{"authors": ["Felipe Lagos-Rojas", "Francisca Gómez-Baeza", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "René Rojas", "Daniel Jadue", "Marian Schlotterbeck", "Liam Turbett"], "date_download": "2020-05-04 19:49:33", "date_modify": "2020-05-04 19:49:33", "date_publish": "2019-10-22 00:00:00", "description": null, "filename": "2019_10_chile-protests-fare-hike-general-strike_1588621773.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/10/22180722/GettyImages-1177451950.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_10_chile-protests-fare-hike-general-strike_1588621773.html", "title": "Chileans Have Launched a General Strike Against Austerity", "title_page": "Chileans Have Launched a General Strike Against Austerity", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIn Chile’s main cities, armed forces and tanks are filling the streets. But civilians are holding their ground, refusing to abandon public space. Official reports indicate eleven fatalities so far, though there are indications that the number is higher. The president has taken to national television to announce that the country is “at war with a powerful enemy who is willing to use violence without any limits.” There are blackouts all across the country. This is October 2019, but it could just as easily be 1973, when socialist president Salvador Allende was overthrown in a coup, replaced with dictator Augusto Pinochet. Last Saturday, the right-wing president, Sebastían Piñera, decreed a curfew in Santiago that would soon extend to other regions and cities across the country. He has since granted expanded powers to the chief of the national armed forces, Javier Iturriaga, who he has charged with reestablishing order. In this state of emergency, Piñera has effectively banned the right to assembly — a measure not seen since the days of Pinochet. Despite these strongman measures, a pluri-national (in recognition of Chile’s indigenous communities) general strike is now in full swing across the country. A new day of mass protests is expected tomorrow. The spark that lit the fire was a fare hike in Santiago’s subway in response to Chile’s incredibly expensive transit systems, some of the most expensive in the world. A student-led movement responded with a campaign of fare-dodging, which quickly spread to the wider population and was successful in crippling one of the capital’s primary strategic services. The fare hikes came on the heels of a general increase in the cost of basic services, foisted on the Chilean people with routine arrogance. Chile’s transport minister haughtily suggested that commuters “just wake up earlier.”\nA Neoliberal Laboratory Chile’s protest movement is taking to the streets just days after the popular, if partial, victory in Ecuador against the International Monetary Fund–imposed adjustment program. Despite the widespread idea that Chile is a stable democracy driven by a healthy economy — an image cynically forged to act as a counterpoint to other South American nations — the reality is quite different. It is a nation that has suffered the lash of neoliberal capitalism just as much as, if not more than, its neighbors in Ecuador, Brazil, Argentina, and Peru. Chile is the original and perpetual laboratory for neoliberalism, with more than thirty years of economic shock policies under its belt and a steady, low-intensity war waged against the nation’s popular classes. The infamous Chicago Boys — the University of Chicago–trained economists who were so influential in spreading neoliberal measures during the Pinochet regime — are still at work. And Milton Friedman, who knew a thing or two about creating widespread crisis as a pretext for suspending democratic mechanisms, remains a key reference point. These same forces now have new tools at their disposal. As in other Latin American countries, the Right has weaponized social media to declare war against a sector of Chile’s own population, which they label as “vandals,” “criminals,” and even “lumpens.” Such attacks are pitched to those communities who are already feeling vulnerable. Piñera’s is a cynical tactic intended to instill the idea that peace can only be established via war. In this context, police have in the last days made fifteen hundred arrests; eighty-five people have been injured. Civil society organizations estimate that fifteen people have been killed, though the number could easily be higher. Chileans have been widely criminalized by this government. To take just one example, Piñera’s government recently approved a bill to install a significant police presence both in primary and secondary schools. It is no surprise that high school students have taken the lead in the fare-evasion movement. This week’s uprising is in some ways a reprise of the 2011 mass mobilizations in the country in favor of public, non-denominational, free education. Though it seemed then that authorities had successfully defused the movement, it is now apparent that those forces have been gathering strength, working to combat the intensified conditions of precarity, privatization, and dispossession. The conflict unfolding today in Chile, against the backdrop of martial law, is the expression of a society that has reached a breaking point. Chileans are exhausted. For years they have been waiting for justice, democracy, peace, and a dignified standard of living. Neoliberal administrations have responded with fragmentation, cooptation, and the technical management of general social distress. And still, in the weeks leading up to the latest crisis, Piñera had the audacity to refer to Chile as “an oasis of stability and democracy,” revealing his own confidence in the face of the country’s acute political and economic crises.", "url": "https://www.jacobinmag.com/2019/10/chile-protests-fare-hike-general-strike"}