{"authors": ["Solomon Hughes", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Richard Seymour", "Dawn Foster", "Thomas Fazi", "William Mitchell"], "date_download": "2020-05-04 19:55:30", "date_modify": "2020-05-04 19:55:30", "date_publish": "2019-06-20 00:00:00", "description": null, "filename": "2019_06_boris-johnson-brexit-prime-minister_1588622130.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/06/20172852/GettyImages-1149440121.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_06_boris-johnson-brexit-prime-minister_1588622130.html", "title": "What Can We Expect From Boris Johnson?", "title_page": "What Can We Expect From Boris Johnson?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "What does Boris Johnson represent? I don’t mean his politics; we know about them: Johnson is an unprincipled opportunist who will sling any mud or blow any smoke if he thinks it will get him higher up the pole.\nIn the early 2000s, as the Tories went rightward, Johnson wrote columns calling gay men “tank-topped bumboys” and describing repealing Section 28 “Labour’s appalling agenda, encouraging the teaching of homosexuality in schools.” As London mayor, the same man posed as some kind of metropolitan liberal and came out in favor of same-sex marriage.\nOnce Brexit drove the Tories back rightward, Johnson turned up the reactionary knob again, calling Muslim women who wear burqas “letter boxes.”\nBut how would he try running the nation? It’s not worth looking for consistent plans; this is Boris Johnson. There is, however, a general direction.\nLaunching his Tory leadership run, Johnson declared, “If we are to unite our country and unite our society, then we must fight now for those who feel left behind.” He promised to “fight for the teachers and the nurses and the firemen,” arguing that “we need now to level up — not to neglect our capital — of course not, but to put in the infrastructure that will lift every region.”\nAfter these big but vague spending promises came Johnson’s first specific policy: Cutting taxes for around three million higher earners by raising the 40 percent threshold from £50,000 to £80,000.\nMaking windy gestures about “fixing” Britain and helping the less well-off while doing the opposite and cosseting the rich. It all sounds a bit Theresa May. And there is good reason for it: Johnson is not, in ideological terms, a neo-Thatcherite in the mold of Dominic Raab or Esther McVey. He is, instead, a Tory weather vane. His incoherence reflects a party still undecided whether Brexit is an opportunity to build a cross-class one-nation coalition — or to wage a libertarian class offensive.\nJohnson’s record for swaying with the political winds is long-standing, as Sonia Purnell’s biography Just Boris makes clear.\nAfter Johnson left Eton (where he had been a member of the “pop” group for “popular” boys) for Oxford, he ran for president of the Oxford Union in 1984. He ran a Tory campaign, focusing mainly on public schoolboys in clubs like the Bullingdon, where he was a member. He was beaten by a “left-wing” campaign led by a Social Democratic Party candidate (this was Oxford), which canvassed heavily among the half of students who attended state schools. Despite state-school students being derided as “stains” in the private-school circles Johnson moved in, he sensed a need to change tack. When Johnson won the Oxford Union presidency in 1985, it was almost as a Social Democratic Party supporter.\nBoris Johnson is a political entrepreneur, positioning himself in every circumstance to avail of new opportunities and crises. All of which makes the idea of him presented by the likes of Mark Francois — Boris Johnson the ideologue of hard Brexit — fairly laughable. If he pursues a no-deal exit, it will be because the political landscape convinces him that it is the only road that might keep him in power. It is equally likely that he will opt for a softer Brexit, even if it means a Brexiteer retreat.\nBut why the tax cut pledge (which he has already tried to squirm out from)? If there is one reliable predictor of the actions of political entrepreneurs, it is their seed capital.\nBoris Johnson has raised nearly £200,000 for his leadership campaign from very rich people. Take the £15,000 donation from David Lilley this May. Lilley used to run a fund investing in metal trading with former Tory treasurer Michael Farmer. An established Tory donor, he has already given £481,000 to the Conservatives in exchange for years of policies that have benefited the rich at the expense of ordinary people. Lilley is reportedly a devout evangelical Christian — but is he funding Boris because he sticks to the Ten Commandments? Or because he’s going to protect his fortune?\nJohnson is also paid £275,000 per year as a Telegraph columnist, which has arguably been his most important political platform. The Telegraph ’s owners, the Barclay brothers, not only live in a tax haven, they actually own one: the Barclays live in a castle they had built on their personal tiny Channel Island of Brecqhou. These are the people the tax cuts announcement will appeal to — Boris Johnson is a savvy enough operator to know that wealthy backers who keep him in such high prominence have to be satisfied.\nBut this is a fundamentally different approach to ideological libertarians. Johnson has never been shy about spending public money, like the £40 million he wasted on the “Garden Bridge” that was never built. His London mayoral reign is littered with trophy projects like this: from the absurd “Boris Island” airport that never was, to the £320-million “Boris Buses” that were . . . but were worse than the regular buses they meant to replace.\nIn this we find the contours of a likely Boris Johnson premiership: tax cuts and favors for the rich, combined with headline announcements about symbolic projects. Combine this with a communication strategy tilting at every windmill of controversy, and the comparisons with Trump become obvious.\nTory MPs previously suspicious of this approach now see it as their roll of the dice to cling onto power. It’s up to the Left to show that Boris Johnson will deliver for the Etonian elite he comes from and the City types who fund him. If you’re not part of this circle and are minded to believe his promises, well, I’ve got a Garden Bridge to sell you.", "url": "https://www.jacobinmag.com/2019/06/boris-johnson-brexit-prime-minister"}