{"authors": ["Seth Ackerman", "Mike Davis", "Liza Featherstone", "Peter Frase", "Ronan Burtenshaw", "David Broder", "Dawn Foster"], "date_download": "2020-05-04 19:56:05", "date_modify": "2020-05-04 19:56:05", "date_publish": "2019-12-13 00:00:00", "description": null, "filename": "2019_12_uk-election-labour-party-jeremy-corbyn-boris-johnson_1588622165.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/12/13114816/GettyImages-1183399276.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_12_uk-election-labour-party-jeremy-corbyn-boris-johnson_1588622165.html", "title": "You Absolutely Don’t “Gotta Hand It to Them”", "title_page": "You Absolutely Don’t “Gotta Hand It to Them”", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Over the past few months, many of my British comrades, now in mourning, have wasted untold hours of their lives being infuriated by the anti-Corbyn Labourites — those congenitally outraged nostalgics for the status quo — just as we Yanks have been doing with their US equivalents over here. My advice to my UK friends is this: put aside your bitter feelings and congratulate the kamikaze Remainers and anyone-but-Corbynites on their victory. They won fair and square.\nTrue, our side had the canvassers, the passion, the support of Britain’s youth, the moral high ground, and majority support for our ideas, if not our candidate. But their side — let’s be honest — had the banks, the business establishment, the army, the Tories, the Liberal Democrats, the leaderships of both major US political parties, and the entire British media. Politics is no lark. As Max Weber wrote, it’s “the slow boring of hard boards,” and you can’t deny that practically every board in Britain lined up on their side.\nSince there’s no sport in being sore losers, let’s congratulate all the winners out there discreetly savoring their triumph in broadsheet newspaper offices and think tanks all over Britain. They achieved the unthinkable: they managed to convince untold thousands of Britons that their vote didn’t matter. To the victors go the spoils — and over the next five years, the spoliation will be immense.\nHere in the United States, although Corbyn is most often compared to Bernie Sanders, in an odd way he resembles Obama more: both were hopelessly improbable contestants for their party’s leadership who prevailed despite long odds and irreversibly changed their country’s politics. And both were also — you remember, don’t you? — hardened antisemites who mortally threatened Jews’ very existence, according to a host of accredited and self-accredited spokesmen for the Jewish people (some of whom were even Jewish themselves). Just a smattering of headlines should reawaken memories: “Jeremiah Wright: Revisiting Obama’s anti-Semitic Pastor.” “Why Were the 7,000 Antisemitic Incidents Under Obama Largely Ignored?” “Photo of Obama and Farrakhan Was Suppressed at Request of Black Lawmakers, Claims Journalist.” “Did Years of Obama’s anti-Semitic Words and Actions Incite Pittsburgh Shooting?” “Joe Lieberman Says Democratic Party Is Not anti-Jewish — but Some Members Are.” And who could forget: “Obama’s refusal to veto anti-Israel U.N. vote ranked most anti-Semitic incident of 2016: Simon Wiesenthal Center puts U.S. abstention at top of annual list.”\nBut that’s where the similarities ended. Jeremy Corbyn is a socialist, which means the accusations of Jew-hatred aimed at him were solemnly broadcast by the media, echoed by rival politicians, treated with the gravity of a national crisis. Candidate Obama had the good sense not to be a socialist, so that when the New York Times found he’d “become a conduit for Jewish anxiety about Israel, Iran, anti-Semitism and race” (back then, feverish email chains about Obama’s “Muslim Brotherhood agenda” would circulate among elderly Democratic-leaning South Florida Jews), establishment Israel apologists like Jeffrey Goldberg rushed to explain (correctly) that this was all a big misunderstanding. Soon, claims about Obama’s antisemitism began to give off a whiff of crankery in right-thinking circles, while the same accusation against Corbyn — a man who all his life has positively radiated the energy of a Battle of Cable Street reenactor — became a mark of seriousness and gravitas.\nThat’s life. As many young people are now learning, to be radical is to make enemies. Our enemies’ chance came last night.\nI don’t claim to be any kind of expert on British politics, but here’s how it looks to me from afar. In 2017, Jeremy Corbyn won a moral victory, improving on Labour’s 2015 score by centering a radical yet practical program of ambitious social democracy. This he accomplished in spite of, and over the din of, the surrounding Brexit drama. That approach could work as long as his opponent was Theresa May, seen by the electorate as just as muddled and conflicted on the Brexit issue as Corbyn and Labour. But the moment Boris Johnson took the Tory leadership last July, the terrain was transformed. Now that the Tories were a bloc of hard Brexiteers, the election would hinge not on which position Labour took on Brexit, but which dimension the contest would be fought on in the first place: the NHS and social democracy versus sado-austerity and privatization? Or Little England nationalism versus metropolitan Europhilia?\nBetween those two options, there is no question which fight was more electorally advantageous for Labour. As the astute and level-headed political scientist Matt Grossmann wrote on Twitter, “With Brexit, UK conservatives have transformed the Left-Right dimension to tone down economics & focus on national identity, a long-running strategy of the right to maintain power with unpopular economic positions & rising inequality.” And what was Labour’s response? Cacophony and incoherence — because the Labour Europhiles were determined that the election should be fought on precisely the ground that was weakest for Labour: Brexit rather than the NHS.\nHistory has ordained it: in many countries, there now is a right-wing majority for cultural nostalgia and a left-wing majority for egalitarian economics. But while the first bloc is politically united and culturally compact, the second is painfully divided between two distant and mutually distrustful social segments: one urban, young, and Sanders-Corbynite, the other older, provincial, and culturally divorced from the Left. As long as that situation continues, the Right will keep winning.\nThis is as painful a moment as I can remember, and I don’t want to downplay the dangers that face Britain now. The Left may be in recession for years. But I can’t help but feel that in the long run there is room for optimism. The young are massively with us, even when we lose. The Right’s hackneyed 1980s mantras are still discredited. And the political expectations of millions have swelled to a size that will be hard to whittle back down to the laughable dimensions of Blairism. History will not stop surprising us: that’s what William Morris’s narrator was thinking in A Dream of John Ball as he contemplated the hero of the great peasants’ revolt of 1381 — a rebellion against feudalism that was crushed and yet accelerated the demise of feudalism anyway, only to hasten the arrival of capitalism:", "url": "https://www.jacobinmag.com/2019/12/uk-election-labour-party-jeremy-corbyn-boris-johnson"}