{"authors": ["Jedediah Britton-Purdy", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "An Interview With"], "date_download": "2020-05-04 19:54:37", "date_modify": "2020-05-04 19:54:37", "date_publish": "2019-10-03 00:00:00", "description": null, "filename": "2019_10_jedediah-purdy-this-land-environment-climate-change-denialism-ecology_1588622077.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/10/03122353/GettyImages-682630236.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_10_jedediah-purdy-this-land-environment-climate-change-denialism-ecology_1588622077.html", "title": "“Living Together Shouldn’t Put Us at War With One Another or With the Earth”", "title_page": "“Living Together Shouldn’t Put Us at War With One Another or With the Earth”", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "JBP\nAll politics is identity politics. All politics is also material politics. And all politics is environmental politics. This book is an exercise in trying to keep all those premises in view at once.\nI come from people for whom work is everything. That you put in a hard day’s work was the highest compliment you could get from my grandfather, a dairy farmer, and from many of my neighbors when I was growing up in West Virginia. So much of identity there, for better and worse, is about whether you’re a person who works.\nThis is very masculinist — although women have been working outside the home in Appalachia for a long time, and today on most farms both spouses work at least somewhat off the farm. It’s literally settler-colonialist: getting value out of the ground was the heart of the ideology that said Europeans had the right to this place.\nBut there’s another side to it, too. It was about caretaking — for family, for animals, even for land. A good farmer doesn’t use up the land. And there’s something in it about using up your body to keep the world going on, returning everything you have to the dust you came from, which has a kind of poetry. Also, valuing work was part of why they were free-labor Republicans, why my grandfather’s grandfather, a small farmer, got his eardrum blown up fighting the Confederacy at Gettysburg. So there are elements in the tradition of work that I think nearly anyone could admire, and that the Left in particular could welcome.\nIt’s cruel the way the dominant ideal of work in those places trains people to identify with specific kinds of labor that capitalist creative destruction then makes worthless. You tie people’s identity to a form of life that’s built around a specific kind of work in a certain industry, and then you wipe out the industry and the work, and leave them with only their identities. What do you expect them to do? Move to LA and do casting work for Appalachia-themed reality TV?\nPart of social democracy and socialism is decommodifying social reproduction, decoupling your ability to go on being, and to help others go on being, from the issue of whether you make someone a profit in doing so. Another part is that work should not be purely commodity, either. Work isn’t just how an economy produces; it is part of what an economy produces, part of a form of life. Part of the reason some work should exist is that it’s good to do: some kinds of caregiving and teaching, some kinds of farming and caretaking, some kinds of arts. Part of what makes work good to do is that it’s needed: to sustain a community, a culture, a family, a landscape. Profitability has not been a great proxy for this. Letting any labor market determine exactly what work gets done implies a huge decision about how people’s lives are going to go. And the cruelty of our market is that it tells people, “You are not profitable, therefore you are not needed.” We discard human beings and call it efficiency.", "url": "https://www.jacobinmag.com/2019/10/jedediah-purdy-this-land-environment-climate-change-denialism-ecology"}