{"authors": ["Deron Snyder The Washington Times"], "date_download": "2020-05-04 21:08:58", "date_modify": "2020-05-04 21:08:58", "date_publish": "2019-05-27 16:44:19", "description": "\"This is the best important open job in all of sports right now,\" Wizards owner Ted Leonsis said last month about the franchise's GM vacancy. It's quite possible that no else in the world...", "filename": "_a448c00b6fe839b394f13d73f7ec73d6_1588626538.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a448c00b6fe839b394f13d73f7ec73d6_1588626538.html", "title": "Ted Leonsis, Wizards have shot at splash hire", "title_page": "Ted Leonsis, Wizards have shot at splash hire", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "“This is the best important open job in all of sports right now,” Wizards owner Ted Leonsis said last month about the franchise’s GM vacancy.\nIt’s quite possible that no else in the world agreed with Leonsis when he made that statement on April 3. And there’s good reason to wonder how much he truly believed it himself.\n“Open” is the only part of the job assessment that was universally accepted as accurate.\nEight weeks later, nothing else has changed. The position remains unfilled and (to candidates with options) unappealing.\nYou can’t blame Tim Connelly for choosing to remain in Denver, as the Nuggets’ president of basketball operations, instead of returning to the franchise he started with as an intern. Even though Connelly and his wife are from this area, and he reportedly has described running the Wizards as his dream job, childhood fantasies often give way to adult realities.\nLeonsis was banking on Connelly’s emotional ties to Washington, but they were no match once reasoning kicked in. Denver earned the No. 2 seed and reached the Western Conference semifinals this season with one of the league’s youngest rosters, including All-NBA First-Team center, Nikola Jokic.\n“It’s safe to assume, and maybe it’s me being overly optimistic, that we’re going to see a better version of us next year,” Connelly told reporters last week after deciding to stay put. “I don’t know if that means more wins. I don’t know if we’re going to win a playoff series and advance. But I don’t think there’s any reason to think there will be any regression next season.”\nMeanwhile, back in D.C., the Wizards are moving in the wrong direction and haven’t hit bottom yet. That’s not exactly a magnetic scenario to pump up your “Help Wanted” listed, but surely someone out there wants the job.\nIt could be in-house candidate Tommy Sheppard, who has run things on an interim basis since Leonsis fired team president Ernie Grunfeld. It could be Oklahoma City Thunder vice president Troy Weaver or former Cleveland and Atlanta GM Danny Ferry. Each of those candidates reportedly has interviewed for the position, though apparently not successfully enough to end the search after Connelly said no.\nLeonsis was determined to speak to him before proceeding, and he wasn’t available until after the Nuggets were eliminated. Fine. But the owner should’ve been prepared to pivot to a backup plan in case his offer was rejected. That would’ve lessened the sting of other potential candidates coming off the board as Washington watched and waited for Connelly.\nNew Orleans hired David Griffin to run its front office. Nets assistant GM Trajan Langdon was hired to be the Pelicans’ GM. Minnesota handed its basketball operations job to Rockets executive vice president GM Gersson Rosas. Last week, Portland gave president Neil Olshey a contract extension.\nSheppard, Weaver and Ferry might be fine alternatives to Connelly. They all have some merit. But at this stage, only two plays can resuscitate a search process that has flat-lined.\nOne snaring Toronto president Masai Ujiri would be equivalent to hitting a fullcourt heave at the buzzer. The other securing Golden State director of player personnel Larry Harris would be like knocking down a long two-pointer.\nThe Wizards definitely could use an executive as bold as Ujiri, who last year traded the second-most popular player in team history (DeMar DeRozan) and fired the NBA Coach of the Year (Dwane Casey) after a 59-win season. Whatever we thought of those decisions, the Raptors are in the Finals with superstar Kawhi Leonard and coach Nick Nurse.\nLeonsis likely needs to blow away Ujiri in terms of salary and contract length to have any shot. But that’s what should happen if Ujiri has even the slightest interest in perhaps coming to D.C. for whatever reasons. Make him the league’s highest-paid executive and give him a seven-year deal if that’s what it takes.\nHarris wouldn’t be nearly as pricey. But he does have previous experience as a general manager, and seven years with the Warriors’ dynasty brings a cachet that costs more than the other candidates and should be met.\nHaving failed to land his No. 1 choice and clearly not sold on the other candidates Leonsis can still make a splash with Ujiri or Harris.\nOtherwise, Sheppard might as well keep the job and be allowed to prove he’s the antithesis of Grunfeld. But whatever the case, Leonsis’ delusions about the Wizards’ opening should be dead and buried.\nMuch like the franchise if he botches this hire.\n⦁ Deron Snyder writes his award-winning column for The Washington Times on Tuesdays and Thursdays.", "url": "https://apnews.com/a448c00b6fe839b394f13d73f7ec73d6"}