{"authors": ["Maryellen Fillo"], "date_download": "2020-05-04 20:07:29", "date_modify": "2020-05-04 20:07:29", "date_publish": "2019-04-06 04:00:00", "description": "We loved him as the “make it right” stylist on the TLC reality show “What Not To Wear” and happily tuned in daily to “The Chew,” a long-running lifestyle program he co-hosted with Carla Hall,...", "filename": "_67d5a4ede3814339a419a026f6405aba_1588622849.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_67d5a4ede3814339a419a026f6405aba_1588622849.html", "title": "PEOPLE Fully baked", "title_page": "PEOPLE Fully baked", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "We loved him as the “make it right” stylist on the TLC reality show “What Not To Wear” and happily tuned in daily to “The Chew,” a long-running lifestyle program he co-hosted with Carla Hall, Michael Symon and Mario Batali. Now Clinton Kelly, who considers his Connecticut home one of his most prized possessions, has started a new venture as host of the Food Network show “Spring Baking Championship.” Admitting he is not a great cook, Kelly shares some of his favorite desserts, his new experience on the show and why he rarely eats out in Connecticut.\nView this post on Instagram\nMe and my shadow.\nA post shared by Clinton Kelly (@clintonkellyoh) on Jul 16, 2018 at 9:46am PDT\nQ: You have a new gig! So there is life after “The Chew?”\nA: I think there is. I never imagined doing something like the “Spring Baking Championship” on the Food Network, but it seemed like a good fit when my agent called me. I appreciate a skilled baker and I do like hosting things!\nQ: What expertise do your bring a baking show?\nA: The beauty is I don’t have to bring any baking expertise, there are judges for that. The bakers are skilled bakers, the judges know their stuff and I just make it all happen.\nQ: Do you ever get to taste the creations?\nA: I do take a little bite of somethings. I stand next to Nancy during the show and she will tell me “you have to try this.” I am not a huge sweet eater. I am a one bite of dessert after dinner kind of guy.\nQ: What was there previously in your career that translates well as being the host of the baking show, and what did you have to learn that you had not done before?\nA: I know how to host a show. I did “What Not To Wear” for seven years and then “The Chew.” I think I could do that for just about anything except sports. As far as what I had to learn, probably the baking terms and some of the more exotic ingredients that are used.\nQ: So who is your favorite judge, Nancy Fuller, Duff Goldman or Lorraine Pascale?\nA: It’s hard to say. They are all very, very different. Nancy feeds me the most, so I guess her. She’s a mama bear.\nQ: What is your baking go-to recipe?\nA: I really only make a few things, but my specialty is olive oil cake. I just made it on the “Rachael Ray” show. It’s a good cake because it’s not too sweet. But my favorite is my grandma’s pear crunch pie. I tell everyone she immigrated from New Zealand with a Louis Vuitton suitcase in one hand and the pie recipe in the other. The recipe is a family one, not shared!\nQ: What have you tasted so far on the show that you won’t forget?\nA: All the episodes have been taped so I am not sure when it airs, but there was a chocolate cake that is by far the best chocolate cake I have ever had. And I am not a chocolate cake person. It had great texture, was not too complex, not too sweet, just the quintessential perfect piece of cake.\nQ: As you add this program to your resume, what else are your working on and are there any new ventures in the future?\nA: I have a couple of projects in development but nothing I can talk about yet because I don’t want to jinx them. And as far as the baking show, nothing in TV is permanent. We’ll see how it goes but I would do it again.\nQ: Now that you are hosting a baking competition, any plans to raise the bar in your own Connecticut kitchen?\nA: My time in Connecticut is basically my most special time, especially in spring and summer. I wouldn’t want to be anywhere else. I bake with anything that is in season. Peach cobbler with fresh peaches is one of my favorites. I also do a choux pastry puff with fresh strawberries when they are in season. We rarely eat out in Connecticut. I’d rather cook.\nQ: Everyone was a bit surprised when “The Chew” was canceled. Miss it?\nA: I do. I am not 100 percent over the show ending. It wasn’t just a job, it was part of my life and I am still friends with Carla and Mike. I liked them as human beings. It didn’t feel like work.\nQ: Have you thought about doing a cookbook?\nA: A little. It would probably a cookbook about cooking for two, or cooking while your dog is staring at you.\nQ: What is the best part of the show, besides the food?\nA: It was a really such a nice group of people. And I like to be nice to nice people. Damon, my psychologist husband, says I am the best judge of character. Besides standing on camera and hosting, I did find myself giving a couple of pep talks to the bakers.\nQ: So now that we know about your baking expertise, can you share a recipe? You know, in case we want to bake like Clinton Kelly.\nPeach Cobbler\nwith Raspberry Coulis\n4 to 6 Servings\nPeach Cobbler :\n5 cups frozen peaches (thawed)\n1 cup sugar (divided)\n1 stick cold unsalted butter (cut into small cubes, plus more for greasing)\n3/4 cup all-purpose flour\n1/2 teaspoon baking powder\n1/2 teaspoon salt\n1 large egg\n1/4 teaspoon vanilla extract\n2 tablespoons turbinado (raw) sugar\nRaspberry Coulis :\n1/2 cup sugar\n3 tablespoons water\n1 teaspoon lemon juice\n1 pound fresh raspberries\nSour Cream Whip :\n1/4 cup sour cream\n1 cup heavy cream\n1/4 teaspoon almond extract\nFor Peach Cobbler:\nPreheat oven to 375ºF. Grease a 9-inch round baking dish.\nIn a large bowl, add the thawed peaches and 1/2 cup of the sugar and toss to combine. Pour the fruit mixture into the greased baking dish and set aside.\nIn the bowl of a food processor fitted with a blade attachment, add the flour, baking powder, salt and the remaining sugar and pulse briefly to combine. Add the cold butter and pulse until the butter is incorporated fully and is pea-sized. Remove the flour mixture to a large bowl and whisk in the egg and vanilla extract.\nDrop the batter mixture one tablespoon at a time on top of the fruit, so that there is some fruit still exposed. Sprinkle with turbinado sugar and bake until golden brown, about 35-40 minutes.\nFor Raspberry Coulis: In a small saucepan over medium-high heat, add the sugar and water and cook until the sugar has dissolved, making a simple syrup. In the carafe of a blender, add the raspberries, simple syrup and lemon juice and puree until smooth. Strain the raspberry coulis through a fine mesh sieve and discard the solid remains.\nFor Sour Cream Whip: In a large bowl, add sour cream, heavy cream, and almond extract and whip until soft peaks form.\nTo serve: Spoon a small amount of the raspberry coulis onto the middle of a dessert plate and top with a slice of peach cobbler. Add a dollop of sour cream whip to the top of each slice of warm cobbler and serve.\nMaryEllen Fillo is a freelance writer.", "url": "https://apnews.com/67d5a4ede3814339a419a026f6405aba"}