{"authors": ["Nick French", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Lehmann", "Zahra Moloo", "Ben Tarnoff", "Linsey Mcgoey"], "date_download": "2020-05-04 19:54:28", "date_modify": "2020-05-04 19:54:28", "date_publish": "2019-07-15 00:00:00", "description": null, "filename": "2019_07_howard-buffett-gates-foundation-bernie-sanders_1588622068.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/07/15112812/GettyImages-130205858.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_07_howard-buffett-gates-foundation-bernie-sanders_1588622068.html", "title": "Even Nice, “Generous” Rich People Are Not Your Friends", "title_page": "Even Nice, “Generous” Rich People Are Not Your Friends", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThanks in large part to democratic socialists, hating on the rich is becoming mainstream in US politics. Sen. Bernie Sanders regularly denounces the “millionaires and billionaires” who have bought the country’s political system and rigged the economy to work in their favor, and Rep. Alexandria Ocasio-Cortez recently made waves for proposing a 70 percent top marginal tax rate and declaring that a society where billionaires exist alongside extreme poverty is immoral. In the recent presidential primary debates, many candidates echoed Sanders’s calls for wealth redistribution and taking on the power of corporations. Attacks on the rich by socialists and progressives have been met with predictable hysteria by the Right. But many Democrats also reject Sanders / AOC–style class-struggle rhetoric. Case in point: in a meeting with wealthy donors, former vice president Joe Biden recently said, “We may not want to demonize anybody who has made money.” He went on to assure the donors that, under a Biden presidency, “No one’s standard of living would change, nothing would fundamentally change,” before pleading with them: “I need you very badly.” While Biden is a caricature of a corporate Democrat, his comments raise an interesting question: Is it right to demonize all rich people? After all, some of them are good people, and some of them give large sums of money to support good causes. Even AOC has said that not all billionaires are immoral, praising ultrarich philanthropists Bill Gates and Warren Buffett in particular. One doesn’t need to look far to find impressive examples of generosity by the wealthy: billionaire Robert F. Smith just agreed to pay off the student loans of Morehouse College’s entire graduating class. Since many rich people are kind souls who give back to society in big ways, maybe it’s wrong to demonize them. Perhaps, you might think, even if most of the ultrarich are rapacious sociopaths, we should thank the rich who donate to noble causes for their generosity, or (as some have argued) look to them to solve more of society’s problems through philanthropy. This would be a mistake. We shouldn’t cut the benevolent rich any slack — not least because, upon closer examination, they usually aren’t so benevolent after all.\nMr Laces To understand why, we have to think about how capitalism works. Unlike most people, the rich get the lion’s share of their income from investment rather than from wages: they are capitalists rather than workers. Instead of making a living by selling their labor, the rich depend on the success of companies in which they own shares, or interest from loans they have made, or rents from real estate. The wealthy’s dependence on investments subjects them to particular economic imperatives, which typically force them to reduce wages, undermine working conditions, put people out of jobs, and fight against economic policies that benefit working people. Consider the owner of a shoe manufacturing business. The business is profitable — its shoe sale revenues exceed its costs. And the shoe business owner, Mr Laces, is a very nice guy. Unlike some of his competitors, who delight in lording their power over workers by humiliating them whenever possible and who don’t lose any sleep over their shoe production’s contribution to climate change, Mr Laces was raised in a nurturing, caring household that taught him to minister to the less fortunate. So he pays his workers a living wage and good benefits, and he makes a big donation to the Sierra Club every year. But Mr Laces has many competitors, who are all also trying to sell shoes. The easiest way for them to win a sizable share of the shoe market is by selling their shoes at lower prices than other shoe manufacturers. In order to keep his own company running, Mr Laces has to compete with them. And, in order to compete with them, Mr Laces has to cut prices. Mr Laces’s price cuts pressure his competitors to lower their own prices even further, initiating a cycle of competitive price-cutting. But those price cuts result in smaller and smaller profits, unless the business can cut its costs, too. Mr Laces can minimize costs in a number of ways: by paying workers less per hour, by skimping on the cost of maintaining a safe and comfortable work environment, by speeding up the pace and intensity of work, or by finding creative ways to skirt environmental regulations. Mr Laces is a nice guy. He doesn’t want to make life miserable for his shoe factory workers. And he doesn’t want to destroy the planet — that’s why he makes those Sierra Club donations every year. But faced with cutthroat competition, he doesn’t have much of a choice. Is there another path Mr Laces could take besides cutting wages and trashing the planet? Owners like him can also minimize costs by investing in technological improvements that allow workers to produce more shoes with the same amount of work (for example, machines that stitch leather, replacing work that used to be done by hand). The problem is, these improvements are bad for workers in another way: since they let the employer make the same amount of shoes with fewer workers, they usually result in cutbacks and layoffs. Of course, technological improvement wouldn’t be a bad thing if workers themselves were deciding how to deploy it. For instance, workers could opt to use the leather-stitching machines to reduce everyone’s hours while keeping take-home pay steady. But when choices about technology are prerogative of business owners — even benevolent ones like Mr Laces — they have an enormous incentive to use upgrades to pad their profits (or simply stay afloat) rather than increase workers’ well-being. The logic of profitability and competition also creates structural reasons for capitalists like Mr Laces to oppose government policies that benefit or empower workers. He never wanted to oppose those policies — it goes against every bone in his body! It’s not the way he was raised! But if he’s faced with the decision of either pushing policies that screw workers in his factory and society as a whole or closing up shop, which one will he choose? Mr Laces doesn’t want to find himself in the unenviable position of being a worker, after all. And even if he decides to take a moral stand against these pressures to engage in immoral behavior, won’t other capitalists with fewer scruples just swoop in and push those anti-worker policies themselves? They will oppose laws that directly raise their costs, like minimum wage hikes or labor, safety, and environmental regulations. They will also oppose collective bargaining protections, which give workers more power to negotiate better pay and working conditions. For the same reason, the wealthy typically resist policies that promote full employment. In the rare conditions of a full-employment economy, companies compete over a limited pool of employees, giving workers more leverage in negotiating contracts and making them more willing to organize. When there is significant unemployment, workers compete against one another for a limited number of positions. This makes workers more willing to accept worse jobs and more fearful of getting fired for stepping out of line. Similar dynamics are at play when it comes to other kinds of investment. The rich have powerful incentives to maximize returns on loans, for example, by keeping interest rates high and making debt hard to discharge through bankruptcy. It’s often in the interest of landlords to refuse to pay for simple maintenance and repairs, to charge exorbitant fees when tenants are late paying rent, and to fight any sort of tenant protections or rent control laws. It’s not a question of rich people like Mr Laces being good or bad people. If they want to succeed in business, they must act against workers’ interests.\nThe Dark Side of Philanthropy But the wealthy have spent huge amounts on philanthropy, seeking to eliminate hunger, improve education, and eradicate diseases. Don’t these efforts show that the rich can be a force for social good? In fact, the legacy of these ventures is mixed at best. At their worst, billionaire-funded charity is a Trojan Horse for policies that advance the interests of the rich at the expense of the vast majority. The ultrarich-funded “education reform” movement is a case in point. The Broad Foundation, the Walton Family Foundation, and the Bill & Melinda Gates Foundation have been seeking to privatize public education in order to wrest democratic oversight and control and to destroy teachers’ unions (one of the last bastions of organized labor in the Unites States). There is plenty to criticize in other instances of billionaire-funded “humanitarianism.” Consider philanthropy’s recent record in the Global South. Howard Graham Buffett (son of Warren) is investing hundreds of millions of dollars to spur development and promote environmental conservation in the Democratic Republic of the Congo (DRC) and Rwanda. Yet, as Zahra Moloo reports, Buffett has empowered Monsanto and other corporations to control Africa’s seed economy and dispossessed the original inhabitants of the land to create the Virunga National Park. His work in Rwanda has led Buffett to cozy up to violent dictator Paul Kagame, even calling Kagame’s Rwanda “the most progressive country on the continent.” The frequently praised Gates Foundation has a spotty record even outside of its interventions in the US education system. According to a 2009 report by editors of the Lancet , the world’s leading medical journal, the Gates Foundation’s massive spending on health suffered from “whimsical” budgeting choices that did not “reflect the burden of disease endured by those in deepest poverty.” More recently, Linsey McGoey writes, the Gates Foundation has given large sums of cash to for-profit companies like Mastercard to expand operations into Kenya — apparently assuming that credit cards will benefit both the Kenyan poor and Mastercard’s bottom line. We should also note that the wealthy do not give away a large share of their riches. Nicole Aschoff writes, “The very rich have earned at least an 8 percent return annually on their investment portfolios over the past twenty years, yet they give away only about 1.2 percent of their fortunes each year.” On the whole, the rich aren’t getting rich, then giving it all away for charitable causes — they’re getting rich and buying a fourth yacht, while tossing charitable causes some pocket change. Meanwhile, inequality continues to skyrocket globally. According to Oxfam, in 2009, 380 people owned as much wealth as the world’s poorest 50 percent; in 2017, just forty-two extremely rich people had as much wealth as the bottom 50 percent. A similar pattern holds in the United States, where three men own as much wealth as the bottom half of Americans.", "url": "https://www.jacobinmag.com/2019/07/howard-buffett-gates-foundation-bernie-sanders"}