{"authors": ["Chris Basnett Lee Newspapers"], "date_download": "2020-05-04 20:22:34", "date_modify": "2020-05-04 20:22:34", "date_publish": "2019-05-27 16:22:00", "description": "The Nebraska baseball team will visit an old friend to start the NCAA Tournament. The Huskers are headed to the Oklahoma City regional as a No. 3 seed and will take on No. 2 seed UConn at...", "filename": "_7ebd85c8c24d458aa0e74472e431e0ff_1588623754.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7ebd85c8c24d458aa0e74472e431e0ff_1588623754.html", "title": "Husker baseball headed to Oklahoma City for NCAA Tournament", "title_page": "Husker baseball headed to Oklahoma City for NCAA Tournament", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Nebraska baseball team will visit an old friend to start the NCAA Tournament.\nThe Huskers are headed to the Oklahoma City regional as a No. 3 seed and will take on No. 2 seed UConn at noon Friday as part of the regional hosted by Oklahoma State.\nThe Cowboys and Harvard are on the other side of the bracket. Because of state-wide flooding in Oklahoma, the regional was moved from Stillwater to Chickasaw Bricktown Ballpark in Oklahoma City.\nThe 64-team bracket was announced Monday. It will be Nebraska’s third NCAA Tournament trip in the last four seasons.\n“I’m not going to break it down too much other than I’m happy we’re in. The boys deserve it. They beat some real quality teams this year,” NU coach Darin Erstad after the bracket was announced. “Like I told the seniors, this is three out of four years. Matt Waldron starting at Clemson as a freshman, and now he’s going to be starting in Oklahoma City as a senior. I think that’s pretty cool.”\nNebraska, of course, has plenty of good memories from playing in Bricktown. The Huskers won four Big 12 tournament titles at the ballpark, including three in a row from 1999-2001. The fourth title came in 2005, when current NU assistant Curtis Ledbetter was named tournament MVP.\n“I wasn’t around for all the Bricktown years. They’ve obviously had a ton of success there in the history of Nebraska baseball, so hopefully some of that rubs off on our boys,” Erstad said. “But this time of year you just want to get your foot in the door, and hopefully we can play some good baseball.\nNU lost its only matchup with UConn, a 15-0 defeat in the 1979 Northeast Regional. In more pertinent statistical matters, the Huskies went 36-22 this season, including 12-12 in the American Conference. That record includes taking two of three games from Louisville, who went on to earn the No. 7 overall national seed, in a season-opening series and sweeping a four game series from Michigan State.\nLike the Huskers, UConn lost in its conference tournament title game, falling to Cincinnati 22-5 Sunday. The Huskies’ No. 1 starter is Mason Feole, a left-hander who is 3-3 with a 3.50 ERA.\nThe strength of the UConn pitching staff is the bullpen, where, Jacob Wallace, CJ Dandeneau and Caleb Wurster have combined for an 11-3 record. Wallace has 15 saves and a 0.73 ERA. His save total is fourth in the nation.\nMichael Woodworth leads the UConn offense with a .323 batting average and five home runs.\nNebraska last faced Oklahoma State in 2016 at the Clemson regional, losing 6-0. The Huskers have never played Harvard in baseball. The Huskers played in the Stillwater regional in 2014, going 1-2 with a pair of losses to Cal State Fullerton and a victory over Binghamton. That win remains Nebraska’s last victory in the NCAA Tournament.\nIt’s also the last time Nebraska had a relatively short trip to play in the NCAA Tournament. The Huskers went to Corvallis, Ore., two seasons ago, and to Clemson in 2016.\n“I’m pumped that we’re going to be able to get on a bus and not nine different flights to get everybody there,” Erstad said.\nThe winner of the Oklahoma City regional will take on the winner of the Lubbock regional for a trip to the College World Series. That regional features Texas Tech, Army, Florida and Dallas Baptist.\nUCLA is the No. 1 overall national seed, followed by Vanderbilt, Georgia Tech, Georgia, Arkansas, Mississippi State, Louisville and Texas Tech.\nThe other eight national seeds are Oklahoma State, East Carolina, Stanford, Ole MIss, LSU, North Carolina, West Virginia and defending national champion Oregon State.\nOmaha, making its first NCAA Tournament appearance, is the No. 4 seed in the UCLA regional while Creighton is headed to the Oregon State regional.", "url": "https://apnews.com/7ebd85c8c24d458aa0e74472e431e0ff"}