{"authors": ["Sentinel"], "date_download": "2020-05-04 20:10:43", "date_modify": "2020-05-04 20:10:43", "date_publish": "2019-03-21 10:33:57", "description": "FITCHBURG -- A city man accused of selling heroin, crack and the narcotic Trazadone within 300 feet of Longsjo Middle School in January was scheduled for a pre-trial hearing on Tuesday in District...", "filename": "_bfb9497a040f4176a26720ecb0afc23b_1588623043.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bfb9497a040f4176a26720ecb0afc23b_1588623043.html", "title": "Fitchburg Man Arrested on Drug Charges Near Longsjo Middle School", "title_page": "Fitchburg Man Arrested on Drug Charges Near Longsjo Middle School", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FITCHBURG -- A city man accused of selling heroin, crack and the narcotic Trazadone within 300 feet of Longsjo Middle School in January was scheduled for a pre-trial hearing on Tuesday in District Court, according to court documents.\nCarlos Lago-Viera, 21, of 150 Pleasant St., was arrested on Jan. 24 at his apartment after the State Police Gang Unit and North Worcester County Drug Task Force executed a search warrant, according to a report police report.\nOnce inside Lago-Viera’s apartment, officers located 35 individually wrapped bags of heroin, four individually wrapped bags of crack cocaine, nine Trazadone pills, baggies, and a digital scale, according to the police report.\nAs a result of the discovery, Lago-Veira was charged with one count of possession with intent to distribute a Class A controlled substance (heroin), one count of possession with intent to distribute a Class B controlled substance (crack cocaine), one count of possession with intent to distribute a Class E controlled substance (Trazadone) and a drug violation near a school or park, according to court documents.\nHe was released on a written promise to appear and ordered to remain drug-free and submit to drug testing at each court appearance.\nLago-Veira was not in court for the hearing Tuesday, but, according to court documents, was in treatment at a recovery center.\nHis next court date is April 2.\n----\nLunenburg woman granted emergency restraining order\n----\nLUNENBURG -- A woman was granted an emergency restraining order against her estranged husband after he repeatedly entered her residence when asked to stay out and briefly choked her during an altercation, police said.\nThe 29-year-old victim reported the incident to police on Monday, March 18, one day after it occurred, police said.\nShe told police that on Sunday, March 17, Sigfrido Carrillo, 34, of Tacoma St., Worcester, showed up at her residence unannounced and uninvited and walked in.\nThe victim told police she asked Carrillo “multiple times” to leave, but he refused. They both then walked outside to get some items from his car. As she returned to the house, Carrillo allegedly followed and went inside once again, the victim told police.\nShe then grabbed Carrillo by the shirt in an attempt to push him out of the house. At that point, the victim told police, Carrillo allegedly grabbed her by the throat for approximately three seconds before she was able to fight him off.\nOfficers did not see any visible injuries, but the victim complained of a sore jaw and pain when she opened her mouth.\nImmediately after that happened, she got Carrillo to leave, but he, the victim told police, reentered the residence through an unlocked basement door.\nThe victim called a relative to help and when he arrived, she told police, Carrillo left.\nFearing for her family’s safety, the victim, at the suggestion of the police, was granted an emergency restraining order.\nBecause Carrillo works in Ayer, officers with that police department were called to assist in his arrest.\nOnce in custody, according to court documents, Carrillo was charged with nighttime felony breaking and entering, assault and battery on a household or family member and strangulation and suffocation.\nWhen arraigned in Fitchburg District Court, Carrillo was released after posting a $500 cash bail.\nHis next court date is May 7.", "url": "https://apnews.com/bfb9497a040f4176a26720ecb0afc23b"}