{"authors": ["Sentinel"], "date_download": "2020-05-04 21:09:09", "date_modify": "2020-05-04 21:09:09", "date_publish": "2019-03-31 10:33:54", "description": "By Jimmy Panetta, Don Bacon, Chrissy Houlahan, Michael Waltz The Washington Post Just a few decades ago, veterans made up more than 70 percent of Congress. An ingrained commitment to...", "filename": "_323758e01aa5485797110f7ce58576c9_1588626549.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_323758e01aa5485797110f7ce58576c9_1588626549.html", "title": "Veterans on Common Mission to Get Things Done in Congress", "title_page": "Veterans on Common Mission to Get Things Done in Congress", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "By Jimmy Panetta, Don Bacon, Chrissy Houlahan, Michael Waltz\nThe Washington Post\nJust a few decades ago, veterans made up more than 70 percent of Congress. An ingrained commitment to public service brought these Democrats and Republicans together to put country over party. These members’ primary obligation was to patriotic service, not partisan politics. Now, veteran representation in Congress is near a historic low of 18 percent. Congress, often paralyzed by debilitating bickering and gridlock, is consistently rated as one of the least trusted institutions in the United States. These trends are not a coincidence.\nLast year’s midterm elections sent a surge of veterans to Congress, including the largest number of freshman-class veterans in more than a decade. These military-connected congressmen and -women present an opportunity to strengthen trust in Congress and help the institution to function again.\nAs we seek to break through the political dysfunction, we are pleased to announce the launch of the For Country Caucus. The caucus will provide principled military veteran members a platform to work in a nonpartisan way and create a more productive government. For Country’s vision is a less polarized Congress that works for -- and is trusted by -- Americans. We seek a Congress where members serve with integrity, civility and courage. And we want a Congress that is strategic in purpose, focused in action and where elected officials put their country first.\nAll four of us have served in the U.S. military. We served in the Navy and Air Force, and one of us continues to serve in the Army National Guard. While in uniform, we took an oath to serve our country. Now in Congress, we continue that service. Service members and veterans know how to work together to solve tough problems. In the military, the goal is to effectively execute the mission at hand. Regardless of background, experience or ideology, our actions were in service to and for country. We are committed to continuing that ethos in Congress through the For Country Caucus.\nTo be clear, we represent diverse districts that span the country. We are not asking fellow veteran members to check their party at the door. This caucus includes Democratic and Republican members who hold strong principles and convictions. Rather, we are asking our colleagues to come together and identify issues and policies that will advance the country. Traditionally nonpartisan areas -- including public service, veterans issues and national security -- are a good place to start.\nCivility is also an important cornerstone for the caucus. We have witnessed the tenor and quality of our conversation erode daily. No doubt, For Country Caucus members will engage in strong and, at times, passionate dialogue on the issues. But that does not mean we need to attack or denigrate each other’s character or intent.\nCongressional caucuses come in all shapes and stripes. The For Country Caucus is differentiated by its membership’s common experience of military service, commitment to working together across the aisle and adherence to placing principles before politics.\nIt is a privilege every day to serve our country again in the House of Representatives. This Congress, we look forward to a common mission of getting things done for the American people.", "url": "https://apnews.com/323758e01aa5485797110f7ce58576c9"}