{"authors": ["Trish Dehond Clemson Extension"], "date_download": "2020-05-04 20:23:13", "date_modify": "2020-05-04 20:23:13", "date_publish": "2019-04-14 07:00:00", "description": "If you like to have large trees around your home, no doubt you have encountered the challenges of growing turf grasses in the shade. Most of our Southern warm-season turf grasses (such as...", "filename": "_15af3e42dd444dc890b3f26a91212a7a_1588623793.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_15af3e42dd444dc890b3f26a91212a7a_1588623793.html", "title": "TRISH DEHOND: Moss is not the boss", "title_page": "TRISH DEHOND: Moss is not the boss", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "If you like to have large trees around your home, no doubt you have encountered the challenges of growing turf grasses in the shade.\nMost of our Southern warm-season turf grasses (such as centipede grass) need a good bit of sunshine to perform well. At the same time the shade trees are intercepting the light, they are also competing with the grass for moisture and nutrients. So what I usually suggest is that people keep the two separate.\nAlthough centipede grass can tolerate a little bit of shade, it’s better to maintain a beautiful, healthy lawn in the sunny part of the yard, even if it is only a small area. Where the trees are, cover the ground with mulch (such as pine straw, hardwood mulch or pine bark nuggets), out to the dripline (where the branches and leaves stop).\nThere are also many species of evergreen groundcover plants that do very well in the shade, such as monkeygrass (a.k.a. bordergrass or liriope), mondograss and various ferns. Our fact sheet on Planting and Care of Groundcovers includes a list of plants for both sun and shade at https://hgic.clemson.edu/factsheet/groundcovers/\nThere is one naturally occurring groundcover plant that people seem to either love or hate. Moss tends to grow in shady yards with compacted soil that is highly acidic. I would group myself with the moss lovers, because I like its soft texture and green color.\nSome people would rather have a lawn there, and think the moss is “taking over” the turf grass. My suggestion would be to either mulch over it, plant a groundcover, or change the soil conditions to make it more conducive for the grass rather than moss.\nThe first thing to do, as usual, is the soil test, so that the acidity can be corrected by applying lime according to the recommendations for YOUR soil. Relieving soil compaction with a core aerator is the next step, and perhaps limbing up the trees (NOT topping them!) to allow a little bit more light to reach the ground.\nFor more information on controlling moss (as well as algae) in the home lawn, please see our fact sheet at the Clemson Extension Home and Garden Information Center at https://hgic.clemson.edu/factsheet/moss-algae-control-in-lawns/.\nIf you go with the mulching option, consider whether people will be walking through that area at all. If so, use hardwood or bark mulch, and maybe add some stepping stones to create a clear path. Never cut off surface roots of the tree, but just place the stones or mulch between them. I like pine straw, but it tends to be a little slippery so only use it in areas that will not be walked through regularly. I use longleaf pine straw for most applications, but if I need to put the mulch between a bunch of little ferns or other plants in the ground, I use the shortleaf pine straw.\nSo now that the days are getting warmer, enjoy your mossy (or mulchy) shady yard!\nIn next week’s column, we will talk about planning and planting the spring vegetable garden.\nTrish DeHond is the home horticulture agent and Master Gardener coordinator for Clemson Extension in Darlington and Florence counties. She can be reached by email at pdehond@clemson.edu. Clemson University Cooperative Extension Service offers its programs to people of all ages, regardless of race, color, gender, religion, national origin, disability, political beliefs, sexual orientation, gender identity, marital or family status and is an equal opportunity employer.", "url": "https://apnews.com/15af3e42dd444dc890b3f26a91212a7a"}