{"authors": ["Mayra Cruz"], "date_download": "2020-05-04 20:13:15", "date_modify": "2020-05-04 20:13:15", "date_publish": "2019-01-10 06:00:00", "description": "Tomball ISD is now taking applications for open enrollment all year long from students who live outside the district’s borders. The district decided to make the change in response to...", "filename": "_00acbe7e69f4480ab9873c1e15aab982_1588623195.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_00acbe7e69f4480ab9873c1e15aab982_1588623195.html", "title": "Tomball ISD accepts year-round limited enrollment", "title_page": "Tomball ISD accepts year-round limited enrollment", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Tomball ISD is now taking applications for open enrollment all year long from students who live outside the district’s borders.\nThe district decided to make the change in response to families who had missed the previous deadlines during the spring and summer.\n“We had quite a few phone calls from parents who would find out about (limited open enrollment) at different times during the year and were upset to learn they had missed the window. Since there was so much interest, and since some of our schools still had available slots for LOE students, we decided to open the process up throughout the year,” said spokesperson Allison McClain.\nTomball ISD previously had limited enrollment open for three or four weeks and began accepting year-round enrollment in December.\nLimited open enrollment is now available at eight schools for students between kindergarten and eighth grade.\nFor each student the district accepts from outside of its boundaries, the district is able to retain over $6,000 in local taxes instead of sending the funds to the state.\nCurrently, about 200 students have been accepted into the district during the 2018-2019 school year, allowing the district to retain about $1.25 million.\n“(T)he largest numbers probably come from Spring, Klein, and Magnolia,” McClain said.\nFamilies will need to pay a nonrefundable $50 fee when submitting an open enrollment application.\nStudents who are accepted would need to reapply every year to remain within Tomball ISD schools.\nAccording to the Tomball ISD website, the families of students who are accepted into one of the district’s schools will not need to pay for tuition, but will need to provide transportation.\nFor more information on the application process, visit www.tomballisd.net or call the Tomball ISD administrative services department at 281-357-3100, extension 2010.\nmayra.cruz@chron.com", "url": "https://apnews.com/00acbe7e69f4480ab9873c1e15aab982"}