{"authors": ["Richard Rothstein", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Richard Walker", "Meagan Day", "Mike Stivers", "Douglas Massey"], "date_download": "2020-05-04 19:49:46", "date_modify": "2020-05-04 19:49:46", "date_publish": "2019-06-25 00:00:00", "description": null, "filename": "2019_06_rothstein-segregation-color-of-law-new-deal_1588621786.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/06/25113503/GettyImages-111220918.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_06_rothstein-segregation-color-of-law-new-deal_1588621786.html", "title": "How the Federal Government Deepened Segregation", "title_page": "How the Federal Government Deepened Segregation", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Richard Walker’s critique of my book The Color of Law asserts that:\nthe federal government (particularly the New Deal) built upon deeply embedded private racism in its housing policies, and therefore, the New Deal should not be thought culpable for residentially segregating the nation.\nWe agree on the first point; as The Color of Law states,\nWithout the support of these private beliefs and actions, our democratically elected governments might not have discriminated either.\nWalker’s second point overlooks that the New Deal did not merely concede to private bigotry but pursued independent racial policies that did much to create a segregated landscape that persists today. And Walker ignores a fundamental principle of our democracy. As The Color of Law continues,\nBut under our constitutional system, government has not merely the option but the responsibility to resist racially discriminatory views, even when — especially when — a majority holds them. In the twentieth century, federal, state, and local officials did not resist majority opinion with regard to race. Instead, they endorsed and reinforced it, actively and aggressively.\nPrivate bigotry and bigoted public policy don’t weigh equally in assessing responsibility for segregation. If government actions were excusable when following majority opinion, our Bill of Rights would be pointless. The federal government commits a Fifth Amendment civil rights violation if it follows majority preferences for segregation. State and local governments commit Fourteenth Amendment violations if they do so.\nWhen President Lyndon Johnson signed the 1968 Fair Housing Act, he predicted that his unpopular action would ultimately destroy Democratic Party majorities. Does Walker conclude that Johnson should not have signed it? If he had vetoed it, would government bear responsibility for ongoing housing discrimination? I think so, but Walker, I presume, would not.\nIf President Kennedy had failed to issue the 1962 executive order that (finally) prohibited federal promotion of housing discrimination, should we deem his administration responsible for continuing to enforce segregation, or excuse it because he only followed white public opinion? I think the former; Walker would, I presume, think the latter. That’s how he approaches Franklin Delano Roosevelt’s legacy.\nHow far can we carry this approach? Should future historians downplay Donald Trump’s efforts to exclude Muslims from the country because it was popular in a constituency upon which he was counting for reelection? Why not?\nWalker accuses The Color of Law of making “errors of fact,” yet cites no purported factual errors. Indeed, since the book’s 2017 publication, historians have identified no errors of fact. One charge (by UCLA law professor Richard Sander and colleagues) is that the book relies on “highly selective anecdotes.” Well, of course: historical narrative must employ highly selective anecdotes. No New Deal history could document each minute of every administration official’s public life. Good historical writing selects representative anecdotes. Neither Sander et al. nor Walker offer evidence that The Color of Law ’s anecdotes are unrepresentative.\nWalker is troubled by what he terms my “attack on public housing.” I make no such attack but provide a dispassionate account of its racial history. The book’s frontispiece, as Walker notes, is a photo of FDR giving keys to the one hundred thousandth family to get New Deal public housing. The family and surrounding crowd of Pittsburgh project residents are white and apparently middle class. The Public Works Administration, the first New Deal agency to construct public housing, listed each project’s racial designation. The all-white projects outnumbered the all-black ones. A very few were “both,” but the PWA segregated those by building.\nThe great African American writer Langston Hughes’s autobiography recounts his adolescence in integrated Central Cleveland, where he dated a Jewish girl and his best friend was Polish. Such early-twentieth-century neighborhoods were not as rare as they later became. Before highways, factories needed access to ports or railroad terminals to receive parts and ship products; workers of both races and varied ethnicities lived nearby and walked to work. The New Deal created segregation in Cleveland’s Central neighborhood by building one project for whites and a separate one for blacks.\nCertainly Cleveland had private segregation patterns before the PWA projects. But suppose the PWA had assigned apartments without regard to race, as it was constitutionally required to do: Some bigoted whites might have refused to live with black neighbors, but housing shortages were so great that many were ready to take the place of any family that refused. And Cleveland would be a very different place today.\nDuring World War II, many thousands of workers (and their families) migrated to war industry jobs. The federal government segregated the housing for white and black war workers, who in many cases were toiling side by side.\nBefore the war, relatively few African Americans lived in West Coast cities, unlike places like Chicago and Detroit, where private forces had established segregation during the earlier “First Great Migration.” When the government segregated housing for war workers who arrived in the “Second Great Migration,” it established rigid West Coast racial boundaries for the first time.\nWalker describes The Color of Law as asserting a “ludicrous” notion that federal segregation policy was “imposed on reluctant localities.” That notion would be ludicrous, and a cursory scan of the book would reveal a pattern of federal, state, and local policies to impose segregation, all of which were constitutional violations.\nLocal authorities were pleased when the federal government validated their racist preferences, although I did find one exception. When housing was needed at San Francisco’s Hunters Point Dry Dock, local officials proposed nondiscrimination. The Navy intervened, ordering San Francisco to segregate apartments, claiming that integration would impede the war effort.\nPerhaps the most important story in The Color of Law concerns a congressional debate over President Truman’s call for a vast public housing expansion to relieve shortages for veterans. Conservatives attempted to sabotage Truman’s legislative proposal with a “poison pill” amendment to require nondiscrimination in public housing. They hoped to entice some Northern liberals to join them, creating a majority. Then they planned to vote against the final amended legislation that would also lose Southern Democrats, ensuring its defeat.\nLiberals faced a difficult choice — fight segregation, at the cost of failing to address the housing crisis, or accept segregation as the price of reducing homelessness. They chose the latter: The poison pill amendment failed, and federal officials cited the vote to justify segregating all federal housing programs, not only public housing, into the 1960s.\nThe liberals’ leader, Illinois Sen. Paul Douglas, said, “I should like to point out to my Negro friends what a large amount of housing they will get under this act . . . [I]t is in the best interests of the Negro race that we carry through the housing program as planned rather than put in the bill an amendment which will inevitably defeat it.”\nWas Douglas correct that segregated public housing, the politically feasible alternative to no housing, was in the best interests of the Negro race, or anybody else, for that matter? Many black families, desperately needing housing, agreed (although the NAACP did not). While Douglas was well intentioned, I don’t agree either. Does Richard Walker? The legislation did address the housing crisis, with segregated projects like Cabrini-Green in Chicago or Pruitt-Igoe in St. Louis (Pruitt for blacks, Igoe for whites).\nBut the long-term price is a racial achievement gap in education, due partly to concentrating the most disadvantaged black children in single schools; health disparities — African Americans have shorter life expectancies and greater rates of heart disease because so many live in more polluted and more stressful neighborhoods; and disparate mass incarceration rates when we settle so many young black men in neighborhoods without access to good jobs.\nPaul Douglas, in this matter, was neither sinner nor saint, but something between. As was the New Deal.\nIn Douglas’s case, his devil’s bargain was compelled by his need for Southern Democratic votes to pass a housing program. There is a commonplace view that this also explains the New Deal’s segregation policies. Walker, for example, notes that the CCC was “forced to segregate its camps due to local pressure from southern and rural communities.” This explanation falls short.\nIn two important books, When Affirmative Action Was White and Fear Itself , Ira Katznelson demonstrated that FDR excluded predominantly black occupations from national economic programs, like Social Security and minimum wages, to enlist Southern Democratic support. But the inference is unjustified that Southerners required the New Deal to practice segregation where uniform national administration was unnecessary. After all, Southern Democrats accepted integrated Northern schools, or water fountains, provided segregation was enforced at home. Interstate railroads traveling south were integrated in Northern states but stopped at the Mason-Dixon Line to segregate passengers.\nSo if the PWA had built a segregated white project and a segregated black project in Memphis (as it did) but integrated projects in Cleveland (as it did not), Southern Democrats would not likely have vetoed PWA funding for that reason. They may have required segregated Southern CCC camps, but this does not explain why New York camps were segregated or why, when white residents of Gettysburg, Pennsylvania, of all places, objected to blacks’ proximity, the CCC moved its black corpsmen out of town.\nA better explanation for New Deal policy is that, with some exceptions, the Democratic Party was nationally segregationist, up to and including the president. FDR did not lead in requiring such policy, but racial equality had no priority for him.\nThe Color of Law recounts how Republican presidents McKinley, (Theodore) Roosevelt, and Taft created an integrated civil service, including black supervisors of whites. When the Democrat Woodrow Wilson assumed office in 1913, his administration segregated federal offices, erecting curtains to separate clerical workers by race, firing black civil servants who had supervised whites, and placing separate washroom facilities for black workers in basements. At the Navy Department, Assistant Secretary Franklin Roosevelt had charge of implementing the policy. I don’t know if he did so enthusiastically, only that he recorded no objection.\nAs president, FDR included the most rabid racists among his closest advisors. One, South Carolina Sen. James Byrnes, was so influential that the press sometimes called him “assistant president.” Byrnes led the campaign against anti-lynching bills, the only civil rights legislation Congress considered in the 1930s. Byrnes explained to the Senate that lynching was necessary to keep Negroes in their place and prevent them from raping white women. He remained in FDR’s good graces, so much so that Roosevelt subsequently appointed him to the Supreme Court. So close were they that FDR had him quit the court to head the Office of Economic Stabilization during World War II.\nWe can only speculate whether, had Byrnes remained a justice, there would have been a unanimous Brown v. Board of Education decision — or any decision at all. I don’t suggest that in promoting lynching, Byrnes reflected the president’s personal views, but only that civil rights were not on FDR’s agenda. As his wife, Eleanor, became more committed to racial equality, her frequent pestering of the president about it is well known.\nAnother key racist figure in the New Deal was FDR’s press secretary, Steve Early. On one occasion, he attempted to prevent Mrs. Roosevelt from admitting black journalists to her press conferences. He failed, not because the president intervened, but only because Mrs. Roosevelt was not easily pushed around.\nA troubling aspect of Richard Walker’s critique is his stated motivation. He fears that describing New Deal segregation policy will tarnish admiration for FDR’s economic program and inspire distrust of government. He fails to recognize our responsibility to confront accurate historical accounts, and if some draw disagreeable political conclusions, show why these are misguided. Suppressing unpleasant facts lacks integrity and opens a door to legitimizing “fake news,” something about which, today, we should be especially wary.\nWalker’s review itself shows the dangers of tailoring facts to what we hope promotes our policy preferences. He accuses The Color of Law of “bolstering conservative positions . . . that government is the problem not the solution,” and then criticizes the same book for devoting a chapter to describing government actions that could redress segregation. Instead of a chapter on activist government policies, he says, I should have written one calling upon citizens to mobilize in favor of such (unspecified) policies.\nYes, books should call for a new civil rights movement. But that’s not the book I wrote; mine is a straightforward account of what happened. At the start of his review, Walker describes the positive public response to The Color of Law . It has helped spur new conversations about “reparations,” has led some Democratic presidential candidates to cite the book as reason for more aggressive policy to redress segregation, and has inspired some cities to enact or consider zoning reforms.\nThese reactions show how misguided is a fear that telling the truth will encourage passivity and inaction. On the contrary, learning about our de jure, not de facto system of residential segregation can stimulate our motivation to correct this most enduring of constitutional violations.", "url": "https://jacobinmag.com/2019/06/rothstein-segregation-color-of-law-new-deal"}