{"authors": [], "date_download": "2020-05-04 20:21:06", "date_modify": "2020-05-04 20:21:06", "date_publish": "2019-03-05 09:00:00", "description": "Shannen Doherty is \"in shock\" following the death of Luke Perry. The 47-year-old actress has been left \"heartbroken\" after her friend and former 'Beverly Hills, 90210' co-star passed away on...", "filename": "_9a1cb61db2bd4cbd8094d58e4a03c452_1588623666.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9a1cb61db2bd4cbd8094d58e4a03c452_1588623666.html", "title": "Shannen Doherty in shock over Luke Perry's death", "title_page": "Shannen Doherty in shock over Luke Perry's death", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Shannen Doherty is “in shock” following the death of Luke Perry.\nThe 47-year-old actress has been left “heartbroken” after her friend and former ‘Beverly Hills, 90210’ co-star passed away on Monday (04.03.19), less than a week after suffering a stroke, and will always be thankful that they rekindled their friendship during her battle with breast cancer.\nShe told People magazine: “I am in shock. Heartbroken. Devastated by the loss of my friend. I have so many memories with Luke that make me smile and that are forever imprinted on my heart and mind.\n“Luke was a smart, quiet, humble and complex man with a heart of gold and never-ending well of integrity and love. Luke reached out to me during my cancer journey and we picked right back up, albeit older and wiser, but that connection remained intact.”\nWhile neither Shannen nor Luke - who played lovers Brenda Walsh and Dylan McKay on the teen drama - had been confirmed to appear on the upcoming ’90210′ reunion series, the actress revealed they had been discussing potential projects to work on together.\nShe said: “There is a special kind of love one has for each other when you are experiencing the journey we did on 90210 and of course life in general. Luke and I were working on show ideas for us.\n“We wanted to work with each other again and create something special and meaningful for our fans at this stage in our lives...I will miss him everyday. Every minute. Every second.”\nLuke was father to Jack, 21, and 18-year-old Sophie from his marriage to Minnie Sharp and the ‘Charmed’ star described his kids as his “biggest accomplishment”.\nShe said: “Luke loved his family. He raved about his kids and how proud he was of them. He showed me videos of them often. They were his heart and for him, his biggest accomplishment.”\nAnother ’90210′ star, Tori Spelling, who played Donna Martin, has also admitted to being in “utter shock” by the death of her “protector and brother”.\nShe said: “I’m in utter shock and heartbroken.\n“I’m saddened for his kids whom he adored beyond words. He was so proud of Jack and Sophie.\n“Luke was one of the kindest and most humble human beings I’ve ever known.\n“I’m grateful for the years of friendship we had. He truly was family to me, a protector and a brother. I’m so sorry for the loss that everyone is experiencing.”\nAnd Jennie Garth - who portrayed Kelly Taylor - called Luke’s death a “terrible loss”.\nShe said: “My heart is broken. He meant so much to so many. Such a very special person. I share my deep sadness with his family and all who loved him. Such a terrible loss.”\nGabrielle Carteris, who played Andrea Zuckerman, paid tribute to the “tremendous force” who always “fought for the underdog”.\nShe said: “I am absolutely heartbroken. Luke was a tremendous force in the lives of so many. He was a very sensitive soul who was kind, generous and he fought for the underdog. He was a strong voice and an advocate who will be so missed by all who knew him. He has left his mark - never to be forgotten. My heart goes out to his family, friends and fans around the globe.”", "url": "https://apnews.com/9a1cb61db2bd4cbd8094d58e4a03c452"}