{"authors": ["Nina Culver"], "date_download": "2020-05-04 21:07:22", "date_modify": "2020-05-04 21:07:22", "date_publish": "2019-03-21 00:00:00", "description": "People often wonder how Brad Byers manages to get a deck of cards or a tennis ball inside a glass bottle with an opening no more than an inch wide, but he won’t tell anyone his secret. Not even...", "filename": "_7a1ed40290384f79adda14f48457ad22_1588626442.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7a1ed40290384f79adda14f48457ad22_1588626442.html", "title": "Professional sword swallower takes up another rare feat - impossible bottles", "title_page": "Professional sword swallower takes up another rare feat – impossible bottles", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "People often wonder how Brad Byers manages to get a deck of cards or a tennis ball inside a glass bottle with an opening no more than an inch wide, but he won’t tell anyone his secret. Not even his wife.\n“That’s a jealously guarded secret,” he said. “She gave up trying to ask me.”\nByers stumbled on the hobby of making “Impossible Bottles” last year and is only now beginning to offer them for sale. “I started out making them as gifts,” he said. “This is so new I haven’t sold any yet.”\nThe rules for making an impossible bottle are simple, Byers said. “Everything that’s inside has to be bigger than the opening,” he said. “You can’t tamper with the glass. Some people classify it as a puzzle.”\nByers is self-taught and said there’s little information available on how it’s done. “It’s a very rare hobby,” he said. “There’s virtually nothing on the internet about it.”\nThose who do know how it’s done keep the secret to themselves. “Nobody wants to reveal,” he said. “Nobody teaches anybody. I had to figure it out through trial and error.”\nByers, who makes his home in Spokane and Pullman, frequents the Mary Lou’s Milk Bottle restaurant on Garland Avenue and noticed the collection of antique glass lining the wall. He offered to make a customized impossible bottle for the restaurant and presented it to owner Tom Ritchie earlier this month.\nThe antique milk bottle includes three decks of cards, including one featuring Elsie the Milk Cow and another with a diner theme. The card boxes are topped with a plastic hamburger. Each box has a small hole cut in the side, “so you can see the cards are really in there,” he said.\nRitchie said he was pleased to have a bottle to display at his restaurant. “Look at it,” he said. “Who can do that? It’s neat.”\nThe impossible bottle will add a little spice to his glass collection, he said. “I think it’s a special gift he has,” Ritchie said. “I’m just honored to have a bottle here.”\nDoing difficult things is the norm for Byers. He’s a professional sword swallower, extreme juggler and yo-yo expert who has performed in 26 countries and holds 72 world records. One of those records is for swallowing a rear axle from a Model T truck. He’s also swallowed 2-foot-long serving spoons, saws and curved swords. His other expertise is in hanging heavy objects on a hook that goes into his nose and out his mouth.\nHe used those unique daredevil skills to make two appearances on the popular television show “America’s Got Talent.”\n“Everything I do is unusual,” he said.\nHe may not be using his tongue to put out a propane blowtorch or lying on a bed of nails while an ATV runs him over, but Byers still finds making impossible bottles a challenge, though it’s not one that requires him to risk his life.\nHe recently finished a bottle that holds a tennis ball topped by a Rubik’s Cube topped with a mini basketball. “My final attempt took seven hours, but I worked on it for three days,” he said. “Different items require different methods.”\nIt’s a skill that leaves people scratching their heads and trying to figure out how Byers manages to get large objects through a small opening without damaging the object or the bottle. He uses everything from Mason jars to orange juice bottles to alcohol bottles to make his creations.\nHe’s also made a bottle that contains several pairs of scissors standing upright. Byers said it was more complicated than he thought it would be. “They don’t bend and you can’t take them apart,” he said.\nByers’ bottles will be featured on his website, www.bradbyers.com. And if you want to book him for a sword-swallowing performance, he’ll do that, too.", "url": "https://apnews.com/7a1ed40290384f79adda14f48457ad22"}