{"authors": ["Job Vigil Jvigil Nptelegraph.Com"], "date_download": "2020-05-04 21:06:08", "date_modify": "2020-05-04 21:06:08", "date_publish": "2019-03-21 08:00:00", "description": "Competition is stiff between communities across the United States as retail stores like Shopko, Herberger’s and Payless close their doors, leaving towns like North Platte high and...", "filename": "_99d5b106dfb84c9bbea4ad8ec8c0aa0c_1588626368.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_99d5b106dfb84c9bbea4ad8ec8c0aa0c_1588626368.html", "title": "Plenty of opportunity", "title_page": "Plenty of opportunity", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Competition is stiff between communities across the United States as retail stores like Shopko, Herberger’s and Payless close their doors, leaving towns like North Platte high and dry.\nCassie Condon, vice president of economic development and marketing/communications director for the North Platte Chamber, says there is great opportunity for businesses to find success in North Platte.\n“There’s not very many retailers that are expanding, and the ones that are, they really have their choice in the game,” Condon said. “It’s really a retailers’ market right now, because there’s a lot of available properties and available communities begging them to come in.”\nShe said North Platte needs to make coming here enticing for companies to consider locating here. A partnership with Buxton, a retail recruitment firm that uses analytical mapping software, has helped the North Platte Area Chamber of Commerce and Development Corp. with that process.\n“We have to sell them the great picture that we are the best opportunity,” Condon said. “We partnered with Buxton and they have really helped us paint that better picture in retailers’ terms and in real estate investors’ terms.”\nBuxton has provided factual data for the opportunities here.\n“So it’s not just Cassie who has been in economic development for six months,” Condon said. “We know exactly what each company is looking for and we’re able to hit on those points.”\nAnother “gut punch,” as Chamber president and CEO Gary Person earlier this week described the impending closure of Shopko, is difficult to take, but Condon said there is hope.\n“The biggest hurdle that Buxton has helped us overcome is they know that retailers will ask for a 25-minute drive time demographic report,” Condon said. “In midwestern Nebraska, our 25-minute drive time from any site is not enticing to a big retailer.”\nCondon said in order to attract the attention of retailers, a larger “drive time ring” is necessary — that is a circle that expands out geographically from North Platte.\n“So we know we have to provide and we can provide through Buxton’s reports a larger drive-time ring,” Condon said. “It’s the communication that in midwestern Nebraska, customers don’t have options 80 minutes away. We are their closest option.”\nShe said customers will drive to North Platte from all over the region.\n“They will come from northern Kansas and from Valentine, northern Nebraska and even eastern Colorado,” Condon said. “They would drive to North Platte to shop because we would be a close option for them to shop if they were looking for x, y, z.”\nCondon said there are about 79,000 people with a 80-minute drive time to North Platte, and about 27,000 people with a 20-minute drive time.\nShe said that is a huge difference, and she hopes she can get some attention from retailers with that data. Incentives are also part of the picture.\n“When I’m talking to retailers, I tell them incentives are available — tell us what you need, and we work with them to fine-tune that,” Condon said. “There are different things available with TIF and Quality Growth Funds, which can become hot buttons, especially in our community.”\nHowever, Condon said, she thinks the community would stand behind the use of those incentives because they want to see new retail.\n“Those options plus the Opportunity Zone have been something we’re able to spread the news about,” Condon said, “the Opportunity Zone being that 400-block tract that starts at Philip and goes up to Front and from Bicentennial over to Vine.”\nRedeveloping any of that zone would be helped with federal tax credits, she added.\n“There’s also been packages in the past put together by developers and real estate companies to entice retailers to look at our community,” Condon said. “Sometimes it turns a head, sometimes it doesn’t.”\nShe said the Chamber board put some dollars to another opportunity for incentives.\n“We said, if you come to our community this is what is available,” Condon said. “We have an Economic Incentive Fund that comes from our economic partners, it is not taxpayer money.”\nShe said the money comes from 90 or so businesses that pay into a special fund just to breathe economic life into the community.\n“When you talk retail and retail recruitment, it’s not necessarily only what someone would think of as retail,” Condon said. “It’s not just clothing apparel, it is actually restaurants and grocers and that sort of thing as well, and I wouldn’t say that our eyes are closed to any certain sector.”\nIn terms of strengths, North Platte is doing very well in the motor vehicle market.\n“We are actually well over meeting the demand of our motor vehicle consumer market here,” Condon said. “That means that we are selling more and driving more people into our community, which is a great thing.”\nWeaknesses are evident as well, Condon said.\n“Things like groceries and apparel, we are losing considerably, anywhere between the 30 and 50 percent mark, and that hurts,” Condon said. “Because if we know they’re leaving to go spend money on groceries in Kearney and Hy-Vee, what else are they spending their money on?”\nThere are other strengths as well that Condon said North Platte can build on.\n“Our strengths are obviously our great tourism spots,” Condon said. “We have a lot of great assets — you have to think off the interstate — Bailey Yard, Buffalo Bill and the Lincoln County Historical Museum are great assets to our community, and they drive in people from out of the country to see the Union Pacific railyards.”\nCondon is going to an event in Las Vegas in May that will give her the opportunity to share the features and opportunities in North Platte with over 30,000 attendees from 56 countries. She said she hopes the event will open doors for communication with retailers who might be willing to take a chance on North Platte.", "url": "https://apnews.com/99d5b106dfb84c9bbea4ad8ec8c0aa0c"}