{"authors": ["Bailey Vogt The Washington Times"], "date_download": "2020-05-04 20:28:45", "date_modify": "2020-05-04 20:28:45", "date_publish": "2019-05-24 08:48:03", "description": "House Judiciary Vice Chairwoman Rep. Mary Gay Scanlon said Friday she believesthey \"will hear publicly from\" special counsel Robert Mueller despite Rep. Jerrold Nadler saying Mr. Mueller wanted a...", "filename": "_f0b47b576be4998f2d07102ced01c201_1588624125.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f0b47b576be4998f2d07102ced01c201_1588624125.html", "title": "'His testimony will become public'", "title_page": "Scanlon on Mueller request for private testimony: 'His testimony will become public'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "House Judiciary Vice Chairwoman Rep. Mary Gay Scanlon said Friday she believesthey “will hear publicly from” special counsel Robert Mueller despite Rep. Jerrold Nadler saying Mr. Mueller wanted a private testimony.\n“We would prefer for him to testify completely in public. One way or the other, his testimony will become public,” the Pennsylvania Democrat said on CNN’s “New Day” show.\n“We think the American public should hear directly from Robert Mueller, Mr. McGahn the White House counsel who’s testimony ... this week was blocked, [and] any number of witnesses who have direct knowledge of the president’s cover-up,” she said.\n“We’d like America to see the actual truth and hear from the actual participants,” she said.\nMr. Nadler said on MSNBC that Mr. Mueller has asked for a private session to testify about his report, which investigated President Trump’s presidential campaign and Russian interference in the 2016 election.\n“Mueller, I think I can say at this point, that he wants to testify in private. I don’t know why. He’s willing to make an opening statement [in public], but he wants to testify in private,” he said, adding a transcript of Mr. Mueller’s testimony will be made public.", "url": "https://apnews.com/f0b47b576be4998f2d07102ced01c201"}