{"authors": ["Eric Kieta"], "date_download": "2020-05-04 20:25:48", "date_modify": "2020-05-04 20:25:48", "date_publish": "2019-03-23 02:15:00", "description": "Somerset Borough officials are working to combine managerial responsibilities. Borough Manager Michele Enos said that since May officials have been reworking three positions. The overall...", "filename": "_978f1464b3024d66b8225a4ee231c258_1588623948.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_978f1464b3024d66b8225a4ee231c258_1588623948.html", "title": "Somerset Borough restructuring management", "title_page": "Somerset Borough restructuring management", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Somerset Borough officials are working to combine managerial responsibilities.\nBorough Manager Michele Enos said that since May officials have been reworking three positions. The overall goal is for the duties of the former assistant manager position to be taken on by someone else.\nThe last time the borough had an assistant manager was in 2016, when the position was held by Josh Summits.\nEnos once held the post under former Borough Manager Benedict Vinzani Jr.\nTo help out with the transition, Vinzani has been working part time for the borough at $35.60 an hour since retiring from the manager post in January 2015.\nA Right-to-Know request from the Daily American shows that he has made more than $100,000 from the borough since that time.\nThe request shows that Vinzani worked an average of 13.45 hours a week in 2015, 16.65 in 2016, 12.32 in 2017 and 11.97 in 2018 as of Feb. 28.\nVinzani said that he “absolutely” thinks the new system will be more efficient. When asked why the transition has taken as long as it has since his retirement, he said, “It’s a process.”\n“I’m just pleased to be helping out during this restructuring,” he said. “I’m pleased I’ve been able to help out.”\nEnos said that Vinzani’s knowledge of borough management is unprecedented, and that his work has shown the municipality a cost savings.\n“There hasn’t been any additional increase to the budget at all to having him stay on,” she said. “It’s been the most cost-saving means for us to have that administrative support.”\nBy comparison, Summits was paid an annual salary of $40,000. That would equal about $20 an hour for full-time work. That does not factor in what the borough would have paid for his benefits.\nEnos said that Vinzani’s hourly rate is worth it because of his expertise. She said that he is versatile and can fulfill all roles of local government.\n“Would it be a cheaper hourly rate? Absolutely,” she said. “But the overall cost on the budget is significantly lower.”\nShe added that the position is temporary.\n“We are not planning on doing this on a full-time basis,” she said.\nShe said that action on the transition process should occur in May. She declined to comment on when Vinzani will finish his post.\n“We didn’t want to jump and make a decision when we had a larger picture to look at,” she said of the timeframe of the transition.", "url": "https://apnews.com/978f1464b3024d66b8225a4ee231c258"}