{"authors": ["Stephanie Stinnett Dc Family"], "date_download": "2020-05-04 20:10:02", "date_modify": "2020-05-04 20:10:02", "date_publish": "2019-01-12 16:00:00", "description": "Douglas County has so many amazing things to offer and we are lucky to have so many incredible parks. My husband and I love to take our kids on all kinds of adventures and encourage them to...", "filename": "_00d2c22972094f7b9fae3f45fcb275e7_1588623002.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_00d2c22972094f7b9fae3f45fcb275e7_1588623002.html", "title": "Places to visit in Douglas County when the rain begins", "title_page": "Places to visit in Douglas County when the rain begins", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Douglas County has so many amazing things to offer and we are lucky to have so many incredible parks. My husband and I love to take our kids on all kinds of adventures and encourage them to explore.\nAfter my husband left the Army, we moved home and began looking for things to do locally with our kids to show them the beautiful place where we grew up. Now that the cold, rainy weather is starting to set in I started looking for things to do that are indoors.\nDouglas County Museum of Natural and Cultural History\nThis is one of my favorites from when I was a child, so I was very excited to be able to take my kids and let them experience it as well. This is also a great activity for those cold and rainy days that come with winter. If you’re ever looking for an activity that the whole family will love this is a great place.\nThe museum is located right next to the fairgrounds and was opened in 1969. It has many hands-on exhibits that are geared toward young kids to help them learn about the county’s history. On the lower level of the museum, there is an area that is filled with puppets for the younger kids. In the courtyard of the museum, there is a large outdoor excavation exhibit where kids can uncover artifacts. You can then make your way up to the train station where kids can play with a wooden train set and learn about the history of the railroad in Oregon. Admission is $8 for adults, $2 for students ages 5 to 17, and $5 for seniors and veterans. It is open from 10 a.m. to 5 p.m. Tuesday through Saturday.\nWildlife Safari\nThis is another one of my personal favorites that my kids and I love. My kids ask to go every week. The safari has so many things to do there, from the drive-thru to the keeper talks in the village. There is a petting zoo with a feeding station so you can feed the goats. Then you can head over to the White Rhino Cafe for some ice cream. My family had a blast with the elephant encounter the safari offers, where you can see the elephants up close and watch them paint a picture.\nLocated in Winston, Wildlife Safari is home to hundreds of animals that wander freely over the 600-acre park. Wildlife Safari also has the top cheetah breeding program in America.\nTickets, which can be purchased online or at the ticket booth at the entrance to the park, are $19.95 for adults (13-59), $13.95 for children (3-12), and $16.95 for seniors (60-plus). The village is open all week from 9 a.m. to 6 p.m. From November 8 to March 12, the drive is opened from 10 a.m. to 4 p.m. From March 13 to Nov. 7 the drive is open from 9 a.m. to 5 p.m.\nTen Down Bowling\nTen Down is an awesome place to go for an activity your entire family can enjoy. With bumpered lanes, it is an activity that even your younger children can enjoy. There is also an arcade filled with games for all ages. When you or the kids are done playing, you can go exchange your tickets for prizes. Splitz Family Grill, located inside the bowling alley, has a fun menu for kids. They also have a selection of wines, cocktails and beer.\nThe Strikes Lanes are open from Monday to Friday. Before 5 p.m., it costs $3.75 per person, per game. After 5 p.m. on weekdays and before 5 p.m. on weekends, it costs $4. On Friday and Saturday after 5 p.m., the price is $4.25.\nThe Splitz Lanes, which are more relaxed, are open Monday to Friday, before 5 p.m. it is $4 per person, per game. After 5 p.m. on weekdays, and before 5 on weekends, it will cost $4.25. Friday and Saturday after 5 p.m. the price is $4.75.\nOakland Museum\nIf you find yourself in Oakland there is a cute little museum dedicated to the history of this quaint little Oregon town, and it is free. The museum has a bank exhibit, post office, general store, as well as a display of clothing and toys commonly found in turn-of-the-century homes. It is also filled with old photographs and the stories of Oakland throughout the years. The Oakland Museum is open from 12:30 to 3:30 p.m. daily, with the exception of holidays.", "url": "https://apnews.com/00d2c22972094f7b9fae3f45fcb275e7"}