{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Alyssa Battistoni", "Thea Riofrancos", "Barry Eidlin", "Luke Savage"], "date_download": "2020-05-04 19:54:43", "date_modify": "2020-05-04 19:54:43", "date_publish": "2019-09-05 00:00:00", "description": null, "filename": "2019_09_climate-town-hall-2020-democratic-presidential_1588622083.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/09/05164618/GettyImages-1164688320.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_09_climate-town-hall-2020-democratic-presidential_1588622083.html", "title": "We Heard Three Visions for Saving the Planet Last Night. Only One Will Work.", "title_page": "We Heard Three Visions for Saving the Planet Last Night. Only One Will Work.", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Last night’s climate town hall was seven hours long. You can be forgiven for not watching the whole thing; I didn’t. But if you tuned in for a two-hour stretch in the middle, you got to see the Democratic primary race’s three top contenders — Joe Biden, Elizabeth Warren, and Bernie Sanders — lay out their visions for how to solve the climate crisis. And they were very different visions.\nBiden promised a return to the old status quo. Warren promised carrots and sticks to make corporations behave more sustainably. And Sanders promised to wrest control of the future from for-profit interests. The clock is ticking, and the choice is clear.\nJoe Biden struggled through his segment, mashing folk-isms together and trailing off per usual. But somewhere amid the endless string of non sequiturs, a stance on climate change did emerge. Biden appears to believe that Donald Trump is responsible for bringing the world to the brink of irreparable environmental destruction, and that the primary task of his successor is to undo the damage Trump has done.\nOne audience questioner, the mother of a young woman who died during Hurricane Sandy, asked Biden what specific steps he would take in his first year to address the climate crisis. Try to make sense of his answer here:\nFirst of all, what we have to do is go back and turn back all the changes that in fact the president has made, from CAFE standards to moving in the direction that we in fact deal with providing people who get displaced opportunities to have jobs by sending them back to school, by doing continuing education, whole range of things. I would see to it in the first, immediately, moving toward, you know we’re in fact in a position now that if in fact we dealt with mitigation across the board, just what we did in the last administration and before, leading to a standard that we provide efficiency for appliances.\nYou can’t make sense of it, because it’s largely unintelligible. But one thing that does shine through is that Biden thinks the most important steps to take are “turning back all the changes that in fact the president has made” and doing “just what we did in the last administration.” Unbelievably, Biden even implied that nobody knew about climate change before Trump became president, saying:\nIt’s a little bit like a whole lot of things that people didn’t know before this guy became president, before he started to take it away. And he started to take it away and they said, “Whoa, wait a minute man, look what that’s done.” He’s changed the CAFE standards, we’re not gonna meet those standards. Well that means boom, he’s done his, and that means bang, everybody knows now, knows what he has done.\nWhatever else Biden said — and it was mostly gibberish like this — his insistence that the climate crisis begins and ends with Trump, and that the Obama administration provided adequate stewardship on climate issues, is unacceptable and incommensurate with the threat we face. If Joe Biden wins the presidency, we’re toast.\nNext up was Bernie Sanders, whose Green New Deal is the most comprehensive plan to address climate change put forward by any presidential candidate, not just in this race but in US history.\nSanders performed well in his segment. With characteristic directness, he covered about three times as much ground as Biden. Reasonable people may disagree with his views on nuclear energy (he doesn’t see investing in nuclear as the path to sustainability) or his great love of energy efficient light bulbs (Warren made a good point later that the conversation about light bulbs, straws, and cheeseburgers is a distraction). But primarily Sanders focused on the contours of his Green New Deal, a national mobilization plan that treats the climate emergency with the gravity it deserves.\nSanders’s plan is aggressive and its timelines are short. It goes after the profits of climate-destroying corporations, proposing a ban on imports and exports of oil and gas, a ban on fracking, and a ban on public-lands drilling. His plan also boldly proposes to build new federal agencies, modeled after the Tennessee Valley Authority, that can provide cheap and reliable public utilities and begin to free our energy grid from the strangulation of private corporations. It proposes to create twenty million new jobs, putting people to work building infrastructure and restoring the environment. For those whose jobs will be lost in the transition, Sanders’s plan proposes five years of guaranteed income and retraining, leaving no worker behind.\nSanders hit most of these points during his climate town hall segment. He demonstrated the depth of his vision right off the bat when he was asked how he would pay for it all. Sanders laid out a four-point plan for paying for the Green New Deal: First, we will end subsidies to the fossil fuel industry. Second, bringing private utilities under public ownership will generate revenue for the federal government while also guaranteeing that no one will go without light and heat. Third, we will slash the enormous defense budget and stop paying to protect US corporate oil interests abroad. And fourth, the mass provision of new jobs — good, public sector, unionized jobs — will mean fewer people on public assistance. He threw in a bonus: We’re going to tax the shit out of Jeff Bezos.\nHost Anderson Cooper asked Sanders if he would prioritize his Green New Deal plan over his other ambitious plans, like Medicare for All, tuition-free public college, and student and medical debt cancellation. His answer testified to his holistic vision for change. “To my mind, it’s not prioritizing this over that. It is finally having a government which represents working families and the middle class rather than wealthy campaign contributors.”\nIn brief, there is no tension between the struggle for universal health care and education and the fight to end climate change. They are all part of the same project to build a government that reflects the interests the vast majority of people rather than the wealthy few. And in all instances, the government must take the lead in providing what people need to survive and thrive through progressive taxation and ambitious universal program design.\nAfter Sanders came Elizabeth Warren. She also performed well: her demeanor was charming and her points, unlike Biden’s, were substantive and clear. But while she echoed many of Sanders’s concerns about runaway for-profit companies destroying the planet, her solutions rested heavily on plans to coax and regulate that same capitalist class into leading the climate effort themselves.\nTo turn to a metaphor: if Bernie Sanders sees the government as the bowling ball barreling toward the pins, Warren sees the government as the bumpers guiding the ball. The ball, in Warren’s case, is corporations. Good ones. Green ones.\nWarren detailed a plan to invest public money in research and development of green technology, and then tell corporations that if they want to manufacture based on those innovations, they need to do so in the US. This, she assured viewers, would lure private corporations to our country to build green manufacturing operations, which would result in good jobs. It’s markedly different from Sanders’s proposal, in which the government actually provides the bulk of the jobs — not just the private sector.\nWarren inexplicably claimed that these private sector jobs would be unionized and highly paid. There’s scant evidence for this: private sector manufacturing is losing union density at an alarming rate, and wages remain stagnant. Why do we think green manufacturing will be any different? Only Sanders’s plan, which provides jobs through the already heavily unionized federal government, can guarantee that the transition will be a boon for workers.\nThis difference in perspective came out clearest in Warren’s answer to a question asked by audience member Robert Wood from Brooklyn. Wood asked, “Bernie Sanders has endorsed the idea of the public ownership of utilities, arguing that we can’t adequately solve this crisis without removing the profit motive from the distribution of essential needs like energy. As president, would you be willing to call out capitalism in this way and advocate for the public ownership of our utilities?”\nWarren looked briefly panicked. “Gosh, you know, I’m not sure that that’s what gets you to the solution,” she said. “I’m perfectly willing to take on giant corporations,” she added — but take on doesn’t mean supplanting them with public alternatives. “If somebody wants to make a profit from building better solar panels and generating better battery storage, I’m not opposed to that. What I’m opposed to is when they do it in a way that hurts everybody else.”\nIt’s clear from this answer that Warren believes that profit-driven corporations are key partners in solving climate change. She just wants them to behave better, and her solution is a series of carrots and sticks — incentives and regulations — that can bring out the best in the private sector. This is the key difference between Sanders and Warren: he’s guided by no such faith. That’s why his plan places the federal government, an entity not motivated by the maximization of private profit, in the drivers’ seat of the effort to save the planet. The corporations got us into this mess, and they won’t get us out of it.\nBiden, Sanders, and Warren are the three frontrunners in the race for the Democratic Party presidential nomination. In the primary race, voters who care deeply about climate change are now faced with a clear choice. They can choose a fumbling out-of-touch party insider who pines for a return to the status quo, a regulator par-excellence who wants primarily to whip corporations into shape, or a democratic socialist who wants to take control of the ship from the private interests who are steering us toward planetary destruction.\nFor the sake of future generations, let’s hope they choose the latter.", "url": "https://jacobinmag.com/2019/09/climate-town-hall-2020-democratic-presidential"}