{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:07:28", "date_modify": "2020-05-04 20:07:28", "date_publish": "2019-01-27 11:37:37", "description": "LOWELL -- As a Catholic school community, Lowell Catholic High School not only teaches students academic lessons, but also directs them to apply what they learn to improve the world around...", "filename": "_0e8ec98f6dea4d3f8f77299f881e6214_1588622848.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0e8ec98f6dea4d3f8f77299f881e6214_1588622848.html", "title": "LC Students Volunteer 2,500 Hours in One Week", "title_page": "LC Students Volunteer 2,500 Hours in One Week", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOWELL -- As a Catholic school community, Lowell Catholic High School not only teaches students academic lessons, but also directs them to apply what they learn to improve the world around them.\nEach January for the past seven years, seniors have gone into the community and given back by volunteering at more than 25 sites. This year, the class of 2019 collectively volunteered for nearly 2,500 hours in one week, serving seniors, children and families at organizations across the Merrimack Valley region. Collectively, the class has served more than 6,000 hours of community service this school year alone.\n“I was pretty negative about the week going into it, but I came out of the experience with a much different attitude,” senior Jamison Harrower said.\nServing in a second-grade classroom, Jamison became inspired by the young faces that counted him as their friend and a gentle giant.\n“Not only did the week teach me about different communication styles, problem resolution and leadership, it taught me to take positions of authority seriously when working with young, impressionable minds,” he said.\nJamison admitted it was an adjustment to be back in the classroom at LC after a week in second grade, but he looks forward to serving in future leadership roles and has plans to attend Louisiana State University for communications after graduating.\nSenior Service Week is run in conjunction with LC’s CSL program, which requires students to perform more than 100 hours of community service as a requirement for graduation. In addition to weeklong internships, all seniors kept a daily journal and attended a night of reflection that gave them a chance to discuss and share their experiences.\nThis spring, each senior will give a presentation titled “My Mark on the World” to a panel of teachers and community members reflecting on the impact their service has had on them and their community, and to report any plans to continue their service in the future.", "url": "https://apnews.com/0e8ec98f6dea4d3f8f77299f881e6214"}