{"authors": ["Francisco Louçã", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Raquel Varela", "Nuno Teles", "Catarina Príncipe", "An Interview With"], "date_download": "2020-05-04 19:58:24", "date_modify": "2020-05-04 19:58:24", "date_publish": "2019-10-05 00:00:00", "description": null, "filename": "2019_10_portugal-elections-economy-socialist-party-left-bloc-francisco-louca_1588622304.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/10/05110016/8204584027_21044c50e2_o.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_10_portugal-elections-economy-socialist-party-left-bloc-francisco-louca_1588622304.html", "title": "Making Portugal’s Break With Austerity Real", "title_page": "Making Portugal’s Break With Austerity Real", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Interview by David Broder\nFor many on the European center-left, Portugal stands as proof that it is possible to break out of austerity without any need for a “populist” offensive against Brussels. For the Guardian , Portugal today stands as “Europe’s beacon of social democracy”; for the New Stateman , it is “Europe’s socialist success story.” Since 2015 the Socialist-led government has been acclaimed for its role in escaping the sovereign debt crisis, returning Portugal to growth even while taking poverty-reduction measures.\nThe government is especially notable for its parliamentary majority, dependent on the external support of both the Left Bloc and the Communists. Yet if Portuguese right-wingers deem Costa “in hock to the extreme left,” his government can also be seen as a rejuvenation of mainstream social democracy. Where other austerity-hit countries have seen a rise of Eurosceptic or otherwise populist forces, polls for Sunday’s vote suggest a strengthening of the Socialists’ position, outstripping even their success in the 2015 contest.\nYet for all the triumphalism surrounding the center-left’s record in office, the difference between Portugal and other PIIGS countries is, at best, relative. Without doubt, since the harshest period of austerity in the early 2010s Portugal has gained some economic breathing space — putting an end to the cycle of falling wages, lower consumption, tax rises, and rising debt. Aided by Europe’s emergence from the worst moment of crisis, Portugal has also seen a return to economic growth.\nHowever, the particular forms this takes is also storing up long-term problems. In particular, the government has slashed investment — in 2016 it even recorded negative levels of public investment, where the depreciation in state assets outstripped spending. This is what Mickaël Correia called the “dark side of Portugal’s economic success story” — a historic tightening of the purse strings, in which even the return to growth has added to the economic weight of property speculation, tourism, and precarious employment.", "url": "https://jacobinmag.com/2019/10/portugal-elections-economy-socialist-party-left-bloc-francisco-louca"}