{"authors": ["Jennifer Harper The Washington Times"], "date_download": "2020-05-04 20:12:47", "date_modify": "2020-05-04 20:12:47", "date_publish": "2019-03-17 18:38:07", "description": "President Trump is being advised to push back personally on the chic socialism that now has many millennials in its grip. \"Basically, our youth has suffered from a form of child abuse by...", "filename": "_a10a8991d23e28217d9bb8da2b63a8d6_1588623167.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a10a8991d23e28217d9bb8da2b63a8d6_1588623167.html", "title": "Inside the Beltway: Trump urged to save millennials from socialism", "title_page": "Inside the Beltway: Trump urged to save millennials from socialism", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Trump is being advised to push back personally on the chic socialism that now has many millennials in its grip.\n“Basically, our youth has suffered from a form of child abuse by their teachers and the media. They have been told, implicitly and explicitly, from earliest childhood that socialism is the preferable system because of ‘fairness.’ The next election is likely to be some form of socialism versus capitalism, no matter who the Democrats nominate. If Bernie Sanders, it will be front and center, but it won’t be far away with other candidates. Every election is said to be the most consequential. This one really is. So as Lenin himself would have put it, what is to be done?” writes PJ Media co-founder and columnist Roger Simon.\n“Trump has to be prepared as never before to be the spokesperson for the free market system and its attendant freedoms. This is not going to be simple. While the president can be a hugely entertaining speaker and often has excellent gut instincts, education is not his strong suit. But he’s going to have to do it,” the columnist continues.\n“Rather than relying on obvious sloganeering, even if it’s accurate, or pointing to his own business success or even a booming economy, he has to be mindful of his audience. It is not, in this instance, the ‘deplorables,’ who already understand the situation. It is the youth of America our future who must be educated from the ground up, actually re-educated,” writes Mr. Simon.\n“This takes patience and it takes clarity, but is also an opportunity to make this election even more important. Our youth must be walked through basic economics and have history explained to them,” he advises.\nIMMIGRATION: NOT THERE YET\nThe immigration debate drags on. New York Post columnist Michael Goodwin warns it could drag into the next generation.\n“We already see that in the move by blue states mostly to let illegal immigrants get driver’s licenses and vote in municipal elections. Health benefits and college scholarships are being created specifically for illegals, as if their unlawful arrival here makes them extra deserving of taxpayer help. Traditionally, legal immigrants had to be self-supporting or have a financial sponsor. Now the uninvited are expected to be dependent on government support,” writes Mr. Goodwin.\n“It has been obvious for decades that the first order of immigration business is securing the border so we can decide which people, and how many, come into our country. Then the nation could turn to the trickier issue of those already here. It is profoundly disheartening that we have not taken even that elementary first step, and have instead made the problem exponentially worse. So the president is doing the right thing by fighting for a secure border, but nobody should be fooled into thinking we are anywhere near a solution to the immigration crisis,” he warns.\nIMMIGRATION ACCORDING TO GEORGE W. BUSH\nFormer President George W. Bush and former first lady Laura Bush take the hands-on approach for an immigration naturalization ceremony Monday. They will oversee the moment when 51 new citizens take their Oath of Allegiance to the U.S. and receive certificates of naturalization at a ceremony at the George W. Bush Institute a policy center housed in the Bush Presidential Center in Dallas, Texas,\n“President and Mrs. Bush will deliver brief remarks noting the significant contributions of immigrants to our society and economy and the importance of border security,” the organization advises.\nThe former first couple will also participate in a conversation with Rep. Will Hurd, Texas Republican and a former CIA officer, plus policymakers, community leaders and an immigration lawyer, among others.\nThe Bush Institute, organizers advise, advocates for “smart, skills-based immigration reform” with a close eye on a 21st-century economy and for the “debunking” of immigration myths.\nCurious? The event will be live-streamed at 11 a.m. EDT at Bushcenter.org.\nTHE REALLY LONG RIDE\nMost Americans still sit in cars for an hour every day to stay employed. But some must now go to extremes to get to work.\n“Average commute times in the U.S. have remained surprisingly stable for as long as the Census Bureau has been measuring them. The average American commute today is roughly 26 minutes, only about five minutes longer than it was in the 1980s and ’90s. The average American seems content commuting just under a half-hour each way, and some scholars even point out that commute times in the Roman Empire were nearly identical,” notes a new national analysis from Apartment List, based on U.S. Census data and economic indicators.\n“Many people are increasingly braving extremely long commutes. Today, 3.5 million Americans 2.9 percent of the full-time working population are ‘super commuters’ who travel more than 90 minutes to work and back home again, each way. The number of super commuters increased by 31.7 percent since 2005, as 850,000 dedicated Americans crossed the threshold of spending over fifteen hours per week just getting to and from work.”\nPOLL DU JOUR\n30 percent of Americans consider unemployment rates and job reports as the “best measure” of how the national economy is doing; 32 percent of Republicans, 29 percent of independents and 31 percent of Democrats agree.\n28 overall say the prices of goods and services they buy are the best measure of the economy; 30 percent of Republicans, 25 percent of independents and 29 percent of Democrats agree.\n17 percent overall say their personal finances are the best measure; 18 percent of Republicans, 13 percent of independents and 20 percent of Democrats agree.\n9 percent overall say the stock market index is best measure; 12 percent of Republicans, 9 percent of independents and 7 percent of Democrats agree.\n17 percent overall say they don’t know what is the best measure; 8 percent of Republicans, 25 percent of independents and 13 percent of Democrats agree.\nSource: An Economist/YouGov poll of 1,500 U.S. adults conducted March 10-12.\nHelpful information to jharper@washingtontimes.com", "url": "https://apnews.com/a10a8991d23e28217d9bb8da2b63a8d6"}