{"authors": ["Robyn Norton", "Wisconsin State Journal"], "date_download": "2020-05-04 20:15:40", "date_modify": "2020-05-04 20:15:40", "date_publish": "2019-03-29 10:15:00", "description": "Sit back and relax while the kids enjoy Music and Laughter with David Landau 10 to 10:45 or 11 to 11:45 a.m. Saturday at DreamBank, 821 E. Washington Ave. Landau is an award-winning musician and a...", "filename": "_90a83241cb144283b40ccbd818e5797e_1588623340.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_90a83241cb144283b40ccbd818e5797e_1588623340.html", "title": "Going Out: Sing and dance with David Landau", "title_page": "Going Out: Sing and dance with David Landau", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sit back and relax while the kids enjoy Music and Laughter with David Landau 10 to 10:45 or 11 to 11:45 a.m. Saturday at DreamBank, 821 E. Washington Ave. Landau is an award-winning musician and a local favorite for kids to sing and dance along with. Register online for the free family event.\nMore information and register at go.madison.com/DavidLandauDreamBank ; more information 608-286-3150.\nBeethoven for kids\nIntroduce the kids to classical music at Wisconsin Chamber Orchestra’s Family Series “Beethoven Lives Next Door” 9:30 and 11:15 a.m. Saturday in Warner Park Community Recreational Center, 1625 Northport Drive. Beethoven’s Fifth Symphony will be brought to life through live music and storytelling during each 40-minute session of the free, family-friendly event. Arrive early, 9 or 10:45 a.m., for pre-show activities.\nMore information go.madison.com/beethovennextdoor ; or phone 608-257-0638.\nOutdoor expo\nExplore the Outdoor Life/Field & Stream Expo 2 to 8 p.m. Friday, 9 a.m. to 7 p.m. Saturday, and 9 a.m. to 4 p.m. Sunday in the Exhibition Hall and New Holland Pavilion 1 at Alliant Energy Center, 1919 Alliant Energy Center Way. Formerly known as the Deer and Turkey Expo, the family-friendly event caters to hunting, fishing and outdoor enthusiasts. Try out some of the latest products, gear, and equipment; talk to experts and attend seminars and demonstrations; enter in the trophy deer contest; view a trail camera photo display; watch a dog diving competition; see Bryan Ferguson performing trick archery, and more. On-site admission is $15/one-day adult, $20/two-days adult, $30/three-days adult; $5/youth 6 to 15; free for kids 5 and under; $13/one-day military with proof of duty. Parking is $7/cash only.\nMore information go.madison.com/OutdoorExpo .\n‘Cabaret!’ at Bartell Theatre\nDon’t miss the final performances of “Cabaret!” 7:30 p.m. Friday and 2 p.m. Saturday on the Drury Stage of the Bartell Theatre, 113 E. Mifflin St. The updated classic musical deals with issues of gender fluidity and the fascist Nazi threat and is the collaborative effort of StageQ and OUT!Cast Theatre. Set in Germany, just before the rise of the Nazis when Berlin was a liberal haven for all types of lifestyles, stories of love and relationships unfold in the decadent Kit Kat Club. Music accompaniment is provided by a live eight-piece band. General admission to the production, recommended for ages 16 and older, is $30; senior and student admission is $25.\nMore information bartelltheatre.org ; or phone 608-661-9696.", "url": "https://apnews.com/90a83241cb144283b40ccbd818e5797e"}