{"authors": ["Christine Stuart"], "date_download": "2020-05-04 20:18:30", "date_modify": "2020-05-04 20:18:30", "date_publish": "2019-04-22 17:29:56", "description": "HARTFORD — On their own time, Department of Labor employees delivered a petition to Gov. Ned Lamont’s office Monday asking him not to privatize any part of any Paid Family and Medical Leave...", "filename": "_8282cb14fd014f9eb3878e53d8b5f6b6_1588623510.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8282cb14fd014f9eb3878e53d8b5f6b6_1588623510.html", "title": "Hundreds petition to prevent privatizing CT family leave plan", "title_page": "Hundreds petition to prevent privatizing CT family leave plan", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HARTFORD — On their own time, Department of Labor employees delivered a petition to Gov. Ned Lamont’s office Monday asking him not to privatize any part of any Paid Family and Medical Leave program that’s approved by the General Assembly.\nThe petition was signed by about 300 of their colleagues.\n“We as an agency believe we could do a better job administering the program,” AFSCME Local 269 President Xavier Gordon said.\nHe said privatization, one of the options being discussed in negotiations over three different versions of the legislation before the General Assembly, could also compromise the integrity of the program.\nDemocratic lawmakers are looking to negotiate exactly what Connecticut’s paid Family and Medical Leave Program will look like. House Speaker Joe Aresimowicz, D-Berlin, has said he expects the legislation to be passed in the next two weeks.\n“Personally, I really don’t care who is administering it,” Aresimowicz said recently. “I don’t care. Public, private, let’s find out what works. Let’s get the product out to the people who need it.”\nThe two bills proposed by the legislature differ from the bill proposed by Lamont.\nUnder all three bills, all employees in Connecticut would contribute 0.5 percent of their weekly paycheck to a state-run trust fund, which would be used to pay workers during approved periods of leave.\nHow much employees would receive while they are out on leave differs depending upon which bill you consider.\nThe governor’s bill, SB 881, says an employee could earn 90 percent of their typical earnings up to $600 per week for anyone making around $15 an hour, and 67 percent up to $900 for workers earning more than that.\nThe other two bills offer a wage replacement level of 100 percent, up to a maximum of $1,000, which is much higher than programs in other states.\nAsked about how firm he was last week on privatizing parts of the program, Lamont said the “hard line” for him is to “keep those options open so we can deliver service in the most efficient and effective way possible.”\nLamont said the Department of Labor would adjudicate any claims related to the program even if it’s overseen largely by a private insurance company.\nGordon said he doesn’t want to be sharing anyone’s “medical information” with a private company.\nHe said even if the Department of Labor maintained the claims adjudication, it would need to share information it collects for other functions with a private company.\n“It shouldn’t be in two different areas,” Gordon said.\nHe said the state already has the infrastructure to manage this type of program.\nAFSCME Local 269 Vice President Marsha Tulloch said she came from the division that crafted the current regulations for unpaid Family and Medical Leave.\n“We are subject-matter experts who have the training and the commitment to do the job right — and do it impartially, with full accountability to the public,” Tulloch said.\nShe said they already have wage information and a list of all employers.\n“I think it would be an easier fit and a quicker fit to have us administer the program,” Tulloch said.\nIt’s unclear exactly how many employees will eventually be hired to administer the program if it becomes law. Gordon estimated that it would be between 100 and 120.\nThe fiscal note for the legislation says the state will have to hire between four and eight additional staff — two principal attorneys, five staff attorneys, and one administrative assistant — at a cost of between $414,690 and $863,938 in fiscal year 2021.", "url": "https://apnews.com/8282cb14fd014f9eb3878e53d8b5f6b6"}