{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:18:13", "date_modify": "2020-05-04 20:18:13", "date_publish": "2019-04-01 20:40:46", "description": "Pricing your home can be challenging, even with a carefully prepared market analysis. Even with this, there is still a risk of pricing your home too high. The challenge comes from the fact...", "filename": "_f002a0742ed34091aed7f06443df3cf4_1588623493.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f002a0742ed34091aed7f06443df3cf4_1588623493.html", "title": "How do you know if you have priced your home correctly?", "title_page": "How do you know if you have priced your home correctly?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Pricing your home can be challenging, even with a carefully prepared market analysis. Even with this, there is still a risk of pricing your home too high.\nThe challenge comes from the fact that very few homes in our area are exactly alike. Recently sold similar homes are used in the analysis, but pricing is still subjective. This means that condition and location vary — even the size and amenities like central air or in-ground pool can vary.\nThese differences are taken into consideration and this creates a price differential either higher or lower than the recent sales. Your agent uses the analysis along with experience to suggest a range of values, but remember the true value is what a buyer and seller agree upon. Together, you decide on the list price after this information is reviewed.\nYou’ll know if your house is priced properly when you put it on the market. If it’s priced right, you will have a lot of showings, which will generate an offer or perhaps several offers. When you get several offers, you might even have offers over your list price. Buyers will see the value of a well-priced home in good condition. They will be willing to pay more.\nIf your house has been on the market for several weeks and you haven’t had any showings, this indicates that the price is too high. Maybe you have had a lot of showings and you haven’t had any offer yet. This is another measure that it’s priced too high. Buyers are hesitant to make an offer on an over priced listing as they worry about overpaying. Price it right and it will sell.\nTake the time to talk to your agent about pricing. You never want to have your house on the market for too long as buyers will think that there is something wrong with it. Overpricing it could make it “shopworn.” This drives down the price. It will not sell for as much money as it would have if you priced it right from the beginning. You will be money ahead if you price it competitively as quickly as possible.\nBetty Hensal,\nWilliam Pitt Sotheby’s\nInternational Realty,\n203-241-1560", "url": "https://apnews.com/f002a0742ed34091aed7f06443df3cf4"}