{"authors": ["Isaiah Delgado-Flores", "Generation Next"], "date_download": "2020-05-04 20:09:30", "date_modify": "2020-05-04 20:09:30", "date_publish": "2019-05-03 01:00:00", "description": "What a journey. For over 10 years, The Marvel Cinematic Universe has released movies about heroes we’ve all grown to love: Iron Man, Captain America, Thor and Black Panther, among others. Ever...", "filename": "_1e71061ed2894d0b9f9c7f50358c5999_1588622970.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1e71061ed2894d0b9f9c7f50358c5999_1588622970.html", "title": "‘Endgame’ packs an emotional punch for fans", "title_page": "‘Endgame’ packs an emotional punch for fans", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "What a journey. For over 10 years, The Marvel Cinematic Universe has released movies about heroes we’ve all grown to love: Iron Man, Captain America, Thor and Black Panther, among others. Ever since the end credits began to roll during last year’s Avengers: Infinity War, fans eagerly waited for the sequel, Avengers: Endgame, which was supposed to resolve the events of Infinity War and wrap up arcs for some of our favorite heroes.\nFirst things first: If you aren’t a fan of the the Marvel Cinematic Universe, this movie isn’t for you. It’s not gonna make any sense to you, and you will not be or grow attached to these characters. You likely will leave confused, wondering what all the hoopla is about.\nThe plot, in its simplest form, sees our Avengers once again trying to prevent the destruction of the universe by evil forces. While watching this movie, a quote that came to mind from Tony Stark (Iron Man) in Avengers (2012) helps sum it up:“If we can’t protect the Earth, you can be damn well sure we’ll avenge it.”\nNow, I am one of those fans who have been watching these characters since 2008’s Iron Man and, as one of those fans, I cried. I don’t usually cry during movies, but by the end, I was bawling. I legitimately had to hold back from making noise in the theater. No joke, I experienced the five stages of grief. That’s how much this movie will tug on a fan’s heartstrings. From the first seconds of the movie, a whirlwind of emotions punches you in the gut.\nBut the film has flaws, which I hate talking about because fans should still partake in the sacred ritual of seeing the movie. First, the comedy is very hit or miss. When it hits, it really hits, but for the most part, it misses. I kind of just wish they kept the comedy out all together because it takes away from the movie’s strengths at times. Also, this movie doesn’t have to be three hours long. There are lot of scenes when characters just stand around not doing anything, and it doesn’t feel as trim and to the point as its predecessor. Lastly, the dialogue is weak at times.\nHowever, it is a movie with guts. It has plot twists (which I won’t reveal), and though the movie dangles them in your face to let you know they are coming, you still aren’t ready when they hit you.\nAvengers: Endgame, rated PG-13, runs 3 hours and 1 minute long, and is currently playing at Regal Cinemas Santa Fe 14, Regal Santa Fe Place and Violet Crown Santa Fe.\nIsaiah Delgado-Flores is a junior at Pojoaque Valley High School. Contact him at bubbadukes2002@gmail.com.", "url": "https://apnews.com/1e71061ed2894d0b9f9c7f50358c5999"}