{"authors": ["Corey Mcmaken"], "date_download": "2020-05-04 20:19:05", "date_modify": "2020-05-04 20:19:05", "date_publish": "2019-05-23 05:00:01", "description": "International mural artist 1010 will add a piece to downtown Fort Wayne, beginning next week. Art This Way announced the project for the north wall of 918 S. Calhoun St. on Thursday. The...", "filename": "_656076f29a1c4e56987db49faba6bb68_1588623545.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_656076f29a1c4e56987db49faba6bb68_1588623545.html", "title": "International artist tapped for downtown mural", "title_page": "International artist tapped for downtown mural", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "International mural artist 1010 will add a piece to downtown Fort Wayne, beginning next week.\nArt This Way announced the project for the north wall of 918 S. Calhoun St. on Thursday. The artist will begin working on Thursday and the mural is expected to be complete by June 3.\nThe artist, whose name is pronounced “ten-ten,” is based in Hamburg, Germany, and has done work in Berlin, Paris, Madrid and Detroit. He is currently creating a mural in Los Angeles.\nArt This Way manager Alexandra Hall says 1010′s local project came together organically. She was speaking with Josef Zimmerman, curator of contemporary art at Fort Wayne Museum of Art, and mentioned she was looking for an artist that does 3D work. Zimmerman told her he knows 1010, whose work Hall had seen in Paris and Detroit, so Art This Way put out a feeler to see if the artist would be interested in creating a mural in the city.\nHaving work by an artist with an international reputation raises the bar for Art This Way and gives a boost to all the artists involved, Hall says.\nIt also shows the outside world and other international artists that Fort Wayne is a place that welcomes and supports high-caliber public art. Downtown also boasts two murals from well-known Philadelphia artist Yis “NoseGo” Goodwin, whose pieces were created outside the Art This Way program.\nThe wall on the side of Lebamoff Law Offices was chosen for 1010′s piece because it seemed like a good fit for the artist, Hall says. The building’s owner was one of the first to sign on for the program.\nThe muralist’s works have a realistic, three-dimensional effect creating the illusion of a hole in the building.\n“His entire concept is this hole that is kind of a portal into another place or into an abyss,” Hall says. Examples of his work can be seen on his Instagram page, @1010zzz.\nThe Art This Way program operates under the umbrella of the Fort Wayne Downtown Economic Improvement District and focuses on using art to activate pedestrian and vehicular alleys within the two blocks bordered by Harrison, South Calhoun and Berry streets and West Washington Boulevard.\nFour murals were created in the program by local artists last summer and 1010′s piece is one of at least two that will be added this year. Another is planned for the back of the City Center Garage, 840 S. Calhoun St., next to Caliente Cuban Cafe.\nHall says the Art This Way jury will meet at the end of May to look at 42 proposals for the space. The majority of the submissions are from artists outside the city, with many from outside the state and several from abroad.\n“It’s a really good mix of artists, and I’m really excited to see what the jury decides,” she says.\nThere are tentative plans for a third space this year, but that may be moved to next year.\nArt This Way has set its third Art Crawl fundraiser for 5 to 9 p.m. Sept. 20 downtown. Tickets go on sale in July.\nFor now, Hall says she is crossing her fingers that the weather is good for 1010′s time in the city. She says he works fast and believes he will be able to complete the piece in two days if the weather stays clear.\nThe public is welcome to watch the installation. The alley will have temporary closures during the process.\ncmcmaken@jg.net", "url": "https://apnews.com/656076f29a1c4e56987db49faba6bb68"}