{"authors": ["Dr. Zorba Paster", "Family Physician"], "date_download": "2020-05-04 20:21:15", "date_modify": "2020-05-04 20:21:15", "date_publish": "2019-02-15 11:10:00", "description": "Dear Doc: My spouse uses pot every day and has been for about 20 years. He’s gotten to the point where he doesn’t want to go out of the house much, isn’t interested in socializing with friends and...", "filename": "_34bbbc359bfb4508b342ad88e8850cca_1588623675.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_34bbbc359bfb4508b342ad88e8850cca_1588623675.html", "title": "Dr. Zorba Paster: Pot can be addictive", "title_page": "Dr. Zorba Paster: Pot can be addictive", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dear Doc: My spouse uses pot every day and has been for about 20 years. He’s gotten to the point where he doesn’t want to go out of the house much, isn’t interested in socializing with friends and all that. I use pot occasionally but not every day. I tell him he should stop but he says he can’t. What’s the dope on this? — J.B.\nDear J.B.: Like alcohol, like opioids, pot can foster dependence. It’s called Cannabis Use Disorder. It’s characterized by high daily pot use because of the body’s ability to develop tolerance. The more you smoke, the more the cannabis receptors down-regulate — requiring more and more.\nStudies have shown this tolerance reduces the body’s sensitivity to dopamine, a natural chemical that makes us feel good when we do fun stuff. Hence, he doesn’t find the usual reward in normally pleasurable activities.\nThe problem here is that withdrawal symptoms occur in half the patients who try to stop using pot. They include anxiety, irritability, depression and restlessness. The person often has difficulty sleeping. They lose their appetite and just feel lousy. All this goes on for a week or two. It’s not as severe as opioid withdrawal at all but not fun, either.\nThere is no good drug to reduce these symptoms. There was a recent study in the journal Lancet Psychiatry looking at a new experimental drug that appears to help with withdrawal, but that’s years away from being on the market.\nMy best advice is to talk to him about reducing his use — and go to his primary care practitioner to get some meds for sleeping. That might help him to cut down or even give it up entirely. This is just like alcoholism — a complex dependence that has no quick, easy answers.\nNow, on to breastfeeding. As many of you know, the goal is to breastfeed an infant for one year. That’s not easy for many moms to do, as they often have to go to work and are in workplaces that are not breastfeeding-friendly.\nIf moms supplement with formula that is cow’s milk-based, many babies develop a so-called cow’s milk allergy and require going to a more expensive formula. How real is this allergy? An article in the British Medical Journal throws some light on the $50-billion-a-year formula industry.\nTheir investigation suggests this allergy may be a “Trojan horse” to encourage health care providers to recommend these expensive alternative formulas. In the UK, where researchers observed this, they found that many prominent people — those who develop guidelines on infant feeding — were receiving lots of funding, speaking fees, etc., from the formula industry.\nThey concluded there is an “industry-driven overdiagnosis” of this so-called allergy. Between 2006 and 2016, there was a 500 percent increase in prescriptions for special formula.\nThe World Health Organization stepped in when they recommended restricting companies from sponsoring educational events that promoted formula of any sort, rather than breast milk.\nIn 1991, the WHO launched the Baby Friendly Hospital initiative (BFHI), a global program to encourage breastfeeding and discourage the inappropriate use of “breast milk substitutes,” i.e., formula. In 2007, less than 3 percent of hospitals met the BFHI guidelines. Today, 25 percent of women deliver in hospitals that are “Baby Friendly.”\nMy spin: What happens in the UK probably happens here, too. This is where a good relationship with your baby’s doctor counts a lot.\nBut it shouldn’t be passive. If you get a recommendation for a special formula, you should ask why. How are they sure this is the right one? Question, question, question. Stay well.", "url": "https://apnews.com/34bbbc359bfb4508b342ad88e8850cca"}