{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:05:44", "date_modify": "2020-05-04 20:05:44", "date_publish": "2019-04-12 00:52:00", "description": "Wow! I take back what I said about February and March! The flooding caused so much destruction to our community and state, but it also shows why the Midwest is the best. The outpouring of...", "filename": "_70f7d6b4bcb349bcbc5628cd006da682_1588622744.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_70f7d6b4bcb349bcbc5628cd006da682_1588622744.html", "title": "A busy month for KCB", "title_page": "A busy month for KCB", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Wow! I take back what I said about February and March!\nThe flooding caused so much destruction to our community and state, but it also shows why the Midwest is the best. The outpouring of kindness and support we have for one another is astounding. I am so proud of our community and blessed to be a part of it.\nIt’s finally April! During this time we will celebrate Earth Day but we like to go big around here so we are celebrating Earth Month! We have already started cleanup efforts all around the community with several more planned. The “Island” was recently trimmed and mulched to get ready for spring. I had the help from Scotus Central Catholic High School teachers to do this project. They were so helpful and we finished in record time! I may have to see if they are available next year.\nKeep Columbus Beautiful is presenting to several service groups and organizations this month as a refresher of the programs we offer and what’s coming up in the future. We also partnered with Central Community College, Nebraska Conservation and the UNL Extension Office for an upcoming Recycled Art contest open to area students. The open house for these recycled art pieces will be held on April 17 at Central Community College starting at 5 p.m. It’s open to the public, so feel free to come and check out some amazing art.\nColumbus will also be hosting the Regional Directors Meeting for Keep Nebraska Beautiful on the 19th of this month. During this meeting, other affiliate leaders will come and learn about each other’s programs, concerns, and successes. We also are receiving our supplies to prepare for the Great American Cleanup which takes place all over the state in the summer and fall months. These supplies are generously donated by the National Sponsors of Keep America Beautiful.\nTo celebrate Earth Day (April 22) we are working with the National Honor Society students at Columbus High to help spruce up the pollinator garden near the high school pond. And last but not least there is a Medication Take Back event where you can safely dispose of old medications on April 27th at Hy-Vee.\nFor any questions about upcoming events please give us a call at 402-563-9223.\nVanessa Oceguera is the executive director of Keep Columbus Beautiful. Her column is published in The Columbus Telegram every second Friday of the month.", "url": "https://apnews.com/70f7d6b4bcb349bcbc5628cd006da682"}