{"authors": ["David Broder", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Michal Rozworski", "Ronan Burtenshaw"], "date_download": "2020-05-04 19:55:41", "date_modify": "2020-05-04 19:55:41", "date_publish": "2019-12-16 00:00:00", "description": null, "filename": "2019_12_labour-party-uk-brexit-jeremy-corbyn-general-election_1588622141.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/12/16110224/GettyImages-1176126401.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_12_labour-party-uk-brexit-jeremy-corbyn-general-election_1588622141.html", "title": "Labour’s Brexit Stance Defeated Corbynism Months Ago", "title_page": "Labour’s Brexit Stance Defeated Corbynism Months Ago", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Most Labour supporters will have felt the same after Thursday’s result. Sorrow for our loss and fear for what the Tories will do is mixed with exhaustion at the continued media attacks on us; only Jeremy Corbyn’s most rabid opponents took to Twitter the minute after the exit poll to break a “silence” they had never actually respected. Picking through the ruins, or even blaming one another, appears rather unseemly, especially if we’re going to stand together over years to come. But with the battle to set up stalls for the coming leadership race already raging, we can hardly stay silent as Corbyn’s loudest critics disown their responsibilities. Clearly, some factors for defeat were also external — from the intense tabloid demonization of Corbyn to Boris Johnson’s own skill in posing as an “insurgent.” As accounts from the doorsteps have highlighted, the sheer scope of our manifesto also meant a lack of succinctness. A desperately needed agenda like the Green Industrial Revolution sounded too much like an abstract plan for the future rather than something immediate and concrete on the local level. It is easy to say, like aspirant leadership candidate Lisa Nandy, that Labour needs to “reconnect” with working-class voters. Thousands of us condemned as fanatical Momentum “cultists” were at least out on the streets, all over Britain, speaking to voters on their own doorsteps these last weeks. What this could not make up for was the lack of a party rooted in everyday life, in working-class experience, not least in areas where unreformed Labour councils do little to change people’s lives. But there was one issue that especially glued together the different feelings of alienation about Labour — our stance on Brexit, or, more precisely, the changes it underwent since 2017. This was most evidently, but not only, a problem in areas that voted Leave in 2016, accounting for almost all of the seats we lost in England and Wales. From Bolsover to Workington and Durham North West, large parts of our 2017 base either didn’t turn out or turned to the Brexit Party — ensuring a thumping Tory majority. The last thing we should do is recognize these areas as “lost.” Labour’s roots in ex-mining and postindustrial areas have thinned out for decades, especially in small towns where the weakening of social solidarity is most keenly felt. Yet as the 2015 and 2017 elections showed — with the loss of support to UKIP, followed by recovery of many of these same voters — perhaps the effect is more volatility than a permanent break. In 2019, we had to re-earn confidence of voters disillusioned with the political process; something our call for a second Brexit referendum clearly undermined. On this issue, the very people who damned Momentum as ideological and narrow imposed their own minoritarian, factional agenda on Labour, a kind of soft coup within the party. A failure even at the level of electoral opportunism, the call for a fresh referendum weakened Corbynism’s transformative promise and ability to reach out to the disillusioned and non-voters. If one of Corbyn’s key advantages, faced with the constant information war, was his image of intransigent principle, the series of changes in our Brexit stance — from acceptance of the 2016 referendum result to “constructive ambiguity” and then a slide toward a second referendum call — instead looked like a return to the “triangulation” and focus-group-led opportunism of decades past. In the first televised debate with Boris Johnson on November 22, Corbyn tried to answer accusations that he had no position on Brexit by claiming he would be a neutral “honest broker” in any future referendum. Yet despite his admirable efforts to defend the integrity of his personal position, no one could doubt that the call for a re-vote was itself motivated by Remainers’ pressure and that Corbyn had been forced to cave to their will. In the 2017 campaign, insisting that Labour would uphold the Brexit vote, Corbyn neutralized the issue of Brexit and forced Remainers to choose Labour or Tory. By December 2019, the call for a second referendum had effectively neutralized him.\nListening Without Hearing For evidence of the undermining of Corbynism, we need only look at those who most angrily insisted that Corbyn should embrace a “People’s Vote.” These latter have been quick to disown responsibility for the result, instead smearing the architects of the far more successful 2017 campaign and speculating that we should have sought to rally all Remainers of whatever other politics. Former journalist Paul Mason has been especially avid in this regard, dismissing Corbynism as “over” while calling for a leader able to unite the center and the Left. Mason’s own obsession with Remain has become a short circuit to a whole slew of liberal-centrist positions, from Russophobia and support for nuclear weapons to a retreat from Corbyn-style economic radicalism. Such a turn is not particularly surprising, by Mason as by left-wing second-referendum initiatives like the Trotskyist-run “Another Europe Is Possible” campaign. Since 2016, such forces’ call for “Remain and Reform” has been simply deaf to anything but the need to unite pro-European opinion, neither detailing how exactly they plan to reform the European Union or engaging with the reasons why so many working people voted Leave. Rather, their campaigns consistently reified identification with the EU itself. They take any fellow Remainer as an ally, while counting anyone in favor of honoring the referendum as an enemy — no matter their stance on economic issues or even immigration. Throughout their efforts, the alphabet soup of liberal, Blairite, and far-left groups fighting to overturn the 2016 referendum have claimed to acknowledge that “people are angry” while also insisting that “no one voted to make themselves poorer.” But when allied to catastrophist predictions of the effect of Brexit, this amounted to the argument that Brexit should not happen — because the people who voted for it did not really want or understand its consequences. Second-referendum campaigners spoke of “listening” while monomaniacally pursuing the Remain vote that they were determined — and in many cases paid — to work toward. It is, indeed, true that some political actions have unintended consequences and that one may vote or campaign only to help produce a result one sought to avoid. No doubt, many people who campaigned for a second referendum after 2016 were animated by real concerns about what Brexit means for migrants or saw their activity as a way of resisting the rise of the far right. But the People’s Vote campaign was above all defined by its central, organizing networks, almost entirely based on liberals and Labour right-wingers who had since 2015 set out to destroy Jeremy Corbyn. Media outriders recognized that their only path to a second referendum lay in pressuring the Labour Party to take up their cause — and shot down whoever stood in the way. Whereas the soft-Brexit position outlined by Corbyn after 2016 continued to draw the implacable hostility of Leave figures like Arron Banks and Nigel Farage — and, indeed, stood far from a transformational “Lexit” advocated by some on the far left — “Another Europe Is Possible” instead remained closely aligned with the wealthier and deeper-rooted liberal-Blairite forces. Funded from the same sources (to the tune of around £310,000 from June 2018 to June 2019), its core strategy was in fact to unite all Remainers, as shown by its lead figures’ turn toward calls for tactical voting for Liberal Democrats, even in by-elections that preceded last Thursday’s contest. The fact that around two-thirds of Labour MPs were Remainers who represented Leave-voting seats (a majority of whose Labour voters did not themselves vote Leave) did without doubt create a real dilemma for the Labour leadership, at least from the perspective of inner-party tactics. With Corbyn and his allies constantly under attack from most Labour MPs, the idea of “unity” — empowered by the positive experience of the 2017 election campaign — was keenly taken up by figures like shadow chancellor John McDonnell. The dilemma began to sharpen in the first months of 2019 as the question of the withdrawal agreement with the European Union came more fully into focus. This, however, especially owed to an incipient leadership challenge within the Tory Party, whose hard-right flank exploited Theresa May’s weakness to vote down her Brexit deal. The resistance of hard-line Brexiteers close to Johnson fed a sense of impasse and chaos — encouraging many in Labour who had previously accepted the result to consider it could be stopped entirely. The groundwork had, unfortunately, already been laid at the party’s September 2018 conference, which accepted a vague formulation prioritizing an election and, secondarily, a public vote on the Brexit deal. Itself the result of union pushback in compositing — in the attempt to thwart a more full-throated Remain position — this compromise nonetheless encouraged second referendum campaigners to push for more. While the left-wing Remainers whipped up activists’ fears around Brexit, their Blairite counterparts wielded the threat of a split in the parliamentary party. With Corbyn reluctant to embrace a second referendum, and Theresa May’s leadership in disarray, some centrists became increasingly confident in their prospects of redrawing the political map. In February 2019, a handful of Labour MPs split away to form an Independent Group in Parliament, promising that dozens more would follow them. As panic spread — and was deliberately spread, by figures like Labour’s pro-Remain deputy leader Tom Watson — it began to seem that Labour’s call for a second referendum was now inevitable, the delay only a matter of appearances. Perhaps, then, the problem was that Labour ought to have changed its position earlier — more forcefully bidding to unite the pro-Remain vote? Doubtless the fence-sitting of spring 2019 aggravated existing criticisms of Corbyn’s weakness. Yet the abject failure of the Independent Group/Change UK as well as the Liberal Democrats to build up a base of activists or indeed support in this election shows just how far the Uber-Remainers relied on pulling the Labour Party machine (and its funds and activists) behind them. Telling in the buildup to the December 12 election was the Liberal Democrats’ emphasis on their success in the European election, historically taken far less seriously than national contests. They came second to the Brexit Party, defeating Labour — yet their 3.3 million votes, just 8 percent of the electorate, represented nothing but a minority obsessed by European identity.", "url": "https://www.jacobinmag.com/2019/12/labour-party-uk-brexit-jeremy-corbyn-general-election"}