{"authors": ["Carmine Frongillo", "Cfrongillo Lowellsun.Com"], "date_download": "2020-05-04 20:25:19", "date_modify": "2020-05-04 20:25:19", "date_publish": "2019-03-24 11:01:57", "description": "LOWELL -- Courtney Cashman possesses a seemingly bottomless reservoir of athletic talent. At Governor's Academy in Byfield, Cashman excelled in softball, basketball and volleyball, earning...", "filename": "_791aad5c11e048279136941f41c2bcb3_1588623919.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_791aad5c11e048279136941f41c2bcb3_1588623919.html", "title": "UML's Cashman a Gem on the Diamond", "title_page": "UML's Cashman a Gem on the Diamond", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOWELL -- Courtney Cashman possesses a seemingly bottomless reservoir of athletic talent.\nAt Governor’s Academy in Byfield, Cashman excelled in softball, basketball and volleyball, earning Independent School League all-star honors in each sport multiple times.\nBut it was on the diamond where this Danvers native’s vast array of skills shined brightest. A slick shortstop with a big bat, Cashman quickly got into the swing of things as a freshman on the UMass Lowell softball team, leading all hitters in the America East Conference with a .430 average in 2017.\nThe numbers this hard-hitting junior produces at the plate have grown in accordance with her experience. Cashman has had an amazing start to the 2019 campaign. Heading into the weekend, Cashman, 20, a righty batter, was leading NCAA Division 1 softball nationally in batting average (.582, 39-for-67) and on-base-percentage (.633), while ranking third in slugging-percentage (1.075).\n“This is the best start to a season I’ve ever had in my whole life,” said Cashman. “I can’t wait to get up to the plate and hit. I’m excited for all of our games anyway. But it gives me that extra incentive. It’s game day and I’m ready to go.”\nAgainst Yale on Tuesday, Cashman went 7-for-7 during a double-header sweep with a grand slam, two doubles and five RBI. In 22 games this season, Cashman has seven home runs, 10 doubles, one triple and 21 RBI.\n“It’s kind of a crazy feeling (to be hitting this well),” said Cashman. “In the past, I’ve put pressure on myself. But this year I’ve read a bunch of mental toughness books. I’ve learned to be confident in myself. That’s something I haven’t done. And I’ve learned how to play freely. Now when I make a mistake, I bounce back quicker than I used to.”\nCashman finished with seven homers, 11 doubles, two triples and a .696 slugging-percentage as a freshman. In 2018, she batted .345 (51-for-148) with five homers, 18 doubles and 18 RBI. This spring the two-time America East first-team all-conference selection has located her launch angle and is sending balls flying into the gaps and over the fence.\n“I feel like this year she has been different than previous years,” said UMass Lowell coach Danielle Henderson. “I feel like she’s been more poised and composed. She looks confident up there and she’s able to see more pitches.\n“She just has this great hand-eye coordination. Sometimes her swing may not look pretty, but she’ll take an inside pitch and put it over the right field fence. She’ll be out on her front foot, and hit a change-up over the fence. This year she’s just hitting the ball harder.”\nAnd this exit speed has the balls Cashman hits leaving the yard in a hurry.\n“I’d say I’m more of a gap hitter than a home run hitter,” said Cashman. “I always hit to the right side. I never pull the ball. My coach calls the gap between center and right field Cashman Alley. I get a lot of pitches away. I’ve been able to make good contact and drive the ball the opposite way.”\nRight now, there can’t be a more menacing a sight for an opposing pitcher than that of Cashman stepping into the batter’s box.\n“By this point teams have seen her average,” said Henderson. “They’ve seen how well she’s hitting. Why would anyone pitch to her? It might just be the teams we’ve played don’t know her and they assume they can get her out. That might change once we get into conference. The teams in conference know what type of hitter she is.”\nCashman is a fixture in the infield with her solid glove work at shortstop.\n“This year I feel it’s been the best we’ve seen her (in the field),” said Henderson. “She gets to more balls than people realize. She doesn’t look like she’s fast, but she’s one of the fast players on our team. She gets to balls in the hole and has a strong enough arm to get the outs.”\nGrowing up, Cashman competed in sports in the back yard with her brothers, a couple of whom went on to play college baseball. The support she received from her family, especially her parents, Jeannie and John, helped in her development as a student-athlete.\n“It’s been an experience,” said Cashman, a criminal justice major. “I went into freshman year without any pressure on myself and I think that’s why I did so well. Last year, I kind of put pressure on myself. This year I’ve learned to how to play free and be confident in myself.”\nFollow Carmine Frongillo on Twitter @cwfrongi", "url": "https://apnews.com/791aad5c11e048279136941f41c2bcb3"}