{"authors": ["Liza Featherstone", "Mike Davis", "Peter Frase", "Seth Ackerman", "Meagan Day", "Barry Eidlin", "Ben Beckett", "Roseann Demoro"], "date_download": "2020-05-04 19:52:54", "date_modify": "2020-05-04 19:52:54", "date_publish": "2019-08-23 00:00:00", "description": null, "filename": "2019_08_bernie-sanders-unions-labor-plan-2020-presidential-campaign_1588621974.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/08/23110408/GettyImages-1160684459.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_08_bernie-sanders-unions-labor-plan-2020-presidential-campaign_1588621974.html", "title": "After Releasing His Incredibly Strong Labor Plan, Will Unions Back Bernie Now?", "title_page": "After Releasing His Incredibly Strong Labor Plan, Will Unions Back Bernie Now?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Bernie Sanders just unveiled the most pro-union platform of any major presidential candidate in decades. At this point, any union that ends up endorsing one of his opponents in the primary over him would be enacting a straight-up Mad Tea Party scenario, as if a coalition of endangered species — say, the giant kangaroo rat, the red wolf, and the fruit bat — were to endorse Trump, who has been steadily weakening protections for such animals.\nCiting the high correlation between declining union membership and rising inequality, as well as the impact on worker safety, healthcare, and retirement security, the Sanders campaign has outlined a clear and specific way to stop the bloodletting of the American labor movement by making it much easier for workers to join unions — and by vastly increasing unions’ negotiating power.\nAt present, as you know if you’ve tried to unionize your workplace, getting a majority of workers to sign cards saying they want to join the union is usually just the beginning. That majority ought to carry the day right off the bat since democracy is about majorities, right? But it doesn’t. After the cards are collected an “election” is scheduled, before which the employer may run an intimidating and often mendacious campaign against you and your pro-union co-workers. As the Sanders campaign noted, when workers try to join unions, 75 percent of employers hire outside consultants to run aggressive anti-union campaigns, and 54 percent threaten workers in closed-door anti-union meetings. Workers who try to organize their workplaces have a one in five chance of getting fired.\nBernie has (forgive me) a plan for that. He would allow the National Labor Relations Board (NLRB) to certify a union after the majority of workers sign cards.\nIn the current anti-worker legal hellscape in which most Americans labor, even after employees have risked firings and endured all the intimidation and threats and successfully unionized their workplace, their boss can still refuse to bargain with them. More than half of workers who vote to form unions lack a union contract after a year, while 37 percent don’t have that first contract even after two years. Bernie’s plan would require employers to begin negotiating within ten days of receiving a request from a new union. Failure to reach a contract would force compulsory mediation, then binding arbitration. Employers who resist the process would face steep penalties.\nBernie’s plan would also eliminate state-level right-to-work laws, give federal workers the right to strike, and eliminate “at-will” firing. It would also make it possible for the labor movement to establish collective bargaining agreements that cover entire industries, as they do in many European countries. Each of these measures would vastly increase the power of workers and their institutions.\nWorkplaces wouldn’t magically unionize as a result of Bernie’s plan. People would still have to do a lot of organizing and persuasion. But it would be a much fairer fight, with far greater reward. If workers had a chance of fighting for their share of their own productivity on the job, it would change our whole society — even more than free college or Medicare for All (but why choose). The employer class grasps that and would probably fight this harder than anything else Bernie is proposing to do. It will be a class war, but one that the labor movement has to fight and win.\nLet’s hope union leaders grasp the significance of Bernie’s campaign more fully in 2020 than in 2016. While the Communications Workers of America allowed a membership vote to decide their primary endorsement and became the largest union to back Bernie, SEIU and AFT leadership went with Hillary early on, and met with intense member backlash. (As a dues-paying UAW member, I’m dismayed to report that my union did endorse Clinton over Sanders, though I’m somewhat proud that they at least waited till late May, when most of the primaries were over.) This time around, they’re being more cautious, as well as more transparent about their decision-making process, though some union leaders have batted their eyelashes at Kamala Harris behind closed doors, and Joe Biden has been getting handsy with a few. With Bernie’s labor vision so much stronger and more ambitious, the member backlash could be even fiercer.\nSEIU, one of those unions that failed to endorse Bernie last time around, unveiled its own labor demands for the candidates on the very same day that Bernie’s labor platform was released. As Helaine Olen reported on Tuesday in the Washington Post (having obtained an advance copy of a speech announcing the demands, which SEIU president Mary Kay Henry then delivered on Wednesday in Milwaukee), SEIU is demanding that candidates support a complete overhaul of federal labor laws, including sectoral bargaining. That last point rarely, if ever, comes up in presidential campaigns, which is why it was so impressive to see it in Bernie’s platform. Now, SEIU is a practitioner of business unionism; you might remember that they opposed a grassroots movement to stop one of the world’s most anti-union companies from reaping enormous taxpayer subsidies in New York City. But surely, you might ask, the service workers’ union must end up supporting the only candidate whose agenda is exactly the same as theirs, right?\nIt’s a naïve question, unfortunately. Unions are capable of acting in terribly self-defeating ways. But this time, if they fail to support Bernie, they’ll be rejecting the only candidate with a plan to save them.", "url": "https://www.jacobinmag.com/2019/08/bernie-sanders-unions-labor-plan-2020-presidential-campaign"}