{"authors": ["Jim Shay"], "date_download": "2020-05-04 20:31:44", "date_modify": "2020-05-04 20:31:44", "date_publish": "2019-05-08 10:28:15", "description": "A citizen of Mexico, who illegally entered the United States three times, will be staying here for a few more years. In jail. Fabiola Bastian Mojica, 38, who lived in Stamford, pleaded...", "filename": "_52b6108efb3b4df29b20dec4838ce0f9_1588624304.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_52b6108efb3b4df29b20dec4838ce0f9_1588624304.html", "title": "Woman, who illegally entered US 3 times, gets to stay ... in jail", "title_page": "Woman, who illegally entered US 3 times, gets to stay ... in jail", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Woman, who illegally entered US 3 times, gets to stay ... in jail\nA citizen of Mexico, who illegally entered the United States three times, will be staying here for a few more years.\nIn jail.\nFabiola Bastian Mojica, 38, who lived in Stamford, pleaded guilty Tuesday in Hartford federal court to reentry of a removed alien.\nJohn H. Durham, U.S. Attorney for Connecticut, said it is Bastian Mojica’s third conviction for illegal reentry.\nNow, she faces 10 years behind bars in the U.S.A. when she is sentenced by U.S. District Judge Robert N. Chatigny on July 17.\nAccording to court documents, in May 2003, Bastian Mojica, who at the time was a lawful permanent resident of the U.S., was convicted in Stamford Superior Court of possession of a hallucinogen and marijuana. Bastian Mojica’s lawful permanent residence status was revoked. In November 2003, she was removed to Mexico.\nIn October 2005, Bastian Mojica was arrested by Greenwich police and was subsequently convicted in state court of evading responsibility resulting in injury/property damage and possession of marijuana. She was also charged and convicted in federal court of reentry of a removed alien. In January 2008, Bastian Mojica was removed to Mexico\nIn July 2008, Bastian Mojica was arrested in Stamford.\nAnd again, she was again removed to Mexico in August 2008.\nIn January 2010, Bastian Mojica was apprehended by the U.S. Border Patrol in Columbus, New Mexico. She was subsequently charged in the District of New Mexico with illegal reentry of a removed alien, and with violating the conditions of her supervised release related to her prior conviction for illegal reentry.\nShe was convicted of both offenses and, following the completion of her sentence, was sent back to Mexico in April 2011.\nOn Oct. 23, 2018, Bastian Mojica was arrested by Stamford police for a motor-vehicle violation, and was subsequently charged with failure to appear.\nOn March 7, after her identity was confirmed through a fingerprint analysis, she was arrested on a federal criminal complaint charging her with illegal reentry. She has been detained since her federal arrest.\nBastian Mojica is scheduled to be sentenced by U.S. District Judge Robert N. Chatigny on July 17, at which time she faces a maximum term of imprisonment of 10 years.", "url": "https://apnews.com/52b6108efb3b4df29b20dec4838ce0f9"}