{"authors": ["Conor Foley", "Staff Writer"], "date_download": "2020-05-04 20:31:39", "date_modify": "2020-05-04 20:31:39", "date_publish": "2019-05-22 00:00:00", "description": "SWB RAILRIDERS GAME REPORT Pawtucket 11, RailRiders 8 Pawtucket RailRiders ab r h bi ab r h bi Miller 3b-ss 5 1 2 1 Ford dh 3 2 0 0 Holt ss 5 1 1 1 Valera 3b 3 1 3 2 Witte 3b 0 0 0 0 Tauchman cf 3...", "filename": "_e2c2594b74ee4a999220d5956e5e9704_1588624299.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e2c2594b74ee4a999220d5956e5e9704_1588624299.html", "title": "Game Report: RailRiders Vs. Pawtucket", "title_page": "Game Report: RailRiders Vs. Pawtucket", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SWB RAILRIDERS GAME REPORT Pawtucket 11, RailRiders 8 Pawtucket RailRiders ab r h bi ab r h bi Miller 3b-ss 5 1 2 1 Ford dh 3 2 0 0 Holt ss 5 1 1 1 Valera 3b 3 1 3 2 Witte 3b 0 0 0 0 Tauchman cf 3 0 1 2 Pedroia 2b 5 0 1 0 Higashioka c 5 0 0 0 De La Guerra 2b 0 0 0 0 Wade ss 4 1 1 0 Travis 2b 4 1 0 0 Amburgey rf 5 1 1 0 Castillo rf 4 0 1 1 Morrison 1b 5 2 3 3 Ockimey 1b 5 2 2 1 McBroom lf 5 0 1 1 MHernandez dh 5 3 4 1 Miller 2b 4 1 1 0 GHernandez cf 5 2 1 1 Centeno c 5 1 3 3 Totals 43 11 15 9 Totals 37 8 11 8 Pawtucket 602 010 002 — 11 RailRiders 012 210 101 — 8 LOB: Pawtucket 11, RailRiders 9. 2B: Holt (2), Centeno (3); Tauchman (2), McBroom (11), Valera (3), Morrison (3). HR: G. Hernandez (3), Ockimey (12), M. Hernandez (1); Morrison 2 (2), Valera (3). SB: Holt (1), M. Hernandez (1); Tauchman (3), Wade (2). CS: Castillo (3). SF: Castillo. E: Amburgey (1, throw), Valera (1, throw), Miller 2 (2, fielding, fielding). Pawtucket IP H R ER BB SO Shawaryn 3.2 4 5 5 7 4 Bleich (W, 2-1) 1.1 2 1 1 0 3 Runzler (H, 2) 1 1 0 0 0 0 Taylor (H, 4) 2 2 1 1 0 4 Mejia 1 2 1 1 0 0 RailRiders IP H R ER BB SO Hutchison (L, 3-3) 4 8 8 3 2 2 Coulombe 2 3 1 1 0 4 Feyereisen 2 1 0 0 1 3 Coshow .2 3 2 2 1 2 Sosebee .1 0 0 0 1 1 Umpires: HP: Additon, 1B: Beck, 2B: Carnahan, 3B: Grassa. A: 5,468. T: 3:49. How they scored Pawtucket first: Hutchison pitching. Miller singled. Holt doubled, Miller scored. Pedroia flied out. Travis walked. With Castillo batting, Holt stole third base. Castillo hit a sacrifice fly, Holt scored. Ockimey singled, Travis to second. M. Hernandez singled, Travis to third, Ockimey to second. G. Hernandez reached on an error by 2B Miller, Travis scored, Ockimey to third, M. Hernandez to second. Centeno singled, Ockimey scored, M. Hernandez scored, G. Hernandez to third, throwing error by RF Amburgey, G. Hernandez scored, Centeno to second. Pawtucket 6, RailRiders 0. RailRiders second: Shawaryn pitching. Wade struck out. Amburgey flied out. Morrison homered. Pawtucket 6, RailRiders 1. Pawtucket third: Castillo grounded out. Ockimey homered. M. Hernandez singled. G. Hernandez reached on a fielding error by 2B Miller. Centeno singled, M. Hernandez scored, G. Hernandez to second. Pawtucket 8, RailRiders 1. RailRiders third: Miller struck out. Ford walked. Valera homered, Ford scored. Pawtucket 8, RailRiders 3. RailRiders fourth: Morrison lined out. McBroom struck out. Miller singled. Ford walked, Miller to second. Valera walked, Miller to third, Ford to second. Tauchman doubled, Miller scored, Ford scored, Valera to third. Pawtucket 8, RailRiders 5. Pawtucket fifth: Coulombe pitching. M. Hernandez struck out. G. Hernandez homered. Pawtucket 9, RailRiders 5. RailRiders fifth: Bleich pitching. Wade singled. Amburgey struck out. Morrison struck out. With McBroom batting, Wade stole second. McBroom doubled, Wade scored. Pawtucket 9, RailRiders 6. RailRiders seventh: Taylor pitching. Wade struck out. Amburgey struck out. Morrison homered. Pawtucket 9, RailRiders 7. Pawtucket ninth: Coshow pitching. Ockimey struck out. M. Hernandez homered. G. Hernandez struck out. Centeno doubled. Miller singled, Centeno scored. Pawtucket 11, RailRiders 7. RailRiders ninth: Mejia pitching. Higashioka flied out. Wade grounded out. Amburgey singled. Morrison doubled, Amburgey scored. Pawtucket 11, RailRiders 8. Today’s game RailRiders (21-19) vs. Pawtucket (16-25), PNC Field, 6:35 p.m. Probable pitchers: RailRiders RHP Raynel Espinal (1-4, 6.49) vs. Pawtucket LHP Matthew Kent (0-1, 9.72) Off the rails ■ IF Cliff Pennington is on the injured list with a hamstring injury, RailRiders manager Jay Bell said. ■ Former New York Mets closer Jenrry Mejia pitched the ninth inning for Pawtucket and allowed one run on two hits. — CONOR FOLEY International League North W L Pct. GB Syracuse (Mets) 24 19 .558 — Lehigh Valley (Phillies) 22 19 .537 1 RailRiders (Yankees) 21 19 .525 1.5 Buffalo (Blue Jays) 17 23 .425 5.5 Pawtucket (Red Sox) 16 25 .390 7 Rochester (Twins) 15 25 .375 7.5 South W L Pct. GB Durham (Rays) 26 17 .605 — Gwinnett (Braves) 26 18 .591 .5 Charlotte (White Sox) 24 18 .571 1.5 Norfolk (Orioles) 20 22 .476 5.5 West W L Pct. GB Columbus (Indians) 25 17 .595 — Indianapolis (Pirates) 23 18 .561 1.5 Louisville (Reds) 18 26 .409 8 Toledo (Tigers) 15 26 .366 9.5 Tuesday’s Games Durham 4, Norfolk 3 Pawtucket 11, RailRiders 8 Indianapolis 4, Louisville 3 Charlotte 2, Gwinnett 1 Buffalo 5, Rochester 0 Lehigh Valley 9, Syracuse 3 Today’s Games Indianapolis at Louisville, 11 a.m. Durham at Norfolk, 6:35 p.m. Pawtucket at RailRiders , 6:35 p.m. Toledo at Columbus, 6:35 p.m. Buffalo at Rochester, 7:05 p.m. Syracuse at Lehigh Valley, 7:05 p.m. Thursday’s Games Pawtucket at RailRiders , 10:35 a.m. Buffalo at Rochester, 11:05 a.m. Durham at Norfolk, 12:05 p.m. Indianapolis at Louisville, 7 p.m. Charlotte at Gwinnett, 7:05 p.m. Syracuse at Lehigh Valley, 7:05 p.m.", "url": "https://apnews.com/e2c2594b74ee4a999220d5956e5e9704"}