{"authors": ["Rosa Salter Rodriguez"], "date_download": "2020-05-04 20:13:37", "date_modify": "2020-05-04 20:13:37", "date_publish": "2019-05-01 05:00:01", "description": "Neighborhood opposition has developed concerning a proposal to rezone 2.5  acres of land along Coldwater Road on Fort Wayne's north side for an office park. The proposal by Sycamore Pointe...", "filename": "_10d5fe360dc94ee3945db93e05c5df76_1588623217.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_10d5fe360dc94ee3945db93e05c5df76_1588623217.html", "title": "Office park plan sees opposition", "title_page": "Office park plan sees opposition", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Neighborhood opposition has developed concerning a proposal to rezone 2.5 acres of land along Coldwater Road on Fort Wayne’s north side for an office park.\nThe proposal by Sycamore Pointe Holdings LLC, Fort Wayne, is to build two multi-unit office buildings at 11305 Coldwater, on the west side of Coldwater between Badiac Road and Marcelle Drive in Perry Township.\nTo accommodate the project, the land must be rezoned from agriculture/low-density residential to professional offices and personal services, the most restrictive commercial classification.\nNeighbor Linda Galloway said residents are concerned about increased traffic, saying the location is near a day care center and close to roads that serve as egress from residential developments.\nShe said residents already have difficulty exiting and entering their neighborhoods from already congested Coldwater Road.\nSome residents also have expressed concern that the proposed development backs up to wetlands and that “stacking” two 114,000-square-foot buildings has not been done in the immediate area.\nState corporations records show the registered agent for Sycamore Pointe is Neil A. Schroeder, Fort Wayne. Schroeder could not be reached for comment Tuesday.\nAlso sought is approval of a primary development plan.\nA Fort Wayne Plan Commission public hearing on the project is scheduled for 5:30 p.m. Monday in Room 35 of Citizens Square.\nrsalter@jg.net", "url": "https://apnews.com/10d5fe360dc94ee3945db93e05c5df76"}