{"authors": ["Grant Traylor"], "date_download": "2020-05-04 20:21:03", "date_modify": "2020-05-04 20:21:03", "date_publish": "2019-01-31 05:01:00", "description": "HUNTINGTON - The road in Conference USA is often long, and such is the case this week for the Marshall University women's basketball team. Make no mistake, though. This week has Texas-sized...", "filename": "_7aac4978ae58410bafa0dd5212ae60b9_1588623663.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7aac4978ae58410bafa0dd5212ae60b9_1588623663.html", "title": "MU women embark on Texas trip, look to regain momentum", "title_page": "MU women embark on Texas trip, look to regain momentum", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HUNTINGTON - The road in Conference USA is often long, and such is the case this week for the Marshall University women’s basketball team.\nMake no mistake, though. This week has Texas-sized implications for the Thundering Herd in Conference USA.\nMarshall (11-9, 5-2 C-USA) embarks on a Texas swing starting with Thursday’s 9 p.m. contest against UTEP (4-16, 1-6) in El Paso. The Herd is coming off a loss to Southern Miss and dropped to sixth place in the conference. After UTEP, the Herd plays Saturday at UTSA (6-13, 1-6).\nThe Herd’s last road trip resulted in a weekend sweep of Florida Atlantic and FIU. If the Herd could pull off that type of scenario again this week, the team would be in good standing for the stretch run, taking momentum into the season’s final month of conference action.\nTo get that win, however, Marshall has to continue its success on defense.\nThe Herd is in the middle of the conference in scoring defense at 66.2 points allowed per game but is second in the league at forcing turnovers (17.5 per game), second in blocks (4.3 per game), second in steals (8.95 per game) and fourth in field goal percentage allowed (38.4 percent).\nUTEP is last in C-USA in scoring at 57.4 points per game. The Miners are also last in forcing turnovers at only 12.2 per game, which means the Herd should have a decided advantage in points stemming from miscues.\nIf Marshall is able to take advantage of the defensive side of the ball, it will negate a rebounding advantage the Miners will have.\nUTEP is led in scoring by Zuzanna Puc averaging 11.9 points and also getting 6.3 rebounds per game.\nMarshall’s Shayna Gore continues to lead the Herd at 18.6 points per game, which is second in C-USA. Taylor Porter is averaging 11.6 points per game.\nMarshall (11-9, 5-2) at UTEP (4-16, 1-6)\n9 p.m. Thursday, Don Haskins Center, El Paso, Texas\nRadio: WMUL 88.1-FM", "url": "https://apnews.com/7aac4978ae58410bafa0dd5212ae60b9"}