{"authors": ["Julia Perkins"], "date_download": "2020-05-04 20:27:09", "date_modify": "2020-05-04 20:27:09", "date_publish": "2019-03-26 16:07:24", "description": "There have been two suicides in the Danbury area in as many months. Jeremy Richman, the father of a Sandy Hook victim, died by suicide on March 25, while 16-year-old Hailey Nailor, a Danbury High...", "filename": "_e814502a57e641b3a2e5cd696cd2d7be_1588624029.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e814502a57e641b3a2e5cd696cd2d7be_1588624029.html", "title": "FAQ: What you need to know about getting suicide help", "title_page": "FAQ: What you need to know about getting suicide help", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FAQ: What you need to know about getting suicide help\nThere have been two suicides in the Danbury area in as many months. Jeremy Richman, the father of a Sandy Hook victim, died by suicide on March 25, while 16-year-old Hailey Nailor, a Danbury High School student, died by suicide in February.\nWhere can you get help if you are feeling suicidal?\nThose who are thinking about suicide or know people who need emotional support are encouraged to call the National Suicide Prevention Lifeline. The lifeline is free, confidential and available any time by calling 800-273-8255 or by visiting www.suicidepreventionlifeline.org.\nYou can also contact the Crisis Text Line by texting TALK to 741741 to connect with a trained crisis counselor.\nWhat resources are available in the Danbury area for those struggling with mental health or contemplating suicide?\nUnited Way of Connecticut offers a statewide help line for residents to contact for crisis intervention and various other needs. Residents can call 211 to get help. Nearly 22 percent of requests to the help line in 2016 were from those seeking assistance with mental health and addiction problems.\nDanbury schools and mental health professionals have also been holding a series of workshops on youth mental health in the wake of the suicide of 16-year-old Hailey Nailor.\nThe National Alliance on Mental Illness offers mental health support groups from 6:30 to 8 p.m. on the second Thursday of the month at Jesse Lee Memorial United Methodist Church in Ridgefield. For more information, contact Marc at 203-940-2516; marcrabinowitz1@gmail.com; Sheryl 203-470-1488; sherylsheehan@gmail.com; Ivan 203-502-3048; ivanpodpolucha@yahoo.com\nThat organization also holds family support groups from 7 to 8 p.m. on the first and third Tuesday of the month at Unitarian Universalist Congregation in Danbury. For more information, contact Gale at 860-350-4915 or namidanbury@yahoo.com.\nParents of children with mental health issues meet either on the Monday or Wednesday of the first week of the month at Brookfield Senior Center.\nBrookfield Cares also focuses on raising awareness for depression, suicide and other public health concerns.\nWhat are the signs someone might be feeling suicidal?\nThe person might pull away from friends and family or stop doing activities he or she enjoys, said Kate Mattias, the executive director for the Connecticut chapter of the National Alliance on Mental Illness.\nA change in behavior or exhibiting new behaviors are other warning signs, according to the American Foundation for Suicide Prevention. This includes aggression, fatigue, increased use of alcohol or drugs, looking for ways to end their lives, sleeping too much, giving away prized possessions, and visiting or calling loved ones to say goodbye, the website states.\n“This is of sharpest concern if the new or changed behavior is related to a painful event, loss or change,” the foundation said on its website. “Most people who take their lives exhibit one or more warning signs, either through what they say or what they do.”\nPeople also might talk about killing themselves, feeling hopeless or feeling like a burden on others, according to the foundation.\nWhat is the best way to help a friend or family member struggling with mental health or feeling suicidal?\nThe American Foundation for Suicide Prevention recommends having an honest conversation with the person and taking them seriously.\nThe foundation states you should:\n1. Talk to them in private\n2. Listen to their story\n3. Tell them you care about them\n4. Ask directly if they are thinking about suicide\n5. Encourage them to seek treatment or to contact their doctor or therapist\n6. Avoid debating the value of life, minimizing their problems or giving advice\nWhat other stories are there on this issue?\nSandy Hook father who died by suicide was ‘a beautiful human being’\nSandy Hook father’s suicide another tragic link to Parkland\nDanbury holds mental health forum in wake of teen’s suicide\nHailey Nailor’s suicide an ‘unimaginable’ loss to family, friends in Danbury\nHailey Nailor ID’d as Danbury suicide victim\nFamily of Hailey Nailor raising money for American Foundation for Suicide Prevention\nExperts: Vigil for Danbury’s Hailey Nailor not healthiest way to mourn\nDanbury to review mental health programs after teen’s death\nDanbury teen’s death shines spotlight on suicide prevention\nParents told to tackle issues head-on in first forum after Danbury teen’s suicide\nEarly intervention key for schools to address youth mental health issues\nBrookfield Cares, parents who lost daughter to suicide bring mental health film to high school\nSupport group for parents with kids with mental health issues forms in Brookfield\nWho is covering this story?\nThe News-Times reporter, Julia Perkins, can be reached at 203-731-3337, by email at jperkins@newstimes.com or on Twitter at @JuliaPerkinsHP.\nThe News-Times reporter, Rob Ryser, can be reached at 203-731-3342, by email at rryser@newstimes.com or on Twitter @RobRyserNT.", "url": "https://apnews.com/e814502a57e641b3a2e5cd696cd2d7be"}