{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:10:51", "date_modify": "2020-05-04 20:10:51", "date_publish": "2019-01-13 08:00:00", "description": "Brennan Kathleen Brennan Kathleen Brennan, 97, longtime Pocatello resident passed away January 10, 2019. Kathleen was born in Hopedale, Labrador (Canada) on November 11, 1921. She was one of four...", "filename": "_c5990e40cdc946199db80d9e3de0e050_1588623051.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c5990e40cdc946199db80d9e3de0e050_1588623051.html", "title": "Brennan, Kathleen", "title_page": "Brennan, Kathleen", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Brennan Kathleen Brennan Kathleen Brennan, 97, longtime Pocatello resident passed away January 10, 2019. Kathleen was born in Hopedale, Labrador (Canada) on November 11, 1921. She was one of four children born to Moravian missionaries, Andrew E. and Margaret E. Asboe. Prior to coming to the United States, Kathleen and her family lived in Hopedale, Labrador, St. Croix in the Virgin Islands, Puerto Rico and the family homestead in Malmesbury, England. In 1928, after her father was ordained an Episcopal priest, the family immigrated to the United States, and moved to Beatrice, Nebraska. Kathleen attended grade school there and graduated from Beatrice High School. After attending Doane College, she worked for a doctor in Beatrice before moving with her family to Pocatello. When she arrived in, Pocatello she worked at Idaho State College as a statistician. She married Robert (Bob) Brennan in 1946 and they were married until his passing in 2001. They had four children, Becky Brennan Vannatter (Kim), Jack Brennan, Pam Brennan Maguire (David), and Jim Brennan. Kathleen led an active life, enjoying tennis, water skiing and snow skiing, gardening and walking. Kathleen spent years supporting the Episcopal Church, working with various youth groups, initiating a Girl’s Club, singing in the choir, and serving as president of Episcopal Church Women. She was also a dedicated member of Chapter BA, P.E.O. for over 50 years. She, and her husband Bob, were actively involved in the Pocatello Ski Association and the Junior Racing Program and were recognized in the Intermountain Ski Hall of Fame as competition volunteers. Later in life, she earned her Bachelor’s degree in Elementary Education from Idaho State University, taught in the Pocatello Public School System, the Cardin Private School for several years, then tutored children in her home. Kathleen was a loving, kind-hearted, and committed woman who adored her family and was always there for them, cheering them on in all their activities and sporting events in their youth and who continued her loving support into their adulthood. Kathleen was preceded in death by her parents, her husband Bob, her brothers Eric and Don, and her daughter Pam. She is survived by her children, Becky, Jack and Jim, her sister Muriel Skow, four grandchildren and six great-grandchildren. Funeral services will be conducted Monday, January 14, 2019 at 10:30 am in the Trinity Episcopal Church, 248 North Arthur Ave., Pocatello, with the Rev. Donald Paulson officiating. The family will receive friends in the Parish Hall one hour prior to the service. The family would like to thank the staff at The Gables for their kind and loving care of our dear mother for the past two years. Memorials may be given in Kathleen’s memory to Trinity Episcopal Church Memorial Fund, 248 North Arthur Ave., Pocatello, Idaho 83204 or to a charity of the donor’s choice.", "url": "https://apnews.com/c5990e40cdc946199db80d9e3de0e050"}