{"authors": ["Jim Ross"], "date_download": "2020-05-04 20:07:13", "date_modify": "2020-05-04 20:07:13", "date_publish": "2019-05-20 07:05:25", "description": "Memorial Day is almost upon us. The last Monday in May is a time to celebrate the unofficial beginning of summer and the end of the school year. Families will get together for cookouts or...", "filename": "_56c1b584e8bc415d8d1500e9d9ba08dd_1588622833.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_56c1b584e8bc415d8d1500e9d9ba08dd_1588622833.html", "title": "Decoration Day holiday reminded us of our families", "title_page": "Decoration Day holiday reminded us of our families", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Memorial Day is almost upon us. The last Monday in May is a time to celebrate the unofficial beginning of summer and the end of the school year. Families will get together for cookouts or reunions.\nSome of us will pause to remember the purpose of the day — to remember the soldiers, airmen, sailors, Marines, merchant mariners and others who died to defend and protect us, our freedoms and our way of life.\nIronton does Memorial Day right. Back in the 1980s I covered several of the big Memorial Day parades the city is known for. One year, just before the parade started, I walked the entire route, beginning to end, and counted the thousands of people who lined just one side, multiplied it by two and got my own crowd estimate. It’s no wonder you need to arrive a few hours early if you wish to avoid the traffic jams and find a place to park.\nMy own family hasn’t lost any people to combat, although I’ve had ancestors and siblings who served in time of war. My wife’s grandfather spent part of World War II in Alaska defending the Aleutians from Japanese invasion. He was one of those veterans who wouldn’t talk about what he saw or experienced. And he refused to watch any television shows or movies about war.\nWhere I grew up, Memorial Day was always the last day in May, regardless of what day of the week it fell on. The last weekday before Memorial Day was always the last day of school, just as the day after Labor Day was the first day.\nMy parents didn’t recognize the day as Memorial Day. They called it Decoration Day. It was the day to ensure flowers were placed on graves of family members so the world would know they were not forgotten. I admit that as a youngster I didn’t really get Decoration Day. It was interesting, but I had no memory of many of the people whose graves my mother tended, so it wasn’t something that got my curiosity going.\nMemories of Decoration Day came back to me one afternoon last week as I was returning to Huntington after a short trip upriver. The trip back down the river took me past the cemetery where my mother, her parents, her grandparents and other family members are buried. That cemetery includes too many people I went to school with.\nEvery year my mother took us to that cemetery so she could be sure the graves were in good condition and so she could place flowers on them. It wasn’t until she was gone that I fully understood why she did that.\nLong ago, I thought the worst part of a family member’s dying was how it robbed the rest of us of that person’s presence. In the 25 years since her passing I have realized the worst part is how death robs later generations of knowing that person — what she went through, the stories she could tell, the person she was and the person a child could be.\nSo yes, I’ll spend time on Memorial Day to remember the people who went off to war and never came home. And I’ll also remember how the people of my youth used the day to remember family members who should not be forgotten. My only remaining brother is the family genealogist. He says too many people don’t get interested in their family history until the people who can really help them are gone.\nDecoration Day was one way around that.\nJim Ross is opinion page editor of The Herald-Dispatch. His email is jross@herald-dispatch.com.", "url": "https://apnews.com/56c1b584e8bc415d8d1500e9d9ba08dd"}