{"authors": ["Nicole Aschoff", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman"], "date_download": "2020-05-04 19:56:41", "date_modify": "2020-05-04 19:56:41", "date_publish": "2019-06-14 00:00:00", "description": null, "filename": "2019_06_private-equity-blackstone-workers-inequality_1588622201.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/06/14120541/GettyImages-969817250.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_06_private-equity-blackstone-workers-inequality_1588622201.html", "title": "Ban Private Equity", "title_page": "Ban Private Equity", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nBlackstone — the world’s largest “alternative investment” company — recently closed on the biggest private real estate deal in history. It paid $18.7 billion for the US warehouse division of GLP, a global logistics firm based in Singapore. Private equity firms like Blackstone, Apollo, and Carlyle have grown ever more powerful in the easy credit decade following the 2008–2010 financial crisis. This isn’t good news. The relationship between private equity firms and ordinary folks is zero sum: when PE firms thrive, working families and communities suffer. Here are five things you should know about private equity firms.\n1 They are huge. Blackstone not only snagged the biggest private real estate deal in GLP — it’s also the largest landlord for single-family homes in the United States. And it’s not alone. 3,749 private equity firms were looking for investors at the start of 2019, hoping to raise a trillion dollars in fresh funds. Since 2000 the number of private equity–backed companies in the US has increased from less than two thousand to nearly eight thousand, and recently private equity firms have been consolidating, creating vast buyout funds. Today the aggregate value of PE-backed companies is $5 trillion, more than the GDP of Japan and Germany.\n2 They will buy anything. Private equity firms aren’t picky eaters. They’ve purchased rugby teams, talent agencies, grocery stores, the zinc supplier for US pennies, community hospitals, and even Jamie Oliver’s restaurant chain. The only thing they care about is whether their investment target has a steady cash flow and can be piled up with debt. These minimal requirements make for some unexpected purchases. For example, the Carlyle Group and others are hoping to cash in on America’s growing inability to afford homes that aren’t on wheels. They’re going long on trailer parks, where roughly one in fifteen Americans live. Trailer parks have an annual return of at least 4 percent, which is about double that of US real estate investment trusts. Trailer parks are just the beginning. PE firms have an estimated $2 trillion in “dry powder” — funds that have been raised but haven’t yet been invested.\n3 They are called vultures for a reason. Despite the recent good deed of billionaire investor Robert F. Smith and the purported beneficence of “impact investing,” private equity firms are bad actors. Their business model is simple and brutal. They raise cash from investors (pension funds, wealthy individuals, endowments, etc.) to purchase companies, like hospitals and grocery stores, in “leveraged buyouts.” PE firms put very little of their own money into these deals. Instead the company that is bought takes on about 70 percent of the (often wildly inflated) purchase price as debt. The PE firm uses some of this debt to pay itself huge fees; to make more money it sells off company assets, fires workers, closes facilities, etc. If returns are not deemed satisfactory it simply schedules a “divi recap” (dividend recapitalization) where it raises even more debt to pay itself and investors. (PE-owned companies’ debt levels are about eleven to twelve times earnings before interest, tax, depreciation, and amortization.) When the PE firm has sucked all the money it can out of the company and its stakeholders, which usually takes between three and five years, it either sends it into bankruptcy (where workers lose whatever they have left) or sells it (often to another PE firm).\n4 They are funded by workers. PE firms raise money from investors for the down payment on their leveraged buyouts. A major source of this money is workers, through their pension funds. Pensions are underfunded to the tune of $3.8 trillion dollars, a funding gap that has roughly doubled since 2008. Desperate to maximize their annual rate of return so they can meet retiree obligations, pension funds have turned to private equity firms who claim to beat the S&P. To name just one, CalPERS, the California Public Employees’ Retirement System, which manages $355.8 billion in pension savings, has gone big on private equity — $27.6 billion — and plans to invest even more to reach its goal of a 7 percent annual rate of return. The Canada Pension Plan Investment Board is the world’s largest investor, with $54.8 billion allocated to private equity. The conflict of interest here is stark: workers’ retirement savings are invested in companies that actively destroy the livelihoods of working families.", "url": "https://www.jacobinmag.com/2019/06/private-equity-blackstone-workers-inequality"}