{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 21:06:45", "date_modify": "2020-05-04 21:06:45", "date_publish": "2019-03-03 11:37:36", "description": "By Jon Winkler jwinkler@nashobavalleyvoice.com DEVENS -- Ten days into her tenure as the senior vice president of Devens, Jessica Strunkin is looking forward to an event:...", "filename": "_a32c2c904f1d4eddae7a50a8c4c23826_1588626405.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a32c2c904f1d4eddae7a50a8c4c23826_1588626405.html", "title": "New Devens Leader Ready to Meet and Greet Stakeholders", "title_page": "New Devens Leader Ready to Meet and Greet Stakeholders", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "By Jon Winkler\njwinkler@nashobavalleyvoice.com\nDEVENS -- Ten days into her tenure as the senior vice president of Devens, Jessica Strunkin is looking forward to an event: breakfast.\n“Breakfast with the Boss,” to be more specific, will be hosted by the Nashoba Valley Chamber of Commerce on Wednesday, when the 43-year-old Strunkin will meet with local residents about what’s in the works at the former military base.\n“I’m very much looking forward to speaking and getting to know businesses through that engagement,” she said Monday. “I just want to continue the success rate MassDevelopment has experienced here at Devens and determine those specific goals with a little more time under my belt.”\nStrunkin referenced MassDevelopment, which manages the 4,400-acre community and has been developing the land into a mixed-use community.\nIn her new role, Strunkin will be overseeing the area’s departments of public safety, public works, recreation and utilities.\nThe Sterling resident, born and raised in Fitchburg, explained that these duties are similar to those in her previous job as deputy director of 495/Metrowest Partnership. Those included highway projects and development of commuter rails.\n“It works with both the public and private sector,” Strunkin said. “This role is also a unique combination of economic development, infrastructure and community engagement. I think there’s a lot of exciting opportunities here in Devens, not to mention the fact that it’s been a role model for base redevelopment. I hope to continue that trend of attracting businesses and ensuring the continuing success of the community.”\nShe highlighted how the diverse range of businesses growing in the community, ranging from restaurants such as the Devens Grill to the sound stages at New England Studios, exemplify what makes Devens so outstanding.\nTo keep the community’s economic development growing, Strunkin pointed out how an “educated work force” helps support local businesses looking to thrive and expand.\nThe new senior VP added that she’s looking forward to overseeing phase two of the Emerson Green housing development containing 41 houses, meeting new tenants and developers to further bring in commerce to the community and rezoning the Vicksburg Square historic district where a collection of old brick buildings lay dormant.\nFor now, Strunkin has breakfast to look forward to and what Devens people will want to talk about with her.\n“Hopefully they’ll just say, ‘Welcome to Devens!’ and we’ll take it from there,” she said.", "url": "https://apnews.com/a32c2c904f1d4eddae7a50a8c4c23826"}