{"authors": ["Miles Kampf-Lassin", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Miles Culpepper", "Luke Savage", "Kate Aronoff", "Alyssa Battistoni", "Daniel Aldana Cohen"], "date_download": "2020-05-04 19:54:36", "date_modify": "2020-05-04 19:54:36", "date_publish": "2019-07-15 00:00:00", "description": null, "filename": "2019_07_alexandria-ocasio-cortez-aoc-nancy-pelosi-democratic-party_1588622076.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/07/15144359/GettyImages-1127752071.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_07_alexandria-ocasio-cortez-aoc-nancy-pelosi-democratic-party_1588622076.html", "title": "They’re Not Just Mad at AOC - They’re Scared of Her", "title_page": "They’re Not Just Mad at AOC — They’re Scared of Her", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nJust over one year ago, Alexandria Ocasio-Cortez (D-NY) sent shockwaves through the mainstream political establishment by ousting ten-term incumbent Democrat Joe Crowley in New York. Running as an open democratic socialist on a platform of redistributive economics, universal health care, bold climate action, and abolishing ICE, she lit a spark under a moribund Democratic Party, becoming an immediate media sensation and capturing the imagination of progressives and young people across the country. In the face of the incredible response to Ocasio-Cortez’s surprise victory, House leader Nancy Pelosi (D-CA) threw cold water on all the excitement. “They made a choice in one district,” she said. “So let’s not get yourself carried away as an expert on demographics and the rest of that.” Flash forward to today, and Pelosi’s dismissal of Ocasio-Cortez and her role in the party is again making headlines. This time, the controversy stems from comments Pelosi made to the New York Times ’s Maureen Dowd about AOC and her “squad” of fellow freshmen reps Ayanna Pressley (D-MA), Ilhan Omar (D-MN), and Rashida Tlaib (D-MI): “All these people have their public whatever and their Twitter world. But they didn’t have any following. They’re four people and that’s how many votes they got.” Those comments elicited a response from Ocasio-Cortez and her chief of staff Saikat Chakrabarti in which they defended the reputation of the four new progressives, calling Pelosi’s characterization “outright disrespectful.” The ensuing back-and-forth has seen longtime incumbent Democrats pile on criticisms of the squad, with some members accusing Ocasio-Cortez of using “the race card” for suggesting that leadership was “singling out” the newly elected women of color. Even the operatives behind the official House Democrats Twitter account got in on the action, sending out a tweet disparaging Chakrabarti for daring to criticize moderate Democrats over their votes. Mainstream outlets have characterized the conflict as driven by generational tensions, or (on Pelosi’s side) simply a desire to protect Democratic incumbents from criticism. But the feud in fact speaks to something much deeper: Ocasio-Cortez and her allies are pushing for bold, transformational policies that would upend the current economic and political system. That campaign is coming into open conflict with a Democratic establishment that would prefer to just keep things as they are.\nBreaking Ranks With the Establishment Consider the political backdrop to the current war of words. Pelosi’s “four votes” comment was in reference to a border funding package that Ocasio-Cortez and the squad all voted against, arguing it would provide financing for immigration enforcement more than it would address the humanitarian needs of migrants. The final version of the bill passed by Pelosi included even less aid for migrants than the previous House version, with the few measly concessions secured by the Speaker including a promise from Vice President Mike Pence “that members would be notified within 24 hours of the death of a child in U.S. custody.” Contrast that dystopian compromise with the stated policy goals of Ocasio-Cortez when it comes to immigration: Repealing laws that criminalize entering the United States without proper documentation, massively increasing US aid to Central America, abolishing ICE — the brutal arm of the US deportation regime that she says “systematically and repeatedly violates human rights” — and even dissolving the Department of Homeland Security, an agency that has been sacrosanct to both the Republican and Democratic parties since its creation after September 11. This approach to immigration flies in the face of decades of mainstream Democratic Party messaging around the issue, which has consistently centered militarizing the border, criminalizing those who would dare cross it, and deporting immigrants in order to claim the mantle of “toughness.” But the Democratic approach to immigration isn’t just about rhetorical positioning. It also stems from the fact that many Democrats rely on funding from the very same private prison industry that undergirds the horrendous system of migrant detention camps in the United States. Take Rep. Henry Cuellar (D-TX), who, according to OpenSecrets, has taken $88,990 from GEO Group and CoreCivic America since 2012. Cuellar, one of the most conservative Democrats in the House, is currently being targeted in his primary by Jessica Cisneros, a left challenger and former immigration lawyer backed by Justice Democrats — the same group that helped propel Ocasio-Cortez into power and was cofounded by Chakrabarti. Cisneros has sworn off the types of corporate donations on which Cuellar has long relied, and her platform includes ending family separation and opposing the border wall. If elected, she would help cut off the valve of private prison money flowing into the Democratic Party and push forward a more unapologetically progressive approach to immigration — just the type of confrontational, anti-corporate politics embodied by Ocasio-Cortez and her squad. It’s this prospect that causes hand-wringing in the mahogany-adorned offices of centrist Democrats the country over. They understand that Ocasio-Cortez and her supporters in the Justice Democrats don’t just want to knock off a few incumbents here and there; they want to create a political environment in which Democrats who put corporate-friendly policies over the demands of working-class Americans are seen as toxic — and they’re willing to take risks to achieve this goal.", "url": "https://jacobinmag.com/2019/07/alexandria-ocasio-cortez-aoc-nancy-pelosi-democratic-party"}