{"authors": ["Daily Inter Lake"], "date_download": "2020-05-04 20:20:21", "date_modify": "2020-05-04 20:20:21", "date_publish": "2019-03-14 05:00:01", "description": "Break out your spring muck boots, because it's about to get real sloppy in Northwest Montana. A warming trend beginning this weekend and lasting into next week will cause the valley's...", "filename": "_391ad5631a1b4e289e9e366d97716c9a_1588623621.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_391ad5631a1b4e289e9e366d97716c9a_1588623621.html", "title": "Warming trend to trigger valley melting", "title_page": "Warming trend to trigger valley melting", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Break out your spring muck boots, because it’s about to get real sloppy in Northwest Montana.\nA warming trend beginning this weekend and lasting into next week will cause the valley’s extraordinary March snowpack to begin to melt away, according to the National Weather Service in Missoula, raising the potential for some flooding issues. By Tuesday, high temperatures in the valley could hit the low 50s, with overnight lows in the 20s.\nWith feet of snow piled up and the ground still frozen, this melt will not be able to soak in and will create run-off conditions, the Weather Service warned in its hydrological outlook on Thursday.\nMuddy, slushy roads will likely create difficult travel during the day, while black ice will be a problem just about every night as moist surfaces refreeze.\nSome flooding in low-lying areas and basements is also possible. Creeks will likely rise with the melt and there is some potential for ice jam formation on rivers.\nThe severity of the impacts will depend on how fast the snow melts, the Weather Service stated, adding that it looks like a gradual warming trend at this time.\n“Now is the time to move personal items, equipment and livestock out of low-lying areas and away from waterways,” the Weather Service warned. “Move heavy accumulations of snow away from home foundations, and take steps to prevent water from making it into basements.”", "url": "https://apnews.com/391ad5631a1b4e289e9e366d97716c9a"}