{"authors": ["Shannon Cobb Evans"], "date_download": "2020-05-04 20:12:10", "date_modify": "2020-05-04 20:12:10", "date_publish": "2019-01-27 06:00:00", "description": "When you have a negative experience at a restaurant, store, or doctor’s office, what do you do? You might speak to the service provider to get a refund, discount or other arrangement that...", "filename": "_0028e2f5c1334316ad0d4a2113cef513_1588623130.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0028e2f5c1334316ad0d4a2113cef513_1588623130.html", "title": "What to do if you must file a complaint in real estate", "title_page": "What to do if you must file a complaint in real estate", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "When you have a negative experience at a restaurant, store, or doctor’s office, what do you do? You might speak to the service provider to get a refund, discount or other arrangement that rectifies the problem. In real estate, there is another step that you can take if you have a less than ideal experience, however unlikely it may be. Here’s what you need to know if you have to lodge a complaint in real estate.\nAre you dealing with a Realtor? A real estate licensee is someone who is state-licensed to engage in the practice of real estate. Holding an agent’s or broker’s license does not make someone a Realtor. Only membership in the National Association of Realtors (NAR), the state-level association of Realtors, and the local-level Realtor association makes licensees a Realtor.\nHiring a Realtor means you’ve retained someone who is committed to continuing education, professionalism and integrity. What also distinguishes a Realtor from a licensee is the Realtor Code of Ethics, which outlines Realtors’ obligations to colleagues and the general public and requires Realtors to put their clients’ interests first.\nWhat if you have a problem? In Texas, the Realtor Code of Ethics is enforced through professional standards committees maintained by the Texas Association of Realtors (TAR). When a member of the public or another Realtor feels they have been treated unfairly, they can file an ethics complaint. Some types of complaints can be made anonymously. If a Realtor is found in violation of the Code of Ethics, there is a wide range of sanctions he might receive, from a letter of reprimand to a more serious disciplinary action like suspension or expulsion from membership.\nEthics complaints must deal only with issues regarding the Code of Ethics, not legal issues or real estate regulations. Keep in mind, too, that only Realtors are subject to the Code of Ethics. Complaints against agents and brokers who are not Realtors may be addressed by the Texas Real Estate Commission or in court.\nBefore you go through the ethics-complaint process, try one of these alternatives, which may bring a quick and easy resolution to your problem:\nTalk it out. Contact the principal broker of the firm to discuss the situation and work out a solution. Open, constructive discussion often resolves questions or differences.\nTake advantage of the TAR Ombudsman Program. You can try using an ombudsman before filing a complaint. An ombudsman is a Realtor volunteer who helps clear up any miscommunication between the parties and discusses options available to the complainant. The ombudsman does not make judgments, only helps facilitate a solution.\nGo to mediation. Although a complainant must file an ethics complaint before being offered mediation as an alternative, the mediation process serves as a replacement for the complaint process. Mediation is a confidential, voluntary process in which the parties look to an impartial mediator who assists the parties to resolve a dispute.\nThe process\nAn ethics complaint must be filed within 180 days from the time you knew (or reasonably should have known) that potentially unethical conduct took place, and the complainant must cite one or more articles of the Code of Ethics that may have been violated. Search “Code of Ethics” on TexasRealEstate.com to see the Code of Ethics in its entirety.\nIn Texas, the grievance tribunal of the TAR Professional Standards Committee will review the complaint to determine if the allegations support a violation of the articles cited in the complaint. The grievance tribunal may then forward the complaint to a hearing panel or dismiss the complaint, depending on the possibility that a violation of the Code of Ethics occurred.\nFor questions about the filing an ethics complaint, contact the TAR Professional Standards Department at 800-873-9155. And for more information about working with a Realtor, visit www.HAR.com.\nShannon Cobb Evans, with Heritage Texas Properties, is 2019 chair of the Houston Association of Realtors/HAR.com.", "url": "https://apnews.com/0028e2f5c1334316ad0d4a2113cef513"}