{"authors": ["Colin Gordon", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Steve Fraser", "Richard Rothstein", "Richard Walker", "Jennifer Mittelstadt"], "date_download": "2020-05-04 19:49:34", "date_modify": "2020-05-04 19:49:34", "date_publish": "2019-08-12 00:00:00", "description": null, "filename": "2019_08_new-deal-segregation-richard-rothstein-walker-color-of-law_1588621774.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/08/12125713/GettyImages-2669115.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_08_new-deal-segregation-richard-rothstein-walker-color-of-law_1588621774.html", "title": "The New Deal State and Segregation", "title_page": "The New Deal State and Segregation", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "In a recent exchange in these pages, Richard Walker and Richard Rothstein sparred over the culpability of the New Deal in the invention, elaboration, or perpetuation of racial segregation. In his pointed critique of Rothstein’s Color of Law, Walker claims that racism and racial segregation were “deeply embedded in American social structures” and that the New Deal only reluctantly “lined up with the prevailing practices of racial segregation.” This is a familiar refrain in New Deal scholarship, that pragmatic concessions to Jim Crow — in the South and in Congress — were the price for any progress on social, labor, or housing policy.\nIn his rejoinder, Rothstein argues that “the New Deal did not merely concede to private bigotry but pursued independent racial policies that did much to create a segregated landscape,” and, more important, that we should have expected much more from federal policy. It is one thing for rapacious realtors and racist homeowners associations to sustain segregation, in this view, but it is quite another for public actors with the Fourteenth Amendment in their back pocket to do the same.\nBoth Walker and Rothstein make strong points, and the distance between the two is not as wide as either suggest. There is substantial agreement that private and public mechanisms of segregation were well established before the 1930s. Walker is unsurprised that federal housing policy echoed, protected, sustained, and embedded these mechanisms. Rothstein, for his part, is horrified.\nUnspoken, or at least understated, in this last point of contention is any broader expectation or theory about state action or policy choices under such circumstances. Especially in times of economic crisis, how and why do class interests exercise political power? How much autonomy do state actors have? And, if we assume that economic interests occupy a privileged political position (because they have both the incentive and the resources to influence political outcomes), what would it take for popular mobilization to erase that advantage?\nThese useful questions have dominated the political sociology of the New Deal for the last generation, yet they seem to barely register in this debate. How might closer attention to these questions sharpen our understanding of the origins, motives, and consequences of New Deal housing policy?\nMuch of the early critical political history of the New Deal echoed Engels’s famous observation that “the State is nothing more than a machine for the oppression of one class by another.” In this instrumental view of state power, capital (or fractions of capital) simply slide into positions of political power and use the law and police power to bolster or purse their interests. This is the basic premise behind G. William Domhoff’s Who Rules America (first published in 1967) and a raft of scholarship that has unearthed corporate cabals behind even the most progressive of New Deal policies.\nThis instrumentalism is an important undercurrent of the Rothstein-Walker exchange. Both are primarily interested in who made the key decisions and why; both, in their way, argue that the New Deal failed to protect or advance equal protection in housing because segregationists and real-estate interests elbowed aside more progressive voices. Rothstein points to the clout of segregationists in the administration and in Congress. Walker blames the vested housing interests that effectively drafted, lobbied for, and administered the Home Owners’ Loan Corporation (HOLC), the Federal Housing Administration (FHA), and the Federal National Mortgage Association (Fannie Mae). The irony here — as Walker and Rothstein each assemble their lineup of culprits — is that Walker accuses Rothstein of “bolstering conservative positions” and enabling a more general attack on the affirmative state. But it is Walker’s argument that more closely resembles the libertarian version of instrumentalism, in which public policies are invariably captured by the very interests they are intended to reign in or regulate.\nThe instrumental view of the state lost some of its appeal as capitalist democracies easily weathered the upheaval of the late 1960s. For many, instrumentalism seemed incapable of explaining how the state chose among fractions of capital, how it so easily contained and rebuffed popular mobilization, or how it overcame the short-term interests and anxieties of the ruling class in order to ensure the stability of the larger enterprise. In a famous exchange with Ralph Miliband in New Left Review in the early 1970s, Nicos Poulantzas articulated an alternative structural explanation of class power.\nPoulantzas, drawing on the work of Althusser, Gramsci, Foucault, and others, suggested that the state in capitalist society was not an instrument of the ruling class but a structural safeguard of the larger social system — capable of mediating class conflict, pushing aside short-sighted class interests, and bolstering the ideological, political, and cultural legitimacy of capitalism itself. In this view, the presence of class interests in positions of political power was unimportant, a consequence rather than a cause of state interests and priorities.\nThis structuralism is an important undercurrent of the Rothstein-Walker exchange. For Walker, the architecture of racial segregation was fully perfected by private and local interests long before the 1930s, and “federal promotion of zoning, mortgage guarantees, and public housing mostly lined up with the prevailing practices of racial segregation.” What is left undeveloped here is why New Deal policies aligned so closely with “prevailing practices.” Was the New Deal powerless to offer any alternative? Was its housing policy — as Robert Weaver famously put it — simply “given over to the real estate boys”? Or did federal policy, as a matter of course, kick in to protect and sustain existing mechanisms of property valuation and capital accumulation in American housing markets?\nAt this point, Walker and Rothstein are dancing around many of the same issues that animated the instrumentalist-structuralist debate of the 1970s. Instrumentalism seemed to reduce historical explanation to the navigation of “follow the money” rabbit holes. Structuralism, whose mode of explanation was essentially functional, cared little for historical actors or agency (it was, as Miliband put it, an “exceedingly formalized ballet of evanescent shadows”).\nOne way out of this theoretical cul-de-sac was first suggested by Fred Block’s 1977 essay, “The Ruling Class Does Not Rule.” Block acknowledged the insights and limits of the instrumental and structural approaches and suggested a middle ground in which state actors enjoyed “relative autonomy,” as long as their policies sustained the profitability, stability, and legitimacy of the larger social system. “Those who manage the state apparatus,” Block wrote, “regardless of their own political ideology — are dependent on the maintenance of some reasonable level of economic activity.” In this respect, as Charles Lindblom would put it a few years later, markets imprisoned policy but — inside that razor-wire boundary — they did not determine it.\nThis, in a sense, is Walker’s argument — that prevailing patterns of segregation set stark parameters or boundaries for New Deal interventions in housing and housing finance. But this is a view that Rothstein, for whom the priorities and possibilities of the New Deal are open-ended and its failures self-inflicted, would reject out of hand.", "url": "https://jacobinmag.com/2019/08/new-deal-segregation-richard-rothstein-walker-color-of-law"}