{"authors": ["Jenna Schuster", "Homeadvisor Tribune News Service"], "date_download": "2020-05-04 20:23:48", "date_modify": "2020-05-04 20:23:48", "date_publish": "2019-01-26 06:00:00", "description": "Lighting alters more than the aesthetic appeal of your home - it can affect your mood as well. Studies show that we are deeply influenced by our home lighting choices. Light that is too blue,...", "filename": "_e12f263be8eb4b07bf1786a775c79e53_1588623828.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e12f263be8eb4b07bf1786a775c79e53_1588623828.html", "title": "Feeling down? Use lighting to improve your mood", "title_page": "Feeling down? Use lighting to improve your mood", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Lighting alters more than the aesthetic appeal of your home - it can affect your mood as well. Studies show that we are deeply influenced by our home lighting choices. Light that is too blue, bright or artificial can have a negative impact on your health. If you struggle with lying awake at night or feeling exhausted during the day, you may want to rethink your home lighting. Luckily, there are several solutions.\nFeeling anxious? Try dimmer switches.\nIf your emotions tend to get the best of you, installing dimmer switches around your home could help. Studies show that bright light intensifies your emotions, while lower light can keep your feelings at a steady level. Give yourself the option to move between the two without sacrificing bright overhead light when you need it.\nFeeling restless? Try red light.\nYou probably encounter blue light on a regular basis thanks to computer screens, fluorescent bulbs and LED lights. Unfortunately, blue light is known to stop melatonin production in your brain, which makes it difficult to fall asleep. Take a look at the light bulbs you’re using in your bedroom and replace blue tones with red, amber or yellow light for more restful sleep. You’ll still be able to see what you’re doing, but your body will be able to produce the sleep hormone it desperately needs.\nFeeling sluggish? Try a circadian lighting system.\nWaking up without a cup of coffee is always a little bit tricky. But if you find yourself feeling truly sluggish in the morning, it could be because your sleeping pattern has been messed up. Investing in a circadian lighting system may be a good option. Circadian lighting systems get your body back on track by mimicking the sun’s normal light path. Not only will an artificial sunrise help you wake up in the morning, but dimmer light toward the end of the day will make it easy for you to wind down.\nFeeling blue? Try installing natural light.\nThe darker your home is, the more difficult it becomes for your brain to produce serotonin -- a mood-boosting hormone triggered by daylight. So, if you’ve been feeling down, more access to natural light could help. Find places in your home where you spend the most time and consider installing windows or skylights. If you’d like to preserve your privacy, check out light tubes - cylindrical pipes that channel light from your roof and reflect it into the rooms of your choosing.\nWhat now? Don’t forget finishes.\nNo matter which new lighting scheme you decide to try out, it’s important to make sure your home finishes work with your design. Installing natural light won’t help much if you decorate with dark paint colors and espresso floors. Instead, amplify brightness with white walls and pale furniture. If you prefer dimmer ambiance for relaxation, feel free to play up light-absorbing shades like navy, charcoal and umber. And for a more flexible lighting atmosphere, neutral colors will get you a happy medium. You can also try experimenting with light and dark contrasts.\nHomeAdvisor is an online marketplace connecting homeowners with trusted service professionals to complete home projects. Visit HomeAdvisor.com.\nDistributed by Tribune Content Agency, LLC.", "url": "https://apnews.com/e12f263be8eb4b07bf1786a775c79e53"}