{"authors": ["Luke Nichols Daily Sun Sports Editor"], "date_download": "2020-05-04 20:10:35", "date_modify": "2020-05-04 20:10:35", "date_publish": "2019-01-01 21:07:00", "description": "The Beatrice boys basketball team defeated Sidney 74-37 on Saturday to claim the Sidney Holiday Tournament championship. The Orangemen jumped out to an 18-10 lead in the first quarter and...", "filename": "_062e85a44c1142a7a39aaf4814b8d5d2_1588623035.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_062e85a44c1142a7a39aaf4814b8d5d2_1588623035.html", "title": "Beatrice boys win holiday tourney", "title_page": "Beatrice boys win holiday tourney", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Beatrice boys basketball team defeated Sidney 74-37 on Saturday to claim the Sidney Holiday Tournament championship.\nThe Orangemen jumped out to an 18-10 lead in the first quarter and led 39-19 at half time. They broke the game open in the third quarter, outscoring Sidney 24-3 to extend their lead to 63-22. They’d coast to the win from there.\nBennett Crandall led the way for Beatrice with 22 points while Andrew Mahoney had 15, Griffen Vater had 11, Devin Smith had nine, Elliott Jurgens had six, Peyton Murphy had five, Jace Pethoud had four and Josiah Wallman had two.\nThe Orangemen reached the championship by defeating Laramie, Wyo. 59-33 on Friday.\nBeatrice took a 16-4 lead in the first quarter and never looked back in the win.\nMahoney had 15 points for Beatrice while Crandall and Jurgens had 12 each. Vater and Smith had six each while Murphy had five and Zack Zimmerman had three.\nThe Beatrice girls lost to Sidney 39-37 on Saturday in a rematch of last year’s state quarterfinal game.\nThe game was tied 6-6 after the first quarter and Beatrice led 21-17 at half time. Sidney came back to take a 30-29 lead after three quarters and then outscored Beatrice 9-8 in the final quarter to win 39-37.\nThe Beatrice boys are now 4-4 on the season and will be in action again Thursday when they travel to York.\nCarley Leners led the Lady O with 10 points while Addie Barnard had nine, Hannah Lytle had six, Lexi Schwartz had four, Olivia Aden had three, Mak Hatcliff had two and Nevaeh Martinez had two.\nOn Friday, in the first round of the Sidney Holiday Tournament, the Lady O defeated Laramie, Wyo. 59-49. Beatrice had a 46-26 lead entering the fourth quarter. Laramie outscored Beatrice 23-13 in the final quarter, but it wasn’t nearly enough.\nHatcliff poured in 25 points for Beatrice while Leners had 16, Schwartz and Barnard had eight each and Morgan Mahoney had two.\nThe Beatrice girls are now 4-4 on the season and they will host Seward on Friday.\nOther Sunland scoresBoysFAIRBURY 75, RAYMOND CENTRAL 52Fairbury 16 15 26 18 -- 75Raymond Central 11 11 18 12 -- 52Fairbury--Melcher 15, Rolentoon 25, Cole 15, Peterson 2, Amundson 13, Arnold 5.Raymond Central--Urbon 10, Oldfield 5, McCoy 2, Thornburg 15, Walla 2, Black 2, Wayma 12, Boyd 1, White 1, Masek 2.FALLS CITY SH 41, FREEMAN 38FCSH 4 15 15 7 -- 41Freeman 7 16 7 8 -- 38Falls City SH--Jordan 2, Bippes 20, Witt 15, Simon 4.Freeman--Archer 2, Yates 8, Eisenbarth 5, Anderson 7, Ideus 3, Adams 10, Unvert 3.H-TR-S 62, PAWNEE CITY 30Pawnee City 13 8 11 7 -- 39H-TR-S 11 21 19 11 -- 62Pawnee City--Koester 3, Mawhiney 11, Robison 2, Lierz 6, Lang 3, Willey 4, Adams 8.H-TR-S--Lockaed 3, Kostecka 6, Knudson 4, Bredemeier 19, Hain 19, Tackett 11.WAVERLY 50, NORRIS 47Waverly 10 8 14 18 -- 50Norris 10 13 14 10 -- 47Waverly--Murray 1, Carter 24, Stoddard 20, Nieman 5.Norris--Ponkoke 11, Knudsen 7, Misko 6, Rice 6, Oelke 6, Schwaninger 4, Price 3, Hood 2, Oerter 2.OAKLAND-CRAIG 60, WILBER-CLATONIA 36Oakland-Craig 9 18 20 13 -- 60Wilber-Clatonia 9 7 9 11 -- 36Oakland-Craig--Ray 2, Mayberry 4, Thomsen 18, Dodge 19, Meyer 2, Thiele 2, Mulder 7, Seagren 6.Wilber-Clatonia--Lee 2, Cerveny 2, Rezabek 14, Zimmerman 4, Thompson 2, Whittington 4, Fritch 8.DESHLER 67, H-TR-S 58Deshler 14 9 18 26 -- 67H-TR-S 4 13 13 28 -- 58Deshler--Dubbert 37, Ruhnke 12, Loomis 4, Finke 2, Buescher 12.H-TR-S--Lockard 7, Knudson 5, Bredemeier 16, Schaardt 8, Hain 16, Tackett 6.DILLER-ODELL 53, MERIDIAN 18Meridian 5 6 1 6 -- 18Diller-Odell 13 21 16 3 -- 53Meridian--Van Westen 8, Garcia 2, Schafer 5, Klipp 1, Sones 2.Diller-Odell--Meyer 6, Ebeling 3, McLaughlin 16, Jones 5, Klecan 6, Warren 12, Mohr 3, Jurgens 2.FREEMAN 54, SYRACUSE 36Syracuse 10 10 9 7 -- 36Freeman 15 10 12 17 -- 54Syracuse--Cavanaugh 7, Nannen 11, McCoy 12, Stubbendeck 6.Freeman--Archer 2, Yates 5, Eisenbarth 8, Anderson 8, Ideus 8, Adams 13, Unvert 10.HOLDREGE 57, FAIRBURY 50Holdrege 14 17 13 13 -- 57Fairbury 9 15 12 14 -- 50Holdrege--Engel 2, Bauman 15, Hilyard 22, Anderson 10, Florell 4, Reed 2, Lenaerts 2.Fairbury--Melcher 4, Robertson 16, Parrak 2, Cole 10, Peterson 2, Amundson 15, Arnold 1.JOHNSON-BROCK 72, PAWNEE CITY 38Pawnee City 9 11 8 10 -- 38Johnson-Brock 14 14 28 16 -- 72Pawnee City--Koester 9, Mawhiney 15, Lierz 4, Robison 6, Willey 3, Mitch 1.Johnson-Brock--Co. Fossenbarger 15, Volker 2, Glynn 20, Hahn 11, Westhart 4, Froisland 2, Moerer 3 Rowe 13, Davis 2.LINCOLN CHRISTIAN 52, NORRIS 36Lincoln Christian 7 14 11 20 -- 52Norris 7 10 7 12 -- 36Lincoln Christian--Bowman 2, Canfield 6, Langenberg 8, Bubak 24, McGerr 2, Kuszak 6, Carlson 4.Norris--Misko 3, Knudsen 11, Boe 3, Derter 3, Pankoke 9, Rice 2, Deveaux 2, Price 3.MALCOLM 47, WILBER-CLATONIA 46Malcolm 12 9 7 13 6 -- 47Wilber-Clatonia 9 6 18 8 5 -- 46Malcolm--Saltzman 10, Henson 5, Beekman 2, Johnson 14, Kuhn 14, Little 2.Wilber-Clatonia--Lee 5, Cerveny 8, Homolka 15, Rezabek 9, Whittington 9.TRI COUNTY 66, DILLER-ODELL 37Diller-Odell 5 16 8 8 -- 37Tri County 21 14 18 13 -- 66Diller-Odell--Mclaughlin 11, Warren 10, Jurgens 5, Meyer 4, Klecan 3, Martin 2, Arnold 2.Tri County--Siems 24, Niemeyer 19, Larson 16, Weise 4, Niemeier 2, Knust 1.GirlsCENTENNIAL 53, WILBER-CLATONIA 8Centennial 22 19 8 4 -- 53Wilber-Clatonia 2 4 0 2 -- 8Centennial--Hirschfeld 13, Kinnett 2, Cast 4, Dey 4, Hartshorm 12, Gierhan 6, Rathjen 2, Nisly 3, Stuhr 4, Ziegler 2.Wilber-Clatonia--Sand 2, Pecka 2, Rezny 4.DESHLER 41, PAWNEE CITY 28Deshler 12 10 5 14 -- 41Pawnee City 12 4 8 4 -- 28Deshler--Schardt 2, Lemke 2, Jaccobe 5, Oakman 10, Schmidt 3, Roth 19.Pawnee City--Koning 3, Martin 3, Branch 5, Menninga 11, Branek 6.FAIRBURY 42, LINCOLN LUTHERAN 26Fairbury 11 7 11 12 -- 42Lincoln Lutheran 6 3 11 6 -- 26Fairbury--Ohlde 20, Johnson, 6, Huss 5, Eden 11.Lincoln Lutheran--G. Moll 12, E. Moll 3, Jurgens 7, Bergt 2, Poppe 2.JOHNSON-BROCK 63, H-TR-S 36Johnson-Brock 15 12 17 19 -- 63H-TR-S 6 12 12 6 -- 36Johnson-Brock--H. Sandfort 12, A. Sandfort 9, Edwards 8, Hodges 14, Jo. Koehler 10, Ja. Koehler 10.H-TR-S--Novak 7, Glathar 24, Stalder 2, Schuster 3.LOURDES CC 32, FREEMAN 30Lourdes CC 9 10 8 5 -- 32Freeman 13 2 6 9 -- 30Lourdes CC--Fulton 5, Em. Heng 3, Bamert 9, Kreifels 3, Allgood 3, Meyer 5, Madison 2, McGowen 2.Freeman--R. Hartwig 6, B. Hartwig 2, Dorn 5, Oltman 6, Holland 11.WAVERLY 43, NORRIS 32Norris 6 4 8 14 -- 32Waverly 11 14 10 8 -- 43Norris--Mo. Ramsey 5, Collier 3, Waters 5, Stai 6, Kroeker 3, Chambers 4, Jelinek 6.Waverly--Schernikau 15, Lambrecht 9, Danson 7, Clarke 5, Martin 2, Bream 4, Hoos 1.WEEPING WATER 32, STERLING 28Weeping Water 9 9 12 2 -- 32Sterling 3 11 6 8 -- 28Weeping Water--Nissen 2, Wilson 2, Cave 11, Barrett 15, Ahrens 2.Sterling--M. Wingert 2, Wenzl 9, Huls 2, E. Wingert 2, Haner 5, Thes 8DILLER-ODELL 45, TRI COUNTY 42Tri County 11 6 8 17 -- 42Diller-Odell 7 11 10 17 -- 45Tri County--Freese 15, Connelly 5, Gerlach 2, Niemeyer 11, Strein 9.Diller-Odell--Heidemann 19, Barnts 4, Kostal 2, Jones 4, Smith 2, Vitosh 3, Swanson 11.FAIRBURY 43, HOLDREGE 17Holdrege 11 1 1 4 -- 17Fairbury 8 9 13 13 -- 43Holdrege--Stats not provided.Fairbury--Ohlde 3, Shumard 2, Johnson 6, DeBoer 3, Huss 10, McCord 9, Eden 10.H-TR-S 63, DESHLER 50H-TR-S 21 9 14 19 -- 63Deshler 12 9 15 14 -- 50H-TR-S--Novak 17, Glathar 21, Vasco 7, Stalder 8, Schuster 5, Schaardt 4, Zimmerling 1.Deshler--Ty. Schardt 2, Nash 3, Oakman 12, Tr. Schardt 2, Schmidt 5, Roth 26.JOHNSON-BROCK 60, PAWNEE CITY 29Pawnee City 2 10 5 12 -- 29Johnson-Brock 17 17 6 20 -- 60Pawnee City--De Young 8, Snyder 3, Wilcox 3, Menninga 10, Branek 5.Johnson-Brock--H. Sandfort 9, A. Sandfort 4, Edwards 11, Hodges 11, Buchmeier 2, Jo. Kuehler 13, Ja. Koehler 10.MALCOLM 54, WILBER-CLATONIA 18Wilber-Clatonia 0 3 4 11 -- 18Malcolm 17 14 17 6 -- 54Wilber-Clatonia--Kreshel 8, Martinez 2, Honea 3, Rezny 5.Malcolm--Reiling 11, Small 8, Teten 10, DeBaets 4, Sehi 8, Virus 4, Brady 9.NORRIS 50, LINCOLN CHRISTIAN 39Lincoln Christian 3 11 17 8 -- 39Norris 9 13 11 15 -- 50Lincoln Christian--Power 3, Ailes 10, Korte 8, Arnold 9, Hollenbeck 7, Johnson 2.Norris--Ramsey 4, Waters 4, Stai 20, Kroeker 7, Chambers 9, Collier 3, Jelinek 3.SOUTHERN 48, PARKVIEW CHRISTIAN 11Parkview Christian 2 2 2 5 -- 11Southern 18 11 18 1 -- 48Parkview Christian--Cole 3, Sundermann 2, Fulks 2, Ab. Anderson 2, Platter 2.Southern--Stats not provided.STERLING 61, EAST BUTLER 20East Butler 5 5 2 8 -- 20Sterling 14 12 21 14 -- 61East Butler--Sullivan 1, Aerts 3, R. Bergman 4, Main 6, Rigaluso 2, Buresh 2, Hummel 1, Helman 1.Sterling--M. Wingert 8, Wenzl 16, Walters 2, Huls 2, E. Wingert 8, Wusk 3, Haner 2, N. Harms 2, Thies 12, Agena 6.SYRACUSE 45, FREEMAN 34Syracuse 20 9 10 6 -- 45Freeman 11 7 4 12 -- 34Syracuse--Siefken 2, H. Wilhelm 2, Meyer 8, Moss 6, Nordhues 5, Damme 6, Vallertsen 2, Clark 14.Freeman--R. Hartwig 8, B. Hartwig 8, Dorn 10, Oltman 4, Holland 4.", "url": "https://apnews.com/062e85a44c1142a7a39aaf4814b8d5d2"}