{"authors": ["Natalie Shure", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Ben Burgis", "Luke Thibault", "Tim Higginbotham", "Michael Lighty"], "date_download": "2020-05-04 19:51:23", "date_modify": "2020-05-04 19:51:23", "date_publish": "2019-10-04 00:00:00", "description": null, "filename": "2019_10_donald-trump-medicare-advantage-health-insurance_1588621883.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/10/04145905/GettyImages-1178822122.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_10_donald-trump-medicare-advantage-health-insurance_1588621883.html", "title": "We Don’t Need More “Choice” - We Need Medicare for All", "title_page": "We Don’t Need More “Choice” — We Need Medicare for All", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "During a speech yesterday at an upscale Florida retirement village, Donald Trump announced a new executive order aimed at expanding the Medicare Advantage program — which allows private insurers to compete with traditional Medicare plans — so as to ward off the program’s alleged demise via Medicare for All. “Standing in solidarity with our nation’s seniors, I declare once again that America will never be a socialist country,” he said at the event. The order, titled “Protecting and Improving Medicare for Our Nation’s Seniors,” was originally, and hilariously, dubbed “Protecting Medicare from Socialist Destruction.”\nWith around one-third of Medicare-eligible seniors currently opting for private Medicare Advantage plans over traditional Medicare, one might be inclined to celebrate the fact that some 19 million elderly and disabled Americans are empowered to make the “choice” that’s best for them and their families. But a closer look exposes the problems inherent with this model, which further entrenches the commodification of health care and the byzantine financing system that facilitates it.\nWhen it comes to health insurance, we’ve never actually needed “choice.” We never have. Trump’s move is simply a push for more privatization within one of the nation’s largest public welfare programs — doubling down on related measures by the administration to boost private plans within the Medicare market.\nHere’s how the present system works: when someone becomes Medicare-eligible, they are able to select between traditional Medicare plans — which include heavy cost-sharing, and are often supplemented with private “Medigap” plans that cover costs that Medicare plans don’t — and private Medicare Advantage (MA) plans, which often offer a broader range of services, lower premiums, or out-of-pocket caps. In other words, MA plans can easily seem like the better deal.\nIf this dynamic sounds innocuous, it’s not: not only are MA plans permitted to entice enrollees with shiny carrots that indisputably inadequate traditional plans legally cannot, they make the math work by elbowing out the sickest patients. These private plans’ go-to strategy for cost-cutting is building plans with extremely limited provider networks — while nearly all providers accept traditional Medicare plans, fewer than half accept Medicare Advantage — and those who do often go through bureaucratic rigmarole to get prior authorization for necessary care.\nThe result is that MA enrollees have fewer choices of doctors, and often have to travel further to reach them — a deal breaker for people with extensive health care needs. Combined with the fact that the trickier research and enrollment process makes MA less accessible for patients with cognitive and emotional challenges, it’s no wonder that sicker and poorer patients are disproportionately likely to flee Medicare Advantage for its traditional public counterpart once their care needs become more significant. Despite their healthier, cherry-picked risk pool, MA plans notoriously pad their numbers by “upcoding” — massaging their billing practices to make patients appear sicker than they really are. Ultimately, MA costs more public money while spending less on care.\nIt isn’t just Trump or Republicans touting the wonders of private health insurance. Several Democratic candidates have emphasized that their health care proposals would maintain a robust role for private players. Kamala Harris’s plan explicitly envisions an expansion of MA. Other candidates have adapted versions of the “public option,” or its latest incarnation, “Medicare for All Who Want It” As Pete Buttigieg recently put it in a condemnation of Medicare for All, “The problem, Senator Sanders, with that damn bill that you wrote, and that Senator Warren backs is that it doesn’t trust the American people … I trust you to choose what makes the most sense for you, not my way or the highway.”\nI hate how eminently reasonable that sounds, because it isn’t. The logic of puffing up consumer “choice” of plans rests on a conflation of health care and insurance. Insurance is not, and has never been, “health care.” Your insurance plan is merely an entry ticket into the health care system, which includes a set of inscrutable and ever-shifting stipulations regarding the specific benefits you’re entitled to, and for how much. Lauding this kind of choice is nothing short of celebrating multitiered medicine.\nThat some people can “choose” to save cash by opting for a plan whose nearest specialists are 100 miles away, or “choose” to extend their strained monthly budgets by acquiescing to $5,000 deductibles, while others “choose” to shell out higher premiums for VIP access to whatever they need — is exactly the system we reject. Having a “choice” of insurance only ever benefits rich, healthy people. Poor and sick people are coerced into whatever “decision” they make about health insurance by definition.\nThe “choice” of what people pay and for what services ought to be made democratically and extended equitably to all people. Any health care proposal that retains a sizable role for private insurers — even with universal coverage — necessarily demands that health care be doled out by income and health status.\nWith Trump’s executive order, even more seniors are likely to “choose” Medicare Advantage moving forward. Real freedom would be no one ever having to.", "url": "https://www.jacobinmag.com/2019/10/donald-trump-medicare-advantage-health-insurance"}