{"authors": ["Dawn Foster", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman"], "date_download": "2020-05-04 19:56:22", "date_modify": "2020-05-04 19:56:22", "date_publish": "2019-10-10 00:00:00", "description": null, "filename": "2019_10_boris-johnson-brexit-labour-conservative-party-tory_1588622182.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/10/10164453/GettyImages-1174515725.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_10_boris-johnson-brexit-labour-conservative-party-tory_1588622182.html", "title": "We’re Sick of Boris Johnson’s Lies", "title_page": "We’re Sick of Boris Johnson’s Lies", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The Conservative Party conference felt muted this year: fewer ministerial speeches and announcements, fewer excited young activists — and far fewer attendees than Labour ever managed to muster. Boris Johnson’s speech was shorter than usual, came with almost no new announcements (aside from “faster broadband”), and wasn’t followed by the usual press huddle with his staff to answer questions. Even Jeremy Corbyn’s speech the week before at the Labour conference was longer, and his team had drastically shortened it when news came that MPs would be forced to rush back to the House of Commons after the UK Supreme Court declared Johnson’s prorogation of Parliament illegal.\nIt’s clear now that Boris Johnson has no desire to thrash out a deal on leaving the European Union. Instead, he’s appealing to the far right of the party, the hard fringe who want to crash out with no deal, relying on World Trade Organization rules rather than creating new rules in agreement with the EU. The offer Johnson put forward during the conference was deliberately designed to be rejected by the EU and Ireland, a purely performative deal concocted exclusively to give Johnson something to point at, to claim that the EU was immovable and wanted to see the UK punished for leaving.\nThe entire period has been punctuated by wild and aggressive briefings from an anonymous “Number 10 source,” happily tweeted out and published by lobby journalists with no critical analysis. The general public are deeply critical of this practice, knowing that many of the briefings are from Dominic Cummings, Johnson’s supposed mastermind, and many feel that he should put his name to these claims. On the other hand, the practice also means that any briefings from anonymous “Number 10 sources” are assumed to be Cummings and dismissed immediately.\nCummings’s briefings are designed to instill a sense of confusion, supporting Johnson’s deliberate goading of the EU. Despite Johnson’s insistence that the UK will leave the EU by October 31, and the Conservative Party conference slogan “Get Brexit Done,” parliamentary legislation means Johnson will be forced to ask for an extension if no deal has been agreed to by Halloween. Johnson and Cummings know we won’t leave by October 31, and the repeated insistence that the UK will do so is designed to feed into the narrative of “betrayal.” They know that once an extension is agreed upon, the opposition parties will agree to a general election, so the Brexit shenanigans and outré briefings are geared toward general election messaging, not Brexit.\nThe entire mess has proven that Cummings is not the evil genius he has been made out to be. He hasn’t helped Johnson run rings around the EU. Instead, he is creating a sense of utter chaos, pursuing a general election strategy that hopes to see the party mobilize the hard-right Tory voters that the Brexit Party is competing for. But this could cost them the more moderate wing of the party.\nDuring the New Labour era, general elections were fought by appealing almost exclusively to centrist swing voters who voted either Labour or Tory. This cost Labour dearly when the left of the party abandoned them. Many people I speak to in the party, who now knock on doors and deliver leaflets whenever they have free time, didn’t vote Labour until Corbyn became leader; many cast protest votes for the Green Party instead. The Liberal Democrats are convinced they will scoop up a windfall of seats in a general election by appealing to the center, now that they have nineteen MPs, thanks to defections from the Tories and from members of the tragicomic centrist party Change UK/The Independent group, who realized no one wanted to vote for them in the European Parliament elections.\nLabour are hurriedly putting candidates in seats and preparing for a general election. Despite tiresome claims in the media that their Brexit position is impossible to understand, most campaigners have pointed out it’s incredibly easy to explain on the doorstep: have a second referendum on Brexit, and if Leave wins again, try to get the best deal possible with the EU. When it comes to voting, most voters will see the election as a clear choice between Labour and the Conservatives. If the Brexit Party stand, they will eat into the Tory vote, causing Labour/Tory marginal districts to swing left. The Lib Dems are overly positive and haven’t addressed the problem that many voters still despise them for their role in implementing austerity and propping up a Tory government a mere five years ago. Voters aren’t as stupid as the Lib Dems believe, nor do they have amnesia: many young people have massive student debt because the Lib Dems broke their key 2010 election pledge to make university free, instead voting to raise student fees from £3,000 per year to £9,000.\nWe won’t leave the EU on the 31st of October, but we will have a general election in which Boris Johnson will speak endlessly about how Parliament forced him to ask for an extension, depicting it as a great betrayal — a deliberately dangerous right-wing narrative that echoes the words shouted by the man who murdered Labour MP Jo Cox in 2016, just before the referendum. Labour have a chance to achieve a majority and, with any luck, to implement sorely needed policies to reverse austerity and genuinely alter society to make the lives of the poorest and most precarious easier and more secure. Brexit won’t happen for a good while, and if it does, it will take far longer than the hard right believe: even No Deal is a process, not an immediate exit. Labour could win an election outright, and hopefully knock these hard-right chaotic villains out of Number 10 Downing Street.", "url": "https://www.jacobinmag.com/2019/10/boris-johnson-brexit-labour-conservative-party-tory"}