{"authors": ["Gabriella Muñoz The Washington Times"], "date_download": "2020-05-04 20:04:39", "date_modify": "2020-05-04 20:04:39", "date_publish": "2019-04-04 12:57:39", "description": "The House passed the Democrats' new version of the Violence Against Women Act in a Thursday vote, rejecting Republicans' pleas to quickly restore the old law, which expired earlier this...", "filename": "_c5eb6debd23209e604461b8984c8acd3_1588622679.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c5eb6debd23209e604461b8984c8acd3_1588622679.html", "title": "Democrats pass renewed Violence Against Women Act", "title_page": "Democrats pass renewed Violence Against Women Act", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The House passed the Democrats’ new version of the Violence Against Women Act in a Thursday vote, rejecting Republicans’ pleas to quickly restore the old law, which expired earlier this year.\nDemocrats’ legislation attracted bipartisan support, passing 263-158, with 33 Republicans voting for it.\nThe update would renew the 1994 law’s grant programs through 2024, would expand protections against discrimination for transgender individuals, extend tribal courts’ jurisdiction over non-Indians and create new categories of people banned from legally purchasing firearms.\n“Do not let the NRA bully you,” Rep. Debbie Dingell, who authored the gun control provisions, urged. “We’re not talking away due process. All it does is say if someone has been convicted convicted as an intimate partner, that they would not have access to a gun.”\nThe new gun control provisions would extend an existing ban on firearms purchases by someone accused of domestic violence against a spouse or live-in partner to also include dating couples and those convicted of a stalking misdemeanor charge.\nGOP lawmakers said that and other provisions stray too far from the core purpose of VAWA.\nThe expansion of protections for transgender individuals, for example, prioritizes LGBTQ community over privacy concerns of biological women in domestic abuse shelters and prisons, said Rep. Louie Gohmert, Texas Republican.\n“This bill in the name of equality says women are not going to be able to have a safe place from biological men,” he said.\nThe Violence Against Women Act was last renewed in 2013, but House Speaker Nancy Pelosi allowed it to expire earlier this year.\nRepublicans said she wanted to create pressure so Congress would be forced to accept Democrats’ new proposed changes.\n“They have sought to turn this bill into a political weapon rather than a resource for law enforcement,” Rep. Doug Collins, the top Republican on the Judiciary Committee, said on the House floor. “Instead of negotiating in good faith, they have decided a highly partisan bill with zero chance of moving forward in the Senate was the best way to approach reauthorizing crucial VAWA programs.”\nRepublicans attempted to push a short-term renewal of the old VAWA bill, saying it would restore the law immediately.\nDemocrats refused that gesture.\n“It is a short and incomplete reauthorization,” Ms. Dingell said.\nHouse Majority Leader Steny H. Hoyer stood behind his party’s decision to hold out for the new provisions despite the likely rejection it will face in the next chamber.\n“Our calculation was that we’re in charge now, we can pass a bill that we think is a comprehensive bill to protect all women,” he told reporters on Tuesday. “I’m hopeful that the Senate will take it up or ask to go to conference on it. But we need to reauthorize it.”", "url": "https://apnews.com/c5eb6debd23209e604461b8984c8acd3"}