{"authors": ["Taylor Stuck The Herald-Dispatch Tstuck Heralddispatch.Com"], "date_download": "2020-05-04 20:09:32", "date_modify": "2020-05-04 20:09:32", "date_publish": "2019-01-29 08:16:01", "description": "CHARLESTON — The House of Delegates' Finance Committee passed a bill Monday to exempt all Social Security income from the state's income tax. The bill aligns with what Gov. Jim Justice...", "filename": "_f952a05845fe431589f64bacf69cee60_1588622972.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f952a05845fe431589f64bacf69cee60_1588622972.html", "title": "Bill passed to exempt Social Security from state income taxes", "title_page": "Bill passed to exempt Social Security from state income taxes", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHARLESTON — The House of Delegates’ Finance Committee passed a bill Monday to exempt all Social Security income from the state’s income tax.\nThe bill aligns with what Gov. Jim Justice proposed in his State of the State address. West Virginia is one of only 13 states that tax Social Security income.\nThe committee chose to amend House Bill 2001, which exempted Social Security from being taxed below a certain income level and phased the exemption out over three years. The amended version exempts all Social Security regardless of a person’s total income and it would go into effect this year.\nRich Stonestreet, president of West Virginia AARP, said the group is ready to support any version of a Social Security income exemption. He said the issue is one most frequently discussed by his members.\nSome delegates, chief ly Del. Larry Rowe, D-Kanawha, expressed concern the bill was only a tax break for the wealthy.\nCurrently, 78 percent of the 468,120 Social Security beneficiaries in the state are exempt from Social Security taxation because their total income is below $25,000 (for a single filer). Those with a total income between $25,000 and $34,000 can have up to half of Social Security benefits taxed, and those bringing in more than $34,000 can have 85 percent of their benefits taxed.\nRowe’s fears are supported by the West Virginia Center for Budget and Policy, which says 64 percent of those who will benefit from the tax cut make more than $91,000 a year, or the top 20 percent of earners in the state.\n“Those with lower incomes will receive virtually no tax savings from eliminating the tax on Social Security,” WVCBP executive director Ted Boettner wrote in a blog post about the topic. “Instead of eliminating the tax on Social Security, policymakers could eliminate the tax for those with incomes below $100,000 (filing jointly) and use the savings to give a bottom-up tax cut to low-income working families that need it the most.”\nStonestreet and the AARP, however, say that is not the case.\n“There is a retired teacher in Fayette County, and I do her taxes for her,” Stonestreet said. “She’s not a high income person, but she has teacher retirement, Social Security and because her children and grandchildren are out of state, she has to fly to see her kids so she does a lot of substitute teaching...She’s in the 85 percent bracket — the max you can be taxed. She will benefit from this.”\nRegardless of who benefits the most, says Del. Isaac Sponaugle, D-Pendleton, taxing Social Security income is unfair.\n“You pay Social Security on your payroll when you are working, then the state of West Virginia and the federal government turns and takes when you start receiving it,” he said. “That’s double taxation and that’s not fair.”\nThe state will lose about $50 million in tax revenue with the exemption. Justice built it into his budget bill.\nRowe said with the state taking a loss, the committee needs to still remember senior centers and senior support programs are still in desperate need of more funding.\n“The folks who are really needy aren’t really benefiting from this bill because we already exempt them,” Rowe said. ”...We have got to come up with funds way over $50 million to support them.”\nThe bill passed unanimously out of the committee and heads to the full House for consideration.\nFollow reporter Taylor Stuck on Twitter and Facebook @TaylorStuckHD.", "url": "https://apnews.com/f952a05845fe431589f64bacf69cee60"}