{"authors": ["Dawn Foster", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Daniel Finn", "John Cooper"], "date_download": "2020-05-04 19:55:46", "date_modify": "2020-05-04 19:55:46", "date_publish": "2019-02-22 00:00:00", "description": null, "filename": "2019_02_dead-center-independent-group-labour-defectors_1588622146.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/02/22114804/GettyImages-1126195793.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_02_dead-center-independent-group-labour-defectors_1588622146.html", "title": "Dead Center", "title_page": "Dead Center", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Nearly four years ago, the United Kingdom went to the polls. At the time, living in south London, I weighed up the options on my ballot paper. A Labour Party selling mugs with the slogan, “Controls on Immigration,” not traditionally a stirring socialist phrase; a leader who’d campaigned in front of an absurd eight-foot high concrete slab that ended up functioning as his own political tombstone; and a local candidate so center-right I ended up spoiling my ballot. The country seemingly felt similarly: what should have been an easy win for Labour instead became a victory for the Conservatives, and caused such turmoil in Labour that Jeremy Corbyn secured a surprise and thumping victory in the race for the party leadership.\nThe local candidate I deemed so undesirable as to deny him my vote this week left the party and created a new outfit that he insisted wasn’t a party: Chuka Umunna joined with seven Labour MPs and three Conservatives to forge a centrist party no one had asked for. The Liberal Democrats already exist, after all — and poll abysmally. Asked what they stood for, the new grouping championed austerity and the Conservatives’ previous public service cuts, oppose both nationalization (one of the most popular of Labour’s policies) and increases in marginal tax rates on the wealthiest, and oppose Brexit. In an interview with the BBC, former Conservative MP Anna Soubry said the group was in favor of “sensible policies for a stable economy,” a phrase utterly devoid of meaning: no party is openly advocating “absolute lunacy for a blazing garbage fire of an economy”.\nBut it speaks to the patronizing philosophical core of centrism: that conservatism, liberalism and democratic socialism are all mere distractions, and that a Frankenstein’s monster of a party combining the worst of all their aspects is what the public are crying out for. What have “The Independent Group” created? A party squarely of the establishment, almost designed by committee to appeal exclusively to career politicians and newspaper columnists.\nCentrism and the Third Way carries with it a particular patronizing nasal tenor: melding selected tenets of socialism and capitalism, but openly challenging only the former, never the latter, is held to be simply a more “grown up” way of doing politics. The defeat of the Labour Right and the shock referendum result only amplified this peculiarly loud tendency in British politics. Obsessive Remainers invariably characterize themselves as exasperated adults, the only mature cohort left in politics, shouting into the wind like King Lear. Everyone opposed to reversing the referendum result is cast as a knuckle-dragging clod — regardless of whether they actually voted to leave or begrudgingly accepted the will of democracy after a binding referendum — with only centrists as the voice of cool, (always) middle-class reason.\nThe calling card of this particular type of centrist is a preternatural pride in the fact they not only work with their ideological opponents, but even count them amongst their close friends. Here, The Independent Group have taken this feature to its logical conclusion and left their original parties for a new shared home with their traditional ideological enemies. In 2017, newly elected member of Parliament Laura Pidcock told an interviewer, “whatever type [Conservatives] are, I have absolutely no intention of being friends with any of them. I have friends I choose to spend time with. I go to parliament to be a mouthpiece for my constituents and class – I’m not interested in chatting on.” The apoplectic centrist rage was phenomenal: an endless stream of professional commentators, political staff and casual political critic expressed absolute disbelief that Pidcock preferred friends of the same political background. Doing so, dozens of articles claimed, showed an immaturity ill-fitting for an elected representative. At no point did Pidcock say she wouldn’t work alongside Conservative MPs to attain important political goals — merely that she didn’t desire to spend her social life engaged in cross party banter.\nSelf-congratulatory public praise for your ideological enemies might be depicted as a mark of political sophistication, but it belies a particularly privileged position. You can rarely work together if they utterly despise you. Scrutinize the history of the Conservative Party and its hatred of the poor, single mothers, people of color, and many other groups comes to the fore like a brass rubbing. The limits of cooperation are set by these value judgments. The MP Frank Field was praised repeatedly for his commitment to working cross-party to combat poverty. Two points are worth examining here. First, he left the Labour party to become an independent after decades of being considered one of the most right wing politicians within the Labour fold. Second, there are different approaches to “combatting poverty,” and Field’s, which included housing poor families in shipping containers under bridges as a punishment, suited the Conservatives’ agenda by dovetailing with a mindset that blamed the poor for their own fecklessness, and offered “routes out of poverty” rather than the eradication of destitution and the more equal distribution of wealth. The Independent Group will only function as a party while they focus on opposition to Brexit as their core shared belief, fighting poverty and inequality simply will not feature in any mooted manifesto.\nIn British, and lately Irish, politics, the past few years have seen burgeoning interest in the prospect of a new centrist party to mop up those who have a vitriolic antipathy towards Corbynism, along with disillusioned Liberal Democrats and soft Tories. Finally, after endless plots, one has launched.\nThe MPs who have jumped ship and joined The Independent Group are adamant there is a gaping hole in politics that can only be filled with exhumed Blairism. Never mind that Miliband lost despite having every opportunity to win the 2015 general election, or that Labour experienced its biggest boost in membership and greatest share of the popular vote in recent memory because of the vitality of Corbynism. And yet these MPs are curiously reluctant to prove this appeal by doing the decent thing and moving to a by-election, standing as independents rather than Labour or Tory candidates. Joan Ryan, the MP for Enfield North saw her vote margin increase tenfold between the 2015 and 2017 general elections. The difference? A new leader of the Labour party. If Ryan genuinely believes her stunning individual performance as an MP is the reason for the huge boost, she should force a by-election and prove it. But she won’t: like fellow splitter Gavin Shuker, Ryan lost a no-confidence vote in her local party in September 2018. I was unable to read her tweeted resignation letter, having been blocked for suggesting that her calling local members “Trots, Stalinists and Communists” was disrespectful and bore no resemblance to reality. For now, the 11 MPs are more than happy to cling to their seats, won with Labour and Conservative money and the hard work of local activists, now abandoned for personal opportunism.\nThe drift is pure delusion. A small subset of people who may once have considered themselves left-wing, but have veered to the center and right as the result of advancing age and accumulated wealth, continue to cling to the belief they constitute a far larger demographic than reality illustrates, and have the media connections to agitate and publicize their vanity projects. The Liberal Democrats show what happens when centrism reaches power, as they did in 2010 with the Tory-Lib Dem coalition government: constituting a small minority, the only positive benefit they can claim to offer is to act as the brakes on socially ruinous policies. The reality is worse: centrists are simply whipping boys for the larger party. The best example of this Stockholm Syndrome is this anecdote from a former Lib Dem adviser, obscenely proud of having demanded a policy of charging for plastic grocery store bags, in exchange for agreeing to ruinous Tory-sponsored sanctions for the poorest on social security benefits:\nThe Lib Dems’ vote has collapsed and Miliband’s campaign failed — whereas a Labour party that proudly calls itself socialist, wants to renationalize utilities, make society fairer, and make low-paid workers better off has done far better electorally. Centrism fails because on the face of it, it tries to be everything to everyone, which invariably means favoring the rich over the poor. But it also carries with it a patronizing tone that pervades politics and alienates voters. Citizens know who they want to vote for, and it’s generally based on party and policies, rather than the name recognition of a mid-ranking London-based celebrity.\nCentrism will always fail for as long as it attempts to sanitize conservative policies in the guise of a vanity project. Come polling day, the “Independent” MPs are in for a sharp shock.", "url": "https://www.jacobinmag.com/2019/02/dead-center-independent-group-labour-defectors"}