{"authors": ["Gilbert Baez", "Wral Reporter"], "date_download": "2020-05-04 20:08:14", "date_modify": "2020-05-04 20:08:14", "date_publish": "2019-03-19 18:57:00", "description": "A Hoke County commissioner running for lieutenant governor had a frightening encounter over the weekend when he returned to his townhouse in Greenville and discovered that it had been ransacked...", "filename": "_583ee0209cb2fa199ffd9e7970170b86_1588622894.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_583ee0209cb2fa199ffd9e7970170b86_1588622894.html", "title": "Shotgun-wielding Hoke County commissioner says he held home intruders at bay during break-in", "title_page": "Shotgun-wielding Hoke County commissioner says he held home intruders at bay during break-in", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Hoke County commissioner running for lieutenant governor had a frightening encounter over the weekend when he returned to his townhouse in Greenville and discovered that it had been ransacked and the burglars were still inside with him. Parts of the incident was recorded when Commissioner Allen Thomas, who stays on the second floor of a three-level townhouse at the Carolina Creek Apartments, posted the incident on Facebook as it was happening.\nAccording to a statement by the Thomas campaign, the county commissioner decided to take a break from campaigning when he returned to his secondary home in Greenville Saturday around noon.\nThomas said he saw several men in the downstairs common area but he assumed they were guests of the resident who lives on the first floor. The apartments in the unit share a downstairs common area.\nWhen Thomas went upstairs, he found that his bedroom had been ransacked.\nThomas said he locked his bedroom door and called 911 and took out a shotgun that was hidden in the room.\nThe intruders came upstairs and knocked on the door, saying they had left several items in the bedroom, including knives and a stun gun.\nThomas cocked his shotgun, which he says was loaded with three rounds.\n“I was telling (them) that was my limit,” he said, adding that he warned them not to try and enter his bedroom. “If (they) came through (the door), I would shoot.”\nThomas said the suspects told him that they had left a phone in the bedroom and they wanted it back.\n“I didn’t see a phone, so I couldn’t tell if he was trying to gain back access,” Thomas said. “I didn’t know he had a weapon.”\nIn the video posted to Facebook, you can hear the shotgun being loaded. You can also hear him talking to someone through the bedroom door.\nThomas said the standoff lasted for several minutes before the men decided to leave without trying to enter the room.\nThomas never fired his weapon.\nGreenville police arrived on the scene about 10 minutes after he made the call to 911, but no one has been arrested in connection with the incident as of Tuesday.\nThomas says he feared for his life and says he recorded the incident in case he had to shoot.\nHe said he wanted to show he was acting in self-defense if the intruders were wounded or killed.", "url": "https://apnews.com/583ee0209cb2fa199ffd9e7970170b86"}