{"authors": ["Gabriella Muñoz The Washington Times"], "date_download": "2020-05-04 20:05:45", "date_modify": "2020-05-04 20:05:45", "date_publish": "2019-02-25 08:42:49", "description": "President Trump defended his plan for border security Monday, as 58 former national security officials are reportedly preparing to release a formal rebuke of his national emergency...", "filename": "_4b2ea2771019aea2c8395e7308efa29c_1588622745.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4b2ea2771019aea2c8395e7308efa29c_1588622745.html", "title": "Trump urges GOP to stay strong on emergency declaration as security officials prepare to push back", "title_page": "Trump urges GOP to stay strong on emergency declaration as security officials prepare to push back", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Trump defended his plan for border security Monday, as 58 former national security officials are reportedly preparing to release a formal rebuke of his national emergency declaration.\n“We have a State of Emergency at our Southern Border. Border Patrol, our Military and local Law Enforcement are doing a great job, but without the Wall, which is now under major construction, you cannot have Border Security,” he tweeted. “Drugs, Gangs and Human Trafficking must be stopped!”\nThe Washington Post first reported Sunday night that the group of former security officials who served under both Republican and Democratic administrations will counter the president’s argument that a national emergency exists.\n“Under no plausible assessment of the evidence is there a national emergency today that entitles the president to tap into funds appropriated for other purposes to build a wall at the southern border,” the group wrote.\nMr. Trump made the decision to declare a national emergency to access additional funds to build portions of his border wall after the congressional compromise reached earlier this month allocated him $1.375 billion a fraction of the $5.7 billion he request for border fencing.\nThe letter is expected to be released on Monday and submitted to the Congressional Record, according to The Post.\nThe House is set to vote on legislation Tuesday to block the president’s declaration, though it remains unclear if the bill can pass the Senate, where some Republicans have criticized Mr. Trump’s decision.\nThe president vowed to veto any attempt from Congress to block his path.\n“I hope our great Republican Senators don’t get led down the path of weak and ineffective Border Security,” the president tweeted. “Without strong Borders, we don’t have a Country - and the voters are on board with us. Be strong and smart, don’t fall into the Democrats “trap” of Open Borders and Crime!”", "url": "https://apnews.com/4b2ea2771019aea2c8395e7308efa29c"}