{"authors": ["Tara O'Neill"], "date_download": "2020-05-04 20:07:01", "date_modify": "2020-05-04 20:07:01", "date_publish": "2019-02-21 20:05:31", "description": "MILFORD — Two people have been arrested in connection with a video released by Milford police on Thursday that shows suspects trying to break into vehicles in the city overnight. “Through...", "filename": "_0b2ff861b41744a6b1fd3948fe4100fa_1588622821.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0b2ff861b41744a6b1fd3948fe4100fa_1588622821.html", "title": "Thieves caught on video trying to break into vehicles in Milford", "title_page": "Thieves caught on video trying to break into vehicles in Milford", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Thieves caught on video trying to break into vehicles in Milford\nMILFORD — Two people have been arrested in connection with a video released by Milford police on Thursday that shows suspects trying to break into vehicles in the city overnight.\n“Through diligent efforts and community involvement, MPD has made two arrests in regards to the vehicles gone-thru overnight in Milford,” a tweet from the department said. “In addition, one vehicle and several items that had been reported stolen have been recovered.”\nThe identities of the suspects and their charges were not immediately released.\nVideo footage that captured two suspects attempting to break into vehicles in Milford on Wednesday night was released by the city police department on Thursday. It was unclear if the two people caught on video were the two people that police arrested.\nIn the video, a dark colored Subaru station wagon comes into frame before it comes to a stop and two occupants get out.\nThe two suspects run to two separate driveways across the street from each other and pull on the driver’s side door handle to try to get into the vehicles. With no luck, the two suspects can be seen running back toward the Subaru.\nMilford police said there was a rash of unlocked vehicles that were riffled through overnight. The department said the Subaru was occupied by three male suspects.\nAnyone with information is asked to contact Milford police at 203-878-6551.", "url": "https://apnews.com/0b2ff861b41744a6b1fd3948fe4100fa"}