{"authors": ["Luke Savage", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:03", "date_modify": "2020-05-04 19:50:03", "date_publish": "2019-06-13 00:00:00", "description": null, "filename": "2019_06_sanders-democratic-socialism-speech-freedom_1588621803.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/06/13171609/GettyImages-1154838361.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_06_sanders-democratic-socialism-speech-freedom_1588621803.html", "title": "Winning Socialism Is About Winning Freedom", "title_page": "Winning Socialism Is About Winning Freedom", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Yesterday, in a major address at George Washington University, Bernie Sanders outlined his vision of a democratic socialism for the twenty-first century.\nAmong his most expansive to date, the speech embraced a few themes the senator has been invoking for years: the urgent need for universal social programs like Medicare For All and liveable wages; the unchecked tyranny of corporate actors like Amazon and Disney; the growing divide in American society between ordinary people and an entrenched class of wealthy elites. Echoing these in an international context, Sanders also warned of the growing threat posed by an increasingly menacing authoritarian right melding corporatism and xenophobia with a disdain for civil liberties — a current that’s become all-too visible in the United States under Donald Trump.\nHeavy on references to FDR and the New Deal, Sanders attempted a difficult balancing act: embracing and championing the socialist label in a country traditionally hostile to it while pitching socialist values in terms designed to be legible to the average person. To this end, he also invoked Martin Luther King Jr’s famous declaration that America has “socialism for the rich and rugged individualism for the poor.”\nThe most novel use of this strategy arguably came in the speech’s second half as Sanders sought to advance a vision of freedom rooted in economic rights, including the right to a decent job that pays a living wage; to quality health care, to a complete education, to affordable housing, to a clean environment, and a secure retirement.\n“Freedom is an often-used word,” declared Sanders, “but it’s time we took a hard look at what that word actually means.” He continued:\nAsk yourself: what does it actually mean to be free? Are you truly free if you are unable to go to a doctor when you are sick, or face financial bankruptcy when you leave the hospital? Are you truly free if you cannot afford the prescription drug you need to stay alive? Are you truly free when you spend half of your limited income on housing, and are forced to borrow money from a payday lender at 200 percent interest rates? Are you truly free if you are seventy years old and forced to work because you lack a pension or enough money to retire? Are you truly free if you are unable to go to attend college or a trade school because your family lacks the income? Are you truly free if you are forced to work sixty or eighty hours a week because you can’t find a job that pays a living wage? Are you truly free if you are a mother or father with a newborn baby but you are forced to go back to work immediately after the birth because you lack paid family leave?\nAlthough Sanders invoked the New Deal — a social-democratic movement whose program was only partially adopted — his pitch nevertheless had firmly socialist undertones, pitting the market and the powerful private tyrannies it enables in opposition to freedom itself.\nWho, after all, is ultimately responsible for problems like unemployment, low wages, high medical costs, and chronic job insecurity? Most of America’s liberals now so thoroughly accept the rule of the market that they’re unable to offer a precise or satisfactory answer — preferring to cast social ills as innocent corollaries of an ultimately desirable economic system. (A conservative and unambitious policy agenda naturally follows.)\nSocialists, on the other hand, have long understood that class stratification, poverty, and economic deprivation are in fact both created and necessitated by capitalism: imposed on the majority by the imperative to generate profits, cut labor costs, and commodify every aspect of life.\nReal freedom therefore requires a whole lot more than the basic civil and political rights enshrined in a liberal constitutional order. It is simply not enough to be free from arbitrary coercion by other people or the state — true freedom also means independence from the dictates of the market: its bosses, its tycoons, its profiteers, its expropriation of the wealth workers collectively create.\nBy framing the argument for his program in these terms, Sanders is taking up the difficult but necessary task of reclaiming freedom from the Right.\nThe conservative movement’s decades-long assault on the postwar settlement, after all, carried its own conception of freedom — one rooted firmly in markets and the supposed agency of individuals within them. Key to this were bootstrap idioms like “personal responsibility,” which cast hardship as the product of individual failure and grotesque wealth as the preeminent marker of social value and success.\nThis populist thrust, though key to the New Right’s triumph in the 1980s, has proven totally illusory to the vast majority now beset by soaring medical bills, tuition fees, cripplingly low wages, and a democratic institutions perpetually disciplined by market pressure. Years of unbound finance, privatization, and neoliberal deregulation have unsurprisingly failed to make people freer, and now threaten to create new and more powerful forms of oligarchy.\nDespite what generations of conservative economists and politicians have insisted, equality and freedom are in fact mutually interdependent — the former being an essential precursor to the latter and its natural and indispensable ally.\nBy advancing economic rights as the basis for freedom, Sanders is in essence turning the Right’s definition on its head. While there remains much more to be done, his campaign is laying the groundwork for a sweeping redefinition of the political and economic orthodoxies that have long dominated American society — and offering millions a richer and more textured definition of freedom than most have ever known.", "url": "https://jacobinmag.com/2019/06/sanders-democratic-socialism-speech-freedom"}