{"authors": ["Jennifer Bolton"], "date_download": "2020-05-04 20:21:50", "date_modify": "2020-05-04 20:21:50", "date_publish": "2019-03-29 05:00:00", "description": "Marked by booming cannon and crackling rifles, the annual San Jacinto Day Festival in La Porte can be counted on to draw tens of thousands to celebrate the 1836 Battle of San Jacinto that led to...", "filename": "_f9a9ea47d5e2402a90a07815e353bf68_1588623710.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f9a9ea47d5e2402a90a07815e353bf68_1588623710.html", "title": "Fire aftermath forces cancellation of San Jacinto Day Festival", "title_page": "Fire aftermath forces cancellation of San Jacinto Day Festival", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Marked by booming cannon and crackling rifles, the annual San Jacinto Day Festival in La Porte can be counted on to draw tens of thousands to celebrate the 1836 Battle of San Jacinto that led to Texas independence.\nBut this year the guns will be silent, with the festival proving to be the latest victim of disruptions caused by the recent fire at the Intercontinental Terminals Co. chemical plant in Deer Park.\n“Our train of thought has always been safety first with our guests,” Larry Spasic, president of the San Jacinto Museum of History, said in explaining why the April 13 event was canceled for only the second time in 35 years.\nFirefighting foam and a mixture of chemicals that flowed down the Houston Ship Channel from the ITC terminal have impacted up to two miles of shoreline along the park, along with the park’s Santa Anna Bayou.\n“Different entities have conducted air quality testing, and there have been hot spots of elevated benzene levels,” Spasic said. “The winds change where those are located, and even as we felt things were settling down, they became unsettled, and we don’t want to put Texans or their guests in danger.”\nPostponing the event was out of the question, said Bill Irwin, superintendent of the the San Jacinto State Historic Site Complex.\nInside the park, the San Jacinto Monument and Battleship Texas have been closed since the fire.\nThe last time the festival was canceled was more than a decade ago when large electrical storm posed a risk to the expected crowd of between 10,000 and 20,000 people, Spasic said.\nFought on April 21, 1836, the battle saw Gen. Sam Houston’s Texian army surprise and destroy a force under Mexican President Antonio Lopez de Santa Anna. Houston forced Santa Anna to sign a treaty recognizing Texas independence.\n“To me, this is the most sacred site in Texas, and we’ve been very lucky to be able to celebrate it so many times,” Spasic said.\n“When it comes to our guests, we must be prudent and careful and thoughtful in our decisions, and this is what we’ve done,” he said. “We don’t know what next week or the week after will bring, but we need to know that anyone who comes out when will be safe.”", "url": "https://apnews.com/f9a9ea47d5e2402a90a07815e353bf68"}