{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:06:08", "date_modify": "2020-05-04 20:06:08", "date_publish": "2019-01-30 11:35:38", "description": "The Westford Academy boys basketball team rallied from a 16-point deficit and earned a come-from-behind 55-46 victory over a scrappy Bedford squad on Tuesday night. Junior Declan Morse led...", "filename": "_94be2199bcfc41f6a2ccb0c95ab93677_1588622768.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_94be2199bcfc41f6a2ccb0c95ab93677_1588622768.html", "title": "Westford Rally Drops Bedford", "title_page": "Westford Rally Drops Bedford", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Westford Academy boys basketball team rallied from a 16-point deficit and earned a come-from-behind 55-46 victory over a scrappy Bedford squad on Tuesday night.\nJunior Declan Morse led the way for the Grey Ghosts with 17 points, 9 rebounds and 2 blocks. Junior Jake Barisano (4 rebounds, 4 assists) had a clutch fourth quarter with all of his 7 points coming in that frame.\nWestford Academy 55\nBedford 46\nSenior captain Adam Scaramuzzo had 10 points for WA, while senior captain Scott Beattie had 7 points, including 6 big free throws at the end of the game.\nSenior Michael Zacharachuk (7 rebounds) and senior captain Ben Lawrence each chipped in with 6 points.\nShawsheen Tech 75\nEssex Tech 32\nEverybody played for Shawsheen (11-3) and everybody scored.\nJunior Santino Garofalo had 9 points and 11 rebounds for the Rams. Senior John Pilla had 7 points and 10 rebounds. Josiah Martinez had 5 points and 5 steals.\nPelham 58\nSouhegan 41\nIn a battle between two of the top teams in New Hampshire Division 2, Pelham (10-2) locked down Souhegan (7-3) with excellent defense.\nThe Pythons led 48-27 after three quarters and cruised to the victory.\nDerek Crowley had 20 points for PHS. Zach Jones chipped in with 12 points and 8 rebounds.\nLowell 87\nDracut 61\nThe Red Raiders came out firing, scoring 54 points in the first half en route to the MVC romp.\nLowell (14-2) received 16 points, 9 assists and 4 steals from Nate Siow. Deven Okuwuga added 16 points. Carlos Nunez collected 12 points, while Justin Villanueva chipped in 8 points and 10 rebounds.\nPlaying well for the Middies (8-7) in defeat were JC Santiago with 14 points, Mitchell Monette with 10 points and 4 assists, and TJ Guerrero with 8 points and 5 rebounds.\nWhittier 65\nGreater Lowell 49\nThe Gryphons dropped to 11-3 on the season.\nLuis Mota put in 17 points for Greater Lowell. Luis Huertas had 11 points. Jacob Burk also played well with 7 points.\nCentral Catholic 84\nBillerica 68\nJunior forward Shawn Colby had 18 points in the loss for Billerica (8-7) against a very talented Central squad.\nSenior guard Jake Loftin had 17 points and junior forward Ryan Murphy had 16 points for the Indians. Sophomore guard Ankeet Patel had 12 points.\nBromfield 55\nLittleton 37\nTrailing only 23-18 at halftime, the Tigers watched the Mid-Wach road game slip away in the second half.\nLittleton (8-7) received 11 points from senior forward Luke Elliott and 10 points from Ross Cotnam. Bromfield scored 21 points in the fourth quarter.\nGroton-Dunstable 54\nNashoba Regional 31\nGroton-Dunstable ran its record to 12-3 overall and 5-1 in Mid-Wach B.\nAs he has done all year long, senior Evan Cook paced the Crusaders’ attack with a game-high 19 points. Cook converted an old-fashioned 3-point play with five seconds left in the third quarter to put the game out of reach as the visitors held a 42-28 lead heading into the fourth.\nGrafton 49\nNorth Middlesex 44\nDespite a game-high 19 points from Alban Baboci, the Patriots (0-14) fell in Townsend.\nLawrence 68\nChelmsford 34\nChelmsford fell behind 32-16 at the half and never threatened in the final two quarters.\nGraham Jeffries led the Lions with 11 points and 8 rebounds.", "url": "https://apnews.com/94be2199bcfc41f6a2ccb0c95ab93677"}