{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:14:27", "date_modify": "2020-05-04 20:14:27", "date_publish": "2019-02-13 06:58:00", "description": "It doesn’t take a business degree to know that shopping malls aren’t the economic powerhouses they used to be. The retail economy in general these days seems to be an iffy proposition. And yet,...", "filename": "_18ed1f7751774613876dcb2681a531bc_1588623267.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_18ed1f7751774613876dcb2681a531bc_1588623267.html", "title": "New plan for The Shops is welcome development for Havasu's anemic mall", "title_page": "Our View: New plan for The Shops is welcome development for Havasu's anemic mall", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It doesn’t take a business degree to know that shopping malls aren’t the economic powerhouses they used to be. The retail economy in general these days seems to be an iffy proposition. And yet, one can’t help but look at Havasu’s version of a mall, The Shops at Lake Havasu, and see the potential that exists for our town’s largest shopping center.\nThe Shops were a victim of bad timing. When the shopping center was proposed 14 years ago, developers speculated it would eventually be one to three anchor stores, four to six mini-anchors, a movie theater, and roughly 80 to 90 shops, with about 1,400 full-time employees. It wasn’t long after they broke ground that Lake Havasu City, along with the rest of America, was caught up in the Great Recession.\nToday, there are many vacancies at The Shops, and despite a commendable effort to hang on by developers and retailers, it’s been pretty clear for a while that old business models aren’t going to work in that space.\nFortunately, Havasu is home to people like Jarrett Portz, a business owner with a background in private equity. Portz bought 200,000 square feet of the mall, about a third of the total space there, and plans to focus on restaurant and entertainment businesses to create more of a destination atmosphere. (That’s an important development for locals who feel like a trip to The Shops is too long of a drive.) More importantly, however, Portz has a plan to focus on what he calls omnichannel retailers — basically, an approach to sales and marketing that incorporates a combination of mobile browsing, internet shopping and brick-and-mortar customer service. It’s a trend that’s already caught on at the mall’s three anchor stores.\nPortz hopes to kick start his plan with the addition of Our Pampered Home, a Havasu-based internet retailer that will open its first showroom at The Shops. The whole venture is admittedly a risky one, but Havasu is a city that has found great success with risky ventures. With any luck, other smart mom-and-pops will follow, and The Shops will finally thrive.\n— Today’s News-Herald", "url": "https://apnews.com/18ed1f7751774613876dcb2681a531bc"}