{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:09:21", "date_modify": "2020-05-04 20:09:21", "date_publish": "2019-01-30 05:01:01", "description": "HD Media BUFFALO - Twenty-two talented students from across Putnam County came together to compete in the 2019 Putnam County Schools Spelling Bee hosted at Buffalo High School on Thursday,...", "filename": "_080b6855e07a4093ad421119884db8b0_1588622961.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_080b6855e07a4093ad421119884db8b0_1588622961.html", "title": "Putnam crowns 2019 Spelling Bee champion", "title_page": "Putnam crowns 2019 Spelling Bee champion", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HD Media\nBUFFALO - Twenty-two talented students from across Putnam County came together to compete in the 2019 Putnam County Schools Spelling Bee hosted at Buffalo High School on Thursday, Jan. 17, sponsored by Poca Valley Bank.\nAfter an hour-and-a-half-long bee lasting 14 rounds, Jensine Atkins, an eighth-grader at Winfield Middle School, became the new Putnam County Schools Spelling Bee Champion.\nJensine correctly spelled the anticipated Championship Word, “iguana,” receiving the title of 2019 Putnam County Schools Spelling Bee Champion. The Putnam County Schools Bee runner-up is Avery Rader of Winfield Elementary, and alternate is Jaxson Davis of Poca Elementary.\nEvent judges included Putnam County Schools Assistant Superintendent of Curriculum and Instruction Sonya Shue; Director of Elementary Education Debbie Shrewsbury; and Director of Adolescent Education Lynda Rumbaugh. Special guest pronouncer for the evening was Megan Tarbett, director of the Putnam County Libraries.\nPutnam County Schools would like to thank the 2019 Spelling Bee sponsor Poca Valley Bank, who sponsored the Putnam County Schools Spelling Bee and donated $50 to the PCS Runner-Up and $100 to the Champion.\nJensine will advance to represent Putnam County Schools at the Gazette-Mail Spelling Bee in March hosted at Capital High School in Charleston.", "url": "https://apnews.com/080b6855e07a4093ad421119884db8b0"}