{"authors": ["Amber A'Lee Frost", "Anton Jäger", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Richard Seymour", "David Broder", "Ronan Burtenshaw"], "date_download": "2020-05-04 19:55:45", "date_modify": "2020-05-04 19:55:45", "date_publish": "2019-12-18 00:00:00", "description": null, "filename": "2019_12_jeremy-corbyn-bernie-sanders-lessons-uk-election_1588622145.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/12/18105750/GettyImages-1189058020.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_12_jeremy-corbyn-bernie-sanders-lessons-uk-election_1588622145.html", "title": "Corbyn Lost. But Bernie Can Win.", "title_page": "Corbyn Lost. But Bernie Can Win.", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe Durham Miners’ Gala is the strangest and biggest anachronism of the British workers’ movement — a massive celebration of the workers of an industry long since felled by Thatcher and capital, it still attracts hundreds of thousands of people to the North of England to honor those who built the world. Last year, the gala was serious-minded but joyous and truly optimistic. Corbyn took the stage to give his address and was met with wild cheers. This year, the mood was different — a bit tired, a bit apprehensive. The crowd looked nearly the same, save for one notable increase in a previously rare specimen, the bellowing European Union activist. As if out of nowhere, Durham had broken out in a suspicious rash of EU flags, conspicuously out of place in the heavily pro-Brexit city (particularly given Europe’s indirect role in crushing the 1980s Miners’ Strike). Among Thursday’s more shocking upsets this election was North West Durham’s Laura Pidcock, who, after referring to the Leave/Remain conflict as an “arbitrary division,” lost her seat to a Brexit Tory. A 7 percent point reduction in Labour’s vote is not just a temporary blip in what is often marketed as a secular recovery. The “red wall” didn’t just crumble. It was dynamited. The signs are clear: whenever left and social democratic parties abandon their heartlands — Die Linke in eastern Germany, the Socialists in northern France — their power is devastated in ways that are extremely difficult to restore. A sprawling denial industry has already popped up. For Americans, it’s very reminiscent of the furious protestations that Hillary Clinton still won the popular vote. The Labour vote share is still at 33 percent. It has retained the large urban working classes. It’s popular among the asset-poor and the downwardly mobile young professionals — if only eighteen- to twenty-four-year-olds would vote tomorrow, then Britain’s electoral map looks like a game of Soviet Stratego. But Britain doesn’t vote in percentages. It votes in constituencies, with seats allocated in parliaments. For that, we need districts beyond the London belt. The Left cannot retreat into its metropolitan bunker. Even there, the enemy will eventually overtake you.\nDissolution Labour’s promise had always been to include the working class in all its diversity. This means catering to the precarious Deliveroo driver in Birmingham and the call-center worker in Durham, the care worker in Brixton and the Amazon driver in Yorkshire. Everyone who has to sell their labor power to survive is their audience, even if this labor power is complemented with a mortgaged house. Corbynism was premised on this very inclusivity, but after years of betrayal by a Blairite Labour Party, voters were understandably skeptical, and the party failed to prove its loyalties. The plea for a second referendum was not met with a wild reception from within the party. Momentum members narrowly favored a second referendum in 2018, eventually. Their acquiescence mobilized all the wrong people while demobilizing all the right ones, and the failure of nerve proved fatal. Enough Northerners recognized the second referendum for what it was — a lump of spit in the face of any self-respecting democrat. Holding their noses, some even voted for the party that wrecked their regions, but these were hardly the effective set. The most powerful agents in the election were the apathetic. Social democracy is on its deathbed across Europe. France has no socialists left. The 156-year-old German Social Democratic Party might pass into oblivion in the next decade. In Flanders, the sp.a (Socialistische Partij Anders) is polling at a pitiful 8.5 percent. This is not erosion. This is straightforward dissolution, the death cry of a specimen. So now, in the strangest twist of fate, the only country capable of saving social democracy might just be the country that never had social democracy in the first place — the United States of America. So what can we learn from the tragedy of Corbynism, lest we become the farce?\nLessons of Defeat There are differences, of course. The United States does not have a Labour Party, in which trade unions and workers are integrated into party power. In fact, we don’t actually have parties at all — parties have dues and a membership for leaders to be held accountable to. The US system is presidential and deeply allergic to mass membership. Precisely because Bernie has never been able to rely on their party machinery, he has been building up an organization of his own. He might run on Democratic platforms and take part in their primaries, but his organizational resources do not depend on big money donors and DNC grifters. It was long said that Bernie would suffer from the absence of a sustainable party superstructure in the United States. Corbyn, in turn, managed to infiltrate an already existing party and colonize it for his own purposes. But this colonization was never complete, and the backward elements were never expelled. The inertia of a party that always saw itself as the better manager of British capitalism cannot be exorcised overnight. The Blairites hung on to their privileges and posts, while only a small handful defected. They loathed Corbyn, but their day would come: better to wreck the project and take the party with them, turning it into a careerist husk along the way, than to let Corbynism rebuild the bases for something that could one day look like a viable, majoritarian left. Corbynism never managed to control its boisterous, Europhile middle classes, inconstant in their loyalties and fickle in their politics. These fair-weather friends remained far more existentially wedded to EU membership than they were to socialism, even when it was made clear that Europe would be a major obstacle to key points of the Labour manifesto like railway nationalization, even when the barbarous cruelty of the EU to migrants was exposed, and even when the financial benefits of the economic integration remained so low. It will be difficult in the coming years to keep the story straight, countering both right-wing revisionism — that Corbyn was too far left to win — and the anti-worker hysteria of the middle class progressive. Already they are passing the blame off on voters, who they smear as irredeemably bigoted members of the working class. But, of course, there is mutual contempt between the professionals and the working class; even when they share interests, they are in direct competition for political power. Liberals may love to feel merciful toward a weak working class, but that’s not the same thing as solidarity, which is premised on the belief in working-class strength. The story of Corbynism is crystal clear. The Labour Party chose to appease a minority of the rear-guarders — a few very loud and well-funded middle class “activists,” particularly in media and academia, rather than its historic base. And, not surprisingly, many workers noticed. Only one redeeming factor arises out of this wreckage: in contrast to the 2000s, the 2010s at least gave us something to squander. But history is not cordial with her appointments, and the stakes are incredibly high. But the Bernie movement can win precisely because we’re learning from the mistakes of Corbynism, not to mention our own.", "url": "https://www.jacobinmag.com/2019/12/jeremy-corbyn-bernie-sanders-lessons-uk-election"}