{"authors": ["Solomon Hughes", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Dawn Foster", "David Broder", "Richard Seymour"], "date_download": "2020-05-04 19:55:31", "date_modify": "2020-05-04 19:55:31", "date_publish": "2019-07-23 00:00:00", "description": null, "filename": "2019_07_liberal-democrats-cable-davey-swinson_1588622131.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/07/23100614/GettyImages-1163567329.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_07_liberal-democrats-cable-davey-swinson_1588622131.html", "title": "Jo Swinson Is Not Your Friend", "title_page": "Jo Swinson Is Not Your Friend", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "We’re in the middle of a much-vaunted Liberal Democrat surge, but it can be difficult to discern what it all means. Lib Dem leader Vince Cable and his advisers made an effort to outline the basis for the party’s revival in his conference speech last September.\nWith the middle ground disappearing amid years of economic stagnation, flat wages, and insufficient public spending, that the Lib Dems themselves were complicit in, the party needed a new message. Brexit provided the opportunity. And Cable seized it in his conference speech, using the party’s second referendum platform as a basis to pose against the establishment. Brexit, he said, would mean “years of economic pain justified by the erotic spasm of leaving the European Union. Economic pain felt — of course — not by them but by those least able to afford it.”\nThe “erotic spasm” line was heavily trailed. Cable rather uncomfortably discussed it on Radio 4 before the speech. His predecessor, Nick Clegg, complained in advance that the “spasm” was “like something out of a Carry On movie.” In the end, Cable, feeling embarrassed by such a risqué line, fluffed it. We were, he said, in the midst of an “exotic spresm.”\nThe Lib Dems have been in something of “exotic spresm” ever since, prompting the usually well-mannered liberals to declare “Bollocks to Brexit,” and running as insurgent radicals in the European elections. It has to be said it worked — while Change UK entered the contests with greater coverage, as many MPs, and what seemed like momentum, the Lib Dems crushed their Remainer rivals and now look in poll position to lead the anti-Brexit charge.\nThe Lib Dems were able to carry this off because, unlike Change UK, they are an actual national party, with around 100,000 grassroots members, who were deeply involved in building the big march against Brexit that supplied the “Bollocks to …” slogan.\nThis isn’t the first Lib Dem “surge,” after all. Who could forget the 2010 election and “Cleggmania”? The Guardian, then cheerleaders for the Lib Dems, declared Nick Clegg a “potential Prime Minister.” Labour looked tired and compromised, dragged down by the financial crisis, the Iraq War, and tuition fees.\nClegg’s Lib Dems had opposed Iraq, and they were guaranteeing free tuition fees. What wasn’t to like? Well, the Tory–Lib Dem coalition, it turned out — in which Clegg U-turned on fees and backed the disastrous 2011 Libyan intervention. Yet, a mere four years after that coalition, during which the Lib Dems famously backed tightening benefit sanctions in exchange for a five-pence plastic bag charge, here we are again.\nSo, who are the Lib Dems? In their own minds they are something like the US Democrats. But the Democrats are big because they are not challenged by a Labour Party in the United States. Since 1914, and the rise of the Labour Party here, the Liberals have played second fiddle. They still court “progressive” support among big business, but most of the City, the corporates, and “free marketeers” turned Tory, while workers and radical votes went to Labour.\nThe Liberals managed to hang around through this, although by the 1970s they were slipping into decay, with morally bankrupt leaders like Jeremy Thorpe and Cyril Smith. The party was rejuvenated by a merger with the Social Democratic Party (SPD), the right-wing split from Labour, in the 1980s.\nThe SDP themselves briefly led the polls amid much excitement. But, just like Clegg in 2010, they too failed to “break the mold of British politics.” The Lib Dems were economic liberals, opposed to European-style social democracy with its powerful unions, industrial base, and high public spending. That was the whole point of the party as a bastion of liberalism. But the SDP merger helped to give the party a “social liberal” wing — those who were more prepared to talk up the benefits of the mixed economy and state intervention.\nThey never totally shed their “classical liberal” tendencies, though, which partly explains why the party found it so easy to partner up with the “liberal” Tory David Cameron in 2010. It’s worth remembering that no party had a majority in 2010. The Lib Dems actually chose to join the Tories rather than form a “Rainbow Coalition” with Labour, the leftish nationalist parties (Scottish National Party, Plaid Cymru, and Social Democratic and Labour Party) and the Greens. In other words, they rejected the very coalition they now claim to lead in the battle to “stop Brexit.” Such a coalition would have been harder to sustain than the Cameron-Clegg deal. But maybe it wouldn’t have ended up sending vans around immigrant communities telling them to “go home”?\nThe foundations for Tory–Lib Dem coalition were laid in 2004 when Lib Dem–backing hedge fund boss Paul Marshall and Lib Dem MP David Laws edited the “Orange Book,” a collection of policy essays written by Nick Clegg and other leading party lights. The Orange Book aimed to pull the Lib Dems rightwards, away from what they called “soggy socialism and corporatism.” Inside, Laws called the NHS a “second-rate, centralised, state monopoly service,” and said, “private sector providers are more efficient than the NHS.” As well as arguing for “more competition within the NHS,” the authors called for more private prisons and Royal Mail privatization.\nWhile Lib Dems claim they were a moderating influence on the Tories in coalition, their Orange Book values meant they were more than compatible as a partner. In government, the party was an enthusiastic proponent of the idea that the financial crisis had been caused by excessive government spending, turning a crisis created by bankers and speculators onto public sector workers.\nBut, after all, a lot of people who consider themselves progressive vote for the Lib Dems. And these policies didn’t meet with approval. After the coalition’s austerity, voters either rejected them for Labour or went for the real thing and voted Tory instead. In 2015 the Lib Dems were reduced from fifty-seven MPs to eight. In 2017, Nick Clegg himself was turfed out of parliament — before heading off to make his millions as Facebook’s head of PR (standing up, no doubt, to the company’s excesses).\nThe Orange Book caucus hasn’t gone away, though. The new Liberal Democratic leader Jo Swinson took over as employment minister in 2012, when he was promoted to energy minister. On her Lib Dem leadership campaign website Swinson claims that “as Minister for Employment Relations” she delivered “a fairer deal for workers.” She will, she says promisingly, “build an economy that puts people and the planet first.”\nBut as a minister, Swinson intensified the attack on workers’ rights. In 2012, Swinson was boasting about “the direct benefits to business of extending the qualifying period for unfair dismissal.” She then made things much worse: she introduced charges of up to £1,200 for the privilege of attending an employment tribunal, placing justice even further out of reach for workers.\nIn 2017 the Supreme Court decided Swinson’s fees scheme “prevents access to justice and is therefore unlawful.” The judges agreed with the long-running legal case brought by trade union Unison, who argued that the number of people going to tribunals had dropped by 79 percent because people were being priced out of justice. The government cancelled Swinson’s fees and agreed to pay back the £32 million wrongly charged to workers who made it through the maze.\nThis wasn’t even the full extent of Swinson’s contributions in office. In 2013, she said zero-hour contracts offered “helpful flexibility for the employee” and were a “useful tool for flexibility in employment” while ruling out introducing a ban. In fact, as minister, Swinson oversaw the introduction of new legislation formalizing flexible working hours. She also came out strongly against increasing the minimum wage, going so far as to suggest it should be frozen or even cut if there was another downturn. Maybe it’s no surprise she receives such praise from Corbyn’s staunchest opponents.\nThe unique conditions of Brexit are giving the Lib Dems the opportunity to rebrand as a reforming, progressive party. The truth is, they are anything but. And it’s long-past time Labour MPs who spend day after day attacking the current leadership devoted a little time to reminding people of that.", "url": "https://www.jacobinmag.com/2019/07/liberal-democrats-cable-davey-swinson"}