{"authors": ["Natalie Shure", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Matt Bruenig", "Branko Marcetic", "Adam Gaffney"], "date_download": "2020-05-04 19:51:25", "date_modify": "2020-05-04 19:51:25", "date_publish": "2019-07-16 00:00:00", "description": null, "filename": "2019_07_joe-biden-health-care-plan_1588621885.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/07/16123344/GettyImages-1162219598.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_07_joe-biden-health-care-plan_1588621885.html", "title": "Bidencare Is a Scam", "title_page": "Bidencare Is a Scam", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "After months on the presidential campaign trail, alleged Democratic frontrunner Joe Biden has finally rolled out just the sort of health care plan everyone expected of him: a marginal improvement upon the Affordable Care Act, pitched explicitly as a safer, saner alternative to Medicare for All. Bidencare would create a public insurance option to be sold on ACA exchanges and distributed at no-cost to Medicaid-qualifying individuals in non-expansion states, as well as remove income caps for premium subsidies. In isolation, such incremental measures would slightly improve the status quo, while leaving intact the most corrosive features of the health care system that Obamacare failed to fix.\nThe American health care system is a thoroughly complicated colossus plagued by no shortage of problems, but most boil down to this: it’s run as a business, and patients are framed as consumers. This is why hospitals maximize revenue by building fancy new orthopedics wings adorned with philanthropists’ names, why they hire consultants to teach them new billing code tricks to get more money per patient, and why they merge with other hospitals to increase their market power. And what are insurance premiums but rent payments for a ticket into the health care system, each of which comes with its own stipulations and user fees? What is a deductible but a strategy to force customers to foot their own bill for as long as humanly possible?\nRather than upend this dynamic, the ACA made market-based health care slightly gentler by subsidizing poorer patients and halting the more galling practices of the insurance industry, like denying coverage to people with preexisting conditions. But most mechanisms for harm survived: the astronomical price-gouging, the shifting of those costs onto patients themselves, the millions of people locked out of any care at all, tens of thousands of whom will die because of it.\nBidencare concedes none of this, opting instead to hitch its wagon squarely on Obama’s legacy. “For Biden, this is personal,” his website reads, despite having privately cautioned against the ACA as vice president. “He believes that every American has a right to the peace of mind that comes with knowing they have access to affordable, quality health care. He knows that no one in this country should have to lay in bed at night staring at the ceiling wondering, ‘what will I do if she gets breast cancer?’ or ‘if he has a heart attack?’ ‘Will I go bankrupt?’ He knows there is no peace of mind if you cannot afford to care for a sick child or a family member because of a pre-existing condition, because you’ve reached a point where your health insurer says “no more,” or because you have to make a decision between putting food on the table and going to the doctor or filling a prescription.”\nThe whole paragraph is a brazen lie. Joe Biden does not, in fact, believe that health care is a right. The ACA doesn’t make it one. His proposed changes don’t either. Every one of the scenarios he lists off in his folksy “I’m a good person” spiel persist today, and still would under his plan. Tens of millions of uninsured and underinsured people can hardly be assumed to have “peace of mind.” Breast cancer patients delay treatment when their insurance plans have high deductibles. Medical bills are still a factor in some two-thirds of personal bankruptcies. If insurers can no longer flat-out deny patients with preexisting conditions, they can certainly still bilk them with high deductibles and coinsurance. While reporting recently on skyrocketing insulin costs, I was struck by just how many diabetes patients burdened by these prices have insurance but nonetheless struggle to pay out-of-pocket until they hit their deductible. Several of them explicitly mentioned skimping on groceries to buy insulin instead.\nTruly codifying something as a right means more than just making it “affordable” to “access.” It requires public administration and financing to guarantee it universally, free at the point of use. Under the ACA, health care is still overwhelmingly distributed based on wealth rather than need. You can either uphold health care as a right, or fight for Bidencare, but you can’t do both at the same time.", "url": "https://www.jacobinmag.com/2019/07/joe-biden-health-care-plan"}