{"authors": ["Nick French", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:29", "date_modify": "2020-05-04 19:54:29", "date_publish": "2019-03-14 00:00:00", "description": null, "filename": "2019_03_college-admissions-scandal-inequality-meritocracy_1588622069.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/03/14162011/GettyImages-1135399219.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_03_college-admissions-scandal-inequality-meritocracy_1588622069.html", "title": "Rich Kids Aren’t Any Smarter Than the Rest of Us", "title_page": "Rich Kids Aren’t Any Smarter Than the Rest of Us", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nOver the past two days, a far-reaching college admissions scandal has dominated the headlines. An FBI investigation, comically named “Operation Varsity Blues,” uncovered that parents (including actresses Felicity Huffman and Lori Loughlin) paid around $25 million to a consultant to illegally guarantee their children spots in elite universities. William “Rick” Singer, founder of a college counseling company, charged parents tens or hundreds of thousands of dollars to doctor student test scores. Singer also collected millions of dollars as payment for bribing university coaches and administrators to falsely designate their students as recruited athletes. Unsealed court documents reveal that officials at eight elite universities are implicated in the scandal, including Georgetown, the University of Southern California, Stanford, Yale, and Wake Forest University. Many columnists have been quick to point out that this case is only a particularly brazen and illegal instance of rich parents exploiting their wealth to give their children a leg up in the college admissions process. There are many legal means by which the wealthy give their kids a better shot at getting into top schools, from paying big for test preparation services to making sizable donations. Yet focus on this point, correct as it is, threatens to obscure even deeper problems with elite US colleges and universities. Even setting aside the ways the rich consciously buy advantages for their children in college admissions, the prestigious, highly selective universities reproduce broader social and economic inequalities. In doing so, they bestow a false legitimacy on an unjust system.\nThe Roots of Inequality However, looking only at the wealthy’s blatant efforts to game the system misses the forest for the trees. A 2017 study found that, at many elite schools, a higher percentage of students were drawn from families in the top 1 percent of US income-earners than from families in the entire bottom 20 percent. (This is true of several of the schools implicated in the recent admissions scandal, including Yale, Stanford, Wake Forest, Georgetown, and USC.) At the nation’s eighty most elite schools (as ranked by Barron’s), students from the 1 percent are better represented than students from the bottom 40 percent. The wealthy’s conscious attempts to get a leg up in the admissions process can’t account for all of the inequality in college admissions. Even setting aside the advantages provided by cheating and test prep, one’s chances at getting into a prestigious college — or going to college at all — are highly influenced by one’s race and class. These factors affect students’ ability to get into top colleges in a number of ways. To name a few: Poorer students and students of color have less access to the extracurricular activities that elite schools look for in their applicants, including many sports.\nThe SAT itself has a racial bias.\nWhether one graduates from high school in the first place is significantly influenced by the wealth of the neighborhood where you go to high school.\nChildhood poverty tends to hinder brain development, according to recent research. Even if the rich weren’t trying to manipulate the admissions process in their favor, we could still expect to see racial and class inequalities reflected in who gets into elite schools.", "url": "https://www.jacobinmag.com/2019/03/college-admissions-scandal-inequality-meritocracy"}