{"authors": ["Sam Lewis", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Cristina Groeger", "Samuel Stein", "Cea Weaver", "Michael Cavadias", "Ryan Cooper"], "date_download": "2020-05-04 19:49:30", "date_modify": "2020-05-04 19:49:30", "date_publish": "2019-06-20 00:00:00", "description": null, "filename": "2019_06_new-york-rent-control-housing_1588621770.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/06/20125342/Screen-Shot-2019-06-20-at-12.52.59-PM.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_06_new-york-rent-control-housing_1588621770.html", "title": "Things Are Only Going to Get Worse for Developers", "title_page": "Things Are Only Going to Get Worse for Developers", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nLast week, New York State passed a sweeping package of rent reforms that dramatically strengthens tenants’ rights for millions of New Yorkers in rent regulated apartments. The new legislation also opens up an ambitious new front of struggle that could fuel the spread of tenant organizing, socialist political campaigns, and the expansion of rent control all across the state. For decades, tenants have been fighting a war of attrition — trying to protect the state’s dwindling regulated housing stock against a sustained assault from the real estate industry and their allies in Albany. The rent law package passed last week took meaningful steps to reverse landlord influence over housing policy in New York — influence that has led to the deregulation of hundreds of thousands of apartments and a homelessness crisis of epic proportions. The reaction of the industry and the business press tells us what we need to know about the significance of the legislation. One landlord who owns nine rent stabilized buildings told the Financial Times, “I feel like someone just dropped a nuclear bomb on my business and my family.” The stock prices for the banks that provide loans to speculators fell precipitously, and the titans of real estate were reduced to pitifully whining to their ally Governor Andrew Cuomo, to no effect. While these historic changes will reduce the pressure on nearly two million rent stabilized tenants mostly in New York City, housing advocates’ signature policy demand did not pass. Democratic socialist Senator Julia Salazar’s “good cause eviction” bill would have prevented almost any tenant, anywhere in the state, whether their building was regulated or not, from facing a rent increase of more than 1.5x the rate of inflation. The ambitious good cause legislation — which would have guaranteed truly universal rent control — faced the most intense opposition from real estate and the business press. Despite substantial pressure from housing advocates, the Democratic Assembly and Senate were unwilling to include it in their deal. The failure of good cause was a disappointment. But housing advocates still achieved one other major, though overlooked, victory: the expansion of the Emergency Tenant Protection Act to cover the entire state. Prior to last week the ETPA was in effect only in NYC and its suburban counties. With the new change, municipalities across the state can implement rent stabilization as long as they can demonstrate a housing vacancy rate below 5 percent through a local study. Many localities can meet that bar right now, as the state’s housing crisis continues worsen. The ETPA’s expansion provides an opportunity for the organized left to build on last week’s historic victory and bring class struggle politics to the local governments of communities across the state.\nPolitical Context This year’s major gains for tenants are due to a profoundly changed political landscape in New York that put the real estate industry on the defensive for the first time in decades. In recent years, Republican control of the State Senate has been empowered by a group of rogue “independent” Democrats financed by the real estate industry and tacitly supported by Governor Andrew Cuomo. Last year, six members of that ‘Independent Democratic Conference’ were unseated by progressive Democratic primary challengers. A successful general election gave the Democrats a seven-seat advantage in the State Senate (without their disloyal “independent” faction) and unified control of the state government. The Democratic majority was absolutely essential to improving the rent laws. But without changing political dynamics within the Democratic Party, real estate donors might still have found a welcome ear from candidates whom they have been funding for years, and could likely have secured a much more modest set of reforms to the system. Unfortunately for the real estate industry, last year marked the startling success of an explicitly class-conscious politics within the Democratic Party primaries. This politics focused on the dual issues of a housing crisis squeezing renters and a political system funded by landlords and developers. Political contributions by the real estate industry were an almost completely unquestioned feature of Democratic politics in New York until just a few years ago. That started to change in a contested 2015 State Assembly race in Crown Heights, which evolved into a proxy battle between Brooklyn’s powerful political machine and Diana Richardson, a progressive backed by the Working Families Party. That election was reshaped when the Crown Heights Tenants Union called upon all the candidates to pledge not to take real estate money. Diana Richardson was the only candidate to take the pledge, and was able to turn an otherwise sleepy special election into a referendum on the role of real estate in a rapidly gentrifying neighborhood. She won decisively. In 2018 Alexandria Ocasio Cortez’s congressional campaign beat one of the most powerful Democratic figures in the state, sending shockwaves through the establishment. That was quickly followed by another democratic socialist upset in the election of Julia Salazar over incumbent Democratic state senator Martin Dilan. Both Ocasio Cortez and Salazar also pledged to refuse donations from the real estate industry, as did Cynthia Nixon in her gubernatorial challenge to Governor Cuomo. This pledge has moved so quickly from the fringe to the mainstream that just a few months later Senator Mike Gianaris, the second most powerful Democrat in the State Senate, one of its most prolific fundraisers, and a key player in the rent reforms, felt pressured to publicly renounce real estate money as well. It was in this new context — a unified Democratic majority in which a few democratic socialists with outsized influence were directly challenging real estate money in politics — that the Upstate/Downstate Housing Alliance (a coalition of over seventy housing organizations and community groups, including three chapters of Democratic Socialist of America) was able to push through historic reforms. And with the expansion of ETPA statewide, the coalition’s working-class organizations have the opportunity to open a powerful new front in the fight against the real estate industry. While the assertion of one real estate industry leader that “the democratic socialist wing of the Democratic Party is in full control of the state government” is not yet true, this victory does give us the playbook to effect a political revolution across the state.", "url": "https://jacobinmag.com/2019/06/new-york-rent-control-housing"}