{"authors": ["St. John Barned-Smith", "Keri Blakinger"], "date_download": "2020-05-04 20:27:14", "date_modify": "2020-05-04 20:27:14", "date_publish": "2019-03-07 06:00:00", "description": "A Houston narcotics officer under an internal police investigation following a botched January drug raid is retiring, according to multiple law enforcement sources. Steven O. Bryant put in...", "filename": "_31363ac718e94829ae88b5c7b3d33d41_1588624034.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_31363ac718e94829ae88b5c7b3d33d41_1588624034.html", "title": "HPD narcotics officer under investigation retires", "title_page": "HPD narcotics officer under investigation retires", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Houston narcotics officer under an internal police investigation following a botched January drug raid is retiring, according to multiple law enforcement sources.\nSteven O. Bryant put in his paperwork this week while under investigation following the shooting deaths of two residents in an unannounced raid of a Pecan Park residence in south Houston on Jan. 28. The Harris County District Attorney’s Office is reviewing more than 800 criminal cases brought by Bryant during his 23-year career. Sources said his last day is Friday.\nHPD officials relieved Bryant of duty as questions mounted about his actions leading up to the drug raid, in which a team of officers burst into a house at 7815 Harding St. after obtaining a no-knock search warrant. A gunbattle ensued, and police killed homeowners Dennis Tuttle and Rhogena Nicholas. Four officers were hit by gunfire, and a fifth officer was injured.\nRELATED: FBI opens civil rights investigation into botched Houston drug bust, police chief says\nThe Pecan Park bust — and the officers’ actions — have drawn close scrutiny because police did not find any heroin, only a small quantity of cocaine and marijuana. Investigators later failed to find the confidential informant police relied on to obtain a search warrant.\nThe case agent, Gerald Goines, was shot in the neck as he entered the private home, but he has also been relieved of duty after Houston Police Chief Art Acevedo said the veteran officer appeared to have lied about the undercover drug buy that served as justification for the search warrant used by the squad to raid the house.\nIn a search warrant for Bryant’s phone data, an investigator with HPD’s Special Investigations Unit wrote that Bryant told investigators he had retrieved two bags of heroin from the center console of Goines’ police car at the instruction of another officer.\nThat, however, was not consistent with the affidavit used to obtain the warrant for the Jan. 28 raid, in which Goines wrote that Bryant identified heroin brought out of the house.\nThough he took the two bags of drugs for testing to determine that they were heroin, Bryant eventually told investigators he had never seen the narcotics in question before retrieving them from the car.\nMultiple law enforcement sources confirmed Bryant put in his retirement paperwork this week. An ongoing investigation would not affect his compensation benefits.\nREAD MORE: Houston police officer Gerald Goines had previous allegations against him\nBryant’s retirement is the latest fallout from the deadly raid, and comes as Acevedo has launched a wide-ranging probe into the division and its operations following the raid. The FBI has launched a rare civil rights investigation into the operation.\nThe Harris County District Attorney’s Office has announced it is investigating 2,200 of the former criminal cases of Goines and Bryant. Acevedo has dramatically curtailed no-knock raids, and said he will equip raid teams with body cameras to record the operations. At the time of the raid, none of the members of the raid team was wearing cameras.\nTwo other narcotics officers, including a longtime partner of raid leader Goines — have quietly resigned from the department in recent weeks, including one who is under investigation for an unrelated matter.\nHouston Police Officers’ Union President Joe Gamaldi declined to comment on Bryant’s departure, citing the fact that it is a personnel matter and the ongoing investigation.\nAcevedo did not respond to a request for comment Thursday afternoon. Union attorneys representing Bryant also did not immediately respond to a request for comment.\nAttempts to contact Bryant were not successful.\nst.john.smith@chron.com\nkeri.blakinger@chron.com", "url": "https://apnews.com/31363ac718e94829ae88b5c7b3d33d41"}