{"authors": ["Sentinel"], "date_download": "2020-05-04 20:19:14", "date_modify": "2020-05-04 20:19:14", "date_publish": "2019-04-13 10:33:46", "description": "As the Boston Herald's Joe Dwinell has been reporting, the Massachusetts Cultural Council has proven to have expensive taste. The group's website reads, \"Mass Cultural Council works to elevate our...", "filename": "_322d4d347b3042cab21c3b1b52c36a1a_1588623554.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_322d4d347b3042cab21c3b1b52c36a1a_1588623554.html", "title": "Last Call for Cultural Council's Free Spending", "title_page": "Last Call for Cultural Council's Free Spending", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "As the Boston Herald’s Joe Dwinell has been reporting, the Massachusetts Cultural Council has proven to have expensive taste. The group’s website reads, “Mass Cultural Council works to elevate our rich cultural life in Massachusetts.”\nWhat that means on paper is that Executive Director Anita Walker (whose pronoun description on the website is “she/her/hers”) earns $174,700 a year, has also been furnished a state-leased Toyota Prius with gas and parking privileges. The unmarked Prius C III costs $404.63 a month and another $340 a month for parking.\nAlong with her bonus, that means her elevated lifestyle is worth about $200,000, paid for by you/me/us.\nThe Cultural Council is located in the tony Back Bay at 10 St. James Ave., a block away from the Public Garden. The rent is $332,000 a year for the third-floor offices, records show.\nElevated too are the dining experiences of the council’s staff. Last June, the Herald reported that the MCC had racked up $3,700 in meals at Davio’s, on a state-issued credit card.\nSo far this fiscal year they’ve spent $9,000 for lodging, including accommodations at the Red Lion Inn in Stockbridge. The agency is on track to match last year’s $17,500 hotel bill.\nThe rich cultural life of the council unsurprisingly requires them to leave terra firma, and they don’t hesitate, spending $3,685 on air fare to California, Utah, Texas and Connecticut, and another $1,800 in unspecified spending on junkets to Washington, California and Connecticut.\nSt. James Ave. in Boston is about 100 miles away from Hartford. It is curious as to why anyone would need to fly there.\nWe can assure you that the list goes on and on. Thankfully, Massachusetts House speaker Bob DeLeo may have had enough and is putting the council on notice.\nDeLeo said the tiny agency must cap its out-of-state spending and focus on its mandate to promote the arts in Massachusetts.\n“The council shall establish guidelines ensuring that public funds provided to the council are spent in a manner consistent with other state agencies, including but not limited to, the use of vehicles, the cost of travel and the purchase of meals,” the House Ways and Means budget released Wednesday states.\n“We wanted to really make sure that that money is going where it should be going, to cultural activities as opposed to some of the trips and other niceties,” DeLeo told reporters.\nThe new House Ways and Means budget proposal for fiscal year 2020 includes strict language forcing the agency to adopt spending guidelines that must be approved by the attorney general, the inspector general, the comptroller and the Ethics Commission.\nCurbing its wanderlust may not be easy. This fiscal year, the council has already sent “staffers” to conferences in Atlanta; Detroit; Oakland, Calif.; San Diego; Baltimore; College Park, Md.; Minneapolis; Buffalo, N.Y.; New York City; and Stamford, Conn.\nEnough is enough. The Mass Cultural Council must begin to show respect for the taxpayer. The story that a glimpse at their travel and dining receipts tells is one of arrogance and disdain. DeLeo must make good on his commitment to reform the rich, cultural lives of those at the council.", "url": "https://apnews.com/322d4d347b3042cab21c3b1b52c36a1a"}