{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:28:51", "date_modify": "2020-05-04 20:28:51", "date_publish": "2019-02-23 11:35:38", "description": "A Sun Staff Report DRACUT -- The retired Dracut doctor who allegedly prescribed opioids that resulted in an at-risk patient's death will go on trial Dec. 2, a spokesman for Attorney General...", "filename": "_454e4164e6db430c9d7b63c6f4721efd_1588624131.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_454e4164e6db430c9d7b63c6f4721efd_1588624131.html", "title": "Trial Date Set for Retired Dracut Doctor", "title_page": "Trial Date Set for Retired Dracut Doctor", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Sun Staff Report\nDRACUT -- The retired Dracut doctor who allegedly prescribed opioids that resulted in an at-risk patient’s death will go on trial Dec. 2, a spokesman for Attorney General Maura Healey said this week.\nDr. Richard Miron had a brief appearance Thursday in Middlesex Superior Court during which the tentative trial date was set.\nThe case against Miron is the first of its kind in Massachusetts. It is being prosecuted by lawyers in Healey’s office.\nMiron, 76, of Dracut, pleaded not guilty at his brief arraignment in December before Assistant Clerk Magistrate Michelle Goldman.\nMiron was indicted earlier in December by a Middlesex County grand jury on 23 counts of illegal prescribing of controlled substances, 23 counts of filing false Medicaid claims, and one count of involuntary manslaughter. Miron had practiced internal medicine in Dracut until he entered into a voluntary agreement this month not to practice with the Board of Registration in Medicine\nThis is the first time in the state that a doctor is facing criminal charges for allegedly illegally prescribing opioids.\nThe AG’s Office alleges Miron was responsible for the death of his patient, Michelle Craib, 50, on March 17, 2016. The Office of the chief medical examiner determined the woman’s death was caused by acute intoxication from the combined effects of fentanyl, morphine, codeine and butalbital, all prescribed by Miron.\nThe attorney general began investigating the doctor in September 2017 after the matter was referred by MassHealth. Miron was the largest provider of high-dose, short-acting oxycodone prescriptions of all MassHealth care providers across the state from September 2015 to February 2016. MassHealth terminated the doctor from its program in September 2017.\nIn a phone interview with The Sun following his arraignment, Healey said the opioid epidemic itself must be combated from different angles.\n“It’s a public health crisis and it remains a top priority of my office,” Healey said of the opioid crisis. “With respect to prescribers, the vast majority of prescribers are good and trying to do the right thing. This is not about them. This is about rooting out the outliers who have been contributing to the crisis through illegal prescribing.”\nMiron’s next court date is March 21. He remains free on personal recognizance.", "url": "https://apnews.com/454e4164e6db430c9d7b63c6f4721efd"}