{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:06:46", "date_modify": "2020-05-04 20:06:46", "date_publish": "2019-03-01 05:01:00", "description": "WASHINGTON — Pope Francis' closing address to the Vatican Summit on Child Protection was a disgraceful display of excuses and evasions. He began with extended meditation on how a \"great...", "filename": "_743cfbb52e5d4667a93288b4674b9e4f_1588622806.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_743cfbb52e5d4667a93288b4674b9e4f_1588622806.html", "title": "Pope's speech was a disgraceful display of excuses", "title_page": "Marc Thiessen: Pope's speech was a disgraceful display of excuses", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WASHINGTON — Pope Francis’ closing address to the Vatican Summit on Child Protection was a disgraceful display of excuses and evasions.\nHe began with extended meditation on how a “great number of” abuse cases are “committed within families.” He urged the assembled bishops to focus on “other forms of abuse” experienced by “child soldiers,” “starving children,” “child victims of war” and “refugee children.” He laid out an agenda that, bizarrely, focused on matters having nothing to do with clerical abuse (such as combating “sexual tourism”). And, most shamefully of all, he lashed out at those demanding that bishops who covered up abuse and silenced victims be held to account, declaring that the church must “rise above” those who “exploit, for various interests, the very tragedy experienced by the little ones.”\nSorry, Holy Father, that’s not good enough.\nWhile Francis did declare that “no abuse should ever be covered up (as was often the case in the past),” he still refuses to tell us which bishops and cardinals did the covering up. It’s true that, just days before the summit, he removed disgraced former Archbishop Theodore McCarrick from the priesthood. But Francis still refuses to explain: What took so long? Who knew about McCarrick’s alleged serial predations and did nothing? When did Francis know? And why did he not punish McCarrick until his crimes — which were repeatedly reported to the Vatican — were publicly exposed by the media?\nIndeed, Francis’ decision to focus the summit exclusively on “the protection of minors” was a cynical ploy to avoid addressing questions of accountability, or the rampant sexual abuse of vulnerable adults by their religious superiors. The accusations against McCarrick were not limited to his horrific abuse of children. He allegedly forced countless young priests and seminarians, whose careers he could make or break, to have sex with him. Last week, The Post reported on the Rev. Lauro Sedlmayer, who says he was sexually abused as a young priest by McCarrick during the 1990s. The priest says he told three bishops and that nothing was done. “To not be believed and to be ignored and demonized by the people to whom I reported the abuse victimized me a second time,” he said.\nHow was McCarrick able to advance through the hierarchy, and even become a trusted adviser to Francis on international diplomacy and the selection of cardinals, when his predatory behavior was well known? Simple. A network of corrupt bishops and cardinals, many of whom owed their positions to McCarrick, protected him. It is not enough for Pope Francis to remove McCarrick from the priesthood. The patronage network that enabled him must be rooted out as well.\nThere are documents in the Vatican archives that would definitively show who knew what, and when they knew it. But Francis has refused to release them, much less hold McCarrick’s many enablers to account.\nQuite the opposite, the pope has squelched efforts to expose and punish those responsible for covering up abuses by McCarrick and others. The Wall Street Journal reports that in 2015, Boston Cardinal Sean O’Malley — whom Francis put in charge of handling the abuse crisis — recommended the creation of a special tribunal to try bishops who ignore or cover up abuse. The pope rejected his proposal. Last year, O’Malley met with Francis in Rome where, the Journal reports, the pope “made it clear he would not authorize a full-fledged investigation into the McCarrick affair.” He then “stunned” the cardinal by recommending that the U.S. bishops cancel a meeting at which they were to vote on penalties for bishops who neglect or cover up abuse — suggesting they hold a spiritual retreat instead. When they held the meeting anyway last November, Francis forbade them from voting on the measures. And O’Malley — ostensibly the pope’s point man on sex abuse for the past five years — was omitted from the speaker’s list at the pope’s sex abuse summit.\nUntil Francis addresses the corruption of the episcopacy, he has zero credibility to lead a fight against sex tourism. No one wants to hear lectures on morality from bishops who refuse to rid their ranks of those who enable sex predators. They seem to be more concerned with preserving their worldly privilege and power than restoring the church’s moral integrity. How many souls have been lost, how many have left the sacraments, because of their scandalous inaction? We will never know in this world. But they will certainly learn the answer in the next.\nFrancis called the summit an “opportunity for purification.” It was a missed opportunity. Purification requires two things: confession and penance. Until the bishops repent of their sins, and accept the temporal consequences of their actions, there will be no forgiveness from the laity.\nMarc A. Thiessen is a syndicated columnist. You can follow him on Twitter, @marcthiessen.", "url": "https://apnews.com/743cfbb52e5d4667a93288b4674b9e4f"}