{"authors": ["Luke Creasy Hd Media"], "date_download": "2020-05-04 20:10:26", "date_modify": "2020-05-04 20:10:26", "date_publish": "2019-05-28 04:01:00", "description": "WAYNE — It doesn't take long to describe the kind of basketball player Lakyn Adkins was for the Wayne High School Lady Pioneers during her four years. Wayne coach Wade Williamson summed her up...", "filename": "_f298837589bd4c17a0ec3621bdf9b6bc_1588623026.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f298837589bd4c17a0ec3621bdf9b6bc_1588623026.html", "title": "Wayne's Adkins excited to play at KCU", "title_page": "Wayne's Adkins excited to play at KCU", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WAYNE — It doesn’t take long to describe the kind of basketball player Lakyn Adkins was for the Wayne High School Lady Pioneers during her four years. Wayne coach Wade Williamson summed her up briefly just before she signed a National Letter of Intent to play basketball at Kentucky Christian University next fall.\n“She’s a tough, strong-minded person that’s willing to work for what she wants,” he said. “Lakyn has played a lot of basketball over the years to get to this point and I think I can safely speak for the rest of the coaches and say that we’re very proud of her and excited for her to have this opportunity.”\nAdkins didn’t decide on KCU until late in the recruiting period, but said it was an easy decision after meeting the Knights’ coaching staff on her official visit.\n“I always wanted to play in college so I went up for a visit and almost as soon as I got up there I knew that’s where I wanted to play,” she said. “When I found out some of my friends from Wayne get to go up there, too, I got even more excited for it. It is close to home so people from here can come to watch me. It should be fun.”\nThe camaraderie comes as an added bonus to playing at the collegiate level. At least two other former Pioneer student athletes will join Adkins in Grayson, Kentucky, next fall. Whitney Sansom, her basketball teammate since middle school, will join the Knights’ softball team and Tanner Owens will attend KCU to play football and run track.\nAdkins was named to the Class AA all-state first team last last season after helping lead the Lady Pioneers to the girls basketball state tournament semifinals for a second consecutive season. She averaged 14.3 points as a senior.Along with her offensive production, her aggressive play on the defense impressed KCU coach Lisa Conn, who said Adkins began to show her true colors on her second visit to campus. Though they haven’t known of her long, Conn said she and her staff were thrilled when the 5-foot-9 Adkins walked into the gym.\n“She came the first day and was kind of a little shy, but the second time visit was when she really showed me what she could do for us,” Conn said. “I love the way she plays with a very aggressive nature offensively and defensively on both ends of the court. It was impressive.\n“She shoots the ball extremely well and scores in transition I was very happy to get her.”", "url": "https://apnews.com/f298837589bd4c17a0ec3621bdf9b6bc"}