{"authors": ["Nicole Aschoff", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:56:44", "date_modify": "2020-05-04 19:56:44", "date_publish": "2019-05-19 00:00:00", "description": null, "filename": "2019_05_china-is-not-the-problem-capitalism-is_1588622204.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/05/19154837/105984440_gettyimages-943639230.jpg_554688468.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_05_china-is-not-the-problem-capitalism-is_1588622204.html", "title": "China Is Not the Problem. Capitalism Is.", "title_page": "China Is Not the Problem. Capitalism Is.", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "C. S. Lewis said that people become friends because “they see the same truth.” On a recent episode of CNBC’s Squawk Box Tom Friedman and Steve Bannon looked downright chummy defending President Trump’s recent decision to raise tariffs on $200 billion of Chinese imports. Perhaps this is the beginning of a beautiful friendship.\nFriedman might even snag an invitation to Bannon’s new alt-right academy housed in a former Italian monastery. The two could don matching robes and co-teach a seminar on How Trump Saved Western Civilization. Both men seem to think that the fate of the free world, or at least “free market democratic capitalism,” is at stake in the US-China trade war.\nThe Friedman/Bannon story goes something like this: For decades China broke the rules of international trade, engaging in illegal subsidies, intellectual property theft, industrial espionage, forced technology transfers, dumping, slave labor, etc. But for a long time nobody really cared because China dealt mainly in toys and t-shirts.\nThese days, however, Friedman and Bannon say the playing field has leveled. Chinese companies are competing head to head with American companies in advanced sectors and their vision for the future — China 2025 — is actually a plan to take over the world.\nFor them, Bob Lighthizer’s trade plan is bigger than balancing soybeans and televisions — it’s about preventing China from dominating the field of artificial intelligence, supercomputing, materials, and aerospace, and gaining military control of the South China Sea. Trump, we’re told, is the only one with the guts to take a stand against China’s rise, the only politician willing to “call the game.”\nThe Friedman/Bannon diagnosis includes a solution: Our “misaligned” trade relationship with China can be repaired by forcing China to play by the rules it already agreed to twenty years ago when it joined the WTO. The United States can use the leverage of continued access to American markets and capital as carrot and stick to force an end to industrial espionage, forced technology transfers, and illegal subsidies.\nRight now, “China’s business model is an existential threat to the industrial democracies,” says Bannon. But forcing China to play by the rules, will be a “win-win,” especially for American workers: with Trump the American working class “finally ha[s] a voice in the room that’s looking out for them and looking out for their children and grandchildren.” Farmers and manufacturing workers may have to endure some “short term pain” but they understand what’s at stake.\nWe’ve heard this story before. In the late eighties and early nineties, it was Japan that was the global threat to fair and balanced capitalism.\nNovels like Michael Crichton’s Rising Sun and Tom Clancy’s Debt of Honor captured a pervasive sense of anger in the United States over “unfair trade” and a deep fear that Japanese firms posed an “existential” threat to American manufacturing and technological dominance, particularly in the high tech sector. American companies complained that global capitalism was stacked against them, that without a rebalancing they would collapse.\nAt the same time, workers, especially unionized workers, were promised that if they sided with their employers (and by extension their country) and were willing to endure some short term pain — to put the national interests of the country above their personal interests — everyone would benefit in the long run. Facing constant threats of plant closure and declining bargaining power many workers chose to line up with their bosses. A popular 1980s bumper sticker among autoworkers read: “Toyota, Datsun, Honda — Pearl Harbor!”\nNo doubt many companies, especially in sectors like auto, legitimately struggled during this period. But in hindsight, it is clear that Yellow Peril 3.0 was used as a smokescreen to facilitate a much broader reorganization in favor of capital. Nationalist rhetoric and geopolitical panic enabled corporations and elites to rewrite the rules of global trade for their own benefit, smoothing pathways for offshoring, restructuring, financialization, and cutting labor costs.\nThe new global trade architecture, crystallized in the 1995 founding of the WTO, was extremely profitable for US corporations and elites. But the workers who put “the national interest” above their own were rewarded with wage and benefit cuts, job loss, and permanent deterioration of their standard of living.\nJust as the problem for workers in the 1980s wasn’t Japan, the problem today is not the Chinese Communist Party. Skyrocketing inequality, a stark absence of pathways to a decent life for ordinary folks, and widespread alienation and distrust can’t be blamed on China’s “economic war on industrial democracy.” The war on working families is being waged by American corporations and elites.\nBut with the Third Way project delegitimized and elections around the corner politicians on both sides of the aisle are happy to play the China card, telling their constituencies fables about how forcing China to “follow the rules” of global capitalism is the key to creating decent livelihoods for ordinary Americans. Chuck Schumer tweeted: “Hang tough on China, President @realDonaldTrump. Don’t back down. Strength is the only way to win with China.”\nThe newfound camaraderie between Friedman and Bannon, Trump and Schumer, notwithstanding, elite calls to make China play by the rules are not about making global capitalism fair for working people or creating good jobs in the United States. They are about resuscitating US political and military hegemony and helping American companies capture new sectors and markets.\nInstead of trickle-down trade politics, the Left should double down on calls for a Green New Deal. A green industrial policy — paid for by defunding the military industrial complex — would align the needs of working families, both inside and outside the US, with the need to develop ecologically sustainable models of production and consumption.\nChina is not the problem. Capitalism is.", "url": "https://www.jacobinmag.com/2019/05/china-is-not-the-problem-capitalism-is"}