{"authors": ["James Halpin"], "date_download": "2020-05-04 20:07:01", "date_modify": "2020-05-04 20:07:01", "date_publish": "2019-03-12 13:44:00", "description": "WILKES-BARRE — A city man already awaiting trial on robbery charges was hit Tuesday with new charges alleging he pistol-whipped a man while robbing him of a cellphone earlier this...", "filename": "_5efbacc55f194870816e4cd4ec08bfd1_1588622821.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5efbacc55f194870816e4cd4ec08bfd1_1588622821.html", "title": "Alleged Robber Hit With New Charges", "title_page": "Alleged Robber Hit With New Charges", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WILKES-BARRE — A city man already awaiting trial on robbery charges was hit Tuesday with new charges alleging he pistol-whipped a man while robbing him of a cellphone earlier this year.\nRavone Davis, 31, of 308 N. Empire Court, is accused of approaching the victim along with an unidentified accomplice outside the CJ’s Pizza at 54 Spring St. the night of Jan. 7.\nDavis pulled a gun and hit the victim, causing a cut to his eyebrow, police said.\n“I’m not playing with you,” a complaint quotes Davis as saying as he and the other man went through the victim’s pockets.\nThe robbers stole the man’s Samsung cellphone before fleeing the scene. Police say the victim identified Davis as the gunman in a photo lineup.\nMagisterial District Judge Thomas F. Malloy Sr. arraigned Davis on the charges Tuesday afternoon and ordered him held at the Luzerne County Correctional Facility with bail set at $75,000.\nPolice say Davis is a suspect in a rash of recent robberies in the Heights and North End sections of the city, and he is already awaiting trial in two other robbery cases.\nThe first took place Feb. 8 at the Sherman Hills apartments, where Davis allegedly grabbed his ex-girlfriend by the neck and stole her wallet. Police say Davis removed the money and discarded the wallet in a hallway.\nThe next case took place at the United Check Cashing on Wilkes-Barre Twp. Boulevard on Feb. 21. Police allege Davis confronted a customer who had just bought a money order, pulling a pistol and robbing the man of money order as well as $600 from his wallet.\nDavis — who police say was also wanted in New York for absconding on his parole in a robbery case — is also awaiting trial in two other Luzerne County cases on charges including drug possession and fleeing police.\nIn one case, Davis is accused of a domestic violence assault and fleeing police on Jan. 20. Police said he evaded officers by jumping our of a second-story window.\nThe other case stemmed from his arrest at the Sherman Hills complex on Feb. 22. Police found Davis hiding in a closet, and he then lied about his name and birthday, police said.\nHe was also found to be hiding a bag of marijuana in his underwear, police said.\nDavis is being held at the Luzerne County Correctional Facility with bail set at total of $285,000 in the five cases.", "url": "https://apnews.com/5efbacc55f194870816e4cd4ec08bfd1"}