{"authors": ["Doug Henwood", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Carl Beijer", "Tim Higginbotham", "Matt Bruenig", "Natalie Shure"], "date_download": "2020-05-04 19:50:49", "date_modify": "2020-05-04 19:50:49", "date_publish": "2019-11-18 00:00:00", "description": null, "filename": "2019_11_elizabeth-warren-medicare-for-all-m4a-wall-street-insurance_1588621849.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/11/18131502/GettyImages-1188319810.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_11_elizabeth-warren-medicare-for-all-m4a-wall-street-insurance_1588621849.html", "title": "Wall Street Doesn’t Believe Elizabeth Warren Is Serious About Medicare for All", "title_page": "Wall Street Doesn’t Believe Elizabeth Warren Is Serious About Medicare for All", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "People on the Left have been debating Elizabeth Warren’s health plan since it was released a couple of weeks ago — “realistic” or a ruse? I vote ruse, but I don’t want to make that argument myself right now. Instead, I’ll allow a research note from Barclays, which found its way into my inbox, do that work.\nHere’s the opening paragraph of the report, by Barclays analyst Steven Valiquette:\nCompared to her previous hardline stance on M4A, the new plan represents a significant change in tone, in our view. Not only does the transition plan push out the legislative agenda for M4A (potentially to year 3), but it also tacitly acknowledges the practical and political resistance of pushing too much change too quickly. In fact, we think Warren’s plan was carefully crafted to appease both progressive and moderate Democrats, and may afford her flexibility to pivot on health care issues throughout the Democratic primaries. All said, her near-term plan seems much closer to more moderate proposals endorsed by Biden and Buttigieg; and as such the “pivot” catalyzed HC [health care] Services stocks on Fri with MCOs [managed care organizations] leading the way (+5% vs S&P 500 up 0.8%).\nHealth-care stocks rallied on the release of Warren’s plan, meaning that Wall Street — which isn’t always right, but does have some skill in decoding political bullshit — sees her plan as political bullshit.\nWarren’s defenders say the scheme, to start with a “moderate” Dem plan and wait three years to push for the full program, is politically realistic, given congressional and other political constraints on ambitious social programs. That argument never made sense to me. If the success of the Right over the last few decades has taught us anything, it’s that going for maximalist demands gets results. You might have to make some concessions along the way, but you get some wins and also push the political center of gravity in your direction. If you start out already compromised, you won’t get anywhere.\nSo that whole phase-in approach looked to me like a signal that she wasn’t serious about the Medicare for All (M4A) part — that it was just for show. Barclays offers support for the cynical reading:\nHowever, based on recent history, we note that a US president typically enacts signature legislation during their first two years in office (e.g., ACA under Obama, tax reform under Trump), so the possibility that M4A may slip until year three further decreases the likelihood that this plan comes to fruition, in our view.\nThe only question is how conscious Warren is of this. Since she’s quite smart, it’s hard to believe she isn’t.\nMuch of the rest of Valiquette’s note is devoted to analyzing how bullish her opening gambit to allow people to buy into Medicare would be for Humana ($2.6 billion in profits in the most recent year, growing at a 7 percent annual rate). A Medicare buy-in would allow people over fifty to buy packages similar to Medicare Advantage, the semi-privatized option run by managed care companies that restrict coverage in all the too-familiar ways. (For people under fifty, there would be a “modest-cost” public option.)\nEnrollees in Medicare Advantage plans rate their care lower than traditional Medicare plans, especially if they have chronic illnesses. Traditional Medicare allows you to “choose your doctor,” and Medicare Advantage doesn’t. Since the inability to choose your doctor is one of the major raps against “socialized medicine” — nonsense, given all the restrictions that come with private plans — Warren is embracing one of least appealing parts of Medicare as the leading edge of her plan, the one that’s supposed to build support for the transition to full M4A.\nBut her scheme would be great news for Humana. The company left the Obamacare exchanges in 2017, and if there were a scheme to allow people to buy into Medicare, most of the migrants would presumably come from those exchanges. Barclays estimates a Warren-style buy-in would boost Humana’s earnings per share (EPS) by fifty cents. That’s not a massive windfall, given current EPS of just under $19. But it is a step in the wrong direction, since companies like Humana need to be put out of business, as a serious M4A plan would do.\nSupporting evidence: the performance of Humana stock over the last month.", "url": "https://www.jacobinmag.com/2019/11/elizabeth-warren-medicare-for-all-m4a-wall-street-insurance"}