{"authors": ["Seth Mclaughlin The Washington Times"], "date_download": "2020-05-04 20:23:13", "date_modify": "2020-05-04 20:23:13", "date_publish": "2019-03-07 09:19:50", "description": "More than half of Arizona voters support the legalization of marijuana, according to a survey that had previously shown a majority of voters opposed the idea. The OH Predictive Insights poll...", "filename": "_a99e4c2fd82944cbdfcab9f9c9514ebf_1588623793.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a99e4c2fd82944cbdfcab9f9c9514ebf_1588623793.html", "title": "Majority of Arizona voters back marijuana legalization for the first time: Poll", "title_page": "Majority of Arizona voters back marijuana legalization for the first time: Poll", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Majority of Arizona voters back marijuana legalization for the first time: Poll\nMore than half of Arizona voters support the legalization of marijuana, according to a survey that had previously shown a majority of voters opposed the idea.\nThe OH Predictive Insights poll released on Thursday found that 52 percent of likely 2020 general election voters back marijuana legalization, and 41 percent opposed it.\n“More than two years after voters narrowly rejected legalizing adult use marijuana, Arizonans have become more comfortable with the idea,” said Mike Noble, chief of Research and managing partner of Phoenix-based research company OH Predictive Insights. “If supporters of adult use marijuana go back to the ballot in 2020, they face an open-minded electorate and better prospects for success than in 2016.”\nIn 2016, voters in Arizona rejected a ballot measure that called for legalization by a 51 percent to 48 percent margin.\nThe poll showed major divisions in the electorate, with Democrats being more supportive than Republicans overall.\nVoters between the ages of 18 and 54 backed legalization by a wide 57-35 margin, while those 65 and older opposed the idea by a 43-48 margin.", "url": "https://apnews.com/a99e4c2fd82944cbdfcab9f9c9514ebf"}