{"authors": ["Mike Considine"], "date_download": "2020-05-04 20:28:42", "date_modify": "2020-05-04 20:28:42", "date_publish": "2019-05-14 05:00:00", "description": "There is little doubt that TAPPS 5-II is the strongest district in the state. TAPPS 3-II champion Holy Cross (21-11-1) and runner-up Providence (14-9) both were victims of its power in the...", "filename": "_4b27d4d044274ea5a01e9f4517388abb_1588624122.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4b27d4d044274ea5a01e9f4517388abb_1588624122.html", "title": "Houston-area teams eliminate Holy Cross and Providence in second round", "title_page": "Houston-area teams eliminate Holy Cross and Providence in second round", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "There is little doubt that TAPPS 5-II is the strongest district in the state.\nTAPPS 3-II champion Holy Cross (21-11-1) and runner-up Providence (14-9) both were victims of its power in the Division II area round of the playoffs. District champion Houston Lutheran South (18-3) felled Providence 10-0 in five innings on May 6 and Holy Cross succumbed to third-place finisher Houston Second Baptist 5-0 on May 8.\n“When they beat us, I said they were going to state,” Providence coach Kat Chavarria said of Lutheran South. “Their pitcher is lights out. They’re a really consistent team offensively and defensively.”\nHouston Lutheran South reached the state semifinals by blanking Victoria St. Joseph 11-0 on Saturday in the next round. Pioneers pitcher Shelby Smith recorded her fourth-consecutive shutout.\nHouston Second Baptist was scheduled to play district runner-up and defending state champion Sugar Land Fort Bend Christian (15-8) on May 13 in the state quarterfinals in a game postponed because of rain. Holy Cross’ game against Second Baptist also was postponed from May 7 to May 8, causing the Knights to lose the home-field advantage.\nThe game was played in Three Rivers, where pitcher Riley Warnica limited the Knights to four hits.\n“The truth of that ballgame is that they were better than we were on that day,” Holy Cross coach Angel Cedillo said.\nHoly Cross ended the game with the bases loaded in the bottom of the seventh. Freshman Angel Gonzales reached base with a single and advanced on a walk and an error. However, Warnica retired the next two batters.\n“Their kid pitched the ball really well,” Cedillo said. “We just didn’t get the timely hit, and they did.”\nThe Knights coach said Sarah Rangel and Darrian Barrera were the team’s top hitters against Second Baptist.\n“Sarah and Darrian had some really good at-bats,” Cedillo said. “Sarah hit the ball 220 feet, but it was about eight feet foul. She and Darrian battled really well.”\nSenior catcher Brianna Rangel returned from nose and facial bone fractures to rejoin the Knights. Along with her cousin, Sarah Rangel, and center fielder Alexia Olivo, they’ll be key graduation losses for Holy Cross.\n“We’re proud of the girls,” Cedillo said. “There’s no doubt, because of the work they put in. We know they’ll be back. They’re just too good not to be.”\nHoly Cross will return the bulk of its three-time district championship team next season, and should get help from a district title-winning middle school team.\nTAPPS 5-II champ Houston Lutheran South downs Providence\nThe Provets ran into a buzzsaw in Smith. The Seton Hall recruit allowed just two hits while striking out 11. Smith also hit a solo home run.\n“Last year, she held us to one hit,” Chavarria said referring to a bi-district game. “We came in knowing they had a solid pitcher, and I threw some heat at them (in batting practice). They weren’t psyched out, like they were last year.”\nSophomore Amelia Franco and freshman Kiersten Salinas accounted for Providence’s hits.\n“We had a couple of other girls get on base with walks and errors,” Chavarria said, “but Amelia and Kiersten were big for us.”\nLike Holy Cross, Providence will return a large contingent of players.\n“We only have two senior starters, so that benefits us preparing for next year,” Chavarria said.", "url": "https://apnews.com/4b27d4d044274ea5a01e9f4517388abb"}