{"authors": ["Gary Abernathy"], "date_download": "2020-05-04 21:07:19", "date_modify": "2020-05-04 21:07:19", "date_publish": "2019-05-14 22:31:26", "description": "If age alone is not enough, journalism and politics are professions guaranteed to lead to a case of chronic cynicism. Having spent a 30-plus-year career divided between those two pursuits, it’s...", "filename": "_5aa62a03c73a40c1ab6ce7ee5d22157d_1588626439.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5aa62a03c73a40c1ab6ce7ee5d22157d_1588626439.html", "title": "These are times to try cynics’ souls", "title_page": "These are times to try cynics’ souls", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "If age alone is not enough, journalism and politics are professions guaranteed to lead to a case of chronic cynicism. Having spent a 30-plus-year career divided between those two pursuits, it’s difficult for me to view politics, particularly in Washington, with anything but jaded eyes.\nI recognize that such relentless skepticism is unhealthy, so the occasional chance to speak with high school or college students — who still exhibit hope and optimism about government and politics — is a much-needed elixir. They help recalibrate my attitude, at least briefly.\nBut then comes a spectacle such as Attorney General William Barr’s appearance before the Senate Judiciary Committee recently, where I watched practiced masters ply their well-honed thespian skills.\nDemocrats brought varying degrees of commitment to their assigned roles during Barr’s guest-starring turn on Capitol Hill.\nSen. Kamala Harris of California offered a convincing portrayal of a prosecutor, complete with knowing nods and dismissive asides. Sen. Mazie Hirono of Hawaii had the juiciest lines, but she was curiously still on book, reading her part with little conviction. Calling a U.S. attorney general a liar should be done with more than the casual air of someone commenting on the weather. Barr’s performance was unsteady as he waited, often in vain, for his cue to emerge, but Judiciary Committee Chairman Lindsey Graham, R-S.C., has his “outraged and offended” routine down pat.\nWhy were Democrats furious with Barr for his four-page summary of special counsel Robert Mueller’s report and Barr’s pre-release news conference? Because he set the narrative. They wanted to set the narrative! How dare he steal their thunder.\nThe New York Times recently reported, “As Speaker Nancy Pelosi urges caution on impeachment, rank-and-file House Democrats are agonizing over the prospect of trying to oust President Trump, caught between their sense of historic responsibilities and political considerations in the wake of the special counsel’s damning portrait of abuses.”\nThe notion that anyone in Congress is “agonizing” over “their sense of historic responsibilities” was comical to me. Try as I might, I detect no authentic outrage over the Mueller report by seasoned Democrats such as Pelosi of California, Senate Minority Leader Chuck Schumer of New York, House Intelligence Committee Chairman Adam Schiff of California or House Judiciary Chairman Jerrold Nadler of New York, whose feud with Trump is personal and goes back decades. There is simply applause to be earned from a grateful Democratic base.\nWhen it’s their turn, Republicans will be just as happy to switch roles, as will happen in the coming months when more details arise about the genesis of the Trump-Russia probe. Republicans are no less driven by the temperature of their base. But Republicans in Congress will dump the president in a heartbeat if his poll numbers among the GOP faithful go south.\nBut then I stop and chide myself. Maybe I’m wrong. Maybe my cynicism runs too deep. I remind myself that I personally know members of Congress who are sincere and do good things for their constituents. I try to tell myself that maybe the Democrats’ outrage over Trump, Barr and the Mueller report is real.\nBefore long, though, my cynicism owns me again. I try to exorcise the demon, but it materializes with every congressional hearing, every Washington news conference, every campaign stump speech. What I see is not good government, just poll-tested show business.\nStill, we can’t all be cynics. Politicians need the trusting and the innocent. Perhaps this is why the parties target the youth vote, and some even want to lower the voting age to 16, before pessimism takes root.\nDemocratic partisans and Never-Trumpers will naturally cheer the coming hearings on obstruction of justice and other Mueller report matters. But I particularly envy the true believers, the Americans who will watch the proceedings believing they are witnessing history unfold. In their eyes, Democratic members of Congress will be rising to meet their “historic responsibilities.”\nI’ll watch the same hearings and seeing nothing more than the latest chapters of the “Trump-Russia Collusion and Obstruction Show,” a Partisan Political Production that was almost derailed when the attorney general exercised script approval over last month’s blockbuster finale. No worries. It’s been renewed for additional episodes — with a guarantee through 2020.\nGary Abernathy is a contributing columnist for the Washington Post and a freelance writer based in Hillsboro, Ohio.", "url": "https://apnews.com/5aa62a03c73a40c1ab6ce7ee5d22157d"}