{"authors": ["Matt Bruenig", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Michael Lighty", "Natalie Shure", "Andrej Markovčič"], "date_download": "2020-05-04 19:53:02", "date_modify": "2020-05-04 19:53:02", "date_publish": "2019-07-02 00:00:00", "description": null, "filename": "2019_07_medicare-for-all-health-care_1588621982.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/07/02112327/35153038060_5055745883_z.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_07_medicare-for-all-health-care_1588621982.html", "title": "The US Health System Is a Nightmare Where 50 Million Go Uninsured Every Single Year", "title_page": "The US Health System Is a Nightmare Where 50 Million Go Uninsured Every Single Year", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Everyone knows the American health-care system is a disaster, but surprisingly few realize just how much of a disaster it really is. One reason for this is that the statistics we use to measure it completely miss how much anguish is caused by people constantly cycling in and out of insurance plans. In prior posts, I have tried to produce some figures that help illuminate the immense degree of “churn” in our system. In this post, I do the same thing, but with a new data source. What this source reveals is that, in a given twelve-month period, one in four adults between the ages of eighteen and sixty-four — 50 million people — face a spell of uninsurance.\nNormal estimates of uninsurance miss this fact because those estimates are either annual surveys that ask individuals if they were uninsured for the entire year (Census) or point-in-time surveys that ask people if they are currently uninsured (Gallup). These are useful statistics to have, but they do not really capture how prevalent uninsurance is. To capture that, you need to ask people if they were uninsured at any point over some period of time, such as over the last year.\nThe Behavioral Risk Factor Surveillance System (BRFSS), a massive ongoing public health survey, asked precisely this question in 2014: “In the PAST 12 MONTHS was there any time when you did NOT have ANY health insurance or coverage?”\nThe answer?\nIn the forty-three states using questions from the optional module, 75.6 percent of adults aged 18–64 years had continuous health insurance coverage, 12.9 percent had a gap in coverage, and 11.5 percent had been uninsured for more than twelve months.\nThat’s right: one in four adults between the ages of eighteen and sixty-four faced a spell of uninsurance in the prior twelve months, meaning that they were either uninsured for the entire twelve months or for some period of time during those twelve months. Based on current population estimates, this is just under 50 million people, and that’s not even counting children and elderly people.\nThe following graph shows the difference between the Census whole-year estimate (2014), the Gallup point-in-time estimate (2015Q1), and the BRFSS any-point estimate (2014).\nWhat’s important to understand about this figure is that it is a direct result of the way in which our health insurance system constantly causes people to lose their insurance at nearly every critical life moment: loss of job, loss of spouse, loss of parent, loss of Medicaid upon income increase, turning twenty-six, moving states, and so on. Indeed, even those who manage to stay continuously insured are nonetheless forced to switch plans all the time, often losing their doctors and preferred providers in the process.\nOnly a seamless national health plan that keeps you insured no matter what happens to you, like that envisioned by the Medicare for All proposal, can finally rescue Americans from this nightmare system.", "url": "https://www.jacobinmag.com/2019/07/medicare-for-all-health-care"}