{"authors": ["Travis Fain", "Wral Statehouse Reporter"], "date_download": "2020-05-04 20:07:04", "date_modify": "2020-05-04 20:07:04", "date_publish": "2019-05-08 20:49:00", "description": "A climate change group known for taking on Duke Energy filed an ethics complaint against Senate Minority Leader Dan Blue on Wednesday, suggesting that his support of key legislation for the...", "filename": "_10dafe42428e63d48b240361203cda8f_1588622824.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_10dafe42428e63d48b240361203cda8f_1588622824.html", "title": "Complaint filed over Wake lawmaker's Duke Energy bill, his law firm's pipeline work", "title_page": "Complaint filed over Wake lawmaker's Duke Energy bill, his law firm's pipeline work", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A climate change group known for taking on Duke Energy filed an ethics complaint against Senate Minority Leader Dan Blue on Wednesday, suggesting that his support of key legislation for the company is tied to work his family law firm does for the Duke’s planned natural gas pipeline.\nNC WARN said it would also forward this complaint to the U.S. Attorney’s Office, saying in a release that “the timing of Blue’s paid work and promotion of Duke’s interests raise suspicion about a potential quid pro quo.”\nBlue, D-Wake, dismissed the complaint as an absurd “out-of-the-sky accusation.” He insisted that Duke and the conglomerate behind the Atlantic Coast Pipeline are separate entities, though Duke owns nearly half the line.\nHe said Senate Bill 559, which he’s co-sponsoring this session, doesn’t help the company, but simply gives the North Carolina Utilities Commission a new way to review rate increase requests. Sponsors have said repeatedly that the bill doesn’t require the commission to change its process; it just provides the option.\nThe bill is a priority for the company, though. It helped write it, and its lobbying team is working it hard.\nThe bill would allow the Utilities Commission, which regulates Duke and other utilities, to approve annual rate increases as much as five years in advance. It was filed after a commission decision last year denied Duke billions in requested increases to cover future coal ash clean up costs and to remake the state’s electric grid over the coming decade.\nBlue said in a statement Wednesday that his involvement with the bill “was vetted with legislative staff prior to its filing.” He told reporters that he “talked informally with ethics lawyers who did not see a conflict” and that he hasn’t been influenced “by anything Duke has done.”\n“Anyone claiming that I can be bought doesn’t know my record,” Blue, who is a former House speaker and has been in the state legislature more than 30 years, said in a written statement.\nNC WARN’s complaint runs 44 pages, though much of that is a list of land condemnations Blue’s firm is working on the pipeline’s behalf, various documents showing that the pipeline is partly owned by Duke and a letter that Blue and other legislators, from North Carolina and beyond, co-signed to the Federal Energy Regulatory Commission in 2017 backing the pipeline plan.\nThe pipeline would run from West Virginia to Robeson County, feeding natural gas to power plants as Duke and Dominion Energy, its partner in Virginia, move from coal-fired power to natural gas. NC WARN, like a lot of environmental groups, opposes the pipeline, and construction has been held up by a federal court ruling.\nBlue’s firm represents the pipeline partnership in at least 32 land condemnation proceedings along the pipeline route, according to a rundown NC WARN attached to its complaint. Blue acknowledged Wednesday that his firm has represented the pipeline company “in several eminent domain cases,” but he said that doesn’t connect to the bill.\n“I’ve no dealings with Duke,” he told reporters after the Senate wrapped its business on Wednesday. “The ACP is a separate entity.”\nThe pipeline is a joint venture between Dominion, Duke, Piedmont Natural Gas and Southern Company Gas. Dominion is handling construction and owns 48 percent of the LLC, with Duke owning 47 percent, according to Duke’s 2018 annual report.", "url": "https://apnews.com/10dafe42428e63d48b240361203cda8f"}