{"authors": ["Times-Tribune Readers"], "date_download": "2020-05-04 21:06:41", "date_modify": "2020-05-04 21:06:41", "date_publish": "2019-02-26 00:00:00", "description": "Sell Scranton district’s office Editor: Although I’m not traditionally a fan of selling off assets to help clear up years of mismanagement, I truly think it’s time.", "filename": "_20880eda7ea24b4ab79968f5cfda2959_1588626401.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_20880eda7ea24b4ab79968f5cfda2959_1588626401.html", "title": "Letters To The Editor 2/26/2019", "title_page": "Letters To The Editor 2/26/2019", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sell Scranton\ndistrict’s office\nEditor: Although I’m not traditionally a fan of selling off assets to help clear up years of mismanagement, I truly think it’s time.\nThe Scranton School District should sell the administration building and take those employees and place them throughout existing schools and/or other buildings. It would allow administrators to be in the schools and see what actually happens in the district. Having the administrators do routine hall patrols as well as lunchtime monitoring would make a big impact.\nIt’s time to sell the ivory tower and put school district employees in the schools, not in isolation in the administrative building.\nDEREK RAINES\nSCRANTON\nPrimary objections\nto public cost\nEditor: I agree with Jennifer Bullock (“Exclusionary pattern,” Feb. 15) about Pennsylvania’s closed primary system, which keeps the two major parties in control of our elections.\nPrimary elections should be open to all electors and parties. Nothing in the Pennsylvania Constitution allows, let alone mandates, primaries. If we have them, especially at taxpayer expense, then they should be equal. The constitution mandates that elections be “free and equal,” yet the primaries obviously are not.\nHaving held a Republican Party leadership position before becoming an independent, I understand the desire of the parties to keep nonmembers from participating. What I don’t understand is how they legitimately can continue to expect taxpayers, a growing number of whom have left major parties or simply never joined when registering to vote, to pay for primaries.\nThe state is under a mandate to replace voting machines with ones that have verifiable paper trails. The cost is estimated at more than $125 million, with the federal government providing a small portion of the necessary funds. The rest would come from state taxpayers. No sooner would this bill be paid than another mandate likely would come to upgrade yet again as technology and threats increase.\nIf the Democratic and Republican parties wish to continue their closed primaries then they need to pay the bills associated with such. That includes paying a fair portion of the costs of the new voting machines.\nOf course, if they wish to forgo the expense then they are free to take their primaries private.\nThere are several special elections statewide, including one here in the 114th Legislative District on March 12. No primary was necessary for any of these, so there is obviously a system in place should the parties choose to get off the taxpayers’ dime.\nDAVID KVERAGAS\nNEWTON TWP.\nSocialist damage\nEditor: U.S. Rep. Alexandria Ocasio-Cortez, a radical socialist, and her sympathizers have won their first major victory in New York.\nThey succeeded in forcing Amazon, one of the world’s largest companies and one run by the richest man in the world, Jeff Bezos, to abandon plans to build a multibilliondollar center in Long Island City, Queens. Ocasio-Cortez is filled with animosity toward the rich and has successfully spread her message, which was received foolishly by citizens of New York.\nThe spoils of her victory were that thousands of construction workers needed to build the huge complex have lost an opportunity to make a lot of money. The airports of the city have lost the potential to make huge amounts of money from Amazon’s cargo planes. Small businesses, including restaurants, convenience stores and beauticians, could have had huge increases in income, but it is lost. Moreover, Amazon was to employ 25,000 workers at an average salary of $150,000, which totals more than the $3 billion lost in taxable income to the state of New York.\nThis truly is an achievement in which the new congresswoman should take pride.\nNEIL ACKERMAN\nSCRANTON\nEnabler chastened\nEditor: Jeffrey Toobin has moved from courtroom journalism to the wider world of features in important periodicals and even an important book.\nIn 2016 he wrote the definitive account of a major 1970s event in “American Heiress,” the kidnapping and adventure of Patty Hearst. In a recent issue of the New Yorker, Toobin’s “Time in a bottle” tries to explain recent behavior by political consultants Roger Stone and Jerome Corsi.\nLately, Corsi appeared apologetic and sensible in cable news interviews. Stone was tagged with a gag order recently by a judge.\nAfter a recent discussion about how Stone got to a place of scorn from where he started, I picked up “All the President’s Men,” by Carl Bernstein and Bob Woodward. It begins with a three-page cast of characters. Donald Segretti was identified as simply, attorney.\nIn the highly suspenseful movie from the book, Segretti looks too young to be 31. Ten years earlier, on the campus of the University of Southern California in Los Angeles, he gained popularity within fraternity life as a prankster. Among his classmates were future Nixon insiders: Ron Ziegler, press secretary, and presidential aide Dwight Chapin. Once in power, they remembered Segretti could be useful in the re-election campaign.\nIn the Committee to Re-Elect the President, he occupied an important role in the undoing of Nixon’s most serious Democratic competition in 1972. His messages on “official” Edmund Muskie stationery helped to doom that senator’s campaign.\nHe enjoyed his job as a “dirty trickster” of the re-election committee’s reconnaissance team when first visited by Woodward and Bernstein. It came to a quick end as he realized that there are consequences to having such fun.\nAlmost 50 years later another Nixon- and now, Trump-enabler, finally appears to be facing his comeuppance.\nRICHARD J. YOST\nSOUTH ABINGTON TWP.\nLetters to the Editor\nare welcome. Submissions should be limited generally to 300 words and may be emailed to letters@timesshamrock.com; mailed to Times-Tribune Letters to the Editor, 149 Penn Ave., Scranton, PA, 18503; or faxed to 570-348-9135. All submissions are edited before publication.", "url": "https://apnews.com/20880eda7ea24b4ab79968f5cfda2959"}