{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:13:25", "date_modify": "2020-05-04 20:13:25", "date_publish": "2019-11-27 05:01:06", "description": "DALLAS (AP) — Paul George scored 17 of his 26 points in the first quarter, Kawhi Leonard finished with 28 and the Los Angeles Clippers took control early in a meeting of teams with matching...", "filename": "_66af314f92f14091b1dfa1adc757fe56_1588623205.html", "image_url": "https://storage.googleapis.com/afs-prod/media/cbd78f24d0b846d28a084f4481e9027a/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_66af314f92f14091b1dfa1adc757fe56_1588623205.html", "title": "George, Clippers stop Doncic, Mavs 114-99 for 6th straight", "title_page": "George, Clippers stop Doncic, Mavs 114-99 for 6th straight", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Los Angeles Clippers guard Lou Williams (23) works against Dallas Mavericks guard J.J. Barea (5) for a shot opportunity in the second half of an NBA basketball game in Dallas, Tuesday, Nov. 26, 2019. (AP Photo/Tony Gutierrez)\nLos Angeles Clippers guard Lou Williams (23) works against Dallas Mavericks guard J.J. Barea (5) for a shot opportunity in the second half of an NBA basketball game in Dallas, Tuesday, Nov. 26, 2019. (AP Photo/Tony Gutierrez)\nDALLAS (AP) — Paul George scored 17 of his 26 points in the first quarter, Kawhi Leonard finished with 28 and the Los Angeles Clippers took control early in a meeting of teams with matching five-game winning streaks, beating the Dallas Mavericks 114-99 on Tuesday night.\nThe Clippers used several defenders to end Luka Doncic’s franchise-record streak of four games with at least 30 points and 10 assists. George had a career-high six steals as Los Angeles held the Mavericks under 100 points for the first time this season.\nThe Clippers limited the 20-year-old phenom to 4-of-14 shooting, including 0 for 7 from 3-point range. The Slovenian star made 14 of 16 free throws and finished with 22 points, eight rebounds and six assists.\nPatrick Beverley got in foul trouble as one of the defenders assigned to Doncic, but getting his fourth early in the second half just brought back Lou Williams sooner. The high-scoring reserve finished with 21 points, going 4 of 7 on 3-pointers.\nNUGGETS 117, WIZARDS 104\nDENVER (AP) — Nikola Jokic had 20 rebounds and Jerami Grant scored a season-best 20 points to lead Denver over Washington.\nJokic finished one rebound shy of his career high and added eight points in Denver’s sixth straight win.\nWill Barton had 17 points, eight rebounds and eight assists for the Nuggets, who are 10-1 in November and ended a three-game home losing streak against the Wizards. Jamal Murray scored 16 and Mason Plumlee 15.\nDenver held one of the NBA’s most prolific offenses to its second-lowest point total of the season. Washington entered averaging 119.1 points and had failed to score at least 100 just once in 15 games. It needed 35 in the fourth to reach the century mark this time.\nBradley Beal, the Wizards’ leading scorer at 29.6 points per game, was held to 14 on 6-for-15 shooting. He was 2 of 10 from behind the 3-point line.\nJordan McRae had 21 points for Washington.\n___\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP_Sports", "url": "https://apnews.com/66af314f92f14091b1dfa1adc757fe56"}