{"authors": ["Kasey Cunningham", "Wral Reporter"], "date_download": "2020-05-04 20:13:19", "date_modify": "2020-05-04 20:13:19", "date_publish": "2019-04-10 01:30:00", "description": "Cleanup was underway Tuesday in Chatham County, which was one of the areas that was hardest hit by a powerful line of thunderstorms that moved through Monday night. Residents off of South...", "filename": "_96aac0d881ed9db8a32821a887666f29_1588623199.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_96aac0d881ed9db8a32821a887666f29_1588623199.html", "title": "Despite storm damage, Chatham County residents say it's 'a good day'", "title_page": "Despite storm damage, Chatham County residents say it's 'a good day'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Cleanup was underway Tuesday in Chatham County, which was one of the areas that was hardest hit by a powerful line of thunderstorms that moved through Monday night.\nResidents off of South Main Street have some major cleaning up to do.\n“I was at home yesterday afternoon and it started hailing. As soon as it started hailing, we lost a couple of trees behind our pond,” Will Shue said.\nShue spent Tuesday helping his grandmother take care of the damage outside her home, where two big pine trees and several branches fell.\n“There’s two down here, some down on the shed over here. Just picking it up a little at a time, doing what we can do,” Shue said of the cleanup effort. “Nobody’s hurt, no damage to the house, that’s what we’re going for.”\nDown the street, Alan Williams’ beloved work shed sits under a 100-year-old old oak tree.\n“I think it’s completely totaled,” he said of the shed.\nWilliams said he was at work when he got a call from his wife moments after the storm rolled through.\n“She called me up and said, ‘You’re not going to be happy. Your sheds got a big tree in the middle of it,’” he said.\nWilliams said he has already called his insurance company, which won’t cover the cost of building a new shed, but he’s still counting his blessings.\n“We’re all here and we’re all breathing and we’re above ground, so I think that’s a good day,” he said.", "url": "https://apnews.com/96aac0d881ed9db8a32821a887666f29"}