{"authors": ["Tom Oates", "Wisconsin State Journal"], "date_download": "2020-05-04 20:10:04", "date_modify": "2020-05-04 20:10:04", "date_publish": "2019-05-16 14:15:00", "description": "MILWAUKEE — Recent evidence to the contrary, it is not advisable for the home team to lose the opening game of an NBA playoff series. Losing the home-court advantage didn't come back to bite...", "filename": "_a2e27903783f490caddc69c4cd78b49f_1588623004.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a2e27903783f490caddc69c4cd78b49f_1588623004.html", "title": "Tom Oates: Bucks avoid major misstep with late push to close out Raptors in series opener", "title_page": "Tom Oates: Bucks avoid major misstep with late push to close out Raptors in series opener", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MILWAUKEE — Recent evidence to the contrary, it is not advisable for the home team to lose the opening game of an NBA playoff series.\nLosing the home-court advantage didn’t come back to bite the Milwaukee Bucks when they began their second-round series against the Boston Celtics with a listless loss on April 28 at Fiserv Forum. The Bucks came back to dominate the next four games and win going away.\nBut the Celtics, though talented, were a disjointed team that couldn’t stand up to the heat when the Bucks finally showed up to play. The Toronto Raptors, on the other hand, were unlikely to be that accommodating if the Bucks showed up for the first game of the Eastern Conference finals Wednesday night at Fiserv Forum as tired-looking and unmotivated as they did against the Celtics.\n“You just try to not have that feeling again, try to avoid that embarrassment that we had after game one, because we weren’t ourselves,” Bucks forward Giannis Antetokounmpo said earlier in the week. “Everybody is aware of what happened, the way the team was feeling. Against Boston, you can go down 1-0 and you’ll still be fine. But against Toronto, it’s hard to be in that spot when you lose the first game in your home.”\nAs important as the series opener against the Raptors was, there were reasons to wonder how the Bucks would come out of the gate this time.\nFirst, the Raptors are a good team that is playing well, with their 58 regular-season wins second only to the Bucks’ 60 in the NBA. Second, the Raptors were coming off the high of Kawhi Leonard’s rim-dancing game-winner at the buzzer in the seventh game of its series with Philadelphia on Sunday. Finally, though the Bucks were well-rested from a week off following their early dismissal of Boston, even coach Mike Budenholzer admitted that it’s hard to recreate playoff intensity in practice and he was worried the Bucks would start slowly after going six days without a game.\nAware that the needed to stay sharp, the Bucks players put in extra work at night early in the week.\n“Everybody showed up because everybody knows ... how important it is to set the tone in game one,” Antetokounmpo said. “That’s what a special team does. That’s what a great team does.”\nIf that’s the case, it took the Bucks a long time to set the tone Wednesday night. Rallying in the fourth quarter after shooting abysmally from 3-point range in the first three, the Bucks got the series off to the start they were looking for with a 108-100 win over the Raptors, a victory that was way harder than it looked.\n“The first half, I don’t think we were very good,” Budenholzer said.\nDespite another listless start, the Bucks managed to dig their way out of the hole they created for themselves. The thanks for that went to some old friends — strong defense, a deep bench and timely contributions from center Brook Lopez and guard Malcolm Brogdon, two stalwarts who had been missing in action. After falling behind by as many as 13 points in the first quarter, the Bucks gradually stabilized the situation through the second and third quarters before dominating the fourth.\n“Maybe it took us a quarter or two, but I think our mind was in the right place,” Lopez said. “We were playing with a lot of energy and a lot of toughness. Shots weren’t going down but we were in a much better place from the get-go than we were in game one against the Celtics.”\nThe Bucks’ biggest problem against the Raptors was they didn’t heed their own advice. As they did against the Celtics, they looked sluggish on both ends in the first quarter.\nOn offense, Antetokounmpo came out like a man on a mission but didn’t have any followers as the rest of the Bucks struggled, finishing the quarter shooting 33.3% overall and 20% from 3-point range. The most telling stat: Milwaukee missed its first six shots from deep, most of them long, a sign perhaps of a team that was too jacked up at the start.\nIt wasn’t any prettier on defense as the Bucks fell behind 34-23 after one quarter. The defense, ranked No. 1 in the NBA during both the regular season and playoffs, had some uncharacteristic breakdowns. That gave the Raptors open shots from 3 and at the rim, a major reason they shot 52% overall and 46.2% from 3.\nThough the slow start meant they would have to play from behind for much of the game, the Bucks wore down the Raptors by the fourth quarter, putting on a 32-17 finishing kick after entering the quarter trailing by seven. After missing their first 12 3-point shots in the second half to fall to 6-for-35 in the game, they were 5-for-9 down the stretch, a run kicked off by back-to-back 3s by Lopez, who had shot just 23.8% from 3 in his last 13 games.\n“I think the way the guys competed and got after it defensively in the second half, and particularly the fourth quarter, just stands out to me,” Budenholzer said. “We feel like we can get better. To get this win after a pretty significant (stretch of) days without playing, hopefully we’ll be better between now and game two.”\nFrom the Bucks’ standpoint, the best thing you can say about Game 1 is they got it out of the way. It wasn’t pretty, but in the end they got what they wanted, a 1-0 lead in the series.", "url": "https://apnews.com/a2e27903783f490caddc69c4cd78b49f"}