{"authors": ["Nick French", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Eric Blanc", "Mike Stivers"], "date_download": "2020-05-04 19:54:25", "date_modify": "2020-05-04 19:54:25", "date_publish": "2019-03-07 00:00:00", "description": null, "filename": "2019_03_a-different-kind-of-teachers-strike-wave_1588622065.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/03/07115018/GettyImages-1131234405.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_03_a-different-kind-of-teachers-strike-wave_1588622065.html", "title": "A Different Kind of Teachers’ Strike Wave", "title_page": "A Different Kind of Teachers’ Strike Wave", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nAfter decades of decline, the past year has seen a dramatic revival in labor militancy. Public school teachers have been at the forefront of this resurgence, starting with a dramatic wildcat strike in West Virginia in February 2018, then a wave of teacher strikes that swept the nation, moving from red states like Arizona and Oklahoma to blue California and Colorado. This is not the first time teachers have taken mass, militant labor action in the United States; the 1970s saw a similar strike wave. But today’s strikes have centered antiracist class-struggle demands that unite teachers and school communities, particularly in LA, Oakland, and Chicago; the strikes of the 1970s exacerbated tensions between mostly white teachers and the communities of color they served. Striking teachers have also made clear that public education must be funded by reappropriating the wealth of corporations and the ultrarich, not by higher taxes or benefit cuts to working people. The legacy of these toxic conflicts was division among working people, who should have been uniting to fight the opening salvos of austerity politics and neoliberal privatization. By the early 1980s, teachers found themselves politically isolated and vulnerable to increasingly aggressive right-wing attacks. The recent teacher strikes are significant because of the kinds of demands teachers are pressing: smaller class sizes, more support staff for students, and ends to school closures and charter school expansion. Teachers have won widespread public support for their cause by presenting demands on behalf of the entire working class, and by building solidarity against a common enemy: the billionaires hoarding obscene wealth and trying to destroy public education. Today, the teachers’ victories are victories for the working class. The solidarity being rebuilt through the current strike wave could be a seed of the kind of mass movement necessary to fundamentally reorder society: a movement of the multiracial working class, fighting to democratize our economy and break the stranglehold of the ultrarich over our political system.\nTeacher Strikes in the Late ‘60s and ‘70s As historian Jon Shelton reports in his recent history of teacher militancy in the second half of the twentieth century, Teacher Strike!, teacher strikes were common throughout the 1960s. But around the turn of the decade, the strikes spiked dramatically, peaking at more than 200 in the 1975–76 school year. (By contrast, there were only 300 strikes throughout all of the ‘60s.) They also took on a more militant character, with teachers engaging in illegal labor action and shutting down schools for weeks or months on end. Teachers engaged in major strikes in St Louis, Detroit, Chicago, Pittsburgh, Philadelphia, and New York City, as well as in smaller cities. Shelton cites two main issues driving the ‘70s strike wave. The first was the conflict, in the early part of the decade, between majority-white teachers unions and Black Power advocates, who pushed for greater community control of urban schools and wanted teachers to shoulder more care-taking responsibilities. The second was the fiscal crises many cities faced in the mid- to late ’70s, which forced city governments to reduce public employee payrolls and cut benefits. Structural economic changes led to fiscal pressure in many cities. Deindustrialization and “white flight” of higher-income taxpayers to the suburbs had decimated cities’ tax bases, while spending on public services and welfare increased as poorer people (predominantly people of color) continued to migrate to the cities and unemployment grew — a history recounted by William Julius Wilson in The Truly Disadvantaged. While teachers often won their strike demands throughout this period, the victories would prove pyrrhic. Resistance to black communities’ desire for more control over their schools alienated teachers from parents and students of color. Later on, when unions fought against municipal governments’ attempts to lay off teachers and cut pay and benefits, mayors and local media often succeeded in portraying teachers and other urban public employees as irresponsible, unproductive leeches. White workers and business owners (disproportionately located in the suburbs) were positioned as productive taxpayers, forced to pay for urban greed and excess. Ironically, this narrative lumped the mostly white teachers in with black people in the cities, who were stereotyped as undeserving welfare recipients. Shelton recounts this political dynamic playing out in many cities, including New York, Pittsburgh, and Philadelphia. These developments marked the beginning of the neoliberal turn: governments and policymakers rejected the postwar truce between capital and labor, embarking on a large-scale project of privatization and destruction of unions. As a result of the divisive strikes that did not build support or solidarity beyond educators, teachers unions were a politically vulnerable target for elites who wanted to attack labor and enact a corporate school reform agenda. In some ways, teachers were victims of conditions beyond their control. A global crisis of profitability spurred an aggressive capitalist assault on labor unions and public services generally, of which the attack on teachers was only a small part. Yet the character of teacher militancy in that era contributed to the weak position in which teachers unions eventually found themselves. Instead of unifying a broad coalition around shared material interests and uplifting school communities along with the teachers who served them, the teachers’ demands put them at odds with other segments of the working class.", "url": "https://www.jacobinmag.com/2019/03/a-different-kind-of-teachers-strike-wave"}