{"authors": ["Dawn Foster", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Lauren Townsend", "Matt Zarb-Cousin", "Solomon Hughes"], "date_download": "2020-05-04 19:57:04", "date_modify": "2020-05-04 19:57:04", "date_publish": "2019-08-01 00:00:00", "description": null, "filename": "2019_08_labour-party-boris-johnson-jeremy-corbyn-brexit_1588622224.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/08/01123755/GettyImages-1161779945.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_08_labour-party-boris-johnson-jeremy-corbyn-brexit_1588622224.html", "title": "Labour Can’t Let Tory Antics Distract It", "title_page": "Labour Can’t Let Tory Antics Distract It", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Amid the slew of announcements of newly installed prime minister Boris Johnson’s cabinet appointments, another member of Parliament grabbed public attention. Jacob Rees-Mogg issued his staff a style guide and list of banned words that was promptly leaked. The words “equal,” “yourself,” and “unacceptable” were banned. Periods were to have double spaces afterward, Oxford commas were banned, and people without nobility titles were to be called “esquire.” The level of attention the missive drew is indicative of a sickness in British politics: an obsession with civility as the bedrock of politics. For many in the media and senior positions in British institutions, politeness and civility remain the sole substance of politics. Politics becomes a game, with unspoken rules, that is merely about shifting power and entertaining, rather than the means of improving our collective life.\nOn the day Boris Johnson became prime minister, Jeremy Corbyn tweeted a number of comments and announcements. One was criticized by Alan Rusbridger, the former editor of the Guardian: a tweet about the closure of a Glasgow train yard and the loss of jobs that entailed. For Rusbridger, such a comment was ephemeral and pointless: the situation was outside of Westminster’s ambit and therefore not worthy of attention.\nThe Johnson administration is unlike any political cabinet that has come before. Like Johnson himself, it thrives on artifice and shock value, and leans to the far right. Labour’s response could be to react to each spectacle, each deliberate and farcical attempt to grab the headlines. Or it could choose to respond differently, with a greater political maturity.\nThe Conservatives are focused entirely on Brexit. No other policies are mooted, and there is no real concern evinced for social policy, the public sector, health, or inequality. On Wednesday, Johnson visited Belfast, dining with the Democratic Unionist Party (DUP) the night before meeting the five main political parties in Northern Ireland, claiming to treat them equally. Concurrently, workers had occupied the Harland and Wolff shipyard in Belfast, protesting the looming closure of the site. Irish language protestors joined the workers, as did protestors calling for the prosecution of soldiers for crimes committed during the Troubles. Labour wrote to the prime minister, calling for the East Belfast shipyard to be taken into public ownership; Johnson and DUP leader Arlene Foster chose not to visit the shipyard.\nIt is easy to fall into the Conservative Party’s new trap, to endlessly respond to the attention-seeking wrangling in Westminster. But for Labour, a far better strategy is to focus on crafting and communicating policy: pushing green industrial policy and expanding it to subsume more areas in need of regeneration. On benefits and welfare, Labour should be advocating a comprehensive new welfare settlement and not simply pointing out the flaws in universal credit.\nAlthough Johnson may be touring Britain and Northern Ireland now, he can scarcely hide the fact that the trip is a sop and will not be replicated; he is despised in Scotland and the north of Ireland, and the Conservatives are still struggling for an electoral foothold in Wales. Labour should focus on traveling and communicating their policies, ignoring Johnson’s Westminster tantrums and instead telling potential voters how different life, the economy, and the country could be under Labour.\nWhen Corbyn first became leader, Theresa May was thrown for a loop. During Prime Minister’s Questions, rather than engaging in the slanging match and the childish charade, Corbyn read out problems voters were experiencing as a result of government policy. When May responded, she sounded callous. Johnson et al. may enjoy the pomp and tone embedded in Westminster, but Labour are in a far better position to cut through the Brexit fog and speak to the people. The vast majority of the public are bored senseless by the incessant Brexit chatter, more concerned about health, education, and whether they can pay their rent.\nWhen Jacob Rees-Mogg acts out, the response should be to ignore him and instead focus on publicizing the plight of people who have been impoverished by capitalist callousness. Talking about industrial strategy and fighting poverty and unemployment will always be more important than some toff compiling a list of banned words.", "url": "https://www.jacobinmag.com/2019/08/labour-party-boris-johnson-jeremy-corbyn-brexit"}