{"authors": ["Jamie Mills"], "date_download": "2020-05-04 20:09:43", "date_modify": "2020-05-04 20:09:43", "date_publish": "2019-03-01 15:26:11", "description": "A proposal before the Connecticut Legislature would gradually raise the minimum wage over three years, reaching $15 an hour in 2022. This one policy change will have an immediate and meaningful...", "filename": "_3bc32bb8b4604cc2ad8088a7c0e993bc_1588622983.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3bc32bb8b4604cc2ad8088a7c0e993bc_1588622983.html", "title": "Jamie Mills Minimum wage hike needed, but not sufficient", "title_page": "Jamie Mills Minimum wage hike needed, but not sufficient", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A proposal before the Connecticut Legislature would gradually raise the minimum wage over three years, reaching $15 an hour in 2022. This one policy change will have an immediate and meaningful positive effect on the lives of over 510,000 Connecticut low-wage workers by increasing their net income, along with decreasing the poverty rate, and reducing or slowing the growth of income disparities in Connecticut.\nDespite some recent signs that Connecticut’s economy is growing and wages for low-wage workers are slightly and slowly increasing, working families continue to struggle to reach a decent standard of living. After decades of policy choices that have suppressed wage growth for most workers, raising the minimum wage is a simple and effective policy tool to address growing income disparities in our wealthy state. Connecticut Voices for Children believes everyone who works full time should be able to care for themselves and their children, and that Connecticut will prosper when everyone has the opportunity to participate fully, fulfill their potential and achieve economic stability. With wages so low, workers struggle to provide for their families. When parents work in low-wage jobs, the basic costs of having a family — health insurance, child care, housing, food — are often out of reach, and their children face daunting barriers to their health, development and opportunities.\nWho are these half-million Connecticut workers? According to a recent analysis of government data by the Economic Policy Institute, the typical worker who will benefit from a minimum-wage increase in Connecticut is a woman over 30 who works full time, and provides more than half of her household’s income. Twenty-five percent are parents. Forty-six percent have some college or have completed a college degree. The stereotype of minimum-wage workers as mostly teenage, part-time workers earning extra pocket money for sneakers or gas is simply wrong. Two-thirds of Connecticut’s low-wage workers are 25 or older, while only 10 percent are under 20 years old. They work across all industries with the largest share in retail trade, health care and food services.\nRaising the minimum wage will impact a subgroup of low-wage workers who depend on both earned income and public supports — such as Medicaid, housing and child care subsidies— to meet their basic needs. With an increase to the minimum wage, some workers will no longer need the public supports. However, given the high cost of living in Connecticut, we need to ensure that an increase in the minimum wage does not inadvertently cause some low-wage workers to be worse off because they have lost access to affordable health care or child care.\nA $15 minimum wage, while a meaningful policy change, is insufficient for a two-parent household with two children, both working full time, to afford the basic cost of living in Connecticut. A recent United Way report estimates the cost of basic annual household expenses for a family of four in Connecticut at $77,832. For some families, public supports enable them to get and keep jobs, access health care and lift themselves out of poverty. With increased earnings, some low-wage workers will lose public supports. We must ensure that an increase to the minimum wage, as a matter of public policy, does not result in minimum-wage earners suffering a net decrease in income or moving closer or falling back into poverty. Just as the minimum wage must be regularly adjusted to meet its stated purpose of setting a “fair and just wage,” our system of public supports must be routinely adjusted to ensure that higher wages and public supports can work together to improve, rather than diminish, families’ ability to afford the basic necessities of life.\nOur state has become increasingly split between the “haves” and the “have-nots.” Between the 1950s and 2015, the share of Connecticut income enjoyed by the top 1 percent has jumped from 10 percent to 27 percent. The top 1 percent in our state makes an astonishing 37 times what the bottom 99 percent makes, causing Connecticut to be the third most unequal state in the nation. Halting the growth of extreme inequality will take more than just raising the minimum wage; however, this one straightforward policy will help ensure that Connecticut’s lowest-paid workers have a better chance of reaching the middle class. Working from our many strengths, we can build a more inclusive economy that enables all families to provide their children with the opportunity to thrive.\nJamie Mills is director of fiscal policy and economic inclusion at Connecticut Voices for Children.", "url": "https://apnews.com/3bc32bb8b4604cc2ad8088a7c0e993bc"}