{"authors": ["Andrew Murray", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Dawn Foster", "Christine Berry", "Peter Gowan"], "date_download": "2020-05-04 19:55:27", "date_modify": "2020-05-04 19:55:27", "date_publish": "2019-10-25 00:00:00", "description": null, "filename": "2019_10_british-left-rise-fall-grenfell-corbyn_1588622127.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/10/25113128/GettyImages-1175971737.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_10_british-left-rise-fall-grenfell-corbyn_1588622127.html", "title": "We Want a Socialist Society", "title_page": "We Want a Socialist Society", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The following is excerpted from The Rise and Fall of the British Left — out now from Verso.\nFour years on from Jeremy Corbyn’s unexpected triumph, there is a realistic possibility of the election of a socialist government in Britain, or at least of the election of socialists to government. It is no more than a possibility. That it exists at all is due above all to the continuing crisis of the capitalist economy and the dissatisfaction of millions of people with their circumstances and prospects. The same situation exists across much of the world, upending all the assumptions which have prevailed for forty years or more. The greatest difficulties for the Left lie ahead: winning an election and governing thereafter. But everything that has happened since September 2015 has better fitted it for the task, on the time-honored principle that what doesn’t kill you makes you stronger. And there has been no shortage of efforts to kill the resurgent left: a media campaign of engulfing and almost demented hostility directed at Corbyn personally, from BBC political correspondent Laura Kuenssberg’s interrogation as to whether Corbyn would “kneel before the Queen” in week one, through to the Sun’s risible “comrade Cob” smear. An attempted coup by the Parliamentary Labour Party designed to send the Leader packing, if needs be, by barring him from standing for reelection. Theresa May’s “crush the saboteurs” snap general election, called at a moment when the putative “saboteurs” looked ill-equipped to resist a crushing. And, as of 2019, the breakaway of a rump of right-wing Labour MPs to establish a new, and already divided, party in alliance with several Tory parliamentarians in a maneuver explicitly and openly designed to stop the election of a Corbyn-led Labour government; while in parallel a new group has been established in Parliament by Deputy Leader Tom Watson to pull the party back towards the right. Yet the Left has held its position and advanced — the mass media has been confounded by its own waning influence in a more diverse communications landscape; the PLP were thwarted by Labour’s membership; and Theresa May was rebuked by the British people themselves. These were not just necessary victories in their own terms; they have reshaped the political map in lasting ways. Achievements can often be best recognized in their opponents’ reactions. The stunned faces of Corbyn-skeptic Labour MPs when the BBC’s general election exit poll came in on June 8, 2017, and the “Corbyn surge” was confirmed, were a measure of the change that had been wrought, not least in political expectations. The “surge” brought together the social movements (“fragments” no more) with the trade unionists, and the metropolitan students with working-class communities. Brexit is straining that coalition. But there are reasons the Left’s new strength is likely to be maintained.\nNeoliberalism Is Decaying To paraphrase Kenneth Wolstenholme of 1966 World Cup fame, the neoliberals thought it was all over. The final whistle had been blown and the Hayek-Thatcher-Reagan-Friedman team had won. Nothing more to argue about, history’s verdict was in. Sensible leaders on “the other side,” like Blair and Brown, acknowledged the result. There was nothing left to do but laugh all the way to the bank, literally in Tony Blair’s case, to cash the checks that the End of History had written. They are not laughing any more. The elite is struggling to come to terms with a world in which all it believed was solid starts in its turn to melt into air — free trade, globalization, the transatlantic alliance, US hegemony, the European Union, capitalist democracy, even liberalism itself. The post-1979 consensus is over. The 2017 general election was, as Jeremy Corbyn said, “the year politics caught up with 2008.” The economic impact of the crash had finally found an electoral expression. Since the shock of the 2017 election, undead neoliberalism has continued to wreak one misfortune after another in Britain. This is the twilight of Thatcherism, to give it the proper British name. But it is not ready to go quietly. What came in with bombs and bullets in Santiago goes out amid social calamity. As Chilean democracy was being taken down in 1973, Grenfell Tower in west London was going up. In a fire immediately after the 2017 general election, the twenty-four-story public housing block built between 1972 and 1974 was destroyed, with the loss of seventy-two lives. The inferno in North Kensington was an accident, while the coup in Chile was all too purposeful. But they are connected by the threads of neoliberalism. The principles which Pinochet adopted from Hayek and Friedman unwound at Grenfell throughout its forty-three years in occupation. It is a parable of the Thatcherite dogmas of privatization, deregulation, and public penny-pinching, written in ashes. Each prime minister played a part, dismantling the safeguards in place at the time of Grenfell’s construction. Mrs Thatcher scrapped the London Building Acts of the 1930s, which mandated that external walls have at least one hour of fire resistance to prevent flames from spreading between flats or entering inside. Her 1984 Buildings Act introduced competition into the inspection of regulation compliance. John Major expanded this, allowing different companies to license building inspectors, and creating a competitive market for ensuring that building regulations were met, thereby introducing two perverse incentives — those inspectors who were cheap would be preferred, likewise those who had a record of waving projects through. Enter Tony Blair. The Economist wrote in 2018 that his task had been to “broaden and deepen Thatcher’s reforms.” So it proved in the matter of building regulation. After a fatal fire in Scotland, his government mandated that sprinklers be fitted in all new blocks of flats more than about eleven stories high, but with no requirement to install them in existing tower blocks. Blair also introduced the Regulatory Reform (Fire Safety) Order (RRO) in 2006, which ended the government’s responsibility to certify that buildings had met fire codes, and shifted it instead to self-policing by owners. Those who found this too burdensome could commission private companies, licensed or not, to do the work. Meanwhile, a company marketing noncombustible insulation as a firesafe alternative to plastic was tied up in several years and millions of pounds’ worth of litigation initiated by the plastic insulation industry. Under David Cameron, Celotex, the company which would supply the plastic insulation used in the cladding at Grenfell, was included on an advisory panel on revising building regulations to meet targets for lowering carbon emissions. The UK market for plastic insulation doubled, and Celotex profits increased rapidly. Liberal Democrat minister Stephen Williams rejected calls for the installation of automatic sprinkler protection in older tower blocks: “I have neither seen nor heard anything that would suggest that consideration of these specific potential changes is urgent.” Tory housing minister Brandon Lewis was blunter, warning that the requirement to fit sprinklers would “affect house building — something we want to encourage.” Building homes that are affordable, safe, and profitable to the builder was apparently too challenging to contemplate. According to the British Automatic Fire Sprinkler Association, around 4,000 blocks had not been retrofitted at the time of the Grenfell fire — the cost to cash-strapped local authorities appearing to be the main reason. However, the market that had been created for testing cladding systems had become very lucrative. One client of the privatized Building Research Establishment (BRE) revealed that it was paid £20,000 for each test, and there were dozens each year. By 2014, the quantity of cladding and insulation systems needing BRE certification was so great that a new method of approval was required to speed things up. The trade body for private building inspectors, the Building Control Association (BCA), published fresh guidelines, allowing that “if no actual fire test data exists for a particular system” then the opinion of qualified experts, such as those at BRE, would be sufficient. Private inspectors had determined that the opinions of experts funded by the industry they opined upon could judge that untested combustible materials were safe under government regulations. Austerity was then piled atop this rackety system. According to the Fire Brigades Union, “fire brigade safety officers are struggling to carry out audits” under Blair’s RRO system “because of cuts to their headcount.” By 2016, the number of fire safety officers stood at less than half of the 1,500 employed in 2006. According to Home Office data, 63,021 fire safety audits were completed in England in 2015–16, 18 percent down on the 2009–10 figure, and representing just over 4 percent of the 1.5 million buildings identified by fire authorities as subject to the RRO. Nevertheless, 30 percent of those buildings that were audited were deemed unsatisfactory, indicating that as many as 450,000 across England as a whole may not have been compliant with fire safety regulations. On top of this, “half the fire cover within four miles of Grenfell Tower has gone in the past four or five years,” according to the general secretary of the Fire Brigades Union, Matt Wrack — fewer engines, fewer crews within easy distance. Against the background of this incremental collapse of the inspection and regulation regime under successive governments pressurized by private profit, the renovation of Grenfell Tower was undertaken. Combustible decorative panels were fitted to the building’s exterior. It has yet to be definitively determined, as of early 2019, whether or not the cladding conformed to UK regulations. It is believed that the panels may have contained a flammable foam equivalent to 30,000 liters of petrol. Sprinklers were not retrofitted. As the work was being finished, the BRE was paid by the government to tell them if tower blocks were safe. In April 2016 it found that “there is currently no evidence … to suggest that the current recommendations … are failing in their purpose.” So building safety control was deregulated, privatized, and marketized all the way to June 14, 2017, resulting in the cutting short of seventy-two lives.", "url": "https://www.jacobinmag.com/2019/10/british-left-rise-fall-grenfell-corbyn"}