{"authors": ["Garrison Lovely", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Jack Norton", "Jarrod Shanahan", "Roger Lancaster", "Heather Ann Thompson", "Toussaint Losier"], "date_download": "2020-05-04 19:52:17", "date_modify": "2020-05-04 19:52:17", "date_publish": "2019-02-07 00:00:00", "description": null, "filename": "2019_02_mdc-prison-brooklyn-freezing-mobilization-mass-incarceration_1588621937.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/02/07151806/mdc-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_02_mdc-prison-brooklyn-freezing-mobilization-mass-incarceration_1588621937.html", "title": "“They’re Human Beings in There!”", "title_page": "“They’re Human Beings in There!”", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Last Friday, a video shot on the street below the Metropolitan Detention Center (MDC) in Brooklyn, New York captured the sound of hundreds of detainees banging on the windows. Later that day, the New York Times reported that the more than 1,600 people incarcerated inside were being held in freezing cold temperatures and dark cells. The jail, the Times reported, “has had limited power and heat for at least this week.” “They just stay huddled up in the bed,” a case manager at the jail said of the detainees, the vast majority of whom are awaiting trial and thus still considered innocent.\nBoth the article and the video quickly shot around social media. Over the next two days, hundreds of protesters flooded the parking lots surrounding the building. Responding to calls for action on social media, I joined the demonstrations on Sunday afternoon. Only an hour before I arrived, protesters had attempted to enter the building, only to be driven back by pepper spray.\nThe protest was free form, following the lead of various voices. We heard mothers implore the crowd and the officers outside to recognize the humanity of those incarcerated. We heard singers lead protest songs and marching bands blast classics loud enough for the detainees inside to pick them up. We heard elected officials relay reports of the conditions in the MDC, technical updates on the progress of the repairs, and explanations as to how this had happened in the first place. With no gavel to keep order, the officials were occasionally drowned out by family members with megaphones.\nAt one point, I walked down a neglected alleyway holding my pizza-box sign and began hearing the men inside pounding on their windows. The presence of one person looking and listening was enough to set off a chorus.\nTo bystanders, their cause was instantly sympathetic. The building next to the jail was an Amazon shipping facility whose ramp was occasionally swarmed by protesters. After one of the workers found out why we were there, he responded, “That’s fucked up! They’re human beings in there!” He had a shift to finish, but still joined in the chants.\nThat night, after a week of minimal emergency power, the electricity returned, and the following morning, family visits resumed after being suspended for at least a week. (They were interrupted by an alleged bomb threat, which officials used to justify moving protesters and press away from the building’s entrance.)\nAt the time, the details of the conditions inside were still murky. In the days since, a grim picture has emerged.\nAccording to David Patton, the executive director of the Federal Defenders of New York, temperatures in cells ranged from 50 to 69 degrees. A person inside put that number significantly lower, telling a federal defender that a corrections officer read the temperature in a housing unit at 34 degrees. (Detainees’ standard-issue uniform is similar to hospital scrubs, short-sleeved and not very warm.)\nPatton reported leaks and no lights in the cells, cold meals, and cold water, directly disputing claims by the Federal Bureau of Prisons (BOP) that everyone inside was receiving hot meals and had lights on in their cells. The BOP also said that medical care was not interrupted — a claim that Congressman Jerry Nadler directly disputed following his tour of the facility.\nOn Tuesday, the BOP doubled down on its claims, contradicting testimony by numerous witnesses during an evidentiary hearing before a US District Judge. A transcript of a judge’s visit to the jail the same day detailed further horrors: one person locked in a flooded solitary confinement cell had to prevent his cellmate from hanging himself, after being repeatedly ignored by the guards outside. At least nine incarcerated individuals did not have access to necessary medical equipment, and another man lived with an untreated gunshot wound for two weeks.\nAs of Monday, at least six federal judges are investigating the crisis at MDC. One ordered the facility to resume daily attorney visits (which federal defendants are constitutionally entitled to). Also on Monday, federal defenders filed a lawsuit against the BOP and Warden Herman Quay, alleging inhumane treatment, misleading statements, inadequate response, and violation of the incarcerated individuals’ constitutional right to legal representation. The suit details how the people inside were unable to fill medical prescriptions or receive medical treatment. They also had not received clean clothing or bedding since January 27, forcing one person to “sleep on bedding that was made bloody due to his ulcerative colitis.” It now appears that blankets and heaters provided by New York City were not distributed to the people inside MDC.\nNormally incarcerated people can purchase warm clothing at the commissary, but this was one of the many services unavailable because the facility was on lockdown. Elected officials who toured the facility reported that the BOP had no emergency plan and demonstrated a complete lack of urgency in responding to the crisis. Additionally, those awaiting trial were not able to prepare, extending their stays in MDC.\nThe actions of the BOP reveal more than just a dereliction of duty. They reveal a callous, unconscionable disregard for the humanity of the people in their custody.\nAt the same time, the BOP’s willingness to lie about the reality of life within its walls should come as no surprise. What’s striking is that their lies are being openly challenged. Normally, the power imbalance between the carceral state and the people it cages allows such claims to go unchecked. Who are you going to believe? Press releases printed below official seals, or the frantic cries of alleged criminals mediated through their families and lawyers? In the case of MDC, a specific confluence of circumstances made it easier for people on the outside to become aware of this issue — and pressure officials to do something about it.\nWhile it’s impossible to know what role the protests played in resolving the immediate issues inside the facilities, the turnout on the street garnered significant media coverage and support from elected officials. Members of Congress, members of the New York State Assembly, members of the City Council, the New York attorney general, the Brooklyn Borough president — all were among those I saw on the streets on Sunday. Mass mobilization made these officials see support as politically advantageous.\nAt the protest Sunday, many of the people I spoke to had family members inside, but others were ordinary New Yorkers like me who heard about the protests on Twitter or Instagram. A jogger passing by decided to join us in a march. This kind of mobilization and resistance serves as a necessary foil to the excesses of state power. A lot more of it will be needed in the years to come.\nIt’s disturbing to think how things might have played out had a similar electrical and heat failure happened in one of New York State’s many other correctional facilities. The jails and prisons on Rikers Island are only accessible via a two-lane bridge strictly controlled by the NY Department of Corrections.\nMost of the state’s other prisons are far from the homes of the people they cage. Auburn Correctional Facility, a maximum-security prison where I taught during college, is over an hour from Syracuse and six hours from New York City by public transit. In 2016, 54 percent of the New York State prison population was from NYC and its suburbs, but not one of the state’s fifty-three facilities is within an hour of the city by car.\nWhile news of a comparable situation in more isolated facilities would eventually leak out through family members or attorneys, the videos and mass mobilization that helped bring attention by officials and the media would not have been possible.\nAs conditions return to normal in MDC, it would be easy to declare victory. The lawsuit brought by the Federal Defenders is likely to be costly, and the spotlight from media and elected officials may lead to a modicum of accountability for those responsible for this disaster. It appears that judges looking into the case no longer trust the BOP or the US attorneys representing them. But for most of the men and women inside, a return to normal means continued incarceration in the cruelest and least just criminal justice system in the developed world. And for the hundreds of thousands more caged far from home, there is no one to hear their pounding.", "url": "https://www.jacobinmag.com/2019/02/mdc-prison-brooklyn-freezing-mobilization-mass-incarceration"}