{"authors": ["Kaila Contreras"], "date_download": "2020-05-04 20:19:56", "date_modify": "2020-05-04 20:19:56", "date_publish": "2019-03-19 15:00:00", "description": "From flooding to wildfires, Kingwood-based Arbor True is used across the country for their expertise in growing and revitalizing trees. Arbor True, a company with over 20 years of...", "filename": "_4bf2c0d1d88e47fd9a7ec2cef3c34919_1588623596.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4bf2c0d1d88e47fd9a7ec2cef3c34919_1588623596.html", "title": "Kingwood tree service restores ecosystems nationally, locally", "title_page": "Kingwood tree service restores ecosystems nationally, locally", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "From flooding to wildfires, Kingwood-based Arbor True is used across the country for their expertise in growing and revitalizing trees.\nArbor True, a company with over 20 years of experience, is working to help reduce the risk of wildfires in California, restore Houston’s ecosystem after Harvey and has a partnership with the Houston Zoo to provide food to its herbivores, co-owners Brad Phillips and Brandon Murphy said.\nRestoration efforts in California\nKnown as California’s most severe wildfires, more than 84,000 acres of land were destroyed back in November 2018.\nArbor True was one the many arbor services that traveled to California to see what can be done to help reduce the risk of future wildfires.\nPhillips said Arbor True’s biggest goal at the moment is to get better control of the fire.\n“California is not necessarily in a place of ecosystem restoration right now. It’s this absolute chaotic attempt to reduce the risk, and it’s very, very far behind,” Phillips said.\nPhillips said the next steps would include reducing the fuel content in areas where people live, removing burned trees, recycling logs and recycling the chippings to use as biofuel.\nPhillips said straw and wood chips are being placed on the ground to recreate the soil structure that is burned out to re-initiate the ecosystem.\n“I think that anybody who shows up to a scene where as far as you can see is burned down homes, burned down trees, destroyed lives and the smell of the ashes, is an overwhelming experience that brings emotion to even the hardest hearts,” Phillips said.\nMurphy, who is still in California working to reduce fire risks, said they are currently taking down the burned trees that could possibly threaten homes, properties and utilities.\n“We’re in the mitigation process,” Murphy said. “As arborists, we’re not just running along cutting every tree within a certain amount of feet. We’re basically making judgement calls based on the appearance of the trees and whether or not we can determine that they will pull through basically after the amount of damage they have incurred. … In this case we’re following a very strict protocol because California values their trees, and so we’re going through and assessing the damage on these trees and determining whether or not they can be trimmed or if it’s necessary for a removal.”\nImproving the ecosystem after Harvey\nAfter Hurricane Harvey hit Houston in 2017, it caused a lot damage to not only homes and properties but to the local flora as well.\nPhillips said restoring the trees and other plants in the Houston area is still an ongoing process.\n“Our role in that recovery has been generally meeting with individual property owners, homeowner associations, municipalities (and) water districts,” Phillips said. “We’ve met with many different kinds of clients who want their properties inspected and tested to see what kinds of problems they’re having.”\nSamples have been taken from the soil, leaves, plants and trees to analyze them for diseases and to recommend a solution not only treat symptoms but to restore ecosystems.\n“(Hurricane Harvey) affected (trees) in ways that we do know and ways that we do not know,” Phillips said. “We have never had that much rain anywhere in the United States in reported history… We don’t know what that means. What we do know is that we’ve lost a lot of organic matter in the soil and that the soil is more compact. Trees and plants will struggle with root rots and other soil-born diseases as a result of that.”\nFeeding the elephants\nPhillips said the company’s partnership with the Houston Zoo started in 2017.\nPhillips said he was giving a presentation on organic tree care at Hermann Park, and in the audience were some people from the Houston Zoo that select properties to harvest from to enrich the diets of the zoo animals.\nSince then, people from the Houston Zoo harvest young trees from one of Arbor True’s properties to feed the animals. Some trees the animals eat from Arbor True properties are sweet gum trees, elm trees, grapevines and sycamore trees. All the trees are grown organically.\n“We do controlled burnings to make the forest healthier and more vibrant and to eliminate invasive species,” Phillips said. “Then we do biological augmentation or biological fertilization of the trees to enhance the growth rates so that they can be harvested in a sustainable way.”\nkaila.contreras@chron.com", "url": "https://apnews.com/4bf2c0d1d88e47fd9a7ec2cef3c34919"}