{"authors": ["Roy Kent"], "date_download": "2020-05-04 20:15:06", "date_modify": "2020-05-04 20:15:06", "date_publish": "2019-01-25 06:00:00", "description": "Established in 2015, the Women’s Health Advisory Committee had a relatively short existence. The committee held its last meeting Aug. 12, 2017. The Women’s Health Advisory Committee advised...", "filename": "_cb73ae51af7f4f58aedf5eeae57a8fa5_1588623306.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cb73ae51af7f4f58aedf5eeae57a8fa5_1588623306.html", "title": "Rep. Calanni: Don’t mess with Texas women’s healthcare", "title_page": "Rep. Calanni: Don’t mess with Texas women’s healthcare", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Established in 2015, the Women’s Health Advisory Committee had a relatively short existence. The committee held its last meeting Aug. 12, 2017.\nThe Women’s Health Advisory Committee advised the Texas Health and Human Services Department on the consolidation of women’s health programs across the state.\nThe committee may be resurrected if legislation submitted by Texas State Rep. Gina Calanni (D-District 132) becomes law. Calanni is advocating the bill as a boost to women’s health in the state.\nCalanni filed House Bill 992 to re-establish the Women’s Health Advisory Committee. Similar legislation passed both the Senate and House last session.\n“I’m bringing back this bipartisan bill because time’s up, and we’re here to say ‘don’t mess with Texas women.’ We have seen appalling maternal mortality rates, shockingly high numbers of uninsured Texans, and a disregard for our healthcare access,” Calanni said in a news release. “The committee acts to serve in the best interest of women and their access to healthcare. It is clear that women s voices were not taken into account and that the committee s recommendations were mostly ignored; look no further than the contractor debacle with the Healthy Texas Women program.”\nAccording to the news release, the Women’s Health Advisory Committee was created in 2015 in “response to the consolidation of the state’s various women’s health programs after the state banned Planned Parenthood from participating in the Medicaid Women’s Health program. The Medicaid Women’s Health Program was largely funded by a $9 to $1 match from the federal government.”\nAfter banning Planned Parenthood, the state created the Healthy Texas Women program which, Calanni said, “continuously fails to meet its goals for the number of women served.”\nCalanni added, “Texas women deserve better. Rural communities have seen their limited access to healthcare dwindle even more with the closure of life-saving women s health clinics. As a mom serving in the Legislature, I know that we owe it to all Texas women to ensure their healthcare needs are heard and taken seriously.”\nFor more information on the Health Texas Women program, go to www.healthytexaswomen.org.\nCalanni represents Texas House District 132 and serves on the Juvenile Justice & Family Issues Committee and the Homeland Security & Public Safety Committee.\nrkent@hcnonline.com", "url": "https://apnews.com/cb73ae51af7f4f58aedf5eeae57a8fa5"}