{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:22:20", "date_modify": "2020-05-04 20:22:20", "date_publish": "2019-02-25 16:34:28", "description": "GREENWICH — There are two ways to help Boy Scouts in Greenwich fight hunger in town: by making food donations in person and by giving monetary donations online. The Greenwich Council of the...", "filename": "_141fd78d214446ca99d2aabffcffe316_1588623740.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_141fd78d214446ca99d2aabffcffe316_1588623740.html", "title": "Greenwich Boy Scouts launch to ways to give for food drive", "title_page": "Greenwich Boy Scouts launch to ways to give for food drive", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GREENWICH — There are two ways to help Boy Scouts in Greenwich fight hunger in town: by making food donations in person and by giving monetary donations online.\nThe Greenwich Council of the Boy Scouts of America will be set up in four locations to accept donations for its annual food drive, “Scouting for Food,” on Saturday, March 2. That food drive benefits Neighbor to Neighbor, a local food pantry.\nFrom 9 to 11:30 a.m. Saturday, food donations can be brought to one of the four drop-off locations:\n* Christ Church, 254 E. Putnam Ave.\n* Glenville Volunteer Fire Company, 266 Glenville Road\n* Cos Cob Volunteer Fire Company, 200 E. Putnam Ave.\n* Sound Beach Volunteer Fire Department, 207 Sound Beach Ave., Old Greenwich.\nGreenwich residents are encouraged to drop-off nonexpired items, such as canned beans (not green), canned fruit, tuna, boxed milk, pasta sauce, pasta, jelly, peanut butter and more. All donated food will be sorted and then delivered by the scouts to Neighbor to Neighbor.\n“We’re excited to partner with the Greenwich Scouts to raise money to bridge the gap between hunger and health,” said Nancy Coughlin, Neighbor to Neighbor’s executive director.\n“Online donations give us the ability to purchase fresh fruits and vegetables, which supplement traditional food drives. This approach helps to ensure that we meet the health needs of our clients.”\nTo make an online donations, visit https://ampyourgood.com/user/campaigns/3247.\nA visitor to the website can make a choice of how to donate — by choosing to give, for example, a 10-pound bag of oranges for $14.50 or a 5-pound bag of apples for $8.50. The donation of fresh fruits and/or vegetables will then be delivered to the pantry.\nState Rep. Fred Camillo (R-151) is serving as honorary chairman of the food drive for the sixth year.\n“The Scouts have been running this event for decades, and it is an example of their commitment to our community and the ideals of the Boy Scouts of America,” Camillo said.\nGreenwich Scouting partners with Neighbor to Neighbor, located at Christ Church in Greenwich, to help fill the increasing need for food for families in the area, especially during non-holiday times. Neighbor to Neighbor provides nutritious meals monthly for over 660 local families through its “Client Choice” food pantry, where clients have the opportunity to do their own shopping. Approximately 47 percent of the food provided by Neighbor to Neighbor feeds children at or below the poverty level.\n“Neighbor to Neighbor is dedicated to assisting local residents in need of food, clothing and other essentials,” said Camillo. “Please stop by and see us at any of the four drop-off locations on the second of March to witness and participate in a great civic event.”\nTo learn more about the Greenwich “Scouting for Food” drive, visit www.GreenwichScouting.org.", "url": "https://apnews.com/141fd78d214446ca99d2aabffcffe316"}