{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Solomon Hughes", "Doug Henwood", "Benjamin Y. Fong", "Christie Offenbacher", "Jacky Davis"], "date_download": "2020-05-04 19:56:47", "date_modify": "2020-05-04 19:56:47", "date_publish": "2019-12-03 00:00:00", "description": null, "filename": "2019_12_medicare-for-all-m4a-nhs-national-health-service-boris-johnson_1588622207.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/12/03091757/GettyImages-1163804229.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_12_medicare-for-all-m4a-nhs-national-health-service-boris-johnson_1588622207.html", "title": "The Transatlantic Health-Care Struggle", "title_page": "The Transatlantic Health-Care Struggle", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIn the United States, the demand for Medicare for All is growing. It feels like ancient history, but only three years ago the Democratic Party’s presidential front-runner promised that a single-payer health insurance system will “never, ever come to pass.” Now, thanks in large part to the tireless insistence of two-time democratic socialist presidential candidate Bernie Sanders, most of the major contenders for the party’s presidential nomination are forced at the very least to rhetorically concede that Medicare for All is the goal — though all but Sanders are finding ways to kick the can down the road. In Britain, meanwhile, the National Health Service (NHS) is widely regarded as the country’s finest political achievement, its jewel in the crown. A former Conservative Party chancellor once called it “the closest thing the English have to a religion,” while Conservative prime minister David Cameron once had to issue a groveling repudiation of one of his party’s MEPs, Daniel Hannan, after Hannan criticized it on Fox News while visiting the United States during the Obamacare debate. The NHS is a universal public health-care service that guarantees that every person can receive the medical care they need, free at the point of service. But for decades, it has been subject to brutal austerity, deliberately harming its effectiveness so as to leave it vulnerable to criticism that can be used to justify creeping privatization. Now there is mounting fear that the privatizers will use Brexit to open up the British health-care system to for-profit American health-care companies. Aneira Thomas was the first baby ever born under the NHS, named after its chief architect, the Labour stalwart Aneurin Bevan. Thomas, who went on to become a nurse in the NHS, worries that if the Tories win the upcoming election, Britain “will go back to the old days, before 1948, where it was only the privileged few who could afford health care.” In a recent video in support of the Labour Party, Thomas asks, “Can you imagine somebody being ill and having to check their bank account?” Yes, many Americans can imagine that: 87 million are uninsured or underinsured. On the surface, these might appear to be disparate struggles. The Left in Britain is seeking to defend its public health-care system, while the Left in the United States is merely trying to establish a right to universal public health insurance, only a fraction of what the NHS has accomplished. But at base, they are constituent elements of the same fight. They both represent efforts to establish health care as a social right, not a commodity. Both British defenders of the NHS and American proponents of Medicare for All are operating from the basic principle that a health-care system should exist to heal the sick and care for the many, not line the pockets of a few.\nThe NHS for Sale Britain’s Tory prime minister, Boris Johnson, swears up and down that he’s not interested in selling off the NHS to for-profit health-care companies based in the United States. “Under no circumstances will this government or any Conservative government do anything to put the NHS up for negotiation in trade talks, or privatizing, anything like that,” Johnson said last week. His comments came amid a heated election contest, after his opponents in the Labour Party accused Johnson of seeking to do just that: broker a post-Brexit deal with the United States that renders parts of the British health-care system up for grabs. Unfortunately for Johnson, Labour Party leader Jeremy Corbyn got his hands on some unredacted documents detailing six rounds of talks between London and Washington trade representatives over the last few months. The documents “leave Boris Johnson’s denials in absolute tatters,” Corbyn said. “We have now got evidence that under Boris Johnson the NHS is on the table and will be up for sale. He tried to cover it up in a secret agenda and today it has been exposed.” Al Jazeera reports that the papers “do clearly indicate a range of public services have been discussed by trade representatives.” According to the Guardian , the documents show that US and UK trade representatives discussed “the NHS, drug patents, the pharmaceutical industry, health insurance and medical devices as part of the post-Brexit trade deal.” Corbyn accused the Johnson administration of issuing “a green light for breaking open Britain’s public services so corporations can profit” from them. In a separate document, the US government lists one of its primary negotiating objectives as ensuring that the UK’s “state-owned enterprises” should “accord non-discriminatory treatment with respect to the purchase and sale of goods and services,” calling for “full market access for US products,” including pharmaceuticals. Donald Trump himself has made it clear that he wants the NHS “on the table.” Johnson denies that he and Trump see eye to eye. But this is a politician who has previously claimed that other countries have better health care because “they do not rely exclusively on a top-down, monopolistic health care service of a kind we have in this country. The Chancellor has decided there is only one model for health care in this country. It’s the NHS model, and he’s decided that it’s unimprovable, except for the addition of more taxpayers’ money.” In light of these comments — and the fact that Johnson has staffed his cabinet with several people who openly advocate entrusting public hospitals to private corporations — the notion that Johnson would like to use Brexit to privatize the NHS is far from unthinkable.", "url": "https://www.jacobinmag.com/2019/12/medicare-for-all-m4a-nhs-national-health-service-boris-johnson"}