{"authors": ["Dennis Punzel", "Wisconsin State Journal"], "date_download": "2020-05-04 20:04:31", "date_modify": "2020-05-04 20:04:31", "date_publish": "2019-02-04 10:15:00", "description": "In nature, badgers are renowned for their ability to dig holes. It’s a trait that has carried over to their University of Wisconsin women’s basketball namesakes. For the second...", "filename": "_a672627dd03a42c8b9b91e18e640c9f2_1588622671.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a672627dd03a42c8b9b91e18e640c9f2_1588622671.html", "title": "Michigan survives 30 points from Marsha Howard to beat Badgers women's basketball team", "title_page": "Michigan survives 30 points from Marsha Howard to beat Badgers women's basketball team", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In nature, badgers are renowned for their ability to dig holes.\nIt’s a trait that has carried over to their University of Wisconsin women’s basketball namesakes.\nFor the second consecutive Sunday, the basketball Badgers found themselves in a deep hole against Michigan.\nBut unlike a week ago when they overcame a 10-point deficit in the final four minutes to beat Nebraska, the Badgers’ late comeback effort came up short, 76-70, before an announced crowd of 6,670, the largest of the season at the Kohl Center.\nSenior Marsha Howard led the fourth quarter rally with 14 of her career-high 30 points coming in the period. But as exciting as the effort to overcome a 16-point deficit was, it was negated by the need to make up that amount in less than eight minutes.\n“First and foremost, we can’t continue to dig ourselves in those holes and have to crawl out of them,” Howard said. “It’s just the fight that we have that we’re going to continue to fight until the clock says zero regardless of the score.”\nThe Badgers (11-12, 2-9 Big Ten) knew they faced some huge obstacles in the Wolverines (14-9, 5-6). Foremost among them was 6-foot-5 senior center Hallie Thome, who recorded her career high of 37 points against the Badgers two years ago. That game left a lasting impression on UW coach Jonathan Tsipis.\n“I always remember my first Big Ten game as a head coach, she about set a Kohl Center record,” Tsipis said.\nThat record of 41 points by Purdue’s Katie Gearlds was not endangered Sunday as the Badgers held Thome to 12 points as she got into foul trouble and played less than 24 minutes.\n“Thome got some early ones,” Tsipis said. “I thought we did a good job after about halfway through the first quarter on her.”\nBut the UW defense came up short just about everywhere else, as the Wolverines shot 53.6 percent for the game, the highest mark for any opponent this season and just the second team to top 50 percent. It was even worse in the second half when Michigan shot 64 percent (16-for-25).\n“It just comes down to the defensive end and their ability to score in the paint,” said Tsipis, noting that the Wolverines got 46 of their 76 points in the paint. “I know we’re a better defensive team than that and our kids take a lot of pride (in that).”\nHoward, who gave up more than six inches to Thome, had the task of defending her much of the game and was determined to not let her have another big game.\n“Defensively, it’s always a challenge for us in the post to guard people who are inches taller than us and may weigh more than us,” Howard said. “It’s just taking pride in it and wanting to get it done.”\nWith Thome held largely in check, the Wolverines were led by freshman Naz Hillmon with 20 points. Senior Nicole Munger added 10, including a crucial 3-pointer with 1:37 left in the game after the Badgers had closed the gap to just six points at 69-63.\nFreshman Imani Lewis scored 15 points for the Badgers, with 12 of them coming in the third quarter when they put up 23 points, one more than in the entire first half. Unfortunately, they were outscored 26-23 in the period.\nThat was the overriding lesson for Lewis.\n“I would say I have to play better defense because I scored 15 points but in my head I scored zero because of how many points I gave up,” Lewis said. “To me, it’s changing my mindset and becoming a better defender.”\nWhile Michigan outscored UW 46-36 in the paint, those numbers were a little misleading because Howard and Lewis got 16 of their combined 45 points at the free throw line in 23 attempts.\nHoward, who scored 22 of her points in the second half, credited assistant coach Myia Johnson for keeping her aggressive offensively.\n“Every timeout Coach Myia would pull me aside and say attack them,” Howard said. “That’s just what I did. I tried my best to get on the offensive boards and kept on going strong to the basket.”\nMICHIGAN\nmin fg-a ft-a rb pf a to pts\nBrown 22 4-9 1-3 1 3 2 0 10\nThome 23 6-12 0-0 5 4 1 1 12\nDilk 36 2-6 3-4 2 2 8 3 7\nMunger 34 3-6 1-2 2 0 0 0 10\nChurch 16 3-5 0-0 4 4 0 0 7\nJohnson 25 1-5 1-1 4 1 4 1 3\nHillmon 21 8-9 4-6 8 5 0 4 20\nRobbins 15 3-4 0-0 4 2 0 1 6\nYoung 1 0-0 1-2 0 1 0 0 1\nSmeenge 1 0-0 0-0 0 0 0 0 0\nRauch 1 0-0 0-0 0 0 0 1 0\nRooks 1 0-0 0-0 0 0 0 0 0\nKiser 1 0-0 0-0 0 0 0 1 0\nTotals 30-56 11-18 33 22 15 14 76\nWISCONSIN\nmin fg-a ft-a rb pf a to pts\nKarlis 35 2-8 1-2 6 4 2 0 5\nHoward 34 9-17 11-15 9 2 1 4 30\nLewis 25 5-12 5-8 7 4 0 0 15\nVan Lee. 23 2-4 0-1 3 5 2 2 4\nBeverley 35 2-7 0-0 1 2 3 3 5\nLaszwski 19 2-6 2-2 4 2 0 0 6\nHale 3 0-0 0-0 1 1 0 0 0\nGilreath 11 1-2 0-0 2 0 1 1 3\nLuehring 11 1-3 0-0 1 1 1 2 2\nBragg 1 0-0 0-0 0 0 0 0 0\nCrowley 1 0-0 0-0 0 0 0 0 0\nMathiason 1 0-0 0-0 0 0 0 0 0\nTotals 24-59 19-28 39 21 10 12 70\nTeam totals include rebounds and turnovers\nMichigan 17 15 26 18 — 76\nWisconsin 14 8 23 25 — 70\n3-pointers — M 5-12 (Munger 3-5, Church 1-1, Brown 1-3, Thome 0-1, Johnson 0-2), W 3-11 (Howard 1-1, Gilreath 1-2, Beverley 1-4, Luehring 0-1, Karlis 0-3). Blocks — M 6 (Thome 2, Robbins 2, Brown 1, Hillmon 1), W 4 (Howard 1, Lewis 1, Laszewski 1, Luehring 1). Steals — M 6 (Thome 2, Dilk 2, Munger 1, Johnson 1), W 7 (Lewis 3, Howard 2, Van Leeuwen 1, Laszewski 1). Field goal percentage — M .536, W .407. Free throw percentage — M .611, W .679. Att. — 6,670.", "url": "https://apnews.com/a672627dd03a42c8b9b91e18e640c9f2"}