{"authors": ["Ruben Navarrette", "Syndicated Columnist"], "date_download": "2020-05-04 20:11:57", "date_modify": "2020-05-04 20:11:57", "date_publish": "2019-02-08 06:02:22", "description": "SAN DIEGO ? Howard Schultz is right about his critics. They have had too much caffeine. And it's made them snarky, mean and close-minded. And what Schultz's critics could really use are a...", "filename": "_571f772a674b46b3b7c9ab950def28b3_1588623117.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_571f772a674b46b3b7c9ab950def28b3_1588623117.html", "title": "Schultz is the pick-me-up gridlocked politics needs", "title_page": "Schultz is the pick-me-up gridlocked politics needs", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SAN DIEGO ? Howard Schultz is right about his critics. They have had too much caffeine. And it’s made them snarky, mean and close-minded.\nAnd what Schultz’s critics could really use are a few shots of consistency, historical perspective and a willingness to hold the right people accountable when the wrong people get elected.\nThe media, Democratic Party operatives and others on the left are steamed at the billionaire coffee mogul ? and lifelong Democrat ? for believing that politics is too important to be left to the professional politicians. The criticism started a few weeks ago from the moment that Schultz, the founder of Starbucks, went on CBS’ “60 Minutes” and uttered the following words:\n“I am seriously thinking of running for president. I will run as a centrist independent, outside the two-party system.”\nThose words were music to my ears. Not because I like Schultz. I don’t know enough about him to know how I feel about him one way or another.\nI heard the music because, like many Americans, I’ve been burned too many times by both the right and the left. I’ve grown to detest the political parties. For that, I make no apologies. In fact, it’s the parties that owe an apology to me ? and millions of other Americans like me.\nAs Schultz likes to point out, according to polls, more than 40 percent of American voters are either registered Independents or they identify themselves as Independents.\nTo the political class ? which is defined by people who benefit more from gridlock than progress ? terms like “centrist independent” and “outside the two-party system” are fighting words. And that’s especially true when those words come from an ultra-wealthy person who could spend $200 million of his own money to upset the apple cart and throw both parties off their scripts.\nDuring an interview when Schultz spilled his guts ? about, among other things, the physical abuse he suffered growing up at the hands of his father ? a tone-deaf Scott Pelley said: “Many people are going to ask, ‘what does the coffee entrepreneur know about being commander in chief?’”\nGee, Scott. Maybe those people need to come to grips with the startling fact that most people don’t know anything about being commander-in-chief ? not governors of Arkansas or Texas, not first-term senators from Illinois, and certainly not real estate magnates. It’s a role that calls for on-the-job training.\nBut, by all means, let’s brush all that aside and hold Schultz to a different and impossibly high standard.\nThe global CEO with the self-made success story responded to that gotcha question with a pretty good answer.\n“I have a long history of recognizing (that) I’m not the smartest person in the room, that in order to make great decisions about complex problems, I have to recruit and attract people who are smarter than me and more experienced, more skilled,” he said.\nIn truth, the beef that those on the left have with Schultz is not about his lack of experience or familiar rhetoric about a rich guy wanting to buy some high elective office. It has to do with math. The concern is that Schultz will ? as Pelley put it ? “siphon off” just enough votes from whoever becomes the Democratic nominee that he’ll wind up throwing the election to Donald Trump.\nCan you imagine if that happened? We’d go from hearing about how the Russians elected Trump the first time to how Schultz got him re-elected.\nNotice who’s missing from both explanations. That’s right. The Democratic nominee for president.\nIn most of the obituaries that came out after the 2016 election ? including the one that she wrote herself ? Hillary Clinton got a pass. Here Democrats had managed to find the one person in America who could actually lose to Donald Trump, no small accomplishment. Clinton did everything wrong, ran a terrible campaign, came across as untrustworthy and dishonest and even ignored the expert advice of her husband ? who had won two presidential elections. And yet, according to some, she played no role in her defeat.\nNow Democrats are gearing up to do it again. With seven Democratic politicians already having declared that they’re running for president, and more expected to enter the race in the weeks to come, the party is already boasting about how it has an embarrassment of riches.\nMaybe so. But the way the folks on the left are attacking Schultz is just a plain old embarrassment.\nE-mail ruben@rubennavarrette.com. “Navarrette Nation” is available through every podcast app. (c) 2019, The Washington Post Writers Group.", "url": "https://apnews.com/571f772a674b46b3b7c9ab950def28b3"}