{"authors": ["Camila Vergara", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Isidora Cepeda Beccar", "Andrew Richner", "Abigail Gutmann-Gonzalez", "René Rojas", "Pablo Abufom"], "date_download": "2020-05-04 19:49:28", "date_modify": "2020-05-04 19:49:28", "date_publish": "2019-10-29 00:00:00", "description": null, "filename": "2019_10_chile-protests-sebastian-pinera-constitution-neoliberalism_1588621768.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/10/29162046/GettyImages-1178671336.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_10_chile-protests-sebastian-pinera-constitution-neoliberalism_1588621768.html", "title": "The Meaning of Chile’s Explosion", "title_page": "The Meaning of Chile’s Explosion", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Chile, Latin America’s “oasis” of stability, has been in flames for a week, fueled by an underlying current of socioeconomic oppression. The rapacity of the “Latin American tiger” that accomplished the neoliberal “miracle” of high economic growth from the ashes of socialism, has been revealed in street clashes in which protestors threatening the neoliberal order have become enemies of the state — stripped of their rights in a de facto, and therefore illegal, state of siege. The aggressive, zero-tolerance response of the police to peaceful civil disobedience, and the government’s resort to the use of the military to quell political dissent, is partly the result of three decades of denial vis-à-vis Chile’s growing oligarchization of power. The oppressive conditions facing the working class and the precarious position of an indebted middle class in a system in which all basic necessities have been privatized to make a profit, have been ignored, justified, and normalized during the last three decades of democratic governance in which left- and right-wing governments have alternated power. Chile is neoliberalism’s ground zero, a testing ground for neoliberal economic policies as well as neoliberal forms of legality. The Constitution of 1980, which has been amended almost forty times and is still in place, was mostly designed by Jaime Guzmán, an ultraconservative jurist and member of the fundamentalist Catholic Opus Dei, with the intention of stabilizing and protecting the newly implemented neoliberal economic model — together with a patriarchal social framework — against popular pushback. Article 8 —repealed in 1989 just few months before the return to democracy — outlawed any doctrines based on “class struggle” or aimed at “attacking the family.” The brutal costs of the “neoliberal adjustment” came shortly after, and the population was forced to endure economic hardship and domination at gunpoint. During the seventeen years of dictatorship under Pinochet, poverty increased from 20 percent to 44 percent while GDP was distributed more unequally: the share of wages in national income fell from more than half to one-third, while the share of corporate profits rose from 31.4 percent to 42.4 percent. The neoliberal model of accumulation by dispossession created massive wealth on the backs of the working classes and through the savage plundering of public property as well as the Earth. The legal scaffolding of the neoliberal state allowed the oligarchy to disproportionately appropriate this socially created wealth while shielding political elites from popular pressures through procedural arrangements aimed at insulating public officials from electoral accountability. Chile’s particular institutional arrangement has made for a rapid oligarchization of the economy in which oligopolies have given rise to collusion scandals, from the toilet paper industry to pharmacies, and a political system in which elected representatives receive the highest compensation packages in Latin America while consistently endorsing laws and policies favoring the wealthy and further entrenching monopolies, or neglecting to adopt measures to counteract oligarchic outcomes, passively letting the wealthy keep enriching themselves. The merciless extraction of wealth from humans and nature, at high speed and insulated from popular pressure, has nurtured a new crop of the superrich who own most of the national industries, media outlets, banks, supermarkets, pension investment funds, health insurances, electricity, land, precious metals, and water. Chile boasts ten billionaires in the Forbes list, with a combined wealth of about $40 billion, equal to roughly 16 percent of GDP, while middle- and low-income households spend 45 percent of their salaries to pay off debts just to make it to the next paycheck. It is in this context that the slight increase in transportation tariffs in Santiago sparked what has become a national popular uprising.\nBringing the Military Back in A successful massive fare evasion action led by students, who have been in the forefront of protests since 2011, turned into popular fury after images of police crackdowns were shared on social media. The people “woke up” in an outpouring of civil disobedience, mass mobilizations, and also targeted violence. Amid declarations that they had lost everything — even their fear — defiance quickly spread from students to workers, from the lower to the middle classes, and from Santiago to Valparaíso, Concepción, and beyond. As ordinary people took to the streets, the government led by right-wing billionaire Sebastián Piñera mobilized the military to defend the neoliberal order against those who dared to rise up to dismantle it. After the burning of subway stations and supermarkets, President Piñera stated that Chile was “at war against a powerful enemy,” declared a state of emergency, and summoned more than 9,000 soldiers to the streets to deal with this existential threat. Who is the enemy in this war? What is being defended? The sight of soldiers and heavy armored vehicles on the streets was profoundly shocking to people who thirty years ago were still living under Pinochet’s repressive regime. It was also not surprising, in the sense that calling on the military to “pacify” a popular insurrection against inequality and oppression is predictable behavior from a neoliberal state and its oligarchic ruling class. As the First Lady, Cecilia Morel, put it in a private audio message to a friend, the government was completely overwhelmed by what seemed like an “alien invasion” forcing her and her circle of “people of good will … to decrease our privileges and share with others.” Though civil disobedience began over the increase in transportation prices, protest quickly spilled over, tapping into a host of other grievances related to inequality and systemic corruption that had mobilized people to protest before but were never fully addressed. Indignation led to apparently organized destruction of subway stations, supermarkets, pharmacies, and electric companies, assaults that were framed by fake news organizations as foreign-led attacks. As the official narrative quickly turned protestors into “violentistas,” Minister of Interior Andrés Chadwick —cousin of President Piñera and collaborator of the Pinochet regime— threatened to subject them to anti-terrorist provisions for disrupting public services. According to the anti-terrorist law, an action is considered a form of terrorism if it is part of a plan that aims to “eliminate or inhibit resolutions from the authorities or to impose demands on them.” As a result, protestors would risk aggravated penalties of up to ten years in prison, political disenfranchisement, and even loss of citizenship (Art. 9, 16.2 & 17.3). The UN Human Rights Council has argued this law “does not offer the necessary guarantees for a fair trial” and has urged Chile in the past to refrain from using it to penalize “social protests by Mapuche peoples seeking to claim their rights.” This is the first time the government has threatened to use the anti-terrorist law not only against indigenous peoples seeking autonomy in southern Chile, but against anyone attacking the status quo to demand social rights. It’s also the first time since the end of the dictatorship that a state of emergency has been called to deal with a sociopolitical crisis instead of a natural catastrophe like earthquakes and tsunamis. Not only is the aim of the deployment different, but the prerogatives being exercised by the armed forces far exceed those granted to the President by the Constitution in a state of emergency. According to Jaime Bassa, a constitutional lawyer who offered expert testimony before the Senate’s Commission for Human Rights, Chile is currently under “de facto state violence” since there is no normative basis for the extraordinary authority exercised by the military. Under the Constitution a state of emergency permits the President only to “restrict” the freedom of movement and assembly. While curfews were enforced at gunpoint and collective dissent was criminalized during the dictatorship, today disrespecting a curfew, like jumping a turnstile, is not a crime but a misdemeanor punishable by a $40 fine (Penal Code art. 495). However, the armed forces have completely suspended the freedom to assemble, arrested protestors, and declared curfews —all measures that are not allowed under a state of emergency. The prerogatives given to the armed forces show that Chile was in a de facto state of siege, a state of exception triggered by internal war. In the past week, more than 3,000 people were detained and clashes with armed forces yielded about 800 injured, most of them shot. At least five of the nineteen reported dead so far are believed to have been murdered by state agents.\nA Social New Deal? After a massive peaceful mobilization of more than one million people in downtown Santiago on Friday, President Piñera addressed the nation and stated: “we all got the message, we all have changed.” Without addressing claims of illegal detentions, use of excessive force, sexual violence. or homicide charges against members of the armed forces during the past week, he lifted the state of exception starting Monday, and called on Chileans to start the week with “institutional and civic normalcy.” He also announced a new cabinet and a social agenda with a price tag of $1.2 billion to tackle popular demands. Congress will discuss a reform package to increase pensions and wages, “stabilize” prices for electricity, water, and urban highway tolls, reduce drug prices, establish an insurance scheme for “catastrophic illnesses,” reduce salaries for elected officials, and increase taxes on “those of higher income.” If it seems the President has finally listened to the popular cry and changed his agenda of protecting the status quo from social demands, the urgency with which he is attempting to tackle the popular demand for a “more just society” pales in comparison to his swift decision to call in the military to protect property, infrastructure, and the neoliberal model. Moreover, given the severity of the social crisis, it is clear that a few extra subsidies will not be enough to address it effectively. If we take seriously the role of emergency powers in the Constitution, which are aimed at empowering the president to effectively tackle situations of crisis, then the equivalent to “bringing in the military” would need to be deployed to resolve the crisis of the neoliberal model that has produced high inequality and the increasing oligarchization of power. Proposing a social agenda to be discussed in Congress does not amount to the use of emergency powers, but to politics as usual; a top-down agenda setting, without social inputs other than what government officials decoded from the popular message: immediate relief of material conditions. However, the need for immediate relief does not address the need for structural change. As a long-term, slow-moving process toward greater oligarchy, systemic corruption produces laws and procedures that benefit the wealthy. In the case of Chile, basic services were commodified, citizens became captive, precarious consumers, and laws have done nothing more than regulate exploitation. Though more public money to subsidize pensions and health care might bring immediate relief to those suffering economic hardship, it does not amount to a structural change in the foundations of the private pension and healthcare systems. It simply subsidizes demand without adding any meaningful control over private industries. Given the nature of the crisis, structural solutions need to go beyond relief packages in which private industries end up receiving public funds and no change is made to the legal and institutional landscape — a landscape that has allowed extraordinary wealth to be appropriated by the 1 percent.", "url": "https://jacobinmag.com/2019/10/chile-protests-sebastian-pinera-constitution-neoliberalism"}