{"authors": ["Bailey Vogt The Washington Times"], "date_download": "2020-05-04 20:10:38", "date_modify": "2020-05-04 20:10:38", "date_publish": "2019-03-01 10:51:16", "description": "President Trump said Friday that his former lawyer Michael Cohen has written a book called \"Love Letter to Trump\" and attempted to get it published. Mr. Trump's wrote in a series of Tweets...", "filename": "_ffa4b11b15ede92f9949b8a3e833aa5f_1588623038.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ffa4b11b15ede92f9949b8a3e833aa5f_1588623038.html", "title": "Donald Trump says Michael Cohen wrote 'love letter' to him in new book", "title_page": "Donald Trump says Michael Cohen wrote 'love letter' to him in new book", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Donald Trump says Michael Cohen wrote ‘love letter’ to him in new book\nPresident Trump said Friday that his former lawyer Michael Cohen has written a book called “Love Letter to Trump” and attempted to get it published.\nMr. Trump’s wrote in a series of Tweets that Cohen was “pushing” his book after the Charlottesville, Virginia, white supremacist rally and the Helsinki summit with Russian President Vladimir Putin, which Cohen testified before the House Oversight and Reform Committee were the events that caused him to turn on the president.\n“Wow, just revealed that Michael Cohen wrote a “love letter to Trump” manuscript for a new book that he was pushing,” Mr. Trump tweeted. “Written and submitted long after Charlottesville and Helsinki, his phony reasons for going rogue. Book is exact opposite of his fake testimony, which now is a lie!”\nHe also said Congress should subpoena the manuscript.\n“Congress must demand the transcript of Michael Cohen’s new book, given to publishers a short time ago,” he wrote. “Your heads will spin when you see the lies, misrepresentations and contradictions against his Thursday testimony. Like a different person! He is totally discredited!”\nIn his statement to the committee, Cohen said he is “ashamed” that he worked for Mr. Trump, saying he regrets “all the help and support I gave him along the way.”\nHe also outlined several potentially damaging claims, including that Trump confidant Roger Stone told the president that WikiLeaks would release hacked emails from 2016 Democratic presidential candidate Hillary Clinton and that Mr. Trump was aware of the Trump Tower meetings with Russian officials while he was campaigning.", "url": "https://apnews.com/ffa4b11b15ede92f9949b8a3e833aa5f"}