{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:07:28", "date_modify": "2020-05-04 20:07:28", "date_publish": "2019-01-16 07:03:00", "description": "Editor: We are always reminded that America is a nation of immigrants. True, even the so-called indigenous people came from somewhere else. Today it seems that the word is used all too...", "filename": "_f7986deecbd44c5d94eeed6a5f31bc00_1588622848.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f7986deecbd44c5d94eeed6a5f31bc00_1588622848.html", "title": "Jeff Reyburn: Common sense on immigration", "title_page": "Jeff Reyburn: Common sense on immigration", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Editor:\nWe are always reminded that America is a nation of immigrants. True, even the so-called indigenous people came from somewhere else. Today it seems that the word is used all too loosely to include both legal and illegal immigrants. This is wrong. Illegal immigration is a major problem that we face as a nation. We need secure borders and a policy that works. Illegal immigration is supported by big business and the Democratic Party. Big business wants cheap labor. Cheap immigrant labor keeps wages low and hurts the low wage workers in our country by not allowing them to work their way up and out of poverty. By depressing wages and bringing in more workers for those jobs we continue to maintain and build a dependent class. This, more and more, has become the Democrat’s constituency. An open border makes no sense when you consider the costs to our nation. Security, public health, safety and social services are at risk and over burdened. If we need migrant workers then let’s have a system where they can come, work, and return home. Incidentally, we have take over a million legal immigrants into our country yearly. The onslaught of illegal immigrants that we have endured and that currently threaten our border must stop. It is a sorry situation when you consider logically that anyone who can walk in illegally can stay. Congress has failed us. The courts have failed us. Those who seek asylum must do so legally. It is not about compassion but common sense. A wall is just a part of the solution that we need.\nJeff Reyburn\nLake Havasu City", "url": "https://apnews.com/f7986deecbd44c5d94eeed6a5f31bc00"}