{"authors": ["Tommy Hernandez"], "date_download": "2020-05-04 20:19:11", "date_modify": "2020-05-04 20:19:11", "date_publish": "2019-01-27 02:00:00", "description": "Every 65 seconds, someone in the United States develops Alzheimer’s. Another way to put that into perspective is to say that around the time it takes you to read this, two people will have...", "filename": "_4f71c486016d4903aa3b45bb0a62e56c_1588623551.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4f71c486016d4903aa3b45bb0a62e56c_1588623551.html", "title": "Support needed for state’s aging population", "title_page": "Support needed for state’s aging population", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Every 65 seconds, someone in the United States develops Alzheimer’s.\nAnother way to put that into perspective is to say that around the time it takes you to read this, two people will have developed this devastating disease.\nSadly, in our state, its prevalence is projected to jump nearly 40 percent by 2025. Because of this, chances are that someone you know will suffer the emotional and physical pain that comes with it. The swelling prevalence of Alzheimer’s and all that it does to a person, and their loved ones, is why it is one of the most feared diseases today.\nThis helps explain why Alzheimer’s has become a dinner table topic for many families. But this conversation needs to transcend the home; it needs to be seriously discussed by our legislators in the Roundhouse to ease some of the worry caused by this hardship.\nWandering is one of the top concerns associated with this disease because it is a dangerously common occurrence among those with Alzheimer’s. Realistically, anyone who has memory problems or any cognitive decline is at risk of getting lost. Even in the early stages of dementia, a person can become disoriented or confused for a period of time.\nIn fact, 6 in 10 people with this disease will wander away from the safety of their homes. Some will return home safely. Some will return having suffered an injury. And worst of all, some will not return at all. There is action that our lawmakers can take to mitigate this risk. Targeted policies around notification systems have proven to help save lives.\nThis session, Democratic Sen. Richard Martinez from Los Alamos, Rio Arriba, Sandoval, and Santa Fe counties is sponsoring Senate Bill 42, titled “Missing Person Notification Requirements” to address the concerns of advocates, including the Alzheimer’s Association, New Mexico Chapter.\nOne of the proposed changes in this bill relates to the current age requirement for Silver Alert notifications. SB 42 would exempt the endangered person from the age requirement of 50 years or older if there is a clear indication that the individual suffers from Alzheimer’s disease or another form of dementia. This would align New Mexico’s Silver Alert policy with several other states that have already passed similar change.\nThe bill also would provide a plan for collecting and maintaining records on each Silver Alert issued so that data-driven decisions can be made in the future. Currently, there is no plan to collect and maintain records and data on these notifications. Further, this legislation would establish a procedure for a text message notification on the endangered person, similar to an Amber Alert text.\nThis bill is urgently needed. Our state’s population of people age 65 and older will grow at a much faster rate than the national average. Aging is the single biggest risk factor for developing Alzheimer’s. According to the New Mexico Aging and Long Term Services Department’s website, “By the year 2030, New Mexico’s percentage of population over age 65 will move from 29th to fourth-largest in the nation.”\nWe look forward to advocating in strong support of this much-needed bill on behalf of the nearly 39,000 people living with this disease and the 110,000 selfless caregivers in our state today, and call on our policymakers to support it.\nIf you also support this bill, call your representative or senator to let them know how Alzheimer’s or some other form of dementia has affected you and your family and why this legislation is needed. Our chapter also welcomes all to join us from 10 to 11 a.m. Jan. 30 in the Rotunda of the Roundhouse for Alzheimer’s Awareness and Advocacy Day. If you have questions, comments or would like to learn more about the Alzheimer’s Association, New Mexico Chapter, contact us at 800-272-3900 or visit www.alz.org/newmexico.\nTommy Hernandez is the public policy director of the Alzheimer’s Association, New Mexico Chapter.", "url": "https://apnews.com/4f71c486016d4903aa3b45bb0a62e56c"}