{"authors": ["Readers Of The Times-Tribune"], "date_download": "2020-05-04 20:06:50", "date_modify": "2020-05-04 20:06:50", "date_publish": "2019-02-20 00:00:00", "description": "Blue-ribbon pawns Editor: The many problems that need fixing in the Scranton School District are glaringly obvious, and cuts to expenditure are inevitable.  But the idea of closing...", "filename": "_6038e3e90d5a4fd8865366322c6d9578_1588622810.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6038e3e90d5a4fd8865366322c6d9578_1588622810.html", "title": "Letters To The Editor 2/20/2019", "title_page": "Letters To The Editor 2/20/2019", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Blue-ribbon pawns\nEditor: The many problems that need fixing in the Scranton School District are glaringly obvious, and cuts to expenditure are inevitable.\nBut the idea of closing Robert Morris or William Prescott is ludicrous. They are both Blue Ribbon elementary schools. There are 11 elementary schools in the district, including three that are considered low performing by the state Department of Education.\nEvery elementary school is an ecosystem of families, teachers and communities and children are not pieces on a chess board to be moved purely for financial benefit. Economic concerns cannot outweigh educational outcomes for our children.\nIf we need to rationalize schools, then surely we start with the weakest performers, and transfer their students to high-performing schools, rather than messing around with schools that clearly perform well and transferring students from those facilities to weaker institutions.\nThe school district has been mismanaged for years, leading to a possible state takeover. Closing Prescott or Robert Morris would be yet another mistake and a huge error of judgment, an apparently simple band-aid solution slapped onto a complex situation that would cost the children of Scranton for decades.\nSTACY NIVERT\nSCRANTON\nDo-over strategy\nEditor: Apparently the old saying “crime does not pay” does not carry over to the Scranton School District or the city of Scranton.\nThe few people who allegedly committed crimes, well, their crimes are not really called crimes around here. The garage owner who allegedly stole from the school district walked away with a county job and the district’s former business manager walked away with yearly pension of more than $78,000.\nWhat happen to all the other names that were supposed to come out?\nIf I had a chance to live my life over, I would take a political job in Scranton and steal as much as I could and then take my pension for the rest of my life, because in Scranton that seems to not be a crime. Silly me, I worked at an honest job and retired with no pension, just Social Security that I paid for myself.\nBut that is the way things go in Scranton,\nJAMES A. VIOLA\nSCRANTON\nInspired by Wofford\nFormer Sen. Harris Wofford, who died recently, was a true statesman.\nInspired by President John F. Kennedy’s call to service, he was one of his generation’s brilliant young men drawn to government. They viewed public service as a noble calling.\nI met Wofford as a student leader in college as he and I scrubbed pots at a soup kitchen in Harrisburg on Youth Service Day in 1988. I initially thought he was a professor. He never told me that he was the state’s secretary of Labor and Industry. Nor did he tell met that he had advised Kennedy on civil rights and helped R. Sargent Shriver to create the Peace Corps. Wofford wanted to talk about my aspirations and what inspired young people of my generation to serve others.\nI worked for the General Assembly when Gov. Bob Casey appointed Wofford to the seat left vacant by the death of Sen. John Heinz. Wofford was considered a scholar who had little chance of beating former Gov. Richard Thornburgh. But, championing the cause of affordable health care, he went on to Senate victory.\nWithout Casey and Wofford, Bill Clinton may have not become president. They brought campaign adviser James Carville to the attention of the then-unknown Arkansas governor in 1991.\nI worked at the Corporation for National Service when Clinton tapped Wofford to head the agency. AmeriCorps, Clinton’s signature national service program, engages young people in service. Regardless of the nobility of an idea, it will come under attack. Wofford focused on building a quality program that would change America for the better and he would have made a great president.\nHe inspired me to follow my ideals. I still volunteer regularly. I always will be grateful to Wofford for showing me the way to a life of real meaning.\nJOSEPH A. RICCARDO, JR.\nSCRANTON\nGreatness subjective\nEditor: Michael M. Phillips (“Trump criticism unjustified,” Feb. 5) proves again that he doesn’t know what he is talking about.\nHe tries to link my letter (“Putin’s pansy,” Jan. 29) to a false article that appeared in BuzzFeed. Nothing in my letter came from the BuzzFeed article.\nHe also suggests that there was nothing wrong with members of the Trump campaign meeting with the Russians with a promise of receiving dirt on Hillary Clinton.\nPhillips writes, “Who wouldn’t want to have negative information on an opponent?” Can he really be so ignorant that he doesn’t understand why it is wrong to meet with agents of a hostile foreign government that is trying to undermine our democracy by interfering in our election?\nPhillips goes on to say that the Russian meddling had no effect on the results of the election and that it didn’t cost Clinton any votes. What a ridiculous thing to say. How could Phillips know for sure what effect Russian meddling had on the election?\nIf anyone needs more proof of just how clueless he really is, in his last sentence Phillips calls Trump a great leader. Great leaders do not have their top intelligence officials testify before a Senate intelligence committee and basically confirm that the president doesn’t know what he’s doing.\nGreat leaders are not investigated by the FBI for fear that they work for a foreign government.\nBEN EGLESIA\nDICKSON CITY\nFavoritism for King?\nEditor: President George Washington led our nation to freedom for all peoples.\nPresident Abraham Lincoln kept the union intact and freed the slaves.\nMartin Luther King brought awareness to the problems colored people of America suffered.\nWhy do two great presidents share a holiday and King gets his own?\nHAYDN EVANS\nSCOTT TWP.", "url": "https://apnews.com/6038e3e90d5a4fd8865366322c6d9578"}