{"authors": ["James Halpin"], "date_download": "2020-05-04 20:21:25", "date_modify": "2020-05-04 20:21:25", "date_publish": "2019-01-16 00:00:00", "description": "WILKES-BARRE — A Plains Twp. woman charged with falsely accusing two state troopers of rape has pleaded guilty to delivering methamphetamine in a separate case. Christine Cromer, 38, was...", "filename": "_83eae6132e474a2da2db16e8d1b8de4d_1588623685.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_83eae6132e474a2da2db16e8d1b8de4d_1588623685.html", "title": "False Rape Suspect Pleads Guilty To Delivering Meth In Separate Case", "title_page": "False Rape Suspect Pleads Guilty To Delivering Meth In Separate Case", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WILKES-BARRE — A Plains Twp. woman charged with falsely accusing two state troopers of rape has pleaded guilty to delivering methamphetamine in a separate case.\nChristine Cromer, 38, was accused of conspiring with her husband Donald Richard Cromer, 44, to sell crystal meth while free on bail in other cases. But prosecutors on Monday dropped the conspiracy charges against Christine Cromer in exchange for her pleading guilty to a felony count of delivering meth.\nLuzerne County Judge Michael T. Vough accepted the plea and set sentencing for March 15.\nDonald Cromer had his trial continued to March 18 on the meth trafficking charges as well as a false imprisonment charge alleging he handcuffed his wife to a radiator while in a jealous rage, accusing her of cheating on him.\nChristine Cromer is also awaiting trial on charges of filing false reports and unsworn falsification alleging she lied about being raped by two state troopers.\nChristine Cromer has separately alleged that Trooper Robert Covington, a Bureau of Gaming Enforcement officer, and state police Sgt. Daniel Jones sexually assaulted her outside Mohegan Sun Pocono, where she worked as a cocktail waitress.\nPolice said Christine Cromer provided “multiple and inconsistent stories” about the assaults.\nThe Cromers are free on bail pending trial.\nContact the writer:\njhalpin@citizensvoice.com\n570-821-2058", "url": "https://apnews.com/83eae6132e474a2da2db16e8d1b8de4d"}