{"authors": [], "date_download": "2020-05-04 20:16:28", "date_modify": "2020-05-04 20:16:28", "date_publish": "2019-12-23 06:02:46", "description": "JEWELRY DROPPED IN SALVATION ARMY KETTLE ANNAPOLIS, Md. (AP) — It happens every so often: instead of a few coins or a buck or two, Salvation Army kettle bell-ringers get a donation of...", "filename": "_2cb68ee9da6242b6919ac5eb08ccdbb8_1588623388.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2cb68ee9da6242b6919ac5eb08ccdbb8_1588623388.html", "title": "AM-Prep: Kickers", "title_page": "AM-Prep: Kickers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "JEWELRY DROPPED IN SALVATION ARMY KETTLE\nANNAPOLIS, Md. (AP) — It happens every so often: instead of a few coins or a buck or two, Salvation Army kettle bell-ringers get a donation of jewelry. This time it happened in Annapolis, Maryland, where a woman dropped a ring and two bracelets into a kettle. Capt. Ryan Vincent says a check of the baubles showed them to be legit. One came from Tiffany — and has been sold for $1,500. The other two pieces are being appraised. The ringer who got the jewelry calls the donor a “quiet spirit” who said the pieces were sentimental — but were just laying around.\nOWL IN CHRISTMAS TREE\nATLANTA (AP) — When a Georgia family got their Christmas tree and decorated it with lights and owl ornaments, they had no idea the tree already had an owl — a live one. Katie McBride Newman says she and her daughter spotted the owl about two weeks ago. She says the discovery was “surreal” but they “weren’t really freaked out about it” because they’re “really outdoorsy people.” Just the same, they wanted the owl to be “outdoorsy” — so they called a nature center to capture the bird and help release it.\nNYC COSTUMED CHARACTERS DRAW NEW SCRUTINY\nNEW YORK (AP) — This holiday season, they’re as much of an attraction in midtown Manhattan as crowds, bright lights, decorated store windows and pigeons: an army of costumed characters, from Muppets, to Mickey and Minnie Mouse to all kinds of superheroes. But with the costumes come controversy. The city has a law that limits the characters to a small area of Times Square. But lately, the dress-uppers have drifted north to Rockefeller Plaza. Residents complain the characters slow foot traffic, while tourists complain the costumed characters urge them to pose for photos — then badger them for tips for the privilege.\nby Oscar Wells Gabriel II", "url": "https://apnews.com/2cb68ee9da6242b6919ac5eb08ccdbb8"}