{"authors": ["Dawn Foster", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Solomon Hughes", "Richard Seymour", "Gerard Di Trolio"], "date_download": "2020-05-04 19:57:32", "date_modify": "2020-05-04 19:57:32", "date_publish": "2019-07-17 00:00:00", "description": null, "filename": "2019_07_boris-johnson-prime-minister-conservative-tory-austerity-brexit_1588622252.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/07/17132245/GettyImages-1161823561.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_07_boris-johnson-prime-minister-conservative-tory-austerity-brexit_1588622252.html", "title": "Boris Johnson Will Push Tory Austerity Even Further", "title_page": "Boris Johnson Will Push Tory Austerity Even Further", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Next week, the United Kingdom will have a new prime minister. Unless all polling and indicators are incorrect, it will be Boris Johnson. The former mayor of London is far more popular than his opponent among Conservative Party members and has been the favorite since the race began, but the Tory leadership has still gone through the motions of a lengthy campaign, with Johnson and his rival, Jeremy Hunt, touring the country, each setting out their policy platform. Both have focused overwhelmingly on Brexit, and each debate is dominated by discussion on how the UK should leave the European Union.\nBrexit has sucked the oxygen out of politics for years now, but the prime minister will still have to deal with other political issues, attempt to steer the economy, and manage public finances. Both Johnson and Hunt have committed to some spending commitments; Johnson’s key pledge is to increase the number of police officers by twenty thousand to deal with violent crime. The £1.1 billion policy is revealing in its hypocrisy: police numbers have fallen by twenty thousand since 2010 due to cuts to police budgets that Johnson repeatedly voted for. The number sounds large but merely reverses the austerity measures put in place by the Conservatives, and even police chiefs have dismissed the policy, pointing out that investing in technology is more likely to combat violent crime, and that recruitment is time-consuming and difficult.\nThe Conservatives have repeatedly claimed the austerity era that began in 2010 is over. That claim was never true, and despite Johnson’s offer of police cash, he is unlikely to reverse the cuts to every department in government as prime minister. But his weekly column in the Telegraph reveals that a Johnson government will be even harsher on social issues and funding. Writing this week, Johnson argued that the best response to mental health problems was work, and that in his first budget as prime minister, he would offer tax breaks to companies to spend on mental health provisions. Johnson pointed to the example of Winston Churchill, who suffered from depression but remained in work, as purported proof of the fact that employment is the panacea for the country’s huge mental-health crisis.\nAttacks on Johnson have focused on his dishonesty, his history of duplicity and flip-flopping on political issues for personal gain, his personal failings, and the fact that he is likely to drag the UK out of the EU without an agreed withdrawal plan. But throughout his time as both a member of parliament and London mayor, he has unwaveringly supported the austerity regime that began under David Cameron’s government. Under Johnson, the government is likely to become crueler: Theresa May spoke in her maiden speech as prime minister of tackling the “burning injustices” that afflicted the country, including health problems and widespread structural inequality, yet failed to reverse any of the cuts inflicted during the Cameron era.\nJohnson will be worse, refusing to accept that the UK is riven with inequalities and that austerity worsens them. Starting from this point, the next Tory government is bound to be harsher and more immovable on social issues. At no point in his column does Johnson discuss the factors that worsen mental-health problems; he speaks at length about the loss of productivity to the economy and to business. The tragedy of mental health is not the widespread human suffering it causes, but simply lost profit.\nAusterity and mental health are intrinsically linked: the United Nations special rapporteur for health stated in a report this year that austerity, inequality, and job insecurity were responsible for many cases of mental-health problems, and that governments should focus on battling those injustices to prevent problems rather than merely providing mental-health services after the fact. Tory austerity has been responsible for untold stress among citizens, with cuts to local authorities withdrawing vital social provisions from the most socially excluded and extensive benefit cuts increasing stress and poverty, as evidenced by rocketing food bank demand (which also worsens the sense of shame for the poor).\nAt the same time, cuts to the National Health Service mean mental-health provision cannot remotely stretch to treat everyone in need: waiting lists for therapy are months long, the majority of people struggle to get an appointment with a doctor quickly, and if antidepressants and a short course of cognitive behavioral therapy don’t miraculously cure your depression, there is nothing else available. Stress causes poor physical health as well as poor mental health, and poor physical health in turn worsens mental-health problems, often leading to a downward spiral in well-being. Poverty is immensely stressful — worries about money, the threat of eviction, and job insecurity all consume a huge amount of mental energy and worsen mental health. Failing to combat poverty leaves people at risk of developing mental-health problems, and increasing poverty, as the Conservatives have done, is a positive attack on the mental health of citizens. Nor is this a problem for adults alone: one in four children in the UK lives in poverty, and children’s mental health is in crisis, too. Enduring poverty as a child decreases your life chances, creating mental-health problems that can potentially impact people for life.\nJohnson isn’t wrong to tie mental health to work, but his arguments and conclusions are. Tory policies have deliberately increased job insecurity — the rise of zero-hour contracts has proliferated without check, and access to legal aid to allow employees to take employers to court for breaking employment law has been slashed to the bone. Wages haven’t kept pace with inflation, while lower benefits mean the majority of low-paid working people have seen their earnings drop in real terms, along with greater precarity.\nLegislating for better conditions for workers, and increasing government financial support both for those in work and out of work would reduce stress and improve mental health. But a Johnson administration will never countenance that. The old Etonian is deliberately taking the party lunging to the right, socially and economically. Austerity never ended under the Conservatives, in spite of their claims. Now, under Boris Johnson, it’s about to return with a socially ruinous vengeance.", "url": "https://www.jacobinmag.com/2019/07/boris-johnson-prime-minister-conservative-tory-austerity-brexit"}