{"authors": ["Nick French", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Eric Blanc", "Alex Caputo-Pearl", "Allie Gross"], "date_download": "2020-05-04 19:54:24", "date_modify": "2020-05-04 19:54:24", "date_publish": "2019-02-08 00:00:00", "description": null, "filename": "2019_02_oakland-teachers-strike-charter-schools_1588622064.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/02/08110010/3472913945_e2ece1d382_b.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_02_oakland-teachers-strike-charter-schools_1588622064.html", "title": "Oakland Teachers Are on the Verge of a Strike", "title_page": "Oakland Teachers Are on the Verge of a Strike", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nWherever there’s a battle over public education lately, a billionaire is somehow involved. Los Angeles, Newark, the “education reform” project as a whole — the ultrarich always have their hands in efforts to antagonize teachers. One city they’ve now set their sights on: Oakland, where teachers are in the middle of union contract negotiations and just authorized a strike. Some teachers stayed out of school in one-day wildcat strikes in December and January, joined by many of their students. According to posts circulating on Facebook and Instagram, Oakland students have planned to call out sick in solidarity with teachers today. Just like other teachers’ union battles these days, the contract fight pits students and working people against billionaire pro-corporate school reformers and the politicians backing them. The superintendent of the Oakland Unified School District (OUSD), Kyla Johnson-Trammell, wants to cut teachers’ already low pay and expand class sizes. Independent of the contract fight, she also intends to replace public schools with more unaccountable charter schools. Johnson-Trammell claims a budget crisis is forcing these moves. But the district’s “crisis,” like so many other claimed budgetary crises around the country, comes after school privatization advocates helped drain the district’s funds through previous charter expansions; their allies in the superintendent’s seat and on the school board have overspent wildly on administrative salaries and corporate consultants. Charter schools are the thin wedge of the privatization movement. They open opportunities for profiteering, weaken teachers’ unions, and expand the control of the wealthy over the public school system. The superintendent’s plan to further expand charter enrollment would drain more resources from Oakland public schools, which would be used to justify more privatization. But the Oakland Education Association (OEA), the teachers’ union, is demanding that the district adequately fund its schools. They are asking for higher teacher pay, smaller class sizes, and lower workloads for staff. Who caused OUSD’s budget woes? What political circumstances have enabled the school privatization movement to flourish in Oakland? And why do billionaires care so much about charter schools?\nThe OEA Contract Fight and the OUSD Budget Oakland schools are currently experiencing a series of crises. OUSD has a severe problem keeping teachers in classrooms: about one in five teachers leave the district each year. High teacher turnover results in disruptions to student learning and a reliance on untrained teachers with emergency credentials. (In 2017–18, at least 15 percent of new OUSD teachers had emergency credentials, and at least 30 percent of teacher applicants did.) The cause of the teacher retention crisis isn’t a mystery. As the cost of living in Oakland skyrockets, OUSD teachers remain some of the lowest paid in Alameda County. The starting salary for an OUSD teacher is roughly $46,000/year, far below the $61,000/year and $65,000/year paid to new teachers in nearby Hayward Unified and Fremont Unified, respectively. OUSD’s maximum teacher salary is the second lowest in the county. Unsurprisingly, a recent survey by the district found thatlow pay and a high cost of living were the primary reasons teachers left the district. Schools are also facing shortages of other critical staff like nurses, a shortage that is so bad that teachers and other staff often have to take on the role of medical caregivers. After over a year and a half without a contract, negotiations between OEA and OUSD have gone nowhere. The Oakland Post reports that OEA is asking for a 12 percent pay raise over three years. They are also asking for smaller class sizes and smaller caseloads for staff who provide critical services to students, like nurses. OUSD’s most recent offer is a raise of just 5 percent over three years (including a retroactive raise for 2017–18). That’s in effect a pay cut, since it doesn’t even keep up with inflation. The district also plans to increase class sizes for special ed, making it harder for high-needs students to get adequate individual attention. OUSD is using a budget shortfall to argue against increasing teacher pay. The district estimates that, if current revenue and expense trends continue, it will face a shortfall of almost $60 million by the 2020–21 school year. It aims to cut $30 million from the 2019–20 budget, with over $11 million in cuts to already overburdened school staff. At the same time as the district points to deficits to argue against meeting teachers’ contract demands, Johnson-Trammell, the district superintendent, is also using the shortfall as a rationale for shutting down public schools and replacing them with charters.", "url": "https://www.jacobinmag.com/2019/02/oakland-teachers-strike-charter-schools"}