{"authors": ["Justin A. Cohn"], "date_download": "2020-05-04 20:18:00", "date_modify": "2020-05-04 20:18:00", "date_publish": "2019-04-06 05:00:01", "description": "The Komets had claimed indifference about which team they'd face in the first round of the Kelly Cup playoffs, the regular-season champion Cincinnati Cyclones or arch-rival Toledo...", "filename": "_d2dcc5cf014744d39aaf156f7e154c06_1588623480.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d2dcc5cf014744d39aaf156f7e154c06_1588623480.html", "title": "K's win, cement 3rd seed in division", "title_page": "K's win, cement 3rd seed in division", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Komets had claimed indifference about which team they’d face in the first round of the Kelly Cup playoffs, the regular-season champion Cincinnati Cyclones or arch-rival Toledo Walleye.\nIt didn’t show tonight.\nThe Komets defeated the Cyclones 5-3, therefore ensuring they won’t face them until the second round, should both teams make it that far.\nHowever, there were some familiar themes in this game as the Komets squandered a huge lead : they were up 4-0 : aided by defensive lapses and penalties. Cincinnati outshot Fort Wayne 40-22, including 28-10 in the second and third periods combined.\n(Video highlights above.)\nWith the victory, the Komets cemented the third of four seeds in the Central Division, making the regular-season finale 5 p.m. Sunday against the Wheeling Nailers at the Coliseum meaningless for anything other than momentum.\nThat best-of-seven series with the Walleye will begin with games Friday and Saturday at the Huntington Center in Toledo, Ohio, with Games 3 and 4 at the Coliseum on April 17 and 19.\nThe series will have a 2-2-1-1-1 format.\nFor the league-sponsored Marvel Superhero Night, the Komets wore special “Black Panther” jerseys that will be auctioned off on www.meigray.com, and a crowd of 8,375 was on hand.\nThe Komets opened the scoring when Justin Hodgman retrieved a rebound, sent the puck back to the blue line and Ryan Lowney fired a shot past goaltender Ty Rimmer at 4:47 of the first period.\nJ.C. Campagna’s steal of the puck in the corner, and then a short pass, set up Anthony Nellis for a goal on an 18-foot shot for a 2-0 lead at 10:44.\nShawn Szydlowski made it 3-0 with his second 5-on-3 power-play goal in as many nights, this on a snap shot from just inside the left circle and 38 feet out from the net at 15:54, after which he crossed his arms across his chest to make the Wakanda Forever pose from “Black Panther.”\nSzydlowski had helped set up the power play when he was slashed by Spencer Dorowicz during a breakaway that began at the other end with Fort Wayne defenseman Dalton Hamaliuk sweeping the puck off the goal line behind netminder Zach Fucale.\nThe onslaught continued when Jake Kamrass intercepted the puck at center ice, skated into the offensive zone and dropped pass for Kyle Hope to score from the left circle for a 4-0 lead 5:46 into the second period.\nThe Cyclones answered with goals late in the period from Pascal Aquin and Anthony Florentino, both from within 10 feet, to cut Fort Wayne’s lead to 4-2. And Cincinnati’s Alex Wideman scored 47 seconds into the third period, on a power play, with a shot from the right circle that slipped just underneath the crossbar but was quickly ruled a good goal by referee Steven Rouillard.\nHodgman cemented the game with a goal at 17:32, sending the puck into an open net after he patiently waited for Rimmer to sprawl to the ice.\nNotes: The Indy Fuel’s Ryan Rupert, who injured Fort Wayne’s Sean Flanagan with a hit from behind, and then linesman Christopher Williams with a punch in the ensuing melee, was suspended indefinitely by the ECHL pending a review. The incident came in the Komets’ playoff-clinching 3-2 victory Friday in an overtime shootout. Flanagan passed his concussion test but was unable play today. Williams had a sore neck and teeth, but he was able to work tonight’s game in Toledo, Ohio. ... The Komets played without Jamie Schaafsma, Kevin Gibson, Craig Cescon and Alex Dubeau.\njcohn@jg.net", "url": "https://apnews.com/d2dcc5cf014744d39aaf156f7e154c06"}