{"authors": ["The Herald-Dispatch"], "date_download": "2020-05-04 20:07:21", "date_modify": "2020-05-04 20:07:21", "date_publish": "2019-03-30 04:01:00", "description": "AID, Ohio — Rachael Hayes, Sarah Kingery and Ericca Ross all went 2 for 3 to lead Symmes Valley (4-0) to a 12-3 rout of Fairland. Kingery was the winning pitcher. Emily Bowen went 3 for 4...", "filename": "_80841dae00374807b26550ca3e87f22c_1588622841.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_80841dae00374807b26550ca3e87f22c_1588622841.html", "title": "Prep softball/baseball: Symmes Valley clobbers Fairland 12-3", "title_page": "Prep softball/baseball: Symmes Valley clobbers Fairland 12-3", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "AID, Ohio — Rachael Hayes, Sarah Kingery and Ericca Ross all went 2 for 3 to lead Symmes Valley (4-0) to a 12-3 rout of Fairland.\nKingery was the winning pitcher. Emily Bowen went 3 for 4 for the Dragons.\nBOYD COUNTY 7, SOUTH POINT 2: Bailey Conley homered twice, tripled once, drove in five runs, scored three and was the winning pitcher as the Lions (4-1) went on the road to beat the Pointers. Graci Borders was 2 for 4 and Bekah Badgett hit a home run.\nPOINT PLEASANT 4, RIVER VALLEY 1: The home-standing Big Blacks (4-1) used a three-run fifth inning to pull away from the Raiders (0-4). Kit Stroud was the winning pitcher, allowing four hits with two strikeouts and two walks in four innings. Peyton Jordan and Emma Harbour each smacked three hits for Point Pleasant. Brooklyn Sizemore had two hits for River Valley.\nASHLAND 6, BATH COUNTY 1: Kenzi Robinson homered to help the Kittens (5-1) beat the visiting Wildcats (5-3).\nWAHAMA 5, CALHOUN COUNTY 4: Lauren Noble went 2 for 4 with two doubles and two runs scored for the White Falcons (7-1). Hannah Rose was 2 for 4. Hannah Billups and Victoria VanMatre each went 2 for 3. Whitney Stevens went 2 for 4 for the Red Devils (6-2).\nWHEELERSBURG 8, HURRICANE 6: Christen Risner homered and Sarah Claxon went 2 for 4 and drove in two runs as the Pirates (3-1) beat the Redskins (3-4) in Sluggerfest in Ona, West Virginia. Laney Eller was 3 for 4 and Boo Sturgill went 2 for 3 for Wheelersburg. Winning pitcher Sydney Spence struck out 11.\nSOUTH WEBSTER 19, GREEN 3: Rease Hall went 2 for 3 with four RBI and Baylee Cox went 2 for 5 with four RBI to lead the Jeeps (3-3) over the Bobcats (1-3). Gwen Messer was 3 for 5 and drove in two runs. Bri Smith went 2 for 4 with two RBI. Charlie Blevins was 2 for 3 for Green. Bri Claxon was the winning pitcher.\nWINFIELD 11, SCOTT 1: Elyssa Medley hit a solo home run to lead the Generals past the Skyhawks. Kennedy Dean had two doubles with two RBI for Winfield. Kenzie Hale added two hits, including a double, and Gracie Benison had two RBI. Tori Allen hit a solo homer for Scott.\nBaseball\nIRONTON ST. JOE 15, SCIOTOVILLE EAST 4: Michael Mahlmeister went 2 for 4 with three RBI and Jimmy Mahmeister was 2 for 4 and drove in two as the Flyers (2-1) pounded the Tartans in Ironton. St. Joe scored 10 in the bottom of the first to pull away and make a winner of pitcher Matt Sheridan. Chase Wilds was 2 for 3 with two RBI.\nPOINT PLEASANT 7, BUFFALO 2: Levi Williams had two hits, two RBI and was the winning pitcher as the Big Blacks (6-0) defeated the visiting Bison (5-3). Dylan Jividen, Jacob Smith and Preston Tucker had two hits apiece for Buffalo.\nGREEN 6, SOUTH WEBSTER 4: Bryce Ponn threw a complete game as the Bobcats (2-1) edged the Jeeps in Franklin Furnace, Ohio. Eli Webb went 2 for 4 for Green. Mason Barber drove in two runs. Jacob Ruth went 2 for 3 for South Webster.\nFAIRVIEW 3, SOUTH POINT 1: Jaxon Manning scored the winning run on a fielder’s choice to lift the Eagles (6-2) over the Pointers (2-2). Jordan Lucas was the winning pitcher and went 2 for 3, as did George Jervis. Brycen McCann went 2 for 4 for South Point.\nWHEELERSBURG 11, IRONTON 1: Trey Carter went 2 for 3 with two RBI and Connor Mullins was 2 for 4 with an RBI as the Pirates (2-1) defeated the Fighting Tigers (1-2). Drew Blair earned the victory.", "url": "https://apnews.com/80841dae00374807b26550ca3e87f22c"}