{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:20:20", "date_modify": "2020-05-04 20:20:20", "date_publish": "2019-01-17 12:30:00", "description": "I'm a Northwest Iowa-raised woman who left the area for college. While I don't always agree with how each person presents their beliefs, I believe Steve King was misquoted by The New York Times. A...", "filename": "_966ec398db2e4e14b8e8f66833cc1a4c_1588623620.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_966ec398db2e4e14b8e8f66833cc1a4c_1588623620.html", "title": "'Let's slow down ...'", "title_page": "LETTER: 'Let's slow down ...'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "I’m a Northwest Iowa-raised woman who left the area for college. While I don’t always agree with how each person presents their beliefs, I believe Steve King was misquoted by The New York Times. A pause, a comma in our verbal language, is difficult to translate to written word. I say let’s watch what he does for the next 20 months. 2020 is another election. If we apply this same judgment to others serving in Congress today, America ought to have a dozen resignations this week (by people who have made no attempt to correct their anti-Semite and anti-Christian statements in the past two years). I’ve learned to never trust one news source completely.\nI don’t believe Mr. King is a white supremacist. Let’s slow down and monitor the entire government, not jump on popular topics without proper information. Again, does anyone believe each and every news report as truth standing alone, or do we demand evidence? I haven’t seen evidence of Mr. King’s alleged prejudice, just an interpretation by a newspaper that hasn’t hidden their prejudice against Republicans.\nI’ve Iearned living in Iowa my entire life that we are capable people, we expect honesty and we will discover liars given time. Let’s slow down and investigate the entire leadership in Congress before throwing out this man. - Laura Carlson, Story City, Iowa", "url": "https://apnews.com/966ec398db2e4e14b8e8f66833cc1a4c"}