{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:17:32", "date_modify": "2020-05-04 20:17:32", "date_publish": "2019-03-31 20:20:00", "description": "Jerrold C. “Jerry” Bakken, 70, passed away peacefully at his home in Portage on Wednesday, March 27, 2019, surrounded by his family and dogs. Jerrold was born on July 22, 1948, in Madison,...", "filename": "_9dc78ce24a7f42e8ac0d0ee9651478c9_1588623452.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9dc78ce24a7f42e8ac0d0ee9651478c9_1588623452.html", "title": "Jerrold C. Bakken, 70, Portage", "title_page": "Jerrold C. Bakken, 70, Portage", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jerrold C. “Jerry” Bakken, 70, passed away peacefully at his home in Portage on Wednesday, March 27, 2019, surrounded by his family and dogs.\nJerrold was born on July 22, 1948, in Madison, the son of Hector and Sally (Theel) Bakken. He married Lynn Wegert on May 23, 1992. Jerry was a U.S. Army veteran, having served during the Vietnam War. He was an avid artist. Jerry worked at Ace Hardware in DeForest, and had worked at Oscar Meyer and Madison Metro.\nHe is survived by his wife, Lynn Bakken of Portage; five children, Dax (Kristin) Bakken, Madison, Heather (Kevin) Williams, Orfordville, Jeremiah (Lisa) Bakken, Janesville, Matthew (Erin) Bakken, Randolph, and Crystal Gray, Pardeeville; 10 grandchildren; his brothers, Ray (Kathy) Bakken, Madison and Mike Bakken, Madison; his sisters, Joan Anderson, Madison and Diana (Tom) Nelson, Madison; other relatives and many friends.\nHe was preceded in death by his parents, a brother, Donald; his brother-in-law, Ken Anderson; nieces, Toni Louise Anderson and Michaelyn Meinholz; his son, Travis Kutz; and son-in-law, Brandon Gray.\nA celebration of life will be held and announced at a later date.\nPflanz Mantey Mendrala Funeral Home in Portage (www.pmmfh.com) is assisting the family.", "url": "https://apnews.com/9dc78ce24a7f42e8ac0d0ee9651478c9"}