{"authors": ["Guy Taylor The Washington Times"], "date_download": "2020-05-04 20:25:53", "date_modify": "2020-05-04 20:25:53", "date_publish": "2019-01-24 14:13:09", "description": "Secretary of State Mike Pompeo signaled Thursday that the Trump administration has no plan of backing away from its push for the removal of Venezuelan President Nicolas Maduro, even after...", "filename": "_ef2176f7f844a7a74b8097743327def0_1588623953.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ef2176f7f844a7a74b8097743327def0_1588623953.html", "title": "Mike Pompeo: Trump admin not backing down on Venezuela", "title_page": "Mike Pompeo: Trump admin not backing down on Venezuela", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Secretary of State Mike Pompeo signaled Thursday that the Trump administration has no plan of backing away from its push for the removal of Venezuelan President Nicolas Maduro, even after Venezuela’s armed forces declared loyalty to Mr. Maduro and Russia warned Washington not to intervene.\n“The time for debate is done,” Mr. Pompeo said in remarks at the Organization of American States in Washington. “The regime of former President Nicolas Maduro is illegitimate.”\nHis remarks came as news spread that Venezuelan Defense Minister Vladimir Padrino Lpez has vowed to stand by Mr. Maduro a development U.S. officials had hoped would not occur since it could increase the chance of violence between Maduro-aligned security forces and opposition demonstrators.\nA local human rights group, known as the Venezuelan Education-Action Program on Human Rights tweeted Thursday that at least 14 people had already been killed in political violence during recent days, including in clashes with security forces.\nConcern over the potential for a wider meltdown in the Venezuelan capital has risen following warnings from Russia a close ally of the Maduro government that further attempts by Washington to push regime change will be catastrophic.\nPresident Trump said Wednesday that “all options are on the table” with regards to his policy toward the situation, suggesting his administration has not ruled out the possibility of some form of U.S. military intervention in Venezuela.\nWith that as a backdrop, Russian President Vladimir Putin’s spokesman Dmitri S. Peskov made headlines Thursday by asserting that “any external intervention” by Washington “is very dangerous.”\n“We consider the attempt to usurp the top power in Venezuela as going against the foundations and principles of the international law,” Mr. Peskov told reporters in Moscow, according to news wire reports.\nThursday’s developments came after Mr. Maduro announced he was severing Venezuela-U.S. diplomatic ties and demanded all U.S. officials in Caracas leave in light of the Trump administration’s declaration of support for opposition leader Juan Guaido as interim Venezuelan president.\nThe administration has not been alone in its stance on Mr. Maduro. Several other Western Hemisphere powers, including Canada, Argentina, Brazil, Chile, Peru and Colombia are backing Mr. Guaido to replace Mr. Maduro.\nThe Organization of American States (OAS), a multinational group with a history of criticizing U.S. interventions in Latin America, has also come out in support of the Venezuelan opposition leader.\nThe organization’s position fits with what some analysts describe as a consensus among regional powers that the Maduro government has destabilized Venezuela with authoritarian moves, including jailing opposition figures, all while the oil-rich nation’s economy has crumbled in recent years.\nMr. Pompeo, meanwhile, has said the Trump administration will ignore Mr. Maduro’s demand that Washington pull U.S. diplomats from Venezuela.\nIn his remarks Thursday to the OAS, the secretary of state asserted that Mr. Maduro’s “regime is morally bankrupt, it’s economically incompetent, and it is profoundly corrupt.”\n“It is undemocratic to the core. I repeat: The regime of former President Nicolas Maduro is illegitimate. We, therefore, consider all of its declarations and actions illegitimate and invalid,” Mr. Pompeo said.\n“In light of these facts, we call on Venezuelan security forces to ensure the protection of interim President Guaido’s physical integrity and his safety,” he added. “We’ve seen reports that a number of protesters were killed yesterday and that more than 100 were arrested, so I reiterate our warning about any decision by remnant elements of the Maduro regime to use violence to repress the peaceful democratic transition.”", "url": "https://apnews.com/ef2176f7f844a7a74b8097743327def0"}