{"authors": ["Stephen Dinan The Washington Times"], "date_download": "2020-05-04 20:06:14", "date_modify": "2020-05-04 20:06:14", "date_publish": "2019-01-10 17:43:39", "description": "Senators passed a bill Thursday to ensure all federal employees, whether they are still working or were furloughed, will be paid in full when the partial government shutdown ends. The...", "filename": "_92b38d6df53ca6c9928d824001868a65_1588622774.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_92b38d6df53ca6c9928d824001868a65_1588622774.html", "title": "Senate passes bill to pay all federal employees -- after shutdown ends", "title_page": "Senate passes bill to pay all federal employees -- after shutdown ends", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Senators passed a bill Thursday to ensure all federal employees, whether they are still working or were furloughed, will be paid in full when the partial government shutdown ends.\nThe shutdown will cross the three-week mark on Friday, which is also the same day that they will miss their first paychecks.\nSenators said they had to find something to do to send a signal of comfort.\n“When we reopen, they will be paid,” said Sen. Tim Kaine, Virginia Democrat.\nUnder federal law essential employees who worked during the shutdown would be paid once government reopens, but those who were furloughed and did not work are not guaranteed pay.\nEvery previous shutdown has been ended with a deal to pay them anyway for work they did not do, and the Senate’s bill Thursday does the same.\nIt cleared without objections, with Majority Leader Mitch McConnell offering the motion.\nThe bill was sponsored by Sen. Ben Cardin, Maryland Democrat.\nDemocrats have blocked other floor action this week as they insist the Senate focus on the shutdown.\nThe partial shutdown has struck nine federal departments and dozens of agencies, leaving more than 400,000 essential workers on the job without pay, and 350,000 others furloughed.\nDemocrats said the pay bill should kickstart efforts to get all employees back on the job.\n“While this gives them much-needed certainty, they shouldn’t be forced to go without a paycheck at all. Let’s end the shutdown and reopen the government!” said Sen. Chris Van Hollen, Maryland Democrat.", "url": "https://apnews.com/92b38d6df53ca6c9928d824001868a65"}