{"authors": ["Jerry Guenther Regional Norfolkdailynews.Com"], "date_download": "2020-05-04 20:25:15", "date_modify": "2020-05-04 20:25:15", "date_publish": "2019-01-09 15:15:00", "description": "Time is running out to donate to the 2018-19 Norfolk Area Good Neighbors fund drive. Members of the Good Neighbors advisory board encourage anyone still planning to donate to do so no later...", "filename": "_d109981b1bbb4d248933de038c95b7bc_1588623915.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d109981b1bbb4d248933de038c95b7bc_1588623915.html", "title": "Fund drive winding down for 2018-19", "title_page": "Fund drive winding down for 2018-19", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Time is running out to donate to the 2018-19 Norfolk Area Good Neighbors fund drive.\nMembers of the Good Neighbors advisory board encourage anyone still planning to donate to do so no later than Friday, Jan. 12, when this year’s campaign will end.\nAlthough more donations could arrive after that date, they will not be included in this year’s total, which stood at more than $66,000 as of Tuesday, Jan. 9.\nThis year’s goal is $75,000. Without a flurry of late donations, this will be the first time in 13 years that the drive doesn’t meet its goal.\nThe last time Good Neighbors didn’t reach its fundraising goal was the 2005-06 campaign.\nThe good news is that based on how close this year’s goal is to being met, it isn’t anticipated that any cuts will have to be made to services despite the shortfall.\nGood Neighbors, which operates at 132 S. Fourth St., conducts its annual fund drive ahead of and during the holidays. Funds are used throughout the year to support both Good Neighbors and the Norfolk Food Pantry.\nA project of the Norfolk Ministerial Association, the drive is sponsored by the Daily News.\nGood Neighbors took over operations of the food pantry in late 2011 when the ILI Food Bank ceased operations.\nVolunteers from 15 churches take turns working at the pantry throughout the year.", "url": "https://apnews.com/d109981b1bbb4d248933de038c95b7bc"}