{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:07:34", "date_modify": "2020-05-04 20:07:34", "date_publish": "2019-02-20 07:30:00", "description": "On Wednesday, Feb. 13, the Winona Public Library celebrated Galentine’s Day (always the day before Valentine’s Day) by inviting gals in the area to have a little fun! There were crafts,...", "filename": "_66f09096c605471eb917f867bb866c82_1588622854.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_66f09096c605471eb917f867bb866c82_1588622854.html", "title": "Thanks to all who made Galentine's Day a success", "title_page": "Samantha TerBeest: Thanks to all who made Galentine's Day a success", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "On Wednesday, Feb. 13, the Winona Public Library celebrated Galentine’s Day (always the day before Valentine’s Day) by inviting gals in the area to have a little fun!\nThere were crafts, demos, vendors, food, a hot cocoa bar, wine, and a photo booth. I just wanted to say thank you to everyone who helped make it happen. First, thank you to all of the ladies who attended the event. It was great to see mother-daughter duos, bffs (best friends forever), and more.\nThank you Bluff Country Co-op for donating the bath bombs which smelled amazing. To Jefferson’s Pub and Grill for letting us have our favorite bartender, Connor, at the event. To Tiny Spoons for making some delicious baked goods. To the library’s director, Lezlea Dahlke, for making the most amazing chocolate covered strawberries and chocolate-covered pretzel sticks. To all of the vendors that either had a booth and/or conducted a demo: Mary Kay, Winona Health, Color Street, Pampered Chef, Goddess Virtue, Chevron Sheep, Young Living Essential Oils, Semcac Clinic, Scentsy, River City Bling, Mary Jo McKenna Massage, Norwex, and Maslowska Pottery.\nFinally, thank you to all of the WPL staff who worked the event to help make it possible. We will see you next year for Galentine’s Day on Thursday, Feb. 13, 2020!\nSamantha TerBeest, Adult Services Librarian, Winona Public Library", "url": "https://apnews.com/66f09096c605471eb917f867bb866c82"}