{"authors": ["Kendra Baker"], "date_download": "2020-05-04 20:06:10", "date_modify": "2020-05-04 20:06:10", "date_publish": "2019-03-13 21:02:29", "description": "BETHEL — Six-range stoves, grills, griddles and even a pizza oven will give students at Workspace Education a chance to experience what it’s like to work in a real restaurant. “This is a...", "filename": "_df637a5b55e64c8db3cb27eb6ec29a3a_1588622770.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_df637a5b55e64c8db3cb27eb6ec29a3a_1588622770.html", "title": "Turning the classroom into a restaurant in Bethel", "title_page": "Turning the classroom into a restaurant in Bethel", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Turning the classroom into a restaurant in Bethel\nBETHEL — Six-range stoves, grills, griddles and even a pizza oven will give students at Workspace Education a chance to experience what it’s like to work in a real restaurant.\n“This is a real Connecticut kitchen — not a play kitchen,” said communications director Vincent Giandurco.\nWorkspace Education is a not-for-profit that offers individualized, student-centered educational pathways for children who don’t thrive in traditional school environments.\nThe state-of-the-art kitchen-classroom will join the various learning labs at the 16 Trowbridge Drive learning center.\n“I think of Workspace as a hybrid of homeschooling and private schooling,” said executive director Cath Fraise.\nWorkspace offers 112 courses that incorporate technology and hands-on learning, allowing students to not just learn but “apply knowledge,” said Giandurco.\nWorkspace Education now has about 60 member families, said Fraise, and that number is projected to grow to about 80 by fall.\nFraise said the new kitchen took about nine months to build and was designed by facility director Paul Merchant, who has more than 15 years of culinary experience.\nMerchant will lead Workspace’s new culinary classes and said he’s already heard from students and parents interested in the program.\nSince it has passed all necessary inspections, Giandurco said, the kitchen can be used for training, as well as serving and selling food.\nFraise said the kitchen won’t just be a space for children interested in culinary arts, but for those with other aspirations as well.\nFrom learning how to process produce to making food-related videos for YouTube, Fraise said, “there are so many possibilities — it’s exciting.”\nWorkspace’s new culinary program includes focuses on farm-to-table and organic gardening.\nOne of the goals of the farm-to-table program is to show students the importance of local agriculture and inspire them to appreciate it, said Fraise.\nPart of the program involves growing produce in Workspace’s outdoor garden. Giandurco said students have already started preparing seedlings to be planted once planting season arrives.\nThat produce will then be used to make food in the new kitchen, which will then be served in Workspace’s dining area, known as the “Hub.”\nThe kitchen will be unveiled with a ribbon-cutting Friday at 1 p.m. Attendees must RSVP by emailing Giandurco at vincent@workspaceeducation.org.\nkendra.baker@hearst.com", "url": "https://apnews.com/df637a5b55e64c8db3cb27eb6ec29a3a"}