{"authors": ["Joseph Terry Jterry Havasunews.Com"], "date_download": "2020-05-04 20:25:46", "date_modify": "2020-05-04 20:25:46", "date_publish": "2019-03-02 07:22:00", "description": "Sen. Martha McSally, R-Arizona, stopped in Parker on Friday afternoon as part of a mission to visit the elected officials of all 15 counties in Arizona in her first 100 days. The freshman...", "filename": "_0f4fd230d081441db4190fc57f534c23_1588623946.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0f4fd230d081441db4190fc57f534c23_1588623946.html", "title": "McSally pledges to lead federal water plan", "title_page": "McSally pledges to lead federal water plan", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sen. Martha McSally, R-Arizona, stopped in Parker on Friday afternoon as part of a mission to visit the elected officials of all 15 counties in Arizona in her first 100 days.\nThe freshman senator visited with the mayors of Parker and Quartzsite, Parker city officials, individual members of the La Paz County Board of Supervisors and officials with the Colorado River Indian Tribes, just days after the passing of a federal bill that would help the county acquire nearly 6,000 acres of land from the federal government.\nThe La Paz County Land Conveyance Act, which passed as part of the larger Natural Resources Management Act, allows the county to purchase 5,935 acres of federal land held by the Bureau of Land Management at fair market value. The county intends to use this land to develop large scale commercial solar energy projects. The site is located off Interstate 10 in the southeast part of the county.\nNearly two years after it was first proposed, the bill passed the House of Representatives on Tuesday after passing the Senate earlier this year and is now awaiting a signature from President Donald Trump.\n“This is what makes all the other stuff I have to put up with being in Washington, D.C., worth it,” McSally said.\n“We hear from a local community what they need. It’s a federal issue. It literally takes an act of Congress for them to be able to do this. For us to be able to help push that through and actually get it across the finish line, it’s actually helping real people in real communities with economic development and job opportunities. It’s such a big deal. I’m so excited to even be here just shortly after we made that happen and talk to the people that are really impacted by it.”\nOnce the bill is signed, the county will then have to wait for the Bureau of Land Management to assess the plot and run environmental tests before it can be sold. Officials are hoping to get that process completed by the end of 2019 in order to take full advantage of available tax incentives for the purchase. Should the process begin to run long, they notified McSally of their timeline in case her influence is needed to move the effort along.\nOf course, noting the pressing issue of the region, the conversation also veered to water management and the various issues involved at the state and federal level.\nMcSally, who is the subcommittee chair for water and power as part of her work with the Senate Energy and Natural Resources Committee, said she would be the first to make sure legislation is processed once the seven Colorado River states come to a final agreement on a drought plan.\n“Assuming the agreements that are in place are finalized and California finalizes its one remaining issue in the Imperial District, then we need to codify the seven states’ agreements in law,” McSally said.\n“I’ll be leading that effort … But, we need to follow up to better understand some of the local concerns and some of the local issues related to the water rights here and some of the concerns about what might happen in the future.”\nIf the states don’t come to an agreement by Monday, then the Bureau of Reclamation will begin the federal takeover of the process.\n“What we need to do is once the seven states finalize their parts, which again right now California Imperial Water District is the one holding it up, then I will lead federal legislation to codify what the seven states came to an agreement on, which is the better way to do this, by the way. Let the states decide how to deal with how we’re going to deal with the drought instead of having the feds tell the states what to do,” McSally said.\n“If for some reason the Bureau of Reclamation is moving out to direct all of this themselves, then in our role as oversight of federal agencies … we’re going to stay closely tuned to that. But I really hope it doesn’t get to that.”\nThe former Air Force fighter pilot also reiterated her support of legislation to help veteran services, especially in rural communities.\n“We talked extensively about you’ve got a strong veterans community here. Getting them access to services and housing and healthcare,” McSally said.\n“The VA Mission Act that we passed last year is going to provide more options and choices for veterans, especially in rural communities. I was really fighting for this. You shouldn’t have to take a three-hour ride somewhere to go see a doctor. You should able to get care in your community if it’s available and you should be able to choose. The VA Mission Act is intended to streamline the options for veterans so that they and their primary care doctor can figure out what’s best for them and what’s the best place for them to get the care that they need.”\nAs a large percentage of the population in the region reaches retirement age, she also voiced her support to help the growing issue.\n“What we’ve found is people are living longer, which is a good thing,” McSally said.\n“This next generation doesn’t have as many retirement plans, like the last generation had with their companies. So you have people that are living right on the edge of poverty or in poverty that are aging in place, aging alone, and in rural areas especially, they can be totally isolated, out of access in transportation for getting the care they need, both for whether that’s for mental health of physical health, all of that. This is a real problem. Baby Boomers are retiring (at a rate of) 10,000 a day. It is something that we need to tackle together as a country, for rural and urban areas, to make sure they have access to the care that they need, they get the support that they need so they can age with dignity and wellness.”\n“With the aging community here and the snowbird community, there’s some important initiatives that we’re doing related to senior scams and care for seniors that we’ve been focusing on already which I want to dive into more deeply to find out how it’s impacting communities like this.”\nShe also talked with La Paz County officials on what she can do to help with issues that aren’t central to just western Arizona, namely addressing substance abuse and aging infrastructure.\n“This is just the beginning of that conversation and we’re going to follow through on some of those discussions,” McSally said.", "url": "https://apnews.com/0f4fd230d081441db4190fc57f534c23"}