{"authors": ["Barry Adams", "Wisconsin State Journal"], "date_download": "2020-05-04 20:23:53", "date_modify": "2020-05-04 20:23:53", "date_publish": "2019-01-18 22:40:00", "description": "A notice submitted Friday to the state by Shopko reveals in at least one way the struggles for the Wisconsin-based retailer. When the two Shopko stores in Madison close in April, only 63...", "filename": "_c895e398ca0c42db9fae984098c8bb82_1588623833.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c895e398ca0c42db9fae984098c8bb82_1588623833.html", "title": "Shopko notice reveals company's struggles", "title_page": "Shopko notice reveals company's struggles", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A notice submitted Friday to the state by Shopko reveals in at least one way the struggles for the Wisconsin-based retailer.\nWhen the two Shopko stores in Madison close in April, only 63 people will lose their jobs, according to a notification submitted by the company to the state Department of Workforce Development. The number is significantly lower from when the two stores opened in the 1980s, when they combined to employ nearly 600 people, according to stories published in the Wisconsin State Journal at the time.\nThe Ashwaubenon retailer announced this week that as a result of a Chapter 11 bankruptcy filing it would close 38 stores nationally, including 10 stores in Wisconsin. The workforce reduction notice, submitted Friday, listed only the Madison stores at 7401 Mineral Point Road at West Towne Mall and on the East Side at 2201 Zeier Road.\nWhen the West Side Shopko opened in 1980, the company hired 325 people. The East Side store, which opened in 1988, had 260 employees at its opening, according to State Journal reports at the time.\nTyler Tichenor, a spokesman for the DWD, said his office had not received notices about the remaining stores that will close in Green Bay, Manitowoc, West Bend, Stevens Point, Plover and Neenah, along with Shopko Express stores in Appleton and the Outagamie County town of Buchanon east of Appleton. The closings will leave just the Shopko store at South Towne Mall in Monona, which opened in 1981, as the lone Shopko store in Dane County. The Shopko just off Aberg Avenue on Madison’s North Side, which opened in 1982, closed in 2014.\nShopko, which was purchased in 2005 by Sun Capital Partners, a private-equity group, announced late last year the closing of 39 stores in 19 states by the end of this February, including a store in Mauston that opened in 2015. Last week the company added six more Wisconsin stores to the closure list. They are in Appleton, Grafton, La Crosse, Menasha, Seymour and Sussex. On Wednesday, citing excess debt and increased competition, Shopko filed for bankruptcy and added 10 more stores in Wisconsin to the closing list.\nShopko said on Wednesday that its two Madison stores will close on April 15, but Friday’s notice indicated that the first job losses could occur as early as April 12. Founded in 1962, Shopko has 126 larger-format stores, 234 Hometown locations, five Shopko Express Rx stores, six Shopko Pharmacy locations and four Shopko optical stores.", "url": "https://apnews.com/c895e398ca0c42db9fae984098c8bb82"}