{"authors": ["Dawn Foster", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Matt Bruenig", "Ronan Burtenshaw", "Jacky Davis"], "date_download": "2020-05-04 19:56:43", "date_modify": "2020-05-04 19:56:43", "date_publish": "2019-09-13 00:00:00", "description": null, "filename": "2019_09_medicare-for-all-national-health-service_1588622203.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/09/13095859/GettyImages-97768287.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_09_medicare-for-all-national-health-service_1588622203.html", "title": "How Medicare for All Looks From Britain", "title_page": "How Medicare for All Looks From Britain", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Babies are often expensive for creatures that are so small: they need new clothes, bedding, toys once they’re a little more agile, and the time you spend caring for them isn’t spent working, so your bank balance is run down for every day you aren’t in the office.\nBy posting a photograph of the bill she received after the birth of her second child, Washington Post columnist Elizabeth Bruenig also underscored that in the United States, the care you and your child receive during the delivery also costs money; even though Bruenig is insured, the hospital billed her nearly $8,000. The responses were mixed: many people understandably found the idea of billing people for bringing new life into being abhorrent, but others were defensive — child-rearing was a choice, their argument went, and having children was bound to cost money, so no one should complain that some companies were profiting from the creation of future generations.\nTravelling to the United States several years ago, I spent more than twice as much time searching for insurance than booking flights, accommodation, and planning a sightseeing itinerary combined. My friends sorted their insurance quickly and cheaply but finding a company who would insure me for less than the cost of the return flight was a challenge. Since insurance is essentially gambling with risk, the vast majority of companies were unwilling to take a chance on a traveller with a rare genetic condition that causes multiple tumors to grow in my spinal cord and severe, poorly controlled epilepsy. Finally, I found a reasonable quote, but spent a huge amount of time in fear of seizing in public and being rushed to hospital, racking up an enormous bill.\nMercifully, I was seizure free for a week in New York, but came down with a brutal chest infection, coughing like a medieval peasant with tuberculosis, and raided CVS for anything that might help so as to avoid having to seek medical help. The cough left me unable to sleep for longer than a couple of hours a night and made enemies of the people around me on the flight back. The pain, fever, and shortness of breath made the tail end of my holiday miserable, but the fear of an expensive medical bill affected me far more. On returning to London, I secured an appointment with the National Health Service (NHS) quickly, was diagnosed with pneumonia, and sent home with a free prescription. I didn’t pay a penny for anything.\nAfter a recent seizure left me unconscious for several minutes, I was kept in hospital for a little over a week. I had my own room in a facility directly over the river from the House of Parliament. Doctors performed multiple tests, including full body MRIs, CT scans, tests that tracked the electrical activity of my heart and brain, and staff gave me three meals a day, many cups of coffee, and medication at regular intervals. Free Wi-Fi throughout the hospital meant that when I felt able to, I could work on my laptop and explore the hospital grounds with friends. As we sat in the well-manicured gardens outside one of the hospital cafes, an American friend marveled that the place was “like a mini-city.”\nIt’s often, correctly, observed that to people in the United Kingdom the National Health Service is akin to a religion. Since its creation after World War II, the mere suggestion, by any party, of a shift away from free health care provokes horror in the electorate. To British people, the US model of health care appears like a hellscape: the easiest way to go viral in the United Kingdom is to post a scan of a US hospital bill and be met with horror by British people from across the political spectrum. Bruenig’s delivery may be at the lower end of that scale, but the outlook of those Americans tweeting about how health care shouldn’t be free is as alien to UK Conservatives as they are to the Left.\nThe NHS has changed the psychology of an entire nation, across multiple generations: we know that no matter what happens we will receive care and pay little, if anything, for it. Nowadays there are some costs: prescriptions are charged at a flat rate of £9 per person, but a large number of people are exempt — children, pregnant people, pensioners, low earners, and people like me, with certain health conditions that require daily medication, such as epilepsy, diabetes, thyroid issues, and cancer. Shortly after the introduction of the NHS, the government opted to impose charges for spectacles, wigs, and dentures, a highly controversial move that provoked the resignation of health minister Aneurin Bevan, the father of the NHS system. It was an unpopular choice but one that has stuck. (Again, there are certain exemptions similar to those listed above, and my eyesight is so poor, I am given free eye tests, and money off the cost of my lenses.)\nEven those in Britain who pay to access private health care, either through work or through their personal wealth, use the NHS: their doctors are trained in the NHS, and specialist care is often available only through the NHS for rare and complex diseases. If you need to visit the emergency room, you’ll be taken to an NHS hospital. People might complain about certain aspects of the NHS, such as waiting times, or personal treatment when they disagree with a doctor, but these are minor gripes, and few would claim that charging people would improve matters. Most problems with the NHS are caused by underfunding at the hands of governments that will happily finance wars while cutting funding for nurses. The United Kingdom spends only about $4,000 per capita on health — the lowest of any G7 country save Italy — compared to more than $10,000 in the United States.\nBut it utterly changes lives: knowing that if you are diagnosed with cancer, you’ll be treated quickly and not pay a penny, that having a baby or being in a car crash won’t land you with a bill has the effect of making the United States feel even more foreign than it is. Being kept alive shouldn’t be treated like ordering a meal in a restaurant, with cash flow being a barrier: if anyone gets cancer, rich or poor, they should be able to access chemotherapy and have doctors and nurses fight to keep them alive. A baby’s birth shouldn’t be heralded by an invoice, and no one should be asked about their earnings after a car crash, instead of about their medical history.\nFree health care for all, paid for through taxation, would improve the health of the nation, but it will also change the psychology of the United States forever, ingraining some small dose of equality in the way lives are valued. Under Bernie Sanders’s Medicare for All, all babies will be born ever so slightly more equal, and people will be able to focus on their child’s life rather than the bill for it.", "url": "https://www.jacobinmag.com/2019/09/medicare-for-all-national-health-service"}