{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:19:34", "date_modify": "2020-05-04 20:19:34", "date_publish": "2019-02-03 11:00:00", "description": "TODAY The Volunteer Income Tax Assistance (VITA) program will start on today at the H. Odell Weeks Activities Center, 1700 Whiskey Road. This service is provided to individuals with low to...", "filename": "_fba628a75f724ef4bfbedfbfbb808d71_1588623574.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fba628a75f724ef4bfbedfbfbb808d71_1588623574.html", "title": "Today's events for Feb. 4", "title_page": "Today's events for Feb. 4", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "TODAY\nThe Volunteer Income Tax Assistance (VITA) program will start on today at the H. Odell Weeks Activities Center, 1700 Whiskey Road. This service is provided to individuals with low to moderate income and there are some restrictions on the types of income, etc. Volunteers are certified and supervised by the IRS, and will be available to assist individuals with their taxes from 8:30 a.m. to 4 p.m. on Monday, Tuesday and Wednesday of each week during the tax season through April 10. April 10 is the last day taxes will be prepared.\nThe Horse Creek Historical Society will meet at 7 p.m. today at the parish house of St. Paul’s Episcopal Church, 117 Hard St., Graniteville. Kathy Widener, author of “Where Memories Live” and “The Return Home,” will be the guest speaker. She will speak about growing up in the Lexington area, and bring her uncle’s WWII scrapbook. For more information, call 803-663-9457.\nAiken Women In Black, in partnership with Aiken Moms Demand Action for Gun Sense, will hold a Vigil for Peace and Nonviolence from 4 to 5:30 p.m. today on Whiskey Road across from The Fresh Market. These nonpartisan vigils in witness against war and all forms of violence are held on the first and third Monday of every month. All are invited to stand with us at Hitchcock Drive (the entrance to Aiken Estates, in front of Bethlehem Lutheran Church). We have signs, or you may bring your own as long as they are nonpartisan. For more information, call Brenda at 803-648-6020, Lynn at 803-226-5546 or Emilie at 586-945-8771.\nThe Town of Windsor will hold its regular meeting at 7 p.m. today in the activity building of the First Baptist Church of Windsor. The meeting is open to the public. For more information, call 803-652-2225.\nThe Aiken County Transportation Committee will hold a work session meeting at 6 p.m. today in the conference room on the second floor of the Aiken County Government Center, 1930 University Parkway. For more information, call 803-642-1694.\nTUESDAY\nUttam Dhillon, acting administrator of the Drug Enforcement Administration, will speak at 7:30 p.m. Tuesday in the Etherredge Center on the campus at USC Aiken, 471 University Parkway. The event is part of the Chancellor’s Signature Speaker Series, and is free and open to the public.\nThe Aiken Lions Club will meet at 6:15 p.m. Tuesday at St. John’s United Methodist Church, 104 Newberry St. S.W. PDG Marla Suckow, District C’s vice district governor, will be the guest speaker. Social time and dinner will be held at 5:30 p.m. The cost is $5. For more information, call Lion Pat Friday at 803-645-0606.\nGeorge McDaniel will speak at 7 p.m. Tuesday at the Aiken County Historical Museum, 433 Newberry St. S.W. His topic will be “You Can’t Do It Alone: Partnerships Among Historical and Environmental Organizations. McDaniel served as the director of Drayton Hall, an historic site in Charleston, for 25 years. A wine and cheese reception will follow the talk. This event is free and open to the public. For more information, call 803-642-2015.\nWEDNESDAY\nThe Three Rivers Solid Waste Authority will meet at 6:30 p.m. Wednesday in the Authority’s Administrative Office at the regional landfill in Jackson. The meeting is open to the public.\nUSC Aiken will celebrate the arrival of its Steinway pianos at 10 a.m. Wednesday at the Etherredge Center on the campus of USC Aiken, 471 University Parkway.\nTHURSDAY\nHarry Potter book night will be held from 5:30 to 7:30 p.m. Thursday at the Aiken County Public Library, 314 Chesterfield St. S.W. The event will feature games, trivia and food. This program is for adults and children age 8 and older. Registration is required and was due by Jan. 31. For more information, visit abbe-lib.org.\nThe Aiken County Board of Disabilities and the board of the Tri-Development Center will meet at 6:30 p.m. Thursday at 5080 Jefferson Davis Highway, Beech Island. For more information, call Joan Lioi at 803-642-8800.\nThe Aiken Parkinson’s Support Group will meet from 1 to 2:30 p.m. Thursday in the Education Center Atrium at Millbrook Baptist Church, 223 S. Aiken Blvd. The program will be the life journeys of two community members John Deppen and Jim Crow. For more information, call 980-332701 x. 2 or email mk4316@gmail.com.\nFRIDAY\nThe Astronomy Club of Augusta will meet at 7 p.m. Friday in the new science center auditorium on the campus of Augusta University, 2500 Walton Way. Dr. John Wise will be the guest speaker. His topic will be First Stars and Galaxies in the Universe. Lunar observing will be held after the meeting. Those attending should bring what they have of planisphere, lunar map, binoculars or telescope. Layered clothing is recommended. For more information, visit angelfire.com/ga/astronomyclubaugusta.\nThe Greater Aiken SCORE will hold a workshop titled Tax Reporting for Sole Proprietors from 10 a.m. to noon Friday at the Greater Aiken Chamber of Commerce, 121 Richland Ave. E. For more information or to register, visit greateraiken.score.org.\nMended Hearts Chapter No. 294 will meet at 10 a.m. Friday in the Miller Building of Nursing on the campus of USC Aiken, 471 University Parkway. Eric Maulbrier, director of patient experience at Aiken Regional Medical Centers, will be the guest speaker. His topic will be Upcoming Changes at ARMC.", "url": "https://apnews.com/fba628a75f724ef4bfbedfbfbb808d71"}