{"authors": ["Katie Finlon Kfinlon Shawmedia.Com"], "date_download": "2020-05-04 20:14:36", "date_modify": "2020-05-04 20:14:36", "date_publish": "2019-02-19 06:02:00", "description": "SYCAMORE – The Sycamore City Council discussed the city’s liquor laws and its fiscal 2020 capital improvement budget during a meeting Monday. City Manager Brian Gregory said the council has...", "filename": "_d1e2f096f9df404e9b85e9b98d46b999_1588623276.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d1e2f096f9df404e9b85e9b98d46b999_1588623276.html", "title": "Sycamore City Council discusses liquor laws, capital improvement budget", "title_page": "Sycamore City Council discusses liquor laws, capital improvement budget", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SYCAMORE – The Sycamore City Council discussed the city’s liquor laws and its fiscal 2020 capital improvement budget during a meeting Monday.\nCity Manager Brian Gregory said the council has taken more of a piecemeal approach when it comes to updating the liquor code over the years, but it hasn’t comprehensively looked at fees or the liquor control chapter of the city’s municipal code since 2003.\n“A lot of changes are either best practices or language related to the state law,” Gregory said.\nGregory said the updated law would clarify that an annual liquor license would be terminated if it’s not renewed by April 30, for example. He said the fee changes are meant to reflect inflationary costs, what other communities are doing and the increase in responsibilities of the city’s liquor commissioner, Mayor Curt Lang.\nLang said it’s good that the city is taking another look at its liquor laws and fees. He said there have been a lot of changes to state laws since 2003, and it was time to update the city law’s language to reflect that and better outline what is expected of any permit holder.\n“I think there needs to be a way for the liquor commissioner to hold people accountable if they’re violators, and everybody plays by the same rules,” Lang said.\nThe proposed liquor ordinance also requires different licenses and fees for Class A establishments, or restaurants, and Class B establishments, or bars. The proposed initial licensing fee would be $2,500 for all establishments, and the annual fee would increase for bars from $1,500 to $2,000 and for restaurants from $1,500 to $1,750. Initial licensing fees currently are categorized by establishment size.\nThird Ward Alderman Steve Braser said he was hoping to see language that would say license fees would go up for businesses that sell to minors and perhaps knock off $50 a year to reward businesses that consistently comply with the law.\nLang said he thinks it would be better for the law to have more consistency, and he is not sure that type of reward or penalty system would offer it.\nGregory said city staff will bring an updated ordinance before the council March 4. He said any changes would not be effective until May 1.\nCapital improvement plans\nThe capital improvement program budget for the next fiscal year will total $18,918,945, with most of the improvements related to the third phase of the wastewater treatment plant expansion, the city’s street maintenance program, sidewalks and water system improvements.\nGregory said there are no new fees or taxes being proposed, and the projects will be subsidized through existing revenue sources.\nA public hearing for the full city budget and its first reading is scheduled for April 1. The scheduled second reading and adoption of the appropriation ordinance will be April 15.", "url": "https://apnews.com/d1e2f096f9df404e9b85e9b98d46b999"}