{"authors": ["Erica Moser"], "date_download": "2020-05-04 21:07:21", "date_modify": "2020-05-04 21:07:21", "date_publish": "2019-04-03 05:00:01", "description": "Stonington — Considering anthropologist Rachel Black has spent the past six years working on a book about women who cook professionally in Lyon, France, and that she works in New London, she was...", "filename": "_f7ba7ce0fdc04eb4a4ebadc6e4cc5d6c_1588626441.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f7ba7ce0fdc04eb4a4ebadc6e4cc5d6c_1588626441.html", "title": "Celebrating women working in the kitchen, on the farm and at sea", "title_page": "Celebrating women working in the kitchen, on the farm and at sea", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Celebrating women working in the kitchen, on the farm and at sea\nStonington — Considering anthropologist Rachel Black has spent the past six years working on a book about women who cook professionally in Lyon, France, and that she works in New London, she was the perfect person to moderate a discussion on local women working in food production.\nAnd considering Oyster Club now has women in the roles of chef de cuisine and sous chef, it was the ideal place to provide bites for the event, and to host a dinner prepared solely by women.\nThe Yellow Farmhouse Education Center at Stone Acres Farm partnered with 85th Day Group, which owns Oyster Club, Engine Room and Grass & Bone, to host two events as part of its Women’s Work series.\nWomen make up 60% of the restaurant group, and they presented a dinner at Oyster Club on Sunday. Some of them returned to the main house at Stone Acres Farm two days later for the panel, which drew about 50 attendees.\nAt the Tuesday event, chef de cuisine Amee Hussey and line cook Maggie O’Brien served a soup with chicken from Wild Harmony Farm in Exeter, Rhode Island; onions from Shundahai Farm in Mansfield; and cilantro from Stone Acres. Sous chef Renee Touponce served Fisher’s Island oysters with two sauces: whipped pork fat, and a soy mignonette with vineyard and onions.\nThe panel featured Shundahai co-owner Raluca Mocanu, Wild Harmony co-owner Rachael Slattery, Stone Acres Farm Director of Operations Jane Meiser and North American Marine Alliance Communications Coordinator Amy MacKown.\n“I look to them as just experts in the field, regardless of gender,” said Jennifer Rothman, Executive director of the Yellow Farmhouse Education Center.\nThe panel was conceived as a celebration of women working on the farm and at sea and in restaurants, places where women have historically been underrepresented, and a way to share their stories.\n“There is a tendency — I see this in America and France — for women to not trumpet their own success,” said Black, an anthropology professor at Connecticut College. “We’re used to men self-aggrandizing whereas maybe women underplay their achievements.”\nAt the same time, “They don’t want a prize for the best female chef in the world,” she said. “They want to participate in the regular category. We don’t want to be sidelined.”\nThe panelists talked about their backgrounds and how they came to work in food. MacKown grew up on a small island in the Chesapeake Bay “where farming and fishing are not only respected but treasured, traditional ways of life.”\nSlattery’s father was a commercial fisherman, and she spent 15 years in the maritime industry, eventually becoming a tall ship captain and volunteering on farms around the world between boat seasons.\nMocanu grew up in Romania, spent 14 years in Canada and worked as an aerospace engineer before realizing she “needed something a little more rewarding,” especially after having her first child and thinking about what went into her body.\nMeiser’s grandparents lived in the farmhouse when Stone Acres was a dairy farm, and after spending time in television production and crisis communications, she returned to the farm.\nWhile these women have found fulfillment in their work and in advocating for local, healthy eating, it hasn’t been easy.\n“Right now, we are scrapping for margins,” Slattery said. “We are on the lowest income bracket that there is. We are happy, and fulfilled, and overworked and underpaid.”\nPart of the struggle, Mocanu said as she held up a map, is that most of the federal farm subsidies go to a belt in the middle of the country that includes megaproducers like Cargill and Tyson, making these foods “look artificially cheap in the supermarket.”\nSlattery asked attendees to close their eyes and “imagine a world where the people growing your food are well-paid, they have time to spend with their children, they have time to cook, you see them walking down the street because they’re in town.”\nRothman, of the Yellow Farmhouse Education Center, asked attendees to write down their food-related intentions before leaving. Some goals included communicating feelings on subsidies with legislators, eating in-season vegetables, and finding community supported fisheries at www.localcatch.org, a site MacKown referenced.\ne.moser@theday.com", "url": "https://apnews.com/f7ba7ce0fdc04eb4a4ebadc6e4cc5d6c"}