{"authors": ["Pat Ruff"], "date_download": "2020-05-04 20:16:55", "date_modify": "2020-05-04 20:16:55", "date_publish": "2019-02-16 12:00:00", "description": "There was a “Big Four” among Hayfield High School girls athletes last year, all of them seniors: Olivia Matti, Maggie Streightiff, Carrie Rutledge and Kate Kruger. They guided the Vikings to huge...", "filename": "_dcd8766ae2a646e09c422452fed94a7d_1588623415.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dcd8766ae2a646e09c422452fed94a7d_1588623415.html", "title": "Ruff Stuff: Olivia Matti, RCTC basketball player", "title_page": "Ruff Stuff: Olivia Matti, RCTC basketball player", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "There was a “Big Four” among Hayfield High School girls athletes last year, all of them seniors: Olivia Matti, Maggie Streightiff, Carrie Rutledge and Kate Kruger. They guided the Vikings to huge success in volleyball, basketball and softball, and did it for years.\nMatti, at Rochester Community and Technical College where she is pursuing a degree in nursing, is the only one among them who has continued with basketball. Streightiff (Upper Iowa) and Rutledge (RCTC) are playing volleyball, while Kruger is attending Minnesota State, Mankato but not playing a sport. Matti — like her team — got off to a slow start this season. But that all started to change for her starting Jan. 23. That’s when she scored 30 points, connecting on 13 of 21 shots and going 3-for-7 on 3-pointers. In succession, she put together games of 30 points, 29 points, 26 points, 17 points and 30 points. Matti was a torrid 35-for-63 from 3-point land during that stretch.\nSo, what happened in those five games?\nMATTI: During that streak, I wasn’t thinking so much. I was just going out and playing and not worrying if my shot was too long or too short. Just having the mindset of “go out and play basketball.” In high school, I would overthink things and tense up in games. I told myself that it was just time to go out and play.\nYou’re averaging 15 points this season on 42-percent field-goal shooting (39 percent on 3’s). Did you see that hot streak coming?\nMATTI: I knew at some point it would come. I wasn’t totally satisfied with how I started the season. I knew I could play better than that. I was just trying to have more confidence in myself, because I went through the same thing (in high school). But when I make that first shot, I feel pretty good. I can even usually tell in warmups how it’s going to go. But I have to give my teammates a lot of the credit. They were driving and then kicking the ball out to me. They were recognizing when I was hot.\nHow much do you miss the old Hayfield gang, including Streightiff, Kruger and Rutledge?\nMATTI: I miss all of our senior class of girls from Hayfield. On our basketball team, everyone was so unselfish. We’d been playing together since the fourth grade and were all on the same page. There wasn’t a lot of drama, just a bunch of easy-going girls who got along well. It was about the best group of girls I could have every played with.\nYou contemplated not going out for basketball at RCTC, instead just going to school there. Are you glad to be playing?\nMATTI: Yeah, I’ve really enjoyed the season, getting to meet this new group of girls, and coach (Steve) Hucke does an awesome job. I think I’d be very bored without basketball. It’s fun being on a team and having a common goal, being motivated to win and compete. It’s not everyday that you get to play college basketball.\nYour team lost Wednesday night, 70-54 to powerful Anoka-Ramsey. What was on your mind when you woke up Thursday morning?\nMATTI: Losing really stings. I’m just a very competitive person, so I woke up and was thinking about it. I’m still thinking about it (late Thursday morning). It’s tough to move on.", "url": "https://apnews.com/dcd8766ae2a646e09c422452fed94a7d"}