{"authors": ["Karen Florin"], "date_download": "2020-05-04 20:20:16", "date_modify": "2020-05-04 20:20:16", "date_publish": "2019-04-24 05:00:01", "description": "The former director of auxiliary services at Connecticut College was sentenced Wednesday to 18 months in prison, followed by three years of supervised release, for using various embezzlement...", "filename": "_dcf586f7afdd4c168106f4cb6be04cdc_1588623616.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dcf586f7afdd4c168106f4cb6be04cdc_1588623616.html", "title": "Former Conneticut College administrator goes to prison for embezzlement", "title_page": "Former Conneticut College administrator goes to prison for embezzlement", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The former director of auxiliary services at Connecticut College was sentenced Wednesday to 18 months in prison, followed by three years of supervised release, for using various embezzlement schemes to steal 70,000 to date.\nAccording to court documents and statements made in court, Kmec began working at Connecticut College in 2006 and was promoted in 2014 to director of auxiliary services. In that position, he oversaw the print shop, bookstore, vending machines, transportation, laundry services and residence halls. He also oversaw the Camel Card program, which is an identification and debit card used at the college. As part of his responsibilities, Kmec oversaw approval of various third-party reimbursements for services to the college.\nBeginning in approximately 2014 and ending when he was terminated by Connecticut College in April 2018, Kmec defrauded the college through various embezzlement schemes, including receiving funds from the college through fraudulent billing schemes, diverting checks to the college to a bank account he controlled, diverting money from the Camel Card program to bank accounts he controlled and misappropriating a college laptop.\nHe also fraudulently deposited more than 80 reimbursement checks that a contractor for the college had issued to Connecticut College students into a bank account he controlled, according to the government.\nThe college terminated him in April 2018 after learning of the thefts. Upon receiving the phone call notifying him of his termination, Kmec prepared and sent several letters apologizing for his conduct that were construed by the recipients to be suicide notes, according to a sentencing memorandum submitted by defense attorney Raymond M. Hassett. Kmec then drove to state police to provide a confession but was turned away. He went to New London police, who opened an investigation and contacted the FBI.\nKmec then entered into inpatient treatment at the Institute of Living at Hartford Hospital, according to the document.\nThe case was prosecuted by Assistant U.S. Attorney Heather Cherry. U.S. District Judge Michael P. Shea presided over the proceedings.\nk.florin@theday.com", "url": "https://apnews.com/dcf586f7afdd4c168106f4cb6be04cdc"}