{"authors": ["Jeff Mayes - Staff Writer"], "date_download": "2020-05-04 20:19:32", "date_modify": "2020-05-04 20:19:32", "date_publish": "2019-01-13 20:22:55", "description": "MICHIGAN CITY – At some point Saturday afternoon, after the patients had been moved out, the doors were locked and the lights went out for the last time in the former St. Anthony...", "filename": "_6d6dca9933a2472c9ec9701fa41893ed_1588623572.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6d6dca9933a2472c9ec9701fa41893ed_1588623572.html", "title": "Lights out at old St. Anthony's", "title_page": "Lights out at old St. Anthony's", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MICHIGAN CITY – At some point Saturday afternoon, after the patients had been moved out, the doors were locked and the lights went out for the last time in the former St. Anthony Hospital.\n“When the last patient is out, then it will go dark,” Trish Weber, vice president of operations at Franciscan Health Michigan City said as patients were being moved from the old hospital on the north side to the new facility to the south.\n“It’s an almost surreal feeling to think that those lights will all be turned off.”\nThe process started at 6 a.m. when the Emergency Department was officially closed. The last patient in that part of the facility left at about 1:45 a.m., and there were no more, Weber said. The next ER patient came to the new hospital at 6:05 a.m.\nSister Jane Marie Klein, chairwoman of the Franciscan Alliance, called the hospital’s closing a “memorable” moment.\n“I got my first CEO job there in 1980,” she said while helping welcome patients to the new facility. “There will always be a place in my heart for St. Anthony’s, but there is always a time to let go.\n“Even if we are emotionally tied to that place, we have so much more to offer patients here, with all the new technology. But it’s not just the technology, it’s the people that make it happen, not just all the medical things. And we have to think of the other people, the patients, first.”\nWhile patients were being brought to the new hospital via ambulance, back at Wabash and Homer, a group of ER nurses were preparing to leave for the final time.\nJennifer Sutton called it a “bittersweet” moment.\n“It is kind of sad. We’ve got a lot of memories of this place, good and bad.”\nTina Thomas, who’s worked at the hospital for eight years, said, “It’s the only place I’ve ever worked, and it really is like home. It will be strange – when I get in the car now, it says ‘8 minutes to get to work’ and now that will change.”\nSutton, who’s been at Franciscan for eight years, said it’s “the first hospital move in my 20-plus years of nursing. It’s pretty incredible how they pulled this off. Franciscan did a great job getting everything ready. I’m amazed at how well-organized of a fiasco this was.”\nThomas said she was excited about the move, but it was unsettling to see the ER totally empty, saying, “I’ve seen a lot of happy times and bad times here.”\nThe planning and organization of the move also impressed her, and reminded her of another time when controlled chaos hit the ER.\n“It reminds me of that big pileup on 94 a few years back. I remember how well-organized everything was even with this huge influx of patients. Everybody had a place and everybody knew what they were doing. That will always stand out for me.”\nThe entire ER staff has been doing double duty, Thomas said, working regular shifts and helping set up the new department.\n“Our crew has been setting up the ER at the new place,” she said. “It’s so big we wanted everything to be perfectly organized and arranged so we had to take as few steps as possible while working.”\nSutton said everyone has been working hard, and she hopes Michigan City realizes what a gem it’s getting.\n“I hope the community knows just how great the new facility is. We’ve got some amazing equipment there. I am thrilled as a nurse to work with some of the new technology.”\nAs for the old technology, hospital president and CEO Dean Mazzoni said some of it will go to other Franciscan hospitals, and the rest will be sold or donated to other medical providers or community groups that need things like chairs.\nBut the fate of the building remains up in the air for now.\nWhile there have been talks with developers about possible uses, or even demolition, nothing is in writing, he said.\nBut Mazzoni said he “promised the mayor that we won’t be be leaving the city with an abandoned building.”\nFranciscan does plan to open an urgent care center in the old ER area, he said, probably sometime in March.\nSaturday, however, was about goodbyes.\n“Everyone’s been taking pictures of everything before all the signs come down,” Thomas said.\nAnd even as she spoke, signs reading “CLOSED” were being placed on all the doors and standing signs; and the Franciscan logos were coming off the signs along adjacent streets.\nThomas said she hopes everyone in the community is aware that the old hospital is now closed, and figured that was the case with all of the media publicity.\n“Not everyone,” Sutton said with a laugh. “I still have a few patients who’d say, ‘You’re building a new hospital?’”\nBoth had come in early Saturday morning, expecting there to be some ER patients, but found none, and no one else except for the teams preparing and moving out patients.\nThomas said that was OK; she couldn’t sleep anyway.\n“I didn’t get any sleep last night because I was worried and anxious and excited. I’m sure the entire hospital was awake last night.”\nBut as Weber, who said she teared up at the thought, said later, “Just as this new hospital is coming to life, the old one will be put to sleep.”", "url": "https://apnews.com/6d6dca9933a2472c9ec9701fa41893ed"}