{"authors": ["Art Olson Life Postbulletin.Com"], "date_download": "2020-05-04 20:04:41", "date_modify": "2020-05-04 20:04:41", "date_publish": "2019-03-16 06:00:00", "description": "In Colossians chapter 2, Paul came against false teachers who were enticing the Colossian church to submit themselves to the ritual of physical circumcision. Verse 11 states that real circumcision...", "filename": "_2f2d426221944128a1d1ca469a1c2960_1588622681.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2f2d426221944128a1d1ca469a1c2960_1588622681.html", "title": "From the Pulpit: Christ helps us cast aside our sinful side", "title_page": "From the Pulpit: Christ helps us cast aside our sinful side", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In Colossians chapter 2, Paul came against false teachers who were enticing the Colossian church to submit themselves to the ritual of physical circumcision. Verse 11 states that real circumcision occurs the moment a person receives Jesus Christ as their Lord and Savior: “In whom also ye are circumcised with the circumcision made without hands, in putting off the body of the sins of the flesh by the circumcision of Christ.” (Colossians 2:11 KJV)\nThe phrase “In whom also ye are circumcised” refers to spiritual circumcision which happens the moment you accept Christ as Lord and Savior. The Greek states “You were (once for all) circumcised (spiritually, at your conversion and baptism into the body of Christ, Romans 2:28-29; Philippians 3:3) with a circumcision made without hands.” (Ephesians 2:11)\nThe ordinance of circumcision, rightly understood, taught the necessity of giving up sin and of having the sinful nature (earthly nature inherited from Adam) cut off. Circumcision was the first symbol to Israel that they had accepted the Lord Jesus Christ. This is the circumcision of the new birth. Physical circumcision is not a means of salvation.\nCast off old person\nThe next phrase “The circumcision made without hands” is spiritual circumcision of Calvary that cuts off the “old person” and puts an end to it judicially before God. The Law cut off a portion of the physical man as a shadow of the true moral circumcision which Calvary would effect.\nThe words “putting off” in the phrase, “In putting off the body of the sins of the flesh,” in Greek means “total breaking away from” which describes a complete break from the fallen human nature inherited from Adam. It is like taking off the filthy worn out clothing and throwing them away.\nThe word is a strong expression for wholly putting away from one’s self. “The body of the sins of the flesh” refers to the human nature (with its frailties and passion) that is put off through spiritual circumcision. In physical circumcision the foreskin only was put off; in Christian regeneration “the body of the flesh” is spiritually put off. The Greek New Testament does not contain the words “of the sins” in this phrase. The phrase should read “In putting off the body of the flesh.”\nHuman nature\nIn the last phrase “By the circumcision of Christ” is the spiritual circumcision effected through Christ. Fleshly circumcision removed only a portion of the body. In spiritual circumcision, through Christ, the whole corrupt carnal nature is put away like a garment which is taken off and laid aside. Only Christ could perform circumcision of cutting off the sinful nature the moment a person accepts Him as Lord and Savior. Our commitment to God had been written on our hearts, not on our bodies. Christ sets people free from their evil desires by a spiritual operation, not a bodily one. He removed the believers’ old nature and had given them a new nature. Now our commitment to God is written on our hearts, not on our bodies.\nMany Christians have victory over demons and over Satan because Jesus Christ is Head over all principalities and power, but they do not have victory over their old human nature. They blame many things on Satan when it is coming from their own flesh. How do you overcome addictions and destructive habits? The answer is found in Romans which states that you need to crucify the old nature and not let it control your life any longer. You have the victory through Jesus Christ: “For the law of the Spirit of life in Christ Jesus has made me free from the law of sin and death.” (Romans 8:2 NKJV)", "url": "https://apnews.com/2f2d426221944128a1d1ca469a1c2960"}