{"authors": ["David E. Malloy For Hd Media Dmalloy Herald-Dispatch.Com"], "date_download": "2020-05-04 20:17:58", "date_modify": "2020-05-04 20:17:58", "date_publish": "2019-05-23 07:35:30", "description": "IRONTON — The following information was compiled from Lawrence County Sheriff's Office reports: DRUG ARRESTS: Following a traffic stop Monday, sheriff's deputies arrested Randolph M....", "filename": "_80d82a1fea624d8fb6a42668ca668610_1588623478.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_80d82a1fea624d8fb6a42668ca668610_1588623478.html", "title": "Columbus men charged with trafficking meth", "title_page": "Columbus men charged with trafficking meth", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "IRONTON — The following information was compiled from Lawrence County Sheriff’s Office reports:\nDRUG ARRESTS: Following a traffic stop Monday, sheriff’s deputies arrested Randolph M. Wagoner, 56, and Christopher R. Wagoner, 33, both of Columbus, on charges of trafficking in 43.2 grams of meth. One of the suspects said they come down to Huntington once a week to sell meth and that they double their money. Both were transported to jail.\nESCAPE: A prisoner from the Lawrence County Jail seeking treatment in Ironton escaped custody Saturday and was subsequently arrested by Ironton police. The prisoner took a taser from an officer before being subdued. The prisoner also knocked down a nurse during a chase.\nFAILURE TO COMPLY: Lawrence County probation officials last week called a sheriff’s deputy seeking assistance after a Proctorville area man cut off an ankle monitor. After the suspect was located, he took off at a high rate of speed and headed to Huntington. After a sheriff’s deputy stopped him, Huntington police charged him with being a fugitive from justice and found drugs in his car.\nFELONY DOMESTIC VIOLENCE: A 47-year-old Chesapeake area woman reported last week that her boyfriend got drunk and slapped her in the face three times and shoved her to the ground. A sheriff’s deputy arrested Alvin D. Lewis II, 47, of the 400 block of Madison Avenue, Huntington, on a felony charge of domestic violence and transported him to jail.\nTHEFT: An 87-year-old Chesapeake area man reported last week that someone stole 60, $50 savings bonds from her home.\nDOMESTIC VIOLENCE: A 43-year-old Chesapeake area woman reported Saturday that a man threatened to kill her. A sheriff’s deputy arrested a 44-year-old Chesapeake area man on a misdemeanor charge of domestic violence.\nDRUG OVERDOSE: A sheriff’s deputy responded to a drug overdose call Sunday in the Ironton area. Emergency Medical Services responded and administered 4 milligrams of Narcan and transported the man to a local hospital.", "url": "https://apnews.com/80d82a1fea624d8fb6a42668ca668610"}