{"authors": ["Elizabeth Wyman"], "date_download": "2020-05-04 20:07:28", "date_modify": "2020-05-04 20:07:28", "date_publish": "2019-03-08 05:00:01", "description": "The Mad Ants need a perfect storm of events to make the G League playoffs but it's still possible, as the Ants are just four games back from Windy City and 2.5 from second-place division leader...", "filename": "_a1318f5acb734029b3766f5bcd3c25e7_1588622848.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a1318f5acb734029b3766f5bcd3c25e7_1588622848.html", "title": "Playoffs still in the picture for Mad Ants", "title_page": "Playoffs still in the picture for Mad Ants", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Playoffs still in the picture for Mad Ants\nThe Mad Ants need a perfect storm of events to make the G League playoffs but it’s still possible, as the Ants are just four games back from Windy City and 2.5 from second-place division leader Grand Rapids with six games remaining. They got a much-needed 110-98 win over the Lakeland Magic on Friday night to end a seven-game losing streak\nBut it’s about more than winning from here on out, head coach Steve Gansey said.\n“We just gotta continue to stay together and play hard for 48 minutes,” he said. “Sounds cliche, but we gotta do it and not everybody does.\n“It’s not just playoffs, it’s individual accomplishments in trying to get better basketball situations for the summer.”\nThe Ants haven’t missed the playoffs since 2016, but it would certainly be understandable given their roster situation throughout the season.\nBut it is about more than winning, and the Ants have now showed consecutive games of strong performances, even if they lost one of those.\n“I thought we played a lot better our previous game against Long Island, the best team in the East,” Gansey said.\nThe Ants lost that game but 128-123, but Gansey said that energy carried over.\n“I loved our effort, energy for 48 minutes,” he said of the Magic win. “We had seven guys in double figures. Guy really played for each other and that’s what we preached.”\nThey’ll need more of that as they play four of the final six games on the road.\n“It’s extremely difficult, but every team has to do it in our league,” Gansey said.\newyman@jg.net", "url": "https://apnews.com/a1318f5acb734029b3766f5bcd3c25e7"}