{"authors": [], "date_download": "2020-05-04 21:06:26", "date_modify": "2020-05-04 21:06:26", "date_publish": "2019-03-14 10:18:00", "description": "Every year on March 14 (3/14), Pi Day is celebrated by many restaurants and grocery stores with great deals on pizza pies, fruit pies, chicken pot pies and more! Read on for the list of 2019 deals...", "filename": "_8b78859ff20209516e32493a798f79ea_1588626386.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8b78859ff20209516e32493a798f79ea_1588626386.html", "title": "Pi Day Deals 2019 TODAY, March 14", "title_page": "Pi Day Deals 2019 TODAY, March 14", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Every year on March 14 (3/14), Pi Day is celebrated by many restaurants and grocery stores with great deals on pizza pies, fruit pies, chicken pot pies and more! Read on for the list of 2019 deals including Blaze Pizza, Bojangles, Boston Market, Hungry Howie’s, Your Pie and more!\nIn case you are wondering, Pi, or π, is the ratio of the circumference of a circle to its diameter. It is often shortened to 3.14 which is why 3/14 (March 14) is the official day to celebrate all things Pi...or Pie.\nAnd here’s an interesting fact: Mathematical genius Albert Einstein was born on March 14, 1879!\nPlease share any other offers you know about in the Comments section and we will add them to the list.\nOn March 14, Bean Traders Coffee in Durham is offering all of their pie slices for $3.14, while supplies last, See more details on their Facebook page.\nOn March 14, dine in at BJ’s Restaurant and get a mini 1-topping pizza for $3.14. Cannot be combined with any other offers. See the details on their website.\nBlaze Pizza is celebrating Pi Day on Thursday, 3/14 with $3.14 pizzas! To get this offer, download the new Blaze Pizza app for the offer. Limit one per person, in-restaurant only at participating locations. It cannot be combined with other offers. See all the details on their website.\nOn Thursday, March 14, you can buy three Sweet Potato Pies for $3.14 at participating Bojangles locations while supplies last. See all the details on their website.\nBoston Market is offering a special buy-one-get-one deal on their delicious and savory Chicken Pot Pies. Guests who bring in a Pi Day coupon from BostonMarket.com (or show it on their phones; coupon will be available starting Monday, March 11) can enjoy one free Rotisserie Chicken Pot Pie with the purchase of another Pot Pie and drink at any one of the more than 450 U.S. locations. Get the coupon on their website.\nOn March 14th only, when you order one a Cheddar’s Scratch Kitchen restaurant Homemade Chicken Pot Pie, you get a second Pot Pie to bake at home. No coupon is necessary. There is a location in Fayetteville. See the details of the offer on their website.\nThe Cici’s Buffet will be $3.14 with the purchase of a large or medium drink at participating Cici’s locations, according to a company representative on their Facebook page. Contact your local Cici’s to see if they are participating.\nIn the Wednesday morning e-Vic e-mail, Harris Teeter shared that HT Fresh Foods Market Take & Bake pizzas (26-31 oz) and HT Fresh Foods Market bakery pies (6-9 inch) will be $3.14 each. There is a limit of 2 while supplies last.\nHungry Howie’s is celebrating Pi Day through March 14 by offering customers a medium one topping pizza for $3.14 with any bread purchase at menu price when you use coupon code 19PI when ordering. The deal is only valid for carryout orders from 3/11 through 3/14 at participating locations. There are multiple locations in Raleigh, Fayetteville and Burlington. See the store locator on their website. See the details on their website.\nApple pies from the bakery, 8 inch, are only $3.14 through March 19.\nGet a small cheese pizza for $3.14 with any pizza purchase on March 14 at participating locations. See the details on their Facebook page.\nBuy 1 Artisan Thin Crust pizza on March 14 and get another one for $3.14 at participating Pieology locations. See the details on their Facebook page.\nOn Thursday, March 14 from 4 pm – 7 pm, Publix is celebrating Pi Day by offering free apple pie and key lime pie samples in the bakery. Plus select apple and key lime pies are on sale for $3.14 this week.\nOn March 14, Your Pie is offering a 10″pizza for only $3.14 at participating locations. Limit 1 per person. No call in or online orders. See the details on their website.\nGet a free PI Day Medal when you run, bike or walk 3.14 miles on March 14. Then fill out the form on their website by March 18. Medals will be mailed the week of March 25. See the details on their website.\nThe adorable Play-Doh Playful Pies Set is on sale for only $9.99 (63% off) at Amazon.com right now! This set is usually $26.99 and includes a pie plate, fruit basket, 5 accessories, and 4 cans of PLAY-DOH Brand Modeling Compound. See this deal at Amazon.com HERE!\nFor some cute Pi puns to share with all your kids and all your Facebook friends, head to grammarly.com. For example, “The worst thing about getting hit in the face with pi is that it never ends” or “What is the official animal of Pi Day? The pi-thon.”\nIf you are thinking about making a dessert pie for Pi Day, head to allrecipes.com for tons of pie recipes including fruit pies, chocolate pies, custard and cream pies, ice cream pies, no bake pies and so many more.\n.\nThis post may contain affiliate links and we appreciate your using them.\nSmart Spending Resources is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to Amazon.com.", "url": "https://apnews.com/8b78859ff20209516e32493a798f79ea"}