{"authors": ["Jason Dean"], "date_download": "2020-05-04 20:08:42", "date_modify": "2020-05-04 20:08:42", "date_publish": "2019-04-24 14:00:00", "description": "The National Football League Draft begins Thursday night and runs through the weekend. While some prospects – such as Kyler Murray of Oklahoma (pictured), Quinnen Williams of Alabama, and Nick...", "filename": "_8ad23601ca5d45659a704870fece26f0_1588622922.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8ad23601ca5d45659a704870fece26f0_1588622922.html", "title": "Best player available? Get to know the 2019 NFL Draft prospects", "title_page": "Best player available? Get to know the 2019 NFL Draft prospects", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Best player available? Get to know the 2019 NFL Draft prospects\nThe National Football League Draft begins Thursday night and runs through the weekend. While some prospects – such as Kyler Murray of Oklahoma (pictured), Quinnen Williams of Alabama, and Nick Bosa of Ohio State – may already be household names, most will be unknown to the casual fan. Use our search to learn more about the players who might be picked. What are their strengths? Weaknesses? How fast are they? How strong?\nThe search combines draft grades from NFL.com with NFL Scouting Combine results from players who participated. Search by any combination of variables, including grades, 40-yard dash times, height, school and more. Click on the Details link for additional prospect data.\nDraft grades are created by NFL.com , with higher being better. Players ranked 8-7 are Pro Bowl & All-Pro caliber. 6.99-6 are instant starters with a chance to become Pro Bowl caliber. 5.99-5.50 Chance to become a NFL starter. 5.49-5.0 should make an NFL roster. 4.99 and lower have less than a 50% chance of making an NFL roster.\nCombine stats are compiled by Pro Football Reference, and grades by NFL.com. Bench press numbers are reps of 225lbs.", "url": "https://apnews.com/8ad23601ca5d45659a704870fece26f0"}