{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:11:05", "date_modify": "2020-05-04 20:11:05", "date_publish": "2019-05-28 05:00:00", "description": "Ernest Spanhake September 28, 1930-May 26, 2019 Ernest Spanhake, 88, of Leigh, died Sunday, May 26, 2019.", "filename": "_be3176cf7439466eaa6e7e1bf5d32d6f_1588623065.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_be3176cf7439466eaa6e7e1bf5d32d6f_1588623065.html", "title": "Ernest Spanhake", "title_page": "Ernest Spanhake", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Ernest Spanhake\nSeptember 28, 1930-May 26, 2019\nErnest Spanhake, 88, of Leigh, died Sunday, May 26, 2019.\nPrivate funeral services will be held.\nErnest was born on Sept. 28, 1930, in Clarkson, to Ernest and Blanche (Malena) Mlnarik. He graduated from Leigh High School, and went to work for Leigh Implement. In 1951, he enlisted in the United States Air Force, spending time in French Morocco and several bases in the United States.\nOn June 5, 1955, he married Bonnie Jelinek in Winter Park, Florida. Upon completion of his service to the country, he again worked for Leigh Implement until 1973, when he and Bonnie took ownership under the name Spanhake Implement, selling and servicing International Harvester farm equipment.\nErnest enjoyed fishing, gardening, traveling, and family vacations at their cabin in Minnesota. He served on the Fair Board, Community Club, Village Board, and was a member of the Leigh Volunteer Fire Department and Rescue Unit. He was also a 60-year member of both the Masonic Lodge and Sucha American Legion Post #302.\nErnest is survived by his wife, Bonnie of Leigh; daughters: Susan Spanhake of Apple Valley, Minnesota, Sally (Mike) Hillis of Lincoln; son, John Spanhake of Edina, Minnesota; grandchildren: Jason Zessin, Mary (Eric) Noel, Charles Hillis, Matthew Spanhake; and one sister and brother-in-law, Regina and Robert Barnes of Apex, North Carolina.\nHe was preceded in death by his parents, Ernest and Blanche; step-father, Gustave Spanhake; and one sister, Delores Spanhake.", "url": "https://apnews.com/be3176cf7439466eaa6e7e1bf5d32d6f"}