{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:27:37", "date_modify": "2020-05-04 16:27:37", "date_publish": "2019-07-08 23:06:21", "description": "Read CNN's Fast Facts on the 2020 presidential debates and forums and learn more information about the 2020 presidential debate schedules.", "filename": "2019_07_08_politics_2020-presidential-debates-fast-facts_index_1588609657.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190627220625-37-2020-dem-debate-0627-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2019_07_08_politics_2020-presidential-debates-fast-facts_index_1588609657.html", "title": "2020 Presidential Debates Fast Facts", "title_page": "2020 Presidential Debates Fast Facts  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Photos: In pictures: The first Democratic debates Ten presidential candidates take the stage for a Democratic debate in Miami on Thursday, June 27. The candidates, from left, are author Marianne Williamson; former Colorado Gov. John Hickenlooper; businessman Andrew Yang; South Bend, Indiana, Mayor Pete Buttigieg; former Vice President Joe Biden; US Sen. Bernie Sanders; US Sen. Kamala Harris; US Sen. Kirsten Gillibrand; US Sen. Michael Bennet; and US Rep. Eric Swalwell. Hide Caption 1 of 46\nPhotos: In pictures: The first Democratic debates Harris, a US senator from California who previously served as the state's attorney general, confronted Biden on his recent remarks in which he recalled working with two segregationist senators. She raised the issue while talking about race and recalling her own childhood. Hide Caption 2 of 46\nPhotos: In pictures: The first Democratic debates Harris speaks with guests after Thursday's debate. Hide Caption 3 of 46\nPhotos: In pictures: The first Democratic debates Biden poses for a selfie after the debate. Hide Caption 4 of 46\nPhotos: In pictures: The first Democratic debates NBC's Savannah Guthrie asked Thursday's candidates to raise their hands if their government plan would provide health-care coverage to undocumented immigrants. All of the candidates raised their hands. Hide Caption 5 of 46\nPhotos: In pictures: The first Democratic debates Sanders speaks Thursday as Biden looks on. Sanders is the longest-serving independent in the history of Congress, but he caucuses with the Democratic Party. Three years ago, he was viewed as a protest candidate from the political fringe. But after an impressive showing against Hillary Clinton, he's now one of the most popular politicians among Democratic voters. Hide Caption 6 of 46\nPhotos: In pictures: The first Democratic debates Buttigieg is seen on a monitor inside the spin room where many members of the media were set up. Buttigieg became South Bend's mayor in 2011 when he was 29 years old. From 2009 to 2017, he was an intelligence officer in the Navy Reserve, and he was deployed to the war in Afghanistan in 2014. Hide Caption 7 of 46\nPhotos: In pictures: The first Democratic debates Biden, center, leads in national polls and in the polls of key early states such as Iowa, New Hampshire, South Carolina and Nevada. And his leads are not small: He's usually up 15 to 20 points. Hide Caption 8 of 46\nPhotos: In pictures: The first Democratic debates Bennet watches Swalwell speak on Thursday. Swalwell, a four-term congressman from California's Bay Area, has made combating gun violence a focus for months, and he said it will be the top focus of his campaign. The orange ribbon on his lapel was worn to honor the victims of the Parkland, Florida, school shooting last year. Hide Caption 9 of 46\nPhotos: In pictures: The first Democratic debates The debates were held at the Arsht Center in Miami. Hide Caption 10 of 46\nPhotos: In pictures: The first Democratic debates Hickenlooper, center, served two terms as Colorado's governor and was Denver's mayor before that. He had a career as a geologist in his early years, and when he was laid off in the 1980s he found success in business by opening a large brewpub. Hide Caption 11 of 46\nPhotos: In pictures: The first Democratic debates Bennet, a US senator serving his second term in Colorado, has pitched himself as a pragmatic lawmaker who has a progressive voting record and knows what it takes to win in an electorally split state. Hide Caption 12 of 46\nPhotos: In pictures: The first Democratic debates The audience watches the debate on Thursday. Hide Caption 13 of 46\nPhotos: In pictures: The first Democratic debates From left, Harris, Gillibrand and Bennet all try to speak at once during an early question on Thursday. Hide Caption 14 of 46\nPhotos: In pictures: The first Democratic debates Williamson makes a point while Hickenlooper watches. Williamson, a best-selling author who is perhaps best known for being a spiritual counselor to Oprah Winfrey, says she's running for president to bring a \"moral and spiritual awakening\" for America. The Texas native ran for Congress in 2014. Hide Caption 15 of 46\nPhotos: In pictures: The first Democratic debates Buttigieg and Biden talk during a break. Hide Caption 16 of 46\nPhotos: In pictures: The first Democratic debates Gillibrand, a US senator from New York, rose to national prominence in recent years as a fierce critic of President Donald Trump. She's also been an advocate for women's issues and a forceful proponent of the #MeToo movement. Hide Caption 17 of 46\nPhotos: In pictures: The first Democratic debates The opening volleys of the second debate offered an immediate contrast between the candidates' competing ideas about the direction of the party. Hide Caption 18 of 46\nPhotos: In pictures: The first Democratic debates Yang answers a question while Buttigieg looks on. Yang's platform includes a plan for universal basic income. He wants to give all Americans over the age of 18 $1,000 per month to address economic inequality. He argues the policy would play a key role in restructuring the modern economy to make it more equitable. Hide Caption 19 of 46\nPhotos: In pictures: The first Democratic debates From left, Biden, Sanders and Harris arrive on stage for Thursday's debate. Hide Caption 20 of 46\nPhotos: In pictures: The first Democratic debates Julian Castro, a candidate who took part in Wednesday night's debate, is seen on a television set before the start of Thursday's debate. Castro was secretary of Housing and Urban Development during the Obama administration. Hide Caption 21 of 46\nPhotos: In pictures: The first Democratic debates Ten candidates take the stage for the first debate on Wednesday. From left are New York Mayor Bill de Blasio, US Rep. Tim Ryan, Castro, US Sen. Cory Booker, US Sen. Elizabeth Warren, former US Rep. Beto O'Rourke, US Sen. Amy Klobuchar, US Rep. Tulsi Gabbard, Washington Gov. Jay Inslee and former US Rep. John Delaney. Hide Caption 22 of 46\nPhotos: In pictures: The first Democratic debates Candidates greet each other at the end of Wednesday's debate. Hide Caption 23 of 46\nPhotos: In pictures: The first Democratic debates Booker and Klobuchar take selfies with supporters after Wednesday's debate. Hide Caption 24 of 46\nPhotos: In pictures: The first Democratic debates Castro, second from left, clashed with O'Rourke, right, early in Wednesday's debate. It was by far the most direct clash of the first hour. Castro's goal was to poke holes in O'Rourke on immigration — an issue that he has used at the center of his political identity. Both candidates are from Texas. O'Rourke is a former congressman from El Paso who rose to Democratic stardom in 2018 while challenging for the US Senate seat held by Ted Cruz. Castro was mayor of San Antonio before he became secretary of Housing and Urban Development. Hide Caption 25 of 46\nPhotos: In pictures: The first Democratic debates NBC moderator Chuck Todd speaks to the audience during a technical problem in Wednesday's debate. As microphone issues continued, Todd was forced to cut to a commercial break. At right is moderator Rachel Maddow. Hide Caption 26 of 46\nPhotos: In pictures: The first Democratic debates Gabbard, an Iraq War veteran from Hawaii, was elected to the House of Representatives in 2012. She is one of six women seeking the Democratic Party's nomination. Hide Caption 27 of 46\nPhotos: In pictures: The first Democratic debates Members of the audience watch the debate Wednesday. Hide Caption 28 of 46\nPhotos: In pictures: The first Democratic debates Ryan, from Youngstown, Ohio, has served in Congress since 2003. Hide Caption 29 of 46\nPhotos: In pictures: The first Democratic debates Klobuchar gestures during NBC's technical difficulties on Wednesday. The US senator from Minnesota has cast herself as a product of working-class roots who can win bipartisan support. Hide Caption 30 of 46\nPhotos: In pictures: The first Democratic debates Warren is displayed on a monitor inside the spin room at the Arsht Center. The US senator from Masschusetts is the only candidate from Wednesday's debate who is polling above 5%. She became a progressive star by taking on Wall Street after the 2007 financial crisis. Hide Caption 31 of 46\nPhotos: In pictures: The first Democratic debates Booker, a US senator from New Jersey, rose to prominence as Newark's charismatic and ambitious mayor. Hide Caption 32 of 46\nPhotos: In pictures: The first Democratic debates A wide view of Wednesday's debate. Hide Caption 33 of 46\nPhotos: In pictures: The first Democratic debates NBC's moderators during the first hour of Wednesday's debate: from left, Lester Holt, Savannah Guthrie and Jose Diaz-Balart. Hide Caption 34 of 46\nPhotos: In pictures: The first Democratic debates John Delaney, a former congressman from Maryland, was the first Democrat to enter the 2020 presidential race. He announced his candidacy way back in July 2017. Hide Caption 35 of 46\nPhotos: In pictures: The first Democratic debates From left, Castro, Booker and Warren share a laugh during a commercial break on Wednesday. Hide Caption 36 of 46\nPhotos: In pictures: The first Democratic debates Ryan, right, looks at de Blasio as the New York mayor answers a question on Wednesday. Hide Caption 37 of 46\nPhotos: In pictures: The first Democratic debates None of the candidates is polling above 35% nationally. Four years ago, Hillary Clinton was polling at around 60%. Hide Caption 38 of 46\nPhotos: In pictures: The first Democratic debates Gabbard speaks with Inslee during a commercial break Wednesday. Hide Caption 39 of 46\nPhotos: In pictures: The first Democratic debates O'Rourke answers an early question during Wednesday's debate. During his first answer, he switched over to Spanish for a bit. Booker and Castro also spoke some Spanish during the debate. Hide Caption 40 of 46\nPhotos: In pictures: The first Democratic debates Inslee is serving his second term as Washington's governor. He has said his top priority is combating climate change. Hide Caption 41 of 46\nPhotos: In pictures: The first Democratic debates The candidates prepare for the start of Wednesday's debate. Hide Caption 42 of 46\nPhotos: In pictures: The first Democratic debates Tom Perez, chairman of the Democratic National Committee, speaks to the media before the start of the debate on Wednesday. Hide Caption 43 of 46\nPhotos: In pictures: The first Democratic debates From left, Booker, Warren, O'Rourke and Klobuchar pose on stage before the start of the debate Wednesday. Hide Caption 44 of 46\nPhotos: In pictures: The first Democratic debates Delaney takes the stage before Wednesday's debate. Hide Caption 45 of 46", "url": "https://www.cnn.com/2019/07/08/politics/2020-presidential-debates-fast-facts/index.html"}