{"authors": ["The Herald-Dispatch"], "date_download": "2020-05-04 20:22:33", "date_modify": "2020-05-04 20:22:33", "date_publish": "2019-05-11 04:01:00", "description": "PIPESTEM, W.Va. — Zip line tours are officially underway at Pipestem Resort State Park — just in time for summer. West Virginia State Parks unveiled the state's newest aerial adventure...", "filename": "_26cd849c0dc84efab02bcc04744916e2_1588623753.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_26cd849c0dc84efab02bcc04744916e2_1588623753.html", "title": "Zip line tours now officially open at Pipestem State Park", "title_page": "Zip line tours now officially open at Pipestem State Park", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PIPESTEM, W.Va. — Zip line tours are officially underway at Pipestem Resort State Park — just in time for summer.\nWest Virginia State Parks unveiled the state’s newest aerial adventure Thursday with the first trips on a series of zip lines that let riders soar for more than a mile above the Bluestone National Scenic River.\n“This is truly a great day for West Virginia State Parks,” Division of Natural Resource Director Stephen McDaniel said. “Since day one on the job, Gov. (Jim) Justice has charged me with finding ways to improve our parks, and he has been involved every step of the way in this project. Thanks to his leadership, we’re able to diversify our parks system and add out-of-this-world recreation opportunities for our park visitors and guests.”\nMcDaniel participated in a ribbon-cutting ceremony at Pipestem Resort in Summers County to mark the occasion. Also on hand to celebrate were Tourism Commissioner Chelsea Ruby, State Parks Chief Sam England, Pipestem Park Superintendent Brett McMillion and Paul Buechler of Ace Adventure Resort, which operates the zip line.\nThe partnership with Ace, announced earlier this year, represents a new era in recreation at West Virginia State Parks focused on family-friendly activities to draw a new generation of visitors.\nAce has other projects in the works at Pipestem, including an adventure lake and splash park similar to Ace’s lake in Oak Hill, rock climbing and rappelling instruction, kayaking and paddle board tours, guided mountain bike excursions, and tubing and whitewater adventures. Guided fishing trips on the Bluestone River began earlier this spring.\nThe Pipestem Peaks canopy tour spans more than 1.5 miles of zip lines and crosses the Bluestone Gorge three times. The tour soars more than 300 feet above the river valley and can reach speeds up to 50 mph. At the end of the tour, riders can return from the gorge via the park’s tram.\nThe adventure takes between two and three-and-a-half hours to complete, including the gear-up process, training and transportation.\nThe zip line is just one part of an $11 million investment at Pipestem Resort State Park, which is also undergoing improvements to its cabins, lodge, campgrounds, water treatment facility and tram. Guests can reserve their room, cabin, campsite and zip line tour on the recently launched online booking engine at wvstateparks.com.", "url": "https://apnews.com/26cd849c0dc84efab02bcc04744916e2"}