{"authors": ["Alana Melanson", "Amelanson Lowellsun.Com", "Aaron Curtis Acurtis Lowellsun.Com"], "date_download": "2020-05-04 20:09:23", "date_modify": "2020-05-04 20:09:23", "date_publish": "2019-02-21 11:59:36", "description": "LOWELL -- A 4-year-old Lowell girl is the suspected victim of the second flu-associated pediatric death in Middlesex County this season, and the third in the state. McDonough Funeral Home...", "filename": "_97cc0e07376f454e933d5cb72e340da5_1588622963.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_97cc0e07376f454e933d5cb72e340da5_1588622963.html", "title": "Officials: Lowell Girl, 4, Dies of Flu", "title_page": "Officials: Lowell Girl, 4, Dies of Flu", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOWELL -- A 4-year-old Lowell girl is the suspected victim of the second flu-associated pediatric death in Middlesex County this season, and the third in the state.\nMcDonough Funeral Home confirmed Wednesday morning that Puthiraksmey “Raksmey” Sopheak, who died Saturday at Lowell General Hospital, was the child whose flu-related death was reported to state health officials Tuesday.\nFuneral Director Jack McDonough said the family is requesting privacy and declined to speak with a reporter.\nThe young girl’s father, Sopheak Paak, told WCVB Tuesday night that Raksmey became sick last week and he brought her to Lowell General Hospital last Tuesday when her fever reached 99 degrees and she was coughing up blood. He said he was told she had the flu, and they were sent home with orders to give her acetaminophen, known by the brand name Tylenol.\nA grieving and emotional Paak told WCVB Raksmey seemed better at first, but took a sharp turn for the worse on Saturday. He called 911 and an ambulance rushed her back to the hospital, where she later died. According to the report, Paak was worried that Raksmey, having just returned from Cambodia in September, may have suffered from another illness, and was awaiting final word from the medical examiner on the cause of her death.\nIt was not immediately known if the girl had received a flu shot this year.\n“We offer our deepest sympathies and condolences to the family over the tragic loss of their daughter,” Lowell General Hospital spokesman Will Courtney said in an emailed statement. “Patient privacy rules prohibit us from commenting any further at this time.”\nAccording to an obituary from McDonough Funeral Home, Raksmey was born at Lowell General Hospital Dec. 30, 2014, the daughter of Paak and Sokkruy Yang, both of Lowell.\nThe flu is a contagious respiratory illness caused by influenza viruses that infect the nose, throat and sometimes lungs, the U.S. Centers for Disease Control website states. Symptoms include fever, cough, sore throat, stuffy nose, body aches, chills, headache, fatigue, and sometimes diarrhea and vomiting.\nThe CDC released numbers showing there have been between 15.4 million to 17.8 million flu illnesses this flu season, which began Oct. 1. There have also been between 11,600 to 19,100 flu deaths, the CDC website states.\nThe CDC recommends everyone 6 months and older receive a flu shot every year, which the agency’s states is the best way to prevent the flu.\nA debate about the effectiveness of flu vaccine has raged publicly. Some other types of vaccines, including those against measles, mumps and rubella, are more effective in preventing people from getting sick than the flu vaccine, according to an article release by the Associated Press. Experts say flu is a quick-changing and elusive target.\nHowever, preliminary figures suggest the flu vaccine is 47 percent effective this season in preventing flu illness severe enough to send someone to the doctor’s office, the Associated Press reported earlier this month. Health officials are generally pleased if a vaccine works in 40 to 60 percent of people.\n“We have patients who decline having flu shots,” said Sarah Hall, a nurse practitioner with Westford Internal Medicine. “We usually explain to them it’s their best defense against the flu.”\nHall referenced myths that exist about the flu shot, including a link between the vaccine and the development of autism.\n“There’s a lot of literature in the medical world that says there is no link between vaccines and autism and we should not prevent or delay vaccinations because of that reason,” Hall said.\nHall described the flu as extremely contagious. Developing the illness and passing it can be prevented by washing hands frequently, coughing into the elbow and avoiding being around people who are sick.\n“Typically the worst of it lasts three days, and then people start to get better,” Hall said. “It’s usually about a week. If at any point during that time, people have shortness of breath, chest pain, severe or persistent vomiting, or significant dizziness or confusion -- people should be seen in an emergency room.”\nVisiting hours will be held for Raksmey on Friday beginning at 3 p.m. at Glory Buddhist Temple, located at 24 Cambridge St. A funeral will be held Saturday morning, with a procession leaving the temple at 8 a.m. for Merrimack Crematory in Merrimack, N.H.\nFollow Alana Melanson at facebook.com/alana.lowellsun or on Twitter @alanamelanson and Aaron Curtis @aselahcurtis.", "url": "https://apnews.com/97cc0e07376f454e933d5cb72e340da5"}