{"authors": ["Riley Kelley Daily News Staff Writer"], "date_download": "2020-05-04 20:07:38", "date_modify": "2020-05-04 20:07:38", "date_publish": "2019-03-19 17:52:00", "description": "SCOTTVILLE — Mason County Central Schools Superintendent Jeff Mount is optimistic, for the most part, about how Gov. Whitmer’s proposed 2020 fiscal year budget would impact the school...", "filename": "_c0179c41d9d048969902c03f16707352_1588622858.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c0179c41d9d048969902c03f16707352_1588622858.html", "title": "MCC talks proposed budget, snow days", "title_page": "MCC talks proposed budget, snow days", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SCOTTVILLE — Mason County Central Schools Superintendent Jeff Mount is optimistic, for the most part, about how Gov. Whitmer’s proposed 2020 fiscal year budget would impact the school district.\nMount spoke to school board trustees about the budget Monday at MCC High School, noting that there are several potential strengths to the proposal, including weighted funding allocations for students whose education could be more costly.\n“Gov. Whitmer’s budget proposal is, from our perspective, a really good governor’s proposal,” Mount said. “She has additional funding and new funding for special education students, recognizing that they might cost an extra few dollars, and she has additional dollars for economically disadvantaged (students) and for career and technical education (CTE).”\nOn Tuesday, Mount told the Daily News that Whitmer’s proposed budget would be an adjustment because it’s based on a different model than what Michigan school districts have worked with since the Granholm administration, but he said the change could be could be a boon for rural school districts in the state.\nThe policy initiated by Granholm allocates School Aid Funding to higher education, and Mount said it’s a good thing that Whitmer plans to change that.\n“The voters were duped ... under Gov. Granholm … and the budget was a wreck when that was the case,” he said. “(Granholm) started the process of taking money out of the school aid fund, and it’s been continued ever since. Gov. Whitmer has promised to close that back up and get (funding) back to K-12.”\nHe said he’s pleased with the proposed $507 million investment in the School Aid Fund, but noted that there are a few portions of the proposal that don’t help rural schools as much as they could.\nWhitmer’s budget would change the formula by which school funding is allocated, and while it would result in a per-pupil increase of 2.3 percent — from $7,871 to $8,051 — Mount said that increase is not as high as he would like it to be.\nAnother area of the proposed budget that Mount finds lacking is the funding for public school transportation, which would still be based on an across-the-board allowance.\n“The thing I think we’re missing that will really impact our district is the transportation piece,” Mount told the Daily News. “How can a district of 225 square miles like MCC and a district of 2 square miles like North Muskegon get the same foundation allowance?”\nThe budget still needs to be approved by the State House and the State Senate, which Mount predicts will be a contentious process.\n“Stay tuned. There’s a lot to be done here yet,” Mount said. “Hopefully we’ll have some good ideas of what it will look like by budget season in June, but … we probably won’t see a real, complete, finalized budget until (later than that).”\nSnow day update\nMount provided the board with an update about the district’s snow-day status following the approval of the request to have three of the district’s snow days forgiven.\nThe request was submitted to state superintendent Sheila Alles in February, and Mount received word last week that the school would have the three days forgiven.\n“Six days are automatically (forgiven) as part of the school code, and there’s another three built in if you get a waiver from the … state superintendent,” Mount said. “I did apply for that waiver and we did receive (those three days).”\nHowever, Mount said there’s still a chance that the district could accrue more snow days this year.\n“It’s still up to Mother Nature. Hopefully we’re in a good spell of weather right now, but last year we did use two snow days after spring break, so you never know,” Mount said. “It’s also up to legislation … but if everything stays the same and legislation doesn’t change, we’d have to add two days onto the end of the calendar.”\nThose two days would keep students in class until Tuesday, June 11.\nMount noted that there is pending legislation — House Bill 4206 — to forgive snow days taken during periods of statewide emergency. Four of the district’s 11 snow days were during the state of emergency declared by Gov. Whitmer on Jan. 28, and the passing of HB 4206 would have an effect on the school calendar.\nMount said he wanted to avoid speculation about the official end of the year calendar for now, because there’s no way to predict whether the legislation will pass, or how the weather will fare for the remainder of the year.\nHowever, he said he plans to have a finalized district calendar ready by April 1.", "url": "https://apnews.com/c0179c41d9d048969902c03f16707352"}