{"authors": ["Sentinel"], "date_download": "2020-05-04 20:12:08", "date_modify": "2020-05-04 20:12:08", "date_publish": "2019-02-25 11:31:44", "description": "DEVENS -- Ten students received certificates as certified nurses assistant from Mount Wachusett Community College at a graduation last week for a free program that pairs the certificate with...", "filename": "_369d01f74349407ab682dbdd651b35ab_1588623128.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_369d01f74349407ab682dbdd651b35ab_1588623128.html", "title": "10 Become CNAs Through MWCC Program", "title_page": "10 Become CNAs Through MWCC Program", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DEVENS -- Ten students received certificates as certified nurses assistant from Mount Wachusett Community College at a graduation last week for a free program that pairs the certificate with continued classes for English for speakers of other languages.\n“This is a group who is focused and committed and who are going to do great things,” said MWCC President James Vander Hooven said at the graduation. “You are going to be helping people in need and you are going to be working with them in ways that make them feel better. ... I’m very proud of you, and it’s a pleasure for me to be here.”\nThe students were surrounded by family and friends as they received their certificates on Wednesday, Feb. 15, at the college’s Devens campus. This was the first group of students to complete the newly launched program. The student speakers -- Jacqueline Conte of Leominster, Katia Ferrari of Clinton and Sarai Marcial-Rodriguez of Fitchburg -- said the program has helped them move toward their dreams of helping people.\n“We have traveled together sharing the same dream,” Conte said. “We’ve had to face many difficulties, but knowing that in the end I will be helping other people will make it all worthwhile.”\nStudents in the program not only put in the hours for CNA training but also took ESOL classes two nights a week. Students said the work was tough, but worth it. The next step for students will be to take their state exam and then they will be able to work out in the community.\nEveryone was a great student, said Kijah Gordan, MWCC’s associate director of Adult Education and Training at Devens, and now they will be able to make an impact as they give back through their work.\n“You being a part of our college makes it a better place,” Gordon told the graduates. “You working in the community will make it a better place because you’re all amazing.”\nThe new program is operated at MWCC’s Devens campus by the MWCC Adult Education and Training Department in partnership with the College Workforce Development Office. It offers English language instruction that has been contextualized to the health-care field in conjunction with training to prepare students for the Massachusetts Certified Nursing Assistant Exam.\nMWCC received the Integrated English Language and Civics Education grant that funds the program from the Massachusetts Department of Elementary and Secondary Education in 2018. All student costs for the program are covered by the grant and matching funds from MWCC, including all the supplies and textbooks, making it free for the students. The clinical portion of the program was conducted at Life Care Center of Leominster.\nGrant funds will cover 20 students a year through 2020. While many students were referred from other English language programs, interested students may also inquire directly with MWCC’s Adult Education and Training at Devens by calling 978-630-9363.", "url": "https://apnews.com/369d01f74349407ab682dbdd651b35ab"}