{"authors": ["Tim Damos"], "date_download": "2020-05-04 20:12:20", "date_modify": "2020-05-04 20:12:20", "date_publish": "2019-03-20 00:45:00", "description": "With a uniquely shaped cake and several speakers Tuesday evening, officials celebrated the 175th anniversary of the founding of Sauk County. “I congratulate you on the prosperous growth of...", "filename": "_76568c7ca87d45e6830e27a7100c74fd_1588623140.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_76568c7ca87d45e6830e27a7100c74fd_1588623140.html", "title": "Sauk County celebrates 175th anniversary", "title_page": "Sauk County celebrates 175th anniversary", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "With a uniquely shaped cake and several speakers Tuesday evening, officials celebrated the 175th anniversary of the founding of Sauk County.\n“I congratulate you on the prosperous growth of this county, the businesses we have here that thrive, that you support,” said state Rep. Dave Considine, D-Baraboo. “The conservation ethic in this county, I think, is outstanding. This is hoping that this continues for a much longer time.”\nConsidine, whose district includes the eastern half of the county, presented officials with a legislative citation in recognition of the occasion, as did a representative of Democratic U.S. Rep. Mark Pocan’s office.\nThe ceremony took place at the West Square Building in Baraboo just prior to the Sauk County Board’s monthly meeting. Among an array of snacks was a cake baked by Neat-O’s Bake Shoppe in Baraboo shaped like the county.\nDuring his remarks, Sauk County Board Chairman Peter Vedro of Baraboo discussed the challenges county government faces and looked toward the future.\nHe listed several initiatives the board is likely to consider during its midterm strategic planning session next month, such as exploring the realignment of the county’s organizational structure.\nVedro listed additional priorities as the Great Sauk State Trail, expanding the county’s Criminal Justice Coordinating Council programs, more housing and workforce opportunities, departmental space needs, mental health partnerships, transparency in government and a partnership with the Ho-Chunk Nation.\n“As always, the board looks forward to continued engagement and feedback from our citizens to assist us in determining the priorities of our county government,” Vedro said.\nSauk County Historical Society President Paul Wolter provided a glimpse into the county’s past, from the 50 vertebrate and 15 mollusk species identified at Natural Bridge State Park’s Raddatz Rockshelter to the native people that first inhabited the area.\nHe also gave a detailed account of the days that followed the first county election in 1844 and the construction of a courthouse in Prairie du Sac, which the county replaced two years later following controversy over which community should become the county seat.\n“County officials held meetings in private homes until it was finished in the fall of 1845,” Wolter said of the first courthouse. “The first county board meeting was held there on October 6, 1845.”", "url": "https://apnews.com/76568c7ca87d45e6830e27a7100c74fd"}