{"authors": ["Times-Call Staff"], "date_download": "2020-05-04 20:21:49", "date_modify": "2020-05-04 20:21:49", "date_publish": "2019-03-30 16:09:58", "description": "Longmont police officers took a report Thursday of a criminal mischief that occurred near the intersection of 9th Avenue and Tulip Street. An unknown suspect threw a rock at a vehicle. Due to the...", "filename": "_c879a22c34324e9394db4889fe5d21bd_1588623709.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c879a22c34324e9394db4889fe5d21bd_1588623709.html", "title": "Longmont Police Notes: Rock Throwing", "title_page": "Longmont Police Notes: Rock Throwing", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Longmont police officers took a report Thursday of a criminal mischief that occurred near the intersection of 9th Avenue and Tulip Street. An unknown suspect threw a rock at a vehicle. Due to the lack of further suspect information, the case will be closed.\nLongmont officers responded to the 1100 block of Parker Drive on Thursday in reference to a report of criminal mischief. A 43-year-old man reported the tire of his vehicle was slashed. The case is closed.\nLongmont police investigated a theft that occurred Thursday in the 900 block of Hover Street. The case is closed.\nAt about 9:45 p.m. Thursday , Longmont officers were dispatched to a call of a motorcycle theft in the 600 block of Longs Peak Avenue. The suspect has not been identified at this time, and the case is closed.\nLongmont police responded to a theft that just occurred at about 11:30 p.m. Thursday in a parking lot of a closed business in the 500 block of Hover Street. A Longmont man had met an unknown person to sell an item and the unknown suspect stole the item without paying. The suspect fled in a vehicle that was later determined to have been stolen. There are leads in this matter and the case is open, under further investigation.", "url": "https://apnews.com/c879a22c34324e9394db4889fe5d21bd"}