{"authors": ["Deborah Strange", "Wral Digital Journalist"], "date_download": "2020-05-04 20:26:01", "date_modify": "2020-05-04 20:26:01", "date_publish": "2019-05-04 11:59:00", "description": "A man has been charged in a hit-and-run crash that injured a woman on May 4. On Tuesday, investigators announced charges against 27-year-old Jose Luis Baltazar. Baltazar was charged with...", "filename": "_a16d45cbf311158dd25898657d047107_1588623961.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a16d45cbf311158dd25898657d047107_1588623961.html", "title": "Man charged in hit-and-run that injured 28-year-old bicyclist in Durham", "title_page": "Man charged in hit-and-run that injured 28-year-old bicyclist in Durham", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A man has been charged in a hit-and-run crash that injured a woman on May 4.\nOn Tuesday, investigators announced charges against 27-year-old Jose Luis Baltazar. Baltazar was charged with felony hit-and-run involving serious injury or death and driving while his license was revoked for a DWI revocation, according to officials.\nHe is not yet in custody.\nThe victim, 28-year-old Jessica Bridgers, was struck in the 800 block of West Club Boulevard near Duke Street while riding a bicycle shortly after 1 a.m., officials said. On Tuesday, she remained in the hospital in critical but stable condition.\nAccording to a GoFundMe page, Bridgers suffered multiple broken bones and lacerations and is currently in the ICU with brain swelling.\nThe vehicle, which officials said was located on Sunday, was spotted traveling west on West Club Boulevard at the time of the crash.\nOn Sunday, an update on the family’s GoFundMe page read:\n“It’s unknown if Jess will ever be 100 percent again. Those of us who know Jessica, know how kind of a soul she has and would go out of her way to help anyone in need. She will have a long road of recovery financially and physically.”\nAnyone with information about the incident or vehicle can call the the Durham Police Department’s traffic unit at 919-560-4935, extension 29409, or Crime Stoppers at 919-683-1200.", "url": "https://apnews.com/a16d45cbf311158dd25898657d047107"}