{"authors": ["Art Kabelowsky", "Wisconsin State Journal"], "date_download": "2020-05-04 20:18:54", "date_modify": "2020-05-04 20:18:54", "date_publish": "2019-05-18 08:45:00", "description": "The WIAA Board of Control gave initial approval to a conference realignment plan for eight-player football that would place the area’s two eight-player programs in the same six-team conference as...", "filename": "_fedb83a42ac341cb9a8681a83c57fa51_1588623534.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fedb83a42ac341cb9a8681a83c57fa51_1588623534.html", "title": "Prep football: WIAA proposes realignment plan for eight-player conferences", "title_page": "Prep football: WIAA proposes realignment plan for eight-player conferences", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The WIAA Board of Control gave initial approval to a conference realignment plan for eight-player football that would place the area’s two eight-player programs in the same six-team conference as part of the South Region.\nWisconsin Heights and the Madison Abundant Life would be placed in Conference B of the South Region under the plan. The conference also would include Elkhart Lake/Glenbeulah, Oakfield, Williams Bay and Neenah St. Mary/Oshkosh Valley Christian.\nThe plan, if granted final approval on Aug. 19, would go into effect for the 2020 season.\nConference A would include La Farge, Weston, Belmont, Wonewoc-Center, North Crawford and Kickapoo. There also would be a Northeast Region, a Central Region and a Northwest Region, each consisting of two six-team conferences.\nEach conference would pair with the other conference in its region to provide crossover games.\nOf course, the number of conferences, or the number of teams in each conference, would have to grow as more schools switch to eight-player football — a trend that is expected to increase in coming years.\nThe WIAA sponsored its first official eight-player state championship series last fall, with Sevastopol beating Luck in the final, 38-30, to top an eight-team playoff field.\nOther conference alignments proposed under the new plan:\nNortheast Region, Conference A: Florence, Suring, Elcho/White Lake, Three Lakes, Wausaukee and Wabeno/Laona.\nNortheast Region, Conference B: Lena/St. Thomas Aquinas, Gillett, Gibraltar, Sevastopol, Algoma, Green Bay NEW Lutheran co-op.\nCentral Region, Conference A: New Auburn, Gilman, Alma Center Lincoln, Bruce, Chippewa Falls McDonell, Phillips.\nCentral Region, Conference B: Port Edwards, Wausau Newman, Greenwood, Plainfield Tri-County, Bowler/Gresham, Marion/Tigerton.\nNorthwest Region, Conference A: Mellen, Mercer/Butternut, Birchwood/Winter, Minong Northwood/Solon Springs, Chequamegon, Washburn/Bayfield.\nNorthwest Region, Conference B: Prairie Farm, Frederic, Clayton, Luck, Siren, Shell Lake.", "url": "https://apnews.com/fedb83a42ac341cb9a8681a83c57fa51"}