{"authors": ["Pablo Abufom", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Noam Titelman", "Sebastián Uchida Chávez", "Daniel Jadue", "Natalia Tylim"], "date_download": "2020-05-04 19:49:37", "date_modify": "2020-05-04 19:49:37", "date_publish": "2019-10-21 00:00:00", "description": null, "filename": "2019_10_chile-protests-pinera-repression_1588621777.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/10/21150850/fire1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_10_chile-protests-pinera-repression_1588621777.html", "title": "“It’s Not About 30 Pesos, It’s About 30 Years”", "title_page": "“It’s Not About 30 Pesos, It’s About 30 Years”", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "On Friday night, Chile’s right-wing president Sebastían Piñera called a state of emergency for the entire city of Santiago in response to a week of massive protests. Rejecting a planned fare increase, thousands of people have refused to pay the subway fare as part of a protest with a simple slogan: evade.\nMassive fare dodging throughout Friday took the government completely by surprise. Two of Santiago’s six subway lines were cancelled and the city’s buses soon overflowed with passengers. Police repression could do little to deter the student-led protests, and eventually thousands of workers joined in the actions. Ostensibly, this was a simply an act of defiance against price-hikes in public transportation.\nA handmade poster making the rounds on social media expressed the general sentiment: “It’s not about 30 pesos, it’s about 30 years.” It’s been roughly thirty years since 1988, when Chile began its transition from the Pinochet dictatorship to liberal democracy. Those three decades have seen restoration of civil rights, but also an extension of many of the regime’s neoliberal economic schemes.\nThe destruction of the pension system, the marginalization of the organized workers’ movement, and a volatile pattern of capitalist accumulation based on the extraction and export of raw materials — these defining features of contemporary Chile have created a deeply fragmented and unequal social life. In that same sense, the spontaneous uprising that the nation is witnessing in response to rising costs of living is not only a cry of help, it is a desperate attempt to find a political alternative.\nBy decreeing a state of emergency, President Piñera has named Javier Iturriaga, a figure from a family associated with Pinochet-era human rights abuses, as national defense chief. This fact alone reinforces the brutal reality of the situation: in Chile the dictatorship continues to permanently haunt the present.\nThe military has again taken to the street in an attempt to restore public order. But the events of Friday night and Saturday morning made clear that the Chilean people would not be cowed. Despite constant police and military patrolling, tens of thousands stood their ground in the streets, raising barricades and bonfires. Things are taking an even more radical turn: subway stations have been ransacked and set ablaze. Hundreds of points throughout the city became the site for pitched standoffs with the police.\nBy Saturday afternoon the protests had become national in scale, and the government had decided to backtrack on price-hikes in Santiago. However, by that point the fare increases were beside the point. The protests continued until 8 PM Saturday, when a curfew was declared between 10 PM and 7 AM the following Sunday morning. A measure completely without precedent (save for during natural disasters like earthquakes), this was a painful reminder of the dictatorship years.\nAll the while, the government has been smearing the protesters as part of a criminal conspiracy — a desperate attempt to downplay the spontaneous and mass-character of the protests. Around midnight in Santiago de Chile, it was clear that the curfew was unsuccessful. Thousands held their ground, erecting barricades and shouting and chanting against the president, the state of emergency, the military, and the legacy of the dictatorship. The stirring demonstration recalled the 1980s: the national days of protests against Pinochet, which then as now included the banging of empty pots as a sign of the impoverished and indebted life of the majority.\nThis weekend, the government has extended the state of emergency and curfew to Valparaíso and Concepción, two of Chile’s main cities (more cities would join in the growing wave of national disobedience on Sunday). This is just a partial response to what is now a nationwide protest, where there is hardly a corner without a barricade and bonfire, where looting of supermarkets and malls, attacks on police stations and government buildings is slowly starting to see people from all walks of life involved.\nIt would be impossible at this point to write the final word on the situation. Things are simply too volatile. One thing is certain: the government’s response has been to reach back into their only tool kit: repression and the safeguarding of private property against the threat of democracy and working-class revolt.\nThat said, there are two possible scenarios looking ahead: the government’s repression and propaganda tactics will take the upper hand, leading to a “normalized situation”; or, mass mobilization will press ahead and continue to occupy spaces throughout the nation’s cities, demanding not only a lower cost-of-living but profound political transformation. As for the first scenario, the government is alone in wishing an immediate return to social peace, and Piñera’s administration is cornered and on the defensive, plagued by its own blunders and uncertain how to withdraw the military from the street.\nAs for the second option, a general strike calling for an end to the state of emergency is already underway today. Initially announced by Chile’s principal social movements — high school student organizations and the Feminist Coordinating Committee “8M,” responsible for the Feminist General Strike — it has been joined by port workers, teachers, health workers, and construction workers, among others.\nFollowing a week of relentless popular unrest, while things may not change completely overnight, there is no doubt that mass protest has returned to Chile.", "url": "https://www.jacobinmag.com/2019/10/chile-protests-pinera-repression"}