{"authors": ["Madison Guernsey Mguernsey Journalnet.Com"], "date_download": "2020-05-04 20:07:45", "date_modify": "2020-05-04 20:07:45", "date_publish": "2019-04-07 01:52:00", "description": "POCATELLO — If they weren’t known already, guys like Isaiah Walter, Colton Belnap and Tyray Collins made names for themselves Saturday. It was lesser-known and seldom-used backups like them...", "filename": "_c4d09803ee3a41f7b5fac916ca872dee_1588622865.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c4d09803ee3a41f7b5fac916ca872dee_1588622865.html", "title": "Backups show out in ISU's first spring scrimmage", "title_page": "Backups show out in ISU's first spring scrimmage", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "POCATELLO — If they weren’t known already, guys like Isaiah Walter, Colton Belnap and Tyray Collins made names for themselves Saturday.\nIt was lesser-known and seldom-used backups like them that highlighted Saturday’s Idaho State spring football scrimmage at the ICCU Practice Field.\nWith many big-ticket players held out of the spring’s first scrimmage because of various unavailabilities, several young backups stole the show.\n“There were a lot of front-line guys that didn’t get reps today,” ISU head coach Rob Phenicie said. “We’re a veteran team, so you saw a lot of young, new faces, new names. I thought they came out and did well.”\nWalter led ISU’s whittled receiving corps with six catches and two touchdowns, Belnap nabbed an early interception, and Collins scored the day’s first touchdown with a long sprint outside the hash marks. They were among ISU’s backups who saw extended reps Saturday with the likes of Mitch Gueller, Michael Dean, Ty Flanagan and others sidelined.\nThe same was true for the defense, which shuffled its personnel to account for absent starters.\n“A guy like Michael Dean, he doesn’t need to get hit,” Phenicie said. “He’s going to get plenty of touches in the fall. … The good thing about that is you develop depth. Michael Dean didn’t take any live reps today, well Isaiah Walter and Josh Crane got a ton and that’s how you build some depth.”\nOther standouts Saturday included wide receiver Tracey Reynolds (three receptions, two touchdowns), running back Soujah Gasu (14 carries), defensive back Alec Flanagan (two pass breakups) and veteran linebacker Oshea Trujillo (one interception, one tackle for loss). All stats were kept by the Journal and are unofficial.\nGasu’s 14 carries, plus Collins’ eight rushes, provided a look at the future of ISU’s backfield. Flanagan will undoubtedly lead the charge in the fall, but the two freshmen instilled some confidence in the depth behind him.\nGasu broke off a long gain up the middle to start the scrimmage, and Collins’ first of two touchdowns came on the second-team offense’s first play, about 80 yards away from the end zone.\n“I like to see that on the offensive side of the ball,” Trujillo said. “We can have a good defense, but without the offense to mesh with us, we can’t do anything.”\nQuarterbacks Gunnar Amos and Mat Struck each played half the scrimmage with the first-team offense – though Amos’ reps came in what Phenicie called the “open-field” first half, when punts set up offensive field position. Struck’s first-team action was in the second half, when ISU started series from the opponent’s 25-yard line and in. Phenicie said that was scripted.\nUnofficially, Amos completed 8 of 12 passes, for one touchdown and two interceptions. He connected on his first five attempts of the day before throwing a pick to Belnap to end the first-team’s initial possession.\nAmos was intercepted later by Trujillo, and wrapped his day with a short TD toss to Reynolds.\nAmos favored Walter out of the slot on short routes over the middle. The pair hooked up four times – all on the first-team offense’s opening series.\nStruck, who has yielded most first-team QB reps in practice to Amos thus far, unofficially completed 5 of 13 passes, with three touchdowns and no interceptions. He found Reynolds twice on the second-team offense’s opening drive, which ended when Stuck hit Reynolds for six.\nStruck, who joined ISU during last year’s fall camp as a transfer from Riverside City College, took more deep shots than Amos, often seeking Reynolds’ 6-foot-4 frame down the sideline. He ended the scrimmage by finding Walter in the end zone on fourth down.\nAmos’ lion’s share of first-team reps this spring — and the fact he started Saturday’s scrimmage — allude to his position ahead of Struck on the depth chart. But Phenicie hasn’t declared one the starter.\n“We just wanted to see them make the right reads and, from the outset, it looked like for the most part they did the right thing and went the right way and got to the right person,” Phenicie said. “That’s what we wanted to see today, that they’re not forcing things, not doing things that they haven’t done the last two weeks.”\nSaturday’s scrimmage was the closest thing Struck has had to in-game action in over a year. He played sparingly during his final season at Riverside, and reps were hard to come by last year with Tanner Gueller and Amos commanding the offense in practice.\nStruck spoke Saturday about the progress he has made learning ISU’s system and his increased level of comfortability.\n“It felt good,” Struck said of the scrimmage. “I wasn’t like, ‘This is my read, that’s my read,’ it was more of, ‘OK, I know what I’m supposed to do, this is the defense.’ I’m kind of seeing the bigger picture now, which (offensive coordinator/quarterbacks coach Mike) Ferriter has been preaching to me.”\nAfter Walter’s six receptions and Reynolds’ three, the rest of Amos’ and Struck’s completions went to Isaiah Brimmer (two), Matt Peterson (one) and Gasu (one). Quarterback Michael Goggin played, but did not throw a pass.\nDefensively, Trujillo and Jace Richter were among the players to record unofficial tackles for loss. DJ Hagler, Caleb Brown and first-year linebacker Jared Gibson unofficially had quarterback sacks. Alec Flanagan’s pass breakups came on would-be touchdown passes.\nISU’s defense punctuated its effort Saturday with interceptions, stops in the backfield and goal-line tackles. But defensive coordinator Roger Cooper was quick to point out the offense’s explosive plays – like Collins’ long touchdown run – as an area of needed improvement.\n“We gave up some explosive plays. That’s what we’re trying to cap,” Cooper said. “So I wasn’t happy with that. … Did a decent job of getting off (the field).”\nISU resumes spring practice Tuesday at 4 p.m. The team’s next scrimmage is scheduled for April 13 at 11 a.m.", "url": "https://apnews.com/c4d09803ee3a41f7b5fac916ca872dee"}