{"authors": ["Barry Adams", "Wisconsin State Journal"], "date_download": "2020-05-04 20:16:40", "date_modify": "2020-05-04 20:16:40", "date_publish": "2019-02-18 05:00:00", "description": "Change is central to the newest entrant of the Madison area’s growing craft beer scene. Delta Beer Lab is one of the few local beer makers to use a reverse osmosis water system to transform...", "filename": "_b0bab5fe0ed24858ac5759a185393977_1588623400.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b0bab5fe0ed24858ac5759a185393977_1588623400.html", "title": "Delta Beer Lab to open Monday with brews and conscience", "title_page": "Delta Beer Lab to open Monday with brews and conscience", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Change is central to the newest entrant of the Madison area’s growing craft beer scene.\nDelta Beer Lab is one of the few local beer makers to use a reverse osmosis water system to transform Madison’s hard groundwater to something more conducive for beer.\nThe $42,000 system pushes tap water through a carbon filter and then a reverse osmosis membrane that, in essence, creates pure water and largely strips away chlorine, bicarbonates, calcium and other minerals. The process then allows brewers to reintroduce minerals to create customized water that better fits each specific beer recipe.\n“To make the best beer possible, I feel that we had to make the investment to strip it all the way down,” said Tim Piotrowski, founder of the brewery, scheduled to open its taproom on Monday. “Most of the (beer) styles we have in America came from somewhere else. We’ve Americanized them but they came from somewhere else and those places have different water profiles.”\nBut water isn’t the only thing changing at the 7,774-square-foot brewery and tap room in the Novation Campus at 167 E. Badger Road just west of Rimrock Road on the south side of the Beltline.\nThe business model and social commitment of its owners and employees could help Delta stand out by hosting political events and social issue discussions, promoting voter registration and nonprofit organizations and expanding access to craft beer without regard to gender, race or sexual orientation.\nThe business is also paying its employees a wage of at least $12.44 per hour and rewarding employees with a percentage of revenues from the tap room each month. Tipping is not allowed but glasses of beer will be about a dollar more than most other tap rooms to fund the revenue sharing program.\nThe $2 million facility, that can seat 120 people and is designed to brew about 1,000 barrels of beer in its first 12 months, includes gender neutral bathrooms while the bar is the shape of delta, the triangular mathematical sign for change.\nPiotrowski, 36, a Stevens Point native who goes by the nickname “Pio,” is a former Boy Scout, camp counselor and director and, in 2017, hiked all 2,189 miles of the Appalachian Trail. His commitment to nonprofits and social change are unwavering and are key ingredients to his operation as much as hops and barley are to the brewing process.\n“It’s just kind of ingrained,” Piotrowski said, as he stood last week in his nearly finished taproom that includes beakers, test tubes and two sinks that mimic those found in a chemistry lab. “When I had the opportunity to start my own place, I got to start it how I wanted to. We put our mission out in our business plan and I brought it up in every conversation with banks and real estate discussions. Having a safe place and treating employees right and being a positive partner in the community are all equally important to me in making quality craft beer.”\nFinding a location\nDelta Beer Lab is one of the few centrally located breweries in Madison. The original Great Dane Pub & Brewing Co. is located Downtown, Lucky’s 1313 Brew Pub is on Regent Street a few blocks from Camp Randall while Rockhound Brewing Co. is on South Park Street just west of Monona Bay. But most of Madison’s breweries or brewpubs are on the city’s East or West Sides.\nPiotrowski chose the location for Delta because it’s close to the Downtown, adjacent to the Beltline and accessible in 15 minutes from all but the city’s North Side. The facility was also more affordable than other locations in the Downtown or on East Washington Avenue and has ceilings up to 24 feet high.\nBut before Piotrowski could choose a location within Madison, he had to choose a city.\nAfter graduating from UW-Stevens Point where he studied business administration and camp management, Piotrowski moved to California to work as a director at a YMCA camp south of San Francisco.\nIn 2010, Piotrowski moved to Boulder, Colorado, and entered a brewing program with the American Brewers Guild. That led to an apprenticeship with Oskar Blues Brewery in Longmont, Colorado, and then an assistant brewers gig with Rock Bottom Brewery in Boulder and Denver. He later worked under a senior brewer at Rock Bottom’s Westminster, Colorado, location, before being promoted in 2012 to head brewer at the company’s Minneapolis location.\nA year later, he took a job with a restaurant group to build The Freehouse Brewpub in Minneapolis. By the time he left in 2017,z The Freehouse was the largest brewpub in Minnesota.\nPiotrowski considered other cities for his Delta Beer Lab but Madison quickly became his first choice from a small list. And one of his key partners in the project is Michelle “Speedy” Riehm, whom he met in college and has been a longtime friend and confidant. She’s also one of 17 investors in the project.\n“I asked questions but I was in from the start,” said Riehm, who grew up in the northeastern Wisconsin village of Kiel and has years of restaurant experience, primarily with the Topper’s Pizza chain. “We’ve known each other for a very long time and we work really well together. I trust him and I know that he’s good at the things that he does. He’s very smart so there were no doubts in my mind.”\n35 taps and plans for food\nThe taproom includes an 85 inch television that will typically be hidden by a sliding chalkboard—each of its two sections 12 feet wide and five feet high—but used only for special events like Badgers and Packers games. No food is served but there are plans for a commissary kitchen that can be used by two or three rotating food carts. The taproom has 35 taps, 24 for beer and 11 for non-alcoholic products like locally made sodas and Kombucha.\nFor now, the Delta-made beer choices include a golden ale, three different India pale ales, an English porter and a nut brown made with coffee from Kin Kin Coffee, which has a roasting facility just yards from the backdoor of the brewery.\nThe brewmaster is Barrett Lione-Seaton who works on a 10 barrel brewhouse made by Quality Tanks Solutions in Oconomowoc. Six fermentation tanks range in size from 10 to 30 barrels each while the beer cooler was purchased used after Mr. Brews closed its tap house in Madison’s Downtown.\nLione-Seaton, 34, grew up in the town of Dane and graduated from Lodi High School and Winona State University. He spent time at Oskar Blues in North Carolina and brewed in Colorado before taking a position with a company to brew beer at two brewpubs in Shenzhen, China, a city of more than 10 million people next door to Hong Kong. He’s been brewing commercially for six years and began homebrewing in 2006.\n“A big aspect for me in any job I do is that I look for what the company stands for. What are the things the brewery is going to do other than just produce great beer,” Lione-Seaton said. “I’ve always sought that out.”", "url": "https://apnews.com/b0bab5fe0ed24858ac5759a185393977"}