{"authors": ["Art Kabelowsky", "Wisconsin State Journal"], "date_download": "2020-05-04 20:05:56", "date_modify": "2020-05-04 20:05:56", "date_publish": "2019-02-14 09:35:00", "description": "The Mount Horeb boys basketball team took another giant step toward the Badger North Conference championship with a 50-45 victory over visiting Waunakee on Wednesday night. The Vikings...", "filename": "_bb7e45fcb773487bae3b86e68ab8ab8b_1588622756.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bb7e45fcb773487bae3b86e68ab8ab8b_1588622756.html", "title": "Prep basketball: Mount Horeb boys beat Waunakee to remain perfect in Badger North", "title_page": "Prep basketball: Mount Horeb boys beat Waunakee to remain perfect in Badger North", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Prep basketball: Mount Horeb boys beat Waunakee to remain perfect in Badger North\nThe Mount Horeb boys basketball team took another giant step toward the Badger North Conference championship with a 50-45 victory over visiting Waunakee on Wednesday night.\nThe Vikings (16-3, 11-0 Badger North) battled to a 25-23 halftime lead, and then held on throughout a tight second half to beat the Warriors (11-7, 6-5).\nMount Horeb got 19 points from senior Jason Larson and 16 from Gunnar Nortman.\nWaunakee senior Will Knatz scored 13 points and Josh Cash had 12.\nReedsburg 68, Baraboo 39\nJunior Will Fuhrmann scored a game-high 21 points, including five 3-pointers, as the host Beavers rolled past the Thunderbirds.\nReedsburg (11-9, 6-6 Badger North) attempted just four free throws but made 11 3-pointers, including three from sophomore Zach Bestor, who totaled 13 points.\nSenior Caden Blum had 16 points to lead Baraboo (1-18, 0-12).\nBeaver Dam 64, Sauk Prairie 46\nSophomore guard Nate Abel had 21 points to lift the Golden Beavers (12-6, 6-4 Badger North) past the Eagles (5-14, 3-8).\nSauk Prairie senior Spencer Breunig scored 14 points.\nMiddleton 57,\nJanesville Parker 55\nThe Cardinals (13-7, 10-6 Big Eight) held off the comeback attempt, picking up victory over the visiting Vikings (2-17, 1-15).\nSenior guard Jack Boyle led Middleton with 14 points. Tremar Curry scored 15 points for Parker.\nMadison Memorial 57,\nBeloit Memorial 55\nNick Caropreso had 11 points and Daemiontae Bates scored 10 to lift the Spartans (12-5, 10-5 Big Eight) past the Purple Knights (3-15, 2-12) on the road.\nSenior Terrell Ringer led Beloit, scoring 12 of his 18 points in the second half.\nStoughton 64, Fort Atkinson 36\nThe Vikings (12-8, 9-3 Badger South) took control with a 47-20 run in the first half and coasted past the host Blackhawks (3-16, 2-9).\nSenior point guard Adam Hobson led Stoughton with 12 points. Carson Baker scored nine for Fort Atkinson.\nMadison Edgewood 57,\nMonroe 54\nThe visiting Crusaders (9-10, 5-6 Badger South) had three double-digit scorers en route to picking up the victory over the Cheesemakers (10-10, 7-5).\nSenior Michael Meriggioli led Edgewood with 19 points. Monroe’s Kade King had 16 points.\nWatertown 56, Milton 52\nThe visiting Goslings (8-9, 4-6 Badger South) wiped out a six-point halftime deficit with a 37-27 spurt in the second half, beating the Red Hawks (4-15, 1-10).\nCade Oiler scored 19 points for Watertown. Milton got 12 points each from Jack Campion and Brad Bowditch.\nLakeside Lutheran 74, Watertown Luther Prep 49\nAfter opening a 38-19 lead at the half, the Warriors (14-3, 8-1 Capitol North) clinched a tie for the league title by beating the visiting Phoenix (11-7, 4-3).\nSenior forward Jack Monis scored 16 points to lead Lakeside. Micah Kieselhorst had 13 points for Luther Prep.\nLake Mills 64, Lodi 48\nThe L-Cats (14-5, 6-2 Capitol North) kept their conference championship hopes alive with their victory over the Blue Devils (9-11, 4-5).\nCharlie Bender led Lake Mills with 16 points. Lodi’s Cole Steinhoff had 14 points.\nMarshall 78, Cambridge 76 (OT)\nGabe Stewart scored eight of Marshall’s nine points in overtime to lead the Cardinals (10-7, 4-3) to a victory over the Blue Jays (3-16, 0-8).\nMarshall’s Noah Freeman hit a lay-up with 45 seconds remaining to force overtime.\nDeerfield 68,\nMadison Country Day 37\nThe Demons (6-12, 4-5 Trailways South) rolled past the Prairie Hawks (5-11, 1-7) as Carson Knapp scored 21 points and Wills Manning had 15.\nCountry Day got nine points each from Colin Green and Carl Ashworth.\nGirls\nLodi 47,\nWatertown Luther Prep 42\nThe Blue Devils (15-5, 8-2 Capitol North) clinched the league title, shooting 17-for-17 from the free throw line in their victory over the Phoenix (11-10, 3-7).\nSophomore Lauryn Milne finished with 23 points. Luther Prep’s Lauren Paulsen had 15 points.\nMarshall 74, Cambridge 41\nSophomore guard Mia Morel led the Cardinals (18-2, 9-0 Capitol South) with 20 points, helping Marshall lock up the outright league title with a victory over the host Blue Jays (6-16, 1-9).\nJunior forward Olivia Williams scored 16 points for Cambridge.\nEvansville 55, Brodhead 33\nJunior forward Paige Banks scored 19 points, leading the Blue Devils (13-8, 12-5 Rock Valley) to victory over the visiting Cardinals (10-9, 7-9). Brodhead’s Kiarra Moe scored eight points.\nAlbany 55, Barneveld 43\nThe Comets (15-5, 7-3 Six Rivers East) took a league victory over the visiting Eagles (4-14, 4-6).\nWilliams Bay 43, Madison Country Day 22\nThe host Bulldogs (5-13, 2-8 Trailways South Conference) kept the Prairie Hawks winless in league play with a runaway victory (1-18, 0-11).", "url": "https://apnews.com/bb7e45fcb773487bae3b86e68ab8ab8b"}