{"authors": ["Tom Howell Jr. The Washington Times"], "date_download": "2020-05-04 20:13:30", "date_modify": "2020-05-04 20:13:30", "date_publish": "2019-01-23 17:07:08", "description": "The federal personnel office told agencies Wednesday they should, wherever possible, make the shutdown as painless as possible for \"essential\" employees forced to work without pay, from allowing...", "filename": "_04874c289ba7cafae80cd93d6252f2f0_1588623210.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_04874c289ba7cafae80cd93d6252f2f0_1588623210.html", "title": "OPM to federal agencies: Make shutdown less painful; Consider telecommutes, flexible hours", "title_page": "OPM to federal agencies: Make shutdown less painful; Consider telecommutes, flexible hours", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The federal personnel office told agencies Wednesday they should, wherever possible, make the shutdown as painless as possible for “essential” employees forced to work without pay, from allowing them to work remotely to giving them a more flexible start or end to their workday.\nWorkers who’ve been called into duty without pay are viewed as the most sympathetic figures in the shutdown, which centers on President Trump’s demand for border-wall funding and stretched into a fifth week.\n“During this difficult time, it is prudent, to the extent possible and appropriate, for agencies to provide additional flexibility to the federal civil servants who are excepted from the furlough to perform necessary functions for the American people,” Margaret M. Weichert, acting director of the Office of Personnel Management, wrote in a memo to federal human-resources directors.\nShe said employees who aren’t receiving a paycheck may have lost subsidies for childcare or transit, too, making it hard for them to physically come into the office.\nLabor unions who are suing the federal government for immediate pay during the shutdown have mused that employees might not be able to afford the gas they need to even drive into work.\nMs. Weichert said employers should be open to requests for leave from their workers, even though they won’t be able to collect on paid vacation or other forms of paid leave until after the shutdown ends.\nWhile essential workers are performing important duties during the shutdown, there may be daylight for time off, she said.\n“Agencies are encouraged to consider the same principles that guide the granting of various types of paid leave during normal periods of funded operations, while keeping in mind any special work requirements for excepted employees during the lapse in appropriations,” she wrote.", "url": "https://apnews.com/04874c289ba7cafae80cd93d6252f2f0"}