{"authors": ["Dawn Foster", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Laura Pidcock", "Ronan Burtenshaw", "Matt Zarb-Cousin"], "date_download": "2020-05-04 19:56:39", "date_modify": "2020-05-04 19:56:39", "date_publish": "2019-08-28 00:00:00", "description": null, "filename": "2019_08_boris-johnson-no-deal-brexit-queen_1588622199.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/08/28122135/GettyImages-1170719021.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_08_boris-johnson-no-deal-brexit-queen_1588622199.html", "title": "Boris Johnson Is Shutting Down Parliament to Force Through Brexit", "title_page": "Boris Johnson Is Shutting Down Parliament to Force Through Brexit", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Chatter since Boris Johnson was installed as prime minister in Downing Street has suggested that the Conservatives have been considering proroguing parliament: shutting it down to prevent MPs from frustrating any attempt by Johnson to force through a no-deal Brexit. That rumor was confirmed today, as a gang including Jacob Rees-Mogg prepared to visit the Queen in one of her many castles, Balmoral, to ask her to undertake a prorogation.\nBritish politics swiftly descended into chaos at the announcement. One anti-Brexit campaign group, Best for Britain, issued a deeply weird statement reminding the Queen of Britain’s history of regicide: “It would make no sense for the Queen to back this deeply undemocratic, unconstitutional and fundamentally political maneuver from the government. If the Queen is asked to help, she would do well to remember history doesn’t look too kindly on royals who aid and abet the suspension of democracy.” There’s little question that the United Kingdom has lost its head collectively since the 2016 referendum result, but threatening to cut the monarch’s head off would have been seen as a step too far for centrists even yesterday.\nWhy are the Conservatives doing this? In the past few days, opposition parties have been talking about possible solutions to escape what looks to be a near certain careening lurch towards a no-deal Brexit. After the Lib Dems and hard-core Remainers realized their constant accusations that Jeremy Corbyn was a hard-line Brexiter were not remotely believed by the public, the possibility of a fragile coalition to block a no-deal Brexit looked more likely. Proroguing parliament blocks any opposition attempt to prevent crashing out of Europe with no deal and the logistical nightmare that would ensure.\nUnder the Fixed Term Parliaments Act, adopted by the Tory-Liberal Democrat coalition government in 2011, only the government can dissolve parliament to trigger an election, but proroguing remains a Royal prerogative. Thus, the Lib Dems, for all their claims to be the only party fighting against Brexit — a charge every other opposition party would point out is nonsense — should admit their role in allowing this situation to arise by passing the act in exchange for a sniff of power in the 2010 Tory-Lib Dem coalition.\nThe Conservatives have in the last few days been borrowing heavily from the playbook of the successful and hard-line Leave.EU campaign, the campaign run by billionaire Aaron Banks and current head of the new Brexit Party Richard Tice. The Tories are clearly attempting to shore up the votes they have leaked to the rival Brexit Party by aping their tactics, and are gearing up for repeating those tactics in the probably looming general election.\nFor the Left, it also means that any election will be fought exclusively on Brexit, with Leave voters warned of “betrayal” by “out of touch” Westminster politicians indifferent to the wishes of the slight majority who voted Leave. That’s a big gamble by the Conservatives. Labour, meanwhile, will have to ramp up its strengths: proposing a manifesto that doesn’t dwell on Brexit and the past, but instead puts forward a vision for how the future could be different, how voters’ lives, their children’s lives, their community’s lives, and the economy could be different.\nThe loudest voices continue to be those of the fringe voters obsessed with casting the entire country as either “Remain” or “Leave,” framing this entire psychodrama as a culture war. Most Britons aren’t as extreme as the media and political class’s view of Brexit suggests. They care deeply about their own lives, where they live, and what the future of the country might look like. The Conservatives will fight an extraordinarily negative campaign exclusively on Brexit: but Labour and the Left can tell a bigger story, and capture voters on both side of the Brexit divide.", "url": "https://www.jacobinmag.com/2019/08/boris-johnson-no-deal-brexit-queen"}