{"authors": ["Job Vigil Jvigil Nptelegraph.Com"], "date_download": "2020-05-04 20:26:52", "date_modify": "2020-05-04 20:26:52", "date_publish": "2019-02-16 09:00:00", "description": "Like in most fields of medicine, diagnosing sleep disorders can be difficult because there are a variety, said Dr. Jefrey Start, a new sleep medicine physician at Great Plains Health. Start...", "filename": "_8dcf551e4f14416789c6fb1eb454c497_1588624012.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8dcf551e4f14416789c6fb1eb454c497_1588624012.html", "title": "Great Plains welcomes new sleep doctor", "title_page": "Great Plains welcomes new sleep doctor", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Like in most fields of medicine, diagnosing sleep disorders can be difficult because there are a variety, said Dr. Jefrey Start, a new sleep medicine physician at Great Plains Health.\nStart recently began his practice at GPH and treats patients for issues ranging from snoring and insomnia to sleep apnea.\n“We really should call them sleep/wake disorders,” Start said. “If you think about it, one is sort of the flip side of the other. But it’s important to talk about it, because somebody may have a problem with their sleep, but it does not necessarily always impact their wakefulness.”\nInsomnia is one problem that may or may not impact people during their waking hours.\n“There are certain types of insomnia that are very, very annoying to people,” Start said. “But when you start to analyze their daytime sleepiness, for example, they don’t have a lot of daytime sleepiness.”\nDiscovering how people react to lack of sleep or inconsistent sleep is one tool he uses to make a diagnosis. Another important factor is the patient’s history.\n“Patients fill out a questionnaire about personal history, family history,” Start said. “There are questions about sleep/wake habits, caffeine consumption, bedtime schedule, exercise, keeping schedule the same on weekends as during the week.”\nStart said talking through the questions helps put things in context for an accurate diagnosis.\n“There’s other things other than sleep/breathing disorders,” Start said. “There’s disorders of movement during sleep: people commonly kicking their legs, movement disorders, seizure disorders during sleep, parasomnias — walking around or yelling or eating and not being aware of it.”\nIt has been found that human beings need, on average, six hours of sleep at night, Start said.\n“It’s very rare that people can get by on less than six hours of sleep,” Start said. “However, you need seven hours and 13 minutes, if you really want to get (technical) about it, to be somewhat on your average best across the population.”\nExercise and nutrition play a large part in sleep disorders.\n“It’s very important,” Start said. “There’s a ton of research going on with nutrition, and there are two hormones that we’ve studied amongst others — grehlin and leptin.”\nHe said these are two hormones that seem to be reversed when it comes to sleep apnea. Normally, grehlin increases appetite and leptin decreases appetite.\n“Their relationship in the body is reversed from what it should be or what is normally found in someone who doesn’t have sleep apnea,” Start said.\nThe hormones are directly or indirectly involved in energy metabolism and storage.\n“The bottom line is this,” Start said. “If you have untreated sleep apnea, your ability to lose weight is impaired, your ability to store excess energy as fat is promoted.”\nThere are different levels of sleep disorders.\n“It’s a wide spectrum,” Start said. “Snoring is at one end; something called obesity-related hyperventilation syndrome is at the other end, which is like super Godzilla obstructive sleep apnea.”\nAll these things are about airway resistance, Start said, and they tend to be affected by weight.\n“That doesn’t mean you have to be overweight to have one of these airway resistance things,” Start said. “But weight seems to be the No. 1 factor when you look at everyone who has sleep apnea or snoring.”\nStart said it is important to get an accurate diagnosis from a physician because everybody is different.\n“We recommend to everybody common-sense things again,” Start said. “Get your body mass index below 25, try to avoid sleeping on your back, among other things.”\nHe said doctors also look at the patient’s apnea hypopnea index, which is the average number of breathing disruptions per hour of sleep.\nApnea refers to episodes in which a person stops breathing. Hypopnea is overly shallow breathing or an abnormally low respiratory rate.\n“If that AHI number is above 5 and less then 15 per hour, you have to ask another question,” Start said. “Does (the patient) have any comorbidities like diabetes, depression, anxiety, coronary artery disease, any other real hardcore sort of diagnosis — then they should be put on a machine.”\nFor more information on the GPH sleep medicine program, go to gphealth.org/services/sleep-medicine or call 308-568-3500.", "url": "https://apnews.com/8dcf551e4f14416789c6fb1eb454c497"}