{"authors": ["Ignacio Laguarda"], "date_download": "2020-05-04 20:27:33", "date_modify": "2020-05-04 20:27:33", "date_publish": "2019-01-18 00:23:26", "description": "STAMFORD — Dannel Malloy knew he was going to a surprise party Thursday night, he just didn’t realize the party was for him. Malloy became the 76th person to be awarded the Stamford Citizen...", "filename": "_1db3536fe35e4fc09ead097f598b9a8d_1588624053.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1db3536fe35e4fc09ead097f598b9a8d_1588624053.html", "title": "‘I’m totally surprised’", "title_page": "‘I’m totally surprised’", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "STAMFORD — Dannel Malloy knew he was going to a surprise party Thursday night, he just didn’t realize the party was for him.\nMalloy became the 76th person to be awarded the Stamford Citizen of the Year honor as he walked into the kitchen of his son’s home. The former governor of Connecticut and mayor of Stamford thought he was walking into a surprise party for his daughter-in-law Christina.\nInstead, a shocked Malloy realized he had become the winner of the annual award.\n“I’m totally surprised. It’s very nice,” he said.\nMalloy said he’s gone to many of the previous COTY dinners, but didn’t expect to be going as a recipient for the first time.\nBoard of Finance member and longtime city volunteer Dudley Williams, who won the last COTY award, said Malloy was a great choice for the award this year.\n“I think for most of his life, he’s been involved in some way in service to the city and his impact has been positive in a really transformative way,” he said. “I can’t think of anyone more deserving.”\nWilliams said Malloy spearheaded an economic revival for Stamford during his 14 years as mayor as well as the turnaround of the downtown.\nSpeaking from his son’s home, Malloy said he left Connecticut in a better place than when he took over the governorship in 2011.\n“I think the state’s on a much better trajectory today than it was. I’d rather be coming in as governor this January as opposed to eight Januarys ago,” he said.\nThe former mayor said he drove by the Charter Communications building, under construction, on his way to his son’s Shippan home on Thursday. He sees such partnerships as part of his legacy.\n“That’s a company that we brought to Connecticut, so I’m very proud of it,” he said.\nMalloy, who recently stepped down from public office, served as the 88th governor of Connecticut, from 2011 to 2019, and was Stamford’s mayor from 1995 to 2009.\nPrior to becoming mayor, Malloy served on the Stamford board of finance from 1984 to 1994. A graduate of Boston College Law School, Malloy began his legal career in New York as an assistant district attorney before moving back to his hometown.\nRick Redniss, also a past COTY winner, said few, if any, have deserved the award more than Malloy.\n“In my opinion, no one has done more and sacrificed more time and effort on behalf of so many citizens of Stamford for so many decades than Dan Malloy,” Redniss said.\nMalloy joins J. Walter Kennedy, Julius M. Wilensky, and Thomas C. Mayers as the only Stamford mayors to have won the COTY award.\nSponsored by Post 142 of the Jewish War Veterans, the COTY honor has been bestowed upon Stamford citizens since 1945.\nStamford’s current mayor David Martin was also effusive in his praise for Malloy’s work and legacy in Stamford.\n“Dan has demonstrated his great love for our community, both in his official duties and as an advocate for numerous organizations,” Martin said. “If it were not for him, we would not have the UConn dormitories, Fairfield County Hospice House, the revitalized Mill River Park, Leone Park and the faithfully restored Old Town Hall.”\nMalloy is the youngest of eight children, all Stamford natives. He has three sons: Dannel, Benjamin and Samuel.\nAfter leaving the governor’s residence Malloy and his wife Cathy moved to Essex. He is commuting to Boston College Law School where he is serving as its fifth Rappaport Distinguished Visiting Professor of Law.\nThe Stamford Citizen of the Year dinner will be held this spring.", "url": "https://apnews.com/1db3536fe35e4fc09ead097f598b9a8d"}