{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:07:02", "date_modify": "2020-05-04 20:07:02", "date_publish": "2019-04-11 10:37:46", "description": "Zach Jacobs won his first game as Tewksbury High's boys lacrosse coach, as the Redmen easily got past Lowell Catholic, 11-3, during a non-league meeting Wednesday. Boys lacrosse In...", "filename": "_33333ae9bb0b4b4ea2ce034d9eb2ff48_1588622822.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_33333ae9bb0b4b4ea2ce034d9eb2ff48_1588622822.html", "title": "Jacobs Wins First Game at Tewksbury", "title_page": "Jacobs Wins First Game at Tewksbury", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jacobs Wins First Game at Tewksbury\nZach Jacobs won his first game as Tewksbury High’s boys lacrosse coach, as the Redmen easily got past Lowell Catholic, 11-3, during a non-league meeting Wednesday.\nBoys lacrosse\nIn other action, Hollis-Brookline topped Alvirne, 13-5.\nTewksbury 11\nLowell Catholic 3\nJosh Sughrue collected 3 goals, while Derek Schumaker and Kyle Darrigo each notched 2 goals to power the Redmen.\nAdding a goal each were Dylan Scott, Pat Rosemond, Jason Cooke and Colby Brown.\nShawsheen 14\nMinuteman 3\nDan Lee sparked Shawsheen Tech’s potent offense with 2 goals and 3 assists.\nConor Looney netted 4 goals for the Rams (4-0).\nOwen Sullivan and Dylan Timmons potted 3 goals each, while Dave Fraser scored 2 goals and had 1 assist.\nJonah Varallo (6 saves) earned the win in net.\nMarblehead 10\nWestford 7\nCam Barisano and Pressly Meade scored 2 goals each for Westford during this non-league game Tuesday.\nJason Bunyon and Matt Curran each notched a goal and assist, while Nate Arsenault fired home 1 goal.\nEssex Tech 15\nNashoba Tech 2\nJunior middie Matt Lucozzi scored both goals for the Vikings (1-2), while goalie Kyle Besjardin was superb in making 28 saves.\nHollis-Brookline 13\nAlvirne 5\nDespite a strong defensive performance in Hudson, the Broncos fell to Hollis-Brookline.\nDylan Bliss played a solid game for Alvirne and scored 2 goals.\nAlgonquin 17\nGroton-Dunstable 2\nSenior attack Nathan Townsend scored both goals in the losing effort. Also playing well was goalie Declan Nash, who turned away 14 shots.", "url": "https://apnews.com/33333ae9bb0b4b4ea2ce034d9eb2ff48"}