{"authors": ["Jamie Duffy"], "date_download": "2020-05-04 20:09:20", "date_modify": "2020-05-04 20:09:20", "date_publish": "2019-05-11 05:00:01", "description": "When police officers tracked down a man suspected of stealing numerous bicycles from the Purdue Fort Wayne campus, the man's mother was at the Broadway apartment they shared. \"Does this have...", "filename": "_625e54e30ac84d57b77c5e53638134f6_1588622960.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_625e54e30ac84d57b77c5e53638134f6_1588622960.html", "title": "Police make arrest in string of campus bike thefts at PFW", "title_page": "Police make arrest in string of campus bike thefts at PFW", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "When police officers tracked down a man suspected of stealing numerous bicycles from the Purdue Fort Wayne campus, the man’s mother was at the Broadway apartment they shared.\n“Does this have anything to do with a bike?” she asked the officers, according to court documents.\nCody Lee Lewis, 27, of the 2100 block of Broadway, had a penchant for men’s black bicycles, particularly the expensive ones, which is why he would sometimes steal one outside campus dorms and swap it for another.\nLewis didn’t like Mongooses, for instance, because they were cheap, he said.\nHe reportedly used a set of bolt cutters he kept inside his gray backpack, and sometimes the cutters weren’t good enough to cut a lock. That apparently didn’t deter Lewis who would go on to the next one, court documents allege.\nThe thefts began March 15 with a black Hyper with red letters. Later, Lewis told an officer, the Hyper was the same bike he was riding in Wells County on March 20. He’d been released from the Noble County Jail and, since no one came to the jail to get him, he got a ride from a Noble County officer to LaOtto. From LaOtto, he walked to Fort Wayne.\nHe decided he was going to leave Fort Wayne to start a new life in another state. He walked to the PFW campus, stole the Hyper bicycle and started to ride south, where he was stopped by Bluffton police. When Bluffton police discovered the bike was stolen, he was released and given a ride back to Fort Wayne by a Wells County officer, he said.\nIt was one of a few stories Lewis told the officers, describing events surrounding the theft of eight bicycles from the campus bike racks in two months.\nMost of the thefts were caught on camera, and officers there tried to keep track of the thief they described as skinny, wearing a sock hat and tennis shoes, court documents said.\nOn Tuesday, police received a tip on Lewis’ address and when police arrived at his Broadway apartment, a bike stolen from PFW was by the front step. The bike, a black Hummer Global, had a PFW bike registration tag on the top of the frame.\nLewis skipped out of a scheduled police interview Thursday, police said, but was apprehended the same day around 3:45 p.m. near Lawshe Drive and Crescent Avenue after stealing a different bicycle from campus.\nPolice asked him about the Hummer bike and he denied taking it, saying that it would just add more charges to the list. Later he admitted taking it but didn’t recognize the name “Hummer,” he said.\nLewis was charged with eight counts of theft with a misdemeanor charge for resisting law enforcement. He was being held at the Allen County Jail in lieu of $20,750 bail.\nHe has a court hearing Wednesday.\njduffy@jg.net", "url": "https://apnews.com/625e54e30ac84d57b77c5e53638134f6"}