{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:15:22", "date_modify": "2020-05-04 20:15:22", "date_publish": "2019-12-16 15:32:46", "description": "A look at some of the key business events and economic indicators upcoming this week: HOUSING BELLWETHER Builders have stepped up new construction as sales have accelerated this...", "filename": "_02f2a447665a0bc914dd34a161d92d72_1588623322.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_02f2a447665a0bc914dd34a161d92d72_1588623322.html", "title": "This Week: Housing starts, Nike results, US GDP", "title_page": "This Week: Housing starts, Nike results, US GDP", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A look at some of the key business events and economic indicators upcoming this week:\nHOUSING BELLWETHER\nBuilders have stepped up new construction as sales have accelerated this year.\nNewly started residential construction projects increased to a seasonally adjusted annual rate of 1.31 million in October. Economists project that housing starts accelerated to 1.33 million last month. The Commerce Department issues its November tally of housing starts Tuesday.\nHousing starts, monthly, seasonally adjusted annual rate:\nJune 1,233,000\nJuly 1,204,000\nAug. 1,375,000\nSept. 1,266,000\nOct. 1,314,000\nNov. (est.) 1,330,000\nSource: FactSet\nJUST DO IT AGAIN\nWall Street expects another solid quarterly report card from Nike.\nAnalysts predict the athletic apparel company will report Thursday that its fiscal second-quarter earnings and revenue increased from a year earlier. Investors will be listening for a sales update. Last month, Nike said it would stop selling its wares directly to Amazon and focus on its own site and apps.\nSLIGHT GDP BUMP?\nThe Commerce Department delivers its final estimate of third-quarter economic growth Friday.\nEconomists expect that the economy, as measured by the gross domestic product, grew at a 2.1% seasonally adjusted annual rate in the July-September quarter. Solid consumer spending has helped keep the economy growing amid a global slowdown and U.S. trade conflicts.\nGDP, seasonally adjusted annual rate, by quarter:\nQ2 2018: 3.5\nQ3 2018: 2.9\nQ4 2018: 1.1\nQ1 2019: 3.1\nQ2 2019: 2.0\nQ3 2019 (est.): 2.1\nSource: FactSet", "url": "https://apnews.com/02f2a447665a0bc914dd34a161d92d72"}