{"authors": ["Samuel Farber", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Luke Elliott-Negri", "Paul Heideman"], "date_download": "2020-05-04 19:51:55", "date_modify": "2020-05-04 19:51:55", "date_publish": "2019-06-28 00:00:00", "description": null, "filename": "2019_06_revolutionary-socialism-party-electoral-strategy-independence_1588621915.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/06/28154647/GettyImages-2669544.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_06_revolutionary-socialism-party-electoral-strategy-independence_1588621915.html", "title": "What Revolutionary Socialism Means to Me", "title_page": "What Revolutionary Socialism Means to Me", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Many years after having vanished, socialism is back in the US political arena. This is because of the election of Donald Trump as president in 2016 as well as Bernie Sanders’s campaign for the Democratic Party nomination. Even the more forbidden term “revolution” has made a comeback recently, with Sanders’s call for a political revolution to implement a progressive agenda of job creation, wage increases, protection of the environment, and universal health care. The popularization of socialism and Sanders’s call for a political revolution has raised the question of how to respond for the Marxist left. To do so, it would be useful to outline the fundamental characteristics of the Marxist revolutionary tradition, a tradition that helps provide some guidelines to an appropriate response to the new political situation in the US. For Marxists, Sanders’s progressive agenda is worth fighting for, in as much as it represents a stand against the neoliberal social agenda implemented by Democrats and Republicans alike since the 1970s. Their participation, however, is informed by the distinctive view that, in order to win those struggles, it is necessary to go far beyond the ballot box and take them into the workplaces and neighborhoods of America, to “socialize” those struggles and turn them into a movement from below, independent of the two parties. Marxist socialism seeks to articulate these and other progressive struggles — against racism and imperialism and for immigrants and refugees — into a long-term view of systemic change: a social revolution that brings down the economic and political system founded on the profit motive, capitalism, and replaces it with a politically and economically democratic one.\nMarxist Views of Revolution For many people, the term “social revolution” conjures the image of a sudden explosion of armed insurrection. An analog of this view exists within the revolutionary tradition, best exemplified by Che Guevara, for whom revolution only meant insurrection. So it did for the whole revolutionary Cuban leadership in the 1960s, which insisted that “the duty of the revolutionary was to make the revolution.” Che Guevara took this notion to its extreme by rooting revolution on sheer voluntarism, the sheer will for armed insurrection and relegating the objective circumstances, the concrete situation on the ground, to a marginal role. But revolution involves much more than armed insurrection. It involves fighting political battles for reforms to advance the interests of working people, mobilizing and organizing them to open up revolutionary possibilities. In further contrast to Guevara (and other voluntarists like Mao Zedong), the objective situation plays a central role in the process leading to insurrection. This view is best articulated by V.I. Lenin: To the Marxist it is indisputable that a revolution is impossible without a revolutionary situation; furthermore, it is not every revolutionary situation that leads to revolution. What, generally speaking, are the symptoms of a revolutionary situation? We shall certainly not be mistaken if we indicate the following three major symptoms: (1) when it is impossible for the ruling classes to maintain their rule without any major change; when there is a crisis, in one form or another, among the “upper classes,” a crisis in the policy of the ruling class, leading to a fissure through which the discontent and indignation of the oppressed classes burst forth. For a revolution to take place, it is usually insufficient for “the lower classes not to want” to live in the old way, it is also necessary that “the upper classes should be unable,” to live in the old way; (2) when the suffering and want of the oppressed classes have grown more acute than usual’ (3) when, as a consequence of the above causes, there is considerable increase in the activity of the masses, who uncomplainingly allow themselves to be robbed in “peace time,” but in turbulent times, are drawn both by all the circumstances of the crisis and by the “upper classes” themselves into independent historical action. In contrast to the Guevara-Mao view of revolution at the voluntaristic end of the Marxist spectrum stands the determinist view of Karl Kautsky, who in his The Road to Power (1909) wrote: “The Socialist party is a revolutionary party, but not a revolution-making party. We know that our goal can be attained only through a revolution. We also know that it is just a little in our power to create this revolution as it is in the power of our opponents to prevent it. It is no part of our work to instigate a revolution or prepare the way for it.” For Kautsky, a prominent theoretician of the German Social Democratic Party, revolution was the automatic result of objective conditions that inevitably led to it (although in other occasions he wrote about it with a different tone). History, however, has contradicted Kautsky’s passive evolutionary view. Although revolutions have been preceded by deep social and political crisis, it was not inevitable or predetermined which side would end up winning; their outcome depended not only on the depth of the crisis and the social support for each of the clashing sides, but also on how effectively the contending forces were led, organized, and conducted themselves. Contrary to Kautsky’s unilinear evolutionism, social, economic, and political conditions may make revolutions more likely, but they do not guarantee their victory over historical reaction. Applied to the present conditions, Kautsky’s passive perspective, which in the classic German case placed an exaggerated emphasis on the growing parliamentary representation of the SPD, would downplay the response of the ruling classes to the movement, ranging from lies and propaganda against it in order to weaken it by sowing division and confusion, to government surveillance, provocation, and repression — such as the Palmer Raids which deported large number of radicals in the US after World War I, or McCarthyism after World War II — which might force the movement into a clandestine existence with far more limiting conditions for political life. Political conditions in democratic capitalism are certainly more favorable for political organization, but they cannot be taken for granted, and their prospects might well decline, as is now happening in this era of right-wing governments such as those existing in Hungary, Poland, Turkey, and in the Western capitalist democracies, including the US. In contrast to Guevara and Kautsky’s thought, revolutionary socialist politics requires strategic and tactical thinking and action long before a revolutionary situation arises, in order to strengthen the working class and the socialist movement to respond appropriately to the revolutionary situations that otherwise could be resolved in favor of the forces of reaction. A tragic example of the lack of preparation to respond to such critical situations was General Augusto Pinochet’s coup in Santiago, Chile, on September 11, 1973, when President Salvador Allende’s unconditional commitment to parliamentarism led to the crushing of democracy and the Chilean left. As Kautsky recognized in his writings but never integrated into his perspective, the ruling classes will do everything and anything to prevent the success of a revolution, even after they have been initially defeated.\nRevolutionary Socialism in a Nonrevolutionary Situation The United States is very far from being in a revolutionary situation of any kind. However, there are serious problems affecting vast sectors of the population. In contrast with the “thirty glorious years” that followed the end of WWII, the majority of the US population has been experiencing a progressive deterioration in their living circumstances. As author Ben Fountain put it recently, Americans are working harder than ever for a steadily shrinking share of the rewards as shown by the data on wages, income inequality, household wealth, and class mobility, a reality that is also confirmed by the metrics of life expectancy, maternal and infant mortality, and in deaths from “the diseases of despair” like opioids and suicide. Add to this other sources of oppression like police brutality and massive incarceration, among other forms of racial discrimination. These changes open the road for substantial radicalization on the Left even if these do not result in a revolutionary situation. In response, popular movements have been taking shape like the Black Lives Matter movement. The #MeToo movement has brought to the surface the long-standing problem of gender inequality and oppression. The numerous and inspiring teachers’ strikes, especially in the most politically conservative states in the union, constitute another promising response that points to the possible rebirth of a labor movement that never recovered from the employer and government offensive since the late 1970s. (One front where, unfortunately, there has been no popular engagement since the massive protests against the mounting efforts of the Bush government to invade Iraq on February 2003, is the foreign front, desperately needed particularly at a time when the Trump administration is beating the drums for war with Iran.) For revolutionary socialists, it is crucial to actively participate in those and other progressive movements, even if limited to the terms of what those movements seek to achieve. And to do so by highlighting the connections of one social grievance to other social grievances and to the social system — capitalism — as a whole, underlining the systemic nature of the different kinds of oppression against which each of those movements are fighting. Along the lines of Marx and Engels 170 years ago, the socialist movement must “fight for the attainment of the immediate aims, for the enforcement of the momentary interests of the working class, but in the movement of the present they also represent and take care of the future of that movement.” In that process, along with other socialists, socialist revolutionaries oppose as divisive and distracting any attempt to blame other workers, at home and abroad, or poor people like welfare recipients who are victims of capitalism, pointing instead to the profit system as the fundamental source of their problems. And they insist on measures to remedy present and past racial discrimination, including reparations. The same political spirit and logic applies to gender and other forms of discrimination. But what distinguishes the politics of revolutionary socialism in terms of their participation in today’s struggles is its refusal to compromise the organizational and political independence not only of working-class organizations, but more generally of the social movements of the oppressed, a method and approach that is applicable to a wide variety of political situations ranging from the workers struggle with employers to electoral politics. This is paramount to preserve those organizations and movements as independent agents and to prevent them from being co-opted and diverted into supporting the politics and priorities of their opponents. What follows are examples of how this method applies in the arenas of 1) the labor movement, specifically regarding labor-cooperation schemes, and 2) political activity, specifically regarding elections and participation in Democratic Party politics.\nIndependence of the Labor Movement The starting assumption of an approach putting the independence of the working class at the center is that unions cannot concern themselves, and much less attempt to guarantee, the profitability of the enterprises for which their members work. That includes participating in co-management schemes with employers, which, in practice, involves accepting responsibility without getting any real power in decision-making, and compromising in the process the union’s organizational independence. The paradigmatic case of labor-management cooperation is the United Auto Workers (UAW) collective bargaining agreement with Chrysler in October 1979. This new contract included a supposed concession by Chrysler Corporation accepting the appointment of UAW president Doug Fraser as member of the company’s board of directors. As described by Labor Notes at the time, the international union, along with Lee Iacocca, the head of Chrysler, issued a joint statement to the press warning that the company would go bankrupt and that the workers would lose their jobs if they did not partake in the pain and contributed with their own share of sacrifice. Besides new contract language making it easier for the company to discipline workers with poor attendance records or for “abusing” sick leave, this sacrifice amounted to a $203 million donation (or $2,000 per worker) by Chrysler employees. This was a small amount compared to what Chrysler was going to receive from government-backed loans, sale of preferred stock, state and local tax relief, and joint ventures. But neither Democratic president Jimmy Carter nor the Democratic-controlled two houses of Congress would agree to a bailout without the workers accepting significant sacrifices. Sixty nine percent of the workers accepted the concessionary agreement based on the notion that “half a loaf was better than none,” although in the end that meant that they ended up paying to avoid a capitalist bankruptcy for which they were not responsible. Meanwhile, by joining the board of directors, the union leadership ended up accepting political responsibility for that denouement. In the decades to come, that 1979 concessionary agreement would come to look relatively mild as the union continued to accept ever worsening agreements with features such as two-tier wages for new hires. And it initiated a concessionary wave that spread throughout the whole economy, in many cases involving corporations that did not have a credible claim of economic hardship but that used that false claim to extract concessions from their employees. One could say that the 1979 UAW agreement that co-opted the union into its board as the policeman of its own members in the name of cooperation was the result of the defensive position in which the union was put by the likely bankruptcy of the enterprise and the loss of thousands of jobs of its members. (Although the union, could have, for example, attempted to organize a national campaign for a political solution forcing the government to intervene to protect the contractual rights of the workers — which it did not do.) But there are labor-capital cooperation proposals in contexts more favorable to labor that are coming from the Left itself. This is the case for example, with the British Labour Party’s Jeremy Corbyn, whose government program, if he were elected to office — an undoubtedly big victory for the Left and the working class — would ask every company with 250 or more employees to create an “inclusive ownership fund” (IOF) involving shares for the workers in each firm into which the company would transfer at least 1 percent of their ownership each year, up to a maximum of 10 percent. As a result, almost 11 million workers would end up receiving up to 500 pounds in dividends every year. The Labour Party estimates that 10.7 million people — or 40 percent of the private sector labor force — would initially be covered by the plan with workers’ fund representatives having voting rights in their company’s decision-making processes similar to that of other shareholders. Yet far from representing a 10 percent advance on the road to socialism, this legislation would do the opposite. It would further incorporate the working class into capitalism, since the unions, in exchange for a rather small income increment for its members, would end up assuming corporate responsibilities as members of the boards of directors, of which they would in any case constitute a small minority. In political and social-psychological terms, this proposal would also significantly increase the workers’ identification with “their” company in exchange for minimal influence, at best, in corporate decision-making. Instead of investing major political capital in this legislation, the new Labour leadership, if victorious, could use its newfound clout to increase independent working-class power by beginning to reverse the drubbing that unions took under the Thatcher and Blair governments by restoring at least some of their lost institutional power, without compromising, as Corbyn’s proposal does, the political and organizational independence of the working class.\nThe Issue of Compromise The negative consequences of Corbyn’s plan would have been the same even if it had proposed, as a compromise, a 40 percent instead of the 10 percent increase in their company’s shares (Elizabeth Warren has proposed a similar plan, which will be emulated by Bernie Sanders’s coming proposals.) But this does not mean that Marxist socialism is in principle opposed to compromise. Revolutionaries do not reject compromise as such, but instead focus on what the specific compromise entails, in this case as it regards union independence. In a collective-bargaining situation or in a strike, a union might be forced to agree to accept less than it originally demanded for its members, given that the balance of power at that point in time has tilted in favor of the boss. That is one kind of compromise. Another, qualitatively different, compromise involves the union’s agreement to the employer’s proposal to establish labor-management productivity committees, reduce the union’s ability to communicate with its members inside the plant, or to participate in advertising campaigns against the firm’s competitors. The first compromise would not jeopardize the union’s organizational independence and preserve its ability to continue fighting for a better contract in the next round (or for fighting to enforce the new contract in the best interests of its members). The second type of compromise would jeopardize the independence of the union and its class alignment.\nIndependent Political Activity, Elections, and the Democratic Party For some 150 years, the Left has been divided with respect to elections in liberal capitalist democracies. At one end, anarchists and various kinds of leftists have refused to participate in elections for fear of legitimating and furthering illusions on the willingness of the capitalist state to allow fundamental structural reforms, and on a parliamentary road to socialism. At the other end is the far more influential tendency on the Left to consider the parliamentary system all powerful and parliamentary politics as the main if not only form of political struggle. Since the late nineteenth century, German Social Democracy has classically embodied this attitude, which in conjunction with the extreme adventurism and sectarianism of the Stalinized German Communist Party opened the road for Hitler’s rise to power. Karl Marx captured the essence of this political phenomenon in The Eighteenth Brumaire of Louis Bonaparte under the term “parliamentary cretinism” that he coined to describe “that peculiar malady which since 1848 has raged all over the Continent … which holds those infected in it in an imaginary world and robs them of all sense, all memory, all understanding of the rude external world.” Although revolutionary socialists have no illusions about the parliamentary road to socialism, it is important for them to participate in elections supporting independent and socialist candidates because during the electoral period, people are more likely to pay attention to political issues and even participate in political organizations, thereby compensating for the political apathy and atomization typical of capitalist democracies in economically developed countries. Access to the mass media during electoral campaigns adds the further advantage of allowing left-wing candidates to argue for their policy proposals to far wider audiences. We are now witnessing the growth of progressive and left movements that have led to the election of their representatives to those offices. The opportunities for those elected officials to use their positions as public platforms to propose and mobilize for left-wing legislation are obvious, as we’ve seen with the impact of Congresswoman Alexandria Ocasio-Cortez on the media and public opinion with her proposals like the Green New Deal. But the electoral history of the Left is fraught with examples of elected officials being unable to resist the blandishments and wheeling and dealing of “normal” politics and to remain faithful to the politics with which they ran for office. As Seth Ackerman put it in an interview with Jacobin: “any politicians that we managed to elect are going to find themselves under a lot of pressure to find alternative sources of support and therefore to pursue alternative policies to the ones that we want them to pursue.” This is the sort of situation that compelled the New York chapter of the Democratic Socialists of America (DSA) to criticize Alexandria Ocasio Cortez’s endorsement of neoliberal Andrew Cuomo for governor of New York in the 2018 elections. The newly elected socialist politicians will also be subject to other, subtler, pressures: used to the very austere, if not disheveled, world of the left movements, or even to the mostly clean, efficient, but not necessarily luxurious world of independent nonprofit organizations and NGOs, they begin to operate in a world of power over assistants, office staff, budgets, and office paraphernalia often located in impressive, even august, government buildings. In the normal course of legislative and government work, they begin to meet important people, who in turn are the source of invitations to high-level social functions and parties, opening the door to an often-glamorous social milieu previously barely discernible if not entirely unimaginable. The newly minted socialist officeholder will find common ground with decent legislators and government functionaries who, like themselves, are displeased by the corruption ongoing in the legislative and executive bodies but who don’t have a single radical political bone in their bodies. And they will also come to realize that many liberal and even conservative legislators they meet are not so personally repelling as they had imagined. In the end, all of this may well end up co-opting the socialist officeholders. The possibility of that happening is magnified when the elected socialist representatives are not directly responsible to the people who elected them and to the socialist organizations that selected or supported them as candidates. That is why revolutionary socialism insists on the importance of remaining alert to the political behavior of their elected officials by the mobilized base of those who voted for them, and to the need for some sort of democratic discipline that holds the elected candidate responsible to the organizations’ political guidelines. Ideally, the candidate must be nothing more and nothing less than an expression of the politics of the organization that democratically selected her to run for office. It is in that vein that parties in the socialist tradition have taken organizational measures such as insisting that the elected officeholders turn over their government salaries to the party’s coffers, and to compensate them with a salary comparable with that of a skilled worker, an efficient way to reduce the social distance between the representatives and their electors.\nThe Democratic Party The Democratic Party has long been called the “graveyard” of progressive and radical movements in the labor, civil rights, and peace arenas. The classic example is what happened to the militant and radical Congress of Industrial Organizations (CIO) of the 1930s, which was gradually domesticated by its wholesale entry into Democratic Party politics. The Democratic Party’s deadening impact is primarily due to the fact that it is a party that fundamentally reflects the interests of capital. As Lance Selfa shows in his book The Democrats: A Critical History, important sectors of capital contributed similar, if not higher, sums to the Democratic than to the Republican Party in the 2008 elections. Contributions to the Democratic Party included 45 percent of all the funds contributed to the election by agribusiness, 68 percent of all the election contributions from the communications and electronics sectors, 52 percent from defense, 55 percent from finance, insurance, and real estate, 54 percent from health, 74 percent from lawyers and lobbyists, and 55 percent from miscellaneous businesses. In the 2016 presidential election, while total spending on behalf of Trump’s election from all sources totaled a little more than $861 million, Hillary Clinton’s campaign raised $1.4 billion. With the possible exception of 1964, the Clinton campaign surpassed any other campaign since the New Deal and obtained financial support from sectors and firms that have rarely supported any Democrat. Undoubtedly, Hillary Clinton, not Trump, was the presidential candidate supported by the majority of the capitalist class. Moreover, it cannot be claimed that the Democratic Party chiefly represents the liberal wing of the capitalist class. Only a wing of the Democratic Party’s elected representatives can be called liberal; a few conservatives and a very large number of neoliberals account for an ample majority of its officeholders, although the liberal wing — with the addition of a number of socialists — has grown substantially as a result of the 2008 recession, Bernie Sanders’s campaign, and the Trump presidency. Insofar as its internal organization is concerned, the Democratic Party is led by the Democratic National Committee, which as Selfa explained, is “composed of hundreds of elected politicians, union leaders, lobbyists, and campaign donors, [which] exists mainly to raise money for Democratic candidates. Its role in policy making or determining the direction of the party is fairly minimal. In essence, the Democratic Party is a loose federation of candidate-based local and state electoral machines.” Thus, in reality, the Democratic Party is not a party in the usual sense of the term involving a membership that decides the party’s policy through internal deliberations and decision-making. The only thing resembling a Democratic Party program is the platform it adopts before every presidential election. Even then, Democratic candidates at the federal, state, or local level are free to ignore, and for the most part do ignore, their party’s platform when they are running for office. Another important characteristic is that those who register as Democrats at election time do not elect their own party leaders. That is why, in spite of having won twenty-three state primaries in the period leading to the 2016 elections, Bernie Sanders did not end up representing and leading the Democratic Party in any of those states. These characteristics of the Democratic Party make it totally impervious to any attempt by many American leftist leaders in the past to “take it over.” Unlike the British Labour Party where its members directly elect their leaders, as they recently elected left-wing Jeremy Corbyn, it is impossible to do so in the Democratic Party, which is not a membership-based party. Despite agreeing with the previous arguments, many would still argue that Democrats should be supported because they represent a lesser evil. But this argument, brandished for quite a few decades, presents several problems. Historically, the supposedly “lesser evil” has sometimes turned out to be the larger one, as was the case of the 1964 election in which Lyndon Johnson, the Democratic Party “lesser evil” winner over really evil Barry Goldwater, significantly escalated the war in Vietnam with the number of US troops surpassing half a million. It is unlikely that Barry Goldwater could have outdone Johnson’s massive deployment of US troops, use of Agent Orange and strategic hamlets, by unleashing massive nuclear warfare in Vietnam, if for no other reason that such an act might have very likely provoked a war with the USSR and/or China. In terms of domestic policy, it was the explosive black protests in the streets of America, and not Johnson’s politics, that brought about big gains, such as the Civil Rights Act of 1964. In the midst of the incendiary situation prevailing in the country in 1964, Senate Republican minority leader Everett Dirksen and his caucus felt obliged to respond to black demands by joining Johnson in preventing the white racist Southern Democrats from filibustering the Civil Rights Act. “Lesser evil” political accounting has always limited itself to a very short-run perspective — and has ended up contributing to the very conditions leading to the success of a “worse evil.” Hillary Clinton represented the “lesser evil” alternative to “evil evil” Trump, but it was Clinton’s own neoliberal economic policies that played a definitive role in engendering the white popular support for Trump. Supporting the “lesser evil” Democrats on the basis of short run considerations — winning the election — ignores the evil that they create in the medium and long run, as in the case of Clintonian neoliberalism.\nThe “Dirty Break” Several Jacobin and Democratic Socialists of America (DSA) writers such as Seth Ackerman have proposed that socialists consider the use of the Democratic Party ballot line, not necessarily as matter of political commitment to the party but as a way to use their ballot status to reach out to vast sections of the population to which it would otherwise have no access, particularly when it may be difficult to run as independents. Advocates of this view justify this “dirty break” strategy by arguing that the chances for creating a third party that reflects their left politics are minimal given the legal obstacles for the creation of such parties in the US. The main problem with this tactic is that it might end up unintentionally misleading voters who might feel manipulated unless they are explicitly informed that the “dirty break” candidates do not support, and in fact oppose, the Democratic Party as presently constituted. And the candidates pledge, in advance, that if elected they will not join the Democratic caucus and instead create a separate caucus. And that if they lose, they will not support a mainstream Democratic Party winner (a big problem with Bernie Sanders’s strategy of supporting mainstream Democrats who win the presidential and other primaries.) This approach would also have the virtue of preventing the cementing of illusions about the Democratic Party. The issue is, however, that the national success of such a transparent dirty break presumes the very same conditions — namely the massive radicalization of the voting population — that would also lead to the formation and success of a third party, rendering the dirty break tactic irrelevant.", "url": "https://www.jacobinmag.com/2019/06/revolutionary-socialism-party-electoral-strategy-independence"}