{"authors": ["Lindsay Boyle"], "date_download": "2020-05-04 20:18:29", "date_modify": "2020-05-04 20:18:29", "date_publish": "2019-02-14 05:00:01", "description": "Salem — Even as she spent a year writing a book about her new life, resident Tonya Harris had avoided returning to the stretch of Old Colchester Road where she nearly died two years...", "filename": "_72c2a2f91ac543e7a6c5c993f1f9ec9c_1588623509.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_72c2a2f91ac543e7a6c5c993f1f9ec9c_1588623509.html", "title": "In new book, Salem resident details nearly dying in 2017 crash", "title_page": "In new book, Salem resident details nearly dying in 2017 crash", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Salem — Even as she spent a year writing a book about her new life, resident Tonya Harris had avoided returning to the stretch of Old Colchester Road where she nearly died two years ago.\n“Your photographer asked me to go there earlier today,” the 41-year-old said as she walked into a room in the Salem Free Public Library last week. “It’s the first time I have been back” since Jan. 13, 2017.\n“I think my heart is still racing,” she said.\nHarris, who had just picked up pizza for her oldest son, was driving north on Old Colchester and waiting to turn left onto Rattlesnake Ledge when Thomas Bysko, an Oakdale resident, hit her rear driver’s side bumper and drove straight into an oncoming car.\n“I remember a mother screaming for help for her daughter,” said Harris, whose two other children, riding in the back seat, were beat up but OK. “I got out of the car, then I woke up in the hospital.”\nAs Harris exited her car, Frederick McKeehan of Quaker Hill careened into it.\n“I don’t know how far I was dragged, but I was run over by my own car,” said Harris, whose entire body was critically injured.\nPolice didn’t charge Bysko or McKeehan in the wreck, which killed McKeehan’s passenger, Carol McKeehan.\nSix surgeries, two hospitals and countless hours of therapy later, Harris said she still doesn’t know a lot of the details. She’d rather focus on moving forward than looking back.\n“I know they say stay in your car, but I have what’s called empathy,” Harris said. “Of course I got out ... I would do it all over again.”\n‘Why not live with utter happiness?’\nHarris’ book, self-published in December, is called “Superstar,” a nickname she earned during a two-month stint in Gaylord Hospital, which followed 25 days in Hartford Hospital.\nHarris, her hands clenched into fists, could only move her eyes when she woke from a 10-day coma in Hartford. She couldn’t even ask what had happened.\n“And now look,” she said, gesturing toward her relatively new leg braces, which make her “feel like my legs are back.”\n“Don’t let anyone tell you, ‘You can’t,’” Harris said. “I am here today as living proof that you can.”\nHarris said she wrote the book, which is conversational in tone, as therapy, as inspiration, to answer people’s questions and because parts of it are almost too good to be true.\nThe wreck, for example, happened on Friday the 13th.\nHarris, oddly enough, was an aide for people with spinal cord injuries before she got such an injury herself.\nAnd Christopher Beauchene, now her boyfriend, was one of her clients. Injured when he jumped into a wave in 1998, Beauchene is paralyzed from the chest down.\nIn another twist, the pair realized later in life they actually had met years earlier, when Harris worked at Dusty’s Dairy Bar in Misquamicut, R.I.\n“This is movie kind of stuff,” she said.\nAt Harris’ request, Beauchene wrote “his side of the story” to close out her book. He wrote about his shock when he learned what had happened, about asking her out while she was hospitalized and about her long and continuing road to recovery.\n“I think God knew I needed someone that understood what I was going to go through,” Harris said.\nHarris said she’s in pain daily. Nerve damage means her skin constantly feels like it’s burning. Some days she’s OK with walking around the mall, other days it’s hard just to sit up.\nHarris’ hands eventually unfurled, but the former home aide and Salem Health Mart pharmacy technician now can use only her index fingers to type.\nHarris said much of what’s in her book was digitized via voice-to-text technology. Only later did she go back and rearrange or make small edits to the material — one finger at a time.\n“When I had a thought, I would go to the computer and speak it,” she said. “This (book) is not in chronological order because I don’t remember things in chronological order. I wanted people to see it like that.”\nHarris isn’t sure whether she’ll be able to work again. She hears people laugh when she and her wheelchair-bound boyfriend navigate public places. She wonders how life would be different if she hadn’t been crashed into just three miles from her house.\n“I’m not saying I don’t go through moments, don’t have tears, don’t think, ‘Why did this have to happen?’” she said. “But have your moment. Kick and scream, do what you need to do. Then get over it and move on.”\n“Because really, what is there to complain about?” she asked. “Why not live with utter happiness?”\nl.boyle@theday.com", "url": "https://apnews.com/72c2a2f91ac543e7a6c5c993f1f9ec9c"}