{"authors": ["Julia Bergman"], "date_download": "2020-05-04 20:23:45", "date_modify": "2020-05-04 20:23:45", "date_publish": "2019-02-15 05:00:01", "description": "With news that the suicide rate among active-duty military personnel is at a record high, a suicide prevention coordinator with the Department of Veterans Affairs Healthcare System in Connecticut...", "filename": "_167ef87337874b45bfc7d4a6ca3a5e93_1588623825.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_167ef87337874b45bfc7d4a6ca3a5e93_1588623825.html", "title": "Amid record military suicides, experts urge outreach", "title_page": "Amid record military suicides, experts urge outreach", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "With news that the suicide rate among active-duty military personnel is at a record high, a suicide prevention coordinator with the Department of Veterans Affairs Healthcare System in Connecticut is calling attention to fact that asking about thoughts of suicide doesn’t increase risk, and that intervention can help prevent suicidal behavior.\n“There’s still the perception that asking somebody if they’re having thoughts of suicide could cause them to start having those thoughts, or could cause them to act on those thoughts, and this is just not true,” said Christina Allen, a licensed clinical social worker with the VA in Connecticut. “There’s been research that shows asking them about thoughts of suicide could potentially provide an opportunity to talk about something that they’ve been struggling with but weren’t able to come out and disclose on their own.”\nA total of 321 active-duty military members — 57 Marines, 68 sailors, 58 airmen and 138 soldiers — died by suicide in 2018, according to data released recently by the Pentagon. That’s the same number of suicide deaths as 2012, the record since the military services began closely tracking the issue in 2001, according to Military.com.\nWhile the Pentagon has implemented a number of suicide prevention and awareness programs, suicide remains a troubling challenge for the military services. But it’s not just the active-duty military community; veterans and the general public also are affected.\nData released by the VA last fall found that the suicide rate for veterans was 1.5 times greater than for the general population in the U.S., amounting to about 20 veterans a day. The rate for vets aged 18 to 34 increased by more than 10 percent from 2015 to 2016, the most recent VA data available.\nNumbers also released last fall by the Centers for Disease Control and Prevention show the suicide rate in the U.S. is at a 50-year peak. There were more than 47,000 suicides in the U.S. in 2017.\nAllen said there are some common warning signs to look for: somebody becoming more withdrawn or isolated, or talking about feeling hopeless or lacking purpose, feeling trapped. An increase in drug and alcohol use is also an indicator.\nHelping to increase the feeling of belonging and connectedness for someone who is having suicidal thoughts can reduce their risk for suicide.\n“Oftentimes, people who are thinking about suicide are in a place where they’re feeling extremely alone and isolated,” Allen said.\nSteve Kennedy, 32, of Fairfield, who served as an Army infantryman, said he’s found outreach to be an effective tool for veterans, as well — getting them together and rebuilding camaraderie “can make a world of difference,” he said.\nAfter Kennedy got out of the Army in 2009, it took him three years before he went to a veterans event. Once he did, he said he “fell right back into it.”\n“It was like I knew them forever,” he said.\n“You don’t need to necessarily be talking about post-traumatic stress disorder or any kind of specific problems you’re having, there’s a comfort level there that can be difficult to have with other people,” he continued. “In that environment, even if you’re not addressing it directly, it can be helpful.”\nKennedy joined the Army in 2006, deploying to Iraq from June 2007 to July 2008 as a Humvee turret gunner and machine gun operator. He provided route clearance and security for a supply convoy between western and central Iraq, where his unit’s convoys regularly hit or discovered improvised explosive devices. His unit later was responsible for disrupting Al Qaeda supply lines through the desert villages in the Anbar and Saladin Provinces.\nWhen he returned from Iraq, he began to exhibit symptoms of PTSD. He abused alcohol, self-mutilated and began having suicidal thoughts. But he didn’t seek help because he feared being labeled weak and losing the trust of members of his unit.\nWhat would’ve made a difference for him was if the Army’s mental health clinics had evening hours, he said in an interview this week. While in the Army, if he’d wanted to go to the mental health clinic, he’d have to go in the morning when the infantry did its physical fitness training. And he’d have to explain to his superiors why he was missing PT. If the clinic were open at night, he could’ve gone on his own time without alerting anyone in his chain of command.\nKennedy’s own experience led him to later advocate for legislation in Connecticut to allow veterans, diagnosed with PTSD or other mental health conditions, who were discharged under other than honorable circumstances to have access to state veterans benefits. He argued that these vets were at increased risk for suicide and were being cut off from services that could help them. Kennedy said removing barriers to getting treatment is one solution to the problem.\n“People are desperate for a solution, but it’s a complicated problem,” he said.\nTo contact the Veteran Crisis Line, call 1 (800) 273-8255 and select option 1 for a VA staffer. Veterans, troops or their family members also can text 838255 or visit bit.ly/VetsCrisis for assistance.\nj.bergman@theday.com", "url": "https://apnews.com/167ef87337874b45bfc7d4a6ca3a5e93"}