{"authors": ["Matthew Toth Mtoth Dailyamerican.Com"], "date_download": "2020-05-04 20:05:44", "date_modify": "2020-05-04 20:05:44", "date_publish": "2019-03-10 00:05:00", "description": "Local transportation providers stand to lose millions of dollars if the Pennsylvania Department of Transportation is deprived of Act 44 funding. But the loss of funds would impact some agencies...", "filename": "_edcc25b6d59244daa22000a304bee22f_1588622744.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_edcc25b6d59244daa22000a304bee22f_1588622744.html", "title": "PennDOT's loss of funds could be felt locally", "title_page": "PennDOT's loss of funds could be felt locally", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Local transportation providers stand to lose millions of dollars if the Pennsylvania Department of Transportation is deprived of Act 44 funding. But the loss of funds would impact some agencies more than others.\nAccording to Act 44, the Pennsylvania Turnpike Commission is obligated to give $450 million to PennDOT’s budget, which the commission affords by taking on debt and raising tolls. Officials said the turnpike has amassed more than $11 million in debt, $6 million of which is due to PennDOT.\nRose Lucey-Noll, Cambria County Transit Authority executive director, said most services have been aware for at least the last six months that transit funding could be impacted by a lawsuit claiming those funds are illegally used for non-turnpike projects.\n“When it comes to capital projects, you are looking at a bus replacement and other projects that will just go on hold,” she said. “There will just be no funding for those things.”\nTwo groups representing motorists and the trucking industry filed a federal lawsuit in March 2018 saying that turnpike tolls can be used only to maintain or expand the roadway that charges the tolls. The groups say PennDOT is violating the law by using money for non-turnpike projects and are seeking a refund of $6 billion.\nDuring recent legislative hearings PennDOT Secretary Leslie Richards said the lawsuit could drastically impact local projects.\n“Almost a billion dollars will be in jeopardy if the litigation could not get resolved in a positive way for PennDOT,” she said. “If that money doesn’t get replaced, we are in a difficult situation.”\nRichards referenced the rehabilitation of the Johnstown Inclined Plane, which started in the 1980s. PennDOT officials said that without the Act 44 funds, this project would be halted with only 60 percent of design work completed, and no funds would be available for construction.\n“The big project (Richards) is referring to is more like an $8 million to $10 million project,” Lucey-Noll said.\nLucey-Noll said the project includes a car suspension project, track lighting and electrical system updates. She added that while safety is not a concern, the incline has been shut down several times because of breakdowns.\n“Obviously, something like the Johnstown Inclined Plane is so important to this community and has a huge economic impact in the area,” she said. “This is obviously something we don’t want to see put on hold if the funding is not there.”\nIn a list submitted to local legislators, the Johnstown Economic Development Transportation Investment Policy would also receive no funding with the removal of Act 44 funds. Lucey-Noll said this program works with local leaders from groups such as the Johnstown Redevelopment Authority to prioritize projects, including transportation and infrastructure, that need funding.\n“This is more of a planning project at this stage, so that’s supposed to be wrapping up (in) the next couple of months,” she said.\nThe Somerset County Transportation System is listed as receiving $1.32 million less if Act 44 funding is removed. Mike Villeneuve, the system’s manager, said that while they would lose that amount of funds over several years, a lot of their revenue comes from medical assistance provided by federal funds.\n“Our funds don’t solely come from Act 44,” he said. “Our funds come from the Federal Transportation Association and from the lottery. . . . (our) funding comes from five different sources . . . and the only thing that would affect us is our capital fund.”\nVilleneuve said the system uses the capital fund to purchase new vehicles, which for the 2018-19 fiscal year was around $279,500. He added the center purchases three new vehicles a year for its 16-vehicle fleet.\n“What PennDOT assured me was, ‘Hey, don’t you guys worry about it; we’ll find a way to pay for your vehicles,’” he said. “That’s exactly what he told me.”\nA full list of projects that will be affected with the removal of Act 44 funds can be found online at www.dailyamerican.com.\nIn an email to the Daily American, PennDOT communications director Erin Waters-Trasatt said through “reserve funds and re-prioritization of capital programs,” PennDOT officials were able to minimize the impact a lack of funding had on this fiscal year. However, she added that without turnpike payments, the distribution for capital projects next fiscal year would be dramatically lower.\n“We will need the General Assembly’s help with addressing this issue, as we are assessing several capital improvements as well as studies and operational activities that will have to stop or slow down in the fiscal year beginning in July,” she said.", "url": "https://apnews.com/edcc25b6d59244daa22000a304bee22f"}