{"authors": ["Isidora Cepeda Beccar", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Andrew Richner", "Abigail Gutmann-Gonzalez", "Felipe Lagos-Rojas", "Francisca Gómez-Baeza", "Pablo Abufom"], "date_download": "2020-05-04 19:49:41", "date_modify": "2020-05-04 19:49:41", "date_publish": "2019-10-28 00:00:00", "description": null, "filename": "2019_10_chile-protests-fare-hike-pinera-demands_1588621781.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/10/28104746/GettyImages-1178449311.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_10_chile-protests-fare-hike-pinera-demands_1588621781.html", "title": "We Will Make a New Chile", "title_page": "We Will Make a New Chile", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "ICB\nIt really began because Piñera refused to listen to the students. But that wasn’t unexpected, there are often small protests about government measures. They figure “they’ll get tired eventually and we’ll move on.” It changed when the government decided to close the metro stations, which impacted every worker’s life, and then reacted with such strong repression to the protests.\nThe same Friday that the metro stations started to burn another building went up in flames, belonging to the energy company Enel. We don’t really know who started these fires. They were taken by the government as proof that the movement was organized by sinister groups and an attack on, in their words, “every citizen.” This was a mistake — to try to shift the conversation so soon from the demands of the movement, which were quite popular, to demonizing it. People realized how out of touch the government was.\nLast Saturday, the government brought the army onto the streets, which was another escalation. Then on that Sunday Piñera took it to the next level and said he was in a “war” against the movement. His exact words were “we are in a war against a powerful and relentless enemy, that respects nothing and no one.” He didn’t specify who the enemy was, but left it open for various interpretations. He was avoiding the real problem — general discontent — by raising the specter of chaos and a threat posed by violent organized people.\nMost ordinary people felt this was extreme. There was no justification for sidelining the concerns that were obvious to the great majority. It’s still uncertain who exactly started the fires, but people felt that the President was creating a monster that didn’t exist. The reality is that anger and frustration accumulated for years. People didn’t support the violent acts, but many understood them.\nBringing the army onto the streets in response to this threat was significant. The history of the army in Chile is not a positive one. They have only acted against their own people. They haven’t been in a war with another country in the modern period. It’s intimidating to see the army on the streets, but it is more so when that army was torturing and killing your people for political activities in the recent past. This is really vivid in the popular imaginary.\nAll of a sudden we had armored vehicles and tanks on the streets. They were at the entrance to the metro stations. They were protecting supermarkets like Walmart. A curfew was imposed. During this time most people went home, because they didn’t want to know what would happen if the curfew was broken. All of this had added to the idea that we are living under siege.\nThere have been clashes between protestors and both the army and the police. The official numbers suggest eighteen people have died — but, if the protests happen at night, during the curfew, we don’t really know what happens. There is no press. The police have also been raiding people’s homes and detaining activists. More than 3,000 people have been detained in total.\nEarlier this week, Piñera started to make concessions. The government reversed the hike in transport fares and offered what he called a “new social agenda” with reforms to pensions, health care, and the minimum wage. But it wasn’t substantial. In Chile we have a saying, “bread for today, hunger for tomorrow.” The minimum wage right now is 300,000 pesos [equivalent of $414] and he promised to raise it 50,000 [$69] — that won’t take anyone out of poverty. On Wednesday, after he announced these concessions, we had the biggest wave of protests so far.\nAt this moment there was a transversal understanding that everything that had happened until Wednesday hadn’t been enough to force the President to listen. It wasn’t enough to make him concede even on basic elements of the neoliberal system and the development model that are, in fact, the direct cause of the inequality. On Friday, it’s estimated that more than 1.2 million people, in Santiago alone, gathered in the streets. Thousands of others also participated in other cities.\nThe demands on this demonstration were diverse, but followed a theme: from the President’s resignation, to the proposal of a new constitution; from a criticism of the media, to a reproach of the police and the military’s behavior. The movement was criticizing the government’s handling of the conflict so far, and its inflexibility.", "url": "https://jacobinmag.com/2019/10/chile-protests-fare-hike-pinera-demands"}