{"authors": ["Gabriella Muñoz The Washington Times"], "date_download": "2020-05-04 20:06:05", "date_modify": "2020-05-04 20:06:05", "date_publish": "2019-05-12 19:02:08", "description": "House Democrats' plans to blacklist rebellious strategists have sparked a backlash from a key party demographic, with dozens of chapters of the College Democrats vowing to boycott the Democratic...", "filename": "_b6a8fe2d99c3684f05ccca788fa50796_1588622765.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b6a8fe2d99c3684f05ccca788fa50796_1588622765.html", "title": "College Democrats vow to boycott DCCC over incumbent policy", "title_page": "College Democrats vow to boycott DCCC over incumbent policy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "House Democrats’ plans to blacklist rebellious strategists have sparked a backlash from a key party demographic, with dozens of chapters of the College Democrats vowing to boycott the Democratic Congressional Campaign Committee over its efforts to protect incumbents from primary challenges.\nIn doing so, the boycotting chapters are finding a champion in popular freshman Rep. Alexandria Ocasio-Cortez of New York.\nThey dissenting College Democrats chapters are objecting to the DCCC’s new rule refusing to do business with consultants, pollsters and other campaign workers who sign on to work for challengers making primary runs against incumbent Democrats.\nThe chapters are calling on their members not to donate to the DCCC, and to ask others also to withhold their support.\n“The rule would financially deter and greatly disadvantage vital new voices in our party, who are often younger and come from underrepresented and historically marginalized communities and identities,” the boycotters said in a statement. “This blacklist policy is undemocratic and antithetical to our values of inclusion and diversity.”\nHarvard students launched the boycott on April 24, and the ranks have since skyrocketed to over 70 chapters. They were joined Thursday by NextGen America, a group backed by billionaire Tom Steyer and focused on increasing turnout of the youth vote.\n“Young people are the present and the future of the Democratic Party, but time and time again, the Democratic establishment has ignored their demands and written them off,” Heather Hargreaves, executive director of NextGen America, said in a statement.\nVoters ages 18 to 29 saw the biggest increase in turnout from 2014 to 2018, and the Center for Information and Research on Civic Learning and Engagement at Tufts University found that 67% of young voters supported Democrats.\nThe DCCC announced its policy in March, sparking a backlash from liberal groups.\nThe committee says its first goal is to defend Democrats’ House majority, and that means defending those who already have seats, whether that’s against a GOP challenger or another Democrat.\nBut liberals say that could tamp down on repeats such as Ms. Ocasio-Cortez or Rep. Ayanna Pressley of Massachusetts, both of whom won their seats last year by defeating 10-term incumbents in primaries and then cruising to November victories in their heavily Democratic districts.\nMs. Ocasio-Cortez, who has criticized the DCCC rule, praised the students’ boycott and called it good news that college-aged voters are that active.\n“I think what we’re really seeing here in this mobilization is the emergence of young people having real political power in the party,” Ms. Ocasio-Cortez told The Washington Times. “I think that is energizing and it’s exciting. And listen, Democrats win when they mobilize electorates. Period. If young people aren’t energized, I’d be much more concerned.”\nRep. Cheri Bustos of Illinois, chairwoman of the DCCC, has brushed off calls to change the policy.\n“We have a policy that is the most diverse vendor policy in the history of the political arm of House Democrats, and it promotes diversity in our member ranks, and I’m very, very proud of that,” Ms. Bustos told The Times last month.", "url": "https://apnews.com/b6a8fe2d99c3684f05ccca788fa50796"}