{"authors": ["Stephen Dinan The Washington Times"], "date_download": "2020-05-04 20:12:49", "date_modify": "2020-05-04 20:12:49", "date_publish": "2019-05-13 15:03:00", "description": "President Trump suggested Monday that he could retaliate against Democrats on Capitol Hill with his own intrusive demands if they refuse to relent on their own interrogations. \"I could ask...", "filename": "_1f6410430b9556ae39ce95ca5e240da0_1588623169.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1f6410430b9556ae39ce95ca5e240da0_1588623169.html", "title": "Trump hints at retaliation demands against congressional Democrats", "title_page": "Trump hints at retaliation demands against congressional Democrats", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Trump suggested Monday that he could retaliate against Democrats on Capitol Hill with his own intrusive demands if they refuse to relent on their own interrogations.\n“I could ask them for the same kind of thing. They wouldn’t want to do it,” he said. “All they’re trying to do is win an election in 2020.”\nThe president did not say what those demands could entail.\nSpeaking to reporters ahead of a meeting with Hungary’s prime minister at the White House, Mr. Trump doubled down on his administration’s roadblock of congressional requests for information, saying members of Congress have become over-obsessed with him.\n“They’re asking for things that they’re not entitled to,” he said.\nEven as he kept one eye firmly on growing international hot spots of a trade war with China and a possible conflict with Iran, the president fended off complaints about how he’s handling his re-election prospects at home.\nHe batted away recent stories suggesting he and his team would seek out information from other countries to use against potential Democratic opponents in 2020.\n“I don’t need it. All I need is the opponents I’m looking at. I’m liking what I’m seeing,” Mr. Trump said.\nHe would not say what he thought should happen with former White House Counsel Don McGahn, whom Democrats are seeking to turn over notes, but who has been instructed by the White House not to comply.\nThe president said he didn’t know the latest negotiations, but said he has nothing to apologize for in the way he’s run things.\n“I can tell you that there has never been anybody so transparent as the Trump administration. And it was no collusion, and no obstruction. And we’re wasting a lot of time with that stuff. But the Mueller report came out, and it was a very good report for us,” he said.", "url": "https://apnews.com/1f6410430b9556ae39ce95ca5e240da0"}