{"authors": ["David Elliot Berman", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:47", "date_modify": "2020-05-04 19:57:47", "date_publish": "2019-12-23 00:00:00", "description": null, "filename": "2019_12_broadband-internet-bernie-sanders_1588622267.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/12/23150241/12695864505_feebe91b4f_b-e1577131378852.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_12_broadband-internet-bernie-sanders_1588622267.html", "title": "We Need Broadband Internet for All", "title_page": "We Need Broadband Internet for All", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nNearly half of Americans do not have an internet connection that meets minimum broadband speeds. Moreover, a staggering number of poor people of color do not have home internet access of any kind. And, across the board, Americans are charged some of the highest prices for internet service in the developed world. These are all symptoms of a much larger, structural problem: the corporate capture of the pipes, wires, and other infrastructure that powers the internet. Over the last two decades, progressive media reformers have often pursued an accommodationist agenda, attempting to reconcile the public’s interest in universal, high-quality broadband with the profit interests of large internet service providers (ISPs). They sought to rein in the malfeasance of corporations like Comcast, Verizon, and AT&T while leaving their ownership and control of the country’s internet infrastructure intact. Their animating question was how to tame the telecom giants, not how to slay them. However, as the fog of neoliberalism begins to lift and the horizons of political possibility extend forward, we should not be satisfied with dithering at the edges of the vast empires of cable and telecom monopolies. This requires not just rearguard critique of the existing communications order, but an affirmative vision of what a more democratic communication system that operates outside of the market would like. There are strong signs that we are at the beginning of such a reckoning: in recent months, the UK Labour Party, Elizabeth Warren, and, most recently, Bernie Sanders have all unveiled ambitious plans to create publicly-owned broadband internet networks. Taken together, this troika of plans represents a growing rejection of what was once seen as commonsense: that internet access can only be provided by large corporations such as Comcast and Verizon, unsavory as they may be. Bernie Sanders’ High-Speed Internet for All plan proceeds along three broad dimensions of action: imposing strict public interest regulations on behemoths like Comcast, using antitrust legislation to break them up, and creating publicly-owned alternatives to corporate ISPs. The latter is the most transformative plank of Sanders’ Internet for All platform, and is also the one emphasized most heavily in the proposal.\nAnother Internet is Possible Across the country, hundreds of cities and towns have taken it upon themselves to build their own publicly-owned broadband networks. In general, these networks are cheaper, faster, and operate with greater public accountability than the likes of Comcast, despite lacking their enormous economies of scale. The city of Chattanooga, Tennessee, for instance, quietly launched its own fiber-optic broadband network in 2010, which now offers at least a one gigabit-per-second (Gbps) connection to the 170,000 homes and businesses in their service area. Unlike the Labour Party’s plan — which would have created a single state agency tasked with delivering free fiber-optic broadband to all individuals and businesses throughout the United Kingdom by 2030 — Sanders’s High-Speed Internet for All plan offers federal support for local broadband initiatives, citing municipal broadband networks like Chattanooga’s with approbation. At the center of Sanders’ Internet for All proposal is $150 billion in infrastructure grants — nearly twice the amount put forward in Warren’s proposal — that would be distributed to municipalities and states that want to build out “publicly owned and democratically controlled, co-operative, or open access broadband networks.” As a matter of policy, Sanders’ Internet for All proposal does not itself entail the build out of a single mile of broadband infrastructure. What it would do is make the political terrain more amenable to the expansion and multiplication of public broadband initiatives, not only by providing funding and technical assistance, but also by repealing laws in twenty-five states that currently either prohibit or significantly hinder municipalities from building their own networks. The public broadband networks built under Sanders’ Internet for All initiative would be held to a much higher standard of conduct than their lightly-regulated private sector counterparts are today. Private ISPs notoriously underinvest in low-income neighborhoods that they deem insufficiently profitable, a practice often referred to as “digital redlining.” By contrast, in order to qualify for grants, publicly-owned ISPs would be required to abide by universal service requirements. While private ISPs still offer internet service over decades-old copper wires that were originally installed to transmit telephone signals, under Sanders’ Internet for All plan public broadband operators would be required to deploy technologies that meet minimum speed thresholds. And while corporations like Comcast have a long history of abusing the workers who build and maintain their networks, the Sanders plan conditions grants on adhering to strong labor, wage, and sourcing standards. Critically, however, Sanders’ does not specify how he intends to fund the buildout of public broadband infrastructure. This is a missed opportunity. “But how will you pay for that?” is not only a cynical rhetorical device deployed by neoliberals to torture any call for new public expenditures. Deciding how to finance social programs can clarify the political battlefield: determining who should pay to remedy a social problem hints at who is responsible for the problem in the first place (Sanders’ proposal to hit Wall Street with a financial-transaction tax to eliminate student debt is a brilliant example of this). Indeed, Internet for All could be funded by taxing the titans of the new economy like Amazon, Facebook, and Google (as the Labour Party proposed to do). Or it could be funded by taxing corporate internet providers. They are responsible for the sorry state of broadband in this country: we should make them pay to fix it.\nHolding Private Power Accountable Sanders’s Internet for All agenda both nurtures the growth of a new communications order and sets firm constraints on the hegemons of the current one. Because the creation of publicly-owned broadband networks is dependent on the voluntary participation of municipalities and states, the majority of Americans would still be dependent on for-profit internet providers — at least initially. Sanders’ call for public ownership is thus complemented by a multifaceted approach to regulate for-profit ISPs like a utility, much as we currently regulate the companies that manage electricity, gas, and other critical infrastructure in the United States. Under Internet for All, the FCC would be empowered to regulate the rates that for-profit ISPs can charge their subscribers — a policy long anathema to telecom policymakers and regulators, who stubbornly insist that competition will lower internet rates for consumers, even as competition perpetually fails to materialize. Rate regulation would prevent large providers from leveraging their monopoly position in the broadband market to charge their customers monopoly prices, as they do now. ISPs — both privately and publicly-owned — would also be required to offer a low-cost internet plan, which would be fully subsidized by the government for low-income households. Eligibility for subsidized internet access would be tied to eligibility for means-tested social programs like SNAP and Medicaid, effectively integrating internet access into the welfare state. This would put more money back in the hands of low-income families, and help close America’s cavernous digital divide.", "url": "https://www.jacobinmag.com/2019/12/broadband-internet-bernie-sanders"}