{"authors": ["Nicole Aschoff", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman"], "date_download": "2020-05-04 19:56:09", "date_modify": "2020-05-04 19:56:09", "date_publish": "2019-08-20 00:00:00", "description": null, "filename": "2019_08_industrial-policy-central-planning-elizabeth-warren_1588622169.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/08/20124806/GettyImages-101684102.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_08_industrial-policy-central-planning-elizabeth-warren_1588622169.html", "title": "An Industrial Policy That Puts Workers First", "title_page": "An Industrial Policy That Puts Workers First", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Industrial policy is en vogue again. The Financial Times editorial board recently announced its tentative support for industrial policy in the United States, writing that “the need to transition to a worker-led economy is increasingly clear.”\nThe FT isn’t calling for socialism. Instead, the studiously bland piece highlights recent suggestions (from both Democrats and Republicans) for a reboot of industrial policy and hints that Elizabeth Warren’s “Plan for Economic Patriotism” might not be a terrible idea.\nWarren’s proposal is the latest addition to her growing platform of ambitious ideas to overturn the neoliberal status quo. In her industrial policy endeavor, Warren takes on “unpatriotic” US corporations like Levis and General Electric that have offshored production to cheaper locales, “abandoning loyal American workers and hollowing out American cities along the way.” Warren argues:\nIf we want faster growth, stronger American industry, and more good American jobs, then our government should do what other leading nations do and act aggressively to achieve those goals instead of catering to the financial interests of companies with no particular allegiance to America.\nThe aggressive action Warren urges includes the establishment of a new federal agency called the Department of Economic Development whose “sole responsibility” is to “create and defend quality, sustainable American jobs.” The DED — which would subsume the Commerce Department, the Small Business Administration, and other agencies that work on job creation — would essentially oversee all trade-related matters, set up worker training and apprenticeship programs, and take a leading role in job-creating research and development.\nThe department’s mandate would include actively managing the dollar to promote exports and linking expanded research and development with domestic production mandates and a federal purchasing program. Taxpayers would be rewarded with a return on investment, potentially in the form of intellectual property rights or reinvestment in American communities.\nSome might find it surprising that the editors of the pink pages are touting a plan that has the whiff of central planning. But as the mouthpiece of international business, the FT has a stake in preserving capitalism, and these days elites are concerned about the short- and long-term health of our for-profit system.\nIn the short run, elites and policymakers worry that we’re on the verge of a deep recession. The recent inversion of the yield curve on three-month and ten-year US Treasury bonds to favor short-term yields — historically a signal of impending recession — is fueling market jitters.\nLong-run concerns center on the fact that, despite easy access to credit, corporations show little interest in investing in jobs and infrastructure. At the same time, governments seem content to use monetary policy to keep national economies from derailing rather than formulating longer-term plans for economic growth and development.\nIndustrial policy holds the potential to break out of the cul-de-sac of monetary policy.\nCalls to revisit industrial policy pop up periodically, but the last time a serious debate arose was in the midst of another crisis — the downturn of the late seventies and early eighties. Like today, pundits and policymakers were wracked by fears of US decline. Political challenges from the Global South and restive social movements at home — combined with sluggish growth, high inflation, and the spectacular achievements of global competitors, particularly Japan — wreaked havoc on American “business confidence.” Observers fretted that the United States would tumble from a global industrial powerhouse to a nation of burger flippers.\nWe know now how elites dealt with this crisis: neoliberalism. But back then it wasn’t clear which way things would go. Various paths were explored and debated.\nIn the fog of a dying Keynesianism, prominent scholars proposed developing and adopting a broad-scale industrial policy rather than the supply-side route of tax cuts, relaxed government regulation, and weaker public programs that would ultimately prevail.\nIn a 1982 piece for the Harvard Business Review, economist Robert Reich argued for an industrial policy that “focuses on the most productive pattern of investment, and … favors business segments that promise to be strong international competitors while helping to develop the industrial infrastructure (highways, ports, sewers) and skilled work force needed to support those segments.”\nAccording to Reich, the United States already had an unacknowledged industrial policy — an ad hoc blend of subsidies, tariffs, quotas, and government/military procurement programs — that favored politically connected industries and firms, many of which were antiquated and uncompetitive. What it needed instead was an explicit, government-led program of industry restructuring that would direct resources and attention toward developing cutting-edge industry, infrastructure, and a skilled workforce. With an organized effort to reduce short-term costs for capital and labor, the United States could regain its competitive edge on the global industrial stage.\nBut in an ideological climate of ascendant Reaganism, the idea of industrial policy proved controversial. Economists like Paul Krugman and Charles Schultze countered that the US government would be terrible at “picking winners” and that industrial policy would most likely be counterproductive.\nThe supply-siders won. America didn’t get an industrial policy. Instead we got the same ad hoc protectionism combined with new trade agreements, which gave US corporations breathing room to restructure, cut costs, and enter new markets. Displaced workers didn’t get retrained or help finding new jobs. Many moved to lower-paying work and were forced to adjust to a declining standard of living. The dream of industrial policy was quietly forgotten.\nFast forward to today. For decades neoliberal policies have generated incredible wealth for a fraction of the country and stagnant wages, increased precarity, and alienation for everyone else. People are sick of the status quo. They’re demanding something different.\nTrump’s response — more tax cuts for the rich, strongman rhetoric, and a dash of protectionism — clearly won’t work. As Reich advocated long ago, and still does today, we need an industrial policy.\nWarren’s plan is a good start. Despite the FT’s characterization, however, it is not a “worker-led” plan.\nWarren is absolutely correct to call for job creation. But in crafting a twenty-first-century industrial policy we should pay careful attention to history. Our proposals should avoid assuming that forcing US companies to generate jobs, even jobs in high tech or manufacturing, will automatically produce a better life for working people.\nJobs in manufacturing only became “good” jobs when workers fought to make them good — when they organized unions that delivered decent wages and benefits and health and safety regulations. Even then, most manufacturing jobs were never all that good. At best they offered a subset of the population a secure, decently compensated job.\nMany unionized workers still toiled in “gold-plated sweatshops.” They never had much say in how their work was organized, let alone a say in how their companies operated, how they impacted the broader community, or for what purpose these firms existed. As Nelson Lichtenstein observes, “collective bargaining between unions and employers represented the sole model that governed the resolution of conflicts and the assertion of rights within the world of work.” The supposed heyday of American capitalism still suppressed workers’ dreams of an industrial democracy.\nBeginning in the late 1960s, the power of the labor movement to enforce the rights of working people rapidly dissipated in the face of lukewarm state support and a concerted effort by US corporations to cut labor costs amid growing international competition. With the decline of working-class power, what were once decent jobs deteriorated into the tiered, unsafe, underpaid jobs that characterize most of American manufacturing today.\nSo we should absolutely push for an industrial policy today. But if we’re really going to make workers our “highest priority,” as Warren demands, we need an industrial policy that empowers workers — all workers, not just “American workers.” Calls for new jobs must be explicit about the kind of jobs we want — unionized, well-compensated, safe, secure jobs that provide a dignified livelihood for working people. More than this we should push for an industrial policy that puts us on a path toward a different relationship with work — a relationship in which working people have a voice in how their job is organized and compensated, how profits are shared and allocated, and what responsibilities companies have to the communities in which they operate.\nA truly worker-led industrial policy, in short, must be rooted in the principles of industrial democracy — not corporate profit-making.", "url": "https://www.jacobinmag.com/2019/08/industrial-policy-central-planning-elizabeth-warren"}