{"authors": ["Staff Reports"], "date_download": "2020-05-04 20:18:53", "date_modify": "2020-05-04 20:18:53", "date_publish": "2019-05-16 23:58:00", "description": "FLORENCE, S.C. – The Masterworks Choir will perform its final concert of the season at 5 p.m. Sunday as it celebrates its 40th anniversary. The free concert will be held at the Francis...", "filename": "_28666b86b55942cc9fbcf36bf2433e29_1588623533.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_28666b86b55942cc9fbcf36bf2433e29_1588623533.html", "title": "Sunday concert celebrates 40th anniversary of Masterworks Choir in Florence", "title_page": "Sunday concert celebrates 40th anniversary of Masterworks Choir in Florence", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FLORENCE, S.C. – The Masterworks Choir will perform its final concert of the season at 5 p.m. Sunday as it celebrates its 40th anniversary.\nThe free concert will be held at the Francis Marion University Performing Arts Center in downtown Florence.\nThe performance will feature the world premiere of a work written for this occasion by Houston composer Terre Johnson titled “The Gift to Sing,” along with a large-scale work, “Jubilate Deo,” by South Carolina composer Dan Forrest.\nA reception will be held immediately following the performance and all audience members and participating musicians are invited to attend.\nConducting the program will be Will Carswell, the choir’s music director.\nThe 70-voice Masterworks Choir began as an all-male choir in 1979 under the direction of founding music director William B. Mills. Along with serving as conductor of Masterworks, Mills was the organist and director of music at Central United Methodist Church for more than 40 years.\nAfter Mills died in 2012, Carswell became only the second music director of the Masterworks Choir. Known for his innovative programming and thoughtful interpretations of classical and contemporary works, Carswell has expanded the repertoire of the choir and has actively pursued touring opportunities, the most recent being a performance tour to Italy in 2016 and the choir’s Carnegie Hall debut in 2014. Next month, 50 members of the choir will travel to central Europe to give concerts in Budapest, Salzburg, Vienna and Prague.\nIn addition to the Masterworks Choir, Sunday’s concert also will feature the Masterworks Children’s Choir. Formed three years ago by founding director Sandra Howard, the Children’s Choir will be highlighted in both choral works. Children first sang with Masterworks in a 2015 concert that was very well-received. That success led to the formation of an ongoing children’s choir as a part of the Masterworks organization. There are 24 children in the choir.\n“Our children are singing the music beautifully,” Howard said, “and I am thrilled to work with these fun, energetic and talented young singers. The opportunity to perform serious choral music in a concert hall like the FMU Performing Arts Center with the Masterworks Choir and orchestra is a wonderful learning experience for these young people.”\nGuest performers at Sunday’s concert are soprano Serena Hill-LaRoche and mezzo-soprano Jami Rhodes.\nCurrently, Hill-LaRoche is an instructor of voice at the University of South Carolina. She works with students in applied voice, diction and vocal pedagogy.\nRhodes is an associate professor of voice at East Carolina University, where she teaches applied voice, serves as coordinator of applied pedagogy and conducts ECU’s treble ensemble and the ECU Concert Choir.\nThe choirs will be accompanied by a full orchestra of 38 musicians.\n“The preparation for our spring concert has been a marvelous journey and a true joy,” Carswell said. “Incredible melodies, exciting rhythms, beautiful texts and creative orchestrations all combine for a memorable musical experience. Add to that the angelic voices of children and our guest soloists and the result is a concert you do not want to miss.”\nVeteran Masterworks accompanist Beverly Hazelwood agrees.\n“The audience is going to love this program,” she said. “The opportunity to premiere a new choral work along with performing Dan Forrest’s thrilling ‘Jubilate Deo’ is the perfect ending to our 40th anniversary season.”\nThough no tickets are required for this concert, an offering will be collected. Seating is on a first-come basis. The Masterworks Choir is able to continue to perform free concerts because of the philanthropic donations from loyal supporters.\n“So many individuals, businesses, corporations and foundations in the Pee Dee region are faithful supporters of this organization,” Carswell said. “", "url": "https://apnews.com/28666b86b55942cc9fbcf36bf2433e29"}