{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:27:51", "date_modify": "2020-05-04 20:27:51", "date_publish": "2019-12-02 16:00:13", "description": "Today in History Today is Sunday, Dec. 8, the 342nd day of 2019. There are 23 days left in the year. Today's Highlight in History:", "filename": "_520f7cd58e7647b5a9e2352b853d53ce_1588624071.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_520f7cd58e7647b5a9e2352b853d53ce_1588624071.html", "title": "Today in History", "title_page": "Today in History", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Today in History\nToday is Sunday, Dec. 8, the 342nd day of 2019. There are 23 days left in the year.\nToday’s Highlight in History:\nOn Dec. 8, 1980, rock star and former Beatle John Lennon was shot to death outside his New York City apartment building by an apparently deranged fan.\nOn this date:\nIn 1863, President Abraham Lincoln issued his Proclamation of Amnesty and Reconstruction for the South.\nIn 1886, the American Federation of Labor was founded in Columbus, Ohio.\nIn 1940, the Chicago Bears defeated the Washington Redskins, 73-0, in the NFL Championship Game, which was carried on network radio for the first time by the Mutual Broadcasting System (the announcer was Red Barber).\nIn 1941, the United States entered World War II as Congress declared war against Imperial Japan, a day after the attack on Pearl Harbor.\nIn 1972, a United Airlines Boeing 737 crashed while attempting to land at Chicago-Midway Airport, killing 43 of the 61 people on board, as well as two people on the ground; among the dead were Dorothy Hunt, wife of Watergate conspirator E. Howard Hunt, U.S. Rep. George W. Collins, D-Ill., and CBS News correspondent Michele Clark.\nIn 1982, a man demanding an end to nuclear weapons held the Washington Monument hostage, threatening to blow it up with explosives he claimed were inside a van. (After a 10-hour standoff, Norman D. Mayer was shot dead by police; it turned out there were no explosives.)\nIn 1987, President Ronald Reagan and Soviet leader Mikhail S. Gorbachev signed a treaty at the White House calling for destruction of intermediate-range nuclear missiles.\nIn 1991, AIDS patient Kimberly Bergalis, who had contracted the disease from her dentist, died in Fort Pierce, Fla., at age 23.\nIn 1998, struggling to stave off impeachment, President Bill Clinton’s defenders forcefully pleaded his case before the House Judiciary Committee. The Supreme Court ruled that police cannot search people and their cars after merely ticketing them for routine traffic violations.\nIn 2001, the U.S. Capitol was reopened to tourists after a two-month security shutdown.\nIn 2003, President George W. Bush signed a $400 billion Medicare overhaul bill that included a prescription drug plan for seniors. Congress approved legislation to stem the flood of unwanted junk e-mail known as “spam.”\nIn 2013, hundreds of thousands of protesters poured into the streets of the Ukrainian capital of Kyiv (KEE’-ihv), toppling the statue of former Soviet leader Vladimir Lenin and blocking key government buildings in an escalating stand-off with the president on the future of the country.\nTen years ago: Ohio executed murderer Kenneth Biros by performing the nation’s first lethal injection using a single drug, a supposedly less painful method than previous executions that required three drugs. A wave of coordinated bomb attacks targeting high-profile symbols of Iraqi authority killed at least 127 people.\nFive years ago: The U.S. and NATO ceremonially ended their combat mission in Afghanistan, 13 years after the Sept. 11 terror attacks sparked their invasion of the country to topple the Taliban-led government. Britain’s Prince William sat down with President Barack Obama in Washington while his wife, Kate, made an impression of a down-to-earth duchess on preschoolers and prominent British expats in New York.\nOne year ago: As protests on the streets of Paris grew more violent, French riot police used armored police trucks and tear gas to contain thousands of yellow-vested protesters venting their anger against the government. Oklahoma quarterback Kyler Murray was named the winner of college football’s Heisman Trophy, beating out Alabama’s Tua Tagovailoa (TOO’-ah tuhng-ah-vy-LOH’-ah). President Donald Trump said that chief of staff John Kelly would leave his job by year’s end amid an expected West Wing reshuffling.\nToday’s Birthdays: Flutist James Galway is 80. Singer Jerry Butler is 80. Pop musician Bobby Elliott (The Hollies) is 78. Actress Mary Woronov is 76. Actor John Rubinstein is 73. Reggae singer Toots Hibbert (Toots and the Maytals) is 71. Actress Kim Basinger (BAY’-sing-ur) is 66. Rock musician Warren Cuccurullo is 63. Rock musician Phil Collen (Def Leppard) is 62. Country singer Marty Raybon is 60. Political commentator Ann Coulter is 58. Rock musician Marty Friedman is 57. Actor Wendell Pierce is 56. Actress Teri Hatcher is 55. Actor David Harewood is 54. Singer Sinead (shih-NAYD’) O’Connor (AKA Shuhada’ Davitt) is 53. Actor Matthew Laborteaux is 53. Baseball Hall of Famer Mike Mussina is 51. Rock musician Ryan Newell (Sister Hazel) is 47. Actor Dominic Monaghan is 43. Actor Ian Somerhalder is 41. Rock singer Ingrid Michaelson is 40. R&B singer Chrisette Michele is 37. Actress Hannah Ware is 37. Country singer Sam Hunt is 35. MLB All-Star infielder Josh Donaldson is 34. Rock singer-actress Kate Voegele (VOH’-gehl) is 33. Christian rock musician Jen Ledger (Skillet) is 30. NHL defenseman Drew Doughty is 30. Actress Wallis Currie-Wood is 28. Actress AnnaSophia Robb is 26.\nThought for Today: “War does not determine who is right — only who is left.” — Author unknown (although this sentiment is sometimes attributed to Bertrand Russell).\nCopyright 2019, The Associated Press. All rights reserved.", "url": "https://apnews.com/520f7cd58e7647b5a9e2352b853d53ce"}