{"authors": ["Mark Dawidziak", "The Plain Dealer"], "date_download": "2020-05-04 20:18:17", "date_modify": "2020-05-04 20:18:17", "date_publish": "2019-02-10 10:00:26", "description": "Radcliffe comedy and Netflix’s ‘Umbrella Academy’ among viewing choices CLEVELAND, Ohio – A TBS comedy starring Daniel Radcliffe and a Netflix adaptation of the graphic novels “The Umbrella...", "filename": "_291786b819c646f097ba75188e80b841_1588623497.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_291786b819c646f097ba75188e80b841_1588623497.html", "title": "Radcliffe comedy and Netflix’s ‘Umbrella Academy’ among viewing choices", "title_page": "Radcliffe comedy and Netflix’s ‘Umbrella Academy’ among viewing choices", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Radcliffe comedy and Netflix’s ‘Umbrella Academy’ among viewing choices\nCLEVELAND, Ohio – A TBS comedy starring Daniel Radcliffe and a Netflix adaptation of the graphic novels “The Umbrella Academy” are among the week’s top viewing choices:\n“Studio 54” (10 p.m. Monday, Feb. 11, A&E): Documentary filmmaker Matt Tyrnauer’s film looks at what A&E bills as “the pulsating epicenter of 1970s hedonism: a disco hothouse of beautiful people, drugs and sex.” The wild journey of two best friends from Brooklyn, Studio 54 co-owners Ian Schrager and Steve Rubell, provide the framework for this history of the Manhattan club. Schrager and Rubell transformed an empty theater built in 1927 into the club, which opened its doors on April 26, 1977 (the location became the Roundabout Theatre in 1998). Among those glimpsed in archival footage are Liza Minnelli, Michael Jackson, Farrah Fawcett, Mikhail Baryshnikov, Bianca Jagger and Calvin Klein.\n“Boomerang” (10 p.m. Tuesday, Feb. 12, BET): Tequan Richmond (“Everybody Hates Chris”) and Tetona Jackson have the lead roles in this cable comedy series, a sequel to the hit 1992 movie starring Eddie Murphy, Cleveland native Halle Berry and Robin Givens. The film’s stars don’t appear in the series, but Berry is on bard as a producer. Jackson plays Simone, the daughter of Marcus Graham and Angela Lewis (the Murphy and Berry characters). Richmond plays Bryson, the son of Jacqueline Broyer (the character played by Givens). Another of the producers, Emmy winner Lena Waithe (“Master of None”), co-wrote the pilot.\n“Miracle Workers” (10:30 p.m. Tuesday, Feb. 12, TBS): Radcliffe, best known for playing a high-profile wizard named Harry, plays a low-level angel named Craig in this seven-episode cable comedy from executive producer Lorne Michaels and series creator-producer Simon Rich (based on his novel “What in God’s Name”). With his boss, God (played by Steve Buscemi), ready to give up on the whole Earth project, Craig is responsible for handling all of humanity’s prayers. To prevent Earth’s annihilation, Craig and fellow angel Eliza (Geraldine Viswanathan) must answer a seemingly unanswerable prayer: help two humans fall in love.\n“Weird City” (Wednesday, Feb. 13, YouTube Premium): Oscar winner Jordan Peele (“Get Out”), the host and executive producer of the upcoming CBS All Access revival of “The Twilight Zone,” also is behind this six-episode science-fiction comedy anthology set in the futuristic city of Weird. Episodes feature Mark Hamill, Sara Gilbert, LeVar Burton, Michael Cera, Steven Yeun, Rosario Dawson, Youngstown native Ed O’Neill, East Cleveland native Yvette Nicole Brown and Laverne Cox.\n“The Umbrella Academy (Friday, Feb. 15, Netflix): Based on the Dark Horse graphic novels written by Gerard Way and illustrated by Gabriel Ba, this dark mix of action, adventure, mystery and drama stars Ellen Page, Tom Hopper, Emmy Raver-Lampman, Robert Sheehan, David Castañeda, Aidan Gallagher and Mary J. Blige On the same day in 1989, 43 infants are inexplicably born to random, unconnected women who showed no signs of pregnancy the day before. Seven are adopted by Sir Reginald Hargreeves, a billionaire industrialist, who creates The Umbrella Academy and prepares his “children” to save the world.", "url": "https://apnews.com/291786b819c646f097ba75188e80b841"}