{"authors": ["Paris Marx", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Rachel Riederer", "Keith A. Spencer", "Nick Levine"], "date_download": "2020-05-04 19:55:06", "date_modify": "2020-05-04 19:55:06", "date_publish": "2019-07-19 00:00:00", "description": null, "filename": "2019_07_space-colonies-jeff-bezos-blue-origin_1588622106.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/07/19122121/GettyImages-1148070247-web.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_07_space-colonies-jeff-bezos-blue-origin_1588622106.html", "title": "We Don’t Need Space Colonies, and We Definitely Don’t Need Jeff Bezos", "title_page": "We Don’t Need Space Colonies, and We Definitely Don’t Need Jeff Bezos", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nBillionaire Amazon CEO Jeff Bezos put forward his grand vision for the future of humanity at a convention center ballroom in Washington, DC on May 9. It was certainly ambitious, with declarations that humans need to return to the moon “and stay there” and that his aerospace company Blue Origin was the first step on a path to space colonies in orbit above Earth. Earth is the best planet, Bezos assured his audience, but building space colonies is the only way to ensure “growth and dynamism” in our future, instead of the “stasis and rationing” that would accompany remaining an Earth-based species. His colonies would allow the human population to expand to a trillion people — it’s currently expected to peak between eight to eleven billion — which he promises would allow us to produce “a thousand Mozarts and a thousand Einsteins.” Maybe that’s an inspiring vision to a billionaire and the coterie of people in thrall of his every utterance, but think about it for a second: the richest man in the world is saying that the only way for humanity to thrive is to embrace his vision of open pit mines in space and moving the vast majority of the human population off Earth. Yet there’s absolutely nothing stopping humanity from thriving right here, right now. What we need is a system that values everyone’s skills and wants to see everyone flourish. But that’s the very thing that billionaires like Bezos, whose companies do everything they can to avoid paying taxes and profit from the privatization of public services, don’t see any value in. Why should they get to make that decision?\nThriving Billionaires Create Mass Suffering The only time that rich people like Bezos pay attention to the plight of the poor is when they feel their wealth is threatened by an increasingly angry populace, but few take that as a reason to back a more egalitarian tax system. Instead, they turn to philanthropy and make some token investments in social causes to make it seem like they care. Bezos, for example, lobbied Seattle City Council so hard he got the city to revoke a tax on major employers that would have funded services for the city’s ballooning homeless population. In response to criticism, Bezos announced a $97.5 million dollar fund for groups providing homeless services across the United States — a drop in the bucket for a man worth $150 billion. And there’s a clear connection between the success of people like Bezos in Seattle to the city’s growing social crisis. Success for a few robs the many of a good life and social mobility. That’s not just a slogan; it’s backed up by analysis of the income and wealth distribution over the past several decades. Since the 1970s, the share of income and wealth captured by the rich has soared, while the wages of working people have basically stagnated. As the working class lost its union representation, it lost power at the bargaining table and in the political arena. That allowed the rich to rewrite the tax code and change the rules of the game to work in their favor at the expense of everyone else. Now, decades later, 40 percent of Americans wouldn’t have $400 in the event of a health scare or some other emergency. Millions of people lost their homes and their jobs in the aftermath of the Great Recession, and when they were able to find work again, it was in low-paid service jobs. Then, in order to try to pay their bills and maintain their standard of living, some of them started working in the lightly regulated gig economy, desperate to bring in a little more income. An economy where people are so cash-strapped and so many people are struggling just to get by is not an economy that sets people up to meet their potential. It’s not an economy that maximizes people’s ability to become Mozarts and Einsteins. It’s an economy that lets talented people languish because they’ve been robbed of opportunity and social mobility. Elevating them into space colonies won’t change that.\nPoverty Holds People Back Poverty sets people back in many ways, some obvious and some not. On the obvious side is money. When people don’t have it, they struggle to access all the things that they need to thrive: stable housing, good food, reliable transport, education, healthcare, and more. But poverty isn’t simply about not being able to pay for things; the experience can hold people back in less obvious ways, too. In their book, Scarcity: Why Having Too Little Means So Much , Sendhil Mullainathan and Eldar Shafir explain how scarcity — “having less than you feel you need” — can cause one’s mind to fixate on what is lacking, limiting the cognitive capacity available for life, work, and anything else one has to deal with. They call this a “bandwidth tax.” Scarcity comes in many forms: poverty, time, loneliness, and more. Poverty, however, has the greatest cognitive impact, as it can reduce one’s mental capacity “more than going one full night without sleep.” That might make it seem that poor people are less intelligent than middle-class or rich people, but Mullainathan and Shafir assert that is absolutely not the case: It is easy to confuse a mind loaded by scarcity for one that is inherently less capable […] [but] we are emphatically not saying that poor people have less bandwidth. Quite the opposite. We are saying that all people, if they were poor, would have less effective bandwidth. If we took away Bezos’s billions and put him to work in one of Amazon’s warehouses tomorrow, he would experience the same cognitive impact from scarcity as other workers whose minds are forced to focus mostly on how to make their paycheck last until the next pay period. Bezos would have the same bandwidth tax as anyone else, limiting the mental capacity he could expend on other ideas, personal projects, or improving his position. Poverty is more than a lack of money. It has a negative cognitive impact which can keep people from thriving — from becoming a Mozart or an Einstein — and that won’t change just because people are elevated into space colonies. We’ve built a society that grinds every last minute of productive labor — including mental labor — from the working class to enrich the billionaires charting our future. Those billionaires will need to be defanged for regular people to have a fighting chance at reaching their full potential.\nAbolish Billionaires and Support the Masses Capitalism is engineered to privilege the rich over everyone else, and they exert their power to keep it that way. But while that allows the wealthy to entertain their dreams of space colonization, it closes off opportunity for almost everyone else — and that needs to change if we want everyone to reach for the (metaphorical) stars. Mullainathan and Shafir suggest that the cognitive burden experienced by low-income people can be eased by eliminating time-consuming, bureaucratic barriers to social assistance; providing cash transfers to relieve material scarcity; and providing high-quality universal social programs. They provide the example of subsidized childcare for a single mom: not only will it save her money, but it will relieve the mental burden of having to worry about where her child will go while she’s working. This mental benefit will not show up in narrow cost-benefit analyses of such programs, but could be life-changing for the working mother. Even more sweeping changes, like decommodifying healthcare, education, childcare, and transportation, could radically ease working people’s mental burdens. The less people worry about how to pay for these essential services, the more they might be able to delve into science, technology, art, and more, and become the Mozarts and Einsteins of their time. Anthropologist David Graeber makes the case that the popular culture produced by Britain in the 1960s would not have been possible without its strong and generous welfare state: “a surprising proportion of major bands later to sweep the world spent at least some of their formative years on unemployment relief.” When New Labour tried to launch Cool Britannia decades later after major reforms to welfare, it didn’t have nearly the same result because “pretty much everyone with the potential to become the next John Lennon would instead spend the rest of their lives stacking boxes in their local Tesco.” People need economic security and the mental space to engage themselves if they are to fulfill their potential, but it’s currently near impossible for most people to get either. Good jobs are hard to come by, despite the low unemployment rate; support for the poor and unemployed has been aggressively cut; and the economic pain people are feeling has created a mental health crisis that isn’t being properly addressed.", "url": "https://www.jacobinmag.com/2019/07/space-colonies-jeff-bezos-blue-origin"}