{"authors": ["Noah Hausmann"], "date_download": "2020-05-04 20:05:24", "date_modify": "2020-05-04 20:05:24", "date_publish": "2019-02-19 14:00:00", "description": "VICTORY TWP. — The West Shore Community College Board of Trustees Monday approved WSCC President Scott Ward and the college’s legal counsel to begin negotiations to purchase a property in downtown...", "filename": "_a1de764dee0d4aeaa0105fd19e814829_1588622724.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a1de764dee0d4aeaa0105fd19e814829_1588622724.html", "title": "WSCC considers buying Manistee property, bans smoking", "title_page": "WSCC considers buying Manistee property, bans smoking", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "VICTORY TWP. — The West Shore Community College Board of Trustees Monday approved WSCC President Scott Ward and the college’s legal counsel to begin negotiations to purchase a property in downtown Manistee, in order to possibly create a satellite campus there.\nThe property is the former Glik’s building at 400 River St. in Manistee, which includes more than 13,000 square feet, with 370 feet of frontage on the Manistee River boardwalk. The list price of the building is $525,000, and the board authorized negotiations not to exceed that price.\n“This is not asking you to purchase the property at this point, it’s only setting us up to allow us to purchase this property (and) protecting our interest to purchase the property at a later date,” Ward told the board.\nThe project would be financially feasible because an anonymous donor has pledged to contribute $1 million to it; and because in the proposed plan, parts of the building would be leased to the Manistee Area Chamber of Commerce and Networks Northwest, which would generate revenue for the college and ensure the building is regularly staffed, according to Ward.\nDuring the negotiations period, the college would do its due diligence, including conducting a title review, land survey, appraisal and environmental site assessment, Ward said. The college can back out of negotiations at any time, for any reason, he added.\nThe board will make the final decision on whether or not to purchase the property during a future meeting.\nWSCC already has some programs at Munson Healthcare Manistee Hospital, but classroom availability is largely limited to evening hours and there is a sizeable demand for daytime classes, so the River Street building would provide additional daytime classroom space, according to Ward.\nTrustee Randy Tomaszewski told the board he’s in favor of exploring the idea of purchasing the building.\n“I think it’s a fantastic move that we consider it,” he said. “That’s an important part of our West Shore mission — to take care of our student body here in Mason County and in the Manistee area. It’s a tremendous opportunity.”\nOTHER BUSINESS\nThe board also approved a policy change to prohibit all smoking, vaping and use of all tobacco products on campus, starting this summer. Tobacco use will still be allowed in private vehicles, and also on campus with prior administrative approval. The new policy will be implemented on June 1. Until then, the college’s current policy is to prohibit smoking within 50 feet of building entrances.\nThe board also modified the college’s policy and procedure for cancelling or delaying classes and closing campus due to hazardous weather to allow administration to use the closure of other local public institutions, such as K-12 schools, as a determining factor in WSCC’s decision.", "url": "https://apnews.com/a1de764dee0d4aeaa0105fd19e814829"}