{"authors": ["Derrick O'Keefe", "Robert Hackett", "Shane Gunster", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Luke Savage", "Ethan Cox", "Gerard Di Trolio"], "date_download": "2020-05-04 19:50:02", "date_modify": "2020-05-04 19:50:02", "date_publish": "2019-04-26 00:00:00", "description": null, "filename": "2019_04_kinder-morgan-trans-mountain-pipeline-resistance_1588621802.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/04/26150418/GettyImages-1129037033.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_04_kinder-morgan-trans-mountain-pipeline-resistance_1588621802.html", "title": "How a Pipeline Fight Exposed Justin Trudeau’s Fake Progressivism", "title_page": "How a Pipeline Fight Exposed Justin Trudeau’s Fake Progressivism", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIn this era of far-right resurgence and escalating climate disruption, there are no shortage of reasons to despair about the future of the planet. But there is also cause for hope. The fossil fuel industry juggernaut can be stopped. The battle over expanding Kinder Morgan’s Trans Mountain pipeline (TMX) in western Canada is one example where David beat Goliath — and at least temporarily halted Goliath’s climate-destroying advance. When the corporate Goliath fled in defeat, however, the Canadian state stepped in to rescue the fossil fuel industry. Justin Trudeau’s Liberal federal government bought Kinder Morgan’s existing pipeline last spring and announced its determination to fully back and fund TMX’s export-oriented expansion. The move, which blindsided the pipeline’s opponents, has only upped the stakes around TMX — and thrust the issue into the national political debate as Canada heads toward a federal election later this year.\nThe Kinder Morgan Controversy Justin Trudeau’s Liberal government suffered a crushing blow to its image early this year, mere weeks after New York Times columnist Nicholas Kristof gushed that under the photogenic prime minister, Canada was “emerging as a moral leader of the free world.” With less than six months until the next federal election, Trudeau’s Liberals suddenly seem vulnerable to defeat. The immediate cause of their political crisis is a growing scandal over alleged political interference by the prime minister, his office, and other top government officials on behalf of the Montreal-based multinational corporation SNC-Lavalin. The company is facing criminal charges for corruption and bribery of officials in the now-deposed Gaddafi regime in Libya, and, in the recent past, has been found guilty of bribery and making illegal campaign contributions to both the Liberals and Conservatives. Who blew the whistle on this ugly mix of business interests and backroom politics? No less than Canada’s now-former attorney general and minister of justice, star Liberal member of parliament Jody Wilson-Raybould, the first indigenous person to hold that ministerial post and a former regional chief for the Assembly of First Nations in British Columbia (BC). After Wilson-Raybould was removed as attorney general and shuffled to a less prominent cabinet position, the Globe and Mail broke the story that she was allegedly subject to months of political interference in the SNC-Lavalin case. When Trudeau denied the media reports, Wilson-Raybould resigned from the cabinet. Then on February 27, Wilson-Raybould delivered a powerful testimony to a parliamentary justice committee detailing the pressure she’d received from Trudeau and ten other top government officials to overrule the public prosecutor and offer SNC-Lavalin a deferred prosecution agreement. Following weeks of growing controversy, on April 2 Trudeau expelled Wilson-Raybould and Jane Philpott, a cabinet member who resigned in solidarity with the former attorney general, from the Liberal Party caucus. The revelation of a prime minister allegedly meddling with the judicial system to help his rich corporate friends would be bad enough — but it comes on top of a number of reversals and hypocrisies on everything from electoral reform to climate and indigenous issues. The key example of the latter two was the Liberals’ decision to buy Kinder Morgan’s Trans Mountain pipeline last spring, in the face of massive and unprecedented opposition from First Nations, environmentalists, and local communities (including city governments) in British Columbia. Kinder Morgan is a corporation co-founded by former Enron executive and major GOP funder Richard Kinder. After purchasing the Trans Mountain pipeline in 2005, Kinder Morgan proposed expanding the pipeline network to carry tar sands bitumen from northern Alberta to terminal in Burnaby, a suburb of Vancouver. With global oil prices high, it seemed like a slam dunk. After all, corporations in Canada’s fossil fuel sector enjoy many political advantages: allied political parties and governments, especially in Alberta and, increasingly, Ottawa; an industry-captured regulatory agency, the National Energy Board; friendly think tanks and corporate media outlets, particularly PostMedia, Canada’s largest newspaper chain; a close relationship with other corporate sectors, including Canada’s major banks; huge resources for lobbying government and launching advertising and social media campaigns; and the exaggerated promise of jobs, jobs, jobs. It was not to be. Faced with legal, political, and economic uncertainties, and hit with opposition from both grassroots movements and the BC government, Kinder Morgan announced it would abandon the project in 2018. To most observers’ surprise, however, Trudeau’s government decided to purchase the megaproject outright, paying $4.5 billion for an existing pipeline and guaranteeing federal political support for the expansion. Just months after the Liberals spent billions bailing out Kinder Morgan, the Federal Court quashed the government’s approval of the pipeline expansion, in part due to insufficient consultation with First Nations. Nevertheless, the Liberal government doubled down — exposing the limits of its bright and shiny climate commitments and revealing that when indigenous nations clashed with Big Oil, it would put corporate interests first.\nThe Opposition in British Columbia Canada’s west coast has long been home to vibrant progressive movements. British Columbia was the birthplace of Greenpeace, and it boasts a tradition of civil disobedience, mass protest, and left parties. The current minority BC government, for example, is the result of a parliamentary agreement between the social-democratic New Democatic Party (NDP), which campaigned on a platform of “using every tool in its toolbox” to stop TMX, and the Green Party. BC is the first major jurisdiction in North America where Greens have held the balance of power in government, and although the party’s politics are very mixed, its elevation of “green issues” into the public discussion shoudn’t be minimized. But political elites have never been the driving force behind opposition to TMX. The movement, contrary to the traditional image of white environmentalists, has largely been led by indigenous people. A number of First Nations in British Columbia, a province in which the majority of the land was never ceded through agreement or treaties with indigenous nations, continue to oppose the tar sands pipeline. This includes nations like the Tsleil-Waututh and Squamish, whose territories and waters include the land through which the pipeline terminal would run and inlet through which export tankers would travel. The First Nations opposed to TMX are a powerful legal obstacle to the pipeline and the petro-state actors behind it, but they also embody a strong moral commitment — providing inspiration to the movement and reshaping politics in BC and Canada. Many local municipal governments have followed the lead of indigenous nations in opposing TMX, and in many cases it has proven to be a successful ballot issue. In 2014, the Union of British Columbia Municipalities, an influential umbrella group of the province’s local governments, passed a number of resolutions raising concerns about Kinder Morgan’s pipeline expansion. Since then, opposition from municipal politicians and local governments has proliferated, led by the municipal governments across the province including in Vancouver and Burnaby. And many other municipalities have expressed concerns about the pipeline plans, with some demanding additional compensation for infrastructure work.\nIndependent Media Another significant resource for opponents of the Trans Mountain pipeline is the rich field of independent media in British Columbia and its editorial decision to prioritize coverage of the fight against TMX. Over the past two decades, Metro Vancouver in particular has sprouted award-winning digital upstarts like the Tyee and National Observer, news-magazines that each boast hundreds of thousands of unique visitors per month. They take their place alongside older print-based “alternative” media like the Georgia Straight weekly and Common Ground monthly. The perceived weakness of the region’s corporate media, particularly the two right-leaning dailies owned by PostMedia, helped create an opening for such alternatives. A recent study for the Canadian Centre for Policy Alternatives, a progressive policy institute, explored the differences between corporate and independent media coverage of pipeline controversies, particularly TMX. While the corporate papers could hardly ignore protests and dissident messages, they still typically emphasized extractivist themes: job creation and other economic benefits, pipeline safety, the legitimacy of the approval process, pipelines as in the public interest, the continued need for fossil fuels, the illegitimacy of opposition, etc. The noncorporate independent daily outlets, on the other hand, were found to provide a counternarrative: the power of Big Oil imperils democracy; the approval process was flawed; the pipeline could accelerate climate change and bring other environmental risks (tanker spills, pipeline ruptures, tank-farm fires); it tramples First Nations’ rights. Alternative media were also more likely to give a platform to First Nations spokespeople, environmental groups, and protesters. Another crucial difference: alternative media have been far more willing to expose the gaps and flaws in the economic case for TMX. Energy analysts like Andrew Nikiforuk, Robyn Allan, and J. David Hughes have made a number of counterarguments, including the following telling points: Proponents have greatly exaggerated the losses to the Canadian economy from not building the pipeline. The differential between the international price of crude oil and Alberta’s lower-priced bitumen-based “heavy” oil only applied to a fraction of the Sands’ output — and the differential is driven by other factors, such as overproduction and a lack of upgrades in quality.\nThe notion that tar sands pipeline capacity is critically low is over-hyped. By the time TMX could be built, there would likely be excess pipeline capacity for exporting bitumen from the sands. Relatedly, existing infrastructure is inefficiently used.\nContrary to the much-hyped idea that Alberta’s purported economic crisis is the result of a pipeline bottleneck, the province’s woes are actually the product of bad policy — such as very low royalty rates and overly rapid development of the Sands, outstripping infrastructure and creating a market glut. The reality of these economic challenges may help explain why no private-sector corporation jumped at the chance to buy the existing Trans Mountain pipeline when the Canadian government tried to offload it in 2018. Instead, the public was left (for now) paying $4.5 billion — a bill that the pipeline expansion could at least triple. Of course, alternative media’s pipeline coverage wasn’t flawless. It did little to challenge the paralyzing trope that jobs and environmental protection are mutually exclusive. Nor did it give much voice to fossil fuel workers and unions, who could offset the pro-corporate tendencies of a commercial press and put forward their potent alternative — a “just transition” that would boost workers’ participation, job retraining, and other measures to reduce economic insecurity in resource communities. Muffling labor in the media has allowed fossil capital to shape the public debate by painting a skewed picture of workers’ interests.\nBig Oil: A Many-Headed Hydra The extraction and export of the Alberta tar sands’ massive deposits has exploded since the early 2000s, but their future expansion or contraction depends on the strength of social movements — as well as the price of oil and the state of global and US energy markets. For the past half-dozen years at least, major environmental and climate organizations in Canada have poured significant resources and strategic energy into battles against proposed tar sands pipelines. The idea is that pipelines represent “chokepoints” that can be used to halt the expansion of the tar sands. Yet while slowing or stopping new pipelines affects the speed of tar sands development, the effort can feel Sisyphean. Every time one pipeline project is chopped off, the oil industry sprouts a replacement. Many have likened this to a game of “whack-a-mole,” but an even better analogy might be a many-headed hydra. Particularly with the past year’s resurgence in world oil prices, new pipelines are bound to keep attracting investors despite the determined efforts of anti-pipeline activists. It also appears pipeline proponents have learned from their mistakes. Take, for example, the proposed Eagle Spirit pipeline, which, at $16 billion and a capacity of 2 million barrels a day, would dwarf the size and scale of TMX. Eagle Spirit has contingency plans to evade the legislated “Tanker Ban” on BC’s north coast introduced by the federal Liberal government. If no work-around can be found in Canada, Eagle Spirit plans to locate the pipeline’s terminal and export port in a small town on the Alaska panhandle adjacent to BC. And who is Eagle Spirit’s chairman? Calvin Helin — a member of the Lax Kw’alaams First Nation.", "url": "https://jacobinmag.com/2019/04/kinder-morgan-trans-mountain-pipeline-resistance"}