{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:15:02", "date_modify": "2020-05-04 20:15:02", "date_publish": "2019-05-22 05:00:00", "description": "( Family Features ) Weeds are opportunists that take advantage of bleak growing conditions to set root. If you've ever seen a weed growing out of a crack in your driveway or other paving, you know...", "filename": "_4c9fc6395a364c2e8f089a61ba758b86_1588623302.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4c9fc6395a364c2e8f089a61ba758b86_1588623302.html", "title": "9 Troublesome Weed Zones to Tackle", "title_page": "9 Troublesome Weed Zones to Tackle", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "( Family Features ) Weeds are opportunists that take advantage of bleak growing conditions to set root. If you’ve ever seen a weed growing out of a crack in your driveway or other paving, you know that weeds, by nature, can adapt to almost any spot.\nAs you work to get your yard in shape, keep an eye on the following areas that often offer ideal conditions for weeds to grow and reproduce.\nPathways. Paths made from loose materials, such as bark mulch, decomposed granite or stones, can act as seeding beds, offering a natural spot for weeds to grow.\nUnderneath shrubs. Areas under shrubs can be hard to reach, shady and moist – a perfect place for weeds.\nUnpaved drives and parking areas. Whether grassy, muddy or filled with gravel, these areas often roll out the welcome mat for weeds.\nCracks and crevices. Cracks between paving stones, bricks or slabs of concrete provide natural entry points for weeds. If the weeds are not dealt with, roots can lift pavers or bricks, creating dangerous uneven spots while potentially ruining the clean look of your patio or walkway.\nBeneath decks. Despite sparse sunlight, weeds may still grow under decks.\nAround downspouts. Weeds often thrive at the base of downspouts where moisture is abundant. Heavy rains can wash seeds from these weeds into other areas of your yard.\nAlong fences and foundations. Often out-of-sight and out-of-mind, these areas are natural spots for weed build-up.\nFreshly tilled soil. Anytime you turn soil or an animal digs a hole, you expose buried weed seeds, creating an area to watch for new seedlings.\nOpen soil. Keep a close watch on your yard for dead spots or open areas. Fill them in as soon as you can, adding new plants, seeds or mulch. Bare spots in lawns should be over-seeded with desirable grass seed. In new plantings, cultivate often to uproot new weed seedlings.\nThere are many ways to control weeds, including hand-pulling, hoeing, mulching or using herbicides. People often try homemade, natural weed killers like vinegar to avoid herbicides. However, these “natural” techniques often don’t kill the roots of the weeds, so they quickly regrow. Alternatively, consider an environmentally friendly option like Natria Grass & Weed Control With Root Kill. You’ll usually see results within minutes and weeds are not likely to come back from their roots, unlike when using natural solutions.\nFor more information on controlling weeds, visit natria.com .\nPhoto courtesy of Getty Images", "url": "https://apnews.com/4c9fc6395a364c2e8f089a61ba758b86"}