{"authors": ["Donnette Beckett"], "date_download": "2020-05-04 20:10:04", "date_modify": "2020-05-04 20:10:04", "date_publish": "2019-10-21 22:21:51", "description": "DECATUR, Ill. (AP) — The job of an animal control warden isn’t often glorified. According to the job description, the officers' duties include investigating animal humane violations, animal...", "filename": "_04621f9562764796a1dd285c25437d27_1588623004.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_04621f9562764796a1dd285c25437d27_1588623004.html", "title": "EXCHANGE: Animal warden still has a soft spot after 35 years", "title_page": "EXCHANGE: Animal warden still has a soft spot after 35 years", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DECATUR, Ill. (AP) — The job of an animal control warden isn’t often glorified.\nAccording to the job description, the officers’ duties include investigating animal humane violations, animal bite incidents and removing and disposing of dead animals. They may also have to impound, and eventually euthanize, stray animals, all while resisting the urge to take them home.\nAfter 35 years, Paulette Smith has learned how to handle herself around Fluffy, Fido and their families.\n“It is stressful,” she said. “But I love to take care of the animals. And I love the people I work with.”\nMacon County Sheriff’s Department Sgt. Matt Reynolds is the administrator for the Macon County Animal Control and Care Center. He has witnessed Smith’s appreciation of her job. He admires her work as well.\n“She is very knowledgeable about her job,” he said. “And she works very well with the public and knows many people.”\nSmith, 58, has been employed with the animal shelter since 1984. “That is quite a long time,” Reynolds said. “She needed a little bit of recognition.”\nSmith has learned how to handle more than the animals. The people she encounters along the way can be a challenge as well.\n“People think we are just wanting to take their dog,” she said. “Most of the time when we pick up dogs off the streets, we try to find the owners before we bring them to the shelter.”\nIf an information microchip has been found embedded in a lost animal, Smith will return the animal to its owner once the shelter employees retrieve the information.\nAlthough the temptation to rescue an animal for herself is there, Smith has resisted and owns only one dog. However, before she became a mother to her son 29 years ago, she had less control.\n“I had about 10 animals,” she said. “My landlord let me keep them in the backyard.”\nIn the past, Smith’s jobs included employment as a kennel worker and a highway worker. Her current job as an animal warden is her favorite. “I love it here,” she said. “The people I work with, I get on their nerves, but I still love them.”\nAs a secretary at the animal shelter, Audra Bricker greets visitors as they enter the facility. She often encounters Smith as she is going from one call to the next.\n“She kids around a lot, but she doesn’t have a mean bone in her body,” Bricker said. “Her bark is worse than her bite.”\nThe two have discussed some of the situations Smith has encountered. “She can take a lot,” Bricker said. “Sometimes they (people) can be a little confrontational. Paulette knows how to soothe them.”\nSmith admits the work can be stressful, but she stays positive with a sense of humor and good attitude.\n“It’s pretty rough out there. You get cussed out and threatened,” she said. “You just have to kill them with kindness, because I still have to do what I have to do.”\n___\nSource: (Decatur) Herald & Review, https://bit.ly/2VZfVkT\n___\nInformation from: Herald & Review, http://www.herald-review.com", "url": "https://apnews.com/04621f9562764796a1dd285c25437d27"}