{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:11:21", "date_modify": "2020-05-04 20:11:21", "date_publish": "2019-01-21 06:00:00", "description": "( Family Features ) Whether circumstances are good or bad, exciting or stressful, there are several simple ways to improve emotional and mental fitness. As one example, sharing a hug with a...", "filename": "_73965a0731044034aabb340d96a4fa6b_1588623081.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_73965a0731044034aabb340d96a4fa6b_1588623081.html", "title": "Hug More, Stress Less", "title_page": "Hug More, Stress Less", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "( Family Features ) Whether circumstances are good or bad, exciting or stressful, there are several simple ways to improve emotional and mental fitness.\nAs one example, sharing a hug with a loved one has been found to boost immune system responses, help fight disease and increase overall health, according to an article published by “The Guardian.” Hugs increase serotonin, which is the body’s natural antidepressant, can be a natural sleep aid and help reduce stress and anxiety.\nHowever, according to the article, hugs are on the decline. Among the reasons for this decline in hugging are busy schedules and the prevalence of technology extending the workday into time spent at home. It can be hard to focus on personal connections when work follows you home in your pocket. At times, it seems there are stronger connections to mobile devices than family members sitting in the same room.\nThere is a simple solution, though. In honor of National Hug Day, you can get back to showing love through the simple act of hugging.\nWith the help of its mascot, Seymore Good, Tree Top encourages everyone to “squeeze the day” and acknowledge goodness in others by sharing a meaningful, honest hug. The grower-owned fruit cooperative that uses simple ingredients and real fruit also introduced innovative clear apple sauce pouches that let parents “See the Good” in what their kids are eating before they eat it.\nIn the spirit of reducing stress and giving meaningful, memorable hugs, consider these tips:\nKeep it real. Avoid superficial hugs or giving a hug just out of habit. Instead, try focusing on the hug and giving it with purpose, as an expression of friendship. Squeeze hard, but not too hard.\nTake a breath. Once you are in the hug, pause for a moment and breathe. Just one breath. This is where you have the chance to squeeze a little longer. Go ahead and be a little vulnerable. In the moment, remember who you are hugging and why you are hugging him or her. This is a moment when the healing power of the hug can shine through, and a hug or squeeze is a sign of affection and trust.\nLet it go. Be sensitive to the movements of the person you are hugging and be willing to be the first to let go. Leave the embrace with a smile on your face, even in the hardest moments of life. Always let the person you are letting go of know you are happy.\nVisit treetop.com for more information.\nPhoto courtesy of Getty Images", "url": "https://apnews.com/73965a0731044034aabb340d96a4fa6b"}