{"authors": ["Chris Peterson Hungry Horse News"], "date_download": "2020-05-04 20:28:50", "date_modify": "2020-05-04 20:28:50", "date_publish": "2019-05-18 05:00:01", "description": "Two big school construction projects are on the horizon in Columbia Falls, including a new school at Glacier Gateway and a remodel of Ruder Elementary. The Columbia Falls School District...", "filename": "_16fe3f45632b4122b958c5bbf2c9bdf8_1588624130.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_16fe3f45632b4122b958c5bbf2c9bdf8_1588624130.html", "title": "C-Falls to seek voter approval for school projects", "title_page": "C-Falls to seek voter approval for school projects", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Two big school construction projects are on the horizon in Columbia Falls, including a new school at Glacier Gateway and a remodel of Ruder Elementary.\nThe Columbia Falls School District this week approved that plan as recommended by the district’s Long Range Planning Committee. The final plan comes after the committee met on the project and toured the district’s three elementary schools over the past eight months or so.\nThe project estimated combined price tag is about 22 million.\nBut the board didn’t talk about the costs much at its Monday night meeting because the estimated costs at this point could change. For example, there’s still talk about rolling the expense of a secured entrance to the junior high school into the bond and plans for new soccer and other fields adjacent to Ruder could also be folded in.\nThe orientation of the schools themselves could even change.\nTrustee Michael Nicosia noted the Gateway plan currently has the school facing the Truck Route, and he openly expressed concern about the safety of that option.\nThe board is expected to narrow down, or expand the project, as the case may be, in the next month or so. A solidified bond request is expected in July, with a vote in September.\nRight now, a 237 annual tax bill on a home assessed at 400,000 assessed home would see a tax bill of 12 million junior high bond issue. That bond is paid off in 2020.\nAccording to L’Heureux Page Werner Architecture’s Steve L’Heureux, the upgraded facilities would not only provide a better learning environment for local elementary students, but also help draw families to the district, he said on Wednesday during the last long range planning meeting.\n“There are a couple of messages that are sent when trying to upgrade school facilities. It’s all about trying to create a quality, safe and secure environment for learning. It shows that the community is willing to invest in those sorts of things. It will make people want to come here,” he said.\nWhile the project looks to build a brand new school at Gateway, it still leaves the old junior high standing. There is talk about offering it to the Boys and Girls Club, but the club doesn’t seem to be interested in that. The new Gateway building would include secure entrances, including a separate kindergarten entrance. It would also have interior courtyards. The Ruder plan also creates a new entrance, a dining area, adds classrooms adjacent to the gym, adds a library and media center, a music room and a teacher’s lounge.\nThe plan, at least at this point, doesn’t integrate the project with a Boys and Girls Club facility that organizers are planning to build just north of the school.\nThe district needs the space - the two elementary schools are packed with students.\nBut critics of the plan say the district needs to reopen Canyon Elementary School in Hungry Horse, which is largely vacant, save for a community health center. Canyon was closed several years ago when enrollment dipped.\nSchool officials maintain reopening Canyon Elementary would be a costly proposition, and it still wouldn’t solve the needs at the other two schools.", "url": "https://apnews.com/16fe3f45632b4122b958c5bbf2c9bdf8"}