{"authors": ["Sam Gindin", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:55", "date_modify": "2020-05-04 19:51:55", "date_publish": "2019-03-06 00:00:00", "description": null, "filename": "2019_03_sam-gindin-socialist-planning-models_1588621915.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/03/06093405/mondragon_vote.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_03_sam-gindin-socialist-planning-models_1588621915.html", "title": "We Need to Say What Socialism Will Look Like", "title_page": "We Need to Say What Socialism Will Look Like", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "This article is reprinted from Catalyst: A Journal of Theory and Strategy, a publication from the Jacobin Foundation. Right now, you can subscribe to the print edition of Catalyst for just $20.\nWhen, some four decades ago, Thatcher arrogantly asserted “there is no alternative,” a confident left might have turned that declaration on its head by adding “yes, there is indeed no real alternative — under capitalism.” But no such left existed. The radical left was too small to matter, and social-democratic parties had by then long retreated from advocating socialism as a systemic option. Over the intervening decades steps towards a radically egalitarian and democratic transformation of society have, in general and in spite of the advent of a vague “anticapitalism,” further receded. Of the two central tasks the making of socialism demands — convincing a skeptical populace that a society based on public ownership of the means of production, distribution, and communication could in fact work, and acting to end capitalist rule — the overwhelming focus of those still committed to socialism has been on the political battle to defeat capitalism. What the society at the end of the rainbow might actually look like has, with some notable exceptions, tended to receive only rhetorical or cursory attention. But in the gloomy shadow of socialism’s marginalization, the cavalier assertion of socialism’s practicality will no longer do. Winning people over to a complex and protracted struggle to introduce profoundly new ways of producing, living, and relating to each other demands a much deeper engagement with socialism’s actual possibility. For socialists, establishing popular confidence in the feasibility of a socialist society is now an existential challenge. Without a renewed and grounded belief in the possibility of the goal, it’s near impossible to imagine reviving and sustaining the project. This, it needs emphasis, isn’t a matter of proving that socialism is possible (the future can’t be verified) nor of laying out a thorough blueprint (as with projecting capitalism before its arrival, such details can’t be known), but of presenting a framework that contributes to making the case for socialism’s plausibility.\nWhen Hope “Rings Oddly in Our Ears” The Communist Manifesto’s famous rebuke of the utopians for spending their time on “castles in the air” went beyond the tension between dreaming and doing, though it of course spoke to that as well. In underscoring that one’s visions and corresponding actions need to be grounded in an analysis of society and identification of social agency, Marx and Engels introduced what amounted to an early exposition of historical materialism. Without a historical lens, they argued, the utopians simultaneously lagged and yet prematurely raced ahead of history: lagged in missing the significance of a newly emerging revolutionary actor, the proletariat; rashly raced ahead in absorbing themselves with detailing a distant world that could then only be imagined in the most general and abstract terms. This deeper critique of utopianism discouraged future generations of revolutionary socialists from serious engagement with the feasibility of socialism — a reluctance that, as noted, largely persists today. The orientation of socialist politics turned to analyzing the political economy of capitalism, grasping its dynamics and contradictions, and facilitating the formation of the dispossessed into a coherent class with the potential to remake the world. Only in the process of fighting to transform capitalism, Marxists insisted, could the collective capacities for building socialism emerge, and only in the process of confronting the new dilemmas thrown up, might institutional solutions surface. Such an orientation is clearly indispensable to the socialist project. The intent here is certainly not to belittle it. Yet it doesn’t justify, especially in the current conjuncture, the common Marxist disdain for utopian contemplations. In the wake of the profound defeat of the socialist left and the consequent widespread fatalism over transformative alternatives, it’s not enough to focus on getting there. It is now at least as important to convince prospective socialists that there really is a “there” to get to. Looking back, the warnings of Marx and Engels against fixation on an unknowable future have a convincing air about them. At that early stage of capitalism, the car — never mind the airplane, electronic computer, and internet — had not yet been invented. Trade unions were just appearing, universal suffrage was still an epoch away, the modern state wasn’t yet recognizable, and above all the Russian Revolution and the new questions it posed had not yet burst onto the political stage. To have debated then what socialism might later look like certainly does, in retrospect, confirm how presumptuous it would have then been to devote much attention to the workings of a socialist society. Moreover, capitalism’s relative youth at the time of the Manifesto left that period comparatively more open to envisioning its rejection: the barriers of traditional cultural, religious, and family ties blocked capitalism’s full sway and the absorption of the working class into the new social system remained incomplete. In the decades after 1873, the year that Marx coined the derisive catchphrase “writing recipes for the cook shops of the future,” socialism was in the air in a way that it no longer is today. Socialism was widely discussed among workers, and in London it was “fashionable for even West-end dinner parties to affect an interest in and knowledge of it.” Mass socialist parties were emerging across Europe and this was widely followed, whether anxiously or hopefully. In the US, though a mass socialist party never took hold, the second half of the nineteenth century ushered in a “long era of anti-capitalism” that included an “urge to overthrow the new order of things.” This openness to socialism persisted after World War i. As the preface to a newly translated work of Karl Polanyi on socialist accounting notes, in the early 1920s Polanyi was “just one of many social scientists who found accounting, prices, and socialism to be the most exciting topic of the day.” Surprisingly, this attitude existed even within neoclassical economics, which had emerged in the shadow of the Paris Commune essentially as a counter to Marx. At the end of the 1920s the president of the prestigious American Economic Association began his keynote by declaring that “Like most teachers of economic theory, I have found it quite worthwhile to spend some time studying any particular problem at hand from the standpoint of a socialist state.” In going on to address how a society without private ownership of the means of production might determine prices and allocate resources, he confidently asserted that its authorities “would have no difficulty finding out whether the standard valuation of any particular factor was too high or too low,” concluding that “this much having been learned, the rest would be easy.” Later, Murray Rothbard, a lifetime disciple of the archconservative Ludwig von Mises, lamented that when he entered grad school after World War ii “the economics establishment had all decided, left, right, and center, that … socialism’s only problems, such as they might be, were political. Economically, socialism could work just as well as capitalism.” With socialism carrying such a degree of economic credence, the elaboration of the details of a functioning socialist society seemed decidedly less pressing for socialists than developing the politics of getting to it. But such openings to a different world, however qualified, have today strikingly contracted. Erik Olin Wright begins his monumental treatise on “real utopias” by wistfully recalling that “There was a time, not too long ago, when both critics and defenders of capitalism believed that ‘another world was possible.’ It was generally called ‘socialism.’” Wright continues on to lament that “Most people in the world today, especially in its economically developed regions, no longer believe in this possibility.” The oft-noted paradox of our time is that even as popular frustrations with capitalism intensify, belief in transformative alternatives continue to languish. There is clearly an appetite for change and the discourse of “anticapitalism” pervades protests, but the elevated language of hope in a systemic alternative “rings oddly in our ears.” The persistence and even strengthening of capitalism through great crises seems to further verify its permanence. The Manifesto’s faith in “capitalism’s grave diggers” comes up against the atomization of workers, the depth of their defeats, their multidimensional integration into capitalism, and their painful inability to defend past gains — never mind advance radical agendas. The overwhelming prospect of taking on a global capitalism that seems beyond the purview of any particular state seemingly leaving us with no tangible target, reinforcing the now pervasive cross-generational sense that “there is no alternative.” If we add the betrayals of Third Way social democracy, the fateful collapse of the Soviet Union, the Chinese road to capitalism, the failures of other twentieth- and twenty-first-century revolutions that occurred in the name of socialism, and the recent political reversals in Latin America and Europe (Corbynism perhaps being an exception), it becomes clear that “radical change” is more often than not a calling card of the Right. Today the zeitgeist that no alternative to capitalism is possible seems, some stubborn pockets aside, settled. The liberatory confidence that the Manifesto radiated has been replaced with a ubiquitous skepticism of transformative possibilities. In these dispiriting times the need for structures to more effectively organize and mobilize struggles is clear enough, but transcending pessimism and reviving revolutionary hope needs an animating vision as well, a utopia that is both dream and possible reality. A good number of Marxists have indeed increasingly argued that far from seeing the preoccupation with alternatives negatively (a diversion), it is the very absence of alternatives that contributes to the Left’s marginalization. This has led them to mine Marxist political economy for insights to the “concept of alternatives.” Yet as insightful as such work is, in today’s discouraging context it remains too conceptual to revive and popularly spread the socialist idea. Going beyond the frustrations and demoralization wrought by capitalism demands a more expanded and convincing defense than we currently have of socialism’s practical possibilities. However valid Marx and Engel’s historical criticism of the utopians may have been for their era, there is a compelling case — equally historically driven — to take a different turn in our times. Developing a more systematic consideration of socialism’s possible functioning, even if what we offer remains relatively general, incomplete, and even speculative, has today become a requirement for reviving a receptivity to achievable utopias and the willful action to achieve them. As Robin Hahnel recently asserted, without a plausible alternative “we cannot expect people to take the risks necessary to change things” nor “forge a strategy of how to get from here to there.” An institutionally elaborated alternative is now elemental to encouraging social movements to press beyond protest, to sustaining socialists who are wavering, and to recruiting the newly discontented. Such an alternative has, in Ernst Bloch’s poetic capture of both despair and hope, become an indispensable spur “to make the defeated man try the world again.”\nSubmerging Socialist Contradictions On those occasions when Marxists have engaged the nature of a future socialist society, they too often shied away from problematizing future difficulties in favor of assuring the unconvinced that the difficulties involved in the construction of a socialist society had been vastly exaggerated. Yet working people well understand from their experience of capitalism that building a new society will be far from simple. To engage those that we expect to lead in the making of socialism by misleading them about the difficulties involved is patronizing and ultimately self-defeating. What is instead needed is an honest presentation of the risks, costs, and dilemmas the socialist project will face, alongside credible examples and promising indications of how the problems might be creatively addressed. The primary quandary of socialism lies in how to concretely manifest social property in the means of production. Can workers run their workplaces? If social property is organized through the state, where does worker control fit in? If social property is divided among worker collectives, how do the particular interests of each collective mesh with the social interest? And can these fragmented collectives counteract the centralized power? That is, can the concentrated power that comes with comprehensive planning be democratized? Such dilemmas — contradictions may be more apt — cannot be conjured away by appealing to the further development of the productive forces inherited from capitalism, whether that involves the “end of scarcity” or the explosion of computer power, artificial intelligence, and big data. Nor can they be resolved through expectations that the experience of “revolutionary praxis” in the course of ending capitalism will bring a level of socialist consciousness that similarly disposes of such questions. And neither can concern with the concentration of power in the central plan be escaped by asserting — on the basis of some combination of the end of scarcity, higher social consciousness, and a hoped-for democratization — the “withering away of the state.” Scarcity — the need to make choices between alternative uses of labor time and resources — is unlikely to end outside of utopian fantasies because popular demands, even when transformed into collective/socialist demands, are remarkably elastic: they can continue to grow. Think especially of better health care, more and richer education, greater care for the aged, the expansion of art and of cultural spaces — all of which require labor time and generally also complementary material goods. That is, they demand choices. Furthermore, the calculation of scarcity can in particular not ignore leisure, with leisure representing the “realm of freedom.” Even if we produced enough of what we wanted, as long as some of that labor isn’t completely voluntary but instrumental, then effective scarcity of either labor time or the good/service remains. Workers may even like their jobs and see them as a source of creative expression and satisfaction, but as long as they’d periodically prefer to not show up or leave early, some further inducement is needed to offset the sacrifice of providing those labor hours. That inducement is a measure of the persistence of effective scarcity. And once scarcity is acknowledged as an inherent and essentially permanent frame in the restructuring of society, the question of structured incentives becomes paramount. This is not just a matter of motivating adequate hours of work, but of affecting its intensity and quality, and influencing where that work is best applied (i.e., determining society’s overall division of labor). As for the saving grace of computer power, its role in inventory control and the logistics of just-in-time delivery as well as the breathtaking potentials of big data and artificial intelligence would undoubtedly help solve specific planning problems. Perhaps even more significant are the exciting possibilities of reconfiguring computer power so it provides decentralized information to facilitate the decisions of worker collectives and links them to other workplaces. Nevertheless, computers cannot be depended on to solve the overall problems of socialist planning. This goes beyond contestation over whether future breakthroughs in computing power will be able to cope with the voluminous data involved in the simultaneous interactions and vicissitudes of a living society. It is also that the output computers give us depends entirely on the quality and completeness of the information going in (garbage in, garbage out), something more powerful computers alone cannot resolve. This is not a secondary issue. A commonly noted dysfunction in Soviet-style planning was the systematic withholding of accurate information by both managers and workers. Since the annual production in any year influenced the target for the following year, and a lower base target allowed for more easily achieving the subsequent bonuses, workplaces conspired to hide actual productive potentials. Friedrich Hayek, the economist-philosopher and Thatcherite hero, pointed to such perverse incentives to reinforce his argument that socialism simply had no structures adequate to generating the existing and potential information and knowledge that is indispensable to the functioning of a complex society. And even if this were ameliorated and a coherent plan established, it still doesn’t follow that the plan will be implemented. In capitalism the competitive discipline to follow the rules is, for all its problems, integrated into that process of gathering, disseminating, and applying of information. Under socialism the center can, in the name of fulfilling the plan, instruct management or work councils to act according to certain directives — but what if they choose not to? Higher levels of consciousness seem an obvious answer here. In this regard, the edifying impact of participating in the defeat of capitalism is unquestionably central to the construction of the new society. The escape from the debilitating resignation wrought by capitalism and the exhilarating discovery of new individual and collective capacities are clearly indispensable to advancing the building of socialism. But absent appropriate incentive structures and related mechanisms fully able to access accurate information, the heady moment of revolution cannot be sustained and extrapolated to consolidating a socialist society. To start, there is the generational problem. As time goes on fewer people will have experienced the revolution’s rousing élan. Then there is the reality that the skills and orientations developed in the course of political mobilization to defeat one kind of society don’t necessarily match the democratic sentiments and governance skills required for constructing a new society. Moreover, even among the revolution’s original participants, the heightened consciousness of that moment can’t simply be projected into the ensuing, more mundane world of meeting daily needs. As these workers become the new administrators of society, it can’t be assumed that questions of bureaucracy and self-interest will inevitably fade into yesterday’s problems. Christian Rakovsky, a participant in the Russian Revolution and later a dissident internally exiled under Stalin, keenly noted this corrosion of the revolutionary spirit. “The psychology of those who are charged with the diverse tasks of direction in the administration and the economy of the state, has changed to such a point that not only objectively but subjectively, not only materially but also morally, they have ceased to be a part of this very same working class.” This, he argued, was true in spite of a factory director being “a communist, in spite of his proletarian origin, in spite of the fact that he was a factory worker a few years ago.” He concluded, with some despondency, that “I do not exaggerate when I say that the militant of 1917 would have difficulty in recognizing himself in the militant of 1928.” While this reflects the special circumstances of the Russian experience, it would be a mistake to ignore the vulnerability of all revolutions to such regressions. Crucially, even with the heroic assumption that universal socialist consciousness has been achieved, the question remains of how individuals or workplace collectives limited by their own fragmented locations figure out what the right overall thing to do is. The highest levels of socialist consciousness cannot, in themselves, answer this dilemma. It is one thing to assert that workers will make the decisions but how, for example, would workers in an appliance plant weigh whether to increase their use of aluminum as opposed to leaving that aluminum for more valuable social purposes elsewhere? Or in deciding how to allocate their year-end “surplus,” how much should be reinvested in their own firm versus other firms? Or if a group of workers wanted to exchange some income for shorter hours, how could they measure and compare the benefits to themselves versus the loss of product or services to society? Hayek argued that a good part of such knowledge is “tacit” or latent knowledge — informal knowledge about consumer preferences and production potentials that is often not explicitly appreciated even by the social agents directly involved. It only surfaces through reactions to particular institutional constraints, incentives, and opportunities such as, in Hayek’s telling, individual choices made via markets and pressures to maximize profits. This includes “discovered knowledge” — information only revealed post hoc through the process of competition among firms, e.g., which of a number of alternative goods, machines, services, or forms of work organization is superior. The power of capitalism, Hayek claimed, is that it brings such otherwise internalized, hidden knowledge to the surface while socialism, no matter how much it hopes to plan, cannot effectively access or develop the knowledge on which successful planning would rest. For all its inherent ideological and class biases, this critique can’t be ignored. Hayek cannot be countered by arguing that capitalists themselves plan. Aside from the fact that the scale of organizing a total society in a nonmarket way is of a different order of magnitude than addressing a single, even vast, corporation, internal corporate calculations under capitalism have an advantage that centralized socialist planning would not have: they have external market prices and market-driven standards by which to measure themselves. More fundamentally, corporate planning is based on structures that give management the flexibility and authority to allocate and employ labor. To plan in a way that is instead based on worker control involves a completely new productive force — the capacity to democratically administer and coordinate workplaces. The expectations of full or near-full abundance, added to perfect or near-perfect social consciousness, have a further consequence: they imply a dramatic waning, if not end, of substantive social conflicts and so do away with any need for an “external” state. This fading away of the state is, as well, rooted in how we understand the nature of states. If states are reduced to only being oppressive institutions, then the democratization of the state by definition brings the withering away of the state (a “fully democratic state” becomes an oxymoron). On the other hand, if the state is seen as a set of specialized institutions that not only mediate social differences and oversee judicial discipline but also superintend the replacement of the hegemony of class and competitive markets with the democratic planning of the economy, then the state will likely play an even greater role under socialism. This is more than a semantic issue. An orientation to the disappearance of the state tends to pass over a whole range of issues: the state’s effectiveness; balancing state power with greater participation from below; how to initiate experiences and learning that would not rest so heavily on the original praxis of introducing socialism but constitute a constant praxis that fosters socialist education, consciousness, and culture. Accepting the persistence of the state turns the focus to the transformation of the inherited capitalist state into a specifically socialist, democratic state that is central to the creative rethinking of all institutions. Even where the process of democratization includes the decentralization of some state functions, advancing postrevolutionary socialism may also include (as we’ll see) a need for an increase in the state’s other roles. It is, in short, one thing to build on the productive forces inherited from capitalism and the consciousness developed in the transition towards socialism, but quite another to place inflated socialist hopes on them — to see capitalism as socialism’s dialectical enabler. The extent to which capitalism’s productive and administrative achievements can be reproduced, adapted, and applied by nonspecialists in a democratic and socialized form is a question to be posed, not mechanically presumed. It is to concretizing this challenge that we now turn.\nSocialism and Markets At the heart of finding a way to manifest social property is the tension between planning and markets. In this section we insist that that this is not a matter of planning versus markets but of discovering creative institutional mechanisms that structure the proper place of planning and markets. Marx rightly argued that praising the voluntary and efficient nature of markets apart from the underlying social relations in which they’re embedded fetishizes markets. But markets are also fetishized when they are rejected as an absolute and treated as having a life of their own independent of those underlying relations. The place of markets under socialism is a matter of both principle and practicality — and dealing creatively with the contradictions between the two. Some markets will be banished under socialism, some welcomed, and some reluctantly accepted but with constraints on their centrifugal antisocial tendencies. Rejecting markets in favor of leaving decision-making to the central planners comes up against the fact that, as the Soviet central planner Yakov Kronrod noted in the 1970s, economic and social life are simply too diverse, too dynamic, and too unpredictable to be completely planned from the top. No amount of planning capacity can fully anticipate the continuous changes encouraged by socialism among semi-autonomous local groups, nor — given that many of those changes occur simultaneously with repercussions upon repercussions across workplaces and communities — respond without pronounced and disruptive lags. Putting too great a load on central planning can therefore be counterproductive; plans work best if they concentrate on a limited number of key variables and don’t overload themselves with too much detail. Moreover, the heavy hand of the “vast and complex administrative system of allocation” carries the threat, as illustrated in the former USSR, of a crystallization among those occupying the commanding heights of the economy — central planners, ministry heads, workplace managers — into what Kronrad called a self-reproducing “social oligarchy.” As that oligarchy pushes for compliance to its rigid plans it also brings forth increased authoritarianism and bureaucratization (Kronrod was not alone in this argument but was especially insistent on it). If the heavy hand is eased by instead setting “parameters” to be met, this means bonuses for conforming and penalties for underperforming. Such incentives bring market-like problems in a different form, one that may not even include some of the advantages of formal markets. Albert and Hahnel likewise reject markets but look to planning administered from below. Their creative and meticulous model is based on elected representatives from workplace collectives meeting with representatives from suppliers, clients, and the affected community. The community must be there because it has a stake in workplace decisions on the consumption side but also because of the impact of those decisions on roads, traffic, housing, environmental conditions, etc. Together these interested parties develop mutually agreed upon plans and since such plans would most likely not immediately match the broader supply and demand conditions in the economy, an iterative process of repeated meetings to come closer to balance could, they argue, ultimately close the gaps. This might work in specific cases, and perhaps become more significant over time as shortcuts are learned, computing innovations expedite the procedure, and social relations are built up. But as a general solution it is simply not viable. The context of scarcity, various interests, and no external arbiter of any kind is likely to lead to unending conflict rather than a comfortable mutual consensus. Given the larger interdependencies of production and consumption involved with their implications for a multitude of decisions being made and revised concurrently not just in sequence and each with cascading consequences, such a process could not help but lead to an oppressive tyranny of meetings. Markets will be necessary under socialism. But certain kinds of markets must be unequivocally rejected. This is especially so for commodified labor markets. The argument runs as follows. Planning — the ability to conceive what is about to be constructed — is a universal characteristic of human labor: “What distinguishes the worst architect from the best of bees is that the architect raises his structure in imagination before he erects it in reality.” A core critique of capitalism is that the commodification of labor power robs workers of that human capacity. Individual capitalists plan, capitalist states plan, and workers as consumers also plan. Yet in selling their labor power to get the means to live, workers as producers surrender their planning capacities and human potential to create. This original sin of capitalism is the foundation for the broader social and political degradations of the working class under capitalism. Yet the question of reallocating labor remains and, if workers are to have the right to accept or reject where to work, this implies a labor market of sorts. But this would be a labor market of a very particular, limited, and decommodified kind. Based on the need to attract workers to new sectors or regions, the central planning board would set higher wages (or more favorable housing and social amenities), adjusting them as needed if the workforce falls short. Within the wage framework set by the central plan, the sector councils could likewise raise wages to allocate workers across workplaces or into new ones. Workers could not, however, be fired nor lose work through competitive closures of workplaces and should there be a general shortage of demand relative to supply, demand could be stimulated or worktime reduced as the alternative to the creation of a reserve army to discipline workers. Alongside commodified labor markets being out of bounds so too must capital markets be prohibited. Choices over where investment goes are choices about structuring every facet of our lives and shaping future goals and options. Economic indices can be brought into making such decisions, but the common rationale for such indices — their ability to compare alternatives based on a narrow range of monetary economic criteria — is offset by the unquantifiable complexities of assessing what is to be valued. And though credit will exist under socialism in terms of providing credit for consumers, funds for individual or small co-op start-ups, or workplace collectives dealing with the gaps between buying and selling, financial markets based on the creation of financial commodities would have no place. On the other hand, who can imagine a socialism without a marketplace of coffee shops and bakeries, small restaurants and varieties of pubs, clothing stores, craft shops, and music stores? If the underlying conditions of equality are established so these markets are about personal preferences not expressions of power, there is no reason to be defensive about welcoming them. It is when we turn to the commercial activities of workplace collectives that the role of markets takes on their greatest, and most controversial, significance. In addressing the dilemmas involved in worker collectives operating through markets, it’s useful to begin with a quick sketch of a worker in a workplace collective under socialism. Outside of self-employment and co-ops with a handful of workers providing local services, workers control but do not own their workplaces. The workplaces are social property; ownership resides in municipal, regional, or national state bodies. Workers hold no workplace-based marketable shares to sell or pass on to their families — there are no private returns to capital under socialism. Though individual workers can leave their jobs and look for work elsewhere, workplace collectives cannot decide to shutter their workplaces since they aren’t theirs to close. If demand for the goods or services produced fade, the collective would be integral to conversion plans to other activities. Workers do not work for “others” but collectively organize their labor power with the after-tax surplus shared among them. Income wouldn’t be based on receiving “the fruits of your own (private) labor” since work is a collective, not private activity. Those working get pay for their work based on hours worked and the intensity or unpleasantness of the work. Everyone, employed or not, shares in a social wage — the universally free or near-free collective services distributed according to need (e.g., health, education, childcare, transportation) as well as subsidized housing and culture. Those not in the paid labor force receive a consumption stipend set at a level which allows people to live in dignity, and the distribution of each collective’s after-tax surplus would be distributed as either additional collective services and/or individual bonuses. (Employment would bring higher pay but, depending on postrevolutionary conditions and politics, the social wage plus a living income would make self-employment or work in a small co-op a practical option.) In the absence of income from capital, and with the social wage carrying great weight relative to individual consumption, the effective variation in the conditions of workers will lie in a relatively narrow, egalitarian range. (On reasonable assumptions the value of the social wage — free health care, education, transit, childcare, and subsidized housing and culture — would be at least three times that of individual consumption.) In this context, there will be concerns that prices reflect social costs such as environmental impacts, but beyond that there seems little cause for socialist angst over workers using their individual earnings to choose which particular goods or service they prefer. Nor is there much reason to worry about the existence of credit. With basic necessities essentially free, housing subsidized, and adequate pensions in retirement, pressures to save or borrow would largely be limited to different time preferences over the life cycle (e.g., saving for a trip at retirement or wanting an appliance now). As such, workplace or community credit unions, or for that matter a national savings bank may, under nationally supervised conditions and interest rates, mediate credit flows between lenders and borrowers with no threat to socialist ideals. Yet while the authoritarian market discipline imposed under capitalism will no longer exist, workplace collectives will still generally operate in a market context of buying inputs and selling their goods and services or, if the final product has no market price, of measurable output targets. Incentives to act in socially sensitive ways (such as operating efficiently) consequently remain necessary. This would take the form of a portion of the surplus generated by the collective going to its members as collective goods (housing, sports, culture) or income for private consumption. This brings a mechanism for bringing opportunity costs into decision-making, such as how valuable an input is if used elsewhere and how valuable others consider the final product. This however also re-introduces the negative side of markets: the incentives involved imply competition, which means winners and losers and therefore non-egalitarian outcomes. Moreover, if those workplaces which earn a larger surplus were to choose to invest more, their competitive advantages would be reproduced. Especially significant, the external pressures to maximize the earned surplus or beat state-set standards affects internal structures and relationships within the collective, undermining the substantive meaning of “worker control.” Emphasis on the achievement of large surpluses as the prime goal tends, for example, to favor replicating the “more efficient” divisions of labor of old and — for the same reasons — deference to expertise and toleration of workplace hierarchies. With this comes the downgrading of other priorities: a tolerable work pace, health and safety, solidaristic cooperation, democratic participation. Though ending private ownership of the means of production addresses the critique of the inter-class relations underlying markets (no more bosses), what remains is the intra-class conflict between workplace collectives connected through competitive markets. At the extreme, the competitiveness fostered becomes a backdoor to labor-market-like pressures on workers to conform to competitive standards. We turn, in the next section, to whether the use of markets can, via institutional innovations, be adapted to limit such negative thrusts of markets.\nSectoral Councils Though planning and worker control are the cornerstones of socialism, overly ambitious planning (the Soviet case) and overly autonomous workplaces (the Yugoslav case) have both failed as models of socialism. Nor do moderate reforms to those models, whether imagined or applied, inspire. With all-encompassing planning neither effective nor desirable, and decentralization to workplace collectives resulting in structures too economically fragmented to identify the social interest and too politically fragmented to influence the plan, the challenge is: what transformations in the state, the plan, workplaces, and the relations among them might solve this quandary? The operating units of both capitalism and socialism are workplaces. Under capitalism, these are part of competing units of capital, the primary structures that give capitalism its name. With socialism’s exclusion of such private units of self-expansion, the workplace collectives are instead embedded in pragmatically constituted “sectors,” defined loosely in terms of common technologies, outputs, services, or simply past history. These sectors are, in effect, the most important units of economic planning and have generally been housed within state ministries or departments such as Mining, Machinery, Health Care, Education, or Transportation Services. These powerful ministries consolidate the centralized power of the state and its central planning board. Whether or not this institutional setup tries to favor workers’ needs, it doesn’t bring the worker control championed by socialists. Adding liberal political freedoms (transparency, free press, freedom of association, habeas corpus, contested elections) would certainly be positive; it might even be argued that liberal institutions should flourish best on the egalitarian soil of socialism. But as in capitalism, such liberal freedoms are too thin to check centralized economic power. As for workplace collectives, they are too fragmented to fill the void. Moreover, as noted earlier, directives from above or competitive market pressures limit substantive worker control even withinthe collectives. A radical innovation this invites is the devolution of the ministries’ planning authority and capacities out of the state and into civil society. The former ministries would then be reorganized as “sectoral councils” — structures constitutionally sanctioned but standing outside the state and governed by worker representatives elected from each workplace in the respective sector. The central planning board would still allocate funds to each sector according to national priorities, but the consolidation of workplace power at sectoral levels would have two dramatic consequences. First, unlike liberal reforms or pressures from fragmented workplaces, such a shift in the balance of power between the state and workers (the plan and worker collectives) carries the material potential for workers to modify if not curb the power that the social oligarchy has by virtue of its material influence over the planning apparatus, from information gathering through to implementation as well as the privileges they gain for themselves. Second, the sectoral councils would have the capacity, and authority from the workplaces in their jurisdiction, to deal with the “market problem” in ways more consistent with socialism. Key here is a particular balance between incentives, which increase inequality, and an egalitarian bias in investment. As noted earlier, the surpluses earned by each workplace collective can be used to increase their communal or individual consumption, but those surpluses cannot be used for reinvestment. Nationwide priorities are established at the level of the central plan through democratic processes and pressures (more on this later) and these are translated into investment allocations by sector. The sector councils then distribute funds for investment among the workplace collectives they oversee. But unlike market-based decisions, the dominant criteria are not to favor those workplaces that have been most productive, serving to reproduce permanent and growing disparities among workplaces. Rather, the investment strategy is based on bringing the productivity of goods or services of the weaker collectives closer to the best performers (as well as other social criteria like absorbing new entrants into the workforce and supporting development in certain communities or regions). That partiality to equalizing conditions across the sector would no doubt lead to resistance from some workplaces. Crucially, it would be backed up by the central plan and the conditions that come with the center’s investment allocations to the sectors. The tension between the need for incentives and commitment to egalitarian ideals would reflect practical realities. It would be conditioned by the extent to which socialist ideals have permeated the workplace collectives and sectoral councils and the self-interest of some workplaces opposed to intensive competition. But this would be balanced by ongoing concerns about efficiency and growth. Over time, to the extent that the ideological orientation is strengthened and material standards rise, this would be expected to facilitate a greater favoring of equality. Closing the performance gap between workplace collectives would especially be reinforced by significantly centralizing research and development (though some might still be workplace specific) and sharing the knowledge across the sector rather than seeing it as a private asset and source of privilege. As well, regular sectoral production conferences would take place to share techniques and innovations, cross-workplace exchanges would be facilitated to learn best practices, and teams of “fixers,” including both engineers and workers, would be on call to troubleshoot particular problems and bottlenecks in workplaces and among suppliers. What distinguishes the socialist workplace from its capitalist counterpart is therefore not just that there is no private owner and delegated managers, but that workers don’t live under the external threat of compete or die. There are no omnipresent threats of job loss and layoffs, the high level of universal benefits leaves people far less dependent on earned income, and the sectoral councils regulate disparities between workplaces. It’s only in such a context, where the competitive pressures to conform to standards of surplus maximization are alleviated, that worker autonomy and control can have a substantive rather than only formal meaning. Without employers pushing workers to maximize the surplus and/or lower costs, and with the market pressures for workers to police themselves significantly eased, the space is established for workers to make choices that can demonstrate what everyday worker control and decommodification might genuinely mean. Inside the reincarnated workplace, basic rights do not vanish when the border into the workplace is crossed. The rigid division of labor, including the rigidities built in by labor in its self-defense, becomes an open field of experimentation and cooperation. Hierarchies can be flattened — not by dismissing the importance of those with special skills but by integrating them as mentors (“red experts”) committed to democratizing knowledge and making complex issues understandable. With workers given the time, information, and skills to regularly participate during worktime in planning production and resolving problems, it becomes possible to finally imagine a decisive blurring of the historic separation between intellectual and manual labor. The culture of rights and responsibilities that can emerge in this context, especially the new self-confidence of people seeing themselves as more than “just workers” could not be confined to the workplace. It would flow into the local community and beyond, raising democratic expectations of all institutions, especially the socialist state. This new social authority of the working class, materially reinforced by the weight of the worker-led sectoral councils in influencing and implementing the national plan, corrects a previously missing check on the central planners and establishes the footing for assertive initiatives from below. In this world without capital or labor markets, with tight institutional constraints and countermeasures against subsuming labor power to the discipline of competition, it could credibly be argued that the commodification of labor would be effectively done away with.\nLayers of Planning The introduction of worker-elected sectoral councils as powerful new institutions outside the state suggests reframing how we think about socialist planning. Debating “the plan” vs “decentralization” is not all that helpful. The decentralization involved in the formation of sectoral councils also includes the consolidation or centralization of workplaces into sectors. And, as we shall see, though there is a degree to which the central plan is sharing its power with other structures, this does not necessarily mean a loss in its effectiveness as a planning body. It therefore becomes more useful to contemplate a system based on “layers of planning.” These interdependent layers include the central planning board of course, and the sectoral councils. They also include markets as an indirect form of planning and, with the critical role of the sectoral councils in constraining market authoritarianism, planning also extends to internal workplace relations. And they include a spatial dimension supplementing the sectoral emphasis. The dominant anxiety over organizing the material conditions of life and the practical fact that so much of social interaction occurs through work (all the more so if workers are intimately involved in planning that work) gives a special weight within the layers of planning to the economy. But the importance of the social and cultural, of the urban and its relationship to the suburban and rural, demand a spatial layer of planning. There is, in this regard, a history of on-again off-again experiments in the former Soviet Union with regional decentralization. The devolution of the spatial to the regional and sub-regional, like the devolution of ministries to worker-controlled sectors, would allow the otherwise overloaded center to concentrate on its own most important tasks and bring planning closer to those most affected by, and most familiar with, local conditions. Along the way it would vastly multiply the numbers potentially able to participate actively in planning. This distinction between the production and spatial/consumption side of planning would likely bring new tensions, and not just between different institutional groups but even within individuals since these individuals are always workers, consumers, and participants in community life. Some of this might be eased by including community representatives in the sectoral and workplace planning mechanisms. In the service sector in particular, and to some degree also in the case of some local manufacturing, the “municipalization” of the ownership of hospitals, schools, utilities, energy distribution, transportation, housing, and communications opens another possibility. The creation in these cases of local “community councils” might facilitate bridging the everyday tensions among the various dimensions of people’s lives. As socialism matures and productivity is increasingly expressed in reductions of working hours and increased leisure, the role of such councils — with their emphasis on rethinking streetscapes and city architecture, expanding the provision of daily services, developing sociality, encouraging art and cultural expansiveness — would, in line with the ultimate goals of socialism, be expected to gain in comparative prominence relative to the more narrowly conceived demands of economic organization. Such transformations in the relationship between the central plan and the rest of the economy/society would bring both supports and mutual checks among the layers of planning extending across workplace collectives, sectoral councils, regional councils, markets, and the modified central planning board. To this would be added the role of political mechanisms to establish national goals: ongoing debates at all levels, lobbying and negotiating between levels, and contested elections revolving around future direction which — because of its importance and genuine openness to public direction — would hopefully bring the widest popular participation. This decentralization of power and increased spaces for participation would be a powerful check on the “social oligarchs” that Kronrod and others have been so concerned to limit, but it would not necessarily mean a weakening in the significance of the central planning mechanism. In the spirit of Kronrod’s critique of excess planning, it may leave planning less intrusive but more effective. And the very dispersal of power makes the importance of a coordinating body, even if less directly hands on, even more critical. In fact, even as the planning board sees some of its functions shifted elsewhere, this may lead to the board having to take on certain new functions such as monitoring and regulating markets, introducing new mechanisms for revenue generation in the unfamiliar world of extended markets, and transforming education curriculums to incorporate developing the popular capacities essential for the explosion of active democratic participation in planning. It will likely also be the case that, since the central planning board will still control the allocation of investment resources to the sectoral councils and regions, it will be able to leverage the administrative capacities now existing outside the formal state to help implement the central plans. Reflecting the priorities established democratically, a list of the reformed central planning board’s roles might entail the following: Guaranteeing full employment, universal access to necessities, and a living income. Setting the relationship between present and future consumption through determining the share of GDP to be allocated to investment and growth. Allocating investment to sectors and regions, which they in turn reallocate within their respective jurisdictions. Generating the revenue for its activities. Curbing impediments to society’s solidarity and equality goals not only across individuals/households but across workplace collectives, sectors, and regions. The constant development, through educational institutions and at work, of popular functional skills and democratic and cultural capacities. Governing the pace of decommodification through the distribution of expenditures between collective and individual consumption. Regulating the production-leisure trade-off by influencing the share of productivity that goes to producing more vs producing the same with fewer hours of work. Enforcing the stringent adherence to environmental standards, with the state ownership and pricing of resources, as well as allocation of investment, being critical here. Navigating the relationship with what will likely still be a predominantly capitalist global economy. (International relations raise a host of issues not addressed here, ranging from the complex relations with capitalist countries, to relations of solidarity with the Global South to negotiating planned relations with other socialist countries.)\nCan Socialism Be as Efficient as Capitalism? No one paid greater economic homage to capitalism than the authors of The Communist Manifesto, marveling that capitalism “accomplished wonders far surpassing Egyptian pyramids, Roman aqueducts, and Gothic cathedrals.” Yet far from seeing this as representing the pinnacle of history, Marx and Engels identified this as speaking to a new and broader possibility: capitalism was “the first to show what man’s activity can bring about.” The task was to build on this potential by explicitly socializing and reorganizing the productive forces. In contrast, for Hayek and his earlier mentor von Mises, capitalism was the teleological climax of society, the historical end point of humanity’s tendency to barter. Hayek considered it a truism that that without private property and no labor and capital markets, there would be no way of accessing the latent knowledge of the population, and without pervasive access to such information, any economy would sputter, drift, and waste talent and resources. Von Mises, after his argument that socialism was essentially impossible was decisively swept aside, turned his focus on capitalism’s genius for entrepreneurship and the dynamic efficiency and constant innovation that it brought. Despite Hayek’s claims, it is in fact capitalism that systematically blocks the sharing of information. A corollary of private property and profit maximization is that information is a competitive asset that must be hidden from others. For socialism, on the other hand, the active sharing of information is essential to its functioning, something institutionalized in the responsibilities of the sectoral councils. Further, the myopic individualism of Hayek’s position ignores, as Hilary Wainwright has so powerfully argued, the wisdom that comes from informal collective dialogue, often occurring outside of markets in discussions and debates among groups and movements addressing their work and communities. Most important, Hayek’s framework has a condescending class bias — he is only concerned with the knowledge residing in the business class. The knowledge of workers, the vast majority of the population and the ones with the most direct experience in work processes, is of no interest to him. He pays no attention to the possibility that workers under capitalism often have good reason to keep their knowledge from employers — “soldiering” — since passing it on may not help their conditions and may even have negative consequences (e.g., the tightening of work standards). In contrast, a primary purpose of socialism is to liberate and further develop the creative potentials of working people and that includes the maximum mutual sharing of information. Followers of von Mises similarly foreclosed the possibility that entrepreneurship could take place in a variety of institutional settings. Yet even under capitalism, the history of technological breakthroughs was always about more than a series of isolated thinkers suddenly seeing lightbulbs flash above their heads. As Mariana Mazzucato has shown in her detailed study of some of the most important American innovations, it is the state that is in fact “willing to take the risks that businesses won’t” and “has proved transformative, creating entirely new markets and sectors, including the internet, nanotechnology, biotechnology, and clean energy.” This is not to imply that a socialist state will inevitably be as innovative as the American state has been, but rather that greed need not be the only driver of innovation. Dynamic efficiency can also come from socially concerned scientists and engineers given the resources and opportunity to address society’s needs, as well as from mutual cooperation within worker collectives and the interactions of workplace committees with their suppliers and clients. Even more important, socialism can introduce a flourishing and far broader social entrepreneurship focused on innovations in how we live and govern ourselves at every level of society. An empirical observation seems appropriate here. Over the past three decades, US output per worker has grown by about 2 percent per year (much slower over the last decade alone). Slightly under half of that is attributed by the US Bureau of Labor statistics to “capital deepening” (more investment) and about 0.8 percent to multifactor productivity (roughly defined as the increase in output after the impact of more labor and capital inputs have been accounted for); the rest is accounted for by changes in so-called “labor quality.” There is no reason to expect socialism to lag behind capitalism in capital deepening, not when corporations are sitting on hordes of cash that isn’t being invested and when a radical redistribution of existing income would potentially leave enormous resources for reinvestment. And if anything, socialism would be expected to raise the growth of labor quality as it prioritizes the development of popular skills and capacities. Suppose, for the sake of argument, that socialism matches capitalism on investment rates and labor quality, but can meet only half of capitalism’s standard for multifactor productivity (0.4 percent vs 0.8 percent). This would mean an average growth in productivity of around 1.6 percent for socialism rather than capitalism’s 2 percent. In a competitive capitalist environment, firms whose productivity lags risk being chased out of business. But in a socialist context, lagging productivity implies slower growth but is not necessarily catastrophic. While the capitalist rate of growth (2 percent) would generate a compounded increase of 17 percent over eight years in this example, it would take the socialist society ten years to get there — hardly a definitive difference relative to socialism’s far greater social ambitions. The gap would be even smaller if we allowed for the potential productivity gains of workers cooperating to overcome problems, and for the often-unheralded significance to productivity improvements of the systematic dispersal of existing knowledge which, as noted, can come into its own once the barrier of private property is removed. Economists have, increasingly of late, come to admit to some of the problems in the glorification of markets; the problems were too obvious to ignore. The crucial concession was that markets do not handle “externalities” very well, a reference to exchanges that affect, generally negatively, people who weren’t party to the exchange. The economists’ response to such “exceptions” is to propose modifications in taxes and subsidies so the totality of real costs involved in these exceptions to the norm are internalized. The hitch in this is that the so-called externalities at stake here include such things like the environment and the impact of markets on inequality, popular capacities, and substantive democracy — outcomes that are the very stuff of life. This has emerged most popularly in the case of the environmental crisis, with its challenges to the consumerist culture and commodification of nature underlying capitalist markets and the practical concern to introduce widespread planning to address the scale of the environmental threats. The point here is not to argue, as Marx seemed to do in the preface to his 1859 Critique of Political Economy, that with capitalist social relations having become “fetters” on the productive forces, the transformation in social relations would allow socialism to continue the development of the productive forces and surpass capitalism even on capitalism’s own terms. This may or may not turn out to be the case, but its assertion is neither persuasive nor necessary. Intuitively, it is a stretch to assert that a social system with a wide range of goals of which the development of the productive forces is only one, will surpass a society consumed by the singularity of that goal. The incentive-egalitarian balance highlights that trade-off. And if we accept that the path to socialism will involve sacrifices and choices all along the way, including in its construction, then winning people to the socialist cause and keeping them there will have to be based on their desire for something different rather than the questionable promise of socialism bringing not only more justice, more democracy, more workplace control, but also more growth. The point is that the notion of “efficiency” is contested terrain. For capital, unemployment is a class weapon functional to enforcing working-class discipline; for socialists it represents an unambiguous waste. Accelerating the pace of work is a plus for corporate efficiency, a negative for workers. Time spent in democratic deliberations is a non-value-added cost for capitalist employers, a priority for socialists. Reducing hours of work for full-time workers is, for capitalist employers, a Pandora’s box not to be opened; for workers it is a principle reason for improving productivity. What defending socialism demands isn’t efficiency comparisons with capitalism, but whether a society structured to address the full and varied potentials of all its inhabitants can, on its own terms, also be reasonably efficient in coordinating its activities; advancing the development of new technologies, products, and forms of democratic organization/administration; and freeing up the capacity to labor so it can be applied to other human pursuits.\nSocialism as Process The system of distinct but overlapping layers of planning raised here would involve a variety of mechanisms of planning: direct administrative, consultative, iterative negotiations, decisions through delegated bodies, direct cooperation, markets with widely different degrees of freedom. And unlike the elegance of so-called market equilibrium and of the algorithms and computer models of imaginary central plans, this would inevitably come with something that is anathema to orthodox defenders of planning — a significant degree of “messiness.” Workplaces might, for example, find themselves in more than one sector. Boundaries between sectors are often blurred and unstable, being affected by technological changes and social priorities. Within any layer there may be not one but many mechanisms of planning. The balance between centralization and decentralization will be fluid. Allowing for the decentralized flexibility that workers and regional bodies with place-specific knowledge need in order to constantly make unscripted adjustments can be both positive and disruptive (planners too will need a degree of flexibility). Relations between particular workplaces and communities may involve conflicting interests — conflicts internalized even in the same households and individuals. Tendencies to bureaucratization and expressions of vested interests will not completely disappear. Interactions with the international economy will be uncertain and at best semi-planned. The socialist preference for emphasizing free collective goods may be democratically challenged from below (and above). This degree of disarray reflects in part the realities of any complex social organism, as is self-evident once we move away from the paper orderliness of markets and central plans. But there is something more here. The disorder within socialism is also an expression of its larger and multifaceted aspirations: its refusal to narrow everything to easy indicators (like those that fit so neatly with profits and competitiveness); the insistence on developing the fullest range of human capacities to build, create, and enjoy; the commitment to creating the most genuine democracy. All this may produce a disconcerting messiness, but it is best appreciated as a manifestation of the fact that, as William Morris put it in his critique of Bellamy’s utopia, “variety of life is as much an aim of true Communism as the equality of condition, and that nothing but a union of these two will bring about real freedom.” Fundamental here is the nature of socialism as a process. Wlodzimierz Brus, pondering the experience with socialism in Eastern Europe, cautioned that “the socialization of the means of production is a process and not a one-time event” and that it may not tend “automatically in a particular direction … [and] may even be regressive.” At one level, this emphasis on “process” may seem banal — isn’t everything a process? But to insist on this is a reminder of the scale and ambition of what we are addressing, with all the uncertainties of trying to introduce something that has never been successfully achieved before. It is not just that socialism will undoubtedly face all kinds of difficulties in its early postrevolutionary days and that shortcomings may continue into an extended transition period. It is that the making of socialism must be understood as permanently in an uncertain state of becoming. Far from delivering nirvana, what socialism offers is that, having removed the capitalist barriers to actively making life qualitatively better and richer, humanity can then begin to “more and more consciously make [its] own history.” Those beginnings will depend on a host of contingencies leading up to the socialist transformation (contingencies that will make every transition distinct and so not reducible to a single model): How destructive of physical capital was the transition to socialism (including investment strikes and the exit of capital)? How decisively was the capitalist class defeated? How developed was the working class that came to power — did it, for example, enter power through a long march or after sudden collapse of the system? How unequal was the distribution of housing among workers and how will this be resolved? How favorable or antagonistic is the international context? And perhaps most worrisome, what will be the scale of the environmental crisis inherited? These contingencies will continue even after the old bases of power have been effectively dealt with. In part, this is because differences among individuals will persist due to (for example) variations in age and gender, conflicting personal preferences, the influence of distinct social functions. There will be those arguing for more incentives and a reversal of the growth of free collective goods relative to individual consumption. There will be calls for reviving the influence of those with expertise against the democratic dominance of those who “don’t know as much.” One region will be favored against another, and so on. And all this will be occurring in a context in which the best way forward is simply not definitively known. “The art of socialist planning,” Trotsky noted, “does not drop from heaven nor is it presented full-blown into one’s hands with the conquest of power.” It can only be discovered and mastered “by struggle, step by step, not by a few but by millions, as a component part of the new economy and culture.” That patient sensibility must infuse all discussions of the building blocks of socialism, but its democratic emphasis must not be taken to deny the importance of leadership (obviously so, given who Trotsky was). In light of socialism’s contingencies, imperfections, messiness, and fragility, leadership will be especially important in facilitating the most creative democratic participation. That leadership cannot come from the fusion of the revolutionary party and the state; democratic socialism and party monopoly are not compatible. But party politics will contest for such leadership and the postrevolutionary role of the revolutionary party will be critical. Democracy alone doesn’t guarantee that socialism won’t be stalled or reversed. Its advance will continue to depend on the role of a party or parties — in office or out — who are committed to the most ambitious of socialism’s long-term egalitarian, participative, and developmental goals.", "url": "https://www.jacobinmag.com/2019/03/sam-gindin-socialist-planning-models"}