{"authors": ["Staff Reports"], "date_download": "2020-05-04 20:10:16", "date_modify": "2020-05-04 20:10:16", "date_publish": "2019-04-04 16:02:00", "description": "FLORENCE, S.C. – Isabella Orrico and Maggie Smith, seniors at The King’s Academy, have been awarded the prestigious South Carolina Teaching Fellowship. Orrico will join the freshman class at...", "filename": "_49d7fd1150f6494eae437f653ee52a51_1588623016.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_49d7fd1150f6494eae437f653ee52a51_1588623016.html", "title": "Two students at The King's Academy named SC Teaching Fellows", "title_page": "Two students at The King's Academy named SC Teaching Fellows", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FLORENCE, S.C. – Isabella Orrico and Maggie Smith, seniors at The King’s Academy, have been awarded the prestigious South Carolina Teaching Fellowship.\nOrrico will join the freshman class at Winthrop University this fall; Smith will attend Anderson University. Both students will be offered numerous professional development opportunities and will be involved with communities and businesses through various service projects and partnerships with local schools.\nThe state’s Teaching Fellows Program, operated by the Center for Educator Recruitment, Retention and Advancement (CERRA), was established in 1999 by the S.C. General Assembly. The mission of the program is to recruit talented high school seniors into the teaching profession and help them develop leadership qualities.\nEach year, the program provides fellowships for up to 200 high school seniors who have exhibited high academic achievement, a history of service to their school and community and a desire to teach in South Carolina.\nApplicants for the program undergo a rigorous selection process that includes an online application, an interview and presentation in front of a team of three educators, and a scored response.\nFollowing the rigorous selection process, applicants who are awarded a fellowship receive up to $24,000 in scholarships (up to $6,000 a year for four years) to attend a Teaching Fellows Institution in South Carolina. Each Fellow agrees to teach in South Carolina one year for every year he or she receives the fellowship.\nFor more information about the South Carolina Teaching Fellows Program, visit teachingfellowsc.com.\nThe Center for Educator Recruitment, Retention and Advancement, established by the Commission on Higher Education in December 1985 and funded by the South Carolina General Assembly, was created out of a concern for the condition of South Carolina’s teacher supply pool and a need for a centralized teacher recruitment effort.", "url": "https://apnews.com/49d7fd1150f6494eae437f653ee52a51"}