{"authors": ["Emilia Benton"], "date_download": "2020-05-04 20:11:53", "date_modify": "2020-05-04 20:11:53", "date_publish": "2019-02-15 06:00:00", "description": "For many older adults, the idea of getting into shape can be daunting, especially if they’ve been away from the fitness game for a number of years. John Ramirez, a certified personal trainer and...", "filename": "_12e3add008b54d7b85e3e91cdd563166_1588623113.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_12e3add008b54d7b85e3e91cdd563166_1588623113.html", "title": "Local trainer specializes in helping older adults make fitness a priority", "title_page": "Local trainer specializes in helping older adults make fitness a priority", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "For many older adults, the idea of getting into shape can be daunting, especially if they’ve been away from the fitness game for a number of years. John Ramirez, a certified personal trainer and owner of Acupuncture and Nutrition Clinic/Vintage Fitness in Houston, is aiming to change that.\nRamirez, 54, began his career working as the director of the Wellness Center at Memorial Hermann Healthcare System/Houston Baptist University. However, he had long held an interest in working with older adults, as his master’s degree was in exercise physiology with a specialty in geriatric studies.\n“I could see that wellness was gaining momentum and older adults wanted to stop relying on medications to stay healthy,” Ramirez said. “Additionally, I had older parents, as my mother had me at 43, and I wanted them to live as long as possible.”\nOnce Ramirez realized working with older adults was his passion and he wanted to focus specifically on that population, he bought his current clinic from his own acupuncturist. After learning how acupuncture can help people with pain and inflammation, he realized this was an area that would work perfectly with his fitness endeavors. The wellness clinic currently has acupuncturists, massage therapists and Ramirez as the trainer on staff.\n“The older adults I train also participate in acupuncture, as they understand how it can benefit them and minimize pain and inflammation so that they can travel and live their lives versus being tied up at home in pain,” he said.\nRamirez recommends older adults begin working with a trainer initially, especially if it has been a while since they have maintained a regular fitness routine. The first thing they will want to do is make sure their trainer has proper degree-based credentials and certification, such as through an organization like the American College of Sports Medicine or the National Academy of Sports Medicine. This is so they can get some guidance and begin exercising without piling on too much too soon and increasing the risk of injury. They should also be sure a trainer knows all medications they are currently taking. Then they should be ready to explore their options and figure out what kind of activities they enjoy.\n“There are various affordable facilities throughout the Houston area, including the YMCA and Jewish Community Center, which sometimes offer classes specifically for older adults,” he said.\nFor older adults working out on their own, Ramirez recommends working out for at least 30 minutes a day, five days a week. He advises using two of those days for weight training and the rest for cardiovascular activity such as running, walking or cycling. During his 30-minute personal training sessions at the clinic, he also tacks on an additional five to eight minutes of guided stretching at the end.\n“Once older adults take steps to come more active, they will see they’re able to walk and control their balance better,” Ramirez said. “By being active and strengthening key muscles in their legs and core, seniors can catch themselves from falling, in addition to generally feeling better and more energized.”\nRamirez’s clients currently range in age from 52 to 84 and work out with him for two or three 30-minute sessions per week. His sessions are function-based (including sitting, standing and side-step movements) and include balance work and strength and flexibility training.\n“Weight training is important for seniors, especially older women, because osteoporosis is high on the list of potential health issues they may experience,” he said.\n“Working with older adults has been a very rewarding experience for me, as it keeps me motivated and doesn’t allow me to be stagnant in my field, since new health issues and diseases are always coming up in research,” he said. “Clients who work with me will get an educational experience and will learn why they’re there, why they’re losing muscle strength, and what they can do to feel better.”\nUltimately, Ramirez maintains that it’s important to understand that a lifestyle change will take time and won’t happen overnight.\n“One doesn’t become overweight over the course of a few days; it’s wear and tear that accumulated throughout life, so you have to be patient and take your time with the journey,” he said. “Everyone has doubts about starting to work out and I just want to help people understand that there’s no such thing as being too old to exercise and it’s not that difficult to get out and move.”\nAcupuncture and Nutrition Clinic/Vintage Fitness is located at 9660 Hillcroft St. For more information, visit www.acupunctureandnutritionclinic.com.", "url": "https://apnews.com/12e3add008b54d7b85e3e91cdd563166"}