{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:27:14", "date_modify": "2020-05-04 20:27:14", "date_publish": "2019-02-03 00:03:00", "description": "Most of the 10,000 ships lost to the bottom of the Great Lakes in wrecks over the past 400 years are still lost — hidden somewhere in 6 quadrillion gallons of water. Finding anything in a lake is...", "filename": "_14c35ee5726e473a9106ed9ed698228e_1588624034.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_14c35ee5726e473a9106ed9ed698228e_1588624034.html", "title": "Jake Walsh: Speed the search for tiny invaders", "title_page": "Jake Walsh: Speed the search for tiny invaders", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Most of the 10,000 ships lost to the bottom of the Great Lakes in wrecks over the past 400 years are still lost — hidden somewhere in 6 quadrillion gallons of water. Finding anything in a lake is a lesson in humility, so life as a freshwater biologist at UW-Madison is always humbling. If we can’t account for huge steel freighters, imagine the challenge of finding a single tiny organism.\nBut it is crucial to detect invasive species as early as possible. Aquatic invasive species cause billions of dollars in economic damages, and regulators base multimillion-dollar management decisions on scientists’ and managers’ ability to detect them. It is much more cost-effective to invest in prevention measures than to react after a species becomes established. And low-density populations are easier to manage than species that have taken over an ecosystem.\nBecause funding, gear and time are limited, scientists often can only sample for invasive species over small fractions of vulnerable areas. Compounding the challenge, our target species tend to lurk at low densities — that is, they are rare in most places.\nI have spent eight years studying the spiny water flea (Bythotrephes longimanus), an invasive zooplankton, in Wisconsin. In a recent study, I worked with my colleagues Eric Pedersen and Jake Vander Zanden to develop a theoretical framework that uses math and computer modeling to improve detection of invasive species at low densities.\nOur model provides a simple rule of thumb for designing surveillance programs with no information other than an estimate of expected population densities. In other words, if managers have a ballpark understanding of how many individuals are in a system, our models can provide some basic information about how much effort they need to invest in sampling to detect the species reliably. Alternatively, our models can help managers estimate if their efforts are effective for detecting populations early in the invasion process.\nA belated find\nFor us, this challenge was personal. The spiny water flea has upended the food web of our own Lake Mendota in Madison.\nIn most lakes, it’s not surprising to miss biological invasions. But Lake Mendota is one of the most well-studied lakes in the world, and we sampled it over 200 times in the decade leading up to the flea’s detection.\nZooplankton are tiny organisms: The spiny water flea is less than a half-inch long. To find them, we drag a cone-shaped net through the water. The net is nearly 6 feet long, with a hoop about a foot and a half in diameter at one end and a collection cup that traps captured zooplankton at the other. For every 10 feet that we pull the net through the lake, we sample nearly 160 gallons of water — a quantity that would be a struggle to carry, but represents just one one-billionth of the volume of Lake Mendota.\nAt first, the spiny water flea’s invasion of Lake Mendota seemed like the simplest of detection challenges. When we first identified its presence in 2009, our nets teemed with pinky-width tail spines and jet-black eye spots. We estimated that these densities would correspond to a lakewide population of trillions.\nBut as we learned more, we found that the fleas had likely been in the lake for as long as a decade before showing up in masses we referred to as “spiny water flea applesauce” in our collection jars.\nRules of thumb for\ndetecting invasive species\nWhile this realization was a shock, our work revealed it wasn’t actually surprising. Because invasive species often lurk at low densities, missing invasive populations is more likely the rule than the exception, even in well-monitored ecosystems.\nDetecting invasive species is the first step of any management strategy, and early detection is challenging but critical for effectively managing harmful invaders, such as Asian carp and zebra mussels. Failing to detect the spiny water flea has been a key stumbling block in managing its spread across the Midwest. Similar dynamics are occurring with other invasive species, including medflies in California and Didymo algae, also known as “rock snot,” which is causing blooms in rivers across North America.\nWe wanted to see if detection could be more effective.\nAt low densities, detecting a small invasive organism in a large area can be nearly impossible without extraordinary effort. Even if Lake Mendota had one spiny water flea for every cubic meter of water, catching one in a net would be like finding a sesame seed in roughly 250 gallons of water.\nBut managers can dramatically improve detection rates by targeting their sampling to areas or time periods when the target species is likely to be present at higher densities. Humans do this naturally when we have the necessary information. For example, I don’t search grocery stores randomly for blueberries — I look in the produce section, mainly in late summer when blueberries are in season in Wisconsin.\nThe spiny water flea is most abundant in fall. By doubling search efforts in the fall, we calculated that managers would improve detection as much as if they doubled efforts over the entire year.\nTargeting is particularly important in multi-species surveys. Managers often look for multiple invasive species when they are sampling, but we concluded in our study that it’s much more efficient to target each species separately if they differ in when or where they are most abundant. And the greater the difference, the greater the benefit from sampling for them separately.\nIt also helps to identify locations that are vulnerable to invasion. If a manager is tasked with monitoring a dozen lakes, she could either spread effort equally among them or use information about what kinds of lakes the invader tends to invade to target vulnerable lakes. Focusing efforts on a smaller number of vulnerable lakes, instead of sampling all 12, might be enough to overcome the challenges of detecting species at low densities.\nDetection is key to control\nInvasive species cause enormous ecological and economic harm. As just one example, invasive insects do some $13 billion in damage yearly to crops in the United States.\nOur rules of thumb can help scientists and managers work smarter. Ultimately, though, the United States needs to invest much more in effective and comprehensive invasive species prevention efforts to prevent future ecological and economic harm by invasive species.", "url": "https://apnews.com/14c35ee5726e473a9106ed9ed698228e"}