{"authors": ["Dawn Foster", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Christine Berry", "Alex Gourevitch"], "date_download": "2020-05-04 19:57:51", "date_modify": "2020-05-04 19:57:51", "date_publish": "2019-06-21 00:00:00", "description": null, "filename": "2019_06_tory-leadership-race-boris-johnson-uk-conservative-party_1588622271.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/06/21143008/GettyImages-1150620872-web.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_06_tory-leadership-race-boris-johnson-uk-conservative-party_1588622271.html", "title": "The Grotesque Horror Show of the Tory Leadership Race", "title_page": "The Grotesque Horror Show of the Tory Leadership Race", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "On Thursday, Conservative MPs whittled down the candidates for the next Tory leader to two finalists: Boris Johnson (the current favorite) and foreign secretary, Jeremy Hunt. Although the next prime minister is being chosen by a bizarrely small selectorate, most of us cannot opt out of the media charade, nor vote on whether we will continue to be ruled by the party that is subjecting us to the race, thanks to the Fixed Term Parliaments Act stipulating that an election may only be called under very particular circumstances. The Conservatives’ sense of terror that their unpopularity would lead to a Corbyn victory in the event of an election means we will almost certainly not see an election before 2022, though there is an outside chance Johnson may arrogantly call an election soon, assuming — as Theresa May did in 2017 — that he can secure a Tory surge that will win the party an outright majority.\nThe race unofficially began even prior to the candidate list being finalized. Firm outsider Rory Stewart, the international development secretary famous, before becoming an MP, for a bestselling book detailing his ramblings through Iraq and Afghanistan, used his ambulatory skills to film himself walking around the country meeting voters in places ranging from the Irish border to the streets of Scotland, to public gardens in the outskirts of London, appealing to social media observers and voters rather than lobbying support from his colleagues. MPs toured broadcast studios, claiming they could iron out the intricacies of Brexit far better than May had managed. Boris Johnson, usually exuberant in performing his troublemaking, outspoken self-image, was kept away from the spotlight in a carefully managed campaign that sought to ensure the media couldn’t ambush him with questions about his past.\nAll candidates were asked about their drug use, with Stewart admitting to smoking opium at an Iranian wedding like a nineteenth-century colonial ambassador; Michael Gove was plagued with days of front pages attacking his hypocritical use of cocaine after pursuing draconian punishments for drug dealing; while Justice Secretary Johnson refused to answer a question on whether (as he previously claimed) he had used cannabis and cocaine in his youth. Foreign Secretary Jeremy Hunt smugly announced at his campaign launch that he had never broken a law, but was forced to retract that statement later, when journalists pointed out he had broken his own government’s anti-money laundering laws — proving that when it comes to middle-class drug use and inventive accounting, Tory white-collar crime is treated entirely differently to offenses committed by less wealthy citizens.\nThere is, however, a small degree of certainty around the result and the aftermath: Johnson seems almost certain to win once the vote is left to Tory rank-and-file members, who are far older, more male, and whiter than the general population. The candidates spoke at length about their plans to break the parliamentary Brexit deadlock — ignoring the fact that European leaders state unequivocally that they will not reopen negotiations on the withdrawal agreement — and mooted policies ignoring chancellor Philip Hammond’s insistence that he does not plan to dramatically alter spending plans. A new prime minister will not change the parliamentary arithmetic that has blocked the proposed Brexit withdrawal agreement. Instead, what this campaign has mostly revealed is the inner workings and guts of the British press machine and class system.\nJohnson has the advantage of having vast swathes of the press backing him: the Telegraph, one of the biggest broadsheet “quality” newspapers, backs Johnson and also counts him as an opinion columnist, paying the MP £275,000 a year (or £2,291 an hour) to write a weekly column — 9.5 times the average UK salary for ten hours’ work a month. Three days after the campaign officially launched, the Telegraph’s front page claimed a Johnson victory as leader would gift the Conservatives a 140-seat majority in a general election, with a very dubious private methodology that did not take into account the realities of the UK’s first-past-the-post system, the fact that the poll found a Johnson government would only retain 69 percent of Tory voters from 2017, and the fact that many constituencies will never return a Conservative MP no matter who is in charge. Johnson’s hard stance on Brexit also means right-wing newspapers will back the former foreign secretary over Hunt, who has adopted a more moderate approach to leaving the EU, and voted to remain in the referendum.\nThe broader British media’s centrist stance was also revealed in its approach to Rory Stewart, with the candidate depicted as a political moderate standing to the left of the Conservative Party, despite being loyal to the party on all social, economic, and environmental issues, with journalists openly admitting their infatuation with the Etonian, Oxford-educated son of a colonial diplomat. Four years after Jeremy Corbyn’s election, many in the media have still not come to terms with a Labour Party that embraces social democracy rather than Third-Wayism, claiming — despite the annihilation of Change UK/The Independent Group in the European elections and their subsequent humiliating split — that the country retains an immense yearning for a centrist party comprising of right-leaning figures that appeal exclusively to media pundits.\nThe bread-and-butter issues of how a candidate votes on austerity, school funding, human rights, and issues affecting the poorest and most marginalized are rarely scrutinized when a posh and media-savvy politician appeals to the prejudices of the London-based media inner circle. For all that pundits are fond of denouncing Corbyn and his cabinet for not appealing to a mythical working-class voter that is always stereotyped as white, male, racist, and socially conservative, time and again an overtly wealthy and privileged right-leaning politician is held up as a messianic figure for reflecting the media’s image back to them. The fates of David Miliband, Yvette Cooper, Owen Smith, and Chuka Umunna have all failed to make the press pause and reflect: with memories shorter than goldfish, the media have already fallen for Rory Stewart and will continue to venerate him and indulge in parallel-universe fantasies in which he is palatable to the Left and becomes imperial ruler of Britain post-Brexit.\nThe race has already become tiresome, and several more weeks will worsen the travel sickness the entire nation has to endure on this compulsory journey. At the end, a new leader will emerge, and nothing will have changed. When the Brexit deadline was extended until Halloween, EU President Donald Tusk admonished the UK: “please do not waste this time.” The Conservative Party has decided to do precisely that. When Johnson enters 10 Downing Street, the Brexit deadline will rear its head again: Johnson has promised the UK will leave the EU by the Halloween deadline, which likely means crashing out of the EU with no deal. This is widely, and incorrectly, depicted as a policy endgame. That is simply not true — it merely triggers another protracted stage of negotiation with no more clarity visible.\nLabour, meanwhile, is equally stuck, bounced into a position in which they are forced to accept a stance that seeks to prevent leaving the EU, rather than softening the terms on which the UK leaves. For many hard Remain campaigners, this has been cast as fighting for a “People’s Vote”: a second referendum that seeks to overturn the result of the first. This is likely to be catastrophic: the term itself reeks of snobbery, as though only those who voted Remain (and I count myself among that number) matter, and those who voted Leave are racist, stupid, or both. Brexit was a hard-right project, but forcing a second referendum is unlikely to quell that tendency, only inflame it, and both the Remain and Leave camps have only hardened their views, with the extremes of each sides either depicting the EU as a hellscape and invoking a fallacious memory of the purportedly glorious British Empire, while hard Remainers have draped themselves in the EU flag and refused to listen to criticisms of the EU’s reprehensible stance on refugees in the Mediterranean, or myriad other concerns from the Left.\nRegardless, Labour does not have the numbers in parliament to force a referendum, and if they did, the vote would be unlikely to offer an identical Remain-or-Leave option, but rather one in which the UK stays in the EU or leaves with no deal. Polling of Conservative members this week showed how extreme card-carrying Tories have become on Brexit, with members saying they would happily see significant damage to the UK economy, the separation of Scotland and Northern Ireland from the UK, and the Conservative Party destroyed if it meant Brexit could be delivered. The only scenario they couldn’t countenance was Jeremy Corbyn becoming prime minister: 51 percent of Conservatives would rather remain in the EU to stop a Labour government, while only 39 percent would rather leave even if it caused a Corbyn premiership.\nThere is no neat solution that creates a cohesive and fail-safe Labour strategy. The party cannot simply ‘Stop Brexit’ as centrists claim, while Conservative members are happy to destroy the union, the UK economy, and their own party in some utterly deranged self-immolation to secure Brexit. And it certainly looks as though the man most comfortable with pushing forward that willful destruction is about to be handed the keys to Number 10 Downing Street.", "url": "https://www.jacobinmag.com/2019/06/tory-leadership-race-boris-johnson-uk-conservative-party"}