{"authors": ["Staff Report News Saukvalley.Com"], "date_download": "2020-05-04 20:07:43", "date_modify": "2020-05-04 20:07:43", "date_publish": "2019-03-12 00:10:00", "description": "The record abundance of snow accumulation this winter may lead to record flooding this spring along the Mississippi River, according to the National Weather Service. Probability percentages...", "filename": "_2fd197cec6f148eb82d2a83f0f869888_1588622863.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2fd197cec6f148eb82d2a83f0f869888_1588622863.html", "title": "Record flooding possible along Mississippi", "title_page": "Record flooding possible along Mississippi", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The record abundance of snow accumulation this winter may lead to record flooding this spring along the Mississippi River, according to the National Weather Service.\nProbability percentages for river levels were determined by the weather service last week. Widespread flooding potential remains high this spring, with nearly saturated and frozen ground, the NWS said.\nAt Lock and Dam No. 13, north of Fulton, the Mississippi has a 25 percent chance of eclipsing the record of 24.75 feet set on April 28, 1965.\nLevels may reach 25 feet from April 15 to 29. There is a 50 percent change the river will reach 23 feet, and a 10 percent possibility of the river reaching 27 feet.\nThe river sat at 7.08 feet Monday, is expected to rise to 13.08 feet by Sunday, and continue to rise about 2 feet a week until mid-April. The dam, operated by the U.S. Army Corps of Engineers, closes when the river reach 18.98 feet.\nBasement and yard flooding in Savanna is expected at 21 feet.\nRecord crests are not expected to be reached along the Rock River, but levels are predicted to be high enough to cause some road closures.\nThe Rock was at 11.3 feet Monday at Como, where the record of 15.65 feet was set July 23, 2017; there is a 10 percent chance that the river will reach as high as 15.75 feet from April 1 to 8.\nLawrence Park in Sterling will have water approach its surface at 12.3 feet, and Spring Slough southwest of Rock Falls will overtop at Prophetstown Road at 15.6 feet.\nThe Sauk Valley has more rain in the forecast today through Friday, with temperatures rising to 58 degrees Wednesday and 60 Thursday.", "url": "https://apnews.com/2fd197cec6f148eb82d2a83f0f869888"}