{"authors": ["Jim Shay"], "date_download": "2020-05-04 20:27:18", "date_modify": "2020-05-04 20:27:18", "date_publish": "2019-04-24 12:30:15", "description": "When it comes to clean air, all eight Connecticut counties get an F with ozone pollution. That’s according to the American Lung Association “State of the Air 2019” report released Wednesday...", "filename": "_fbfe086f32b4463e8fda81b374e99e8a_1588624038.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fbfe086f32b4463e8fda81b374e99e8a_1588624038.html", "title": "Connecticut still among worst in U.S. with ozone pollution", "title_page": "Connecticut still among worst in U.S. with ozone pollution", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Connecticut still among worst in U.S. with ozone pollution\nWhen it comes to clean air, all eight Connecticut counties get an F with ozone pollution.\nThat’s according to the American Lung Association “State of the Air 2019” report released Wednesday that ranks metropolitan areas based on ozone and particle pollution during 2015, 2016 and 2017.\nThe good news is that Connecticut gets a passing grade with particle pollution. Particle pollution is a mix of ash, soot, diesel exhaust, chemicals, metals and aerosols. These microscopic particles can burrow deep within the lungs, triggering serious problems such as asthma, heart attacks, strokes, and lung cancer.\nOften called “smog,” ozone is harmful to breathe. Ozone aggressively attacks lung tissue by reacting chemically with it. When ozone is present, there are other harmful pollutants created by the same processes that make ozone.\nThe 20th annual air quality “report card” tracks Americans’ exposure to unhealthful levels of ozone and particle pollution, both of which can be deadly.\nConnecticut’s worst air pollution ranking comes from ozone.\nThe state is ranked 10th as the worst polluted with ozone. The ranking includes New York-Newark, N.J. and Pennsylvania.\nAlthough Connecticut has some of the toughest air pollution standards in the country, officials have said Connecticut is downwind of polluting power plants in Illinois, Michigan, Pennsylvania, Virginia and West Virginia that have failed to provide ozone-reduction plans. Connecticut joined New York and six other Northeastern states in suing the EPA over the enforcement of pollution from Midwestern power plants. The Trump administration has allowed nine states to exceed pollution limits.\nIn February, Connecticut Attorney General William Tong filed the suit to force the Environmental Protection Agency to comply with federal law by requiring further controls on smog pollution.\n“Connecticut sits at the end of the tailpipe of the nation’s exhaust fumes, with severe consequences for public health,: Tong said. “States like Connecticut ... downwind of some of our country’s heaviest polluters need the protection of strong interstate ozone pollution regulation,” Tong said. “Trump EPA’s failure to comply with the Clean Air Act violates federal law and endangers the health of Connecticut families.”\nAll six counties - Fairfield, New Haven, Litchfield, Hartford, Middlesex, Tolland and Windham - received an F grade for high number of ozone days.\nThe methodology of the report determined a “weighed average” of ozone pollution based on the number of “orange” and “red” days.\nOrange days are when the air quality index is between 101-150. It’s a time when temperatures are in the 80s and 90s, winds are light, skies are mostly sunny and a slight chance of afternoon thunderstorms. Orange days affect sensitive groups such as the young and elderly and people with respiratory disease, such as asthma. Active people should also limit prolonged outdoor exertion during orange days.\nRed days are when air quality index is between 151 and 200 on days that are hot, hazy, and humid, the air is stagnant, skis are sunny with little chance of precipitation. Red days affect active children and adults, and people with respiratory disease such as asthma. Everyone, especially children, should limit prolonged outdoor exertion.\nAll counties received an F because of a high number of unhealthy air days.\nFairfield County had the highest number of high ozone days with an average of 25.8 days. It had 52 orange days and 17 red days.\nNew Haven County was second with 15.7 days. It had 32 orange days and 10 red days.\nMiddlesex County was third with 11.5 days. It had 30 orange days and three red days.\nNew London County had an average of 10.7 days. It had 26 orange days and 4 red days.\nHartford County was fifth with 6.2 days. It had 17 orange days and one red day.\nLitchfield County has a weighted average of 6.2 days. It had 13 orange days and one red day.\nTolland County average was 4.7 days. It had 14 orange days and no red days.\nWindham County had the lowest average with 3.8 days. It had 10 orange days and no red days.\nCalifornia had the highest ozone pollution with seven of its cities in the Top 10.", "url": "https://apnews.com/fbfe086f32b4463e8fda81b374e99e8a"}