{"authors": ["David Broder", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Dawn Foster", "Daniel Finn", "Ivan Mitchell", "Daniel Lopez", "Peter Gowan"], "date_download": "2020-05-04 19:55:47", "date_modify": "2020-05-04 19:55:47", "date_publish": "2019-02-22 00:00:00", "description": null, "filename": "2019_02_independent-group-labor-social-democratic-party_1588622147.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/02/22165340/GettyImages-1125554913.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_02_independent-group-labor-social-democratic-party_1588622147.html", "title": "The Wilderness Years", "title_page": "The Wilderness Years", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe Monster Raving Loonies are a desperately unfunny satirical party, who stand on joke policies like “having hop, skip and jump years as well as leap years.” Their most notable triumph came in the Bootle by-election of May 1990, in which they beat into sixth place a Social Democratic Party (SDP) which had just a few years earlier outpolled both Labour and the Tories. This humiliation has been legendarized as the death-knell for the SDP, founded in 1981 by big beasts like Roy Jenkins (Home Secretary in Harold Wilson’s reforming Labour government) and David Owen (1977–79 Foreign Secretary). Briefly topping 50 percent in the polls, the SDP within a decade become a warning to whoever sought to break the two-party system. Largely created by Labour splitters, the SDP is an obvious predecessor to The Independent Group formed this week — or the party they are due to found. Today an asset of Gemini A Ltd, this caucus of eight former Labour and three former Tory MPs are raising funds and organization to create a “third force” roughly along the lines of the Jenkins-Owen party. This task is more difficult than it sounds; the group will need to more than triple its number of MPs even to surpass the Scottish Nationalists. But we can certainly expect at least a trickle of disgruntled Blairites and Tories to continue to join The Independent Group (TIG), in a choreographed bid to feed an ongoing crisis in the two main parties. Throughout Jeremy Corbyn’s time as Labour leader, the putative splitters’ media outriders have emoted on the difficulty of such a leap, taking the SDP as a warning. Not just the barriers it faced (not least Britain’s First Past the Post electoral system) but also the apparent differences from the 1980s scenario inform the wisdom of creating a new vehicle. But what especially links the two is that they are more “anti-Labour parties” than projects with their own base or identity. After the SDP helped create the Liberal Democrats in 1988, none of its veterans joined the Blair or Brown cabinets, whereas in 2010 ex-SDPer Vince Cable joined David Cameron’s government along with four others who had become Tories. Ex-Labour man Chris Leslie has already declared that TIG would not vote to bring down Theresa May’s government. Even his colleagues’ common opposition to Brexit is little served by their move to split Labour’s ranks. This SDP mark II may prove more than a fluffer that helps keep the Tories in power. But from past experience, it probably won’t be.\nLabour Days In fact, the SDP isn’t the only example of this happening. While upon its origins Labour was so much a party of the trade unions that it did not even allow individual membership, it soon integrated former Liberal MPs and in both 1924 and 1929 formed governments reliant on the support of this still-powerful party. This generated continual tensions in its ranks. While Ramsay MacDonald’s first Labour government in 1924 lasted only nine months, the 136 extra seats it won in the 1929 general election brought it close to a majority, which was then secured with Liberal backing. However, faced with the effects of the Wall Street crash, MacDonald and chancellor Philip Snowden resorted to sharp austerity measures. A dogged commitment to balanced budgets, governed by both the desire to present Labour as “responsible” defenders of the Gold Standard and pressure from Liberals, soon produced frictions in the party. Former Tory MP Oswald Mosley insisted that Labour should adopt Keynesian stimulus measures, and quit amidst a storm of publicity when he was ignored. Founded in February 1931, his New Party soon embraced fascism as the wave of the future. But faced with opposition to spending cuts within his cabinet, MacDonald soon himself provoked crisis in Labour. Resigning as prime minister in August 1931, he then agreed to form a “national government” essentially reliant on Tory parliamentary support. Expelled from Labour along with Snowden, MacDonald’s new “National Labour” was the first force in British politics to be defined principally by its renegacy from the old party of the unions. At the October 1931 general election it held just 13 seats; the Labour Party’s vote took a knock of 6.5 percent, but its number of MPs collapsed from 287 to 52. MacDonald became an infamous traitor, responsible for the worst rout in Labour’s history. Having led minority Labour governments for a total of less than three years, the longtime pacifist would now spend the next four years as head of an imperial government dominated by the Tories at every level, heckled by trade unionists and Labour activists wherever he went.\nThe Battle for Europe This dismal example would do much to solidify Labour over subsequent decades, notwithstanding the brief expulsion of figures such as Aneurin Bevan (due to perceived softness on the Communist Party). But things changed with the case of Dick Taverne, a public-school Euro-federalist elected as an “Independent Democratic Labour” MP in 1973–4. Britain had joined the European Economic Community (EEC) in 1973 under Ted Heath’s Tory government. Labour leader Harold Wilson supported Britain’s membership but the Left of the party was hostile to what was widely perceived as a bosses’ club. Labour imposed a three-line whip on MPs to vote against Heath’s terms of entry, but sixty-nine rebelled. This group, led by Roy Jenkins, who voted with Heath, more than made up for the Tory rebellion, allowing Heath to join the EEC on his chosen terms. A Labour rebel, Taverne was deselected by his left-wing constituency party, and then (in an act of principle unmatched by TIG MPs in 2019) resigned his seat in order to force a by-election. His victory in this contest (he was also reelected in the February 1974 general election) contained in embryo the basic terms of the later SDP split. Notably, Taverne’s success partly owed to the fact that no Liberal candidate stood against him. This would be reaffirmed in the 1980s by a formal SDP-Liberal alliance. Labour won a very thin two-seat majority after the October 1974 election, and after Jim Callaghan took over from Wilson in 1976 it was soon forced to rely on Liberal parliamentary backing. Confrontations with the unions moreover emboldened the dissident Left in the party, whose leading champion was Tony Benn. Benn had in 1975 been one of the leaders of the “No” campaign in a referendum on Britain’s continued presence in the EEC. Wilson went into the 1974 elections promising to renegotiate its terms of membership, in particular not wishing to condemn Britain to limits on state aid or to currency parity that would hamper measures to combat unemployment. While Wilson’s renegotiation did not change what he termed the “theology” of the EEC, it was enough for him (backed by new Tory leader Margaret Thatcher) to win a decisive “Yes” vote in the 1975 referendum on continued membership. Benn, like Michael Foot, campaigned to leave, in a largely left-led campaign also backed by the nationalist right.\nThe Limehouse Declaration These ministers’ dissent was not the only rancor in Labour. Falling out with Wilson (notably over the appointment of fellow right-winger Denis Healey as chancellor) and humiliated in the 1976 leadership ballot, Jenkins left Westminster in 1977 to become president of the European Commission. In this role began the process that led to the ultimate creation of the euro. Ejected from power in 1979 as the Liberals and Scottish Nationalists lined up behind Thatcher’s no-confidence motion, Labour entered a period of soul-searching. Clashes with the unions (famously termed the “winter of discontent”) had hobbled Jim Callaghan’s government, with the tabloids claiming that striking public sector workers had “left the dead unburied.” This image of a Labour Party in hock to “militants” intensified with the election of Margaret Thatcher’s government. Having made his own move to the Left, Tony Benn electrified delegates to the 1980 Labour conference with his withering criticism of Callaghan’s failures, instead calling for a bold industrial policy and the abolition of the House of Lords. The Bennites, including Jeremy Corbyn, represented a Labour tradition at odds with the Trotskyist infiltrators of the Militant group, but opposed to their expulsion from the party. This issue provided a battering ram for Labour’s opponents, as trade unionists and left-led councils were smeared by association with the entryists. The 1980 conference saw Michael Foot become leader, winning out over stalwart of the right, Denis Healey. At the same time, Benn’s supporters called for the deselection of the MPs deemed responsible for the disasters of Callaghan’s government, pitching the party toward unilateral disarmament and departure from the EEC. Jenkins and his allies had enough. On January 25, 1981 he, David Owen, Shirley Williams, and Bill Rodgers — the so-called “Gang of Four” — issued the Limehouse Declaration. Protesting that trade unions and left-wing members had stolen the party from its MPs, they announced the creation of a Council for Social Democracy, which would soon found a new party.\nNot Very Social Democratic Their new Social Democratic Party was very much a party of disgruntled Labour members: of the twenty-nine MPs who defected to it over the following year, just one came from the Tories. The effect on Labour was devastating. While at the time of the 1980 conference it led Thatcher by fifty points to thirty-six, its support slumped as liberal middle-class voters decamped to the SDP. The SDP found minimal support in the trade unions and was from the outset a media-driven phenomenon with a weak activist base. That said, the Bennites were also relatively weak among the unions, and the 1981 Deputy Leadership contest — setting Benn against Healey — ended in an extremely narrow victory for the right-winger owing to union votes. This marked the high point of the Bennite insurgency, despite the Left’s generally strong influence on Labour policy (including its 1983 election manifesto). But after the SDP’s promising start (forging an alliance with the Liberals within five months of its foundation) Jenkins narrowly failed to defeat Labour’s Doug Hoyle in the Warrington by-election. By the end of 1981 the SDP topped half the vote in national polls. Liberal leader David Steel infamously declared to his party’s conference, now apparently in the limelight, “Go back to your constituencies and prepare for government!” Yet already the SDP was incoherent on the key issues of the day, including Thatcher’s anti-union measures. If its small band of MPs were divided over measures to hamstring labor, its ability to eat into Tory support was greatly weakened by the Falklands War of 1982. Thatcher’s difficult first period in government, including recession in 1980, was soon followed by jingoist dreams of restored empire as the Argentine junta picked a fight it couldn’t win in the British colony. The final defections to the SDP at the start of March 1982, followed by Jenkins’s by-election victory in formerly Tory-held Glasgow Hillhead later that month, were in fact the end of its advance. The invasion of the Falklands in April, and then Thatcher’s stunning military victory (Labour called for UN intervention) saw her soar ahead in the polls. Relations between Labour and the SDP were bitter. One flash point was the Bermondsey by-election of 1983, in which Foot chaotically disavowed Australian leftist Peter Tatchell as the Labour candidate, before backtracking. Liberal Simon Hughes, backed by the SDP, beat Tatchell with a vile homophobic campaign (Hughes himself later came out). With signs of economic recovery and the opposition divided, the Tories swept home at the 1983 general election. While Thatcher’s party dipped from 43.9 to 42.4 percent, this left it over 4.5 million votes ahead of Foot’s Labour (27.6 percent). Yet most notable was that the SDP-Liberal Alliance actually lost seats, its 25.4 percent total electing just twenty-three MPs. The SDP had succeeded in winning urban and middle-class voters from Labour, while making next to zero impact on the Tories. But if it claimed that almost two-thirds of its activists had not been party members before, this also belied its shallowness and weak ability to create the local and intermediate structures necessary for a mass party. At the same time, the SDP was little distinct from the Liberals, and the end of its initial rise soon led to clashes between the two over the leadership of their Alliance. This was memorably satirized by popular comedy show Spitting Image, whose puppets lampooned the Liberal Steel as Owen’s craven sidekick, literally in his pocket. Labour was also beginning to rebuild. In the decisive 1981 deputy leadership contest, Neil Kinnock distanced himself from the Left of the party by abstaining in the Benn-Healey clash, and he was handpicked by the ailing Foot — a fine socialist writer, but also an elderly and unworldly figure to lead a political party — to take over as his successor. The fact that Labour had held on as second party in 1983, notwithstanding the split and Thatcher’s triumph in the Falklands, was enough to doom the SDP in the long term. In 1987 it was set back further, and the following year itself fractured, as the majority faction joined a single party with the Liberals (the Liberal Democrats) while Owen limped on alone until 1990.\nThe End of Blairism The Liberal Democrats have never become a serious contender for government, even when briefly seeming likely to exploit Labour’s ills following the 2008 crisis. In general, they operate as a right-wing opposition in Labour seats and (at least until the 2010 coalition with David Cameron) a soft-left force in deepest Tory England. For those who dream of creating a new centrist project today, it would be nice to think that the SDP had some indirect wider effect. If UKIP helped create the conditions for Brexit, even while never electing more than one MP, or the rise of the Scottish Nationalists encouraged Labour to offer devolution, did the SDP perhaps succeed in changing the other parties? Well, no. Edging out the SDP-Liberal alliance in the 1983 election, Michael Foot’s Labour preserved its own integrity; upon his election as Foot’s successor, Neil Kinnock was seen as a figure from the soft-left (but anti-Bennite) wing of the party rather than the champion of an SDP-lite. Kinnock was far from a neoliberal dogmatist. Neither under Kinnock’s leadership (lasting until 1992) or under his successor John Smith (until his death in 1994) did Labour adopt SDP-style positions. Kinnock waged war on Militant, but this Trotskyist entryist group was hardly the heart and soul of Old Labour. Blair’s own “modernization” began several years after the SDP had dissolved. If the SDP had an effect, it was most of all that in maintaining the Tories in power (indeed, David Owen openly backed John Major in the 1992 general election) it left a desperate Labour Party more at the mercy of Blair’s charms. Yet even Smith’s local election results in 1994 (42 percent nationally) suggested that Labour was on the brink of the landslide that came in 1997. Indeed, while in 2019 Blair may himself join the new party, this would be a very different move from the position he took in relation to the SDP. Becoming Labour MPs in 1983, he and Gordon Brown knew that they stood far more chance changing British politics by taking over the party of the trade unions than by joining a shallow third force. The mantra of Blair in his heyday was that Labour had to “reform” to govern. Before reaching office in 1997 he mounted symbolic clashes with the weakened unions and the Left to reassure middle England, but all in the name of electing a government that could be expected to ramp up public service spending on the back of economic growth (as indeed it did). Without prettifying the mid-1990s “golden age” of New Labour, it is clear that the disaster in Iraq and exile from power have turned Blair and his fans into something that they were once not. Marginalized and ridiculed, they seem unable to understand why the “moderate” rhetoric that accompanied their rise to power a quarter-century ago no longer suffices. The serial rebel Jeremy Corbyn is in fact one of the few Labour MPs who unhesitatingly defends Blair-era public spending, even while maintaining his opposition to New Labour’s now demonstrably failed Public-Private Partnerships (a particular cash cow for private business on the railways, today serviced by former SDP man Chris Grayling).", "url": "https://www.jacobinmag.com/2019/02/independent-group-labor-social-democratic-party"}