{"authors": ["Theo Lawson"], "date_download": "2020-05-04 20:15:02", "date_modify": "2020-05-04 20:15:02", "date_publish": "2019-05-06 00:00:00", "description": "Washington State and Gonzaga will both be represented at the upcoming NBA G League Elite Camp, held May 12-14 in Chicago. The Cougars’ Robert Franks and CJ Elleby, and the Bulldogs’ Josh...", "filename": "_65baa615fb25469385411ce73d1d5a94_1588623302.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_65baa615fb25469385411ce73d1d5a94_1588623302.html", "title": "Washington State’s Robert Franks, CJ Elleby and Gonzaga’s Josh Perkins to participate in G League Camp", "title_page": "Washington State’s Robert Franks, CJ Elleby and Gonzaga’s Josh Perkins to participate in G League Camp", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Washington State and Gonzaga will both be represented at the upcoming NBA G League Elite Camp, held May 12-14 in Chicago.\nThe Cougars’ Robert Franks and CJ Elleby, and the Bulldogs’ Josh Perkins, have chosen to attend the inaugural three-day scouting event at Quest Multisport, designed to give NBA hopefuls and top G League prospects more exposure leading up to the 2019 NBA Draft.\nThe camp field includes 40 draft-eligible college players and 40 more players who spent the 2018-19 season in the G League.\nThe Chicago-based event, held in front of NBA coaches, scouts and executives, will be a good opportunity for all three players to showcase their skills.\nFranks and Perkins, both seniors last season, haven’t appeared on many mock draft boards in recent months, but will likely pursue professional basketball regardless of whether their names are called in the draft.\nElleby, one of the Pac-12’s top freshman players last season, is testing the draft waters and could still return to the Cougars next season as long as he withdraws his name before the May 29 deadline.\nThe Seattle native recently hired an agent and has already gone through multiple workouts with NBA teams. Elleby has worked out with the Boston Celtics and Houston Rockets already and was scheduled to work out for the Philadelphia 76ers today. The forward has a few more workouts scheduled for later in the week.\nElleby was WSU’s second-leading scorer in 2018-19, averaging 14.7 points per game, and was second on the team with 7.1 rebounds per game. He was only outdone by Franks, who scored a Pac-12-leading 21.6 ppg and grabbed 7.2 rebounds per game. Elleby was named to the Pac-12 All-Freshman Team, while Franks earned All-Pac-12 First Team honors.\nPerkins started all 37 games he played in as a senior, recording 234 assists on the season and breaking the program record previously held by Matt Santangelo. His 712 career assists also rank third all-time in the WCC.", "url": "https://apnews.com/65baa615fb25469385411ce73d1d5a94"}