{"authors": ["Megan Rowe"], "date_download": "2020-05-04 20:07:39", "date_modify": "2020-05-04 20:07:39", "date_publish": "2019-03-09 00:00:00", "description": "A bill cleared the Idaho Senate floor on Thursday that could make life a lot simpler for the Panida Theater in Sandpoint – and other historic theaters like it. Idaho law prevents liquor...", "filename": "_1bb945d368fb4657b803db7eb6dd9564_1588622859.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1bb945d368fb4657b803db7eb6dd9564_1588622859.html", "title": "Idaho lawmakers pass bill allowing alcohol sales in historic theaters", "title_page": "Idaho lawmakers pass bill allowing alcohol sales in historic theaters", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A bill cleared the Idaho Senate floor on Thursday that could make life a lot simpler for the Panida Theater in Sandpoint – and other historic theaters like it.\nIdaho law prevents liquor sales in movie theaters, which causes a hindrance to theaters like the Panida that host both movies and live events.\n“I’m grateful that it passed and certainly don’t want to count my chickens yet, but I’m hopeful that Brad Little recognizes what this does for art house theaters on the historic register,” said Patricia Walker, executive director of the Panida Theater, referring to the Idaho governor. The bill was passed by the House on Feb. 21.\nThe law would limit the rule to theaters on the historic register that were built in 1950 or prior. The Panida – established in the mid-1920s, – more than meets the requirement.\nSen. Jim Woodward, R-Sagle, who voted for the bill, has been a longtime patron at the Panida. In fact, his grandfather was in a production of The Music Man at the theater.\n“It’s not trying to turn the venue into a bar, but more of a community event, and the ability for people to have a glass of wine or one of the local craft brews is how I see that playing out,” Woodward said. “Just like you might have a drink of some sort with a meal, you can also do that at one of the events held at the Panida.”\nA theater could obtain historic registry to be included on the list, but, as of now, only five other theaters would qualify for this law. There are six additional theaters in Idaho that meet the age requirement but don’t have historic registry.\nWalker has been with the theater for the past four-and-a-half years, and she said that she has had to work around the rule – obtaining catering permits for each night so that they could serve wine and beer in the theater. The catering permits were costing her $20 for each day that she requested them, and she was typically needing them Thursday through Sunday.\n“It’s really difficult to make money with movies anymore, so this impacts us a great deal to not have to have that,” Walker said.\nThere are some theaters in Idaho that could already serve alcohol: Theaters that had obtained their liquor license prior to 2008 were grandfathered in. Since the Panida didn’t pursue a license until 2014, the nonprofit theater was left in the dust.\n“We’re grateful that people recognize the value of taking care of the past and keeping us relevant in the future,” Walker said.", "url": "https://apnews.com/1bb945d368fb4657b803db7eb6dd9564"}