{"authors": ["Sentinel", "Enterprise Staff"], "date_download": "2020-05-04 20:27:25", "date_modify": "2020-05-04 20:27:25", "date_publish": "2019-05-28 16:35:46", "description": "HOUSTON — Boston Red Sox manager Alex Cora was asked after a 4-1 win over the Astros if he uses the two recent series against Houston as a measuring stick for how good his team is. \"No, I...", "filename": "_0e0fc192a0f349feb6aa8db2cd630c19_1588624045.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0e0fc192a0f349feb6aa8db2cd630c19_1588624045.html", "title": "Red Sox Avoid Sweep", "title_page": "Red Sox Avoid Sweep", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HOUSTON — Boston Red Sox manager Alex Cora was asked after a 4-1 win over the Astros if he uses the two recent series against Houston as a measuring stick for how good his team is.\n“No, I don’t,” Cora said with a grin. “If I say that, then they’ve got bragging rights.”\nRafael Devers homered off Justin Verlander, and the Red Sox capitalized on two Houston errors to avoid a three-game sweep Sunday.\nThe banged-up Astros lost for just the fifth time in 22 games and finished the regular season 4-2 against the Red Sox, who beat them 4-1 in the ALCS last season on the way to a World Series championship.\n“You see the scores,” said Cora, the Astros’ bench coach for their 2017 title before heading to Boston. “I know it’s early and I know where they’re at and I know where we’re at. We just both match up well. There are no secrets. It’s all execution. There were certain days where we didn’t execute, and today, they made some errors and we took advantage of that.”\nEduardo Rodriguez (5-3) held Houston to one run and four hits in six innings, improving to 5-1 in his last eight starts.\nIt was exactly the bounce-back outing he was hoping for after allowing six runs over five innings in a loss to Toronto last time out.\n“It feels really good,” Rodriguez said. “I’ve been working these past four days on how I’m going to pitch, the game plan and everything, and it worked pretty good.”\nDevers’ solo shot to center field in the fourth gave the Red Sox a 2-1 lead. It was Devers’ seventh homer of the season and fourth in six games.\nBoston extended its lead to 3-1 during a sloppy fifth inning for the AL West leaders. A one-out double by Eduardo Núñez was followed by errors from second baseman Yuli Gurriel and third baseman Alex Bregman on back-to-back plays, allowing Núñez to score.\n“We didn’t play well, and we missed an opportunity to sweep those guys and really just misfired on a day where (Verlander) pitched well enough to keep us in the game and win,” Houston manager AJ Hinch said. “I think we allowed ourselves to play a little mentally tired, a little physically tired. We’re beat up a little bit, so it wasn’t our day.”\nVerlander (8-2) permitted three runs and six hits in seven innings, striking out six and walking none. He got his 2,800th career strikeout in the fourth against Michael Chavis and finished his day five strikeouts shy of Cy Young’s 2,806 for 21st all-time.\nVerlander also threw two wild pitches, both in the third inning, after entering with none in 72 ⅓ innings this season.\n“Against a lineup like that, you’ve got to limit baserunners, so when they get a couple guys on with infield hits, that makes it really tough,” Verlander said. “I was pleased to be able to keep the damage to a minimum but not happy with the results, obviously. We play this game to win, and we weren’t able to do that.”\nHouston went up 1-0 in the first when Aledmys Díaz scored from second on a single by Carlos Correa that deflected off Devers’ glove at third base into shallow left field. Christian Vázquez couldn’t handle Núñez’s bouncing throw to the plate.\nAfter the play, Díaz left the game with left hamstring discomfort. Gurriel moved to second base and Tyler White entered at first.\nHinch said after the game Díaz is likely headed to the injured list.\nThe Red Sox tied it in the second on a sacrifice fly from Andrew Benintendi that scored Steve Pearce.\nBoston added an insurance run to make it 4-1 in the ninth. A walk to Jackie Bradley Jr. was followed by a balk from Framber Valdez, a passed ball and a groundout from Núñez that scored Bradley.\nMarcus Walden pitched a scoreless inning for his second major league save and first this season.", "url": "https://apnews.com/0e0fc192a0f349feb6aa8db2cd630c19"}