{"authors": ["Marc Kagan", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Joe Demanuelle-Hall", "Meagan Day"], "date_download": "2020-05-04 19:59:51", "date_modify": "2020-05-04 19:59:51", "date_publish": "2019-07-07 00:00:00", "description": null, "filename": "2019_07_amazon-workers-new-york-times_1588622391.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/07/07074808/GettyImages-825338414-web.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_07_amazon-workers-new-york-times_1588622391.html", "title": "Giving Amazon’s Side of the Story", "title_page": "Giving Amazon’s Side of the Story", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "For thirty years, the New York Times’s labor reporter was Steven Greenhouse. Greenhouse was no radical, but at least he evinced a belief that workers got the short end of the stick, as epitomized by the title of his book, The Big Squeeze: Tough Times for the American Worker . On the Times labor beat before Greenhouse was William Serrin, who had come to New York from Detroit. Serrin’s most well-known book, The Company and the Union: The “Civilized Relationship” of the General Motors Corporation and the United Automobile Workers detailed how company and union collaborated to raise productivity (and wages) at the expense of workers’ demands to ease the brutality of the assembly line.\nFactories could be humanized, Serrin opined. But to want to do so would require believing that the men and women who worked there were not morons; they were capable of reimagining their work in a more fulfilling and less brutal way, and deserved to be able to do so. Serrin did not think they were morons, and he felt for their abuse on the job.\nSerrin died last year, and right about now he must be rolling over in his grave. That’s because the Times’s current labor journalist, Noam Sheiber, thought that the best way to find out what it was like to work at one of the most important companies in the world today, Amazon, was to accept a chaperoned tour through their Staten Island fulfillment center: “in mid-May, I spent a few hours observing workers and asking them about their jobs, with a press chaperone in tow. By the end, I had concluded that both sides had a point.”\nBecause Sheiber had eyes and is not an idiot, he couldn’t help but see that the work is “repetitive,” making workers “resemble robots.” Still, he insists, “the problem may be less with Amazon than with technology itself.” Magically, in Scheiber’s telling, technology exists autonomously of the capitalist or workplace engineer — no one bears any real responsibility for the conditions of that work (and thus nobody can be called to account for it).\nMoreover, the workers Sheiber talked to — again, “with a press chaperone in tow” — seemed so jolly. One “seemed like a state-of-the-art Amazon employee.” What really excited Sheiber was that this worker was “someone who saw the world through the eyes of a manager . . . ‘I try to find ways to make me more efficient,’ he said.” Of course, every workplace has a few Stakhonovites. But isn’t it more likely — and shouldn’t it have been obvious to Scheiber — that the worker thought this was an easy way to please the boss?\nA second worker also boasted of working harder and harder: “he motivated himself by competing with a friend in a different part of the warehouse to see who could earn the higher productivity ranking. ‘Last week I was forty-first in the building,’ he said. ‘This week I’m trying to be top ten.’” A third, seeming to remember the boss’s ear next to him, said: “When I asked whether he could see any benefit to a union . . . [he] told me, ‘The biggest benefit is job security.’ He quickly added, ‘The managers here, they don’t want to fire people — they just want people to work hard.’”\nThat’s actually exactly right: firing and retraining has costs, and it’s much easier and cheaper for a capitalist to get workers to stick around at a job in which more and more profit can be wrung out of them. Henry Ford’s famous “$5 a day wage” was no act of humanitarianism, but a response to labor turnover rates reaching 200 percent a year. The rational capitalist, at Amazon and everywhere else, doesn’t want to fire you: they want you to willingly accept your dehumanization.\nSheiber’s excitement about a workplace that makes workers “resemble robots” yet urges them to “have fun; make history” is so palpable, he is almost giddy. “The general manager, Chris Colvin, knew many of his employees’ names and bantered with them amiably.” That Amazon is already training these workers’ children to be good employees — it “recently held a contest for their children to illustrate job safety practices, like bending at the knees and wearing gloves” — goes unnoticed by Sheiber; it’s a fun activity!\n“Video-game interfaces . . . allow workers to accumulate points and badges for completing the[ir] tasks. . . . . The bin holding the needed screwdriver or watch or bottle of vitamins simply lights up, turning the exercise” — by which he means the task that pickers do “300 to 400” times an hour — “into a gentle game of Whac-A-Mole.”\nWhat is most pernicious of all is the way Sheiber uses the workers themselves to make us feel good about all of this. One speaks highly about his Amazon job because his former job was even more tedious. Three more — “a former Uber driver, a former tollbooth cleaner, and a former assistant deli manager” — had come to Amazon from jobs that paid even less. There are worse jobs, so there’s no need to wring our hands about work conditions or compensation — these workers should be grateful.\nSheiber doesn’t think to ask how long they have been there, how long they plan to stay. He didn’t ask for a list of workers he could contact off the job. He didn’t get statistics on injury rates. Instead, he leaves us with a feel-good anecdote about “small acts of rebellion.”\nNear the entrance of the Staten Island center was a wooden cart with a big pile of bananas. A sign announced that the bananas were free (“Yes, Free!”), but with a caveat: “Please, take just one at a time,” the sign said. . . . . I was standing about fifteen feet away when I saw it: A woman walked by and grabbed two.” That second banana apparently makes workers and Amazon even.\nMore than a hundred years ago, the engineer Frederick Taylor authored The Principles of Scientific Management, a treatise on how to speed up work and, even more important, strip all control over production from the worker through time and motion study.\nTaylor thought most workers were slackers, producing “in many instances not more than one-third to one-half of a proper day’s work.” And, as William Serrin put it, he thought workers were morons. “The workman who is best suited to actually doing the work is incapable of fully understanding this science, without the guidance and help of those who are working over him. . . . . almost every act of the workman should be preceded by one or more preparatory acts of the management which enable him to do his work better and quicker than he otherwise could. This is the essence of modern scientific or task management.”\nThere are two ways to look at work and workplaces. Amazon wants us to think like a consumer: faster, cheaper, one-day delivery, two-hour delivery, by people who could have it much worse. Go Amazon! Or we can think about our lives as workers, as producers, about the way we would like to be treated (and paid) where we work. That work — this thing that consumes half of our waking lives — should not be intolerable, doesn’t need to be intolerable. And it can be made tolerable, if workers — not benevolent Amazon managers — work to make it so. Noam Sheiber seems much more comfortable with the former.", "url": "https://www.jacobinmag.com/2019/07/amazon-workers-new-york-times"}