{"authors": ["Emily Lowe", "Tommy Simmons Newsroom Idahopress.Com"], "date_download": "2020-05-04 20:25:50", "date_modify": "2020-05-04 20:25:50", "date_publish": "2019-03-03 07:20:00", "description": "Idaho's Lieutenant Governor posted a picture to Facebook Thursday “sending love” to a man sentenced to federal prison for his role in a 2014 standoff. The post on Janice McGeachin’s Facebook...", "filename": "_47e188cb240f4c1ca1d8dbb5b63d00e4_1588623950.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_47e188cb240f4c1ca1d8dbb5b63d00e4_1588623950.html", "title": "Idaho Lt. Gov. poses with protesters in support of standoff prisoner", "title_page": "Idaho Lt. Gov. poses with protesters in support of standoff prisoner", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Idaho’s Lieutenant Governor posted a picture to Facebook Thursday “sending love” to a man sentenced to federal prison for his role in a 2014 standoff.\nThe post on Janice McGeachin’s Facebook page has since been removed. McGeachin, a Republican from Idaho Falls, took office in January after being elected as Idaho’s first female lieutenant governor.\nThe post read, “Sending love to Todd Engel from the Idaho Capitol and ‘getting to know’ the new Senate Pages.”\nEngel, an Idaho native, was sentenced to 14 years in federal prison in July for his role in a 2014 standoff near the Nevada ranch of Cliven Bundy, known for fighting the government over grazing rights on federal land, according to a previous report in The Spokesman Review .\nIn January 2018, charges were dismissed against Bundy, who later moved to Gem County , as well as two of his sons and an independent militia leader related to the standoff for Bundy’s unpaid grazing fees, according to the report. Engel was found guilty and charged with obstruction and traveling across state lines in aid of extortion.\nThat was after August 2017, when 31 members of the Idaho Legislature penned a letter to then-U.S. Attorney General Jeff Sessions , urging him to end the Bunkerville standoff case. While the letter did not mention Engel by name, it did reference other defendants in the case, including the Bundies, as well as Eric Parker and Scott Drexler, both of Idaho. In January 2018, Parker, of Hailey, was introduced to the House by Rep. Dorothy Moon, R-Stanley, according to a report in the Spokesman Review . He received applause from multiple house members.\nIn Thursday’s photo, McGeachin, forming a heart symbol with her hands, stood next to two men dressed in prison garb with “Engel” on the front. The men are both showing a symbol — three extended fingers with the thumb and pointer finger touching — which, according to the Southern Poverty Law Center , is a symbol representing the group Three Percenters, a Second Amendment rights group.\nMcGeachin provided no comment to a group of reporters waiting outside her office in the Idaho State Capitol or while she walked to the Senate. An Idaho Press call to McGeachin’s office was not immediately returned.\nSen. Michelle Stennett, Sen. Cherie Buckner-Webb and Maryanne Jordan with the Democratic Leadership Office released a statement Friday morning expressing their concern with the picture posted by McGeachin. While acknowledging their commitment to free speech and openness, they are also “mindful of our responsibilities as elected officials to hold ourselves to a higher standard; to be thoughtful in our words and behavior,” the statement read.\n“We have heard numerous grave concerns overnight and today from constituents who are now fearful of coming to the statehouse. Some have said they will not allow their children to visit. The openness of the statehouse is foundational to our service. Whatever the intention of the post, the impact has resonated negatively across the state,” read the statement. “We stand ready to engage with our colleagues to support an environment that upholds our oath of office and inspires confidence in our citizens.”", "url": "https://apnews.com/47e188cb240f4c1ca1d8dbb5b63d00e4"}