{"authors": ["Dede Biles"], "date_download": "2020-05-04 20:25:59", "date_modify": "2020-05-04 20:25:59", "date_publish": "2019-03-22 12:00:00", "description": "As Aiken County’s emergency management director, Paul Matthews often is in the news whenever there is the potential for a disaster to strike. Because he’s used to that type of attention,...", "filename": "_0193c8ee9c134fbc909da319a6e35ea0_1588623959.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0193c8ee9c134fbc909da319a6e35ea0_1588623959.html", "title": "Matthews honored as Palmetto State's Emergency Management Director of the Year", "title_page": "Matthews honored as Palmetto State's Emergency Management Director of the Year", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "As Aiken County’s emergency management director, Paul Matthews often is in the news whenever there is the potential for a disaster to strike.\nBecause he’s used to that type of attention, Matthews is always ready to provide information to the media, various local officials and others.\nBut he wasn’t prepared for the spotlight when he was recognized as the S.C Emergency Management Director of the Year for 2019.\n“I was totally surprised by it,” said Matthews of the honor, which he received last month during the S.C. Emergency Management Association’s Annual Workshop in Myrtle Beach.\nMatthews became Aiken County’s interim emergency management director in March 2015. The following year, the county made his role permanent.\n“He’s done a fine job since he’s been the director,” said Aiken County Administrator Clay Killian of Matthews. “He has taken our emergency management program to a new level. When something happens, like a tornado or a hurricane, he always has a team ready to go.”\nDuring Aiken County Council’s meeting March 19 at the Aiken County Government Center, Killian recognized Matthews and read comments made by S.C. Emergency Management Division Director Kim Stenson, who nominated Matthews for the Emergency Manager of the Year award.\nAccording to Stenson, Matthews “has built Aiken County Emergency Management into an agency that can be called upon at a moment’s notice to help those in need,” and he “exemplifies what it means to actually manage an emergency before, during and after a major disaster.”\nDuring his tenure, Matthews has worked with Augusta University to develop a Continuity of Operations Plan to address how critical operations locally would continue under a broad range of circumstances.\nHe also has offered internship opportunities for college students interested in emergency management.\nIn addition, Matthews obtained a grant that allowed him to hire one of those interns, Parker Riggs, as an emergency management planner.\nMatthews currently is focusing on developing a system of five weather stations that will provide real-time data from different locations in the county.\n“We’ve got three of the five stations up, and we’re working on getting the bugs worked out in some of the telemetry,” he said.\nServing as the county’s emergency management director is a job that Matthews enjoys, mainly because of the spirit of cooperation that exists locally.\n“I’m very fortunate to be part of a team that works so well together,” Matthews said. “The cities, the sheriff, EMS (emergency medical services), fire departments, Public Works and Code Enforcement – we all work very, very well together. I’m blessed because not all communities are that way. We just work together here to get the job done, and that makes all the difference in the world.”", "url": "https://apnews.com/0193c8ee9c134fbc909da319a6e35ea0"}