{"authors": ["Brandpoint", "Bpt"], "date_download": "2020-05-04 21:06:31", "date_modify": "2020-05-04 21:06:31", "date_publish": "2019-05-17 19:52:38", "description": "(BPT) - Playing video games is not simply entertainment or an escape for middle school girls; it can be a confidence booster. The best games offer intellectual challenges, social interaction and a...", "filename": "_63d833576aaa459589710a163de1cf90_1588626391.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_63d833576aaa459589710a163de1cf90_1588626391.html", "title": "Video games that help young women solve problems and express themselves", "title_page": "Video games that help young women solve problems and express themselves", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "(BPT) - Playing video games is not simply entertainment or an escape for middle school girls; it can be a confidence booster. The best games offer intellectual challenges, social interaction and a creative outlet. These games provide opportunities for young women to problem solve, be part of a group, express themselves and find their voice.\n“For many tween/teen girls, gaming can be a star with many points,” says Taina Malén of Star Stable , an online multi-player PC game designed for Gen Z girls. “For some, a game can be about storytelling and adventure; for some, it’s about caretaking; for some, it’s about hobbies; for some, it’s about sport and competition; for some, it’s about socializing. For all, it’s about self-expression — about simultaneously fitting in and standing out.”\nHere are five features and characteristics to consider when choosing video games for a tween or teen girl:\n1) Find games that challenge her to think.\nGames involving problem-solving help girls feel a sense of accomplishment. When girls analyze a problem and resolve it successfully, it boosts their confidence. Many games today incorporate problem-solving as part of the adventure, such as multi-player games where girls work together to solve quests or challenges.\n2) Look for games that require collaboration and teamwork.\nGames that encourage or even require girls to work together help players hone their collaboration and communication skills, while creating a sense of community. In-game friendships (sometimes with players many states away) can expand the world around them. Games rooted in a positive, shared social experience and teamwork encourage collaboration and friendship.\n3) Choose games that mirror her interests.\nToday’s tween girls have varied interests, and there are games that support virtually every pursuit — art, music, sports or animals. In addition to immersing themselves in a game subject they love, they are likely to find other girls with the same passion to “nerd out” about horses or soccer or fantastical worlds.\n4) Research games that encourage self-expression.\nToday’s girl gamers tend to prefer open world or sandbox games that let them be creators, where they are customizing characters, building worlds or directing the plot. Girls at this age are in a constant battle to fit in and stand out. Games that allow a customized experience will not only give them a sense of control and decisiveness, but will also let them put their own unique stamp on their game experience — which can be very empowering.\n5) Select games rich in storytelling and music.\nJust like a favorite movie, today’s games must also include a clever and interesting story, rich characters and original music. Tween/teen girls are sophisticated consumers, and an evolving story line and fresh music are markers for a game that is worthy of its cost. In many cases, game play can spill over to socializing, where girls talk plot and how it will unfold, the location of hidden gems or why they love a new song. A game like Star Stable can be the springboard for turning a gamer into a creator, where girls are inspired to make music videos, write poetry or produce artwork.\nThese days, gaming is so much more than a simple pastime. It can be a place where girls connect with people with similar interests, grow friendships and express themselves. Helping them find the right game can reinforce their favorite interests and increase their self-confidence, and maybe even make those tween and teen years a tiny bit easier, and more fun.", "url": "https://apnews.com/63d833576aaa459589710a163de1cf90"}