{"authors": ["Mark Reagan Staff Writer"], "date_download": "2020-05-04 20:03:45", "date_modify": "2020-05-04 20:03:45", "date_publish": "2019-04-11 02:15:00", "description": "In observance of Child Abuse Prevention Month, Tip of Texas Family Outreach planted 300 blue-and-silver pinwheels Wednesday morning in front of the Cameron County Courthouse. Alma Herrera,...", "filename": "_412bb169e24e403babd2a3a54274b701_1588622625.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_412bb169e24e403babd2a3a54274b701_1588622625.html", "title": "Raising Awareness: Pinwheels placed at courthouse for child abuse awareness", "title_page": "Raising Awareness: Pinwheels placed at courthouse for child abuse awareness", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In observance of Child Abuse Prevention Month, Tip of Texas Family Outreach planted 300 blue-and-silver pinwheels Wednesday morning in front of the Cameron County Courthouse.\nAlma Herrera, executive director of the organization, said the pinwheels were donated by 445th state District Judge Gloria Rincones, County Court-at-Law No.5 Judge Estella Chavez-Vasquez and attorney Linda Gonzalez.\n“We are doing this as a way to raise community awareness and support the children,” Herrera said as members of the District Attorney’s Office, including victim advocates and members of its Child Abuse Unit, placed the pinwheels and posed for photos.\nTip of Texas Family Outreach works to make sure children are raised in a safe, healthy and nurturing environment.\n“We are a child abuse prevention organization providing an array of supportive services in the community,” Herrera said.\nThose services include parenting classes, a team parenting program, free counseling, education workshops and providing emergency basic needs for children and families.\nCameron County District Attorney Luis V. Saenz said Tip of Texas Family Outreach is a great example of how partners work together in the community toward preventing child abuse, a scourge that will likely never fully be extinguished.\n“When is this going to end,” Saenz asked. “The reality is it’s not and we have to deal with that.”\nOne way to deal with that is by raising awareness about child abuse, which translates into more cases for his office to prosecute.\n“What I mean is the more we educate on what to look for and how to make outcries, the more awareness there is,” Saenz said.\nBut, the cases that land in his office continue to be alarming and seem to get worse and worse, he said.\n“How do you combat this when in 95 percent of the cases, the perpetrator is in the household and is a family member or a friend who is in the circle of trust,” Saenz said.\nHowever, prosecutors and community organizations are always going to be out there raising awareness and prosecuting cases, he said.\n“We will never give up,” Saenz said.\nThe Tip of Texas Family Outreach will continue to raise awareness Saturday with its Walk For Child Abuse Prevention & One Mile Fun Run at 455 E. Levee Street at 8 a.m.\nRegistration is $10 and the proceeds will benefit the service the center provides to the community.\nFor more information on the fundraiser, call (956) 541-5566.\nmreagan@brownsvilleherald.com", "url": "https://apnews.com/412bb169e24e403babd2a3a54274b701"}