{"authors": ["Ignacio Laguarda"], "date_download": "2020-05-04 20:08:00", "date_modify": "2020-05-04 20:08:00", "date_publish": "2019-03-07 03:55:07", "description": "STAMFORD — Removing vinyl floors and walls, renovating the heating and cooling system, and lowering the height of the fire access road are some of the improvements planned at Westover Magnet...", "filename": "_11e62a1d42fd4e2f8f476208a71d0b9d_1588622880.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_11e62a1d42fd4e2f8f476208a71d0b9d_1588622880.html", "title": "Westover renovation may cost at least $20 million", "title_page": "Westover renovation may cost at least $20 million", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "STAMFORD — Removing vinyl floors and walls, renovating the heating and cooling system, and lowering the height of the fire access road are some of the improvements planned at Westover Magnet Elementary School for the 2020-21 school year.\nThe project, which could cost at least $20 million, is expected to take more than year to complete.\nIn the meantime, students will remain at the temporary location of the 1 Elmcroft Road campus, which is owned by Building and Land Technology (BLT) the former world headquarters of Pitney Bowes.\nIn early November, the city’s Mold Task Force announced they will close the Westover Stillwater campus indefinitely due to water intrusion and mold infestation.\nMembers of the task force presented their plan to fix the problems to an audience of parents and residents at the Elmcroft Road building on Wednesday night.\nOne would involve lowering the elevation of the fire access road that leads to the north and west sides of the building. That road is at or near first floor level and directs water toward the structure, which led to water being trapped under the slab foundation.\nThat issue led to water coming up through the floors.\nJoe Reilly, of KG&D Architects, said the vinyl floor tiles and all the interior walls will need to be removed to install a barrier above the slab.\nDirector of Administration and Task Force Member Michael Handler said the heating, ventilation and air conditioning, or HVAC, system will need to be renovated.\nHe said 70 ventilators are in the school and all are failing.\nReilly said the air in the building is not balanced, since the system is not releasing enough exhaust air.\n“The air in the room becomes stagnant,” he said. “The unit ventilator stops being effective and stagnant moist air sits in those spaces. ... The lack of air balance in the building is a significant factor in the way the building is behaving when it is wet inside.”\nThe answer, he said, would be to add ductwork and install exhaust fans to balance the air in the building.\nHandler said the vinyl walls in the school were conducive to mold growth.\n“The glue in the vinyl is a great food source for the mold,” he said.\nFor the renovation, he said every wall on the first floor will come down, while vinyl on second floor walls will be stripped off.\nSome parents at the meeting voiced their displeasure with having their children attend school at the BLT building for another school year. One asked if Westover parents could get preference in moving to a different magnet school.\nTamu Lucero, Stamford Public Schools deputy superintendent, said that wouldn’t be possible.\n“I don’t know that it would be fair for any other family who’s been applying,” said Lucero.\nFrank Domiziano, who has two kids at Westover, scoffed at the mention of fairness.\n“Why wouldn’t Westover parents get preference since you guys failed us?” asked Domiziano. “The city failed us. Why wouldn’t we get that?”\nHandler said a number of factors led to Westover School’s closing.\nFor starters, the existing 1990s era building has design and construction flaws, he said. Second, a lack of maintenance and capital funding led to the deterioration of the interior of the building.\nFinally, he said, the climate led to a veritable perfect storm of conditions, which resulted in the rapid growth of mold in the school.\n“If we never had this July and August, I suspect we’d still have buckets in our hallways catching rain water from the roof, I’d suggest we’d still have water coming in under the doors when it rains … but it would never blossom into something that was concerning because we never had the conditions that were ripe for mold,” he said.\nignacio.laguarda@hearstmediact.com", "url": "https://apnews.com/11e62a1d42fd4e2f8f476208a71d0b9d"}