{"authors": ["David Fierro"], "date_download": "2020-05-04 20:12:59", "date_modify": "2020-05-04 20:12:59", "date_publish": "2019-01-21 23:55:31", "description": "A hat trick by Chase Maxwell did the trick for Xavier Monday against hockey rival Greenwich. The senior forward’s three goals propelled Xavier past Greenwich, 4-1, in a mid-season,...", "filename": "_974ce7a10746497ab1617dd90646681e_1588623179.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_974ce7a10746497ab1617dd90646681e_1588623179.html", "title": "High School Roundup GHS hockey falls to Xavier", "title_page": "High School Roundup GHS hockey falls to Xavier", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A hat trick by Chase Maxwell did the trick for Xavier Monday against hockey rival Greenwich.\nThe senior forward’s three goals propelled Xavier past Greenwich, 4-1, in a mid-season, non-conference matchup at Dorothy Hamill Skating Rink.\nThe Falcons, who had been struggling, upped their record to 3-8 with the win. Greenwich, meanwhile, dropped to 3-5-2.\n“Xavier is a very good team, though their record may not indicate it,” GHS coach Chris Rurak said. “They have three solid lines, a good goalie and they are a tough, physical team.”\nTrailing 2-0 in the third period, the Cardinals closed to within a goal when senior forward Matt Davey tallied from the right wing off a strong rush up the ice with 6:28 remaining.\nGreenwich couldn’t tally the equalizer, however, as Xavier padded its lead at the 2:32 mark of the final period, after holding off the Cards. Cashing in on Greenwich’s inability to clear the puck out of its zone, the Falcons made it 3-1, courtesy of forward Trevor Early and Maxwell.\nMaxwell sent a pass across the ice to Early, who from the right face-off circle converted a snap shot, giving the visitors a 3-1 advantage. An empty-netter by Maxwell put the Falcons ahead, 4-1 with 1:14 to go in the final period.\n“It seems like every game the puck just isn’t bouncing our way and things aren’t going our way with the penalties,” Rurak said. “We have found our identity, we want to be a physical, blue-collar team and that’s how we have to play. I feel that we’re playing well and moving in the right direction. We started out playing well today, but penalties hurt us.”\nXavier took a 1-0 lead with 3:07 left in the first period. Positioned at the post, Maxwell received a pass from sophomore forward Nick Leclaire and one-timed the puck past GHS junior goalie Ben Nash, giving the Falcons a 1-0 edge 23 seconds into its power play.\nGreenwich was forced to kill penalties the majority of the second period. Xavier went on a power play three times after Greenwich was charged a too-many-men-on-the-ice infraction at the 8:29 mark in the period, a high-stick penalty with 6:04 remaining and an interference and unsportsmanlike penalty with 2:21 left.\nStrong play in goal by Nash kept it a 1-0 game for most of the period, but the Falcons capitalized on their third power-play opportunity. Maxwell snapped a shot from just above the left face-off circle that whizzed past Nash’s glove and settled inside the right corner of the goal, putting Xavier on top, 2-0, with 1:20 left in the second period.\nDespite spending a lot of time killing penalties, Greenwich had a good amount of chances in the second period. Davey tested Kellen Beauton with a backhand, but the Falcons goalie came up with a stop at the 12:40 mark of the second period.\nBeauton made a pad save off a shot from the point from GHS sophomore forward Jake Shredders with 10:10 to go in the second period, then made a save off a shot from the right wing from Cardinals senior forward Sean Pratley with 3:50 left.\nGreenwich is right back in action Tuesday against Trumbull at 4:30 in an FCIAC matchup at Dorothy Hamill Skating Rink.\n“It’s a big FCIAC game that we need to win,” Rurak said. “The top six teams make the FCIAC Tournament, so we have to start winning some conference games and put ourselves in position to make the tournament.”\nSACRED HEART BASKETBALL\nFollowing its first loss of the season on Friday, Sacred Heart Greenwich got right back on the winning track on Saturday, defeating visiting Millbrook School, 54-35.\nThe Tigers jumped out to a 31-14 halftime lead and never looked back on their way to improving their record to 11-1. An 8-0 run by Millbrook early in the second half cut Sacred Heart’s lead to 12 points, but the Tigers regained the momentum and added on to their advantage.\nSarah Eckerson, a senior center, scored 19 points and pulled down 14 rebounds to spark Sacred Heart’s offense. Displaying strong shooting, junior guard Leah Atkins scored 15 points and recorded four steals in the winning effort.\nThe Tigers travel to Greens Farms Academy on Wednesday.\ndfierro@greenwichtime.com", "url": "https://apnews.com/974ce7a10746497ab1617dd90646681e"}