{"authors": [], "date_download": "2020-05-04 20:17:35", "date_modify": "2020-05-04 20:17:35", "date_publish": "2019-05-06 08:00:00", "description": "Kelly Clarkson feels \"horrible\" as she recovers from surgery. The 37-year-old singer had an operation on Thursday (05.02.19) to remove her appendix after hosting the Billboard Music Awards...", "filename": "_01b586c61e6c460aab185e507e794391_1588623455.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_01b586c61e6c460aab185e507e794391_1588623455.html", "title": "Kelly Clarkson feels 'horrible' after having her appendix removed", "title_page": "Kelly Clarkson feels 'horrible' after having her appendix removed", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Kelly Clarkson feels “horrible” as she recovers from surgery.\nThe 37-year-old singer had an operation on Thursday (05.02.19) to remove her appendix after hosting the Billboard Music Awards the night before, and now she has admitted she is finding it difficult to take it easy.\nTaking to Twitter, she wrote: “Quick recap... recovering after surgery super duper sucks. “Turns out I don’t “rest” well (so bored), pain meds make me feel a different kind of horrible 2 where I question if I’d just rather feel the pain instead, & 2 out of the 3 scars feel as if Lord Voldemort is always near.”\nKelly broke down in tears due to the pain after of suffering from appendicitis after fronting the BMAs at the MGM Garden Arena in Las Vegas on Wednesday night (05.01.19), and afterwards she flew home to Los Angeles to undergo the operation the following morning.\nShe tweeted: “Not gonna lie.... I may or may not have broken down in tears after the show from pain BUT thanks 2 all the amazing people @ Cedars-Sinai I flew home directly after the event, nailed the surgery early this morning, & feeling awesome now! Bye bye appendix #TheShowMustGoOn (sic)”\nKelly had been suffering from appendicitis all week, but still managed to present the awards show - at which Drake scooped 12 prizes, including Top Artist - and perform her new tune ‘Broken & Beautiful’.\nShe also performed a song medley, including Cardi B, Bad Bunny and J Balvin’s collaboration ‘I Like It’, Maroon 5′s ‘Girls Like You’, and Maren Morris and Zedd’s ‘The Middle’.\nWhat’s more, the ‘Beautiful Disaster’ hitmaker poked fun at herself being accidentally mistaken for a seat filler at last month’s Academy of Country Music Awards.\nShe sat in the audience next to actor Terry Crews at the start of the Billboard Music Awards ceremony and was discussing Taylor Swift and Brandon Urie’s show-opening performance of ‘ME!’ when a security guard - played by NFL star Rob Gronkowski - asked her to move.\nFollowing the ACM Awards last month, she tweeted: “The greatest thing by far that happened to me tonight was being asked to move because some guy thought I was a seat filler at the ACM’s tonight #CantWinEmAll literally, it made my night because he was so serious, and I just politely said no hahaha!! (sic)”", "url": "https://apnews.com/01b586c61e6c460aab185e507e794391"}