{"authors": ["Sentinel"], "date_download": "2020-05-04 20:09:28", "date_modify": "2020-05-04 20:09:28", "date_publish": "2019-03-28 10:53:58", "description": "By Marisa Ingemi Boston Herald When David Pastrnak first returned from thumb injury, it seemed he needed to readjust to handling the puck; head coach Bruce Cassidy said as much after...", "filename": "_6e27c27c091b4c28b6daa9788bfd0559_1588622968.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6e27c27c091b4c28b6daa9788bfd0559_1588622968.html", "title": "Pastrnak, Bruins Beat Up on Rangers", "title_page": "Pastrnak, Bruins Beat Up on Rangers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "By Marisa Ingemi\nBoston Herald\nWhen David Pastrnak first returned from thumb injury, it seemed he needed to readjust to handling the puck; head coach Bruce Cassidy said as much after Wednesday’s morning skate.\nHe had scored since his return, but there was still some rust to shake off after missing 16 contests.\nConsider that rust amply shaken off.\nThe 22-year-old netted a hat trick to lead the Bruins to a 6-3 win over the Rangers at the Garden on Wednesday night, moving them closer to clinching home ice advantage in the first round of the postseason. Pastrnak picked up five points total, while Brad Marchand dished three assists and Torey Krug had two helpers in his return.\nFour of the Bruins six tallies came on the power play, including their final three.\nWith a Maple Leafs loss in a shootout earlier in the day, the Bruins moved to six points ahead of their divisional rival for home ice in their inevitable first round playoff bout.\nIt was Pastrnak’s third hat trick this season.\nPastrnak ripped his 34th tally of the year (even with 16 games on the sidelines) just 2:48 into the contest, taking advantage of an early too many men call on the Rangers.\nThe Rangers capitalized on a power play chance of their own in the first. With Zdeno Chara in the box for flipping the puck over the glass, Rangers leading scorer Mika Zibanejad deked through the Bruins defense on a zone entry and buried the puck past Jaroslav Halak to put it in a deadlock with 3:51 left in the frame.\nAmidst more line shuffling in the second period, Pastrnak found some of the previous magic he had with David Krejci to put the Bruins back ahead. With 10:45 to play in the middle frame, Krejci dished to his right to the charging Pastrnak, who had an open net with Henrik Lundquist sprawling towards Krejci.\nKrug’s assist on Pastrnak’s second goal was the 284th point of his career, moving him into first place all-time among American players in Bruins history.\nPastrnak’s big night continued into the third. Secure on the second line, he took a feed from Krejci down ice and connected with an open Jake DeBrusk streaking down the right circle, who tallied his 24th goal of the season with 16:41 to play.\nThe Rangers responded in turn, with Ryan Strome poking a loose puck through Halak with 14:17 remaining to bring them back within one.\nNew York pressed throughout the third, though the Bruins had plenty of chances. Just beyond halfway through the final frame, Danton Heinen rang the crossbar.\nTheir luck hadn’t run out quite yet, though.\nPastrnak blasted another goal for the hat trick just 14 seconds into the Bruins third period power play to give the B’s a two-goal cushion with 7:08 to play.\nBergeron, following a Rangers second too many men call, put the Bruins ahead 5-2 with 3:37 to play on a 5-on-3. Not done still, Charlie McAvoy potted the B’s fourth man advantage goal of the night with 2:48 to play for the 6-2 lead.\nZibanejad scored with four seconds left for the Rangers last goal, but it was far too late.\nDavid Backes got into it with Lias Andersson late in the game, following Andersson’s headshot attempt on Bergeron in the second period that resulted in a Bergeron near-fight, and a power play for the B’s in the second.\nThe Rangers, who lead the league in penalty minutes per game, got the scrap they wanted late, but it was far too late on the scoreboard.\nThe Bruins face Florida at home on Saturday before a final three-game road trip.", "url": "https://apnews.com/6e27c27c091b4c28b6daa9788bfd0559"}