{"authors": ["Bob Sandrick", "Special To Cleveland.Com"], "date_download": "2020-05-04 20:08:23", "date_modify": "2020-05-04 20:08:23", "date_publish": "2019-03-01 20:50:55", "description": "Two drunk men arrested for fighting outside Shell; two women fight outside Lakefront Lines: Brook Park police blotter Disorderly conduct, Smith Road: A Brook Park man and a Middleburg...", "filename": "_2c6cc1a014264b84946078d3261bf184_1588622903.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2c6cc1a014264b84946078d3261bf184_1588622903.html", "title": "Two drunk men arrested for fighting outside Shell; two women fight outside Lakefront Lines: Brook Park police blotter", "title_page": "Two drunk men arrested for fighting outside Shell; two women fight outside Lakefront Lines: Brook Park police blotter", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Two drunk men arrested for fighting outside Shell; two women fight outside Lakefront Lines: Brook Park police blotter\nTwo drunk men arrested for fighting outside Shell; two women fight outside Lakefront Lines: Brook Park police blotter\nDisorderly conduct, Smith Road: A Brook Park man and a Middleburg Heights man, both 27, were arrested at about 2:30 a.m. Feb. 20 after they fought each other outside Shell, 5918 Smith.\nThe two men had been drinking and arguing at Solid Gold Lounge on Snow Road. They drove separately to Shell to buy cigarettes, met each other again and continued their argument, this time with fists.\nPolice on patrol saw the fight, ordered the men to stop and they complied. A third drunk man, 32, from Brunswick, was watching the fight. Police released him to a sober driver.\nDisorderly conduct, Brookpark Road: A Lakewood woman, 34, and a Brooklyn woman, 21, fought each other at about 6:15 p.m. Feb. 5 in the parking lot of Lakefront Lines, 13315 Brookpark.\nThe fight was over something that happened at a recent birthday party. The two women punched each other. Lakefront Lines workers called police. By the time police arrived, the women had been separated. Neither woman wanted to press charges.\nReckless operation of a vehicle-fleeing & eluding, Interstate 480: An unidentified driver led police on a high-speed vehicle chase at about 9:45 a.m. Feb. 19.\nPolice tried to pull over the driver’s car because it was traveling more than 130 mph on I-480. But the driver didn’t stop. Police stopped the chase after about a mile because the driver was traveling on the freeway’s left berm and they were concerned about the safety of other drivers.\nTheft, Smith Road: Police hope to identify and arrest an unidentified male who stole merchandise, including alcoholic beverages and health and beauty aids, from Marc’s Deeper Discount Store, 5725 Smith.\nMarc’s reported the thefts -- which occurred on more than one occasion -- Feb. 20. The male had been stealing for two days by placing items into a garbage can inside the store, then carrying the garbage can out the rear employee door. The thefts were captured on security video.\nGrand theft vehicle, Snow Road: A company car owned by National Car Mart was reported stolen at about noon Feb. 17 from the parking lot of Howard Johnson by Wyndham, 16644 Snow.\nThe vehicle was later found in Brooklyn. It had been involved in a vehicle crash. A Cleveland woman, 56, who was driving the vehicle was arrested.\nTheft, Smith Road: A purse containing credit cards was stolen between 10:40-11:05 p.m. Feb. 15 from a car parked outside Planet Fitness, 5755 Brookpark. One of the car’s front windows was smashed to get inside.\nSudden illness, Bowfin Boulevard: Bowfin residents called police at about 7 p.m. Feb. 15 after hearing a man screaming in a neighboring driveway.\nWhen police arrived, the man waived them over to him. Three warrants had been issued for his arrest, and the man was carrying unidentified pills. He was taken to Southwest General Health Center in Middleburg Heights.\nTheft, West 130th Street: An unidentified female stole a 12-pack of Red Bull energy drink from Speedway, 5764 West 130th.\nA Speedway worker saw it happen and called police. The woman climbed into a sport-utility vehicle, driven by another unidentified person. The SUV drove away.\nTheft, Barbara Lane: Two video games and a wristwatch were reported stolen at about 11:15 p.m. Feb. 13 from a single-family home on Barbara. Police didn’t say if there were any signs of a break-in.", "url": "https://apnews.com/2c6cc1a014264b84946078d3261bf184"}