{"authors": ["Catherine Rampell"], "date_download": "2020-05-04 20:07:33", "date_modify": "2020-05-04 20:07:33", "date_publish": "2019-02-20 23:28:15", "description": "The far right wants to eliminate what it considers the vestigial organs of government, including the Education, Commerce and Energy departments. The far left wants to Abolish ICE. They’re...", "filename": "_d515edae537d4cac8ef6fe0792f7b1a9_1588622853.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d515edae537d4cac8ef6fe0792f7b1a9_1588622853.html", "title": "Abolish Congress - it’s not doing its job", "title_page": "Abolish Congress — it’s not doing its job", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The far right wants to eliminate what it considers the vestigial organs of government, including the Education, Commerce and Energy departments. The far left wants to Abolish ICE.\nThey’re both thinking too small. What America really needs to do — and what might actually receive strong bipartisan support — is to abolish Congress.\nSure, you might argue that the legislative branch has critical responsibilities, endowed by our sacred Constitution. Congress is an equal branch of government that provides checks and balances on the other branches.\nWithout Congress, you might ask, wouldn’t the president have completely free rein to act on his worst authoritarian impulses? But then again you might also ask: How would that be different from the situation we have now?\nWhy, just a few days ago, the legislature proved how little interest it has in exercising one of its most fundamental constitutional powers, the power of the purse.\nThe Constitution gives Congress the authority to appropriate federal dollars. This is a constitutionally mandated check on the executive branch and at the crux of our founding document’s separation of powers. In practice, it means the president cannot decide unilaterally to spend money for a purpose that Congress has rejected.\nAnd yet that is what happened last week.\nCongress has — multiple times now — explicitly denied President Trump’s request for billions of dollars for a border wall that we don’t need and that most Americans don’t want. After months of debate and a pointless shutdown, lawmakers appropriated $1.375 billion for border barriers, and not a penny more. Then Trump announced that he was declaring a “national emergency” to commandeer $8 billion for his pet project anyway.\nFederal lawmakers should have been livid at this power grab. Curiously, many were not. In fact, Senate Majority Leader Mitch McConnell, R-Ky. — one of the most powerful people in this supposedly powerful branch of government — declared this a splendid outcome.\nSo here’s my question to you, fellow taxpayers. If lawmakers are not going to perform their most basic constitutional functions, then what are we paying them (at minimum) $174,000 a year to do? We might as well can them all and save the money.\nTo be clear, this is not the only duty our derelict lawmakers have abdicated. Declaring war when we’re, in fact, at war comes to mind. As does, say, exercising the authority to “regulate Commerce with foreign Nations” and lay import duties.\nOver the past 80 years, Congress has voluntarily delegated much of this constitutional trade-regulating power away from itself and to the president, as trade historian Craig VanGrasstek lays out in his new book, “Trade and American Leadership.”\nMore recently, Congress turned a blind eye as Trump abused even that generously re-delegated authority. Here, too, Trump cited similarly bogus “national security” rationales to justify his overreach. Yet in response, Republican lawmakers — members of a party that once embraced free trade and sounded the alarm about an “imperial presidency” — have introduced legislation that would give the president even more discretion to levy tariffs without their interference.\nPerhaps they view their jobs as a sort of sabbatical in between more lucrative gigs in Fox News green rooms, at lobbying firms or as spokespeople for dietary supplements and get-rich-quick-with-marijuana schemes.\nOr perhaps they believe their laziness on most legislative concerns is offset by their recent hyperactivity on one particular constitutional duty. The Senate has, after all, been rubber-stamping judicial nominees at a record pace.\nEven so, it’s hard to argue that they’re performing much actual work in this capacity, given that the Republican-led Senate’s judicial confirmation decisions could easily be replaced by a simple software algorithm: If the judge is nominated by a president from our party, vote yea; if not, vote nay (or better yet, don’t allow a vote at all).\nA mere 11 percent of Americans have “a great deal” or “quite a lot” of confidence in Congress, which ranks it lower than any other major U.S. institution — including the presidency, banks, military, public schools or even (gasp) newspapers.\nWhich suggests that there’s at least one impressive feat Congress can still claim. It has managed to unite nearly all Americans — Democrats and Republicans alike — around a common purpose: Throw the bums out.\ncrampell@washpost.com", "url": "https://apnews.com/d515edae537d4cac8ef6fe0792f7b1a9"}