{"authors": ["Bob Kalinowski"], "date_download": "2020-05-04 20:27:34", "date_modify": "2020-05-04 20:27:34", "date_publish": "2019-02-09 00:00:00", "description": "NANTICOKE — The suspect in the massive theft from a city social club admitted to embezzling funds to support his lifestyle and a secret casino gambling habit, according to a search warrant...", "filename": "_51b763ac22004d6eb7e58db6d295b1ec_1588624054.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_51b763ac22004d6eb7e58db6d295b1ec_1588624054.html", "title": "Search Warrant: Suspect Stole From Club To Fund Gambling Habit", "title_page": "Search Warrant: Suspect Stole From Club To Fund Gambling Habit", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NANTICOKE — The suspect in the massive theft from a city social club admitted to embezzling funds to support his lifestyle and a secret casino gambling habit, according to a search warrant obtained by Nanticoke police. Search warrant documents identify the suspect as Daniel Wozniak, who was treasurer the past five years at the Honey Pot Club in the city’s Honey Pot section. Investigators say tens of thousands of dollars are missing from the club’s coffers. The theft came to light recently after utilities were shut off to the club’s building at 13 Honey Pot St. The utility shut off forced the Honey Pot Volunteer Fire Department out of service. The fire company is an affiliated, but separate, organization which shares the building with the club. City police said they recently were approached by board member Julianna Kobylarz, who reported the utilities were shut off due to months of unpaid bills. She and other members then discovered the club’s three bank accounts were “depleted,” police said. The next day, Wozniak’s wife, Jennifer, also a board member, came to police headquarters to report Wozniak was “missing” for several days, according to the search warrant. She said he had sent her an email admitting to stealing from the club. Police say Wozniak surrendered on Thursday and admitted to stealing from the club for several years. Wozniak, the club’s treasurer since 2014, said he initially wrote himself several checks, but mainly stole money each night from cash deposits, the search warrant says. When there wasn’t enough money to pay bills, he would transfer cash from the club’s savings account to its checking account until the point there was no money left, police said. Wozniak said he used the cash for personal purposes and to “fund his closeted casino gambling habit,” the search warrant says. Police say charges are pending the completion of the investigation and an analysis of the club’s financial records. Efforts to reach Wozniak on Friday were not immediately successful. Contact the writer: bkalinowski@citizensvoice.com 570-821-2055; @cvbobkal", "url": "https://apnews.com/51b763ac22004d6eb7e58db6d295b1ec"}