{"authors": ["Meagan Day", "Nick French", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Hadas Thier", "Eric Blanc", "Miles Kampf-Lassin", "Matt Stone"], "date_download": "2020-05-04 19:54:26", "date_modify": "2020-05-04 19:54:26", "date_publish": "2019-10-16 00:00:00", "description": null, "filename": "2019_10_aoc-bernie-endorsement-warren-2020-primary_1588622066.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/10/16074417/sanders_aoc_0.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_10_aoc-bernie-endorsement-warren-2020-primary_1588622066.html", "title": "AOC’s Endorsement of Bernie Makes Perfect Sense", "title_page": "AOC’s Endorsement of Bernie Makes Perfect Sense", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nLast month, the New York Times published a story that portrayed Alexandria Ocasio-Cortez as a politician who’s learning that she’ll catch more flies with honey than vinegar. “Ms. Ocasio-Cortez has tempered her brash, institution-be-damned style with something different: a careful political calculus that adheres more closely to the unwritten rules of Washington she once disdained,” the article read. Ocasio-Cortez bristled at the portrayal. On Twitter she wrote, “There will always be powerful interest in promoting the idea that the left is losing power 1 way or another. The big way they try to dismantle the left isn’t to attack it, but to gaslight & deflate it.” She accused the article of “dripping condescension.” She’s right: this is the moneyed centrist playbook. See how they’ve covered Bernie Sanders’s 2020 presidential campaign. Unable to characterize him as a naif getting a reality check, the mainstream media has resorted to repeatedly claiming that his campaign is dead in the water — despite the fact that his polling numbers remain consistent and that he’s been breaking all-time fundraising records. The angle of attack on Sanders is different, but the goal is the same: demoralize and diminish the Left by declaring the battle over already. It was already unfair to dub Ocasio-Cortez another would-be reformer who’s capitulated to the conservatizing pressures of the Democratic Party establishment. She has continually challenged the neoliberal status quo, especially in the realm of policy. Her Green New Deal legislation is phenomenally ambitious, as is the new suite of bills she’s calling “A Just Society.” And last night, news broke that proves that she’s still bucking the pro-corporate Democratic Party consensus: according to the Washington Post, Ocasio-Cortez will endorse Sanders for president this weekend, as will Reps. Rashida Tlaib and Ilhan Omar. So much for conciliation with the status quo.\nAn Endorsement That Makes Perfect Sense Bernie Sanders has been calling himself a socialist since he was a college student. For decades, he fought inside the halls of power for the working class — their right to health care, housing, a living wage, a union, freedom from violence, a secure retirement, a livable planet. In Congress, the independent Sanders caucused with Democrats on most votes. But he was largely alone when it came to demanding universal social programs and the decommodification of essential goods and services, and in claiming a political identity that pointed beyond capitalism, an unjust system that by design carves people up into classes and rests on the exploitation of person by person. After the Great Recession hit, voters were disillusioned with establishment politics. Surveying the environment, Sanders ran against Hillary Clinton in 2016. Despite entering the race with little name recognition against an opponent anointed and assisted by the party establishment and its wealthy donors, Sanders lost to Clinton with over 40 percent of the popular primary vote. In the process, he cracked open the Democratic Party electoral field. In his wake, left-wing challengers began to primary powerful, complacent, conservative incumbents. Many chose to adopt the political identity that Bernie Sanders himself uses: democratic socialist. One of these was Ocasio-Cortez. Now the 2020 presidential primary campaign is in full swing, and the field is much more crowded and ideologically diverse than last time. Sanders wants to build up the welfare state, redistribute wealth, and empower a mass movement of ordinary working-class people to force the state to put people over profit. Joe Biden represents the Clinton wing of the party, telling rich donors that under a Biden presidency, “Nothing would fundamentally change.” Pete Buttigieg, Kamala Harris, Beto O’Rourke, Cory Booker, and a handful of others are miming progressivism while remaining careful not to upset the capitalist class by going all-in on Sanders’s politics. And then there’s Elizabeth Warren, a longtime ally of Sanders in the Senate, making strides by running to their left. Of the contenders, Sanders is the strongest, clearest, most time-tested candidate for the working class. The top employers of individual donors to Sanders’s campaign are Starbucks, Walmart, and Amazon. Their top occupation is teacher. Sanders has the most support in the race from nurses, students, servers, social workers, information tech workers, truck drivers, electricians, retail workers, farmers, and construction workers. In 2016, Sanders set out to build a multiracial working-class movement that knows its enemies and welcomes their hatred. He has succeeded. What remains unanswered is the fate of this movement. Ocasio-Cortez has a crucial role to play in shaping its future. She wields a great deal of influence, especially among voters who are undecided between Sanders and Warren. When Ocasio-Cortez mounted her challenge to Joe Crowley in 2018, she released a powerful video of herself saying, “After twenty years of the same representation, we have to ask: who has New York been changing for? Every day gets harder for working families like mine to get by. The rent gets higher, health care covers less, and our income stays the same. It’s clear that these changes haven’t been for us.” Working people heard her and elected her to office. But one Ocasio-Cortez isn’t enough. She can’t actually accomplish her legislative goals if she’s isolated in Congress with a handful of allies. We need hundreds and eventually thousands of democratic-socialist elected officials to meaningfully shift the balance of power in favor of the working class. Ocasio-Cortez has shown she can be a movement-builder, strengthening the same forces that carried her into Congress and can carry many others behind her. That’s why it makes perfect sense that Ocasio-Cortez is endorsing Bernie Sanders for president. Sanders is building a diverse working-class movement behind him. Ocasio-Cortez’s endorsement shows that she wants to empower and help lead that movement.\nThe Cost of Neutrality Ocasio-Cortez didn’t have to endorse Sanders. She could have declined to endorse anyone, or opted for a dual endorsement of Warren and Sanders. Endorsing Sanders will further alienate Ocasio-Cortez from the Democratic Party establishment who, beholden to corporate interests, are uniformly hostile to Sanders’s campaign. The New York Times was wrong to announce that Ocasio-Cortez is bending to the establishment’s will. But she has faced and will continue to face intense pressure from party bigwigs and leaders in Congress. The establishment wants nothing to do with Sanders and is accepting Warren as a compromise candidate, and contravening the party establishment is likely to keep straining relationships with Democratic congressional leadership. That could lead to Ocasio-Cortez being shut out of important decisions, being denied leadership positions, or possibly even being primaried by her own party. So while Ocasio-Cortez’s political vision inevitably brings her into conflict with Democratic Party leadership, it makes sense that she might hesitate to antagonize its leadership too much. For Ocasio-Cortez to boost Sanders over Warren could be seen as an aggressive move, one that the Democratic Party might punish her for. Remaining neutral in the primary could have allowed Ocasio-Cortez to avoid unnecessary heat from the party, giving her room to more easily maneuver in Congress. It’s tempting to think that staying neutral is the best “long game” for advancing her political agenda. But placating party leaders will do little to help Ocasio-Cortez achieve the kind of transformative changes she wants. She seems to understand this. On the whole, the Democratic Party establishment represents the interests of wealthy donors and corporate lobbyists. Most of them will steadfastly oppose Ocasio-Cortez’s policy priorities, like Medicare for All, a Green New Deal, and a living wage, because these policies involve a massive redistribution of wealth and power from the ultrarich to the working class, which means they require working-class movements. Politicians like Ocasio-Cortez can enact and maintain fundamental, systematic change only if they have working people backing them up. That sort of movement can use the threat of lost votes to pressure policy-makers to ignore the voices of capitalist donors and lobbyists. The real long game is building a base powerful enough to win the demands that Ocasio-Cortez is championing. Playing nice with other Democrats will not help to do that. Ocasio-Cortez’s decision to back Sanders is strong evidence that she understands where her power comes from.", "url": "https://www.jacobinmag.com/2019/10/aoc-bernie-endorsement-warren-2020-primary"}