{"authors": ["Staff Writer"], "date_download": "2020-05-04 21:09:02", "date_modify": "2020-05-04 21:09:02", "date_publish": "2019-03-21 11:49:00", "description": "Dear readers, today I, Lovina (youngest daughter of Lovina), thought I’d give Mom a little break and write her weekly column. In case any of you are confused, I was named after my mom so we share...", "filename": "_3ae6b2b3c3c145f49a9770f616ab0f4c_1588626542.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3ae6b2b3c3c145f49a9770f616ab0f4c_1588626542.html", "title": "Homework should be illegal, young Lovina pleads", "title_page": "Homework should be illegal, young Lovina pleads", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dear readers, today I, Lovina (youngest daughter of Lovina), thought I’d give Mom a little break and write her weekly column. In case any of you are confused, I was named after my mom so we share the same name.\nAlthough I’m not as busy as my mom, it takes 90 percent of my energy to put so much brain into schoolwork! I think homework should be illegal, it is physically and mentally too stressful for our bodies.\nFor instance, when I ask mom to help me with my homework, it doesn’t really get me anywhere. She’s smart, but she wastes 10 percent of the little time I have by doing the multiplication problems on paper instead of using the calculator.\nI never thought I needed school. I always knew I was born a natural genius. Just don’t go asking any family members; they probably have stories that would tell you differently. Anyway, there’s no trying to get out of school now. Although I did try to get people to fall for my theory about being a natural genius, I gave up since this is my last year.\nI’m going to be graduating from eighth grade middle school in May. Time flies, it seems like yesterday I was in kindergarten. Even though sometimes I forget I’m not an adult yet.\nSometime this month we are going to present our school portfolios. I think there is a special name for it, but I forget. After presenting our portfolio to our parents and some other people, we will serve them dinner. The best part is that we eighth-graders get to bake the food for them ourselves. If I’m any good at that kind of stuff like my mom is, then the food should be edible. The school also hires a comedian to come in and be funny, I think. I’m nervous about presenting the portfolio, but other than that, it sounds like fun.\nRight now Loretta and Verena are making cookies. I should be helping them, but I get the fun part of eating them.\nThe weather here has warmed up a lot today. I can’t complain, I’ve been looking forward to it warming up. Earlier this week I had just started thinking that winter had left us … and then, of course, it snowed. On the bright side, there is still no doubt of me being a genius. I’m right 99 percent of the time! Apparently when it snowed that was the 1 percent of time I was wrong.\nMy brothers Joseph and Ben are doing chores. Kevin is reading his new set of books that mom got him. He is very proud of his books and gives me strict instructions on how to use them properly if I ask to read one.\nKevin asks me the most random questions that even I don’t know what they mean. Then when I can’t make sense of it, I sit in silence, which rarely happens with me. What else is there to do when my head is spinning in confusion?\nAnyway, I’m going to help mom and my sister make supper. Or the next question Kevin will be asking is, “Is supper ready yet?” I’m sharing one of my favorite recipes.", "url": "https://apnews.com/3ae6b2b3c3c145f49a9770f616ab0f4c"}