{"authors": ["Scott Slawson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:20", "date_modify": "2020-05-04 19:53:20", "date_publish": "2019-03-08 00:00:00", "description": null, "filename": "2019_03_ue-strike-ge-erie-pennsylvania-overtime_1588622000.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/03/08134122/ue.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_03_ue-strike-ge-erie-pennsylvania-overtime_1588622000.html", "title": "Working People Aren’t Going Quietly", "title_page": "Working People Aren’t Going Quietly", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "While the workers were on strike, Sen. Bernie Sanders invited UE Local 506 president Scott Slawson to attend his March 2 Brooklyn rally. (Sanders also used his lists to text and email people in Pennsylvania to turn out supporters to the UE rally outside Pittsburgh on Wednesday.) Slawson’s remarks are below. Thanks to Labor Notes‘s Dan DiMaggio for the transcription.\nEarlier this week, the company and the workers reached a ninety-day agreement and will return to work on Monday. They will continue bargaining for a longer-term agreement during that time; the union’s official statement did not speak to whether or not another strike could be possible if they did not reach an agreement after those ninety days.\nOne thousand seven hundred workers at the Westinghouse Airbrake Technologies (or Wabtec) locomotive manufacturing complex in Erie, Pennsylvania, walked off the job late last month in response to concessions demanded by their employer, which had recently bought the factory from General Electric. The workers are members of the historically militant United Electrical Workers (UE), and they drew a line in the sand against contract givebacks and two-tier wages.\nWabtec recently took over General Electric Transportation Division in Erie, Pennsylvania, where we build world-class locomotives. We attempted to meet with the company last year to start contract negotiations and they refused. They waited until the end of January to meet with its largest and most complex unionized workforce. Instead, they were too busy running around forcing concessionary contracts down the throats of workers at smaller Wabtec facilities around the country.\nAfter a mere seven sessions of negotiations had produced little progress, we proposed a thirty-day interim agreement, based on our current terms and conditions. This would have given both sides more time to negotiate a brand-new contract and ensure labor peace. We were looking for peace; they were looking for a fight. Our current terms and conditions were negotiated over the last eighty-two years and they made GE Transportation one of the most successful companies anywhere. The company told us they were not interested. Today 1,700 families are standing on a freezing cold picket line in Erie, Pennsylvania, saying we’ve had enough.\nThey insisted that all our 450 workers on layoffs would be treated as new hires if and when they got called back to work. They would be paid $20,000 to $30,000 less per year for the same job. Those are wages we were making in the nineties. They would force mandatory overtime and make up to 20 percent of our workforce temporary — almost 400 workers — with no union, low rates of pay, and no benefits. Again, we said we’d had enough. Those terms were unacceptable to us, and we will not go to work for Wabtec under those terms and conditions.\nThese conditions don’t just destroy our families, they destroy our communities. They destroy the company. You cannot have two-tier wage systems or a temporary workforce for high-skilled manufacturing employees and expect a business to be successful.\nWe make a living wage, and for that, we don’t make an apology. Generations of families in Erie have fought hard to build a great standard of living for us. We’re not gonna throw that away for our children and the generations of the future, just so a greedy corporation and its shareholders can take more. We know what works — with decent pay, solid benefits, and strong job protections, we make a high-quality locomotive, we turn a good profit for the company, and we provide a solid economic foundation for our community — it’s that simple. If you gut the living and working conditions not only will you hurt the members of the community — in the long run, you’ll hurt the company as well.\nOn top of all that, the company is insisting on combining our job descriptions, which puts our members’ health and safety at risk. That is something we absolutely will not tolerate.\nToday, 85 percent of our workers work voluntary overtime. When you force people to work mandatory overtime, how do you expect a community to thrive? They want to force people to miss church, weddings, little league games. Our members want the freedom to be able to help the community, to be in their children’s’ lives and their school activities. My union, UE, is proud to stand against forced overtime. Forty hours is enough for the employer to control your lives!\nFor decades, working people and the communities that they live in have been beaten down by greedy corporations while they pay themselves millions in bonuses and stock options. This is wrong. It’s a failed model, and we at 618 and 506 in Erie, PA, and our community intend to change that. We are fighting for every workers’ right to family-sustaining wages, good pay, decent benefits, and solid work protections for all.", "url": "https://www.jacobinmag.com/2019/03/ue-strike-ge-erie-pennsylvania-overtime"}