{"authors": ["Keeanga-Yamahtta Taylor", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Matt Bruenig", "Paul Heideman", "Malaika Jabali", "Meagan Day"], "date_download": "2020-05-04 19:50:04", "date_modify": "2020-05-04 19:50:04", "date_publish": "2019-06-18 00:00:00", "description": null, "filename": "2019_06_bernie-sanders-socialism-speech-capitalism-primary_1588621804.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/06/18135341/GettyImages-1149502671.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_06_bernie-sanders-socialism-speech-capitalism-primary_1588621804.html", "title": "Bernie Sanders’ Democratic Socialism Speech Was a Landmark", "title_page": "Bernie Sanders’ Democratic Socialism Speech Was a Landmark", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Last Wednesday, Bernie Sanders passionately argued for a “democratic socialist” United States. Sanders’s clear arguments for a complete transformation of the country showed why the mainstream media and the leadership of the Democratic Party have tried to marginalize his electrifying presidential campaign.\nIn the course of a single speech, Sanders demonstrated the existential threat he poses to the political status quo in the United States by exposing the roots of the hardship and deprivation that roil wide swaths of the country. He named capitalism as the culprit and democratic socialism as a solution. What a breathtaking turn of events.\nSanders’s address bowled through the diminished expectations of twenty-first century liberalism and the cruelty of right-wing demagoguery. In doing so, he provided a powerful counter-narrative to the entire political establishment, which has situated blame any and everywhere for the social and economic catastrophe that is unfolding in working-class and poor communities — except the economic system undergirding it all.\nFrom housing and health insecurity to poverty wages to the racism of the criminal justice system to the overwhelming reality of climate change, it’s clear that things are unraveling. It is a feeling that is experienced in the daily lives of ordinary people and yet is regularly made invisible by the political class and the economic elite. Sanders exposed these conditions as a way of life for millions of Americans, and he named the system at their root — capitalism.\nSanders described how “unfettered” greed and exploitation by the “billionaire class” is the central source of misery in the lives of ordinary Americans. Perhaps most poignantly, he graphically illustrated the most macabre disparity within US society by highlighting the stark difference in life expectancy between the rich and the working class. He noted an eighteen-year difference in life expectancy between the richest area of Virginia and the poorest. He said further, “While the rich get richer, they live longer lives. While poor and working families struggle economically and often lack adequate health care, their life expectancy is declining for the first time in modern American history.”\nIn a country where the political establishment has long denied the existence of “class” as a phenomenon in the United States, where notions of unfettered social mobility is supposed to be a defining feature of “American exceptionalism,” that a leading candidate for the US presidency has made class warfare the centerpiece of his campaign is a stunning turn of events.\nIn the last several decades, liberalism has lamented the absence of “opportunity” as the source of hardship in the lives of ordinary Americans. This has meant overvaluing skills training, education, and financial literacy to bridge the “opportunity gap.” Strategically, it has also meant an inordinate focus on mentorship, role modeling, grant-funded social initiatives, and other programmatic responses that essentially accept the limitations of our society rather than challenge them.\nAt the same time, conservatives have either blamed individual behavior or regulatory impingements on markets as the root of inequality. Among both liberals and the Right, then, there’s been an ingrained acceptance of a minimized role for the state in solving the crisis of inequality in the United States. Guaranteed, state-provided social provision seems like a hazy memory of a world that no longer exists.\nLast Wednesday, Sanders did more than call for a revamped welfare state. He described “economic rights” as human rights and linked various aspects of these rights — the right to housing, health care, education, jobs, and a good life — to “freedom.”\nWe shouldn’t underestimate Sanders’s political narrative as a powerful rejoinder to the typical mainstream explanations for poverty and hardship. Trump and the “nightriders” of the Republican Party laud the strength of the economic “fundamentals” while ignoring how its benefits are accruing almost exclusively at the top of society. But Trump’s Republicans are not completely clueless. Their vicious and raw provocations of race, ethnicity, and religion are intended to distract from their (more often than not completely legal) pilfering.\nThe white supremacists that head up the Republican Party want us all to believe that the biggest problems in the country are not their grotesque policies that steal the wealth of many and redirect it to the few. Instead, they point the finger at Mexicans, Muslims, and “the blacks.” Sanders did not resort to flowery homilies that claim this weaponized racism “isn’t us” or is somehow outside of the norms of American politics or other tripe. Instead, he argued that the wealthy use racism to destroy the living standards of ordinary workers by constantly fraying the “mutuality” that otherwise might bind us together.\nBeyond pointing out the centrality of scapegoats to Trump’s plunder, Sanders provided workers a framework with which to understand their oppression and exploitation. This is especially true for black workers, who have been told for forty years that their lower living standards and greater hardship is their own doing. In the same way that the eruption of the Occupy Movement helped cut through President Obama’s rhetoric — who blamed black communities for the conditions rendered by decades of racism — Sanders’s depiction of capitalism and the billionaire class as the culprit for inequality is vital to advancing a structural understanding of racial inequality.\nThere are critics who complain that Sanders does not talk enough about racism specifically, but they often do so by underestimating the economic dimensions of racial oppression in the United States. There is no race without class in this country. Black people are overrepresented among the ranks of the poor and working class because racism is used to justify lower wages, substandard housing, and tiered access to health care and education. This doesn’t mean that racism can be dismantled by fighting only against economic inequality. But it also means that the overlap between economic inequality and racism should not be ignored.\nWhen Sanders attacks the oligarchs of the Walmart empire, this is unmistakably confronting the overlapping issues of racism and class exploitation. Walmart is the largest private employer of African Americans, with nearly 46 percent of its workforce identified as black. When Sanders names the company’s notorious low wages and business practices as prime examples of practices that drive inequality, he is highlighting a key feature of what leads to greater levels of poverty and dispossession in black communities. When Sanders takes on Walmart, as he did in his speech, he is amplifying the voices of organized Walmart workers, a disproportionate number of whom are African American, that have been organizing for a $15 minimum wage and humane benefits for years.\nTo this end, it matters that Sanders used Martin Luther King Jr as a guidepost throughout his speech — not in a cheap way, but by drawing on the heights of King’s militancy when he politically fused the struggles for racial justice with calls for a “radical reconstruction” of US society.\nMost importantly, Sanders linked the possibility of ending capitalist oligarchy to a “political revolution” that calls on the many to stand up to the few. Unlike most mainstream politicians, who tell you that a vote for them is the solution to your problems, Sanders emphasizes the collective — “not me, us.” He could become president in 2021, but without an organized movement on the ground, the economic transformations he has argued for may be suffocated before they see the light of day. In other words, the Sanders campaign may be an entry point for many into political activism — not a graveyard.\nOf course, the Sanders speech was not perfect. His literal entombment in a sea of American flags went along with a silence on the crimes of US foreign policy. Whether it is the nearly one trillion dollars allocated by the federal government to the Department of Defense or the lawless and relentless drone campaign conducted by the military, US imperialism remains the most imposing impediment to peace in the world and a shackle on developing the kinds of social programs at the heart of his program for change.\nIn the spirit of Sanders’s “political revolution,” the expansion of the US welfare state from the thirties through the sixties was propelled by mass movements, sit-down strikes, rent rebellions, and urban uprisings. It would also do our side good to remember that Roosevelt ordered the internment of more than 120,000 Japanese-Americans in concentration camps during World War II and Lyndon Johnson spent hundreds of billions of dollars incinerating Vietnamese men, women, and children.\nYet to focus on this and other omissions is to truly miss the forest for the trees. Sanders is a reflection of the deepening radicalization in this country, but he is also helping fuel it forward by naming the source of misery and rejecting the well-worn habits of blaming American workers for their own despair. He is helping crush the political center made up of political mush like the underwhelming Beto O’Rourke, Kamala Harris, and Joe Biden.\nIt is still very early, and it remains to be seen if Sanders can overcome the dirty tricks of the Democratic Party and the wider political establishment that seeks to contain and tamp down his insurgency. But Sanders has lifted the discussion of politics and what should be expected from the richest society in the history of the world out of the gutter. It is clearly a new day in US politics.", "url": "https://jacobinmag.com/2019/06/bernie-sanders-socialism-speech-capitalism-primary"}