{"authors": ["Stephen Coulter"], "date_download": "2020-05-04 20:04:16", "date_modify": "2020-05-04 20:04:16", "date_publish": "2019-03-05 22:47:48", "description": "Emily Lee won’t have to endure another Christmas of watching her kids open gifts and fearing forgot something on their wish lists. The Ridgefield High School graduate has created an app,...", "filename": "_f4aae9e0a29c424ab20d4af732f08f54_1588622656.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f4aae9e0a29c424ab20d4af732f08f54_1588622656.html", "title": "bWISHd RHS grad creates app to track gift ideas", "title_page": "bWISHd RHS grad creates app to track gift ideas", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Emily Lee won’t have to endure another Christmas of watching her kids open gifts and fearing forgot something on their wish lists.\nThe Ridgefield High School graduate has created an app, bWISHd, that creates lists of gifts for people and reminds users when to shop for them.\n“You can enter in birthdays, holidays, whatever you want,” said Lee, a New Milford resident and mother of three. “It syncs up with your calendar and you control when it reminds you — it could be two weeks before, one before or even a day or two before for those last-second shoppers. You can also set no reminder.”\nLee was inspired to create bWISHd by her children — Monica, 9; Evelyn, 7; and JJ, 3.\n“I’m not going to buy gifts for them in the store while they’re shopping with me,” she said. “If I buy it for them then, it becomes a ‘now’ gift and not a birthday gift...\n“There were too many times when they would ask for something not near their birthdays, or not near Christmas, and I would forget it,” she added.\nShe began thinking about the app around this time last year, and met with a developer who helped her design it and get it approved on the Apple store.\n“When you get that idea of a gift or your kids pick out something they really, really want, you can use the app to scan the bar code and then it goes into your phone,” Lee explained. “It can be done at the store or at home if you’re shopping online.”\nThe app also functions without scanning bar codes — all users need to enter is a keyword into their list and the app generates search terms.\n“It works with a string of texts or keywords and you can begin clicking on those words once they’re entered and searching for gifts,” Lee said.\nRight now the app’s search function is paired with Walmart.com but Lee hopes to pair it with other retailers soon.\n“You don’t have to shop at one store,” she said. “The real goal is to keep track of the list for each person you’re shopping for. You can take it anywhere to shop — even online where it’s very handy, too.”\nDeveloping the app\nbWISHd is Lee’s first app.\nA professional photographer, she said she designed the app on paper before contacting developers.\n“I operate in the visual sphere, I think in pictures,” she said. “It really was something that started from scratch a year ago ...\n“I kept having this idea and was looking for something like it and found there was nothing like it out there.”\nLee, who graduated from RHS in 2001 before going to Connecticut College, said she was always into art and creative learning.\n“bWISHd is pretty similar from what I originally imagined it would look like,” she added. “My goal was for it to be simple — something accessible for all, from kids to parents to grandparents. Nothing too complicated.”\nWhile developing the app, Lee discovered a key function was missing in her original sketches.\n“I began thinking about things I disliked about apps, and that’s when I decided I had to make this free of ads,” she said. “The information is locally stored, and it’s not shared anywhere. Your search terms won’t come up as targetted ads on Facebook.”\nWith privacy concerns at the forefront of bWISHd’s creation, Lee decided the app would go on the Apple store at $0.99.\n“Apps that are free are never really free when you think about it,” she said. “When you download a free app, there’s always a string of pop up ads that insist you download the paid version. It was very important to me not to misguide our customers. It comes at a small cost because there’s no ads and it’s private.”\nPatience is a virtue\nLee, who ran track at RHS before contracting Lyme disease, said she applies the same lessons her parents taught her when getting gifts for her kids.\n“My father was a big proponent of delayed gratification, and that’s something I like to use for my kids,” she said. “I want them to be patient and wait until it’s time for a gift.”\nStuffed animals or other miscellaneous items at the counter near the store’s register don’t make it easy.\n“My kids are learning to recognize impulse decisions versus waiting for something,” she added. “And I think they’re beginning to see that I’m recognizing their wants and taking notes ... My youngest loves scanning with the app and he’s beginning to put items back and know that I’m not going to buy it for him in the moment but I will come back for it. It cuts down a lot of huffing in the store.”\nOf course, patience helps weed through what kids really want and something that might just catch their eye in a fleeting moment.\n“The things they see in the store — they don’t always want it,” Lee said.\n“We’ve created this culture of impulse shopping, and retailers know it — that’s why there’s that gauntlet of items at the register. With this app, I can take down everything my kids think they want in any given store and decide what’s a real gift — something that’s special to them — and what’s something that’s just cute and in the moment.”", "url": "https://apnews.com/f4aae9e0a29c424ab20d4af732f08f54"}