{"authors": ["Dawn Foster", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Solomon Hughes", "Richard Seymour"], "date_download": "2020-05-04 19:56:39", "date_modify": "2020-05-04 19:56:39", "date_publish": "2019-09-17 00:00:00", "description": null, "filename": "2019_09_liberal-democrats-uk-brexit-lib-dems-tories-labour_1588622199.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/09/17094048/GettyImages-1175228126.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_09_liberal-democrats-uk-brexit-lib-dems-tories-labour_1588622199.html", "title": "The Galling Hypocrisy of the Liberal Democrats", "title_page": "The Galling Hypocrisy of the Liberal Democrats", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "It’s party conference season in the United Kingdom, and the first Britain-wide political party to court media attention at their days-long meeting are the Liberal Democrats. The Lib Dems will claim they’re gaining good electoral ground: they increased their vote share in the recent European elections and have scooped up several new recruits in Parliament, with pro-Remain members of Parliament defecting to the Lib Dems and leaving their own parties — Labour, the Tories, and the disastrous new incarnation Change UK/the Independent Group — behind them. The Lib Dems put their success down to their position on the European Union, which calls for a second referendum, and claims that in the three years that have passed since that initial vote, the electorate, having observed the veritable mess that has beset Parliament and seen the country tear through three prime ministers, may have changed their mind on membership of the EU.\nBut in pursuing electoral success above all else, the party under new leader Jo Swinson is also laying several bear traps of its own making. Following the disastrous decision to enter a coalition with David Cameron’s Conservatives in 2010, the general election of 2015 saw the party fall out of its traditional third-place position, shrinking from fifty-seven seats to eight, tied with the Northern Irish Democratic Unionist Party. A common political joke pointed out they could hold parliamentary meetings in a large cab, and their party leader, Nick Clegg, humiliatingly lost his own seat. Their meager gain of four more seats in 2017 showed that the electorate still felt the main political choice in Britain was between Labour and the Conservatives, with more voters backing the Scottish National Party, and that few had forgiven them for reneging on their promise to vote against a rise in college tuition fees, given their previously strong performance in university towns.\nSwinson has already faced backlash for the Lib Dems’ willingness to accept any and all comers, bolstering the party’s numbers in Parliament through defections rather than electoral success. Many newcomers, including Chuka Umunna, came from Change UK once it became apparent the new party’s creation was a huge electoral error. More controversial have been the Conservative recruits: Phillip Lee, whose defection from the Tories knocked Boris Johnson’s working majority down to zero. Lib Dem members left the party in protest over Lee’s skepticism over same-sex marriage, and his support for an amendment to the Immigration Bill that would have banned HIV-positive migrants.\nThe party has now announced a change in its position on Brexit, too: rather than support a second referendum, they pledge to cancel the UK’s exit from the EU if they lead a government. The stance is pure electoral demagoguery: winning power is mathematically impossible for the Lib Dems, so they are fully aware that they cannot be held accountable for anything they say. Pandering to the hard-core Remainers across the UK is a cynical attempt to regain some of the extensive ground they lost after the Lib Dem–Conservative coalition.\nBut any voters the party wins over with this Brexit stance — presumably voters willing to ignore its willingness to welcome illiberal MPs with open arms — are likely to be sorely disappointed if the Lib Dems do get a stab at power in a coalition. Repeatedly, Swinson has stated she is unwilling to work with Jeremy Corbyn in any coalition, which leaves the Conservatives as her only possible coalition partners. A second Liberal-Tory pact will see history repeating itself and an even wider pool of voters abandoning the Lib Dems for the foreseeable future. It took the Labour Party a complete overhaul in both leadership and outlook to coax back those who had abandoned the party over the Iraq War: jumping back into bed with the Conservatives and abandoning key election promises so swiftly shows a distinct lack of both scruples and political intelligence in Swinson’s party, especially given Swinson’s own role in the austerity of Cameron’s government.\nThe fiasco reveals a key problem with centrism: contrary to the claims of centrist politicians, they will always side with the status quo and the Right, and will value access to power over the wishes of their voters in all circumstances. One key fact remains for British voters: when it comes to the Liberal Democrats, you should never have trusted them, and still can’t, no matter how much they claim they’ve changed.", "url": "https://www.jacobinmag.com/2019/09/liberal-democrats-uk-brexit-lib-dems-tories-labour"}