{"authors": ["Daily Citizen Staff Dc-News Wiscnews.Com"], "date_download": "2020-05-04 20:15:44", "date_modify": "2020-05-04 20:15:44", "date_publish": "2019-01-24 18:21:00", "description": "WATERTOWN — Law enforcement agencies, including the Dodge County Sheriff’s Office, were on hand on Thursday while search warrants were conducted at two establishments in the Watertown...", "filename": "_8ec545481b544ab2892b50245a10ec62_1588623344.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8ec545481b544ab2892b50245a10ec62_1588623344.html", "title": "Feds search Dodge County strip club, Watertown bar", "title_page": "Feds search Dodge County strip club, Watertown bar", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WATERTOWN — Law enforcement agencies, including the Dodge County Sheriff’s Office, were on hand on Thursday while search warrants were conducted at two establishments in the Watertown area.\nAccording to a press release issued by Dodge County Sheriff Dale Schmidt, the sheriff’s office along with Watertown Police Department, town of Emmet/Lebanon Police Department assisted federal law enforcement agencies with the search warrants.\nThe search warrants occurred at Wild Rose Gentleman’s Club, 4808, N866 County Road R and Dew Drop Inn, 1027 N 4th St., Watertown.\nSchmidt said in the press release that the sheriff’s office has no further information at this time as it is an ongoing federal investigation and the sheriff’s office is only assisting in the investigation.\nIt is the second time in recent months that a federal warrant was served at a Dodge County strip club. Federal, state and local authorities executed a search warrant at The Hardware Store, 942 Main St., Clyman, on Nov. 2.\nOfficials did not release any information about what was found or the nature of the warrant at the time.\nStrip clubs in Dodge County have come under heavy pressure after the indictment of Christopher Childs, 45, of Hartford, on federal charges of human trafficking. Childs is accused of torturing women and forcing them to engage in prostitution while keeping the money they earned for their work.\nProsecutors allege that he operated out of the TNT Club, in the town of Lebanon, and The Hardware Store.", "url": "https://apnews.com/8ec545481b544ab2892b50245a10ec62"}