{"authors": ["Pam Eggemeier Peggemeier Saukvalley.Com", "Ext."], "date_download": "2020-05-04 20:12:57", "date_modify": "2020-05-04 20:12:57", "date_publish": "2019-01-31 23:25:00", "description": "STERLING – The Westwood Juice Bar will open Monday, bringing the Sterling Park District's $1.25 million renovations project at the main Westwood building close to completion. The juice bar...", "filename": "_501a53f1eb7342869f4672734d90bb79_1588623177.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_501a53f1eb7342869f4672734d90bb79_1588623177.html", "title": "Park district takes another step toward full-service fitness", "title_page": "Park district takes another step toward full-service fitness", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "STERLING – The Westwood Juice Bar will open Monday, bringing the Sterling Park District’s $1.25 million renovations project at the main Westwood building close to completion.\nThe juice bar will sell nutritional shakes, supplements and healthy snacks that are tailored to individual ages, nutritional and fitness needs. There are natural specialty drinks for exercise recovery, detox, meal replacement, and particular lifestyle and nutritional needs.\nThe juice bar will operate 7 days a week during regular fitness center hours. While Total Fitness Pass members get a discount, the bar is open to anyone.\nThe park district is using Performance Food Centers, a division of Simple Again, for its products and expertise.\n“They have been wonderful to work with,” Sterling Park District Executive Director Larry Schuldt said. “They helped design the bar, and have supported us with marketing and educational materials.”\nThe drink prices range from $4 to $7, depending on what ingredients are chosen. The juice bar is part of Westwood’s efforts to become a full-service fitness center.\n“The prices are as low as we could get them, and members get a $1 discount because this is more about service and convenience than generating revenue,” Schuldt said.\nWith the launch of the juice bar, the 8-month renovation project is about 85 percent to the finish line.\nOther additions include two full-size basketball courts with wood floors, the Kids Gym with child care staff, a functional training center with fitness turf, and new cardio and weight equipment for the fitness area.\nMany of the renovations have moved certain activity areas around to allow for better use of available space.\nThe final piece will be the completion of the Kids Gym for ages 3 months to 12 years. A large playground will feature interactive high-tech equipment that combines fun with fitness. The blast of extreme winter weather has delayed delivery of the playground, but it is expected to arrive on Monday.\n“I think we’re about 5 or 6 weeks away from opening the Kids Gym, probably mid-March,” Schuldt said.\nNew carpet also will be brought in when the sloppy weather dries up.\nThe CrossFit area has been moved into an area that doubles its space. It is now in the old wrestling room. The Kids Gym will be in the space vacated by the CrossFit program.\nThe batting cage area with turf, where the tennis courts once were, is now fully enclosed and has a movable net that provides more versatility. The Sauk Valley Community College baseball team has been practicing there daily.\nThe tennis courts exited when the park district put the Westwood Tennis Center in Building 2. The tennis facility, built almost entirely with donations, opened last Jan 11.\nAdjusted for demand, pickleball has been scaled back from 12 to six courts. Three additional courts can be set up in the basketball area when needed for tournaments.\nThe functional training area with turf is for general fitness activities. Functional training focuses on exercises designed to help individuals with movements used in daily life.\nThe project will probably come in a bit over budget even though a healthy contingency was built in.\n“We weren’t planning to move pickleball yet, but after we did the budget, we decided to just get it done now,” Schuldt said.\nThis renovation project has been more challenging that the one at the Duis Center, but ultimately more rewarding, Schuldt said.\n“Duis was closed the entire time, so it was a lot tougher to get all of this done while we were open,” Schuldt said. “It’s been exciting, though, to see how everything came along. There was a lot of satisfaction in doing much of the demo and construction work ourselves.”\nThe next big project comes with the description “not very glamorous, but much-needed”. The park board will put bids out this spring for road work at the main Westwood building and Sinnissippi Park.\nA smaller offering is expected to be unveiled March 1. The Westwood fitness app will include exercise videos and it has the capability to combine data from all other fitness apps that are being used.\nEarly numbers indicate that the park district’s efforts are paying off. Last month’s year-over-year membership numbers were doubled.", "url": "https://apnews.com/501a53f1eb7342869f4672734d90bb79"}