{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:20:50", "date_modify": "2020-05-04 20:20:50", "date_publish": "2019-03-12 15:57:00", "description": "Democracy by and for the people is under assault. A secretive New York-based hedge fund controls hundreds of U.S. newspapers. And it might soon own more. Vulture capitalists at Digital First...", "filename": "_24a1336e04854159b6e46a5b3e78c315_1588623650.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_24a1336e04854159b6e46a5b3e78c315_1588623650.html", "title": "Hedge fund bad for public's right to know", "title_page": "James Kramer: Hedge fund bad for public's right to know", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Democracy by and for the people is under assault. A secretive New York-based hedge fund controls hundreds of U.S. newspapers. And it might soon own more.\nVulture capitalists at Digital First Media are circling around America’s largest newspaper chain — Gannett. A successful acquisition of Gannett would include USA Today and make Digital First the largest publisher in the country.\nThe hedge-fund owners of Digital First Media operate with no obligation to disclose their small group of wealthy investors, hold hundreds of millions of dollars in offshore tax havens, and show a pattern of ethically questionable investments.\nWhile Gannett rejected an earlier takeover bid, Digital First executives recently nominated six new Gannett board members. According to Gannett and USA Today, all six have ties to Digital First Media’s parent company and its hedge-fund owners, Alden Global Capital.\nDigital First Media’s slash-and-burn strategies are well-documented and harshly criticized. The company guts newsrooms and lays off journalists in communities around the United States. Local news content and the public’s right to know suffer.\nThis collapse into a news desert might soon rumble through Wisconsin. Gannett owns the Milwaukee Journal-Sentinel, and Digital First specializes in selling newspaper assets. The Journal-Sentinel’s building in downtown Milwaukee is prime real estate. It is precisely the sort of asset Digital First likes to sell while liquidating for profits.\nNewspapers are essential to democracy. Americans have fretted and lamented the effects of media consolidation for decades. But this is serious and urgent.\nIt’s hard to know what to do. Nobody has magic beans that can bring back the old advertising-driven model of news and journalism. Nobody has a crystal ball ready to predict how democracy would fare without watchdogs or journalists. What is clear is the threat to democracy. Media consolidation and profiteers such as Digital First are an omnipresent danger in America.\nI fear for our country and pray for America’s young people. They will grapple with this issue for generations to come. Freedom, liberty, democracy and the very momentum of history hang in the balance.", "url": "https://apnews.com/24a1336e04854159b6e46a5b3e78c315"}