{"authors": ["Andrew King Shaw Media Correspondent"], "date_download": "2020-05-04 20:13:17", "date_modify": "2020-05-04 20:13:17", "date_publish": "2019-03-11 05:07:00", "description": "DeKALB – On Saturday night, Tails Humane Society celebrated 20 years of helping animals while raising money to help continue to provide care for the year ahead. “We estimate that we’ve cared...", "filename": "_33e4e1c4700746cca7efb13e24227930_1588623197.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_33e4e1c4700746cca7efb13e24227930_1588623197.html", "title": "Tails Humane Society fundraiser's proceeds going to the dogs, cats ...", "title_page": "Tails Humane Society fundraiser's proceeds going to the dogs, cats ...", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DeKALB – On Saturday night, Tails Humane Society celebrated 20 years of helping animals while raising money to help continue to provide care for the year ahead.\n“We estimate that we’ve cared for roughly 28,000 animals,” Tails executive director Michelle Groeper said in prepared remarks during Tropical Tails, the nonprofit’s annual auction program. This year’s event was held in the Duke Ellington Ballroom at Northern Illinois University.\nEach year, Tropical Tails is the organization’s primary fundraising event. Danielle Hoske, development and marketing manager for Tails, said Tails hoped to bring in $20,000 during the Fund the\nFuture portion of the live auction alone. Money from the event goes into Tails Humane Society’s unrestricted fund, meaning it can be used to cover any and every need the organization encounters. Tails provided medical services, shelter and, in many cases, adoptive homes for 2,700 animals in 2018.\n“This event funds countless numbers of operations, surgeries; it helps so many animals get put into great homes,” said Alex Hunter, a member of Tails’ board. “It really does fund the majority of the year, this one event.”\nThe banquet/auction lived up to its tropical name with silent auction tables named for kiwis, pineapples and flamingos. But, more significantly, trips to distant locales such as Puerto Penasco, Mexico and Zulu Nyala Private Game Reserve in South Africa were available during the live auction. Southwest tickets offering travel around the U.S. and its territories also were on the auction block. Bidders could buy more locally focused prizes such as Bears and Cubs tickets and a day of golf at Lake Wood Estates Golf Club in Walworth County, Wisconsin.\nAdditionally, 100 items were displayed on the silent auction tables set up throughout the ballroom.\nAs a reminder of Tails’ work throughout 2018, animal testimonials were spread throughout the banquet hall on pieces of card stock.\n“Tyrannosaur, about 6 months old now, is a cat who was found as a stray along the side of the road,” one card featuring a gray-and-white cat read. “This poor kitty was likely hit by a car. It was later found that she had brachial nerve paralysis in her front right leg. Her leg was removed and she recovered in a foster home. Tyrannosaur has since been adopted from Tails!”\nNancy Rigler has helped care for thousands of animals since she started volunteering at Tails’ inception. She was honored with a lifetime achievement award Saturday night.\n“Initially, I really felt strongly that DeKalb needed a new model, up-to-date animal shelter. And, I’ve been just thrilled with all the steps that Tails has taken along the way, coming from an idea to having an old farmhouse where we first started operations, to getting a building and to having a spay and neuter clinic and [helping] all the thousands of animals who find a new home every year,” she said.\n“I’m a volunteer, but I’ve been seeing a lot more as I work more closely at the shelter. And the care these animals get is phenomenal. From the … puppies to the rats to the bunnies, somebody on staff cares about each one of those animals. And it’s not just the physical care, but they emotionally care about their well-being and that they go to the right home.”\nWith another successful auction under their belts, the staff and volunteers at Tails Humane Society will be able to provide that kind of care for at least one more year.", "url": "https://apnews.com/33e4e1c4700746cca7efb13e24227930"}