{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:20:04", "date_modify": "2020-05-04 20:20:04", "date_publish": "2019-04-17 07:30:36", "description": "MOLLIE MAYNARD, 94, of Wayne, went to be with the Lord Monday, April 15, 2019, at her residence. Funeral services will be conducted 10 a.m. Thursday, April 18, 2019, at Morris Funeral Home Chapel...", "filename": "_3e1ef2bc307a4d11b2f9c714462934d7_1588623604.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3e1ef2bc307a4d11b2f9c714462934d7_1588623604.html", "title": "MOLLIE MAYNARD", "title_page": "MOLLIE MAYNARD", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MOLLIE MAYNARD, 94, of Wayne, went to be with the Lord Monday, April 15, 2019, at her residence. Funeral services will be conducted 10 a.m. Thursday, April 18, 2019, at Morris Funeral Home Chapel by Elder Tommy Damron and Elder Ivory Williamson. Burial will follow at Sam Damron Cemetery, Dunlow. She was born August 27, 1924, in Dunlow, a daughter of the late Sam and Peggy Ray Damron. Mollie was a homemaker and member of the Brush Creek United Baptist Church for 51 years. Her husband of 69 years, Arthur “Bill” Maynard, also preceded her in death, along with six sisters, Ida Napier, Erie Pack, Opal Pope, Dovie Napier, Mary Robertson and Ruth Nugent; brothers, Forest, Noah, Cullie, Orville, Wilmer and Sam Damron; a daughter-in-law, two granddaughters and three great-great-grandchildren. Survivors include ten children, Jack Maynard (Orlean), Edgar “Dude” Maynard (Jean), Robert “Bob” Maynard (Vickie), Norman Maynard (Shirley), Arvil “Babe” Maynard (Joan), Dale Maynard (Melva), Roger Maynard (Sue), Delbert Maynard (Arlene), Harvey Maynard (Ruby), Richard Maynard (Sibyl); two brothers, Tommy Damron (Cathleen), Darrell Damron; twenty-four grandchildren; forty-five great-grandchildren; and fourteen great-great-grandchildren. Friends may call from 6 to 9 p.m. Wednesday, April 17, 2019, at Morris Funeral Home, Wayne. A special thanks to Hospice of Huntington, Dr. Kevin McCann and his staff, and all of her daughters-in-law.", "url": "https://apnews.com/3e1ef2bc307a4d11b2f9c714462934d7"}