{"authors": ["Guy N. Limbeck"], "date_download": "2020-05-04 20:21:48", "date_modify": "2020-05-04 20:21:48", "date_publish": "2019-02-12 12:45:00", "description": "The Philadelphia Eagles have promoted Elgin native Carson Walch after his first season with the NFL club. Walch joined the Eagles for the 2018 season, his second stint in the NFL, and he was...", "filename": "_ddf97b81c3ac48428fe33b5a9ff5f2d1_1588623708.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ddf97b81c3ac48428fe33b5a9ff5f2d1_1588623708.html", "title": "Local Notebook: Walch gets coaching promotion with Eagles", "title_page": "Local Notebook: Walch gets coaching promotion with Eagles", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Philadelphia Eagles have promoted Elgin native Carson Walch after his first season with the NFL club.\nWalch joined the Eagles for the 2018 season, his second stint in the NFL, and he was the team’s assistant wide receivers coach. This past week the Eagles named him wide receivers coach.\n“Thankful for the opportunity coach (Doug) Pederson has awarded me with the understanding of all the responsibilities that the job entails,” Walch said.\n“It’s a dream come true,” he added. “Many people are involved in the promotion from all my former and current colleagues/players.”\nWalch said his new duties will be “similar to last year but being the lead coach for the position with game-planning duties assisting Mike Groh, our offensive coordinator.”\nBack in 2013 and ’14 Walch served as an offensive quality control coach with the Chicago Bears, where he worked with Groh.\nWalch began coaching in the professional ranks with Montreal of the Canadian Football League from 2010-12. During that span, Montreal won one Grey Cup, the CFL’s version of the Super Bowl. He was an assistant coach with the Edmonton Eskimos in the CFL in 2016 and 2017.\nWalch helped the Eagles earn a playoff berth during the 2018 season. The Eagles, who won the Super Bowl during the 2017 season, beat Chicago in the first round of the 2018 playoffs before falling to the New Orleans Saints.\n“It’s always a learning experience,” Walch said. “Each day brings a different set of challenges and enjoyment when doing something you love to do.”\nWalch is currently spending some time in Elgin, Winona and the Twin Cities.\n“We work daily but see some more vacation time in the offseason,” he said.\n———\nCaledonia’s Karl Klug, who spent seven years in the NFL with the Tennessee Titans, coached at the high school level in 2018.\nAfter playing his college ball at Iowa, Klug recorded 21 1/2 sacks as a defensive tackle and scored one touchdown during his career with the Titans.\nAs a 30-year-old, he was released last March by the Titans. Rather than try to hook on with another team, Klug decided to get into coaching.\nHe spent last fall as the defensive line coach for Page High School in Franklin, Tenn.\nKlug’s twin brother, Kevin, also resides in Tennessee — in Nashville — where he runs a business.\n———\nRochester’s Jon Dicke, who played football at Southwest Minnesota State in Marshall, was named to the 2018 Google Cloud CoSIDA Academic All-America first team for Division II.\nDicke, a defensive lineman, has a cumulative 4.0 grade-point average in exercise science and has recorded numerous awards for his classwork and play on the field.\nLast fall he was recognized as a member of the 2018 Allstate AFCA Good Works Team and was chosen as a semifinalist for the National Football Foundation and College Hall of Fame William V. Campbell Trophy, which recognizes the top football scholar athlete in the nation.\nHe was also the recipient of the Northern Sun Intercollegiate Conference Glen Galligan Award, which is given to a football student-athlete who participates at his institution for four years and is academically superior while making a positive contribution to the institution.\nDicke was a senior during the 2018 season.\nHe finished with 42 tackles, including 5.5 for loss, and two sacks.\nDicke, who started every game for the Mustangs the past two seasons, closed his four-year career with 111 tackles, 9.5 tackles for loss, and 4.5 sacks.\n———\nMayo grad Meg Geschwind is a member of the Saint Michael’s College women’s swimming and diving team and she was part of a record-setting event at the Northeast-10 Conference Championship Meet.\nGeschwind, a sophomore, was part of the 800-yard freestyle relay team that set a school record with a time of 8:08.70.\nThe foursome finished ninth at the conference meet.\nGeschwind competed in distance freestyle, breaststroke and individual medley events for Saint Michael’s this season.\nSaint Michael’s is located in Colchester, Vt.\nGuy N. Limbeck is a sports writer for the Post Bulletin. His Local Notebook appears each Tuesday. He can be reached at glimbeck@postbulletin.com", "url": "https://apnews.com/ddf97b81c3ac48428fe33b5a9ff5f2d1"}