{"authors": ["Courtesy Of Ohio University Southern"], "date_download": "2020-05-04 20:13:21", "date_modify": "2020-05-04 20:13:21", "date_publish": "2019-03-14 07:10:30", "description": "IRONTON — The Community Education Department at Ohio University Southern has a variety of new classes to meet the interests of all ages in March and April. Topics range from technology, music,...", "filename": "_c97dde6014864e1db60ddc8af7b5850a_1588623201.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c97dde6014864e1db60ddc8af7b5850a_1588623201.html", "title": "New community education classes offered by OUS", "title_page": "New community education classes offered by OUS", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "IRONTON — The Community Education Department at Ohio University Southern has a variety of new classes to meet the interests of all ages in March and April. Topics range from technology, music, finance and recreation.\n• “All about Google” will teach participants how to work with Google, including Gmail, Google Docs, Google Presentations and Google Sheets. The class will be held on Tuesdays and Thursdays beginning March 19 through April 9 from 5:30 p.m. to 7:30 p.m. The class will be held on the Ironton campus in the Academic Center, room 214. The cost is $5 per person.\n• Adults age 35 to 59 who wish to develop proactive strategies for protection and preparing for the unexpected may want to enroll in “Ready or Not? Preparing for the Unexpected.” This class will cover: emergency funds, establish line of credit, and review insurance/liability protection. This course will be held at the Ironton campus in the Caucus Room, located in the Academic Center. This course will meet on Tuesday, March 19, from 6-7 p.m. The cost for this course is $10 per person.\n• “Guitar 101: For Beginners” will assist beginners in learning guitar in a group with an experienced music teacher. The course will cover chords and how to strum them over a variety of styles from blues to bluegrass. An acoustic guitar is preferred. This course will meet on Monday evenings from 5:30 to 7:30 p.m. on Mondays, March 18 and 25, and April 1 and 8. The course fee is $69 per person. The guitar class will meet in the Caucus Room of the Academic Center, located on the Ironton campus.\n• “Wilderness Living Skills” will introduce participants to basic backpacking skills and knowledge in order to enhance personal enjoyment of the outdoors. This class will teach conservation of wild areas, and sound safety practices on outdoor trips. Participants will learn through direct experience, discussion, demonstration and reflection at an area park or recreation area (to be determined). This class involves two weekend overnights, 3 p.m. to 11 a.m. on Saturday-Sunday, March 23-24, and March 30-31. The cost for this course is $169 per person.\n• “Microsoft Word 2016” is a five-week class providing instruction on how to edit, format, work with tabs, tables and pictures, create letters and envelopes and create mail merges. After attending all of the course sessions and once the course concludes, you will receive a certificate of completion from Ohio University Southern. The cost of this class is $59 per person. The class will meet on Mondays from 5:30-7:30 p.m. April 1-22. The course will meet in the Academic Center, room 214, on the Ironton campus.\n• “Retirement: Making Your Money Last,” will provide participants with information about considerations and trade-offs when developing a withdrawal strategy from retirement plans. Other topics covered will include: working longer, spending less and delaying social security and ways to plan for expected and unexpected expenses with insurance. This class is intended for persons who have recently retired or those who have less than 10 years until retirement. Ohio University Southern Academic Center Caucus Room is the location of this class, which costs $10 per participant. The class will meet on Tuesday, March 26, from 6-7 p.m.\n• “What Happens After the Paychecks Stop? A Retirement Income Primer” is scheduled for April 2 from 6-7 p.m. Participants will examine how to budget for retirement expenses, potential sources of retirement income and potential risks such as long-term care and health care costs. The class is targeted to people ages 50-70 who are thinking of retiring or have recently retired. The class will meet in the Caucus Room of the Academic Center on the Ironton campus. The cost is $10 per person.\nTo register, visit online at https://www.ohio.edu/south-ern/academics/community-education/index.cfm. Contact Community Education at Ohio University Southern by calling 740-533-4588 or via email at ous_community_ed@ohio.edu. All classes are held at 1804 Liberty Ave. in Ironton.", "url": "https://apnews.com/c97dde6014864e1db60ddc8af7b5850a"}