{"authors": ["Katrina Koerting"], "date_download": "2020-05-04 21:06:10", "date_modify": "2020-05-04 21:06:10", "date_publish": "2019-04-05 18:02:57", "description": "NEW MILFORD — A traditional seder encourages Jews to envision themselves as the slaves who fled Egypt thousands of years ago, but on Thursday the women gathered were able to see themselves in the...", "filename": "_3f93c3816c1447c09b2f31ba631e9167_1588626370.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3f93c3816c1447c09b2f31ba631e9167_1588626370.html", "title": "New Milford synagogue hosts first women’s seder", "title_page": "New Milford synagogue hosts first women’s seder", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NEW MILFORD — A traditional seder encourages Jews to envision themselves as the slaves who fled Egypt thousands of years ago, but on Thursday the women gathered were able to see themselves in the ritual.\nTemple Sholom held its first women’s seder, changing the words to honor the women in the Exodus story and connect it to modern Jewish women. A change from the traditional Haggadah that focuses on the men, such as Moses.\n“The traditional Haggadah asks us, ‘why is this night different from all other nights?’” Debbie Heckmann, a committee member, told the group of 25 seated around a long table. “Tonight is different from all other nights because tonight we join as one community of modern women, together as one group, as women at the table.”\nIn Thursday’s women’s seder, the traditional four sons became four daughters; the four questions examined what the Exodus story means for women today and Elijiah’s cup of wine was replaced with Miriam’s cup of water. Miriam, Moses’s sister, is often associated with water and even is believed to have had a well that followed her as the Israelites left Egypt and crossed the desert. She is considered to be a central part of the story, though never mentioned in the traditional Haggadah.\nThe traditional song ‘Dayenu,’ which translates to “it would have been enough,” also listed ways for women to lighten their load, including only serving on one volunteer committee, working 45 hours a week instead of 60 and buying a dessert instead of making one from scratch.\nThe 10 plagues were also adapted to take on modern symbols, including a lack of affordable housing, climate change, gun violence, childhood hunger and domestic violence.\n“We have these 10 contemporary plagues that very often affect women,” Breznick said.\nThe Haggadah also built on the women who came before, including Miriam, the midwives Shifra and Puah, the daughters of Zelophehad who demanded their rights on inheritance and the suffragettes of the early 1900s.\nWomen’s seders have been around since the 1970s. Joan P. Ivler, a committee member for this event, had participated in one on Long Island about 20 years ago and suggested Temple Sholom have one, building on the popularity of women’s events.\nShe suggested it after service one day in January and Heckmann and Cantor Laura Breznick readily agreed. Breznick then spent the next three months or so crafting the Haggadah with the committee so that it would speak to the group of women.\n“It was a journey, to say the least,” Breznick said. “It was a labor of love.”\nHeckmann said the event is designed to open the table to not only members of the synagogue but also the surrounding community, including to those who aren’t Jewish.\n“It’s really about building community,” she said. “That’s what we’re trying to do.”\nThe organizers said the event’s attendance exceeded their expectations.\nGretchen O’Shea of New Milford said she came because Ivler is her neighbor and the two had been planning to attend each others services for a while. O’Shea, an Episcopalian, said she’s appreciated learning about Passover and the corresponding traditions, as well as a deeper exploration of the Exodus story, which is also in the Old Testament of the Bible.\nShe attended a seder years ago at a Catholic church in Washington, but this was her first Jewish seder.\n“It was a great experience, but it wasn’t the real thing like this is,” O’Shea said. “I feel like I’m at the authentic thing.”\nThe women’s seder is designed to compliment the traditional family seder, which will happen in two weeks when Passover actually begins.\nHannah Schear, one of the other guests at the women’s seder, agreed that it was nice to add this to the mix with the traditional seder.\n“It’s great,” she said. “It’s nice when we get together.”\nShe said the woman-centered twist also inspired reflection.\n“I’ve been thinking about the women who need our help and don’t have the advantages we have in the U.S.,” Schaer said.\nThe organizers are already looking ahead to the possibility of another women’s seder.\n“Normally, we say ‘next year in Jerusalem,’ but I say next year here,” Breznick said at the end of the night. “Let this be the beginning of our women’s seder journey.”\nkkoerting@newstimes.com; 203-731-3345", "url": "https://apnews.com/3f93c3816c1447c09b2f31ba631e9167"}