{"authors": ["Alvaro Montano"], "date_download": "2020-05-04 20:31:44", "date_modify": "2020-05-04 20:31:44", "date_publish": "2019-05-17 05:00:00", "description": "Klein Forest boys head track and field coach Remon Smith feels the team’s biggest accomplishment was a change in mindset from “me” to “we.” A year after the program missed out on an...", "filename": "_30351adb8b3447dcb37856efa26b3806_1588624304.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_30351adb8b3447dcb37856efa26b3806_1588624304.html", "title": "With state title at hand, Klein Forest track and field in position for repeat", "title_page": "With state title at hand, Klein Forest track and field in position for repeat", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "With state title at hand, Klein Forest track and field in position for repeat\nKlein Forest boys head track and field coach Remon Smith feels the team’s biggest accomplishment was a change in mindset from “me” to “we.”\nA year after the program missed out on an opportunity to make the state meet as a team, the Golden Eagles remained focused in the classroom, community and on the track.\nWith individual district champions giving up their events hoping to take the relays to state, Smith knew he had something special.\nKlein Forest scored 42 points as a team, taking silver in the 4?—100 and 4?—200-meter relays to claim the Class 6A Men’s Track & Field Team State Championship in Austin on Saturday, May 11.\n“It still feels unreal, still trying to adjust to it,” third-year head coach Smith said. “I’m starting to feel a whole lot better about it.”\nKlein Forest finished ahead of Strake Jesuit (40) and third place Mansfield Summit (37) at Mike A. Myers Stadium.\n“Everybody was just elated,” Smith said. “It’s the first one ever for the school, then the first ever state championship for the district…Just a great feeling over there right now.”\nSmith arrived at Klein Forest three years ago along with a freshman group that was poised just like him to make it all the way. After falling short last year, the junior-led squad was able to finish what they started, and with one year left.\n“When I got there, I told those guys if they stay with me we’ll be state champions before it’s over with,” Smith said. “It happened a year earlier but to me that was the key to us winning.”\nThe championship has the coaching staff feeling like there’s nothing they can’t do.\n“We as a group are going to try to just go from there,” Smith said.\nRising up\nIn the District 15-6A meet, April 11 and 12, the Golden Eagles placed second (94) behind The Woodlands (151) and ahead of College Park (74) at The Woodlands High School.\nKlein Forest then finished second (90) in the area 15/16 meet, April 18, with The Woodlands getting first (103) and College Park third (72) at Klein High School. And in the region II meet, April 26 and 27, the Golden Eagles placed first (76), The Woodlands second (58) and Round Rock third (42).\n“Guys came back more focused and they executed well, didn’t let the stage get too big for them,” Smith said.\nWith junior Maurice Westmoreland being the only state qualifier from a year ago, the Golden Eagles arrived at Austin more determined.\n“I think they were still a little nervous at the beginning of the meet,” Smith said.\nWestmoreland got things going by taking fifth in the shot put and fourth in the discus. He had placed eighth in the discuss a year ago. His points helped Klein Forest pull away from Strake Jesuit in the team standings.\nThe 4?—100-meter relay of senior Crayg Fletcher, senior Travion Dotson, senior Christion Derrick and junior Auhmad Robinson took silver with a time of 40.49 and the 4?—200-meter relay of the same group took silver (1:24.13).\nThe 4x400 of Fletcher, Robinson, junior Mario Demerson and junior Myles Rhodes placed fifth (3:15.61).\n“They locked in and said, ‘OK, we can get this done,’” Smith said. “They did not let the stage distract them, so I was very impressed with the fact that they kept their composure and kept their eye on the task at hand.”\nPerfect picture\nIt was a completely different atmosphere walking into the building on campus Monday morning, May 13, for Smith.\nHe and the program felt the pride throughout the school — from principal Lance Alexander and parents, to teachers that Smith had no idea knew who he was emailing him, to athletic director and head football coach Ajani Sanders.\n“Coach Smith is a leader amongst leaders here on campus,” Sanders said.\nSanders has known Smith for over 10 years and said Smith has served as his voice of reason throughout his career.\n“I feel honored to have the privilege to work with such a great coach and even better person,” Sanders said.\nSanders and Smith had a vision three years ago to build Klein Forest athletics brick by brick and piece by piece.\n“Remon knew that increasing participation in track would help to change the culture,” Sanders said. “He set out and got the kids that want to be the legacy to sacrifice their time and hard work has paid off in the form of a State Championship…\n“For coach (Cary) Black and coach Smith to have the success in both basketball and track, with kids that have been together since middle school, we have enough here at Klein Forest to be champions.”\nStrong support network\nThe championship season really started last year at regionals for the Golden Eagles, according to Smith.\nIn the most important meet of the year, the squad had mishaps the day of regionals.\nThey were ahead of The Woodlands in the 4x100 and had an athlete fall and were ahead in the 4X400 and the anchor’s leg pulled up.\n“That kind of propelled us this year going into the season because the guys felt like they had an opportunity and they let it slip away,” Smith said.\nAnd this year the returners stuck to the plan and moved forward as a unit.\nRobinson was the District 15-6A and area champion in the 200-meter event this past season but wanted to be a part of something special.\n“He said, ‘coach I want to give up the 200 to focus on the 4x4,’” Smith said.\nRobinson ended up being the anchor leg that got them to state.\n“I had guys doing things like that, and after we had shortcomings the year before,” Smith said.\nSee it through\nThe program will lose three seniors to graduation from the state meet in Fletcher, Dotson and Derrick. There was also Trevon Hardy, Rendon Reddock, Anthony Warren and Jeffery Williams.\n“They’re going to be sorely missed,” Smith said.\nHowever, Smith made sure that the guys who will be back are acclimated for next year.\nThey include Robinson, Demerson, Rhodes, junior Darryl Cooper, junior Zion Turner, junior Donaven Hackett, junior Aaron Carr, junior David Garcia, sophomore Jereme Ombogo, sophomore Samuel Navarro and sophomore Otis Berry.\n“All these guys are experienced,” Smith said.\nThe whole 4x4 that Smith ran in regionals prelims (Rhodes, Demerson, Cooper, Ombogo) to qualify will also be back.\n“I have a young couple of freshman guys, that ran well this year, that I think can come up and help me again next year as well,” Smith said. “Of course, my anchor leg is back, Robinson.”\nThe coaching staff knows the program is a step ahead of the curve but also recognizes the importance of knowledge and patience.\n“It’s very exciting because I know I have some experience coming back,” Smith said. ’They’ve tasted what it’s like to be at the state meet and what it’s like to win a championship.”\nMore importantly, the athletes work together.\n“Everybody stayed the course, to me that speaks volumes,” Smith said. “If they stay there and move together, trust the process, I think we can be successful.”\nalvaro.montano@chron.com", "url": "https://apnews.com/30351adb8b3447dcb37856efa26b3806"}