{"authors": ["Molly Cavanaugh", "Special To The Omaha World-Herald"], "date_download": "2020-05-04 20:18:30", "date_modify": "2020-05-04 20:18:30", "date_publish": "2019-04-08 20:00:00", "description": "My daughter, Mara, wants to get her ears pierced. Her father and I know this — as does her brother and anyone else she has struck up a conversation with in the last week. It's practically...", "filename": "_e0d955458fe9460ea1616cdf999d0d5d_1588623510.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e0d955458fe9460ea1616cdf999d0d5d_1588623510.html", "title": "My daughter wants to get her ears pierced but my answer is 'not right now.' Here's why.", "title_page": "My daughter wants to get her ears pierced but my answer is 'not right now.' Here's why.", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "My daughter wants to get her ears pierced but my answer is ‘not right now.’ Here’s why.\nMy daughter, Mara, wants to get her ears pierced. Her father and I know this — as does her brother and anyone else she has struck up a conversation with in the last week.\nIt’s practically all she talks about.\nWe haven’t been able to pinpoint exactly where Mara got the idea, but my money is on one of the Raina Telgemeier books she’s had in her possession since last December. She has pored over and over their pages, which has spawned exhaustive conversations about what it feels like to have braces on your teeth and why she can’t have a sister like the girls in the book.\nHonestly, I thought she had run out of surprise source material from their colorfully illustrated pages, but it would appear she found another little tidbit to pique her interest.\nAnd so, in addition to her numerous questions about the likelihood of encountering rattle snakes or scorpions during our week-long Southern California vacation (we tried to assure her the chances were minimal at best), she would eventually spill what was really taking up real estate in her 7-year-old mind.\nWhen can she get her ears pierced?\nThe short answer is “not now,” which is met with groans of displeasure. She is groaning way above her age; her groans of displeasure resemble those of girls at least three years older than she is. So I’ve got that going for me. She is insistent on knowing why she can’t have her ears pierced now, and that has a rather complicated answer.\nGrowing up, I couldn’t get my ears pierced until I was 13 years old. It felt like I was the last girl on the planet to finally get to wear earrings, but my parents were firm about me waiting. While I will not be holding Mara to the same age standard, I also don’t see any need to rush out to the nearest mall for that rite-of-passage visit to Claire’s.\nFor starters, I’m fairly confident Mara isn’t up to the task of taking care of newly-pierced ears, and I’m not looking to take on any additional health and beauty responsibilities. I’m already iffy about how effectively she’s brushing her teeth, and I’m not sure she has getting all of the shampoo rinsed out of her hair down to a science yet either. So I’m not entirely convinced that multiple daily earlobe cleanings could be executed without adult supervision.\nBut I think the biggest reason for holding off is I’m not ready yet.\nIn just the last year, Mara has lost five baby teeth and has grown like a weed. My little girl is growing up by leaps and bounds and, last I checked, time doesn’t have a rewind button or the ability to take a pause. Getting her ears pierced seems like the next small step in her growing up, and I’m not in a super big rush to get there before necessary.\nShe may be giving me attitude like a pre-teen, but her ears are going to have to wait to catch up.\nMolly Cavanaugh of Channel 94.1 FM’s “Big Party Show” in Omaha is a mom to two children living in Chicago. She writes weekly for Momaha.com.", "url": "https://apnews.com/e0d955458fe9460ea1616cdf999d0d5d"}