{"authors": ["Matthew Leblanc"], "date_download": "2020-05-04 20:25:09", "date_modify": "2020-05-04 20:25:09", "date_publish": "2019-03-20 05:00:01", "description": "The Fort Wayne man accused of beating a 2-year-old boy to death in 2017 will testify in his own defense. Mitchell Vanryn, 28, is charged with murder, aggravated battery and domestic battery...", "filename": "_3e43c788d6794952945a3eeac48d2190_1588623909.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3e43c788d6794952945a3eeac48d2190_1588623909.html", "title": "Defendant in toddler's death to take stand", "title_page": "Defendant in toddler's death to take stand", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Fort Wayne man accused of beating a 2-year-old boy to death in 2017 will testify in his own defense.\nMitchell Vanryn, 28, is charged with murder, aggravated battery and domestic battery in the death of Malakai Garrett : the son of his girlfriend. The boy was taken Nov. 29, 2017, from a Palmetta Court home, clinging to life, and died later at a hospital.\nMalakai had bruises all over his body and severe internal injuries, investigators said; Vanryn was arrested the next day.\nDefense attorney James Hanson told jurors assembled Tuesday for the first day of Vanryn’s trial in Allen Superior Court his client will take the witness stand.\n″(Prosecutors are) going to present witnesses, but none of them can tell you what they saw in that house,” Hanson said. “There’s only one who can tell you what happened in that home on Nov. 29, 2017.”\nThe trial is scheduled for four days but is expected to end Thursday.\nAllen County Prosecutor Karen Richards told jurors in opening statements it’s obvious what happened. Vanryn : the only person home with the boy that day : beat Malakai and rushed the toddler’s “limp and unresponsive” body to a nearby fire station, she said.\nFirefighters found the boy “covered in bruises,” Richards said, and cut his clothes off to find more injuries.\n“This little boy died of blunt force trauma to his abdomen so violent ... that it ripped apart his internal organs,” the prosecutor said.\nCourt testimony last year from a girl who lived in the home indicated Vanryn disciplined the children with a belt and a wooden spoon, and Indiana Department of Child Services records obtained by The Journal Gazette show Malakai was abused.\nDoctors told police the injuries were consistent with multiple strikes from a closed fist, and witnesses who testified Tuesday said they saw the boy weeks before he died with bruises and dark circles around his eyes.\nThe boy’s mother, Amber Garrett, 27, is charged with two counts of felony neglect, and her trial is scheduled June 24.\nMargaret Easterly, Malakai’s great-grandmother, said Tuesday she called DCS and police after arriving Oct. 29, 2017, to Vanryn and Garrett’s home.\n″(Malakai) had dark eyes, and it looked like he had a bruise on the right side of his face,” Easterly said. “His eyes were very dark.”\nFort Wayne police Officer Jon Williams and Amanda Treska, a DCS family case manager, testified separately that they found Malakai in October looking pale and with the circles around his eyes.\nJurors saw autopsy photos showing a large bruise on Malakai’s cheek and injuries to his chest and back.\nVanryn, dressed in a white shirt and black tie, did not look as copies of the photos were passed to defense attorneys Hanson and Randall Hammond.\nLantz Garrett, Malakai’s father, was the first witness called by prosecutors Richards and Patricia Pikel.\n“He loved his cars and his trucks,” he said, pausing. “And his dad.”\nmleblanc@jg.net", "url": "https://apnews.com/3e43c788d6794952945a3eeac48d2190"}