{"authors": ["Seth Ackerman", "Mike Davis", "Liza Featherstone", "Peter Frase", "Keeanga-Yamahtta Taylor", "Richard Walker", "Luke Savage", "Branko Marcetic"], "date_download": "2020-05-04 19:49:55", "date_modify": "2020-05-04 19:49:55", "date_publish": "2019-06-19 00:00:00", "description": null, "filename": "2019_06_new-deal-socialism-bernie-sanders-democratic-primary_1588621795.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/06/19131548/GettyImages-2669115.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_06_new-deal-socialism-bernie-sanders-democratic-primary_1588621795.html", "title": "Why Bernie Talks About the New Deal", "title_page": "Why Bernie Talks About the New Deal", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "YMany in the pundit class claim to be confused about Bernie Sanders’s big socialism speech. For one thing, what was Franklin Roosevelt doing in it?\n“There’s something a little strange about saying ‘I meant socialism like the kind advocated by the guy who very explicitly and intentionally did not call his project socialism,’” MSNBC’s Chris Hayes said on Twitter, referring to FDR. Slate’s Jordan Weissmann expressed the same thought on his website’s What Next podcast. “Bernie now wants to talk about democratic socialism as the continuation of FDR’s legacy. And it’s kind of weird rhetorically. He’s sort of latched on to this identity as a socialist even as he’s just sort of a New Deal liberal.”\nMore sympathetic observers saw political logic in the move, even as they agreed it made no sense on a factual level. Jamelle Bouie, in a perceptive column for the New York Times, wondered why Sanders would attempt to — in Bouie’s words — “defend himself as a ‘democratic socialist’ by defining ‘democratic socialism’ as something that is not actually socialism.” He concluded that the Vermont senator, having spent so much of his life in socialist circles, is simply trying to “bring the term itself into the mainstream of American politics.”\nThat is surely true. But there’s another reason why Sanders points to the New Deal as an expression of socialist values: that’s how it was perceived by many observers at the time.\nSome of these observers, of course, were reactionary Republicans. Senator John Bricker of Ohio, for example, the 1944 GOP vice-presidential nominee, liked to rant about how “Communist forces have taken over the New Deal.”\nBut they also included “progressive” Democrats like Al Smith, the Irish-American former New York governor, whose 1928 presidential campaign had mobilized millions of immigrant voters with its inclusive message opposing nativist bigotry. Smith was a lifelong Democrat, but like many leading Democrats today he felt distaste for “demagogues that would incite one class of our people against the other.” By the end of FDR’s first term, Smith had seen enough of the New Deal.\n“Just get the platform of the Democratic Party, and get the platform of the Socialist Party, and lay them down on your dining room table, side by side, and get a heavy lead pencil and scratch out the word ‘Democrat,’ and scratch out the word ‘Socialist,’ and let the two platforms lay there,” Smith quipped in a 1936 speech. “Then study the record of the present administration up to date. After you have done that, make your mind up to pick up the platform that more nearly squares with the record, and you will put your hand on the Socialist platform. You couldn’t touch the Democratic.”\nIt wasn’t only red-baiting opponents of socialism who saw the resemblance. So did many socialists — including Norman Thomas, the longtime leader of the Socialist Party of America. In the words of his biographer, Thomas “viewed Roosevelt’s program for reform of the economic system as far more reflective of the Socialist Party platform than of his own [Democratic] party’s platform,” in particular its embrace of a shorter workweek, public works, abolition of sweatshops, a minimum wage, unemployment insurance, and old-age pensions. Though always highly critical of Roosevelt — who never embraced “our essential socialism” — Thomas acknowledged that FDR built a rudimentary welfare state by adopting “ideas and proposals formerly called ‘socialist’ and voiced in our platforms beginning with Debs in 1900.”\nNor was it just American socialists who saw the affinity. French prime minister Léon Blum — a genuine, red flag–waving, Marx-reading European socialist — was almost lyrical in his praise of Roosevelt. Elected in 1936 as the candidate of the French Section of the Workers’ International, in a coalition with the French Communist Party, Blum made no secret of the fact that he took the New Deal as his governing model: “Seeing him [FDR] act,” Blum said in a 1937 speech in Paris, “French democracy [i.e. the French left] has had the feeling that an example was traced for it, and it is this example that we wish to follow.” When Roosevelt won reelection, Blum rushed to the US embassy, where, according to the ambassador’s report to Roosevelt, he displayed “as genuine an outpouring of enthusiasm as I have ever heard….Blum himself said to me that he felt his position had been greatly strengthened because he is attempting in his way to do what you have done in America.”\nRank-and-file Communists shared that feeling as well. The historian Eric Hobsbawm, a lifelong member of the party who joined it in Berlin in 1931 and remained an active militant into the 1950s, recalled in his memoirs the admiration he and his fellow European Communists felt for Roosevelt:\nIn the 1920s and early 1930s America was a by-word for the hardfaced pursuit of profit, for injustice, for ruthless, unscrupulous and brutal repression. But F. D. Roosevelt’s USA not only disclaimed this reputation; it turned it sharply to the left. It visibly became a government for the poor and the unions. What is more, Roosevelt was passionately loathed and denounced by American big business, that is to say by the very people who more than any others represented the evils of capitalism to us. It is true that, as usual, the Communist International, stuck in its ultra-sectarian phase, took its time to recognize what was obvious to everyone else and denounced the New Deal, but by 1935 even it had come round. In short, in the 1930s it was possible to approve of both the USA and the USSR, and most youthful communists did both, as did a very large number of socialists and liberals. Franklin D. Roosevelt was certainly not Comrade Stalin, and yet, if we had been Americans, we would have voted for him with genuine enthusiasm. I cannot think of any other “bourgeois” politician in any country about whom we felt that way.\nThat so many observers saw a connection between socialism and the New Deal shouldn’t be surprising. In 1932, FDR was a fairly conventional progressive Democrat, but the wave of mass strikes that started in 1934 forced him to the left. By 1936, the newly formed industrial unions that grew out of those strikes had become the core of his political base, and most were led or had been organized by socialists and communists: Walter Reuther of the United Auto Workers, Sidney Hillman of the Clothing Workers, Harry Bridges of the Longshore Workers, John Brophy of the CIO. At the same time, thousands of socialist and communist experts flooded into the New Deal agencies, including the National Labor Relations Board and the Treasury, Agriculture, and Commerce departments.\nIn 1944, Roosevelt called for an Economic Bill of Rights: the right to a job and adequate income; to decent housing and medical care; to protection from the risks of old age and unemployment. As reform momentum in Washington slowed in the face of war and congressional conservatism, the CIO took up the mantle in its “People’s Program for 1944,” distributed in pamphlet form to millions of voters.\nThe CIO program laid out an aggressive social-democratic platform for postwar America: guaranteed full employment, progressive taxes, public works, day care programs, a national health insurance plan, and expanded old-age and unemployment insurance, all backed by price controls and “planning for plenty.” (Its civil rights program included voting rights guarantees for Southern blacks and a permanent federal job discrimination commission.) As the historian Isser Woloch has shown, the CIO program closely echoed the contemporaneous postwar programs of Britain’s Labour Party and France’s National Council of the Resistance — both written largely by socialists.\nUtterly dependent on CIO support, Harry Truman’s 1948 presidential campaign — the last of the New Deal era — embraced the union federation’s rhetoric and program almost in their entirety, including a single-payer health care system, a full-employment guarantee, a higher minimum wage, and continued postwar price controls. When news of his victory reached London, the British Labour Party — “a Socialist Party, and proud of it,” in the words of its 1945 manifesto — released an exultant statement: “We are not suggesting that Mr. Truman is a Socialist. It is precisely because he is not that his adumbration of these policies is significant. They show that the failure of capitalism to serve the common man . . . is not, after all, something we invented . . . to exasperate Mr. Churchill.”\nThe same message came from the Labour Party’s internal left-wing dissident group, Keep Left (the “Bevanites,” followers of socialist leader Aneurin Bevan), which was otherwise bitterly critical of Truman’s emerging Cold War foreign policy: “The Fair Deal, backed by a politically conscious labour movement, is based on . . . moral principles which inspire our socialism . . . Over a wide field the Truman Administration and the Labour Government have the same interests and ideals — and the same enemies.”\nThe socialists who saw their likeness in the New Deal, it should go without saying, were hardly representative of socialism’s most radical currents. There were always factions on the left, including most Trotskyist groups, that could see no common ground between themselves and the patrician from Hyde Park. And Roosevelt, of course, never called for the collective ownership of the means of production (at least outside a few sectors, like rural electrification) let alone a dictatorship of the proletariat.\nBut real-life politics is more than just a battle of philosophical position papers about ultimate goals, and socialism, as Marx said, is about the “real movement” more than any blueprint for a distant future. Maybe it’s precisely the absence of a mass socialist tradition in this country that accounts for the pundits’ oddly literal-minded definitions of socialism: in Britain, no one in the commentariat seems to question Jeremy Corbyn’s self-description as a socialist, though he’s not calling for wholesale nationalization either.\nRepublicans have spent decades ludicrously insisting that anyone to the left of Calvin Coolidge is a socialist. The Democrats, it now seems, want to claim that anyone to the right of Bob Avakian couldn’t possibly be one. When did the party of Joe Biden start sounding like a bunch of Maoist sectarians?", "url": "https://jacobinmag.com/2019/06/new-deal-socialism-bernie-sanders-democratic-primary"}