{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:27:35", "date_modify": "2020-05-04 20:27:35", "date_publish": "2019-02-20 16:37:00", "description": "After 44 years of syringes, stitches and strep cultures, Shannon Merrill is hanging up her stethoscope and retiring from a long and full career as one of Pocatello's finest nurses. Whether before,...", "filename": "_54ffdae206fa4040a32afb21e6a22a78_1588624055.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_54ffdae206fa4040a32afb21e6a22a78_1588624055.html", "title": "Shannon Merrill retires from nursing career after 44 years", "title_page": "Shannon Merrill retires from nursing career after 44 years", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "After 44 years of syringes, stitches and strep cultures, Shannon Merrill is hanging up her stethoscope and retiring from a long and full career as one of Pocatello’s finest nurses. Whether before, during, or after labor, into adolescence or after their own retirement, Shannon’s nursing skills have touched many in our community.\nHer journey began with graduating from ISU’s nursing program in 1974. Two days later she married the love her life, Gary Merrill, and shortly there after began her first job in the nursery at Bannock Memorial Hospital. She loved everything about her job. From giving the babies their first baths, helping the new moms with nursing, and folding mountains of diapers, to prepping the new, excited families to take their new addition home, every part was special and exciting. Shortly thereafter, she began her longest career run as a nurse at The Pocatello Children and Adolescent’s Clinic. This role not only introduced her to many lifelong friends but also prepared and guided her through her other full time job, as a mother to her four daughters. During her 23 years at the Children’s Clinic she worked for many of Pocatello’s finest pediatric physicians, including Dr,’s Judd, Boe, Bryden, Fischel, Hogen, McInturff, Nelson, Yost and Mack. She then followed Dr. Yost (Chris) as he set up his own private practice. During her 10 years with Yost, Shannon oversaw IRIS, the state immunization program, and was recognized and awarded many of those years as operating one of Idaho’s highest patience immunization rate practices.\nIn 2005 she changed focus from children to women’s health when she began working with Dr. Bruneau and Dr. Shelley at the Pocatello Women’s Health Clinic. She loved working with and educating new expecting moms and assisting with in-office procedures. She then completed and rounded out her nursing career by working with Brad Walker N.P. at Bingham Memorial Family Medicine, focusing on men’s health.\nRetirement for Shannon will be full of many opportunities to continue her passion for caring for others. She’s looking forward to spending more time with her 12 grandchildren at their sporting and dance events, as well as helping her and Gary’s parents. There are piles of books to be read, archives of recipes to be tested and furniture to be refinished. She is also looking forward to spending more time with Gary and traveling to new places. Shannon’s children, Mecinna (Jared) Price, Jodi (Sean) McHugh, Cassia (William) Myers, and Hailey (Kevin Fay) Merrill, would like to tell their mom how proud they are of her and thank her for the example she is to them. They could not enter any store, event or school function without a grateful stranger coming up to the their mother expressing their appreciation for her help in taking care of a loved one’s aliment or birth. Many dinners were interrupted by a phone call from a frantic patient or\nshopping trips paused by someone needing some advice for their babies’ fever. Shannon always had time for everyone and always had just the right advice to help sooth their pain. Her family is very proud of her. Her husband Gary says although he knows there is no such thing a wife who doesn’t work, he’s excited to watch her try. He’s very proud of her many accomplishments and can’t wait for the many Harley rides into the sunset together.\nIf any community members, past or present patients. coworkers, friends or family would like to wish Shannon a happy retirement, her family will be honoring her at an open house reception. March 1st, from 6-8, at the Assemble’ Event Center located at 820 East Young street. on Yellowstone near City Hall. Refreshments will be served.", "url": "https://apnews.com/54ffdae206fa4040a32afb21e6a22a78"}