{"authors": ["Ryan Duvall"], "date_download": "2020-05-04 20:05:55", "date_modify": "2020-05-04 20:05:55", "date_publish": "2019-03-17 05:00:01", "description": "Just when I thought I knew all the great places for fish, a Mexican restaurant stepped up and surprised me. As I perused the appetizers at Don Chava's Mexican Grill along the Wells Street...", "filename": "_d04acf4f89a5452ea95528b2e4088a8b_1588622755.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d04acf4f89a5452ea95528b2e4088a8b_1588622755.html", "title": "Mexican grill has excellent options for Lent", "title_page": "Mexican grill has excellent options for Lent", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Just when I thought I knew all the great places for fish, a Mexican restaurant stepped up and surprised me.\nAs I perused the appetizers at Don Chava’s Mexican Grill along the Wells Street corridor, the Charalitos caught my eye. It was mixed in among the usual queso and bean dips listed on the menu. Your choice of two dozen fried or garlic smelt, the menu stated.\nI love smelt as does my youngest son. It is a go-to for us at our favorite restaurant near our river cottage. Well, the Don Chava’s version was just as good.\nThe little butterflied, bone-in fillets were perfectly fried until super crispy, and they were presented nicely with lime wedges and a tomato skin rose. We happily gobbled down every morsel, and plan to try the garlic versions next time to see if they are even better.\nCharalitos do not appear on any other menu in the Cebolla’s group of restaurants, nor do many other fish and seafood creations that separate it from its sister stores.\nMy second Lent-friendly offering was also a winner but it was far more complex than the smelt. The Camarones a la Diabla featured six jumbo shrimp in a fiery red hot sauce that really woke me up. The shrimp were plump and juicy and their sweetness played nicely against the spice.\nThe dish also came with a side of Don Chava’s wonderful crab salad that is so good it is a must-add side with about anything I order there. It is packed with sweet shredded crab with just a touch of creamy dressing.\nAs fiery as the shrimp dish was, it was not as challenging as my guacamole dip. Served in a fried tortilla bowl, this creamy dip was packed with diced jalapeños that made it one of the spiciest things I had at the restaurant.\nI like a little jalapeño in my guacamole, but the amount I was served was startling. It was especially startling given there was no indication on the menu that it might be such a fiery offering.\nMy salsa was also very hot during that visit, which had me thinking there was someone in the kitchen who was going off the script because Don Chava’s salsa is usually perfect.\nI did not stop eating either dip, however, because the chips on this busy weekend night were super fresh : still hot from the fryer : and as perfect as can be.\nThe chips never ran out, either, as my server didn’t miss a beat despite the hectic state of things. I never wanted or needed for anything during all of my visits and, though the place can get a little loud with its open, cantina-style atmosphere, there was not much I could complain about when it came to the aesthetics of the place.\nBesides the smelt, another great new find at Don Chava’s was a spin on a rather boring, staple Mexican dish. The arroz con pollo : chicken in Spanish rice blanketed in creamy white queso sauce : can be had with steak instead of chicken. This arroz con carne, which I guess one would call it, was even better than the staple. The edges of the fajita-style beef strips were charred a little from the grill, but were tender and flavorful.\nThe steak was even better as part of the mixteca salad, which could also be had with chicken. This beautiful salad had crunchy romaine perfectly dressed with a lively chipotle dressing, corn, black beans and red peppers. Cilantro and some of those peppers were artfully arranged along the outside of the plate and it was topped with fresh avocado and fried tortilla strips.\nThe steak was perfectly seasoned and the greens were finely diced to closely match the beans, corn and peppers so it reminded me of a classic chopped salad. The avocados added fatty richness and there was nary a flaw.\nThere were also no major flaws with my Tijuana’s Enchiladas, but I did not enjoy them as much as I thought I would. Four corn tortillas stuffed with marinated chicken were coated in queso sauce and a green tomatillo sauce with a scoop of sour cream on top.\nI love tomatillo sauces, but Don Chava’s, though still tasty, lacked some of the acidic brightness I expected. It was a huge entrée with four big enchiladas and nothing else, so I grew tiresome of it quickly. I actually missed having sides of refried beans and rice to break things up even though I never usually pay much attention to those sides.\nMy final dish from the sea was wonderful, but I felt it, too, lacked a side. The fillets of tilapia in my three tilapia tacos were heavily seared until brown, which gave them extra flavor and a little texture. The fish was flaky and delicious, and there was avocado, pico de gallo, fresh avocado and a mini cabbage salad to add as I liked. The chipotle tartar sauce was also sweet and yummy, but I felt I was missing something.\nI think perhaps a fresh pineapple salsa or another sweet, fresh element would have been better than the heavy tartar sauce. Or maybe I just needed to add a side of crab salad to make it brilliant.\nMy favorite dessert needed nothing else because it was already brilliant. The flan at Don Chava’s was a traditionally prepared masterpiece. The cone of thick, rich, set custard had caramelized beautifully on the top and bottom, it had an ultra-creamy texture and its runny caramel sauce was just right.\nRestaurant: Don Chava’s Mexican Grill\nAddress: 1234 N. Wells St.\nPhone: 423-6677\nHours: 11 a.m. to 10 p.m. Monday through Thursday; 11 a.m. to 10:30 p.m. Friday and Saturday\nCuisine: Mexican\nHandicapped accessible: Yes\nAlcohol: Full bar\nCredit cards: Yes\nKid-friendly: Yes\nMenu: Charalitos (4.59), Camarones a la Diabla (10.05), tilapia tacos (8.99), arroz con pollo ($11.25)\nRating breakdown: Food: ★★ (3-star maximum); atmosphere: 1/2 (1 maximum), service: ★ (1 maximum)\nRyan DuVall is a restaurant critic for The Journal Gazette. This review is based on two unannounced visits. The Journal Gazette pays for all meals. Email him at rduvall@jg.net; call at 461-8130. DuVall’s past reviews can be found at www.journalgazette.net. You can follow him on Twitter @DiningOutDuVall.", "url": "https://apnews.com/d04acf4f89a5452ea95528b2e4088a8b"}