{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:14:53", "date_modify": "2020-05-04 20:14:53", "date_publish": "2019-04-10 04:00:00", "description": "As residents and taxpayers of Bethel for over 40 years, my wife and I have personally invested handsomely in our town. We have done all we could do to help improve the quality of our schools and...", "filename": "_84fee81debd045148c8f88c11b3bbaec_1588623293.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_84fee81debd045148c8f88c11b3bbaec_1588623293.html", "title": "Urges yes-yes votes on Bethel budget", "title_page": "Urges yes-yes votes on Bethel budget", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "As residents and taxpayers of Bethel for over 40 years, my wife and I have personally invested handsomely in our town. We have done all we could do to help improve the quality of our schools and over the years we have supported reasonable increases in our town budgets to improve our roads, fix neglected bridges and buildings and improve our quality of life.\nThese efforts have paid off. Today Bethel schools are recognized as one of the finest systems in New England. Many of our programs have been ranked among best in the nation. This has made Bethel one of the most desirable towns in this state. And unlike the rest of Connecticut, Bethel is growing and providing new opportunities to raise families in a beautiful and friendly community.\nI am going to the voting booth this Thursday to vote YES-YES on Bethel’s town and school budgets to protect the investments that all of us have approved. This year’s budget calls for a modest 2.2 percent tax increase, only about the same as annual inflation. And even at that, nearly all of that increase is simply the new bond payments on the construction projects voters authorized in the past three years.\nAside from that new cost, this budget merely maintains present services. There are no costly additions or new initiatives. Yet this budget also includes the things our town needs to stay safe. It will support the continued rebuilding of Bethel’s roads, replace aging portable radios with new digital systems that allow all police and fire agencies to communicate with one another, and provides new breathing tanks for our volunteer fire fighters.\nThis is a sensible budget that pays for our projects without sacrificing services or quality. I hope you will join me in voting YES for our town and YES for our schools.\nMatthew Knickerbocker\nBethel\nNote: The author is first selectman of Bethel.", "url": "https://apnews.com/84fee81debd045148c8f88c11b3bbaec"}