{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:28:28", "date_modify": "2020-05-04 20:28:28", "date_publish": "2019-05-08 19:34:53", "description": "Connecticut’s Beardsley Zoo is seeking amateur and professional photographers to submit their best work for its first non-juried photography exhibition, “Photography Goes Wild.” Opening...", "filename": "_082fc0fef32445e5a097a757e72cbcc9_1588624108.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_082fc0fef32445e5a097a757e72cbcc9_1588624108.html", "title": "Connecticut’s Beardsley Zoo seeks amateur and professional photographers for its first non-juried exhibit", "title_page": "Connecticut’s Beardsley Zoo seeks amateur and professional photographers for its first non-juried exhibit", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Connecticut’s Beardsley Zoo seeks amateur and professional photographers for its first non-juried exhibit\nConnecticut’s Beardsley Zoo is seeking amateur and professional photographers to submit their best work for its first non-juried photography exhibition, “Photography Goes Wild.”\nOpening night for the exhibit is Thursday, July 25 — a festive evening celebration for the public to view the photos and for photographers to meet and mingle.\nExhibit rules:\nEach photographer can submit three photos, sized 8 x 10, and matted, with a $10 fee per photo.\nPhotos must include animals from Connecticut’s Beardsley Zoo. They may be older photos from a previous year as well as current photos.\nMilford Photo will provide First, Second, and Third prizes in the form of gift certificates to the store. First prize is $200, second prize is $100, and third prize is $50.\nIn addition to the judged photos, a People’s Choice will be selected. The general public can vote on their favorite by making a $1 donation for each vote.\nPhotos will be offered for sale following the opening, with a portion of the proceeds going to support the zoo.\nPhotos are due to be submitted by Sunday, June 30. Photo submissions may be dropped off at the front gate or the zoo’s Welcome Center.\n“Art is a natural way for people to express their love of animals and appreciation of nature,” Zoo Director Gregg Dancho said in a news release. “The ‘Photography Goes Wild’ exhibit will help to showcase the stunning diversity of species at the zoo, and we hope, encourage people to focus on preserving wild habitats and animal conservation in new ways.”\nIn preparation for the exhibit, event sponsor Milford Photo will be on zoo grounds on Saturday, June 22, with a display of cameras and lenses. In addition to a guided Zoo Walkabout with experienced animal photographer and zoo volunteer Jack Bradley, Milford Photo will loan lenses that day for a free trial.", "url": "https://apnews.com/082fc0fef32445e5a097a757e72cbcc9"}