{"authors": ["Peter Gowan", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:57", "date_modify": "2020-05-04 19:51:57", "date_publish": "2019-02-26 00:00:00", "description": null, "filename": "2019_02_a-plan-to-win-socialism-in-america_1588621917.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/02/26104108/issue32-feature-3.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_02_a-plan-to-win-socialism-in-america_1588621917.html", "title": "A Plan to Win Socialism In America", "title_page": "A Plan to Win Socialism In America", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nAs socialists prepare for the long campaign to elect Bernie Sanders president, we should be thinking about the confrontations to come if we actually get what we want. We’ve been losing for a very long time. There have been some green shoots recently, but we still face immense challenges in simply overcoming neoliberal capitalism, let alone moving beyond social democracy and into a democratic-socialist society. One possible outcome of a Sanders presidency involves the administration bowing to “political reality,” abandoning most of its program, and finding one or two symbolic measures it can pass. Its supporters are told to be happy with what they can get. Think of this as the “Bill de Blasio” scenario. The other scenario involves a working-class movement and its president going to war with Congress (not just the Republicans but most of the Democrats as well), the Supreme Court, and recalcitrant state legislatures; adopting a strategy of dissensus rather than consensus; and demanding that undemocratic obstacles to necessary social change are swept out of the way. Think of this as the “Salvador Allende” scenario. This necessarily means imagining our agenda on a federal level as involving more than just parliamentary action, and more than one electoral cycle. One key tool must be the use of appointments to federal positions and executive action to enable labor and social movement assertiveness. The Trump administration has showed that an executive branch alone can quickly reverse key policies of its predecessor. The incoming administration should do the same, while appointing radically pro-labor nominees to the National Labor Relations Board and Department of Labor, and similarly ambitious environmentalists to departments dealing with energy and climate change issues. The administration should immediately take all possible actions to regularize the status of undocumented immigrants and dismantle the internal enforcement machine. Sanders should also use the bully pulpit of the presidency to support primary challengers against obstructionist Democrats. Many representatives are merely careerists who will acquiesce to a leftist program if it is a choice between that or irrelevance. But a core of ideological centrists should be dislodged entirely — if only to set an example for the rest that they would pay a higher price for obstructing progress than they will for upsetting their former corporate masters. Inside Congress, caucuses of committed socialists must be established, and will be required to exert their influence to ensure that legislation is not watered down. We have already seen the beginnings of this with representatives like Rashida Tlaib and Alexandria Ocasio-Cortez, but many more are needed — and existing members of the Progressive Caucus must get more serious about opposing the political establishment rather than acting as intermediaries between the Democratic leadership and a progressive base. But while breaking down opposition to the minimum program of a Sanders administration, we must also think about how to push forward in the event that we’re successful, ensuring that we do not simply declare “job done” upon reaching a social democracy and give capital time to regroup. In a world where we have twelve years to mitigate the impact of climate change, there is no such thing as a partial victory.\nBeyond Social Democracy This means we need to review the legislative component of our path to socialism — how government policy can be shaped to enable changes in political economy that reflect and promote class struggle. One of these mechanisms should be legislation that mandates a ratcheting increase in worker ownership and control of major companies. What is important, however, is to maintain an ambitious horizon. We do not simply seek to change the boundaries between the public and private sector; as socialists it is our position that profit extracted by capitalists should not exist. There are a number of models that the US left can look to — the most well-known being the Meidner Plan, the 1970s Swedish scheme to use a share levy on profitable companies to build up union-controlled funds that would have eventually controlled all significant firms in the economy. The plan failed due to strong opposition from capitalists, right-wing parties, and the lukewarm attitude of the Social Democratic leadership — it was reduced to a shadow of its former self in its eventual implementation before being dissolved entirely in the early 1990s. However, similar ideas have recently been revived in the United Kingdom, where Shadow Chancellor John McDonnell has proposed a system of “Inclusive Ownership Funds” (IOF) that would underline Labour’s other economic policies on living wages, union rights, democratic ownership, codetermination, and public banking. Going beyond this, the party now proposes that 1 percent of companies’ shares be given to workers through an inclusive ownership fund each year, up to a cap of 10 percent (this is of only moderate relevance, since Labour could stand in future elections on a platform of raising the cap). The funds would, in many firms, make the workers the largest single shareholder, and instead of vesting the powers in a distant pension fund they have little control over, they would directly elect their own trustees. If we are thinking about how a Sanders administration might introduce a democratic heartbeat which gradually increases the level of economic democracy around the country on an automatic basis, even if one or more of the institutions of power falls to opponents, a law of this sort could be an incredibly important tool for resetting the default state of economic development, away from greater privatization and towards greater socialization. What we are considering here are residual policies which aim to introduce a rising baseline of economic democracy in those parts of the economy that are not covered by our specific policies that aim to rapidly socialize or eliminate key sectors or firms. There is certainly, for example, a compelling need to dismantle the health insurance industry by creating a single-payer national health care program. Companies like Aetna and Blue Cross Blue Shield will not be brought under workers’ control through a gradual transition mediated through an IOF; they will instead be eliminated entirely, with displaced workers assisted through a transitional program. This is important to note. Some potential objections to inclusive ownership funds or Meidner-style approaches center around a need for more rapid socialization in specific areas — banking and finance, for example, or the fossil fuel industry. These are not residual sectors — a socialist administration should ideally be socializing finance through controls on capital mobility, public banking, and a national investment bank; and bringing fossil fuel companies immediately into public ownership and phasing out their polluting activities by 2030 as proposed by the Green New Dealers. There are undoubtedly additional similar sectors, but there are others which should be lower on our list of priorities. What is important, however, is to maintain an ambitious horizon. We do not simply seek to change the boundaries between the public and private sector; as socialists it is our position that profit extracted by capitalists should not exist. Abandoning the goal of socializing residual sectors because they are not destroying the planet or posing an existential threat to our project would be a historic mistake. With that justification, let’s discuss in broad terms how a Sanders Plan could operate.\nA Sanders Plan? Workers in each firm would elect trustees from among their ranks on an annual basis. If other arrangements, such as a codetermination law, are being implemented by the same government, these elections all could happen at the same time — an annual “economic election day.” The inclusive ownership fund’s worker-trustees would exercise all the rights from IOF shares including the use of voting rights and any minority shareholder protections and rights to access information. A large proportion of the dividends would be distributed equally among workers in each firm, while the remainder would be used as a “social dividend” to promote collective ownership and control on a wider scale. A classic concern with firm-level worker ownership schemes involves fears about turning workers into petty capitalists. We avoid this by making sure that they retain a strong interest in each dollar in firm revenue being added to labor’s share instead of capital’s share. Workers do not “buy in” to the scheme, nor can they “cash out” on leaving or retirement — there is an “asset lock” which makes the trust a permanent part of the company owned by the current workers at any moment in time. They receive a dividend, which is limited in size, and use their shares to influence and control the company. IOFs should not be seen as retirement savings or pension funds, though of course workers are free to put their own dividends in a retirement account. There are four key variables in designing the contours of the policy: the mechanism and rate of share transfer; the threshold above which firms are covered; the design of the social dividend; and the destination of “social dividend” funds. In the Labour Party policy, there are answers to some of these questions already — it would transfer 1 percent of equity to an inclusive ownership fund every year (up to a 10 percent limit); in all firms with more than 250 workers; taking all dividend funds over a £500 per worker annual cap as a social dividend. The answer as to the destination of the funds has been left relatively unclear. The closest one could get to the original Meidner proposal within this framework would involve taking 20 percent of pre-tax profits a year (with no limit); in all firms with more than 50 workers, taking 100 percent of dividend funds and giving them to funds controlled by sectoral unions. However, there are serious reasons for having some deviation here — the political economy of the original proposal left too many of the approach’s benefits too far in the future, ensuring that support for it remained largely limited to union militants; a direct link between increases in social ownership and increases in personal income can help to create a wider appeal without compromising the core commitment to socializing ownership. It is also a concession to the reality that in the United States today, people feel a considerably greater sense of attachment to a firm than a sector, and creating a genuine sense of collective ownership over firms will be considerably more difficult when it involves persuading a Walmart worker that they have meaningful ownership over Target. In order to equalize distribution of socialized wealth between industries and to ensure that nonworkers and public sector workers see some of the benefits, an increasingly large share of dividends from inclusive ownership funds should be sent to a social wealth fund that would own and manage equity stakes in companies on behalf of the whole of society. The social wealth fund could also receive capitalization from other capital taxes — a range of these are proposed by Matt Bruenig at the People’s Policy Project. This creates a double mechanism to increase social ownership of the economy — shares are created in large companies and dilute existing investors while empowering workers within the firm, while capital taxes and the returns on those shares capitalize a wealth fund that invests and increases its holding while paying a yield to the federal government that could be used for social expenditure. The fund would also be able to invest strategically in specific firms, combining its own holding with that of the workers to create a public-worker partnership with a majority stake. It is crucially important that large firms be compelled rather than incentivized to issue the baseline minimum of shares. However, there is a strong case for providing some financial inducement to those who voluntarily socialize companies at an accelerated rate — this assists the policy by introducing divisions and conflict into the ranks of capitalists. Any resources that business spends on preventing “strikebreaking” among its own ranks are resources they are not able to use combatting the general policy. Astute observers have previously noted that worker dividends could potentially be cancelled out by lower wages. This indeed could be the case in a laissez-faire market, which is why restoring union power and introducing sectoral wage-bargaining are so important to the success of this policy. The approach here is a method of moving past social democracy towards democratic socialism, not a silver bullet that will allow us to skip the work of building up independent working-class power and a welfare state. It is, in short, a plan for victory.", "url": "https://www.jacobinmag.com/2019/02/a-plan-to-win-socialism-in-america"}