{"authors": ["Matt Zarb-Cousin", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Dawn Foster", "Solomon Hughes", "Richard Seymour", "Daniel Finn"], "date_download": "2020-05-04 19:57:05", "date_modify": "2020-05-04 19:57:05", "date_publish": "2019-07-23 00:00:00", "description": null, "filename": "2019_07_boris-johnson-no-deal-brexit-remain_1588622225.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/07/23103948/GettyImages-1157399207.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_07_boris-johnson-no-deal-brexit-remain_1588622225.html", "title": "The Resistance to Boris Johnson Must Start Today", "title_page": "The Resistance to Boris Johnson Must Start Today", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "As our new prime minister Boris Johnson grew increasingly comfortable with no-deal Brexit in recent weeks, you’d be forgiven for thinking our barely functioning media had forgotten to ask him questions like “what’s your plan for the day after?”\nAfter negotiations that essentially amounted to Theresa May concluding that we’re going to do everything the European Union wants, the prospect of a no-deal Brexit has become somewhat seductive, like a mysterious void we’re told not to stare into. Voids are dangerous in politics as they create the conditions for projection: where the consequences of an outcome are unclear, almost any meaning can be attached to it.\nBut the implications of leaving without a deal are clear. The United Kingdom will have to understand and determine — before it reverts to World Trade Organization (WTO) terms — what exemptions to its rules it requires, as all the current trade schedules Britain is exempt from are enacted through the European Union.\nIf we get this wrong from the outset, or fail to get approval for our desired exemptions, far from taking back control we would in fact lose sovereign control over trade policy.\nA recent WTO dispute between the United States and Antigua is relevant to understanding why getting this right is so important. Remote gambling operators based in Antigua were accessing American gamblers, and American authorities objected. Offshore operators used a legal opinion to claim that gambling was where the server was rather than where the gambler was, which seemed absurd.\nBut, after several years, the WTO finally found in favor of Antigua and imposed a fine of $12 million on the United States. Simply put, America had failed to recognize that remote gambling was not included in their specified WTO exemptions. These rules are no minor thing — they take precedence over preexisting domestic legislation.\nOnce Boris Johnson is sworn in as prime minister, the first question he should be asked is what his proposed WTO exemptions would be. It is, of course, doubtful he has an answer. And it seems likely he would balk at the idea of coming up with one, should the inevitable happen and the European Union reject his attempts to renegotiate the backstop.\nAt that point Boris Johnson could well take the Syriza route — hoping to disguise his negotiating failures with a referendum aimed at whipping up indignation at Europe. It seems likely there won’t be a buffer “deal” on the ballot, leaving only a binary choice between Remain and No Deal.\nIf that is the case, the Left must take a leading role in the Remain movement if it is to stand any chance of winning. Far from a rerun of the Stronger In campaign, which deployed a “Project Fear” approach aimed at the affluent middle classes in large cities, a left-led campaign could be framed around resisting the disaster capitalism of no-deal: flogging off our NHS to US corporations, tearing up food standards, a blitz of deregulation and privatization.\nSuch a campaign would need to develop a positive message, and build a movement that could achieve more than a return to a 2016 status quo. It should talk about a Green New Deal, ensuring investment in areas that have been left behind, infrastructure spending to rebuild transport links outside of London, ending the housing crisis, and reforming our constitution to revive our democracy.\nIt would need to face the Boris Johnson campaign head-on with an agenda to reform not just Europe but Britain once the Tory Party has been soundly defeated.\nThe great mistake of Stronger In was to run a negative campaign that allowed Vote Leave to monopolize the positive message. The last referendum was about much more than whether we should or shouldn’t be members of a trading bloc. While Stronger In pumped out statistics, Vote Leave portrayed the European Union as a proxy for the economic elite, for those who are doing well at your expense.\nAny Remain 2.0 campaign has to articulate a positive vision for Britain that people can get behind and feel optimistic about, one that isn’t based on fearmongering about change but instead embraces it. This simply won’t happen if the Blairites behind People’s Vote are allowed to run the show — because people will rightly sense that they are about restoring the status quo.\nBut, as the Remain and No Deal binary emerges, the Left has only one choice. Coupled with a transformative vision for Britain, a solidly left-wing Remain campaign could lay the groundwork for a Labour government and build a movement that does much more than win a referendum.", "url": "https://www.jacobinmag.com/2019/07/boris-johnson-no-deal-brexit-remain"}