{"authors": ["Mark Sommerhauser", "Wisconsin State Journal"], "date_download": "2020-05-04 20:12:07", "date_modify": "2020-05-04 20:12:07", "date_publish": "2019-03-22 11:05:00", "description": "In a rebuke to Republican legislators, a Dane County judge on Thursday blocked enforcement of laws enacted in December that curtailed the powers of the incoming Democratic governor and attorney...", "filename": "_ece6fd8a34c04476a037c3bb2575afaa_1588623127.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ece6fd8a34c04476a037c3bb2575afaa_1588623127.html", "title": "Judge blocks GOP lame-duck laws limiting Tony Evers' powers; Evers seeks to remove Wisconsin from Obamacare challenge", "title_page": "Judge blocks GOP lame-duck laws limiting Tony Evers' powers; Evers seeks to remove Wisconsin from Obamacare challenge", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In a rebuke to Republican legislators, a Dane County judge on Thursday blocked enforcement of laws enacted in December that curtailed the powers of the incoming Democratic governor and attorney general.\nImmediately after the ruling, Gov. Tony Evers and Attorney General Josh Kaul sought to do at least one thing the laws had barred: withdrawing Wisconsin from multi-state legal challenges to the federal health care law known as Obamacare.\nRepublican legislative leaders promised to swiftly appeal the ruling, issued Thursday morning by Dane County Circuit Judge Richard Niess. They contend it throws state government into chaos by raising questions about the validity of laws passed in prior extraordinary sessions.\nBut for now, the ruling upends laws and dozens of appointments Republicans made in a lame-duck legislative session, days before they relinquished total control of state government.\nAt the time, passage of the laws sparked Capitol protests and a national uproar among Democrats. They also sparked at least four legal challenges seeking to overturn them. The one ruled on Thursday was brought by plaintiffs including the League of Women Voters of Wisconsin, Disability Rights Wisconsin and Black Leaders Organizing for Communities.\nThey argued the Legislature lacked authority to convene when it passed the laws during a so-called “extraordinary session,” in which lawmakers, rather than the governor, convene the session. For nearly four decades, lawmakers from both parties have convened extraordinary sessions when they controlled the Legislature.\nBut such sessions are not authorized by the state Constitution or state law, Niess wrote in his ruling. The Legislature adopted a joint rule permitting them in the 1977 session, according to the nonpartisan Legislative Reference Bureau.\n“There can be no justification for enforcement of the unconstitutional legislative actions emanating from the December 2018 ‘extraordinary session’ that is consistent with the rule of law,” Niess wrote.\nIn addition to the lame-duck laws, Niess’ ruling also vacates, during the session, 82 nominees and appointees to state boards and councils made by former Gov. Scott Walker.\nHours after the ruling on Thursday afternoon, Kaul asked federal judges to dismiss Wisconsin from two anti-Obamacare lawsuits the state backed under former GOP Attorney General Brad Schimel. It remained unclear late Thursday when federal courts might grant Kaul’s requests.\nEvers: Legislature ‘overplayed its hand’\nEvers praised the ruling in a statement and said the Legislature “overplayed its hand by using an unlawful process to accumulate more power for itself” by enacting the lame-duck laws.\nSpeaking to reporters Thursday afternoon, Evers said he expected Niess’ ruling to withstand appeals.\n“The judge made it clear that the Constitution counts for something in this state,” Evers said.\nIn addition to withdrawing from the Obamacare lawsuit, Evers said his administration is exploring other courses of action that the lame-duck laws previously prevented — though he did not name any.\n“We’re going to move forward with due speed, but we have to have an opportunity to digest this,” Evers said.\nNiess wrote in the ruling that his injunction blocks enforcement only of laws enacted during the December 2018 extraordinary session.\nBut Republicans fear the ruling could be used as a basis to challenge any of the more than 300 laws or resolutions enacted in previous extraordinary sessions dating back to 1980. Senate Majority Leader Scott Fitzgerald, R-Juneau, and Assembly Speaker Robin Vos, R-Rochester, said in a joint statement that the judge’s ruling could affect laws that strengthened protections against child sexual predators and drunken drivers.\n“For decades, the Legislature has used extraordinary sessions that have been widely supported by members of both parties,” Fitzgerald and Vos said.\nAmong other things, laws enacted during the December 2018 extraordinary session prevented the governor and attorney general from withdrawing from or settling lawsuits without the Legislature’s permission.\nWith that hurdle removed Thursday, minutes after Niess’ ruling, Evers took action. According to a letter distributed by Evers’ office to reporters, his chief legal counsel instructed the state Department of Justice to “please take whatever steps are necessary to remove Wisconsin from Texas v. United States,” a consortium of states seeking to overturn Obamacare.\nHealth care lawsuit, WEDC in question\nAnother part of the 2018 lame-duck laws changes the makeup of Wisconsin’s economic development agency, giving lawmakers greater control of its governing board and suspending the governor’s authority to appoint the agency’s CEO until September.\nWith the latter provision now blocked, Evers declined to say Thursday if he will seek to replace current Wisconsin Economic Development Corp. CEO Mark Hogan, a Walker appointee.\n“We have no immediate plans to do anything with WEDC until we have fully had the opportunity to digest the judge’s ruling,” Evers said.\nOne of the other controversial provisions of the laws required uniform access statewide for early voting. The effect was to curtail the timeline in municipalities with more expansive early voting access, including heavily Democratic-voting Madison and Milwaukee.\nDuring a Monday hearing in the case , attorneys for the plaintiffs argued the Legislature illegally convened and legislative leaders committed an abuse of power in convening the session.\nFormer state Solicitor General Misha Tseytlin, now an attorney representing the Republican-controlled Legislature, contended otherwise. Tseytlin said if a judge ruled against the Legislature, it would deem a swath of laws and decisions that occurred as a result of previous extraordinary sessions unconstitutional. Such actions include the constitutional terms of district attorneys and sheriffs, and as a result, criminal convictions they have won, he said.\nDemocratic legislative leaders Thursday called on Republicans to stop all payments to private attorneys granted under the authority of December’s extraordinary session.\nThere are two cases where the Legislature cited such authority — the League of Women Voters challenge and one brought by Planned Parenthood. A judge has allowed the Legislature to join the League of Women Voters case, but under an authority other than that provided by the lame-duck law. The Legislature is still seeking to join the Planned Parenthood suit.\nState Journal reporter Riley Vetterkind contributed to this report.", "url": "https://apnews.com/ece6fd8a34c04476a037c3bb2575afaa"}