{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:57:30", "date_modify": "2020-05-04 16:57:30", "date_publish": "2019-01-17 01:44:22", "description": "Read 2020 Presidential Candidates Fast Facts on CNN for information about key dates in their campaigns.", "filename": "2019_01_16_us_2020-presidential-candidates-fast-facts_index_1588611450.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190114100252-donald-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2019_01_16_us_2020-presidential-candidates-fast-facts_index_1588611450.html", "title": "2020 Presidential Candidates Fast Facts", "title_page": "2020 Presidential Candidates Fast Facts - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's a look at the 2020 presidential candidates and key dates in their campaigns as well as election results.\nRepublican Candidates\n45th President of the United States. Running for reelection.Donald J. Trump for President, Inc.The day he is inaugurated, Trump submits paperwork to the Federal Election Commission to be eligible to run for reelection in 2020.The Trump campaign announces Brad Parscale, the digital media director of his 2016 campaign, has been hired to run his reelection bid\nFormer US Representative from Illinois- Walsh 2020\nDemocratic Candidates\nAndrew Yang - Entrepreneur, founder of Venture for America\nPrimary Campaign Committee - Friends of Andrew Yang\nWebsite - https://www.yang2020.com/\nFebruary 2, 2018 - Announces he is running for president via YouTube.\nFebruary 11, 2020 - Announces he is suspending his presidential campaign. Entrepreneur, founder of Venture for AmericaFriends of Andrew YangAnnounces he is running for president via YouTube.\nRichard Ojeda - Former State Senator from Virginia\nPrimary Campaign Committee - Ojeda for President\nNovember 12, 2018 - Announces he is running for president at the Korean War Veterans Memorial in Washington, DC.\nJanuary 25, 2019 - Announces he is suspending his campaign for president. Former State Senator from VirginiaOjeda for PresidentAnnounces he is suspending his campaign for president.\nMarianne Williamson - Author and activist\nPrimary Campaign Committee - Marianne Williamson for President\nWebsite - https://www.marianne2020.com/\nJanuary 28, 2019 - Williamson formally launches her 2020 presidential campaign with a speech in Los Angeles.\nJanuary 10, 2020 - Announces she is ending her presidential campaign. Author and activistMarianne Williamson for PresidentWilliamson formally launches her 2020 presidential campaign with a speech in Los Angeles.\nCory Booker - US Senator from New Jersey\nPrimary Campaign Committee - Cory 2020\nWebsite - https://corybooker.com/\nFebruary 1, 2019 - appears on the talk show, \"The View,\" participates in multiple radio interviews and holds a press conference in Newark, New Jersey.\nJanuary 13, 2020 - Booker ends his presidential campaign. US Senator from New JerseyCory 2020 Releases a video announcing his candidacy, appears on the talk show, \"The View,\" participates in multiple radio interviews and holds a press conference in Newark, New Jersey.\nKirsten Gillibrand - US Senator from New York\nPrimary Campaign Committee - Gillibrand 2020\nWebsite - https://kirstengillibrand.com/\nMarch 17, 2019 - Officially declares her Democratic candidacy for president via YouTube.\nAugust 28, 2019 - Announces that she is ending her campaign. US Senator from New YorkGillibrand 2020Officially declares her Democratic candidacy for president via YouTube.\nWayne Messam - Mayor of Miramar, Florida\nPrimary Campaign Committee - Wayne Messam for America\nWebsite - https://wayneforamerica.com/\nMarch 28, 2019 - Officially declares his Democratic candidacy for president in a\nNovember 20, 2019 - Messam announces that he is Mayor of Miramar, FloridaWayne Messam for AmericaOfficially declares his Democratic candidacy for president in a video released to CNN Messam announces that he is suspending his campaign\nTim Ryan - US Representative from Ohio's 13th District\nPrimary Campaign Committee - Tim Ryan for America\nWebsite - https://timryanforamerica.com/\nApril 4, 2019 - during an appearance on ABC's \"The View.\" The televised announcement came just minutes after Ryan's campaign website went live.\nOctober 24, 2019 - Announces he is dropping out of the presidential race. US Representative from Ohio's 13th DistrictTim Ryan for America Announces his presidential bid during an appearance on ABC's \"The View.\" The televised announcement came just minutes after Ryan's campaign website went live.\nEric Swalwell - US Representative from California's 15th District\nPrimary Campaign Committee - Swalwell for America\nWebsite - https://ericswalwell.com/\nApril 8, 2019 - during a taping of the \"Late Show with Stephen Colbert.\"\nJuly 8, 2019 - Announces he is US Representative from California's 15th DistrictSwalwell for America Announces he is running for president during a taping of the \"Late Show with Stephen Colbert.\"Announces he is dropping out of the presidential race.\nMichael Bennet - US Senator from Colorado\nPrimary Campaign Committee - Bennet for America\nWebsite - https://michaelbennet.com/\nMay 2, 2019 - during an interview on CBS' \"This Morning.\"\nFebruary 11, 2020 - Announces he is ending his presidential campaign. US Senator from ColoradoBennet for America Announces his candidacy during an interview on CBS' \"This Morning.\"\nJoe Sestak - Former US Representative from Pennsylvania's 7th District\nPrimary Campaign Committee - Joe Sestak for President\nWebsite - https://www.joesestak.com/\nJune 23, 2019 -\nDecember 1, 2019 - Announces he is ending his presidential campaign. Former US Representative from Pennsylvania's 7th DistrictJoe Sestak for President Announces his candidacy in a video posted to his website.", "url": "https://www.cnn.com/2019/01/16/us/2020-presidential-candidates-fast-facts/index.html"}