{"authors": ["Staff Writer"], "date_download": "2020-05-04 21:07:11", "date_modify": "2020-05-04 21:07:11", "date_publish": "2019-05-15 14:32:00", "description": "Merlin H. Witte, 84, of Johnson Creek, passed away on Sunday, May 12, 2019, at Heritage Homes in Watertown. A funeral service will be held on Thursday at 11 a.m. at Immanuel Lutheran Church...", "filename": "_37d7cd7218b3465aae7493dc962603cd_1588626431.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_37d7cd7218b3465aae7493dc962603cd_1588626431.html", "title": "Merlin Witte", "title_page": "Merlin Witte", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Merlin H. Witte, 84, of Johnson Creek, passed away on Sunday, May 12, 2019, at Heritage Homes in Watertown.\nA funeral service will be held on Thursday at 11 a.m. at Immanuel Lutheran Church in Farmington with the Rev. Paul Burk officiating. Family and friends may gather at Hafemeister Funeral Home today from 5 until 7 p.m. and at the church on Thursday from 10 a.m. until the time of service. Burial with military honors will take place at the parish cemetery. Memorials, if desired, may be directed to Heritage Homes of Watertown, Alzheimer’s Association or Immanuel Lutheran Church. Currently the Immanuel Lutheran Church’s elevator is not functional; we recommend that anyone with mobile disabilities join the visitation at Hafemeister Funeral Home for easier accessibility.\nHafemeister Funeral Home and Cremation Service of Watertown is serving the family. Online condolences may be made at www.hafemeisterfh.com.\nMerlin Harvey Witte was born on April 25, 1935, to Harvey and Cora (nee Rabenhorst) Witte on the farm in Johnson Creek. He was a 1952 graduate of Johnson Creek High School. On April 26, 1957, Merlin married the former Carol J. Seavert in Rockford, Illinois. Carol preceded Merlin in death on Feb. 8, 2016. Merlin faithfully served in the National Guard until February 1962. Merlin was employed at Carnation for 44 years as a foreman until his retirement. He enjoyed helping on the farm next door at Dettmann’s Dairy Farm, playing sheepshead and euchre, watching the Packers and Brewers, and spending time with his children and grandchildren, especially watching them play sports.\nMerlin is survived by his children, Melody (Greg) Schultz of Watertown, Bonny (Mike) Daniel of Watertown, Denise (Scott) Schwandt of Madison; grandchildren, Trevor (Amanda) Ramseier, Brady (fiancée Lauren Hay) Ramseier, Jared (Amanda Remington) Epker, Kyle (Courtney Buss) Epker, Allison Epker, Jake (Meghan) Schultz; great-grandchildren, Rhody and Ryker Ramseier, Morgan, Easton and McKenzie Schultz; sister-in-law, Diana Witte; stepsister, Cheryl Schiltz; stepbrothers, Randy Raether, Bob Raether; half-brother, Kenny (Mary-Kay) Raether; many nieces, nephews, other relatives and friends.\nHe was preceded in death by his wife of 58 years, Carol Witte; his parents; stepmother, Mary Lou Witte; brothers, Clifford Witte, Harold Witte in infancy; sister, Lucille Witte; siblings-in-law, Fredrick (Donna) Seavert, Roger (Joyce) Seavert, Betty Raether; niece, Tammy Witte.\nThe family would like to thank Heritage Homes and Rainbow Hospice for the excellent care they had provided.\nHafemeister Funeral Home and Cremation Service\n611 E. Main St. Watertown", "url": "https://apnews.com/37d7cd7218b3465aae7493dc962603cd"}