{"authors": ["Lyn Eliovson"], "date_download": "2020-05-04 21:06:32", "date_modify": "2020-05-04 21:06:32", "date_publish": "2019-03-18 15:56:23", "description": "Spring is coming, and with it comes phony home improvement “experts” who prey on the unsuspecting … and they’re among an array of frauds out there. The home improvement fraud involves people...", "filename": "_3038688a623243a29a8c33b3214a06c0_1588626392.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3038688a623243a29a8c33b3214a06c0_1588626392.html", "title": "Forum Scams require heightended vigilance", "title_page": "Forum Scams require heightended vigilance", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Spring is coming, and with it comes phony home improvement “experts” who prey on the unsuspecting … and they’re among an array of frauds out there.\nThe home improvement fraud involves people telling you they can repair whatever you need fixed. They’re working in your neighborhood and are cheaper than the others.\nBeware. They may run off with your deposit and never make the repairs or do shoddy repairs and then disappear. Check with people you trust for recommendations. Get written estimates. Ask for references and be sure to ask for copies of licenses and insurance before you let anyone start working on your home.\nThis home improvement deception is just one example of what we call scams. Originally, it was a carnival term from the British “scamp” (a cheater or swindler who wants to make a quick buck). Scams these days often target the elderly because they tend to be trusting and polite, having grown up in the 1930s, ’40s and ’50s.\nFor instance, seniors are more likely to purchase a “free” introductory product, which often blossoms into monthly credit card charges. Knowing when to call the credit card company and report a fraud or stop ongoing charges is essential.\nThose over age 65 who qualify for Medicare benefits are easy targets for health insurance scams. Once the scammers get your information, they’re able to submit claims and enhance specific claims on their own behalf.\nDid you get a call or letter asking for a Social Security number because a new Medicare card must be issued? Fraud.\nSome scammers tell a senior they need a new supplemental insurance policy. No matter the “claim,” their goal is to obtain personal information so that they can bill Medicare and take money for themselves. What to do? Call Medicare (1-800-MEDICARE) and check. Always alert your friends and family to this scam.\nFraudulent Social Security calls abound. Unknown callers threaten victims, saying they face arrest or legal action if they don’t call a certain provided number or press a certain number indicated in the message. Sometimes the scammers have a return telephone number that looks like a legitimate Social Security line. Hang up. Social Security only contacts you by phone if you have an ongoing case.\nThen there is the IRS imposter. He says you owe taxes and demands you pay immediately or face hefty fines and even jail time. His goal is to obtain your credit card number or other financial information. Remember, the IRS would never threaten arrest or request credit or debit card information over the phone.\nWe as a generation are always feeling pressured to look younger. This makes us susceptible to fake anti-aging products and lower-cost prescriptions. It could be as dangerous as receiving counterfeit prescription medications which, though cheaper, contain ingredients that might even cause injury. Check with your doctor before trying any of these products or medications.\nThe “you’ve won!” scam is popular: it’s a trip or prize or lottery win. The scammer calls all excited because you’ve won and all you need to do is give them your credit card to pay the minimal fee.\nThe “grandparent scam” is not new. A grandchild is in a panic, saying he or she is in trouble, held by authorities in another state. Please send money to them to “get out of jail!” Or, nieces or nephews request money for an emergency. You can even get calls or emails from friends who are on vacation. Some scammers even represent themselves as lonely U.S. soldiers serving overseas, in need of immediate cash.\nDon’t fall for any of this. Don’t send money. Don’t give out your credit card number.\nLegal experts recommend protecting yourself and your estate by preparing living wills and powers of attorney, both of which need at least one primary and one alternate agent each. This is critical to your estate plan. These documents, and the appointment of someone to represent you, helps in the case of a scam: you immediately know who to contact with concerns.\nThis helps you maintain a sense of control in the face of scams. And remember, you’re not alone. Falling victim to these well-trained thieves is more common than you imagine and does not mean you are incapable of handling your own affairs. Call the Federal Trade Commission hotline (1-877-FTC-HELP) to report a scam. Asking for help in reporting is a sign of capacity. If you cross paths with one of these scammers, report their attempts. You’ll help protect others.\nLyn Eliovson is a partner in the Law Offices of Eliovson & Tenore in Fairfield. The firm practices elder law, trusts and estates, conservatorships and probate. She can be reached at 203-336-2566 or at lle@connecticutelderlaw.com.", "url": "https://apnews.com/3038688a623243a29a8c33b3214a06c0"}