{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Dianne Feeley", "Luke Savage"], "date_download": "2020-05-04 19:49:32", "date_modify": "2020-05-04 19:49:32", "date_publish": "2019-11-06 00:00:00", "description": null, "filename": "2019_11_michael-moore-roger-me-flint-michigan-gm-bernie-sanders_1588621772.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/11/06101914/GettyImages-1052592084.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_11_michael-moore-roger-me-flint-michigan-gm-bernie-sanders_1588621772.html", "title": "Michael Moore Was Right", "title_page": "Michael Moore Was Right", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "I look around at the millions of people who support Bernie Sanders’s presidential campaign, who have begun to embrace ideas like Medicare for All and a Green New Deal and tuition-free college, who are warming once again to labor unions, and who are becoming convinced that there’s something fundamentally wrong with capitalism, and I think to myself: I really hope Michael Moore is having the time of his life.\nWhen I was a teenager in the aughts, it was fashionable to poke fun at Moore. I never knew why. Now I know it was because he believed that there was an alternative to crushing poverty, inequality, alienation, oppression, and war — and he never stopped saying so, through decades when an alternative was impossible for most people to imagine.\nI liked Moore’s film Bowling for Columbine when it came out in 2002. It mapped the web of interests driving the proliferation of consumer firearms and exposed the human toll of their lust for profit and power. Why, exactly, was he a laughingstock? “He just won’t shut up,” people said. He wouldn’t shut up about neoliberalism, about militarism, about the distortions of corporate-owned media, about profit-seeking in health care, about what working-class people deserve and aren’t getting and who’s to blame.\nAnd he caught a lot of shit for it. When he stood on stage at the Academy Awards in 2003 and called the Iraq War unjust — “We are against this war, Mr. Bush! Shame on you, Mr. Bush!” — he was emphatically booed by the entertainment industry elite, dressed to the nines in their tuxes and gowns. Now that the political culture has finally started to catch up with him, I hope he feels at least modestly vindicated.\nI was thinking about the vindication of Michael Moore when I decided to watch his debut film Roger & Me , which turns thirty this year and which I’d never seen before. The film is an early exploration of the domino effect of deindustrialization and a premonition about the unraveling of the American dream — and it stands the test of time.\nRoger & Me was personal for Moore. He grew up in Flint, Michigan, the town General Motors (GM) built, and his family worked for the corporate giant. They were also members of the United Automobile Workers (UAW), which was forged in the furnace of struggle — Moore’s uncle had been one of the sit-down strikers who famously occupied factories in 1936–7, giving rise to the union.\nBy the middle of the twentieth century, UAW had been able to secure a remarkable degree of stability and security for GM workers and their families. Roger & Me features archival footage showing mid-century Flint as a kind of middle-class utopia, the living embodiment of capitalism’s promise. “We enjoyed a prosperity that working people around the world had never seen before,” says Moore in a voice-over, “and the city was grateful to the company.”\nBut the company felt no allegiance to the people of Flint. Hungry for profit and regarding the union as a pest and a hindrance, GM began searching for ways to lower labor costs. In the early 1980s, it began laying off workers in its unionized plants and opening new operations elsewhere, across borders and beyond the union’s grasp.\nThe film’s title refers to Roger Smith, chairman of General Motors, who came up with the plan to close eleven factories in the United States and open eleven in Mexico, where the company could pay the workers seventy cents an hour. The company would then use the money saved by underpaying workers to expand its operations into new industries, like weapons manufacturing.\n“Maybe I’ve got this wrong,” says Moore in the film, “but I thought companies lay off people when they’ve hit hard times. GM was the richest company in the world, and it was closing factories when it was making profits in the billions.”\nThe film chronicles Moore’s efforts to secure a meeting with Roger Smith to discuss the unfolding devastation of Flint. Along the way, he introduces us to dozens of Flint residents whose lives have been upended by the layoffs and plant closings. The closest Moore gets to Smith is an ambush at a Christmas press conference, which in the film is cut with footage of Flint families being evicted from their homes just in time for the holidays.\nMoore asks Smith about the evictions. “I’m sorry for those people, but I don’t know anything about it,” Smith retorts before giving Moore the cold shoulder.\nThe film ends with an ominous forecast. “As we neared the end of the twentieth century, the rich were richer, the poor poorer,” Moore narrates over footage of a dismantled factory in the former boomtown. “It was truly the dawn of a new era.” Translation: it’s obvious what’s coming. The writing’s on the wall. And it won’t be good.\nHe was right. Security and prosperity remain elusive for the remaining employees of GM, who continue to fight the company for decent wages and benefits, including going on strike by the thousands just this year. Indeed, they remain elusive for the entire American working class, whose wages have stagnated and whose living standards have declined as corporate productivity and profits have soared and economic inequality has skyrocketed. Meanwhile, multinational corporations continue to extract value from the Global South without returning any favors, leaving billions exploited and impoverished the world over.\nBut as the unexpected popularity of Bernie Sanders’s two presidential campaigns shows, public opinion is beginning to shift. And when that happens, those who tell the truth about exploitation and oppression are likely to find their reputation restored — not because they have changed their tune, but because they no longer stand alone. During a speech in Knoxville, Tennessee, in 1905, the American socialist leader Eugene Debs said:\nI exceedingly appreciate the spirit in which the morning paper referred to me today. Several years ago, they did not write so well of me. I presume I have grown more respectable. I suppose they see that my tribe is increasing. When the masses agree with a man, then he ceases to be an object of ridicule and abuse. After a while, some of these people who have abused us will be the ones who will be saying, “I told you so.”\nIt’s a lot easier today to say the things that Michael Moore was saying during the dark ages. But it’s still difficult to be a socialist in a capitalist society, and we remain on the receiving end of our fair share of sneering and disparagement.\nWe should take the pending exoneration of Michael Moore — both the dawning acceptance that he was right all along, and the promising indications that more people are adopting his once-dismissed worldview — as an encouragement to persist in our own efforts to expose and combat the depredations of capitalism.\nAs our movement grows, it will get easier to tell the truth about the world. Though the point remains, as ever, to change it.", "url": "https://jacobinmag.com/2019/11/michael-moore-roger-me-flint-michigan-gm-bernie-sanders"}