{"authors": ["Dawn Foster", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Meagan Day", "Solomon Hughes", "Ronan Burtenshaw"], "date_download": "2020-05-04 19:56:49", "date_modify": "2020-05-04 19:56:49", "date_publish": "2019-12-03 00:00:00", "description": null, "filename": "2019_12_nhs-national-health-service-boris-johnson-tory-jeremy-corbyn-labour_1588622209.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/12/03121950/GettyImages-1184947716.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_12_nhs-national-health-service-boris-johnson-tory-jeremy-corbyn-labour_1588622209.html", "title": "The NHS Is Already Disappearing, and There’s Only One Way to Stop It", "title_page": "The NHS Is Already Disappearing, and There’s Only One Way to Stop It", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Fifteen years ago, Boris Johnson wrote a mostly waffle-filled column for the Daily Telegraph , complaining at length about an argument he’d had at a dinner party. Despite deriding his evening interlocutor at length in the national press, Johnson claimed she was a “friend” and a “classic posh-liberal” (the prime minister was born to upper-middle-class parents and educated at Eton College, rather than being born in a sewer to wolves) who had made the error of praising the National Health Service (NHS) as a program that “unites the nation.” She had seen an NHS dermatologist and had a small growth (that Johnson termed “a Rice Krispie”) removed for free. This fact troubled him: “it is unjust, surely, that the taxpayer is coughing up for Rice Krispie removal, the kind of cosmetic operation that in France or Germany would almost certainly be covered by insurance. What my friend fails to understand is that she has a choice in healthcare, where millions have none; and what the Tories want to do is extend that choice.”\nStating that you wish to privatize the NHS is considered political suicide in the United Kingdom. Conservatives, therefore, argue extensively for back-door privatization and other forms of subterfuge to make the prospect more palatable, because the fact that health care is not fully open to the market rankles them. In the same column, Johnson opined that middle-class people are brainwashed because they “feel all gooey and warm inside because they have participated in the socialising marvel of free healthcare,” letting slip the fact that socialized medicine is still too close to socialism for comfort for these ideological hard-liners. “Labour believe they have a monopoly on virtue and on caring and that they somehow have an ideological freehold upon the NHS,” he complained. A decade and a half later, this remains the complaint Conservatives make whenever the issue of health care is raised in the general election.\nDuring the first television debate, the one Johnson actually bothered to show up for, Jeremy Corbyn waved a 460-page document at the audience: minutes of meetings in which US and UK officials explored a post-Brexit trade deal that would include the NHS. The document Corbyn waved at that moment was almost entirely redacted. The context was that, back in June, Donald Trump had said “everything will be on the table” when asked if the NHS should be in a trade deal, as then-prime-minister Theresa May visibly grimaced next to him in London. Corbyn’s question was therefore astute: Why was the document redacted if the NHS were not for sale to the United States, as Johnson insisted? At Labour rallies and manifesto launches, “NHS: not for sale” has become an omnipresent chant and a slogan throughout the election. Polls show that despite Conservative attempts to frame this as “the Brexit election,” the NHS remains the top political concern for many voters across the country, and any Tory prevarication is likely to harm them electorally.\nLast week, Jeremy Corbyn held a press conference that was billed as an announcement on the NHS. But rather than a policy, Corbyn brandished the unredacted trade deal. Copies of the document were handed out by qualified doctors and nurses in scrubs. It revealed that the US negotiators expected total market access to the NHS, and believed the talks to be at a near-complete stage. The documents also included reference to chlorinated chicken, a US practice banned in Britain and hugely unpopular with the British public, as well as an insistence that the UK not mention climate change in the trade deal whatsoever.\nThe NHS portions of the deal include lengthening the duration of patents — a move that would drastically increase drug prices in the UK, and that Trump was merrily pushing on behalf of the US pharmaceutical industry. Corbyn used the example of Humira, a medication to treat rheumatoid arthritis and Crohn’s Disease, that currently costs $1,822.80 in the UK — and $10,498.43 in the United States. One of the drugs I take daily, Pregabalin, is Pfizer’s bestselling drug under its brand name Lyrica, and it was the subject of a long patent battle that the company only finally lost in the United States this year. It has been available in generic form in the UK for years, costing the NHS $3.60 for fifty-six tablets, whereas in the United States, Lyrica costs $8.25 per tablet, or $462 for a pack of fifty-six.\nWhen the news broke, I was in an NHS hospital for a routine epilepsy appointment with several medics. Mentioning the news, one nurse remarked to a colleague that the NHS is “an incredible resource of critical data,” and multiple health and technology experts have pointed out that in a trade deal, pharmaceutical and technology companies would be desperately keen to access the huge trove of patient information held by the NHS. Could any government fully communicate the risks and possibilities to patients whose information has already been entered into the system?\nThe Conservative response to the shock leak and announcement was to dismiss the claims and state that they were merely a read-out of ongoing talks. Credulous voices in the media argued that privatizing the NHS would be so unpopular no government would ever dare to consider such a move, and even more subservient members of the right-wing press complained that Labour had made public a document civil servants had marked “sensitive.”\nThis misses the point, but also makes it quite neatly. The NHS will not one day be privatized publicly, with a stroke of a pen: it is already being hollowed out. Like a homeowner denied planning permission but continuing with forbidden renovations in the hope that local authorities don’t notice, the facade remains while the rooms behind the front of the house are being ripped apart. Margaret Thatcher and Tony Blair’s governments laid the foundations of slow-drip privatizations, with the outsourcing of staffing and care contracts, and private finance initiatives (PFI). Many NHS hospitals were rebuilt under PFI contracts that offered no risk to private companies but came at massive cost to government, and health trusts are still struggling with the financial burden. Under David Cameron, further complex reforms were brought in that doctors and nurses protested against, including bruising changes to overworked junior doctors’ contracts that led to the first ever doctors’ strikes since the formation of the NHS.\nThe Conservatives will continue to argue unconvincingly that they are not putting the NHS up for sale and will never privatize it, even taking out Google ads stating, “The NHS is not for sale and never will be” to sit directly under related search terms. When Aneurin Bevan founded the NHS, he stated its three founding core principles: “That it meet the needs of everyone; That it be free at the point of delivery; That it be based on clinical need, not ability to pay.” Already, many people, especially migrants, do not have their needs met, and many more, including disabled people, have limited access. On Friday, the Guardian obtained a leaked memo detailing thirty-four tests and treatments that were to be rationed, putting cost above clinical need, in addition to many more treatments that have been limited due to cuts over the years. “Free at the point of use” is the core principle mentioned near exclusively now — and that too will be winnowed away.\nThe NHS is already being privatized. It is already in huge jeopardy. What the leaked trade talks with Trump reveal is not a secret plan to finally sell off the NHS, but the fact that Boris Johnson and the Conservatives continue to lie about the NHS — not only because they are pathological liars in general, but because of a pathological Conservative unease with free health care for all. But above all, it is simply the continuation of the path set in motion by Thatcher, extended by Blair, and maintained by each new Conservative prime minister elected by the British public, to slowly but surely hollow out the NHS until it is unrecognizable and dysfunctional, so that privatized medical insurance is preferred as a progressive choice, just as Johnson framed it in his column fifteen years ago. The NHS is rightly held in great affection by the British public, and in high regard across the world. It has already been damaged by neoliberalism, and only Corbyn’s Labour will actually halt and reverse this slow death.", "url": "https://www.jacobinmag.com/2019/12/nhs-national-health-service-boris-johnson-tory-jeremy-corbyn-labour"}