{"authors": ["Eric Blanc", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Emily Comer", "Barry Eidlin", "An Interview With"], "date_download": "2020-05-04 19:52:53", "date_modify": "2020-05-04 19:52:53", "date_publish": "2019-08-21 00:00:00", "description": null, "filename": "2019_08_eric-blanc-labor-movement-militant-minority-red-state-revolt_1588621973.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/08/21113502/GettyImages-527696188.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_08_eric-blanc-labor-movement-militant-minority-red-state-revolt_1588621973.html", "title": "We Need to Reconnect Socialists to the US Labor Movement", "title_page": "We Need to Reconnect Socialists to the US Labor Movement", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Interview by Micah Uetricht\nFew questions are as burning for radicals as how to revive the labor movement. The rising socialist movement will have a very tough time carrying out many aspects of a broad, progressive agenda without US unions rebuilding their membership, going on strike in numbers far greater than they are currently, and fighting for demands that benefit not just union members in one industry but the entire working class.\nThe recent teachers’ strike wave, seemingly emerging out of nowhere, should give us cause for much hope — not just because it represents a potential rebirth of labor militancy in the United States, but because those strikes give us a road map of how radicals can play key roles in that revitalization. To do so, we can’t just support strikes from outside: we have to embed ourselves as workers on shop floors around the country, joining other workers who aren’t radicals but are workplace leaders in cohering a militant rank-and-file current. Figuring out how to do this recently became even more pressing as the Democratic Socialists of America (DSA), the most important socialist organization in the country, passed a resolution adopting the “rank-and-file strategy” for labor work at its convention in Atlanta.", "url": "https://www.jacobinmag.com/2019/08/eric-blanc-labor-movement-militant-minority-red-state-revolt"}