{"authors": ["John Bear Staff Writer"], "date_download": "2020-05-04 20:08:29", "date_modify": "2020-05-04 20:08:29", "date_publish": "2019-03-16 00:25:54", "description": "A Colorado Springs man who broke into a Longmont home in May and fought with police officers after his arrest was sentenced in Boulder District Court on Friday to two years and two months in state...", "filename": "_02438ed2426d46a38fa6ef1a962388a4_1588622909.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_02438ed2426d46a38fa6ef1a962388a4_1588622909.html", "title": "Man Who Broke into Longmont Home Sentenced in Boulder District Court", "title_page": "Man Who Broke into Longmont Home Sentenced in Boulder District Court", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Colorado Springs man who broke into a Longmont home in May and fought with police officers after his arrest was sentenced in Boulder District Court on Friday to two years and two months in state prison.\nRyan Lockwood, 32, appeared in custody and pleaded guilty to one count of felony assault and one count of felony trespassing. Prosecutors dropped first-degree burglary, felony menacing, two counts of second-degree assault on a peace officer, obstructing a peace officer, resisting arrest, attempting to disarm a peace officer and trespassing charges.\nLockwood also pleaded guilty to a single count of felony menacing in an unrelated case during which he pulled a gun on a motorist who refused to give him a ride.\nBoulder District Judge Andrew Hartman sentenced Lockwood to two years and two months with the Colorado Department of Corrections.\nAccording to an affidavit, Longmont police on May 23 found Lockwood fleeing a home in the 1300 block of Parker Drive. The resident told police she woke up to Lockwood standing in her hallway with a handgun in his waistband. While she and her daughters hid in the basement, her husband confronted Lockwood until he ran out of the house.\nWhen police arrested Lockwood, they discovered he had a loaded .380-caliber handgun, as well as a bag of cheese and packs of Gogurt yogurt, according to the affidavit. Lockwood told police he thought the house was empty and used a garage door opener he found in an unlocked vehicle to get inside because he was hungry.\nWhile in a holding cell, Lockwood reportedly got into a fight with two officers before they used a stun gun on him.\nThe homeowner spoke in court on Friday, and said that she didn’t believe Lockwood was being property punished for his crime. Lockwood apologized for his actions during a brief statement.\nJohn Bear: 303-473-1355, bearj@dailycamera.com or twitter.com/johnbearwithme", "url": "https://apnews.com/02438ed2426d46a38fa6ef1a962388a4"}