{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Luke Savage", "Shawn Gude", "Neal Meyer"], "date_download": "2020-05-04 19:50:07", "date_modify": "2020-05-04 19:50:07", "date_publish": "2019-06-12 00:00:00", "description": null, "filename": "2019_06_bernie-sanders-democratic-socialism-speech-fdr_1588621807.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/06/12145607/rsz_bern.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_06_bernie-sanders-democratic-socialism-speech-fdr_1588621807.html", "title": "Bernie Has Opened the Door for Democratic Socialism", "title_page": "Bernie Has Opened the Door for Democratic Socialism", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Last month, left-wing economist Joseph Stiglitz warned that the term “democratic socialism” poses too great an electoral risk to justify its embrace. He urged leaders like Bernie Sanders and Alexandria Ocasio-Cortez to adopt softer vocabulary instead, suggesting that “progressive capitalism” might do the trick.\nWhile Elizabeth Warren prefers the Stiglitz approach, naming a recent piece of progressive legislation the Accountable Capitalism Act, Bernie Sanders isn’t content to project the message that capitalism can deliver the transformative change that working people need and deserve. Instead, he’s doubling down on democratic socialism. On Wednesday afternoon, Sanders gave a speech seeking to define the term for a new era. “Economic rights are human rights,” he said. “This is what I mean by democratic socialism.”\nSanders defined basic economic rights as “the right to quality health care, the right to as much education as one needs to succeed in our society, the right to a good job that pays a living wage, the right to affordable housing, the right to a secure retirement, and the right to live in a clean environment.” He called these demands a “Twenty-First-Century Economic Bill of Rights.”\nSanders then argued that the provision of these basic rights can’t be left up to capitalist markets. “Today we now see a handful of billionaires with unprecedented wealth and power,” he said. “We see huge private monopolies operating outside of any real democratic oversight, and often subsidized by taxpayers, with the power to control almost every aspect of our lives. They are the profit-taking gatekeepers of our health care, our technology, our finance system, our food supply, and almost all of the other basic necessities of life.”\nCorporate gatekeepers, motivated by private profit instead of public well-being, will never meet the needs of all working people. To guarantee an Economic Bill of Rights, essential functions will need to be guaranteed by the state and publicly provisioned. This is the impetus behind his proposals for Medicare for All, tuition-free college, and many more policy proposals he assured the audience are yet to come.\nAt the heart of Sanders’s vision of democratic socialism is his insistence that the US needs a movement explicitly dedicated to advancing working people’s interests — even when the capitalists don’t like it, and even when they push back with all their might, knowing full well that they will. This is a class-struggle message: the working class can only secure gains for itself by directly contravening the wishes of the capitalist class.\n“Let me be absolutely clear,” he said. “Democratic socialism to me requires achieving political and economic freedom in every community. And let me also be clear, the only way we achieve these goals is through a political revolution — where millions of people get involved in the political process and reclaim our democracy by having the courage to take on the powerful corporate interests whose greed is destroying the social and economic fabric of our country.”\nHe added, “At the end of the day, the one percent may have enormous wealth and power, but they are just the one percent. When the 99 percent stand together, we can transform society. My friends, these are my values, and that is why I call myself a democratic socialist.”\nLately Sanders has been using a new slogan: No Middle Ground. To beat the Right and progress toward a society free of exploitation, oppression, poverty, and war, the Left must abandon a middle-ground politics that imagines a path to victory paved with concessions. Now is not the time to rely on a “bipartisan marketplace of ideas,” as Speaker of the House Nancy Pelosi pledged last year. Now is the time to present a clear political vision in stark contrast to the Right. They stand for bigotry, division, and the economic rights of the wealthy minority; we stand for equality, working-class unity, and the economic rights of the vast majority.\nThe Democratic Party establishment has long stubbornly occupied the middle ground, particularly on economic matters. In 1994, as Secretary of the Treasury Robert Rubin recalled it, Hillary Clinton insisted that the Democratic Party needed to steer clear of “language tinged with class resentment” and “class conflict” — exactly the kind of advice Sanders is now famous for rejecting. Rubin, who came to his cabinet position from Goldman Sachs and graduated to join Citigroup, naturally agreed with Clinton. This has been the Democrats’ playbook for decades: downplaying class conflict in theory and cozying up to capitalists in practice.\nIn another recent speech, Sanders spoke out against Democratic Party candidates, like Joe Biden, “who believe that the best way forward is a middle-ground strategy that antagonizes no one, that stands up to nobody, and that changes nothing.” If his middle-ground rhetoric articulates what Sanders does not want, his speech on Wednesday about democratic socialism articulates what he does want: a politics that confronts the rich and powerful in order to consolidate a diverse coalition of working people who are tired of upward wealth redistribution, stagnating wages, skyrocketing living costs, and financial insecurity.\nFor those of us who are already socialists, Sanders’s speech sounded a few jarring notes. It’s best to see these as strategic interventions on Sanders’s part, in light of socialism’s relative obscurity, its past political toxicity, and the generally low level of class consciousness in the United States. Sanders’s objective is to acclimate Americans to the idea of democratic socialism, after decades of stigmatization and marginalization of socialist politics. His message isn’t intended for the converted: it’s an appeal to the millions who want a better life, but are understandably skittish about a concept still tainted with Cold War implications of authoritarianism, deprivation, and dreary homogeneity.\nFor example, Sanders talked about what he called “corporate socialism,” or state protection and subsidies for the wealthy. His comments echoed Martin Luther King Jr’s declaration that the US has “socialism for the rich, rugged individualism for the poor.” In reality, upward redistribution of wealth facilitated by the state is not socialism at all — it’s a hallmark of neoliberal capitalism. Socialism doesn’t describe whenever the government intervenes in the economy. It refers to intentional intervention on behalf of the working class, with the aim of eroding capitalist class power and eventually eliminating capitalism altogether.\nIt’s potentially risky to muddy the definition of socialism this way. But Sanders, like King before him, is attempting to upend the mainstream political narrative. He’s spotlighting the hypocrisy of those who claim to object to public assistance on principle, but who actually only reject it for ordinary working people while embracing it in the form of bailouts and tax cuts for capitalists. This intervention is useful to socialists as we attempt to debunk capitalists’ claims that they want a neutral, free market “level playing field,” when their true desire is to opportunistically leverage the state to maximize private profits.\nSanders also said that “we must take up the unfinished business of the New Deal and carry it to completion.” Again, this risks collapsing definitions. The New Deal is an example not of socialism, but of a major step taken toward social democracy, where labor unions are strong and social insurance programs are robust and universal. Sanders wants to get ordinary working people comfortable with socialism again, and to do this he is reminding them of America’s homegrown social-democratic tradition, whose enduring popularity is a testament to its real value to the working class. Crucially, he makes it clear that the political aims that broadly animated the New Deal — the pursuit of greater wealth, freedom, and security for working people — remain unfinished.\nSocial democracy is a massive improvement over US-style neoliberal capitalism, and we should strive to implement ambitious social-democratic reforms in order to alleviate suffering and empower workers to fight for more. But it’s the responsibility of socialists on the ground to clarify that even a strong social democracy is not the horizon of our ambitions. If our society is successful in reversing the worst trends of neoliberalism, we will at some point need to face the fact that social democracy is itself a kind of middle ground, and an unstable system built on tenuous compromises that must eventually be transcended.\nIn order to move beyond social democracy into a true socialist society, we will need a mass working-class socialist movement that believes firmly in the economic rights of the working-class majority, and knows they can only be secured by confronting the wealthy few. We’re currently a long way off from realizing that kind of movement. The task now is to lay the groundwork for its emergence.\nSanders speaks eloquently of justice, equality, security, and shared prosperity, and he refuses to suggest these can be attained without open, mass class struggle. His insistence on calling this political vision “democratic socialism,” instead of “progressive capitalism” or some variant, generates an electrifying array of new possibilities and gives socialists plenty to work with.\nThe success of Sanders’s strategy to popularize socialism and ignite a mass workers’ movement is not up to him alone. As he frequently insists, it’s ultimately up to us. People who are already politicized against capitalism must reach out to those who are inspired by Sanders’s vision of a fairer society and bring them into conscious struggle against capitalist power in their workplaces, at the ballot box, and in the streets.\nThanks in large part to Bernie Sanders, we have an opportunity to do that now that we haven’t seen in a century. That opportunity is ours to squander or to seize.", "url": "https://jacobinmag.com/2019/06/bernie-sanders-democratic-socialism-speech-fdr"}