{"authors": ["The New Mexican"], "date_download": "2020-05-04 20:07:10", "date_modify": "2020-05-04 20:07:10", "date_publish": "2019-02-09 02:22:00", "description": "Days remaining in session: 35 Jury duty: Courts hear all kinds of excuses for skipping jury duty. But some New Mexicans might be able to save those excuses.", "filename": "_c00eaee214ca4694b26c5377a17eb098_1588622830.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c00eaee214ca4694b26c5377a17eb098_1588622830.html", "title": "Legislative roundup, Feb. 9, 2019", "title_page": "Legislative roundup, Feb. 9, 2019", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Days remaining in session: 35\nJury duty: Courts hear all kinds of excuses for skipping jury duty.\nBut some New Mexicans might be able to save those excuses.\nThe Senate voted Friday to make it easier for residents over the age of 75 to get out of jury service.\nCurrent law allows citizens summoned for jury duty to be excused based on age if they turn in a notarized affidavit proving they are over 75.\nUnder Senate Bill 174, sponsored by Sen. Richard Martinez, D-Española, courts could verify age using other state systems.\nMartinez said that will save seniors what can often be a long drive in rural areas to the courthouse.\nThe bill heads next to the state House of Representatives.\nKeeping dreams: U.S. House Minority Whip Jim Clyburn, D-S.C., addressed a joint session of the New Mexico House of Representatives and Senate to mark African American Day at the Roundhouse on Friday.\nThe 78-year-old recalled as a child telling his mother and a friend of hers that he wanted to grow up to work in state or federal government. Though his mother’s friend discouraged him, suggesting a young African-American would never have a chance at such a job, his mother later said, “Son, you hold onto your dreams. You stay in school, you study, you play by the rules and you will grow up to fulfill your dreams.”\nThe lesson, Clyburn told the assembly, is “don’t throw coal on anybody’s dreams.”\nThe afternoon celebration included a rendition of “Amazing Grace” sung by Rep. Sheryl Williams Stapleton, D-Albuquerque, and Sen. Craig Brandt, R-Rio Rancho.\nBackground checks: The state House of Representatives voted 41-25 to approve House Bill 8, which would expand the state’s background check requirements to “keep firearms out of the hands of people who are prohibited from having them,” said Rep. Debra M. Sariñana, D-Albuquerque.\nThe bill includes some exemptions, she said, such as law enforcement officers selling firearms or people who inherit or receive a gun as a gift.\nHouse Republicans opposing the bill say it would not stem the sale of illegal weapons and would infringe on gun owners’ Second Amendment rights. They also say the time and effort would be better spent trying to address behavioral and mental health problems.\nThe vote came only after a contentious go-round between House Speaker Brian Egolf, D-Santa Fe, and Republicans who were unhappy when he called for the vote about a half-hour before the three-hour deadline to cut off debate. Egolf said he did so after Rep. David Gallegos, R-Eunice, could not be located following a “call for the House,” which requires all members to return to their seats on the House floor for debate and a vote.\nSecond time around: Adults who did not graduate high school but still want earn a diploma rather than a GED degree might have a better chance under a bill that received unanimous support from the Senate Education Committee.\nSB 391, introduced by Sen. Craig Brandt, R-Rio Rancho, tasks the Public Education Department and the Higher Education Department with finding a way to give an adult who doesn’t have a diploma a chance to pay for classes, possibly at a college, to earn that diploma.\nThe bill next goes to the Senate Finance Committee.\nFingerprint requirement: The Senate Public Affairs Committee voted unanimously to advance a bill making it easier to obtain a non-Real ID driver’s license and identification card.\nSB 278, sponsored by Sens. Jerry Ortiz y Pino and Daniel Ivey-Soto, both Democrats from Albuquerque, would eliminate the fingerprint process for first-time applicants. It would also change the name of the Driving Authorization Card to “New Mexico Driver’s License,” among other measures.\n“Eliminating the fingerprinting requirement would be a lifeline for people experiencing homelessness,” said Hank Hughes, executive director of New Mexico Coalition to End Homelessness. “A New Mexico resident is required to pay $45 for fingerprinting; for someone experiencing homelessness, that is the same cost as one night of shelter. Many of our members have had to use our limited donations to cover the fingerprinting requirement fee for those we serve. This change will go a long way.”\nQuotes of the day:\n“It’s not helpful to hear from people who answer to the nominee.” — Ivey-Soto, during a confirmation hearing in which subordinates praised Alice Liu McCoy, the governor’s choice to lead the Aging and Long-Term Services Department. The Senate later confirmed McCoy on a 34-0 vote.\n“The saying goes that if you complain long enough about something, you’ll get the job.” — McCoy on becoming a Cabinet secretary after suing the state as an attorney for Disability Rights New Mexico.", "url": "https://apnews.com/c00eaee214ca4694b26c5377a17eb098"}