{"authors": ["Katie Lannan", "State House News Service"], "date_download": "2020-05-04 20:22:32", "date_modify": "2020-05-04 20:22:32", "date_publish": "2019-04-01 17:18:01", "description": "BOSTON -- House Speaker Robert DeLeo acknowledged over the weekend that a recent investigation into the conduct of one House Democrat showed how some representatives \"may be unhappy with me,\" but...", "filename": "_eaf84d3f191e4b4995f947f55e2b3483_1588623752.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_eaf84d3f191e4b4995f947f55e2b3483_1588623752.html", "title": "Some Reps \"may Be Unhappy with Me,\" DeLeo Said", "title_page": "Some Reps \"may Be Unhappy with Me,\" DeLeo Said", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BOSTON -- House Speaker Robert DeLeo acknowledged over the weekend that a recent investigation into the conduct of one House Democrat showed how some representatives “may be unhappy with me,” but said he still feels strongly supported by Democrats who overwhelmingly re-elected him to a sixth term as speaker in January.\n“I’ve had great support from the membership, not only in terms of their strong votes to keep me as speaker but their visits to my office,” DeLeo told WBZ-TV’s Jon Keller on a Sunday morning broadcast. “Although they may not agree with me on every particular issue, I think they really like the way I lead the House. I feel they feel it’s an inclusive process, I feel they feel it’s a fair process, and I think they also feel it’s probably something that the folks in other states, and especially Washington, can learn a little bit in terms of how we get things done.”\nDeLeo, a Winthrop Democrat who last year became the longest continously serving speaker under the state constitution, also said he is not contemplating retirement.\nKeller asked DeLeo about a March investigatory report that did not find sufficient evidence to prove allegations that Rep. Paul McMurtry had inappropriately touched a female representative. Keller pointed specifically to a column by Peter Lucas in The Sun of Lowell that suggested the allegations were put forward by lawmakers who dislike DeLeo and wanted to embarrass him.\nDeLeo said he did not know “exactly what the intent was” of those who first brought the allegations to his office, but said the House has an “extremely exhaustive process” for investigating claims of harassment.\nA special committee appointed by DeLeo and Minority Leader Brad Jones to examine the allegations made public a summary of its comprehensive written report. The summary said that there was “insufficient evidence” against McMurtry and that the alleged victim would not participate in the investigation.\n“Having gone through the process and thoroughly gone through the process, the committee found because of any lack of evidence or anyone stepping forward to collaborate the story, that Chairman McMurtry was vindicated,” DeLeo said.\nKeller pressed DeLeo on the topic, asking him if he felt under attack.\n“I think there are certain representatives, maybe, who for whatever reason, may be unhappy with me,” the speaker said. “But having said that, I think that the overwhelming support which I have received from the body is very gratifying to me, so I feel very secure in terms of my relationship with the House. It’s like any position. Whether you’re Nancy Pelosi in Washington or Bob DeLeo here in Massachusetts, there are always folks who feel like you could do something better or in a different fashion, and I’m OK with that. If someone feels like they have a better idea then I’m going to, I’ll listen to them, and we’ll take it from there.”\nDemocrats hold a supermajority of 127 of the 160 seats in the Massachusetts House, with 32 Republicans and one unenrolled lawmaker.\nOn Jan. 2, 119 Democrats voted to reelect DeLeo as speaker, while eight -- Reps. Nika Elugardo, Tami Gouveia, who represents Chelmsford and several other Greater Lowell area communities, Jonathan Hecht, Russell Holmes, Patrick Kearney, Maria Robinson, John Rogers and Angelo Scaccia -- voted present.", "url": "https://apnews.com/eaf84d3f191e4b4995f947f55e2b3483"}