{"authors": ["Ben Tarnoff", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Alex Doherty", "Josh Gabert-Doyon", "Solomon Hughes", "Ronan Burtenshaw"], "date_download": "2020-05-04 19:55:05", "date_modify": "2020-05-04 19:55:05", "date_publish": "2019-11-21 00:00:00", "description": null, "filename": "2019_11_labour-broadband-full-fiber-fibre-corbyn_1588622105.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/11/21125533/spinning-globe_smart-city_iot_skyscrapers_city-scape_internet_digital-transformation-100777501-large.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_11_labour-broadband-full-fiber-fibre-corbyn_1588622105.html", "title": "Internet for the Many", "title_page": "Internet for the Many", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "What would a socialist internet look like? It’s a complicated question, because the internet is a complicated thing. But one part of the answer has just arrived in the form of a newly announced proposal from the Labour Party to provide free full-fiber broadband to all households and businesses by 2030. The plan is to start with the least-connected areas first, before rolling out the service to the rest of the country. The initiative would be led by a new public entity called British Broadband, which will both own the network and deliver the service.\nIt’s an ambitious proposal, and one that would go a long way toward creating a more just society. In his final book, the late sociologist Erik Olin Wright wrote that a just society would be one in which everyone “has broadly equal access to the material and social means necessary to live a flourishing life.” As Wright points out, the preconditions of human flourishing can vary by time and place. But there is no doubt that today, a fast and reliable internet connection is one of them.\nGetting online is often a necessity for survival, much less flourishing: you need the internet to get a job, to find a place to live, to access government services. You also need it to participate fully in social, civic, and cultural life. Remote and rural communities are especially dependent on the internet for contact with the wider world, as are the elderly or those with disabilities that keep them indoors. Free high-quality broadband for all, then, is an egalitarian notion. It flows from the recognition that the internet is an indispensable infrastructure of modern life, and one that must be made universally available if everyone is expected to enjoy some minimum degree of dignity and self-determination.\nIt also embodies the basic socialist insight that the best way to make something universally available is to free it from the market. Markets don’t give you what you need — they give you what you can afford. And firms that produce for the market don’t allocate resources based on what maximizes survival and flourishing, but what maximizes profit. This is why leaving the provision of necessities to the private sector results in vastly unequal, and often grotesquely immoral, outcomes. The human costs of capitalist rationing are abundantly evident in the case of health care and housing. But they are also clear when it comes to broadband.\nIn a private system, poor and rural people struggle to secure decent internet access. Even when they can afford the monthly fee, they often endure low speeds and spotty service because they live in places that aren’t profitable for internet service providers to invest in. Firms can make more money elsewhere. Thus, large segments of society are denied the possibility of full and equal membership, for the simple reason that the profit motive will not accommodate it.\nBut it’s not just the poor and the rural who suffer. According to a recent study by the domain-name registry Nominet, 79 percent of UK adults report experiencing unreliable internet service in the last year. Fewer than half say they can work from home without difficulties using their connection. And 66 percent want the industry to focus on delivering consistent coverage across the country instead of pouring money into privileged hot spots with higher speeds.\nThe frustrations of a private system are broadly felt, it seems, even if some communities feel them more acutely than others. The Labour plan presents a solution: make high-quality broadband a right rather than a commodity, and bring the ownership of the network under public control. Public providers like the proposed British Broadband can do a wide range of things that their private counterparts can’t. They can supply better service at lower cost because they don’t have investors to enrich. They can borrow money more cheaply and shoulder risk more easily. And they can prioritize considerations other than profit, such as connecting remote or underserved regions.\nHow would a Labour government pay for the project? The rollout of the network would be financed through Labour’s recently announced Green Transformation Fund, while the maintenance costs would be covered through a tax on multinational corporations, including large tech firms like Google. Such firms are creatures of public largesse: they have commodified technologies developed at great public expense such as the internet, and now they engage in extraordinary levels of tax avoidance to keep their profits from flowing back into public coffers. Many of them have also built lucrative business around siphoning data from an ever-growing share of our activities, online and off. Given their historical and continued parasitism on commons of one kind or another, it seems reasonable to compel them to contribute a portion of their wealth toward the construction of new commons.\nHopefully, this is a process that can go further than free public broadband. Labour has put forward a meaningful, even radical, reform, but it is only a first step. A socialist agenda for the internet will have to involve reckoning with the more perplexing precincts of our digital sphere. The real power lies further up the stack, with the so-called platforms. Here the situation is considerably more complex. Broadband is roughly analogous to gas or water: it’s a set of pipes, so the mechanics of running it as a public utility are relatively straightforward. This is much less true of the sprawling infrastructures owned by Google, Facebook, and others.\nFortunately, a growing number of people within the transatlantic left are thinking creatively about how we might de-commodify, democratize, and perhaps even dismantle the platform leviathans. Those in the orbit of Corbynism are producing particularly interesting work. Further scholarship will be needed. But free public broadband, if implemented successfully, will open up political space for a more thorough restructuring. Indeed, the precise contours of that restructuring may require a more radical moment before they can fully emerge. What is needed is not just new proposals but the growth of a popular power capable of extending, adapting, and implementing them. Only masses of people in motion can make a society that makes them free. This is the hypothesis on which the hope of socialism depends.", "url": "https://www.jacobinmag.com/2019/11/labour-broadband-full-fiber-fibre-corbyn"}