{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman"], "date_download": "2020-05-04 19:54:45", "date_modify": "2020-05-04 19:54:45", "date_publish": "2019-08-26 00:00:00", "description": null, "filename": "2019_08_bernie-sanders-elizabeth-warren-democratic-party-elite-2020-presidential-race_1588622085.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/08/26155559/GettyImages-1165226776.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_08_bernie-sanders-elizabeth-warren-democratic-party-elite-2020-presidential-race_1588622085.html", "title": "Bernie Sanders and Elizabeth Warren Aren’t Playing the Same Game", "title_page": "Bernie Sanders and Elizabeth Warren Aren’t Playing the Same Game", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Last week, the Hill ran an article titled “Polls suggest Sanders may be underestimated,” observing that Bernie Sanders “is firmly entrenched in the race’s top tier of candidates” along with Joe Biden and Elizabeth Warren. This isn’t actually news — polls showed Bernie in first place before Biden announced, and he’s been runner-up in most polls since. What’s news is that Elizabeth Warren has joined the top tier. A Monmouth poll released today actually shows Warren and Sanders tied for the lead, followed closely by Biden.\nBiden’s increased exposure has left him vulnerable to popular discovery that he’s mentally muddled at best — an impression so widespread that it prompted him to plead, “I’m not going nuts.” Meanwhile, Warren and Sanders both continue to rise. It’s starting to look like these three may soon be locked in a dead heat.\nThe differences between Sanders and Warren on the one hand and Biden on the other are obvious. Biden has no idea what he wants the country to look like or why he’s running for president. Warren and Sanders do. But the differences between Warren and Sanders continue to confuse many in the mainstream media, who repeatedly assert or imply that they’re ideologically identical.\nThey aren’t. Sanders calls himself a democratic socialist and Warren calls herself a “capitalist to my bones.” These aren’t just labels. They’re distinct approaches to the fundamental problems facing our society.\nA socialist tries to liberate the things people need to survive from the clutches of capitalist markets, which is why Sanders has taken the lead on Medicare for All, transforming it into the most popular working-class demand of the moment. A capitalist respects the superior wisdom of capitalist markets and tries to restore them to optimal functionality, which can help explain why Warren is so frustratingly noncommittal on Medicare for All. A socialist pursues decommodification through universal social programs that enshrine new social rights for all, which is why Sanders has proposed to eliminate every last penny of existing student debt. A capitalist of the liberal or progressive variety is seduced by means-testing, which is why Warren needlessly introduced eligibility requirements and caps into her student-debt forgiveness program.\nAverage Democratic primary voters may be clearer on these differences than the press is. Sanders’s support base is considerably more working class than Warren’s. The number-one employer of individuals who donate to him is Walmart, while the number-one profession of Sanders donors is teachers. Warren’s base primarily belongs to the professional-managerial class — she takes the highest share of college graduates of the top four candidates. Warren has the whitest base of the front-runners, while Sanders’s is the least white. To take Brooklyn as a microcosm, Elizabeth Warren dominates Park Slope, while Sanders dominates everything less upscale. (Interestingly, Sanders’s base is slightly more female than Warren’s, too.)\nMany pieces have been and remain to be written about the differences between Sanders and Warren. I wrote one a while back arguing that while Elizabeth Warren may have smart policy, Bernie Sanders has mass politics. Since then, Sanders has released multiple detailed plans — on education, criminal justice, labor, and climate change — rendering Warren’s slogan “She has a plan for that” less useful in distinguishing between the two. But another point I made, that Sanders is trying to build a mass working-class movement that can challenge the power of the capitalist class itself and Warren isn’t, remains as true as ever.\nOne more place to look for evidence of this distinction is in their relationship to the Democratic Party. An article appeared today in the New York Times headlined “What Elizabeth Warren Is Quietly Telling Democratic Insiders.” What she’s telling them is that they have nothing to fear. Sure, her ideas are to the left of standard Democratic Party fare, but she wants establishment Democrats to know that she intends to cause no major upset. She’s “seeking to lead the party — not stage a hostile takeover of it.”\nThis is Warren’s attempt to differentiate herself from Sanders, who is indeed trying to stage a hostile takeover — that is, he’s trying to engineer a situation in which ordinary working-class people take over the government from powerful corporations and their allies, what he calls a “political revolution.” This scares the devil out of the Democratic Party elite, whose entire operation is bankrolled and sustained by massive corporations. And it should.\nIn June, the centrist Third Way think tank, which is deeply embedded in the Democratic establishment, called Sanders “an existential threat to the future of the Democratic party.” Sanders didn’t respond with back-door meetings assuring people there was nothing to fear. Instead, he said in a public speech:\nI want to say a few words about an interesting event that was held in Charleston earlier his week, sponsored by a national organization called Third Way that represents the corporate wing of the Democratic party, a group that receives a substantial amount of their support from Wall Street. At this Third Way meeting I was called an existential threat to the Democratic Party. Now why am I an existential threat? Well, maybe it’s because my administration will finally take on the insurance companies and the drug companies and pass a Medicare for All single-payer program. Maybe it’s because we’re gonna break up the major banks on Wall Street and lower interests rates for consumers. Maybe it’s because we’re going to take on the fossil fuel industry and transform our energy system into sustainable energy. Maybe it’s because we will demand that the wealthy and large corporations start paying their fair share of taxes so that we can make public colleges and universities tuition free.\nAs is evident, Sanders embraces his villainization by the Democratic Party establishment. He takes it as an opportunity to polarize the Democratic Party, drawing a bright line between its working-class and mostly progressive base and its capitalist-aligned leadership. He’s trying to agitate working-class people against all capitalists and their friends, including those in the Democratic Party. This is because Sanders views the power to make transformative change as something that emanates from the working class itself, not from politicians claiming to act on their behalf — including him. That’s the essence of his competing slogan, “Not Me, Us.”\nThe Atlantic also published an article today, headlined “Elizabeth Warren Manages to Woo the Democratic Establishment.” In that article, Dan Fowler, a former DNC chair and “longtime Clinton-family loyalist” is quoted as saying that Warren “stretches across a broad spectrum of Democrats,” in large part because “she does not include in her presentation the implication of being against things, except the current president.”\nBernie Sanders is against a lot of things. He’s against health insurance and pharmaceutical profiteers. He’s against the military-industrial complex, and the prison-industrial complex. He’s against corporations that don’t pay their workers a living wage, that obstruct their employees from forming a union, and that plunder the earth for profit.\nAnd, yes, he’s against the stratum of the Democratic Party officialdom that carries water for capitalists at the expense of working people, whom it induces to vote for them solely on the basis that they aren’t as bad as Republicans, without offering a positive and engaging political vision of their own. He’s against people like Dan Fowler, who prefer a non-agitational politics that elides the fundamental real class conflict in society — and in the Democratic Party — in favor of platitudes about coming together to beat Trump.\nAs Warren and Sanders both encroach on Biden’s front-runner status, it will become increasingly important to tease out the differences between them. Their attitude toward the Democratic Party is a good place to start. Warren shares some of Sanders’s ideas about taking on the rich and redistributing wealth, but she seems perfectly happy to suture the relationship within the party itself between those who go to bat for the rich and those who are dealt the blow.\nSanders is not similarly content. As he said recently, “If there is going to be class warfare in this country, it’s about time the working class won that war.” Whoever’s standing in the way, no matter their party affiliation or prestige, will get caught in the cross fire.", "url": "https://jacobinmag.com/2019/08/bernie-sanders-elizabeth-warren-democratic-party-elite-2020-presidential-race"}