{"authors": ["Leigh Phillips", "Michal Rozworski", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Sam Gindin", "Annelise Orleck", "The Nostalgia Trap"], "date_download": "2020-05-04 19:56:09", "date_modify": "2020-05-04 19:56:09", "date_publish": "2019-03-21 00:00:00", "description": null, "filename": "2019_03_economic-planning-walmart-democracy-socialism_1588622169.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/03/21124257/GettyImages-964537030.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_03_economic-planning-walmart-democracy-socialism_1588622169.html", "title": "Yes, a Planned Economy Can Actually Work", "title_page": "Yes, a Planned Economy Can Actually Work", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The latest book in our Jacobin Books series with Verso, The People’s Republic of Walmart: How the World’s Biggest Corporations are Laying the Foundation for Socialism, is out now. In the following editorial, its two authors lay out a key argument in the book. All series titles are 40 percent off this week.\nA hundred years after the Russian Revolution, a specter is haunting the West — the specter of what the Economist newspaper recently christened millennial socialism.\nBut what exactly is meant by socialism this time around? Is it just a return of New Deal liberalism or Scandinavian social democracy? Is it public health care and strong unions? Is it a flowering of cooperatives — as Labour shadow chancellor John McDonnell wants?\nAnd above all, what is the role of the market versus economic planning in our alternative? This surely is where the workers’-council-manufactured rubber hits the state-built road?\nAs Friedrich Engels wrote, “the government doing stuff” is definitely not a good definition of socialism: “Certainly, if the taking over by the state of the tobacco industry is socialistic, then Napoleon and Metternich must be numbered among the founders of socialism.” Today that would make the statist leviathan known as the Pentagon practically full communism.\nLuckily, a new, more interesting conversation about the role of markets and economic planning is emerging, from an unexpected place.\nJack Ma, the founder of China’s Alibaba Group — one of the largest and most valuable companies in the world — argues that previous state planners in the Soviet Union and the early People’s Republic of China failed due to insufficient information. He has predicted that over the next three decades thanks to artificial intelligence and the sheer volume of data to which we now have access, we will finally be able to achieve a planned economy.\nMeanwhile, something interestingly “communist” is happening through the shift in recent years from active to passive investing. An investor who has holdings in one airline or telecom, for example, wants it to outperform the others: to increase its profits, even if only temporarily, at others’ expense. But an investor who owns a piece of every airline or telecom, as occurs in a passively managed index fund, has drastically different goals. Competition matters far less. Bloomberg columnist Matt Levine has imagined a slow transition from today’s index funds, which use simple investing strategies, through a future where investing algorithms become better and better, until “in the long run, financial markets will tend toward perfect knowledge, a sort of central planning—by the Best Capital Allocating Robot.”\nIn The People’s Republic of Walmart, we show how contrary to the historic argument of the likes of free market economists Ludwig Von Mises and Friedrich Hayek, economic planning of millions of products and services involving infinitudes of variables in supply chains and lots of non-price information is not just feasible, but works incredibly well.\nNow, Walmart is a terrible entity, home to many labor abuses and lots of downright dull and alienating work, but it’s an interesting case study in the feasibility of planning because of how it operates and just how big it is. Walmart, the largest company in the world, employs more workers than any other private firm; it is the world’s third-largest employer after the US Department of Defense and China’s People’s Liberation Army. If it were a country, its economy would be roughly the size of Switzerland.\nWalmart, of course, sells goods on the market. Under capitalism prices are still inputs into the planning process for corporations and states alike. In addition to prices, however, firms today have at their disposal exponentially increasing amounts of information that is directly about people’s preferences or the use of resources. Already, for example, we can minimize carbon emissions in transporting items alongside cost. There is a hard question about how we relate things to one another — cotton to steel or mind-numbing drudgery to art — but it is a poverty of imagination to think only markets can determine these multidimensional comparison questions rather than we ourselves, democratically.\nRegardless, Walmart engages in large-scale planning without the direct intermediation of markets at scales to make Hayek bristle. Internally, like nearly all firms large and small, it is a dictatorial planned economy: managers tell workers what to do, departments realize goals from on high, and goods flow by fiat.\nAfloat in the market, Walmart is at once an “island of conscious power,” as Keynes’s collaborator D. H. Robertson put it, and an “island of tyranny,” as the social theorist Noam Chomsky rephrased it. Capitalism obscures both the planning and the disciplinary nature of everything that goes on inside the corporation. The market may be free, but work is constant unfreedom. Today’s economy is already to a large degree planned rather than spontaneous — but it’s also home to widespread domination from which we have yet to free ourselves. Doing so will deeply transform how we plan and how we produce.\nWalmart’s planning extends beyond its four walls. Commerce scholars and operations research analysts attribute the success of Walmart’s logistical marvel to being among the first to adopt innovations such as continuous replacement; vendor-managed inventory; computerization; and trust, openness, cooperation, and transparency of information all along the supply chain.\nWalmart’s planned “firmification” of the supply chain stands in contrast to the disaster that is Sears. CEO Edward Lampert was such a fan of Ayn Rand that upon taking over, he introduced an internal market, with departments competing against each other, resulting in information secrecy, duplication, chaos, and ultimately bankruptcy. Unfortunately, rather than being recognized a failure, an “internal market” is periodically imported into the public sector and is currently contributing to the decline of England’s National Health Service.\nThe collapse of Sears however pales in comparison to more existential market failures elsewhere.\nThe world is running out of effective antibiotics because, as everyone from the Centers of Disease Control to the United Kingdom’s former chief medical officer have warned, pharmaceutical giants largely got out of the business of antimicrobial research some thirty years ago due to lack of profitability. A return to a Victorian-style era of medicine is bare decades away without this background of antimicrobial protection.\nAfter twenty years of climate diplomacy, oil firm BP last year reported that the non-fossil share of the energy mix is no different to what it was in 1998. In the face of climate change’s existential threat, we are standing still. This is because a market economy will continue to produce fossil fuels, even in the face of a hothouse earth, if left to its own devices.\nEnvironmental good news in most cases has come from non-market intervention. We have all but solved the challenge of ozone depletion thanks not to the market or giving up our fridges or hair spray, but thanks to regulation. Likewise we have regulation, as well as public sector infrastructure, and state shepherding of innovation—the allegedly inefficient sin of “picking winners”—for the success stories of elimination of acid rain and the 7 percent global increase in tree cover over the last thirty-five years.\nThis is why the Green New Deal, with its focus on robust public sector planning and action instead of market tweaks is so important. California’s emissions trading is less responsible for that state’s greenhouse gas reductions than its classic command-and-control regulations, and the largest single emissions reduction in North America came from the decision by fiat of the Ontario government to shutter all nineteen of its coal-fired generating units.\nThe lesson from all these failures and successes is that if something is profitable, no matter how harmful, it will continue to be produced in the absence of non-market intervention, i.e., planning. Likewise, if something is unprofitable, no matter how beneficial, it will not be produced, again in the absence of planning.\nPlanning on its own is not enough. It has to be truly democratic.\nAt the same time, the widespread suspicion of unaccountable bureaucracy and even arbitrary, authoritarian constraint on freedom is correct. Walmart may be a marvel of logistics but it is also one of many private fiefdoms within our market system. Planning on its own is not enough. It has to be truly democratic.\nWhat is common to the economic planners of Walmart and Amazon (or Foxconn and Daimler) is not just planning on vast scales, but a complete lack of democracy. More than half of Walmart’s part-time employees say they do not have enough money to meet their basic needs, with many of the union-busting firm’s staff depending on food-stamps to make ends meet. Amazon fulfillment-center workers pee in bottles out of fear of being fired for going to the bathroom, all the time tracked by wristbands issuing alerts of any milliseconds spent slacking off. On the hottest days of the year, Amazon had paramedics on hand outside the warehouse to treat heat-exhausted workers. Amazon CEO Jeff Bezos, that mustache-less, bald Stalin of online retail, oversees a panoptical, freedomless surveillance capitalism.\nWe need to use our vast productive resources to better ends — and through politics we can do just that. And as technology allows us to move to a discussion of what sort of planning instead of whether planning, true democratic control of planning both at the enterprise and government level must be the non-negotiable foundation of our vision.", "url": "https://www.jacobinmag.com/2019/03/economic-planning-walmart-democracy-socialism"}