{"authors": ["Dawn Foster", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Neil Davidson", "Rj Quinn"], "date_download": "2020-05-04 19:56:42", "date_modify": "2020-05-04 19:56:42", "date_publish": "2019-08-14 00:00:00", "description": null, "filename": "2019_08_uk-british-politics-united-kingdom-clever-man-labour-corbyn-conservative-party_1588622202.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/08/14131554/GettyImages-1160090646.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_08_uk-british-politics-united-kingdom-clever-man-labour-corbyn-conservative-party_1588622202.html", "title": "Enough with the “Clever Men” of British Politics", "title_page": "Enough with the “Clever Men” of British Politics", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Until recently, Dominic Cummings was mostly credited with having a key role in former education minister Michael Gove’s radically unpopular overhaul of the English education system, overseeing a move that sought to institute a system akin to charter schools in England that put the Conservative Party on a collision course with teachers and parents alike. Then, upon leaving government, he worked for the Vote Leave campaign in the European Union referendum, credited with coining the divisive but catchy slogan “Take Back Control.”\nNow he has been appointed a special adviser to Prime Minister Boris Johnson, an appointment that provoked alarm among many in Westminster, given Cummings’s tendency to adopt kamikaze strategies that may attain the proposed ends but cause chaos along the way. Cummings also has a reputation among Westminster insiders as a ferocious intellect. In his time outside of government, aside from working on the Vote Leave campaign, he had a tendency to fire off blog posts of an interminable length, unfettered by any editor and favoring sheer volume over perspicacity. Whenever Cummings is brought up in passing conversations in Westminster, the length of his blogs has been mentioned as proof of a restless intellect, but people similarly boast of never having finished reading any of his posts: to pass as smarter than your peers, overshoot your word count and do away with editors, and you could easily fool a good number of people.\nCummings isn’t stupid, but the terms in which he and others are spoken of belies a deeper problem in British politics: our idea of what counts as qualification in politics is purely informal, given that no formal qualifications exist. Civil servants have strict entry requirements, post-college exams, and assessment centers before they reach entry-level jobs. To become a member of Parliament, you need to win selection through your chosen party, then convince enough of your constituents to vote for you. To be a special adviser, you need to be trusted enough by your employer and share their ideological mindset. So you’re left with a clutch of MPs and their advisers tasked with cobbling together a coherent political roadmap with little but their own loosely defined historic ideology and willful self-belief to go on.\nThat self-belief is key, and it’s fed by a particular sickness of the English psyche: the belief in the strength of certain individuals’ robust intellectualism and the need to be led by one’s academic betters. Often this dovetails with class: on the more cartoonish end of the scale, the lure of Boris Johnson and Jacob Rees-Mogg is simply down to their vaudevillian performance of the bargain-bucket remnants of the colonial gent — endlessly obfuscating with Latin quotes where an actual answer to a question posed might do. They appeal to an airbrushed image of the past and an insistence that the post-Brexit future will be full of riches because that is the state of their offshore bank accounts, which will happily cushion them from any financial fallout that a sudden exit from the EU may instigate.\nBut there are others too. Cummings, for one; Tory MP David Willetts (regularly termed “two brains”); Jon Cruddas, one of the architects of “Blue Labour” (the attempted melding of Conservative social values and a decentralized Labour economic system); Andrew Adonis, a former Labour minister, now Lord. A litany of men with much-vaunted intellectual ability, according to their cheerleaders, but who nevertheless fail to match their promise, returning quietly to the backbenches or fading back into the shadows. The hallmarks — an Oxbridge education, often a fellowship at Harvard — are scarcely a rarity in Westminster, among neither those elected, those working for them, or those reporting on them, but as a result, those whose route to the same position diverged even slightly are treated with suspicion.\nOne of the criticisms leveled regularly at Jeremy Corbyn is that he is “thick”: his grades at school were lackluster, and he didn’t complete a college degree. Those leveling the charge seem unconcerned by the open snobbery such attacks evince, but it also speaks by extension to their open contempt for the vast majority of the public in the United Kingdom. It was this forelock-tugging superciliousness that led to the surreal campaign to force Corbyn to admit to not having read Ulysses , and to challenge him to some form of Joycean rap battle. Exams are a fudged attempt to gauge the intelligence of students, to force them into fixed education streams. They capture a snapshot, and no teacher worth their salt will claim they fully measure how smart young people are; for many young people, besides, putting the work in and achieving high grades is scarcely worth it. Few outside a small cloistered community in Westminster continue to believe any exam they sat at school or college still matters, and yet they remain convinced these tests can prove someone unfit to rule the country.\nUsing a similar yardstick, how do you measure John McDonnell? His route through education was slightly different: he was raised Catholic, was training to be a priest, then chose not to return, because, as he told me, “One summer I discovered girls and socialism: and only one was compatible with Catholicism.” He studied at night school after work, earning a bachelor’s degree in government and politics, followed by a postgraduate degree in politics and sociology, then became a trade union official.\nTracing the social and educational backgrounds of MPs from 1979 to the 2017 intake, the number of MPs employed in business or white-collar jobs (including political organizing) immediately prior to election has risen the most, while manual backgrounds fell from nearly 16 percent to 3 percent (with seven former miners still in Parliament). Four out of five MPs are graduates, and one in four went to Oxford or Cambridge. Across the UK, 7 percent of people went to private schools, but 44 percent of Conservative MPs did — the number in Labour is far lower, at 13 percent, but still slightly higher than average.\nOur MPs, then, are generally from a very different social background than the general public, and their employment history shows an increasing disjuncture between their constituents and themselves. There are fewer MPs from manual backgrounds or who have spent long stretches in low pay, but more from business, and more who’ve worked in politics: more than twice as many Labour MPs were councillors or worked in politics or policy than were trade union officials prior to election.\nFetishizing a very particular type of knowledge or intelligence leads to bad policy, relying as it does on individuals rather than democratic, collective policy-making. It also makes clear the contempt much of the media and political class feel for anyone who doesn’t meet a very niche and rarefied set of academic criteria. Having people from many different occupational backgrounds involved in policy-making around issues that affect their lives is not just respectful, it makes an immense amount of sense: lived experience of an industry, region, or the economic realities of your environment is key to understanding and improving the lives of people who share that environment.\nBut being in thrall to “the clever man,” with his towering intellect, means these individuals are subject to much less scrutiny: their ideas are subconsciously assumed to be correct rather than ideologically driven, accepted as having been somehow created on a higher plane. Cummings’s tenure in the department for education was a mess that turned teachers and parents alike against the Conservative Party, yet it barely dented his reputation. Yet when Labour suggests relatively tame policies that have been executed with success elsewhere, they are shot down, and journalists describe Corbyn as a very “stupid” man, banging on endlessly about the fact that he didn’t finish university and didn’t go to Oxford or Cambridge.\nThe mess the UK finds itself mired in currently is precisely down to many of these “clever men”: without moving on from this infatuation, riven with class snobbery, the political chaos that has logjammed Parliament will continue. Policy made with the input of many people, from many different backgrounds, is worth far more than the wonkish output of another Oxford graduate.", "url": "https://www.jacobinmag.com/2019/08/uk-british-politics-united-kingdom-clever-man-labour-corbyn-conservative-party"}