{"authors": ["Jim Kiest"], "date_download": "2020-05-04 20:21:31", "date_modify": "2020-05-04 20:21:31", "date_publish": "2019-04-17 18:59:13", "description": "It’s on Fiesta, San Antonio’s sprawling 11-day celebration of revelry, royalty, freedom and fun kicks off Thursday with Fiesta Fiesta. Since it’s also Holy Week, the schedule won’t be...", "filename": "_07b8374cc30a4a90912f5364041956bf_1588623691.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_07b8374cc30a4a90912f5364041956bf_1588623691.html", "title": "Don't miss these highlights of Fiesta's 1st week", "title_page": "Don't miss these highlights of Fiesta's 1st week", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It’s on\nFiesta, San Antonio’s sprawling 11-day celebration of revelry, royalty, freedom and fun kicks off Thursday with Fiesta Fiesta.\nSince it’s also Holy Week, the schedule won’t be as packed as usual. Several traditional first-weekend events happened early.\nStill, there’s more than enough food, music and pageantry to keep the most fervent Fiestaphile busy.\nHere are some of the highlights of the week ahead. You can find a full Fiesta schedule here.\nFiesta Fiesta\nFiesta officially begins here with the clink of medals and the crack of cascarones. This year’s Fiesta Fiesta kickoff event promises more room to roam and enjoy a wider array of attractions. Highlights include a performance by Tejano great Ruben Ramos, artists at work in Hemisfair Gardens, the popular Pin Pandemonium and an appearance by the Dallas Cowboys Hall of Fame Truck. The Taste of the Republic, a ticketed event, will feature fare by more than a dozen chefs.\n3-9 p.m. Thursday, Hemisfair, 434 S. Alamo St. Free. (Taste of the Republic $75 in advance). fiestasanantonio.org\nFiesta Arts Fair\nMore than 100 artists and artisans will exhibit drawings, ceramics, prints, sculpture, jewelry, metalwork and more during this two-day juried event, which also includes plenty of food, children’s art activities and live music in the idyllic setting of the Southwest School of Art. What else could you possibly want from a Fiesta event? On the music front, a couple of sharp Austin acts, soul singer Aaron Stephens and Mike Barfield, the Tyrant of Texas Funk, will join hometown favorites like Two Tons of Steel, Volcán and Rachel Laven.\n10 a.m.-6 p.m. Saturday and 11 a.m.-5 p.m. Sunday, Southwest School of Art, 300 Augusta. $5-$15 at the gate; free for children younger than 5. swschool.org\nDeco Fiesta\nFormer “American Idol” contestant Ada Vox, guitarist Ruben V and country singer Allan Hendrickson are among the musicians scheduled to play the Deco District’s street party, which promises more attractions and longer hours this year. In addition to traditional festival attractions such as food and drink vendors and arts and crafts booths, the Deco Fiesta will celebrate Easter with hourly egg hunts and a visit from the Easter Bunny. Presented by Network for Young Artists, a nonprofit that promotes art and culture.\nNoon-11 p.m. Saturday. Deco District, 1800 Fredericksburg Road. Free. decofiesta.org\nThe Texas Cavaliers River Parade\nMore than 250,000 spectators line the San Antonio River Walk each year for the floating extravaganza that is the Texas Cavaliers River Parade. More than 50 elaborately decorated floats sponsored by local community organizations and military installations will carry bands, dancers and local celebrities down the river. Put on by the Texas Cavaliers, a group of 600 business, civic and community leaders, the parade raises funds for San Antonio children’s charities. Pro Rodeo Hall of Fame bullfighter Leon Coffee is the grand marshal for this year’s parade, which is themed “It’s Showtime in San Antonio.”\n7-9 p.m. Monday. San Antonio River, River Walk. Reserved seats $14-$28. texascavaliers.org\nFiesta Cornyation\nMindy Miller Hill reigns as King Anchovy LIV during Cornyation, traditionally one of Fiesta’s toughest tickets. The spoof of the Coronation of the Queen of the Order of the Alamo, which dates back to 1951, doubles as a ribald roast of politics local and national as well as current events. “Cornyation democratized Fiesta,” Amy Stone, the author of a history of the event, told the Express-News in 2017.\n7 and 10 p.m. Tuesday-Thursday, Charline McCombs Empire Theatre, 226 N. St. Mary’s St. $15-$45 via ticketmaster.com. fiestacornyation.com\nA Night in Old San Antonio\nFormally, the 71-year-old A Night in Old San Antonio is a San Antonio Conservation Society fundraiser benefiting historic preservation. Less formally, it’s NIOSA, for thousands the signature event of Fiesta, a tour of the cultures, food and music that make San Antonio the unique city it is. Perhaps beer cups don’t gets stacked as high as they once did in these more health and safety-conscious times, but the narrow streets of La Villita still will be packed with revelers hoping the flow of foot traffic leads them to Maria’s tortillas, anticuchos or at least a shypoke egg.\n5:30-10:30 p.m. Tuesday through April 26. La Villita. $15; younger than 12 free. niosa.org\nStaff writer Deborah Martin and Express-News archives contributed to this report.", "url": "https://apnews.com/07b8374cc30a4a90912f5364041956bf"}