{"authors": ["The Day Editorial Board"], "date_download": "2020-05-04 20:26:24", "date_modify": "2020-05-04 20:26:24", "date_publish": "2019-05-03 05:00:01", "description": "Let's hear it for municipal decision making that calls on the common sense of the citizens who will have to live with the results. If Connecticut is going to continue to cope with the...", "filename": "_c28a6e4137e146f2881cf693cef6a883_1588623984.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c28a6e4137e146f2881cf693cef6a883_1588623984.html", "title": "Solid proposals for solid waste", "title_page": "Solid proposals for solid waste", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Let’s hear it for municipal decision making that calls on the common sense of the citizens who will have to live with the results. If Connecticut is going to continue to cope with the inefficiencies of home rule — having 169 town governments operating as stand-alone systems — then it ought to benefit from the advantages of hyperlocal governance as well.\nCitizen involvement generally widens perspective on an issue. Always, it opens up the discussion for increased public awareness before the die is cast. It is democracy at the grassroots.\nThe latest good example of this is New London’s Solid Waste Management Task Force. The City Council commissioned the group last summer to examine best practices for reducing solid waste and associated costs and for increasing public awareness about recycling. It doesn’t get any more grassroots than garbage collection.\nThe task force recently gave the council its recommendations for practical measures and, most importantly, equitable sharing of the costs.\nIdeas include adding a wheeled, 96-gallon recycling cart to the same size trash cart already in use at homes and businesses. Like last year’s unpopular Pay-As-You-Throw proposal, which inspired formation of the task force, the recommended plan would apply to all users. Trash removal would become a utility, like water and sewers, subject to a fee rather than a tax. Tax-exempt status does not apply to fees, so any establishment in the city that uses public waste collection would be included.\nFor residences, the only change under the plan would be going from a small recycling bin to the larger cart, at no additional cost. That’s appropriate and welcome. Any establishment, commercial or otherwise, that needs additional carts would pay a fee of 58 per ton. The annual cost has been about 5 per ton. Money spent on disposal is money spent to lose stuff no one wants. It’s better to earn, even modestly, than to spend money losing.\nPublic education work by the task force has encouraged more recycling, according to its chairman, Brian Doughty, and the committee is seeking more ways for residents to be part of the solution. Those include more convenient hours at the city transfer station. Students at the Science and Technology Magnet High School recently ran their own assessment of school-generated waste. Anything that puts recycling on people’s minds should help.\nThe recommendations next need approval from the council’s Finance, Public Works and Economic Development committees. Council President Don Venditto promised a public hearing before anything is enacted. The council should take a hard look at the financial impacts but bear in mind that a multi-year proposal such as this can be expected to cover more of its costs over time.\nMayor Michael Passero took a lot of heat for the original PAYT proposal, but his actions forced the conversation about the need for changes. The task force added what was missing — citizen participation and public education. The Day urges the council and the administration to find a way to move this issue forward, now that the city has tapped in to a common sense of what will work for New London.", "url": "https://apnews.com/c28a6e4137e146f2881cf693cef6a883"}