{"authors": [], "date_download": "2020-05-04 20:07:46", "date_modify": "2020-05-04 20:07:46", "date_publish": "2019-12-16 02:13:27", "description": "Today is Monday, Dec. 16, the 350th day of 2019. There are 15 days left in the year. Today's Highlight in History: On Dec. 16, 1773, the Boston Tea Party took place as American...", "filename": "_909bf3923ed54b128e0eb86a671e24d2_1588622866.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_909bf3923ed54b128e0eb86a671e24d2_1588622866.html", "title": "AM-Prep-Today in History", "title_page": "AM-Prep-Today in History", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Today is Monday, Dec. 16, the 350th day of 2019. There are 15 days left in the year.\nToday’s Highlight in History:\nOn Dec. 16, 1773, the Boston Tea Party took place as American colonists boarded a British ship and dumped more than 300 chests of tea into Boston Harbor to protest tea taxes.\nOn this date:\nIn 1653, Oliver Cromwell became lord protector of England, Scotland and Ireland.\nIn 1859, Wilhelm Grimm, the younger of the story-writing Brothers Grimm, died in Berlin at age 73.\nIn 1905, the entertainment trade publication Variety came out with its first weekly issue.\nIn 1907, 16 U.S. Navy battleships, which came to be known as the “Great White Fleet,” set sail on a 14-month round-the-world voyage to demonstrate American sea power.\nIn 1944, the World War II Battle of the Bulge began as German forces launched a surprise attack against Allied forces through the Ardennes Forest in Belgium and Luxembourg (the Allies were eventually able to turn the Germans back).\nIn 1950, President Harry S. Truman proclaimed a national state of emergency in order to fight “world conquest by Communist imperialism.”\nIn 1960, 134 people were killed when a United Air Lines DC-8 and a TWA Super Constellation collided over New York City.\nIn 1982, Environmental Protection Agency head Anne M. Gorsuch became the first Cabinet-level officer to be cited for contempt of Congress for refusing to submit documents requested by a congressional committee.\nIn 1985, at services in Fort Campbell, Kentucky, President Ronald Reagan and his wife, Nancy, offered condolences to families of 248 soldiers killed in the crash of a chartered plane in Newfoundland.\nIn 1991, the U.N. General Assembly rescinded its 1975 resolution equating Zionism with racism by a vote of 111-25.\nIn 2000, President-elect George W. Bush selected Colin Powell to become the first African-American secretary of state.\nIn 2001, after nine weeks of fighting, Afghan militia leaders claimed control of the last mountain bastion of Osama bin Laden’s al-Qaida fighters, but bin Laden himself was nowhere to be seen.\nTen years ago: Two hundred Mexican Marines raided an upscale apartment complex and killed drug cartel chief Arturo Beltran Leyva in a two-hour gunbattle. Iran test-fired a missile capable of hitting Israel and parts of Europe. Police fired pepper spray and beat protesters with batons outside the U.N. climate conference in Copenhagen. Tiger Woods was voted Athlete of the Decade by members of The Associated Press. Yegor Gaidar, 53, who oversaw Russia’s painful transition from communism to a free market economy, died in Moscow. Roy E. Disney, 79, the son and nephew of the Walt Disney Co. founders, died in Newport Beach, California.\nFive years ago: Taliban gunmen stormed a military-run school in the northwestern Pakistan city of Peshawar, killing at least 148 people, mostly children. Nick Bjugstad scored the game-winning goal in the longest shootout in NHL history to lift the Florida Panthers over the Washington Capitals 2-1.\nOne year ago: With the threat of a partial government shutdown looming, the White House dug in on its demand for $5 billion to build a border wall as congressional Democrats stood firm against it. As a number of probes moved closer to the Oval Office, President Donald Trump and his attorney unleashed a fresh series of attacks on special counsel Robert Mueller and federal prosecutors in New York, while categorically ruling out a presidential interview with Mueller.\nToday’s Birthdays: Civil rights attorney Morris Dees is 83. Actress Joyce Bulifant is 82. Actress Liv Ullmann is 81. CBS news correspondent Lesley Stahl is 78. Pop musician Tony Hicks (The Hollies) is 74. Pop singer Benny Andersson (ABBA) is 73. Actor Ben Cross is 72. Rock singer-musician Billy Gibbons (ZZ Top) is 70. Rock musician Bill Bateman (The Blasters) is 68. Actor Xander Berkeley is 64. Actress Alison LaPlaca is 60. Actor Sam Robards is 58. Actor Jon Tenney is 58. Actor Benjamin Bratt is 56. Country singer-songwriter Jeff Carson is 56. Actor-comedian JB Smoove is 54. Actress Miranda Otto is 52. Actor Daniel Cosgrove is 49. Rhythm-and-blues singer Michael McCary is 48. Actor Jonathan Scarfe is 44. Actress Krysten Ritter is 38. Actress Zoe Jarman is 37. Country musician Chris Scruggs is 37. Actor Theo James is 35. Actress Amanda Setton is 34. Rock musician Dave Rublin (American Authors) is 33. Actress Hallee Hirsh is 32. Actress Anna Popplewell is 31. Actor Stephan James is 26.\nThought for Today: “It’s discouraging to think how many people are shocked by honesty and how few by deceit.” — Sir Noel Coward, English actor, playwright, composer (born this date, 1899; died in 1973).\nCopyright 2019, The Associated Press. All rights reserved.", "url": "https://apnews.com/909bf3923ed54b128e0eb86a671e24d2"}