{"authors": ["Rochelle Simpson"], "date_download": "2020-05-04 20:12:57", "date_modify": "2020-05-04 20:12:57", "date_publish": "2019-01-16 14:00:00", "description": "Saturday, Jan. 19 Dr. Martin Luther King Jr. event, 10 a.m. to 1 p.m., Kankakee Public Library. Open house, including games, free movie (“Black Panther”), refreshments, storytime, coloring...", "filename": "_049d120de9ec4a44ad21b3a0c3fc38d4_1588623177.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_049d120de9ec4a44ad21b3a0c3fc38d4_1588623177.html", "title": "Community Calendar: Jan. 16, 2019", "title_page": "Community Calendar: Jan. 16, 2019", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Saturday, Jan. 19\nDr. Martin Luther King Jr. event, 10 a.m. to 1 p.m., Kankakee Public Library. Open house, including games, free movie (“Black Panther”), refreshments, storytime, coloring contest and a visit by super heroes.\nPizza Making Workshop, 11:30 a.m. to 1 p.m., Limestone Library. Children in grades 1-6 get to learn how to make pizza. Free, all supplies provided.\nSunday, Jan. 20\nDr. Martin Luther King Jr. event, Gospel tribute, 4 p.m., Greater New Hope Baptist Church, 1591 E. Cedar St., Kankakee. David Richardson will receive the Coretta Scott King Music Award.\nMonday, Jan. 21\nDr. Martin Luther King Jr. event, Ecumenical Service, 10 a.m. Mount Calvary Baptist Church, 7376 E. Illinois St., Sun River Terrace. The speaker will be the Rev. Dr. K. Edward Copeland. Judge J. Imani Drew will receive the Lifetime Achievement Award.\nBlood Drive, noon to 7 p.m., outside of Firehouse Subs, Bradley. Donors receive coupon for free small sub from Firehouse Subs. Appointments recommended, but walk-ins welcome. Make appointmets online at vitalant.org, group code 924A or call 877.25VITAL.\nTuesday, Jan. 22\nParis Travel Log, free, 7 p.m., White Oak Room, Bourbonnais Library. Joie de Vivre: A Parisienne Travel Log. Learn about the culture and sites of Paris through the eyes of Bourbonnais Library director Kelly McCully as she presents a travel log of her recent visit to France. Library’s book sale begins at 5:30 p.m. with books priced at 50 cents and $1. Info. 815-933-1727 or bourbonnaislibrary.org.\nWednesday, Jan. 23\nVintage Squadron Breakfast, Coyote Canyon, 1359 N. Locke Drive, Bradley. Second and fourth Wednesday of each month, 7:30 a.m. $7 plus tip. A breakfast buffet with fellow veterans. All welcome. No dues or memberships required, just a friendly gathering. 815-936-0120.\nThursday, Jan. 24\nFamily Movie and Dinner Night, “Hotel Transylvania 3,” 5 to 8 p.m., Limestone Library, free. Register by Jan. 23 at 815-939-1696.\nSoul Collections, 6:30 p.m., Kankakee Library, monthly book discussion. January’s selection is “Born a Crime: Stories from a South African Childhood” by Trevor Noah.\nSunday, Jan. 27\nWatseka FFA Alumni Auction, 1:30 p.m. dinner, 2 p.m. auction, Watseka High School, 138 S. Belmont Ave. Proceeds help the FFA with conferences, education, materials, convention trips and other educational items. Info. 815-386-4446.\nChili Cook Off to benefit Stevens Middle School Pedals for Progress, 4 to 7 p.m., Wilmington Masonic Lodge, 311 Main St. $10 for adults, $5 kids older than 11 and free for kids younger than 11. Hot dogs and chili. Info. 630-667-4128.\nPlay With Your Food, fundraiser for Asbury United Methodist Church Youth Group’s summer 2019 mission trip to Minneapolis, Minn., 4:30 p.m. at the church, tickets $15 per person, $50 for a family of four people or more. Children younger than 2 eat free. Reservations required, 815-933-4408. Five-course meal with family-friendly stunts and challenges during each course.\nMonday, Jan. 28\nHomework Cafe, 3:30 to 7 p.m. Limestone Library. Grades 6-12. Study with friends in the meeting room. Use library resources for class projects. Librarian available to assist. Snacks and drinks available.\nThursday, Jan. 31\nLegends of Michiana: Jerry Hammes, The Believer, a documentary with special guest, director Tom Desch. 7 p.m., Kankakee Library. Documentary showcases Hammes and his family and their accomplishments.\nSaturday, Feb. 2\nAnnual All Choirs Pancake Day, 8 a.m. to 1 p.m., Asbury United Methodist Church, Kankakee. $6 per adult, $3 for kids. Plain and blueberry pancakes (all you can eat), sausage, applesauce and beverage. Tickets available at the door.\nKankakee Valley Genealogical Society meeting, 1 to 3 p.m., Kankakee Public Library. Presentation on National Archives in Chicago, which holds federal records from agencies in the Midwest dating from the 1800s, including territorial papers, farming and agriculture, naturalization, military, taxes, postal service, court cases and others. These can be invaluable when researching family history.\nWednesday, Feb. 6\nKankakee Valley Civil War Round Table, 6:30 to 8:30 p.m., first Wednesday of each month, Bradley Library. Learn about the adventures of Union soldiers, sailors and Marines ramming Confederate boats on the Mississippi River. Info. 815-936-0366.\nThursday, Feb. 7\nMary’s Seven Joys and Sorrows, 9 a.m. to noon, One Heart One Soul Spirituality Center, 2041 W. State Route 113 (lower level), Kankakee. Come away for a time of prayer. Scripture gives us three lived mysteries of Mary’s life, also lived by Jesus. Seven is a complete number in Scripture. These sacred events give us the daily experiences in Mary’s journey.\nSaturday, Feb. 9\nYoga of 12-Step Recovery Meeting, Central Christian Church’s fellowship hall, 310 Main St. NW, Bourbonnais. This is an addiction relapse prevention program integrating yoga and the practical tools of 12-Step recovery programs.\nThursday, Feb. 14\nLove and Poetry, 5 p.m., Limestone Library. Share your favorite love poem — original or from a favorite poet — with fellow poetry lovers. Light refreshments. Please register in advance, 815-939-1696.\nTuesday, Feb. 19\nGive a Pint, Get a Pint, 11 a.m. to 4 p.m., Faith Church, 2400 Waldron Road, Kankakee. Give blood in this American Red Cross Blood Drive and get a certificate for a free pint of ice cream. Reservations at redcrossblood.org or 1-800-733-2767.\nFriday, Feb. 22\nStrikes and Spares for Cornerstone, 5 to 7:30 p.m., Brookmont Bowling Center, Kankakee. Cornerstone Services is a not-for-profit organization that helps adults and children with disabilities. $25 per person includes unlimited bowling and food such as pizza, pasta, salad and pop. For information and tickets, call 815-741-6743.", "url": "https://apnews.com/049d120de9ec4a44ad21b3a0c3fc38d4"}