{"authors": ["Kristen Holmes", "Cnn White House Correspondent"], "date_download": "2020-05-04 16:57:43", "date_modify": "2020-05-04 16:57:43", "date_publish": "2020-04-09 14:56:36", "description": "As states continue to battle one another and the federal government for critically needed medical supplies, governors across the country are discussing a multi-state consortium that would increase their purchasing power, cut the competition and quickly get supplies to the areas most in need.", "filename": "2020_04_09_politics_governors-supply-chain_index_1588611463.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331131143-gov-andrew-cuomo-presser-3-31-2020-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_governors-supply-chain_index_1588611463.html", "title": "Governors working on multi-state consortium to secure supplies", "title_page": "Governors working on multi-state consortium to secure supplies - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) As states continue to battle one another and the federal government for critically needed medical supplies, governors across the country are discussing a multi-state consortium that would increase their purchasing power, cut the competition and quickly get supplies to the areas most in need.\nIn a Wednesday press conference, Andrew Cuomo, governor of New York and vice-chair of the National Governor's Association, told reporters there were talks of states banding together if the federal government continued to resist taking control of the supply chain.\nCuomo called a consortium an \"Option B,\" stressing that the federal government's involvement in purchasing and disseminating supplies was still the preferred choice.\nNGA press secretary James Nash, confirmed the conversations around the notion of a multi-state consortium.\n\"Governors have been discussing this idea through the National Governor's Association,\" Nash told CNN, but did not provide any other details.\nRead More", "url": "https://www.cnn.com/2020/04/09/politics/governors-supply-chain/index.html"}