{"authors": [], "date_download": "2020-05-04 20:06:58", "date_modify": "2020-05-04 20:06:58", "date_publish": "2020-01-23 05:20:01", "description": "On Jan. 23, 1958, Brunswick Records released \"Maybe Baby\" backed with \"Tell Me How\" by The Crickets. In 1970, singer Judy Collins was denied permission to sing her testimony at the Chicago...", "filename": "_f16c8a27140d4b438766e06f1e4c51e4_1588622818.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f16c8a27140d4b438766e06f1e4c51e4_1588622818.html", "title": "AM-Prep-Today in Entertainment History", "title_page": "AM-Prep-Today in Entertainment History", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "On Jan. 23, 1958, Brunswick Records released “Maybe Baby” backed with “Tell Me How” by The Crickets.\nIn 1970, singer Judy Collins was denied permission to sing her testimony at the Chicago Seven trial.\nIn 1976, “Donny and Marie” premiered on ABC. It was the first variety show hosted by a brother and sister team, Donny and Marie Osmond.\nIn 1977, the TV miniseries “Roots,” based on the Alex Haley novel, began on ABC.\nIn 1978, Terry Kath, a vocalist and guitarist with the band Chicago, accidentally shot himself to death. He was 32.\nIn 1982, George Michael and Andrew Ridgeley recorded their first demos as Wham! in Ridgeley’s parents’ house. They used a portable studio that cost them $32.\nIn 1986, the first inductees into the Rock and Roll Hall of Fame were honored. They included Chuck Berry, Ray Charles, Sam Cooke, Fats Domino, the Everly Brothers, Buddy Holly, Jerry Lee Lewis, Little Richard and Elvis Presley.\nAlso in 1989, James Brown was sentenced in Georgia to another six years in jail in connection with a police chase through two states. At the time, Brown was serving a sentence in South Carolina.\nIn 1990, former Lynyrd Skynyrd guitarist Allen Collins died in Florida of complications from pneumonia. He was 37.\nIn 1996, the city council in Johnson City, Tennessee, withdrew permission for White Zombie to hold a show there. Several town residents had complained that the band advocated Satan worship.\nIn 1997, “Louie, Louie” composer Richard Berry died in his sleep at his home in South Central Los Angeles.\nIn 2002, Virgin Records and Mariah Carey terminated their record deal after barely nine months. Virgin paid Carey $28 million to break the contract, on top of the $21 million Carey got for signing with Virgin.\nIn 2005, Johnny Carson died from complications from emphysema in Los Angeles. He was 79.\nToday’s Birthdays: Actress Chita Rivera is 87. Actor-director Lou Antonio (“Cool Hand Luke”) is 86. Jazz vibraphonist Gary Burton is 77. Actor Gil Gerard is 77. Singer Anita Pointer of the Pointer Sisters is 72. Bassist-keyboardist Bill Cunningham of The Box Tops is 70. Actor Richard Dean Anderson (“MacGyver”) is 70. Singer-guitarist Robin Zander of Cheap Trick is 67. Singer Anita Baker is 62. Bassist Earl Falconer of UB40 is 61. Actor Peter Mackenzie (“black-ish”) is 59. Actor Boris McGiver (“House of Cards,” ″Boardwalk Empire”) is 58. Actress Gail O’Grady (“American Dreams,” ″NYPD Blue”) is 57. Actress Mariska Hargitay (“Law and Order: Special Victims Unit”) is 56. Singer Marc Nelson (Az Yet) is 49. “CBS Evening News” anchor Norah O’Donnell is 46. Actress Tiffani Thiessen (“Beverly Hills, 90210”) is 46. Bassist Nick Harmer of Death Cab For Cutie is 45. Actress Lindsey Kraft (“Living Biblically”) is 40.", "url": "https://apnews.com/f16c8a27140d4b438766e06f1e4c51e4"}