{"authors": ["Associate Commerce Editor"], "date_download": "2020-05-04 21:10:49", "date_modify": "2020-05-04 21:10:49", "date_publish": "2020-04-30 23:22:37", "description": "These highly sought after Kiehl’s products are 25% off at Nordstrom. You're welcome.", "filename": "entry_kiehls-sale-nordstrom_l_5eab2f9dc5b655affba57c7c_1588626649.html", "image_url": "https://img.huffingtonpost.com/asset/5eab4a43250000ea11eb0a97.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_kiehls-sale-nordstrom_l_5eab2f9dc5b655affba57c7c_1588626649.html", "title": "FYI, There Are A Lot Of Kiehl's Products On Sale At Nordstrom", "title_page": "FYI, There Are A Lot Of Kiehl's Products On Sale At Nordstrom | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "HuffPost may receive a share from purchases made via links on this page. Prices and availability subject to change.\nHuffPost We spotted a few highly-sought after Kiehl’s products sitting in the beauty section of Nordstrom’s sale page﻿ for up to 25% off.\nLet’s face it: Now’s a great time to establish a skin care routine. While indulging in a face mask or adding an extra item to your bathroom counter might be the last thing on your mind, setting aside some time for yourself can be a healthy way to destress and feel more like yourself.\nBut if you’re not sure where to start, you can’t go wrong with a household brand with nearly 170 years of skin care experience — especially if it’s on sale.\nWe’ve spotted a few highly sought after Kiehl’s products sitting in the beauty section of Nordstrom’s sale page — for up to 25% off. And, Kiehl’s is offering a gift with purchase at Nordstrom, so when you spend $85 or more you’ll get a sample cleanser, tone, masque and serum.\nOur editor is a recent convert to the brand’s best-selling Kiehl’s Ultra Facial Cream. It’s a thick, chilled cream that’s hydrating without being heavy, making it the perfect year-round moisturizer for folks who don’t have the desire to swap their products seasonally.\nUnfortunately that magical moisturizer isn’t included in the sale.\nBut, there are a few other cult-favorite Kiehl’s products that are, including this highly-reviewed corrective cream that promises to lift, firm and improve your skin’s texture.\nIntrigued? Below, we’ve rounded up the Kiehl’s products included in the sale.", "url": "https://www.huffpost.com/entry/kiehls-sale-nordstrom_l_5eab2f9dc5b655affba57c7c"}