{"authors": [], "date_download": "2020-05-04 20:22:48", "date_modify": "2020-05-04 20:22:48", "date_publish": "2020-04-20 17:42:44", "description": "Missoula, Mont. (AP) — Two grizzly bears were euthanized by wildlife officials in Montana for killing livestock, officials said. The bears were killed separately last week by the Montana...", "filename": "_3b91bf6d214fb974b5db9297c8e840d0_1588623768.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3b91bf6d214fb974b5db9297c8e840d0_1588623768.html", "title": "Montana officials euthanize 2 bears for killing livestock", "title_page": "Montana officials euthanize 2 bears for killing livestock ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Missoula, Mont. (AP) — Two grizzly bears were euthanized by wildlife officials in Montana for killing livestock, officials said.\nThe bears were killed separately last week by the Montana Fish, Wildlife & Parks department, The Missoulian reported Friday.\nA young, male grizzly bear was euthanized April 13 after it killed three calves over a period of several days on a ranch east of Ovando in the Blackfoot Valley, the department said.\nThe grizzly killed three calves between April 10 and April 12 and was suspected to have been responsible for another livestock injury in the area the previous week.\nThe department made the decision to kill the bear in consultation with the U.S. Fish and Wildlife Service and in accordance with Interagency Grizzly Bear Committee guidelines.\nWhen bears repeatedly pursue livestock the pattern can be difficult to break, state bear management specialist Jamie Jonkel said.\nAnother young, male grizzly bear was euthanized April 16 after the animal was captured by the U.S. Department of Agriculture Wildlife Services for calf depredations on the Rocky Mountain Front southwest of Augusta.\n“Besides causing calf depredations, it was coming in close to ranch homes,” said Mike Madel, a Fish, Wildlife & Parks bear management specialist.", "url": "https://apnews.com/3b91bf6d214fb974b5db9297c8e840d0"}