{"authors": ["Evan Perez", "Cnn Justice Correspondent"], "date_download": "2020-05-04 16:17:18", "date_modify": "2020-05-04 16:17:18", "date_publish": "2020-04-03 23:10:55", "description": "The federal court that oversees national security surveillance wants the FBI to explain newly uncovered missteps in government warrants to eavesdrop on Americans after a recent internal audit found the FBI fell short of the standards required.", "filename": "2020_04_03_politics_fbi-surveillance-warrants-fisa-court_index_1588609038.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/180125130207-fbi-logo-1-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_fbi-surveillance-warrants-fisa-court_index_1588609038.html", "title": "Surveillance court wants FBI to explain new reported shortcomings", "title_page": "Surveillance court wants FBI to explain new reported shortcomings - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The federal court that oversees national security surveillance wants the FBI to explain newly uncovered missteps in government warrants to eavesdrop on Americans after a recent internal audit found the FBI fell short of the standards required.\nThe Justice Department inspector general said in recent days that after reviewing a sample of Foreign Intelligence Surveillance Act eavesdropping warrants from around the country, it \"lacked confidence\" that the FBI was adhering to its standards that require information presented to the court is \"scrupulously accurate.\"\n\"It would be an understatement to note that such lack of confidence appears well founded,\" the Foreign Intelligence Surveillance Court said in a Friday order in reaction to a memorandum detailing the new findings by the Justice Department inspector general.\n\"The OIG Memorandum provides further reason for systemic concern,\" the court said. \"It thereby reinforces the need for the court to monitor the ongoing efforts of the FBI and DOJ to ensure that, going forward, FBI applications present accurate and complete facts.\"\nThe newly reported missteps added to the failures that the inspector general reported in December in the FBI's use of secret surveillance warrants targeting former Trump campaign aide Carter Page.\nRead More", "url": "https://www.cnn.com/2020/04/03/politics/fbi-surveillance-warrants-fisa-court/index.html"}