{"authors": ["Chloe Melas"], "date_download": "2020-05-04 16:56:58", "date_modify": "2020-05-04 16:56:58", "date_publish": "2020-04-09 13:36:02", "description": "Joseph Gordon-Levitt understands that being creative during a global pandemic can feel challenging, but he's urging others to stay connected now.", "filename": "2020_04_09_entertainment_jo_90bbf1759a5802b1d30eb37d0e0e9f59_index_1588611418.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409063205-seph-gordon-levitt-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_entertainment_jo_90bbf1759a5802b1d30eb37d0e0e9f59_index_1588611418.html", "title": "Joseph Gordon-Levitt wants to hear your coronavirus stories", "title_page": "Joseph Gordon-Levitt wants to hear your coronavirus stories - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Joseph Gordon-Levitt understands that being creative during a global pandemic can feel challenging, but he's urging others to stay connected now.\nThat's why he's making a documentary about how people are living at this time, using his online platform HITRECORD\n\"I find creativity the best way for me to get into what you might call a flow state. Different people get this in different ways. Some people do exercise, some people meditate, some people like to cook, garden,' Levitt said in a recent interview with CNN. \"I've always found it through creativity, whether it's through acting that I've done, I love to play music, writing. It just allows me to focus on something, accomplish something. Time kind of can disappear a little bit. The worries of a global pandemic can sort of fade into the background sometimes, or it can be a productive way to confront those feelings and thoughts.\"\nHe took to Instagram on Wednesday to ask people to share their experiences for his project.\n\"Are you staying home? Or are you leaving the house to work, or for other reasons? Talk on camera about it, shoot some video or photos, write about it, draw about it,\" he wrote alongside a video.", "url": "https://www.cnn.com/2020/04/09/entertainment/joseph-gordon-levitt-hitrecord-coronavirus-documentary/index.html"}