{"authors": ["Reporter"], "date_download": "2020-05-04 20:03:59", "date_modify": "2020-05-04 20:03:59", "date_publish": "2020-05-04 19:42:09", "description": "Actors Kevin Bacon and Orlando Bloom have also expressed interest in portraying the convicted animal trainer in other projects.", "filename": "entry_nicolas-cage-joe-exotic-tv_n_5eb052dec5b614b5c49b8140_1588622639.html", "image_url": "https://img.huffingtonpost.com/asset/5eb0573f2200005b0f8281ff.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_nicolas-cage-joe-exotic-tv_n_5eb052dec5b614b5c49b8140_1588622639.html", "title": "Nicolas Cage In Talks To Play Joe Exotic In Scripted TV Series", "title_page": "Nicolas Cage In Talks To Play Joe Exotic In Scripted TV Series | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Oscar-winner Nicolas Cage is reportedly in talks to play Joe Exotic, the convicted animal trainer made famous in the Netflix documentary “Tiger King,” in a scripted TV series about his life.\nVariety first reported that Cage would star in the series, which is being produced by Imagine Television Studios and CBS and is based on a Texas Monthly article titled “Joe Exotic: A Dark Journey Into the World of a Man Gone Wild,” by Leif Reigstad.\nThe eight-episode series would mark Cage’s first regular television role. It centers around Exotic, real name Joe Schreibvogel, as he fights to keep his park even at the risk of losing his sanity.\nThe new series isn’t the only scripted “Tiger King” show in the works.\nIn November, Variety announced that Kate McKinnon would be playing big cat rights activist Carole Baskin in another proposed series.\nBoth Kevin Bacon and Orlando Bloom have also expressed interest in other projects about Exotic, who was convicted last April of murder-for-hire in a failed plot to kill Baskin.", "url": "https://www.huffpost.com/entry/nicolas-cage-joe-exotic-tv_n_5eb052dec5b614b5c49b8140"}