{"authors": ["Sara Spary", "Ashley Strickland"], "date_download": "2020-05-04 16:51:51", "date_modify": "2020-05-04 16:51:51", "date_publish": "2020-04-08 13:06:34", "description": "The night sky put on a spectacular show around the globe on Tuesday evening as the \"pink\" April supermoon -- the biggest and brightest of the year -- was visible for millions.", "filename": "2020_04_08_world_pink-supermoon-scli-intl-gbr-scn_index_1588611111.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408055425-01-pink-moon-gallery-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_world_pink-supermoon-scli-intl-gbr-scn_index_1588611111.html", "title": "April's pink supermoon in pictures -- from California to Krakow", "title_page": "Pink supermoon in pictures -- the best shots from around the world - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Photos: The April pink supermoon in pictures The full moon rises above the horizon in San Francisco, California. Hide Caption 1 of 11\nPhotos: The April pink supermoon in pictures A bald eagle sits near its nest while the super pink moon rises in the distance at Chatfield State Park in Littleton, Colorado. Hide Caption 2 of 11\nPhotos: The April pink supermoon in pictures A plane passes the pink supermoon as it rises over Dublin, Ireland. Hide Caption 3 of 11\nPhotos: The April pink supermoon in pictures The supermoon rises behind Rocca Calascio castle in Italy. Hide Caption 4 of 11\nPhotos: The April pink supermoon in pictures The pink supermoon rises over the Rock of Dunamase in Laois, Ireland. Hide Caption 5 of 11\nPhotos: The April pink supermoon in pictures The moon rises behind New York City. Hide Caption 6 of 11\nPhotos: The April pink supermoon in pictures The moon rises in Amsterdam, the Netherlands. Hide Caption 7 of 11\nPhotos: The April pink supermoon in pictures The moon takes on a reddish hue as it reflects the light of early dawn in Krakow, southern Poland. Hide Caption 8 of 11\nPhotos: The April pink supermoon in pictures The full moon rises above Salgo castle in Hungary. Hide Caption 9 of 11\nPhotos: The April pink supermoon in pictures The pink supermoon is seen above San Telmo in Spain's Balearic Islands in the early hours of April 8. Hide Caption 10 of 11", "url": "https://www.cnn.com/2020/04/08/world/pink-supermoon-scli-intl-gbr-scn/index.html"}