{"authors": [], "date_download": "2020-05-04 20:16:25", "date_modify": "2020-05-04 20:16:25", "date_publish": "2020-04-08 14:51:29", "description": "SEATTLE (AP) — A suspect accused of child molestation in Washington state was killed in an officer-involved shooting after firing at Pierce County deputies during a traffic stop and officer...", "filename": "_6fa0d662a8e202df4c6b06e63fc32b0a_1588623385.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6fa0d662a8e202df4c6b06e63fc32b0a_1588623385.html", "title": "Man killed in officer-involved shooting after police pursuit", "title_page": "Man killed in officer-involved shooting after police pursuit", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SEATTLE (AP) — A suspect accused of child molestation in Washington state was killed in an officer-involved shooting after firing at Pierce County deputies during a traffic stop and officer pursuit, authorities said.\nPierce County Sheriff’s Department deputies responded to a report of a man with a shotgun in a pizza place parking lot near Eatonville, KOMO-TV reported Tuesday.\nThe suspect, 37, reportedly said it was his last day on Earth before driving off in a vehicle on Mountain Highway reaching over 80 mph (129 kph) during a pursuit, deputies said.\nAuthorities were searching for the suspect, who they learned was scheduled to meet with detectives earlier that day regarding a child molestation investigation.\nThe suspect crashed and gunfire was eventually exchanged, authorities said, adding that the man was transferred to Madigan Army Hospital where he died. No deputies were reported injured.\nIt is unclear if the gunshot wound is self-inflicted or if Pierce County deputies shot him, deputies said.\nThe involved deputies were placed on administrative leave and an investigation is underway by the Tacoma Police Department.", "url": "https://apnews.com/6fa0d662a8e202df4c6b06e63fc32b0a"}