{"authors": ["Jedediah Britton-Purdy", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Luke Savage", "Michael Arria"], "date_download": "2020-05-04 19:54:21", "date_modify": "2020-05-04 19:54:21", "date_publish": "2020-02-29 00:00:00", "description": null, "filename": "2020_02_bernie-sanders-david-brooks-liberalism_1588622061.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/02/29164804/GettyImages-1209345566.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_02_bernie-sanders-david-brooks-liberalism_1588622061.html", "title": "The Liberal-Conservative-Socialist Case for Bernie Sanders", "title_page": "The Liberal-Conservative-Socialist Case for Bernie Sanders", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "In his latest New York Times entry, David Brooks tags Bernie Sanders with Stalin-era Soviet genocide and describes Sanders’s “leadership style” as a cocktail of “rage, bitter and relentless polarization, a demand for ideological purity among your friends, and incessant hatred for your supposed foes.” Sanders’s program, he argues, has almost nothing to do with the New Deal or Scandinavian social democracy. Instead, it is the American version of today’s “corrosive populisms of right and left.” For all these reasons, Sanders’s victory would be a terrible blow to “liberalism,” which Brooks identifies with “reasonableness, conversation, compassion, tolerance, intellectual humility and optimism” and a horror of cruelty, plus a commitment to making change within the political system.\nEven someone committed to reasonableness and conversation can find that their energy flags while arguing with Brooks, his colleagues Bret Stephens and Thomas Friedman, and other never-Sanders avatars of the center. Brooks has seemingly gotten his impression of Sanders from Stephens’s columns, not from anyone with first-hand experience of the campaign.\nBrooks doesn’t know much about the New Deal, doesn’t remember the last decade of the Cold War as clearly as he thinks he does, and, when it comes down to it, doesn’t really care about either. His real target is “left populism,” and his real argument is that Sanders’s political project is basically the same as the racist and nationalist populisms of the Right: driven by anger, prone to cults of personality, tending toward violence, and likely to shatter or suffocate democratic institutions if it takes power.\nBrooks, who calls himself a conservative or a liberal as it suits him, embodies, quite un-self-consciously, a kind of liberalism that blossomed at the end of the Cold War and in the Long 1990s that followed: sentimental, lazy in its thinking about freedom and power, suspicious of democracy but not really interested in understanding it, and, above all, lacking any meaningful idea of capitalism as a political problem. Equipped with this “liberalism,” Brooks is able to define it by a euphonious list of personality traits — the qualities of someone you might like to have a sandwich with, the niceness that is today’s clubbability.\nThere is a danger that in engaging such stupid and opportunistic stuff we become more stupid and glib ourselves. But if it is wasted labor to wade through Brooks’s polemics slander by slander, there is political value in understanding him. Variants on his alt-centrist version of liberal principle might be the biggest threat to a Sanders victory in the fall. Brooks’s bottom line is that, if Sanders is the nominee, Our Responsible Liberal will be unable to support him. If Sanders takes the nomination, the clearest scenario in which he loses is that a bunch of Buttigieg-Klobuchar types in the suburbs of Northern Virginia, Milwaukee, and Philadelphia persuade themselves that the reasonable thing is to hold their moral noses and vote for tax cuts, or just stay home and stick with the devil they know. “No one in this race has good values,” they will say at the breakfast table. That is Brooks’s formula.\n“I’m here to tell you,” Brooks intones from the page, “that Bernie Sanders is not a liberal Democrat. He’s what replaces liberal Democrats.” Well, I am here to tell Brooks, and anyone else who cares, that Sanders is the genuine candidate of the liberal tradition Brooks invokes: “John Stuart Mill, John Locke, the Social Gospel movement and the New Deal.” If there is such a thing as an honest conservatism in these parts, Sanders might even be its candidate.\nFirst, liberalism. Mill (who wrote with enormous sympathy about socialism in his later years) was committed to individuality, self-development and self-expression, and the kinds of experiment and discovery that happen when people are able to approach one another as free equals, undistorted by dependence or oppression. People knew as much about their potential, he wrote (with the uncredited Harriet Taylor) in “The Subjection of Women,” as we know about the life of plants that are kept in greenhouses or cut and bent as topiary. Mill was keenly aware that nothing limited people more than poverty and the petty tyrannies of the household, the workplace, and the neighborhood.\nThe New Deal, as Franklin Roosevelt explained it, was Millian liberalism for a complex and unequal economy. The point of government was to promote and secure “individualism,” in its best, humanist sense, in the face of “the despot of the twentieth century,” concentrated economic power. With this in mind, Roosevelt called for “an economic bill of rights,” including the power “to make a comfortable living,” and in 1942 proposed a maximum annual income of $25,000. There is your job guarantee, your wealth tax, your attacks on concentrated wealth as a threat to freedom and democracy — never mind FDR’s famous “I welcome their hatred” line about reactionary business leaders.\nNever mind, for that matter, that the New Deal’s liberal “optimism,” as Brooks has it, was powered in good part by pressure from a labor movement that was much more militant and combative than anyone in the current political mix, and shaped by advisers well to the left of anyone who is likely to be making policy for Sanders (including, alas, some real naïfs about the nature of the Soviet Union, notably the influential economist Rexford Tugwell, who returned from a visit there regretting that the Russians were monopolizing the fun of shaping the future). Brooks’s liberalism cares about style and tone, and for him the point is remembering FDR as a national uncle, like Reagan, only more freehanded with candy for the kids.\nIf you care about the freedom and self-development of the individual, you care about the power to make a living, to be free from abuse at work, to enjoy basic security in your own life, and to have the chance to learn and grow and change. The despots of the twenty-first century that stand in the way include precarity, poverty, plutocracy, structural racism, and mass incarceration. If you are “horrified by cruelty,” as Brooks says liberals are, you will be horrified by these. Truly universal health care, free higher education, increased power for workers, and deep criminal justice reform are all responses.\nOne can be all for “conversation, compassion, tolerance” — I am — and believe that, other things equal, we are likely to see much more of them when people are not afraid of one another in their daily lives, and not afraid of the damage a piece of bad luck or the whim of a boss or a cop will do to them and their family. Liberal virtues have an institutional ecology, and self-described socialists are the ones who are most interested these days in building that ecology. If you call yourself a liberal but aren’t interested in achieving the conditions in which liberalism can work, the very least you could do is adopt a little of the liberal virtue of intellectual humility.\nWhat happened to American liberalism to make David Brooks possible? A total collapse of intellectual humility, a lack of sensitivity to “new facts” (another virtue Brooks claims for liberals and denies “left populists”), and, centrally, the disappearance of a sense of reality about capitalist democracy. Somewhere in the triumphalism of the late Cold War and its aftermath, it became easy to think of yourself as a liberal without considering the problem that Mill, Roosevelt, and the many reformers and movements around them almost uniformly recognized as the problem of modern life: how to achieve a society of free equals amid an economic order that concentrated wealth, gave its privileged classes new forms of power, and turned human creativity relentlessly to profit and exploitation.\nUnder the dogmatic assumption that there was no alternative in political economy, a generation of liberal commentators instead embraced cultural criticism, moral psychology, and ad hoc evolutionary theories of why everything had to be more or less as it was (with a little regretful scolding for truants). If they thought about capitalism, they treated it as either an obvious ally of “liberal democracy” — look at the decades of optimism about China’s supposedly inevitable convergence with the United States — or a cultural phenomenon, interesting mostly for the status hierarchies that its consumption patterns set up. (Riffs on these two notions made the careers of never-Sanders point men Thomas Friedman and Brooks, respectively, in the 1990s.)\nNo wonder so many millennial socialists think liberalism is trash — even if, from a slightly longer view, many of them are renovating liberalism under the name of democratic socialism. The new label marks the gap between the new (and old) demands and what liberalism has become. It especially marks a generation’s forceful rejection of the cruel political economy that liberals watched grow up around them while observing consumer trends and growth in Chinese markets.\nIf the vast few decades have brought a decadent liberalism, they have matched it with a particularly vile conservatism. In its present dispensation, it is everything Corey Robin has diagnosed as its perennial tendency: defense of established hierarchy, here in a shameless alliance between plutocrats, small bosses, nativists, and racists. But the “conservative” label also names some impulses that are exiled from neoliberal capitalism, and which have always attracted dissenters of the Wendell Berry variety. They, too, should be more at home with Sanders than with a Trump or a Buttigieg.\nOne is stability: part of the reason economic security is important is that the economy is a place where people live. Uprooting jobs and industries, submitting people to the whims of the market, is often a false and socially destructive version of progress. Another is pluralism: it is critical to preserve institutions, and parts of life, where nonmarket values of affection, craft, and, yes, utopian radicalism can flourish. A third is a skepticism that conservative rhetoric has often styled a secular version of the doctrine of original sin or the awareness of hubris: no human ideology deserves unquestioning deference, and no human personality can be trusted with overweening power. Out of the crooked timber of humanity, no straight thing was ever made.\nIf you want to find a real political expression of these values today, you shouldn’t look on the Right, which wants to privatize every level of education, defers to global capital markets unless they happen to burden swing-state white constituencies, and is in thrall to leaders who literally claim infallibility. You won’t find them in Long 1990s liberalism, either, with its hubristic assumption that markets will reconcile all values, uphold a capital-friendly democracy, and sort us out meritocratically into jobs that will eventually let us pay off our student loans.\nYou had better look instead to a self-styled socialism that holds that no one — notably bosses and investors — should have unquestioned power over other lives, that the market has no special claim to wisdom or morality, and that we need social investment in caregiving and education so that values of affection, play, and learning for its own sake can persist. In other words, if there are good-faith conservatives around — and I don’t doubt there are some, though they’re far from power — they should note that their values, too, have ended up in the new socialism.\nWhat’s remarkable in Brooks’s never-Sanders stance is the total lack of the virtues he defines as liberal: intellectual humility, an interest in perspectives other than one’s own, a compassion that survives and informs disagreement. It wouldn’t matter if it were just Brooks, but it’s a whole mood, something approaching a generational worldview. Alt-centrism’s anti-Sanders screeds may add up to the longest declaration of bankruptcy in history. Both liberalism and conservatism lost track of essential questions in the Long 1990s. They produced decadent versions that went to Trump rallies and chanted “Lock her up!” or went to Hamilton and cheered for the meritocratic promise of American capitalism. If political possibility is alive again after decades of no alternative, every tradition of thought is going to have work to do.\nThe brittle centrism that Brooks drapes in history and philosophy is a husk whose living grain has gone. On the campaign trail, the seeds are sprouting a new politics, in which people are once again demanding to measure the economic order against the whole range of human values, democratically expressed. Whatever name you give this politics, it aims to do more to make the world free and decent than our bewildered liberalism, more to preserve and protect it than our ruined conservatism. Whoever wants to argue against it had better be prepared to meet this standard, or join in.", "url": "https://www.jacobinmag.com/2020/02/bernie-sanders-david-brooks-liberalism"}