{"authors": ["Julhas Alam"], "date_download": "2020-05-04 20:05:26", "date_modify": "2020-05-04 20:05:26", "date_publish": "2020-04-07 11:50:06", "description": "DHAKA, Bangladesh (AP) — Police in Bangladesh arrested a fugitive killer of the country’s independence leader Sheikh Mujibur Rahman on Tuesday, nearly 45 years after the brutal assassination, the...", "filename": "_43da3f74192357e77e3ef6a9927589b3_1588622726.html", "image_url": "https://storage.googleapis.com/afs-prod/media/1269847786f846fb8e25d1c4740295c7/2997.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_43da3f74192357e77e3ef6a9927589b3_1588622726.html", "title": "Bangladesh arrests fugitive killer of independence leader", "title_page": "Bangladesh arrests fugitive killer of independence leader ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE- A 1972 file photo of Bangladesh Premier, Sheikh Mujibur Rahman. Police in Bangladesh on Tuesday arrested a fugitive killer of the country’s independence leader Rahman nearly 45 years after the brutal assassination, the country's home minister said. (AP Photo, File)\nFILE- A 1972 file photo of Bangladesh Premier, Sheikh Mujibur Rahman. Police in Bangladesh on Tuesday arrested a fugitive killer of the country’s independence leader Rahman nearly 45 years after the brutal assassination, the country's home minister said. (AP Photo, File)\nDHAKA, Bangladesh (AP) — Police in Bangladesh arrested a fugitive killer of the country’s independence leader Sheikh Mujibur Rahman on Tuesday, nearly 45 years after the brutal assassination, the country’s home minister said.\nAbdul Majed, a former military captain, was arrested in the capital, Dhaka, Home Minister Asaduzzaman Khan said, adding that the arrest was “the biggest gift” for Bangladesh this year.\nMajed had publicly announced his involvement in the assassination after the killing and had reportedly been hiding in India for many years. It was not clear when or how he returned to Bangladesh.\nMajed is one of a dozen defendants whose death sentences were upheld by the country’s Supreme Court in 2009. A trial court in 1998 had sentenced them to death for their involvement in the Aug. 15, 1975, killing of Rahman and most of his family members by a group of army officials.\nRahman is the father of current Prime Minister Sheikh Hasina. Hasina and her younger sister Sheikh Rehana were the only survivors in the family, as they were visiting Germany during the assassination.\nAfter the assassination, subsequent governments and later President Ziaur Rahman awarded the killers by posting them mostly in Bangladesh’s diplomatic missions abroad. Rahman — an ex-army chief and the husband of former Bangladeshi Prime Minister Khaleda Zia, an archrival of Hasina — was killed in a military coup in 1981. Ziaur Rahman and Sheikh Mujibur Rahman were not related.\nIn 2010, five others who admitted to taking part in the assassination were hanged to death. One man died of natural causes in Zimbabwe. The other six convicts, including Majed, were at large. At least one of them is in Canada and another in the United States, officials say.\nMajed was jailed following his arrest on Tuesday. The jail authorities will complete procedures for his execution, but it was not immediately clear when.\nBangladesh became independent in 1971 through a nine-month war against what was then West Pakistan, now Pakistan, under the leadership of Sheikh Mujibur Rahman. He was kept in jail in Pakistan during the war and was freed in 1972 amid a global outcry when he returned to newly born Bangladesh via London and India.", "url": "https://apnews.com/43da3f74192357e77e3ef6a9927589b3"}