{"authors": [], "date_download": "2020-05-04 16:58:01", "date_modify": "2020-05-04 16:58:01", "date_publish": "2020-04-09 15:56:13", "description": "Grilling season is right around the corner. Though you can't have a cookout just yet, that doesn't mean you can't start flexing your grilling skills at home. We asked chefs about their all-time favorite grilling tools.", "filename": "2020_04_09_cnn-underscored_best-grilling-accessories_index_1588611481.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406152217-grilllead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_cnn-underscored_best-grilling-accessories_index_1588611481.html", "title": "Chef-recommended must-haves for grilling season", "title_page": "Best grilling accessories: Chefs recommend their favorite grilling tools  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Grilling season is right around the corner — in some parts of the country, it's already here — and no matter what's going on in the world, there's no better excuse to go out to your backyard or patio and safely enjoy the nice weather.\nWith so many people cooking at home right now, it's probably no surprise that home chefs are excited to flex their grilling skills this spring and summer.\nWe spoke with Peter Agostinelli, executive chef of Grill 23 & Bar in Boston, and Los Angeles-based cookbook author and chef Gaby Dalkin, about their must-have tools for a perfect grilling experience, and how to use them to make wow-worthy meals. Below, you'll find expert-recommended picks for getting the most out of your grill this season.\nAgostinelli, who oversees cooking hundreds of steaks a night, says, \"Let your steaks, or your meats, come up to room temperature and heavily salt them about 10 or 15 minutes before you want to cook them. The salt will dissolve and almost create like a brine on the outside of the meat.\"\nDalkin, a longtime grilling enthusiast, says her must-have while grilling is \"a really incredible marinade or vinaigrette that I can use to marinate food in, like my basil vinaigrette recipe.\"\nLea & Perrins Original Worcestershire Sauce ($3.39, target.com; prices vary, Instacart)\nLea & Perrins Original Worcestershire Sauce\nAgostinelli sticks with a classic, saying, \"Worcestershire sauce is probably my secret ingredient\" when grilling, but \"I love it on vegetables, too. Like a little olive oil, salt and pepper, a dash of Worcestershire almost on anything is going to be great.\"\nAnd he's super selective: \"It's got to be Lea & Perrins, though.\"\nGrilling tongs\nBoth chefs agreed that grilling tongs are key for managing your cookout. As Dalkin explained, \"You need something that can reach that food at the back of the grill without singeing your hands and arms.\"\nGir Grill Tongs ($24; food52.com)\nGir Grill Tongs\nThese 16-inch tongs from beloved kitchen brand Gir are perfect for working a hot grill because of their easy lock and unlock function, according to these chefs, and the extra length that ensures your hand won't get too close to the fire.\n_______________________________________________________________________________\nGrille Perfect Grilling Tongs Heavy Duty 16-Inch ($18.98; amazon.com)\nGrille Perfect Grilling Tongs Heavy Duty 16-Inch\nWith a silicone handle, a big grip on one side and a smaller grip on the other, these heavy-duty tongs will allow you to reach the back of the grill with no problem (or burns).\nInstant-read thermometer\nBoth chefs also put an instant-read thermometer at the top of their lists, since it can tell you the temperature of your meat quickly, ensuring that the food you're eating and serving is safe and perfectly cooked.\nTaylor Commercial Waterproof Instant-Read Thermometer ($10.29; amazon.com)\nTaylor Commercial Waterproof Instant-Read Thermometer\nYou won't need to worry about under- or overcooked meats with this instant-read thermometer, which has an anti-microbial casing to prevent the growth of bacteria, an important feature for professional and home chefs alike.\n_______________________________________________________________________________\nOxo Thermocouple Thermometer ($79.99, originally $99.99; crateandbarrel.com)\nOxo Thermocouple Thermometer\nThis professional-quality thermometer tells temperature within 0.9 degrees and has a rotating probe to allow access to all areas of cooking meat, making it a kitchen staple for these chefs.\nChimney starter\nThis tool is \"absolutely mandatory if you have a charcoal grill,\" says Dalkin. \"Never mind the fact that your backyard might look like it caught on fire, you need one to get the coals hot before you disperse them into the grill and add meat.\"\nAccording to our chefs, charcoal burns hotter and drier than propane, producing a better char and a more savory crust.\nOutset Chimney Grill Starter ($14.99; target.com)\nOutset Chimney Grill Starter\nThis starter, with 5-pound capacity, features a wood handle and heat shield to protect your hands from the heat.\n_______________________________________________________________________________\nCollapsible Stainless Steel Chimney Starter ($18.19; target.com)\nCollapsible Stainless Steel Chimney Starter\nWe love this starter for one simple reason — it collapses. If you're short on space and want a reliable starter for your charcoal grill, this is the one for you.\nFish turner\nLamson Fish Turner With Walnut Handle ($34; food52.com)\nLamson Fish Turner With Walnut Handle\nAgostinelli, showing his New England roots, says a fish spatula is important to keep on hand for great grilling, and recommends this tool from Lamson, saying, \"It's nice and sharp. You can usually get salmon skin grilled really nicely with it.\"\n_______________________________________________________________________________\nOxo Fish Turner ($13.99; target.com)\nOxo Fish Turner\nAnother option is this classic fish turner with beveled edges for easy flipping.\nFor your veggies\nGrilling isn't just about meat and fish. Crisp and smoky grilled veggies can be a real standout when cooked properly.\nReynolds Wrap Heavy Duty Nonstick ($4.89; target.com)\nReynolds Wrap Heavy Duty Nonstick\nAgostinelli has an easy (and budget-friendly) tip to cook veggies on the grill.\n\"I really like to make a foil packet,\" he says. \"And you can do this with corn on the cob or sliced potatoes and onions and herbs. You want to put three or four layers of aluminum foil on it. And then I like to bury those right in the hot coals and let them roast right in the coals while I'm grilling on top of it.\"\n_______________________________________________________________________________\nNordic Ware Nonstick Grilling Basket ($30; food52.com)\nNordic Ware Nonstick Grilling Basket\nAnother way to toss a bunch of veggies on the grill comes from Dalkin, who says that this grilling basket is one of her favorite tools to use on a daily basis in the summer.\n\"Load it up with all your favorite veggies and place it on the grill to get that incredible char on everything,\" she says. \"Just be sure to toss things around every few minutes for even cooking.\"\n_______________________________________________________________________________\nOutset 4-Pack Rosewood Stainless Steel Skewers ($15.49; target.com)\nOutset 4-Pack Rosewood Stainless Steel Skewers\nWhen it comes to grilling veggies, Dalkin is very enthusiastic about one tool. \"Don't bother with the wooden [skewers]; they are too easy to light on fire,\" she says. \"Having a great set of metal skewers means you can make kebabs left and right and reuse the skewers on the daily.\"\nGrills\nGeorge Foreman 15-Serving Indoor/Outdoor Electric Grill ($89.99; amazon.com)\nGeorge Foreman 15-Serving Indoor/Outdoor Electric Grill\nSlim, light and completely portable, this is a grill you can use indoors or outdoors once the weather is nice enough.\n_______________________________________________________________________________\nWeber Original Kettle Premium Charcoal Grill, 22-Inch ($165; amazon.com)\nWeber Original Kettle Premium Charcoal Grill, 22-Inch\nBasic but mighty, this charcoal grill can hold up to 13 burgers at a time.\n_______________________________________________________________________________\nDyna-Glo 3-Burner Open Cart Propane Gas Grill ($119; homedepot.com)\nDyna-Glo 3-Burner Open Cart Propane Gas Grill\nIf gas is more your speed, this three-burner pick has two shelves and porcelain cooking grates that are super easy to clean.\nNote: The prices above reflect the retailers' listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/09/cnn-underscored/best-grilling-accessories/index.html"}