{"authors": ["Cliff Brunt"], "date_download": "2020-05-04 20:11:20", "date_modify": "2020-05-04 20:11:20", "date_publish": "2020-04-16 20:53:39", "description": "After some early rough patches, Oklahoma State coach Mike Boynton has finally built some momentum. A year after bring in a highly ranked recruiting class, Boynton has pulled in a group that...", "filename": "_2f9e5bf7f05bd12fd5b920a04dbbd55a_1588623080.html", "image_url": "https://storage.googleapis.com/afs-prod/media/a5e749e95cb5493aa38e4a54fdd87128/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2f9e5bf7f05bd12fd5b920a04dbbd55a_1588623080.html", "title": "Oklahoma St's Boynton could see turn with recruiting class", "title_page": "Oklahoma St's Boynton could see turn with recruiting class", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Oklahoma State head coach Mike Boynton Jr. shouts in the second half of an NCAA college basketball game against Iowa State in Stillwater, Okla., Saturday, Feb. 29, 2020. (AP Photo/Sue Ogrocki)\nOklahoma State head coach Mike Boynton Jr. shouts in the second half of an NCAA college basketball game against Iowa State in Stillwater, Okla., Saturday, Feb. 29, 2020. (AP Photo/Sue Ogrocki)\nAfter some early rough patches, Oklahoma State coach Mike Boynton has finally built some momentum.\nA year after bring in a highly ranked recruiting class, Boynton has pulled in a group that Cade Cunningham has helped rank in the top 10 nationally on ESPN, 247Sports and Rivals’ lists. Among other honors, Cunningham won the Naismith High School Trophy, as the nation’s best player. USA Today, 247Sports and Rivals all consider him the nation’s top recruit.\nBoynton compared Cunningham’s possible impact to that of Oklahoma’s Trae Young during the 2017-18 season. As a freshman, Young led the nation in scoring and assists and lifted a team that struggled the previous season to the NCAA Tournament. Cunningham’s talent will be the primary reason expectations will be higher for the 38-year-old Boynton, who will enter his fourth season having yet to reach the NCAA Tournament.\n“His talent level will help us elevate our ceiling -- what this team’s capable of doing,” Boynton said of Cunningham, a 6-foot-7 point guard. “He makes other people better. He makes other people’s jobs easier any team, at any level -- you need a guy like that.”\nCunningham isn’t the only elite player Oklahoma State has added. On Wednesday, the Cowboys signed Donovan Williams — Mr. Basketball in Nebraska — and Canadian star Matthew-Alexander Moncrieffe, who has international experience. Boynton said Moncrieffe would be a top-20 prospect in the United States.\nThe Cowboys also signed graduate transfer Ferron Flavors Jr., a 6-foot-3 sharpshooting guard who averaged 13.4 points and 3.5 rebounds for Cal Baptist last season. Oklahoma State had previously signed guard Rondel Walker and forward Montreal Pena, both highly ranked players at their positions.\nThey will join a program that appears to be on the upswing. Oklahoma State went 12-20 two seasons ago under Boynton, then got off to an 0-8 start in Big 12 play this past season before closing by winning seven of their final 10 regular-season games and defeating Iowa State in the first round of the Big 12 tournament.\nSeveral players from the last recruiting class showed promise during conference play. Forward Kalib Boone, in particular, had some strong games down the stretch, scoring 16 points in a win over Texas Tech and 14 in a victory over Oklahoma.\nThe only thing lacking will be experience. Oklahoma State loses three key seniors -- Lindy Waters III, Cameron McGriff and Thomas Dziagwa.\n“You talk about character and work ethic and understanding of being resilient -- they’re going to be missed a lot,” Boynton said. “I’ve already had conversations with our returners about their responsibilities now in that regard.”\n___\nMore AP college basketball: https://apnews.com/Collegebasketball and https://twitter.com/AP_Top25", "url": "https://apnews.com/2f9e5bf7f05bd12fd5b920a04dbbd55a"}