{"authors": ["Contract Commerce Writer"], "date_download": "2020-05-04 20:28:40", "date_modify": "2020-05-04 20:28:40", "date_publish": "2020-04-30 11:00:04", "description": "This month, we're all about dramatic earrings for virtual happy hours, useful over-the-door hooks and a video game for people who aren't into video games.", "filename": "entry_would-recommend-april-2020_l_5ea72282c5b6a30004e66203_1588624120.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8a00c300000b611155155.png?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_would-recommend-april-2020_l_5ea72282c5b6a30004e66203_1588624120.html", "title": "The 12 Finds Our Shopping Editors Were Obsessed With In April", "title_page": "The 12 Finds Our Shopping Editors Were Obsessed With In April | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "A game for people who aren't into gamers\nGamestop\n\"Besides my little espresso maker, the other only thing that has given me as much joy this month is playing Animal Crossing on the Nintendo Switch. I should start by saying I am not a gamer. And I must confess that most of my gaming experience was learned on an N64 from 1997 to 2001. But my boyfriend insisted the newest version of Animal Crossing for Nintendo Switch would be the game for me, and he's not wrong. There is no violence or big battle sequences, so the stakes are low. (And right now all I can handle in life are low stakes.) It's a game that's subtly all about home decor and fashion — two things I love. Released on March 20 , just as most of us across the U.S. began social distancing, Animal Crossing quietly became the game that saved us all from losing our minds during social isolation. If you have other friends who play Animal Crossing, you can virtually visit their characters' homes. People have even been throwing virtual birthday parties on Animal Crossing to make up for canceled plans. It's a carefree, low-effort game I recommend to anyone who wants a little low-stakes escapism from the world today. (And check out our guide to the difference between a Nintendo Switch and a Switch Lite if you're shopping for a console, too.)\"", "url": "https://www.huffpost.com/entry/would-recommend-april-2020_l_5ea72282c5b6a30004e66203"}