{"authors": ["Por Tom Withers"], "date_download": "2020-05-04 20:12:18", "date_modify": "2020-05-04 20:12:18", "date_publish": "2020-04-17 01:34:55", "description": "CLEVELAND (AP) — El manager de los Indios de Cleveland Terry Francona está intrigado por algunas de las opciones que sopesan las Grandes Ligas para iniciar la temporada en algún momento. El...", "filename": "_dffd6a606d964941892073a690e85d5f_1588623138.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b5e3b7e7fa0140109fc9de6a6fa65ac2/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dffd6a606d964941892073a690e85d5f_1588623138.html", "title": "Francona, intrigado por opciones para realizar campaña", "title_page": "Francona, intrigado por opciones para realizar campaña", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nCLEVELAND (AP) — El manager de los Indios de Cleveland Terry Francona está intrigado por algunas de las opciones que sopesan las Grandes Ligas para iniciar la temporada en algún momento.\nEl piloto reconoce que habrá una situación nunca antes vista.\nHablando el jueves desde su casa en Arizona, Francona confió en que cualquier decisión que tome la MLB privilegie las precauciones de seguridad, salud y bienestar _de jugadores y fanáticos.\n“Si llegamos a ver béisbol en algún momento, eso quiere decir que el país está comenzando a tener un sentido de normalidad, lo que sería grandioso”, dijo Francona, que está en su séptima temporada con Cleveland tras pasar ocho con Boston. “Y después, para que nosotros tengamos una temporada, todos tendremos que estar dispuestos a ser flexibles pues no vamos a tener una campaña normal. No es posible”.\nEsta semana, el comisionado Rob Manfred dijo que la MLB evaluará todas las posibilidades al explorar las opciones para realizar la temporada de 2020. Uno de los planes que se discuten concentraría a todos los equipos en Phoenix y utilizaría los estadios de entrenamiento, así como el Chase Field (casa de los Diamondbacks) y las instalaciones colegiales para los juegos.\n“La MLB ha hecho un gran trabajo de explicar, ‘si jugamos, será en el momento apropiado, si es que lo hacemos. No vamos a quitarle nada a otras personas y ciertamente la seguridad de los jugadores y familias entran en consideración’”, dijo Francona. “Tenemos que estar dispuestos a ser flexibles y dar concesiones, pues no es realista que empecemos a jugar en Cleveland de inmediato. No va a suceder”.\nOtra de las posibilidades que se evalúan es la de iniciar la temporada tarde, lo que significaría que la Serie Mundial se posponga incluso hasta finales del otoño o al inicio del invierno y se dispute en una sede neutral.\nPor el momento, Francona está atrapado en casa.\n“Con un par de mis amigos del golf nos levantamos en la mañana a caminar, lo que nunca había hecho en mi vida”, dijo Francona, quien regresó de Cleveland hace 10 días. “Hago eso. Intento nadar un poco. He visto todos los programas que hay en Netflix. Estoy harto de Netflix”.\n“Lo admito, extraño el béisbol”.", "url": "https://apnews.com/dffd6a606d964941892073a690e85d5f"}