{"authors": [], "date_download": "2020-05-04 20:28:18", "date_modify": "2020-05-04 20:28:18", "date_publish": "2020-01-22 02:19:15", "description": "BEWARE OF FALLING IGUANAS! MIAMI (AP) — You’ve heard of weather warnings about falling rain, snow and hail. But falling iguanas? It’s a thing in Florida, where the National Weather Service...", "filename": "_d26673ff60304a82a35998ba3473ece6_1588624098.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d26673ff60304a82a35998ba3473ece6_1588624098.html", "title": "AM-Prep: Kickers", "title_page": "AM-Prep: Kickers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BEWARE OF FALLING IGUANAS!\nMIAMI (AP) — You’ve heard of weather warnings about falling rain, snow and hail. But falling iguanas? It’s a thing in Florida, where the National Weather Service is warning about the possibility of iguanas tumbling to the ground. Temperatures have been falling in the Sunshine State and that can cause iguanas to be stunned — and tumble from trees. It’s expected to be warmer today, so the iguanas should be back awake.\nALASKA MAN ENCOUNTERS MOOSE WHILE TAKING OUT TRASH\nANCHORAGE, Alaska (AP) — For those who hate the idea of taking the trash out on a cold wintry night — here’s a handy excuse you might use to keep from venturing out: a moose might be out there. That happened to an Alaskan man who was taking a bag of garbage to his trash shed a couple of weeks ago. After dumping the trash, Curtis Phelps turned to leave — only to find himself hemmed in by a bull moose trying to get inside. While Phelps had company, he also had a cellphone — so he called inside to his wife to tell her of his plight. She let him know when the moose finally left. And when it did, Phelps was able to escape his own shed.\nMONEY FOUND STASHED IN THRIFT STORE PURCHASE\nOWOSSO, Mich. (AP) — In this case, one man’s castoff also was that same man’s treasure. It happened in Michigan, where a footstool donated to a Michigan thrift store ended up being sold to a man named Howard Kirby. When the footstool didn’t feel as comfortable as it should have, Kirby’s daughter-in-law did some investigation — and found the original owner had stashed $43,170 inside. The footstool became a bit more comfy, but Kirby wouldn’t be comfortable until he returned the money to the family that donated the piece. The granddaughter of the original owner said her granddad was a frugal man who always paid in cash.\nby Oscar Wells Gabriel II", "url": "https://apnews.com/d26673ff60304a82a35998ba3473ece6"}