{"authors": ["Trends Reporter"], "date_download": "2020-05-04 20:13:58", "date_modify": "2020-05-04 20:13:58", "date_publish": "2020-04-29 02:06:06", "description": "Justin Rohrwasser's body art symbolizes an extremist group whose supporters have been linked to white supremacist and anti-Muslim movements.", "filename": "entry_patriots-justin-rohrwasser-tattoo-right-wing-militia-group_n_5ea884f4c5b68fa1edcd919a_1588623238.html", "image_url": "https://img.huffingtonpost.com/asset/5ea886c62200006f0c827d06.jpeg?cache=wyltennmoa&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_patriots-justin-rohrwasser-tattoo-right-wing-militia-group_n_5ea884f4c5b68fa1edcd919a_1588623238.html", "title": "Patriots Draft Pick Says He'll Remove Three Percenters Tattoo Amid Backlash", "title_page": "Patriots Draft Pick Says He'll Remove Three Percenters Tattoo Amid Backlash | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Facing widespread backlash, New England Patriots draft pick Justin Rohrwasser says he now plans to remove a tattoo representing the Three Percenters, an anti-government extremist movement with adherents linked to Islamophobic and racist violence.\nRohrwasser, who was drafted by the NFL team in the fifth round on Saturday, told CBS Boston WBZ on Monday that he planned to get the tattoo “totally taken off my body.”\n“It’s shameful that I had it on there ignorantly,” Rohrwasser said.\nThe new Patriots kicker claimed that he only became aware on Saturday of some of the “horrific” events the group was linked to, including the white supremacist rally in Charlottesville, Virginia, in 2017. He initially told reporters over the weekend that he planned to have the tattoo covered up before stating plans to have it removed altogether on Monday.\nThe Anti-Defamation League and the Southern Poverty Law Center classifies the Three Percenters as an anti-government extremist group that’s part of a right-wing militia movement. “The reference to 3 percent stems from the dubious historical claim that only 3 percent of American colonists fought against the British during the War of Independence,” the SPLC website states.\nArmed members of the Three Percenters have made their presence known at openly racist rallies, including the one in Charlottesville. However, they sought to distance themselves from “white supremacists and Nazis” or any “racist group” in a statement after that deadly rally.\nThe group claims on its website that it is not a militia or anti-government.\n“In fact, we are very pro-government, so long as the government abides by the Constitution, doesn’t overstep its bounds, and remains ‘for the people and by the people.’”\n'That's Not Who I Am': Patriots Rookie Kicker Justin Rohrwasser Apologizes For Tattoohttps://t.co/QKiyqH9I2Q pic.twitter.com/wbnT4AZx3T — WBZ | CBS Boston News (@wbz) April 28, 2020\nRohrwasser, 23, told CBS Boston that he got the tattoo when he was 18 years old and claimed that at the time, he thought it was merely a symbol of being “patriotic.”\n“It was described to me as the percentage of colonists that rose up against the authoritarian government of the British ... and I thought, ‘Wow that’s such an American sentiment, a Patriotic sentiment,’” he said. He later noted that he comes from a military family.\nThe Washington Post reported that Rohrwasser, who also has tattoos with phrases that read “Don’t tread on me” and “Liberty or death,” told Marshall University website The Herd last year that his tattoos were “all random.”\nRohrwasser received criticism on Twitter for his tattoo and for saying that he was unaware of the group’s connections until days ago:\nPatriots kicker is a white supremacist. My bad, he tends to like white supremacist things. Carry on, nothing to see here. https://t.co/CQE0S7LKO8 — Jemele Hill (@jemelehill) April 26, 2020\n\"Just give me the most random racist tattoos you can find\" - Justin Rohrwasser to his tattoo artist https://t.co/cbYv1oTjIn — Mr Luis (@ItsMrLuis) April 25, 2020\nColin Kaepernick is denied a job b/c he peacefully protested racism.\nMeanwhile the new Patriots kicker is drafted & signed despite his overt racism.\nIt was never about the troops or the flag. It was always about refusing to confront the cancer of systemic racism. https://t.co/mRYhx611JD — Qasim Rashid for Congress (@QasimRashid) April 26, 2020\nwhen did you learn the tattoos meant something else? why didn't you cover them then?\nwhy did you once previously say your tattoos were random, when now you say you thought you were supporting the military?\nhow did you think that one symbol represented the military? — bomani (@bomani_jones) April 25, 2020", "url": "https://www.huffpost.com/entry/patriots-justin-rohrwasser-tattoo-right-wing-militia-group_n_5ea884f4c5b68fa1edcd919a"}