{"authors": ["Contract Commerce Writer"], "date_download": "2020-05-04 20:24:33", "date_modify": "2020-05-04 20:24:33", "date_publish": "2020-04-29 19:56:03", "description": "Fun games for two people, for when a puzzle just won't do.", "filename": "entry_best-board-card-games-card-games-for-two-people_l_5ea847b1c5b6cb5d81e44262_1588623873.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9a611240000ae008e9f39.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_best-board-card-games-card-games-for-two-people_l_5ea847b1c5b6cb5d81e44262_1588623873.html", "title": "Here Are The Best Board Games And Card Games For 2 People", "title_page": "Here Are The Best Board Games And Card Games For 2 People | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "HuffPost may receive a share from purchases made via links on this page. Prices and availability subject to change.\nmartince2 via Getty Images These board and card games will get you through those days when you're tired of Netflix.\nYou’ve scrolled through Twitter. You’ve gone through all your friends’ stories on Instagram. And you’ve avoided going on Facebook to see what your aunt is ranting about this time.\nSince social distancing has become the norm, your iPhone screen time is probably on the rise ― as is your time spent on Netflix, Hulu and Prime Video.\nBut, by now, you might be looking to give your eyes a much-needed break from your screens (and all those weekly Zoom happy hours) and settling into a quiet night (or nights) in with a time-consuming puzzle. The only problem? Puzzle sales have recently soared, so much so that they’re almost sold out everywhere — even at places that traditionally have them in spades, like Amazon and Target.\nLuckily, there are still lots of board and card games in stock at places like Uncommon Goods and Urban Outfitters. Lots of games are meant for just one player or for a group of three or more. So we went searching for games that can be played with at least two players, if you’re looking to pass the time with a partner or a roommate. (Of course, if you’re looking for fun two-person games that require nothing but a deck of cards, you can try rummy, gin rummy, double solitaire, crazy eights and war.)\nThere’s a pretty pink tarot card deck to give readings to your roommate and a mini Zoltar kit if you’ve always wished to ~foretell~ your fortune. You can even try your hand at a “Play the Patriarchy” game from feminist site Reductress.\nWe didn’t want to highlight the games you probably already have. Instead, we found board and card games that have a twist on a classic — like a super mini-version of “Uno” — or just look like a lot of fun— like this movie lovers’ trivia game. Bye, bye boredom.", "url": "https://www.huffpost.com/entry/best-board-card-games-card-games-for-two-people_l_5ea847b1c5b6cb5d81e44262"}