{"authors": [], "date_download": "2020-05-04 20:25:38", "date_modify": "2020-05-04 20:25:38", "date_publish": "2020-04-16 19:17:43", "description": "WINSTON-SALEM, N.C. (AP) — Wake Forest men's basketball is adding transfer help. The Demon Deacons announced Thursday that Ian DuBose would play next year as a graduate transfer from Houston...", "filename": "_4a33c24533b67acec6ff363b6165d202_1588623938.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4a33c24533b67acec6ff363b6165d202_1588623938.html", "title": "Demon Deacons adding DuBose, Wilkins as transfer help", "title_page": "Demon Deacons adding DuBose, Wilkins as transfer help", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WINSTON-SALEM, N.C. (AP) — Wake Forest men’s basketball is adding transfer help.\nThe Demon Deacons announced Thursday that Ian DuBose would play next year as a graduate transfer from Houston Baptist. In addition, Virginia Tech sophomore Isaiah Wilkins announced in a social-media post that he would transfer to his hometown school, though it’s unclear if he must sit a year due to NCAA transfer rules or could receive a waiver to play immediately.\nDuBose, a 6-foot-4 guard, averaged 19 points to lead the Southland Conference last season while also becoming that league’s men’s basketball student-athlete of the year with a 3.84 GPA. He will graduate this spring with a degree in kinesiology.\n“His size and athleticism will give us flexibility in how we can use him on the court next year and we are looking forward to seeing how his game will translate” to the Atlantic Coast Conference, coach Danny Manning said in a statement.\nWilkins, also a 6-4 guard, averaged 4.5 points over his first two seasons with the Hokies.\nThe news came a day after junior guard Chaundee Brown announced he would enter his name into the NBA draft as well as the NCAA transfer portal. Brown averaged 12.1 points and 6.5 rebounds last season.\n___\nMore AP college basketball: http://apnews.com/Collegebasketball and http://www.twitter.com/AP_Top25", "url": "https://apnews.com/4a33c24533b67acec6ff363b6165d202"}