{"authors": ["Sam Lewis", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "David Duhalde", "Paul Heideman", "Hadas Thier", "Daniel Denvir", "Lily Geismer"], "date_download": "2020-05-04 19:49:20", "date_modify": "2020-05-04 19:49:20", "date_publish": "2020-05-04 00:00:00", "description": null, "filename": "2020_05_bernie-sanders-democratic-socialists-america-dsa-organizing_1588621760.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/05/04032409/GettyImages-1133220293.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_05_bernie-sanders-democratic-socialists-america-dsa-organizing_1588621760.html", "title": "“Not Me, Us” Means Building Democratic Membership Organizations", "title_page": "“Not Me, Us” Means Building Democratic Membership Organizations", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nSince Bernie Sanders suspended his presidential campaign last month, many of his supporters are turning to the question of where the movement for political revolution goes from here. Sanders himself has been clear that he intends to continue to collect votes and delegates, and to use that leverage to push his political agenda at the Democratic Party convention. Dan Denvir recently argued that the broader Sanders campaign infrastructure must be maintained to carry on the fight, starting with a series of state-by-state virtual meetings for volunteers to decide what comes next. As Sanders supporters organize for the convention and continue this important conversation, we should keep in mind one key principle that may well be the difference between success and failure for what comes next: democracy. The next phase of the Sanders movement must find a way to continue its work through genuinely democratic, nationwide membership organizations. Only democratic organizing at a national scale — with all the challenges it entails — will allow us to truly live up to the mantle of “Not Me, Us” and continue our work for the long haul.\nWe Need a Democratic Mass Organization To figure out what that organizing should look like, we must first turn to history. Jesse Jackson’s Rainbow Coalition in the 1984 and 1988 presidential campaigns may be our closest historical parallel to the current moment. The Rainbow Coalition was the vehicle for Jackson’s two insurgent but ultimately failed primary campaigns. These campaigns, like Sanders’s, drew surprising strength from a working-class base, existing social movement infrastructure, and a significant cadre of dedicated left-wing organizers. When the second Jackson campaign ended in 1988, it was Jackson who made the decision to build an organization around himself as an individual, and the organized left was not able to shape that course of events, nor provide an organizational alternative that would have kept the movement alive. The Left groups that participated in the Rainbow coalition and might have argued for a more independent course were not unified among themselves, and although their active members numbered in the thousands, they were on the tail end of a decade of decline fueled by splits, undemocratic organizational structures, a sectarian political outlook, and a general retreat of social movements since the late 1960s. None of them were structured to embrace the many thousands of Jackson supporters who had been mobilized by his campaign or to keep the movement going independent of its leader. Sanders supporters who want to build a permanent movement should consider these lessons today. While Sanders is a uniquely principled and moral leader on the global stage, by necessity, the movement must be prepared to continue on without relying on a single individual to guide its strategy. We need a democratic organization that will allow participants themselves to chart the course of the movement.\nOrganizing After Trump As we contemplate our path forward, we should study the upsurge in organizing activity that was spurred first by the 2016 Sanders campaign and then by the massive resistance movement following Donald Trump’s reelection. Of the many thousands of grassroots initiatives that started during this time, most of the electoral groups affiliated into one of two national networks, the Sanders-linked Our Revolution and the more mainstream Indivisible. Outside of strictly electoral politics, the Women’s March became the largest protest movement in US history, Democratic Socialists of America (DSA) grew into the largest socialist organization in a century, and countless other grassroots organizing projects were initiated in every corner of the country. Surveying the uneven results of this broad resistance can give us some insight into what works and what doesn’t. The Indivisible groups continue on with some significant capacity to mobilize and can claim a major impact on the 2018 election cycle. While their initial project in 2017 emphasized holding Democrats accountable to resist the Trump administration, that independent posture has largely fallen by the wayside in favor of a narrow partisan program almost totally in line with party leadership. Their continuing success stems from being united by an extremely clear project (volunteer for Democrats) that is supported by some existing Democratic Party infrastructure. In parallel, the Sanders groups that affiliated with Our Revolution also largely turned to local electoral work after 2016, and then to supporting Bernie in 2020. Our Revolution functioned more as a campaign-in-waiting for Sanders 2020 than as an organization whose members collectively set a national strategy. As David Duhalde argued recently in Jacobin , both its structure and its priorities prevented Our Revolution from becoming the dynamic mass organization we need to advance the political revolution moving forward. But both Indivisible groups and Our Revolution groups have been able to continue on, thanks to having a unified analysis and straightforward project. People join with the intent to volunteer for mainstream Democrats or Sanders-style insurgents, respectively, and they get what they are looking for. Other groups have fared much worse. The Women’s March was torn apart by the tensions between a left-wing social movement leadership and a significant portion of the mobilization’s heterogeneous base united only by opposing Trump. Without fora for debate and democratic decision-making structures to navigate these tensions, the organization was riven by controversy, and mobilizations declined precipitously. And beyond the familiar names of Indivisible, the Women’s March, and Our Revolution, there were tens of thousands of email lists, WhatsApp groups, resistance projects, community meetings, and many other initiatives that exploded in late 2016 and early 2017. The overwhelming majority simply no longer exist. One lesson of late 2016 and 2017 is that an upsurge of activity and a shared desire to do good is not enough to make meaningful political change in the long run. Without a clear shared project or a democratic organizational infrastructure through which members can determine priorities, make plans, coordinate actions, and evaluate successes and failures, grassroots groups are likely to fail to retain engagement and often fade away altogether.", "url": "https://jacobinmag.com/2020/05/bernie-sanders-democratic-socialists-america-dsa-organizing"}