{"authors": [], "date_download": "2020-05-04 16:58:16", "date_modify": "2020-05-04 16:58:16", "date_publish": "2020-04-09 13:43:39", "description": "An intensifying storm system is moving across the Northeast Thursday, bringing significant snowfall, gusty winds, cooler temperatures and severe storms.", "filename": "2020_04_09_weather_noreaster-snow-severe-storm-forecast_index_1588611496.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409090441-weather-noreaster-storm-wind-card-20200409-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_weather_noreaster-snow-severe-storm-forecast_index_1588611496.html", "title": "New York weather: Severe storms likely, as a nor'easter develops off the New England coast", "title_page": "New York weather: Severe storms likely, as a nor'easter develops off the New England coast - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) An intensifying storm system is moving across the Northeast Thursday, bringing significant snowfall, gusty winds, cooler temperatures and severe storms.\nAs the storm moves off the coast, it will develop into a late-season nor'easter bringing feet of snow to interior New England through Friday.\nSome localized spots of northern Maine and New Hampshire may even see up to two feet of snow, the Weather Prediction Center (WPC) says.\nIt will pick up in intensity throughout the day Thursday.\n\"Winds will also become increasingly strong leading to near whiteout conditions and drifting snow,\" the WPC says.\nThe overall wind threat associated with this storm system is broad.\nNearly 80 million are under wind advisories, stretching from Chicago to Boston and down the coast to Atlanta, where winds of 30 to 40 mph are likely.\nSevere storms move through New York at midday\nWinds will be even stronger in the line of storms that develops along the cold front that trails to the south of the storm's low-pressure center.\nThis line of severe thunderstorms will rush through the Northeast metros about midday.\n\"A line of storms will move through early this afternoon, bringing the threat for damaging winds,\" says CNN meteorologist Dave Hennen.\nThe Storm Prediction Center has issued a severe thunderstorm watch that includes the New York City, Philadelphia, Baltimore and Washington metro areas until 4 p.m. this afternoon.\n\"The strongest storm could bring damaging winds of up to 70 mph and may bring power outages to the region,\" Hennen says.\nThere is a slight risk -- level 2 of 5 -- for severe storms that include New York City and Philadelphia.\nStorms will develop in Texas on the southern side of the storm\nThe tail end of the front stemming from the Northeast storm will lead to intense storms this afternoon.\nIn parts of southeast Texas, the threat for severe storms is higher, where an enhanced risk -- level 3 of 5 -- exists south of Houston.\n\"Storms will fire midafternoon over central Texas and spread towards the southeast with damaging winds and hail,\" Hennen says. \"Even an isolated tornado is possible.\"\nAfter a break on Friday, storms will return this weekend.\nStorms will begin on Saturday in Texas.\n\"The severe threat will increase on Easter Sunday over much of the Southeast, where tornadoes will become increasingly likely,\" Hennen says.\nAn outbreak of severe thunderstorms appears possible Sunday (4/12) across parts of LA, MS, AL, FL, and possibly into GA by Sunday night. Tornadoes (potentially strong/long-tracked) and widespread damaging winds are expected to be the primary hazards. #lawx #mswx #alwx #flwx #gawx pic.twitter.com/6EooplLxfb — NWS SPC (@NWSSPC) April 9, 2020\nCooler air will rush in behind Thursday's cold front\nA colder and drier air mass will rush in behind the cold front on Thursday.\n\"By Friday, much of the eastern half of the country will be 10 to 20 degrees below normal,\" Hennen says.\nThis will last through week's end.\n\"Morning lows will hover around freezing in portions of the Midwest Friday morning and across the Ohio Valley and Mid-Atlantic Saturday morning,\" the WPC says.", "url": "https://www.cnn.com/2020/04/09/weather/noreaster-snow-severe-storm-forecast/index.html"}