{"authors": [], "date_download": "2020-05-04 20:23:47", "date_modify": "2020-05-04 20:23:47", "date_publish": "2020-04-16 20:57:29", "description": "SILVERTHORNE, Colo. (AP) — Rescue crews in Colorado have said a backcountry skier was killed in an avalanche on Red Mountain near Silverthorne. The volunteers responded to the...", "filename": "_ca3cbf13839d7d7be927ebd71d6bc75f_1588623827.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ca3cbf13839d7d7be927ebd71d6bc75f_1588623827.html", "title": "Colorado skier killed in avalanche north of Silverthorne", "title_page": "Colorado skier killed in avalanche north of Silverthorne", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SILVERTHORNE, Colo. (AP) — Rescue crews in Colorado have said a backcountry skier was killed in an avalanche on Red Mountain near Silverthorne.\nThe volunteers responded to the skier-triggered avalanche Wednesday after a personal emergency beacon placed on the mountain was activated, the Summit Daily News reported.\nThree men were on their way down the mountain when a shallow avalanche broke near the most uphill skier, authorities said. All three skiers were experienced and carrying proper backcountry gear, including avalanche beacons, shovels and probe poles.\n“The one who was standing right where the crack occurred didn’t actually take a tumble,” Summit County Rescue Group spokesman Charles Pitman said. “The one who was right below him managed to roll over and right himself onto his skis. But by the time he looked for the third individual, he couldn’t see him.”\nThe third man sustained fatal injuries while being carried about 1,800 feet (550 meters), authorities said. Neither of the other skiers suffered notable injuries.\nThe rescue crew decided to wait for better weather to send a team searching for the body, likely by Friday or Saturday, Pitman said.\n“It’s going to be an extensive operation. We didn’t feel comfortable putting our search and rescue personnel out there with heightened risk factors,” he said.\nThe Summit County coroner’s office is expected to release the dead man’s identity once his family is notified.", "url": "https://apnews.com/ca3cbf13839d7d7be927ebd71d6bc75f"}