{"authors": [], "date_download": "2020-05-04 20:26:46", "date_modify": "2020-05-04 20:26:46", "date_publish": "2020-04-20 16:04:32", "description": "SOUTH KINGSTOWN, R.I. (AP) — The University of Rhode Island's business school has received a $6 million gift from a couple who graduated in 1974, the school announced Monday. The gift from...", "filename": "_dfb8bc1f8cfb1750a67d1fd53e2eb26d_1588624006.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dfb8bc1f8cfb1750a67d1fd53e2eb26d_1588624006.html", "title": "URI School of Business receives $6M gift", "title_page": "URI School of Business receives $6M gift", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SOUTH KINGSTOWN, R.I. (AP) — The University of Rhode Island’s business school has received a $6 million gift from a couple who graduated in 1974, the school announced Monday.\nThe gift from S. Kent Fannon and Diane Chace Fannon will be used to renovate and expand Ballentine Hall, the business school’s main building, and for the creation of a student success center that will be named for the Fannons.\nThey have also committed an additional $50,000 for the College of Business Annual Fund.\nA key element of the gift is a $500,000 challenge for the Ballentine Hall project. The Fannons will match all new private contributions to the design portion of the renovation up to that amount. The university is in the planning phase of a multiyear project to add new teaching and learning spaces to the existing facility.\nThe student success center will house the latest technology for job interview training, host executives-in-residence, and welcome corporate partners who will be on site working with students.\nThe Fannons, who currently live in Texas, are long-time financial supporters of the university. Kent Fannon is semi-retired as a partner at executive search firm Chartwell Partners. Diane Fannon recently retired as principal at The Richards Group, an advertising agency.", "url": "https://apnews.com/dfb8bc1f8cfb1750a67d1fd53e2eb26d"}