{"authors": [], "date_download": "2020-05-04 20:04:48", "date_modify": "2020-05-04 20:04:48", "date_publish": "2020-04-10 01:29:19", "description": "OAKLAND, Calif. (AP) — Five Oakland police officers facing termination over the fatal shooting of a homeless man lost an important step in their disciplinary process when a hearing officer...", "filename": "_19c902caf3e0721deaea0be678660d2c_1588622688.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_19c902caf3e0721deaea0be678660d2c_1588622688.html", "title": "Oakland officers lose discipline hearing over fatal shooting", "title_page": "Oakland officers lose discipline hearing over fatal shooting", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "OAKLAND, Calif. (AP) — Five Oakland police officers facing termination over the fatal shooting of a homeless man lost an important step in their disciplinary process when a hearing officer affirmed a recommendation that they be fired, according to a news report Thursday.\nThe hearing officer, Michael Gennaco, agreed with the Oakland Police Commission’s finding that the officers should lose their jobs because of their actions on March 11, 2018, when they shot and killed Joshua Pawlik.\nGennaco’s report is not the final step in the disciplinary process, the Bay Area News Group reported. The officers have the right to have an outside arbitrator review the case.\nPawlik was found unconscious with a gun between two houses. Police said he raised the gun and pointed it at them when four officers opened fire.\nThe Pawlik family’s attorney disputed the officers’ interpretation that Pawlik was about to fire his gun.\nLast year, the civilian police commission moved to terminate the officers.\nFour of the officers — William Berger, Brandon Hraiz, Craig Tanaka and Sgt. Francisco Negrete — fired guns and Officer Josef Philips shot a bean bag.\nThe Alameda County District Attorney’s Office, which reviews all fatal shootings by police, concluded no crime was committed.", "url": "https://apnews.com/19c902caf3e0721deaea0be678660d2c"}