{"authors": [], "date_download": "2020-05-04 16:09:26", "date_modify": "2020-05-04 16:09:26", "date_publish": "2020-04-02 20:20:19", "description": "The Nintendo Switch may very well be one of the most versatile systems ever released. From its innovative hybrid console/handheld design to its expansive collection of game releases, it's been a crowd-pleasing favorite ever since debuting in 2017. And even more people joined the Nintendo family with the Switch Lite -- a $199.99 take on the Switch that is just a handheld. You an also lock in an order for the Nintendo Switch ($299.99), but it's back ordered nearly everywhere.", "filename": "2020_04_02_cnn-underscored_best-nintendo-switch-games-2020_index_1588608566.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402143750-underscored-switch-games-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_cnn-underscored_best-nintendo-switch-games-2020_index_1588608566.html", "title": "Best Nintendo Switch Games 2020", "title_page": "Best Nintendo Switch Games 2020 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "The Nintendo Switch may very well be one of the most versatile systems ever released. From its innovative hybrid console/handheld design to its expansive collection of game releases, it's been a crowd-pleasing favorite ever since debuting in 2017. And even more people joined the Nintendo family with the Switch Lite -- a $199.99 take on the Switch that is just a handheld. You an also lock in an order for the Nintendo Switch ($299.99), but it's back ordered nearly everywhere.\nWe already know the Switch itself is a home run — but what about the games? There's a little something for everyone on this diminutive system, from colorful platformers to sprawling, heartrending role-playing games with expansive worlds. And you can play a ton by inserting a microSD card for extra storage. Plus you can play with friends by opting for online play with Nintendo Switch Online.\nExercise games, massive brawlers and even life sims where you feel as though you could jump right in and live an entirely different life — this system has it all. Whether you just picked up a Switch to enjoy this wide variety of titles while the world stays home during the current pandemic, or you want to expand your library, here are some of the best Nintendo Switch games currently available for any type of gamer. Get cozy, because some of these games will keep you entertained for quite some time.\nAnimal Crossing: New Horizons ($59.99; amazon.com)\nAnimal Crossing: New Horizons\nEscape the perils of everyday life by losing yourself in a new world on your own island paradise. Animal Crossing: New Horizons is a laid-back simulation game that lets you retreat to a fun new home surrounded by animal villagers. Wake up each day and go fishing, catch bugs, pick fruit, or craft some awesome new items to decorate your home with. Invite your real-life friends over for a stroll through your town, or keep it closed off so you can enjoy a stress-free facsimile of your own life, with 200% more hilarious animal pals. This is the first time the Animal Crossing series has ever been on the Switch, and it's quickly taken the world by storm. Fall in love with it on your own when you jump in and see just how awesome island living can be. You can read our full review here.\n_______________________________________________________________________________\nSuper Mario Odyssey ($54.90, originally $59.99; amazon.com)\nSuper Mario Odyssey\nMario's very first outing on the Nintendo Switch is a globe-trotting adventure that has him running all over the world to stop Bowser from forcing Princess Peach to marry him. Mario's got a new sidekick named Cappy, who lets the plumber take over any character in the game, for some fun new hijinks. Plus, it steps outside the Mushroom Kingdom to introduce dozens of new locales — like beaches with water made of soda, and 2D areas where 3D Mario flattens out for some retro platforming — and does this all to great effect. This is the definitive Mario experience on Switch, and should attract a wide variety of players.\n_______________________________________________________________________________\nFire Emblem: Three Houses ($59.99; amazon.com)\nFire Emblem: Three Houses\nFire Emblem meets the world of dating sims in this inventive new entry in the long-running tactical RPG series. It puts you in the shoes of a professor who's assigned to teach one of three classes of students from rival nations the basics of combat, in a bid to prepare them for the coming war. It may sound stuffy, but it's the most accessible game of the series, offering fun social simulation and time management elements similar to those seen in titles like Persona. It's an exciting and challenging game to take on the go, and the fact that it's on Switch makes it all the better.\n_______________________________________________________________________________\nPokémon Sword ($59.99, amazon.com) and Pokémon Shield ($59.99 amazon.com)\nPokémon Sword\nPokémon finally got two new core entries on the Switch with both Sword and Shield, and a slew of new monsters to go with them. It also includes a whole new area to explore and new ways to battle. Pokémon can grow to massive size by way of a new Dynamax phenomenon, and gym battles are much more like stadium events. It's a bombastic, exciting new way to play, even for those who have been around since the original Game Boy entries. The future of Pokémon looks exceedingly bright with the cavalcade of niceties done to make things more convenient for trainers, and all of the creative new monsters. Don't worry, though — you still gotta catch 'em all.\n_______________________________________________________________________________\nSuper Smash Bros. Ultimate ($59.99; amazon.com)\nSuper Smash Bros. Ultimate\nSuper Smash Bros. Ultimate takes everything you've ever loved about this ambitious crossover series and pumps it up to 11. It features 74 characters to unlock and brawl with, as you beat Pokémon's Pikachu to a pulp with Metal Gear Solid's Snake, or steal the show with Persona 5's Joker after beating the pants off of Kirby's King Dedede. It's a collection of fighters and characters from throughout Nintendo's storied history, with plenty of third-party title friends along for the ride. It's the biggest, most exciting Smash yet, and even if you skip out on the multiplayer battles, its surprisingly deep single-player story mode will keep you busy for hours.\n_______________________________________________________________________________\nLuigi's Mansion 3 ($59.99; amazon.com)\nLuigi's Mansion 3\nMario's had years to shine in the spotlight. It's time for Luigi to take center stage in a new adventure, and this fun little journey through a haunted hotel is better than it has any right to be. The first Luigi's Mansion entry on the Nintendo Switch is a hilarious, spooky adventure for the taller Mario brother. Luigi has to venture into a haunted high-rise hotel and clear each level of ghosts he finds there with a special vacuum of sorts: the Poltergust. It's not terribly different from previous Luigi's Mansion excursions — save for the odd \"Gooigi\" companion that can assist you and Luigi throughout your time in the haunted hotel — but it'll definitely put a smile on your face.\n_______________________________________________________________________________\nSuper Mario Maker 2 ($57.45; amazon.com)\nSuper Mario Maker 2\nIf you're a Mario fan, the allure of creating your own levels in the iconic platformer's world cannot be understated. We had a glimpse of greatness at the concept on the Wii U when Super Mario Maker first debuted, but the game's sequel, Super Mario Maker 2, lets you create bigger and better projects. Whether you're a creative soul or you just want to play what others have put together, there's plenty for you to tackle in this sky's-the-limit title. There are hundreds of levels available at any given moment online to check out: self-playing platforming levels, musical courses, and even fun nods to other Nintendo classics and game franchises. It's an extremely powerful tool, and in the hands of seasoned Mario fans, magic is made. If you're not into making your own levels, it comes packing over 100 levels in a series-first story mode to keep you entertained.\n_______________________________________________________________________________\nSnipperclips Plus: Cut it Out, Together! ($41.79; amazon.com)\nSnipperclips Plus: Cut it Out, Together!\nEver play with construction paper as a child? Snipperclips feels a lot like doing that, but solving puzzles with it, too. It's a colorful, cartoony adventure that players of all ages will no doubt enjoy. As one of the diminutive paper characters, Snip or Clip, you've got to keep snipping away at your partner (and yourself) to solve each problem presented to you, whether that means being able to get a basketball through a hoop or reaching a distant item in the level. It may not be the simplest to figure out sometimes, but it'll keep you and your partner entertained for hours.\n_______________________________________________________________________________\nThe Legend of Zelda: Breath of the Wild ($59.99; amazon.com)\nThe Legend of Zelda: Breath of the Wild\nThe Legend of Zelda: Breath of the Wild is the best we may ever get from the Zelda series, and that's saying a lot. It takes some of the games' earlier concepts and expands them with concepts found in modern open-world RPGs to create something bold, fresh and new. As you're left to guide Link through a regressive vision of the kingdom of Hyrule to keep the villainous Ganon from wreaking havoc once more on the world, you're faced with a series of quests and missions to complete. Each step forward through the gorgeous land of Hyrule is a real treat, and the expansive world means you're always discovering something new, so there's always a reason to keep playing.\n_______________________________________________________________________________\nSplatoon 2 ($59.99; amazon.com)\nSplatoon 2\nStaying fresh? You soon will be when you dive into the colorful world of Splatoon 2. Jump into this addictive adventure as a squid/human hybrid and start inking everywhere, alone or with friends along for the ride. Whether in single-player or multiplayer modes, you'll shoot, roll, and spray rainbow-hued ink using a variety of guns, rollers and bombs. It's even deeper the second time around, with plenty of unlockables, customization options, and players online at all times of the day to rumble with. Oh, and you're going to love the soundtrack.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/02/cnn-underscored/best-nintendo-switch-games-2020/index.html"}