{"authors": ["Jodi Upchurch"], "date_download": "2020-05-04 16:56:35", "date_modify": "2020-05-04 16:56:35", "date_publish": "2020-04-09 10:23:35", "description": "Today is Maundy Thursday. In the Bible, this is the day when the Last Supper takes place, and it marks the moment that Jesus established the sacrament of the Eucharist, which is now part of every mass.", "filename": "2020_04_09_us_maundy-thursday-explained-trnd_index_1588611395.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/130328183141-pope-kissing-foot-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_us_maundy-thursday-explained-trnd_index_1588611395.html", "title": "Maundy Thursday -- explained", "title_page": "Maundy Thursday -- explained - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The week leading up to Easter is called Holy Week. It begins with Palm Sunday and ends on Holy Saturday, but each day in between comes with its own name and celebrations.\nToday is Maundy Thursday. In the Bible, this is the day when the Last Supper takes place, and it marks the moment that Jesus established the sacrament of the Eucharist, which is now part of every mass. The Last Supper also included a ceremony in which Jesus washed the feet of his disciples. It marks the foundation of the priesthood.\nLeonardo da Vinci's \"Last Supper.\"\nThe day gets it name from the Latin word \"mandatum,\" meaning commandment.\nIt is a reference to what Jesus tells his disciples during the Last Supper: \"A new commandment I give you, that you love one another; even as I have loved you, that you also love one another.\" (John 13:34, Revised Standard Version).\nMaundy Thursday is considered a somber time in the Christian faith for all denominations of the religion, including the Catholic and Protestant traditions. Following the Last Supper and the original Eucharist, Jesus would be betrayed by Judas. Despite the celebratory nature of Palm Sunday, which marks the start of Holy Week and is when Jesus triumphantly entered Jerusalem, Holy Thursday represents the steps leading to the crucifixion.\nRead More", "url": "https://www.cnn.com/2020/04/09/us/maundy-thursday-explained-trnd/index.html"}