{"authors": [], "date_download": "2020-05-04 17:01:41", "date_modify": "2020-05-04 17:01:41", "date_publish": "2020-04-09 21:31:21", "description": "Hand-painted portraits can add texture to your gallery wall, give a room a unique finish and preserve an important figure in your life for the rest of time.", "filename": "2020_04_09_cnn-underscored_paint-your-life_index_1588611701.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409142057-paint-your-life-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_cnn-underscored_paint-your-life_index_1588611701.html", "title": "Paint Your Life: Turn your favorite family photo into a stunning, handmade portrait", "title_page": "Paint Your Life: Turn your favorite family photo into a stunning, handmade portrait  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored partnered with Paint Your Life to create this content. When you make a purchase, CNN receives revenue. CNN news staff is not involved at all in the selections or product reviews. For more on what we do and how we do it, visit our About Us page.\nBefore the age of DSLR cameras and Instagram, when people wanted to capture and display their cherished memories, they'd do so using brushes and paint. And with the ease, accessibility and sheer abundance of digital prints out there (from holiday cards and wedding photos, to family vacation memories, customized fridge magnets, and everything in between), its time to revisit those good old days.\nHand-painted portraits can add texture to your gallery wall, give a room a unique touch and honor an important figure in your life. Plus, they make an especially great gift for family and friends (trust us, you'll win Mother's Day with one of these personalized paintings in hand).\nAnd unlike the olden days of portrait painting, where you'd be required to sit very, very still for hours on end, the modern age of portrait painting is as simple as sending a photo to the artist of your choice and waiting for your final creation to be delivered to your doorstep.\nPaint Your Life helps facilitate this by connecting real artists to its customers, making the process of creating a unique, handcrafted portrait easier than ever. And since its inception in 2006, thousands of customers have received a unique painting of their own; it has a nearly perfect 4.9-star review from over 3,000 customers.\nFor the uninitiated, here's a breakdown of Paint Your Life's services.\nWhat is Paint Your Life?\nEach painting is hand crafted by a professional studio painter.\nPaint Your Life is a portrait service that takes your photographic memories and turns them into stunning, handmade oil portraits that you can hang throughout your home. Each painting is hand crafted by a professional studio painter (you can see the full roster and portfolios of current artists here), who can recreate your family photos in different mediums, including charcoal, watercolor, pencil, pastel and acrylic paints. Customers have memorialized a variety of snaps, including pictures of their weddings, furry friends, favorite landscapes, family members and even themselves.\nHow does the service work?\nFor those who need photos restored, Paint Your Life will do so before starting the order.\nCustomers simply choose the size of their painting (options start at 8 inches by 10 inches and can be as tall as 48 inches by 72 inches), the subject of the portrait and the medium. They then upload the photo of their choice to the site, and the Paint Your Life artists get to work.\nUnlike other services, customers have full say in the creation process from beginning to end. For those who need photos restored, Paint Your Life will do so before starting the order, and if you want to bring vibrancy to a black and white picture, Paint Your Life will also create the portrait in color. Both services are free.\nOnline proofs are uploaded to the site, allowing users to see the painting and give feedback or request alterations throughout the process. And even before the painting reaches your hands, the artwork is appraised by other artists to ensure its quality.\nPrices for Paint Your Life start at $179 and the turnaround time ranges from 14 to 21 days. Plus, when you use the promo code MD50, you will get $50 off your purchase and free shipping through April 31.\nWhat other benefits are there to Paint Your Life?\nPaint Your Life also boasts an unlimited amount of revisions while your work is being created.\nOn top of all of the aforementioned services, Paint Your Life boasts an unlimited amount of revisions while your work is being created, free shipping and a 100% money back guarantee if you aren't thrilled with the final product.\nWhat are customers saying?\nOther honorary mentions from customers include the overall craftsmanship and framing options Paint Your Life provides.\nUniqueness aside, what has truly impressed us about Paint Your Life are the company's stellar reviews. On TrustPilot alone, it has a 4.9-star rating from over 3,000 customers.\nMany of the reviews focus on the helpful review process. As one past reviewer writes, \"As always I was skeptical, but they [Paint Your Life] give you complete autonomy at every step of the process, including the finished painting. The results surpassed my expectations!\" Another customer writes, \"I absolutely love my painting! The artist was able to capture the personality and essence of my dog in such a remarkable way. I also appreciated being kept informed every step of the way.\"\nOther honorable mentions from customers include the overall craftsmanship and framing options Paint Your Life provides, and many reviewers have noted that they have used the service more than once.\nOur verdict\nSince Paint Your Life's inception in 2006, thousands of customers have received a unique painting of their own.\nConsidering the level of customer service and craftsmanship you receive with each Paint Your Life Portrait, we're completely sold on the service. Moreover, we think it makes for one of the most memorable Mother's Day presents yet.\nWith the holiday right around the corner, ordering a Paint Your Life creation now means that it will be delivered and ready to be wrapped before May 10. Talk about good timing.\nTo order a handcrafted portrait of your own or to learn more about Paint Your Life, click here.", "url": "https://www.cnn.com/2020/04/09/cnn-underscored/paint-your-life/index.html"}