{"authors": [], "date_download": "2020-05-04 20:10:49", "date_modify": "2020-05-04 20:10:49", "date_publish": "2020-04-17 01:21:00", "description": "LOS ANGELES (AP) — California wildlife regulators voted Thursday to move forward on a proposal to give state Endangered Species Act protections to certain mountain lion populations that have...", "filename": "_46137721544fa626e4b317bbae3c0695_1588623049.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_46137721544fa626e4b317bbae3c0695_1588623049.html", "title": "California to review protections for mountain lions", "title_page": "California to review protections for mountain lions", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOS ANGELES (AP) — California wildlife regulators voted Thursday to move forward on a proposal to give state Endangered Species Act protections to certain mountain lion populations that have become vulnerable because of development and other human activities.\nThe state Fish and Game Commission voted unanimously in favor of a petition to start a one-year review to determine whether six lion populations in Southern California and on the Central Coast should be formally protected. The act’s protections apply during the study period.\nCurrently, California’s mountain lions are not considered threatened or endangered. They are legally classified as a “specially protected species” under a voter-approved 1990 ballot measure that makes it illegal to hunt the big cats, according to the Department of Fish and Wildlife.\nThe killing of mountain lions is only allowed when a depredation permit is issued to target a specific cougar that has been killing livestock or pets, to preserve public safety or to keep protected bighorn sheep safe.\nThe proposal to include the six puma populations in the Endangered Species Act was made last year in a petition by the nonprofit Center for Biological Diversity.\nTiffany Yap, a biologist at the center and primary author of the petition, called the vote “a historic moment for California’s big cats.”\nThe center points to research showing the populations are threatened because of genetic isolation caused by roads and sprawling development that impedes movement as well as low survival rates due to being struck by vehicles, poisonings and sanctioned depredations.\nAccording to the center, researchers believe mountain lion populations in the Santa Ana and Santa Monica mountains could become extinct within 50 years without protection, and there are similar concerns for pumas in the Santa Cruz, San Gabriel and San Bernardino mountains.\nDozens of mountain lions in and around the Santa Monica Mountains have been studied by the National Park Service since 2002.", "url": "https://apnews.com/46137721544fa626e4b317bbae3c0695"}