{"authors": [], "date_download": "2020-05-04 20:26:24", "date_modify": "2020-05-04 20:26:24", "date_publish": "2020-04-15 17:43:50", "description": "KNOXVILLE, Tenn. (AP) — The Tennessee Volunteers have added forward E.J. Anosike as a graduate transfer, bringing an experienced player into their already highly ranked recruiting class....", "filename": "_94676d74ab559cd940aabef3383de4f5_1588623984.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_94676d74ab559cd940aabef3383de4f5_1588623984.html", "title": "Tennessee adds graduate transfer forward E.J. Anosike", "title_page": "Tennessee adds graduate transfer forward E.J. Anosike", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "KNOXVILLE, Tenn. (AP) — The Tennessee Volunteers have added forward E.J. Anosike as a graduate transfer, bringing an experienced player into their already highly ranked recruiting class.\nTennessee announced Anosike’s transfer Wednesday.\nThe 6-foot-6, 245-pound forward from East Orange, New Jersey, graduates from Sacred Heart in May. He will enroll at Tennessee this summer after ranking sixth nationally in rebounding, averaging 11.6 per game. He also led his team in scoring at 15.7 points and and has 27 career double-doubles.\n“Aside from being a great person from a great family, E.J. brings experience and toughness,” coach Rick Barnes said. “Anyone who averages a double-double for an entire season and displays the versatility he has is impressive. He also plays with tremendous competitive spirit, which is valuable for any team.”\nAnosike is the brother of Nicky Anosike, who won two national titles with the Lady Vols’ basketball program between 2004-08. He will wear her No. 55 at Tennessee.\nHe is the fourth player in Tennessee’s recruiting class, including a pair of five-star players in Keon Johnson and Jaden Springer. That has Tennessee’s class ranked fourth nationally by 247Sports.\n___\nMore AP college basketball: https://apnews.com/Collegebasketball and https://twitter.com/AP_Top25", "url": "https://apnews.com/94676d74ab559cd940aabef3383de4f5"}