{"authors": [], "date_download": "2020-05-04 20:17:05", "date_modify": "2020-05-04 20:17:05", "date_publish": "2020-04-09 07:52:29", "description": "MOSCOW (AP) — A fire in a retirement home in Moscow killed four people and injured 16 others but firefighters managed to rescue 50 people from the burning building, emergency officials said...", "filename": "_387f28fb2fb320489c60db8d1cef9045_1588623425.html", "image_url": "https://storage.googleapis.com/afs-prod/media/08399268c9664e798bb9503736968a9b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_387f28fb2fb320489c60db8d1cef9045_1588623425.html", "title": "Fire at Moscow retirement home kills 4, leaves 16 injured", "title_page": "Fire at Moscow retirement home kills 4, leaves 16 injured", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Emergency situation employees gather during a fire at a retirement home, housing elderly people with limited mobility, in Moscow, Russia, Thursday, April 9, 2020. A fire in a retirement home in Moscow killed around four people and injured more then ten others, but firefighters managed to rescue 50 people from the burning building, emergency officials said Thursday. (Kirill Voronin, Moscow News Agency photo via AP)\nEmergency situation employees gather during a fire at a retirement home, housing elderly people with limited mobility, in Moscow, Russia, Thursday, April 9, 2020. A fire in a retirement home in Moscow killed around four people and injured more then ten others, but firefighters managed to rescue 50 people from the burning building, emergency officials said Thursday. (Kirill Voronin, Moscow News Agency photo via AP)\nMOSCOW (AP) — A fire in a retirement home in Moscow killed four people and injured 16 others but firefighters managed to rescue 50 people from the burning building, emergency officials said Thursday.\nThe fire broke out Wednesday night in the basement of the building and quickly spread to the ground floor. It was most likely caused by a malfunctioning electric cable, authorities said.\nThe retirement home in northwest Moscow housed elderly people with limited mobility, according to Russian media reports.\nFifteen men and women aged 66-90 remained hospitalized on Thursday with injuries from burns and smoke inhalation, the Interfax news agency reported. All were reported in grave condition, and four were put on ventilators, Interfax said. One person was apparently discharged.\nPolice have launched a criminal probe into the fire.", "url": "https://apnews.com/387f28fb2fb320489c60db8d1cef9045"}