{"authors": ["Lisa Respers France"], "date_download": "2020-05-04 16:21:12", "date_modify": "2020-05-04 16:21:12", "date_publish": "2020-03-27 16:52:47", "description": "We are all in this together.", "filename": "2020_03_27_entertainment_netflix-hulu-amazon-april_index_1588609272.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200209212427-parasite-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_27_entertainment_netflix-hulu-amazon-april_index_1588609272.html", "title": "April 2020 streaming: What's new on Netflix, Hulu and Amazon", "title_page": "April 2020 streaming: What's new on Netflix, Hulu and Amazon - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Photos: Never has there been a time when we were more in need of distraction. Fortunately there's a lot to stream in April, including the return of Ricky Gervais in \"After Life\" Season 2. Set in the small fictitious town of Tambury, the Netflix series follows Tony (Gervais) after a life-altering tragedy. You wouldn't think that would be funny, but it is. Here's some of what else is streaming... Hide Caption 1 of 37\nPhotos: \"#blackAF\": Kenya Barris and Rashida Jones star in this family comedy series inspired by Barris's irreverent, highly flawed, unbelievably honest approach to parenting, relationships, race and culture. (Netflix) Hide Caption 2 of 37\nPhotos: \"What We Do In The Shadows\" Season 2: This comedy follows four vampires who've \"lived\" together for hundreds of years. In Season 2, the vampires will try to find their way in a world of human Super Bowl parties, internet trolls, an energy vampire who gets a promotion and becomes drunk on power and of course, all the ghosts, witches, necromancers, zombies and shadowy cloaked assassins who roam freely in the Tri-State area. (Hulu) Hide Caption 3 of 37\nPhotos: \"Stuber\": A mild manner Uber driver ends up getting taken for a wild ride when his passenger turns out to be a cop hot on the trail of a killer. (HBO Now) Hide Caption 4 of 37\nPhotos: \"The Last Kingdom\" Season 4: As Edward and Aethelflaed spar over the future of Mercia and their father's dream of a united England, Uhtred tries to recover his lost birthright in this historical fiction series based on Bernard Cornwell's The Saxon Stories series of novels. (Netflix) Hide Caption 5 of 37\nPhotos: \"Halston\": Director Frédéric Tcheng zooms in on the life of Roy Halston Frowick, the designer whose meteoric rise in the 1970s forever changed American fashion. (Amazon Prime) Hide Caption 6 of 37\nPhotos: \"Les Misérables\": Inspired by the 2005 riots in Paris, this film follows Stéphane (Damien Bonnard), a recent transplant to the impoverished suburb of Montfermeil, as he joins the local anti-crime squad. Working alongside his unscrupulous colleagues Chris (Alexis Manenti) and Gwada (Djebril Zonga), Stéphane struggles to maintain order amidst the mounting tensions between local gangs. (Amazon Prime) Hide Caption 7 of 37\nPhotos: \"Community\" Seasons 1-6: Before he was also known as the rapper Childish Gambino, Donald Glover was the star of this critically acclaimed comedy series. (Netflix) Hide Caption 8 of 37\nPhotos: \"The Lighthouse\": Robert Pattinson and Willem Dafoe star as lighthouse keepers who fight each other for survival and sanity on a remote and mysterious New England island in the 1890s. (Amazon Prime) Hide Caption 9 of 37\nPhotos: \"90 Day Fiance: Happily Ever After?\" Season 4: Couples from different countries meet, fall in love and attempt to make a go of it in this popular TLC reality series. (Hulu) Hide Caption 10 of 37\nPhotos: \"Dragged Across Concrete\": After being suspended without pay for using excessive force, two rogue cops hatch a scheme to rip off a drug dealer in this thriller. (HBO Now) Hide Caption 11 of 37\nPhotos: \"Bosch\" Season 6 : After a medical physicist is executed and the deadly radioactive material he had with him goes missing, Detective Harry Bosch finds himself at the center of a complex murder case, a messy federal investigation, and a catastrophic threat to Los Angeles -- the city he's pledged to serve and protect. (Amazon Prime) Hide Caption 12 of 37\nPhotos: \"Never Have I Ever\": A coming-of-age comedy series about the life of a modern first-generation Indian American teenage girl, inspired by Mindy Kaling's own childhood. (Netflix) Hide Caption 13 of 37\nPhotos: \"Parasite\": Greed, class discrimination and a mysterious interloper threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan. Director Bong Joon Ho made history with his best picture Oscar win for this South Korean film, which also took home Oscars for best director, best original screenplay and best international feature film. (Hulu)\nHide Caption 14 of 37\nPhotos: \"Nailed It\" Season 3: The hosts you love, the hot messes you crave. Welcome back to the \"Nailed It!\" kitchens, where anyone — like, literally, anyone -- can win. (Netflix) Hide Caption 15 of 37\nPhotos: \"Balthazar\" Series 2 : This fascinating French crime thriller about a charismatic forensic pathologist who can make the dead speak like no one else to solve some of Paris' most enigmatic crimes stars Tomer Sisley. (Acorn TV) Hide Caption 16 of 37\nPhotos: \"Minority Report\": Tom Cruise stars in the action packed crime thriller about a future where a special police unit is able to arrest murderers before they commit their crimes. (Netflix) Hide Caption 17 of 37\nPhotos: \"The Matrix\": Will you take the red pill or the blue pill when you watch this action sc-fi starring Keanu Reeves? (Netflix) Hide Caption 18 of 37\nPhotos: \"Into The Dark\": A group of thirty-something friends from high school create their own Creepypasta about Pooka for laughs, but are shocked when it becomes so viral on the Internet that it actually manifests more murderous versions of the creature. (Hulu) Hide Caption 19 of 37\nPhotos: \"Selah and the Spades\": This Sundance Film Festival film follows the five factions that run the underground life of the prestigious Haldwell boarding school. At the head of the most powerful faction -- The Spades -- sits Selah Summers. By turns charming and callous, she chooses whom to keep close and whom to cut loose, walking the fine line between being feared and loved. (Amazon Prime) Hide Caption 20 of 37\nPhotos: \"Coffee and Kareem\": While police officer James Coffee (Ed Helms) enjoys his new relationship with Vanessa Manning (Taraji P. Henson), her beloved 12-year-old son Kareem (Terrence Little Gardenhigh) plots their break-up. Attempting to scare away his mom's boyfriend for good, Kareem tries to hire criminal fugitives to take him out but accidentally exposes a secret network of criminal activity, making his family its latest target. (Netflix) Hide Caption 21 of 37\nPhotos: \"Gorky Park\": Based on the bestselling novel by Martin Cruz Smith, a Russian police officer must find a killer after three mutilated bodies are found in Moscow's Gorky Park. (Amazon Prime) Hide Caption 22 of 37\nPhotos: \"It Chapter 2\": The sequel to the hit 2017 horror film features a star-studded cast. The children who battled evil in Derry, Maine are now adults who must once again face the horror. (HBO Now) Hide Caption 23 of 37\nPhotos: \"How to Fix a Drug Scandal\": Two drug lab chemists' shocking crimes cripple a state's judicial system and blur the lines of justice for lawyers, officials and thousands of inmates in this documentary. (Netflix) Hide Caption 24 of 37\nPhotos: \"Blazing Saddles\": Gene Wilder and Cleavon Little star in this classic satirical take on Hollywood Westerns. (Hulu) Hide Caption 25 of 37\nPhotos: \"Money Heist: The Phenomenon\": This film takes a look at why and how \"Money Heist\" sparked a wave of enthusiasm around the world for a lovable group of thieves and their professor. (Netflix)\nHide Caption 26 of 37\nPhotos: \"Tales from the Loop\": The series explores the town and people who live above \"The Loop,\" a machine built to unlock and explore the mysteries of the universe -- making things possible that were previously relegated only to science fiction. (Amazon Prime) Hide Caption 27 of 37\nPhotos: \"Future Man\" Season 3: Convicted of time crimes and sentenced to death by entertainment, Josh, Tiger, and Wolf become fugitives, on the run through time, trying desperately to evade capture while clearing their names and fixing the big mess of history they've made along the way. (Hulu) Hide Caption 28 of 37\nPhotos: \"Little Joe\": Alice (Emily Beecham), a single mother and dedicated senior plant breeder at a corporation engaged in developing new species. She engineers a special crimson flower, remarkable not only for its beauty but also because this plant makes its owner happy. Against company policy, Alice takes one home as a gift for her teenage son, Joe. They christen it 'Little Joe.' But as their plant grows, so too does Alice's suspicion that her new creation may not be as harmless as its nickname suggests. (Hulu) Hide Caption 29 of 37\nPhotos: \"Mrs. America\": Rose Byrne stars as Gloria Steinem and Tracey Ullman as Betty Friedan in this series starring Cate Blanchett which tells the story of the movement to ratify the Equal Rights Amendment (ERA), and the unexpected backlash that forever shifted the political landscape. (Hulu) Hide Caption 30 of 37\nPhotos: \"Bend It Like Beckham\": Parminder Nagra and Keira Knightley star in this romantic comedy about a young woman who rebels against her Sikh parents to join a football team. (Hulu) Hide Caption 31 of 37\nPhotos: \"Galveston\": Ben Foster and Elle Fanning star in this tale in which a hit man escapes a set up by his boss and saves a young woman in the process in this dark, harrowing thriller. (HBO Now) Hide Caption 32 of 37\nPhotos: \"Good Boys\": Yes, you can make a raunch comedy about sixth graders. Three 12-year-olds decide to skip school in an attempt to learn how to kiss in time for a kissing party. Their odyssey of epically bad decisions involves some accidentally stolen drugs, frat-house paintball, and running from both the cops and teen girls. (HBO Now) Hide Caption 33 of 37\nPhotos: \"Rambo: Last Blood\": Sylvester Stallone reprises his iconic role as Rambo as he confronts his past and unearth his ruthless combat skills to exact revenge in a final mission. (Amazon Prime) Hide Caption 34 of 37\nPhotos: \"Invisible Life\": Set in Rio de Janeiro in 1950, Eurídice, 18, and Guida, 20, are two inseparable sisters living at home with their conservative parents. Although immersed in a traditional life, each one nourishes a dream: Eurídice of becoming a renowned pianist, Guida of finding true love. In a dramatic turn, they are separated by their father and forced to live apart. (Amazon Prime) Hide Caption 35 of 37\nPhotos: \"Hotel Artemis\": Jeff Goldblum, Zachary Quinto and Jodie Foster star in this action film set in riot-torn, near-future Los Angeles about a nurse who runs a secret, members only emergency room for criminals. (Amazon Prime) Hide Caption 36 of 37", "url": "https://www.cnn.com/2020/03/27/entertainment/netflix-hulu-amazon-april/index.html"}