{"authors": ["Lisa Respers France"], "date_download": "2020-05-04 16:00:21", "date_modify": "2020-05-04 16:00:21", "date_publish": "2020-04-01 13:57:34", "description": "Try not to lick the screen. Hopefully you are staying in as much as possible right now, and if so you may be cooking more. If you are looking for some inspiration beyond grilled cheese sandwiches and canned soup, turn to these movies.", "filename": "2020_04_01_entertainment_food-movies-quarantine-cooking_index_1588608021.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/140306131808-02-food-movies-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_entertainment_food-movies-quarantine-cooking_index_1588608021.html", "title": "Food movies to inspire your quarantine cooking", "title_page": "Food movies to inspire your quarantine cooking  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Photos: \"Chef\" (2014): The Jon Favreau indie film, about a chef who returns to his native Miami to open a food truck after he fails in Los Angeles, co-stars some great food. Here are some other scrumptious films which feature food: Hide Caption 1 of 26\nPhotos: More people are cooking at home these days, though perhaps not like the spread featured in the 1987 film, \"Babette's Feast.\" Stéphane Audran stars as Babette Hersant in this sinfully decadent film about a French woman who uses an unexpected windfall to host an amazing dinner. Hide Caption 2 of 26\nPhotos: \"Like Water for Chocolate\" (1992): Marco Leonardi and Lumi Cavazos star in this Marco Leonardi and Lumi Cavazos star in this very sexy film about a forbidden love affair in Mexico in the early 1900s which causes a young woman to channel all of her passion into her cooking. Hide Caption 3 of 26\nPhotos: \"Soul Food\" (1997): Vanessa L. Williams, Irma P. Hall and Vivica A. Fox star in this family drama about a close-knit family that loves as hard as they cook and dine during their Sunday family meals. Hide Caption 4 of 26\nPhotos: \"Burnt\" (2015): Bradley Cooper stars as a troubled chef seeking redemption in this tasty flick. Hide Caption 5 of 26\nPhotos: \"The Hundred-Foot Journey\" (2014): Manish Dayal stars as Hassan Kadam, a young aspiring chef whose family restaurant is in direct competition with a nearby famed French eatery. Hide Caption 6 of 26\nPhotos: \"Big Night\" (1996): Abbondanza! This film starring Marc Anthony, Tony Shalhoub and Minnie Driver is loaded with carbs and involves a failing Italian restaurant that has a single night to turn it all around. Hide Caption 7 of 26\nPhotos: \"Eat Drink Man Woman\" (1994): Before \"Brokeback Mountain,\" Ang Lee co-wrote and directed a mouthwatering tale about a Chinese chef in Taiwan who has lost his sense of taste but still cooks elaborate meals for his three daughters. The film stars Sihung Lung and Chien-lien Wu. Hide Caption 8 of 26\nPhotos: \"Tortilla Soup\" (2001): Jacqueline Obradors, Tamara Mello and Elizabeth Peña star in this film based on Ang Lee's \"Eat Drink Man Woman.\" In this version, the chef is Mexican and must deal with the exploits of his three daughters. Hide Caption 9 of 26\nPhotos: \"Fast Food\" (1989): Kevin McCarthy is among the cast of this comedy about a sex drug that gets mixed in with the secret sauce at a burger restaurant. Hide Caption 10 of 26\nPhotos: \"The Cook, the Thief, His Wife & Her Lover\" (1989): Michael Gambon plays the thief in this crime drama about a gangster who takes over a French restaurant. Hide Caption 11 of 26\nPhotos: \"The Grande Bouffe\" aka \"La Grande Bouffe\" (1973): Andrea Ferreol and Philippe Noiret star in this smorgasbord of food and sex about a group of men who hire some prostitutes for a weekend trip in which they aim to gorge themselves to death. Hide Caption 12 of 26\nPhotos: \"Sideways\" (2004): Yes, there is plenty of wine in this movie starring Paul Giamatti and Thomas Haden Church, but you have to have food to go along with all that libation, right? Hide Caption 13 of 26\nPhotos: \"Chocolat\" (2000): A small French village doesn't know what hits it when a single mother moves to town and opens a delectable sweets shop. The film stars Juliette Binoche and Dame Judi Dench. Hide Caption 14 of 26\nPhotos: \"Ratatouille\" (2007): The animated film about a rat who can cook boasts an all-star cast that includes Patton Oswalt and Peter O'Toole. Hide Caption 15 of 26\nPhotos: \"A Matter of Taste\" aka \"Une Affaire de Gout\" (1999): Jean Pierre Lorit stars as a waiter who develops a close friendship with a wealthy businessman. Hide Caption 16 of 26\nPhotos: \"Mostly Martha\" (2001): Martina Gedeck and Sergio Castellitto star in this romantic film about a female chef who must adjust her workaholic ways after she gains custody of her young niece. Hide Caption 17 of 26\nPhotos: \"No Reservations\" (2007): The lives of Aaron Eckhart and Catherine Zeta-Jones take a turn after she becomes guardian of a young relative. It's a remake of the German film \"Mostly Martha.\" Hide Caption 18 of 26\nPhotos: \"Spanglish\" (2004): Adam Sandler and Paz Vega star in this film about a Mexican single mother who moves in as the housekeeper for a chef and his wife. Hide Caption 19 of 26\nPhotos: \"Tampopo\" (1985): Ken Watanabe and Ryutaro Otomo star in this Japanese comedy that is beloved by fans of ramen noodle soup. Hide Caption 20 of 26\nPhotos: \"Charlie and the Chocolate Factory\" (2005): Glutton Augustus Gloop (Philip Wiegratz) falls into the chocolate river as the others watch from shore in the remake of this classic childhood tale starring Johnny Depp. Hide Caption 21 of 26\nPhotos: \"Julie & Julia\" (2009): Blogger Julie Powell (played by Amy Adams) attempts to replicate the recipes of Julia Child (Meryl Streep, shown here). Hide Caption 22 of 26\nPhotos: \"Eat Pray Love\" (2010): Julia Roberts eats her way to serenity abroad in this ode to self-discovery based on the book by Elizabeth Gilbert. Hide Caption 23 of 26\nPhotos: \"The Ramen Girl\" (2009): Brittany Murphy plays an American who goes to Japan to learn how to cook noodles. Hide Caption 24 of 26\nPhotos: \"Mystic Pizza\" (1988): A young Annabeth Gish, Lili Taylor and Julia Roberts star in this coming-of-age drama about a group of girls working at a pizza parlor. Hide Caption 25 of 26", "url": "https://www.cnn.com/2020/04/01/entertainment/food-movies-quarantine-cooking/index.html"}