{"authors": ["Greg Beacham"], "date_download": "2020-05-04 20:28:31", "date_modify": "2020-05-04 20:28:31", "date_publish": "2020-04-16 20:11:36", "description": "LOS ANGELES (AP) — Southern California quarterback J.T. Daniels has entered the transfer portal. Daniels announced his plan Thursday. Coach Clay Helton says he would welcome Daniels back if...", "filename": "_e931d1184e180392393ece1fadeccff0_1588624111.html", "image_url": "https://storage.googleapis.com/afs-prod/media/5adabe195cd742659711a7b81b808b3a/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e931d1184e180392393ece1fadeccff0_1588624111.html", "title": "USC QB Daniels enters transfer portal; lost job to Slovis", "title_page": "USC QB Daniels enters transfer portal; lost job to Slovis", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - This Sept. 31, 2019 photo shows Southern California quarterback JT Daniels in an NCAA football game against Fresno State in Los Angeles. Daniels has entered the transfer portal. He announced his plan Thursday, April 16, 2020. Coach Clay Helton says the door is still open for Daniels to stay at USC, where Kedon Slovis took advantage of Daniels' knee injury to become the Trojans' starting quarterback last season. (AP Photo/Kyusung Gong)\nFILE - This Sept. 31, 2019 photo shows Southern California quarterback JT Daniels in an NCAA football game against Fresno State in Los Angeles. Daniels has entered the transfer portal. He announced his plan Thursday, April 16, 2020. Coach Clay Helton says the door is still open for Daniels to stay at USC, where Kedon Slovis took advantage of Daniels' knee injury to become the Trojans' starting quarterback last season. (AP Photo/Kyusung Gong)\nLOS ANGELES (AP) — Southern California quarterback J.T. Daniels has entered the transfer portal.\nDaniels announced his plan Thursday. Coach Clay Helton says he would welcome Daniels back if he decides to stay at USC, where Kedon Slovis claimed Daniels’ job as the Trojans’ starting quarterback last season after Daniels injured his knee.\n“It is his desire to explore all of his options going into the 2020 season,” Helton said. “We will continue to support J.T. in every way possible and help him through his decision, including the option of staying on with our football team.”\nDaniels was among the top quarterback recruits in the nation when he left Orange County’s Mater Dei High School early to join the Trojans two years ago.\nHe immediately became USC’s starter as a freshman in 2018, passing for 2,672 yards with 14 touchdowns and 10 interceptions during an inconsistent season for the quarterback and Helton’s Trojans, who dismissed several offensive assistant coaches after the season.\nDaniels won the starting job again out of camp last summer in new offensive coordinator Graham Harrell’s up-tempo scheme, but the sophomore tore a ligament in his knee in the Trojans’ season opener against Fresno State last September.\nSlovis stepped into the starting job and excelled in Harrell’s offense as a freshman, passing for 3,502 yards with 30 touchdowns and nine interceptions. The lightly recruited Arizona native was named the Pac-12′s Offensive Freshman of the Year.\nLeaving USC would be particularly tough for Daniels, a lifelong Trojans fan from the same high school that has produced several USC greats including Heisman Trophy winner Matt Leinart and four-year starting quarterback Matt Barkley.\nDaniels’ right calf is even covered in a large tattoo featuring a Trojan helmet and the famed Peristyle end of the Coliseum, USC’s home stadium.\n___\nMore AP college football: https://apnews.com/Collegefootball and https://twitter.com/AP_Top25", "url": "https://apnews.com/e931d1184e180392393ece1fadeccff0"}