{"authors": ["Brian Lowry"], "date_download": "2020-05-04 16:01:06", "date_modify": "2020-05-04 16:01:06", "date_publish": "2020-04-01 15:50:23", "description": "For those missing the great outdoors -- and wondering when travel plans will be possible again -- nature documentaries can offer a welcome escape from the tide of bad news.", "filename": "2020_04_01_entertainment_nature-documentaries_index_1588608066.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191101171740-02-bbc-american-sarah-barnett-story-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_entertainment_nature-documentaries_index_1588608066.html", "title": "From Wonderstruck to 'Elephant,' nature documentaries offer an escape to cooped-up viewers", "title_page": "From Wonderstruck to 'Elephant,' nature documentaries offer an escape to cooped-up viewers - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Being cooped up at home has inspired all kinds of adaptive behaviors and shifts in media consumption. But for those missing the great outdoors -- and wondering when travel plans will be possible again -- nature documentaries can offer a welcome escape from the tide of bad news.\nNature fare, moreover, has never been in more abundant supply on television and streaming services, with several new titles joining the mix. As a bonus, technological innovations -- including high-definition imagery and advances in filming techniques -- have produced what amounts to a golden age for such programming.\nBBC America continues to transform its weekend lineup into Wonderstruck, a showcase for British-produced documentaries such as \"Planet Earth\" and \"Blue Planet,\" many of them narrated by the extraordinary naturalist Sir David Attenborough.\nOn Tuesday, the network announced it would expand that programming beginning April 2 to two days a week and launch a free digital companion site, Wonderstrucktv.com, offering short-form videos that the network described as \"anxiety-easing content.\"\nOther networks and services are joining in as well. Disney+, for example, adds to that bounty this weekend with \"Elephant,\" a documentary about a family of elephants narrated by Meghan , The Duchess of Sussex; and \"Dolphin Reef,\" the latest film that anthropomorphizes animals produced under the Disneynature banner.\nRead More", "url": "https://www.cnn.com/2020/04/01/entertainment/nature-documentaries/index.html"}