{"authors": [], "date_download": "2020-05-04 20:05:08", "date_modify": "2020-05-04 20:05:08", "date_publish": "2020-04-08 15:00:34", "description": "ST. PAUL, Minn. (AP) — Minnesota lawmakers reached a deal Wednesday on creating a long-awaited emergency insulin program for diabetics who can’t afford the drug. A House-Senate conference...", "filename": "_9c487e785945d8199f9331d35ede5e95_1588622708.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9c487e785945d8199f9331d35ede5e95_1588622708.html", "title": "Minnesota lawmakers reach deal on insulin affordability", "title_page": "Minnesota lawmakers reach deal on insulin affordability ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ST. PAUL, Minn. (AP) — Minnesota lawmakers reached a deal Wednesday on creating a long-awaited emergency insulin program for diabetics who can’t afford the drug.\nA House-Senate conference committee voted unanimously to sign off on the bill, clearing the way for the full Legislature to pass the bill as early as Tuesday next week. The Star Tribune reports the legislation represents a breakthrough for behind-the-scenes talks that began soon after a deal collapsed at the end of the 2019 session.\nUnder the agreement, diabetics who are within seven days of running out of insulin and unable to afford out-of-pocket prescription costs of $75 or more could obtain a 30-day supply at a pharmacy for a $35 copay. Insulin manufacturers would provide reimbursements or replace stockpiles that pharmacies distribute as part of the program.\nIn addition to the emergency access program, the bill mandates that manufacturers provide longer-term assistance to patients who meet certain qualifications. Eligible Minnesotans making at or under 400% of the federal poverty level — roughly $51,000 for individuals or $69,000 for two-person households — could pay $50 for a 90-day supply.\nThe deal follows months of public and private talks between Democratic and Republican legislators in the two chambers.", "url": "https://apnews.com/9c487e785945d8199f9331d35ede5e95"}