{"authors": [], "date_download": "2020-05-04 16:53:56", "date_modify": "2020-05-04 16:53:56", "date_publish": "2020-04-08 18:35:00", "description": "Philips Hue is currently offering a tiered discount — ranging from 10% to 20% off your order — on nine different devices, depending on how many devices you order.", "filename": "2020_04_08_cnn-underscored__0dc521adf66c31496bcee3c085450f53_index_1588611236.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408143204-philips-hue-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_cnn-underscored__0dc521adf66c31496bcee3c085450f53_index_1588611236.html", "title": "Brighten up your home with this buy more, save more deal on Philips Hue smart lights", "title_page": "Philips Hue sale: Add some smart lights to your home with this buy more, save more deal - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "If you've been looking to add some smart lighting to your living room or bedroom, now is the time to take advantage of the latest Philips Hue offer. The company is currently offering a tiered discount — ranging from 10% to 20% off your order — on nine different devices, depending on how many devices you order.\nThis Mix and Match promotion means that you can pick up various bulbs, a Bridge and more for less. You'll save 10% on orders of four items, 15% off orders of five products and 20% off six products.\nIf you're new to Philips Hue, start by adding a $59.99 Hue Bridge to your cart. The Bridge is required to access and unlock the full potential for Hue lights using. Alternatively, if you're a veteran Hue user, now may be a good time to upgrade from the old, round Bridge that will stop working at the end of the month.\nHue Bridge ($59.99; meethue.com)\nSome of the bulbs included in the promotion have Bluetooth connectivity, and therefore don't require the Bridge. But with a Bridge, you're able to create automations to turn the lights on or off at a set time, integrate other Hue accessories and control your lights from anywhere. The Bluetooth-equipped bulbs are distinguished by a Bluetooth icon in the top right corner of the product image.\nPhilips Hue\nSome bulbs of note that are up for grabs at a discount include a $24.99 Hue White E12 bulb, $29.99 Hue White PAR38 Outdoor bulb and the retro-looking $32.99 Hue White G25 E26 Filament Globe.\nHue White E12 Bulb ($24.99; meethue.com )\nHue White PAR38 Outdoor Bulb ($29.99; meethue.com )\nHue White G25 E26 Filament Globe ($32.99; meethue.com)\nThe $79.99 Hue Go white and color ambiance portable light is also on sale. It doesn't go in a light socket; instead, the small bowl-shaped device sits on a table or counter and provides just enough ambient light to break up the darkness. There's a battery built-in, so you can take it from room to room or use it on your porch. You can even program it to slowly light up in the morning as a gentle way to wake you up.\nHue Go Portable Light ($79.99; meethue.com)\nWhile you won't find any light strips or multi-packs included in this deal, the bulbs that are listed make it easy to automate your home's lighting and save some money while doing so. There isn't a promo code; as you add more items to your cart, you'll see the discount automatically applied. So shop this Buy More, Save More event and start automating your home's lighting now.\nFor more great deals, check out CNN Coupons.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/08/cnn-underscored/philips-hue-sale-buy-more-save-more/index.html"}