{"authors": [], "date_download": "2020-05-04 16:16:33", "date_modify": "2020-05-04 16:16:33", "date_publish": "2020-04-03 19:22:08", "description": null, "filename": "2020_04_03_cnn-underscored__cae583308cf8c4f7b99492b03fe919cb_index_1588608993.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200323152946-1-underscored-tech-home-office-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored__cae583308cf8c4f7b99492b03fe919cb_index_1588608993.html", "title": "Upgrade your home office with these tech essentials", "title_page": "Upgrade your home office with these tech essentials - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A lot of us are scrambling to set up a home workspace. Working on a laptop at your kitchen table will get the job done, but after some time, you may find yourself wanting a more permanent setup. Not only does it give you a mental area dedicated to work (not to mention keeps you from constantly having to pack up at mealtime), but its ergonomic benefits will help your body feel better.\nBelow are some key tech upgrades you can make to improve your home office setup.\nSamsung Space Monitor ($349.99; samsung.com or amazon.com)\nOne of the best upgrades you can make to your home office is a dedicated monitor. The $349.99 Samsung Space Monitor hits all the right marks, and it's designed to take up minimal space. The 32-inch screen has a resolution of 3,840 x 2,160 with a frameless design. For those keeping track, that is full 4K resolution, so visuals should look great. It attaches to the back of your desk and appears to float as you move and adjust it for the best viewing angle. Another benefit of attaching to the back of your desk is that it frees up precious desk space where the monitor stand would normally be.\nThe 32-inch Space Monitor is currently $349.99 from Samsung.\nKeychron K2 Wireless Mechanical Keyboard ($74.99; keychron.com)\nPart of setting up a dedicated workspace is getting a wireless keyboard that allows you to move around on your desk in order to be more comfortable. We love the Keychron K2 Wireless Keyboard. You can pick between two different switch types (Red or Blue), each one designed for a specific use. For example, Red is good for gaming and office work, while the Blue is better suited for someone who does a lot of typing.\nYou can either pair the keyboard with your computer via Bluetooth, or use the included USB-C cable for power and connection.\nCheck out the Keychron K2 Wireless Mechanical Keyboard.\nLogitech MX Anywhere 2S ($59.99; logitech.com or amazon.com)\nThe Logitech MX Anywhere 2S wireless mouse can be paired to multiple devices for easy switching back and forth. There's a button on the bottom you can press to switch from being connected to a MacBook to your iPad, or even a Windows computer.\nAccording to Logitech, you should get about 70 days of use out of a single charge. Of course, that number will vary depending on how much you use the MX Anywhere 2S, but if it gets even close to that, it's impressive.\nCheck out the MX Anywhere 2S on Logitech.\nWD 1TB My Passport ($57.99; bhphotovideo.com)\nBacking up your work on an external storage device is always a good idea, and it's still true as a lot of us transition to remote work. Without IT departments helping manage our files, it's far too easy to lose precious work.\nWe've been using the Western Digital My Passport portable external hard drive for a couple of years now, and have zero complaints.\nIt comes in a few different colors, and storage amounts ranging from 1TB to 5TB. It's not terribly pricey, starting at $57.99 for the 1TB model and going up to $109.99 for 4TBs of storage.\nWe like it because it's small and doesn't take up a bunch of space on my desk, and is powered via the USB connection so we don't have to run yet more cables across my desk.\nCheck out the Western Digital My Passport on BH Photo and Video right now.\nSabrent USB 3.0 hub ($9.99; bhphotovideo.com)\nWe don't think we've ever used a computer that's had enough USB ports. Adding a USB Hub is a quick, inexpensive way to increase the number of ports your desktop or laptop has. You can then use those added USB Ports to plug more accessories and devices into your computer. For us, that meant we were able to plug in a webcam and a couple of charging cables.\nWe've been using the Sabrent four-port USB 3.0 hub with individual power switches for a while now. It's quick and easy to set up (seriously, just plug it in) and the ability to turn one or all ports off with the individual buttons has been convenient.\nYou can pick one up for $15.99 on BH Photo and Video.\nSmart lights\nSmart lighting around your home desk or office is an easy way to make sure you look better on video calls, and it also helps add a bit of personality to your workspace.\nIf you don't care about changing colors or anything too fancy, then the $11.98 Wyze Bulb is more than enough. It connects directly to your Wi-Fi network, and you can control it from your phone. You can set schedules, or even use Google Assistant or Alexa to control your light. You can get a four-pack for $37.98 if you really want to go all out.\nFor something a little more sophisticated with colorful lights that can even react to sound around your home, look at Philips Hue. The starter kit comes with a hub and four color LED bulbs for $199. With a Hue Hub setup in your home, you can add bulbs and expand its functionality at any time. The hub gives you the ability to control it from the mobile app, or use personal assistants like Google Assistant, Alexa or Siri.\nPro tip: Assign a color to a bulb in your home — say, red — as a sort of on-air notice signaling to your spouse, kids or roommates when you're on a call.\nUpgrade your Wi-Fi\nGoogle's Nest Wi-Fi system is our current top pick for mesh wireless systems. Nest Wi-Fi includes multiple access points that work in tandem to ensure your home is blanketed in a strong Wi-Fi signal, without compromising throughput or speed. Setup is a breeze, taking just a few minutes in the Google Home app. You'll also be able to set up parental controls, including blocking types of content or creating schedules to pause access on your kids' devices.\nPick up a two-pack for $239 or a three-pack for $407.66. Each access point can cover up to 2,000 square feet.\nIf you don't want to mesh with multiple devices, the $189.99 Netgear Nighthawk Dual Band router at Best Buy is loaded with features. For example, it can dish out 2.4Ghz and 5GHz networks, making it compatible with smart home devices and newer laptops or phones. You can use Google Assistant or Alexa to control internet access, or take advantage of the Circle Smart Parental controls to limit what your kids' devices can and can't see.\nHP Tango wireless printer ($149.98; walmart.com)\nHopefully, your need to print something isn't high, but in any event, the HP Tango wireless printer is affordable and integrates with Amazon's Dash Replenishment for when you're running low on ink.\nThe Tango can scan and copy documents directly to your computer or mobile phone, print photos directly from your phone. If you sign up for Amazon's Dash Replenishment the printer can automatically order more ink as you get low, and you'll even get 10% off for doing so.\nCheck out the HP Tango on Walmart.\nEarbuds and Headphones\nWorking from home is normally a rather quiet experience, but combine that with the fact that the rest of your family or roommates are also now home and you're going to want some earbuds or headphones for those times when it gets noisy.\nApple's AirPods Pro integrates with all Apple products, with seamless pairing, impressive range, and noise-cancellation. They're pricey at $249, especially when compared to standard AirPods, but the added noise features will help drown out your kids in the other room or your roommates rather loud typing.\nFor Android users, Samsung's Galaxy Buds+ are worth every penny. The $149.99 earbuds are completely wireless and have downright crazy 11 hours of battery life. A quick recharge in the charging case, and you'll get another 11 hours of use. Nearly a full day of listening to your favorite music or podcasts on one charge? Unreal.\nIf you're looking for over the ear headphones, the Bose QuietComfort 35 II with Noise-Cancellation will get the job done. For $349 you get some of the best noise cancellation headphones on the market. They're comfortable, pack up to 20 hours of battery life, and can be customized using a mobile app.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/home-office-setup-tech-upgrades-outbrain-2/index.html"}