{"authors": [], "date_download": "2020-05-04 17:01:38", "date_modify": "2020-05-04 17:01:38", "date_publish": "2020-04-10 14:11:39", "description": "Because we all need to find some time for self-care right now, here are some sheet masks packed with ingredients that will leave your skin hydrated, plump and glowing.", "filename": "2020_04_10_cnn-underscored_best-sheet-masks_index_1588611698.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407134034-sheetmasklead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_cnn-underscored_best-sheet-masks_index_1588611698.html", "title": "15 sheet masks to treat yourself to this week", "title_page": "Best sheet masks: 15 hydrating, brightening and fun K-beauty masks  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "What's more fun than relaxing with a sheet mask, a glass of prosecco or tea, and a good Netflix binge? Not much, especially right now. Soothing, hydrating and sometimes silly (you've seen the animal face masks, right?), a sheet mask is one of the easiest ways to indulge in a little self-care.\nBut, as you've probably noticed, you can now find a huge selection of sheet makes everywhere from drugstores to high-end skin care lines, and frankly, it can be overwhelming. Fortunately, Dr. David Lortscher, board-certified dermatologist and CEO and founder of skin care brand Curology, was able to give us some guidance on selecting a mask.\n\"Although there is no independent evidence that mud masks, clay masks, cream masks or sheet masks provide any long-lasting benefit to the skin, they can be hydrating and soothing,\" says Lortscher.\nThey're also one of those rare beauty products that can be extremely cheap and still work well. \"I'm not sure that there is such a thing as a 'too cheap' face mask,\" he says. \"Instead of the price, I recommend paying attention to the ingredients in face masks.\"\nAs for what ingredients to look for, Lortscher goes for the basics. \"To help 'soothe' your skin, look out for moisturizing ingredients like hyaluronic acid, dimethicone and glycerin,\" he says.\nWith that advice in mind, we found sheet masks that offer those kinds of ingredients for hydrating, brightening and more, as well as picks from brands we trust, starting at just $2.\nHydrate and moisturize\n100% Pure Sheet Mask: Deep Hydration ($6; dermstore.com)\n100% Pure Sheet Mask: Deep Hydration\nPacked with hyaluronic acid, this deep hydrating mask has a 5-star rating, and cucumber to help reduce swelling.\n_______________________________________________________________________________\nImage Skincare I Mask Hydrating Hydrogel Sheet Mask ($35; dermstore.com)\nImage Skincare I Mask Hydrating Hydrogel Sheet Mask\nThe five masks in this set are so cooling and soothing you'll feel like you're floating in a pool of moisture. Infused with aloe vera and hyaluronic acid to thwart dryness and dehydration, they're formulated to leave your skin with a soft and smooth finish.\n_______________________________________________________________________________\nPeach Slices Calm Face Mask Sheet - Jasmine + Chamomile ($2.49; target.com)\nPeach Slices Calm Face Mask Sheet - Jasmine + Chamomile\nThis refreshing, cooling mask is designed to calm your skin and make you feel pampered after a tough day. Jasmine and chamomile can help instantly refresh and relax.\n_______________________________________________________________________________\nFarmacy Coconut Gel Sheet Mask ($6; sephora.com)\nFarmacy Coconut Gel Sheet Mask\nClean beauty brand Farmacy has this mask that's infused with hyaluronic acid and cucumber extract, making it perfect for dry skin.\nBrighten and glow\nSK-ll Facial Treatment Mask, 10 Pack ($139; dermstore.com)\nSK-ll Facial Treatment Mask\nThis yummy mask's specialty is targeting large pores, plus it can deliver instant brightening and soothe red, irritated skin. Customer rave that it's the perfect treat for your skin if you haven't had enough sleep, or are just feeling run-down and you don't want it to show.\n_______________________________________________________________________________\nPixi by Petra Glow Glycolic Boost - Brightening Face Mask Sheet, 3 Pack ($9.99; target.com)\nPixi by Petra Glow Glycolic Boost - Brightening Face Mask Sheet\nThis beauty editor fave — that you can get at Target! — is designed to be a brightening bomb. You won't need a beauty filter for Instagram or Zoom after you treat your skin to this collagen-packed mask.\n_______________________________________________________________________________\nToo Cool For School Egg Cream Hydration Face Mask, 5 Pack ($24; kohls.com)\nToo Cool For School Egg Cream Hydration Face Mask\nReviewers across the internet are extremely passionate about this mask, which includes moisturizing and nourishing egg yolk and egg white extracts.\n_______________________________________________________________________________\nTatcha Luminous Dewy Skin Sheet Mask ($12; tatcha.com, sephora.com)\nTatcha Luminous Dewy Skin Sheet Mask\nTatcha, the Japanese skin care brand beloved for its ultra-hydrating and glow-y products, sells this sheet mask that's packed with vitamin E and essential fatty acids, which can help plump the skin and leave it luminous.\nFirm your face\nBurt's Bees Renewing Biocellulose Gel Mask ($3.99; target.com)\nBurt's Bees Renewing Biocellulose Gel Mask\nLike most products from this beloved line, this mask is 99.4% natural in origin, and the biocellulose facial mask has rose and algae extracts to moisturize and help smooth the skin.\n_______________________________________________________________________________\nLa Mer The Treatment Lotion Hydrating Mask (starting at $30; nordstrom.com)\nLa Mer The Treatment Lotion Hydrating Mask\nGet all of the properties of this cult-favorite lotion in a high-powered, energizing mask that is formulated to leave skin looking plumped and glowing.\n_______________________________________________________________________________\nCharlotte Tilbury Instant Magic Facial Dry Sheet Mask (starting at $22; nordstrom.com)\nCharlotte Tilbury Instant Magic Facial Dry Sheet Mask\nHate the wet feeling of most sheet masks? Celebrity makeup artist Charlotte Tilbury's sheet mask goes on dry for a prolonged release of actives that can help reduce wrinkles, smooth, brighten, lift and hydrate.\nJust for fun\nGlamglow Coolsheet No-Drip Hydrating Sheet Mask ($9; nordstrom.com)\nGlamglow Coolsheet No-Drip Hydrating Sheet Mask\nBaby, you're a star, in this fuchsia hydrating fabric sheet mask covered in bright silver stars. Each mask has a blend of glycerin and trehalose designed to hydrate skin, so you're going to look fabulous after you take it off, too.\n_______________________________________________________________________________\nMoschino + Sephora Toy Honey Mask ($4, originally $8; sephora.com)\nMoschino + Sephora Toy Honey Mask\nThis ridiculously cute honey bear mask is sure to bring a smile to your face, and for the price, you can get a few for your friends. Infused with honey, the mask promises to deliver a dose of ultra hydration.\n_______________________________________________________________________________\nSephora Collection Supermask The Bubble Mask ($6; sephora.com)\nSephora Collection Supermask The Bubble Mask\nThis mask puts on a show once it comes in contact with the skin, creating bubbles all over your face. Get ready to take a selfie in 3... 2...\n_______________________________________________________________________________\nMasque Bar Animalz Cat Energizing Sheet Mask ($3.99; amazon.com)\nMasque Bar Animalz Cat Energizing Sheet Mask\nNot only will this mask from this K-beauty brand transform you into a cat for a cool 15 minutes, but it will also leave your skin soft and nourished.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/10/cnn-underscored/best-sheet-masks/index.html"}