{"authors": [], "date_download": "2020-05-04 20:13:14", "date_modify": "2020-05-04 20:13:14", "date_publish": "2020-04-15 07:25:20", "description": "BERLIN (AP) — German authorities say police have arrested four suspected members of the Islamic State group alleged to be planning an attack on American military facilities. Federal...", "filename": "_9be617fe2ae41dbd4df22e18215711d6_1588623194.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9be617fe2ae41dbd4df22e18215711d6_1588623194.html", "title": "Germany arrests 4 IS suspects planning attack on US bases", "title_page": "Germany arrests 4 IS suspects planning attack on US bases", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BERLIN (AP) — German authorities say police have arrested four suspected members of the Islamic State group alleged to be planning an attack on American military facilities.\nFederal prosecutors said the suspects were arrested by tactical police units early Wednesday at various locations in the western state of North Rhine-Westphalia.\nThey identified the men as Azizjon B., Muhammadali G., Farhodshoh K. and Sunatullokh K. — all citizens of Tajikistan. The suspects’ surnames weren’t released for privacy reasons.\nThe men’s alleged leader, a 30-year-old Tajik man identified only as Ravsan B., has been in jail since March 2019 on unspecified charges.\nAll suspects will be charged with membership in a terrorist organization.\nProsecutors said the men joined the Islamic State group in January 2019 and were instructed to form a cell in Germany. They reportedly first planned to carry out an attack in Tajikistan but later shifted their target to Germany, including U.S. Air Force bases in the country and a person they deemed critical of Islam.\nThroughout, they are alleged to have been in contact with two high-ranking IS figures in Syria and Afghanistan.\nProsecutors said the group had already obtained firearms and ammunition to carry out their attacks, while Ravsan B. had ordered materials to build an explosive device.\nIn order to pay for their plans, Ravsan B. allegedly accepted a $40,000 contract to assassinate someone in Albania, but the contract slaying failed.", "url": "https://apnews.com/9be617fe2ae41dbd4df22e18215711d6"}