{"authors": ["Jo Munnik", "Aisha Salaudeen"], "date_download": "2020-05-04 16:56:38", "date_modify": "2020-05-04 16:56:38", "date_publish": "2020-04-09 12:16:33", "description": "Kirsten Landman is one of Africa's top female enduro racers.", "filename": "2020_04_09_africa_africa-enduro-racer_index_1588611398.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200326111122-kirsten-landman-2019-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_africa_africa-enduro-racer_index_1588611398.html", "title": "Kirsten Landman is the first African woman to finish the Dakar rally", "title_page": "Kirsten Landman is the first  African woman to finish the Dakar rally  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Born in Kwa-Zulu Natal, a coastal region in South Africa, Landman has become one of the continent's top female enduro racers.\nEnduro is a form of motorcycle racing that takes place on off-road circuits, such as mountains or hills. It's a physically demanding sport and typically is male-dominated.\nDespite this, Landman has earned her place on the podium across a range of extreme international events.\nAged 29, she has already become the first female to finish races such as the Roof of Africa, Redbull Braveman and the Redbull Sea to Sky.\nBut most recently, she became the first African woman to finish the Dakar Rally on a motorcycle.\nThe Dakar rally\n\"Dakar is the pinnacle of motorsports, it's the pinnacle of two wheels,\" Landman told CNN. \"It's got a legend behind it. They call it the toughest endurance rally for a reason.\"\nDuring this year's Dakar rally, which took place in Saudi Arabia in January, riders covered a grueling distance of almost 8,000 kilometers over 12 days.\nLandman's preparation for the race involved months of intensive physical and mental training. She also had to learn how to fix her motorbike in case it broke down during the race.\nHer hard work paid off. She finished in 55th place, third among women on a bike and the first ever woman from Africa to finish. Another South African woman, Taye Perry, placed 77th.\nGrowing up on bikes\nLandman says her love for racing began as a child. By the time she turned eight years old, she was already riding bikes with her cousin and uncle.\n\"I grew up as a complete little tomboy. I always wanted to do whatever the boys were doing and at the age of eight I remember having a little picture of a KTM Essex 50 [motorbike] on my wall,\" she said.\n\"It was love at first sight and I knew this is what I wanted to do,\" she added.\nBy 14, Landman was competing seriously, and by the age of 20, she had landed her first sponsor.\nHer professional career kicked off when she entered her first-ever extreme enduro in 2012, the Roof of Africa , an event that takes place in Lesotho each year. She finished with a bronze medal.\nBut it hasn't always been an easy ride.\nIn 2013, Landman almost lost her life in an accident whilst competing in Botswana. She crashed at high speed and landed on a tree stump.\n\"I had severed the pancreas of my small intestine,\" she said. \"(Treatment within) eight hours is critical...and I had been sitting for 36 hours with all that gunk in my stomach. They opened me up and all my organs had gone septic. I was put onto life support.\"\nShe was in a coma for 11 days and told she would never ride again, but eight months later, she was back on her bike.\n\"The question I get asked often is why did I get back into the sport that nearly took my life? It's because this is my life. I don't know anything else. For me, riding my motorbike is easier than walking. It's what brings me happiness,\" she said.\nInspiring the next generation of girls\nLandman hopes that her success will inspire other young girls to take up the sport.\n\"When I first started, there were no women on the scene. It was unheard of seeing a little girl on the bike,\" she said.\nLandman has helped to break the mold. \"I see myself as a change in motorsports around the world and enduro...What I'm doing is hopefully showing the younger girls that it is possible,\" she said.", "url": "https://www.cnn.com/2020/04/09/africa/africa-enduro-racer/index.html"}