{"authors": ["Alaa Elassar"], "date_download": "2020-05-04 16:27:02", "date_modify": "2020-05-04 16:27:02", "date_publish": "2020-04-07 16:27:28", "description": "When the bullets rang out, 5-year-old Jordan Allen Jr. was on the balcony of his Houston apartment stuck at home because of social distancing and he and his father were making TikTok videos.", "filename": "2020_04_07_us_texas-5-year-_483472a9f5cfb85c579e7fa46f5cf04a_index_1588609622.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407114532-02-texas-5-year-old-died-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_us_texas-5-year-_483472a9f5cfb85c579e7fa46f5cf04a_index_1588609622.html", "title": "A 5-year-old has died after being caught in a drive-by shooting while making TikTok videos with his dad", "title_page": "A 5-year-old has died after being caught in a drive-by shooting while making TikTok videos with his dad - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) When the bullets rang out, 5-year-old Jordan Allen Jr. was on the balcony of his Houston apartment stuck at home because of social distancing and he and his father were making TikTok videos.\nHe died Monday, nearly a week after being struck by a stray bullet in the drive-by shooting, CNN affiliate KTRK reported.\nJordan was not the intended target, and there are still no known witnesses or suspects, according to the Houston Police Department.\nJordan's dad, Jordan Allen Sr., was playing with his son when he stepped away to grab him some juice. Moments later, the family heard gunshots -- and Jordan begging for help.\n\"Everybody ran in the house and the kids ran in the house, so I ran to the porch, and then I see my son laying on the ground holding his head, asking for my help,\" Allen told KTRK\nAllen was able to flag down an ambulance which transported the child to Texas Children's Hospital, where he was taken off life support days later. That was the last time Allen saw Jordan, who he called the \"happiest child in the world\" and a source of joy to anyone who knew him.\nPolice are currently investigating the shooting and do not have a description of the suspect's car.\n\"There were multiple casings found in the parking lot and several cars had damage from possible gunfire,\" police spokesperson Jodi Silva told CNN.", "url": "https://www.cnn.com/2020/04/07/us/texas-5-year-old-died-tiktok-videos-shooting-trnd/index.html"}