{"authors": [], "date_download": "2020-05-04 16:51:50", "date_modify": "2020-05-04 16:51:50", "date_publish": "2020-04-08 13:00:20", "description": "Samsung kicked off 2020 with the Galaxy S20 5G family of devices and the compact Z Flip. Now it's turning the spotlight to entry and mid-range devices with the new Galaxy A Series: A01, A11, A21, A51, A51 5G and A71 5G.", "filename": "2020_04_08_cnn-underscored__f22a58a276e70302e78f49f0865eeeab_index_1588611110.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407211459-underscored-samsung-galaxy-a-series-2020-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_cnn-underscored__f22a58a276e70302e78f49f0865eeeab_index_1588611110.html", "title": "Here's the full scoop on Samsung's 2020 Galaxy A Series family", "title_page": "Here's the full scoop on Samsung's 2020 Galaxy A Series family - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Samsung kicked off 2020 with the Galaxy S20 5G family of devices and the compact Z Flip. Now it's turning the spotlight to entry and mid-range devices with the new Galaxy A Series: A01, A11, A21, A51, A51 5G and A71 5G.\nWhile these won't deliver flagship-level specs, you can still expect a solid camera, long battery life and, overall, a capable Android smartphone. And yes, these are all running Android with a Samsung user interface on top.\nThese start at just $109.99 for the Galaxy A01 and go up to $599.99 for the A71 5G.\nSome of these devices are launching today, while others will roll out in the coming weeks. Additionally, many of these will be arriving on AT&T, Sprint, T-Mobile and Verizon in the coming weeks. Samsung will also have unlocked models for the A11, A21 and A51.\nLet's take a look at what the 2020 Galaxy A Series has to offer.\nGalaxy A51\nThe Samsung Galaxy A51 features a 6.5-inch Super AMOLED Full HD+ display, which should deliver a vibrant and immersive experience. It has a pinhole notch in the center that secures the 32-megapixel front-facing camera that can be used for snapping selfies or unlocking the phone. On the rear, you'll find a quad-camera setup with a 48-megapixel wide lens. It should deliver improved details and overall better shots, especially when you use it with the 12-megapixel ultra-wide, 5-megapixel depth and 5-megapixel macro lenses beside it.\nThere's even a fingerprint sensor in the screen for securely unlocking. You'll be able to store plenty of photos and videos (you can shoot up to 4K) with 128GBs of storage. There's also a microSD card slot for expansion. Powering the Android experience on the A51 is an octa-core processor that's made up of a 2.3Ghz quad-core and four 1.7Ghz cores. It should be zippy and represent the most seamless experiences found on the A Series.\nIt's paired with 4GBs of RAM and available now for Verizon $399.99. The unlocked model is coming in the next few weeks.\nGalaxy A01\nAt just $109.99, the Galaxy A01 is one of the most affordable devices Samsung has ever made. It aims to be a bare-bones essential focused experience. It starts with a 5.7-inch Infinity-V display that incorporates a teardrop notch at the top of the device where Samsung tucked in a 5-megapixel front-facing camera. This can be used for selfies, making the next epic TikTok and for unlocking the A01 with your face. The backside features a dual-camera setup: a 13-megapixel wide lens and a 2-megapixel depth camera. This way you can capture a full city skyline and you can take bokeh photos. What is bokeh? Well, it's Samsung's answer to Apple's Portrait Mode.\nPowering the A01 is a 3,000mAh battery, which is paired with an octa-core processor that's made up of a 2.0Ghz quad-core and a 1.45Ghz quad-core. This should give ample power to the phone for everyday tasks and capturing content. It should also be efficient to give you long-lasting battery life.\nThe Galaxy A01 is out today on Verizon for $109.99. You can lock in your order on Samsung.com. That's also where an unlocked model will arrive in the coming weeks.\nGalaxy A11\nThe Galaxy A11 steps up the price to $179.99 and increases the screen size to 6.4 inches. That bigger screen comes with a sharper HD+ Infinity-O display. This also features a pinhole camera in the top left corner that is similar to the display on the Galaxy S10e. There's an 8-megapixel camera in that hole as well. It's powered by a larger 4,000mAh battery and is paired with a 1.8Ghz processor. That's faster than the A01 and gets the same 2GB of RAM for performance boosts.\nOn the backside you'll find a 13-megapixel wide, 5-megapixel ultra-wide and 2 megapixel depth lenses. You'll also find a fingerprint sensor in the center. Don't expect this to be the fastest, but it will allow you to take full advantage of the triple camera setup on the back. You'll also be able to store photos, videos, music and apps with 32GB of internal storage. There's also expansion with a microSD card slot.\nSamsung will ship the Galaxy A11 in the coming weeks for $179.99.\nGalaxy A21\nAn A-Series with a quad-camera? That's exactly what the $249.99 Galaxy A21 brings to the table. You have four cameras on the back, including a 16-megapixel wide lens, a 16-megapixel ultra-wide, a two-megapixel depth lens and a two-megapixel macro lens. These will let you capture wide vibrant shots along with closeups that keep details. Your viewfinder for these shots will be a 6.5-inch HD+ Infinity-O display. This sticks with the pinhole design (as seen on the A11 and S10e) and a 5-megapixel front-facing camera is tucked inside.\nThere's a fingerprint sensor on the back for unlocking and authenticating. A 4,000mAh battery should last the full day and features fast charging support up to 15 watts. Inside, it has 32GB of storage and a microSD card slot for expansion. It's also powered by an octa-core processor comprised of 2.3Ghz quad-core and 1.8Ghz quad-core chips. It should be zippy and faster than the A11 or A01.\nIt will launch this summer for $249.99.\nGalaxy A51 5G and A71 5G\nA common theme between the A Series and the S20 family is that select models have 5G support. And that means you can get a 5G phone, fully paid for, at under $600. The A51 5G will be $499.99 and the A71 5G will be $599.99.\nWith the A51 5G, you're getting nearly the same hardware as the normal A51. So that's a 6.5-inch display, 128GBs of storage and a 48-megapixel lens on the back. But Samsung is increasing the RAM to 6GBs for better performance and upping the battery to 4,500mAh to make sure it can last a full day.\nThe A71 5G, on the other hand, offers the highest-end experience on an A Series phone, and it should, since it has a $599.99 price tag. It has a massive 6.7-inch Full HD+ Super AMOLED Plus Infinity-O display, which all basically translates to a vibrant screen that can offer a compelling and detail-filled experience. It's still paired with a 5-megapixel front facing camera. The rear side offers a quad-camera setup that has a main 64-megapixel wide lens that's paired with ultra-wide, macro and depth lenses. You'll also get 6GBs of RAM, 128GB of internal storage along with a microSD card slot, an octa-core processor and a 4,500mAh battery. It also supports 25-watt fast charging via a wire.\nSamsung's Galaxy A51 5G and A71 5G will launch in the coming weeks for $599.99.\nLet's recap\nIf you don't need the latest innovations, the 2020 Galaxy A-Series is for you. We enjoyed the Galaxy A50 and have a feeling these will perform just as well while expanding the line with more options for more people.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/08/cnn-underscored/samsung-galaxy-a-series-a01-a11-a21-a51-5g-pricing-buy/index.html"}