{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:03:48", "date_modify": "2020-05-04 20:03:48", "date_publish": "2020-05-04 19:16:24", "description": "“He’s one of those people that’s not 100% normal,” Elly Jackson of La Roux said.", "filename": "entry_kanye-west-la-roux_n_5eb0436fc5b6283db9a49b1b_1588622628.html", "image_url": "https://img.huffingtonpost.com/asset/5eb05bbb2200005b0f828207.png?cache=hg1giqb4cr&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_kanye-west-la-roux_n_5eb0436fc5b6283db9a49b1b_1588622628.html", "title": "La Roux Singer Said She Witnessed 'Upsetting' Behavior From Kanye West", "title_page": "La Roux Singer Said She Witnessed 'Upsetting' Behavior From Kanye West | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "La Roux singer Elly Jackson said she saw Kanye West engage in “upsetting and unsettling” behavior when she worked with him years ago.\nJackson, who collaborated with West on his 2010 hit, “All Of the Lights” and on a remix of La Roux’s “In For The Kill,” described the rap titan as “fascinating” and “amazing to be around,” but deeply troubling.\n“I just saw some behavior that wasn’t directed toward me, but I saw some behavior that I can’t approve of as a human being ― I can’t approve of,” Jackson said on an episode of Phil Taggart’s “Slacker” podcast released in March. She added that she found it “upsetting and unsettling.”\n“He’s one of those people that’s not 100% normal,” Jackson said. “He’s kind of fascinating. It’s a fascinating world to be in for, you know, like a few days.”\nGetty Images\nDespite her extensive work with West, Jackson said she didn’t get to know him because “you can’t talk about anything normal.”\n“You can’t just have a normal conversation. I didn’t manage to anyway ― I found it impossible,” she revealed. “He’s on [a] show 24 hours a day, it’s just him. It’s also kind of amazing to be around. You know, I’ll never be around anything like that again. It was really strange.”\nJackson said she got the feeling West wanted to come off as strange.\nShe spoke about some of West’s behavior with a mutual friend.\n“One of his friends that I knew afterwards asked me, ‘You kind of looked at me like [West’s behavior] was weird, wasn’t it?’” she said. “And I was like, ‘Yeah it was pretty weird, you know, and I saw a couple of things happen.’ ... I found all of it strange.”\nThe friend, Jackson continued, told West about the conversation and he apparently was insulted enough to want an apology. Later, she said she wrote him a “creepy” note.\nFrank Hoensch via Getty Images Elly Jackson of La Roux performs live on stage during a concert at the Metropol on Feb. 15, 2020 in Berlin, Germany.\n“I remember writing it. I was sat there on my sofa lol’ing to myself like, ‘Dear Kanye,’” she said, calling the whole thing “ridiculous.” She “didn’t say anything bad about him,” she insisted, adding: “He was absolutely lovely to me.”\nJackson spoke out against West in a 2014 interview with the Sunday Times after their collaboration.\n“No, fuck him,” she said in the interview. “Nobody likes him.”", "url": "https://www.huffpost.com/entry/kanye-west-la-roux_n_5eb0436fc5b6283db9a49b1b"}