{"authors": ["Aj Willingham"], "date_download": "2020-05-04 16:20:48", "date_modify": "2020-05-04 16:20:48", "date_publish": "2020-04-05 16:34:15", "description": "Every once in a while, a doozy of a documentary or podcast comes out that overtakes the national pop culture conversation. \"Wild Wild Country\" did it. \"Serial\" did it. But the Netflix docuseries \"Tiger King,\" is on a whole new level.", "filename": "2020_04_05_us_tiger-king-documentary-why-popular-trnd_index_1588609248.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200316160850-tiger-king-netflix-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_us_tiger-king-documentary-why-popular-trnd_index_1588609248.html", "title": "'Tiger King': The not-so-secret formula behind its popularity", "title_page": "'Tiger King': The not-so-secret formula behind its popularity - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Every once in a while, a doozy of a documentary or podcast comes out that overtakes the national pop culture conversation. \" Wild Wild Country \" did it. \" Serial \" did it. But the Netflix docuseries \"Tiger King,\" is on a whole new level.\nTo crib a popular meme about the show, it has everything: Conspiracy, intrigue, romance, mystery, big cats, fleeting political campaigns, bleached mullets, shirtless interviews, country songs and animal-print underwear brands -- and that's only the first few episodes.\nBut what is it about entertainment like this that so completely intoxicates us? What, in our deep bedazzled denim id, draws us to these spectacles, like travelers to a semi-legal roadside zoo?\nIt's everything all at once\nA scene from the Netfix docuseries \"Tiger King.\"\nScot Safon, a former executive for CNN and UPtv and former president of HLN, knows what makes good TV. He says a series like \"Tiger King\" succeeds because it crams all of our favorite binge-watching obsessions into one tiger-print package.\n\"It's introducing people to this subculture that has its own rituals and language and images,\" he said. \"Plus, it has these characters you couldn't make up. Fiction could not do it justice. There's mystery -- several mysteries -- that hover around, and lots of room for speculation. And it's hitting us all at a moment when we're kind of in search of something worth talking about that's not personal or related to the way we're living.\"\nIt shows us a whole new world\nAnimal activist and big cat owner Carole Baskin appears in 'Tiger King.\"\nIt's safe to say, before \"Tiger King,\" most people didn't know who Joe Exotic was. They didn't hum the melody to his song \"I Saw a Tiger\" or lie awake at night wondering if his nemesis Carole Baskin killed her husband and fed him to a tiger, like Maldonado-Passage inexplicably claims she did.\nMost likely, they didn't know this bizarre, shockingly active community of big cat enthusiasts even existed.\nAs much as some people -- including individuals featured in the series -- want to dismiss the show as insubstantial, at the core of \"Tiger King\" madness is the thrill of learning about something entirely new.\n\"We knew from the outset that it was really an interesting subculture in America,\" the show's co-director Eric Goode said on an episode of the Netflix companion podcast \"You Can't Make This Up.\"\n\"What interests us is the psychology behind keeping these animals, and just as much as the issues surrounding the animals, we were interested in the people that did this.\"\nIt's the same element that drove the success of other docuseries like \"Wild Wild Country,\" about Indian guru Bhagwan Shree Rajneesh and the community his followers created in rural Oregon, or \"The Jinx,\" which follows accused murderer and mega-rich real estate heir Robert Durst . Durst has pleaded not guilty to the first-degree murder charge, and has repeatedly denied killing his longtime fiend Susan Berman.\nEven less sensational programs, like the uber-popular reality series \"Cheer,\" which documents the day-to-day lives of a cheer squad in Corsicana, Texas, give viewers the impression they've stolen a peek inside another world completely foreign, yet just as real as their own.\nIt gives us one-of-a-kind characters\nBhagavan \"Doc\" Antle, a fellow zoo owner featured in the series.\n\"Is America ready for the first redneck, gun-toting, mullet-sporting, tiger-tackling gay polygamist president?\" That's the question one interviewer asked during Maldonado-Passage's brief but memorable run as a presidential candidate in 2016. It was also a shockingly accurate prediction of the present.\n\"You know, I think they are,\" he replied.\nEqually fascinating are, well, pretty much everyone else who appears on screen during the seven-hour series: Baskin, dressed in flower crowns and animal print; Maldonado-Passage's husbands, one of whom almost never wears a shirt; fellow private zoo owner Bhagavan \"Doc\" Antle, who employs a host of young women in what many are calling a cult-like arrangement, and former drug kingpin and exotic animal collector Mario Tabraue, who was rumored to be the inspiration for Tony Montana from \"Scarface.\"\nIn fact, the characters present such a rich pageant of humanity that the larger themes of the documentary often take second place to their misadventures, catchphrases and questionable romantic lives.\n\"We really struggled a lot with the fact that the characters, oftentimes, they and their colorful lifestyles and their cult-like facilities trumped many of the issues that we were really interested in addressing in the piece,\" the show's other co-director, Rebecca Chaiklin, said in a Netflix podcast episode . \"It became more character-driven and less issue-driven.\"\nIt's weird enough to enjoy from afar\nJoseph Maldonado-Passage, aka Joe Exotic.\nThere's an important distinction to make between the kind of heroes that drive traditional narratives -- relatable, worth rooting for -- and the heroes that populate the world of \"Tiger King.\" Like the drama kings and queens of \"Love Island\" or the \"Real Housewives\" franchise, it's their misbehavior, not their morality, that make them so eminently watchable.\nAfter all, while some may feel empathy for Joe Exotic because of his traumatic upbringing and his ultimate imprisonment and loss of his zoo, he does some objectively bad things. If it isn't threatening violence on trespassers and enemies, it's referencing parts of his deceased husband's anatomy at the man's funeral. More questionable still is his treatment of his employees and, ultimately, his beloved animals\nHis is the kind of behavior we expect from cartoon characters and cinematic anti-heroes, but rarely tolerate in actual human beings. Oversized, attention-hungry and ready for fame, Maldonado-Passage and his cohorts occupy an uncanny valley in between.\n\"As strange as he is, he's got a great deal of charisma and a lot of magnetism,\" crime writer Kevin Flynn said about Maldonado-Passage in a recent episode of the podcast \"Crime Writers On.\"\n\"He's got all these people who (realize) he's very odd and kind of sketchy in some ways, but also seem very devoted to him and care about him.\"\nSimilarly, charismatic villains of reality TV shows, like Abby Lee Miller from \"Dance Moms\" or Danielle Staub from \"The Real Housewives of New Jersey,\" are raptly followed but not necessarily liked by the viewing public.\nAnd of course, we definitely aren't rooting for individuals like Robert Durst in \"The Jinx.\"\nBut we'll allow ourselves to get wrapped up in their stories for a few hours.\n\"These types of shows are the same -- parades of people that you don't want to be,\" Safon says. \"Even though we're not admiring them or relating to them or aspiring to be them, we still can be fascinated by them. And the lack of relatability is almost a permission to enjoy it.\"\nIt's all people care to talk about right now\nJack Donald \"Don\" Lewis, whose disappearance is mentioned in \"Tiger King.\"\nIn 2014, the podcast \"Serial\" sparked a renewed hunger for true crime entertainment, and \"Tiger King\" keeps that spirit alive with not one, but two murder mysteries. The first, the murder-for-hire plot at the center of the narrative, for which Maldonado-Passage is currently in jail. The second is perhaps the most contentious topic among \"Tiger King\" devotees: The case of Carole Baskin's missing husband, Jack Donald Lewis.\nJUST WATCHED Netflix is making staying at home 'a little more bearable' Replay More Videos ... MUST WATCH Netflix is making staying at home 'a little more bearable' 04:21\nThe outlandish (and unsubstantiated) prospect of someone putting their murdered husband through a meat grinder to feed to their pet tigers would be irresistible fodder for the internet peanut gallery no matter what. Add in a large dose of isolation, frustration and collective anxiety over a global pandemic, and the many mysteries of \"Tiger King\" become welcome obsessions.\n\"This really is a story about how Netflix could read the room,\" Safon says. \"People are actively looking to other people to tell them what to binge. They're actively seeking reassurance from people, and it's fun to recommend it. It's fun to debate and speculate.\"\n\"After all,\" he adds, \"If we're going to argue about something it might as well be 'Tiger King.'\"\nIndeed, there are countless memes and tweets circulating that marvel at the fateful machinations that brought \"Tiger King\" into people's lives just as they were forced inside to weather a catastrophic global event.", "url": "https://www.cnn.com/2020/04/05/us/tiger-king-documentary-why-popular-trnd/index.html"}