{"authors": [], "date_download": "2020-05-04 20:06:15", "date_modify": "2020-05-04 20:06:15", "date_publish": "2020-04-07 15:46:49", "description": "OMAHA, Neb. (AP) — Ohio State assistant Carrie Banks has been hired as the new women's basketball coach at Omaha, athletic director Trev Alberts announced Tuesday. Banks was an assistant and...", "filename": "_760101e06af8f1b5de823eb04f21f03d_1588622775.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_760101e06af8f1b5de823eb04f21f03d_1588622775.html", "title": "Omaha hires Ohio St. aide Banks as women's basketball coach", "title_page": "Omaha hires Ohio St. aide Banks as women's basketball coach", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "OMAHA, Neb. (AP) — Ohio State assistant Carrie Banks has been hired as the new women’s basketball coach at Omaha, athletic director Trev Alberts announced Tuesday.\nBanks was an assistant and recruiting coordinator for four seasons with the Buckeyes. She replaces Brittany Lange, who was fired last month after seven seasons.\n“Carrie rose to the top of our applicant pool because of her depth of experience as a coach and recruiter,” Alberts said. “She has done a terrific job as an assistant coach at Ohio State, and she is ready to lead her own team.”\nBanks worked primarily with the post players at Ohio State and landed a top-five recruiting class in 2019. The Buckeyes won Big Ten regular-season championships twice and the conference tournament once during her time in Columbus.\n“I am humbled to be selected to lead Omaha’s women’s basketball program,” Banks said. “This place is so rich in potential, leadership and vision, and it just felt like home from the very beginning.”\nBanks previously was an assistant at Northwestern, South Florida and Detroit Mercy. She graduated from Detroit Mercy in 2000 and played professionally in Portugal for two seasons.", "url": "https://apnews.com/760101e06af8f1b5de823eb04f21f03d"}