{"authors": ["Ryan Nobles"], "date_download": "2020-05-04 15:56:28", "date_modify": "2020-05-04 15:56:28", "date_publish": "2020-04-15 17:01:37", "description": "Bernie Sanders ran for president in 2020 because he thought he could win, but the Vermont senator says had no illusions about what he was up against and how difficult it would be.", "filename": "2020_04_15_politics_bernie-sanders-interview-2020_index_1588607788.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408125755-vermont-senator-bernie-sanders-address-supporters-during-a-campaign-rally-in-the-diag-at-the-university-michigan-in-ann-arbor-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_15_politics_bernie-sanders-interview-2020_index_1588607788.html", "title": "'Nothing shocked me': Bernie Sanders reflects on again falling short in his bid for the presidency", "title_page": "'Nothing shocked me': Bernie Sanders reflects on again falling short in his bid for the presidency - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Bernie Sanders ran for president in 2020 because he thought he could win, but the Vermont senator says had no illusions about what he was up against and how difficult it would be.\nNow, as he takes a step back and reflects on his second failed bid for the White House, he remains proud of what he accomplished , but still believes there is a lot more work to do to bring more working class Americans into the political system and implement many of the progressive policy positions he has long advocated for.\n\"It's hard,\" Sanders said in an interview with CNN. \"But we knew what we were doing, and nothing that happened really shocked me.\"\n\"I think what we saw from Nevada on out was a cry the rooftops, from the political establishment, from the media that they wanted anybody but Bernie,\" Sanders said. \"My God, I don't know how many articles there were about that. 'We need anybody but Bernie' and you know they ended up succeeding. And that's that.\"\nHe stayed in the race longer in 2016 and will end up earning fewer delegates this year than he did four years ago. But Sanders emerged as a front-runner this cycle, bouncing back after a heart attack in the fall, fundraising more than his rivals and winning over key endorsements from other progressive leaders. When Sanders won the popular vote in three of the first four primary contests, the nomination seemed within his grasp, but his hopes were dashed after Joe Biden's victory in South Carolina.\nThe former vice president's win there streamlined the establishment backlash to Sanders. Other moderate candidates dropped out and rallied around Biden, setting off a sweeping realignment of the contest that ultimately drowned Sanders, whose campaign was not prepared to weather a storm it so confidently predicted. And while Sanders had increased turnout and enjoyed strong support from young voters, their impact was not nearly what he and his campaign predicted.\nWhile many of Sanders' supporters were ready to claim the nomination after his victory in Nevada, the senator himself understood the challenges he faced.\nIn the aftermath of Sanders ending his bid, there has been a rigorous debate about the way the Sanders campaign approached Biden. Some forces in the Sanders world thought he should have been more aggressive in laying out the differences between the two candidates. But Sanders was insistent that any distinctions that were drawn not come at the expense of the personal relationship between the two men, one built while they were colleagues in the Senate. It is a decision Sanders does not regret - and he argues those lodging complaints likely don't know the whole story.\n\"I think probably, what you're going to find for the next five years is half of America was intimately involved in my campaign,\" Sanders joked. \"Look, there are difference in tactics, but I don't think it was the tactics ended up helping us lose.\"\nSince ending his campaign a week ago, Sanders has thrown his support behind Biden and is left to help convince his passionate base of supporters to get behind the former vice president's challenge to Donald Trump.\n\"Joe and I have our disagreements for sure. Joe is a decent guy and I think he is more than willing now to sit down, and we'll listen to those people that supported him in the past, hear what they have to say and tried to address their concerns,\" Sanders said.\nHe recognizes that Biden will have some work to do to win over progressive supporters, but Sanders argues by November, given the choices in front of them, most will come around.\n\"I think most people will wake up in the morning and say, ' OK, what will role will I play now? Is it acceptable for me to sit on my hands and allow the possibilities? Do I allow the more dangerous president in modern American history to get reelected or do I do everything that I can to defeat Trump while at the same time try to move the Biden campaign and his administration into his progressive position as possible?'\" Sanders said. \"And I think the overwhelming majority of the American people will conclude yes.\"\nThe two sides are in the process of forming six policy task forces that will feature leading experts that supported both candidates. They will release a list of policy proposals that will be a part of the Biden campaign's pitch to voters.\nSanders said he is prepared to stay engaged. He feels that, in many ways, his progressive coalition has won the argument. Many of the big issues he ran on in 2016, from single-payer health care to free college tuition, enjoy far greater levels of popular support now. He also has won the praise of many mainstream Democrats.\nIn his endorsement of Biden's campaign, former President Barack Obama described Sanders as \"an American original.\" Sanders said the embrace by figures like Obama serves as a recognition of where he believes American politics are headed.\n\"If he (Obama) were running for president today, he would not be saying what he said in 2008 because the world has significantly changed and political consciousness has changed,\" Sanders said. \"And any good politician -- Obama and Biden they're both very good politicians -- understand that you've got to go where the people are.\"\nWhat discourages Sanders, though, is that many of the average Americans who would benefit the most from progressive policies like guaranteed health care, a higher minimum wage or free college tuition are still not actively involved in the political process. Sanders believes it is not because they don't exist, but because they still don't feel the system works for them.\n\"We as a nation have the lowest voter turnout of almost any major country on earth. I think it is very difficult to get people to vote when they believe the system is totally rigged against them and that they're vote does not make a difference. I've heard that a million times and that's tough,\" Sanders said. \"But that is exactly what has to be done.\"\nThere is one role that, moving forward, he does not expect to play again: candidate for President.\n\"No one could predict the future, but I think it is fair to say I will not be running for president again,\" Sanders said. \"I guess.\"", "url": "https://www.cnn.com/2020/04/15/politics/bernie-sanders-interview-2020/index.html"}