{"authors": ["Associate Commerce Editor"], "date_download": "2020-05-04 20:22:33", "date_modify": "2020-05-04 20:22:33", "date_publish": "2020-04-28 18:48:44", "description": "ICYMI, Mother's Day is coming up on May 10.", "filename": "entry_staub-cookware-on-sale-sur-la-table_l_5ea84cc3c5b63a5dc014aea6_1588623753.html", "image_url": "https://img.huffingtonpost.com/asset/5ea853cd2200006f0c827ccc.jpeg?cache=claQdzDx4U&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_staub-cookware-on-sale-sur-la-table_l_5ea84cc3c5b63a5dc014aea6_1588623753.html", "title": "There's A Ton Of Staub Cookware On Sale At Sur La Table", "title_page": "There's A Ton Of Staub Cookware On Sale At Sur La Table | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "HuffPost may receive a share from purchases made via links on this page. Prices and availability subject to change.\nSur La Table Sur La Table just marked down all of its Staub cookware up to 55% off. Staub features a collection of French-made enamel and cast iron pots, pans and skillets in a wide variety of sizes, shapes and colors.\nWhether you’re ready to level up your bread baking skills with a dutch oven or are working your way through a restaurant cookbook, it might be time to invest in some new cookware for your kitchen.\nAccording to professional chefs, a sharp knife and decent-sized cutting board are the two essentials you need for a well-prepared kitchen, along with a trusty set of pots, pans and a reliable skillet.\nFortunately, there are plenty of home brands having sales on cookware right now to fuel your sudden interest in baking and broiling. Cult-favorite cookware brand Le Creuset is running a first-ever sale through May 11. And beloved kitchenware site Sur La Table just marked down all of its Staub cookware up to 55% off.\nStaub features a collection of French-made enamel and cast iron pots, pans and skillets in a wide variety of sizes, shapes and colors.\nBelow, check out the Staub pieces that are on sale at Sur La Table to take your kitchen from cute to culinary.", "url": "https://www.huffpost.com/entry/staub-cookware-on-sale-sur-la-table_l_5ea84cc3c5b63a5dc014aea6"}