{"authors": [], "date_download": "2020-05-04 20:08:28", "date_modify": "2020-05-04 20:08:28", "date_publish": "2020-04-16 14:06:17", "description": "JAY, Maine (AP) — State and federal investigators began searching Thursday for the cause of a paper mill explosion that shook the ground and sent debris and a slurry of chemicals raining down on...", "filename": "_1ece422a2d44d02f2de54833ea80c8fb_1588622908.html", "image_url": "https://storage.googleapis.com/afs-prod/media/a00cd9547c4b4b73bf6788a6b485cfd9/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1ece422a2d44d02f2de54833ea80c8fb_1588622908.html", "title": "Investigation begins into cause of massive paper mill blast", "title_page": "Investigation begins into cause of massive paper mill blast", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A worker wearing a hazardous material suit hoses debris off a road near the Androscoggin Mill, Thursday, April 16, 2020, in Jay, Maine. A massive explosion at the mill on Wednesday spewed wood fiber and pulping liquor but resulted in no serious injuries. (AP Photo/Robert F. Bukaty)\nA worker wearing a hazardous material suit hoses debris off a road near the Androscoggin Mill, Thursday, April 16, 2020, in Jay, Maine. A massive explosion at the mill on Wednesday spewed wood fiber and pulping liquor but resulted in no serious injuries. (AP Photo/Robert F. Bukaty)\nJAY, Maine (AP) — State and federal investigators began searching Thursday for the cause of a paper mill explosion that shook the ground and sent debris and a slurry of chemicals raining down on nearby cars and buildings.\nElation over the stunning news that no one was hurt began to shift toward concern about how long the Androscoggin Mill would be idled. A long-term closure could send ripples through the rural economy.\n“We are not in a position to estimate the exact timing of restarting any part of the mill,” Roxie Lassetter, human resources manager, said Thursday.\nThe investigation into the cause of the Wednesday blast was led by a team of investigators from the Maine Fire Marshal’s Office and the federal Bureau of Alcohol, Tobacco, Firearms and Explosives, said Stephen McCausland, spokesman for the Maine Department of Public Safety.\nThe investigators began interviewing workers and got their first look at the damage on Thursday, McCausland said.\nThe blast happened in a massive, kettle-like “digester” where a slurry of wood chips, water and chemicals is transformed into pulp. Nearby vehicles were covered with a thick, brown substance that fell from the sky after the blast.\nBut the massive paper machines that churn out different types of specialty paper escaped damage, and the company is exploring options to get them running as soon as possible, Lassetter said.\nIn Jay, the Androscoggin Mill has been a survivor as other paper mills closed with the loss of thousands of jobs in Maine.\nIts economic impact stretches far beyond the 500 workers there, to a supply chain that includes loggers, truckers and foresters.\n“The Androscoggin Mill and all paper mills have economic tentacles that reach deep in the rural communities of new England,” said Eric Kingsley, a forest economist and partner at Innovative Natural Resource Solutions.\nEach day, 150 trucks dropped off about 30 tons apiece of trees, wood chips and sawdust to be transformed into a food-grade paper that’s used in fast food packaging and in other products, he said.\nThe mill, which was built in the mid-1960s, changed ownership in February when it was sold by Ohio-based Verso to a Pennsylvania company, Pixelle Specialty Solutions.\nAround Jay, the 5,000 residents who’ve become accustomed to ups and downs in the paper industry understand that viability of the mill depends on the extent of the damage.\n“All of the options have entered everyone’s minds. Right now we’re trying to focus on the positive,” said Town Manager Shiloh LaFreniere.\nThe positive includes the fact that none of the 200 workers at the mill at the time of the blast were hurt, LaFreniere said.\nAlso, the Maine Department of Environmental Protection classified the slurry that rained down as a minor irritant that wasn’t considered to be toxic, she said. Public works crews were sweeping the streets and picking up fallen debris on Thursday.\n___\nThis story has been corrected to show that each truck dropped off about 30 tons apiece, not nearly 40 tons of wood materials.", "url": "https://apnews.com/1ece422a2d44d02f2de54833ea80c8fb"}