{"authors": [], "date_download": "2020-05-04 20:08:43", "date_modify": "2020-05-04 20:08:43", "date_publish": "2020-04-09 21:25:03", "description": "KEARNY, N.J. (AP) — A New Jersey town lost an appeal Thursday of a $1.8 million judgment it received from a state agency for a landfill. The town of Kearny's argument that the value for the...", "filename": "_b6bd8b989ded8db5d5b7b1ff2f24073a_1588622923.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b6bd8b989ded8db5d5b7b1ff2f24073a_1588622923.html", "title": "Court rejects town's appeal of $1.8M for landfill", "title_page": "Court rejects town's appeal of $1.8M for landfill", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "KEARNY, N.J. (AP) — A New Jersey town lost an appeal Thursday of a $1.8 million judgment it received from a state agency for a landfill.\nThe town of Kearny’s argument that the value for the 104 acres taken by the New Jersey Sports and Exposition Authority isn’t enough was rejected, according to a ruling issued by a state appellate panel.\nThe state agency, which owns the Keegan Landfill, closed the 100-acre area after more than 200 complaints were logged by residents attesting the smell of rotten eggs had been coming from hydrogen sulfide from the the landfill.\nThe court this week rejected the town’s claim that the $1.8 million payment for the land should have been higher because the state agency earned at least $14 million per year in tipping fees, NJ.com reported Thursday .\nKearny Mayor Al Santos and authority officials were not immediately available for comment.\nThe legal battle between the town and the state agency began in April 2019 after years of back and forth over the noxious odors coming from the site. The town eventually won a court fight to have the landfill closed until October 2021.\nAn agreement laying out the terms of a plan to cap the landfill and dedicate the site to “public passive recreation” was signed in March.\nThe appellate panel sided with the state agency that the property’s calculated value was less since the operations of the landfill would cease.\nThe authority argued that due to the “large mound of garbage ... effectively sitting in a tidal marsh, with steeply sloped sides, the landfill has virtually no practical utility except as a passive park,” the ruling stated.", "url": "https://apnews.com/b6bd8b989ded8db5d5b7b1ff2f24073a"}