{"authors": ["Trends Reporter"], "date_download": "2020-05-04 20:14:14", "date_modify": "2020-05-04 20:14:14", "date_publish": "2020-04-29 02:46:45", "description": "Union's husband, Dwyane Wade, told their friends, “I apologize on behalf of the Wade family.\"", "filename": "entry_gabrielle-union-steph-curry-ayesha-breakup_n_5ea8ccaac5b6123a1763f177_1588623254.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8d010300000b61115516f.jpeg?cache=puqtuhbkxl&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_gabrielle-union-steph-curry-ayesha-breakup_n_5ea8ccaac5b6123a1763f177_1588623254.html", "title": "Gabrielle Union Admits She Once Told Steph And Ayesha Curry To 'Just Break Up'", "title_page": "Gabrielle Union Admits She Once Told Steph And Ayesha Curry To 'Just Break Up' | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "It’s a good thing Gabrielle Union’s relationship advice got ignored back in the day.\nThe actor and her husband, Dwyane Wade, joined their close friends Steph and Ayesha Curry for a boozy Instagram Live this week. Sending both couples into fits of laughter, Union recalled telling the famous duo to throw in the towel many years ago because they were so young.\n“I was like, ‘You guys, the likelihood of this working out is very low and you should just break up now and have sex with other people,’” Union said.\nAyesha Curry remembered the incident between bursts of laughter, adding, “You looked at me and said, ‘How old are you? OK…’”\nGabrielle Union recalls the advice she gave to a young Steph and Ayesha Curry lol pic.twitter.com/C43wN24oSk — Ayesha Curry Updates (@AyeshaHive) April 26, 2020\nWade quickly intervened for his wife: “I apologize on behalf of the Wade family. That’s not who we are anymore.”\nIn all seriousness, though, Union added that she truly respected the couple ― who have been married since 2011 and share daughters Riley Elizabeth and Ryan Carson, as well as son Canon. The two met as teenagers in a youth church group but didn’t get together until after high school when Steph was in college working to start his NBA career and Ayesha had moved to Hollywood to pursue acting.\n“There are very, very few people that I have met who have been consistent. I’ve known you guys for well over a decade, and there are a lot of people who talk about faith and there’s a lot of people who talk about moving the culture forward, but something isn’t real somewhere,” Union said.\n“And when people are like, ‘Are they real?’ And I’m like yes!’”\nThe Currys appeared as strong as ever after celebrating their eighth wedding anniversary last July. Ayesha praised their marriage as “the ultimate blessing” and her husband honored “growing strong through all the ups and downs.”", "url": "https://www.huffpost.com/entry/gabrielle-union-steph-curry-ayesha-breakup_n_5ea8ccaac5b6123a1763f177"}