{"authors": ["Judson Jones", "Cnn Meteorologist"], "date_download": "2020-05-04 16:07:42", "date_modify": "2020-05-04 16:07:42", "date_publish": "2020-04-02 15:01:05", "description": "Sixteen named storms, including eight hurricanes, are forecast for the 2020 Atlantic hurricane season, according to early predictions released Thursday by experts at Colorado State University.", "filename": "2020_04_02_weather_2020-atlantic-hurricane-season_index_1588608462.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190904085957-nick-hague-dorian-eye-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_weather_2020-atlantic-hurricane-season_index_1588608462.html", "title": "4 major hurricanes are predicted as part of an above-normal 2020 Atlantic hurricane season", "title_page": "2020 Atlantic hurricane season: 4 major storms are predicted as part of an above-normal season - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Sixteen named storms, including eight hurricanes, are forecast for the 2020 Atlantic hurricane season, according to early predictions released Thursday by experts at Colorado State University.\nFour of the hurricanes will become major storms of Category 3 to 5, with sustained winds of at least 111 mph, the projections indicate for the season that runs from June 1 to November 30.\nThe chance that at least one major hurricane will make landfall in 2020 along the US coastline is 69%, compared with an average over the last century of 52%, researchers said. There is a 95% chance -- the average is 84% -- that at least one hurricane this year will make landfall in the US.\nJUST WATCHED What it's like riding out Hurricane Maria Replay More Videos ... MUST WATCH What it's like riding out Hurricane Maria 01:29\n\"The last season with four or more major hurricanes was the record damage-causing year of 2017 that saw Hurricanes Harvey, Irma and Maria,\" CNN meteorologist Brandon Miller said. \"All caused significant damage in the US and Caribbean.\"\nSix major hurricanes formed that year in the Atlantic basin. The seasonal average is 12 named storms, including six hurricanes.\nRead More", "url": "https://www.cnn.com/2020/04/02/weather/2020-atlantic-hurricane-season/index.html"}