{"authors": [], "date_download": "2020-05-04 16:04:05", "date_modify": "2020-05-04 16:04:05", "date_publish": "2020-04-01 21:25:56", "description": "We're in a new normal as our living space has become our workspace. And whether you're working from home or taking online classes, you're likely looking for ways to upgrade your home office.", "filename": "2020_04_01_cnn-underscored__9bb426c9bea3f0f8532a155c63c9c333_index_1588608245.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401163302-underscored-magic-mouse-2-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_cnn-underscored__9bb426c9bea3f0f8532a155c63c9c333_index_1588608245.html", "title": "Supercharge your work-from-home setup with a Magic Mouse 2 and Magic Keyboard", "title_page": "Apple sale: The refurbished Magic Mouse 2 and Magic Keyboard are marked down right now - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "We're in a new normal as our living space has become our workspace. And whether you're working from home or taking online classes, you're likely looking for ways to upgrade your home office.\nA simple upgrade you can make: pairing the Apple's Magic Mouse 2 ($54.99, originally $79.99; stacksocial.com) and the Magic Keyboard ($99.99, originally $129.99; stacksocial.com). With this, you'll essentially be supercharging your productivity game.\nBoth of these are certified refurbished by the folks over at Calstate and received a Grade A refurbishment. That means these won't feature any deep scratches or signs of heavy wear. Rather, these have light signs of usage and no major scratches — basically good as new and fully functional. You'll also get a 30-day warranty for parts and labor. This way if something does come up, you're covered.\nAt just $54.99 for a Magic Mouse 2, you're getting Apple's current Bluetooth mouse for 31% off. You'll get a sleek silver Magic Mouse with the now-famous glass top that supports clicks, swipes and taps. It charges via a Lightning cable and connects over Bluetooth to your macOS laptop or desktop. Additionally, this can be paired with any iPad running iPadOS 13.4.\nApple's Magic Keyboard with Numeric Keypad is also available in the silver variant. The main hull is silver with white keycaps. It looks like the classic Apple design. Not only do you have the full QWERTY keyboard, functions and arrow keys ---- but a full keypad is included. This also uses Apple's Magic Keyboard design, which utilizes a scissor-switch for a punchy and accurate typing experience. Like the Magic Mouse 2, this charges with an included Lightning Cable and connects via Bluetooth to your macOS laptop or desktop. You can also pair it with an iOS or iPadOS device.\nAct quickly and score a Magic Mouse for $54.99 or a Magic Keyboard for $99.99 from StackSocial.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/01/cnn-underscored/magic-mouse-2-magic-keyboard-refurbished-sale/index.html"}