{"authors": ["Ronan Burtenshaw", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Amber A'Lee Frost", "Anton Jäger", "Richard Seymour", "David Broder"], "date_download": "2020-05-04 19:55:28", "date_modify": "2020-05-04 19:55:28", "date_publish": "2020-01-06 00:00:00", "description": null, "filename": "2020_01_labour-party-socialist-leader-jeremy-corbyn-rebecca-long-bailey_1588622128.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/01/06163104/GettyImages-1183696433.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_01_labour-party-socialist-leader-jeremy-corbyn-rebecca-long-bailey_1588622128.html", "title": "Why the Labour Party Needs a Socialist as Its Leader", "title_page": "Why the Labour Party Needs a Socialist as Its Leader", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "In the aftermath of the general election, Jeremy Corbyn met with widespread ridicule for saying that the party had “won the argument” in policy terms. After such a crushing defeat, the line went, how could a Labour leader credibly claim that his policies were popular?\nLess than a month on, however, the situation has changed. Polling released in the aftermath of the election showed that key pillars of Labour’s policy platform were extremely popular. Support for nationalization of rail, energy, and water had grown massively — even since the 2017 general election. This backed up evidence from the campaign, which found large majorities in favor of things like taxing the rich and giving workers a share of companies. Even the Telegraph had to admit that Corbyn’s platform had substantial appeal.\nIt’s easy to forget just how far this all is from Labour’s 2015 manifesto. Then, instead of nationalizing the rail, Labour was promising only to review franchising and freeze some fares. Similarly, on energy, the extent of Labour’s ambition was to freeze bills until 2017 and give regulators more powers. Only the really “exploitative” zero-hours contracts were to be banned, plans for an investment bank paled in comparison to what we’ve seen under Corbyn, and instead of a pledge to end the privatization of the NHS (National Health Service), profits were merely to be “capped.” The list could go on.\nThere were many good aspects of Labour’s 2015 manifesto. It made some effort to respond to growing dissatisfaction with inequality and austerity (although it also promised to “cut the deficit every year”). But it is a document that symbolizes a Labour Party that was responding, often meekly, to public opinion — instead of trying to shape it.\nJeremy Corbyn lost last month’s election, but in four years, his leadership of the Labour Party profoundly transformed the public debate over the economy. The candidates to replace him as Labour leader have inherited this new consensus, so much so that even the Tories are pretending to support left-wing policies.\nWe can see the impact of this shift in Keir Starmer’s promise to support “radical” policies if he were to win in April. But the real test is not whether a candidate says they support a set of policies today — it’s whether they are willing to fight for them against the vested interests that defend the existing order. If they’re not, pledging support means very little.\nIt’s easy to make promises to Labour’s left-wing membership during a campaign, but what happens the day after a candidate wins the election? Those promises will come under siege from factions in the party that have never supported a transformative economic agenda. They will be attacked by business lobby groups and by the Tories; they will be assailed in the media. Members should ask themselves, who do we trust to stand up for them?\nA lot of former Corbyn supporters find Keir Starmer’s pitch in this election appealing. Much of this is down to the idea that he “feels” prime ministerial in a way that Jeremy Corbyn never did. Maybe he can win an election, the logic goes; maybe he won’t be torn apart in the same way.\nBut Jeremy Corbyn wasn’t demonized by the powerful because he couldn’t win. He was demonized because he might win — and they were determined to protect their interests against that possibility. Any Labour leader who similarly challenges them will meet the same fate. In fact, even middle-of-the-road leaders like Gordon Brown or soft-left ones like Ed Miliband couldn’t shake it. Keir Starmer will be presented as prime ministerial only until such a point as he rocks the boat.\nThe task for socialists in the Labour Party today is not to shy away from the fight that Jeremy Corbyn waged — against big business, the political class, and the billionaire-owned press. That fight is our only hope of changing the country. They won’t hand us the change we want on a platter; things are the way they are because it’s in the interests of the powerful to keep them that way. The task is to fight better, to fight smarter, to fight with more people on our side.\nThat’s why the next leader of the Labour Party has to come from the party’s Left; they have to bring with them not just the policies of Corbynism but its spirit. They have to be a socialist. Right now, that candidate looks like Rebecca Long-Bailey.", "url": "https://www.jacobinmag.com/2020/01/labour-party-socialist-leader-jeremy-corbyn-rebecca-long-bailey"}