{"authors": ["Phil Mattingly"], "date_download": "2020-05-04 16:14:59", "date_modify": "2020-05-04 16:14:59", "date_publish": "2020-04-03 14:32:13", "description": "For days, Treasury Secretary Steven Mnuchin has promised Friday would be the day a massive loan program for small businesses kicks into gear.", "filename": "2020_04_03_politics_small-b_c199aa34953bafdd9eb9a07e4df2a522_index_1588608899.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200122051245-steven-mnuchin-world-economic-forum-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_small-b_c199aa34953bafdd9eb9a07e4df2a522_index_1588608899.html", "title": "Small business stimulus measures poised for rocky rollout", "title_page": "Small business stimulus measures poised for rocky rollout - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) For days, Treasury Secretary Steven Mnuchin has promised Friday would be the day a massive loan program for small businesses kicks into gear.\nFriday is now here.\nThe program, according to sources in the administration, on Capitol Hill and in the financial sector, is far from ready to do what it is intended to do, at the scale its intended to do it, on day one. As one bank executive said Thursday night: \"This has a very Obamacare website rollout feel to it.\"\nBottom line\nThe first day of a new emergency program isn't the end-all-be-all that defines the success of said program. But by the accounts of more than a dozen people involved with or in conversations about Friday's rollout, it will be a rocky start. Given the big promises -- and far more importantly, the massive need in the marketplace for these loans -- a rocky start is the last thing the Trump administration wants at this point.\nThe guarantee\nMnuchin, at the White House briefing on Thursday: \"We spent the last 24 hours making this system easier. This will be up and running tomorrow.\"\nThe siren\nMultiple major US banks announced on Thursday they wouldn't be prepared to participate in the program on its first day due to lack of guidance from the Treasury Department and the Small Business Administration.\nMost notably, this from JPMorgan Chase: \"Financial institutions like ours are still awaiting guidance from the SBA and the U.S. Treasury. As a result, Chase will most likely not be able to start accepting applications on Friday, April 3rd, as we had hoped.\"\nSeveral others also made clear to clients they weren't prepared -- or didn't think they would be prepared -- to start originating loans under the program on Friday.\nMnuchin, however, in a Friday morning tweet said large banks were, in fact, \"expected to go live soon this morning\" on the loan program.\nThe backstory\nThese concerns from the largest banks were raised directly to Mnuchin in a phone call with bank CEOs on Wednesday. The call was described by one participant as \"constructive, but very sharp at points\" as CEOs attempted to secure changes or new guidance that would allow them to launch under the program.\nThe issues they raised cover several key aspects of the program, but most notably the request for legal protections for any loans originated under the program given the speed and relaxed underwriting standards required under guidelines designed to get the money out.\nExpectations\nAccording to several people involved, the expectation is that *some* loans will go out on Friday.\nMnuchin tweeted Friday morning that he'd received a report that showed community banks had already processed more than 700 loans for $2.5 million.\nBut the actual lending is expected to be limited. Banks are still getting comfortable with the new guidelines, and even more lenders are still waiting for their registration with the SBA to go through so they are approved to participate.\n\"This is going to take days, not hours, to really get off the ground,\" one bank executive said late Thursday night as he and his team were going through the latest iteration of the guidance. \"It'll get off the ground -- the need is just too great for it not to -- but this timeline was simply too aspirational.\"\nTech concerns\nThere is also significant concern that the process and portals created to manage the loan demand will crash over the course of Friday. CNN's Lauren Fox reported that the administration has brought in significant outside tech help to prevent this from happening, including creating a mirror site in preparation for potential overload. But this will be something to watch as the day moves along.\nWhat the program does\nThe Paycheck Protection Program is a loan program overseen by the Small Business Administration that pools $349 billion to guarantee, and eventually forgive, loans deployed by financial institutions to small businesses and nonprofits with fewer than 500 employees in order to cover salary, payroll expenses and debts like mortgage payments and utilities. If the loans are used solely for those purposes, the federal government will forgive them in full.\nHere's a layman's description\nThis is free money for small businesses. If this program works effectively, lawmakers and economists both believe it could be the most important element of the massive rescue package.\nBUT -- and this is important -- in order to access that money, small businesses have to actually secure the loans themselves. And before that, lenders have to know how to originate loans under the guidelines of that program. And *that* is where serious problems still exist on rollout day.\nHere's a reality check\nThis is a massive undertaking, designed to be turned around in a little more than a week. This is basically the loan guarantee portfolio of the SBA multiplied by more than 10 -- with a need that is, for thousands of small businesses, the equivalent of do or die at this point. Mistakes will happen, the rollout will be rocky and people will be frustrated. That's essentially where things are at the moment.\n\"We're trying to be agile in deploying a massive program in the middle of a crisis where we pretty much needed everything in place weeks ago,\" one administration official said. \"We will get it all figured out, but it's a massive undertaking -- of course there will be issues.\"\nAs Small Business Administrator Jovita Carranza put it Thursday: \"This is an unprecedented effort by this administration to support small businesses and we know that there will be challenges in the process.\"\nThe guidelines\nLenders and small businesses spent most of Thursday waiting for these. Mnuchin told reporters Thursday that Treasury and SBA staff had been working basically 24/7 to finalize them. Some of the concerns raised in calls over the last few days with Treasury and SBA officials, particularly from the bank side of things, are addressed here -- most notably the decision to bump the interest rate on the loans from 0.5% to 1% in order to make them more attractive to community banks. But there are still several outstanding issues that haven't been addressed -- and might not be for days.\nOne thing to keep an eye on\nThe guidelines make clear the program is first come, first serve. That means one thing, particularly in this moment of confusion/problems in the early stages of the program: those with the best and most connected lawyers will secure the money first. Those that lack that kind of access/counsel could very well miss out. The volume is expected to be *enormous* and several people involved have raised concerns that the $349 billion won't be enough.\nMnuchin's commitment\nMnuchin made clear at the White House press briefing Thursday that if the $349 billion isn't enough, they will immediately go to Congress and ask for more. This, according to people involved, is almost certain to occur.\nThe tweet thread everyone was circulating Thursday\nFrom Brock Blake , the chief executive of Lendio, a marketplace that connects borrowers and lenders.\nThe more important tweets\nThe above thread got all the attention Thursday, but these tweets from Jill Castilla, the president, CEO and vice chairman of Citizens Bank of Edmond in Oklahoma, are probably far more notable, as they underscore the confusion and frustration on the bank side of things.\n\"We want to get this $350 Billion out to our #smallbiz now. For PPP to be successful, the guidelines have to be clear. It is imperative that the qualifications for the @SBAgov guarantee are explicit, simple and timely. Right now, there is too much ambiguity & too little structure.\"\n\"Has anyone seen @SBAgov guidelines? I know @USTreasury Secretary said he was on a call with all bank CEOs, but I must have missed that one?\"\nThe view from the Hill\nLawmakers are extremely invested in this program working. It was the most bipartisan aspect of the entire package, and every office on the Hill has been inundated with small businesses warning they are about to fall off a cliff.\nAides on both sides acknowledge Friday could be rocky, but they're balancing between being ready with the reality that waiting to get the rollout perfect risks more job losses.\n\"Is it going to roll out smoothly, is every single business owner going to be approved for their loans tomorrow? Probably not,\" one aide acknowledged. \"Should we wait a week?\"\nA more grounded view\nSen. Marco Rubio, the lead Republican negotiator for the program, had a more measured approach to the concerns being raised across the universe of participants throughout the day Thursday.\n\"All the issues raised regarding certification requirements etc. are being addressed right now by @USTreasury. Will be very simple.\"", "url": "https://www.cnn.com/2020/04/03/politics/small-business-loans-stimulus-state-of-play/index.html"}