{"authors": [], "date_download": "2020-05-04 20:15:10", "date_modify": "2020-05-04 20:15:10", "date_publish": "2020-04-08 19:56:54", "description": "RALEIGH, N.C. (AP) — North Carolina State has accepted a recommendation for its NCAA case involving recruiting violations tied to former one-and-done star Dennis Smith Jr. to go through the new...", "filename": "_03fcb1cc4ed09f6736f344e7d9370b71_1588623310.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f0fb175a51d54e048c52f4447662a039/2400.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_03fcb1cc4ed09f6736f344e7d9370b71_1588623310.html", "title": "NC State accepts NCAA case referral for independent process", "title_page": "NC State accepts NCAA case referral for independent process", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Jan. 23, 2017, file photo, N.C. State's head coach Mark Gottfried speaks with Dennis Smith Jr. during the second half of an NCAA college basketball game in Durham, N.C. North Carolina State’s NCAA case involving recruiting violations tied to former Wolfpack one-and-done star Smith Jr. has been recommended to go through an independent investigation process created for complex cases. Gottfried is charged individually in N.C. State's infractions case under the provision of head-coach responsibility for violations within his program. (AP Photo/Gerry Broome, File)\nFILE - In this Jan. 23, 2017, file photo, N.C. State's head coach Mark Gottfried speaks with Dennis Smith Jr. during the second half of an NCAA college basketball game in Durham, N.C. North Carolina State’s NCAA case involving recruiting violations tied to former Wolfpack one-and-done star Smith Jr. has been recommended to go through an independent investigation process created for complex cases. Gottfried is charged individually in N.C. State's infractions case under the provision of head-coach responsibility for violations within his program. (AP Photo/Gerry Broome, File)\nRALEIGH, N.C. (AP) — North Carolina State has accepted a recommendation for its NCAA case involving recruiting violations tied to former one-and-done star Dennis Smith Jr. to go through the new independent investigation process for complex cases.\nIn a statement Wednesday, Chancellor Randy Woodson questioned whether the school “can receive an objective or fair hearing” in a typical infractions-committee route. Woodson said the Independent Accountability Resolution Process (IARP) is “the only remaining option.”\nThe NCAA created the IARP following reform proposals from the commission led by former U.S. Secretary of State Condoleezza Rice in the wake of a federal corruption investigation into college basketball. It includes independent investigators and decision-makers with no direct ties to member schools. Rulings cannot be appealed.\nNorth Carolina State’s response to the NCAA’s recommendation stated the university “does not concede its substantive right to appeal,” referencing remedies “within and outside of the NCAA structure.” A committee reviews referral requests before accepting cases into the IARP.\nNorth Carolina State was charged last summer with four violations, including ex-coach Mark Gottfried individually under the provision of head-coach responsibility for violations within his program. Notably, a government witness testified he delivered $40,000 to ex-assistant Orlando Early for Smith’s family in 2015.\nThe school and Gottfried’s attorneys responded to the charges in December, though the NCAA enforcement staff’s response in February held firm that violations occurred.\nA week later, infractions committee member Carol Cartwright’s referral request stated case filings had included “adversarial posturing that goes beyond simple disagreement and advocacy.” N.C. State argued Wednesday its factual and procedural concerns are “legitimate” and noted its cooperation with federal and NCAA investigators.\n___\nMore AP college basketball: http://apnews.com/Collegebasketball and http://www.twitter.com/AP_Top25", "url": "https://apnews.com/03fcb1cc4ed09f6736f344e7d9370b71"}