{"authors": ["Kristen Rogers"], "date_download": "2020-05-04 16:25:25", "date_modify": "2020-05-04 16:25:25", "date_publish": "2020-04-07 07:31:14", "description": "With almost half of Americans ordered to stay at home in compliance with social distancing, household labor might be piling up faster than you can handle. There are ways everyone can chip in to foster a cleaner, happier and healthier home.", "filename": "2020_04_07_health_how-to-di_f6ad4017813e5ad0c04605cb0e04133f_index_1588609525.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401083936-family-household-chores-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_health_how-to-di_f6ad4017813e5ad0c04605cb0e04133f_index_1588609525.html", "title": "How to divide housework now that the whole family's home", "title_page": "How to divide housework now that the whole family's home - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) With most states ordering Americans to stay at home in compliance with social distancing , household labor might be piling up faster than you can handle.\nThere are more dirty dishes, more trash, and more areas of the house to organize and keep sanitized.\n\"Many families are now spending a lot more time at home and on top of each other in a way that I think it will [be] difficult not to see the visible and invisible labor [required] to just run a household. And then on top of that, you're both trying to do your work,\" said Brigid Schulte, author of \"Overwhelmed: How to Work, Love and Play When No One Has the Time.\"\n\"And then you're both trying to manage children and sometimes schooling because schools are closed and childcare centers are closed, and nannies and babysitters are also home and quarantining,\" said Schulte, who's also director of The Better Life Lab , which provides research and reporting on work-life and family culture.\n\"So we're really in a completely new space, as challenging and difficult as it is. It does open up real possibilities to begin to have conversations.\"\nIt can be frustrating to need more help from your partner and kids but not receive it. There are ways everyone can chip in to foster a cleaner, happier and healthier home.\nSwitching up routines\nBefore the outbreak , Gisel Smith, a primary school teacher in Marietta, Georgia, felt as if she had everything under control. For her three boys, she managed chores, mealtimes and everything else.\n\"Now, I feel that those responsibilities -- everybody has to take a little bit of it. Someone has to cook, someone has to clean,\" she said.\nSmith was typically the one responsible for dinner, and her husband would help by taking their three boys, ages 5, 8 and 14, on a walk around the neighborhood so she could focus on cooking . But now, with her husband's remote work trickling over into evening hours, she doesn't have that time.\nSmith and her husband have started meeting regularly to discuss what's working for them and small details they could improve upon. For example, her husband might make up for the lack of an evening walk by cleaning the kitchen afterward.\nThe boys have stepped up, too. A chore sheet the family has on a common area door helps, and the boys can mark the tasks they complete in whichever order they want.\n\"Really what has been very helpful for us as a family is to have their chores printed, so they know what to expect, and we don't have to be nagging at them,\" Smith said.\nThe Smiths encourage their boys to understand the value of helping out around the house by telling them the family is in this together, Smith said. \"This is a team, and we're a body where one hand does something and the other handles the other things.\"\n\"We talk a lot about how their decisions affect us,\" she added. \"If I decide to not get up one day, it's going to affect everybody. If my husband decides to not clean the garage, it's going to affect everybody.\n\"We tell them often, 'This house is yours, you take care of it. We are responsible, and we have to be good stewards of what God has provided to us and take care of it.'\"\nInstilling this value system of collectiveness has primed their kids to jump in when they see they're needed.\nOne recent morning, Smith made breakfast and hurriedly left the dishes to teach online classes. When she returned to the kitchen, her eldest son had already finished cleaning up. \"I think he was very proud of himself, that he just did it without me asking.\"\nHome life is still hectic, but consideration and collaboration have helped the Smiths adjust to life during a pandemic\nParents, wearers of multiple hats\nBob Ford, an engineer and app developer in Brooklyn, New York, is teleworking while his wife, Catalina, cares for their newborn. The biggest change is having to homeschool their sixth-grader.\n\"The lesson plans our son gets from his teachers are a mess, quite frankly, so who is going to work with him every day to sort through what he needs to do for each subject and work with him to make sure he understands the material?\" he said.\nSince his wife's schedule is driven by the baby , it's become Ford's responsibility to step away from his work to help his son. It can be \"distracting to flip-flop between work and teaching sixth grade math,\" he said.\nWorking from home has made it easier for the Fords to get chores done during the day, but more difficult to separate work and home life. Ford finds himself bouncing around to different tasks often, which makes it seem like the workload never stops.\n\"I never get to physically leave my work at the office, and I never get to step away from the clutter at home,\" Ford said. \"Of course, my wife is very appreciative, as I am of her hard work with the baby. I think positive communication is more important than ever in these stressful times.\"\nThe Fords created Labor of Love , a gamified family productivity app they hope will aid these conversations. They use it on a regular basis to communicate about what needs to be done and take turns doing chores.\nWith the app, users create a to-do list with their partner or family and work together to complete the chores and errands. They then earn appreciation and rewards according to personal interests for the tasks they complete.\n\"It reminds me how valuable the work is that my wife is doing, and it helps me remember to be appreciative of what she's doing, too,\" Ford said. \"These extra chores, homeschooling and all the other sources of stress, all while quarantined at home, are a recipe for disaster if we don't keep communicating in a positive way.\"\nCommunication and acceptance\nExpert opinion supports some of the ideas these families have been practicing to balance and organize responsibilities around the home.\nOne of the most important steps to determining who does what and why is communication between partners during regular meetings, said Jill Yavorsky, assistant professor in the sociology department and organizational science program at the University of North Carolina Charlotte.\n\"That can be done the night before, and they map out what they need to do the following day,\" she said. \"It also involves writing out all of the tasks that need to be done, and then having a conversation about who will take on each task in consideration of their work schedules, other priorities and what they each like and dislike doing.\"\nSchulte suggests starting out with small experiments that make tasks automatic responsibilities of a person; for example, the last person out of bed is the one who makes it. Maybe one person empties the dishwasher in the morning, and someone else loads it at night.\nAfter trying these little experiments, partners -- with each other and their kids -- should come together to reflect on how they made each other feel, Schulte said. Did it make someone feel more supported? Did someone feel better that they took part in a chore, rather than just observing?\nThen you can work up to bigger experiments, such as creating a spreadsheet that details everything needed to run the household, including housework, childcare and mental labor. Work together to refine the list, and have frequent check-ins, Yavorsky said. How are chores going now? Has anything slipped? Does it feel fair?\n\"Honest conversations and honest listening are the keys to really finding your way to fairness and recognizing that it's going to look different for every couple based on what your expectations are,\" Schulte said. \"And it's also going to change over time, and [this time] is a perfect example of how things need to shift and change. You need to be responsive to the moment.\"\nPartners and parents should also be OK with having individual standards for what the completion of a task looks like, Schulte said. Maybe that means accepting the way your kid or partner rolls up fitted sheets and stuffs them in the linen closet instead of having perfectly stacked sheets that look like Martha Stewart folded them.\nThough it can be frustrating if a loved one's job doesn't measure up to your standards, by stepping in to fix it you're only worsening the imbalance, Schulte said.\nRescuing someone from their responsibility can contribute to a phenomenon called learned helplessness, which, in this context, means a partner or child may think that because there are no consequences for not following through, doing the job well or at all may be pointless since someone will save them from it.\nEstablishing individual responsibilities, accepting personal standards and avoiding nagging can also lighten the mental load on one partner's shoulders.\n\"It's not about being the helper; that's still a lot of mental labor for typically the woman to try to remember what needs to be done and then follow up on it,\" Schulte said. \"We're trying to move beyond that so that everybody takes responsibility for the mental labor as well as the actual physical labor.\"\nIncreasing overall satisfaction\nThe positives of a family consensus on chores not only makes for a cleaner home, but can spill over into your relationships as well.\nResearch shows that egalitarian relationships are associated with a myriad of positive benefits, Yavorsky said. Men and women who split childcare and housework tend to report better relationship satisfaction.\n\"They have more satisfying sex. They are less likely to talk about getting a divorce or that their relationship is in trouble,\" Yavorsky said. \"Having these egalitarian relationships set up the relationship for less marital discord, less conflict and less resentment, which can be a huge detractor for marriages and relationships.\"\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nFor family members, feeling like a contributing citizen to the household can build confidence, a sense of closeness and self-esteem, Schulte said. It can reduce stress in the environment that would be generated by arguments over an unfair distribution of housework.\nContinued communication about roles in terms of childcare and housework -- and encouraging it as part of your normal family routine -- can help ensure an even distribution of housework lasts after distancing and quarantines are over, Yavorsky said.", "url": "https://www.cnn.com/2020/04/07/health/how-to-divide-family-housework-chores-coronavirus-wellness/index.html"}