{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:21:00", "date_modify": "2020-05-04 20:21:00", "date_publish": "2020-04-29 16:34:05", "description": "The newspaper said its investigation into the sexual assault accusation \"made no conclusion either way\" about its truth.", "filename": "entry_new-york-times-joe-biden-tara-reade_n_5ea98a86c5b6fb98a2b6081e_1588623660.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9953a3000004a1015520c.jpeg?cache=ck4ibh3ofm&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_new-york-times-joe-biden-tara-reade_n_5ea98a86c5b6fb98a2b6081e_1588623660.html", "title": "New York Times Refutes Biden Campaign's Reported Talking Points On Tara Reade Allegation", "title_page": "New York Times Refutes Biden Campaign's Reported Talking Points On Tara Reade Allegation | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "While presumptive Democratic presidential nominee Joe Biden has yet to publicly address a sexual assault allegation against him made by former Senate staffer Tara Reade, behind the scenes the campaign is pushing talking points to surrogates that say the incident never occurred.\nAs BuzzFeed reported on Tuesday, the centerpiece of those talking points is the assertion that a New York Times review “led to the truth: this incident did not happen.”\nBut on Wednesday, in a statement to HuffPost, a spokesperson for the Times pushed back on this claim, denying that its report made a conclusion “either way” about the truth of Reade’s accusation.\nThe reported talking points “inaccurately suggest” the Times investigation found the alleged assault “did not happen,” the Times spokesperson said. “Our investigation made no conclusion either way.”\nReade has alleged Biden pushed her against a wall and penetrated her with his fingers when she worked as a staff assistant in his Senate office in 1993. The Biden campaign has vehemently denied the allegation.\nFor their article published earlier this month, Times reporters Lisa Lerer and Sydney Ember interviewed numerous people who worked in Biden’s office in 1993. They also contacted friends and family members who Reade said she confided in about the alleged assault.\n“As Buzzfeed correctly reported, our story found three former Senate aides whom Reade said she complained to contemporaneously, all of whom either did not remember the incident or said that it did not happen,” the Times spokesperson said.\n“The story also included former interns who remembered Reade suddenly changing roles and no longer overseeing them, which took place during the same time period that Reade said she was abruptly reassigned,” the statement continued. “The Times also spoke to a friend who said Reade told her the details of the allegation at the time; another friend and Reade’s brother say she told them of a traumatic sexual incident involving Biden.”\nThe talking points reportedly crafted by the Biden campaign, obtained by BuzzFeed, advise campaign surrogates to say the Times’ investigation determined the incident “did not happen.”\n“Biden believes that all women have the right to be heard and to have their claims thoroughly reviewed,” the talking points reportedly say. “In this case, a thorough review by the New York Times has led to the truth: this incident did not happen.”\nA spokesperson for Biden’s campaign declined to comment, citing a policy against commenting on reported leaks from the campaign.\nStacey Abrams, a top contender to be Biden’s vice presidential running mate, told HuffPost on Tuesday that nothing in the Times investigation or any other reports on Reade’s allegation suggested anything other than Biden having the potential to “make women proud as the next President of the United States.”\nShe doubled down on her defense of Biden during an interview with CNN hours later.\n“I believe that women deserve to be heard and I believe that they need to be listened to,” Abrams told CNN’s Don Lemon. “But I also believe that those allegations have to be investigated by credible sources. The New York Times did a deep investigation. And they found that the accusation was not credible.”\nShe added: “I believe Joe Biden. I believe that he is a person who has demonstrated his love of family, of our community, has been made perfectly clear through his work as a congressional leader and as an American leader. I know Joe Biden, and I think he’s telling the truth and this did not happen.”\nHuffPost this week reached out to nine people rumored to be on Biden’s short list of vice presidential candidates about Reade’s allegation. As of Wednesday morning, only Abrams had responded.\nAbrams did not immediately respond to HuffPost’s request for comment about the talking points.\nReade was one of at least eight women last year to publicly accuse Biden of inappropriate touching. She said at the time that she worked in his Senate office when she was in her mid-20s and that he would make her uncomfortable by running his fingers up her neck or putting his hand on her shoulder.\nBiden, in response to the touching allegations, acknowledged last year that “social norms are changing.” He said he would be “more mindful about respecting personal space in the future.”\nReade expanded on her allegation last month in separate interviews with The Intercept and with podcast host Katie Halper to include the assault claim. The Times confirmed in its investigation that Reade worked for Biden’s office from December 1992 to August 1993. She said she complained about Biden’s behavior to several senior staffers at the time and also filed a formal complaint with the Senate. Reade said she was subsequently stripped of most of her duties. She said Ted Kaufman, Biden’s chief of staff at the time, later told her she wasn’t a good fit for the job and gave her a month to find a new one. Kaufman told the Times that he “did not know her” and that Reade did not complain to him about Biden’s behavior. The Biden campaign told the Times it does not have the complaint that Reade said she filed. Reade’s former neighbor, Lynda LaCasse, told Business Insider in a report published Tuesday that Reade confided in her about what happened in the mid-1990s. “I remember her saying, here was this person that she was working for and she idolized him,” LaCasse told the outlet. “She felt like she was assaulted, and she really didn’t feel there was anything she could do.”", "url": "https://www.huffpost.com/entry/new-york-times-joe-biden-tara-reade_n_5ea98a86c5b6fb98a2b6081e"}