{"authors": ["David Eggert"], "date_download": "2020-05-04 20:28:41", "date_modify": "2020-05-04 20:28:41", "date_publish": "2020-04-15 19:13:17", "description": "LANSING, Mich. (AP) — A federal appeals court on Wednesday refused to block the creation of a Michigan commission to draw seats in Congress and the Legislature after the 2020 census, denying...", "filename": "_3e61bf199a94ea9a042f41d4ee1df2cb_1588624121.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3e61bf199a94ea9a042f41d4ee1df2cb_1588624121.html", "title": "Appeals court refuses to block Michigan redistricting panel", "title_page": "Appeals court refuses to block Michigan redistricting panel", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LANSING, Mich. (AP) — A federal appeals court on Wednesday refused to block the creation of a Michigan commission to draw seats in Congress and the Legislature after the 2020 census, denying lawsuits filed by Republicans who say eligibility rules violate their constitutional rights.\nA voter-approved 2018 amendment to the state constitution took redistricting out of the hands of state lawmakers and placed it with a 13-member commission whose four Republicans, four Democrats and five independents will be selected at random among applicants. It was a bid to curtail gerrymandering in a state where the GOP has had one of the largest partisan legislative advantages in the country after controlling the once-a-decade process in 2011.\nCurrent and former partisan elected officials, candidates and their family members are among those barred from getting a commission seat — a restriction that was challenged by the Michigan Republican Party, GOP legislators and others. They also said there is no reliable way to verify the panel’s political makeup .\nBut the 6th U.S. Circuit Court of Appeals, in a 3-0 ruling , upheld a lower judge’s decision to not grant a preliminary injunction.\nJudge Karen Nelson Moore, in an opinion joined by Judge Ronald Lee Gilman, wrote that the eligibility criteria “are part and parcel of the definition of this Commission, of how it achieves independence from partisan meddling.” Both were appointed by former President Bill Clinton. Judge Chad A. Readler, who was nominated by President Donald Trump, concurred in the result.\n“It is refreshing to see the Court embrace as a central principle a state’s prerogative in organizing its government, including its election system,” he said.\nState GOP spokeswoman Tony Zammit said the party will review its legal options.\n“We are disappointed by today’s court decision but stand by our belief that the current format of the redistricting committee is unconstitutional,” he said.\nVoters Not Politicians, the group that spearheaded the ballot measure, said it will continue to encourage as many people as possible to apply to serve on the commission before the June 1 deadline. More than 4,300 applications have been processed by the secretary of state’s office.\n“Michigan voters want fair maps,” said Paul Smith, vice president of the Campaign Legal Center, who participated in oral arguments on behalf of the ballot committee last month. “They will not be silenced by special interests, who continue to try and exert their will over the redistricting process.”\n___\nFollow Eggert on Twitter at https://twitter.com/DavidEggert00", "url": "https://apnews.com/3e61bf199a94ea9a042f41d4ee1df2cb"}