{"authors": ["Reporter"], "date_download": "2020-05-04 20:03:06", "date_modify": "2020-05-04 20:03:06", "date_publish": "2020-05-04 17:37:50", "description": "The \"Jojo Rabbit\" director isn’t new to the “Star Wars” universe. Previously, he directed the season finale episode of “The Mandalorian.”", "filename": "entry_taika-waititi-star-wars-mandalorian_n_5eb044c8c5b602e521f11fd1_1588622586.html", "image_url": "https://img.huffingtonpost.com/asset/5eb045d92200000e108281ed.jpeg?cache=3hz0uu6kcd&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_taika-waititi-star-wars-mandalorian_n_5eb044c8c5b602e521f11fd1_1588622586.html", "title": "Oscar Winner Taika Waititi To Write And Direct New 'Star Wars' Movie", "title_page": "Oscar Winner Taika Waititi To Write And Direct New 'Star Wars' Movie | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Oscar winner Taika Waititi is going from Nazi Germany to ... a galaxy far, far away.\nAccording to a Disney press release, the film will be released in theaters ― remember those?\nWaititi will write the film with Krysty Wilson-Cairns, who was nominated this year for a best original screenplay Oscar for co-writing “1917.”\nNo other details about the film were announced, but Waititi isn’t new to the “Star Wars” universe. Previously, he directed the season finale episode of “The Mandalorian.”\nThere is no release date yet for the new film. Waititi is currently finishing work on the fourth Thor film, “Thor: Love and Thunder.”\nWaititi’s work on an upcoming “Star Wars” feature isn’t the only project in the works.\nLeslye Headland, an Emmy-nominated writer who has worked on shows such as Netflix’s “Russian Doll,” is currently developing a new, untitled “Star Wars” series for Disney+.\nDisney offered no other details on either Waititi’s movie or Headland’s show.\nThe announcements came, fittingly, on May 4, which is known to fans as Star Wars day (as in May the Fourth be with you).", "url": "https://www.huffpost.com/entry/taika-waititi-star-wars-mandalorian_n_5eb044c8c5b602e521f11fd1"}