{"authors": ["Daniel Dale"], "date_download": "2020-05-04 16:53:23", "date_modify": "2020-05-04 16:53:23", "date_publish": "2020-02-04 22:43:31", "description": "The best and worst thing about fact-checking President Donald Trump is that he says a lot of the same things over and over.", "filename": "2020_02_04_politics_fact-checker-guide-state-of-the-union_index_1588611203.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190210115934-trump-sotu-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_02_04_politics_fact-checker-guide-state-of-the-union_index_1588611203.html", "title": "A fact checker's guide to the State of the Union", "title_page": "A fact checker's guide to the State of the Union - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The best and worst thing about fact-checking President Donald Trump is that he says a lot of the same things over and over .\nIt can be tiresome to fact-check the same false claim dozens of times. But when a big event is approaching, it's helpful to have an idea of what to expect.\nTrump may throw us a curveball at the State of the Union tonight. These formal, heavily vetted speeches tend to sound much different -- and include fewer false claims -- than the unfiltered, ad-libbed lines Trump tends to deliver in exchanges with reporters and at his campaign rallies.\nIn case he repeats much of his usual rhetoric, though, here's a fact checker's guide to what to look for.\nThe economy\nTrump makes a lot of boasts about the strength of the US economy, many of them true.\nUnemployment rates for African Americans Hispanics and Asians are at record lows, at least since data for these groups has been released by the government.\nThe average overall unemployment rate for Trump's presidency is the lowest under any president at least since Dwight D. Eisenhower in the 1950s. The economy has added about 7 million jobs during Trump's tenure , while stock markets continue to rise.\nBut Trump is nonetheless not always truthful when he talks about this subject. Here are some claims to watch for:\nExaggerations\nTrump frequently exaggerates even legitimate accomplishments. For example, he sometimes turns the lowest women's unemployment rate in about 66 years into the lowest women's unemployment in \"71 years.\" He claimed in January to have created \"700,000\" manufacturing jobs, though the actual number , about 500,000, is itself plenty good.\nOmitted context\nTrump usually suggests that positive economic numbers are solely the result of his own actions. Keep in mind that he inherited some positive economic trends. For example, the unemployment rate for various groups declined substantially under President Barack Obama.\nOmitted timetables for 'all-time' and 'recorded' lows\nMany of Trump's claims to have set records are accurate -- but some of the achievements would sound less impressive if the President noted that the available data doesn't go back very far.\nIt's true, for example, that the unemployment rate for people with disabilities is the lowest on record, but the government has been releasing this information only since 2008.\nTrade\nTrump habitually claims that China has paid for his tariffs on that country. Numerous studies have shown this is not true.\nThe President also cherry-picks estimates of the possible impact of his trade agreements. For example, his claim that his US-Mexico-Canada Agreement is expected to create about 80,000 auto jobs is based on an estimate from his own administration; the estimate from an independent federal agency is lower.\nHis claim that the USMCA is expected to boost GDP by 1.2% is the highest of three estimates from an independent government analysis; in a \"moderate\" scenario, the same report said the estimated GDP boost would be much lower, 0.35%.\nImmigration\nTrump frequently leaves out context when discussing immigration, one of his favorite topics.\nHe has recently claimed that he has built more than 100 miles of new wall on the Mexican border. What he doesn't say is that just one of these miles has been erected where no barriers existed before. The vast majority of the construction has been of replacement or reinforcement barriers.\nTrump has also been touting a decline of more than 70% in illegal crossings of the Mexican border since May. He doesn't mention that May was the highest point for illegal crossings since he took office -- and that the total number in his first two full fiscal years in office was higher than the number in Obama's last two full fiscal years in office.\nThe military and NATO\nTrump tends to exaggerate how much change he has brought to the military. While his administration has poured money into the military budget, it's far from true that military equipment is completely revamped or that, as he has claimed in recent months, the troops no longer use old planes.\nThe President also tends to stretch the truth about NATO. Contrary to his regular assertions, it's not true that military spending by non-US member countries was declining when he took office; that spending increased in 2015 and 2016. And spending by non-US members is expected to increase by $400 billion by 2024, not the $530 billion that Trump frequently claims\nVarious outdated or nonexistent accomplishments\nThe President likes to take credit for things that others accomplished -- or for Trump-era accomplishments that are now out of date.", "url": "https://www.cnn.com/2020/02/04/politics/fact-checker-guide-state-of-the-union/index.html"}