{"authors": ["Chevel Johnson"], "date_download": "2020-05-04 20:16:44", "date_modify": "2020-05-04 20:16:44", "date_publish": "2020-04-15 15:38:11", "description": "NEW ORLEANS (AP) — A white lawyer who defended black civil rights activists at the height of the movement in Louisiana, often weathering threats to his own life, has died. Richard Barry...", "filename": "_be31592bb5c83c1b2758e456377395c6_1588623404.html", "image_url": "https://storage.googleapis.com/afs-prod/media/769c547a7bf042b3b6107e6a287c6a7f/1920.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_be31592bb5c83c1b2758e456377395c6_1588623404.html", "title": "Attorney who fought for civil rights in Louisiana has died", "title_page": "Attorney who fought for civil rights in Louisiana has died", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This 2019 photo provided by Augusta Films, shows Richard Sobol in a still from the documentary \"A Crime on the Bayou.\" Sobol, a lawyer who defended black civil rights activists at the height of the movement in Louisiana, often weathering threats to his own life, died March 24, 2020, at his home in Sebastopol, Calif., of aspiration pneumonia. He was 82. (Augusta Films. A Crime on the Bayou via AP)\nThis 2019 photo provided by Augusta Films, shows Richard Sobol in a still from the documentary \"A Crime on the Bayou.\" Sobol, a lawyer who defended black civil rights activists at the height of the movement in Louisiana, often weathering threats to his own life, died March 24, 2020, at his home in Sebastopol, Calif., of aspiration pneumonia. He was 82. (Augusta Films. A Crime on the Bayou via AP)\nNEW ORLEANS (AP) — A white lawyer who defended black civil rights activists at the height of the movement in Louisiana, often weathering threats to his own life, has died.\nRichard Barry Sobol died March 24 at his home in Sebastopol, California, of aspiration pneumonia, stemming from radiation treatment for squamous cell carcinoma found in a lymph node in his neck, his wife, Anne Sobol, told The Associated Press in an email. He was 82.\nSobol’s career included groundbreaking litigation involving desegregation of schools, employment discrimination against minorities and women, electing blacks to public office and a criminal case that led to a U.S. Supreme Court decision guaranteeing the right to a trial by jury in state criminal cases.\nGary Duncan, the subject of that case, said he’s still at a loss for words after hearing of Sobol’s death.\n“When he passed away, I lost part of myself,” Duncan said in a telephone interview from his home in Harvey, Louisiana. “He was one of the greatest people in the world.”\nDuncan said Sobol treated him like a son and his death is a “great loss” to the world.\n“He was dedicated for what he was doing,” Duncan said. “There was no money involved really but he had a belief that everybody should have equal rights. He represented a lot of people in Louisiana and was threatened everywhere he went but he didn’t let that get in his way. He was a strong man to be able to do that.”\nDuncan said Sobol was jailed for representing him but that didn’t stop him.\nSobol arrived in Louisiana in 1966 as a volunteer for the Lawyers Constitutional Defense Committee. In a 2016 piece about his work for the LCDC that appears in Kent Spriggs’ Voices of Civil Rights Lawyers: Reflections from the Deep South 1964-1980, Sobol said that assignment saw him enter “a new world from which I have never returned.”\n“In Louisiana, people who needed help would be depending on my work,” he wrote. “Whether I did it and did it quickly and successfully meant the difference between jail or not jail; integrated or segregated education; fair or discriminatory employment practices; the right to demonstrate or the denial of that right; access to public accommodations or the denial of access; the right to vote or tricks to nullify that right; and so on.”\nHe noted working for LCDC came at a time after significant milestones in the movement, including the Freedom Rides, the March on Washington and enactment of the Civil Rights Acts of 1964 and 1965.\nPeter Edelman, a lifelong friend who met Sobol while clerking for judges on the 2nd Circuit U.S. Court of Appeals in New York City., said Sobol was “a lawyer’s lawyer and just a wonderful man.”\n“He was so smart and so committed to justice,” said Edelman, a professor at Georgetown Law School.\nSobol’s work in Louisiana, he said, was really remarkable.\n“In Louisiana, at the time of the civil rights movement, lawyering was really thin and Richard was a major player. Everyone went to him; he took on complicated cases, anything that was to be done and he became kind of a hero and he absolutely deserved that,” he said.\nAnother friend, retired Columbia Law School professor George Cooper, worked with Sobol at the LCDC.\n“We wanted to do more with our lives,” he recalled. “Richard was one of those men for whom civil rights and justice, particularly justice for black people, was the cause to which he devoted his life. And he faced a lot of danger because of that.”\nCooper worked with Sobol on one of the first class action lawsuits involving employment discrimination involving a paper mill in Bogalusa, Louisiana and said after that Sobol became the “go-to man” for anyone who had a racial discrimination case.\nA book about the Duncan case is scheduled for release this summer and a documentary about the case is in the works, Anne Sobol said.\nSobol left Louisiana in 1968 shortly after the Duncan decision, and returned to Washington to practice law. He also taught at the University of Michigan’s law school before returning to Louisiana in 1971. Three years later he founded a civil rights law firm in Washington, D.C. with Michael Trister. In 1991, he returned to Louisiana, where he lived for more than two decades.\nSobol is survived by his wife of 45 years, Anne Buxton Sobol, and his daughter, Joanna Sobol McCallum.\n___\nThe location of appeals court has been corrected to New York City;", "url": "https://apnews.com/be31592bb5c83c1b2758e456377395c6"}