{"authors": ["Brian Melley"], "date_download": "2020-05-04 20:22:13", "date_modify": "2020-05-04 20:22:13", "date_publish": "2020-04-20 19:38:25", "description": "LOS ANGELES (AP) — Family members of four passengers killed in a helicopter crash with Kobe Bryant and his daughter have joined the NBA star's widow in filing wrongful death lawsuits against the...", "filename": "_a7202e53a55be729ad59f1be36d0a7b8_1588623733.html", "image_url": "https://storage.googleapis.com/afs-prod/media/65a63d8acc634a94a5fa722e1b33c658/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a7202e53a55be729ad59f1be36d0a7b8_1588623733.html", "title": "Families sue helicopter company in deadly Kobe Bryant crash", "title_page": "Families sue helicopter company in deadly Kobe Bryant crash ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Feb. 10, 2020 file photo, flowers and photos honor members of the Altobelli family outside Angel Stadium in Anaheim, Calif. Coach John Altobelli, 56, far right, his wife, Keri, 43, second from left, and his daughter Alyssa, 13, left, died in a helicopter crash on Jan. 26 in Calabasas. Family members of four of the people killed in a helicopter crash with Bryant and his daughter are suing the companies that owned and operated the aircraft. The wrongful death lawsuits were filed electronically Sunday, April 19, 2020 in Los Angeles Superior Court on behalf of three members of one family and a woman who helped coach Bryant's daughter in basketball. One suit was filed by two children of Orange Coast College baseball coach John Altobelli,his wife and daughter, who played basketball with Gianna. Another suit was filed by the husband and three children of Christina Mauser, who helped Bryant coach the girls' basketball team. (AP Photo/Damian Dovarganes, File)\nFILE - In this Feb. 10, 2020 file photo, flowers and photos honor members of the Altobelli family outside Angel Stadium in Anaheim, Calif. Coach John Altobelli, 56, far right, his wife, Keri, 43, second from left, and his daughter Alyssa, 13, left, died in a helicopter crash on Jan. 26 in Calabasas. Family members of four of the people killed in a helicopter crash with Bryant and his daughter are suing the companies that owned and operated the aircraft. The wrongful death lawsuits were filed electronically Sunday, April 19, 2020 in Los Angeles Superior Court on behalf of three members of one family and a woman who helped coach Bryant's daughter in basketball. One suit was filed by two children of Orange Coast College baseball coach John Altobelli,his wife and daughter, who played basketball with Gianna. Another suit was filed by the husband and three children of Christina Mauser, who helped Bryant coach the girls' basketball team. (AP Photo/Damian Dovarganes, File)\nLOS ANGELES (AP) — Family members of four passengers killed in a helicopter crash with Kobe Bryant and his daughter have joined the NBA star’s widow in filing wrongful death lawsuits against the companies that owned and operated the aircraft.\nThe suits on behalf of three members of one family, and a woman who helped coach Bryant’s 13-year-old daughter in basketball, were filed electronically Sunday in Los Angeles Superior Court.\nThe pair of lawsuits comes about two months after Bryant’s widow, Vanessa, the mother of Gianna, also sued Island Express Helicopters Inc., which operated the Sikorsky, and its owner, Island Express Holding Corp.\nA person who answered the phone at Island Express Helicopters declined to comment and an email from The Associated Press requesting comment was not immediately returned.\nUnlike Vanessa Bryant’s lengthy lawsuit, the new identical 7-page cases do not name the dead pilot, Ara Zobayan, or his representative, as a defendant. All the suits allege that the two companies were careless and negligent.\nOne suit was filed by two surviving children of Orange Coast College baseball coach John Altobelli and his wife Keri. Their daughter Alyssa played basketball with Gianna. Another suit was filed by the husband and three children of Christina Mauser, who helped Bryant coach the girls’ basketball team\nThe group was heading to a basketball tournament Jan. 26 when the chopper crashed in thick fog northwest of Los Angeles.\nAn initial National Transportation Safety Board report said there were no signs of engine failure from the wreckage recovered. Zobayan had nearly navigated the helicopter out of blinding clouds when the aircraft suddenly turned and plunged into the mountainside.\nVanessa Bryant, who filed the suit the same day as her husband’s large public memorial service in February, alleged that Zobayan was careless and negligent to fly in the fog and should have aborted the flight.\nAlso killed in the crash were Sarah Chester and her daughter Payton, who was another of Gianna’s teammates.", "url": "https://apnews.com/a7202e53a55be729ad59f1be36d0a7b8"}