{"authors": [], "date_download": "2020-05-04 20:20:58", "date_modify": "2020-05-04 20:20:58", "date_publish": "2020-04-07 13:52:42", "description": "WATERLOO, Iowa (AP) — A judge has upheld the city of Waterloo’s new law that bans many businesses from asking about applicants’ criminal records in the early stages of the hiring process....", "filename": "_1918fa17027a0581fa11872d800bd34c_1588623658.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1918fa17027a0581fa11872d800bd34c_1588623658.html", "title": "Judge: Waterloo law limiting criminal record inquiries OK", "title_page": "Judge: Waterloo law limiting criminal record inquiries OK", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WATERLOO, Iowa (AP) — A judge has upheld the city of Waterloo’s new law that bans many businesses from asking about applicants’ criminal records in the early stages of the hiring process.\nBlack Hawk County District Judge John Bauercamper sided with the city in a lawsuit brought by a business group that had challenged the so-call “ban-the-box” measure adopted last fall, The Courier reported .\nIn its lawsuit, the Iowa Association of Business and Industry said the new measure violates a state law that prevents cities from adopting rules that exceed or conflict with federal or state law. But Bauercamper rejected that challenge in his ruling Saturday, saying the city properly adopted the ordinance under its “home rule” authority under the Iowa Constitution.\nThe measure is intended to ensure people with criminal convictions get a fair chance of getting jobs by encouraging employers not to discard applications only because potential workers check a box stating they have been convicted of a crime. The measure doesn’t let employers ask about an applicant’s criminal history until after making a conditional job offer.\nThe measure, which applies to business with at least 15 employees and the city government, doesn’t become effective until July 1.", "url": "https://apnews.com/1918fa17027a0581fa11872d800bd34c"}