{"authors": [], "date_download": "2020-05-04 20:28:43", "date_modify": "2020-05-04 20:28:43", "date_publish": "2020-04-04 00:20:28", "description": "BEND, Ore. (AP) — A man is suing the organizers of a 2018 Bend horse show for serious injuries he says he suffered when high winds lifted the portable stall he and his horse were inside and threw...", "filename": "_ac7aada6f09c7172f8d8f01b60aafbca_1588624123.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ac7aada6f09c7172f8d8f01b60aafbca_1588624123.html", "title": "Lawsuit: Man in portable horse stall injured in high winds", "title_page": "Lawsuit: Man in portable horse stall injured in high winds", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BEND, Ore. (AP) — A man is suing the organizers of a 2018 Bend horse show for serious injuries he says he suffered when high winds lifted the portable stall he and his horse were inside and threw them 40 feet.\nJeffrey Ruthhardt filed a $800,000 premises liability claim this week against Allied Show Services and the High Desert Hunter Jumper Association in Deschutes County Circuit Court, The Bulletin reported .\nAccording to the lawsuit, Allied Show Services was responsible for installing the portable horse stalls at the Horse Butte Equestrian Center for the association’s first show of the 2018 season.\nThe overall “tent-like: metal structure contained stalls for 20 horses, the lawsuit states.\nRuthardt attended the show with his daughter, who was a participant.\nRuthardt was leading his daughter’s horse, Indigo, to their stall when a gust of wind tore it from the ground. Ruthardt, Indigo, and all 20 stalls flew through the air and over a fence before crashing down, the lawsuit says.\nRuthardt suffered rib and spine fractures, a broken leg and a concussion that aggravated a previous traumatic brain injury, the lawsuit states.\nIndigo survived the flight but hasn’t jumped since, Spencer said. “He still gets spooked in confined spaces.”\nEfforts by the newspaper to reach the High Desert Hunter Jumper Association and the Horse Butte Equestrian Center were unsuccessful.", "url": "https://apnews.com/ac7aada6f09c7172f8d8f01b60aafbca"}