{"authors": ["Barry Wilner"], "date_download": "2020-05-04 20:22:12", "date_modify": "2020-05-04 20:22:12", "date_publish": "2020-04-20 17:52:04", "description": "Talk about virtual drafts, what is a mock draft, really? Make believe. The upcoming NFL remote draft beginning Thursday night has a touch of irony to it. The producers of said mock drafts...", "filename": "_c2d70e04476e9c71ab43ecf99a9f3646_1588623732.html", "image_url": "https://storage.googleapis.com/afs-prod/media/be274aa8cd574007ba7308b8a42cc2f4/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c2d70e04476e9c71ab43ecf99a9f3646_1588623732.html", "title": "Look for 3 QBs in first 5 picks of NFL draft", "title_page": "Look for 3 QBs in first 5 picks of NFL draft", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Look for 3 QBs in first 5 picks of NFL draft\nFILE - In this Nov. 30, 2019, file photo, LSU quarterback Joe Burrow (9) scrambles during the first half of an NCAA college football game against Texas A&M in Baton Rouge, La. Burrow is a posible first round pick in the NFL Draft Thursday night, April 23, 2020. (AP Photo/Gerald Herbert, File)\nFILE - In this Nov. 30, 2019, file photo, LSU quarterback Joe Burrow (9) scrambles during the first half of an NCAA college football game against Texas A&M in Baton Rouge, La. Burrow is a posible first round pick in the NFL Draft Thursday night, April 23, 2020. (AP Photo/Gerald Herbert, File)\nTalk about virtual drafts, what is a mock draft, really? Make believe.\nThe upcoming NFL remote draft beginning Thursday night has a touch of irony to it. The producers of said mock drafts rarely are even remotely accurate.\nThat said, here’s one view of what might happen in the opening round. This mock draft does not include trades, of which there could be several. Sticking with the existing grid, the Colts, Steelers, Bears, Rams, Bills and Texans don’t have a selection.\n1. Cincinnati\nBengals can’t possibly bungle this pick, right? Last time they took franchise quarterback with top overall selection, in 2003, it worked out pretty well with Carson Palmer.\nJOE BURROW, QB, LSU\n2. Washington\nBest player in this draft is Chase Young. Redskins will get lots of offers, especially from teams seeking QB. If they aren’t tempted enough, they go with chalk ...\nCHASE YOUNG, EDGE/LB, OHIO STATE\n3. Detroit\nLions will get even more pressure to deal this spot with two highly regarded quarterbacks available. Guess what: Matthew Stafford comes off major injury, has gotten beaten down through years, and has difficult family issues. So whether they trade it or keep it ...\nTUA TAGOVAILOA, QB, ALABAMA\n4. New York Giants\nSo many needs, but hard to see Giants ignoring stud linebacker with winning credentials to build defense around.\nISAIAH SIMMONS, LB, CLEMSON\n5. Miam i\nDolphins supposedly were tanking for Tua last year, yet won enough games to fall to fifth in the order. That doesn’t mean they will ignore a passer here.\nJUSTIN HERBERT, QB, OREGON\n6. Los Angeles Chargers\nHaving missed out on top three QBs, Chargers are dumbfounded. They will attempt to trade down for more picks and still get a passer later on. If not, how about the best defensive back in this draft, even though it’s not major need?\nJEFF OKUDAH, CB, OHIO STATE\n7. Carolina\nNew coach Matt Rhule has retooled offense in free agency, now dedicates first of many choices to defense.\nDERRICK BROWN, DL, AUBURN\n8. Arizona\nJust like Panthers, Cardinals must dive deep into defensive picks, but not here. They address major hole on offensive line with ...\nJEDRICK WILLS, OT, ALABAMA\n9. Jacksonville\nFirst of two opening-round picks for rebuilding Jags, who can get desired offensive tackle later on and address D here.\nJAVON KINLAW, DL, SOUTH CAROLINA\n10. Cleveland\nBrowns would love to get left tackle here. They haven’t been secure there since Joe Thomas, the best player at the position of last decade, hung it up.\nThe NFL Draft kicks off Thursday night. Pro Football Writer @wilner88 gives his take on what might happen in the first round.\nRead for more >> https://t.co/jSKzaaAiEH pic.twitter.com/DysIY2NrVb — AP NFL (@AP_NFL) April 20, 2020\nMEKHI BECTON, OT, LOUISVILLE\n11. New York Jets\nGM Joe Douglas has vowed to get protector and playmaker for QB Sam Darnold. Best wideout in this deep draft at that position is available, and coach Adam Gase is drooling. But the quality of blockers in second next round is too much lower to pass on ...\nTRISTAN WIRFS, OT, IOWA\n12. Las Vegas\nRaiders also will select at No. 19. Packaging their two picks to move up is not out of question, but going here will net them ...\nJERRY JEUDY, WR, ALABAMA\n13. San Francisco (from Indianapolis)\nHow nice. Go to Super Bowl, then make deal for this spot to go with later pick. Niners want dynamic target for Jimmy Garoppolo to go with last year’s breakthrough rookie, Deebo Samuel.\nHENRY RUGGS III, WR, ALABAMA\n14. Tampa Bay\nThat soon-to-be 43-year-old quarterback who came in from up north will appreciate this left tackle as bodyguard.\nANDREW THOMAS, OT, GEORGIA\n15 . Denver\nBroncos had productive second half of 2019, believe they can push toward top of AFC West dominated by Chiefs. Dynamic playmaker helps.\nCEEDEE LAMB, WR, OKLAHOMA\n16. Atlanta\nPass rush has disappeared, as has most of Atlanta’s defense. Dan Quinn’s job depends on quick turnaround by that unit.\nK’LAVON CHAISSON, EDGE, LSU\n17. Dallas\nCowboys also are in market for someone to get to opposing QBs, and also could use boost in secondary. Regardless, they go defense here.\nC.J. HENDERSON, CB, FLORIDA\n18. Miami (from Pittsburgh )\nDolphins got their passer, and with their second of trio of first-rounders, they can’t pass on protection for Herbert — from one of his college opponents no less.\nAUSTIN JACKSON, OT, SOUTHERN CALIFORNIA\n19. Las Vegas (from Chicago)\nHaving grabbed outside threat at receiver, it’s time for Mike Mayock and Jon Gruden to fill hole at linebacker. Some might see this as reach. We don’t.\nPATRICK QUEEN, LB, LSU\n20. Jacksonville (from Los Angeles Rams)\nTime for that offensive tackle mentioned above for Jags.\nJOSH JONES, OT, HOUSTON\n21. Philadelphia\nEagles showed tons of gumption winning NFC East with battered roster. They’ve made plenty of offseason changes, and find need for fast guys: cornerbacks and wideouts. Go with D-back here.\nA.J. TERRELL, CB, CLEMSON\n22. Minnesota (from Buffalo)\nPick acquired for WR Stefon Diggs, which could wind up in replacement for Diggs.\nJUSTIN JEFFERSON, WR, LSU\n23. New England\nGrab QB of future here with Tom Brady off to Tampa? Patriots coach believes he could win with Ryan Leaf.\nKENNETH MURRAY, LB, OKLAHOMA\n24. New Orleans\nFew teams have as talented a roster as Saints. So they can look ahead at their most important offensive position.\nJORDAN LOVE, QB, UTAH STATE\n25 . Minnesota\nWith Diggs replaced, time to address secondary. Another Crimson Tide standout in this spot — and Diggs’ younger brother to boot.\nTREVON DIGGS, CB, ALABAMA\n26. Miami (from Houston )\nDolphins’ third selection following QB Herbert and tackle Jackson. Time to grab defensive help.\nYETUR GROSS-MATOS, EDGE, PENN STATE\n27. Seattle\nLast decade’s best coach-GM combo was Pete Carroll and John Schneider. Their first pick of this decade is ...\nTEE HIGGINS, WR, CLEMSON\n28. Baltimore\nNFL’s top team in regular season has few weaknesses. One worth looking at is linebacker, where there’s no Ray Lewis or Terrell Suggs on board.\nZACK BAUN, LB, WISCONSIN\n29 . Tennessee\nAfter falling one win short of AFC title, Mike Vrabel bolsters defense. That could be on Titans line now without Jurrell Casey, or secondary missing Logan Ryan.\nKRISTIAN FULTON, CB, LSU\n30. Green Bay\nReal nice value pick here for Packers’ defense.\nA.J. EPENESA, EDGE, IOWA\n31. San Francisco\nAnother chance to enhance strong roster. With Ruggs in hand, future replacement for standout LT Joe Staley might make sense but also is reach. Instead ...\nROSS BLACKLOCK, DT, TCU\n32. Kansas City\nSuper Bowl champs, after 50-year drought, know they need help in backfield behind Patrick Mahomes.\nD’ANDRE SWIFT, RB, GEORGIA\n___\nAP Sports Writer Jay Cohen contributed.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/c2d70e04476e9c71ab43ecf99a9f3646"}