{"authors": [], "date_download": "2020-05-04 20:09:08", "date_modify": "2020-05-04 20:09:08", "date_publish": "2020-04-09 20:01:01", "description": "WEST LINN, Ore. (AP) — The West Linn Police Chief was placed on administrative leave Wednesday after the City Council voted to hire an outside firm to investigate how the city handled a Portland...", "filename": "_b252282f231744321e20c2ed02f6b9b7_1588622948.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b252282f231744321e20c2ed02f6b9b7_1588622948.html", "title": "West Linn police chief on leave pending investigation", "title_page": "West Linn police chief on leave pending investigation ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WEST LINN, Ore. (AP) — The West Linn Police Chief was placed on administrative leave Wednesday after the City Council voted to hire an outside firm to investigate how the city handled a Portland resident’s wrongful arrest and discrimination allegations against the police.\nTerry Kruger became entangled in the scandal soon after The Oregonian/OregonLive revealed in February that the city had paid $600,000 to Michael Fesser to settle his lawsuit.\nWest Linn police arrested Fesser in February 2017 at the behest of the city’s then-Chief Terry Timeus. Timeus ordered the theft investigation as a favor to fishing buddy, Eric Benson, who was Fesser’s boss at A&B Towing and targeted Fesser because he had complained about racist comments and harassment at work.\nDocuments obtained from a public records request showed Kruger also had a personal relationship with Benson, The Oregonian/OregonLive reported .\nTranscripts released last week of West Linn City Council executive sessions also revealed that Kruger had vigorously defended his department’s arrest of Fesser.\nInterim City Manager John Williams said Kruger would remain on paid administrative leave during the course of the investigation “in order to further ensure a complete, fair and impartial investigation.″\nKruger did not return a message seeking comment.\nFesser’s case already has prompted at least four federal, state and local criminal and civil rights investigations into the actions of the West Linn officers involved.", "url": "https://apnews.com/b252282f231744321e20c2ed02f6b9b7"}