{"authors": ["David Williams", "Chloe Melas"], "date_download": "2020-05-04 16:02:57", "date_modify": "2020-05-04 16:02:57", "date_publish": "2020-03-31 13:36:55", "description": "A Florida sheriff is using the hype surrounding the wildly popular Netflix series \"Tiger King: Murder, Mayhem and Madness\" to seek new leads in the case of Jack Donald \"Don\" Lewis, who's been missing since 1997.", "filename": "2020_03_31_entertainment_tiger-king-cold-case-sheriff-trnd_index_1588608177.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331101418-02-jack-donald-don-lewis-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_entertainment_tiger-king-cold-case-sheriff-trnd_index_1588608177.html", "title": "Florida sheriff getting 6 tips a day in 1997 'Tiger King' disappearance", "title_page": "'Tiger King' cold case: Florida sheriff getting 6 tips a day in Don Lewis disapperance - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A Florida sheriff is using the hype surrounding the wildly popular Netflix series \"Tiger King: Murder, Mayhem and Madness\" to seek new leads in the case of Jack Donald \"Don\" Lewis, who's been missing since 1997.\nLewis was married to Big Cat Rescue owner Carole Baskin , the intended target of the murder-for-hire plot at the center of the docuseries.\nHillsborough County Sheriff Chad Chronister told CNN that the show has generated a lot of new interest in the case. His office is receiving about six tips a day, he said.\n\"We are already receiving new tips and we hope to close this cold case soon with the help of the public,\" Chronister told CNN. \"Since the documentary came out we've been receiving about six tips a day related to this case. We are looking into each one thoroughly.\"\nIn a video news conference on Tuesday, Chronister told reporters that he has assigned a detective supervisor to chase down any new leads generated from the show.\nRead More", "url": "https://www.cnn.com/2020/03/31/entertainment/tiger-king-cold-case-sheriff-trnd/index.html"}