{"authors": [], "date_download": "2020-05-04 20:11:18", "date_modify": "2020-05-04 20:11:18", "date_publish": "2020-04-16 14:26:09", "description": "PORTAGE, Wis. (AP) — Sheriff's officials say two prisoners have escaped from the state maximum-security prison in Portage. Residents in the area received automated phone calls about the...", "filename": "_8bb32b8982cd48c703fc38b618b3f9a3_1588623078.html", "image_url": "https://storage.googleapis.com/afs-prod/media/420dfb90ea75417bb283348f1f3d72f8/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8bb32b8982cd48c703fc38b618b3f9a3_1588623078.html", "title": "2 escape from Columbia prison in Portage", "title_page": "2 escape from Columbia prison in Portage", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In these two undated photos provided by the Columbia County (Wisc.) Sheriff's Office are Thomas Deering, left, and James Newman, who escaped from a maximum security prison in Portage, Wis., Thursday, April 16, 2020. (Columbia County Sheriff's Office via AP)\nIn these two undated photos provided by the Columbia County (Wisc.) Sheriff's Office are Thomas Deering, left, and James Newman, who escaped from a maximum security prison in Portage, Wis., Thursday, April 16, 2020. (Columbia County Sheriff's Office via AP)\nPORTAGE, Wis. (AP) — Sheriff’s officials say two prisoners have escaped from the state maximum-security prison in Portage.\nResidents in the area received automated phone calls about the prison escape about 6 a.m. Thursday and were urged to lock their doors.\nColumbia County Sheriff Roger Brandner said numerous law enforcement officers are looking for 37-year-old James Newman and 46-year-old Thomas Deering.\nAuthorities say the pair escaped by climbing over two of the security fences. The escapees then went to a hotel and were taken by a cab to Poynette. Investigators say the two already had left the Portage area before authorities were notified of their escape.\nThe Department of Corrections is working with local law enforcement officials who are taking the lead in the investigation, DOC spokesman Ray Woodruff said.\nAccording to online records, Deering was convicted of numerous charges in Milwaukee County including kidnapping, sexual assault and burglary. He was also convicted of battery by a prisoner in 2015 and an escape charge in 2002.\nNewman has convictions for kidnapping, escape, theft and discharging a firearm.", "url": "https://apnews.com/8bb32b8982cd48c703fc38b618b3f9a3"}