{"authors": [], "date_download": "2020-05-04 16:23:50", "date_modify": "2020-05-04 16:23:50", "date_publish": "2020-01-28 17:54:33", "description": "For those looking to quickly boost their balance of airline miles, right now United Airlines has a limited-time credit card offer worth considering.", "filename": "2020_01_28_cnn-underscored_united-credit-card-bonus_index_1588609430.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200127180932-underscored-united-airlines-plane-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_01_28_cnn-underscored_united-credit-card-bonus_index_1588609430.html", "title": "United credit card offers 60,000 bonus miles", "title_page": "United credit card offers 60,000 bonus miles - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through The Points Guy affiliate network if you apply and are approved for a card, but our reporting is always independent and objective.\nWhile travel isn't a priority for most people right now, eventually airlines will be flying again, and we'll likely see some great offers to get travelers back onto planes. When that happens, it'll be helpful to have a stash of frequent flyer miles, and for those looking to quickly boost their balances, United Airlines currently has a limited-time credit card offer worth considering.\nRight now, the personal United Explorer Card is offering a 60,000-mile sign-up bonus when you spend $3,000 in the first three months after you open the account. There's no annual fee on this card for the first year, then a $95 annual fee starting the second year you have it.\nThe United Explorer Card earns United MileagePlus miles, which are easily redeemed on United as well as for flights on the airline's 20+ Star Alliance partners. While United now uses a dynamic pricing structure instead of a fixed award chart to price award tickets, the airline's website is adept at finding partner airline inventory, which makes it easy to see route options, find seats and confirm your next award trip.\nUnited credit card: A solid welcome offer and flight perks\nThis limited-time 60,000-mile sign-up offer on the personal United Explorer Card is nothing to sneeze at. With domestic United award tickets starting as low as 5,000 miles one-way, those bonus points could cover 12 tickets at the lowest rate, meaning you could take your whole family on a sorely-needed beach vacation once the current crisis has passed.\nIf you're dreaming about how much you'll need a vacation in a few months, United miles could be useful to have in your pocket.\nYou'll earn 2 miles for every dollar you spend on United with the United Explorer Card, as well as at restaurants and on hotel stays booked directly with the hotel. Those earning rates aren't best-in-class, as the Chase Sapphire Preferred Card earns 2 points per dollar on dining and all travel — not just United flights — and you can transfer Chase points to United miles at a 1-to-1 ratio.\nRelated: Get the classic Chase Sapphire Preferred travel credit card with a 60,000-point bonus.\nHowever, with the United Explorer Card, you'll also get a free checked bag for you and one for a companion on the same reservation, a pair of one-time United Club lounge passes each year (which would cost you $59 each otherwise), 25% back on United inflight purchases, and priority boarding on United-operated flights.\nThose hoping to sign up for Global Entry or TSA PreCheck will also appreciate the up to $100 fee reimbursement on the United Explorer card — enough to fully cover the cost of applying. The card also has no foreign transaction fees, so it's safe to use overseas once international travel resumes.\nAlso, right now you can earn 500 Premier Qualifying Points (PQPs) for every $12,000 spent on the card, up to a maximum of 1,000 PQPs per calendar year, which can be applied up to United Platinum elite status. Plus, United has announced that this limit will be doubled for card holders starting May 1 through the rest of 2020, so you'll be able to bank as many as 2,000 PQPs in 2020 if you time it right.\nRemember, CNN Underscored recommends that you only make purchases you would make otherwise with cash, checks or a debit card. Don't find yourself in debt paying credit card interest.\nYou should always be mindful of applying for too many credit cards in rapid succession, and consider the rules banks employ for people who quickly pick up a lot of cards. For instance, Chase — the bank that issues United credit cards — won't approve any new credit cards for people who have already gotten five or more credit cards across all banks in the previous 24 months. This is colloquially known as Chase's 5/24 rule.\nThis United credit card offer is for a limited time\nYou might consider taking advantage of this United credit card offer with an eye toward the future.\nGetting an airline credit card right now is definitely an investment in the future, since you likely won't be able to use most of its benefits at the moment. But it could make sense to pick up this card to earn the sign-up bonus, especially since you can use the miles down the road not just for United flights, but for flights on any of United's airline partners as well.\nWe've seen bonus offers this high before on this card, so this might not be the last time you'll ever be able to get this bonus. But the current sign-up offer will only be around for a limited time, so if you want to lock down 60,000 bonus miles on the United Explorer Card, don't wait too long to act.\nLearn more about the United Explorer Card.\nCheck out CNN Underscored's guide to the best credit cards for United flyers in 2020.\nEditorial Disclaimer: Opinions expressed here are the author's alone, not those of any bank, credit card issuer, airlines or hotel chain, and have not been reviewed, approved or otherwise endorsed by any of these entities.\nNote: While the offers mentioned above are accurate at the time of publication, they're subject to change at any time and may have changed, or may no longer be available.", "url": "https://www.cnn.com/2020/01/28/cnn-underscored/united-credit-card-bonus/index.html"}