{"authors": [], "date_download": "2020-05-04 16:57:42", "date_modify": "2020-05-04 16:57:42", "date_publish": "2020-04-09 14:56:36", "description": "Making your home smarter just got more affordable. Right now, you can save even more on the already discounted Google Home Smart Speaker and third generation Google Nest Learning Thermostat with codes CNNGHOME and CNNEST, respectively.", "filename": "2020_04_09_cnn-underscored__56b92780e59c374a26305c567b9a5985_index_1588611462.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409104958-google-devices-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_cnn-underscored__56b92780e59c374a26305c567b9a5985_index_1588611462.html", "title": "Google smart home sale: Save on a Google Home speaker and Google Nest thermostat", "title_page": "Google smart home sale: Save on a Google Home speaker and Google Nest thermostat - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Making your home smarter just got more affordable. Right now, you can save even more on the already discounted Google Home Smart Speaker and third generation Google Nest Learning Thermostat with codes CNNGHOME and CNNEST, respectively.\nGoogle Home Smart Speaker ($64.99 with code CNNGHOME, originally $129.99; dailysteals.com)\nGoogle Home Smart Speaker\n3rd Gen Google Nest Learning Thermostat ($199.99 with code CNNEST, originally $209.99; dailysteals.com)\n3rd Gen Google Nest Learning Thermostat\nSo how do these items make your home smarter? Well for starters, you'll have access to the Google Assistant thanks to the Google Home Smart Speaker. With this versatile assistant, you can set alarms, search the web, play music and much more using only your voice. Just be sure to start your request with the phrase, \"Hey Google.\" Once it's plugged in, setup is easy. The Google Home can also act as a command center for other smart appliances. This includes the Google Nest Learning Thermostat.\nThis thermostat applies a new meaning to the word \"smart.\" As you use this device, it will catch on to what temperatures you prefer and when. Once it's learned this, it will create a schedule based on your preferences. It will also automatically adjust the temperature after you leave the house. These and other behaviors are geared toward saving energy — and money. And if you pair it with a Google Home speaker, all you have to do is ask your Google Assistant to change the temperature.\nSo make your home smarter while these deals are still live. For more great deals, check out CNN Coupons.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/09/cnn-underscored/google-smart-home-sale-smart-speaker-nest-daily-steals/index.html"}