{"authors": ["Leah Asmelash"], "date_download": "2020-05-04 15:57:36", "date_modify": "2020-05-04 15:57:36", "date_publish": "2020-04-07 19:24:41", "description": "Earl G. Graves, Sr., founder of Black Enterprise -- the media company focused on black entrepreneurship and black businesses -- died Monday at the age of 85.", "filename": "2020_04_07_us_earl-graves-black-enterprise-death-trnd_index_1588607856.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407143310-earl-g-graves-sr-1983-file-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_us_earl-graves-black-enterprise-death-trnd_index_1588607856.html", "title": "Earl G. Graves Sr., founder of Black Enterprise, dies", "title_page": "Earl G. Graves Sr., founder of Black Enterprise, dies - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Earl G. Graves, Sr., founder of Black Enterprise -- the media company focused on black entrepreneurship and black businesses -- died Monday at the age of 85.\nGraves \"passed away quietly after a long battle with Alzheimer's,\" his son and current Black Enterprise CEO Earl \"Butch\" Graves Jr. wrote on Twitter\n\"I loved and admired this giant of a man, and am blessed to be his namesake,\" he said in the tweet. \"LOVE YOU DAD!\"\nAt 9:22pm this evening, April 6, my Father and Hero Earl Graves Sr., the Founder of @blackenterprise , passed away quietly after a long battle with Alzheimer's. I loved and admired this giant of a man, and am blessed to be his namesake. LOVE YOU DAD! pic.twitter.com/UoerizfX8a\n\"We will evermore celebrate his life and legacy, in this, our 50th Anniversary Year, and beyond,\" the publication wrote in a tweet\nGraves Jr. did not immediately respond to CNN's request for comment.\nGraves first launched Black Enterprise in 1970, in an effort to cover black businesses and also provide business strategies to the magazine's readership.\n\"My goal was to show them how to thrive professionally, economically and as proactive, empowered citizens,\" Graves wrote in his 1997 book \"How to Succeed in Business Without Being White.\"\nHis efforts paid off -- as of 2019, the magazine reaches four million readers, according to the publication\nGraves went on to create Earl G. Graves, Ltd., the parent company of Earl G. Graves Publishing Company, which produces Black Enterprise magazine. His son, Graves Jr., became the CEO of the company in 2006, though Graves Sr. remained a chairman, according to Black Enterprise\nIn addition to his work in media, Graves also served as the CEO of Pepsi Cola between 1990 and 1998.", "url": "https://www.cnn.com/2020/04/07/us/earl-graves-black-enterprise-death-trnd/index.html"}