{"authors": [], "date_download": "2020-05-04 20:17:37", "date_modify": "2020-05-04 20:17:37", "date_publish": "2020-04-04 02:19:12", "description": "SEATTLE (AP) — Washington’s Supreme Court has denied Seattle’s bid to reinstate an income tax on wealthy households. In a majority decision, the Supreme Court on Thursday declined to review...", "filename": "_e2ad74a5f966c66945a7b55c0332e936_1588623457.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e2ad74a5f966c66945a7b55c0332e936_1588623457.html", "title": "Court denies Seattle’s bid for wealthy household income tax", "title_page": "Court denies Seattle’s bid for wealthy household income tax", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SEATTLE (AP) — Washington’s Supreme Court has denied Seattle’s bid to reinstate an income tax on wealthy households.\nIn a majority decision, the Supreme Court on Thursday declined to review the city’s request to overturn rulings against the tax by a King County Superior Court judge and the state Court of Appeals, The Seattle Times reported .\nWithout issuing an opinion, Supreme Court dismissed Seattle’s petition for review and a petition written by the Economic Opportunity Institute, a Seattle-based progressive think tank.\nA Supreme Court spokeswoman declined to report the tally and how each justice voted.\nThe ruling means Washington and its cities will remain barred from enacting graduated income taxes, with different rates based on wealth. But some advocates may still see a way to move forward, because the Supreme Court let stand a decision by the Court of Appeals last year to void a state law that banned taxes on net income.\n“Seattle has the authority to adopt an income tax, and I believe we can craft a proposal that can help make our tax system less regressive,” Mayor Jenny Durkan said in a statement Friday.\n“We are once again confronted with the reality that in times of crisis, those same residents that earn or have the least are the first to feel economic stings of job loss and instability,” Durkan added. “As we emerge from this emergency all of us need to rebuild a city that is more just and equitable.”\nWashington is one of the few states without an income tax, and its system has been labeled by tax reformers as the most regressive, meaning poor residents pay a much higher percentage of their earnings than do rich residents.", "url": "https://apnews.com/e2ad74a5f966c66945a7b55c0332e936"}