{"authors": ["Amir Vera"], "date_download": "2020-05-04 16:21:07", "date_modify": "2020-05-04 16:21:07", "date_publish": "2020-03-31 02:39:11", "description": "Michelle Bennett lost her 75-year-old mother, Carolann Christine Gann, last week to coronavirus.", "filename": "2020_03_30_us_washington-nurse-coronavirus-facetime_index_1588609267.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330154139-brooke-baldwin-split-hospital-mother-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_30_us_washington-nurse-coronavirus-facetime_index_1588609267.html", "title": "A woman got to say goodbye to her mother over FaceTime before she died thanks to a nurse at this Washington hospital", "title_page": "A woman got to say goodbye to her mother over FaceTime before she died thanks to a nurse at this Washington hospital  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Michelle Bennett didn't think she'd be able to say goodbye to her mother before she died.\nCarolann Christine Gann\n\"Not being able to be there and hold my mom's hand, rub her head, tell her the things I wanted to say her. It was such a helpless feeling, I can just remember the days leading up feeling so frustrated and helpless and not being able to talk to her because she was not conscious during that time,\" Bennett told CNN Monday.\nBut a nurse at Swedish Issaquah hospital in Washington took it upon herself to make sure Bennett got to say her goodbyes. Bennett told CNN the nurse called her from her personal cell phone and said her mother's breathing was changing and she probably wouldn't live much longer.\n\"I'm going to put the phone up to her face so you can tell her you love her and say your goodbyes,\" Bennett says the nurse told her. \"She will not be alone, we will stay with her till the end.\"\nRead More", "url": "https://www.cnn.com/2020/03/30/us/washington-nurse-coronavirus-facetime/index.html"}