{"authors": ["Lauren Fox", "Phil Mattingly"], "date_download": "2020-05-04 16:22:42", "date_modify": "2020-05-04 16:22:42", "date_publish": "2020-04-06 14:19:35", "description": "The success of the multi-trillion-dollar life raft that was floated into the cascading waves of business closures, job losses and the virtual shutdown of the US economy will likely be determined this week.", "filename": "2020_04_06_politics_state-o_56199af36f4f18dcc1c7003e2c6035cd_index_1588609362.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200303105041-steve-mnuchin-0212-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_state-o_56199af36f4f18dcc1c7003e2c6035cd_index_1588609362.html", "title": "Critical week ahead to fix initial roadblocks to coronavirus relief package", "title_page": "Critical week ahead to fix initial roadblocks to coronavirus relief package - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The success of the multi-trillion-dollar life raft that was floated into the cascading waves of business closures, job losses and the virtual shutdown of the US economy will likely be determined this week.\nThe first direct payments are scheduled to be deposited in the accounts of individuals and families who qualify.\nA small business lending program, the centerpiece of the $2 trillion economic rescue package, is expected to be fully up and running after a rocky, and at times anemic, first few days in place.\nThe terms for bailouts of the airline industry, and lending facilities for large distressed companies, are also likely to be finalized.\nAs one Senate staffer who helped draft the law that put these programs into place said Sunday: \"This is the week we figure out if it's enough -- or if it works at all.\"\nBottom line\nThis was never going to be quick or easy -- even those touting the success of the efforts up to this point acknowledge that reality. The scope and scale, combined with the urgent need and mass volume, left agencies and their partners overwhelmed. As one career official in the Treasury Department told CNN: \"The federal government wasn't built for this. But we don't have any other option than to make this work.\"\nThe SBA's Paycheck Protection Program\nDays after the launch of the Small Business Administration's rollout of the Paycheck Protection Program, there are still delays in the system lenders use to upload loan application information and the money is still largely not going out to the businesses that need it yet.\nOne industry source close to the process told CNN Sunday night that the numbers that SBA and Treasury were touting all day Friday about the amount of money that SBA had given out were \"incredibly misleading because those dealt with applications coming in and those approved,\" not the amount of money that had actually gone out.\nThe problems\nThe vast majority of banks were still waiting to get final guidance from SBA and Treasury on how to close loans and distribute them. Lenders are also still waiting on guidance on what they need to do to verify information small business owners submit as part of their applications. One of the biggest issues small business owners encountered Friday was that many banks delayed accepting PPP applications because the rules were still so unclear as to what the lenders' responsibilities were when it came to \"know your customer\" and other standards.\nAt least one regional SBA office sent an email to lenders in their area warning them not to close on the loans until they received final guidance.\nThe email addressed to \"SBA lending partners\" and obtained by CNN acknowledged frustrations with the E-tran system (used to upload application information) and delays in getting answers directly from SBA on how the program was working. For one, lenders using the E-tran system were finding over the weekend that the system kicked lenders out when they entered information that wasn't accepted in another loan program, but was consistent with the new rules governing PPP.\nIn the email from one regional SBA office, they acknowledged the system was \"not at all consistent nor compliant with the PPP.\" The email also instructed lenders not to \"close any loans using the current version of the loan authorization.\"\nTranslation: Don't actually cut the checks yet.\nHere's your anecdote\nFrom an industry source who heard from one of the big four banks on E-Tran:\n\"1 PPP loan took 72 minutes, 13 crashes, finally went through on 14th try. We had 3 different people do it, all 3 have been in SBA lending for 20+ years each.\"\nSome perspective\nSen. Marco Rubio, a Florida Republican and chairman of the Small Business Committee, was a lead writer and negotiator of the program and has stayed in close touch with all parties as it has rolled out. He's been blunt about the problems that occurred over the weekend but also clear that he believes they are all fixable.\nAs he stated on Twitter Sunday: \"Confusion being addressed & online lenders starting soon. This is a new program launched with just 7 days, it must/will improve.\"\nRubio also makes a crucial point there -- online lenders, who have been working assiduously to take part in the program and likely have a wider reach than many lenders -- are likely to come online soon, something that will supplement the program's effectiveness.\nTreasury's view\n\"Treasury and SBA, in close coordination with the White House, have established an unprecedented $350 billion Main Street financial assistance program in just one week. Billions of dollars in loans have been registered on the very first day of activity. We are continuing to update guidance and work with lenders to ensure that all eligible borrowers and lenders are able to participate in this critical program to provide much-needed relief to hardworking Americans and businesses.\"\nA blunter view\nFrom a senior administration official:\n\"We're moving as fast as we can -- literally staff working around the clock. Were we ready [for the April 3 start date]? No. But this isn't a perfect world scenario. This is an urgent, if-we-don't-get-this-up-and-running-thousands-of-businesses-close-by-the-end-of-the-week scenario. Every day it gets better, faster, more clear for the lenders.\"\nWhat has worked up to this point\nGovernment officials and market participants say at this point, the billions of dollars in loans booked to aid thousands of businesses have primarily come through community banks and smaller lenders. The largest banks, which have been slower to ramp up access and capabilities for the program, spent much of the weekend continuing to adjust their guidance and build their technology to accurately input the guidelines for the program.\nIn 24 hours, the SBA reactivated 30,000 licenses for community banks and credit unions to help speed the process -- a crucial component of ensuring more small businesses can get access to the program.\nThe reality\nThis program is expected to work -- there's simply too much invested in it, and relying on it, for it not to. In fact, it's so crucial that both President Donald Trump and Treasury Secretary Steven Mnuchin have made clear they will likely be asking for more money for it in the near future.\nAnd senior aides in on both sides of the Capitol tell CNN that money will be made available if the request is made.\nThat's important: one of the major problems over the last several days, according to multiple small business owners who have relayed concerns to CNN, is that the $349 billion made available for the program will run out. Administration officials are making clear they will put their backs into getting more funds -- and even extend the deadline to apply -- if the conditions warrant.\nBut lawmakers are going to want to see the program kicking into high gear and working first.\nHow Capitol Hill is reacting\nRepublicans and Democrats on Capitol Hill are keenly aware that the last few days have not gone smoothly. In fact, Rubio tweeted Saturday morning about all the problems he was hearing about, and promised he was working closely with Treasury and SBA to find fixes. No one is surprised that a federal agency that did 1/10th of the loans they are offering through PPP has struggled to get $350 billion out the door. But it's still a massive problem that lawmakers are feeling pressure to correct.\nOver the weekend, the issues with SBA came up multiple times on Democratic and Republican conference calls. House Republicans held a call Friday night with Mnuchin to discuss several outstanding issues with the implementation of the stimulus bill and Mnuchin drew some fire from members on the execution of the PPP program.\nCNN is also told that PPP was a major point of contention on a Democratic member call for Ways and Means, even though the PPP program is not really in their jurisdiction. The bottom line? Members know that this program is the lifeblood for their communities. It's the difference between a total shuttering of beloved businesses and a complete collapse of employment in cities and rural communities they've spent the last decade since the financial crisis trying to build up again.\nThe *other* SBA program causing problems\nAs everyone focuses on the SBA's Paycheck Protection Program, several small business owners have reported another program that appears to be running into issues: the Economic Injury Disaster Loan.\nThis would allow businesses to receive a loan advance of up to $10,000 and was touted as money that would come within 72 hours, Yet many small business owners who applied weeks ago still haven't gotten their advance, most being told to re-apply due to a shifting application or standards. This is a smaller program, handled directly by the SBA as opposed to lenders, and can be used in tandem with the PPP loans. Yet it also appears to be having issues.\nDirect payments\nThere's been a lot of focus on the SBA, and rightfully so, but this is a huge week for another central plank of the economic rescue package: the direct payments to individuals and families . The department is planning to start sending direct deposit money out as soon as this week. That is expected to work well, people involved in the process tell CNN, but keep an eye on how it all goes. It's a huge volume of money transfers going out the door in a short period.\nBut the key thing to keep an eye on is what progress, if any, the government makes on creating an online portal for individuals that haven't submitted direct deposit information in past tax returns to do just that. Until that portal comes online, millions are staring at a months-long waiting period for their money, in the form of a paper check.", "url": "https://www.cnn.com/2020/04/06/politics/state-of-play-federal-stimulus-coronavirus/index.html"}