{"authors": [], "date_download": "2020-05-04 20:17:53", "date_modify": "2020-05-04 20:17:53", "date_publish": "2020-04-09 20:32:59", "description": "NASHVILLE, Tenn. (AP) — Tennessee State has a new athletic direcrtor — Mikki Allen, Tennessee’s assistant athletic director. Allen starts May 1 at the Ohio Valley Conference school and...", "filename": "_4273ea7f7337718eea3023ae36ab03cc_1588623473.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4273ea7f7337718eea3023ae36ab03cc_1588623473.html", "title": "Tennessee State hires Mikki Allen as new athletic director", "title_page": "Tennessee State hires Mikki Allen as new athletic director ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NASHVILLE, Tenn. (AP) — Tennessee State has a new athletic direcrtor — Mikki Allen, Tennessee’s assistant athletic director.\nAllen starts May 1 at the Ohio Valley Conference school and succeeds Teresa Phillips, who is retiring after 16 years at Tennessee State.\n“I look forward to carrying the torch forward and elevating the sports programs at TSU to the top of the OVC pyramid,” Allen said.\nTennessee State President Glenda Glover announced the hiring Thursday during a video conference call.\nGlover said Allen “builds strong relationships both internally and externally from his success as a fundraiser, and just as important ... is committed to the development of coaches and staff to achieve at a very high level.”\nAllen, 42, spent the past 11 years at his alma mater Tennessee in sports administration and was most recently in assistant AD for player relations and development. Allen created a development and assistance program for Tennessee football players designed to help them from enrollment to post-football careers.\nA native of Murfreesboro, Tennessee, Allen played four years at Tennessee and was a member of the Volunteers’ 1999 national championship team. He earned his master’s degree at Tennessee State.", "url": "https://apnews.com/4273ea7f7337718eea3023ae36ab03cc"}