{"authors": ["John Antczak"], "date_download": "2020-05-04 20:13:58", "date_modify": "2020-05-04 20:13:58", "date_publish": "2020-04-09 19:59:23", "description": "LOS ANGELES (AP) — Rain and snow continued to fall Thursday on parts of California as a wet spring following a no-show winter pushed back against resurgent dryness that spread over three-quarters...", "filename": "_583373f859aacb1a0dac5bfe34615ff0_1588623238.html", "image_url": "https://storage.googleapis.com/afs-prod/media/d3db06c7033149a6be8e01314db47d9a/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_583373f859aacb1a0dac5bfe34615ff0_1588623238.html", "title": "Spring storm brings more rain and snow to California", "title_page": "Spring storm brings more rain and snow to California", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A pedestrian wearing a face mask walks her dog protected from the rain in Los Angeles Thursday, April 9, 2020. Rain and snow continues to fall on parts of California as a wet spring pushes back against dryness that spread over three-quarters of the state during the dry winter. The latest storm entered the state from the north last weekend and moved down the coast. It's still drawing bands of rain into Southern California on Thursday and producing remarkable amounts of snow at higher elevations. For downtown Los Angeles, the rainfall has erased a seasonal deficit. (AP Photo/Damian Dovarganes)\nA pedestrian wearing a face mask walks her dog protected from the rain in Los Angeles Thursday, April 9, 2020. Rain and snow continues to fall on parts of California as a wet spring pushes back against dryness that spread over three-quarters of the state during the dry winter. The latest storm entered the state from the north last weekend and moved down the coast. It's still drawing bands of rain into Southern California on Thursday and producing remarkable amounts of snow at higher elevations. For downtown Los Angeles, the rainfall has erased a seasonal deficit. (AP Photo/Damian Dovarganes)\nLOS ANGELES (AP) — Rain and snow continued to fall Thursday on parts of California as a wet spring following a no-show winter pushed back against resurgent dryness that spread over three-quarters of the state this year.\nMountain peaks from the Sierra Nevada to major ranges crossing Southern California glistened with new coats of white as hillsides sported increasingly vivid shades of green fueled by precipitation that began in March after a largely withering January and February.\nThe latest storm entered the state from the north last weekend and slowly moved down the coast.\nIn its fifth day. it was still drawing bands of rain into Southern California and producing remarkable amounts of snow at higher elevations.\nFor downtown Los Angeles, the rainfall erased a big seasonal deficit and put the total to date above average, with chances for more continuing into Friday. The storm’s snowfall at the Mountain High resort, northeast of Los Angles, topped 31 inches (78.7 centimeters).\nThe U.S. Drought Monitor’s weekly update Thursday, reflecting data as of April 7, showed the effects of the spring storms on California.\nThe overall area affected by a condition called abnormally dry as well as drought declined from about 75% of the state to just under 68%.\nThe monitor cited “beneficial precipitation” in the higher elevations of the Sierra and the Trinity Mountains in Northern California, the Central Coast mountains and the Transverse Ranges of Southern California.\nThe designation of abnormal dryness was removed from many areas along the coast from Monterey County south to San Diego County.\nThe total area considered to be in the first stages of drought held steady at about 43% of the state.\nThree months ago, the state was almost entirely free of any level of dryness.\nDespite the spring storms and very full reservoirs, California’s snowpack remains below normal. State authorities have urged people to use water wisely, saying the climate continues to show extreme unpredictability.", "url": "https://apnews.com/583373f859aacb1a0dac5bfe34615ff0"}