{"authors": ["Dylan Lovan"], "date_download": "2020-05-04 20:04:02", "date_modify": "2020-05-04 20:04:02", "date_publish": "2020-04-07 18:48:26", "description": "LOUISVILLE, Ky. (AP) — A Kentucky man who had sex crime convictions commuted by former Gov. Matt Bevin last year has been charged by federal prosecutors with producing child pornography. The...", "filename": "_8c50afb6c9b197cc2c51eeada3e58347_1588622642.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8c50afb6c9b197cc2c51eeada3e58347_1588622642.html", "title": "Kentucky offender let out of prison by Bevin charged by feds", "title_page": "Kentucky offender let out of prison by Bevin charged by feds", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Kentucky offender let out of prison by Bevin charged by feds\nLOUISVILLE, Ky. (AP) — A Kentucky man who had sex crime convictions commuted by former Gov. Matt Bevin last year has been charged by federal prosecutors with producing child pornography.\nThe new charge against Dayton Jones stems from events that led to sodomy and other charges against him by Kentucky prosecutors in 2014. He was a few years into a 15-year sentence when Bevin commuted the sentence last year, nullifying the case in state court.\nThe U.S. Attorney’s office in Louisville said on Tuesday that Jones, 24, was arrested on one charge of producing child sex abuse material. The federal charge carries a minimum of 15 years in prison upon conviction.\nU.S. Attorney Russell Coleman said in a release that the new charge stems from events in 2014. Jones had pleaded guilty to assaulting a 15-year-old boy with a sex toy who had passed out from drinking. He was also found guilty in that case of making a video of the act, which Coleman said was shared on Snapchat. The U.S. Attorney release said Jones “created a video depicting child pornography.”\nColeman did not mention Bevin’s actions in the news release Tuesday.\n“This prosecution is about one thing and one thing only, Mr. Jones’ conduct in harming someone’s child in the western district of Kentucky in violation of federal law,” Coleman said.\nBevin issued hundreds of pardons before leaving office in December, attracting criticism from lawmakers, prosecutors and victims for a handful of pardons of violent felons that appeared to be politically motivated.\nChristian County Commonwealth’s Attorney Rick Boling admitted to writing a letter to Bevin in December on Jones’ behalf. Boling later publicly apologized for the letter, asking for forgiveness for the “embarrassment that I have caused this community.”", "url": "https://apnews.com/8c50afb6c9b197cc2c51eeada3e58347"}