{"authors": ["Contract Commerce Writer"], "date_download": "2020-05-04 20:21:00", "date_modify": "2020-05-04 20:21:00", "date_publish": "2020-04-29 16:30:55", "description": "Brooklinen's Birthday Sale is news you don't want to snooze on.", "filename": "entry_brooklinen-birthday-sale-20-percent-off-sitewide_l_5ea98d79c5b6123a17657ac7_1588623660.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9a66e220000060d827de7.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_brooklinen-birthday-sale-20-percent-off-sitewide_l_5ea98d79c5b6123a17657ac7_1588623660.html", "title": "You Can Rest Easy Now That Brooklinen’s Birthday Sale Just Dropped", "title_page": "You Can Rest Easy Now That Brooklinen’s Birthday Sale Just Dropped | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "HuffPost may receive a share from purchases made via links on this page. Prices and availability subject to change.\nDamir Khabirov via Getty Images You can rest easy now that Brooklinen's Birthday Sale is here.\nYou’re probably spending a lot more time in bed these days.\nFrom making your mattress a makeshift work-from-home desk to hosting happy hour in your pajamas, you might be staying in your sheets longer than just those five extra minutes in the morning.\nAnd if you’ve been looking for more sweet dreams and less all-nighters, we’ve got some news you definitely don’t want to snooze on.\nIt’s a pretty big deal, too, since Brooklinen rarely has sales. This latest markdown is on par with what the brand has offered on Black Friday, and is better than the brand’s Presidents Day deal earlier this year, which was 15% off bedding.\nFor those who might not know, Brooklinen also sells loungewear and launched its latest loungewear collection earlier this month, including the brand’s first-ever jumpsuit. So you can give your old college sweatshirts a little break now.\nWe went and found our favorite products that you get on sale now at Brooklinen to make it easier for you, including sheets, towels and pillows. Sweet dreams.", "url": "https://www.huffpost.com/entry/brooklinen-birthday-sale-20-percent-off-sitewide_l_5ea98d79c5b6123a17657ac7"}