{"authors": ["Sandra Gonzalez"], "date_download": "2020-05-04 16:03:01", "date_modify": "2020-05-04 16:03:01", "date_publish": "2020-03-31 21:25:57", "description": "Cool cats and kittens everywhere are hungry for more \"Tiger King.\" Luckily, before the docuseries found a ravenous fanbase on Netflix, \"SNL\" star Kate McKinnon was already set to adapt the story for screen. We offer some casting suggestions.", "filename": "2020_03_31_entertainment_ca_9b8c82c727b9ea719c29bdac081ff912_index_1588608181.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200329125429-tiker-king-joe-exotic-netflix-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_entertainment_ca_9b8c82c727b9ea719c29bdac081ff912_index_1588608181.html", "title": "Let's cast the inevitable 'Tiger King' screen adaptation", "title_page": "'Tiger King': Carole Baskin, Joe Exotic and more dream casting choices - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Cool cats and kittens everywhere are hungry for more \"Tiger King.\"\nLuckily, before the docuseries found a ravenous fanbase on Netflix, \"SNL\" star Kate McKinnon was already set to adapt the story for screen, having secured rights to the Wondery podcast \"Joe Exotic.\"\nMcKinnon is set to star as animal advocate Carole Baskin and executive produce the project, which is reportedly a limited series\nWhile a number of celebrities -- such as Dax Shepard Shane West and Edward Norton -- have thrown their hats in the ring to play Joe Exotic (real name Joseph Maldonado-Passage), here are some more suggestions. (: This story does contain spoilers from the docuseries, so do not continue reading unless you've completed your binge.)\nJoe Exotic\nJoe Exotic in 'Tiger King'\nWho is he? The eccentric zoo owner is the main character in \"Tiger King: Murder, Mayhem and Madness.\" The big cat lover has a feud with animal rights activist Carole Baskin, who runs Big Cat Rescue. He is later accused and convicted on charges that he hired someone to murder Baskin. He's currently in prison.\nWho should play him? CNN Entertainment's critic Brian Lowry suggested Billy Bob Thornton. My vote goes to Michael Keaton.\nCarole Baskin\nCarole Baskin appears in \"Tiger King.\"\nWho is she? The founder and CEO of Big Cat Rescue, Baskin has been vocal about her opposition to Joe Exotic's former practices and those of current big cat collectors, especially some featured in the show. Baskin's backstory -- including the mysterious disappearance of her former husband -- was explored on the series. Though, she and her husband have The founder and CEO of Big Cat Rescue, Baskin has been vocal about her opposition to Joe Exotic's former practices and those of current big cat collectors, especially some featured in the show. Baskin's backstory -- including the mysterious disappearance of her former husband -- was explored on the series. Though, she and her husband have taken issue with their portrayal.\nWho should play her? Though McKinnon is set to star, for dream casting purposes, let's say we were starting from scratch. Lowry suggests Oscar-winner Allison Janney. My vote goes to Merritt Wever, who would be the perfect younger version Carole. Then, the filmmakers can borrow the aging tech from Though McKinnon is set to star, for dream casting purposes, let's say we were starting from scratch. Lowry suggestsOscar-winner Allison Janney. My vote goes to Merritt Wever, who would be the perfect younger version Carole. Then, the filmmakers can borrow the aging tech from \"The Irishman\" to make her age-appropriate for the later years.\nHoward Baskin\nWho is he? He is He is Baskin's current husband and seen by her side in present-day interviews.\nWho should play him? CNN's Lisa Respers France suggests Sam Elliott.\nBhagavan \"Doc\" Antle\nBhagavan \"Doc\" Antle and Matt Damon.\nWho is he? Antle is, like Joe Exotic, a fellow big cat collector who runs a Myrtle Beach zoo. Antle has his own unusual lifestyle but resists filmmaker's attempts to discuss it in detail.\nWho should play him? Lowry's pick is Matt Damon. I endorse.\nDon Lewis\nJack Donald \"Don\" Lewis\nWho is he? Don Lewis was the ex-husband of Baskin. He's been missing since 1997. The docuseries, without presenting evidence, delves into theories from Baskin's rivals and some Lewis' surviving family members that she played a role in his disappearance.\nWho should play him? France thinks Woody Harrelson or Russell Crowe are great choices for what would be a likely minor but important role.\nRick Kirkham\nRick Kirkham and Walton Goggins\nWho is he? Kirkham appears mostly in the first half of \"Tiger King\" episodes. A seasoned television producer, Kirkham was hired by Joe Exotic to film a reality show and help make Joe a star.\nWho should play him? I think Walton Goggins (\"Justified\") or William Fitchner (\"Prison Break\") have the right amount of grit to pull this off. CNN's Chloe Melas suggests William Shatner.\nJohn Finlay\nJohn Finlay\nWho is he? Finlay is shown in \"Tiger King\" as being one of Joe Exotic's husbands. Their down-home marriage ceremony (they wore matching pink shirts and jeans) was even shown on the series. (Finlay, however, has stated they were never legally married.) He later has an affair with a female employee at the zoo and leaves Joe.\nWho should play him? My vote goes to \"American Horror Story\" star Finn Witrock. It can be his Charlize Theron in \"Monster\" transformation. She got an Oscar out of hers. Finlay, meanwhile, had his own suggestion in an My vote goes to \"American Horror Story\" star Finn Witrock. It can be his Charlize Theron in \"Monster\" transformation. She got an Oscar out of hers. Finlay, meanwhile, had his own suggestion in an interview with David Spade: Channing Tatum.\nTravis Maldonado\nWho was he? was another of Joe Exotic's husbands. They began their relationship when Maldonado was 19 and had a more than 30 year age difference. He died in 2017. Maldonado was another of Joe Exotic's husbands. They began their relationship when Maldonado was 19 and had a more than 30 year age difference. He died in 2017.\nWho should play him? As Evan Peters has shown on screen before, he could likely provide just the right mix of naive energy and dark undertones to pull this off this tragic role.\nDillon Passage\nDillon Passage\nWho is he? Joe Exotic re-married two months after the death of Maldonado to Dillon Passage, who has a minor role in this series but is shown to be sticking by Joe's side during his incarceration.\nWho should play him? Reid Ewing, who is best known for playing Haley's husband on \"Modern Family.\"\nJeff Lowe\nWho is he? Lowe steps in to help Joe Exotic when his zoo falls on hard financial times, but he has a pretty wild story of his own. The docuseries dives into better than you can in a few sentences, but let's just say it's the kind of wild stuff you imagine someone engages in when they are described as \"a business man.\"\nWho should play him? Lowry says Steve Buscemi. I think Will Arnett would be an odd but interesting choice.", "url": "https://www.cnn.com/2020/03/31/entertainment/carole-baskin-joe-exotic-tiger-king-movie-limited-series-casting/index.html"}