{"authors": ["Ariane De Vogue", "Cnn Supreme Court Reporter"], "date_download": "2020-05-04 16:28:22", "date_modify": "2020-05-04 16:28:22", "date_publish": "2020-04-07 20:38:57", "description": "A federal appeals court wiped away a lower court opinion Tuesday that blocked the federal government from executing federal inmates on death row.", "filename": "2020_04_07_politics_death-penalty-appeals-court_index_1588609702.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/130515154110-lethal-injection-table-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_death-penalty-appeals-court_index_1588609702.html", "title": "Appeals court wipes away lower court ruling blocking federal executions", "title_page": "Federal appeals court lifts lower court opinion blocking federal executions - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) A federal appeals court wiped away a lower court opinion Tuesday that blocked the federal government from executing federal inmates on death row.\nThe 2-1 ruling is a win for the Department of Justice, but the appeals court noted that there are still other issues that need resolution, suggesting that the executions will remain on hold while litigation continues.\nThe case comes after the Trump administration announced last July that it would reinstate the federal death penalty after a nearly two-decade lapse, and the two judges in the majority -- Gregory Katsas and Neomi Rao -- were both appointed by President Donald Trump.\nAttorney General William Barr's move to reinstate the federal death penalty underscored the stark law and order philosophy of the Trump administration. At the time, he directed the head of the Bureau of Prisons to execute five inmates he said represented the \"worst criminals.\"\nThe Bureau of Prisons adopted a new lethal injection protocol consisting of a single drug, pentobarbital.\nRead More", "url": "https://www.cnn.com/2020/04/07/politics/death-penalty-appeals-court/index.html"}