{"authors": ["Priscilla Alvarez", "Ali Zaslav", "Daniella Diaz"], "date_download": "2020-05-04 17:00:30", "date_modify": "2020-05-04 17:00:30", "date_publish": "2020-04-09 14:41:38", "description": "The Trump administration is pulling back federal support of testing sites by the end of the week, according to the Federal Emergency Management Agency, amid ongoing concerns over testing shortages nationwide.", "filename": "2020_04_09_politics_community-based-coronavirus-testing_index_1588611630.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408190618-covid-testing-briefing-04082020-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_community-based-coronavirus-testing_index_1588611630.html", "title": "Federal support to end for coronavirus testing sites", "title_page": "Federal support to end for coronavirus testing sites - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Trump administration is pulling back federal support of testing sites by the end of the week, according to the Federal Emergency Management Agency, amid ongoing concerns over testing shortages nationwide.\nThe so-called Community-Based Testing Sites program was intended to jumpstart initial testing capabilities to critical areas across the US, according to the agency. But given FDA approval for individuals to self-administer nasal swab tests at sites, the demand for personal protective equipment and trained health care providers will be reduced, a FEMA spokesperson said in a statement.\nThe move has received mixed reactions. While some localities may need federal support, others have already moved toward managing their own sites.\n\"The federal involvement was they provided the test kits. As of last week, they were no longer involved and left all of the test kits to use as we deemed appropriate,\" Georgia's Department of Public Health said in a statement, noting that the state has been managing two of these sites.\n\"Under their guidelines we could only use them in two sites in the state, now we are free to disperse them as needed,\" the statement continued, referring to the test kits. \"The sites were already in existence and running when they came in and they still are -- smoothly.\"\nRead More", "url": "https://www.cnn.com/2020/04/09/politics/community-based-coronavirus-testing/index.html"}