{"authors": ["Graham Dunbar"], "date_download": "2020-05-04 20:15:12", "date_modify": "2020-05-04 20:15:12", "date_publish": "2020-04-07 18:53:17", "description": "GENEVA (AP) — Russian officials on Tuesday flatly denied bribing a FIFA voter with millions of dollars to support the country's winning 2018 World Cup bid, after American prosecutors revealed new...", "filename": "_2e562fd218d875fd76761ae5c4acbc89_1588623312.html", "image_url": "https://storage.googleapis.com/afs-prod/media/78a5d89f8ba14f7f912008b1c8972219/2844.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2e562fd218d875fd76761ae5c4acbc89_1588623312.html", "title": "Russia flatly denies US allegation of World Cup bid bribes", "title_page": "Russia flatly denies US allegation of World Cup bid bribes", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this June 2, 2011 file photo, suspended FIFA executive Jack Warner gestures during a news conference at the airport in Port-of-Spain, Trinidad and Tobago. Prosecutors revealed new details of alleged bribes paid to FIFA executive committee members to gain their votes for Qatar to host the 2022 World Cup. An indictment unsealed Monday, April 6, 2020 in U.S. District Court in Brooklyn says Jack Warner of Trinidad and Tobago, president of the North and Central American and Caribbean governing body CONCACAF, received $5 million in bribes to vote for Russia to host in 2018 from 10 different shell companies that included entities in Anguilla, Cyprus and the British Virgin Islands, the indictment alleged. (AP Photo/Shirley Bahadur, File)\nFILE - In this June 2, 2011 file photo, suspended FIFA executive Jack Warner gestures during a news conference at the airport in Port-of-Spain, Trinidad and Tobago. Prosecutors revealed new details of alleged bribes paid to FIFA executive committee members to gain their votes for Qatar to host the 2022 World Cup. An indictment unsealed Monday, April 6, 2020 in U.S. District Court in Brooklyn says Jack Warner of Trinidad and Tobago, president of the North and Central American and Caribbean governing body CONCACAF, received $5 million in bribes to vote for Russia to host in 2018 from 10 different shell companies that included entities in Anguilla, Cyprus and the British Virgin Islands, the indictment alleged. (AP Photo/Shirley Bahadur, File)\nGENEVA (AP) — Russian officials on Tuesday flatly denied bribing a FIFA voter with millions of dollars to support the country’s winning 2018 World Cup bid, after American prosecutors revealed new details about the alleged payments.\nKremlin spokesman Dmitry Peskov said Russia had no part in bribing FIFA executive committee members to win the World Cup hosting vote in December 2010. So did Russia’s top soccer official Alexey Sorokin, who led the bid.\n“We can’t understand what this is about, or how to react,” Sorokin told The Associated Press, referring to claims in a U.S. Department of Justice indictment unsealed late Monday. “We the bid committee had nothing to do with this. ... It looks like a perfect conspiracy theory.”\nThe indictment said high-ranking FIFA official Jack Warner of Trinidad and Tobago received $5 million in bribes to vote for Russia from 10 different offshore shell companies, which used correspondent accounts in the U.S.\nWarner was first indicted in 2015 on financial corruption charges that included a separate $10 million bribe from 2010 World Cup host South Africa. He was an influential FIFA vice president at the time of Russia’s victory against three rival European bids.\nDetailing a new digital money trail, the fresh indictment said payments arrived in Trinidad and Tobago via “densely layered transactions between and among offshore accounts,” including in Cyprus and the British Virgin Islands.\nSome money was wired using accounts that also paid “companies based in the United States that performed work on behalf of the 2018 Russia World Cup bid,” the DOJ said.\nSorokin acknowledged hiring Americans in the 2009-10 bidding campaign in which Russia beat three rival European bids to host the 2018 World Cup.\n“There was a designer company most likely having a legal address in the U.S.,” Sorokin said in a telephone interview. “There were a number of companies. Which one was U.S. based and which one was not, honestly, it’s hard to say right now.”\nTwo emails were cited in the indictment as new evidence in the sprawling investigation that first rocked FIFA and international soccer officials in May 2015.\nOne was written by “co-conspirator 3” in April 2011 and allegedly was sent to Warner’s assistant with advice on writing to accept receiving the “5m” total payments “minus minimal bank charges.”\nThe identity of No. 3 has not been made public, but the person has been described as “a close advisor” to then-FIFA president Sepp Blatter and “other high-ranking FIFA officials.”\nAsked if that person had any formal or informal role with Russia’s bid campaign, Sorokin said: “None that I can recall.”\nThe other email, also to Warner’s assistant, was written ahead of the FIFA vote by “an associate of co-conspirator 3.”\n“Kindly advise him (Warner) that ‘what was agreed is what is being done this week,’” the email said. “Please also tell him that I am less worried about promises made to be fulfilled on my end than his ability to keep his promise when the time comes.”\nRussia won the second round of voting easily with 13 of the 22 votes. Two FIFA officials were removed from the process after being implicated in vote-selling by a British newspaper’s undercover sting.\nRussian President Vladimir Putin, who was prime minister in 2010, made it a national priority to host soccer’s signature event. He gave a victory news conference in Zurich, beginning it by speaking in English.\n“Russia received the rights to host the World Cup in an absolutely legal manner,” Peskov said Tuesday. “This is not linked in any way to any bribes and we categorically deny it.”\nFIFA’s ethics committee found in 2014 that Russia and other candidates, including 2022 World Cup host Qatar, broke some bidding rules but they did not affect the results.\n“We abundantly responded to all the questions,” said Sorokin, who has been a member of FIFA’s strategy-setting council since 2017. “We have opened everything that we have. We don’t know what else to say.”\nHowever, FIFA investigators said Russian bid campaign emails were requested but not retrieved from Google. Staffers’ computers leased from a youth soccer foundation — linked to Chelsea owner Roman Abramovich — were returned and later destroyed, the investigation report said.\n“Regrettably when people see Russia, they automatically — some people — think the worst,” Sorokin said. “We do not agree with this stereotype.”\nWarner has been fighting extradition to face racketeering conspiracy charges in the U.S. since 2015, the same year FIFA banned him for life. He dismissed the latest allegations in comments reported by Trinidadian media.\nThe updated indictment also identified Russia as the 2018 bidder a FIFA voter from Guatemala, Rafael Salguero, said he promised to support for a $1 million bribe. He never received the money, and was sentenced to time served in 2018 after pleading guilty and cooperating with U.S. authorities.\n___\nMore AP soccer: https://apnews.com/Soccer and https://twitter.com/AP_Sports", "url": "https://apnews.com/2e562fd218d875fd76761ae5c4acbc89"}