{"authors": [], "date_download": "2020-05-04 20:28:16", "date_modify": "2020-05-04 20:28:16", "date_publish": "2020-03-03 07:14:32", "description": "CHRIS MATTHEWS RETIRES FROM MSNBC, CITES COMMENTS TO WOMEN NEW YORK (AP) — “Hardball” host Chris Matthews says he’s retiring from MSNBC. The host opened his show Monday evening by saying he...", "filename": "_861740bb29c94d35babfa2aa04ae75a2_1588624096.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_861740bb29c94d35babfa2aa04ae75a2_1588624096.html", "title": "AM Prep-Segue", "title_page": "AM Prep-Segue", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHRIS MATTHEWS RETIRES FROM MSNBC, CITES COMMENTS TO WOMEN\nNEW YORK (AP) — “Hardball” host Chris Matthews says he’s retiring from MSNBC. The host opened his show Monday evening by saying he was retiring from the network and apologizing for comments he made to women. Matthews made the announcement at the top of his show, announcing it would be his last. After he was done, the show went into a commercial break, and Matthews did not return. He said compliments on a woman’s appearance that some men, himself included, thought were OK “were never OK.”\nJAMES LIPTON DIES\nLOS ANGELES (AP) - The one guest James Lipton could not get for his TV show “Inside the Actors Studio” was Marlon Brando. Lipton told Parade magazine in 2013 that Brando told him that he was never going to do his show. Lipton said he had a pretty good roster of guests without Brando. They include Paul Newman, Meryl Streep, Robert De Niro, Glenn Close, Steven Spielberg and Barbra Streisand. Lipton said his favorite guest on the show was Bradley Cooper, because he was a former student. Lipton died Monday of bladder cancer at his home in New York, according to his wife. He was 93.\n“BRING IT” DANCE TEACHER SENTENCED TO 9 MONTHS FOR EXPOSING TEEN TO HIV\nMEMPHIS, Tenn. (AP) — A Tennessee dance teacher who appeared on the Lifetime reality show “Bring It” was sentenced to nine months in prison for raping a teenage student and exposing him to HIV. John Conner III was also sentenced to four years’ probation Friday. Connor pleaded guilty in November to criminal exposure to HIV, statutory rape and solicitation of a minor based on incidents from 2015. Investigators say Connor didn’t tell the teen he was diagnosed with HIV. The youth later tested positive for HIV.", "url": "https://apnews.com/861740bb29c94d35babfa2aa04ae75a2"}