{"authors": ["Breaking News Reporter"], "date_download": "2020-05-04 20:26:54", "date_modify": "2020-05-04 20:26:54", "date_publish": "2020-04-28 21:31:29", "description": "Angela Summers, 45, was delivering mail in an Indianapolis neighborhood when she was fatally shot Monday, authorities said.", "filename": "entry_uspis-reward-in-postal-worker-death_n_5ea86305c5b62271082f599f_1588624014.html", "image_url": "https://img.huffingtonpost.com/asset/5ea88a1c2500004c10eb082b.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_uspis-reward-in-postal-worker-death_n_5ea86305c5b62271082f599f_1588624014.html", "title": "USPS Officials Offer $50,000 Reward In Postal Worker's Shooting Death", "title_page": "USPS Officials Offer $50,000 Reward In Postal Worker's Shooting Death | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "The law enforcement arm of the U.S. Postal Service is offering up to $50,000 for information into the homicidal shooting death of a postal worker in Indiana on Monday.\nThe postal worker, identified by the Marion County Coroner’s Office as Angela Summers, 45, was delivering mail in an Indianapolis neighborhood just before 4 p.m. when she was fatally shot, the U.S. Postal Inspection Service (USPIS) said in a statement.\nShe was transported to a local hospital where she was pronounced dead, the Indianapolis Metropolitan Police Department said in a statement to HuffPost.\nA witness told local station WTHR that Summers had been in a confrontation with a man about him not having received his government stimulus check.\ntsz01 via Getty Images Angela Summers, 45, was delivering mail in an Indianapolis neighborhood Monday when she was fatally shot by an unknown suspect, authorities said.\nSummers reportedly said she couldn’t deliver his mail until he brought his dogs inside. Summers pepper-sprayed the man, and was then shot by the man, who took off running.\nPolice have released few details about the incident and did not respond to HuffPost’s questions about a suspected motive.\nA Facebook post by a local National Association of Letter Carriers union repeated the detail that her death was related to a man enraged about his mail being delayed. The union asked the public to keep her family, which includes a 14-year-old daughter, in its prayers.\nPaul Toms, president of the NALC’s Indianapolis branch, said Summers had worked three years as a mail carrier and made a great impact on everyone.\n“She was very well liked,” Toms told the Indy Star. “Always a smile.”\nKillings of U.S. Postal Service workers are rare, with four postal workers having been killed in workplace homicides between 2013 and 2018, CNN reported, citing the Bureau of Labor Statistics. The crime is considered a federal offense and can be punishable with death or a life sentence.\nThe USPIS, whose reward money is for information leading to the arrest and conviction of the suspect(s) responsible for her death, is the primary law enforcement, crime prevention and security arm of the Postal Service and is one of the nation’s oldest law enforcement agencies, having been created in 1775.\nLast year, the USPIS said it investigated 576 reported threats and assaults made against postal employees. The agency made 247 arrests that resulted in 154 convictions. In 2018, the agency said it made 215 arrests for assaults and threats on postal employees.\nAnyone with information is urged to contact Crime Stoppers at its website or at 317-262-TIPS.", "url": "https://www.huffpost.com/entry/uspis-reward-in-postal-worker-death_n_5ea86305c5b62271082f599f"}