{"authors": [], "date_download": "2020-05-04 20:18:48", "date_modify": "2020-05-04 20:18:48", "date_publish": "2020-03-11 13:55:53", "description": "Today in History Today is Wednesday, March 11, the 71st day of 2020. There are 295 days left in the year. Today's Highlight in History:", "filename": "_f9f35785b61c40619b49dc8b65bdacc6_1588623528.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f9f35785b61c40619b49dc8b65bdacc6_1588623528.html", "title": "Today in History", "title_page": "Today in History", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Today in History\nToday is Wednesday, March 11, the 71st day of 2020. There are 295 days left in the year.\nToday’s Highlight in History:\nOn March 11, 2011, a magnitude-9.0 earthquake and resulting tsunami struck Japan’s northeastern coast, killing nearly 20,000 people and severely damaging the Fukushima Dai-ichi (foo-koo-SHEE’-mah dy-EE’-chee) nuclear power station.\nOn this date:\nIn 1862, during the Civil War, President Abraham Lincoln removed Gen. George B. McClellan as general-in-chief of the Union armies, leaving him in command of the Army of the Potomac, a post McClellan also ended up losing.\nIn 1888, the Blizzard of ’88, also known as the “Great White Hurricane,” began inundating the northeastern United States, resulting in some 400 deaths.\nIn 1918, what are believed to be the first confirmed U.S. cases of a deadly global flu pandemic were reported among U.S. Army soldiers stationed at Fort Riley, Kansas; 46 would die. (The worldwide outbreak of influenza claimed an estimated 20 to 40 million lives.)\nIn 1941, President Franklin D. Roosevelt signed the Lend-Lease Bill, providing war supplies to countries fighting the Axis.\nIn 1942, as Japanese forces continued to advance in the Pacific during World War II, U.S. Army Gen. Douglas MacArthur left the Philippines for Australia, where he vowed on March 20, “I shall return” — a promise he kept more than 2½ years later.\nIn 1954, the U.S. Army charged that Sen. Joseph R. McCarthy, R-Wis., and his subcommittee’s chief counsel, Roy Cohn, had exerted pressure to obtain favored treatment for Pvt. G. David Schine, a former consultant to the subcommittee. (The confrontation culminated in the famous Senate Army-McCarthy hearings.)\nIn 1959, the Lorraine Hansberry drama “A Raisin in the Sun” opened at New York’s Ethel Barrymore Theater.\nIn 1977, more than 130 hostages held in Washington, D.C., by Hanafi Muslims were freed after ambassadors from three Islamic nations joined the negotiations.\nIn 1985, Mikhail S. Gorbachev was chosen to succeed the late Konstantin U. Chernenko as general secretary of the Soviet Communist Party.\nIn 2003, a U.S. Army helicopter crashed near Fort Drum in upstate New York, killing 11 soldiers. Recep Tayyip Erdogan (REH’-jehp TY’-ihp UR’-doh-wahn), the leader of Turkey’s governing party, was named prime minister. After a four-day walkout that cost New York City $10 million, Broadway musicians settled the first strike on the Great White Way in nearly 30 years.\nIn 2004, ten bombs exploded in quick succession across the commuter rail network in Madrid, Spain, killing 191 people in an attack linked to al-Qaida-inspired militants.\nIn 2005, a judge, court reporter and sheriff’s deputy were shot to death at an Atlanta courthouse; Brian Nichols, who killed them as well as a federal agent, surrendered a day later at the apartment of Ashley Smith, a woman he’d taken hostage. (Nichols was later convicted of murder and sentenced to life in prison.)\nTen years ago: A federal appeals court in San Francisco upheld the use of the words “under God” in the Pledge of Allegiance and “In God We Trust” on U.S. currency. In an address at Tel Aviv University, Vice President Joe Biden said “good faith negotiations” could recognize Israeli security needs and the Palestinian goal for a viable state. Sebastian Pinera was sworn in as Chile’s new president on a day when the country was peppered with a dozen significant aftershocks from a February earthquake. Pro Football Hall of Famer and former television actor Merlin Olsen died in suburban Los Angeles at age 69.\nFive years ago: The police chief of the St. Louis suburb of Ferguson resigned in the wake of a scathing Justice Department report prompted by the fatal shooting of an unarmed black 18-year-old by a white police officer. Jimmy Greenspoon, 67, the keyboardist for rock band Three Dog Night, died in North Potomac, Maryland.\nOne year ago: Airlines in Ethiopia, China, Indonesia and elsewhere grounded the Boeing 737 Max 8 jetliner after the second devastating crash of one of the planes in five months; Boeing said it had no reason to pull the popular aircraft from the skies. Party leaders announced that Milwaukee would be the host of the 2020 Democratic National Convention. President Donald Trump proposed a record $4.7 trillion budget, pushing the federal deficit past $1 trillion but counting on optimistic growth, accounting shuffles and steep domestic cuts to bring spending into balance in 15 years. Hal Blaine, a session drummer who played on the songs of Frank Sinatra, Elvis Presley and the Beach Boys, died at his California home at the age of 90; according to the Rock & Roll Hall of Fame, Blaine had played on 40 No. 1 hits and 150 top 10 songs.\nToday’s Birthdays: Media mogul Rupert Murdoch is 89. Former ABC News correspondent Sam Donaldson is 86. Musician Flaco Jimenez (FLAH’-koh hee-MEH’-nez) is 81. Actress Tricia O’Neil is 75. Actor Mark Metcalf is 74. Rock singer-musician Mark Stein (Vanilla Fudge) is 73. Singer Bobby McFerrin is 70. Movie director Jerry Zucker is 70. Singer Cheryl Lynn is 69. Actress Susan Richardson is 68. Recording executive Jimmy Iovine (eye-VEEN’) is 67. Singer Nina Hagen is 65. Country singer Jimmy Fortune (The Statler Brothers) is 65. Actor Elias Koteas (ee-LY’-uhs koh-TAY’-uhs) is 59. Actor-director Peter Berg is 58. Singer Mary Gauthier (GOH’-shay) is 58. Actor Jeffrey Nordling is 58. Actress Alex Kingston is 57. Country musician David Talbot is 57. Actor Wallace Langham is 55. Former U.S. Rep. Jesse Jackson Jr., D-Ill., is 55. Actor John Barrowman is 53. Singer Lisa Loeb is 52. Neo-soul musician Al Gamble (St. Paul & the Broken Bones) is 51. Singer Pete Droge is 51. Actor Terrence Howard is 51. Rock musician Rami Jaffee is 51. Actor Johnny Knoxville is 49. Rock singer-musicians Benji and Joel Madden (Good Charlotte; The Madden Brothers) are 41. Actor David Anders is 39. Singer LeToya is 39. Actress Thora Birch is 38. TV personality Melissa Rycroft is 37. Actor Rob Brown is 36. Actress Jodie Comer is 27.\nThought for Today: “It’s all right to hesitate if you then go ahead.” — Bertholt Brecht, German poet and dramatist (1898-1956).", "url": "https://apnews.com/f9f35785b61c40619b49dc8b65bdacc6"}