{"authors": ["Lauren M. Johnson"], "date_download": "2020-05-04 16:05:03", "date_modify": "2020-05-04 16:05:03", "date_publish": "2020-04-01 21:47:38", "description": "San Rafael Waterfall, the largest waterfall in Ecuador, has seemingly vanished after a sinkhole swallowed part of its water source.", "filename": "2020_04_01_world_san-rafael-waterfall-gone-trnd_index_1588608303.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401161858-01-san-rafael-waterfall-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_world_san-rafael-waterfall-gone-trnd_index_1588608303.html", "title": "Ecuador's largest waterfall has disappeared", "title_page": "Ecuador's largest waterfall has disappeared  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The largest waterfall in Ecuador has seemingly vanished after a sinkhole swallowed part of its water source.\nSan Rafael Waterfall on the Coca River was a prominent tourist attraction for the country, and according to NASA , drew tens of thousands of people every year. The water dropped 150 feet into a crater-like opening on the other side.\nNow, the iconic waterfall is gone, replaced by three streams, NASA said. All tourism to the site has been closed and it no longer appears on the country's travel website.\nExperts at the Ministry of the Environment (MOE) in Ecuador believe the event happened in early February upstream, and diverted the current river pattern underground.\nShortly after, MOE technicians said they inspected the waterfall and reported \"possible undermining of the river's path, prior to the fall of the waterfall.\"\nHowever, they could not determine an exact cause at the time.\nThere is some discrepancy over if it was a natural phenomenon, or caused by construction of a hyrdoplant on the river.\nThe Ministry of Tourism does not plan to reconstruct the falls, NASA said.", "url": "https://www.cnn.com/2020/04/01/world/san-rafael-waterfall-gone-trnd/index.html"}