{"authors": [], "date_download": "2020-05-04 16:57:51", "date_modify": "2020-05-04 16:57:51", "date_publish": "2020-04-09 15:17:20", "description": "Just a day after the Ring Video Doorbell 3 and Video Doorbell 3 Plus started shipping to customers, the company is launching the second generation of Ring Alarm, the brand's customizable security offering.", "filename": "2020_04_09_cnn-underscored__3c6ea5184ac27939deb624e31873f91f_index_1588611471.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409111144-4-underscored-ring-alarm-second-generation-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_cnn-underscored__3c6ea5184ac27939deb624e31873f91f_index_1588611471.html", "title": "Ring Alarm gets sleeker in its 2nd Gen, keeps connectivity and DIY security simplicity", "title_page": "Ring Alarm 2nd Generation: Here's what you need to know about the latest DIY security system - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Just a day after the Ring Video Doorbell 3 and Video Doorbell 3 Plus started shipping to customers, the company is launching the second generation of Ring Alarm, the brand's customizable security offering.\nThe price for the basic starter kit is still $199.99 and includes the base station, a keypad, a motion detector, a range extender and a contact sensor for doors or windows. It might be small for some houses due to a somewhat limited range, but is a perfect size for apartments. And since Ring Alarm is still a no-contract- required DIY solution to home security, you can expand your system with more sensors as you need see fit.\nRing's theme for the second generation is a sleeker and less bulky design. Arguably the biggest changes are with the keypad. Not only is it slimmer and about half the size of the previous generation, but it introduces one-touch buttons for emergency services. Police, fire or medical services are just a tap away. Just be careful not to hit these by accident and as a precaution, a 3-second push is required to activate. Additionally, you get dedicated buttons for core functions like arming, disarming and exiting even while it is armed. You will need to enter a pin to arm or disarm, and that's where the three rows of numbers come in.\nThe new design language for the second generation is sleeker with rounded corners and a full matte white paint job for the whole line. That includes the motion detector, range extender, contact sensor and keypad. You'll also notice rounded edges for a more modern look.\nIn the event of power outages, the base station still features a 24-hour backup battery that will kick in when needed. Additionally, the base and station range extender still pack functionality for Z-Wave, which is the network standard for smart homes that will let you add compatible light bulbs, smart plugs and other smart devices. With the and base station acting as a Z-Wave smart hub as well, you can take control of these products with Alexa. It's certainly handy and the Ring Alarm Range Extender extends that coverage.\nInstallation is meant to be done by the buyer, so that means most folks can install them without the additional cost of professional installation. You can use an included adhesive sticker (think a material similar to that of a Command Hook) or use a bracket.\nOnce the system is set up, you can manage it from the Ring app for Android and iOS. Plus, you can integrate your smart lights, doorbells and security cameras with the system. On its own, Ring Alarm can alert you if a sensor goes off or if it detects motion. But you'll need to make the call to the proper authorities to respond. We'd recommend going with professional 24/7 monitoring from Ring, as they will contact you when a sensor goes off and can get the correct services in motion. It's akin to monitoring from ADT or Vivint. Ring offering professional monitoring through its Protect Plus plan which is $10 a month or $100 a year.\nThe second-generation Ring Alarm is available for preorder right now at Amazon.com, and will officially launch on April 29. The starting five-piece kit is up for preorder at $199.99.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/09/cnn-underscored/ring-alarm-second-generation-security-buy/index.html"}