{"authors": [], "date_download": "2020-05-04 20:12:09", "date_modify": "2020-05-04 20:12:09", "date_publish": "2020-01-23 20:51:19", "description": "“SOPRANOS” ACTRESS TESTIFIES, ACCUSES WEINSTEIN OF RAPE NEW YORK (AP) — The jury in the Harvey Weinstein rape case has heard riveting and emotional testimony from an actress who starred in...", "filename": "_a619e78ea7394025864337c745b43439_1588623129.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a619e78ea7394025864337c745b43439_1588623129.html", "title": "PM Prep-Segue", "title_page": "PM Prep-Segue", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "“SOPRANOS” ACTRESS TESTIFIES, ACCUSES WEINSTEIN OF RAPE\nNEW YORK (AP) — The jury in the Harvey Weinstein rape case has heard riveting and emotional testimony from an actress who starred in the TV drama “The Sopranos.” Annabella Sciorra told the panel the burly movie producer barged into her apartment after giving her a ride home, overpowered her — and raped her. Sciorra, speaking in a quivering voice, said she tried to fight Weinstein off by punching and kicking him — but to no avail. The actress testified that a month after the 1990’s incident, she ran into Weinstein and confronted him with the rape claim. She says he replied, “That’s what all the nice Catholic girls say.” Then, Sciorra says Weinstein leaned toward her and added with a menacing voice, “This remains between you and I.”\nThe incident involving Sciorra isn’t one of the criminal charges that Weinstein faces; the judge let her testify as part of a prosecution effort to paint the disgraced producer as a serial rapist.\n___\nSound: Upcoming\nWEINSTEIN’S ATTORNEYS CROSS-EXAMINE SCIORRA\nNEW YORK (AP) — After her emotional testimony, lawyers for Harvey Weinstein tried to undermine her account. During cross-examination, “Sopranos” actress Annabella Sciorra said Weinstein began their sexual encounter by “trying to cajole” her into having sex — and that after she refused, she had to fight him off. Defense attorney Donna Rotunno also got Sciorra to testify that she never reported the rape to police or went to a doctor. The defense also suggested Sciorra’s judgment and recollection were clouded by drinking.\n___\nSound: Upcoming\nVETERAN NEWSMAN JIM LEHRER DIES\nNEW YORK (AP) — The longtime host of the PBS “NewsHour” has died. PBS has announced that Jim Lehrer passed away at age 85. A statement from the network says Lehrer died “peacefully in his sleep.” For years, Lehrer teamed up Robert McNeil to co-host “The McNeil-Lehrer Report” which like “NewsHour” offered a thoughtful take on the day’s news. Lehrer also often moderated presidential debates.\nCHARACTER ACTOR JOHN KARLEN DIES\nBURBANK, Calif. (AP) — A veteran character actor who starred in TV shows like “Dark Shadows” and “Cagney & Lacey” has died. John Karlen died yesterday of congestive heart failure in Burbank, California. He was 86. Karlen co-starred as Harvey Lacey on “Cagney & Lacey” — playing the husband of Mary Beth Lacey, played by Tyne Daly. That role earned him an Emmy as best supporting actor in 1986.\nJUICE WRLD AUTOPSY RESULTS\nCHICAGO (AP) — An accidental overdose of oxycodone and codeine — that’s what a medical examiner’s report says killed rapper Juice WRLD. Authorities in the Cook County Medical Examiner’s office announced their findings yesterday, several weeks after the 21-yer-old musician went into convulsions at a Chicago airport shortly after he and his crew landed on a private plane. He was taken to a hospital where he was pronounced dead a short time later. A federal agent who met the musician at the airport administered the rapper a “save shot” of Narcan, aimed at reversing the effects of an opioid overdose.\nJOEY KRAMER LOSES BID TO REJOIN AEROSMITH\nBOSTON (AP) — Aerosmith drummer Joey Kramer says he’s “extremely disappointed” that a judge rejected his request to rejoin Aerosmith for performances during Grammy weekend. But he also says he respects that decision. A Superior Court judge in Massachusetts nixed Kramer’s request to let him take part in a weekend celebration of the band’s music and career. Representatives for Aerosmith didn’t comment on the judge’s decision. Previously the band said it invited Kramer along for the Grammy events — just not for him to perform on stage.\n___\nSound:\n104328-r-486:00-(Aerosmith, performing “Walk This Way”)-”(music fades)”-Aerosmith drummer sues to rejoin band for Grammy honors (22 Jan 2020)\n¤¤CUT ´104328 (01/22/20)££ 486:00 ”(music fades)”\nJAMIE FOXX RECOGNIZED BY BLACK FILM CRITICS GROUP\nLOS ANGELES (AP) — Jamie Foxx has won an Oscar and a Grammy — as well as other top awards. But he says the award he got last night is just as big. He was recognized by the African American Film Critics Association last night during its 11th annual ceremony in Los Angeles. Foxx won for his role in “Just Mercy.” Foxx notes people give lots of attention to the Grammys and Oscars — but this one is “special” — because it, as he put it, “comes from your own people.”\nSUNDANCE FILM FESTIVAL GETS UNDER WAY\nPARK CITY, Utah (AP) — The Sundance Film Festival is getting under way — and over the next 10 days, there will be some 118 feature films set to be rolled out before the eyes of fans, movie insiders and fans. The opening day will feature a Netflix film: the Taylor Swift documentary “Miss Americana.”\nby Oscar Wells Gabriel II\nFollow Oscar Wells Gabriel II on Twitter at https://twitter.com/OWGabriel2", "url": "https://apnews.com/a619e78ea7394025864337c745b43439"}