{"authors": ["Keith Ridler"], "date_download": "2020-05-04 20:29:04", "date_modify": "2020-05-04 20:29:04", "date_publish": "2020-04-20 21:04:28", "description": "BOISE, Idaho (AP) — Two environmental groups filed a federal lawsuit Monday to stop a proposed underground natural gas pipeline from Idaho to Wyoming, saying it would harm protected grizzly bears...", "filename": "_4bca8bf6ab8f258a24eea5037cc6dc8f_1588624144.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4bca8bf6ab8f258a24eea5037cc6dc8f_1588624144.html", "title": "Lawsuit filed to stop Idaho-Wyoming natural gas pipeline", "title_page": "Lawsuit filed to stop Idaho-Wyoming natural gas pipeline", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BOISE, Idaho (AP) — Two environmental groups filed a federal lawsuit Monday to stop a proposed underground natural gas pipeline from Idaho to Wyoming, saying it would harm protected grizzly bears and other wildlife.\nThe Alliance for the Wild Rockies and Yellowstone to Uintas Connection filed the lawsuit against the U.S. Forest Service.\nThe groups contend that Forest Service approval of the Crow Creek Pipeline Project in November violated the Endangered Species Act. The groups also said the Forest Service violated its own requirements involving sage grouse contained in its 2015 Forest Plan.\nWyoming-based Lower Valley Energy wants to build the pipeline that would start near Montpelier, Idaho, and run to Afton, Wyoming. The company on its website says it has some 5,000 natural gas customers in Afton. The company has been trucking natural gas to the town, but officials say delivery has been unreliable and the town has nearly run out several times.\nLower Valley Energy spokesman Brian Tanabe didn’t immediately return a call Monday seeking further comment. The U.S. Department of Justice, which defends federal agencies in lawsuits, didn’t immediately respond to an inquiry.\nThe environmental groups said an 18-mile (29-kilometer) portion of the 50-mile (80-kilometer) pipeline would cut a corridor through Caribou-Targhee National Forest and create a road through six roadless areas.\nThe 2001 Roadless Rule prevents road construction and timber harvest in designated roadless areas, which are typically 5,000 acres (2,000 hectares) or larger.\n“There are exactly zero benefits to public lands or wildlife from this project,” said Mike Garrity, executive director of the Alliance for the Wild Rockies.\nThe Forest Service gave approval to build the pipeline through the forest with a temporary 50-foot (15-meter) wide right-of-way for construction and then a 20-foot (6-meter) utility corridor as a permanent right-of-way. In all, the construction phase would use about 110 acres (45 hectares) of forest land and the permanent right-of-way about 45 acres (18 hectares).\n“The pipeline utility corridor will be, in actual effect, a permanent 18.2-mile motorized trail through five different National Forest Inventoried Roadless Areas and thus cause permanent vegetation removal, increased sight-lines for poaching, increased noxious weed introductions, and abundant new opportunities for illegal motor vehicle use in perpetuity,” said Jason Christensen, director of Yellowstone to Uintas Connection.\nAlong with affecting grizzly bears, the groups said the pipeline could also harm Ute Ladies’ tresses orchid, lynx and yellow-billed cuckoo, which are also on the endangered species list. The groups also say wolverine, a proposed species for listing, could be in the area.\nAbout 26 miles (40 -kilometer) of the pipeline crosses private land and about 4 miles (6 kilometers) crosses state land.", "url": "https://apnews.com/4bca8bf6ab8f258a24eea5037cc6dc8f"}