{"authors": ["Scottie Andrew"], "date_download": "2020-05-04 16:08:58", "date_modify": "2020-05-04 16:08:58", "date_publish": "2020-04-02 18:42:42", "description": "Mice, unlike most people, cannot force a smile or disguise their disgust (as far as we know). Most of us may not have realized that their tiny, fuzzy faces can muster an emotional expression at all.", "filename": "2020_04_02_world_mice-facial-expressions-scn-trnd_index_1588608538.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402122135-01-mice-facial-expressions-trnd-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_world_mice-facial-expressions-scn-trnd_index_1588608538.html", "title": "Mice make different faces depending on how they feel -- and that could have big implications for us", "title_page": "Mice make different faces depending on how they feel -- and that could have big implications for us - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Mice, unlike most people, cannot force a smile or disguise their disgust (as far as we know). Most of us may not have realized that their tiny, fuzzy faces can muster an emotional expression at all.\nBut a group of German neurobiologists have proven mice can, in fact, express emotions -- and they play out all over their petite faces. The researchers say that analyses of rodent brains in mid-emotional reaction could improve the ways we treat human patients with mood disorders\n\"Being able to measure the emotion state of an animal can help us identify the 'how' and 'where' in the brain, and hopefully get hints at how emotions arise in humans, too,\" neuroscientist and study author Nadine Gogolla of the Max Planck Institute of Neurobiology told CNN.\nGogolla and her fellow researchers carried out a series of experiments with emotive mice and linked five emotional states -- pleasure, disgust, nausea, pain and fear -- to their facial expressions.\nThe results, published this week in the journal Science, could advance how we understand emotions -- and they're cute to boot.\nRead More", "url": "https://www.cnn.com/2020/04/02/world/mice-facial-expressions-scn-trnd/index.html"}