{"authors": [], "date_download": "2020-05-04 20:04:40", "date_modify": "2020-05-04 20:04:40", "date_publish": "2020-02-05 07:13:33", "description": "AVALANCHE OF ISSUES TAKES OUT IOWA PLAN FOR HIGH-TECH CAUCUS DES MOINES, Iowa (AP) - The Iowa Democratic Party’s deployment of a smartphone app to speed up the process of reporting results...", "filename": "_398f9afc5d434e918f2e64f48a9dfe5a_1588622680.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_398f9afc5d434e918f2e64f48a9dfe5a_1588622680.html", "title": "AM Prep-Cyber Corner", "title_page": "AM Prep-Cyber Corner", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "AVALANCHE OF ISSUES TAKES OUT IOWA PLAN FOR HIGH-TECH CAUCUS\nDES MOINES, Iowa (AP) - The Iowa Democratic Party’s deployment of a smartphone app to speed up the process of reporting results at Monday’s caucuses was tainted by secrecy, insufficient training, user error, and technical glitches. Some election security experts had warned that the party’s plan to deploy unproven technology to collect results for the caucuses was risky given the high stakes involved. And those concerns were borne out. The party picked a tech startup firm with ties to Democratic politics to develop the app and kept its identity secret until Tuesday. Party leaders failed to train some organizers on how to use the app, and a coding error resulted in irregularities in the reported results that prompted the party to move to a back-up system.\nTWITTER TO LABEL ALTERED MEDIA, REMOVE IF IT MAY CAUSE HARM\nSAN FRANCISCO (AP) - Twitter will begin to label, and in some cases remove, doctored or manipulated photos, audio and videos that are designed to mislead people. The company said Tuesday that the new rules prohibit sharing synthetic or manipulated material that’s likely to cause harm. Material that is manipulated but isn’t necessarily harmful may get a warning label. Deciding what might cause harm could be difficult to define, though. The new guidelines go into effect March 5. Twitter and other technology services are under intense pressure to prevent interference in the 2020 U.S. elections after they were manipulated in four years ago by Russia-connected actors.\nIRISH REGULATOR PROBES GOOGLE, TINDER OVER DATA PROCESSING\nLONDON (AP) - Irish regulators have launched separate inquiries into Google and dating app Tinder over their processing of user data, in a fresh round of regulatory scrutiny aimed at tech companies. Ireland’s Data Protection Commission said Tuesday it decided to look into Google’s handling of location data after a number of consumer groups across the European Union filed complaints. The regulator is also investigating Tinder over issues surrounding U.S. parent company Match Group’s “ongoing processing of users’ personal data” related to Tinder, transparency and compliance with Europe’s strict GDPR privacy rules. Google and Match said they will cooperate with the regulator.\nDISNEY PLUS STREAMER HITS NEARLY 29M SUBSCRIBERS IN 3 MONTHS\nNEW YORK (AP) - The Disney Plus streaming service reached nearly 29 million paid subscribers in less than three months. That’s an impressive start for what Disney has positioned as its future as more people drop cable subscriptions. But Disney says profit fell 23% in its latest quarter to $2.13 billion as it absorbed expenses from starting up the new service. Disney Plus launched in November to compete with online video services like Netflix. Earnings and revenue beat Wall Street forecasts. Disney shares rose more than 1% in after-hours trading.", "url": "https://apnews.com/398f9afc5d434e918f2e64f48a9dfe5a"}