{"authors": [], "date_download": "2020-05-04 15:56:28", "date_modify": "2020-05-04 15:56:28", "date_publish": "2020-04-15 15:05:08", "description": "We have a new iPhone in town, but rather than being a $1,000 successor to the iPhone 11 Pro, it's a sub-$500 iPhone. The long-awaited successor to the iPhone SE, which launched in 2016 and has since been discontinued, is here.", "filename": "2020_04_15_cnn-underscored__cf0f52bc082e6cca4bb5678221800bc1_index_1588607788.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200415105532-underscored-iphone-se-second-generation-announcement-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_15_cnn-underscored__cf0f52bc082e6cca4bb5678221800bc1_index_1588607788.html", "title": "Apple iPhone SE: Guide to pricing, preorders and more", "title_page": "Apple iPhone SE 2: Price starts at $399 with preorders available Friday - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "We have a new iPhone in town, but rather than being a $1,000 successor to the iPhone 11 Pro, it's a sub-$500 iPhone. The long-awaited successor to the iPhone SE, which launched in 2016 and has since been discontinued, is here.\nAnd here's the best part about the second-generation iPhone SE: It starts at just $399 for an unlocked 64GB model. It will also ship in 128GB and 256GB models at $449 and $549, respectively. It will be launching on April 24th with pre-orders beginning this Friday, April 17th. You can pick from black, white or PRODUCT(RED).\nWhile there will be unlocked vesions, you can get variants for AT&T, T-Mobile and Verizon. There will also be monthly plans from those carriers and a few options directly from Apple, including the iPhone Upgrade Program.\nThe iPhone SE is just the latest addition to the iPhone family. It's joining the iPhone XR, 11, 11 Pro and 11 Pro Max. The iPhone 8 and 8 Plus are no longer being sold by Apple, effective immediately. So here's what Apple's latest lineup consists of:\nWe'll be going hands-on with the new iPhone as soon as humanly possible, but in the meantime, let's explore what's new.\nA similar design\nYou might have deja vu with more than just the name, being as it's similar in size to the iPhone 8 (which, along with the 8 Plus, are no longer being sold by Apple), but this isn't an exact replica. It's a similar story to the original iPhone SE that had the body of an iPhone 5S, but the hardware of an iPhone 6.\nThe 2nd iPhone SE is made out of aluminum with a glass back. It's about the size of an iPhone 11 Pro, but it's not all screen. There are bezels on all sides and a home button with Touch ID (2nd Gen) sitting below the 4.7-inch Retina HD display. This is an LCD display versus an OLED, but it should still deliver a vibrant and sharp screen with support for wide color gamut. There's also haptic touch built-in for easy shortcuts in iOS.\nA13 Bionic is on-board the iPhone SE\nPowering the 2nd Gen iPhone SE is the Apple-made A13 Chip complete with a Neural Engine and an Image Signal Processor. That's the same chip that powers the iPhone 11, 11 Pro and 11 Pro Max, so you can expect iOS 13.4 to run with the same pep -- and mind-numbingly quick compared to the previous iPhone SE. Apple is saying that it's a 2.4x increase over the CPU in direct comparison and a 40% increase with the CPU over the iPhone 8. So it's safe to say it should feel as fast as the iPhone 11 family. Plus it will support Apple Pay, along with Express Transit Card. This way you can use select transit systems, like the NYC subway, with just a tap of your iPhone — even if your phone is dead.\nPortrait Mode is here\nOn the back of the phone, you'll find a standard 12-megapixel wide camera paired with an LED flash. No two-camera setup here, but Apple is enabling portrait mode for people through software magic. You'll get Live Photos, Smart HDR and even the ability to record in up to 4K video at 60 frames per second. We're excited to put this to the test, especially to see how it compares to other affordable smartphones like the Galaxy A50 from Samsung and even the iPhone XR or 11, which sit at the higher end of the affordable phone spectrum.\nBetter yet, the front-facing 7-megapixel camera will also support Portrait Mode for People. And whether you're shooting with the front or back you'll be able to adjust the depth, the lighting and even use the different Portrait Mode styles. That means all the fun of high-key mono (an effect we loved on the 11 and 11 Pro) will be here.\nThe one port is a Lightning connector, which means the headphone jack is not coming back. You can charge via a cable, but the iPhone SE also supports Qi-wireless charging. Additionally, while Apple is only including a 5-watt charger in the box you can buy an 18-watt charger and fast-charge the iPhone SE.\nApple is saying the iPhone SE should last a full day and is on-par with the battery used in the iPhone 8. Keep in mind that the A13 Bionic is known for efficiency, and should help this iPhone to last a full day. With an LCD display that's smaller than the one on the iPhone 11, we're eager to see just how far we can push this device.\nThe iPhone SE is a great deal\nSo there's a new iPhone in town. It packs more value than the iPhone 8 and the previous SE and comes packed with nice hardware. Plus, the $399 iPhone SE has a home button and Touch ID, if you prefer them. And to make your money stretch further, cases for the iPhone 8 should fit the 2nd Ge iPhone SE, as well. Apple will also be releasing a collection of leather and silicone cases. Leather will come in black, midnight blue and PRODUCT(RED), while Silicone will be black, white and pink sand.\nWe're eager to get our hands on it and put it to the test, so stay tuned for a full review. But if you're already sold, the 2020 iPhone SE is available for this Friday. We'll have an updated iPhone buying guide, accessory roundups and more in the next few hours — so stick with us.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/15/cnn-underscored/apple-iphone-se-second-gen-pricing-features-orders/index.html"}