{"authors": [], "date_download": "2020-05-04 20:04:28", "date_modify": "2020-05-04 20:04:28", "date_publish": "2020-04-07 20:26:37", "description": "ROCHESTER, Ind. (AP) — The National Transportation Safety Board said Tuesday that a northern Indiana school district is partially to blame for a 2018 crash that killed three siblings crossing a...", "filename": "_bc69c839fa5ebe620e65ff5610854a20_1588622668.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bc69c839fa5ebe620e65ff5610854a20_1588622668.html", "title": "NTSB: School district shares blame for crash that killed 3", "title_page": "NTSB: School district shares blame for crash that killed 3", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ROCHESTER, Ind. (AP) — The National Transportation Safety Board said Tuesday that a northern Indiana school district is partially to blame for a 2018 crash that killed three siblings crossing a rural highway to reach their stopped school bus.\nThe wreck was caused by a pickup truck driver’s failure to stop for the school bus, despite the vehicle’s activated and clearly visible warning lights and stop arm, and a road warning sign for the upcoming school bus stop, the NTSB said in part of its final report into the Oct. 30, 2018, crash near Rochester.\nHowever, contributing to the cause of the crash was the Tippecanoe Valley School Corp.’s inadequate safety assessment of school bus routes, resulting in a prevalence of bus stops that required students to cross high-speed roadways, the NTSB said.\nThe agency also found there was no clear policy established by the district for school bus drivers to follow in determining when it was safe to signal students to cross a roadway.\nThe crash killed 6-year-old twin brothers Xzavier and Mason Ingle, and their 9-year-old sister, Alivia Stahl. A fourth child, 11-year-old Maverik Lowe, suffered critical injuries.\nThe pickup’s driver, Alyssa Shepherd of Rochester, was convicted in October of reckless homicide, criminal recklessness and passing a school bus, causing injury. She was sentenced to four years in prison, though she is appealing her convictions.\nAuthorities have said the students were waiting for the bus on the opposite side of the road. After being signaled by the driver to cross, the four students entered the roadway and were struck by Shepherd’s truck.\nAt the time of her arrest, Shepherd, 25, told authorities she didn’t realize that she was approaching a stopped school bus, despite the activated stop arm and flashing lights. Court documents show Shepherd told police she saw the lights but didn’t recognize the vehicle as a school bus until the children were right in front of her.\n“When our school-aged children walk out the door to meet the school bus in the morning, parents have the right to know that everything possible is being done for their safety,” NTSB Chairman Robert Sumwalt said. “This crash tells us that we can and should do more.”\nThe school corporation issued a statement saying it “has implemented a transportation safety review committee” that meets regularly.\nAs a result of its investigation, the NTSB has issued safety recommendations to the National Highway Traffic Safety Administration, the Tippecanoe Valley School Corp., the Indiana Department of Education and other entities.\nThe partial report is available at online . The full final report is expected to be published online in the coming weeks.", "url": "https://apnews.com/bc69c839fa5ebe620e65ff5610854a20"}