{"authors": ["Toni Gilpin", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Aidan Harper", "Paul Prescod", "Joe Demanuelle-Hall", "Dan Dimaggio", "Joe Evica"], "date_download": "2020-05-04 19:49:26", "date_modify": "2020-05-04 19:49:26", "date_publish": "2020-03-07 00:00:00", "description": null, "filename": "2020_03_labor-movement-long-deep-grudge-united-farm-equipment-workers_1588621766.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/07164528/GettyImages-1188682892-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_labor-movement-long-deep-grudge-united-farm-equipment-workers_1588621766.html", "title": "“The Labor Movement Needs to Learn Its History”", "title_page": "“The Labor Movement Needs to Learn Its History”", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "TG\nAfter college, I went to Yale to study labor history with David Montgomery, who was the preeminent American labor historian, and I was fortunate to be among a cohort who were reinvigorating that field and looking at labor history and working-class history from the bottom up.\nWhile I was there, the clerical workers at Yale underwent an organizing drive and then a strike, so I got very involved in that. That’s how I met my husband, who was in law school then. And so not only was I studying labor history while at Yale, but I was actually getting to witness it. That was a really important strike for women workers, for university workers. My husband and I ended up coauthoring a book about the Yale strike, along with two other academics from Yale.\nWatching that rank-and-file organizing drive informed what I knew about organizing and labor history, but that was one of the few, or maybe only, labor victories in my young life. I also was in graduate school during the PATCO [Professional Air Traffic Controllers Organization] strike, when it became markedly obvious that the labor movement was really in deep trouble.\nAfter that, we’re talking about the ’90s when the labor movement was continuing its precipitant decline. I had written a dissertation about the FE, and I believed that its story was really relevant for understanding what had happened and why the movement had declined. But it didn’t seem as though there was that much of an audience for that story at the time, when the labor movement was seemingly in free fall, during the Reagan era and then the Clinton era.\nIt was only during the second Obama administration, with the Bernie campaign and the beginning of some revival of the labor movement, that we saw a renewed interest in socialism. It just was fortuitous that there was an audience for this story about the farm equipment workers and the lessons that it can bring to those who are looking to figure out how to further revive and reinvigorate the labor movement today.", "url": "https://jacobinmag.com/2020/03/labor-movement-long-deep-grudge-united-farm-equipment-workers"}