{"authors": [], "date_download": "2020-05-04 20:03:47", "date_modify": "2020-05-04 20:03:47", "date_publish": "2020-03-03 19:43:42", "description": "DYLAN FARROW BLASTS UPCOMING WOODY ALLEN MEMOIR NEW YORK (AP) — An upcoming memoir by Woody Allen is being blasted by daughter Dylan Farrow, who called it “deeply upsetting” and criticized...", "filename": "_60571db2ee05462f96da48f54f8d6b22_1588622627.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_60571db2ee05462f96da48f54f8d6b22_1588622627.html", "title": "PM Prep-Segue", "title_page": "PM Prep-Segue", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DYLAN FARROW BLASTS UPCOMING WOODY ALLEN MEMOIR\nNEW YORK (AP) — An upcoming memoir by Woody Allen is being blasted by daughter Dylan Farrow, who called it “deeply upsetting” and criticized the publishing house for putting it out. Farrow has alleged that Allen molested her as a child in the early 1990s. Allen has denied any wrongdoing, and he was never charged after two separate investigations. Grand Central Publishing, a division of Hachette Book Group, said the book is called “Apropos of Nothing.” Allen’s agreement with Hachette means he shares a publisher with one of his biggest detractors, his son Ronan Farrow, whose “Catch and Kill” was released by the Hachette division Little, Brown and Company.\nDOMINGO’S NAME REMOVED FROM WASHINGTON OPERA PROGRAM\nWASHINGTON (AP) — Plácido Domingo’s name has been removed from the Washington National Opera’s young artist program. The opera house says the move came “in light of recent developments.” Domingo was the leading figure at the WNO from 1996-2011 as artistic director and later general director. He created the young artists program in 2002 and it was named the Domingo-Cafritz Young Artist Program after him and The Morris and Gwendolyn Cafritz Foundation. The American Guild of Musical Artists says its four-month investigation had found the 79-year-old singer had “engaged in inappropriate activity, ranging from flirtation to sexual advances, in and outside of the workplace.”\nKNICKS SPIKE SPECULATION THAT DIRECTOR LEE WAS EJECTED\nNEW YORK (AP) - Spike Lee still has his courtside seat, though the New York Knicks had to tell their superfan to find another way to get there. Lee says he won’t be sitting there the rest of this season, anyway. The Oscar-winning writer-director told ESPN on Tuesday that he wouldn’t be attending another Knicks home game this season after a disagreement with Madison Square Garden officials a night earlier over which elevator he could use. A video circulated online during the game showing Lee getting frustrated and yelling at Garden security outside an elevator. A Knicks spokesman said Lee had used the wrong entrance.\nFIRST RIDE FEATURING MICKEY MOUSE DEBUTS AT DISNEY WORLD\nORLANDO, Fla. (AP) — The Walt Disney Co. was built on the shoulders of Mickey Mouse. So it may come as a surprise that there has never been a theme park attraction based on the lovable rodent. That’s about to change with the debut of Mickey & Minnie’s Runaway Railway ride on Wednesday at Disney’s Hollywood Studios at Walt Disney World. The ride gives visitors the impression that they are watching a cartoon featuring Mickey and Minnie come to life as the Disney characters look for the perfect place for a romantic picnic and then end up on a train ride on the “Runnamuck Railroad.”\nMUSICALS ‘& JULIET,’ ‘DEAR EVAN HANSEN’ SEEK OLIVIER AWARDS\nLONDON (AP) — Pop-Shakespearean musical “& Juliet” leads the race for Britain’s Olivier theater awards. The “Romeo and Juliet”-inspired show has nine nominations, including best new musical. Trevor Nunn’s revival of “Fiddler on the Roof” was nominated in eight categories on Tuesday, while Broadway import “Dear Evan Hansen” is up for seven prizes. “Fleabag” creator Phoebe Waller-Bridge is up for two trophies. The one-woman stage version of “Fleabag” is nominated for best entertainment or comedy play, and Waller-Bridge is a nominee for best actress in a play. Best-actor contenders include Andrew Scott, James McAvoy, Toby Jones and Wendell Pierce. The winners will be announced in London on April 5.", "url": "https://apnews.com/60571db2ee05462f96da48f54f8d6b22"}