{"authors": [], "date_download": "2020-05-04 20:14:22", "date_modify": "2020-05-04 20:14:22", "date_publish": "2020-04-15 17:04:52", "description": "FAYETTEVILLE, Ark. (AP) — Vance Jackson and Jalen Tate will join the Arkansas basketball program as graduate transfers, the school announced Wednesday. Jackson, a 6-foot-9, 230-pound...", "filename": "_414587406bb7a50c7d8f5cc816f1edc3_1588623262.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_414587406bb7a50c7d8f5cc816f1edc3_1588623262.html", "title": "Vance Jackson, Jalen Tate to join Arkansas as grad transfers", "title_page": "Vance Jackson, Jalen Tate to join Arkansas as grad transfers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FAYETTEVILLE, Ark. (AP) — Vance Jackson and Jalen Tate will join the Arkansas basketball program as graduate transfers, the school announced Wednesday.\nJackson, a 6-foot-9, 230-pound forward, started his college career by playing a season at Connecticut before playing two seasons at New Mexico. He averages 10.8 points per game for his career.\nAs a freshman at UConn, he started 21 games and was named to the American Athletic Conference All-Rookie Team.\nHe sat out the next year because of transfer rules. In his first season at New Mexico, Jackson averaged 13.1 points and 7.0 rebounds per contest. He was named to the 2019 Mountain West All-Tournament team after averaging 25.5 points per game.\nLast season, he averaged 11.1 points and 5.3 rebounds per game for New Mexico. In a two-game stretch, Jackson had 25 points and 13 rebounds against San Jose State and had 29 points and 13 rebounds against Fresno State.\nTate, a 6-foot-6 guard, played three seasons at Northern Kentucky. Last season, he was the 2020 Horizon League Defensive Player of the Year and MVP of the conference tournament. He averaged 13.9 points, 5.4 rebounds, 3.6 assists and 1.9 steals and was a third-team all-conference pick.\nTate helped the Norse win the Horizon League Tournament title in 2020 and the regular-season championship in 2019. He is a three-time Horizon League All-Defensive Team pick.\n___\nMore AP college basketball: https://apnews.com/Collegebasketball and https://twitter.com/AP_Top25", "url": "https://apnews.com/414587406bb7a50c7d8f5cc816f1edc3"}