{"authors": [], "date_download": "2020-05-04 20:04:54", "date_modify": "2020-05-04 20:04:54", "date_publish": "2020-04-07 17:29:09", "description": "ALAMOGORDO, N.M. (AP) — The New Mexico Supreme Court has upheld a ruling convicting an Alamogordo man of fatally shooting his ex-wife and her boyfriend in 2015. Terrick Thompkins, 39, was...", "filename": "_27a5892402df41ac129dab84dc53c04e_1588622694.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_27a5892402df41ac129dab84dc53c04e_1588622694.html", "title": "New Mexico Supreme Court upholds homicide conviction ruling", "title_page": "New Mexico Supreme Court upholds homicide conviction ruling", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ALAMOGORDO, N.M. (AP) — The New Mexico Supreme Court has upheld a ruling convicting an Alamogordo man of fatally shooting his ex-wife and her boyfriend in 2015.\nTerrick Thompkins, 39, was convicted in May 2018 of first-degree murder after fatally shooting Jessica Thompkins, 30, and her boyfriend Phillip Banka, 33, the Alamogordo Daily News reported .\nTerrick Thompkins was also found guilty of child abuse, aggravated burglary and shooting at an occupied dwelling, a jury said. He was sentenced to the equivalent of life in prison.\nThe shooting happened at a home in March 2015 where Alamogordo Police officers found the couple dead and a boy, 13, with non-life threatening injuries, police said.\nOfficers believe Terrick Thompkins fired seven rounds before entering the home and shooting the couple, police said, adding that the boy was able to climb out the window to get help from a neighbor. At least 32 shell casings were found in the home, authorities said.\nDuring trial, Thompkins testified he was upset after losing custody of his two children to his ex-wife.\nHis attorney argued in court that Thompkins was an Iran and Afghanistan veteran and suffered from PTSD and other health issues.\nThompkins filed an appeal in July 2018. The state Supreme Court rejected the appeal Monday.", "url": "https://apnews.com/27a5892402df41ac129dab84dc53c04e"}