{"authors": ["Oliver Darcy", "Jim Acosta"], "date_download": "2020-05-04 16:04:32", "date_modify": "2020-05-04 16:04:32", "date_publish": "2020-04-01 22:22:43", "description": "The White House Correspondents Association on Wednesday voted to remove One America News, a small right-wing media organization, from the rotation for a seat in the briefing room, an extraordinary rebuke of the network for violating social distancing guidelines put into place to protect the health of its members.", "filename": "2020_04_01_media_oan-far-ri_cbc919f6e9e0017371f264d65e8484e6_index_1588608272.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401175112-01-coronavirus-press-briefing-reporters-0331-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_media_oan-far-ri_cbc919f6e9e0017371f264d65e8484e6_index_1588608272.html", "title": "White House Correspondents Association removes far-right outlet from briefing room rotation", "title_page": "White House Correspondents Association removes far-right outlet from briefing room rotation - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) The White House Correspondents Association on Wednesday voted to remove One America News, a small right-wing media organization, from the rotation for a seat in the briefing room, an extraordinary rebuke of the network for violating social distancing guidelines put into place to protect the health of its members.\n\"We do not take this action lightly,\" the WHCA board wrote in an email to members, notifying them of the decision. \"This is a matter of public safety.\"\nThe decision was made after a fringe personality for the far-right media outlet, Chanel Rion, continued to attend the briefings, in defiance of the WHCA's new rules limiting the number of journalists in the room.\nThe rule recently implemented by the WHCA restricts the number of journalists who can attend the briefings to increase the distance between reporters in the James S. Brady Press Briefing Room.\nRion, who has produced what amounts to pro-Trump propaganda for OAN, attended both Tuesday and Wednesday's briefings, standing in the back of the room.\nRead More", "url": "https://www.cnn.com/2020/04/01/media/oan-far-right-personality-coronavirus-briefing/index.html"}