{"authors": ["Christina Zdanowicz"], "date_download": "2020-05-04 16:55:30", "date_modify": "2020-05-04 16:55:30", "date_publish": "2020-04-09 01:24:38", "description": "In the first criminal allegation against someone in space, the claim that an astronaut improperly accessed her estranged wife's bank account turned out not to be true.", "filename": "2020_04_08_us_nasa-astronau_5c4e180b0ffee7d2ae72e2b3e6d7034b_index_1588611330.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190620170728-nasa-anne-mcclain-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_us_nasa-astronau_5c4e180b0ffee7d2ae72e2b3e6d7034b_index_1588611330.html", "title": "Anne McClain's estranged wife charged with lying about space crime allegation", "title_page": "Anne McClain's estranged wife charged with lying about space crime allegation - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) In the first criminal allegation against someone in space, the claim that an astronaut improperly accessed her estranged wife's bank account turned out not to be true.\nProsecutors say Summer Worden lied to federal authorities when she told them her spouse, NASA astronaut Anne McClain, improperly accessed Worden's bank account twice in January 2019 while she was working on the International Space Station.\nWorden was charged with two counts of making false statements to federal authorities, according to a statement this week from US Attorney Ryan Patrick . The indictment was unsealed Monday after a Houston grand jury returned the counts in February.\nThe couple was going through a divorce at the time.\nMcClain told investigators she had accessed the bank account of her spouse while on a six-month mission aboard the ISS, The New York Times reported in August 2019. She said through a lawyer she was dealing with the couple's intertwined finances, the Times reported.\nWorden had provided McClain with login information to the account and McClain's permission to access it had not been revoked on the dates she logged in, according to the indictment.\nWorden, a former Air Force intelligence officer, brought a complaint with the Federal Trade Commission in March 2019 that McClain had committed identity theft, despite not seeing any indication of moved or spent funds, the Times reported.\nThe couple married in 2014, and Worden filed for divorce in October 2018, according to the petition for divorce, after McClain accused her of assault. It was a move Worden contended was part of long-standing attempts by McClain to gain custody of Worden's son. A few months later, McClain went to space, and Worden then discovered the bank account access, the paper reported. Worden denied committing assault and the assault case was later dismissed.\nWorden had multiple USAA bank accounts to which she had granted McClain access by sharing her online login credentials, according to the indictment obtained by CNN. The access was given from at least 2015 to January 31, 2019, when she revoked permission to the accounts, according to the indictment.\nThe divorce was finalized a year later, on January 8, 2020, according to the divorce decree.\nWorden initially told investigators that she had created a private bank account in September 2018 and had reset her bank login information so it could not be accessed by another party, the indictment states.\nBut the indictment alleges that Worden created the account in April 2018 and did not change her password and login until January 2019.\nWorden allegedly made false statements twice, according to the indictment. She allegedly filed the false complaint with the FTC on March 19, 2019, and gave a false statement during an interview with the NASA Office of Inspector General on July 22.\nWorden said she recalled the wrong date of when she opened the account when she initially filed the FTC complaint.\n\"They're trying to send me to prison for five years, which is the penalty, because I mistakenly recalled when I filed this FTC report that I had opened the account in September 2018,\" Worden told CNN by phone Wednesday. \"But in fact, it was April. Then I went back and I made them aware of that.\"\n\"I brought that to the attention of NASA IG investigators,\" she added.\nCNN reached out to McClain's attorney, Rusty Hardin, repeatedly Tuesday for comment. The attorney's office was unable to provide a comment from McClain, as of Wednesday evening.\nWorden is scheduled to appear before a US magistrate judge on April 13.\nThe Department of Justice told CNN that a defense attorney was not assigned to Worden, as of Tuesday. The federal public defender for the district told CNN she had \"no knowledge\" of the case.\nIf found guilty, Worden could face up to five years in prison on each of the two counts and a maximum fine of $250,000, according to the Department of Justice statement.", "url": "https://www.cnn.com/2020/04/08/us/nasa-astronaut-anne-mcclain-estranged-wife-charged-trnd/index.html"}