{"authors": ["Nick French", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Jedediah Britton-Purdy", "Leo Panitch", "Shawn Gude", "Neal Meyer"], "date_download": "2020-05-04 19:54:08", "date_modify": "2020-05-04 19:54:08", "date_publish": "2020-03-13 00:00:00", "description": null, "filename": "2020_03_democratic-socialism-freedom-rights-authoritarianism-capitalism_1588622048.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/13134313/GettyImages-532244580.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_democratic-socialism-freedom-rights-authoritarianism-capitalism_1588622048.html", "title": "Democratic Socialism Is About Freedom", "title_page": "Democratic Socialism Is About Freedom", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIn recent months, Bernie Sanders has faced a barrage of scaremongering about socialism. After a televised debate last month, MSNBC anchor and former Democratic Party operative Chris Matthews raised the specter of revolutionary violence, suggesting that Bernie Sanders would support “executions in Central Park.” (Matthews later resigned.) Donald Trump, speaking at the State of the Union, declared: “Americans are united with the Venezuelan people in their righteous struggle for freedom! Socialism destroys nations. But always remember, freedom unifies the soul.” On March 6, the New York Times got in on the red-baiting action with a story claiming Sanders was an unwitting stooge of Moscow in the 1980s when he promoted sister-city initiatives with the Soviet Union as mayor of Burlington, Vermont. Despite Sanders’s noble intentions, the Times wrote, the Soviets “exploit[ed] Mr. Sanders’s antiwar agenda for their own propaganda purposes.” The clear implication was that Sanders’s socialism led him to aid and abet authoritarian government — a charge the media also pushed while circulating remarks that Sanders once made praising Cuba’s literacy program. The idea that socialism equals tyranny is a very old one. It is given credence by the fact that many twentieth-century governments that claimed the mantle of socialism were repressive regimes. The democratic-socialist tradition to which Bernie Sanders, Martin Luther King, and Eugene Debs belong, however, has nothing to do with authoritarian rule. Democratic socialism is about expanding freedom and democracy — liberating us from the tyranny that permeates everyday life under capitalism.\nCapitalist Unfreedom Capitalism is an economic system with a distinct set of property relations. A small group of people (capitalists) own what Marx called the “means of production” — the land, buildings, machines, and raw materials necessary to produce useful things. The vast majority (workers) do not — they sell their labor to capitalists for a wage, and the capitalist directs them to produce certain goods, which are then sold on the market. After paying wages and purchasing whatever else they need to replenish the means of production, capitalists keep a share of the revenue they make as profits. On the surface, relations between workers and capitalists are free and equal. Workers voluntarily sell their labor to employers and can bargain for a higher wage or turn down their boss’s offer. But even cursory reflection reveals that most workers are not really free to rebuff their employer: the vast majority of people must work in order to obtain life’s necessities. If they don’t, they’ll go without food, housing, clothing, medicine, and other things necessary for a decent life. But wait, can’t workers find a better employer? In theory, yes. Many workers, however, do not have the time and ability to seek out a better job — taking time off may mean missing a rent payment or being unable to feed one’s family. And even if workers do have the flexibility to look for better offers, they are unlikely to find any. Capitalists compete with each other to maximize profits, so every firm tries to get as much work out of its employees for as little money as possible. Unless a worker is lucky enough to have rare or especially valued skills, they will face a host of equally dismal job offers from stingy employers. Employers, on the other hand, benefit from having a massive pool of unemployed or underemployed workers, many willing to accept whatever they can get (what Marx called the “reserve army of the unemployed”). Workers fortunate enough to land a job then find themselves subject to the tyranny of the workplace. As Micah Uetricht and Barry Eidlin wrote in 2018: Employers can limit what people can and cannot say at work, or where and when they assemble. They can intrude into people’s private lives, monitoring their private correspondence and keeping tabs on their non-work activities, or limit their breaks, including where and when they can use the bathroom. With few exceptions, employers are under no compulsion to guarantee due process to those they employ. They can largely hire, fire, and discipline workers at will. The threat of starvation forces workers to seek employment; once employed, they spend most of their waking hours under the boss’s domination. That is why radicals have long described the plight of the worker as one of wage slavery. Capitalists loom large even in the lives of those who don’t work for them. Business owners and investors unilaterally decide whether to continue production or move a factory or office abroad — and force the rest of us to live with the consequences. Pharmaceutical companies refuse to develop badly needed antibiotics and antiviral medicines. Real estate investors evict and displace working-class residents from their neighborhoods so they can build luxury condos. The most dramatic example of capitalists deciding everyone else’s fate is climate change: a handful of fossil-fuel companies are sending us careening toward crisis. Rather than fostering democracy, capitalism is a system where a handful of billionaires and CEOs are allowed to imperil the planet in order to ensure healthy returns on their investments.\nMyths of Capitalist Freedom and Democracy Capitalism necessarily involves an absence of democratic control and unfreedom for the vast majority of people. So how do pundits and politicians get away with equating capitalism with freedom and democracy? A few fundamental myths support these associations. One is that workers always have the freedom to quit their job or find a new one — a kind of freedom, as I noted above, that isn’t worth the name. Defenders of capitalism also often insist that workers who want better jobs can improve their situation through acquiring new skills. But this retort ignores reality, too. While Americans have long cherished the idea that the United States is a land of equal opportunity and unparalleled social mobility, whether a person graduates high school or can attend a top college is largely a function of race and class. And what kind of job a person ends up with is largely shaped by what jobs their parents had. Another sustaining myth is that, while capitalists may enjoy immense economic power, they don’t have inordinate political power. “One person, one vote” gives everyone an equal say in shaping society through democratic elections. Pay attention to contemporary politics for just a moment, and you will see that this is a lie. Far from a neutral arbiter of competing ideas or interests, liberal democratic states systematically support the business class over the working class. There are three main reasons for this. One is that most elected officials and top bureaucrats are drawn from the ranks of the ruling class, and so are most likely to adopt the worldview and promote the interests of that class. Another is that capitalists can use their wealth to wield massive financial power over the state. They hire armies of lobbyists to influence legislators, use their ownership of media to shape the public narrative, and purchase loyalty through huge campaign donations. If you’re rich enough, you can use your personal fortune to buy your way to public office (or at least put yourself in contention). Worse still, when working-class forces overcome their financial disadvantage and elect sympathetic politicians, owners and investors can use the capital strike — withholding investment and tanking the economy — to undermine support for pro-worker policies and governments. Even the mere threat of a capital strike can reverse progressive measures, as Amazon showed last year when it bullied the Seattle City Council into repealing a tax to support the homeless.", "url": "https://www.jacobinmag.com/2020/03/democratic-socialism-freedom-rights-authoritarianism-capitalism"}