{"authors": [], "date_download": "2020-05-04 20:15:10", "date_modify": "2020-05-04 20:15:10", "date_publish": "2020-04-08 18:24:06", "description": "INDIANAPOLIS (AP) — More than 200 Indiana cities, towns and counties have been awarded a combined $126.5 million in state matching funds to help them tackle local road and bridge projects....", "filename": "_92375e72563327399a930784da9a0938_1588623310.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_92375e72563327399a930784da9a0938_1588623310.html", "title": "Indiana awards $126M for local road and bridge projects", "title_page": "Indiana awards $126M for local road and bridge projects", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "INDIANAPOLIS (AP) — More than 200 Indiana cities, towns and counties have been awarded a combined $126.5 million in state matching funds to help them tackle local road and bridge projects.\nGov. Eric Holcomb and Indiana’s transportation commissioner announced the funding for 214 municipalities on Tuesday.\nThe money comes from fee increases on heavy-duty commercial vehicles that use the Indiana Toll Road. To date, a transportation funding program created by a 2017 state law has provided more than $738 million in state matching funds for construction projects.\nHolcomb said that funding program is allowing Indiana communities “to take on more needed road work and do it in record time.”\nThe Indiana Department of Transportation accepts applications for the funding in both January and July, with a $1 million cap annually per community. An estimated $100 million will be available for communities that apply during the July 2020 call for projects, INDOT said.\nTo qualify, local governments must provide local matching funds, 50 percent for larger communities or 25 percent for smaller communities, from a funding source approved for road and bridge construction.", "url": "https://apnews.com/92375e72563327399a930784da9a0938"}