{"authors": ["Brian Stelter", "Cnn Business"], "date_download": "2020-05-04 16:25:15", "date_modify": "2020-05-04 16:25:15", "date_publish": "2020-04-07 05:05:09", "description": "Once a week, I want to showcase some sources of inspiration, examples of media and tech industry creativity amid crisis, and general reasons to cheer at an otherwise devastating time.", "filename": "2020_04_07_media_media-comp_2d8db119350e441f6e23652de0b6a8f2_index_1588609515.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407010209-what-day-is-it-wjw-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_media_media-comp_2d8db119350e441f6e23652de0b6a8f2_index_1588609515.html", "title": "'What Day Is It?' and other ways media companies are getting creative amid the pandemic", "title_page": "'What Day Is It?' and other ways media companies are getting creative amid the pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) A version of this article first appeared in the \"Reliable Sources\" newsletter. You can sign up for free right here.\nOnce a week, I want to showcase some sources of inspiration, examples of media and tech industry creativity amid crisis, and general reasons to cheer at an otherwise devastating time. So here's the latest list, focusing on the media world, since that's my beat.\n-- It all went down on John Krasinski's YouTube show, \"Some Good News,\" which is quickly becoming one of the breakout hits of the shutdown... Sunday's episode featuring \"Hamilton\" has already topped 4 million views...\n-- The stage production of \"Fleabag\" is coming to Amazon for charity, Sandra Gonzalez reports...\n-- Many media companies are supplying resources for newly home-schooled kids and their parents. Here's one great resource, from National Geographic, full of \"quizzes, videos, science experiments, and even at-home classroom resources...\"\n-- Facebook and Instagram are working with the Small Business Association to make sure owners and operators know about loan options...\n-- Apple has sourced 20 million N95 masks for hospitals, and now it is ramping up to produce one million face shields for medical workers per week...\n-- From newsletter subscriber Eric Smillie: The Design at Indeed publication \"created a set of peaceful video conference backgrounds to brighten people's days now that we're spending so much time on calls...\n-- \"Sunday Today\" featured \"good deeds\" by model citizens like Sue, who is helping keep the Stop and Shop in West Islip, NY, functioning for customers...\n-- CBS News correspondent Steve Hartman is teaching Kindness 101 , an online course for kids about courage, character and other values...\n-- WJW, the Fox affiliate in Cleveland, went viral last week with a new public service segment: \"What Day Is It?\" Todd Meany has the daily report for those who have lost track of time. Here is Monday's installment...\n-- Disney Animation is releasing a new digital series, \"At Home with Olaf,\" \"created at home by Hyrum Osmond. Voiced from home by Josh Gad...\"\n-- America's late-night shows are all \"Quarantine TV\" now, and the shows are incredibly creative...\n-- The Guardian's weekly newsletter The Upside is finding \"silver linings, survivor stories and funny interludes\" during this pandemic...\n-- And last but not least, CNN's weekly \"Good Stuff\" newsletter, about the better things in life, is more essential than ever...\nThe Furlough Fund", "url": "https://www.cnn.com/2020/04/07/media/media-companies-coronavirus-reliable-sources/index.html"}