{"authors": [], "date_download": "2020-05-04 16:04:07", "date_modify": "2020-05-04 16:04:07", "date_publish": "2020-04-01 22:01:17", "description": "If you're a frequent Costco shopper either in-store or online, you'll find the Costco Anywhere Visa by Citi offers decent cash back rewards, but with a few quirks.", "filename": "2020_04_01_cnn-underscored_costco-credit-card-review_index_1588608247.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401133219-underscored-costco-wholesale-store-exterior-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_cnn-underscored_costco-credit-card-review_index_1588608247.html", "title": "Costco Credit Card Review: Cash Back at Costco", "title_page": "Costco Credit Card Review: Cash Back at Costco - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Story highlights The Costco Anywhere® Visa Card by Citi offers strong rewards when buying gas, along with purchases at restaurants, travel and Costco.\nThe card has no annual fee, but it does require you to have a Costco membership.\nYou receive your rewards once per year, but have the option to redeem your rewards certificate for cash.\nCNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through The Points Guy affiliate network if you apply and are approved for a card, but our reporting is always independent and objective.\nOur quick take: If you're a frequent Costco shopper — either in-store or online — and have high gas, restaurant and travel expenses, you'll find that the Costco Anywhere Visa® Card by Citi offers a decent cash back rewards program for your shopping needs.\nPros:\nEarn 4% cash back on eligible gas purchases for the first $7,000 per year (1% thereafter).\nEarn 3% cash back on restaurants and eligible travel.\nEarn 2% cash back on all other purchases from Costco.\nPurchase protection and extended warranty coverage.\nNo foreign transaction fees.\nNo annual fee.\nCons:\nNo sign-up bonus.\nNo travel protection or luxury travel benefits.\nYou receive your cash back rewards once per year.\nCash back rewards expire.\nMust have a Costco membership to get the card.\nCurrent sign-up bonus: None.\nBest for: Costco members who want strong rewards when buying at Costco and filling up their gas tank.\nDigging into the Costco credit card\nMost store credit cards don't provide much value. Typically, the category bonuses are limited to that specific store, the ways you can redeem your rewards are limited and the overall perks are sub-par.\nBut that's actually not the case for the Costco Anywhere Visa Card. This card offers strong rewards for Costco purchases and even higher rewards at restaurants, and on eligible travel and gas purchases. Although you receive your cash back in the form of a Costco rewards certificate, you have the option to opt for actual cash — a rarity for store credit cards.\nAdvantages of the Costco credit card\nThe biggest perk of the Costco Anywhere Visa card is the rewards you'll earn on many practical purchases. With this card, you'll get 4% cash back on eligible gas purchases worldwide, including gas at Costco (capped at the first $7,000 in purchases per year, then 1% thereafter). You'll also earn 3% cash back at restaurants and on eligible travel purchases, 2% cash back on all Costco and costco.com purchases other than gas and 1% cash back on everything else.\nA 4% return on gas makes this card a top contender compared to many other highly-ranked credit cards. In fact, it's one of the best cards in the market for those looking for cash back when filling the tank — especially since the card doesn't carry an annual fee. And let's not forget that this includes Costco gas, which is typically less expensive than many other gas stations in the same local area.\nEarn 4% cash back on gasoline purchases, both at Costco and other gas stations.\nThe 3% return on restaurants and eligible travel purchases is also quite decent, especially if you're looking for cash back. There are other cards that could potentially give you a higher return, but they're mostly travel rewards cards, such as the Chase Sapphire Reserve.\nRelated: Is the Chase Sapphire Reserve worth the increased annual fee?\nYou'll also find that the Costco Anywhere Visa card offers strong protection benefits, such as purchase protection and extended warranty coverage.\nAlthough Costco already has a very favorable return policy where you can return almost anything you've ever purchased for a full refund, it doesn't apply to electronics and major appliances, which only have a 90-day return window. That makes the extended warranty coverage a great benefit, since you'll get two additional years on the manufacturer's warranty, for purchases at Costco and any other retailer.\nWith the purchase protection benefit, you'll be covered if your item is damaged or stolen within 120 days of purchase (90 days for New York residents), as long as you've paid for the item with your Costco Anywhere Visa. The coverage is good for up to $10,000 per item and $50,000 annually, which is a surprisingly high reimbursement cap for a credit card with no annual fee.\nFinally, while you likely don't have travel on your mind at the moment, since this card also has no foreign transaction fees, you can use it if you decide to travel out of the country once the travel industry recovers from current events.\nDisadvantages of the Costco credit card\nAlthough the Costco Anywhere Visa card has no annual fee and carries strong rewards and benefits — which is a rare find — you do have to have a Costco membership to get it, which starts at $60 per year. That means if you don't normally have a Costco membership, you'll need to think of this card as having a $60 annual fee.\nThe Costco credit card also doesn't offer a sign-up bonus, and you have to wait a full year to receive your rewards, as you get your rewards in the form of an annual certificate issued each February after your billing statement closes that month. You also only have until December 31 of that year to redeem your rewards — they'll expire if you forget to use them.\nWhile it's sometimes nice to get a large check at once if you want to treat yourself to something big, many people would prefer to receive their rewards more often throughout the year. So if you're looking to get a return on your credit card right away, this is not the card for you.\nOnce you receive your annual certificate, it can be exchanged for cash — instead of only being used only towards Costco purchases. But you'll have to physically go to your local Costco to swap it for cash. This involves an extra step and means you have to have a Costco store in close proximity.\nYou'll need to trek to a physical Costco store to exchange your rewards certificate for cash.\nLastly, you'll only earn a 2% return on Costco purchases and 1% on all other purchases that aren't covered by one of the card's bonus categories. CNN Underscored's benchmark credit card, the Citi® Double Cash Card, earns 2% cash back on every purchase you make — 1% when you buy something, and another 1% when you pay it off.\nThis makes the Costco credit card not very valuable for everyday spending, though since Costco stores themselves only take Visa credit cards, you wouldn't be able to use the Citi Double Cash in-store as its a Mastercard. But you can use it at costco.com, which does accept cards other than Visa.\nStacking up the Costco credit card against our benchmark\nCNN Underscored has chosen the Citi Double Cash Card as our \"benchmark\" credit card. That doesn't mean it's the best credit card on the market — rather, it means we use it as a basic standard to compare other credit cards and see where they score better, and where they're worse.\nHere's how the Costco Anywhere Visa scores against our benchmark. The features of each card in the below chart are colored in green, red or white. Green indicates a card feature that is better than our benchmark. Red indicates the feature is worse than our benchmark, and white indicates the feature is either equivalent or cannot be directly compared to our benchmark.\nWhen reviewing other credit cards, we use this format and these criteria to compare them with our benchmark. You can read our credit card methodology for more details on what we take into account when it comes to perks, protections and redemption value.\nOther credit cards similar to the Costco credit card\nIf you're looking for a credit card that offers solid rewards on all your purchases without having to worry about bonus categories, a card to consider would be the Citi Double Cash. With the Citi Double Cash, you'll earn a 2% return on all purchases — 1% when you buy something, and another 1% when you pay it off — although the card doesn't offer the same purchase protection or extended warranty coverage as the Costco Anywhere Visa.\nRelated: Read CNN Underscored's complete review of the Citi Double Cash Card.\nYou also might consider the Chase Freedom Unlimited card, which actually only earns 1.5% cash back on all purchases. However, if you pair it with a premium Chase Ultimate Rewards credit card such as the Chase Sapphire Preferred Card, you can instead redeem those points toward travel at a higher rate or even transfer them to Chase's airline and hotel partners.\nThe Freedom Unlimited also offers purchase protection and extended warranty benefits, although the coverage caps are slightly lower than the Costco credit card. On the travel side though, the Freedom Unlimited offers trip cancellation and interruption insurance, where the Costco credit card removed that benefit last year.\nOn the other hand, if you want a card with similar bonus categories as the Costco Anywhere Visa card, then you might want to consider the Wells Fargo Propel American Express® card. This is also a no-annual fee card, but you won't need to worry about being a Costco member to get it.\nWith the Wells Fargo Propel, you'll earn 3 points for every dollar you spend — equal to 3% cash back — at restaurants and on travel, as well as on rideshares, transit and select streaming services. However, for your Costco purchases, your rewards will be cut in half with the Propel at just a 1% return, and you'll only earn 3 points per dollar at gas stations, where the Costco credit card earns a higher 4% cash back on eligible gas purchases.\nShould you get the Costco credit card?\nThe Costco credit card is best for people with a local Costco and an existing membership.\nFirst and foremost, you should only consider the Costco Anywhere Visa card if you live near a Costco warehouse location, and ideally if you're already a Costco member. If you fit into that bucket, you'll probably find this is one of the better credit cards to use for your gas and restaurant purchases.\nWhile the Costco credit card offers strong rewards on your travel purchases, we recommend using a card that comes with travel protections to book many of your travel activities. You'll also find the Costco card is a good choice for your Costco purchases. Although it earns a return that's similar to many cash back cards, you'll receive strong purchase protection and extended warranty coverage.\nYou'll need to be comfortable waiting to receive your rewards once a year with the Costco credit card instead of on an ongoing basis. But if you're looking for one card that carries many benefits and strong cash back — all for no annual fee — then the Costco Anywhere Visa is definitely a card to consider.\nLearn more about the Costco Anywhere Visa Credit Card.\nNeed to temporarily make ends meet? Find out which cards CNN Underscored chose as our best credit cards with 0% interest on purchases.\nEditorial Disclaimer: Opinions expressed here are the author's alone, not those of any bank, credit card issuer, airlines or hotel chain, and have not been reviewed, approved or otherwise endorsed by any of these entities.\nNote: While the offers mentioned above are accurate at the time of publication, they're subject to change at any time and may have changed, or may no longer be available.", "url": "https://www.cnn.com/2020/04/01/cnn-underscored/costco-credit-card-review/index.html"}