{"authors": ["Dustin Guastella", "Connor Kilpatrick", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul Heideman", "Sam Lewis", "Beth Huang", "Gabriel Winant"], "date_download": "2020-05-04 19:52:03", "date_modify": "2020-05-04 19:52:03", "date_publish": "2020-02-22 00:00:00", "description": null, "filename": "2020_02_bernie-sanders-nevada-caucus-democratic-primary-win_1588621923.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/02/22165447/GettyImages-1202371517.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_02_bernie-sanders-nevada-caucus-democratic-primary-win_1588621923.html", "title": "After the Nevada Blowout, It’s Bernie’s Party Now", "title_page": "After the Nevada Blowout, It’s Bernie’s Party Now", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Bernie Sanders’s crushing victory in the Nevada caucuses today is much more than one giant leap toward the Democratic Party nomination.\nSanders is, of course, the favorite to win at the convention in Milwaukee. But a closer look at the numbers and demographics of the “Silver State” reveals something much bigger — the seeds of a new electorate rising up, and a fundamental realignment of US politics. And a new party, thoroughly working-class and committed to egalitarian politics, quickly blooming up into the husk of the old one.\nWhile recent polls show Trump strengthening his grip on the Rust Belt, Sanders’s victory in Nevada points ahead to a new electoral map which might be the key not only to defeating Trump in November but toward rebuilding a working-class movement in America.\nNevada, unlike Iowa and New Hampshire, isn’t dominated by an older, wealthier, and whiter electorate. Even though it’s a right-to-work state like much of the Sun Belt, it’s a labor stronghold with higher than average union density thanks largely to the mighty Culinary Workers Union representing sixty thousand members, and providing the kind of working-class social mobility that’s all but vanished elsewhere in the United States.\nBut after the economic crash of 2007–8, Nevada was also the state hardest hit by foreclosures and since that time has seen wage growth lower than that of the country at large. In so many ways, it perfectly represents the thwarted social dynamism of the Sanders coalition. Unlike in the affluent metropolitan regions who find comfort both in the absurd platitudes and sneering contemptuousness of Mayors Pete and Mike respectively, Nevadans are immune to the anti-Sanders spell cast by the Democratic Party elite. The need for a left insurgency within the Democratic Party in the Silver State clearly isn’t merely uncontroversial — it’s commonsense.\nWith Latino voters making up a fifth of the Nevada electorate, the state is also home to a large working-class immigrant population concentrated in service sector work. And with Bernie winning these voters (in spectacular fashion) he’s proven that he’s the only candidate that can rebuild a Democratic majority amid the changing electorate. Like the New Deal coalition before him, Sanders’s success has been based largely on his ability to pull in immigrant workers, who are often new voters, in big numbers. And these voters are looking more and more loyal to the political revolution.\nIn fact, on a host of metrics Nevada looks much more like a microcosm of the United States than any contest we have yet seen. Not only in terms of race and ethnic demographics but in terms of political composition.\nConsider that the Silver State has a large number of voters disaffected with the Democratic Party. In the last decade alone the number of self-identified non-partisans — meaning neither Republican nor Democrat — has grown by 89 percent making up over 20 percent of the total Nevada electorate. While those non-partisans can’t vote in Nevada’s closed caucus system, they do reflect a broader trend of voters disgusted by both major parties but endeared toward outsider candidates (like Sanders).\nAnd like the country at large — but unlike the affluent suburbs around DC and New York — Nevadans want big changes. In a Suffolk University Poll from January, 58 percent of potential Democratic Party caucus-goers rated support for Medicare for All as very important for the Democratic nominee, 52 percent rated free university tuition similarly, and a full 61 percent want the Democratic nominee to raise taxes on the wealthy. Those strong majorities are exactly why “President Bernie Sanders” sounds so appealing.\nWhile Trump’s power in the Midwest is undeniable, with Nevada as the harbinger of a new working-class electorate, we’re starting to see how Sanders’s path to the White House might be just as distinct from his rivals as his politics are — the Sun Belt, with Bernie on the ticket, could be in play in a way not seen in decades.\nThe New Deal was made possible with a new electorate. And just as the mass entry into politics of first- and second-generation Eastern European immigrants brought Roosevelt (and the CIO) to power, Latinos — who are solidly behind Sanders — could very well be the force that helps bring social democracy to America.\nBernie’s staunch anti-establishment outsider appeal and his platform focused on workers’ issues is winning non-partisans, new voters, young voters, and working-class immigrants. That’s not just a savvy coalition for winning the Nevada caucuses, it’s how Bernie Sanders becomes president.\nFace it, establishment Democrats — it’s his party now.", "url": "https://www.jacobinmag.com/2020/02/bernie-sanders-nevada-caucus-democratic-primary-win"}