{"authors": ["Lisa Respers France"], "date_download": "2020-05-04 16:01:13", "date_modify": "2020-05-04 16:01:13", "date_publish": "2020-04-01 15:19:52", "description": "The family of an 11-year-old who battled cancer are thanking three of his favorite artists for calling him during his final days with the disease.", "filename": "2020_04_01_entertainment_drake-weeknd-cancer-patient-trnd_index_1588608073.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401084725-drake-weekend-j-cole-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_entertainment_drake-weeknd-cancer-patient-trnd_index_1588608073.html", "title": "Drake, The Weeknd and J. Cole talked to 11 year old dying of cancer", "title_page": "Drake, The Weeknd and J. Cole talked to 11 year old dying of cancer  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The family of an 11-year-old who battled cancer are thanking three of his favorite artists for calling him during his final days with the disease.\nMichael Watson II posted to Instagram this week a video of his cousin Elijah receiving video calls from singer The Weeknd and rapper J. Cole.\n\"Over the past 3 years, my 11 y.o. cousin, Elijah, has battled cancer with the utmost resilience,\" Watson wrote. \"Elijah's physical fight is now complete, as he transitioned to heaven on Friday.\"\n\"He didn't leave this world without knowing how much he was loved,\" Watson wrote. \"Last weekend, Elijah got to \"meet\" 3 of his favorite artists — The Weeknd, J. Cole, & Drake. \"Incredibly grateful for these 3 super-humans being so caring for my family during this time. We'll hold onto these moments forever.\"\nCNN has reached out to representatives for the three artists for comment. The Weeknd's rep confirmed the calls from the singer and rapper J. Cole to CNN.\nRead More", "url": "https://www.cnn.com/2020/04/01/entertainment/drake-weeknd-cancer-patient-trnd/index.html"}