{"authors": ["Sophia Saifi", "Adeel Raja"], "date_download": "2020-05-04 16:05:30", "date_modify": "2020-05-04 16:05:30", "date_publish": "2020-04-02 08:18:06", "description": "A local court in Pakistan on Thursday overturned the death sentence and murder convictions of the four men involved in the killing of US journalist Daniel Pearl in 2002.", "filename": "2020_04_02_asia_daniel-pearl-suspects-intl-hnk_index_1588608330.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/140124165111-rs-daniel-pearl-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_asia_daniel-pearl-suspects-intl-hnk_index_1588608330.html", "title": "Daniel Pearl: Pakistan court overturns convictions in killing of American journalist", "title_page": "Daniel Pearl: Pakistan court overturns convictions in killing of American journalist  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Islamabad, Pakistan (CNN) A local court in Pakistan on Thursday overturned the death sentence and murder convictions of four men believed to be involved in the killing of US journalist Daniel Pearl in 2002.\nThe men had all been in prison for 18 years. Three were handed life sentences. A fourth, British national Ahmad Omar Saeed Sheikh, was awaiting the death penalty\nThe high court in Pakistan's southern province of Sindh vacated Sheikh's murder conviction and reduced his death sentence to a seven-year prison term for kidnapping. His seven-year sentence will now be counted from the time served. It's unclear if all four will be immediately released.\nPearl, who was working as the South Asia bureau chief of the Wall Street Journal, was in Karachi reporting on Pakistani extremists and \"shoe bomber\" Richard Reid when he was kidnapped by militants.\nThe high profile abduction drew international attention, amid growing concern over the threat posed by radical Islamic terrorism. Assailants later filmed his beheading and sent it to US officials. It was among the first propaganda videos targeting hostages created by extremists, and helped to inspire other terror groups to film horrific and egregious acts of violence.\nRead More", "url": "https://www.cnn.com/2020/04/02/asia/daniel-pearl-suspects-intl-hnk/index.html"}