{"authors": [], "date_download": "2020-05-04 20:17:57", "date_modify": "2020-05-04 20:17:57", "date_publish": "2020-04-15 17:52:56", "description": "WICHITA, Kan. (AP) — Wichita State University is seeking to tear down its 74-year-old Cessna Stadium and replace it with a new smaller, multi-purpose stadium. The university has asked the...", "filename": "_97bcc529e9a3af44d0ba454b8e20db43_1588623477.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_97bcc529e9a3af44d0ba454b8e20db43_1588623477.html", "title": "WSU seeks to raze Cessna Stadium, build smaller version", "title_page": "WSU seeks to raze Cessna Stadium, build smaller version", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WICHITA, Kan. (AP) — Wichita State University is seeking to tear down its 74-year-old Cessna Stadium and replace it with a new smaller, multi-purpose stadium.\nThe university has asked the Kansas Board of Regents to allow it to raze the 30,000-seat stadium, the Wichita Eagle reported Wednesday. Cessna is currently home to the Wichita State track and field team and is also home the nation’s largest high school track and field meet.\nUniversity officials say the condition of the amenities in the stadium have deteriorated drastically since the school’s football program was discontinued in 1986.\nThe proposal leaves in limbo what would happen to the Kansas high school state track and field meet, which has hosted around 3,500 athletes for all six championship meets for boys and girls for the last four decades.\nThe proposed smaller stadium would host not only Wichita State’s track and field events, but could also attract high school and club events for soccer, lacrosse and track and field, university officials said.\nWSU estimates it will cost $1.4 million to tear down the building. That money would be raised from private funds and restricted fee funds, officials said.", "url": "https://apnews.com/97bcc529e9a3af44d0ba454b8e20db43"}