{"authors": ["Chad Sokol"], "date_download": "2020-05-04 20:03:44", "date_modify": "2020-05-04 20:03:44", "date_publish": "2020-04-07 00:00:00", "description": "Authorities now say there is definitive evidence a Spokane Valley tattoo artist was not involved in a beating that left a man with fatal head wounds in late December. Prosecutors last week...", "filename": "_62e3a3facc054d29a0e66b41ed9ec4cf_1588622624.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_62e3a3facc054d29a0e66b41ed9ec4cf_1588622624.html", "title": "Deputies arrested wrong man for fatal beating in Spokane Valley; charge permanently dismissed", "title_page": "Deputies arrested wrong man for fatal beating in Spokane Valley; charge permanently dismissed", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Authorities now say there is definitive evidence a Spokane Valley tattoo artist was not involved in a beating that left a man with fatal head wounds in late December.\nProsecutors last week permanently dropped a first-degree assault charge against 38-year-old Joseph R.W. Riley. He was jailed in January on suspicion of beating 40-year-old Daniel G. Jarman, who died days after the attack.\nCpl. Mark Gregory, a spokesman for the Spokane County Sheriff’s Office, said detectives continue to investigate and may have identified another suspect.\n“Through the investigation, they were able to rule out Riley as a suspect. They were able to positively confirm he was not involved,” Gregory said. “We’re looking into another person of interest, and we’re following up on information we’ve received through the investigation.”\nJarman, an Army veteran and father of two, had recently moved to Spokane Valley from Curlew, Washington. He frequented several bars, accompanied by several women, on the night he was attacked.\nThe beating occurred in a parking lot outside Ichabod’s East, 12116 E. Sprague Ave., shortly after the bar closed at 2 a.m. on Dec. 29. Two of those women told deputies they had been accompanied by Riley, too – and that he was the assailant.\nNeither woman initially recalled Riley’s name. Court records indicate one of them looked him up on Facebook before giving his name to a detective. Court records don’t describe any physical evidence linking Riley to the crime scene.\nJarman died at Providence Sacred Heart Medical Center five days after the attack.\nRiley was arrested on Jan. 2, while Jarman was still in the hospital, and charged with first-degree assault. He continues to insist he was at home with his wife and children at the time of the attack.\nRiley spent 13 days in jail before posting a $150,000 bond. Then, in late January, prosecutors moved to drop the charge, citing “potentially exculpatory evidence.”\nA Spokane County Superior Court judge initially dismissed the case “without prejudice,” meaning prosecutors still could charge Riley in connection with Jarman’s death if evidence supported it.\nLast week, however, deputy prosecutor Sharon Hedlund filed another motion, writing “there is now insufficient evidence in this matter.” Judge Raymond Clary granted another order of dismissal – this time, with prejudice.\nIn a phone call Tuesday, Riley said he’s happy the case is behind him, though he still must rebuild trust with friends and clients of his tattoo shop who were stunned by news of his arrest.\n“I feel fantastic. I mean, I’m still in shock that they made the mistakes they did,” Riley said, referring to the sheriff’s office. “My family is extremely relieved, and we’re ready to move on and continue clearing my name through the community, because it’s going to take some time to do that.”", "url": "https://apnews.com/62e3a3facc054d29a0e66b41ed9ec4cf"}