{"authors": [], "date_download": "2020-05-04 16:07:07", "date_modify": "2020-05-04 16:07:07", "date_publish": "2020-03-31 21:47:19", "description": "With all the devices we use on a daily basis, there's one thread that runs through just about every tech thing we do: connectivity. Specifically Wi-Fi — whether we're at home, in a public space like a coffee shop, or in an office, that network is the backbone for our devices. It's how we connect to the world.", "filename": "2020_03_31_cnn-underscored__ccb2780d2794ed0111918b437c47ed1c_index_1588608427.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331165251-1-underscored-routers-mesh-tradational-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_cnn-underscored__ccb2780d2794ed0111918b437c47ed1c_index_1588608427.html", "title": "Best Routers: mesh vs traditional", "title_page": "Best Routers: mesh vs traditional - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "With all the devices we use on a daily basis, there's one thread that runs through just about every tech thing we do: connectivity. Specifically Wi-Fi — whether we're at home, in a public space like a coffee shop, or in an office, that network is the backbone for our devices. It's how we connect to the world.\nAnd currently, there's a good chance your home network is getting a lot of use. With kids home from school taking online classes, college students back in the nest studying (or playing games), and lots of folks working remotely, all those extra devices straining the router can result in a slowdown.\nIf you're using a traditional router, likely one you bought a few years ago or got from your internet service provider, that one device is casting out a network for your whole home. And that's a lot for one piece of equipment to handle, especially if you have a multi-story home or one with many rooms. There's only so much network space to go around. If you're experiencing slowdowns, it could be that there's not enough bandwidth to support all the devices.\nAnd that's where a mesh router can come into play. Essentially, a mesh router is multiple routers that work with each other to cast a wider net over your home. Instead of just one router powering the network for a whole house, you can get a set of two or three. The base one will still live next to where the Ethernet intake comes from the internet service provider, but the second one can go on your main floor and the third on the second floor, giving you much more coverage.\nBut this is just the tip of the iceberg when it comes to routers, and we're not leaving you hanging. Let's dive into just what a mesh router is.\nWhat's the job of a router?\nSimply put, a router is what powers the internet in your home or apartment. It casts the Wi-Fi network so that devices (like your phone, tablet, laptop, TV and smart speakers) can connect to the internet.\nRight now, you might be using a router from your cable company, otherwise known as your ISP or internet service provider. We'd recommend checking your bill to see if you're leasing one and paying monthly for it. There's a chance you might be able to save some money here by buying your own router.\nThat router has an Ethernet cable plugged into the back, which comes from a modem. This last piece is how your home gets connected and is basically the intake for whatever services you use from the cable company. In some cases, it splits up phone, TV and internet from one connection into three separate connections, but we're focusing on the internet in this guide. The modem supplies an IP address from the ISP to the router via an Ethernet cable. The router then disperses the internet, which in turn becomes your Wi-Fi network.\nA traditional router versus a mesh router\nWi-Fi routers\nAs mentioned, a standard router is one device that casts the network for your whole space. A basic or traditional router is enough for many homes, but if you want more visibility into your network and good coverage for an ever-expanding number of devices, a mesh router may be the way to go.\nAfter all, a basic router just casts one network for all those devices to share. So if you have a few phones, a smart speaker and a tablet, along with a TV that's streaming a movie, it can result in a slowdown or bottleneck. That's less than ideal. Separately, depending on where your router is located, it can be a big task for one device to broadcast a network through multiple floors, and cement and brick can be hard for it to pass through.\nA mesh router essentially splits that one router into multiple access points. These points work in tandem with one another to create a larger network with more bandwidth. This way it can deliver a broader net of coverage than a typical router, which may serve your needs much better.\nA lot of companies are getting on the mesh router bandwagon, like Nest Wi-Fi and Eero, which start with mesh routers with just two access points, but offer the option of more access points too. Many of these mesh systems come with an easy-to-use app that makes setup simple, and customization options are still available, so you can make changes that work best for your network.\nAdditionally, you'll want to be aware of the network bands inside. The current standards for network connectivity are 2.4Ghz and 5Ghz; 2.4Ghz is the older one and has the potential to interfere with some other devices that also use that wavelength, while 5Ghz is the more modern one, used by many recent devices to get another band to connect to the internet. Most recent routers will support both of these out of the box, and they can also intelligently choose which band to use with a device. There are dual-band routers (with 2.4Ghz and 5Ghz), as well as tri-band routers, which have a single 2.4Ghz band and two 5Ghz bands inside.\nThe best mesh routers\nWith the basics out of the way, let's look at our recommendations of routers. We'll be updating in the coming weeks with links to our full reviews, as well.\nNest Wi-Fi\nNest W-Fi\nGoogle's second-generation mesh router system brought a name change. Nest W-Fi was announced last fall, and we've already reviewed it. It starts at $167.98 for a single access point, called a puck (because it looks like, um, a puck) and goes up to $269 for two pucks (with the white ones on sale for $199). You can, of course, expand that network with additional access points, but for most people, the two-pack will be just fine.\nThe two Nest Wi-Fi access points will cover up to 4,400 square feet. One of these points will connect to your modem and the other one just needs power and a spot in your house. That second access point will also act as a Google Assistant smart speaker (with microphones built in). Setup is really fast and simple with the Google Home app — it will give you the download on your network, let you customize the name and password, set parental controls and even get into the nitty gritty of networking. As you might expect, it integrates pretty well with the Google ecosystem.\nThere's no subscription pricing to access additional features, and Nest Wi-Fi also comes in some cool hues.\nEero Mesh Wi-Fi\nAmazon eero\nAlso announced last fall was the Eero, the entry-level offering in that brand's line of routers. Similar to Nest Wi-Fi, this works really well with Alexa smart devices, including Echo smart speaker or smart displays. It's also cheaper, on sale now for $79 for one access point (originally $99) or $135 for two.\nThese are a bit smaller than Nest Wi-Fi pucks and have a rounded square design. And no, Alexa isn't built into these. You'll place them in the same way as Nest, with one connecting to your modem via Ethernet and the other simply plugged into a power source. You'll set these up and control them with the Eero app for iOS and Android. It has a really sleek user interface, and it's very easy to get a sense of what's happening on your network. You can see what devices are connected, the amount of data being used and even which node each device is connected to.\nIf you have an Echo smart speaker or smart display, you can ask Alexa for information about your network. Eero also works with Apple HomeKit and is one of the first routers to do so. It will let you manage your Eero from the Home app on iOS or macOS. You can easily add more HomeKit-enabled devices to your network and make sure they can also connect to what they need.\nAnd you can sign up for Eero Secure or Secure+, subscription services that cost $2.99 or $9.99 a month. Both of these give you advanced security features like ad blocking, the ability to block content and more. Secure+ also gives you family accounts to 1Password, Malwarebytes and encrypt.me. It's a solid value.\nEero Pro\nAmazon eero Pro\nIf you want a tri-band setup, Eero has another option. Eero Pro is a bit more expensive, but it packs some serious network chops. Not only do you have a single 2.4Ghz and two 5Ghz bands, but this setup supports faster internet speeds. In fact, each access point can cover 1,750 square feet on its own — that's on par with most traditional routers. Eero pairs a single Pro router with a Beacon, which is a smaller network extender that plugs right into a wall outlet. That combination costs $299, and a set of three Eero Pros goes for $499.\nThat can easily power a home of up to 6,000 square feet and will likely future-proof you for quite some time. It can handle several phones, tablets, TVs, smart speakers, desktop PCs, gaming consoles and laptops with ease. It's a real pro setup that should last for many years. And it packs in the hardware to create a strong network backbone. It's also controlled with the Eero app for iOS and Android, supports Apple's HomeKit, and works with Alexa-enabled smart speakers.\nLet's recap\nIf you're in the market to speed up or physically enlarge your network, or just to give your devices a little more distance between them, a mesh router is a great solution. Chances are you'll notice faster speeds and a more fluid internet experience.\nNote: The prices above reflect the retailers' listed prices at the time of publication.", "url": "https://www.cnn.com/2020/03/31/cnn-underscored/mesh-routers-traditional-comparison/index.html"}