{"authors": ["Reporter"], "date_download": "2020-05-04 20:31:19", "date_modify": "2020-05-04 20:31:19", "date_publish": "2020-04-30 10:32:02", "description": "The model, who was seen out with Jordyn Woods' ex Devin Booker, was called out on Twitter for dating basketball stars.", "filename": "entry_kendall-jenner-nba-dating-tweet_n_5eaad1d9c5b6efb0d33cfab0_1588624279.html", "image_url": "https://img.huffingtonpost.com/asset/5eaad88c240000c6018ea03c.jpeg?cache=o3fdyd0tkv&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_kendall-jenner-nba-dating-tweet_n_5eaad1d9c5b6efb0d33cfab0_1588624279.html", "title": "Kendall Jenner Had The Sauciest Response To A Joke About Her Dating NBA Players", "title_page": "Kendall Jenner Had The Sauciest Response To A Joke About Her Dating NBA Players | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Kendall Jenner wants her haters to know that she’s in “full control.”\nThe 24-year-old model cheekily tweeted on Wednesday in response to Twitter users joking about her being seen with Phoenix Suns point guard Devin Booker.\nOn Wednesday, the “Keeping Up With the Kardashians” star was photographed with Booker ― who previously dated sister Kylie Jenner’s former best friend, Jordyn Woods ― outside of his Maybach at a rest stop. They appeared to be on their way to Sedona, Arizona, according to TMZ.\nShortly after that news made the rounds, a Twitter user shared a mocking tweet featuring imagery of three men throwing a female doll around the room, quipping that the men were players in the NBA and the doll being passed around was Kendall Jenner.\nIn response to the now-deleted tweet, another person wrote, “Maybe she passing them around.” That tweet caught the attention of Kendall Jenner.\n“They act like i’m not in full control of where i throw this cooch,” she wrote.\nthey act like i’m not in full control of where i throw this cooch https://t.co/DOCPKMdW6K — Kendall (@KendallJenner) April 29, 2020\nUnsurprisingly, the sassy retort was overwhelmingly popular with fans, who chimed in to share their support for the reality star:\ndid you just....... maybe we have to stan — matt gehring (@mattryanx) April 29, 2020\nOf course, Kylie Jenner had a response. Initially, it appears she tweeted “love a good cooch throw, but that was quickly deleted. Her declaration that Kendall Jenner’s missive was “tweet of the year” appeared instead.\nlmfao tweet of the year https://t.co/618eopr6UJ — Kylie Jenner (@KylieJenner) April 29, 2020\nPreviously, Kendall Jenner had been connected to Philadelphia 76ers player Ben Simmons, whom she had dated on and off from 2018 until earlier this year.\nBefore that, she was involved with Detroit Pistons’ Blake Griffin.", "url": "https://www.huffpost.com/entry/kendall-jenner-nba-dating-tweet_n_5eaad1d9c5b6efb0d33cfab0"}