{"authors": [], "date_download": "2020-05-04 20:11:32", "date_modify": "2020-05-04 20:11:32", "date_publish": "2020-02-27 07:28:14", "description": "JAIL INMATE ESCAPES BY POSING AS FELLOW PRISONER SALT LAKE CITY (AP) — A case of deliberate mistaken identity has gotten a California inmate free from jail. Authorities in Utah say inmate...", "filename": "_65499e2e7aa84565bfc8ac106a1d77d7_1588623092.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_65499e2e7aa84565bfc8ac106a1d77d7_1588623092.html", "title": "AM-Prep: Kickers", "title_page": "AM-Prep: Kickers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "JAIL INMATE ESCAPES BY POSING AS FELLOW PRISONER\nSALT LAKE CITY (AP) — A case of deliberate mistaken identity has gotten a California inmate free from jail. Authorities in Utah say inmate Kaleb Wiewandt ended up being “released” from lockup Tuesday night — because he pretended to be a fellow inmate whose time had come to be released. Staffers thought Wiewandt was Matthew Belnap, who was to be released that day. And apparently Belnap was in on the ruse. Authorities say he helped Wiewandt shave his head to look like him — and even gave him his inmate ID. After Wiewandt was let go, Belnap went to jail officials, asking why he wasn’t released — and they realized they’d let the wrong guy go. Authorities are looking for the escaped inmate, have charged the other inmate with the deception — and are trying to tighten their release procedures.\nRESCUED JET SKIER LOSES SCOOTER TRYING TO SAVE A BIRD\nPORT RICHEY, Fla. (AP) — A missing Florida jet skier came close to losing his life — trying to save a bird. Cole Torrent says he borrowed a friend’s jet ski Tuesday afternoon — and while he was out, he saw a bird caught in a wire. He says when he docked the jet ski while trying to get the bird free, the watercraft got away. He tried to swim after it but had to abandon that effort because of heavy currents. Torrent ended up taking refuge in a stilt house. Meanwhile, the friend who owned the jet ski alerted authorities — and when the search began, they found the craft, but no sign of Torrent. Once he heard the helicopters the next day, Torrent waved down rescuers and was picked up. He’s fine — and police say he won’t face any charges.\nPILL TRAIL LEADS TO BREAK-IN AT DRUG STORE\nUNDATED (AP) — Some crimes are solved by following a paper trail. Some are solved by investigators following a money trail. In this case, authorities in Florida made quick work of an investigation into a drug store break-in — by following a trail of pill bottles. Two men broke into a CVS in Clearwater on New Year’s Day and made off with more than 10,000 pills of oxycodone and hydrocodone. As they drove away, the men emptied pills from the bottles — and flipped the bottles out the window of the getaway car. That made it easy for police to track down the suspects. When the trail of pill bottles ended, they found the suspects and matched them to images on surveillance video. The two — and a third accomplice — are all under arrest, facing a variety of drug-related charges.\nby Oscar Wells Gabriel II", "url": "https://apnews.com/65499e2e7aa84565bfc8ac106a1d77d7"}