{"authors": [], "date_download": "2020-05-04 20:29:01", "date_modify": "2020-05-04 20:29:01", "date_publish": "2020-04-20 18:09:57", "description": "MONACO (AP) — An athletics agent who was filmed telling undercover reporters he could supply performance enhancing drugs has agreed to a two-year ban in a case that risked implicating Justin...", "filename": "_55074a2f658eb53e20ee3d671e5b4853_1588624141.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_55074a2f658eb53e20ee3d671e5b4853_1588624141.html", "title": "Track agent accepts 2-year ban for doping talk to reporters", "title_page": "Track agent accepts 2-year ban for doping talk to reporters", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MONACO (AP) — An athletics agent who was filmed telling undercover reporters he could supply performance enhancing drugs has agreed to a two-year ban in a case that risked implicating Justin Gatlin in doping.\nThe Athletics Integrity Unit announced the sanction on Monday against Robert Wagner, while accepting he made “misleading and untruthful statements” to secure what he thought was a $250,000 contract for work.\nIn fallout of reports in 2017 by Britain’s Daily Telegraph, former Olympic and world champion sprinter Gatlin fired his then-coach , Dennis Mitchell, who was implicated in the allegations.\n“Mr. Wagner confirmed that he had no further information or any evidence to corroborate his claims that Mr. Justin Gatlin (and ‘everybody else’) was doping at certain points in the season or that Mr. Dennis Mitchell was involved, aware and engaged in doping Mr. Gatlin,” the AIU said in a published judgment .\nThe newspaper alleged Wagner met reporters at a training camp in Florida, and that he offered to supply and administer testosterone and human growth hormone they said were for an actor training for a film, for a fee of $250,000.\nWagner’s conduct was “extraordinarily unprofessional,” the ruling said. “The statements made by Mr. Wagner to undercover reporters concerned extremely serious matters that presented some of the gravest threats to the integrity of the sport.”\nWagner was given credit for cooperating with an investigation done by the AIU and U.S. Anti-Doping Agency.\nHe had been provisionally suspended from the sport since April 2018, and his two-year ban covered time already served.\nGatlin, the 2004 Olympic champion, served two bans in his career for doping violations. He returned to win 100-meter medals at the 2012 and 2016 Olympics, and the 2017 world title in what was Usain Bolt’s farewell competition.\n___\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports", "url": "https://apnews.com/55074a2f658eb53e20ee3d671e5b4853"}