{"authors": [], "date_download": "2020-05-04 20:12:28", "date_modify": "2020-05-04 20:12:28", "date_publish": "2020-04-16 04:12:16", "description": "HELENA, Mont. (AP) — A Montana man convicted of negligent homicide retracted requests to withdraw his guilty plea and disqualify the judge presiding over the case after the state Supreme Court...", "filename": "_7eddd5ab4024f5d725885a736abfac53_1588623148.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7eddd5ab4024f5d725885a736abfac53_1588623148.html", "title": "Sentencing agreement reached in Montana fatal shooting case", "title_page": "Sentencing agreement reached in Montana fatal shooting case", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HELENA, Mont. (AP) — A Montana man convicted of negligent homicide retracted requests to withdraw his guilty plea and disqualify the judge presiding over the case after the state Supreme Court ruled the judge acted appropriately during sentencing.\nGregg Trude also agreed to waive his right to further challenge his conviction as part of an agreement approved during a resentencing hearing Wednesday, The Independent Record reported .\nThe Montana Supreme Court ruled last week that Lewis and Clark County District Court Judge Michael McMahon acted with “integrity and honesty” when he sentenced Trude, who pleaded guilty to negligent homicide in October 2019.\nMcMahon oversaw the resentencing hearing in Helena.\nTrude’s Winchester Magnum accidentally discharged in a Helena parking lot and killed his hunting partner, Dr. Eugene “Buzz” Walton, in October 2018.\nTrude initially pleaded not guilty to the negligent homicide charge but changed his plea to guilty during trial. The evidence tampering charge was dismissed.\nTrude later appealed to the state Supreme Court, asking for the district judge to be disqualified due to his personal relationship with the victim.\nThe high court granted the request for a hearing but determined McMahon acted impartially when structuring Trude’s original sentence.\nIn exchange for agreeing to the new terms, Trude can seek parole after serving 25% of his sentence of more than three years. That opportunity was not afforded to him in McMahon’s initial sentencing.\nTrude will also be able to request a transfer to the supervision of the Montana Department of Corrections to serve out the remainder of his sentence at one of its holding facilities.\nTrude is currently incarcerated in Cascade County Regional Prison in Great Falls. A transfer decision must be approved by the corrections department.\nTrude will also be required to pay restitution of about $3.7 million.", "url": "https://apnews.com/7eddd5ab4024f5d725885a736abfac53"}