{"authors": [], "date_download": "2020-05-04 20:07:41", "date_modify": "2020-05-04 20:07:41", "date_publish": "2020-04-08 22:28:15", "description": "LITTLE ROCK, Ark. (AP) — Tech giant Amazon acquired 80 acres (0.32 square kilometers) of land for $3.2 million in the Port of Little Rock, a city official announced. Mayor Frank Scott Jr....", "filename": "_ae43170d430511937069f1d20017455b_1588622861.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ae43170d430511937069f1d20017455b_1588622861.html", "title": "Little Rock official: City approved Amazon deal", "title_page": "Little Rock official: City approved Amazon deal", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LITTLE ROCK, Ark. (AP) — Tech giant Amazon acquired 80 acres (0.32 square kilometers) of land for $3.2 million in the Port of Little Rock, a city official announced.\nMayor Frank Scott Jr. confirmed at a city board meeting on Tuesday when the deal was approved that construction is underway. A distribution center is planned for the site.\nA Delaware limited liability company, PDC TN/FL LPIV, agreed to buy the land in October. Arkansas Business first reported last week that Amazon would be opening a facility at Little Rock Port.\n“This is some good news in the midst of uncertainty, and so we are grateful to welcome this company to our city, and we’re excited because this is a major investment and a major deal for our city, and we’re looking forward to its future as those details are revealed,” Scott said.\nJay Chesshir, president and CEO of the Little Rock Regional Chamber of Commerce, said Amazon did not want to reveal any details about the project until the sale was final due to the global economic uncertainty caused by the pandemic.\nBryan Day, Little Rock Port Authority Executive Director, couldn’t name the project. It was called “Project Diamond” on meeting documents.\nThe deal is “a wonderful addition to the port of Little Rock with … significant jobs, significant capital investment, and we were able to generate revenues through the sale of this land which will allow us to continue acquiring land for future development,” Day said at the port meeting.\nTwo years ago, the city launched the “Love, Little Rock” ad campaign, telling Amazon that although it didn’t meet the company’s requirements for a headquarters in its 2017 search, it would be a good location for other businesses.\nWhen City Director Lance Hines asked Chesshir if the campaign helped secure the deal, he responded: “Today’s a great day to love Little Rock.”", "url": "https://apnews.com/ae43170d430511937069f1d20017455b"}