{"authors": ["Tim Booth"], "date_download": "2020-05-04 20:23:40", "date_modify": "2020-05-04 20:23:40", "date_publish": "2020-04-14 22:42:45", "description": "RENTON, Wash. (AP) — Guard Mike Iupati is returning to the Seattle Seahawks on a one-year deal, joining a glut of free agent additions focused on the offensive line. A person with knowledge...", "filename": "_f46d148cd21bed1e01a17946500ef654_1588623820.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f46d148cd21bed1e01a17946500ef654_1588623820.html", "title": "AP Source: Iupati returning to Seahawks on 1-year deal", "title_page": "AP Source: Iupati returning to Seahawks on 1-year deal", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "RENTON, Wash. (AP) — Guard Mike Iupati is returning to the Seattle Seahawks on a one-year deal, joining a glut of free agent additions focused on the offensive line.\nA person with knowledge of the deal confirmed Iupati’s agreement with the Seahawks on Tuesday. The person spoke to The Associated Press on the condition of anonymity because it had not been announced by the team. NFL Network first reported the agreement.\nIupati started 15 games at left guard last season for Seattle, his first with the Seahawks. He was solid for most of the season but did not play in either of Seattle’s playoff games due to a neck stinger suffered late in the season.\nThe decision to bring back Iupati adds another name to a long list of offensive linemen Seattle has added this offseason.\nThe Seahawks also reached deals with tackles Brandon Shell and Cedric Ogbuehi and interior linemen B.J. Finney and Chance Warmack.\nBringing back Iupati may raise speculation about what Seattle could do with Finney, who has experience at guard and center. Seattle center Justin Britt is entering the final year of his contract and is coming off a torn ACL. Britt has an $11.4 million salary cap charge for the upcoming season and Seattle could save $8.5 million by making a move with the veteran.\nSeattle also rescinded its exclusive rights free agent tender to wide receiver Malik Turner, making him a free agent. Turner had 15 receptions and one touchdown in the regular season last year but also had a crucial drop in the fourth quarter of Seattle’s playoff loss in Green Bay. Turner may have struggled to find a role with Seattle this season after the Seahawks signed Phillip Dorsett.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/f46d148cd21bed1e01a17946500ef654"}