{"authors": ["Dan Merica"], "date_download": "2020-05-04 16:55:13", "date_modify": "2020-05-04 16:55:13", "date_publish": "2020-04-08 18:37:40", "description": "Former President Barack Obama played an active, albeit private, role in the Democratic presidential primary that effectively ended on Wednesday when Vermont Sen. Bernie Sanders dropped out of the race.", "filename": "2020_04_08_politics_obama-sanders_index_1588611313.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200305002626-bernie-sanders-barack-obama-split-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_obama-sanders_index_1588611313.html", "title": "Sanders had multiple conversations with Obama ahead of decision to end campaign", "title_page": "Sanders had multiple conversations with Obama ahead of decision to end campaign - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Former President Barack Obama played an active, albeit private, role in the Democratic presidential primary that effectively ended on Wednesday when Vermont Sen. Bernie Sanders dropped out of the race.\nObama and Sanders spoke multiple times in the last few weeks as the Vermont senator determined the future of his campaign, a source familiar with the conversation tells CNN. Sanders' decision to get out on Wednesday paves the way for Joe Biden, who served as Obama's vice president for eight years, to become the Democratic nominee.\nObama's eventual endorsement of Biden and fulsome entry into the campaign, whenever it occurs, will signal a new phase in Democrats' efforts to defeat President Donald Trump\nIn keeping with tradition, Obama had previously made clear he wouldn't publicly wade into his party's 2020 presidential primary fight but has promised to support whomever ended up as the nominee. And with Sanders out, the former President backing his one-time running mate is all but a forgone conclusion, something Trump acknowledged at the White House Wednesday.\n\"He'll come out, I'm sure he's got to come out at some point,\" Trump said of Obama. \"Because he certainly doesn't want to see me for four more years. We're not -- we think a little bit differently.\"\nObama's endorsement of former Secretary of State Hillary Clinton in 2016 was highly choreographed, even though it happened in June, more than a month before Sanders officially backed the eventual Democratic nominee.\nAlthough Obama remained relatively mum throughout the primary, only speaking out a handful of times before voters began casting ballots in 2020, the former president was closely monitoring the debate and had regular conversations with candidates before, during and after their respective bids.\n\"His private counsel consistently emphasized staying focused on the ultimate goal: Winning the White House in November,\" the source familiar with Obama's calls tells CNN.\nObama, the source said, was impressed by the caliber of Democrats who chose to run -- and over two dozen did so. But the former president \"urged them to keep in mind that we must be well-positioned to unify as a party once we have a nominee,\" the source said of the calls.\n\"While the content of those conversations remains private,\" the source said of Obama's calls with Sanders, \"there was always agreement that winning in the fall was paramount.\"\nClinton declined to comment about Sanders ending his campaign, a spokesman told CNN on Wednesday.\nThe history between the two is fraught, with Clinton and many of her allies feeling that Sanders stayed in the 2016 race long after his path to victory closed. And the former secretary of state has said that his decision to fight until the California primary in June hurt her in the general election.\n\"He hurt me, there's no doubt about it,\" Clinton told Howard Stern in December 2019. \"And I hope he doesn't do it again to whoever gets the nomination. Once is enough.\"\nIn the rare moments where Obama did comment on the 2020 field during the race, he both urged voters to stop worrying about the strength of the candidates and pushed the candidates to remember that the most important win could come in November against President Trump.\n\"There will be differences,\" Obama said at a fundraiser in November about the Democratic candidates, \"but I want us to make sure that we keep in mind that, relative to the ultimate goal, which is to defeat a President and a party that has ... taken a sharp turn away from a lot of the core traditions and values and institutional commitments that built this country,\" those differences are \"relatively minor.\"\nAt the same fundraiser, he decried purity tests and said while arguments about policy are \"good\" to have, \"you got to win the election.\"\nObama, at an earlier fundraiser, also warned against worrying too much about the bruising primary, noting that he and Clinton had a tough primary during the 2008 election.", "url": "https://www.cnn.com/2020/04/08/politics/obama-sanders/index.html"}