{"authors": ["Alicia Lee"], "date_download": "2020-05-04 16:25:18", "date_modify": "2020-05-04 16:25:18", "date_publish": "2020-04-07 03:37:55", "description": "Dr. Francis Robicsek, who died Friday at the age of 94, was known to his Charlotte, North Carolina, community as a hero, saving many lives during his long career as a heart surgeon.", "filename": "2020_04_06_us_surgeon-francis-robicsek-buried-scrubs-trnd_index_1588609518.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406161335-02-surgeon-francis-robicsek-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_us_surgeon-francis-robicsek-buried-scrubs-trnd_index_1588609518.html", "title": "Renowned surgeon, known for his generosity and humanitarian work, asked to be buried in his scrubs", "title_page": "Renowned surgeon, known for his generosity and humanitarian work, asked to be buried in his scrubs  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Dr. Francis Robicsek, who died Friday at the age of 94, was known to his Charlotte, North Carolina, community as a hero, saving many lives during his long career as a heart surgeon.\nSo instead of being buried in a traditional suit, the late doctor will be put to rest on Monday wearing the clothes that made him the hero that he was: his scrubs.\nAccording to The Charlotte Observer, the acclaimed surgeon requested to be buried in scrubs, considered the uniform of doctors everywhere.\n\"That's how he saw himself,\" Dr. Geoffrey Rose, president of Sanger Heart & Vascular institute, told CNN. \"In scrubs, there to serve patients.\"\nRobicsek, born Ferenc Robicsek in Hungary in 1925, was a pioneer in the operating room. He was one of the first doctors in Charlotte to perform heart bypass operations in the 1950s, and he helped perform Charlotte's first heart transplant in 1986, according to the Observer\nHe founded the Atrium Health Sanger Heart & Vascular Institute and performed more than 35,000 surgeries until he retired in 1998.\nDr. Francis Robicsek was one of the first surgeons to perform open-heart surgeries in Charlotte, North Carolina.\n\"Everybody (in Charlotte) knew Dr. Robicsek and everybody had a story about how he had either operated on one of their family members or neighbors,\" Rose, who knew Robicsek for nearly 25 years, said.\nIf there was one word that could describe Robicsek, it would be innovation, because of the numerous surgical instruments and procedures he patented to make surgeries go smoother, Rose said.\nBack in 1957, Robicsek and his fellow surgeons, Dr. Paul Sanger and Dr. Fred Taylor, were set to perform the city's first open-heart operations, Rose said. They needed a heart-lung machine, which essentially does the work of both the heart and lungs by pumping and oxygenating blood.\nWith barely any heart-lung machines in the US, Robicsek traveled to the Cleveland Clinic to see the one that was being used there. He came back to Charlotte and with the help of a friend who was an engineer, they built their own heart-lung machine in the friend's garage.\nFor years, Robicsek loaded up that machine on the back of a pickup truck and transported it between hospitals to do heart surgery.\nDr. Francis Robicsek with the heart-lung machine he helped build to perform open-heart surgeries.\nPeople also remember Robicsek for his generous heart and caring demeanor when interacting with his patients.\nDuring the days of segregation in the US, African American patients in Charlotte had to be treated at a separate hospital called the Good Samaritan Hospital, according to the Observer.\nBut Robicsek wasn't able to perform heart surgeries there so he instead arranged for black patients to be admitted to a tuberculosis hospital even though they didn't have the disease. He would then perform their heart surgeries there, Rose said.\n\"Francis found ways around that to be able to provide care for all,\" Rose said. \"That was always his modus operandi.\"\nIn that same vein, Rose said Robicsek took his medical expertise abroad. In the 1960s, he traveled to Guatemala, Nicaragua, El Salvador, Honduras and other Central American countries to help establish cardiac surgery and pediatric intensive care programs there.\nHe assisted with surgeries and trained Guatemalan doctors and nurses. But the facilities there didn't allow for cardiac catheterization, which is used to diagnose certain heart diseases, so Robicsek would help fly Guatemalan patients to Charlotte using a military transport plane, work through the weekend to do the cardiac catheterizations, then fly them back in a matter of less than 48 hours.\nDr. Francis Robicsek helped transport Guatemalans to Charlotte so he could diagnose heart conditions correctly.\n\"What that would do is tee up surgery for the next six months because all the diagnostic work would've been done,\" Rose said. \"That type of ability to solve problems and find ways to get things done is a wonderful example of Francis' spirit and his commitment to others.\"\nHe then went on to help found the Guatemalan Heart Institute, which today performs 700 open-heart procedures a year, according to Carly Stephenson, a spokeswoman with Atrium Health.\nEven after retiring, Robicshek continued to help hospitals in Central America by donating medical equipment in his role as vice president of the International Medical Outreach program.\nJim Olsen, senior vice president of material resource management at Atrium Health, accompanied Robicshek for many of these humanitarian trips.\n\"Wherever we went to (in) Central America, there was someone holding their shirt up to show Dr. Robicsek the scar from the surgery he had done on them years before,\" Olsen told CNN.\nWhile dozens of awards lined his office walls, Stephenson said Robicsek was most proud of the Surgical Humanitarianism Award from the American College of Surgeons he was awarded in 2017.", "url": "https://www.cnn.com/2020/04/06/us/surgeon-francis-robicsek-buried-scrubs-trnd/index.html"}