{"authors": ["Theresa Waldrop"], "date_download": "2020-05-04 17:03:53", "date_modify": "2020-05-04 17:03:53", "date_publish": "2020-04-10 13:40:39", "description": "A little over 183,000 people were still without power in Maine Friday after a spring snowstorm barreled through the state with the heavy, wet snow that brought down trees and power lines.", "filename": "2020_04_10_us_maine-snowstorm_index_1588611833.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410072654-01-maine-snow-0409-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_maine-snowstorm_index_1588611833.html", "title": "Maine snowstorm causes power outages", "title_page": "Maine snowstorm causes power outages - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A little over 183,000 people are still without power in Maine Friday after a spring snowstorm barreled through the state with heavy, wet snow that brought down trees and power lines.\nSome areas north of Portland were hit with more than a foot of snow, and in Franklin County as much as 20 inches was reported, according to the National Weather Service\nCrews with Central Maine Power continue to clear debris and downed wires, according to a release from the company. Just over 183,000 CMP customers are still without power as of 5 p.m. Friday, the utility company said in a release.\n\"We have worked in coordination with the Maine Emergency Management Agency today to ensure all of the state's hospitals and critical medical facilities have power and emergency vehicle access,\" said Doug Herling, CMP president and CEO. \"We expect additional contractor crews to start with us first thing in the morning to make significant progress on restoration.\"\nCMP advised customers that they should plan to be without power, perhaps for a couple of days given the extent of the outages.\nRead More", "url": "https://www.cnn.com/2020/04/10/us/maine-snowstorm/index.html"}