{"authors": ["Shannon Liao", "Cnn Business"], "date_download": "2020-05-04 16:28:34", "date_modify": "2020-05-04 16:28:34", "date_publish": "2020-04-07 21:30:35", "description": "Sony revealed more details about its new PlayStation 5 controller on Tuesday and said that it's starting to ship the controller to game developers. That means game developers can think about how to use the new controller's features in their games.", "filename": "2020_04_07_tech_ps5-dualsense-new-controller-trnd_index_1588609714.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407164000-01-playstation-5-controller-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_tech_ps5-dualsense-new-controller-trnd_index_1588609714.html", "title": "Sony unveils its new PlayStation 5 controller, the DualSense", "title_page": "PS5: Sony unveils its new DualSense controller for the next-gen console - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Sony revealed more details about its new PlayStation 5 controller on Tuesday and said that it's starting to ship the controller to game developers. That means game developers can think about how to use the new controller's features in their games.\nThe new DualSense wireless controller has more immersive 3D audio, improved tactile sensations via haptic feedback, such as rumbling and shaking, so users can better feel what's going on within a game. The new controller also has built-in microphones for quickly chatting with friends, although Sony recommends relying on a headset for longer conversations.\n\"DualSense marks a radical departure from our previous controller offerings and captures just how strongly we feel about making a generational leap with PS5,\" said Jim Ryan, president and CEO of Sony Interactive Entertainment in a statement. \"The new controller, along with the many innovative features in PS5, will be transformative for games.\"\nA \"Share\" button for taking screenshots, video and livestreaming has been replaced by a \"Create\" buttton that will serve a similar function. Sony said more details on the new button will be revealed later.\nThe DualSense controller comes in a white and black design. The new controller is redesigned to feel smaller than it looks, Sony wrote on Tuesday. The company said it went through \"hundreds of mockups over the last few years\" before settling on this one.\nRead More", "url": "https://www.cnn.com/2020/04/07/tech/ps5-dualsense-new-controller-trnd/index.html"}