{"authors": ["Scottie Andrew"], "date_download": "2020-05-04 16:28:01", "date_modify": "2020-05-04 16:28:01", "date_publish": "2020-04-07 19:41:23", "description": "A coterie of international researchers confirmed the ages of two whale sharks for the first time -- by sampling the carbon in its vertebrae, left over from nuclear bomb tests during the Cold War.", "filename": "2020_04_07_world_whale-shark-age-bomb-carbon-scn-trnd_index_1588609681.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407154531-02-whale-sharks-age-study-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_world_whale-shark-age-bomb-carbon-scn-trnd_index_1588609681.html", "title": "Nuclear bomb tests helped determine the age of whale sharks for the first time", "title_page": "Nuclear bomb tests helped determine the age of whale sharks for the first time - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) We know that whale sharks are the largest fish in the seas, reaching up to nearly 60 feet in length. But that's one of the few things we know about the endangered species .\nBecause of the whale shark's elusiveness, marine researchers were left to guess at its age and lifespan, which conservationists use to develop species survival plans.\nNew findings end those guesses: A coterie of international researchers confirmed the ages of two whale sharks for the first time -- by sampling the carbon in vertebrae, left over from nuclear bomb tests during the Cold War.\nAnd by learning how long the species can live, conservationists know a bit more about how to protect them in the wild.\nThe findings were published in the journal Frontiers in Marine Science\nThe evasive whale shark\nTheir status and unique body structure has made it difficult to study them, which in turn makes it difficult to create an effective survival plan. Progress in improving whale shark populations reversed in 2016, when the species was reclassified from vulnerable to endangered.\n\"I've been working on whale sharks for 20 years,\" said Mark Meekan, senior principal research scientist at the Australian Institute of Marine Science and study co-author. \"Over that time, we've learned about their movements and behaviors, but some very basic information is still a mystery to researchers.\"\nTheir lifespan was an essential piece that's been missing for decades -- until Meekan and the team took a novel approach to dating the fish.\nHow to age the world's largest fish\nPrevious attempts at aging whale sharks were mixed. To do it, researchers need to slice into vertebrae that, when cut, reveal growth bands -- similar to the rings in tree trunks -- that could prove how old they are.\nBut researchers could never decide whether the bands were formed once or twice a year, a distinction that made it difficult to determine how long they live.\nSo Meekan, lead author Joyce Ong and the team set out to settle the growth band debate -- using leftover carbon from bomb tests.\nCarbon-14 is a naturally occurring radioactive isotope frequently used by archaeologists and historians to date fossils and artifacts because of its constant rate of decay, said Ong, a postdoctoral associate in the Department of Marine and Coastal Sciences at Rutgers University.\nBut nuclear weapons testing throughout the '50s and '60s caused levels of Carbon-14 to temporarily elevate. Those levels first saturated the atmosphere, then oceans, then entered the food web and into animals -- and that's how elevated levels of the isotope ended up in the vertebrae of some of the world's largest fish.\nSo Ong, Meekan and their colleagues started their dating of animals the traditional way: Sectioning a vertebrae -- the samples belonged to a 32-foot-long shark that was stranded in Pakistan in 2012 and a smaller shark collected in Taiwan in 2005 -- then counting the growth bands.\nThen, they extracted material from the vertebrae and sampled the amount of radiocarbon in it. They compared that amount to the level of Carbon-14 in a material that they knew the age of -- and that's how they determined that the whale sharks they sampled were 50 and 35 years old, respectively.\nAnd that debate among researchers about what a whale shark's growth band rings meant? This study settled that, too -- the radiocarbon dating proved that growth bands formed once a year instead of twice.\nThe significance\nNow that we know the growth bands generate once a year, we know whale sharks grow slowly, which means populations likely won't survive high losses in fisheries, Meekan said.\nThat's a key conservationists can use to more accurately model their populations, which can aid in their conservation.\nPreviously, researchers believed whale sharks may live up to 100 years. That still could be true -- because the whale shark collected in Pakistan was only 32 feet in length, which is smaller than average, there's evidence that perhaps it would've continued to grow and mature, he said.\n\"We still can't say for certain if these sharks live to be 100 years old, but it now seems much more likely,\" he said.", "url": "https://www.cnn.com/2020/04/07/world/whale-shark-age-bomb-carbon-scn-trnd/index.html"}