{"authors": [], "date_download": "2020-05-04 16:22:29", "date_modify": "2020-05-04 16:22:29", "date_publish": "2020-04-06 13:01:54", "description": "Samsung is now taking orders for its Galaxy Chromebook, a premium Chrome OS-powered laptop. As Chrome OS laptops go, Samsung's Galaxy Chromebook costs more than most, but it has the specs and features to back up that price.", "filename": "2020_04_06_cnn-underscored__609487bedd991c1d96554a45f8f2ffd2_index_1588609349.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200105222515-1-underscored-samsung-galaxy-chromebook-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_cnn-underscored__609487bedd991c1d96554a45f8f2ffd2_index_1588609349.html", "title": "Galaxy Chromebook: How to buy Samsung's high-end Chromebook", "title_page": "Galaxy Chromebook: How to buy Samsung's high-end Chromebook - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Samsung is now taking orders for its Galaxy Chromebook, a premium Chrome OS-powered laptop, which made its debut during CES 2020 in January, its Fiesta Red exterior matching the neon lights throughout Las Vegas.\nYou can order the $999 Galaxy Chromebook directly from Samsung right now, with orders shipping this week.\nAs Chrome OS laptops go, Samsung's Galaxy Chromebook costs more than most, but it has the specs and features to back up that price. There's a 13.3-inch 4K UHD AMOLED display, similar to what Samsung uses on its Galaxy line of phones, that's known for its bright and saturated colors, while also improving battery life with deeper blacks. Samsung claims it's the first time a Chromebook has been outfitted with an AMOLED display.\nInside is a 10th Generation Core i5 processor, which is configurable with up to 16GB of memory and up to 1TB of storage. Its connectivity is futureproofed with Wi-Fi 6 capabilities, it weighs an impressively light 2.29 pounds and is only 9.9 millimeters thick. The base model comes with 8GB of RAM and a 256GB SSD for storage. There's also a UFS microSD card reader for expandable storage. Two USB-C ports are used for charging the laptop, as well as syncing or connecting accessories to it.\nThe power button has an integrated fingerprint sensor for added security and ease of use.\nThe display works with the built-in stylus, similar to the S Pen that comes with Samsung's Galaxy Note phones. The hinge allows the screen to rotate almost a full 360 degrees, turning the laptop design into a tablet or sketch pad for use with the stylus.\nGoogle's Pixelbook is widely considered the standard for a premium Chromebook experience, but it was released in 2017, and is in need of a refresh. The Galaxy Chromebook looks to be just that, or at the very least, will put pressure on Google to consider releasing a Pixelbook 2.\nChrome OS is more than just Google's Chrome browser. The Android Play Store is built into all Chrome OS devices, giving you the option to install Android apps. You can use Google Assistant voice commands to ask questions, set reminders or send an email. Google constantly updates Chrome OS, most of the time in the background, with feature improvements and enhanced security.\nAt $999, the Galaxy Chromebook is on the high end of Chromebooks. But you're getting high-quality components, inside and out. The 4K display combined with the i5 processor and memory should be able to handle anything Chrome OS can throw at it.\nOrder the $999 Galaxy Chromebook from Samsung right now.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/06/cnn-underscored/galaxy-chromebook-available-buy-samsung/index.html"}