{"authors": ["Tim Booth"], "date_download": "2020-05-04 20:22:11", "date_modify": "2020-05-04 20:22:11", "date_publish": "2020-04-20 23:00:53", "description": "The latest results of the joint testing done by the NFL and the players' union was released Monday, concluding a comprehensive new testing method that went beyond examining only new helmet models...", "filename": "_c72219fb1c88a479cbc6a92f9525c11e_1588623731.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c72219fb1c88a479cbc6a92f9525c11e_1588623731.html", "title": "New data lead to new testing, results for NFL helmets", "title_page": "New data lead to new testing, results for NFL helmets", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The latest results of the joint testing done by the NFL and the players’ union was released Monday, concluding a comprehensive new testing method that went beyond examining only new helmet models joining the market this year.\nAs the NFL and NFLPA continue to evolve testing around what are the best models of helmets for players to wear, all 35 models of helmets were tested and rated by biomechanical engineers appointed by the league and the union. On-field data have helped engineers develop an improved testing model and more defined results.\n“We are continually improving the way we gather, analyze and deploy data to try to drive down injuries,” said Jeff Miller, the NFL’s executive vice president of health and safety innovation. “This year’s helmet testing protocol is an important evolution based on what we have learned over years of gathering on-field data. The outcome is better information for players as they make their helmet choices and better information for helmet manufacturers as they continue to design for the future.”\nA poster released by both the league and players will be displayed at every team facility, and it’s broken down into different categories this year than previous seasons.\nThe three top-graded models for the 2020 season all come from Riddell with its SpeedFlex Precision Diamond, SpeedFlex Precision and SpeedFlex Diamond -- the highest-rated new helmet --topping the list.\nThe Xenith Shadow XR, a new model, was next, followed by the VICIS Zero1, the top-graded helmet from the previous three seasons.\nSchutt, the other major helmet maker on the market, rounded out the top six with its F7 LTD model. VICIS went into receivership last December amid financial troubles, but was recently purchased by a private equity firm that also owns a share of Schutt.\nFour of the six new models of helmets tested this year ranked in the top 10. Only one new model tested — the LIGHT LS1 Composite — tested so poorly that it was deemed prohibited, joining an existing list of 12 prohibited models. The league said no player is wearing a banned helmet.\nThe new display on the poster in team locker rooms will have a top-performing group in green, but that section will be segmented into two sub-categories. The darker green will represent the helmets that performed better in lab testing than the helmets denoted with a lighter green.\nThe league and players believe there will be further refinement and additional differentiation among the best-performing models beginning next year.\nThe sides also said that 99.5% of players wore top-rated models during the 2019 season, versus just 41% at the end of the 2017 season.\n“It is significant progress within two years to have such widespread adoption of top-performing helmets by our players. That is a testament to the power of collaboration with the NFLPA, with club equipment managers and a credit to the players themselves for making this change happen,” Miller said.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/c72219fb1c88a479cbc6a92f9525c11e"}