{"authors": ["Breaking News Reporter"], "date_download": "2020-05-04 20:24:57", "date_modify": "2020-05-04 20:24:57", "date_publish": "2020-04-29 21:08:49", "description": "Tony Cushingberry, 21, was arrested Tuesday in the shooting of Angela Summers. The shooting may have been over mail being delayed, a union rep said.", "filename": "entry_arrest-in-angela-summers-uspsshooting_n_5ea9d1b8c5b6ad0a4317882f_1588623897.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9e58a240000e1018e9f82.jpeg?cache=l0lo46kmpw&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_arrest-in-angela-summers-uspsshooting_n_5ea9d1b8c5b6ad0a4317882f_1588623897.html", "title": "Arrest Made In Shooting Death Of Indianapolis Postal Worker", "title_page": "Arrest Made In Shooting Death Of Indianapolis Postal Worker | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "A 21-year-old man has been arrested in the fatal shooting of an Indiana postal worker while she was delivering mail on Monday, authorities said.\nTony Cushingberry of Indianapolis was taken into custody by local and federal officers Tuesday night in the shooting death of Angela Summers, 45, the U.S. Postal Inspection Service announced Wednesday.\nCharges against Cushingberry are pending at the U.S. Attorney’s Office for the Southern District of Indiana, said the USPIS, which is the law enforcement arm of the U.S. Postal Service.\nUPDATE. See below and a big thanks to all of our law enforcement partners for their hard work so far. More to come! #uspis #usps #update pic.twitter.com/JTngOz16Xk — USPIS - Detroit (@USPIS_DETROIT) April 29, 2020\nKilling a postal worker is considered a federal offense. It can be punishable with death or a life sentence.\n“Anyone who threatens, assaults, or otherwise harms a postal employee fulfilling her critical mission will be apprehended and held fully accountable,” said Felicia George, USPIS’s Detroit Division acting inspector in charge, in a statement.\nA USPIS representative reached by HuffPost Wednesday declined to provide additional details on the incident, only to say “the investigation is ongoing.”\nSummers was delivering mail in a neighborhood on the eastern side of the city when authorities said she was shot in her chest around 4 p.m. Monday.\nA 19-year-old woman responding to knocking on her front door said she found Summers lying on her front porch, bloody, after being shot.\n“She couldn’t speak, she was hyperventilating,” Alondra Salazar told the Indy Star. Salazar said she called 911 and held Summers’ hand until paramedics arrived. Summers was taken to a hospital where she was pronounced dead.\nThe USPIS on Tuesday offered a reward up to $50,000 for information leading to an arrest and conviction in her homicide. It’s not clear whether Cushingberry’s arrest is tied to this reward offer.\nAuthorities have released few details about the incident. One witness told local station WTHR that moments before Summers was shot she had been in a confrontation with a man about him not having received his government stimulus check because his dogs were outside.\nThe president of the local National Association of Letter Carriers union, which Summers was a member of, said a house where the shooting took place had had its mail delayed for about two weeks because of issues with dogs.\n“There was an issue with the dogs at that residence, and you give three letters and, on the third one, we curtail the mail,” Paul Toms, president of the NALC’s Indianapolis branch, told WISH-TV.\nThe union posted a tribute to Summers on Facebook while asking the public to pray for her family, which includes a 14-year-old daughter.", "url": "https://www.huffpost.com/entry/arrest-in-angela-summers-uspsshooting_n_5ea9d1b8c5b6ad0a4317882f"}