{"authors": [], "date_download": "2020-05-04 20:17:15", "date_modify": "2020-05-04 20:17:15", "date_publish": "2020-03-01 22:26:27", "description": "GARTH BROOKS: IT’S SANDERS, NOT SANDERS DETROIT (AP) - Garth Brooks is still giggling that people read his Barry Sanders jersey as a Bernie Sanders endorsement. Brooks wore a “Sanders 20”...", "filename": "_2dd9ac23a20844afb18a91025de64f60_1588623435.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2dd9ac23a20844afb18a91025de64f60_1588623435.html", "title": "AM Prep-Music", "title_page": "AM Prep-Music", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GARTH BROOKS: IT’S SANDERS, NOT SANDERS\nDETROIT (AP) - Garth Brooks is still giggling that people read his Barry Sanders jersey as a Bernie Sanders endorsement. Brooks wore a “Sanders 20” jersey at his Feb. 22 show at Detroit’s Ford Field. Barry Sanders was a running back for the Detroit Lions. Brooks told the audience he wore that jersey because they both went to Oklahoma State University. When Brooks posted a photo of himself in the jersey online, people thought it meant he was endorsing Bernie Sanders for the Democratic presidential nomination in 2020. Bernie Sanders has not said anything publicly about Brooks and the jersey. Barry Sanders tweeted to Brooks on Friday, “Want to be my VP?” Brooks responded, “I would run any race with you!”\nPAULINA PORIZKOVA SAYS RIC OCASEK GAVE HER NOTHING IN HIS WILL\nNEW YORK (AP) - Model Paulina Porizkova (por-iz-KOH’-vah) acknowledges that while she and singer Ric Ocasek (oh-KAS’-ihk) of The Cars were divorcing when he died, she still felt “betrayed” that he cut her out of his will. Porizkova tells “CBS Sunday Morning,” “It’s made the grieving process really, really tricky.” Porizkova says she had put all her earnings from modeling into the marriage. She lived with Ocasek up to his death in September, even though they announced their separation in 2018 after 28 years of marriage. She says the day she found him dead was the worst moment of her life.\nCRUSTACEAN NAMED FOR METALLICA\nUNDATED (AP) - Two European scientists have named a previously unknown deep-sea crustacean in honor of Metallica. Dr. Torben Riehl of the Senckenberg Society for Natural Research in Germany and Dr. Bart De Smet of Ghent University in Belgium have named the creature Macrostylis metallicola. It lives roughly between Mexico and Hawaii, has no eyes or color and is barely a quarter of an inch long. Riehl named the crustacean after Metallica because he’s been a fan since he was a teenager. Metallica approves. They call the name “stellar” and note that because it lives among cobalt, manganese, nickel and rare-earth elements, it’s “one metal crustacean.”\nLUKE BRYAN: A GOOD BEER IS LIKE A HIT SONG\nNEW YORK (AP) - Luke Bryan was involved in the creation of his new beer and not just because he really likes beer. Bryan says having a bad beer as his signature brand would be like having a hit song he hates — and has to perform night after night. Bryan teamed with Constellation Brands to create Two Lane American Golden Lager. Bryan says even if you’re not a fan of his music, you can still be a fan of his beer. He says the right beer with the right ideas behind it can set itself apart. Two Lane is available in limited release, with an expansion in the coming months.\n___\nSound:\n111242-a-145:68-(Luke Bryan, country singer)-“it every night”-Luke Bryan wants a beer he can live with (2 Mar 2020)\n¤¤CUT ´111242 (03/02/20)££ 145:68 “it every night”\n111241-a-67:20-(Luke Bryan, country singer)-“to stand alone”-Luke Bryan wants a beer he can live with (2 Mar 2020)\n¤¤CUT ´111241 (03/02/20)££ 67:20 “to stand alone”\n111243-a-189:60-(Luke Bryan, country singer)-“itself apart, too”-Luke Bryan wants a beer he can live with (2 Mar 2020)\n¤¤CUT ´111243 (03/02/20)££ 189:60 “itself apart, too”\n111244-a-180:96-(Luke Bryan, country singer)-“is all about”-Luke Bryan wants a beer he can live with (2 Mar 2020)\n¤¤CUT ´111244 (03/02/20)££ 180:96 “is all about”\nRHONDA VINCENT INVITED TO JOIN OPRY\nNASHVILLE (AP) - Bluegrass musician Rhonda Vincent says she’s still in shock after being invited to join the Grand Ole Opry in Nashville. She had just performed the song “Like I Could” at the Opry on Friday when the song’s co-writer, Jeannie Sealy, came on stage to invite Vincent to be the latest member. Vincent said, “100 percent yes!” She will be inducted in a ceremony on March 24.\n“MAP OF THE SOUL: 7” BY BTS LEADS ALBUM CHART\nLOS ANGELES (AP) - BTS has earned its fourth number-one album with “Map of the Soul: 7.” It moved 422,000 units in its first week of release, putting it on top of the Billboard 200 album chart. YoungBoy Never Broke Again is second with “Still Flexin, Still Steppin.” Ozzy Osbourne is third with “Ordinary Man.” Last week’s number one, Justin Bieber’s “Changes,” drops to fourth place. “Please Excuse Me For Being Antisocial” by Roddy Ricch is number five.\nMAN CONVICTED OF KILLING NICKI MINAJ’S STAGE MANAGER\nPHILADELPHIA (AP) - A man has been convicted of third-degree murder in the stabbing death of a man who was about to go on tour with Nicki Minaj as her stage manager in 2015. Thirty-eight-year-old Khaliyfa Neely was convicted Friday of stabbing and killing 29-year-old De’Von Andre Pickett outside a Philadelphia bar. Neely will be sentenced April 24. An earlier trial for Neely ended in a hung jury last year. Another man, 36-year-old Pierce Boykin, was initially charged with the killing, but the charge was changed to aggravated assault when prosecutors thought the evidence pointed to Neely as the killer.\nBy Margie Szaroleta", "url": "https://apnews.com/2dd9ac23a20844afb18a91025de64f60"}