{"authors": ["Josh Dubow"], "date_download": "2020-05-04 20:29:02", "date_modify": "2020-05-04 20:29:02", "date_publish": "2020-04-21 00:22:21", "description": "General manager John Lynch added one first-round pick when the San Francisco 49ers traded away defensive stalwart DeForest Buckner at the start of the league year. Lynch would like to add...", "filename": "_0ce54c35cfcbea26ac5ffa9d76e077cb_1588624142.html", "image_url": "https://storage.googleapis.com/afs-prod/media/985c2df3703b4faf954782f7e69ece0e/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0ce54c35cfcbea26ac5ffa9d76e077cb_1588624142.html", "title": "49ers open to trading back in 1st round for more picks", "title_page": "49ers open to trading back in 1st round for more picks", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Feb. 2, 2020, file photo, San Francisco 49ers general manager John Lynch watches his team warm up for NFL football's Super Bowl 54 against the Kansas City Chiefs in Miami. \"You never stay the same,\" Lynch said at the scouting combine. \"You're either getting better or getting worse. We're into getting better. It becomes trickier with less draft equity and things of that nature, but we've got a lot of good players that are part of us moving forward as well.\" (AP Photo/David J. Phillip, File)\nFILE - In this Feb. 2, 2020, file photo, San Francisco 49ers general manager John Lynch watches his team warm up for NFL football's Super Bowl 54 against the Kansas City Chiefs in Miami. \"You never stay the same,\" Lynch said at the scouting combine. \"You're either getting better or getting worse. We're into getting better. It becomes trickier with less draft equity and things of that nature, but we've got a lot of good players that are part of us moving forward as well.\" (AP Photo/David J. Phillip, File)\nGeneral manager John Lynch added one first-round pick when the San Francisco 49ers traded away defensive stalwart DeForest Buckner at the start of the league year.\nLynch would like to add more picks before the end of the draft to replenish a stash that was depleted by two trades that helped San Francisco reach the Super Bowl this past season.\n“We’re open to trading,” Lynch said Monday. “I’m comfortable saying that we’re currently and we will right up to the draft let people know there are scenarios where we’re going to be open at both of those picks to moving back. It’s out there for everyone to see. We have two firsts and then we don’t have a pick until the fifth where we have two picks and then a sixth and then two sevenths. With those picks there’s a big gap in there.”\nThe Niners got the extra first-round pick by trading Buckner to Indianapolis at the start of the league year for the 13th overall pick in a move Lynch called one of the most difficult in his tenure as GM.\nBut the deal added a high draft pick and created salary cap room to retain key defensive starters like lineman Arik Armstead and safety Jimmie Ward.\n“We talked about we wanted to do our best to keep this team together,” Lynch said. “It became apparent in the discussions with him that that wasn’t going to be a possibility along with keeping our team together as we wanted to do so. The Colts entered the picture with a pick, not only a first-round pick but in the upper half. We weighed that with the opportunity to sign other guys. It was one of those business decisions that’s so tough.”\nThe Niners also have their own selection at No. 31 and have made it clear they are open for trades in the right situation to get additional picks before their next scheduled selection in the fifth round.\nLynch said he and coach Kyle Shanahan have identified about six players right now who they view as a potential “difference maker” who they wouldn’t pass up if they are available at No. 13.\n“We’re prepared for all scenarios, open to listening, but we’re also prepared that if we’re convicted at those spots we’ll stand pat and deliver the pick,” Lynch said.\nSan Francisco traded away picks in the second through fourth rounds in the past year, dealing a second-rounder for edge rusher Dee Ford and then third and fourth-round picks for receiver Emmanuel Sanders.\nFord dealt with injuries his first season with the 49ers but still made a big impact on the pass rush when healthy, while Sanders sparked the passing game after being acquired as a rental midway through the season.\n“You wish you had draft picks but in my mind it was worth it,” Lynch said.\nIn other news, Lynch said the team has been “actively” involved in trade talks about speedy receiver Marquise Goodwin, who had only 12 catches in nine games last season.\n“We have been in discussions,” Lynch said. “It came close a couple times. There a lot of different aspects to being able to close these deals. He’s a guy because we know he has value we can continue to hang on and we’ll see if something happens here.”\n— Lynch said he is optimistic that left tackle Joe Staley, who turns 36 in August, will be back for another season. Staley missed nine games last season with a broken leg and broken finger. Staley is under contract through 2021.\n“We’re encouraged,” Lynch said. “We’ve heard nothing that would lead us to believe that Joe is not going to play.”\n— Lynch said he’s hopeful center Weston Richburg, who had a season-ending knee injury last December, will be ready for the start of training camp. Lynch said Richburg’s status made it important for the team to re-sign backup Ben Garland as insurance earlier this offseason.\n— The Niners also announced that running back Jeff Wilson Jr. has signed his one-year tender. Wilson had 27 carries for 105 yards and four touchdowns last season.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/0ce54c35cfcbea26ac5ffa9d76e077cb"}