{"authors": [], "date_download": "2020-05-04 20:24:00", "date_modify": "2020-05-04 20:24:00", "date_publish": "2020-04-30 07:04:19", "description": "Tycoon Tom Hagen's wife, Anne-Elizabeth Falkevik Hagen, was first reported missing in 2018.", "filename": "entry_norway-tom-hagen-murder-wife_n_5eaa7314c5b62eaf043f0d3c_1588623840.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa76d9300000d11215529f.jpeg?cache=h6odcuiall&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_norway-tom-hagen-murder-wife_n_5eaa7314c5b62eaf043f0d3c_1588623840.html", "title": "One Of Norway's Wealthiest Men Arrested, Suspected Of Murdering Wife", "title_page": "One Of Norway's Wealthiest Men Arrested, Suspected Of Murdering Wife | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "COPENHAGEN, Denmark (AP) — One of Norway’s wealthiest men was arrested Tuesday in connection with his wife’s 2018 disappearance and held on suspicion of murder or complicity to murder in a case that police had earlier thought was a kidnapping.\nTom Hagen, a media-shy real estate investor and owner of an electric company, was arrested on his way to work, chief police investigator Tommy Broeske said.\nThe case had made headlines in the Scandinavian country, where police first reported that Anne-Elizabeth Falkevik Hagen had been abducted. Police had been told of her disappearance on Oct. 31, 2018, but didn’t publicly speak about it until Jan. 9, 2019, after which hundreds of tips poured in.\n“The case is characterized by a clearly planned deception,” Broeske told a news conference Tuesday in Oslo. “As other hypotheses have been weakened, suspicions against Tom Hagen have gradually been strengthened.”\nTom Hagen's wife Anne-Elizabeth Falkevik Hagen, 69, vanished from their home in October 2018 https://t.co/IK3u8VMoyn — SkyNews (@SkyNews) April 29, 2020\nProsecutor Aase Kjustad Eriksson said authorities would seek Wednesday to have Hagen held for four weeks in pre-trial custody and that more arrests were possible.\nPolice declined to elaborate on a motive due to the ongoing investigation.\nThe 69-year-old childhood sweetheart that Hagen had married at age 19 disappeared from the couple’s home in Loerenskog, east of Oslo, authorities said.\nA ransom for her release was demanded, police said in January 2019 but declined to give the amount. Norwegian newspaper VG said it was for 9 million euros ($850,980) to be paid in a cryptocurrency popular among cyber-criminals.\nPolice eventually released security videos of men walking back and forth outside Hagen’s workplace. Officers and police dogs were also seen scouring the grounds around the couple’s home and divers went into a nearby pond as police led a large investigation at home and abroad.\nHEIKO JUNGE via Getty Images Policemen search the residence of the Hagen couple in Lorenskog near Oslo, Norway, after Anne-Elisabeth Hagen's husband, Tom Hagen, was arrested in a police action in Lorenskog on April 28, 2020.\nIn June 2019, police changed their main hypothesis because of the absence of any signs that the missing woman was still alive or any recent contacts with the alleged kidnappers. They believe Falkevik Hagen, who has never been found, had been killed and said they “cannot exclude a staged kidnapping to hide it.”\nTom Hagen, the second-oldest in a farming family of 12 children, struck it rich in the real estate business he started in 1978. His fortune is estimated to be worth nearly 1.7 billion kroner ($161 million).", "url": "https://www.huffpost.com/entry/norway-tom-hagen-murder-wife_n_5eaa7314c5b62eaf043f0d3c"}