{"authors": ["Mark Long"], "date_download": "2020-05-04 20:17:01", "date_modify": "2020-05-04 20:17:01", "date_publish": "2020-04-16 19:59:09", "description": "JACKSONVILLE, Fla. (AP) — Jacksonville’s once-stout defense, which carried the franchise to the brink of the Super Bowl in 2018, is a shell of itself these days. The Jaguars traded Calais...", "filename": "_4cf9945acfe8ecaff0c4b8dcc21dbf25_1588623421.html", "image_url": "https://storage.googleapis.com/afs-prod/media/fc5d0db1786d4f7884dc1799f3c3c4ef/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4cf9945acfe8ecaff0c4b8dcc21dbf25_1588623421.html", "title": "Jaguars turn to NFL draft to rebuild once-stout defense", "title_page": "Jaguars turn to NFL draft to rebuild once-stout defense", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "South Carolina's Javon Kinlaw of the South squad runs drills during practice for the Senior Bowl Wednesday, Jan. 22, 2020, in Mobile, Ala. (AP Photo/Butch Dill)\nSouth Carolina's Javon Kinlaw of the South squad runs drills during practice for the Senior Bowl Wednesday, Jan. 22, 2020, in Mobile, Ala. (AP Photo/Butch Dill)\nJACKSONVILLE, Fla. (AP) — Jacksonville’s once-stout defense, which carried the franchise to the brink of the Super Bowl in 2018, is a shell of itself these days.\nThe Jaguars traded Calais Campbell, A.J. Bouye, Jalen Ramsey and Dante Fowler. They cut Marcell Dareus, Tashaun Gipson and Malik Jackson. They lost Telvin Smith and Paul Posluszny to retirement.\nThey could be without disgruntled pass-rusher Yannick Ngakoue next.\nRebuilding the unit is a must in the upcoming NFL draft. The Jaguars have 12 picks, including seven in the first four rounds, and no one would be surprised to see general manager Dave Caldwell and coach Doug Marrone use both first-round selections (Nos. 9 and 20) on defenders.\n“It’s huge,” Caldwell said via Zoom on Thursday. “This is the most draft capital we’ve had here and we need to hit on all 12, and that’s our philosophy. Our thought process is that we want to make every one of them count.”\nJacksonville created most of its defensive holes, some in hopes of improving a fractured locker room and others with the belief that it’s better to get rid of aging and expensive veterans a year too early than a year too late.\nThe Jags declined an option in Dareus’ contract, letting the team’s best run-stopper go. Then they traded Bouye to Denver, parting ways with a 2018 Pro Bowl starter, and dealt five-time Pro Bowl defensive end Campbell to Baltimore.\nThose moves created $45 million in salary cap space. They also added to a defensive void that started with the release of Gipson and Jackson in 2019, grew bigger when Smith abruptly stepped away from football last May and became untenable when Ramsey forced a trade in October following exchanges with Marrone, Caldwell and former executive Tom Coughlin.\nCaldwell signed five defenders in free agency, but three of those are considered stop-gap guys in case the draft doesn’t go as planned. He added middle linebacker Joe Schobert and defensive tackle Rodney Gunter to long-term deals and brought in nose tackle Al Woods, cornerback Rashaan Melvin and pass-rusher Cassius Marsh on one-year contracts.\nJacksonville tried to land cornerback Darqueze Dennard, agreeing to terms on a three-year deal worth $13.5 million, but he failed his physical. Losing Dennard left Jacksonville with a starting duo comprised of journeyman Melvin and third-year pro Tre Herndon.\nCornerback and defensive line are clearly Jacksonville’s most pressing needs heading into the draft. Long-term solutions at both spots could be found during the seven-round draft that begins April 23.\nAuburn defensive tackle Derrick Brown and South Carolina defensive tackle Javon Kinlaw are considered viable options at No. 9. LSU cornerback Kristian Fulton and Alabama cornerback Trevon Diggs should be there at No. 20.\nHaving a dozen selections gives Jacksonville the ability to move around and target certain guys.\n“It gives you a lot of flexibility,” Caldwell said.\nHere are some other things to know about Jacksonville as it prepares to select in the top 10 for the 12th time in the past 13 years:\nNGAKOUE UPDATE\nThe Jaguars don’t appear to be close to trading Ngakoue, who has made it clear he wants out of Jacksonville. There have been rumors about him landing in Philadelphia or Seattle, but Jacksonville has no plans to let him go for less than a first-round draft pick. He has not signed his franchise tender.\nMINSHEW MANIA\nNumerous mock drafts have Jacksonville taking a quarterback at No. 9 even though Caldwell traded Nick Foles to Chicago and took on $18.75 million in 2020 dead money — signs that the team is moving on with Gardner Minshew. Marrone did little to put those rumors to rest Thursday.\n“Right now, if we went to play, Gardner Minshew is our guy, and I’m excited about that,” Marrone said. “But do I want competition for him? Absolutely. You want competition for everyone, though.”\nSEC STREAK\nThe Jaguars have used their first two draft picks in each of the past three years on players from the powerhouse Southeastern Conference. It’s a turnabout from the previous regime, which between 2009 and 2012 used 16 of its 26 picks on guys from non-Power Five college programs while not drafting a single SEC player.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/4cf9945acfe8ecaff0c4b8dcc21dbf25"}