{"authors": ["Barry Wilner"], "date_download": "2020-05-04 20:20:22", "date_modify": "2020-05-04 20:20:22", "date_publish": "2020-04-07 16:30:33", "description": "Ron Mix likes what he has seen and read regarding the new labor agreement between the NFL and its players. The Pro Football Hall of Famer, a board member with the Pro Football Retired...", "filename": "_fc65fcd6128105d019ee325b0238eb9d_1588623622.html", "image_url": "https://storage.googleapis.com/afs-prod/media/7260ec1e2dcb41ac8d0fcf383d4ab75b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fc65fcd6128105d019ee325b0238eb9d_1588623622.html", "title": "NFL retirees mostly in favor of new labor agreement", "title_page": "NFL retirees mostly in favor of new labor agreement", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this May 2, 2014, file photo, Ron Mix is introduced before the inaugural Pro Football Hall of Fame Fan Fest at the International Exposition Center in Cleveland. Ron Mix likes what he has seen and read regarding the new labor agreement between the NFL and its players. The Pro Football Hall of Famer, board member with the Pro Football Retired Players Association and retired attorney believes players from every generation will benefit from the deal struck last month that runs through the 2030 season. (AP Photo/Mark Duncan, File)\nFILE - In this May 2, 2014, file photo, Ron Mix is introduced before the inaugural Pro Football Hall of Fame Fan Fest at the International Exposition Center in Cleveland. Ron Mix likes what he has seen and read regarding the new labor agreement between the NFL and its players. The Pro Football Hall of Famer, board member with the Pro Football Retired Players Association and retired attorney believes players from every generation will benefit from the deal struck last month that runs through the 2030 season. (AP Photo/Mark Duncan, File)\nRon Mix likes what he has seen and read regarding the new labor agreement between the NFL and its players.\nThe Pro Football Hall of Famer, a board member with the Pro Football Retired Players Association and a retired attorney, believes players from every generation will benefit from the deal struck last month that runs through the 2030 season. Mix retired after the 1971 season.\n“Ten years ago, the CBA helped correct the low pension benefits for retired players,” Mix says. “A baseball player who played the same time as me and the same number of years and inducted into the Hall of Fame receives a pension of $100,000 a year. My pension is $20,000. The current players and owners should really be applauded for making sure the new CBA addressed the pensions and the needs of the thousands of players who left with broken bodies and minds.\n“The new benefits are significant, improve players’ benefits by doubling in many instances. Aside from approved benefits, the new formula calls for $550 a month per vested season. This increases the pension benefits significantly for all players.”\nRecently, the labor agreement’s validity has been challenged by attorneys for safety Eric Reid, and questioned by others. They believe language changed from the deal the players voted on to the one now in force should void the agreement.\nMix prefers to concentrate on the positive aspects of the CBA that narrowly was approved by the NFL Players Association membership, 1,019-959.\n“I was never troubled by the thought it may not pass,” Mix says. “One of the things they did agree upon strongly was the increased pension and health benefits for retired players. Their disputes had to do with other parts of the CBA.\n“They gave benefits for widows and survivors and I thought that was just noble,” Mix adds, praising NFL Commissioner Roger Goodell and NFLPA Executive Director DeMaurice Smith for their commitment to helping the retirees.\n“I started the Pro Football Hall of Fame Players Association to develop products and events to benefit all Hall of Famers, and primarily, Hall of Famers in need. Any hall member or wife of a deceased member who needs financial assistance receives it. Substantial assistance. There’s no greater means to honor our deceased members than to do what they would have sought the most, take care of their spouses.\n“Whatever happens in this CBA, whether it’s attacked or there’s a new vote, their hearts are in the right places for retired players.”\nMix and Bob Schmidt, president of the PFRPA, also lauded Lisa Marie Riggins, wife of Hall of Fame fullback John Riggins and president/founder of Fairness for Athletes in Retirement (FAIR). She has been one of the strongest advocates for enhanced benefits for former players.\n“Lisa Marie has done an outstanding job of putting together the facts that would gain the interest of owners and players,” says Mix.\nSchmidt’s organization donated $100,000 to FAIR to fund the actuaries who show the differences between the pensions of football players and athletes in other sports, where the pensions were much higher.\nSchmidt, who played quarterback at Southern Cal in 1959-60 and has been involved with the PFRPA since its inception in 2016, is encouraged that today’s athletes and owners are paying tribute to members of his group.\n“I think the league finally is coming around to understanding these are the guys who built their business that is now near $15 billion,” Schmidt says.\n“I think there has been an improvement in each step and the good thing as we understand the new CBA — there’s still need for clarity on some issues — is the way the new pension is being put together is from three buckets.”\nThose “buckets” are the Bert Bell/Pete Rozelle pension established decades ago; the Legacy Fund from the 2011 agreement; and the new CBA.\n“The design is to have that new number in the pension equal $550 (per month) across the board for all (former) players, which is easier said than done,” Schmidt admits.\n“In the case of the Legacy Fund and 2020, they’re making no discrimination. They’ve dropped the qualifying term to three years of service for the older players. That universe of players is looking at a more substantial pension than they ever had.”\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/fc65fcd6128105d019ee325b0238eb9d"}