{"authors": ["Paul Heideman", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Luke Savage", "Nicole Aschoff", "John Patrick Leary"], "date_download": "2020-05-04 20:00:16", "date_modify": "2020-05-04 20:00:16", "date_publish": "2020-01-19 00:00:00", "description": null, "filename": "2020_01_third-way-democratic-socialism-tony-blair-bill-clinton-uk_1588622416.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/01/19150827/GettyImages-72018189.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_01_third-way-democratic-socialism-tony-blair-bill-clinton-uk_1588622416.html", "title": "The Third Way Is the Past. Socialism Is the Future.", "title_page": "The Third Way Is the Past. Socialism Is the Future.", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nMarxism has long scorned backward-looking ideologies. The Communist Manifesto ’s last section is a bracing polemic against those who adopt the mantle of socialism in order to defend feudal backwardness; Lenin’s first major work was an argument with radicals who hoped that Russia could avoid capitalist modernization; and Bertolt Brecht famously advised leftists: “Don’t start from the good old things but the bad new ones.” Marx’s discussion of the European revolutions of 1848 contains one of the most interesting variations on this theme, noting that while the upheavals clothed themselves in the garb of antiquity, the socialist revolution “cannot take its poetry from the past, but only from the future.” While these reflections on the ideological character of appeals to tradition are well-taken, the last few decades have revealed that a politics of the future can be no less fantastical. Exhibit A is the Third Way — the attempt, most notably in the United States and the United Kingdom, to chart a centrist path between conservatism and social democracy. The Left’s traditional ambitions to restrain the market, Third Way acolytes argued, were too old-fashioned, unsuited to the environs of modern capitalism. In the United States, these politics formed the basis of the Clinton and Obama presidencies, and in the UK, the premierships of Tony Blair and Gordon Brown. Today, the Third Way is in ruins. Jeremy Corbyn’s ascension to the Labour Party leadership marked a decisive repudiation of Blairite New Labour, and even though his recent election loss was a devastating one, there is little evidence that Blair’s ideological brethren will be able to capitalize on it to regain control of the party. In the United States, Hillary Clinton’s defeat at the hands of Donald Trump demonstrated the diminishing electoral returns of centrism. Meanwhile, Joe Biden, the heir apparent of the US Third Way, is running a campaign based solely on restoring Obama’s ancien régime, a pitch not one whit less backward-looking and nostalgic than Trump’s atavistic appeal to “Make America Great Again.” This utter ideological exhaustion stands in sharp contrast to the confidence with which Third Way practitioners developed and advanced their project in the 1980s and 1990s. How they arrived at their current state is an object lesson in the dangers of mistaking short-term developments for structural trends — and a reminder that sometimes the good old things, like socialism, provide a better starting point.\nThe Rise of the Third Way The Third Way has its origins, like so much of the contemporary world, in the economic crisis of the 1970s. In the United States, Jimmy Carter had come to power in 1976 in the wake of the Watergate scandal, running as a moderate, and the energies of the Left had largely been spent by the time his presidency began. In the UK, the Labour governments of Harold Wilson and James Callaghan, while hardly radical themselves, were convulsed by a massive wave of public workers’ struggles against the pay caps the government had instituted. Persistent economic crisis doomed governments on both sides of the Atlantic, bringing the Right to power in the person of Margaret Thatcher in 1979 and Ronald Reagan in 1980. The transatlantic pair immediately moved to roll back the gains of the Left of the 1960s and ’70s. The right-wing assault sparked intense intraparty conflict. In the United States, Massachusetts senator Edward Kennedy had challenged Jimmy Carter in the 1980 primary, accusing him of betraying the Democratic Party’s historic constituencies of workers, African Americans, and women. For influential voices in the party, however, the lesson from Carter’s subsequent defeat was not that he had abandoned these voting blocs, but rather that he had remained too closely identified with them. The solution? Turn its back on these “special interests,” and instead appeal to affluent, moderate (white) voters. The forces arguing for this transformation institutionalized themselves as the Democratic Leadership Council (DLC) in 1985. For the rest of the 1980s, the DLC concentrated on attacking the small left that existed in the Democratic Party, focusing special fire on Jesse Jackson’s social democratic campaign in 1988. In Labour, which had far deeper roots in the working class and a historic commitment to socialism, the fight was far fiercer. Initially, after the defeat of 1979, the Left enjoyed some momentum. Michael Foot was elected party leader on a platform of unilateral nuclear disarmament, leaving the North Atlantic Treaty Organization (NATO), and a national minimum wage. But after Labour lost the 1983 election even more decisively, the balance of forces shifted, and the right wing of the party started its ascent. The new leader, Neil Kinnock, though not from the Labour right himself, began reshaping the party to be more media-oriented and more moderate. Simultaneously, he waged war against the Labour left, marginalizing figures like Tony Benn and expelling a group of Trotskyists called the Militant tendency. Third Way politics reached a new stage with the election of Bill Clinton in 1992 and Tony Blair in 1997: consolidation. Clinton, the former president of the DLC, set the terms of Third Way dominance by appointing a cabinet at once more diverse and more populated by millionaires than any before. As president, he gutted welfare, deregulated the banking sector, expanded the war on crime, and guided US foreign policy toward ever-escalating levels of bellicosity. All of this was justified as a progressive politics appropriate to the modern world. In the UK, Tony Blair assumed leadership of the Labour Party in 1994 and led the charge to abandon Clause IV, which had long committed the Labour common ownership of the means of production. It was replaced with pablum about dynamism, diversity, and “the enterprise of the market and the rigour of competition.” When Blair was elected prime minister in 1997, he paired redistributive policies with the marketization of health care and education. In foreign policy, the shift was more dramatic. Blair backed first Clinton’s wars in the former Yugoslavia in the 1990s and then, most fatefully, George W. Bush’s attack on Iraq in 2003. At the close of the 1990s, the Third Way appeared a tremendous success. By dropping the traditional commitments of their parties, Third Way politicians in the United States and the UK had achieved levels of electoral success that had eluded them for decades. What’s more, the old left seemed routed. In the United States, Jesse Jackson’s halting attempts to build a left within the Democratic Party was a distant memory. In the UK, Tony Benn and his supporters — though committed gadflies through the Blairite years — were as far from power in the party as could be. The future, it appeared, had arrived.\nThe Fall of the Third Way Yet the successes of the Third Way proved its undoing. Nemesis came first for Tony Blair. Having eagerly attached the UK to the United States as a junior partner in empire — with hopes of both replicating Thatcher’s political success in the 1982 Falklands War and combating Britain’s long-standing postimperial malaise — Blair saw Bush’s drive to war in Iraq as an opportunity and threw his government’s support behind it. The mass opposition to the conflict took him by surprise: though Blair feigned indifference at the time, documents released later showed that his government was riven with divisions about how to respond to the movement’s militancy. As the war ground on and revealed itself to be an utter disaster, Blair’s problems only grew. Though Labour would go on to win the 2005 election, its majority shrank substantially, and Blair resigned as party leader in 2007. Gordon Brown, another New Labour centrist, succeeded him before being ushered out of government in 2010. In the United States, the discrediting of the Third Way took longer, collapsing not with a bang, but a whimper. Thanks to the Supreme Court, George W. Bush succeeded Bill Clinton, and thus the calamity in Iraq was laid at the feet of the GOP rather than the Democrats. Likewise with the 2008 financial crisis (even though Clinton’s deregulation of commercial and investment banking helped bring it about). But as the recession ravaged the country — only mildly tempered by the Obama administration’s tentative ameliorative measures — the Democrats lost ground in the House, the Senate, and state governments. When Hillary Clinton replaced Obama as the party’s standard-bearer, she inherited a party that had been hollowing out, a process her own defeat in 2016 would complete. And ironically, the Third Way — the supposed politics of the future — would be supplanted by the past it sought to bury.", "url": "https://www.jacobinmag.com/2020/01/third-way-democratic-socialism-tony-blair-bill-clinton-uk"}