{"authors": [], "date_download": "2020-05-04 20:05:11", "date_modify": "2020-05-04 20:05:11", "date_publish": "2020-04-07 22:54:00", "description": "SHREVEPORT, La. (AP) — A man wanted for questioning in connection with his girlfriend’s slaying and for shooting at a sheriff’s deputy was fatally shot Tuesday in a gunfight with law enforcement...", "filename": "_04a832e62b73ff87f619c561c5e717c4_1588622711.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_04a832e62b73ff87f619c561c5e717c4_1588622711.html", "title": "Man wanted in girlfriend's death fatally shot by authorities", "title_page": "Man wanted in girlfriend's death fatally shot by authorities", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SHREVEPORT, La. (AP) — A man wanted for questioning in connection with his girlfriend’s slaying and for shooting at a sheriff’s deputy was fatally shot Tuesday in a gunfight with law enforcement authorities.\nDerek Swanson, 28, started the shootout as he left a home he’d broken into about 12:15 p.m. Tuesday, the Caddo Parish Sheriff’s office said in a statement. Three Louisiana state police troopers and a sheriff’s deputy fired back, killing Swanson, the statement said. None of the officers was hurt.\nSwanson was wanted in connection with the death of his girlfriend, 26-year-old Taylor Baskins. She was shot multiple times Friday in Shreveport’s Highland neighborhood.\nOn Monday, Swanson walked into a house and took a gun, but threw it back down after realizing it wasn’t loaded, the sheriff’s office said. He also tried to steal another man’s truck while armed with a stick, the authorities said.\nThat same day, a Caddo Parish deputy saw Swanson and tried to question him but Swanson pulled out a gun, shot at the deputy — missing him — and fled, the sheriff’s office said in an earlier statement.", "url": "https://apnews.com/04a832e62b73ff87f619c561c5e717c4"}