{"authors": ["Opinion Sarah Friar", "Cynthia Bissett Germanotta"], "date_download": "2020-05-04 16:16:15", "date_modify": "2020-05-04 16:16:15", "date_publish": "2020-04-03 12:00:29", "description": "Sarah Friar and Cynthia Bissett Germanotta write that the stories of generosity and compassion that are surfacing around the world during this time prove that kindness is what will carry us through this challenging time. It will keep us healthy. It will hold our local communities together. It will lift our spirits.", "filename": "2020_04_03_opinions_kindnes_ab199a30b8c4961bafd7e21c1253d475_index_1588608975.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200319015423-acts-of-kindness-savidge-pkg-01-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_opinions_kindnes_ab199a30b8c4961bafd7e21c1253d475_index_1588608975.html", "title": "Covid-19 is challenging the world to be kinder", "title_page": "Covid-19 is challenging the world to be kinder (Opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Sarah Friar is CEO of Nextdoor, an online neighborhood hub to help people make connections and exchange helpful information, goods, and services. Cynthia Bissett Germanotta is President of Born This Way Foundation, which she co-founded with her daughter Lady Gaga in 2012. In 2017, the foundation launched Channel Kindness, a digital platform for young people to tell their stories of kindness, resilience, and community. The opinions expressed in this commentary are those of the authors; view more opinion articles on CNN.\n(CNN) In the midst of a global pandemic, we see a surge in something that gives us hope: Kindness is trending.\nWe are seeing it everywhere -- from the grocery store clerk in Atlanta organizing food runs for elderly neighbors, to the Bay Area dad hosting virtual storytime so exhausted parents can take a break.\nThese stories of generosity and compassion are surfacing around the world. And as these small actions repeat -- and scale -- we see a habit of daily kindness emerging globally.\nWe believe kindness is what will carry us through this challenging time. Of course kindness can't ensure our physical health, but it can help with feeling isolated during social distancing. In this way, it can help keep us healthy. It will hold our local communities together. It will lift our spirits.\nIn crisis, kindness becomes a daily habit\nToday, just behind the medical professionals on the frontline of this pandemic, acts of kindness are a first line of support for the most vulnerable among us.\nActs of kindness and the offers of help are skyrocketing on digital platforms everywhere . Strangers are coming together to organize medical supply drives for doctors and nurses. Neighbors are rallying to support their local businesses, desperate for cash flow while we shelter in place.\nOn the Nextdoor platform, an app that helps neighbors stay connected, we've seen the average number of \"thank yous\" shared among neighbors more than double this week. These expressions of gratitude are one measurable indicator of kindness -- a signal that we are helping one another and appreciating the people around us more than ever.\nResearch shows that we lean into kindness when tragedy strikes. A 2008 study of the aftermath of Hurricane Katrina shattered the myth that disasters bring out the worst in people and reported that \"most people respond positively and generously.\" And we know that being kind does not need to be an \"emergencies only\" phenomenon. In fact, we may have been born this way. Studies have suggested that certain traits, such as kindness, are programmed in our DNA.\nIt is in our nature to be kind. And many have lost touch with their communities\nHistorically, a reliance on those in geographic proximity to survive was all the incentive humans needed to be kind -- from ancient tribes of hunters and gatherers to suburban neighbors in the 1950s who might have needed to borrow a cup of sugar.\nIn the book \"Tribe,\" Sebastian Junger lamented the loss of \"tribal connection\" in modern society. In a later interview, he expanded on his thoughts . \"You're part of the tribe because it's where you live, and who you live among. To feel connected and invested in that tribe is to have a common purpose and, by extension, to be psychologically more healthy.\"\nAs the unifying purpose -- the mutual dependence -- of our geographic tribes (i.e. our neighbors and our communities) has diminished in our evermore fragmented society, evidence suggests that isolation and loneliness have become more pervasive. In the United States, a Cigna study found that more than 40% of adults report feeling lonely.\n\"Loneliness has the same impact on mortality as smoking 15 cigarettes a day, making it even more dangerous than obesity,\" the study says.\nConnection is making a comeback, and there is value in that\nNow is the time to reconnect to our neighborhoods and to offer to help however we can -- from a safe social distance, of course.\nJUST WATCHED Trooper gives doctor medical masks instead of speeding ticket Replay More Videos ... MUST WATCH Trooper gives doctor medical masks instead of speeding ticket 02:35\nIn our digital world, we are seeing individuals use online platforms to bridge divides and connect with their communities.\nBut meeting those in the next apartment, next house, next door over can be difficult. While global friends and professional circles are important, they can't carry the groceries to an elderly parent. This is why we need good neighbors -- why proximity matters.\nAnd strengthening these community bonds is what will keep us healthy and strong, emotionally, physically and even financially -- as neighborhoods, and as individuals.\nBeing kind is good for your health -- and the survival of our communities\nA Born This Way Foundation report looked at the connection between the mental health of young people between the ages of 15 to 24, and found that those who defined their communities as kind had better mental health, demonstrating the importance of kindness to mental wellness. It stands to reason that this correlation between kindness and mental health, established during formative years, remains part of our condition into adulthood. And the impact of building positive relationships on one's physical and emotional health is also well documented.\nHow can you reach out and build relationships in your neighborhood now -- in a time where so many of us are being told to shelter in place?\nHere are a few ideas for those who are healthy and able:\nOffer to walk a neighbor's dog.\nEmail a local business owner and ask how you can support them. (Buy a gift card or two.)\nPick up an elderly neighbor's prescriptions.\nCall a neighbor who lives alone for regular check-ins.\nOrganize for kids to \"see\" each other on video for a quick playdate.\nShare your story on Nextdoor and Channel Kindness, Born This Way Foundation's storytelling platform.\nThese are simple, accessible acts of kindness that will go a long way, especially in a time when so many are in need of assistance and searching for optimism. And it goes both ways -- making these connections with neighbors can help us feel less lonely and more empathetic. Now is the time to reach out and build neighborhoods we can rely on.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nWe challenge you to channel kindness and step forward to help as you can. You may just find this is exactly what we need to get through it together.\nNote: This article has been updated with a fuller description of how kindness can contribute to better mental health in this crisis.", "url": "https://www.cnn.com/2020/04/03/opinions/kindness-increase-covid-19-pandemic-friar-bissett-germanotta/index.html"}