{"authors": ["Senior Culture Writer"], "date_download": "2020-05-04 20:03:33", "date_modify": "2020-05-04 20:03:33", "date_publish": "2020-05-04 18:48:41", "description": "The glossy 1940s Netflix drama wears its heart on its sleeve, but is that such a bad thing?", "filename": "entry_hollywood-escape-fantasy-netflix-series_n_5eb03f1ec5b6283db9a48e28_1588622613.html", "image_url": "https://img.huffingtonpost.com/asset/5eb05db02200001510828209.png?cache=tarjaqfv6u&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_hollywood-escape-fantasy-netflix-series_n_5eb03f1ec5b6283db9a48e28_1588622613.html", "title": "'Hollywood' Is The Perfect Escape Fantasy In These Uncertain Times", "title_page": "'Hollywood' Is The Perfect Escape Fantasy In These Uncertain Times | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "In 1942, Lena Horne made history when she signed a seven-year contract with MGM. She wasn’t the first Black performer to sign a long-term contract with a major studio (MGM had signed actress Nina Mae McKinney to a five-year contract in 1929), but she was the first to receive the full glamour-girl treatment. Horne was meant to become a star, on the same level with white leading ladies of the era like Bette Davis, Joan Fontaine and Ava Gardner.\nHorne was insistent upon signing the contract that she would not play maids or slaves on screen. But it soon became clear that MGM had no idea what to do with her. She was given cameos and bit parts as “exotic” singers during nightclub scenes, but denied meaty and substantial leading roles. Horne campaigned hard for the role of Julie, a white-passing Black woman, in the 1951 movie “Show Boat.” The role went to Gardner, however, because studio executives were afraid to cast a Black actress in a lead role, especially one in which she would play opposite a white male romantic lead. Later, Horne would say that signing with MGM was one of her biggest regrets.\n“Hollywood,” the new Ryan Murphy drama series that premiered Friday on Netflix, imagines what could have been if Horne, or someone like her, actually got to become a studio star in the Golden Age of Hollywood. The series is a counter-factual fantasy set in an alternate universe, featuring a mixture of original characters and historical figures. The show asks: What would have happened if mainstream Hollywood filmmakers had started championing inclusivity and diversity 70 years ago?\nThe truth that the show reveals over its eight episodes is simple but searing: The disaster of Horne’s MGM run, the tragedy of Dorothy Dandridge’s post-Oscar-nomination career, the fact that Anna May Wong lost out on what rightfully should have been her role in “The Good Earth,” and a million other realities of inequality were all the result of cowardice, complacency and a severe lack of imagination. “Hollywood” may feel fantastical, but the scenarios it posits could have happened and probably should have.\nThe series offers several things so rarely seen on screen, including but not limited to women over the age of 60 being unapologetically sexual (71-year-old Patti LuPone has her first onscreen sex scene), depictions of sex work that aren’t demonizing, and multiple scenes in which historically marginalized people talk about what representation means to them. In this show, what would be subtext in another glossy period series about Hollywood is very much text.\nIn one episode, Avis Amberg (played by the resplendent LuPone) has become interim head of Ace Studios after her studio-chief husband has a heart attack. She’s in a position to cast Camille Washington, a Black contract player at the studio, in a drama loosely based on the life of actress Peg Entwistle, which is being written by Black gay writer Archie Coleman and directed by half-Filipino filmmaker Raymond Ainsley.\n“It’s a shame ― she’s the best actress for the part,” Avis tells her friend, who just happens to be former first lady Eleanor Roosevelt, at a lunch. “But she’s colored.”\nIn the real world, or even in another kind of show, the conversation would be left at that. But in “Hollywood,” Roosevelt insists that Avis cast Camille, emphasizing the impact her face on the silver screen could make for a little Black girl who had never seen herself up on screen.\n“Sometimes I think folks in this town don’t really understand the power they have,” Roosevelt said. “Movies don’t just show us how the world is; they show us how the world can be.”\n“If we change the way that movies are made, you take a chance and you make a different kind of story, I think you can change the world.”\nSo Avis uses her new power to cast Camille and greenlight the film, which by the end of the series breaks every box office record and nabs numerous Oscar nominations. Camille becomes the first Black woman to win a Best Actress Oscar, Wong finally receives an Oscar too, and Archie, upon winning his Best Screenplay award, declares his love for boyfriend Rock Hudson on the Academy Awards stage. Hudson lives openly as a gay man, and a woman runs one of the biggest studios in town.\nVery often, art about the Hollywood of the past is really about the present. “Once Upon a Time ... in Hollywood,” another revisionist history film, taps into the chaotic, underlying dread around Charles Manson’s crime spree at a time when the world feels equally chaotic, though in different ways.\n“Hollywood,” in turn, taps into a need for order, for decency, for making sense in nonsensical times. For all its brash glossiness, its sex and scandal, “Hollywood” is a deeply earnest show. This earnestness could be read as a kind of naivete — some critiques of the show have argued that it ultimately oversimplifies the representation conversation, that it’s simply hollow wish fulfillment.\nI get it: Representation alone will not save us, and the movie industry has a tendency toward self-aggrandizing fantasies that leave little space for nuance. But in this bizarre time of social distancing, when people are relying on art to connect and self-soothe, the wide-eyed sincerity of “Hollywood” is simply comforting. There’s a catharsis in the fantasy, and even truth.\n“Hollywood” doesn’t suggest that everything has changed just because one movie was made or one award was won. What the show explores — and is really championing — is the significance of momentum. That a series like “Hollywood” could even exist — with its diverse cast, its unabashedly queer romance, its LGBTQ executive producers Ryan Murphy and Janet Mock — is a testament to the very themes the show highlights.", "url": "https://www.huffpost.com/entry/hollywood-escape-fantasy-netflix-series_n_5eb03f1ec5b6283db9a48e28"}