{"authors": [], "date_download": "2020-05-04 21:06:50", "date_modify": "2020-05-04 21:06:50", "date_publish": "2020-04-20 19:14:32", "description": "WINFIELD, Kan. (AP) — Dave Seaton, the longtime former editor and publisher of the Winfield Daily Courier and a member of a prominent newspaper family, died Saturday. He was 80. His son,...", "filename": "_21cc8db749879b06a9cd9b8a988c1fc7_1588626410.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_21cc8db749879b06a9cd9b8a988c1fc7_1588626410.html", "title": "Longtime Kansas newspaper publisher Dave Seaton dies at 80", "title_page": "Longtime Kansas newspaper publisher Dave Seaton dies at 80", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WINFIELD, Kan. (AP) — Dave Seaton, the longtime former editor and publisher of the Winfield Daily Courier and a member of a prominent newspaper family, died Saturday. He was 80.\nHis son, David Allen Seaton, confirmed that his father died at the hospital in Winfield. He said his father’s health had been failing and that he had undergone heart surgery about a year ago.\n“My Dad was a lion in community journalism in Kansas,” wrote his son, who is president of the Winfield Publishing Company, which includes The Cowley CourierTraveler and the Newkirk (Oklahoma) Herald Journal. “He saw his role as publisher and newspaper owner as one of advocacy and community leadership, in the tradition of William Allen White. And he could write. His concise, insightful editorials, especially about state issues, were admired by many (and scorned by others!).”\nAfter earning a bachelor’s degree in history from Harvard University and a master’s degree from Columbia University School of International Affairs, the elder Seaton and his wife, Callie, served for two years in the Peace Corps in Brazil. He then was press secretary and legislative aide to U.S. Sen. James B. Pearson of Kansas.\nIn 1978, he went to work for Winfield Publishing Co., part of the Seaton media group, which has seen four generations of family members operate newspapers in Kansas, according to the Kansas Press Association .\nSeaton served as president of the Kansas Press Association in 1991 and was inducted into the Kansas Newspaper Hall of Fame in 2010.", "url": "https://apnews.com/21cc8db749879b06a9cd9b8a988c1fc7"}