{"authors": ["Reporter"], "date_download": "2020-05-04 20:27:05", "date_modify": "2020-05-04 20:27:05", "date_publish": "2020-04-28 21:49:16", "description": "The former “Parks and Recreation” star recalls an encounter with a teenaged Cruise when the two had to share a hotel room.", "filename": "entry_rob-lowe-tom-cruise-went-ballistic-during-the-outsiders-gnarly_n_5ea1ee63c5b6ea65119b480f_1588624025.html", "image_url": "https://img.huffingtonpost.com/asset/5ea887243000002711155135.jpeg?cache=7sspej5pko&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_rob-lowe-tom-cruise-went-ballistic-during-the-outsiders-gnarly_n_5ea1ee63c5b6ea65119b480f_1588624025.html", "title": "Rob Lowe Says Tom Cruise 'Went Ballistic' During 'The Outsiders': ‘It Was Gnarly’", "title_page": "Rob Lowe Says Tom Cruise 'Went Ballistic' During 'The Outsiders': ‘It Was Gnarly’ | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Tom Cruise apparently displayed diva-like behavior before he was famous ― and it may be why he’s where he is today.\nAt least according to Rob Lowe.\nOn Monday, the former “Parks and Recreation” star told Dax Shepard on his podcast “Armchair Expert” that when he and Cruise were virtual unknowns in Hollywood and were auditioning for roles in Francis Ford Coppola’s 1983 movie “The Outsiders” a teenaged Cruise acted like he was already a major movie star in the lobby of New York’s Plaza Hotel.\n“We check-in and Tom finds out that we’re sharing a room and just goes balliiiiiiiiistic,” Lowe said.\nLowe explained that in the moment, he remembers, “going, ‘Wow, this guy is the real deal’. I mean it made me laugh, it was gnarly.”\nBut in retrospect, the 56-year-old “9-1-1: Lone Star” star doesn’t necessarily see Cruise’s actions as a bad thing.\n“To me, what’s great about the story is, there’s certain people who have always been who they are, and that element of them has powered them to where they are today and the rest is history,” Lowe said.\nHe continued:\n“And the notion that an 18-year-old actor with a walk-on part in ‘Endless Love’ and like a seventh lead in ‘Taps’ could have that kind of like wherewithal.”\nSunset Boulevard via Getty Images The cast of 1983's \"The Outsiders,\" directed by Francis Ford Coppola, turned out to be truly star-studded. Top row, left to right: Patrick Swayze, Matt Dillon, Rob Lowe; bottom row, left to right: Emilio Estevez, Ralph Macchio, C. Thomas Howell and Tom Cruise.\n“But at the end of it, you can’t argue with the results,” Lowe concluded. “He’s had his eye on the ball since day one.”\nThe coming-of-age drama, set in the 1960s, was a springboard for a bunch of future stars, including Matt Dillon, Diane Lane, Emilio Estevez, Ralph Macchio, C. Thomas Howell and Patrick Swayze — who Lowe also shared a few incredible stories about (which you can hear in the podcast above).\nLowe also offered another fun anecdote about Cruise’s persistent drive, which he said recently led him to get into a YouTube “rabbit hole” where he watched videos of Cruise doing his own stunts in the “Mission Impossible” movies.\n“It took me back to being in the Tulsa gymnasium where we had to learn backflips,” Lowe said.\nHe explained that during the filming of “The Outsiders” in Oklahoma, Coppola “had a lot of ideas that I don’t know what was going on.” One of these included all the young actors learning how to backflip, which Lowe described as “really scary” and “hard as fuck to learn.” But because Cruise was “relentlessly competitive,” he was the only one who learned how to do it.\n“[His backflip] is in the movie ‘The Outsiders’ for no reason,” Lowe said. “He runs out of the house and does a backflip for no reason, just to do it.”", "url": "https://www.huffpost.com/entry/rob-lowe-tom-cruise-went-ballistic-during-the-outsiders-gnarly_n_5ea1ee63c5b6ea65119b480f"}