{"authors": [], "date_download": "2020-05-04 20:26:53", "date_modify": "2020-05-04 20:26:53", "date_publish": "2020-04-17 16:57:36", "description": "MILWAUKEE (AP) — Eugene Kane, an award-winning columnist for the Milwaukee Journal Sentinel who wrote about racial injustices and inequities, has died at age 63. Kane was pronounced dead...", "filename": "_b5f6443fde1d91b7da0761cde594d6f1_1588624013.html", "image_url": "https://storage.googleapis.com/afs-prod/media/5db6b9d688b84fc7ba6e057e75bca410/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b5f6443fde1d91b7da0761cde594d6f1_1588624013.html", "title": "Former Journal Sentinel columnist Eugene Kane dead at 63", "title_page": "Former Journal Sentinel columnist Eugene Kane dead at 63", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This Dec. 2008 portrait shows former Milwaukee Journal Sentinel columnist Eugene Kane, an award-winning columnist who wrote about racial injustices and inequities. Kane was pronounced dead Thursday, April 16, 2020 at age 63, according to the Milwaukee County Medical Examiner's Office. No cause of death was immediately released. (Kevin Eisenhut/Milwaukee Journal-Sentinel via AP) This Dec. 2008 portrait shows former Milwaukee Journal Sentinel columnist Eugene Kane, an award-winning columnist who wrote about racial injustices and inequities. Kane was pronounced dead Thursday, April 16, 2020 at age 63, according to the Milwaukee County Medical Examiner's Office. No cause of death was immediately released. (Kevin Eisenhut/Milwaukee Journal-Sentinel via AP)\nMILWAUKEE (AP) — Eugene Kane, an award-winning columnist for the Milwaukee Journal Sentinel who wrote about racial injustices and inequities, has died at age 63.\nKane was pronounced dead Thursday, according to the Milwaukee County Medical Examiner’s Office. No cause of death was immediately released.\nKane covered a number of beats before becoming best known for his column Raising Kane, which challenged readers to deal with race as a force in politics, culture, business and the media.\n“Eugene was a passionate journalist and wonderful writer who cared deeply about justice. As a columnist, he encouraged the people of Milwaukee and America to listen to our better angels, to confront our failures and to not surrender to accepting racial injustices and inequities. He urged us all, including himself, to be better,” said George Stanley, editor of the Milwaukee Journal Sentinel and regional editor of USA TODAY-Wisconsin.\nKane faced a number of health issues over the last several years, according to the Journal Sentinel . He suffered a stroke while driving to visit his sister near Washington, D.C. in 2015.\nMilwaukee Mayor Tom Barrett called Kane a gifted writer who was passionate about justice.\n“I knew him for decades. There were times we worked closely together. There were times when he challenged me and challenged the city. And, every time that he challenged us I took it very seriously because I knew that he was speaking from a place of wanting to do what’s right for the people of this community,” Barrett said.\nKane, who never married and didn’t have any children, graduated from Temple University and moved from Philadelphia to Milwaukee in September 1984 to work for the Milwaukee Journal, the city’s evening newspaper.\nHe was a two-time National Headliner Award winner for Best Local Column; a National Association of Black Journalists award winner for Best Commentary; and a Sigma Delta Chi Award winner from the Society of Professional Journalists for Best General Column.\nKane left the Journal Sentinel in 2012, after a 28-year career.", "url": "https://apnews.com/b5f6443fde1d91b7da0761cde594d6f1"}