{"authors": [], "date_download": "2020-05-04 20:29:05", "date_modify": "2020-05-04 20:29:05", "date_publish": "2020-04-21 01:49:49", "description": "MONTGOMERY, Ala. (AP) — An Alabama man accused of kidnapping and killing the stepdaughter of a UFC fighter has also been charged with biting a correctional officer while in jail, authorities said....", "filename": "_59dd413c34267c88ad07cdfa83acfc96_1588624145.html", "image_url": "https://storage.googleapis.com/afs-prod/media/746e64869c4740719708f01ecc56f005/2000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_59dd413c34267c88ad07cdfa83acfc96_1588624145.html", "title": "Man charged in Aniah Blanchard's death bit officer", "title_page": "Records: Man charged in Aniah Blanchard's death bit officer", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - This photo provided by the Auburn Police Department in Alabama, shows Ibraheem Yazeed. Authorities said Yazeed, who is accused of kidnapping and killing the stepdaughter of a UFC fighter, has also been charged with biting a correctional officer while in jail. Yazeed was charged with second-degree assault in connection with a March 23, 2020, incident at the Lee County Detention Center. (Auburn Police Department via AP, File) FILE - This photo provided by the Auburn Police Department in Alabama, shows Ibraheem Yazeed. Authorities said Yazeed, who is accused of kidnapping and killing the stepdaughter of a UFC fighter, has also been charged with biting a correctional officer while in jail. Yazeed was charged with second-degree assault in connection with a March 23, 2020, incident at the Lee County Detention Center. (Auburn Police Department via AP, File)\nMONTGOMERY, Ala. (AP) — An Alabama man accused of kidnapping and killing the stepdaughter of a UFC fighter has also been charged with biting a correctional officer while in jail, authorities said.\nIbraheem Yazeed, 30, was charged with second-degree assault in connection with a March 23 incident at the Lee County Detention Center, news outlets reported Monday.\nCourt records said three officers were taking Yazeed back to his cell when Yazeed became hostile and refused to enter.\nOne of the officers attempted to use a stun gun on Yazeed but he continued to be combative, swinging and kicking at the officers, records said.\nTwo more officers came to help and Yazeed bit one of them in the leg, records said.\nYazeed was previously charged with capital murder in the death of 19-year-old Aniah Blanchard.\nBlanchard was last seen on Oct. 23 and her remains were found Nov. 25. in Auburn. She was the stepdaughter of UFC fighter Walt Harris and a student at Southern Union College.\nYazeed was out on bond for kidnapping and attempted murder charges at the time of Blanchard’s death. He had been given the maximum bond on the state’s bail schedule, news outlets reported.\nIn February, the Alabama House of Representatives approved a bill , named after Blanchard, that would allow judges to deny bond to people accused of committing violent crimes.\nIt’s unclear whether Yazeed had an attorney who could comment on his behalf.", "url": "https://apnews.com/59dd413c34267c88ad07cdfa83acfc96"}