{"authors": [], "date_download": "2020-05-04 20:25:08", "date_modify": "2020-05-04 20:25:08", "date_publish": "2020-04-29 21:22:51", "description": "The ruling by a federal appeals court panel dealt a blow to efforts by Republicans in several states to enact restrictive voting laws.", "filename": "entry_court-kansas-no-citizenship-proof-voting_n_5ea9ee1ec5b6a89866f9db79_1588623908.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9ee7b240000c6018e9f8e.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_court-kansas-no-citizenship-proof-voting_n_5ea9ee1ec5b6a89866f9db79_1588623908.html", "title": "Court Rules Kansas Can’t Require Voters To Show Proof Of Citizenship", "title_page": "Court Rules Kansas Can’t Require Voters To Show Proof Of Citizenship | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "BELLE PLAINE, Kan. (AP) — A federal appeals court panel ruled Wednesday that Kansas can’t require voters to show proof of citizenship when they register, dealing a blow to efforts by Republicans in several states who have pursued restrictive voting laws as a way of combating voter fraud.\nThe 10th Circuit Court of Appeals panel in Salt Lake City upheld a federal judge’s injunction nearly two years ago that prohibited Kansas from enforcing the requirement, which took effect in 2013. The appeals court, in a ruling that consolidated two appeals, found the statute former Gov. Sam Brownback signed into law violates the U.S. Constitution’s Equal Protection Clause and the National Voter Registration Act, commonly known as the “motor-voter law.”\nMany experts say voter fraud is extremely rare, and critics contend the Republican-led efforts are actually meant to suppress turnout from groups who tend to back Democrats, including racial minorities and college students.\nThe law was championed by former Kansas Secretary of State Kris Kobach, who led President Donald Trump’s now-defunct voter fraud commission. Kobach was a leading source for Trump’s unsubstantiated claim that millions of immigrants living in the U.S. illegally may have voted in the 2016 election.\nDale Ho, director of the American Civil Liberties Union’s Voting Rights Project, said that the ruling doesn’t immediately affect other states because Kansas’s law was unique in requiring people to show a physical document such as a birth certificate or passport when applying to register to vote. However, Ho said the ruling is grounded in a broader constitutional principle that when a state significantly burdens the right to vote, it has to justify it.\n“Kansas wasn’t able to muster evidence that the law in question here was necessary to prevent voter fraud, and I think that broader principle could have reverberations beyond the specific context of this case in a wide range of disputes over voting access between now and November,” Ho said.\nThe decision is binding in states covered by the 10th Circuit, which also covers Oklahoma, New Mexico, Colorado, Wyoming, and Utah, plus those portions of the Yellowstone National Park extending into Montana and Idaho.\nIn reaching the decision, the appeals court noted the “significant burden quantified by the 31,089 voters who had their registration applications cancelled or suspended” in Kansas. They said the interests of the secretary of state do “not justify the burden imposed on the right to vote.”\nKansas argued in court filings that it has a compelling interest in preventing voter fraud. It contended its proof-of-citizenship requirement is not a significant burden and protects the integrity of elections and the accuracy of voter rolls.\nCritics countered that the documentary proof-of-citizenship law was “a disastrous experiment” that damaged the state’s voter rolls, disenfranchised tens of thousands and eroded confidence in the state’s elections.\nWhile the court agreed “in the abstract” that Kansas has a legitimate interest in counting only the votes of eligible voters, the court in an 84-page ruling said it did not see any evidence that such an interest made it necessary to burden voters’ rights in this case.\nThe judges noted that the district court had found essentially no evidence that the integrity of the state’s electoral process had been threatened, that the registration of ineligible voters had caused voter rolls to be inaccurate, or that voter fraud had occurred.\nIt found that at most 67 noncitizens registered or attempted to register in Kansas in the last 19 years.\n“Thus we are left with this incredibly slight evidence that Kansas’s interest in counting only the votes of eligible voters is under threat,” according to the ruling. “Indeed, even as to those 39 noncitizens who appear on the Kansas voter rolls, the district court found that ‘administrative anomalies’ could account for the presence of many — or perhaps even most — of them there.”\nThe judges also noted that the district court had found that even under the calculations of the state’s experts, the estimated number of suspended applications that belonged to noncitizens was “statistically indistinguishable from zero.”\n“This law disenfranchised tens of thousands of Kansans, denying them the most fundamental right in our democracy,” Ho said.\nHe called for current Kansas Secretary of State Scott Schwab to drop any appeals and “turn the page on Kris Kobach’s sorry legacy of voter suppression.”\nSchwab, a Republican who supported the law as a legislator, said in a written statement that his office is reviewing the decision and will confer with the attorney general on how to move forward.\nKobach said he’s not surprised by the “clearly incorrect” ruling by the appeals court judges, based on their judicial philosophy. He said the judges disregarded the plain meaning of the voter registration law’s text, making the decision the “essence of judicial activism.” He urged Schwab to appeal.\n“The Kansas law is crucial for protecting the integrity of our voter rolls and this decision — this deeply flawed decision — should not be allowed to stand,” Kobach said.\nKansas Gov. Laura Kelly, a Democrat, said the state should drop its appeal, but that decision is not up to her.\n“I think what it tells us is what we have thought for a long time, that we ought to be doing everything we can to encourage voting,” Kelly said. “If we have a problem with voting in the state of Kansas and across the country, it is that not enough people exercise their right. So I think eliminating any barriers to voting is a good thing.”\n___\nAssociated Press Writer John Hanna contributed to this story from Topeka. Associated Press Writer Heather Hollingsworth also contributed to the story from Mission, Kansas.", "url": "https://www.huffpost.com/entry/court-kansas-no-citizenship-proof-voting_n_5ea9ee1ec5b6a89866f9db79"}