{"authors": ["Scott Bauer"], "date_download": "2020-05-04 20:20:42", "date_modify": "2020-05-04 20:20:42", "date_publish": "2020-04-15 17:20:31", "description": "MADISON, Wis. (AP) — Air National Guard units based in Wisconsin and Alabama have been awarded squadrons of F-35 fighter jets, the U.S. Air Force announced Wednesday, overcoming vocal opposition...", "filename": "_f403128f16a818e499306968999dd7e6_1588623642.html", "image_url": "https://storage.googleapis.com/afs-prod/media/16a1e652685a474baf1a93efca7f5c6f/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f403128f16a818e499306968999dd7e6_1588623642.html", "title": "Wisconsin, Alabama awarded F-35 fighter jets", "title_page": "Wisconsin, Alabama awarded F-35 fighter jets ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Sept. 19, 2019 file photo, the an F-35 fighter jet arrives at the Vermont Air National Guard base in South Burlington, Vt. The Wisconsin Air National Guard unit based in Madison has been awarded a squadron of F-35 fighter jets. U.S. Sen. Ron Johnson said Wednesday, April 15, 2020 that the Air Force had decided to award the jets to Wisconsin. (AP Photo/Wilson Ring, File)\nFILE - In this Sept. 19, 2019 file photo, the an F-35 fighter jet arrives at the Vermont Air National Guard base in South Burlington, Vt. The Wisconsin Air National Guard unit based in Madison has been awarded a squadron of F-35 fighter jets. U.S. Sen. Ron Johnson said Wednesday, April 15, 2020 that the Air Force had decided to award the jets to Wisconsin. (AP Photo/Wilson Ring, File)\nMADISON, Wis. (AP) — Air National Guard units based in Wisconsin and Alabama have been awarded squadrons of F-35 fighter jets, the U.S. Air Force announced Wednesday, overcoming vocal opposition from people who live near the base in Wisconsin’s capital city.\nThe jets will be placed with the Wisconsin Air National Guard’s 115th Fighter Wing at Truax Field in Madison and with the 187th Fighter Wing at Dannelly Field in Montgomery, Alabama. The first jets are expected to arrive in late 2023.\nThe jets will replace older F-16 aircraft and will allow the Air Force to meet other requirements for readiness and training, the Air Force said in a statement.\nLocating the jets in Madison has divided the state and community over the past three years, with many people who live near the airport saying noise and pollution from the jets will lessen their quality of life and value of their homes. The Air Force said in a preliminary report that noise from the F-35s could make more than 1,000 homes “incompatible for residential use.”\nBut there was a broad base of support that included businesses, communities, economic developers, office holders, veterans and the University of Wisconsin-Madison.\nSupporters argued that concerns over the noise are overblown and there won’t be much difference from the current F-16s. Advocates said having the next generation of jets will be an economic development boost, ensuring the future of the base in Madison, which employs about 1,200 people.\nMadison’s City Council passed a resolution opposing the jets, but the Greater Madison Chamber of Commerce has been a vocal supporter. The chamber, which represents businesses in Madison, said the Air National Guard wing has a $100 million annual economic impact on the community. There was also bipartisan support from Wisconsin politicians, including both its Democratic and Republican U.S. senators.\nU.S. Rep. Mark Pocan, a Democrat who represents Madison, said Wednesday that the Air Force never sufficiently addressed his request that the Air Force pay for soundproofing or any financial losses those who live near the base may suffer due to reduced property values.\nAnd Democratic state Rep. Chris Taylor, one of the most vocal critics of the jets, called placing them in a Madison an “unfortunate and harmful decision” that will hurt people’s health, quality of life and lower property values.\n“Instead of listening to our community, the Air Force is intent on foisting these jets on a place they are not wanted,” she said.\nMaj. Gen Paul Knapp, leader of the Wisconsin National Guard, praised the awarding of the jets to the base in Madison and said he looked forward to working in partnership with the city and surrounding communities.\n“Through collaboration, I’m confident we will continue to be good stewards of the communities in which we work and live,” he said.\nThree other bases considered for the jets were in Boise, Idaho; Harrison Township, Michigan; and Jacksonville, Florida.", "url": "https://apnews.com/f403128f16a818e499306968999dd7e6"}