{"authors": [], "date_download": "2020-05-04 20:28:06", "date_modify": "2020-05-04 20:28:06", "date_publish": "2020-04-07 18:59:55", "description": "CHAMBLEE, Ga. (AP) — Multiple guns were recently reported stolen from a Georgia police chief's city-owned SUV, despite a department policy stating firearms should not be left unattended inside...", "filename": "_046654777c287e5f3e615255564c59ad_1588624086.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_046654777c287e5f3e615255564c59ad_1588624086.html", "title": "Guns stolen from Georgia chief's SUV", "title_page": "Police report: Guns stolen from Georgia chief's SUV", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHAMBLEE, Ga. (AP) — Multiple guns were recently reported stolen from a Georgia police chief’s city-owned SUV, despite a department policy stating firearms should not be left unattended inside take-home cars, police records obtained by a newspaper show.\nThe firearms were taken from Chamblee police Chief Kerry Thomas’ city-issued Chevrolet Tahoe while it was at an apartment complex on March 26, The Atlanta Journal Constitution reported Tuesday, citing Chamblee police reports.\nA window of the unmarked SUV had been shattered, the report said.\nAmong the items missing from the department vehicle were a rifle with scope, a long rifle, a 12-gauge shotgun, ammunition, magazines, bulletproof vests and police badges from another department, the report listed. It’s unclear whether the guns belonged to Chamblee police.\nTwo men seen driving a Mercedes-Benz reported stolen from Atlanta were identified as suspects in the break in, Chamblee police said in a statement Friday. Atlanta police said they recovered the car but the guns were not found.\nRecords indicated that two days before the break-in was reported, Thomas reviewed the department’s vehicle policy — which calls for disciplinary action if it is violated — and signed off on it, the newspaper said.\nA city spokeswoman told the newspaper the situation was a “personnel matter that has been addressed.” She did not comment further.\nThomas was not available for comment, the outlet said.", "url": "https://apnews.com/046654777c287e5f3e615255564c59ad"}