{"authors": ["Associated Press"], "date_download": "2020-05-04 20:28:49", "date_modify": "2020-05-04 20:28:49", "date_publish": "2020-04-08 16:35:10", "description": "BOYNTON BEACH, Fla. (AP) — A plane that crashed into a Florida neighborhood in March, killing the pilot, took off with fuel tanks that were ruptured and contained “no evidence of residual fuel,\"...", "filename": "_7e3d651235f1b0ddeab3a9e94806d8b8_1588624129.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7e3d651235f1b0ddeab3a9e94806d8b8_1588624129.html", "title": "NTSB: Small plane that crashed likely took off without fuel", "title_page": "NTSB: Small plane that crashed likely took off without fuel", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NTSB: Small plane that crashed likely took off without fuel\nBOYNTON BEACH, Fla. (AP) — A plane that crashed into a Florida neighborhood in March, killing the pilot, took off with fuel tanks that were ruptured and contained “no evidence of residual fuel,” according to a preliminary report by the National Transportation Safety Board.\nThe single-engine Grumman American AA-5 plane crashed in Boynton Beach, about 3 miles (5 kilometers) from Lantana Airport on March 6. John R. Pardillo, 67, of Miami was the only person on board, officials said.\nThe NTSB report posted Wednesday morning also said the valve that switches between the tanks, located on each wing, was “devoid of fuel,” and the carburetor’s float bowl contained only drops of fuel.\nThe report also said there was not a smell of fuel at the crash site and the grass in the area was not brown, which would have indicated a fuel spill.\nThe plane hit a palm tree, slicing it at about 5 feet up, then came to a stop against a fence behind a home, the report said. Both winds were partially torn off the plane.\nA complete NTSB report usually takes about a year.", "url": "https://apnews.com/7e3d651235f1b0ddeab3a9e94806d8b8"}