{"authors": ["Books", "Culture Writer", "Senior Women'S Reporter"], "date_download": "2020-05-04 20:25:37", "date_modify": "2020-05-04 20:25:37", "date_publish": "2020-04-29 22:10:58", "description": "Hulu's adaptation of Sally Rooney's bestselling novel elevates familiar tropes and uses them to break (and then unbreak) your heart.", "filename": "entry_normal-people-hulu-sally-rooney-show_n_5ea9deccc5b61d0e36404ec2_1588623937.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9e3713000009512155255.jpeg?cache=bncb2bujc5&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_normal-people-hulu-sally-rooney-show_n_5ea9deccc5b61d0e36404ec2_1588623937.html", "title": "‘Normal People’ Is The Prestige Show Teen Romance Fans Deserve", "title_page": "‘Normal People’ Is The Prestige Show Teen Romance Fans Deserve | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "The Sally Rooney phenomenon has finally arrived on the small screen.\nBy the time her second novel, “Normal People,” came out last year, the Irish novelist had already been deemed the great millennial writer by various august publications — a weighty (and not unchallenged) reputation to rest on two subtle, unassuming books about young people exploring love, lust, art, ambition and politics. Expectations for the “Normal People” Hulu adaptation have been stratospheric ever since news of the series first broke, and now Rooney fans and skeptics can finally dive in.\n“Normal People” opens in Sligo, a town on the western coast of Ireland, where two misfit secondary schoolers — Marianne (Daisy Edgar-Jones), a headstrong loner, and Connell (Paul Mescal), a shy jock — jump into an unlikely sexual fling. Connell, who is popular at school, hides the relationship out of embarrassment, and though Marianne initially agrees, his cowardice eventually drives them apart. Later, they reconnect at Trinity College in Dublin, where Marianne’s family money helps her easily navigate a social scene Connell finds daunting. Their friendship and romance continue, on and off, throughout their university years as their comings together and apart help them confront their deepest vulnerabilities and shape them into adults.\nBut is the “Normal People” adaptation a trite treatment of puppy love or a show worth spending the weekend on? HuffPost reporters Emma Gray and Claire Fallon discuss.\nThe Bottom Line\n“Normal People” provides a beautiful, imperfect twist on romantic narrative cliches, tailor-made to provoke feelings of nostalgia about the power of first love.\nFrom The Page To The Screen\nClaire: Rooney’s novels, especially the swoony “Normal People,” are the publishing version of unicorns: Marketed as literary fiction, they have enraptured critics, become influencer must-have accessories and climbed bestseller lists. With any wildly popular book, the screen adaptation will face one question, so let’s start there: Does the Hulu show do justice to the original, Emma?\nEmma: You know, I think it does. Fans of the book will be pleased to see that the show stays quite faithful to the source material, for better or worse. The things I loved about the book — the familiar emotional pangs of deep first love, the exploration of what it means to find connection with another person when you feel inadequate and unsure of yourself, the complexities of sexual intimacy and desire — were all present. I found the performances to be compelling, though perhaps a bit quiet at the beginning at least, and the show to be highly watchable. The things that frustrated me with the book — the abruptness of certain time and place jumps, the way that the plot dives immediately into the sexual relationship of protagonists Marianne and Connell without much buildup — were also there.\nThis is perhaps why the first episode left me feeling a little empty and unenthusiastic. It’s an immediately intense story but performed in a quite muted way. This ended up really working for me, but it made it harder to get into the show. How did you feel about both the watchability and the adaptation’s relationship to the book?\nClaire: It certainly hews closely to the novel; nearly every line of dialogue was familiar, as was the unfolding of the narrative, scene by scene. It made me look back on the book somewhat differently because I thought it worked quite well for TV — despite those abrupt jumps and mostly needless flashback framing scenes. Often literary novels require quite a bit of reworking to build a screen-friendly narrative structure, but “Normal People,” despite its emphasis on interiority, has a smooth, propulsive pace. Even the sudden start to Connell and Marianne’s sexual relationship didn’t jolt me, perhaps because it revealed an enormous amount about both of their characters. (Connell: popular but shy and easily influenced; Marianne: a brilliant outcast but risk-seeking and sexual.)\nOn the aesthetic level, I also saw parallels to the novel, particularly in the mutedness that you note. The palette is dominated by violet grays; interiors are shadowed and skies overcast. (I mean, Ireland.) The performances of Edgar-Jones and Mescal rely on quiet intensity to convey what’s left unsaid — which is a great deal, especially in the early stages of Connell and Marianne’s relationship. There’s a muffled evenness to Rooney’s writing that does seem to flatten emotional intensity in order, perversely, to draw attention to where that intensity lies. This correlates to a certain prestige-TV aesthetic that “Normal People” does draw on: gloomy visuals, spare dialogue, underplayed performances, a dreamy soundtrack and dashes of slow-motion to blur the edges of high-energy moments.\nAll this is to say I really enjoyed it! Though this style doesn’t always draw me in, it seemed right for this particular story, and I got lost in it quite quickly. Did you eventually find the show as addictive as I did?\nLet’s Talk About Sex, Baby\nEmma: I did! The muted tone and aesthetic that initially bored me ultimately ended up drawing me in. By Episode 2, I was hooked, and the series’ 12-episode run of 25 minutes each was perfectly paced to make it eminently bingeable. I, too, was taken aback by how well the novel’s literary flourishes and inner thoughts translated to television.\nOne aspect of the series that I found particularly compelling (and intense!) in its screen adaptation was the sexual intimacy. Sex is a major part of this story — unlike many love stories that revolve around young people, “Normal People” doesn’t shy away from female desire, and all of the messiness and oddity and heat of sexual awakening. Marianne is the driving force behind much of her and Connell’s physical relationship, from their high school days on. She craves contact with him, and he reciprocates that desire. That physical intimacy grows and evolves as they fall in and out of touch over the course of the next four years, but the tension and desire are ever-present; a throughline of both the novel and the show. As Marianne says: “It’s not like this with other people,” and the TV series communicates that point well.\nThere is simply something base and kind of wonderful about seeing that desire and connection in the flesh. (Pun… perhaps intended?) The sex scenes were titillating without feeling exploitative, and it was refreshing to see not just full-frontal female nudity but also male. “Normal People” doesn’t play coy about its characters’ desires and bodies, effectively showing the role sex can play in both emotional intimacy and disconnect. What did you think of the many, many sex scenes? And were there other themes from the book that you saw emphasized in the show?\nClaire: The sex scenes were quite frank! Not just between Connell and Marianne, but also with their other partners. Marianne has a taste for BDSM — perhaps, the show implies, because of her abusive family and her damaged self-esteem — and she explores this with Lukas, a Swedish photographer she meets while studying abroad. With Connell, the sex is more vanilla and more intimate. Marianne sees her obsession with him as submission enough; she repeatedly tells him she’d let him do whatever he wanted to her. Connell and Marianne are both more vulnerable than they appear, and sex is the primary way they show that vulnerability to each other. On the shallow level — is the sex steamy? — I’d say, uh, yes.\nRooney has placed her books in the Victorian novelistic tradition, and though there may be more sex than in a George Eliot novel, there’s a similar fixation on goodness, aesthetic sensitivity and the relationship between them. The book is very interested in the couple as students and readers, and in their evaluations of each other’s intelligence, sensibilities and morals. The show picks this up to some degree. Both characters are watchful people, and their capacity to be moved by what they see is what marks them as gifted and also, perhaps, moral. I do think there’s a rich crop of television right now about what it means to be good, and “Normal People,” without foregrounding this question as much as “The Good Place,” gave me the warm feeling of being in a world that cared about kindness.\nBut I think we have to talk about the romance. “Normal People” is a teen love story, and some critics have pointed out that it’s packed with tropes straight from the CW: the nerdy girl who gets a makeover, the popular guy who stands up for her, the star-crossed but undying love. Is this the central appeal and, if so, is that to the detriment of the show’s quality?\nWhat’s So Bad About Tropes Anyway?\nEmma: Although the central romance tiptoes dangerously close to certain overwrought teen romance clichés, the complication of those clichés is what keeps it from feeling basic. I also think that as someone who adores romantic stories ― especially onscreen ― and feels deeply comforted by their familiar structures and narrative arcs, perhaps I just am not all that bothered by the appearance of teen romance tropes in my prestige TV? If you are someone who is put off by them, “Normal People” might feel more grating.\nThere are certain scenes that feel annoyingly close to something you’ve seen in a late-’90s teen rom-com, like when Marianne shows up to a high school dance fundraiser suddenly hot and stylish, and Connell steps in to defend her honor from his lecherous, cruel, popular friends. (Some serious “She’s All That” vibes.) But “Normal People” quickly moves beyond high school. The story doesn’t end after the popular guy deigns to fall in love with an eccentric-but-secretly-conventionally-attractive girl. Instead (slight spoiler alert!), he puts his reputational anxiety above her feelings, and they end high school apart. When they come back together less than a year later at college in Dublin, things have radically changed for both of them. Their power dynamics have swapped places, with Marianne the seemingly cool and confident one, Connell the out-of-place loner. Over the course of the series, those dynamics shift again and again, eventually reaching some sort of equilibrium.\n“Normal People” also resists the pat happy endings that many beloved teen romances cling to, requiring audiences to suspend their disbelief and pretend that high school sweethearts usually get married and grow old together without issue or regret. There is not a suggestion that these extraordinary (not so normal) lovers are the only ones for each other or that finding love means your story can end there, no further growth necessary. A happy ending doesn’t necessarily mean that Connell and Marianne stay together forever. It means that they value each other and recognize how essential their relationship has been to each of their individual narratives. What did you think of the way these lovers were portrayed?\nHulu Connell and Marianne in Hulu's \"Normal People.\"\nClaire: I couldn’t agree more. What’s wrong with some tropes, honestly? (Especially these tropes, which are my favorite ones??) Why shouldn’t a teen romance get the same prestige treatment as any other kind of story? The idea that romance is inherently lowbrow is relatively recent; many of the great Victorian novels center on a love story, and then there’s Shakespeare, and so on through literary history. As much as I love a glossy rom-com, there’s nothing inherently glossy about young love, and telling that story through muted realism ― even including some of those feel-good tropes ― is just as fitting.\nAs you note, the show destabilizes the more cloying elements of its genre, and is actually quite astute about how social power operates. In “She’s All That,” the hero is hot, popular and rich, while the heroine is nerdy, ostracized and poor. “Normal People” redistributes the blessings, allowing it to unpack how Marianne’s money and proximity to the cultural elite lend her one kind of social currency, while Connell’s athleticism and rugged good looks lend him another.\nI appreciated how the couple’s portrayal resisted easy, slogan-style conclusions. Their romance is not all-powerful, but it’s also not frivolous. And yet, at the end, the show feels the need to have them tie off this message with a little bow by having them both opine on how they’ve shaped each other. “Normal People” is at its best when it’s more restrained.\nEmma, what was your final takeaway?\nEmma: There is always inevitably a challenge at wrapping up a love story. Should it end with overwhelming, perhaps unrealistic sunniness? Should it be unrelentingly tragic? (See: every teen love story where one of them dies of cancer.) Or should it attempt the most difficult thing: forgoing both extremes and landing somewhere in between? “Normal People” aims for that complex in between, and, as you noted, only somewhat sticks the landing.\nSince I knew that it was coming, the ending didn’t feel as abrupt as it did in the book, but the dialogue felt clunkier than in the rest of the series. However, I was so swept up with Connell and Marianne’s connection by that point that it didn’t bother me too much. I found myself wondering what their lives would look like when they reached our age, in their 30s. Would it still feel so intense, or would it, as Marianne predicted, be hard for a while, and then less so, to be apart? I suspect the latter, but I like that “Normal People” leaves us to ponder it.\nMy overall takeaway was that “Normal People” hits at something deep and emotionally true, even when it flounders a bit in the execution. And that, for me, is enough.\nSo, Should You Watch It?\nClaire: In the time of stay-at-home orders, many viewers may be desperate for anything remotely bingeable to numb the pain with. “Normal People” is something better: a lovely, absorbing show with just enough teenage sweetness and heart to comfort the soul.\nEmma: If you love love stories that hit all of your softest parts but do it in a way that is smart and thoughtful, turn to “Normal People” for some bingeable romance without easy answers.\n“Normal People” is now streaming on Hulu.", "url": "https://www.huffpost.com/entry/normal-people-hulu-sally-rooney-show_n_5ea9deccc5b61d0e36404ec2"}