{"authors": [], "date_download": "2020-05-04 16:27:55", "date_modify": "2020-05-04 16:27:55", "date_publish": "2020-04-07 15:38:34", "description": "From cozy hoodies to fleece pants, The North Face is offering 25% off its entire site with code STAYCOZY.", "filename": "2020_04_07_cnn-underscored_north-face-sale-sitewide_index_1588609675.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407111354-underscored-tnf-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_cnn-underscored_north-face-sale-sitewide_index_1588609675.html", "title": "The North Face sale: Take 25% off sitewide", "title_page": "The North Face sale: Take 25% off sitewide - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Whether you're gearing up for at-home workouts, prepping for your eventual return to the outdoors, or just looking for something to wear while you lounge around, there's something for you at this rare sitewide sale at The North Face. From cozy hoodies to fleece pants, the iconic outdoor brand is offering 25% off its entire site with code STAYCOZY.\nThat means hundreds of items, including cold-weather classics and newer gear, are marked down now. You can browse the entire sale here — just note there are some exclusions, including sale items and certain collections. Check out our favorites from The North Face below, and be sure to shop before this sale ends on April 19.\nWomen's Thermoball Eco Hoodie ($165, originally $220; thenorthface.com)\nWomen's Thermoball Eco Hoodie\nThis classic jacket from The North Face is lightweight and made from recycled materials. It's water- and wind-resistant, making it a must-have layer when you're on the go.\n_______________________________________________________________________________\nWomen's Core High-Rise Tights ($67.50, originally $90; thenorthface.com)\nWomen's Core High-Rise Tights\nWhether it's for hiking, yoga or just chilling around the house, these tights are versatile enough to keep you comfortable. They have moisture-wicking technology and a high-rise fit for ultimate support.\n_______________________________________________________________________________\nWomen's 66 California Tri-Blend Pullover Hoodie ($33.75, originally $45; thenorthface.com)\nWomen's 66 California Tri-Blend Pullover Hoodie\nThis retro hoodie is colorful, cozy and stylish. It's made with the soft Tri-Blend material and recycled polyester, so you can feel good about your new lounging uniform.\n_______________________________________________________________________________\nWomen's Aphrodite Motion Short ($30, originally $40; thenorthface.com)\nWomen's Aphrodite Motion Short\nThese airy shorts are moisture-wicking and water-repellent, making them the perfect choice for any summer day. Plus, they pack into their own back pocket, so you can take them wherever you go.\nMen's Denali 2 Jacket ($134.25, originally $179; thenorthface.com)\nMen's Denali 2 Jacket\nThe Denali 2 is one of The North Face's most popular items, and for a good reason. An all-around fleece, the Denali 2 is made from ultra soft, recycled material, making it the perfect layer for warmth and sustainable style.\n_______________________________________________________________________________\nMen's Half Dome Pullover Hoodie ($41.25, originally $55; thenorthface.com)\nMen's Half Dome Pullover Hoodie\nYour new go-to hoodie, this pullover features The North Face's iconic Half Dome logo. It comes in 11 colors, so you can play it safe with black or gray or go bold in blue or pink.\n_______________________________________________________________________________\nMen's Graphic Collection Fleece Pant ($63.75, originally $85; thenorthface.com)\nMen's Graphic Collection Fleece Pant\nThis adjustable, jersey-knit fleece will have you relaxing in style and coziness all day long. Plus, the pants have woven overlays on the knees for added durability.\n_______________________________________________________________________________\nMen's Flight Better Than Naked Shorts ($45, originally $60; thenorthface.com)\nMen's Flight Better Than Naked Shorts\nThese stretchy shorts are light and breezy, making them perfect for runs or your next at-home workout session. With a minimal waistband, drawcord and multiple pockets, these shorts are ready for any activity.\nExplore Fusebox Daypack - L ($74.25, originally $99; thenorthface.com)\nExplore Fusebox Daypack - L\nThis 26-liter pack is extremely durable and can fit everything you need for an adventure out in nature. A fleece-lined laptop sleeve and daisy chains are a few of the many features that make this the ultimate backpack.\n_______________________________________________________________________________\nLumbar Pack ($26.25, originally $35; thenorthface.com)\nLumbar Pack\nFor a quick run around the block, you'll still be able to keep your essentials on hand with this stylish fanny pack. The Lumbar Pack comes in three fashionable colorways and has an invisible outer pocket for your most necessary items.\n_______________________________________________________________________________\nElectra Tote - L ($66.75, originally $89; thenorthface.com)\nElectra Tote - L\nThis large tote has enough room to fit whatever you need, whether it's gym gear or a grocery haul. Plus, the bag is durable and has an outer water bottle pocket.\n_______________________________________________________________________________\nCotton Tote ($18.75, originally $25; thenorthface.com)\nCotton Tote\nThis cotton tote from The North Face is super stylish and holds 17 liters.\nFor more great deals, check out CNN Coupons.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/07/cnn-underscored/north-face-sale-sitewide/index.html"}