{"authors": ["Mary Esch"], "date_download": "2020-05-04 20:10:05", "date_modify": "2020-05-04 20:10:05", "date_publish": "2020-04-08 19:21:41", "description": "ALBANY, N.Y. (AP) — The Environmental Protection Agency is proposing to buy several homes contaminated by arsenic from a 19th-century mine in upstate New York as part of a $5.8 million Superfund...", "filename": "_8b4eac7c837ebd24d3c7c5242515b365_1588623005.html", "image_url": "https://storage.googleapis.com/afs-prod/media/51447d2360eb4bffbcc0f39c8f6b50e6/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8b4eac7c837ebd24d3c7c5242515b365_1588623005.html", "title": "EPA proposes buyout of homes contaminated by arsenic mine", "title_page": "EPA proposes buyout of homes contaminated by arsenic mine", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this June 12, 2019 file photo, Eric Luther poses for a picture at his house in Carmel, N.Y. The Environmental Protection Agency is proposing to buy several arsenic-contaminated homes in upstate New York as part of a $5.8 million Superfund cleanup plan at an old mine site. Luther said Wednesday, April 8, 2020 that he's happy with the EPA's proposal and has \"every intention of accepting.\" (AP Photo/Seth Wenig, file)\nFILE - In this June 12, 2019 file photo, Eric Luther poses for a picture at his house in Carmel, N.Y. The Environmental Protection Agency is proposing to buy several arsenic-contaminated homes in upstate New York as part of a $5.8 million Superfund cleanup plan at an old mine site. Luther said Wednesday, April 8, 2020 that he's happy with the EPA's proposal and has \"every intention of accepting.\" (AP Photo/Seth Wenig, file)\nALBANY, N.Y. (AP) — The Environmental Protection Agency is proposing to buy several homes contaminated by arsenic from a 19th-century mine in upstate New York as part of a $5.8 million Superfund cleanup plan announced Wednesday.\nThe agency said an as-yet undetermined number of residents would be relocated and their homes demolished at the 12-acre site in Kent, 50 miles (80 kilometers) north of New York City. There are 10 homes with soil contaminated by arsenic from a nearby long-abandoned mine.\n“Our first reaction is relief and joy,” resident Eric Luther wrote in an email. “We still have a ways to go but we’re glad we don’t feel permanently trapped in our home any more.”\nLuther said he and his husband “have every intention of accepting’ the buyout proposal.\nThe EPA first became aware of drinking water contamination in the area in 1987 when residents Norman and Alicia Berns were hospitalized with arsenic poisoning. The agency installed an alternative water supply at their home. But extensive soil sampling wasn’t done until 30 years later, when arsenic-contaminated sediment was found in the water tank at the same house, now owned by another family.\nLast July, the site was added to EPA’s Emphasis List of 17 Superfund sites targeted for “immediate, intense action.” Earlier, a federal health advisory had been issued saying long-term exposure to arsenic in soil on the properties posed a significant health risk.\nAs an interim measure last summer, EPA contractors covered contaminated yards with wood chips, installed stone paths and provided heavy-duty doormats. Residents have been using water treatment systems or bottled water to avoid contaminated well water.\nUnder the proposed cleanup plan, which is subject to a public comment period that ends May 8, “certain affected properties” would be purchased and demolished, and the area would be fenced off. Residents would receive federal financial and logistical support to find new homes and move.\nThe EPA said the buyout and demolition plan was determined to be the most feasible, effective and fast of alternatives considered. If residents stay, protective measures would have to be maintained and monitored for 10 years while a permanent remedy was designed and implemented, according to the EPA’s proposal.\n“We previously took actions at the Arsenic Mine Site that have addressed the immediate risks by reducing residents’ exposure to arsenic contamination in the short term,” EPA Regional Administrator Pete Lopez said in a statement. “Today, we are proposing the best course of action to protect residents from arsenic-contaminated soil over the long-term.”", "url": "https://apnews.com/8b4eac7c837ebd24d3c7c5242515b365"}