{"authors": [], "date_download": "2020-05-04 20:22:49", "date_modify": "2020-05-04 20:22:49", "date_publish": "2020-04-20 14:58:20", "description": "WASHINGTON (AP) — The Supreme Court delivered a setback Monday to Montana homeowners who are seeking additional cleanup of arsenic left over from years of copper smelting. The court said...", "filename": "_ee14bbf4c377585ed54cf6babfde7e85_1588623769.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9fed7844c71a43c8be2211010a006649/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ee14bbf4c377585ed54cf6babfde7e85_1588623769.html", "title": "Justices rule against Montana homeowners near Superfund site", "title_page": "Justices rule against Montana homeowners near Superfund site", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE- In this Nov. 11, 2019 file photo, a view of the Supreme Court in Washington. The Supreme Court has delivered a setback to Montana homeowners who are seeking additional cleanup of arsenic left over from years of copper smelting. The court said Monday that the homeowners cannot proceed with efforts to decontaminate their own property near the shuttered Anaconda smelter without the permission of the Environmental Protection Agency. (AP Photo/Susan Walsh)\nFILE- In this Nov. 11, 2019 file photo, a view of the Supreme Court in Washington. The Supreme Court has delivered a setback to Montana homeowners who are seeking additional cleanup of arsenic left over from years of copper smelting. The court said Monday that the homeowners cannot proceed with efforts to decontaminate their own property near the shuttered Anaconda smelter without the permission of the Environmental Protection Agency. (AP Photo/Susan Walsh)\nWASHINGTON (AP) — The Supreme Court delivered a setback Monday to Montana homeowners who are seeking additional cleanup of arsenic left over from years of copper smelting.\nThe court said the homeowners cannot proceed with efforts to decontaminate their own property near the shuttered Anaconda smelter without the permission of the Environmental Protection Agency. But it did not order an end to the state court lawsuit that was under review.\nThe smelter, near the town of Opportunity, Montana, belongs to BP-owned Atlantic Richfield Co. and sits at the center of a 300-square-mile Superfund site. The company says it has spent $470 million to clean the site.\nHomeowners who are dissatisfied with the EPA-ordered cleanup want Atlantic Richfield to pay for the removal of more arsenic-tainted soil from their properties. And the Montana Supreme Court ruled in 2017 that their claims could proceed in state court.\nBut Chief Justice John Roberts wrote for the high court that federal environmental law requires the homeowners to seek EPA approval for additional cleanup. “That approval process, if pursued, could ameliorate any conflict between the landowners’ restoration plan and EPA’s Superfund cleanup, just as Congress envisioned,” Roberts wrote.\nJustice Neil Gorsuch wrote in a dissent that Justice Clarence Thomas joined that the court’s reading of the Superfund law “strips away ancient common law rights from innocent landowners and forces them to suffer toxic waste in their backyards, playgrounds, and farms. Respectfully, that is not what the law was written to do; that is what it was written to prevent.”\nAn EPA spokesperson said the agency is reviewing the decision. The EPA backed Atlantic Richfield in the Supreme Court, urging several ways in which the justices could rule against the homeowners.\nJoseph Palmore, who represented the homeowners at the Supreme Court, said he was pleased the court did not dismiss his clients’ suit. “We look forward to working with the EPA toward a clean-up that will protect the environment and safeguard the health and property of the residents of Opportunity,” Palmore said.", "url": "https://apnews.com/ee14bbf4c377585ed54cf6babfde7e85"}