{"authors": [], "date_download": "2020-05-04 20:16:03", "date_modify": "2020-05-04 20:16:03", "date_publish": "2020-04-16 17:57:15", "description": "LITTLE ROCK, Ark. (AP) — Arkansas signed a contract with a new firm to take over management of the remaining state youth lockups, after legislators approved a $70 million contract. The...", "filename": "_6777faf4062f941d5d49ddbc4e3ac980_1588623363.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6777faf4062f941d5d49ddbc4e3ac980_1588623363.html", "title": "Nevada-based firm to manage Arkansas' youth lockups", "title_page": "Nevada-based firm to manage Arkansas' youth lockups", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LITTLE ROCK, Ark. (AP) — Arkansas signed a contract with a new firm to take over management of the remaining state youth lockups, after legislators approved a $70 million contract.\nThe agreement with Nevada-based Rite of Passage will hand day-to-day operations of facilities at Dermott, Harrisburg and Mansfield on July 1 and is set to last until 2023.\nRite of Passage has been managing the Arkansas Juvenile Assessment and Treatment Center at Alexander since 2016.\nThe state’s youth detention facilities currently house more than 200 children who have committed juvenile felonies, misdemeanors and other infractions.\n“We’re excited to be able to continue our work in the state of Arkansas,” Mike Cantrell, executive director of Rite of Passage, said in an interview with the Arkansas Democrat-Gazette on Wednesday. “I know that today things just got better for the kids in the state of Arkansas. We’re going to be able to bring consistency to the programs.”\nWith the management change, the state plans to close its fifth youth lockup at Lewisville until further notice. The eight children at that campus will be transferred to other facilities by the time Rite of Passage takes over, said Amy Webb, a Human Services Department spokeswoman. If money is available, Rite of Passage may reopen the campus as a substance abuse treatment facility.\nAll facilities that Rite of Passage operates will have the capacity to house 230 children in residential beds and 20 in assessment beds.", "url": "https://apnews.com/6777faf4062f941d5d49ddbc4e3ac980"}