{"authors": ["Marianne Garvey"], "date_download": "2020-05-04 16:17:22", "date_modify": "2020-05-04 16:17:22", "date_publish": "2020-04-03 23:37:41", "description": "Selena Gomez and Miley Cyrus had a moving virtual conversation on Friday in which Gomez revealed that she was recently diagnosed with bipolar disorder.", "filename": "2020_04_03_entertainment_se_1d1bb2eaaa7b3be9a18bb7febc0f6f89_index_1588609042.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403192922-selena-gomez-miley-cyrus-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_entertainment_se_1d1bb2eaaa7b3be9a18bb7febc0f6f89_index_1588609042.html", "title": "Selena Gomez shares she has bipolar disorder", "title_page": "Selena Gomez shares she has bipolar disorder in reunion talk with Miley Cyrus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Selena Gomez and Miley Cyrus had a moving virtual conversation on Friday in which Gomez revealed that she was recently diagnosed with bipolar disorder.\nThe two former Disney stars appeared on Cyrus' Instagram show \"Bright Minded,\" where Gomez talked openly about her health.\n\"Recently, I went to one of the best mental hospitals in America, McLean Hospital, and I discussed that after years of going through a lot of different things, I realized that I was bipolar,\" Gomez said. \"And so when I got to know more information, it actually helps me. It doesn't scare me once I know it.\"\nThe two singers reconnected, they said, after Gomez left Cyrus a butterfly emoji in the comment section of an Instagram post.\n\"I'm just really happy that we did this new DM. It was very sweet because you just sent a butterfly emoji,\" Cyrus recalled. \"And that's enough, connecting with people and letting them know that you're there. A butterfly emoji is totally enough.\"\nRead More", "url": "https://www.cnn.com/2020/04/03/entertainment/selena-gomez-miley-cyrus-bipolar-disorder/index.html"}