{"authors": [], "date_download": "2020-05-04 20:28:47", "date_modify": "2020-05-04 20:28:47", "date_publish": "2020-04-30 12:10:58", "description": "The documents show FBI officials debating internally how best to approach the Flynn interview and what to do if he lied.", "filename": "entry_michael-flynn-fbi-emails_n_5eaabee1c5b6671e3e48d424_1588624127.html", "image_url": "https://img.huffingtonpost.com/asset/5eaabf4530000030121552e3.jpeg?cache=qenzbz15fb&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_michael-flynn-fbi-emails_n_5eaabee1c5b6671e3e48d424_1588624127.html", "title": "Lawyers For Michael Flynn Release Internal FBI Emails, Notes", "title_page": "Lawyers For Michael Flynn Release Internal FBI Emails, Notes | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "WASHINGTON (AP) — Lawyers for President Donald Trump’s first national security adviser, Michael Flynn, released internal FBI emails and notes that they hope will bolster their allegations that Flynn was entrapped when he was questioned at the White House three years ago.\nThe documents were made public Wednesday evening as Flynn seeks to withdraw his guilty plea to lying to the FBI and makes broad assertions of law enforcement misconduct. U.S. District Judge Emmet Sullivan has rejected many of the defense arguments but has yet to rule on whether Flynn can take back his guilty plea.\nMeanwhile, a federal prosecutor from Missouri is reviewing the Justice Department’s handling of the case at the direction of Attorney General William Barr. The department said the notes were produced to the defense as part of that ongoing review.\nIt remains unclear what bearing the documents will have on the case or how significant the judge will determine them to be. But Flynn has emerged as something of a cause celebre in recent months for supporters of the president, who have rallied around the retired Army lieutenant general and seized on the findings of a harshly critical watchdog report on the Russia investigation to try to cast doubt on the entire probe.\nProsecutors haven’t filed anything in response to Wednesday’s action by Flynn’s lawyers.\nTrump has said he is considering pardoning Flynn and retweeted Wednesday night several news stories about the documents.\nASSOCIATED PRESS In this June 24, 2019, file photo, former national security adviser Michael Flynn, leaves the federal courthouse in Washington. with his lawyer Sidney Powell, left.\nThe notes and emails show FBI officials debating internally how best to approach the Flynn interview, how much information to provide him with, what the purpose of interviewing him should be — and what to do if he lied.\nIn emails dated Jan. 23, 2017, the day before agents interviewed Flynn at the White House about his conversations during the presidential transition period with the Russian ambassador to the United States, officials pondered at what point in the conversation Flynn should be reminded that it is against the law to lie to the FBI — at the outset of the conversation or after he makes a suspected false statement.\nFlynn’s former attorneys have said he was never given such a warning.\nAlso released was a page of handwritten FBI notes in which an official asks “what’s our goal? Truth/admission or to get him to lie, so we can prosecute him or get him fired?”\nAt another point, the notes say, “If we get him to admit to breaking the Logan Act, give facts to DoJ and have them decide.” That is a reference to a centuries-old, esoteric law that makes it a crime for a private citizen to conduct foreign policy with another government.\nThe notes also say: “If we’re seen as playing games, WH will be furious. Protect our institution by not playing games.”\nThe handwritten notes bear the initials “EP,” which is likely a reference to E.W. Priestap, the senior FBI official who authorized the decision in the summer of 2016 to open an investigation into ties between the Trump campaign and Russia.\nFlynn was among the first of the president’s aides to admit guilt in special counsel Robert Mueller’s investigation into ties between the Trump campaign and Russia. He acknowledged lying to the FBI about having discussed sanctions against Russia during the presidential transition period with the then-ambassador, Sergey Kislyak.\nHe provided such extensive cooperation that prosecutors said he was entitled to a sentence of probation instead of prison.\nAs it turned out, that sentencing hearing was abruptly cut short after Flynn, facing a stern rebuke from Sullivan, asked to be able to continue cooperating and earn credit toward a more lenient sentence.\nSince then, though, Flynn has hired new attorneys — including Sidney Powell, a conservative commentator and outspoken critic of Mueller’s investigation — who have taken a far more confrontational stance to the government. The lawyers have accused prosecutors of withholding documents and evidence they said was favorable to the case and repeatedly noted that one of the two agents who interviewed Flynn was fired from the FBI for having sent derogatory text messages about Trump during the 2016 presidential campaign.", "url": "https://www.huffpost.com/entry/michael-flynn-fbi-emails_n_5eaabee1c5b6671e3e48d424"}