{"authors": ["David Duhalde", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul Heideman", "Hadas Thier", "Dustin Guastella", "Jedediah Britton-Purdy", "Connor Kilpatrick"], "date_download": "2020-05-04 19:49:29", "date_modify": "2020-05-04 19:49:29", "date_publish": "2020-04-28 00:00:00", "description": null, "filename": "2020_04_our-revolution-failed-to-live-up-to-its-potential-but-the-bernie-movement-needs-a-mass-organization-now_1588621769.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/04/28120103/GettyImages-662145438.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_04_our-revolution-failed-to-live-up-to-its-potential-but-the-bernie-movement-needs-a-mass-organization-now_1588621769.html", "title": "Our Revolution Failed to Live Up to Its Potential. But the Bernie Movement Needs a Mass Organization Now.", "title_page": "Our Revolution Failed to Live Up to Its Potential. But the Bernie Movement Needs a Mass Organization Now.", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nDespite our best hopes and struggle, Bernie Sanders’s presidential campaign once again ended in second place. But while we came up short, it’s more than clear now that 2016 wasn’t a fluke — we do indeed have a mass constituency. And those Bernie supporters deserve a vehicle to advance their political project in the years to come — that means a formal organization capable of representing and galvanizing a mass movement. What form that organization should take, however, is up for debate. Before we lay out a few options, two important caveats. First, I am not considering a new political party because Sanders has rejected such an option. Second, I do not believe Our Revolution, which Sanders created after his first presidential run, can or should be the organization to carry on his legacy. As that group’s former political director, I know firsthand that Our Revolution had tremendous promise to be a gateway to the permanent mass working-class formation this country desperately needs. Unfortunately, Our Revolution no longer truly carries the legacy of Bernie Sanders, especially with the departures of his allies Jeff Weaver, Shannon Jackson, and Nina Turner from the organization. That doesn’t mean we should ignore the experience altogether. To understand where we should go, it is always important to understand where we have been. In this case, it is critical to see how the two different 2016 campaign legacy organizations — the Sanders Institute and Our Revolution — each approached the Trump era and the 2020 presidential contest environment differently. This context provides a window into what possible formation could come out of this year’s campaign infrastructure that includes a donor list of several million people and a staff that peaked at around twelve-hundred.\nThe Twin Births of Our Revolution and the Sanders Institute At the 2016 Democratic National Convention, Bernie Sanders declared the birth of Our Revolution. The organization shared the name of his book released a few months later, and it truly came together late in a meeting at the Sanders home in Vermont that summer. Like many similar ideological projects, there was a decision to create two entities: the Sanders Institute, a 501c3, and Our Revolution, a 501c4. The latter could educate the public about the legislation and public policies supported by Senator Sanders and his advocates, while Our Revolution would mobilize grassroots organizers into local formations to advance social movement goals, elect candidates backing the Sanders agenda, and reform the Democratic Party. The different nature of these missions required two separate nonprofit classifications. Under the law, a 501c3 may not endorse candidates or lobby in the ways that a 501c4 is allowed. Despite this tax difference, both NGOs received copies of the 2016 campaign contributor and email list, and in turn relied heavily on small donor donations. However, their separate headquarters in Burlington (the Sanders Institute) and District of Columbia (Our Revolution) symbolized the future distance of the operations.\nTwo Different Institutional Roads for Berniecrats Tucked far away from the Beltway up in Vermont, the Sanders Institute never was larger than a close-knit team striving to influence popular discourse with their policy agenda. At times, it was able to punch above its weight by leveraging the network of Sanders campaign supporters and alumni in order to produce videos and publish materials, and most notably, hosted a “Gathering” of hundreds of national and grassroot leaders sympathetic to the Sanders agenda. “The Gathering” in 2018, which was designed to be an annual event, convened progressives, left-wing trade unionists, and pro-Sanders grassroot leaders to showcase the depth and size of the activist coalition that Sanders could bring together. This onetime event in some ways was a microcosm of the People’s Summit’s mass conferences which had occurred each of the previous two years. Those events, spearheaded by the National Nurses United union, convened largely membership-based organizations that backed Sanders’s 2016 run. Thousands of Bernie supporters flocked to the People’s Summit in Chicago to discuss, build, and network. Such organic connections are worthwhile and lead to more than a few candidacies, electoral alliances, and other joint projects. However, as 2019 rolled into the Sanders presidential candidacy, the Sanders Institute was faced with a difficult decision — temporarily shut down or continue its work with the confusing optics of operating and raising money while their founder was campaigning and thus also fundraising. The Sanders Institute opted to cease operations for the time being. Our Revolution, however, took a much different course. At its height, Our Revolution could boast over a quarter-million members, the launch of a handful of statewide organizations, as well as over six hundred individual local groups in nearly every state and territory. However, the truth behind these numbers painted a more complex picture of a grassroots group trying to square its democratic and insurgent narrative with a traditional nonprofit structure and nonuniform separation of power. This nuance was also coupled with the fact that despite being the Bernie 2016 legacy organization, Senator Sanders could play no role within it. Senate ethics rules prohibited Sanders, a sitting senator, from being involved in the day-to-day efforts of the operation because of its 501c4 tax status. This separation provided some benefits and space for creativity, but ultimately led to a real perceived distance between the founder and his putative legacy organization.\nSuccess and Failure at the Ballot Box One of the most compelling aspects of Our Revolution’s political work was that nearly 99 percent of the endorsements of ballot measures and candidates came from the local groups, not the national office, creating broad buy-in across the organization. Trust in the grassroots led to the nominations of Squad members such as Ilhan Omar, Rashida Tlaib, and Alexandria Ocasio-Cortez before they were global symbols of the Left. In fact, Our Revolution was one of only a handful of national groups to back AOC at all. The ability to support candidates outside of Sanders’s personal approval enabled the organization to be connected to his base’s political wishes in a way he as a politician with his own set of endorsements and legislative priorities sometimes could not. Backing candidates-turned-celebrities and alongside a horse-race obsessed media put Our Revolution’s endorsements front and center over its other work. Yet its political team never made up more than one-tenth of the staff. But the bottom-up, grassroots-led endorsement process meant that for every amazing victory against the establishment like AOC and Rashida Tlaib, there were many more losses. Sanders critics jumped on this fact — often exaggerating the total defeats by lumping local group endorsements in with national ones — to prove that while Sanders could inspire a movement, that movement itself could not win. “Likely victory” was never the top criteria — the mobilization of its ideas via candidates was paramount. But the wins/losses ratio still weakened the image of the political program. Furthermore, Our Revolution’s 501c4 status legally prevented candidates and groups from receiving the national organization’s lists and other data. Federal law prohibited this, and other national and nearly universally local regulations barred “coordination” (such as privately discussing campaign and electioneering strategy) and direct donations to campaign coffers. A PAC could do some, and eventually a federal PAC was established, but those types of structures also face limitation.\nDid They Make a Dent in the Party? After the 2016 general election, Bernie Sanders publicly called for his supporters to run for public office and for internal posts in the Democratic Party. The “DemEnter” (Democrat + Enter) push offered a venue for many Bernie boosters to channel their frustration productively in changing the party that many blamed for sabotaging his nomination. Sanders’s party-building ethos also ran counter to the narrative that he didn’t care about the Democratic Party — that he was too “independent.” In fact, he and his backers invested significant effort in contesting and winning party offices at all levels. In 2017, the Sanders movement and their allies nearly elected Keith Ellison chair of the Democratic National Committee. Barack Obama though helped thwart Ellison’s election, a harbinger of the former president’s intervention to help Biden three years later. By 2018 though, a handful of state party chairs were Berniecrats with countless more officers sympathetic to the Vermont senator. On the national level, the Sanders camp led by Our Revolution successfully made sure the Unity Reform Commission (URC) recommendations of the 2016 Democratic National Convention were enacted, albeit in a compromised version. For instance, superdelegates were pushed off to the second ballot, a scenario which at the time seemed incredibly unlikely to ever occur. For a moment, a Bernie-wing of the Democratic Party seemed to be on the rise. In fact, some argue that Sanders became a victim of his own success. Without superdelegates on the first ballot for the 2020 convention, centrists coalesced much earlier around Joe Biden than they otherwise may have done if they could have simply counted on the party elite to cast lots at a divided convention.\nHow a Second White House Run Gutted Our Revolution Ninety percent of Our Revolution’s staff exited for jobs with Sanders’s second presidential campaign by early winter 2019. In an effort to quickly replace those staffers, the former executive director of Good Jobs Nation was brought on to lead the organization. Slowly, Our Revolution began taking on the work and even the image of Good Jobs Nation. The Our Revolution logo was changed to align with the branding and aesthetic of Good Jobs Nation. Our Revolution even took on the defunct group’s campaigns, such as trying to stop the General Motors factory shutdown in Lordstown, Ohio among others. While this increased labor activism pleased some in Our Revolution, it caused others to question the utility of suddenly ending all of their original work. The weakness of the triangle was exemplified with how quickly the other work was replaced and remodeled. While we continued to do Medicare for All activism, it was included with a fake ambulance riding around the country for public events in of publicizing our deep organizing. Eventually, all the pre-2019 staff left. Since then, Our Revolution’s staff has never been larger than one-third of its height prior to the launch of the 2020 campaign. Several dozen fellows have been hired, but this is not the same as full-time staff who are completely dedicating their time and work to build an organization. Today, it is best that Our Revolution continues its progressive work, but not as a Sanders legacy organization. This situation has precedent. Both Progressive Democrats of America and Democracy for America have distanced themselves from their original inspirational presidential candidates — Dennis Kucinich and Howard Dean, respectively. Our Revolution can indeed be a remodeled Good Jobs Nation. This would allow for a new formation to truly implement Sanders’s vision of a mass grass roots shaping history and making social change.\nOptions for a New Berniecrat Organization Below I outline three different nonprofit structures that a future Sanders legacy organization could adopt. These are a 501c3, a 501c4, and a political action committee. Each option will include an analysis of the strengths and weaknesses of such a nonprofit, especially on programming. Group 501c3 501c4 PAC Center for Popular Democracy (CPD) CPD CPD Action Popular Democracy PAC Democratic Socialists of America (DSA) DSA Fund DSA DSA PAC Justice Democrats N/A Organize for Justice Justice Democrats Progressive Democrats of America N/A People Demanding Action & Progressives for Democracy in America Progressive Democrats of America Our Revolution Sanders Institute Our Revolution Our Revolution PAC People’s Action People’s Action Institute People’s Action Power 1 The 501c3 Option A tax-exempt nonprofit that exists to promote a social cause that meets public needs including education, philanthropy, and religion. Donations are tax-deductible and can engage in limited forms of lobbying and advocacy. Cannot make endorsements of candidates. Strengths : While not the main vehicle for much of the mass movement energy, a 501c3 nonprofit can do a great deal of good. Advancing educational work — really the primary purpose of these organizations on the left — has necessary value. Such programming are not just publications and other forms of media, but also hosting events such as conferences that bring together people or hosting tours to promote organizing and policy ideas. There is a tremendous amount of room for activity given a good amount of resources and direction. Drawbacks : The primary drawback is the prohibition on endorsing and advancing candidates’ elections. A working-class organization needs to focus on building political power – at least one of the Sanders-inspired type of this formation must engage in electoral politics. This includes, but is not limited to endorsing candidates, training campaign staff and possible electeds, working on campaigns, and making financial contributions. A 501c3 can do none of this. Possible Option : The Sanders Institute can be restarted with a bigger and broader vision and scope. With a renewed energy and larger list, we can formally expand the mission of the Sanders Institute beyond public education into activist mobilization and networking building as well. Previously, the Institute did excellent work to uplift voices that supported and advanced Bernie’s agenda. A new model would view the Sanders Institute as a convener of varying elements of his coalition. Instead of seeking mergers, this role could harness the unique nature of different pro-Bernie formations via points of programmatic unity. With his candidacy over, for example, there is a role for Sanders in such a new entity to facilitate continued collaboration between the groups that backed his 2020 campaign, especially those who are part of — the independent expenditure coalition that included the groups in the chart above and more. This leadership from the Sanders Institute could provide long-term sustainability of the Sanders movement. This could take the form of the Sanders Institute taking on the role of staffing, convening, and organizing a table of these organizations to advance political goals and social justice values that are not being advanced elsewhere. Often what is lacking in movement spaces is a neutral and respected convener to bring together allies that are often stretched for time and money. Regardless of who wins the White House now, such a sustained effort to put pressure and mobilize the grassroots would be invaluable for curtailing the worst elements of right-wing nationalism and decaying neoliberalism. Another and not mutually exclusive way to formalize the Sanders movement is to make the Gathering permanent as was originally planned and expand it closer to a model from the People’s Summit. This kind of annual meeting can cross-pollinate between local grassroots activists and build relationships between organizations. Such interactions will maintain the connection of the Sanders-inspired movement activists and allow for independent organization and cooperation among progressive forces at many different levels. While the Sanders Institute could not do electoral work, these types of events can build networks to advance candidates elsewhere. The 501c4 Option A nonprofit that exists for social welfare. Donations are not tax deductible. By their nature, these NGOs tend to focus more on lobby and political activity than charity and education work. Strengths : Some of the major strengths of a 501c4 are primarily what it can do that a 501c3 must not. First and foremost, it can engage in political activity such as lobbying, advocacy work, and some electoral action. Those freedoms make a 501c4 more equipped to promote a legislative and electoral agenda with many volunteers, organizers, and staffers. This allows it to have a political program that is crucial and popular among the Sanders base. In addition, donations to a 501c4 are not tax deductible unlike those of a 501c3. This means that the revenue is less likely to be tied to big donors seeking tax write-offs. Drawbacks : There are two major limitations that have both optic and real programmatic implications: donor disclosure and candidate coordination. First, while funders will not get tax deductions, 501c4 organizations are not required by law to disclose complete donor information. This difference has long been used by adversaries labeling groups such as Our Revolution as so-called “dark money organizations.” Our Revolution did reveal but did not tied it to an amount the donor gave. While 501c4 are allowed to endorse candidates, in many elections they are directly prohibited or very limited in how they may coordinate with those campaigns. Examples of coordination, include, but are not limited to: General Communication : After endorsing a candidate, due to the national and local campaign finance laws, Our Revolution could not talk to the nearly all campaigns and was explicitly prohibited in discussing strategy such as mobilizing around the items below. Volunteer Recruitment : Our Revolution could only promote public campaign events without knowing the priority to the campaigns. Voter Data : Our Revolution could not share its identified Bernie voter data to help campaigns identify potential supporters Technology : Any successor organization would have tremendous access to tech skill labor and applications that a small campaign would not. However, this 501c4 would be prevented from sharing that advice and knowledge. For Our Revolution and many other groups, these legal barriers created both the optics issue and programmatic limitations. People expected much more in terms of donations or electioneering communication than Our Revolution could actually (sometimes legally) deliver. A Membership and Non-Membership Organization : In addition to assessing whether or not to create a new 501c4 nonprofit, one must consider if it should have a membership structure or just be staff-driven. While there are many membership-based collectives already, not everyone is seeking to join them. Some will only want to be in a Sanders-oriented formation. Membership Based Organization There are benefits to a membership-based structure, especially one that has groups. Berniecrats want a space that they can own to continue their political and activism projects. Having groups enables these members to mobilize more effectively to promote the mission and its goals. This is especially true on the local and state level where such collaboration will have a greater impact than outside staff miles away. This organizational ownership creates more buy-in. Groups were highly committed to the candidates and the Our Revolution political program since those endorsements came from the mass membership. Non-membership Based Organization A 501c4 without a membership — or at least group structure — could be more focused. Not needing to service a base, more staff time can be directed at moving a program. Programming decisions would come from the board, as it did at Our Revolution, but would not require the buy-in from members it once did. This would limit some of the healthy feedback and grassroots input, such as the future Squad nominations, but the ability to narrow the mission may be worth it. In fact, even without a membership, it would still be imaginable for future employees to mobilize Bernie supporters in distributed organizing. There could still be volunteers seeking opportunities, but the expectations would be clear that they are just being asked to promote candidates and other issues decided by a board and staff without volunteers’ opinions. Furthermore, not having a membership would make the new group less competitive with groups with members. Possible Outcomes: Membership Based Organization If there was an interest in creating a new membership-based organization, I would recommend several steps to avoid the problems that Our Revolution faced and continues to grapple with: A very narrow mission with stated priorities and goals plus a strategy to achieve it. A membership model that makes publicly clear the rights and responsibilities of those supporters with a way to influence national projects even if advisory. A group structure that is consistent in branding and has different tiers for size and activity of the local formation. Such a model should require a certain minimum before starting a group and expectations to maintain the right to be a national affiliate. Properly staff any pillars so as not to be too dependent on volunteers. If you are doing national party reform work, you need fulltime organizers. Non-Membership Organization A non-membership organization would still use points one and four above. Regardless if it was a membership group or not, it would need a clear lane and focus. Possible Sanders Legacy 501c4 Mission Here are appropriate project themes that a Sanders legacy 501c4 nonprofit organization could take on. The critical aspect to this is that it would need staffing for the goals set within each potential area. Advocacy work is one clear mission a 501c4 could adopt. This includes pushing for legislation and public policy work to elected officials and other forms of pressure campaigns around issues such as Medicare for All, Democratic Party reform, and free college education. The PAC Option An organization whose primary purpose is to raise funds to be used for and against candidates, ballot measures, and other electoral projects. While a PAC is often soliciting donations and making contributions, sometimes can also be a membership organization such as Progressive Democrats of America. Strengths : Political Action Committees are an excellent way to advance an electoral agenda both by aggregating grassroot support and working directly with candidates. This is why groups such as Justice Democrats and the Progressive Democrats of America are structured as PACs. In fact, Bernie Sanders has his own leadership PAC called the Progressive Voters of America. Unlike a 501c4, a PAC can coordinate with candidates although there are spending limits depending on the race. In addition, PACs are highly transparent. Using a PAC would make it clear where the money is being raised and how it is being spent. Drawbacks : Some of the strengths are some of the weaknesses too. PAC donations are not tax deductible unlike a 501c3 and there are contribution limits unlike both 501c3 and 501c4 nonprofits. Some PACs, such as unions, Our Revolution, or DSA, can only take donations from their members. This can limit the resources. The term Super PAC has helped soil the reputations of all PACs, even those that cannot spend unlimited amounts of money. This optic would still be an issue that needs to be grappled with. Possible Outcome : Sanders could start a revolutionary PAC. This could be a new legal organization or build off his existing senate leadership PAC Progressive Voters of America This PAC would go beyond fundraising and donations. It could serve as a political center to build coalitions at all levels to advance insurgent candidates. In many races, there are progressive allies with local and national affiliates that lack a convener solely dedicated to coordinating the electioneering. A group that could unite political actors as needed on races could play an invaluable role in advancing progressives and socialists in elections. A staffed organization can track and build coalitions of Bernie-aligned groups as needed to see where there is coherence in certain races. This PAC could help coordinate with candidates supported by a critical mass of allies to see what their needs are. Unlike the Justice Democrats or the Winning Primaries table led by CPD, Indivisible, and the Working Families Party, this PAC would focus solely on drafting and supporting candidates on all levels. Instead, track who the movements are picking at all levels. This would be critical as progressive candidates continue to appear in abundance. A PAC (or 501c4) could also add candidates in not only electioneering via the coordination of volunteers, donations and independent expenditures, but also with candidate training. There is no real space for Berniecrat and democratic socialists to have campaign training tailored to their unique space in the US electoral landscape. Educating candidates on how to build the broad coalitions needed to defeat the establishment and work with other progressives is necessary for the Left to win more races. Absent a maturing electoral strategy, victories will become more elusive as the powers that be are more alert to challengers and their methods. This work is crucial for the long-term sustainability of the Left as a project. Electing downballot candidates is essential to demonstrating that we can govern. Without Mayor Bernie Sanders there would have never been Congressman or Senator Sanders. Certainly, without his time as Burlington’s executive could he have ever dreamed of running for president. Such trainings and endorsements should also prioritize women, immigrants and people of color that make up the rising American electorate. It is imaginable that such a PAC would also do party reform work and other advocacy work if there was staff and funding available. However, the primary focus of such an organization should be training, advancing, and electing candidates that promote Bernie’s vision of a better United States and world.", "url": "https://jacobinmag.com/2020/04/our-revolution-failed-to-live-up-to-its-potential-but-the-bernie-movement-needs-a-mass-organization-now"}