{"authors": [], "date_download": "2020-05-04 20:07:12", "date_modify": "2020-05-04 20:07:12", "date_publish": "2020-04-09 21:02:16", "description": "VAIL, Colo. (AP) — A Colorado ski lift operator was not paying attention when a New Jersey man suffocated after his coat got caught on the lift and kept him from breathing, authorities said in a...", "filename": "_b052dfdc07e696f741de1cfd09e8eed2_1588622832.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b052dfdc07e696f741de1cfd09e8eed2_1588622832.html", "title": "Report: Colorado ski attendant inattentive during lift death", "title_page": "Report: Colorado ski attendant inattentive during lift death", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "VAIL, Colo. (AP) — A Colorado ski lift operator was not paying attention when a New Jersey man suffocated after his coat got caught on the lift and kept him from breathing, authorities said in a report.\nJason Varnish, 46, died of positional asphyxia at Vail Mountain’s Blue Sky Basin area Feb. 13, the Eagle County coroner said.\nVarnish had been skiing with a friend. The men were attempting to board a chairlift when Varnish’s clothing caught on a rubber stopper on the seat, an Eagle County Sheriff’s Office incident report released Wednesday said.\nVarnish was lifted 20 to 25 feet (6.1 to 7.6 meters) off the ground, the report said, adding that Varnish’s companion “hollered to the lift operator to stop the lift.”\n“The lift operator was not paying attention and had been cleaning off snow in the area,” the report said.\n“Jason was struggling, trying to get unhooked and getting his coat unzipped,” the report said.\nResort guests tried unsuccessfully to form a human pyramid to push up Varnish’s legs and feet, the report said, noting the operator initially said he could not reverse the lift without permission.\nThe death was ruled an accident.\nVail Resorts Inc. did not immediately return an email seeking comment Thursday.", "url": "https://apnews.com/b052dfdc07e696f741de1cfd09e8eed2"}