{"authors": [], "date_download": "2020-05-04 20:22:19", "date_modify": "2020-05-04 20:22:19", "date_publish": "2020-04-10 21:01:20", "description": "SIOUX CITY, Iowa (AP) — A Nebraska man who intentionally rammed a Sioux City police officer's car during an escape attempt was sentenced Friday to 20 years in prison. Douglas St. Cyr, 30, of...", "filename": "_90b47911d75e24392c80fbefd150d0cb_1588623739.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_90b47911d75e24392c80fbefd150d0cb_1588623739.html", "title": "Nebraska man sentenced for ramming Iowa officer's car", "title_page": "Nebraska man sentenced for ramming Iowa officer's car", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SIOUX CITY, Iowa (AP) — A Nebraska man who intentionally rammed a Sioux City police officer’s car during an escape attempt was sentenced Friday to 20 years in prison.\nDouglas St. Cyr, 30, of Winnebago, Nebraska, had sought probation after acknowleding that he needed treatment for a drug problem. But District Judge Steven Andreasen said the severity of Cyr’s crimes, plus his criminal history, warranted a prison sentence, The Sioux City Journal reported .\nAndreasen found St. Cyr guilty last month of assault on a peace officer, leaving the scene of a personal injury accident, possession of ammunition by a domestic abuser and failure to appear. He was also found guilty of possession of a controlled substance and driving while his license was barred in a separate case.\nThe confrontation occurred July 31, when officers triying to arrest St. Cyr on an outstanding warrant had his vehicle boxed in. St. Cyr struck the undercover officer’s vehicle, prompting the officer to fire at St. Cyr’s vehicle. St. Cyr was not hit and tried to flee on foot but was arrested.\nThe officer was treated and released for his injuries.", "url": "https://apnews.com/90b47911d75e24392c80fbefd150d0cb"}