{"authors": ["Lily Geismer", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Branko Marcetic", "Paul Heideman", "John Patrick Leary"], "date_download": "2020-05-04 20:00:02", "date_modify": "2020-05-04 20:00:02", "date_publish": "2020-02-18 00:00:00", "description": null, "filename": "2020_02_jesse-jacksons-political-revolution_1588622402.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/02/18101937/geismerwide.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_02_jesse-jacksons-political-revolution_1588622402.html", "title": "Jesse Jackson’s Political Revolution", "title_page": "Jesse Jackson’s Political Revolution", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "At 11 pm on July 17, 1984, Jesse Jackson strode to the podium at the Democratic National Convention to deliver a nearly hour-long speech. Many saw his appearance as the high point of an otherwise drab event. Jackson had lost after a bruising presidential primary fight, and the organizers hoped he would use the speech to heal divisions in the party. Instead, Jackson demanded a place in the party’s agenda for progressive policies and his multiracial voting base, which he anointed the Rainbow Coalition. He counseled the Democrats to spread the message that “all of us count and all of us fit somewhere.” And he insisted that if the party advocated reallocating defense spending to building bridges, schools, and hospitals — providing jobs and better services for all — then “the whole nation will come running to us.” The presidential elections of 1984 and 1988 generally reside in the wastebasket of Democratic Party history, cautionary tales dredged up only to illustrate a dark chapter in the party’s past. Yet looking beyond the November electoral returns to the primary campaigns of Jesse Jackson in those two elections reveals a pivotal moment when the vision and composition of the Democratic Party was very much in flux — and a universalist, social-democratic politics could have won out over the market boosterism, “choice and competition,” and upper-middle-class-centric approach of the Democratic Leadership Council.\nFrom New Deal to Atari Democrats The New Deal of the 1930s and ’40s fundamentally remade the Democratic Party, the nation’s political economy, and ordinary people’s relationship with the federal government. The hope of the movement reached its apotheosis in Franklin D. Roosevelt’s 1944 Second Bill of Rights, which proposed a right to employment, housing, education, and health care and a counterweight to corporate power. The New Deal itself fell short of delivering on these promises. It was never fully universal, connecting key privileges like Social Security to work rather than to citizenship and containing loopholes that excluded African Americans, women, and other marginalized groups from many programs. Yet its key social provisions, commitment to labor rights, and advocacy of full employment transformed the nation’s economy and shifted the balance of power away from employers and toward all workers. The state of California and New York City applied these principles at the local level, creating tuition-free public higher education, services like municipal hospitals and clinics, and a bevy of public-sector jobs. By the 1980s, however, a new generation of Democratic politicians had emerged, eager to jettison a New Deal mantle they regarded as outmoded. In the 1984 Democratic presidential primary, Colorado senator Gary Hart served as the torchbearer for these tech-friendly “Atari Democrats,” or “neoliberals,” who defined themselves in opposition to the New Deal. During his initial Senate bid in 1974, Hart declared that it was “time to replace the New Deal,” and in office, he and his fellow Atari Democrats touted the market and private sector, especially the high-tech industry, as not just a mechanism for growth but a tool of reform, regulation, and opportunity. The Atari Democrats pushed the party to abandon full employment, a platform plank since the 1930s, and argued instead that bestowing workers with the education and skills to compete in the postindustrial global economy provided a better means to achieve economic stability. There was a class component to this change of heart: the Atari Democrats recognized that principles of meritocracy and competition would appeal more to the middle-class “knowledge workers” that they saw as the central ingredient of the party’s viability going forward. In the eyes of Hart and his allies, labor and communities of color were “special interests”; the future of the party was with white-collar, baby boomer “Yuppies,” a term coined to describe his supporters. Jesse Jackson’s view was strikingly different. Though not without his own foibles — critics charged that Jackson stole thunder from grassroots progressive groups and didn’t have an organic base in Chicago’s black community — Jackson constructed his presidential bid around the Rainbow Coalition and made racial discrimination, economic equality, and workers’ rights the unifying themes of his campaign. He attracted support across a wide range of voters whom he called “the desperate, the damned, the disinherited, the disrespected, and the despised”— those left out of the Reagan Revolution and, Jackson charged, the priorities of the Democratic Party as well. While both Jackson and Hart eventually lost out to Minnesota senator Walter Mondale in 1984 — Hubert Humphrey’s protégé, Jimmy Carter’s vice president, and a close ally of the AFL-CIO — the 1988 Democratic primary was in many ways a repeat of the contest that took place four years earlier. This time, Massachusetts governor Michael Dukakis took up the torch of the Atari Democrats, appealing to the white, suburban-oriented professional class. Jackson returned to the fray as well, presenting himself as the candidate of workers, farmers, the unemployed, and the homeless — those who had not prospered during the Reagan years. He buttressed his message from 1984 with a more specific set of policies that he labeled “the opposite of Reaganomics.” Declaring that it was time to “stop economic violence against American farmers and workers,” his platform included a moratorium on family farm foreclosures; civil rights legislation to protect lesbians and gay men; reinvestment in key infrastructure like roads, mass transit, and water systems; a national minimum for welfare benefits; an increase in annual Social Security payments; and a doubling of federal spending on education to provide more aid for college students and fully underwrite special education, bilingual, and Head Start programs. In perhaps his boldest demand — a forerunner of the current call for Medicare for All — Jackson endorsed a universal, single-payer health-care system. He denounced the “wasteful, public-private patch-work medical delivery system” and proposed a “national health program” administered by the federal government and funded by raising taxes on corporations and “the richest 1 percent” of Americans. These promises found a broad-based following. Black Americans on Chicago’s South Side, white autoworkers in Michigan, farmers in Wisconsin, and progressives in San Francisco and Boston all flocked to the Jackson campaign. Jackson once again fell short in the delegate count. But he struck fear in the hearts of much of the party establishment — presaging the rise of Bernie Sanders (who endorsed Jackson in 1988) and Alexandria Ocasio-Cortez, who have shown that political majorities can be made and won by organizing around bold universal programs.\nRebels of the Middle Class Another insurgency, nevertheless, had been brewing on the other side of the Democratic spectrum. On the heels of the 1984 election, Atari Democrats like Tennessee senator Al Gore joined forces with a group of Southern moderate governors to form the Democratic Leadership Council (DLC). The group’s goal: move the party away from its perceived focus on special interest groups — especially organized labor — and toward the center. New Deal universalism was out, tech-savvy “choice and competition” were in. In the aftermath of Dukakis’s loss in the 1988 general election to George H. W. Bush, the DLC leadership realized that it needed to develop both a clearer strategy and a more coherent set of principles and policies to win control of the party and the White House. The group created a think tank, the Progressive Policy Institute, to deepen its intellectual infrastructure and formulate clearer policy proposals. And in early 1990, the DLC issued the “New Orleans Declaration,” a manifesto outlining the group’s key ideas. “The political ideas and passions of the 1930s and 1960s,” it opened, “cannot guide us in the 1990s . . . The Democratic Party’s fundamental mission is to expand opportunity, not government,” adding later that the “free market, regulated in the public interest, is the best engine of general prosperity.” According to the declaration, workers needed more skills and education — not stronger labor unions or a job guarantee — and the poor needed to be brought “into the nation’s economic mainstream.” DLC policies like expanding the earned income tax credit (EITC) stressed the need to make assistance conditional on work and other markers of good behavior rooted in the meritocratic sensibilities of Atari Democrats and their base. Not surprisingly, these ideas failed to win over Jesse Jackson, who tarred the group “Democrats of the Leisure Class” and accused them of trying to “suburbanize the Democratic Party.” He derided the DLC’s focus on choice as a “code word for exclusion,” a covert effort “to shift the political center away from the moral center of racial justice, gender equality, and peace.” During the DLC’s 1991 convention, Jackson staged a series of rival appearances, including a speech in front of a banner emblazoned “Jobs for Justice.” But by 1992, the DLC was fully ascendant. Bill Clinton, the Arkansas governor and leader of the organization, based his presidential bid largely on DLC principles, which had a direct impact on the image and focus of the party. He and his organization pressed the delegates at the 1992 Democratic convention to adopt a platform that made no direct mention of unions and eschewed “an outdated faith in programs as the solution to every problem.” Instead, it declared that “an expanding, entrepreneurial economy of high-skill, high-wage jobs is the most important family policy, urban policy, labor policy, minority policy and foreign policy America can have.”", "url": "https://www.jacobinmag.com/2020/02/jesse-jacksons-political-revolution"}