{"authors": ["Por Terry Spencer"], "date_download": "2020-05-04 20:23:06", "date_modify": "2020-05-04 20:23:06", "date_publish": "2020-04-15 23:49:14", "description": "FORT LAUDERDALE, Florida, EE.UU. (AP) — El exlanzador Roy Halladay presentaba altos niveles de anfetaminas en su organismo y realizaba piruetas riesgosas en su avión, cuando perdió el control de...", "filename": "_37d970e9fd0b41f3a7e67d169a01e59a_1588623786.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_37d970e9fd0b41f3a7e67d169a01e59a_1588623786.html", "title": "Reporte: Halladay había consumido drogas cuando se estrelló", "title_page": "Reporte: Halladay había consumido drogas cuando se estrelló", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nFORT LAUDERDALE, Florida, EE.UU. (AP) — El exlanzador Roy Halladay presentaba altos niveles de anfetaminas en su organismo y realizaba piruetas riesgosas en su avión, cuando perdió el control de éste y sufrió un accidente fatal en el Golfo de México en 2017, señala un informe emitido por las autoridades.\nLos niveles de anfetaminas en la sangre de Halladay representaban 10 veces la dosis recomendada en terapia. Su organismo presentaba también altos niveles de morfina y un antidepresivo que podía impedir la toma adecuada de decisiones, señala el reporte de la Junta Nacional de Seguridad en el Transporte (NTSB), difundido el miércoles.\nAgrega que Halladay realizaba ascensos y virajes violentos, descendiendo en ocasiones a tan sólo metro y medio (5 pies) del agua, el 7 de noviembre de 2017, cuando se estrelló frente a las costas de la Florida.\nLas maniobras ejercieron cargas que representaron casi dos veces la fuerza de gravedad sobre la aeronave Icon A5 que Halladay había comprado apenas un mes antes. En su última maniobra, Halladay intentó un ascenso pronunciado, pero la velocidad aminoró a unos 135 kilómetros (85 millas) por hora.\nEl avión a hélice cayó en picada hacia el agua.\nEl informe indica que Halladay, quien tenía 40 años, murió por traumatismo agudo y ahogamiento. No menciona una causa definitiva del accidente, pero ésta se revelaría pronto.\n“El informe que la NTSB reveló ayer sobre el accidente de Roy fue doloroso para nuestra familia, ya que hizo revivir el peor día de nuestras vidas”, dijo la esposa de Halladay, Brandy, en un comunicado divulgado el jueves. “Reitera lo que previamente he dicho, que nadie es perfecto. Muchas familias tienen algún problema y la nuestra no era una excepción. Pedimos respetuosamente no hacer suposiciones o juicios de valor”.\nAproximadamente una semana antes del accidente, el exastro de los Azulejos de Toronto y los Filis de Filadelfia había piloteado el avión para pasar por debajo del emblemático puente Skyway de Tampa Bay.\n“¡Volar el Icon A5 sobre el agua es como volar un avión de combate!”, manifestó entonces en las redes sociales Halladay, ocho veces elegido al Juego de Estrellas.\nEl as lanzó un juego perfecto en 2010. Ese mismo año, logró un juego sin hit en postemporada.\nJugó en los Azulejos de 1998 a 2009 y en los Filis de 2009 a 2013. Tuvo un récord de 203-105 y una efectividad de 3.38.\nEl año pasado, se le exaltó al Salón de la Fama de manera póstuma.\nHalladay había despegado de un lago cercano a su casa, unos 15 minutos antes de la tragedia. Un reporte anterior señalaba que la aeronave se desplazaba a unos 170 kph (105 mph) y a escasos 3,3 metros (11 pies) del agua, antes de que el expelotero comenzara con las acrobacias.\nEl pitcher retirado acumulaba unas 700 horas de vuelo luego de obtener su licencia de piloto en 2013, indicaba el informe anterior. Había volado 51 horas en un Icon A5, incluidas 14 en el avión en que murió.\nLanzado en 2014, el A5 es un avión anfibio, usado con fines recreativos y provisto de alas plegables. La aeronave puede transportarse fácilmente en un remolque hacia algún lago, y puede despegar desde la superficie de éste.", "url": "https://apnews.com/37d970e9fd0b41f3a7e67d169a01e59a"}