{"authors": ["Jack Guy"], "date_download": "2020-05-04 16:26:10", "date_modify": "2020-05-04 16:26:10", "date_publish": "2020-04-07 13:04:57", "description": "Herons using bread or insects as bait to catch fish, carrion crows dropping nuts onto roads so passing cars crack open their shells and great cormorants timing their fishing periods in New Zealand to take advantage of the strong currents generated by commercial ferries.", "filename": "2020_04_07_world_birds-new-behaviors-study-scli-intl-scn_index_1588609570.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407102831-02-adaptable-birds-great-cormorant-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_world_birds-new-behaviors-study-scli-intl-scn_index_1588609570.html", "title": "Birds that learn new behaviors less likely to go extinct, says study", "title_page": "Birds that learn new behaviors less likely to go extinct, says study - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Herons using bread or insects as bait to catch fish, carrion crows dropping nuts onto roads so passing cars crack open their shells and great cormorants timing their fishing periods in New Zealand to take advantage of the strong currents generated by commercial ferries.\nThese are just some of the ways in which birds have adapted -- and optimized -- their survival habits because of humans.\nNow, a new study has found that birds that are able to change their behavior in this way are less likely to become extinct than those that do not adapt.\nCarrion crows are one of many bird species that exhibit innovative behaviors.\nThese adaptations may include incorporating new food into their diet, or developing new hunting techniques, said a team of researchers from Canada's McGill University and CREAF Barcelona, Spain, in a study published Monday.\nSuch innovative behaviors are a measure of \"behavioral plasticity,\" which has long been considered beneficial in avoiding extinction.\nRead More", "url": "https://www.cnn.com/2020/04/07/world/birds-new-behaviors-study-scli-intl-scn/index.html"}