{"authors": ["Elissa Strauss"], "date_download": "2020-05-04 16:13:16", "date_modify": "2020-05-04 16:13:16", "date_publish": "2020-04-03 09:15:21", "description": "Helping as a family is a great way to cope and boost everyone's morale during these difficult times caused by the novel coronavirus.", "filename": "2020_04_03_health_parenting-look-for-the-helpers-wellness_index_1588608796.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402214110-be-a-helper-mr-rogers-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_health_parenting-look-for-the-helpers-wellness_index_1588608796.html", "title": "Don't just look for the helpers. Be a helper", "title_page": "Don't just look for the helpers. Be a helper - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "It's a good line. Thank you, Mr. Rogers. And its endurance isn't surprising.\nThe presence of helpers offers us hope in moments of chaos. The world might feel terrible right now, with a pandemic spreading across the globe, but, somehow, there are still people out there caring for others.\nBetter, those people think caring for others ---- the key ingredient of maintaining social bonds ---- is still worth their while. Their actions remind us that there will, after all this, be something left that's worth fighting to preserve.\nThough helping shouldn't only be something that we admire from a distance. If and when we have the bandwidth to help — remember, you have to put your oxygen masks on first — there are a number of good reasons for all of us to give it a shot.\nDoing good for others has the potential to boost our spirits and impart useful and hopeful lessons to our children during these scary and uncertain times.\nHelping others makes us feel better\nThere is a large and well-supported body of research showing that doing good for others makes us feel better.\nA 2016 study (PDF) using neuroimaging found that generosity makes us happier, a finding replicated by numerous other studies using other methodologies. Another study from 2009 tracked people ages 18 to 60, and found that those who perform acts of kindness felt more satisfied with their lives than those who did not. The list goes on and on.\nPsychologists refer to this boost as a helper's high and believe our brain creates endorphins when we perform acts of goodness. The pleasure centers of our brains light up when we give.\nNow, of course we shouldn't only give to others to help ourselves. In fact, research suggests that such attempts to game our generosity systems are unlikely to produce desired results.\nBut as we cobble together our family coping strategies right now, it doesn't hurt to keep in mind that well-intended attempts at generosity yield rewards for all parties involved. Sincerity is key, and it's the part that will be most tricky to teach to your children.\nEncourage your children to become helpers\nOne of the easiest ways to teach your children to be helpers is by doing more helping yourself.\n\"Modeling, also called observational learning, is one of the most underestimated and poorly used tools by parents,\" said Alan Kazdin, professor of psychology and child psychiatry at Yale University.\nKazdin said modeling generosity can begin by simply appreciating generosity in others. Hear about something nice someone did for someone else? Point it out.\nWhen parents do it themselves, they should make a habit of telling their children about it. Though, importantly, do not boast about it. \"Be instructive, kind and gentle, rather than righteous,\" Kazdin said. (This should not be an opportunity for parents to toot their own horns.)\nThe amazing thing about modeling, Kazdin explained, is how it can teach our children skills without them ever actually doing anything. We can change who they are just by being the people we want them to become.\nKazdin said the brain's mirror networks — the marvelous trick of the mind that allows us to feel as though we are doing what we see others doing — is probably responsible. Our kids can experience the arc of giving, the initial flush of generosity, the execution of act and the helper's high, through us.\nStart small and practice\nIn order to get kids to help on their own from a sincere place, Kazdin suggests starting small and practicing it over and over. Doing something simple like saying \"thank you\" or \"I love you\" to grandma, even if it is emotionless and rote at first, will eventually become internalized. This is especially the case if they can see how happy it makes grandma, and their parents gently note the same.\nMaryam Abdullah, the parenting program director at the Greater Good Science Center of the University of California, Berkeley, said that parents should pay careful attention to their children's emotional state before they encourage them to do larger acts of generosity on their own. If they seem distressed, this is not the right time to push.\nBut if they do seem capable of thinking outside themselves, there are a few ways to help them tap into their generous sides. For one, try to tap into their strengths and give them examples of how they use that strength to help someone else. Do they like to draw? Tell jokes? Can they share?\nFocus on your children's interests\nParents can also tap into their children's interests. Do they like otters? Parks? Donuts from a local store that is currently holding a GoFundMe? Perhaps they could donate some of their allowance money to whatever it is they love.\nIs there an elderly neighbor or someone from your religious community who might benefit from some contact right now? Maybe your kids can draw them a picture or write them a letter. Or you could offer to buy them groceries and your kid joins you for the delivery (from a distance). They could also help a parent organize and box up donations of medical supplies for a local hospital.\nDoing good can also take place between friends and families.\nMaybe your child learns about the power of a check-in with a friend or a relative during a tough moment. Simply saying \"how are you?\" at the right time, with the right intention, can absolutely qualify as a good deed.\nThere's also a lot of potential right at home.\nEach sibling, or member of the family, can come up with an idea of something nice to do for one another. They could bake their sister's favorite cookies. They could let their little brother choose the cartoon during television time. They could go for a bike ride with dad, even though they'd rather take a walk.\n\"Present it as an opportunity that they have a say in, too. You want to capitalize on their own intrinsic motivations, because that increases the likelihood that they will feel good doing it and have that warm, glowy feeling afterward,\" Abdullah said.\nAlmost as important as doing the act is reflecting on it after, she explained. Parents need to celebrate their kids for doing it, and help their kids understand the ramifications of their good deed. Abdullah said this is especially important for older kids, as it \"helps them tell the stories of themselves. 'This is who I am. This is the kind of person I want to be.' ''\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nFor younger kids, Abdullah recommends keeping the giving projects to ideas that they are likely to succeed in.\n\"You want to feel successful. Research shows that if you ask a child to be a helper, and give them a task that they weren't successful at, it can undermine their desire to help in the future.\"\nWith our children, and ourselves, this is no time to expect saintliness. Some days, we are going to feel like we deserve the Nobel Peace Prize just for getting everyone to brush their teeth morning and night.\nBut the longer we remain in this uncertain, isolated and scary state, the more we will need to seek out ways to feel connected to other people and feel good. What makes being the helper so exceptional is that it allows us to do both at once.", "url": "https://www.cnn.com/2020/04/03/health/parenting-look-for-the-helpers-wellness/index.html"}