{"authors": [], "date_download": "2020-05-04 21:06:05", "date_modify": "2020-05-04 21:06:05", "date_publish": "2020-04-20 20:18:52", "description": "MINOT, N.D. (AP) — The Minot City Council fired the city manager Monday after an independent investigator found that he created a hostile work environment for city employees. The council...", "filename": "_6afc3de6675c6a95b6fe9498eb095150_1588626365.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6afc3de6675c6a95b6fe9498eb095150_1588626365.html", "title": "Minot council fires city manager over work environment", "title_page": "Minot council fires city manager over work environment", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MINOT, N.D. (AP) — The Minot City Council fired the city manager Monday after an independent investigator found that he created a hostile work environment for city employees.\nThe council voted unanimously to fire City Manager Tom Barry at a special meeting after he refused to resign immediately. The city hired an outside investigator, attorney Patricia Monson, in March to investigate Barry.\nMonson concluded that city employees were subject to a hostile work environment and may have had their free speech rights violated, KX News reported.\nMonson’s 24-page report concluded that “termination is the only appropriate option,” Alderman Stephan Podrygula said. The report also found that Barry and the City of Minot were vulnerable to lawsuits.\nThe City Council first voted to recommend that Barry resign his position immediately. Barry declined, saying he would ask his own attorney before making a decision. The council, including Mayor Shaun Sipma, then voted to fire him.\nThe investigation began after political blogger Rob Port wrote about apparent attempts by Barry to prevent city staff from talking to him.\nAfter the council voted to fire him, Barry thanked council members for giving him the chance to serve the city.\n“I have a lot left to learn, evidently,” he said.\nBarry had been city manager since 2016. He left soon after the vote and could not be reached for comment.", "url": "https://apnews.com/6afc3de6675c6a95b6fe9498eb095150"}