{"authors": [], "date_download": "2020-05-04 20:22:50", "date_modify": "2020-05-04 20:22:50", "date_publish": "2020-04-20 21:16:35", "description": "MISSOULA, Mont. (AP) — University of Montana women's basketball assistant Mike Petrino has been named the program's interim head coach for the 2020-21 season, athletics director Kent Haslam said...", "filename": "_1d098dcbaf2dbe04dc873f38f3576c6f_1588623770.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1d098dcbaf2dbe04dc873f38f3576c6f_1588623770.html", "title": "Mike Petrino named Montana interim women's basketball coach", "title_page": "Mike Petrino named Montana interim women's basketball coach", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MISSOULA, Mont. (AP) — University of Montana women’s basketball assistant Mike Petrino has been named the program’s interim head coach for the 2020-21 season, athletics director Kent Haslam said Monday.\nThe athletic department will conduct a national search for a permanent head coach next spring, Haslam said. Assistants Jordan Sullivan, Nate Covill and Jace Henderson will return, he said.\n“Mike is deeply committed to our student-athletes, the Lady Griz basketball program and our network of boosters and fans across Montana,” Haslam said in a statement.\nPetrino, who was born in Glasgow and raised in Kalispell, has more than two decades of coaching experience, from high school freshmen to four years as an assistant at Wyoming and one season at Colorado. He has been an assistant at Montana since August 2016.\nPetrino takes over for Shannon Schweyen, whose contract wasn’t renewed earlier this month after her teams posted a 52-69 record in four seasons. Schweyen was an All-America basketball player for the Lady Griz and was an assistant coach for 24 years before being named head coach in 2016.\n“I sincerely appreciate the years of service and dedication Shannon Schweyen has given to the Lady Griz program as a player and a coach. She is without a doubt the greatest women’s basketball player in the history of Montana,” said Haslam.", "url": "https://apnews.com/1d098dcbaf2dbe04dc873f38f3576c6f"}