{"authors": ["Tim Booth"], "date_download": "2020-05-04 20:23:07", "date_modify": "2020-05-04 20:23:07", "date_publish": "2020-04-16 16:24:25", "description": "RENTON, Wash. (AP) — Maybe this will finally be the year there is a bit of certainty with how the Seattle Seahawks approach the NFL draft. There is a clear and obvious need for the Seahawks...", "filename": "_d394492973e707810970e3d3cb91f9c6_1588623787.html", "image_url": "https://storage.googleapis.com/afs-prod/media/42829eab75e9485a86d51d2fad5990dd/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d394492973e707810970e3d3cb91f9c6_1588623787.html", "title": "Seahawks draft agenda should begin on the defensive line", "title_page": "Seahawks draft agenda should begin on the defensive line", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Nov. 11, 2019, file photo, Seattle Seahawks defensive end Jadeveon Clowney (90) applies pressure to San Francisco 49ers quarterback Jimmy Garoppolo (10) during an NFL football game in Santa Clara, Calif. Seattle made a couple of additions bringing back Bruce Irvin and Benson Mayowa in free agency. But with continued uncertainty about Clowney, the pass rush must be a priority in the upcoming draft. (AP Photo/Tony Avelar, File)\nFILE - In this Nov. 11, 2019, file photo, Seattle Seahawks defensive end Jadeveon Clowney (90) applies pressure to San Francisco 49ers quarterback Jimmy Garoppolo (10) during an NFL football game in Santa Clara, Calif. Seattle made a couple of additions bringing back Bruce Irvin and Benson Mayowa in free agency. But with continued uncertainty about Clowney, the pass rush must be a priority in the upcoming draft. (AP Photo/Tony Avelar, File)\nRENTON, Wash. (AP) — Maybe this will finally be the year there is a bit of certainty with how the Seattle Seahawks approach the NFL draft.\nThere is a clear and obvious need for the Seahawks to address along the defensive line, and it happens to be one of the deeper positions of talent in the entire draft.\nThat may be far too simplistic and straightforward for Seattle general manager John Schneider and coach Pete Carroll. Schneider is always good for a few surprises in the draft, and more than a couple of trades.\nSo, while it seems addressing the pass rush — especially with the continuing unknowns around Jadeveon Clowney — is the obvious direction for Schneider and the Seahawks, it’s never that clear with Seattle.\n“It’s really a daily or weekly process of figuring out how you’re going to put this thing together,” Schneider said in late February at the NFL combine. “We have some cap flexibility this year, which is great, but it’s not just about this year. It’s planning for next year and the following year as well. We have to be cognizant of where we’re going.”\nSeattle will go into the draft with seven picks. It’s an improvement over last year when they Seahawks started with just four selections and by the time draft weekend wrapped up had made 11 picks through a series of significant moves by Schneider to stockpile additional picks.\nSchneider may not need to be as active this time around with a few more selections in hand to start, and three picks in the top 65. But quantity has always been a priority for Seattle. And the Seahawks haven’t used their original first-round pick since 2011.\nSeattle currently has the 27th overall pick, but there’s a high likelihood that won’t be where the Seahawks pick on the first night of the draft.\nSOLVE THE RUSH\nSeattle finished last season tied for 30th in the league in sacks with 28. That was with Clowney in the lineup, although he was hampered by a core muscle injury the latter half of the season. Seattle made a couple of additions by bringing back Bruce Irvin and Benson Mayowa in free agency. But with continued uncertainty about Clowney, the pass rush must be a priority in the draft.\nWhether Seattle uses its first pick on that position is the great unknown. It’s a deep draft along the defensive line, and while pass rush is the top priority, the Seahawks could use another versatile interior defensive lineman after losing underrated Quinton Jefferson in free agency. Expect sometime in the first two days the target to end up being that pass rusher.\nTHE OTHER LINE\nSeattle has spent a significant chunk of its offseason capital on the offensive line. The Seahawks reached deals with tackles Brandon Shell and Cedric Ogbuehi and interior linemen B.J. Finney and Chance Warmack. They also brought back veteran Mike Iupati.\nEven with that level of investment the Seahawks are likely to make some additions in the draft. Center could be a focus with Justin Britt entering the final year of his contract and coming off a torn ACL.\nLAST LINE\nOne of the major offseason moves was acquiring cornerback Quinton Dunbar from Washington. Tre Flowers was shaky last season and the move with Dunbar gives the Seahawks options in the secondary.\nStill, the defensive backfield is likely to see some additions. Seattle could use one more safety behind the trio of Bradley McDougald, Quandre Diggs and last year’s second-round pick, Marquise Blair.\nTHE WILD CARD\nSchneider is always good for one draft surprise, whether it was the decision to take Russell Wilson back in 2012 or using a first-round pick on running back Rashaad Penny just two years ago.\nAdding a running back this time around would make sense with both Penny and Chris Carson coming off significant injuries. But what will be Seattle’s curveball? Another wide receiver? A linebacker?\nThere will be at least one move by the Seahawks that will raise eyebrows.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/d394492973e707810970e3d3cb91f9c6"}