{"authors": [], "date_download": "2020-05-04 21:06:53", "date_modify": "2020-05-04 21:06:53", "date_publish": "2020-04-20 19:06:41", "description": "EASTON, Pa. (AP) — An Alaska man has pleaded guilty to making a bogus online threat that disrupted exams and a graduation ceremony at an eastern Pennsylvania college almost two years...", "filename": "_c7bbb94ae1e28817fdd1e7c0d2a3a5be_1588626413.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c7bbb94ae1e28817fdd1e7c0d2a3a5be_1588626413.html", "title": "Guilty plea in bogus online threat to Pennsylvania college", "title_page": "Guilty plea in bogus online threat to Pennsylvania college", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "EASTON, Pa. (AP) — An Alaska man has pleaded guilty to making a bogus online threat that disrupted exams and a graduation ceremony at an eastern Pennsylvania college almost two years ago.\nGavin Lee Casdorph, 21, of Anchorage pleaded guilty to one count of willfully making false threats in connection with the May 2018 threat to Lafayette College.\nCollege officials said someone purporting to be a student with loyalty to the Islamic State threatened an attack with “pipe bombs, pressure cookers and nail bombs.” Officials said they instituted room-by-room searches, disrupting students studying for exams, and changed exam times and the graduation ceremony location.\nFederal authorities alleged that the defendant was involved in a dispute with fellow players of an online game.\nDefense attorney Caroline Goldner Cinquanto told The (Allentown) Morning Call that the maximum prison sentence is 10 years but her client will get credit for taking responsibility and that could reduce the sentence to be imposed Aug. 4.\nShe said Casdorph suffers from significant mental health issues that played a role in his actions and pleaded guilty “because he is genuinely sorry about the way those actions affected the faculty and students at Lafayette College.”", "url": "https://apnews.com/c7bbb94ae1e28817fdd1e7c0d2a3a5be"}