{"authors": ["Mark Scolforo"], "date_download": "2020-05-04 20:16:06", "date_modify": "2020-05-04 20:16:06", "date_publish": "2020-04-09 18:06:29", "description": "HARRISBURG, Pa. (AP) — A federal judge signed off on a settlement Thursday between Pennsylvania death row prisoners and the state Corrections Department to make broad changes to their confinement...", "filename": "_13eed4b8d2ec26834201a2be3f91ab6b_1588623366.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_13eed4b8d2ec26834201a2be3f91ab6b_1588623366.html", "title": "Death row inmates' deal for better conditions gets approved", "title_page": "Death row inmates' deal for better conditions gets approved", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HARRISBURG, Pa. (AP) — A federal judge signed off on a settlement Thursday between Pennsylvania death row prisoners and the state Corrections Department to make broad changes to their confinement rules.\nU.S. District Judge John Jones approved the deal that gives the state’s death-sentenced inmates the same conditions as inmates in general population, although they will continue to be segregated in special units at three prisons.\nThe agreement, Jones wrote, “effectuates a sweeping alteration of the class members’ conditions of confinement. As such, we have absolutely no hesitancy in approving it.”\nFive prisoners sued the corrections secretary and others in 2018 to challenge practices that kept them isolated most of the time, conditions they argued were inhumane.\nAs a result of the agreement, death-sentenced inmates will not be strip searched or shackled while moving within their housing unit, unless there is a specific security reason for it. They will not have to wear clothing that distinguishes them from other prisoners, and their cells will not be illuminated at night.\nThey will be allowed to purchase TVs, tablets and other items allowed in the general inmate population, and are guaranteed at least four hours of activities outside their cells during normal waking hours every day, amounting to at least 42 hours a week.\nThey no longer face mandatory cell changes every three months.\nThe state prison system currently has 131 inmates with pending death sentences, nearly all at the Greene and Phoenix facilities. The state has only executed three inmates since the death penalty was reinstated in the 1970s, and all three had given up on their appeals.\nGov. Tom Wolf, a Democrat, has imposed a moratorium on executions. A Corrections Department spokeswoman said the agency had no comment on the settlement.", "url": "https://apnews.com/13eed4b8d2ec26834201a2be3f91ab6b"}