{"authors": ["Kathy Mccormack"], "date_download": "2020-05-04 21:08:57", "date_modify": "2020-05-04 21:08:57", "date_publish": "2020-04-15 20:49:45", "description": "CONCORD, N.H. (AP) — No officers will be charged over a 15-hour hotel standoff in which an armed man was fatally shot by police and an armed couple who wouldn’t surrender died from a mixture of...", "filename": "_d5c18c52be6e4a8efcfb9bca96de72ad_1588626537.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d5c18c52be6e4a8efcfb9bca96de72ad_1588626537.html", "title": "Police not charged in hotel shooting, standoff, report says", "title_page": "Police not charged in hotel shooting, standoff, report says", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CONCORD, N.H. (AP) — No officers will be charged over a 15-hour hotel standoff in which an armed man was fatally shot by police and an armed couple who wouldn’t surrender died from a mixture of drugs, the New Hampshire attorney general’s office said in a report released Wednesday that calls the police actions justified.\nPolice got a call in March 2019 that the three, who were wanted on outstanding warrants on drug charges, were at the Quality Inn in Manchester. Police evacuated other rooms and spoke to one of the three, Stephen Marshall, 51, on the phone.\nMarshall eventually left the hotel and held out a gun, ignoring commands to drop it, the report said. He was killed by multiple gunshot wounds in a confrontation with law enforcement officers outside the hotel.\nFor more than 13 hours after that, the other two, Christian and Brandie St. Cyr, who were married, were in an armed standoff as police tried to negotiate a peaceful surrender, according to the attorney general’s report. At least 32 shots were fired from their hotel room.\nA review of text messages between the St. Cyrs and acquaintances showed they did not intend to surrender, according to the report.\n“Negotiators made over one hundred phone calls and texts to the occupants and had several conversations,” the report said. “They used a public address system, and yelled through the window and doorway to explain that nobody would be hurt and they just had to walk out into the hallway. “\nThroughout that time, police used lethal force only once, after Christian St. Cyr fired while officers were using a fire hose to take down a section of drywall blocking their view, the report said. An officer returned fire, but the bullets didn’t strike anyone, the report said.\nPolice eventually found Brandie St. Cyr dead and Christian St. Cyr unconscious in the room. He later died at a hospital.\nThe medical examiner said they were not shot. The cause of death for both was the combined effects of environmental hypothermia — they had shot through a water pipe and water had been pouring into the room — and a mixture of drugs, specifically acute intoxication by fentanyl, acetyl fentanyl, methamphetamine and cocaine. Christian St. Cyr also suffered blunt penetrating injuries.\nAuthorities said the deaths resulted from a combination of incidental, self-imposed and inflicted conditions.", "url": "https://apnews.com/d5c18c52be6e4a8efcfb9bca96de72ad"}