{"authors": ["Katie Lobosco"], "date_download": "2020-05-04 16:52:22", "date_modify": "2020-05-04 16:52:22", "date_publish": "2020-04-08 10:08:58", "description": "There are as many as 10 million low-income, childless adults in the United States who are eligible for the federal government's stimulus payment program, but are at risk of missing out on the money, according to tax experts.", "filename": "2020_04_08_politics_america_654ea469e8f7bea17fbaf187f2115766_index_1588611142.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190905130549-dollar-bills--stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_america_654ea469e8f7bea17fbaf187f2115766_index_1588611142.html", "title": "Stimulus checks: Millions of low-income Americans are at risk of missing out on payments", "title_page": "Stimulus checks: Millions of low-income Americans are at risk of missing out on payments - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) There are as many as 10 million low-income, childless adults in the United States who are eligible for the federal government's stimulus payment program, but are at risk of missing out on the money, according to tax experts.\nThat's because they aren't required to file tax returns, making it harder for the IRS to verify their income -- or even to know who they are or where to find them.\n\"These folks are very disconnected from the tax system. It's going to be very hard to get their payments out,\" said Elaine Maag, a research associate in the Urban-Brookings Tax Policy Center.\nPeople who have filed returns and others in government programs like Social Security will automatically receive the stimulus payments, which are worth up to $1,200 per person.\nMaag estimates there about 10 million people who may not be in the IRS system because they don't earn enough money and see little incentive to claim tax credits. By law, people don't have to file if they earn less than $12,200. Those without children aren't eligible for the child tax credit and are usually due relatively small amounts under the Earned Income Tax Credit.", "url": "https://www.cnn.com/2020/04/08/politics/americans-left-out-covid-stimulus-payments/index.html"}