{"authors": [], "date_download": "2020-05-04 16:27:00", "date_modify": "2020-05-04 16:27:00", "date_publish": "2020-04-07 16:19:04", "description": "If you've had your eye on any Amazon Echo, now's the time to buy. Amazon has dropped prices on nearly every Echo device. We're breaking down the discounts on this product lineup.", "filename": "2020_04_07_cnn-underscored_amazon-echo-sale_index_1588609620.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407115016-echo-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_cnn-underscored_amazon-echo-sale_index_1588609620.html", "title": "Amazon is dropping prices on nearly all Echo products", "title_page": "Amazon Echo sale: If you've been waiting to add an Amazon Echo to your home, now's the time to buy - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "If you've had your eye on any Amazon Echo, now's the time to buy. Amazon has dropped prices on nearly every Echo device. We're breaking down the discounts on this product lineup.\nEcho Show\nEcho Show, Echo Show 5 and Echo Show 8\nThe second-generation Echo Show is on sale for $179.99, the Echo Show 5 is available for $59.99, and the Echo Show 8 is on sale for $89.99. All members of the Echo Show family come with high-quality speakers, screens and video calling capability. Alexa is available through these products as well and can help you control the rest of your smart home. We've previously reviewed the Echo Show, Echo Show 5 and Echo Show 8 if you're looking for more info on each product.\nSecond generation Echo Show ($179.99, originally $229.99; amazon.com )\nEcho Show 5 ($59.99, originally $89.99; amazon.com )\nEcho Show 8 ($89.99, originally $129.99; amazon.com)\nEcho Flex and Echo Auto\nEcho Flex and Echo Auto\nSmaller Echo devices are also on sale. If you have an open outlet and have been looking to add Alexa to your home, the Echo Flex, on sale for $19.99, is a great option. This device helps control your other smart home devices, including lights. The speaker isn't the loudest in the Echo lineup, but it absolutely gets the job done. You can read our full review on the Echo Flex here. Even the Echo Auto is on sale for $29.99. If your car doesn't allow for Bluetooth music streaming, the Echo Auto is a worthwhile purchase. This device brings Alexa on the road with you while allowing you to blast your favorite tunes.\nEcho Flex ($19.99, originally $24.99; amazon.com )\nEcho Auto ($29.99, originally $49.99; amazon.com)\nEcho Dot\nEcho Dot and Echo Dot Kids Edition\nThe Echo Dot (third generation), on sale for $39.99, is a super compact, sleek speaker that will give you full control over your music streaming, voice control over your smart home products, and more. It's especially ideal for smaller spaces in your home. The Echo Dot Kids Edition, on sale for $59.99, is designed with kids in mind. Parents are able to set daily time limits for use on this device, as well as filters for expletives during music streaming. Kids will enjoy the endless kid-geared activities Alexa has to offer, especially while they're quarantined at home.\nThird generation Echo Dot ($39.99, originally $49.99; amazon.com )\nEcho Dot Kids Edition ($59.99, originally $69.99; amazon.com)\nEcho and Echo Plus\nEcho and Echo Plus\nThe classic, third-generation Echo is on sale for $79.99. This device has an updated speaker system to fill the room it lives in with sound, and while it doesn't have a screen like the Echo Show, you're still getting full voice control and calling. Check out our full review of the Echo here. Meanwhile, the second-generation Echo Plus, on sale for $119.99, offers the same great sound system as the Echo, but includes a built-in Zigbee hub to control compatible smart home devices. Both are great additions to your smart home lineup if you've been looking to add Alexa to other rooms, since they can serve as intercoms.\nThird generation Echo ($79.99, originally $99.99; amazon.com )\nSecond generation Echo Plus ($119.99, originally $149.99; amazon.com)\nEcho bundles\nEcho bundles\nAmazon is even discounting Echo bundles, including the Ring Video Doorbell Pro with the Echo Show 8 bundle, priced at $289. This bundle has your home covered, allowing you to add an Echo Show 8 inside your home and a layer of protection on the outside with the Ring Video Doorbell Pro. You can view your Ring Video Doorbell footage through your Echo Show 8, and with Alexa you're able to simply say, \"Alexa, talk to the front door\" to communicate with whomever may be outside. You can save on a similar bundle with the Ring Video Doorbell Pro with an Echo Show 5, on sale for $259.\nRing Video Doorbell Pro with Echo Show 8 ($289, originally $378.99; amazon.com )\nRing Video Doorbell Pro with Echo Show 5 ($259. originally $338.99; amazon.com)\nIf you're looking to upgrade your media streaming setup, Amazon is offering a deal on a Fire TV Stick and Echo Dot bundle, which includes an Alexa Voice Remote, for $74.98. Enjoy hands-free control over your Fire Stick with the Echo Dot and Alexa remote. Many of the apps you can access through your Fire TV Stick are Alexa-compatible as well, so you'll spend less time digging between couch cushions for the remote and more time enjoying your favorite shows, movies and music.\nFire TV Stick and Echo Dot with Alexa Voice Remote ($74.98, originally $89.98; amazon.com)\nFor more great deals, check out CNN Coupons.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/07/cnn-underscored/amazon-echo-sale/index.html"}