{"authors": ["Julie Carr Smyth"], "date_download": "2020-05-04 20:19:04", "date_modify": "2020-05-04 20:19:04", "date_publish": "2020-04-09 20:02:05", "description": "COLUMBUS, Ohio (AP) — A review released by Ohio State University on Thursday identified $336,000 in donations and pledges that the university received from Jeffrey Epstein and his foundation, a...", "filename": "_612eda8d94756572703dac028597b92a_1588623544.html", "image_url": "https://storage.googleapis.com/afs-prod/media/3e8748bc4c7b4a2a8e839aed105d0a84/1536.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_612eda8d94756572703dac028597b92a_1588623544.html", "title": "Epstein tied to $336K donated to Wexner Center at Ohio State", "title_page": "Epstein tied to $336K donated to Wexner Center at Ohio State", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - This Sept. 19, 2014 file photo shows retail mogul Leslie Wexner, at the Wexner Center for the Arts in Columbus, Ohio. A review released by Ohio State University on Thursday, April 9, 2020 identified $336,000 in donations and pledges that the university received from Jeffrey Epstein and his foundation, a sum the school said it was donating immediately to fight human trafficking. (AP Photo/Jay LaPrete, File)\nFILE - This Sept. 19, 2014 file photo shows retail mogul Leslie Wexner, at the Wexner Center for the Arts in Columbus, Ohio. A review released by Ohio State University on Thursday, April 9, 2020 identified $336,000 in donations and pledges that the university received from Jeffrey Epstein and his foundation, a sum the school said it was donating immediately to fight human trafficking. (AP Photo/Jay LaPrete, File)\nCOLUMBUS, Ohio (AP) — A review released by Ohio State University on Thursday identified $336,000 in donations and pledges that the university received from Jeffrey Epstein and his foundation, a sum the school said it was donating immediately to fight human trafficking.\nAll the donations went to the Wexner Center for the Arts, a campus museum bearing the family name of billionaire L Brands Leslie Wexner, who employed Epstein as his personal money manager in the late 1980s. An earlier review had found no evidence that Epstein influenced the fiscal operations of Wexner’s multi-million-dollar charitable foundation during their association.\nBoth reviews were ordered after Epstein’s arrest last year on federal sex trafficking charges. The wealthy financier was convicted as a sex offender and died in prison.\nEY, the national accounting firm formerly known as Ernst & Young, examined Ohio State fundraising documents dating back to before 1980, real estate transactions, and treasury and investment records. Its examiners were given access to historical documents maintained by the Wexner Center and the university’s Office of Advancement, as well as to university archives, the school said in a statement.\nThe review found the arts center received $260,000 from the J. Epstein Foundation from 1990 to 1997. One additional document put the value of his gifts at $335,000, but accountants could not confirm the additional $75,000 pledge was ever received.\nThe university said it opted to include the $75,000 in the total that it has donated to the Ohio Attorney General’s Human Trafficking Initiative. The total also included a $1,000 membership fund gift to the arts center that was originally identified and disclosed in July.\nThe university’s statement said it has identified discretionary funds it can use to make the donation and would not use restricted donor funds, tuition or tax dollars.\nAll the donations were made “at least two decades ago and many years before any questions about Epstein surfaced. However, the university has determined that, in light of Epstein’s reprehensible crimes, retaining these gifts would not be consistent with the university’s values,” the statement said.\nAnother gift potentially tied to Epstein that the university had disclosed in July turned out not to be.\nThe review found the 2007 gift of $2.5 million from the COUQ Foundation, Inc., for which Epstein was a director and officer, originated from the Wexner Children’s Trust and the Leslie H. Wexner Charitable Fund and not from Jeffrey Epstein. The gift supported a renovation of the university’s Woody Hayes Athletic Center.\nWexner, who stepped down as L Brands chairman and CEO after the sale of its flagship store Victoria’s Secret in February, has said Epstein misappropriated “vast sums of money” from the Wexner family.\nThe review found no evidence Ohio State had engaged in real estate, investments or purchasing transactions with Epstein or his known affiliated entities.\nWexner says he severed ties with Epstein 12 years ago. Both he and his wife, Abigail, have served as members of Ohio State’s board of trustees.", "url": "https://apnews.com/612eda8d94756572703dac028597b92a"}