{"authors": ["Review Brian Lowry"], "date_download": "2020-05-04 16:14:42", "date_modify": "2020-05-04 16:14:42", "date_publish": "2020-04-03 14:03:17", "description": "The best documentary series connect the subject to larger issues that go beyond one case. So it is with \"Atlanta's Missing and Murdered: The Lost Children,\" a look at the child murders of 40 years ago, and the doubts that linger to this day.", "filename": "2020_04_03_entertainment_at_76bcf3855b8ddbeb556aa786ee7bff57_index_1588608882.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330170227-atlantas-murdered-and-missing-the-lost-children-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_entertainment_at_76bcf3855b8ddbeb556aa786ee7bff57_index_1588608882.html", "title": "'Atlanta's Missing and Murdered: The Lost Children' review on HBO", "title_page": "'Atlanta's Missing and Murdered: The Lost Children' review on HBO - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) However juicy something like \"Tiger King\" might be, the best documentary series connect the subject to larger issues that go beyond one case. So it is with \"Atlanta's Missing and Murdered: The Lost Children,\" a look back at the child murders of 40 years ago, and the legacy and doubts that linger to this day.\nThe five-part HBO series begins last year, with Mayor Keisha Lance Bottoms and police chief Erika Shields announcing plans to review the evidence , hoping to provide a sense of finality the original investigation lacked after the arrest and conviction of Wayne Williams in 1982.\nThe documentary proceeds to document Atlanta's history as a beacon of the South, billed as \"the city too busy to hate,\" and seemingly on the verge of greater strides under then-mayor Maynard Jackson, before the slayings of 30 children and young adults rocked the community.\nThere are several memorable figures portrayed here, none more so than Camille Bell, the mother of a murdered child who spearheaded the pressure campaign against city officials who, many felt at the time, were most concerned about Atlanta's image and tourism.\nBell is shown in a series of interviews, lambasting the city for its sluggish response and charging that the Atlanta police \"couldn't catch a cold.\"\nRead More", "url": "https://www.cnn.com/2020/04/03/entertainment/atlantas-missing-and-murdered-review/index.html"}