{"authors": ["Russell Contreras"], "date_download": "2020-05-04 20:27:42", "date_modify": "2020-05-04 20:27:42", "date_publish": "2020-04-06 03:57:34", "description": "RIO RANCHO, N.M. (AP) — A Super PAC with ties to a northern New Mexico oil trucking company owner and a Massachusetts GOP operative is attacking a Republican candidate in a crucial U.S. House race...", "filename": "_946e27e46b1f91b71f7e007e4df10f9b_1588624062.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f9ef5dc2b9f84c4d81bc90f529701983/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_946e27e46b1f91b71f7e007e4df10f9b_1588624062.html", "title": "GOP House hopeful in New Mexico 'bashing' Trump", "title_page": "Super PAC: GOP House hopeful in New Mexico 'bashing' Trump", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Dec. 18, 2019, file photo, Republican U.S. House hopeful Yvette Herrell of New Mexico waits for a news conference in Albuquerque, N.M. A March 2016 email from Herrell asked fellow Republican state legislators if they were interested in supporting U.S. Sen. Ted Cruz for president and if they would like to sign an attached endorsement card. (AP Photo/Russell Contreras, File)\nFILE - In this Dec. 18, 2019, file photo, Republican U.S. House hopeful Yvette Herrell of New Mexico waits for a news conference in Albuquerque, N.M. A March 2016 email from Herrell asked fellow Republican state legislators if they were interested in supporting U.S. Sen. Ted Cruz for president and if they would like to sign an attached endorsement card. (AP Photo/Russell Contreras, File)\nRIO RANCHO, N.M. (AP) — A Super PAC with ties to a northern New Mexico oil trucking company owner and a Massachusetts GOP operative is attacking a Republican candidate in a crucial U.S. House race for what it called lying about her support for President Donald Trump.\nIn a television ad that began airing this weekend, a Super PAC calling itself Citizens for a United New Mexico said former state lawmaker Yvette Herrell sent emails in 2016 “to undermine Trump’s campaign for president.”\nThe ad also claims Herrell attended an “anti-Trump soiree” in San Diego, where attendees hung a Trump piñata from the ceiling, and was later heard in a podcast being critical of Trump.\n“You think you know Yvette Herrell?” the ad asks viewers. “She’s not who she says.”\nThe ad references a story from The Associated Press about a March 2016 email from Herrell seeking to support U.S. Sen. Ted Cruz of Texas’ run for president. It also refers to another AP story about Herrell saying on a podcast that the Republican-controlled Congress and the Trump administration’s “lack of leadership” during Trump’s first two years in office.\nThe ad was meant to undermine Herrell’s principal argument in a three-person Republican primary that she is the strongest supporter of Trump.\nHerrell, oil executive Claire Chase and Las Cruces businessman Chris Mathys are vying for the GOP nomination to challenge Democratic U.S. Rep. Xochitl Torres Small, who represents the traditionally Republican-leaning seat in southern New Mexico.\nAll of the Republican candidates have tried to position themselves as Trump’s most reliable ally and have accused each other of not backing Trump enough.\nHerrell blamed Chase allies for the new Super PAC’s attack ad.\n“The decision by Claire Chase’s Super PAC to run a false attack ad filled with lies against me is disgusting — especially at a time when President Trump and New Mexicans have called for unity while we focus on the massive health and economic crisis,” Herrell said in a statement. “These false attacks from Claire’s desperate Super PAC should be immediately pulled from the airwaves.”\nBut Chase’s campaign manager, Mike Berg, said their campaign had nothing to do with the ad.\n“Obviously, we can’t control what outside groups do,” Berg said. “It looks like some folks got sick and tired of Yvette’s sleazy attack ads against Claire and decided to expose her for what she is: a lying never-Trumper hiding in the closet.”\nFederal election records show that Butch Mathews, owner of the Farmington, New Mexico-based M & R Trucking company, recently filed documents for a super PAC called Citizens for a United New Mexico.\nRecords on the U.S. Federal Election Commission’s website list Mathews as treasurer of the Super PAC, which has a mailing address in Carlsbad, 460 miles (740.30 kilometers) away from Farmington.\nM & R Trucking has worked in the oil and gas industry for about three decades. The company is active in the natural gas region of the Four Corners and the oil-rich Permian Basin in southeastern New Mexico.\nMathews did not immediately return phone messages.\nFilings also list Charles Gantt of Beverly, Massachusetts, as “custodian of records” of the Super Pac. Gant runs a company called Bulldog Compliance, a division of Red Curve Solutions.\n___\nFollow Russell Contreras on Twitter at http://twitter.com/russcontreras", "url": "https://apnews.com/946e27e46b1f91b71f7e007e4df10f9b"}