{"authors": ["Harmeet Kaur"], "date_download": "2020-05-04 16:27:27", "date_modify": "2020-05-04 16:27:27", "date_publish": "2020-04-07 17:50:18", "description": "The mayor of Alton, Illinois, said he was embarrassed by the incident and that his wife had displayed a \"stunning lack of judgement.\"", "filename": "2020_04_07_us_illinois-mayor-wife-gathering-police-trnd_index_1588609647.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407110446-alton-illinois-mayor-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_us_illinois-mayor-wife-gathering-police-trnd_index_1588609647.html", "title": "A mayor ordered police to crack down on social gatherings. They found his wife at a bar", "title_page": "An Illinois mayor ordered police to crack down on social gatherings. They found his wife at a party - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A mayor in Illinois pleaded with residents last week to follow the state's stay at home order. After officers reported that people were continuing to defy the rules, the mayor said he had directed the city's police department to use its discretion in issuing citations and arrests.\n\"These are very serious times and I'm begging you to please stay at home,\" Brant Walker, mayor of Alton, Illinois, said in a briefing on Friday.\nLess than 48 hours later, police broke up a gathering at Hiram's Tavern in downtown Alton. Among those in attendance: Walker's wife.\nWalker announced in a statement on Monday that police had investigated and stopped a social gathering in violation of Illinois' statewide order around 1 a.m. on Sunday. He said police also informed him that his wife was there.\n\"I instructed the Police Chief to treat her as he would any citizen violating the 'Stay At Home' order and to ensure that she received no special treatment,\" Walker's statement read.\nRead More", "url": "https://www.cnn.com/2020/04/07/us/illinois-mayor-wife-gathering-police-trnd/index.html"}