{"authors": ["Steve Almasy", "Sarah Jorgensen"], "date_download": "2020-05-04 16:59:59", "date_modify": "2020-05-04 16:59:59", "date_publish": "2020-04-09 20:44:31", "description": "Federal prosecutors in the college admissions scandal tell a judge in court documents that their late disclosure of some notes to defense attorneys was due to an error, but that should not result in a dismissal of the charges against actress Lori Loughlin, her husband and 12 others.", "filename": "2020_04_09_us_lori-loughlin-college-admissions-scandal_index_1588611599.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190502152030-lori-loughlin-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_us_lori-loughlin-college-admissions-scandal_index_1588611599.html", "title": "Lori Loughlin case: Prosecutors argue judge shouldn't dismiss", "title_page": "Lori Loughlin case: Prosecutors argue judge shouldn't dismiss  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Federal prosecutors in the college admissions scandal tell a judge in court documents that their late disclosure of some notes to defense attorneys was due to an error, but that should not result in a dismissal of the charges against actress Lori Loughlin, her husband and 12 others.\nProsecutors in Massachusetts on Wednesday filed their response to a motion to dismiss the cases by the attorneys for 14 defendants, including Loughlin and Mossimo Giannulli. The prosecution argues the delay did not harm the defense because there are still six months before trial.\nThe actress and her husband have been charged with three counts of conspiracy: conspiracy to commit mail and wire fraud and honest services mail and wire fraud; conspiracy to commit federal programs bribery; and conspiracy to commit money laundering.\nIn March, Loughlin, Giannulli and other defendants filed a motion to dismiss the charges alleging prosecutorial misconduct, according to court documents. They have also filed to have the notes excluded from a trial.\nThe defense's memo claims notes on scandal mastermind Rick Singer's phone previously withheld by the government prove the government \"coerced Singer to lie when making his scripted, recorded calls to his clients long after their children had been admitted, and directed Singer not to mention on the calls that he had previously told the clients their payments would be 'donation(s)' that would go to the (university) program (and) not the coach.\"\nThe government writes in its motion that the delay was in part due to Singer's attorney receiving treatment for cancer, which pushed back his response to the request for the notes.\nAn attorney hired by the government did not review the notes until February, nor did Singer's attorney, in response to a request by the defense.\nIt was then that Singer's attorney and prosecutors determined that his notes were not privileged and could be turned over to the defense. They were given to the defense a few days later, prosecutors say in the motion.\n\"Through the above sequence of events, the notes were produced later than they should have been, but the defense has suffered no prejudice,\" prosecutors write in part.\nProsecutors argue that \"only a few lines\" of the notes are exculpatory to the defense and point out that the trial's start date is in October, which gives the defense time to incorporate the notes into their strategies.\nThe defense argued in March, as they have previously, that the government has mishandled evidence, specifically regarding recordings of Singer speaking with the defendants and other notes allegedly taken by Singer during interactions with investigators. They also allege Singer was pressured by prosecutors during his recorded calls with the defendants.\nIn response to the allegation that the government essentially entrapped defendants to admit they understood their payments were bribes, prosecutors argue that the evidence shows the defendants were engaging in the scheme for years before prosecutors were involved.\nLoughlin, best known as Aunt Becky from \"Full House,\" and Giannulli began working with Singer in 2015, long before Singer began coordinating with prosecutors, the government says in its filing. Prosecutors argue the recorded phone calls were a continuation of those ongoing dynamics.\n\"The defendants' criminal intent is plain from evidence of their actions, and their interactions with Singer, before he began cooperating -- and that evidence corroborates, and is corroborated by, evidence the government gathered afterwards,\" prosecutors write in part.\nProsecutors add that their case is about more than just bribery; it is about a larger scheme of wrongdoing.\n\"They were bribes, regardless of what Singer and the defendants called them, because, as the defendants knew, the corrupt insiders were soliciting the money in exchange for recruiting unqualified students, in violation of their duty of honest services to their employer.\"\nLoughlin and Giannulli allegedly paid $500,000 as part of a scheme with Rick Singer and a University of Southern California athletics official to get their two daughters into the university as members of the crew team, even though they did not participate in crew.\nAttorneys for the 14 defendants have argued money laundering charges should be dropped because, by definition, money laundering would have had to take place after the parents wrote checks to Singer's foundations. Whatever monies were transferred to test proctors and college administrators after that aren't the responsibility of the defendants, attorneys argue in another new filing.\nSinger pleaded guilty to four charges last year.", "url": "https://www.cnn.com/2020/04/09/us/lori-loughlin-college-admissions-scandal/index.html"}