{"authors": ["Jennifer Hansler"], "date_download": "2020-05-04 16:55:03", "date_modify": "2020-05-04 16:55:03", "date_publish": "2020-04-08 22:42:43", "description": "The Organization for the Prohibition of Chemical Weapons' Investigation and Identification Team (IIT) has concluded the Syrian government forces were responsible for a series of chemical attacks on a Syrian town in late March 2017.", "filename": "2020_04_08_politics_opcw-iit-syria-chemical-weapons-report_index_1588611303.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/170406214544-syria-bashar-al-assad-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_opcw-iit-syria-chemical-weapons-report_index_1588611303.html", "title": "Report finds Syrian government forces responsible for 2017 chemical attacks", "title_page": "OPCW report finds Syrian government forces responsible for 2017 chemical attacks - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Organization for the Prohibition of Chemical Weapons' Investigation and Identification Team (IIT) has concluded the Syrian government forces were responsible for a series of chemical attacks on a Syrian town in late March 2017.\nUS Secretary of State Mike Pompeo praised the OPCW report, saying the US agrees with its conclusions and charging that the regime of Bashar al-Assad is responsible for \"atrocities\" that rise to the \"level of war crimes.\"\nWednesday's 82-page report, the first from the IIT, found that one unit of the Syrian Arab Air Force was believed to be responsible for the March 24 and 30 sarin bombings in southern Ltamenah, which jointly affected at least 76 people. A Syrian Arab Air Force helicopter is believed to have \"dropped a cylinder on the Ltamenah hospital\" on March 25, 2017, releasing chlorine that affected at least 30 people, the report found.\n\"As the investigation progressed, and various hypotheses were considered, the IIT gradually came to these conclusions as the only ones that could reasonably be reached from the information obtained, taken as a whole,\" the report said.\nIIT Coordinator Santiago Oñate-Laborde noted that \"attacks of such a strategic nature would have only taken place on the basis of orders from the higher authorities of the Syrian Arab Republic military command. Even if authority can be delegated, responsibility cannot.\"\nRead More", "url": "https://www.cnn.com/2020/04/08/politics/opcw-iit-syria-chemical-weapons-report/index.html"}