{"authors": ["Veronica Stracqualursi"], "date_download": "2020-05-04 16:02:07", "date_modify": "2020-05-04 16:02:07", "date_publish": "2020-04-01 17:51:56", "description": "A federal appeals court in Florida has declined to review a decision it made in February blocking a state law requiring former felons to pay back all legal financial obligations before they vote.", "filename": "2020_04_01_politics_florida-amendment-4-review-denied_index_1588608127.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/170125081427-voting-booth-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_florida-amendment-4-review-denied_index_1588608127.html", "title": "Federal appeals court won't lift block on Florida law making it harder for ex-felons to vote", "title_page": "Federal appeals court won't lift block on Florida law making it harder for ex-felons to vote - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) A federal appeals court in Florida has declined to review a decision it made in February blocking a state law requiring former felons to pay back all legal financial obligations before they vote.\nThe court's decision Tuesday, a setback for Florida Gov. Ron DeSantis, is the latest development in a series of legal challenges concerning the Republican-led effort to first make ex-felons pay court-ordered fines and fees in order to exercise their right to vote, which was given to them in a 2018 amendment.\nIn February, a three-judge panel of the 11th US Circuit Court of Appeals upheld a preliminary injunction from a district court that allowed 17 former felons the ability to have their voting rights restored, even with unpaid fines, fees, and restitution.\nThe case, set to go to trial in district court in April, could apply to the estimated 1.4 million former felons in the Sunshine State who had their voting rights restored.\nOn Tuesday, the 11th Circuit denied DeSantis and Secretary of State Laurel Lee's request for an \"en banc\" review, meaning by the full bench, of its February decision. Tuesday's ruling said that no judge on the court requested a rehearing. The court also denied a rehearing by the three-judge panel.\nRead More", "url": "https://www.cnn.com/2020/04/01/politics/florida-amendment-4-review-denied/index.html"}