{"authors": ["General Assignment Reporter"], "date_download": "2020-05-04 20:20:17", "date_modify": "2020-05-04 20:20:17", "date_publish": "2020-04-28 15:56:16", "description": "Sophia Macy is moving on after her mother served 11 days in prison for the SAT payoff.", "filename": "entry_sophia-macy-carnegie-mellon_n_5ea83b93c5b6e55df8d85fd4_1588623617.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8405f3000004a101550c1.png?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_sophia-macy-carnegie-mellon_n_5ea83b93c5b6e55df8d85fd4_1588623617.html", "title": "Felicity Huffman's Daughter Accepted To Carnegie Mellon After Scandal", "title_page": "Felicity Huffman's Daughter Accepted To Carnegie Mellon After Scandal | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Felicity Huffman’s oldest daughter is getting a second chance at higher education.\nSophia Macy, who became embroiled in the college admissions scandal after her mother was found to have paid $15,000 to have Sophia’s SAT score boosted, has been accepted to Carnegie Mellon University in Pittsburgh.\nThe 19-year-old updated her Instagram bio to “CMU Drama ’24,” and People and Page Six confirmed Monday that she was bound for the prestigious school.\nMacy, whose father is “Shameless” actor William Macy, retook the SAT after her acceptance to a previous school was rescinded, the outlets noted.\nHuffman and Macy’s youngest daughter, Georgia, will also be attending college in the fall at Vassar, People reported.\nStefanie Keenan via Getty Images Sophia Macy, left, attended the 2019 Golden Globes with her family before the college admissions bribery scandal turned their lives upside down.\nHuffman, the former “Desperate Housewives” star and Oscar nominee, served 11 days in a low-security prison for her role in the scandal, which also snared “Full House” actor Lori Loughlin, who’s awaiting trial on more serious charges.\nHuffman said Sophia was not involved and had been betrayed by her.\n“When my daughter looked at me and asked with tears streaming down her face, ‘Why didn’t you believe in me? Why didn’t you think I could do it on my own?’ I had no adequate answer for her. I could only say, ‘I am sorry,’ ” Huffman wrote in a letter to the judge.\nEarlier this year, Sophia Macy landed a part on an episode of “The Twilight Zone” on CBS All Access.\nThe Hollywood Reporter ranked Carnegie Mellon third among college drama departments.", "url": "https://www.huffpost.com/entry/sophia-macy-carnegie-mellon_n_5ea83b93c5b6e55df8d85fd4"}