{"authors": ["Cheri Mossburg", "Steve Almasy"], "date_download": "2020-05-04 17:03:59", "date_modify": "2020-05-04 17:03:59", "date_publish": "2020-04-11 02:11:40", "description": "Prosecutors in Los Angeles have leveled another sexual assault charge against imprisoned former movie mogul Harvey Weinstein.", "filename": "2020_04_10_us_harvey-weinstein-los-angeles-charges_index_1588611839.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200311101508-01-harvey-weinstein-0224-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_harvey-weinstein-los-angeles-charges_index_1588611839.html", "title": "Harvey Weinstein faces another sexual assault charge in Los Angeles", "title_page": "Harvey Weinstein faces another sexual assault charge in Los Angeles - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Los Angeles (CNN) Prosecutors in Los Angeles have leveled another sexual assault charge against imprisoned former movie mogul Harvey Weinstein.\nThe charge of sexual battery by restraint stems from an alleged incident at a Beverly Hills hotel in May 2010, according to the Los Angeles County District Attorney's Office\nWeinstein, who is serving 23 years in prison in New York after being convicted of committing a criminal sex act in the first degree and rape in the third degree, was already facing four felony charges in Los Angeles, including forcible rape, sexual penetration by use of force, sexual battery and forcible oral copulation. Weinstein has denied the allegations . CNN reached out to his representatives Friday for comment on the new charge.\nThe victim was initially interviewed as a possible corroborating witness to the earlier charges, according to the district attorney's office. Last month, she provided information confirming that the assault took place within the 10-year statute of limitation, the district attorney's office said.\n\"As we gather corroborating evidence, we have reached out to other possible sexual assault victims. If we find new evidence of a previously unreported crime, as we did here, we will investigate and determine whether additional criminal charges should be filed,\" Los Angeles County District Attorney Jackie Lacey said in a statement.\nRead More", "url": "https://www.cnn.com/2020/04/10/us/harvey-weinstein-los-angeles-charges/index.html"}