{"authors": ["Review Brian Lowry"], "date_download": "2020-05-04 16:20:34", "date_modify": "2020-05-04 16:20:34", "date_publish": "2020-04-05 16:14:50", "description": "For all the movies and TV shows about World War II, \"World on Fire\" -- an unfortunate title, at this moment of shared suffering across the globe -- feels like a fresh take on the war's beginnings and its impact on ordinary people swept up in it. If not a light escape, it makes for a beautifully made, extremely soapy \"Masterpiece\" series.", "filename": "2020_04_05_entertainment_world-on-fire-review_index_1588609234.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401140712-world-on-fire-pbs-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_entertainment_world-on-fire-review_index_1588609234.html", "title": "'World on Fire' sets a 'Masterpiece' melodrama against the onset of World War II", "title_page": "'World on Fire' review: PBS sets a 'Masterpiece' melodrama against the onset of World War II - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) For all the movies and TV shows about World War II, \"World on Fire\" -- an unfortunate title, at this moment of shared suffering across the globe -- feels like a fresh take on the war's beginnings and its impact on ordinary people swept up in it. If not a light escape, it makes for a beautifully made, extremely soapy \"Masterpiece\" series.\nReleased in the U.K. last year -- coinciding with the 80th anniversary of war being declared -- this handsome seven-part first season overlaps with recent films that have captured those chaotic early days, most notably \"Darkest Hour\" and \"Dunkirk. \" But it does so by focusing on a sprawling if interconnected cast of fictionalized characters, leaping among scenes played out in Poland, England and across Europe.\nA bit slow in the opening hour, the story unfolds as the Nazis quickly overrun Poland. And it's worth noting a second season has been ordered , so there's not much finality when this arc reaches its end, including a major cliffhanger. Think \"Downton Abbey\" for a later generation.\nAt the core of it all is what amounts to a romantic triangle, with Harry Chase (Jonah Hauer-King), an upper-crust British translator, in love with a working-class girl, Lois (Julia Brown), despite the disapproval of his mother, the deliciously snooty Robina (\"Phantom Thread's\" Lesley Manville).\nLike many in her class, Robina is initially detached from the war, at one point stiffly saying that meeting a refugee will \"give me something to talk about at bridge club.\" She's as close to \"Downton's\" Dowager as this series has to offer.\nRead More", "url": "https://www.cnn.com/2020/04/05/entertainment/world-on-fire-review/index.html"}