{"authors": ["Reporter"], "date_download": "2020-05-04 20:22:02", "date_modify": "2020-05-04 20:22:02", "date_publish": "2020-04-28 17:42:02", "description": "The 2016 Democratic nominee's support comes after Sen. Bernie Sanders and former President Barack Obama backed this year's presumptive nominee.", "filename": "entry_hillary-clinton-endorse-joe-biden-2020_n_5e5d8fcec5b63aaf8f5bcddc_1588623722.html", "image_url": "https://img.huffingtonpost.com/asset/5e5d949623000043120bf7d3.jpeg?cache=0vtouabhkn&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_hillary-clinton-endorse-joe-biden-2020_n_5e5d8fcec5b63aaf8f5bcddc_1588623722.html", "title": "Hillary Clinton Endorses Joe Biden For President In 2020 Race", "title_page": "Hillary Clinton Endorses Joe Biden For President In 2020 Race | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "“Vice President Biden has dedicated his public life to changing the culture and the laws around violence against women,” Kate Bedingfield, Biden’s campaign spokesperson, said in her statement. “He authored and fought for the passage and reauthorization of the landmark Violence Against Women Act. He firmly believes that women have a right to be heard ― and heard respectfully.”\nBiden, who has not yet addressed the most recent allegations publicly, emphasized his record introducing the Violence Against Women Act in Congress during the virtual town hall with Clinton, and called for more support for women currently forced to adhere to stay at home orders with their abusers.\n“Women are experiencing much of the pandemic’s devastating impacts more than anyone else,” Biden said. “Millions of women have lost their jobs or are having their hours slashed or are facing worries of just making ends meet ... Domestic violence survivors are at a heightened risk forced to shelter in place with their abusers. Women’s access to reproductive health care is increasingly in jeopardy.”\nThe Democratic Party’s consolidation behind Biden has been among the Biden campaign’s biggest messages going into the general election: that Biden can unify the party to beat President Donald Trump. Women voters play a big role in that; a recent CNN poll showed Trump losing to Biden among women by 30 points. Biden has already made a nod to that reality pledging to nominate a woman as his running mate.\nSo far Biden’s endorsers have kept quiet about the allegations made against him. Sen. Kirsten Gillibrand (D-N.Y.), a staunch advocate of the “Me Too” movement to take women’s accounts of sexual assault seriously, defended Biden Tuesday.\n“I stand by Vice President Biden,” she told reporters. “He’s devoted his life to supporting women and he has vehemently denied this allegation.”\nBeating Trump has become the primary focus. Sanders (I-Vt.) endorsed Biden a week after dropping out of the presidential race on April 8, acknowledged there were significant policy differences between his democratic socialism and Biden’s moderate views, but emphasized the need to put a Democrat in the White House over those differences.", "url": "https://www.huffpost.com/entry/hillary-clinton-endorse-joe-biden-2020_n_5e5d8fcec5b63aaf8f5bcddc"}