{"authors": ["Rick Callahan"], "date_download": "2020-05-04 20:06:31", "date_modify": "2020-05-04 20:06:31", "date_publish": "2020-04-09 19:35:34", "description": "INDIANAPOLIS (AP) — A new law tightening Indiana’s restrictions on panhandling violates the First Amendment by all but banning solicitation in cities, the American Civil Liberties Union of Indiana...", "filename": "_cba0691b67cf4b4edf1a532a50a62920_1588622791.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cba0691b67cf4b4edf1a532a50a62920_1588622791.html", "title": "ACLU of Indiana: New panhandling law violates free speech", "title_page": "ACLU of Indiana: New panhandling law violates free speech", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "INDIANAPOLIS (AP) — A new law tightening Indiana’s restrictions on panhandling violates the First Amendment by all but banning solicitation in cities, the American Civil Liberties Union of Indiana contends in a federal lawsuit filed Thursday that seeks to block the law.\nThe law, set to take effect July 1, would prohibit most forms of financial solicitation by individuals and groups in the downtown areas of Indiana’s cities by expanding the areas where panhandling is barred, the suit alleges.\nCurrent Indiana law includes a provision barring people from asking for money within 20 feet (6.1 meters) of an ATM or the entrance to a bank. But the new law’s provisions include barring solicitation within 50 feet (15.2 meters) of ATMs, business and restaurant entrances or sites of a financial transaction, including parking meters.\nThe new restrictions will leave “virtually no sidewalks in downtown Indianapolis or any downtown area in any Indiana city where people can engage in this activity which courts have recognized is protected by the First Amendment,” Ken Falk, the ACLU of Indiana’s legal director, said in a news release.\n“This panhandling ban is an unconstitutional attack on free speech,” he added.\nThe lawsuit was filed in U.S. District Court in Indianapolis and seeks a temporary injunction to block the law from taking effect, arguing that it “targets particular First Amendment expression in a flagrantly broad, vague, and unconstitutional manner.”\nThe law was among the measures Republicans who dominate the Indiana Statehouse pushed in the closing days of the legislative session in March.\nRepublican Gov. Eric Holcomb signed it into law on March 21 despite warnings from the ACLU that it was unconstitutional and would criminalize poverty.\nThe lawsuit states the new law is so restrictive that it would prohibit ACLU of Indiana staffers from soliciting contributions for memberships with the nonprofit advocacy group in downtown Indianapolis’ Monument Circle each Sept. 17, on Constitution Day.\nThe suit names as defendants the Indiana State Police superintendent, the mayor of Indianapolis and Marion County’s prosecutor.\nThe Indiana Attorney General’s office, which handles litigation challenging Indiana statutes, said in a statement that it was “reviewing the lawsuit and will respond as appropriate.”\nDonald Morgan, the city of Indianapolis’ chief litigation counsel, said the city doesn’t discuss pending litigation.\nThe Marion County prosecutor’s office declined to comment “at this time,” said spokesman Michael Leffler.", "url": "https://apnews.com/cba0691b67cf4b4edf1a532a50a62920"}