{"authors": [], "date_download": "2020-05-04 16:59:15", "date_modify": "2020-05-04 16:59:15", "date_publish": "2020-04-08 22:06:55", "description": "Whether you're short on space or just looking for a way to move your body to work off stress, yoga can be the perfect home-based workout. And a workout app can be the answer you need to get yourself in the flow. With its near-perfect rating on the App Store, YogaDownload was one that caught our eye, and so we decided to put it to the test.", "filename": "2020_04_08_cnn-underscored_yogadownload-unlimited-review_index_1588611555.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407215459-1-underscored-yogadownload-review-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_cnn-underscored_yogadownload-unlimited-review_index_1588611555.html", "title": "YogaDownload has unlimited classes at an unbeatable price", "title_page": "YogaDownload Review: Keep going with the yoga flow at home with these online classes - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Whether you're short on space or just looking for a way to move your body to work off stress, yoga can be the perfect home-based workout. And a workout app can be the answer you need to get yourself in the flow. With its near-perfect rating on the App Store, YogaDownload was one that caught our eye, and so we decided to put it to the test.\nYogaDownload brings yoga to your devices by providing pre-filmed yoga and workout classes you can stream and download. Both a website and a mobile app, YogaDownload is great if you're looking to keep up with your yoga practice at home. Whether you're a beginner or a yoga studio regular, you're bound to find classes you enjoy.\nBetter yet, a one-year unlimited membership to YogaDownload is now available for $29.\nThe setup\nYour membership to YogaDownload gives you access to classes both on the web and on an app for iOS and Android. Both are extremely easy to navigate. The tabs along the top will take you directly where you want to go and help you find the exact class you're looking for. You can browse for classes by viewing them all or by choosing a particular yoga style, focus, or instructor. If you choose to browse all classes at once, you can apply additional, more precise filters to narrow down your search, like class length, level and intensity. It makes it easy to find the courses you're most interested in.\nAs you preview classes, you're able to see a brief class description, the intensity and skill levels, the instructor, any props the class might require, and a rating by other users. Most classes didn't require any props, which is helpful if you're just starting out. We really enjoyed that YogaDownload showed you other users' reviews, which provided great insight into specific classes and gave us more information about the instructors.\nBetter yet, the unlimited membership gives you access to all classes and programs on YogaDownload. So while you will see prices on the classes, don't worry about them if you've signed up.\nBefore committing to a class, you can preview it in a short video. The video previews gave a great sense of the instructor's teaching style and the pace of the class, which is helpful if you've got time to preview multiple classes before deciding which you'd like to try.\nOnce you've chosen a class, you can purchase it for download.The download process was extremely simple. We viewed most classes that we took through the website, but also downloaded classes so we'd be able to practice outside. With spring weather around the corner, practicing yoga outside is a calming experience, and being able to bring your class to the backyard on your device is lovely.\nThe classes\nYogaDownload has loads of classes available for all skill levels. There's a section on the site dedicated to beginner-level classes, where you'll find information about yoga, programs to get you started, and a prefiltered list of classes to choose from. It provides a lot of insight into the benefits of yoga and helped us find classes that were suitable for our level.\nWe love the way YogaDownload defines its class intensities. Rather than a simple easy-to-difficult scale, the site uses \"Ahhhhhh\" for the lowest intensity, \"Everyday Namaste\" for a little more intensity, \"You'll Feel It\" for medium intensity, and \"Bring a Towel\" for the high-intensity classes.\nThis site offers programs designed for certain interests and levels, which is very helpful if you have specific goals in mind. Programs include \"Yoga for Busy People: a Two Week Challenge,\" \"Yoga for Detox, Cleansing and Vitality,\" and even a 21-day full-body fitness bootcamp. As you preview each program, YogaDownload outlines what kind of people the course is designed for and what downloadable classes you'll receive, with a breakdown of each class.\nWe tried the Deep Sweaty Detox class with Pradeep Teotia. This class has a 5-star rating on the site and based on user reviews, Teotia is a popular instructor. The class level is designated as for advanced beginners and up, and this seemed accurate. Class was 35 minutes, with the last five minutes of class being a Savasana practice (meaning we relaxed muscle groups one at a time to relieve tension and stress). This class did not require props.\nThe class intensity level, \"You'll Feel It,\" was a great description. It was definitely a workout, and Teotia explained how positions we were moving through were helping us detox. Even with the distractions of being in an at-home environment, we were still able to focus on the class.\nThe experience\nYogaDownload has done everything it can to create a calming atmosphere for online yoga classes. Classes are prerecorded in a yoga studio with the instructor, and most classes include students, everyday yogis who help provide a visual for you as you practice.\nClasses also incorporate relaxing music that ebbs and flows in volume. Sometimes the music would be a bit distracting, as the volume was not consistent throughout, but that was our only complaint. During the Savasana portion of class, the screen switched from the instructor and students in the studio to an image of a flower against a blue background, and the music grew in volume as well, which helped make Savasana more relaxing.\nWe took classes both with wireless headphones and without, to see how that affected our experience. If you're practicing at home and you know there will be distractions, we'd definitely recommend headphones so you can fully immerse yourself in the experience. If you're in a quiet setting, taking class without headphones is just as calming and still allows you to really set up your yoga environment.\nWe found ourselves enjoying classes on a computer screen, as this provided a larger picture. If you're taking YogaDownload's classes with others, we'd say a laptop or desktop monitor is a good way to view them, especially if you're a beginner. If you're a more experienced yogi who understands classes and knows poses and movements well, you shouldn't have a problem following classes on a smaller screen. When we practiced with others at home, we connected our computer to a television screen, giving a nice large display that everyone could see. If you have a smart TV or Roku, you can download the app directly and use it through your television as well.\nOur final thoughts\nWith online workouts growing more popular by the minute, YogaDownload is a terrific option. For $29, you'll receive unlimited download and access to more than 1,600 classes and programs. The site definitely creates a calming class experience for users, the next best thing to a real-life yoga studio. Better yet, if you find an instructor you're particularly drawn to, you're able to filter for classes taught by that person. If you're new to yoga and looking for more information, there's lots to be found on the site. If you're just starting out, or missing your home studio,\nYogaDownload will help you create a studio in your own home and $29 for an unlimited one-year membership delivers a big value.\nNote: The price above reflects the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/08/cnn-underscored/yogadownload-unlimited-review/index.html"}