{"authors": ["Analysis Harry Enten"], "date_download": "2020-05-04 15:57:16", "date_modify": "2020-05-04 15:57:16", "date_publish": "2020-04-12 11:50:23", "description": "Indeed, while the 2020 campaign is likely to be one of the strangest campaigns in American history, the popularity of the two men who will almost certainly be their party's nominees is one way in which the 2020 contest looks to be fairly normal.", "filename": "2020_04_12_politics_2020-el_9343282af2787d72ed1f440fc0306006_index_1588607836.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191205055729-joe-biden-donald-trump-split-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_12_politics_2020-el_9343282af2787d72ed1f440fc0306006_index_1588607836.html", "title": "The one normal thing about the 2020 campaign", "title_page": "2020 election: The one normal thing about the campaign - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Poll of the week: A new Monmouth University poll finds that former Vice President Joe Biden has a net favorability rating (favorable - unfavorable) of -1 point with voters. President Donald Trump has a net favorability of -8 points.\nBoth of these are fairly similar to Monmouth's last poll and fairly close to the polling averages.\nThe 2016 campaign was known for having the two least liked major party candidates of all time. That seems unlikely to repeat itself. Indeed, while the 2020 campaign is likely to be one of the strangest campaigns in recent American history, the popularity of the two men who will almost certainly be their party's nominees is one way in which the 2020 contest looks to be fairly normal.\nWhile neither Biden and Trump are popular, it's not unheard of for both major party nominees to be at or underwater at this point . In both 1992 and 2012, the incumbent president and challenger had net negative favorability ratings in the first half of the year before the general election.\nBoth Hillary Clinton and Trump were so far underwater at this point, it's almost hard to believe. Clinton had a -23 point net favorability rating in a CBS News poll taken this week four years ago. Trump had an astounding -38 net favorability. Trump's was the worst on record, and Clinton's was basically tied with Jimmy Carter in 1980 for the second worst on record. Carter, of course, would get blown out in that election.\nThe fact that both Clinton and Trump were so disliked made for voter behavior more unpredictable than normal. In most years, you might think that Clinton had a big leg up because more voters liked her than Trump. (Something that held through to the election.) With hindsight, it's clear what really mattered was that both were so detested . The key group was the bloc of voters who liked neither, and they went for Trump overwhelmingly.\nBut it's more than just that Clinton and Trump weren't liked. They, especially Trump, were despised by large segments of voters . Nearly 40% said they had a very unfavorable view of Clinton in April 2016. Over 50% said the same about Trump.\nThis year, the very unfavorable ratings have shrunk for the major party nominees respectively. Biden's very unfavorable rating was 25% in the Monmouth poll, a double-digit improvement from Clinton. Trump's very unfavorable rating was 43%. That's still rather high, though that too is a double-digit improvement from where he was in April 2016. (A Fox News poll out this week showed pretty much the same thing for both candidates.)\nVoters, on the whole, just feel a lot less strongly about Biden either way (favorably or unfavorably). That could mean his ratings are more likely to change in either direction down the stretch of the campaign. Trump's seem more locked in.\nThis goes back to something I've been speaking about for months. Trump's best hope in winning this election is making Biden less popular and turning this into a choice between two disliked candidates. Otherwise, you'll have a disliked incumbent and a challenger who voters are lukewarm about. The last time that happened was in 1992, when challenger Bill Clinton defeated President George H.W. Bush.", "url": "https://www.cnn.com/2020/04/12/politics/2020-election-normalcy-biden-trump-poll-of-the-week/index.html"}