{"authors": ["Alicia Lee"], "date_download": "2020-05-04 16:03:41", "date_modify": "2020-05-04 16:03:41", "date_publish": "2020-04-01 19:20:06", "description": "NASA received an out-of-this-world number of applicants in this last month for its new class of astronauts.", "filename": "2020_04_01_us_nasa-artemis-astronaut-apply-scn-trnd_index_1588608221.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401123545-nasa-artemis-astronauts-apply-trnd-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_us_nasa-artemis-astronaut-apply-scn-trnd_index_1588608221.html", "title": "More than 12,000 people want to be part of NASA's next class of astronauts", "title_page": "More than 12,000 people want to be part of NASA's next class of astronauts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) NASA received an out-of-this-world number of applicants in this last month for its new class of astronauts.\nMore than 12,000 people from every corner of the US, including its four territories, have applied to be NASA's next class of astronauts. That's the second-highest number of applicants NASA has ever received, according to a news release\nThe record amount of 18,300 applicants was set by the most recent class of astronauts who graduated in January\nBut since then, the application process has changed. NASA shortened its application period from two months to one, and it has increased its education requirement from a bachelor's degree to a master's degree in science, technology, math, or engineering field.\n\"We're able to build such a strong astronaut corps at NASA because we have such a strong pool of applicants to choose from,\" Anne Roemer, manager of the Astronaut Selection Board, said in a statement. \"It's always amazing to see the diversity of education, experience and skills that are represented in our applicants.\"\nRead More", "url": "https://www.cnn.com/2020/04/01/us/nasa-artemis-astronaut-apply-scn-trnd/index.html"}