{"authors": ["Por Brian Melley"], "date_download": "2020-05-04 20:24:39", "date_modify": "2020-05-04 20:24:39", "date_publish": "2020-04-21 01:24:26", "description": "LOS ÁNGELES (AP) — Familiares de cuatro de las personas que murieron en un accidente de helicóptero junto a Kobe Bryant y su hija se unieron a la viuda del exastro de la NBA en una demanda por...", "filename": "_b62646b10cd84c85aee6b5db2a7e242a_1588623879.html", "image_url": "https://storage.googleapis.com/afs-prod/media/37f761f9283341c29fb9e4df3ad2002c/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b62646b10cd84c85aee6b5db2a7e242a_1588623879.html", "title": "Familias demandan a compañías involucradas en choque de Kobe", "title_page": "Familias demandan a compañías involucradas en choque de Kobe", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nLOS ÁNGELES (AP) — Familiares de cuatro de las personas que murieron en un accidente de helicóptero junto a Kobe Bryant y su hija se unieron a la viuda del exastro de la NBA en una demanda por muerte imprudencial en contra de las compañías que poseían y operaban la aeronave.\nLas denuncias a nombre de tres miembros de una familia, y una mujer que ayudaba a entrenar a la hija de 13 años de Bryant, fueron presentadas vía electrónica en la Corte Superior de Los Ángeles el domingo.\nEl par de demandas se presentaron unos dos meses después de que la viuda de Bryant y madre de Gianna, Vanessa, también demandó a Island Express Helicopters Inc., que operaba el Sikorsky, y a su propietaria Island Express Holding Corp.\nLa persona que respondió el teléfono en Island Express Helicopters se negó a comentar y un email de The Associated Press en busca de comentarios no fue respondido de inmediato.\nA diferencia de la prolongada demanda de Vanessa Bryant, las dos nuevas e idénticas denuncias de 7 páginas no hacen mención del piloto fallecido, Ara Zobayan, ni de su representante, como acusados. Todas las demandas aseguran que las dos compañías fueron negligentes.\nUna de las denuncias fue interpuesta por los hijos del coach de béisbol de la Universidad Orange Coast College, John Altobelli, su esposa Keri y su hija Alyssa, quien jugaba básquetbol con Gianna. La otra demanda fue presentada por el esposo y los tres hijos de Christina Mauser, quien ayudaba a Bryant a entrenar al equipo de niñas baloncesto.\nEl grupo se dirigía a un torneo de básquetbol el 26 de enero cuando el helicóptero chocó en medio de la densa neblina al noroeste de Los Ángeles.", "url": "https://apnews.com/b62646b10cd84c85aee6b5db2a7e242a"}