{"authors": ["Trends Reporter"], "date_download": "2020-05-04 20:27:33", "date_modify": "2020-05-04 20:27:33", "date_publish": "2020-04-28 23:58:07", "description": "The supermodel and singer are expecting a baby, according to multiple reports.", "filename": "entry_gigi-hadid-zayn-malik-pregnant_n_5ea8ab9fc5b6106b8eceda32_1588624053.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8ac3a300000b61115515c.jpeg?cache=kdno8mpegn&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_gigi-hadid-zayn-malik-pregnant_n_5ea8ab9fc5b6106b8eceda32_1588624053.html", "title": "Gigi Hadid And Zayn Malik Reportedly Expecting First Child", "title_page": "Gigi Hadid And Zayn Malik Reportedly Expecting First Child | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Gigi Hadid is expecting her first child with boyfriend Zayn Malik, according to multiple reports.\nThe supermodel and British musician are yet to announce the pregnancy publicly, but several sources reportedly confirmed the news to Entertainment Tonight, US Weekly and TMZ.\nHadid and Malik’s representatives did not immediately return HuffPost’s request for confirmation.\nLast week, the couple celebrated Hadid’s 25th birthday with her sister Bella Hadid and a handful of others. Hadid thanked her “quarantine family” ― including Malik ― for making the day so special.\n“I am grateful and lucky that my family and friends ― near and far ― are healthy and safe, and although I missed loved ones I wish I could have celebrated with, know that these times will make us even more grateful for togetherness to be had in the future!” she wrote, sharing images from her family’s farm in Pennsylvania, where they are isolating.\nHadid and Malik first started dating in November 2015. After an on-again, off-again relationship in the following years, they reportedly got back together late last year. Hadid erased any doubt about those rumors with a sweet post about the singer, 27, on Valentine’s Day.\nFans went wild over the pregnancy reports, with “gigi” and “zigi” quickly soaring to the top of Twitter’s trending charts on Tuesday.", "url": "https://www.huffpost.com/entry/gigi-hadid-zayn-malik-pregnant_n_5ea8ab9fc5b6106b8eceda32"}