{"authors": ["Amir Vera"], "date_download": "2020-05-04 16:26:14", "date_modify": "2020-05-04 16:26:14", "date_publish": "2020-04-07 01:27:03", "description": "Legendary right fielder Al Kaline died Monday at the age of 85, according to the Detroit Tigers. He played his entire career, 22 seasons, with the Tigers where he was an All-Star 18 times, won a World Series in 1968 and earned the nickname \"Mr. Tiger.\"", "filename": "2020_04_06_us_mlb-al-kaline-obit-spt_index_1588609574.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406203012-01-al-kaline-obit-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_us_mlb-al-kaline-obit-spt_index_1588609574.html", "title": "Al Kaline, MLB Hall of Famer, dies at 85", "title_page": "Al Kaline, MLB Hall of Famer, dies at 85 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Legendary right fielder Al Kaline died Monday at the age of 85, according to the Detroit Tigers .\nKaline played his entire career, 22 seasons, with the Tigers where he was an All-Star 18 times, won a World Series in 1968 and earned the nickname \"Mr. Tiger.\"\n\"Baseball lost a titan today. Anyone who knew Al Kaline would describe his gentle soul and passion for baseball as an unbelievably powerful combination, making him one of the most respected players in Major League Baseball history,\" said Tigers chairman Christopher Ilitch. \"His positive contributions to the sport will forever be realized by baseball fans everywhere. The impact of his life is wide-reaching, and he will be greatly missed by millions in Detroit, the state of Michigan and across the baseball community.\"\nKaline joined the Tigers straight out of high school\nKaline was born December 19, 1934, in Baltimore, Maryland, and signed with the Tigers straight out of high school in 1953, according to the National Baseball Hall of Fame . He made his debut on June 25, 1953.\nHe retired in 1974 and became a special assistant to the Tigers' general manager. Kaline was inducted into the Hall of Fame in 1980, his first year of eligibility. The city of Detroit retired his jersey, No. 6, which was the first number retired by the organization, according to the Hall of Fame's website.\nAl Kaline of the Detroit Tigers swings at the pitch during an MLB game against the Baltimore Orioles on June 28, 1959.\n\"As one of baseball's greatest right fielders, every new generation of Hall of Fame Members were in awe of Al, not only as the player he was, but also as the true gentleman that he was. He will be missed throughout the game -- and honored forever at the Hall of Fame,\" said Jane Forbes Clark, chairman of the Board of the National Baseball Hall of Fame and Museum.\nMLB Commissioner Robert Manfred said in a statement that Kaline was one of those \"who made the shortlist of players who mean the most to us.\"\n\"A lifelong Tiger, Al was a true gentleman and one of the National Pastime's most universally respected figures,\" Manfred said. \"I appreciated his friendship, humility and the example that he always set for others since he debuted as an 18-year-old rookie.\"\nMichigan reacts to Kaline's death\nNumerous baseball players, politicians and other athletes took to social media Monday to pay their respects to Kaline.\n\"You were a living legend to the game of baseball, but also much more than that. You're one of the wisest and kindest men I've met, and you always took a genuine interest in others. Your presence will not be forgotten,\" tweeted Tigers pitcher Spencer Turnbull.\nAl Kaline you'll be missed by so many. You were a living legend to the game of baseball, but also much more than that. You're one of the wisest and kindest men I've met, and you always took a genuine interest in others. Your presence will not be forgotten. RIP Mr. Tiger @tigers — Spencer Turnbull (@spencerturnbull) April 6, 2020\n\"Such a kind and generous man who meant so much to so many. I hope you knew how much I enjoyed our conversations about baseball, life, or just giving each other a hard time. I am honored to have been able to call you my friend for all these years. R.I.P. Mr Tiger, Al Kaline,\" tweeted Houston Astros pitcher Justin Verlander.\nSuch a kind and generous man who meant so much to so many. I hope you knew how much I enjoyed our conversations about baseball, life, or just giving each other a hard time. I am honored to have been able to call you my friend for all these years. R.I.P. Mr Tiger, Al Kaline. — Justin Verlander (@JustinVerlander) April 6, 2020\nMichigan Gov. Gretchen Whitmer said Kaline was a legend on and off the ball field.\n\"Through his 22 seasons with the team, he brought joy to generations of Tigers fans across our state as he worked his way into the 3,000 club. Farewell, Mr. Tiger,\" Whitmer tweeted.\nSo sad to hear about the passing of Al Kaline. He was a legend on and off the field. Through his 22 seasons with the team, he brought joy to generations of Tigers fans across our state as he worked his way into the 3,000 club. Farewell, Mr. Tiger. https://t.co/OVj83SgyMA — Governor Gretchen Whitmer (@GovWhitmer) April 6, 2020\nLegendary Detroit Lions running back Barry Sanders tweeted \"it is always devastating to lose someone who means so much to the city.\"\nI am sorry to hear of the passing of Detroit sports legend, Al Kaline. It is always devastating to lose someone who means so much to the city. Rest easy, Mr. Tiger. — Barry Sanders (@BarrySanders) April 6, 2020\n\"I told him he & Willie Mays were my 2 favorite players of all time & he sent me a photo of him & Willie which I treasure! He was a great man & he wore it well!\"", "url": "https://www.cnn.com/2020/04/06/us/mlb-al-kaline-obit-spt/index.html"}