{"authors": ["Scott Sonner"], "date_download": "2020-05-04 20:28:53", "date_modify": "2020-05-04 20:28:53", "date_publish": "2020-04-06 17:49:44", "description": "RENO, Nev. (AP) — A late winter storm that dumped more than a foot (30 centimeters) of snow at Lake Tahoe and nearly 3 feet (1 meter) on top of the southern Sierra early Monday was moving south,...", "filename": "_b7cea8329743d378fa5d111fde34dd4c_1588624133.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ab0f18e231cb4cb2a1695acbcf91473a/2439.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b7cea8329743d378fa5d111fde34dd4c_1588624133.html", "title": "Storm that dumped heavy snow in Sierra bound for Las Vegas", "title_page": "Storm that dumped heavy snow in Sierra bound for Las Vegas", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A car on the northbound Harbor Freeway (I-110) in downtown Los Angeles plows through deep water during a torrential downpour on Monday, April 6, 2020. Snow and rain fell Monday on California as spring delivered the kind of stormy weather that was missing most of the winter. Numerous spinouts were reported on Los Angeles-area freeways, and there were scattered reports of roadway flooding and canyon road rockfalls. (AP Photo/John Antczak)\nA car on the northbound Harbor Freeway (I-110) in downtown Los Angeles plows through deep water during a torrential downpour on Monday, April 6, 2020. Snow and rain fell Monday on California as spring delivered the kind of stormy weather that was missing most of the winter. Numerous spinouts were reported on Los Angeles-area freeways, and there were scattered reports of roadway flooding and canyon road rockfalls. (AP Photo/John Antczak)\nRENO, Nev. (AP) — A late winter storm that dumped more than a foot (30 centimeters) of snow at Lake Tahoe and nearly 3 feet (1 meter) on top of the southern Sierra early Monday was moving south, where a winter storm warning has been issued outside Las Vegas.\nRainy weather is in the forecast for the Las Vegas Strip through Wednesday with heavy snow predicted north and west of the city, the National Weather service said.\nThe winter storm warning — in effect until 5 p.m. Wednesday for elevations above 6,500 feet (1,980 meters) — includes Red Rock Canyon, the Sheep Range and Spring Mountains, where up to a foot (60 cm) of snow is possible and as much as 2 feet (120 cm) on ridge tops.\nAn avalanche warning expired Monday along the Northern California-Nevada line and chain restrictions were lifted on Interstate 80 and U.S. Highway 50 near Lake Tahoe, where the storm dumped 13 inches (33 cm) of snow at Incline Village. Mammoth Mountain resort south of Yosemite National Park recorded 35 inches (88 cm) of snow.\nThe Nevada Highway Patrol reported two dozen accidents on slick roads during the Monday morning rush hour in the Reno-Sparks area where 3-5 inches (7-12 cm) of snow fell but melted away by afternoon.\nWet weather will persist across much of Nevada into Wednesday before a warming trend pushes high temperatures in Reno to near 70 degrees (21 C) by Friday, the service said.\nThe Sierra normally stores about one-third of California’s water supply as snowpack but is well below the April average as resurgent drought and abnormal dryness encompasses two-thirds of the state.", "url": "https://apnews.com/b7cea8329743d378fa5d111fde34dd4c"}