{"authors": ["Emma Epperly"], "date_download": "2020-05-04 20:03:43", "date_modify": "2020-05-04 20:03:43", "date_publish": "2020-04-07 00:00:00", "description": "When David Shafer threatened to commit suicide last October, two of his friends took one of his guns and called 911. But Shafer ran back to his house, got another gun and pointed it at...", "filename": "_776f67e348064fa889e0308103708838_1588622623.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_776f67e348064fa889e0308103708838_1588622623.html", "title": "Spokane police release footage of October officer-involved shooting that left suicidal man dead", "title_page": "Spokane police release footage of October officer-involved shooting that left suicidal man dead", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "When David Shafer threatened to commit suicide last October, two of his friends took one of his guns and called 911.\nBut Shafer ran back to his house, got another gun and pointed it at police when they arrived at the scene.\nShafer was then shot and killed, in what the Spokane County Prosecutor called in January a justified use of lethal force.\nThe Spokane Police Department released the 911 call and body camera footage from the incident on Tuesday.\nBill Putman and David Palmer knew their friend Shafer was suicidal. When he called 911, Putman told a dispatcher he is a pastor and Shafer was a deacon at their church.\nAccording to Putman, Shafer tried to commit suicide before while drinking and planned to seek psychological help.\nOn that October afternoon, Shafer was drinking and called his friends to tell them of his plans to kill himself.\nPutman and Palmer got in the car and started driving to Shafer’s house on East Garnet Avenue.\nWhen they arrived, Shafer was walking down the street with a gun in his hand, according to the 911 call. The men were able to wrestle the gun from Shafer and tried to hold him down in the car, which was captured on Putman’s 911 call.\nShafer eventually escaped and went back to his house to get another gun, Putman told the operator.\nOfficer Caleb Martin arrived on scene shortly after Putman was disconnected from the 911 call. At about the same time, Shafer called his friends and told them he had a pistol in his hand and was waiting for the police to arrive.\nThe gun was later determined to be unloaded.\nMartin was able to listen to the phone call and then saw movement in front of Shafer’s house.\nMartin and Officer Daniel Cole walked toward the house with their service rifles drawn. Martin yelled for Shafer to drop the gun, which was pointed at the officer.\nSeconds later, Martin fired two shots, one striking Shafer in the right side of his chest and the second hitting him in the upper back as he fell to the ground.\nMartin was 45 yards away from Shafer, who was standing in front of a pickup truck in his driveway.\nCole and Officer Charles Pavlischak immediately rendered aid to Shafer, with medical personnel arriving within minutes.\nShafer was declared dead on the scene. His blood alcohol content was 0.16, twice the legal limit. Shafer also had kratom, a plant known to have psychotropic effects, in his system.\nIn his statement about the shooting, Martin wrote, “Shafer positioned himself in a way that indicated that he was assaultive and would not cooperate. It was obvious that Shafer knew my exact position.”\nMartin returned to his patrol duties after completing standard procedures following a deadly use of force, including seeing a mental health professional. He has been on the police force since July 2016 and has received three letters of commendation, according to Sgt. Terry Preuninger.\nMartin was one of the officers who shot and killed Daniel Craven in 2017. His use of force in that incident was also found to be justified by the prosecutor.", "url": "https://apnews.com/776f67e348064fa889e0308103708838"}