{"authors": [], "date_download": "2020-05-04 20:04:07", "date_modify": "2020-05-04 20:04:07", "date_publish": "2020-04-07 19:44:53", "description": "VANCOUVER, Wash. (AP) — A man is believed to have fired at a Vancouver, Washington, police officer who was chasing him, prompting the officer to return fire, authorities said. The officer...", "filename": "_711fc665e82017be890452b6c9d5c439_1588622647.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_711fc665e82017be890452b6c9d5c439_1588622647.html", "title": "Police: Fleeing man shoots at officer prompting return fire", "title_page": "Police: Fleeing man shoots at officer prompting return fire", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "VANCOUVER, Wash. (AP) — A man is believed to have fired at a Vancouver, Washington, police officer who was chasing him, prompting the officer to return fire, authorities said.\nThe officer came upon an apparent shooting about 1 a.m. Tuesday, in which a driver appeared to have shot at another driver from inside his car, the Oregonian/OregonLive reported .\nThe officer followed the first driver, a man, and at some point when the officer fired when the officer thought the man fired, Vancouver police said.\nThe man eventually got onto Interstate 5, crossing into Oregon and traveling south in the northbound lanes.\nThe officer stopped to be treated for minor injuries from flying glass, police said. The woman also pulled over and told police she and the man are in a relationship, police said.\nThe man’s car was later seen on northbound I-5 and was found unoccupied near the interstate and the Vancouver campus of the Portland VA Medical Center.\nAuthorities searched the area but haven’t found the man. They have identified him but have not released his name.\nThe officer who fired his weapon has been put on leave, which is standard practice after police shootings. He has not been publicly identified.", "url": "https://apnews.com/711fc665e82017be890452b6c9d5c439"}