{"authors": ["Lisa Respers France"], "date_download": "2020-05-04 16:02:53", "date_modify": "2020-05-04 16:02:53", "date_publish": "2020-03-29 20:13:55", "description": "If you haven't watched \"Tiger King: Murder, Mayhem and Madness,\" don't look to us to try and recap it for you.", "filename": "2020_03_29_entertainment_tiger-king-where-are-they_index_1588608173.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200329125429-tiker-king-joe-exotic-netflix-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_29_entertainment_tiger-king-where-are-they_index_1588608173.html", "title": "'Tiger King:' Where are they now?", "title_page": "'Tiger King:' Where are they now? - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "The following story contains spoilers for the Netflix docuseries \"Tiger King: Murder, Mayhem and Madness.\"\n(CNN) If you haven't watched \"Tiger King: Murder, Mayhem and Madness,\" don't look to us to try and recap it for you.\nThat's because the hit Netflix docuseries has more twists and turns than some of the snakes (literally and figuratively) that appear in it.\nBut we can catch you up on the cast of characters (again, both literally and figuratively) who appear.\nSo buckle in, cats and kittens, because here goes.\nJoseph Allen Maldonado-Passage aka Joe Exotic aka Tiger King\nWe learn at the end of the final episode that Maldonado-Passage was sentenced to 22 years in prison in January after he was convicted on multiple charges including an alleged murder-for-hire plot against his nemesis, Carole Baskin.\nThe former zoo owner/big cat enthusiast/magician/country singer has plenty of folks interested in his case, including Grammy-winning rapper Cardi B who recently tweeted about starting a GoFundMe account to help him win his freedom.\nBout to start a gofundme account for Joe .He shall be free. — iamcardib (@iamcardib) March 28, 2020\nWe have no idea if he is still sporting the mullet.\nCarole Baskin\nBaskin was not thrilled with the docuseries, it appears.\n\"When the directors of the Netflix documentary Tiger King came to us five years ago they said they wanted to make the big cat version of Blackfish (the documentary that exposed abuse at SeaWorld) that would expose the misery caused by the rampant breeding of big cat cubs for cub petting exploitation and the awful life the cats lead in roadside zoos and back yards if they survive,\" the blog begins.\n\"There are not words for how disappointing it is to see that the series not only does not do any of that, but has had the sole goal of being as salacious and sensational as possible to draw viewers,\" Baskin wrote. \"As part of that, it has a segment devoted to suggesting, with lies and innuendos from people who are not credible, that I had a role in the disappearance of my husband Don in 1997.\"\nBaskin has long maintained she had nothing to do with the disappearance of her former husband, Don Lewis.\nHe explains their version of how he and his wife came to be involved with \"Tiger King\" and defends his wife's character.\n\"In 15 years of living together, we have never had an argument,\" he says. \"We have never even had a harsh word where the other had to come back later and say, 'I'm sorry I said that.'\"\nJohn Finlay\nFinlay was married to Maldonado-Passage, though viewers come to learn Finlay is straight, and went on to have a relationship with a woman who worked for Maldonado-Passage.\nWith his multiple tattoos and missing teeth, Finlay has been a source of fascination for the internet.\nFinlay posted a video of himself talking about the page to prove he is running it.\n\"Yes I have my teeth fixed,\" Finlay said in a posting. \"The producers of the Netflix series had video and pictures of this but chose not to show it.\nBhagavan \"Doc\" Antle\nThe founder of The Institute for Greatly Endangered and Rare Species (T.I.G.E.R.), was also among those not happy with his portrayal.\n\"We are very disappointed that our facility was mentioned in the new Netflix series,\" ABC 15 News reported a now-deleted statement saying on Antle's verified Instagram account. \"We can only assume it is because Doc Antle has been such a high profile wildlife personality for so many decades that his association would create more buzz.\"\nAntle appears to continue to be as busy as ever if his Instagram account is to be believed.\nIt's still filled with plenty of animals and activities, including a \"night safari.\"\nRick Kirkham\nThe man who was counting on a reality show about Joe Exotic being his \"retirement fund,\" but instead ended up with ashes is these days looks to be living a low-key life.\nJeff Lowe\nLowe and his love Lauren are still running the Greater Wynnewood Zoo and can frequently be seen on the facility's Facebook page.\nThey plan to open a new zoo in Oklahoma later this year.\nIt's thanks to that zoo's Instagram account that we know the #HotNanny is still a part of their family.\nCNN has reached out to Netflix and the \"Tiger King\" filmmakers for comment.", "url": "https://www.cnn.com/2020/03/29/entertainment/tiger-king-where-are-they/index.html"}