{"authors": ["Parija Kavilanz", "Cnn Business"], "date_download": "2020-05-04 16:16:01", "date_modify": "2020-05-04 16:16:01", "date_publish": "2020-04-03 15:50:41", "description": "3M, the world's largest maker of respirator masks, said Friday it is willing to comply with President Trump's order to manufacture and supply more critically needed N95 masks for the United States. But 3M cautioned about being forced to halt exports of those masks to other parts of the world.", "filename": "2020_04_03_business_3m-defense-production-act-response_index_1588608961.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200323114255-3m-n95-mask--stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_business_3m-defense-production-act-response_index_1588608961.html", "title": "3M: We'll make more N95 masks for the US but we need to keep exporting them", "title_page": "3M: We'll make more N95 masks for the US but we need to keep exporting them  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) 3M, the world's largest maker of respirator masks, said Friday it is willing to comply with President Trump's order to manufacture and supply more critically needed N95 masks for the United States. But 3M cautioned about being forced to halt exports of those masks to other parts of the world.\nA day after Trump invoked the Defense Production Act (DPA) to order 3M to significantly ramp up production of N95 respirators, 3M said in a statement that \"3M and its employees have gone above and beyond to manufacture as many N95 respirators as possible for the US market.\"\n3M is the world's largest maker of N95 respirator masks.\nThe DPA also requires 3M to prioritize its respirator orders from the Federal Emergency Management Agency (FEMA). The company said it was already working closely with the administration to supply more masks to FEMA while increasing its mask imports into the United States from its global manufacturing facilities, including from China.\n3M MMM 3M, however, took issue with the administration's additional request thatcease exporting made-in-the-USA respirators to Canada and to Latin America.\n\"There are significant humanitarian implications of ceasing respirator supplies to healthcare workers in Canada and Latin America, where we are a critical supplier of respirators,\" the statement said, adding that such a move would \"likely cause other countries to retaliate and do the same.\"\nRead More", "url": "https://www.cnn.com/2020/04/03/business/3m-defense-production-act-response/index.html"}