{"authors": ["On Assignment For Huffpost"], "date_download": "2020-05-04 20:28:06", "date_modify": "2020-05-04 20:28:06", "date_publish": "2020-04-30 09:45:03", "description": "Dermatologists explain how laptop and phone screens can harm skin, even when we're indoors.", "filename": "entry_sunscreen-blue-light_l_5ea306a1c5b6d376358eb76c_1588624086.html", "image_url": "https://img.huffingtonpost.com/asset/5ea335f92200003d0a8279e1.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_sunscreen-blue-light_l_5ea306a1c5b6d376358eb76c_1588624086.html", "title": "Should We Wear Sunscreen To Protect Our Skin From Blue Light Damage?", "title_page": "Should We Wear Sunscreen To Protect Our Skin From Blue Light Damage? | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "As if you needed another reason to put down your phone, it turns out the blue light emitted by your cellphone and computer screens can not only make it harder to fall asleep at night, it could be damaging your skin, too.\nBlue light, the kind emitted from screens, is a type of high energy visible light, or HEV. While blue light is strongest from environmental sources like the sun, there are studies that show electronic screens can have similar effects.\nBut first, it’s important to note that the light from your screen isn’t as harmful as a day spent at the pool. The sun is still the biggest enemy when it comes to long term dangers like DNA damage and skin cancer.\n“Blue light causes a slightly different type of damage. It causes generation of reactive oxygen species which damages collagen, causes wrinkling, pigment changes and laxity,” said Michele Farber, a dermatologist at Schweiger Dermatology Group in New York. The sun, on the other hand, causes photoaging to a greater degree than blue light, and can also induce skin cancers, she said.\nBlue light hasn’t been shown to cause skin cancer. In fact, in medical settings it’s used to prevent skin cancer. But cosmetic dermatologist Kenneth Mark, who has practices in New York and Colorado, warned that blue light can “increase signs of aging, such as hyperpigmentation, collagen breakdown, redness, inflammation, swelling/edema and oxidative stress in the form of free radicals.”\n“Blue light has been shown to generate reactive oxygen species, causing damage to collagen, inflammation and pigment changes,” noted Farber.\nBlue light’s sleep-disrupting qualities have a direct effect on skin, too: “Watching TV and using our phones at night also disrupts our sleep-wake cycle, and lack of sleep also results in hormone fluctuations that can flare skin conditions and can accelerate aging,” Farber said.\nEven exposure time as short as an hour can cause oxidative stress in skin cells that leads to aging. Other studies show that humans are exposed to enough blue light in the course of a normal day to decrease carotenoids (an antioxidant) in skin, which increases free radicals (which can cause skin damage).\ntommaso79 via Getty Images Phone and laptops both emit the type of blue light that could cause oxidative stress on the skin.\nKeep in mind that many studies have been small, so more data is needed to confirm the full extent of blue light’s effects on skin. But preliminary results show that it can be significant enough to warrant action.\nBlue light’s not all bad ― it has benefits\nDuring the day, blue light can be a good thing. It boosts energy and mood, and keeps us awake. But don’t go sticking your face in front of your phone for an at-home spa session.\n“The difference is controlled vs. uncontrolled light exposure,” Farber said. “Blue light used as LED therapy in an office has a wavelength of 415 nanometers, which is clinically proven to help decrease inflammation and bacteria in acne, and can also help treat other skin conditions including precancerous lesions. However, the blue light that we are exposed to in the environment has a broader spectrum. The full range, rather than the single wavelength, of high-energy visible light is the cause of accelerated photoaging and skin concerns related to blue light.”\nHow to protect yourself from potential damage\nThe good news is that you don’t need to buy a new skin care product to protect yourself.\n“The best protection is to minimize exposure by utilizing the blue light filters on the phone,” Mark said. There are free apps that reduce blue light (I use Night Shift on my Mac and iPhone), and you can buy screen protectors that block blue light, too. For your eyes, Farber suggests blue-light blocking glasses.\nViacheslav Peretiatko via Getty Images Blue light-blocking glasses can protect your eyes from the effects of blue light.\nBut to fully protect yourself, use sunscreens specifically formulated to block blue light. Not all will.\n“Pick sunscreens that have a broad spectrum to protect your skin,” Farber suggested. “Physical blockers with titanium dioxide and zinc oxide help reflect light rays to offer broad protection against UV and high-energy visible light.”\nThe newest sunscreens protect skin without the heavy, white cast of zinc oxide, and many have skin-healthy features, too.\n“SkinBetter Sunbetter Sheer SPF 56 Sunscreen Stick is a great option,” Farber said. (Her practice promotes the $45, 0.7-ounce stick.) “Sunscreens with tint can add another layer of protection because they typically contain iron oxides that cover the blue light spectrum.” She also suggests Revision Intellishade TruPhysical for its antioxidants and blendability. “Don’t forget your vitamin C serums, as this is another layer of antioxidant and environmental protection,” she added.\nMany of Supergoop’s sunscreens protect against blue light, including Supergoop Unseen Sunscreen with SPF 40, which uses red algae to protect skin.", "url": "https://www.huffpost.com/entry/sunscreen-blue-light_l_5ea306a1c5b6d376358eb76c"}