{"authors": ["Reporter"], "date_download": "2020-05-04 20:31:37", "date_modify": "2020-05-04 20:31:37", "date_publish": "2020-04-30 15:03:01", "description": "The TV personality unpacked the aftermath of the 2005 audio recording that changed his life: “I’m much more curious about other people’s experiences.”", "filename": "entry_billy-bush-trump-access-hollywood_n_5eaad90fc5b6efb0d33d151d_1588624297.html", "image_url": "https://img.huffingtonpost.com/asset/5eaae868240000c6018ea064.jpeg?cache=thsbguxgae&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_billy-bush-trump-access-hollywood_n_5eaad90fc5b6efb0d33d151d_1588624297.html", "title": "Billy Bush Says Trump 'Access Hollywood' Tape Fallout Made Him A 'Nicer Person'", "title_page": "Billy Bush Says Trump 'Access Hollywood' Tape Fallout Made Him A 'Nicer Person' | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Billy Bush opened up about the “ugly moment” that changed his career and life, sharing in a new interview that he’s now a “much nicer person.”\nIn the recording, then-“The Apprentice” host Donald Trump claimed to Bush that he’s tried to have sex with a married woman, and that he can grab women “by the pussy” because he’s famous. Widespread backlash to the audio led to Bush being fired from his job at the “Today” show.\nSince then, Trump has gone on to become president, while Bush has been rebuilding his career.\n“It’s such an ugly moment,” explained Bush. “Yeah, you want to delete it, of course you want to delete it. But you can’t and it’s out there for the world to consume ... It’s humiliating, embarrassing, it’s shitty.”\nThe 48-year-old said that upon the tape’s release, he didn’t remember the “ending part” of his chat with Trump.\n“That famous line, never recalled it. When I heard it, I heard it for the first time because I don’t think it ever landed on me,” he said.\nBush went on to say that while “there’s no denying the moment is a terrible moment,” the experience gave him more empathy and made him “a much nicer person.”\n“I’m much more curious about other people’s experiences,” he said, adding, “I only take the good out of it at this point.”\nBush also credited public support and stars like Quaid, Kate Walsh, Cindy Crawford, Julie Bowen and others with why he was given another chance in Hollywood. In September of last year, he was chosen to replace Mario Lopez to host the revamp of “Extra,” aptly titled “ExtraExtra.”\nPreviously, Bush spoke out on his Instagram page about how his life changed in an “instant.”\n“Two years ago today, my life went from order to chaos in a dramatic instant,” he wrote in 2018 in a now-deleted post. “I accounted for my small part, while the President and my employer walked away and still haven’t accounted for their actions.” He called the time after the tape’s release “character building to say the least” and rife with “anxiety attacks, fits of rage, feelings of betrayal and abandonment.” “On the positive side, I feel grateful to know adversity as intimately as I do, and to have developed more empathy, humility and resilience. And to know you can laugh even in the darkest hour is a blessing,” he wrote.", "url": "https://www.huffpost.com/entry/billy-bush-trump-access-hollywood_n_5eaad90fc5b6efb0d33d151d"}