{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:24:31", "date_modify": "2020-05-04 16:24:31", "date_publish": "2020-04-06 22:54:31", "description": "Here's what we know: Wisconsin is holding a presidential primary tomorrow.", "filename": "2020_04_06_politics_wisconsin-primary-vote_index_1588609471.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200317170405-12-primary-elections-0317-illinois-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_wisconsin-primary-vote_index_1588609471.html", "title": "What's the matter with Wisconsin?", "title_page": "What's the matter with Wisconsin? - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's what we know: Wisconsin is holding a presidential primary tomorrow.\nThat's it.\nWhile most states that were slated to vote in April have either postponed their primaries until later in the year or made the vote mail-in ballots only, Wisconsin has been caught betwixt and between for weeks now.\nWisconsin Democratic Gov. Tony Evers and the Republican-controlled state legislature have gone back-and-forth in search of a workable solution basically nonstop for the last week -- to no avail.\nWith the primary just hours away, Evers issued an executive order outlawing in-person voting on Tuesday , moving in-person voting to June 9 -- even though lots and lots of people who cast absentee ballots will have voted by tomorrow.\nTo which the Republican leaders in the state Assembly and state Senate said this\n\"We are immediately challenging this executive order in the Wisconsin State Supreme Court. The clerks of this state should stand ready to proceed with the election. The governor's executive order is clearly an unconstitutional overreach. This is another last-minute flip-flop from the governor on the April 7th election.\"\nAnd on Monday evening, the state Supreme Court blocked Evers' order, which means that in-person voting is back on. Not long after, the US Supreme Court blocked a lower court's decision that would have extended absentee ballot voting into next week.\nNo matter what happens, legally speaking, between now and tomorrow, the end result will assuredly be lots and lots of confusion for Wisconsin voters.\nAnd that's a massive governmental failure that should be laid directly at the feet of both Evers and the GOP leaders in the state legislature.", "url": "https://www.cnn.com/2020/04/06/politics/wisconsin-primary-vote/index.html"}