{"authors": [], "date_download": "2020-05-04 20:25:14", "date_modify": "2020-05-04 20:25:14", "date_publish": "2020-04-29 21:58:24", "description": "Local LGBTQ advocates have warned of a \"hunting season\" fueled by political and religious groups.", "filename": "entry_puerto-rico-transgender-murders_n_5ea9ed22c5b633a85444bfab_1588623914.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9ef64220000700d827e31.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_puerto-rico-transgender-murders_n_5ea9ed22c5b633a85444bfab_1588623914.html", "title": "Puerto Rico's Wave Of Transgender Murders Sparks Fear Over Violent Epidemic", "title_page": "Puerto Rico's Wave Of Transgender Murders Sparks Fear Over Violent Epidemic | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "MEXICO CITY, April 29 (Thomson Reuters Foundation) - Puerto Rico has been hit by an “epidemic of violence” with five transgender murders in two months, LGBT+ activists said on Wednesday, adding that homophobic rhetoric from politicians and religious leaders may have fueled the bloodshed.\nOpposition lawmakers and campaigners called on the government to publicly acknowledge and investigate the violence, after the bodies of two trans women were found inside a charred car last week and another trans woman was killed in February.\n“Trans people are living in fear, they are terrified,” said Pedro Julio Serrano, spokesman for the Broad Committee for the Search for Equality, an LGBT+ rights advocacy group.\n“It’s as if they’ve opened hunting season against the LGBT+ community, and they’re hunting us, they’re looking for us and they are killing us,” he told the Thomson Reuters Foundation.\nThe Puerto Rican Governor’s office did not immediately respond to requests for comment.\nPolice commissioner Henry Escalera Rivera said that he had met with representatives of the LGBT+ community “to work together for a better Puerto Rico.”\n“We have general orders and procedures that guide officers on how to intervene with members of the (LGBT+) community,” he said. “As always, we have our doors open to dialog and discuss any proposal for the benefit of Puerto Rico.”\nWhile many other Caribbean islands outlaw gay sex, the U.S.territory has introduced legal reforms, legalizing same-sex marriage in 2015 and allowing trans people to change their gender on birth certificates in 2018.\nBut the predominantly Roman Catholic island has a history of violence and intolerance towards gay and trans people, with 10 LGBT+ people killed in less than 18 months in the latest crimewave, rights groups say.\nHATE SPEECH\nSerrano said anti-LGBT rhetoric from local politicians, religious leaders and the former head of state had contributed to the violence.\nGovernor Ricardo Rossello resigned in 2019 after hundreds of pages of group chat messages were leaked, including homophobic comments about gay pop singer Ricky Martin, who is Puerto Rican.\n“That hate speech is pervading the minds of people in PuertoRico and there is this resurgence of violence against LGBT+ people,” he said, adding that the failure to prosecute hate crimes made matters worse.\n“If you have a government that does not investigate, that does not care that (LGBT+) people are being murdered ... you are certainly sending a message as a society that these people are worth nothing.”\nFebruary’s killing of trans woman Alexa Negron Luciano made global headlines after a video circulated online, apparently showing her being shot dead while men laughed.\nRamon Luis Nieves, a former senator who is running for office again this year, said Puerto Ricans’ attitudes towards gay and trans people needed to change.\n“While discrimination may have been eradicated from the law books ... we still have a ways to go to eradicate discrimination and hatred from the minds and hearts of many,” he said.\n(Reporting by Oscar Lopez @oscarlopezgib from Mexico City.Editing by Katy Migiro. Please credit the Thomson ReutersFoundation, the charitable arm of Thomson Reuters, that covers the lives of people around the world who struggle to live freely or fairly. Visit http://news.trust.org)", "url": "https://www.huffpost.com/entry/puerto-rico-transgender-murders_n_5ea9ed22c5b633a85444bfab"}