{"authors": [], "date_download": "2020-05-04 20:17:01", "date_modify": "2020-05-04 20:17:01", "date_publish": "2020-04-16 23:02:06", "description": "DAYTONA BEACH, Fla. (AP) — An appeals court has dismissed charges under Florida's “stand your ground” law against a man accused of shooting at deputies during an arrest in front of his...", "filename": "_b287553489416674e7e52f1e9a05a935_1588623421.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b287553489416674e7e52f1e9a05a935_1588623421.html", "title": "Man cleared in deputy shooting by 'stand your ground' law", "title_page": "Man cleared in deputy shooting by 'stand your ground' law", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DAYTONA BEACH, Fla. (AP) — An appeals court has dismissed charges under Florida’s “stand your ground” law against a man accused of shooting at deputies during an arrest in front of his home.\nThe Fifth District Court of Appeals in Daytona Beach issued its decision Wednesday ending the prosecution of John DeRossett, 60, on the charge of attempted first-degree murder of a law enforcement officer while discharging a firearm, Florida Today reported. DeRossett spent nearly five years at the Brevard County jail before being allowed to leave on bond in March.\nDeRossett’s attorney, Michael Panella, said the appellate decision is better than a jury acquittal, because an acquittal only means that a defendant is not guilty.\n“This order means that John is innocent, that his actions were justified, and that he never should have been arrested in the first place,” Panella said. “It’s a total vindication.”\nThe State Attorney’s Office issued a statement that it respects the court’s decision but disagrees with the outcome.\n“Our law enforcement officers risk their lives daily to protect our community,” prosecutors said. “This ruling adds to that risk by extending protection to those who turn a blind eye to criminal activity, even within their own home.”\nProsecutors and Brevard County Sheriff’s Office investigators said DeRossett opened fire on deputies conducting the arrest of his niece on a prostitution charge in 2015.\nDefense attorneys argued that the Port St. John man didn’t know he was firing at deputies and was only responding to his niece’s screams for help at his front door. The appellate court found that DeRossett was entitled to protect his home against what he thought was a threat.\nA deputy was shot in the lower abdomen and later recovered. DeRossett and his niece, Mary Ellis DeRossett, 47, both suffered minor gunshot injuries.\nUnder Florida’s self-defense law, people who justifiably believe they or others face death or great bodily harm can use deadly force without first retreating.", "url": "https://apnews.com/b287553489416674e7e52f1e9a05a935"}