{"authors": ["Ronald Blum"], "date_download": "2020-05-04 20:18:36", "date_modify": "2020-05-04 20:18:36", "date_publish": "2020-04-09 17:49:48", "description": "NEW YORK (AP) — Two former 21st Century Fox Inc. executives were allowed to remain free on $15 million appearance bonds, three days after they were indicted as part of the U.S. government’s...", "filename": "_ab1b8eb63b1edc0f111cc69be0a02741_1588623516.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ab1b8eb63b1edc0f111cc69be0a02741_1588623516.html", "title": "Former Fox execs stay free on $15M bond each in soccer case", "title_page": "Former Fox execs stay free on $15M bond each in soccer case", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NEW YORK (AP) — Two former 21st Century Fox Inc. executives were allowed to remain free on $15 million appearance bonds, three days after they were indicted as part of the U.S. government’s investigation of soccer corruption.\nHernan Lopez and Carlos Martinez were arraigned Thursday on wire fraud and money laundering charges in connection with alleged payments to officials of the South American governing body CONMEBOL. The indictment, unsealed Monday, also contended they made illegal payments to win broadcast rights for Fox to the 2018 and 2022 World Cups.\nLopez and Martinez pleaded not guilty, as did the sports marketing company Full Play Group SA, which also is charged with racketeering.\nJudge Pamela Chen of U.S. District Court in Brooklyn ordered both to surrender their passports and imposed 10 p.m. to 6 a.m. curfews. Lopez is in Los Angeles, and Martinez is in Miami.\nMartinez, a citizen of the U.S. and Mexico, agreed to the $15 million amount with prosecutors in advance of Thursday’s two-hour telephone hearing.\nLopez, a citizen of the U.S. and Argentina, had asked to stay free on $500,000 bond.\n“I do believe here that there is an incentive to flee depending on how the case proceeds,” Chen said. “The $500,000 is simply not going to be enough. It doesn’t even come close to approximating the equity in his home.”\nMartinez’s lawyers filed a sealed document listing properties and individuals who pledged assets for his bond and Lopez was asked to submit suretors.\n“The idea is to create pressure and moral suasion on him not to hurt other individuals or himself by not complying with the bond,” Chen said.\nLopez’s home in Los Angeles will be a part of the bond but he will not have to pledge equity in Wondery, the podcast company where he is CEO. He must provide notice to the government if he liquidates any of his shares in Wondery.\nLopez was CEO of Fox International Channels, a 21st Century Fox subsidiary, and Martinez was president of Fox International Channels and an executive of Fox Latin American Channel Inc.\nAs part of the latest indictment, prosecutors revealed new details of alleged bribes paid to FIFA executive committee members to gain their votes for Russia to host the 2018 World Cup and for Qatar to host the 2022 World Cup.\n___\nMore AP soccer: https://apnews.com/Soccer and https://twitter.com/AP_Sports", "url": "https://apnews.com/ab1b8eb63b1edc0f111cc69be0a02741"}