{"authors": ["Leah Asmelash"], "date_download": "2020-05-04 15:57:03", "date_modify": "2020-05-04 15:57:03", "date_publish": "2020-04-12 05:00:30", "description": "Previously mundane chores are turning into a fun public outing in the midst of self-isolation. Just look at the Bin Isolation Outing Facebook group, filled with thousands of photos and videos of folks taking their bins to the curb in fun costumes.", "filename": "2020_04_12_world_bin-isolation-outing-facebook-trnd_index_1588607823.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410161834-bin-isolation-outing-facebook-group-trnd-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_12_world_bin-isolation-outing-facebook-trnd_index_1588607823.html", "title": "People around the world are dressing up to take their trash out in the midst of self-isolation", "title_page": "People around the world are dressing up to take their trash out in the midst of self-isolation - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Want more inspiring, positive news? Sign up for The Good Stuff, a newsletter for the good in life. It will brighten your inbox every Saturday morning.\n(CNN) In Australia, previously mundane chores are being turned into a fun public outing in the midst of self-isolation.\nJust scroll down the Bin Isolation Outing Facebook group to see. Originally begun as a joke between friends, the page now has half a million members and counting -- and is filled with photos and videos of folks around Australia (and, increasingly, the world) taking their bins to the curb in fun costumes.\nDanielle Askew created the page two weeks ago, after a friend jokingly wrote on Facebook that she was excited to take the bin out because it gave her a reason to leave the house.\nSo Askew, who lives in Hervey Bay, Australia, dared her to get dressed up for it. She did, as did Askew, who then started the Facebook page as a way to have a laugh with her friend group.\nBut that page quickly went beyond the group and Australia, reaching folks as far away as the US. What was supposed to be a private joke has turned into a source of joy for people everywhere, as more and more people find themselves stuck inside.\nRead More", "url": "https://www.cnn.com/2020/04/12/world/bin-isolation-outing-facebook-trnd/index.html"}