{"authors": ["Alaa Elassar"], "date_download": "2020-05-04 17:02:25", "date_modify": "2020-05-04 17:02:25", "date_publish": "2020-04-10 15:49:55", "description": "Nearly a year after a massive blaze devastated the Notre Dame Cathedral in Paris, only seven people attended a special televised Good Friday service at the 850-year-old church.", "filename": "2020_04_10_us_notre-dame-good-friday-easter-mass-trnd_index_1588611745.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410101024-01-notre-dame-mass-0410-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_notre-dame-good-friday-easter-mass-trnd_index_1588611745.html", "title": "The Notre Dame Cathedral holds small Good Friday service amid coronavirus lockdown almost a year after the fire", "title_page": "The Notre Dame Cathedral holds small Good Friday service amid coronavirus lockdown almost a year after the fire - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Nearly a year after a massive blaze devastated the Notre Dame Cathedral in Paris, only seven people attended a special televised Good Friday service at the 850-year-old church.\nThe ceremony began Friday morning, with Paris Archbishop Michel Aupetit entering the cathedral and presenting an important relic, the Crown of Thorns of Christ, which survived the fire.\n\"A year ago, the cathedral was destroyed. Today the country is ravaged by a pandemic. There's always a message of hope, and this celebration at the heart of the cathedral will be the sign of our hope,\" Aupetit told CNN affiliate BFMTV before the service,.\nThe 40-minute Good Friday service also featured classical musician Renaud Capuçon playing the violin. Actors Philippe Torreton and Judith Chemla, who also sang, delivered readings of Christian texts.\nFrom left to right, Archbishop of Paris Michel Aupetit speaks with violonist Renaud Capucon, actor Judith Chemla and actor Philippe Torreton as during a meditation ceremony to celebrate Good Friday.\nThe small group, some wearing masks and hazmat suits, held the ceremony in a secured part of the cathedral in front of a large cross and under a hole in the cathedral's roof.\nRead More", "url": "https://www.cnn.com/2020/04/10/us/notre-dame-good-friday-easter-mass-trnd/index.html"}