{"authors": [], "date_download": "2020-05-04 20:07:50", "date_modify": "2020-05-04 20:07:50", "date_publish": "2020-04-16 20:08:07", "description": "NEW YORK (AP) — Two police officers assigned to patrol New York City’s desolate streets were put under department investigation Thursday after a video showed them purportedly making profane...", "filename": "_49026a5241e484a58d3bc04eae3aecb6_1588622870.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_49026a5241e484a58d3bc04eae3aecb6_1588622870.html", "title": "Cops caught cursing over loudspeaker, drawing NYPD probe", "title_page": "Cops caught cursing over loudspeaker, drawing NYPD probe", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NEW YORK (AP) — Two police officers assigned to patrol New York City’s desolate streets were put under department investigation Thursday after a video showed them purportedly making profane comments to a man over their police vehicle’s loudspeaker.\nVideo posted on social media showed officers in a police department SUV on Wednesday night telling the man to “shut the (expletive) up” and threatening to “slap the (expletive) out of” him as he screamed out from a midtown Manhattan sidewalk.\nThe NYPD said it has opened an internal investigation into the matter and that such behavior will not be tolerated.\n“An incident involving two members of our department on patrol in Midtown Manhattan last night has surfaced,” the department tweeted Thursday .\n“This incident was put under investigation immediately and that internal investigation will be conducted as expeditiously as possible.”\nEliel Cruz, an activist who shared the video on social media, said the officers’ alleged actions were “unacceptable.”\nEdward Delatorre, chief of the NYPD’s transit bureau, tweeted that he was “equally alarmed by the footage.”", "url": "https://apnews.com/49026a5241e484a58d3bc04eae3aecb6"}