{"authors": [], "date_download": "2020-05-04 20:23:43", "date_modify": "2020-05-04 20:23:43", "date_publish": "2020-04-17 15:35:37", "description": "ARDEN HILLS, Minn. (AP) — The Native American woman who has graced the packaging of Land O’Lakes butter, cheese and other products since the late 1920s has quietly disappeared. Known as...", "filename": "_e23a5ccf00ad6f3f1131a0cfcf00ac8d_1588623823.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e23a5ccf00ad6f3f1131a0cfcf00ac8d_1588623823.html", "title": "Native American woman removed from Land O'Lakes packaging", "title_page": "Native American woman removed from Land O'Lakes packaging ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ARDEN HILLS, Minn. (AP) — The Native American woman who has graced the packaging of Land O’Lakes butter, cheese and other products since the late 1920s has quietly disappeared.\nKnown as Mia, the woman was shown sitting in a serene landscape of lakes and woods. That landscape remains on the Minnesota cooperative’s packaging, but Mia is nowhere to be found.\nOn some packaging she is replaced by photos of Land O’Lakes member farmers.\nPresident and CEO Beth Ford said that as the cooperative, founded in 1921, looks toward its 100th anniversary it needed packaging that reflects the foundation and heart of the company’s culture.\n“As a farmer-owned co-op, we strongly feel the need to better connect the men and women who grow our food with those who consume it,” Ford said in a statement.\nThe woman’s image has been modified over the years.\nOjibwe artist Patrick DesJarlait remade Mia in the mid-1950s. DesJarlait’s work is included in the Minnesota Museum of American Art in St. Paul.\n“I have mixed feelings about it,” Robert DesJarlait, Patrick’s son and an artist and writer, told the Star Tribune from his home in Onamia, Minnesota. “I’m sad to see it go, but I can understand why it’s gone. We live in a politically correct time, so maybe it was time to get rid of it. It certainly devolved into a stereotype.”\nLand O’Lakes, which is headquartered in Arden Hills, posted $14 billion in sales in 2019.", "url": "https://apnews.com/e23a5ccf00ad6f3f1131a0cfcf00ac8d"}