{"authors": [], "date_download": "2020-05-04 16:53:22", "date_modify": "2020-05-04 16:53:22", "date_publish": "2020-03-24 13:56:18", "description": "With many of us practicing social distancing, going to the nail salon is no longer an option, making it the perfect time to master your DIY mani skills at home.", "filename": "2020_03_24_cnn-underscored_diy-nails_index_1588611202.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200320104707-diynailslead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_24_cnn-underscored_diy-nails_index_1588611202.html", "title": "DIY Nails: Everything you need for a perfect at-home mani", "title_page": "DIY Nails: Everything you need for a perfect at-home mani - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "With many of us practicing social distancing, going to the nail salon is no longer an option, making it the perfect time to master your at-home manicure skills. Not only can doing your own nails be fun, it can also work as a distraction in stressful times like these when self-care is more important than ever.\nWe spoke with Jaclyn Duguay-Gordon, manicurist at Green Tangerine Spa & Salon in Boston, to steer us straight when it comes to DIY nails. Turns out, all it takes is a few simple steps and the right products. Read through and use her tips, and you'll end up with an Insta-worthy manicure that will have everyone who sees you (even just on the 'gram) wondering how you did it.\nGet your old polish off\nNow if you're rocking regular polish, you know that a good polish remover and file is all you need to get the job done. But if you're wearing gel polish and you're stuck at home, Duguay-Gordon has guidance.\n\"If you cannot make it to the salon for a gel removal, the first step is to use a fine-grit nail file to gently rough up the top coat and break the seal,\" she says. \"Then use pure acetone in a glass bowl to soak for three to five minutes. Use a birchwood stick to gently remove the remaining jelly-like substance.\"\nMineral Fusion Nail Polish Remover ($8.22; walmart.com)\nMineral Fusion Nail Polish Remover\nThis acetone-free remover can gently remove regular polish without over-drying nails.\n_______________________________________________________________________________\nZoya Remove Plus 3-in-1 Formula ($23.95; walmart.com)\nZoya Remove Plus 3-in-1 Formula\nExcellent for weaker nails, this formula from Zoya conditions nails while removing polish.\n_______________________________________________________________________________\nDeborah Lippmann The Stripper Lavender ($19; nordstrom.com)\nDeborah Lippmann The Stripper\nIf you're wearing traditional nail polish, try Lippmann's gassed-up remover, which takes just one swipe to remove the color.\n_______________________________________________________________________________\nDeborah Lippmann Smooth Operator Buffer Nail File ($12; sephora.com)\nDeborah Lippmann Smooth Operator -- Buffer Nail File\nThe smooth operator buffer file is gentle on the surface of the nails and keeps them smooth and shiny.\n_______________________________________________________________________________\nIridesi Nail Files and Buffers Washable Emery Boards ($11.99; amazon.com)\nIridesi Nail Files and Buffers Washable Emery Boards\nThis 12-pack of simple emery boards has small grit for precise filing on one side and a coarser on the other for fast filing down.\n_______________________________________________________________________________\nOnyx Professional 100% Acetone Glitter & Polish Remover ($4.76; walmart.com)\nOnyx Professional 100% Acetone Glitter & Polish Remover\nFor removing gel polish, soaking your nails in this 100% acetone formula can do the trick.\n_______________________________________________________________________________\nTeenitor Nail Polish Gel Remover Tools Kit ($13.99; amazon.com)\nTeenitor Nail Polish Gel Remover Tools Kit\nGet the salon gel-removal experience at home with this kit: It comes with a file, cuticle peeler and soak art remover, which can help remove nail tips and polish without damage.\n_______________________________________________________________________________\nGraham Handsdown Birchwood Cuticle Sticks ($7.50; amazon.com)\nGraham Handsdown Birchwood Cuticle Sticks\nYou've seen these tiny wood sticks at your salon. They're a lot easier on your cuticles and nail beds than the metal tools in many kits to help remove gel polish.\nPrep your hands\nBefore you paint your new polish, you'll want to get your hands and nails in shape — and this is seriously the best part of a manicure anyway. \"Use a fine-grit buffer to buff your natural nail,\" Duguay-Gordon says. \"And finally a cuticle oil or hand lotion to rehydrate.\"\nIf your nails are looking a little long since your last appointment, this is when you can further file and clip them down to get the shape you want, too.\nTropical Shine Colossal 4-Way Blue-Pink Buffer ($9.99; amazon.com)\nTropical Shine Colossal 4-Way Blue-Pink Buffer\nThis inexpensive Tropical Shine tool is the only buffer most of us need. It's not only a buffer, but it also files, smooths and shines your nails.\n_______________________________________________________________________________\nTweezerman Nail Clipper Set ($10.99; target.com)\nTweezerman Nail Clipper Set\nThis set of two clippers — one small and one large — will last you a lifetime.\n_______________________________________________________________________________\nBarefoot Scientist Inner Strength Nail Cuticle Renewal Drops ($19.99; amazon.com)\nBarefoot Scientist Inner Strength Nail Cuticle Renewal Drops\nThis luxurious oil absorbs quickly, strengthen cuticles and nail beds, and has a built-in drop applicator. So bonus: no mess!\n_______________________________________________________________________________\nCaudalie Hand & Nail Cream ($15; sephora.com)\nCaudalie Hand & Nail Cream\nThis classic hand and nail cream will keep your skin soft and your cuticles uncracked.\nPick a color\nSince everyone wants to get the most out of a polish, especially when they do the work themselves, it's important to invest in a polish that you really know sticks.\n\"CND Vinylux, Opi Infinity Shine and Essie Gel Couture are great long-lasting polishes,\" she says. \"None of these require a base coat, and each have a gel-like top coat for which a UV/LED light is not needed, which makes for easy removal with just a polish remover. All have long-lasting wear, generally for up to seven days with proper nail prep.\"\nCND Vinylux ($11.20; walmart.com)\nCND Vinylux\nTry this long-lasting polish in #283 Element, a bright and jolly red.\n_______________________________________________________________________________\nOPI Infinity Shine ($13; amazon.com)\nOPI Infinity Shine\nThis high-shine polish delivers in a classic pink.\n_______________________________________________________________________________\nEssie Gel Couture ($11.49; target.com)\nEssie Gel Couture\nTry a lovely lilac shade in this powerful polish.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/03/24/cnn-underscored/diy-nails/index.html"}