{"authors": [], "date_download": "2020-05-04 16:27:27", "date_modify": "2020-05-04 16:27:27", "date_publish": "2020-04-07 18:08:45", "description": "You certainly don't have to learn new skills with your added time at home these days, but if you're looking to pick up or refine hobbies — be it cooking a super tasty beef wellington or how to write the next best-selling novel — online learning is your best bet.", "filename": "2020_04_07_cnn-underscored_online-learning-courses-roundup_index_1588609647.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407115434-underscored-elearning-cooking-gordon-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_cnn-underscored_online-learning-courses-roundup_index_1588609647.html", "title": "Learn new skills with these online courses", "title_page": " E-Learning Course Roundup: E-learning is all the rage and we're breaking down the best sites to find classes - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "You certainly don't have to learn new skills with your added time at home these days, but if you're looking to pick up or refine hobbies — be it cooking a super tasty beef wellington or how to write the next best-selling novel — online learning is your best bet.\nBut finding a reliable course in a sea swimming with thousands of options is easier said than done. Sure, YouTube and Pinterest are great for quick hits and inspiration. When learning something new, though, you want a vetted instructor who can provide more in-depth direction.\nAnd that's where our guide to e-learning courses comes in. We've narrowed down the long, long list of e-learning courses down by interests: food and drink, coding, arts and lifestyle. We focused on three of our favorite sites — Udemy, SkillShare and MasterClass — due to their sleek user interfaces, a wide breadth of courses to choose from, solid customer reviews to back them up and instructors with a wealth of knowledge. All of the below courses were chosen based on customer feedback and classes we thought would appeal to a wide audience.\nSo what are you waiting for? Pull out your trusty writing utensil and some sheets of paper and get to learning.\nFood and Drink\nGordon Ramsay teaches Cooking I on MasterClass\nYes, there might be countless cookbooks in your home. And yes, there are tons of recipes online. But reading text isn't the most lively, right? Especially if you're new to the cooking game, learning from a legendary chef (say, Gordon Ramsey, perhaps) or at least someone with solid kitchen skills in an organized fashion makes a big difference. Plus, a professionally shot and edited video with great visuals that show you the whole kitchen counter are much easier to follow. Here are some great food and drink courses to kick off your culinary journey.\nThink Like a Chef: A Beginner's Guide to Cooking with Confidence ($99.99 Skill Share premium)\nThis course includes 15 lessons, totaling 38 minutes of video content, with two New York City chefs breaking down the basics of cooking. You're taught basics like knife skills and safety, and learn how to put together a well balanced meal.\nEssential Cooking Skills on Udemy for $44.99\nThis course offers 18 lectures, totaling more than an hour total. Lessons include skill set tutorials like Chopping Herbs and recipes like Making a Simple Omelette. If you're new to the kitchen and looking to build a foundation of skills, this course is an excellent place to start. This course is part of a series, so if you find it useful you're able to pick up another level with the same instructor.\nGordon Ramsay teaches Cooking I on MasterClass for $90\nThis seven-star Michelin chef runs down everything you'd need to know, from how your kitchen should be laid out for everyday use to making beef Wellington. It also doesn't include his classic angry screaming. His class includes 20 video lessons, totaling almost four hours of videos. This class is also part of a series, featuring Ramsay and Thomas Keller of The French Laundry. That means if you enjoy the instructor, you can continue with classes taught by him. A nice bonus.\nCocktail Secrets: Making Your Signature Drink on SkillShare through a premium membership.\nLooking to improve your bartender skills? Try this mixology class. Over thirty three minutes broken up into eight lessons you'll learn how to properly create a flavor profile, mix, and present your cocktail.\nHow to Bake Real Artisan Bread on Udemy for $24.99\nIf you're missing the fresh baked bread of your favorite local restaurants, try baking your own! This one hour course will get you confident in the kitchen. The course covers ingredients and equipment you'll need. You'll also learn how to mold your dough into your desired shape.\nCoding, Web development and Software\nAdobe Photoshop CC-Essentials Training Course on SkillShare\nMake no mistake: coding languages like C++, HTML and Swift are daunting. Same goes for becoming a streamer online and learning the Adobe Suite. But a full course taught by an esteemed instructor can help make it less daunting. Better yet, these online courses pair that with clear instructions and examples that bring new meaning to showing your work.\nThe Complete 2020 Web Development Bootcamp on Udemy for $199.99\nThis course includes almost 54 hours of content, eight coding exercises and covers all major software systems. You don't need to have any prior programming experience, and by the end of the course, you'll have created your own website.\nNinja's Guide to Streaming: Grow Your Channel on Udemy for $99.99\nNinja has been playing video games professionally for years, and he's built his career on streaming. In this one hour course he's breaking down how to set up your stream and interact with your community. Make money and have fun all while putting your gaming skills to the test.\nAdobe Photoshop CC-Essentials Training Course on SkillShare through their premium membership.\nOne of the longer courses we've found is taught by Adobe Certified Instructor Dan Scott who will take you through everything you need to know about Photoshop. Broken up over eighty seven lessons, this course time totals eight hours and thirty six minutes. Along the way you'll have projects to submit to make sure you're on the right track.\nLearn Basic HTML5, CSS and JavaScript Programming from Scratch on SkillShare, available through its premium membership.\nThis course features 29 lessons, taking up about four hours. You'll learn how to build a website using HTML5, which is one of the most frequently used programs in web design. Like the Udemy course, you'll wrap this course knowing how to make a site. Lesson titles include Dynamic Data Type, Alert Boxes, and Building A Website.\nWill Wright Teaches Game Design on MasterClass for $90.\nGame Design is taught by the man behind \"SimCity\" and \"The Sims.\" Through this course you'll learn the process of game creation, design and mechanics. If you have an idea that's been brewing in the back of your mind for the next best game, this would be a great class to help get your idea off the ground. Especially with a focus on how games generally run and ways of player interaction.\nArts\nAcrylic Painting: Learn the Basics for Beginners on SkillShare\nWhether you want to speed up putting a pen to paper, write a hit soap opera or get creative with painting, there's an online course for you. You can learn to write, get schooled in sewing and even learn writing for television from Shonda Rhimes. All of these feature clear instructions that give you exciting tasks that will have you thinking outside the box to complete the goals of each course.\nDan Brown teaches Writing Thrillers on MasterClass.\nThis course breaks down every step for writing your masterpiece. Course content includes Finding the Idea, Creating your Villain and The Secret of Secrets. In this 3½-hour course, you'll learn all you need to know about how to finally put pen to paper and get writing. All yours for $90.\nAcrylic Painting: Learn the Basics for Beginners on SkillShare through a premium membership.\nPick up your brushes and paints and get started on your next masterpiece with this course from SkillShare. Two hours are broken up over twenty six lessons that break down color mixing, brushes, texture, and depth of field. You'll be the next Picasso in no time.\nSewing 101 on Udemy for $29.99.\nThis course includes two hours of video lessons, breaking down the basics like seams and stitches, and getting you prepared to sew your own pillowcase. You'll need some materials like a sewing machine, an iron and ironing board, as well as other supplies like scissors, pins, and thread.\nShonda Rhimes Teaches Writing for Television on MasterClass for $90.\nShonda Rhimes is a prolific television writer, and the mind behind Scandal, Grey's Anatomy, and Private Practice. In this thirty lesson course (totaling six hours and fifteen minutes of video) she's breaking down every step of the TV writing process. Rhimes has built herself a television empire, and she'll help you get started on your own.\nThe Writer's Toolkit: 6 Steps to a Successful Writing Habit from SkillShare\nThis nine-lesson course runs just 38 minutes and doesn't break down writing steps like the other two mentioned do, but helps you establish a productive writing habit. This course offers foundational steps to create a great writing space and great writing practices. These, in turn, will help you produce writing at the top of your game.\nLifestyle\nTidy Up Your Home: The KonMari Method from Udemy\nThis might seem a little more ephemeral, but many of these focus on leadership and handling feedback — two skills that are crucial for working on a team. You can also learn how to be a leader in business from Howard Schultz, the former person at the helm of Starbucks. These courses can lead you to feeling better and more confident in yourself.\nSkillShare offers Modern Leadership: Give & Get Honest Feedback at Work if you have a premium membership.\nThis course is 32 minutes long and broken down over six lessons. Giving and receiving feedback can be a major challenge in the workplace. This course breaks down the feedback loop, and teaches you how to get honest feedback from employees who are on the quieter side, and how to provide feedback in productive ways.\nThe Power of Deep Listening on Udemy is one of its top rated courses, which runs for $74.99. In ever changing times, it's become more important than ever to listen closely and carefully. This course runs almost four hours long and is spaced out over 46 lectures. The only course requirements are a desire to improve your relationships with others by better listening and a willingness to have more empathy and be better attuned to others.\nTidy Up Your Home: The KonMari Method from Udemy for $59.99\nBeen meaning to declutter your closet for months now, and finally have the time? This course is taught by Marie Kondo, known for her best-selling books The Life-Changing Magic of Tidying Up and Spark Joy. Over this hour and a half course Kondo gets you through all stages of decluttering.\nHoward Schutlz teaches Business Leadership on MasterClass for $90.\nHoward Schultz, former chairman and CEO of Starbucks, breaks down how to be the best leader in business. This course lasts one hour and 43 minutes and is broken down into 12 video lessons. If you're looking to grow a business and need motivation, this is a great place to start.\nRuPaul teaches Self Expression and Authenticity on MasterClass for $90\nThroughout this two hour course RuPaul is sharing his personal journey while helping you further yours. Lessons in this course include titles like Owning the Room, There's No Such Thing as Failure, and Seeing Yourself. RuPaul has been a monumental figure in pop culture, and he's a great person to turn to if you need motivation.\nA breakdown of e-learning sites\nUdemy is the most prolific of the three sites we researched when it comes down to the range in categories and the breakdowns of courses it offers. To help you narrow your options, Udemy offers a short quiz to help you find courses suitable for you and your interests. This feature is unique to Udemy, and we found it to be extremely helpful in finding courses. Prices on Udemy range from $19 to $199.\nSkillShare boasts 16 learning categories, ranging from Animation, to Business Analytics, to Web Design. The range of courses on SkillShare is great. This site even offers free courses, something we couldn't get from the other two. A premium membership is priced at $99 per year, with billing occurring monthly.\nMasterClass is the flashiest of these three sites. This e-learning site boasts well-known and celebrity instructors such as Gordon Ramsay, Stephen Curry, Anna Wintour, among many others. The lineup seems to be growing as well, as its Twitter account has been filled with exciting announcements regarding new instructors and courses. A single class will cost you $90, while an All-Access Annual membership will cost you $180.\nReady to learn?\nBetween Udemy, SkillShare and MasterClass, there is an e-learning course for anyone and everyone. Whether you're looking to hone in on specific skills or gain a broader understanding of a topic, you're bound to find something that fits your needs on one of these three sites.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/07/cnn-underscored/online-learning-courses-roundup/index.html"}