{"authors": [], "date_download": "2020-05-04 20:11:20", "date_modify": "2020-05-04 20:11:20", "date_publish": "2020-04-16 23:06:06", "description": "OKLAHOMA CITY (AP) — A board led by Gov. Kevin Stitt has until Monday to respond to a lawsuit filed against it by legislative leaders over a budget feud, the Oklahoma Supreme Court said in an...", "filename": "_b27f074686d03c4d895ba258de88da22_1588623080.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e9686509df224d668ea818f6152edf61/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b27f074686d03c4d895ba258de88da22_1588623080.html", "title": "Oklahoma Supreme Court sets arguments in funding flap case", "title_page": "Oklahoma Supreme Court sets arguments in funding flap case", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Aug. 14, 2019, file photo is Oklahoma's Office of Management and Enterprise Services Director Steven Harpe, in Oklahoma City. Revenue collections to Oklahoma's main state operating fund were just 3.6% below projections last month, but state finance officials warned Tuesday the biggest hit is expected over the next three months. (AP Photo/Sue Ogrocki, File)\nFILE - In this Aug. 14, 2019, file photo is Oklahoma's Office of Management and Enterprise Services Director Steven Harpe, in Oklahoma City. Revenue collections to Oklahoma's main state operating fund were just 3.6% below projections last month, but state finance officials warned Tuesday the biggest hit is expected over the next three months. (AP Photo/Sue Ogrocki, File)\nOKLAHOMA CITY (AP) — A board led by Gov. Kevin Stitt has until Monday to respond to a lawsuit filed against it by legislative leaders over a budget feud, the Oklahoma Supreme Court said in an order Thursday.\nChief Justice Noma Gurich also set oral arguments in the case for Tuesday before a Supreme Court referee.\nHouse Speaker Charles McCall and Senate President Pro Tempore Greg Treat asked the high court earlier this week to weigh in on the dispute between them and Stitt. The lawmakers want the court to order the Board of Equalization, chaired by Stitt, to meet and declare a revenue failure.\nStitt abruptly canceled a meeting of the board last week during a spat with lawmakers over funding for one of Stitt’s budget priorities to upgrade the state’s computer systems.\nThe Legislature last week approved a package of bills to fill a projected $416 million hole in the budget for the fiscal year that ends June 30. But one of the bills requires the declaration of a revenue failure by the board to access reserve funds.", "url": "https://apnews.com/b27f074686d03c4d895ba258de88da22"}