{"authors": [], "date_download": "2020-05-04 20:04:18", "date_modify": "2020-05-04 20:04:18", "date_publish": "2020-04-08 20:28:43", "description": "ANNAPOLIS, Md. (AP) — Authorities recovered the body of a grandson of former Maryland Lt. Gov. Kathleen Kennedy Townsend on Wednesday, two days after the body of the boy's mother was found in the...", "filename": "_9ef2f35efde00c35b465063a4d21a8f0_1588622658.html", "image_url": "https://storage.googleapis.com/afs-prod/media/7651030b6ad5446da392224af0a52d20/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9ef2f35efde00c35b465063a4d21a8f0_1588622658.html", "title": "Body of Kathleen Kennedy Townsend's grandson found", "title_page": "Police: Body of Kathleen Kennedy Townsend's grandson found", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Friday, April 3, 2020, file photo, Gov. Larry Hogan, R-Md., speaks at a news conference, in Annapolis, Md. Authorities have recovered the body of a grandson of former Maryland Lt. Gov. Kathleen Kennedy Townsend, two days after the body of the boy’s mother was found in the water after a canoeing accident. The Maryland Natural Resources Police said in a news release that the body of 8-year-old Gideon McKean was found Wednesday afternoon, April 8. (AP Photo/Brian Witte, File)\nFILE - In this Friday, April 3, 2020, file photo, Gov. Larry Hogan, R-Md., speaks at a news conference, in Annapolis, Md. Authorities have recovered the body of a grandson of former Maryland Lt. Gov. Kathleen Kennedy Townsend, two days after the body of the boy’s mother was found in the water after a canoeing accident. The Maryland Natural Resources Police said in a news release that the body of 8-year-old Gideon McKean was found Wednesday afternoon, April 8. (AP Photo/Brian Witte, File)\nANNAPOLIS, Md. (AP) — Authorities recovered the body of a grandson of former Maryland Lt. Gov. Kathleen Kennedy Townsend on Wednesday, two days after the body of the boy’s mother was found in the water after a canoeing accident.\nThe body of 8-year-old Gideon McKean was found in roughly 25 feet (8 meters) of water more than 2 miles (3 kilometers) south of his grandmother’s residence in Shady Side, Maryland, where he and his mother had launched the canoe, according to a news release from the state Natural Resources Police.\nThe body of Gideon’s mother — 40-year-old Maeve Kennedy Townsend McKean, was recovered on Monday about 2,000 feet (610 meters) from where the boy’s body was recovered, police said. The search for the missing mother and son lasted five days and included the use of underwater imaging sonar technology.\nThe search started Thursday after authorities responded to a report of two people on a canoe in the Chesapeake Bay who appeared to be overtaken by strong winds.\nMaeve McKean’s husband, David, said in a Facebook post Friday that their family had been self-quarantining in an empty house owned by his wife’s mother to give their kids more space than what they had at their home in Washington, D.C.\nMaeve McKean, a public health and human rights lawyer, served as executive director of the Georgetown University Global Health Initiative. The initiative’s website says her work focused on “the intersection of global health and human rights.” McKean previously served as an associate research professor at the City University of New York School of Public Health.\nKennedy Townsend, who served two terms as Maryland’s lieutenant governor, is the eldest daughter of the late U.S. Attorney General and U.S. Sen. Robert F. Kennedy, and niece of the late President John F. Kennedy.\n“Our Maeve dedicated her life to society’s most vulnerable,” Kennedy Townsend said in a statement Friday night, adding that her grandson Gideon was a “loving” big brother who excelled at sports, riddles, math and chess.\n“My heart is crushed, yet we shall try to summon the grace of God and what strength we have to honor the hope, energy and passion that Maeve and Gideon set forth into the world,” Kennedy Townsend said.", "url": "https://apnews.com/9ef2f35efde00c35b465063a4d21a8f0"}