{"authors": [], "date_download": "2020-05-04 20:16:54", "date_modify": "2020-05-04 20:16:54", "date_publish": "2020-04-06 18:32:55", "description": "GRAND JUNCTION, Colo. (AP) — The temporary head of the federal Bureau of Land Management is expected to continue overseeing the agency for another month. William Perry Pendley will continue...", "filename": "_33ec6ef8557eeebf9b1cb03ee743cd0b_1588623414.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_33ec6ef8557eeebf9b1cb03ee743cd0b_1588623414.html", "title": "Bureau of Land Management director to continue through April", "title_page": "Bureau of Land Management director to continue through April", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GRAND JUNCTION, Colo. (AP) — The temporary head of the federal Bureau of Land Management is expected to continue overseeing the agency for another month.\nWilliam Perry Pendley will continue as acting director through May 5, The Daily Sentinel reported Saturday.\nInterior Secretary David Bernhardt issued an order delegating the responsibilities of the office to Pendley, the deputy director of policy and programs.\nPendley has carried out the director’s duties since last summer. The agency has not had a permanent director during the Trump administration.\nThe Interior Department announced last year that the land management bureau would move most administrative jobs based in Washington, D.C., to locations in the western U.S., including a new headquarters in Colorado. The Grand Junction office opened in January.\nPendley has drawn criticism over views he espoused about public lands management during decades as president of the conservative Mountain States Legal Foundation.\nTracy Stone-Manning of the National Wildlife Federation said in a statement that Pendley is not qualified to lead the bureau.\n“Americans deeply value our public lands, and yet the administration has appointed a man to be in charge of them who does not believe public lands should exist,” Stone-Manning said.\nPendley has provided a “steady hand” at the bureau, the Interior Department said in a statement.\n“Mr. Pendley brings a wealth of knowledge and experience to the Department and is committed to carrying out the Administration’s priorities for the betterment of the American people,” the department said.", "url": "https://apnews.com/33ec6ef8557eeebf9b1cb03ee743cd0b"}