{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:24:43", "date_modify": "2020-05-04 20:24:43", "date_publish": "2020-04-20 14:22:48", "description": "NEW ORLEANS (AP) — EDITOR’S NOTE: On April 20, 2010, a well blew wild under a BP oil platform in the Gulf of Mexico. Eleven workers were missing that day, and would later be declared dead. The...", "filename": "_7914d11149279a44e6b600c57292960d_1588623883.html", "image_url": "https://storage.googleapis.com/afs-prod/media/5e19563a45a343bca6d6fa99cee8388e/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7914d11149279a44e6b600c57292960d_1588623883.html", "title": "AP Was There: Deepwater Horizon oil platform explosion", "title_page": "AP Was There: Deepwater Horizon oil platform explosion", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - This Wednesday, May 5, 2010 file picture shows a plume of oil as a shrimp boat uses booms to collect oil in the waters of Chandeleur Sound, La. On April 20, 2010, a well blew wild under a BP oil platform in the Gulf of Mexico. Eleven workers were missing that day, and would later be declared dead. Ten years after the explosion on that Deepwater Horizon rig off Louisiana's coast, The Associated Press is making the original story and photographs available. (AP Photo/Eric Gay)\nFILE - This Wednesday, May 5, 2010 file picture shows a plume of oil as a shrimp boat uses booms to collect oil in the waters of Chandeleur Sound, La. On April 20, 2010, a well blew wild under a BP oil platform in the Gulf of Mexico. Eleven workers were missing that day, and would later be declared dead. Ten years after the explosion on that Deepwater Horizon rig off Louisiana's coast, The Associated Press is making the original story and photographs available. (AP Photo/Eric Gay)\nNEW ORLEANS (AP) — EDITOR’S NOTE: On April 20, 2010, a well blew wild under a BP oil platform in the Gulf of Mexico. Eleven workers were missing that day, and would later be declared dead. The blast touched off the nation’s worst offshore oil spill. Millions of gallons of crude oil spewed into the blue water of the gulf. Miles of coastline from Texas to Florida were marred, animals were coated in oil, and economies took years to start to recover.\nTen years after the explosion on that Deepwater Horizon rig off Louisiana’s coast, The Associated Press is making two original text stories and several photographs available.\n___\nOIL RIG EXPLODES OFF LOUISIANA COAST, 11 MISSING\nRescuers in helicopters and boats searched the Gulf of Mexico for 11 missing workers Wednesday after a thunderous explosion rocked a huge oil drilling platform and lit up the night sky with a pillar of flame. Seventeen people were injured, four critically.\nThe blast Tuesday night aboard the Deepwater Horizon rig 50 miles off the Louisiana coast could prove to be one of the nation’s deadliest offshore drilling accidents of the past half-century.\nThe Coast Guard held out hope that the missing workers escaped in one of the platform’s covered lifeboats.\nNearly 24 hours after the explosion, the roughly 400-by-250-foot rig continued to burn, and authorities could not say when the flames might die out. A column of boiling black smoke rose hundreds of feet over the Gulf of Mexico as fireboats shot streams of water at the blaze.\n“We’re hoping everyone’s in a life raft,” Coast Guard Senior Chief Petty Officer Mike O’Berry said.\nAdrian Rose, vice president of rig owner Transocean Ltd., said the explosion appeared to be a blowout, in which natural gas or oil forces its way up a well pipe and smashes the equipment. But precisely what went wrong was under investigation.\nCrews were doing routine work before the explosion and there were no signs of trouble, Rose said.\nA total of 126 workers were aboard the rig when it blew up. The Coast Guard said 17 were taken by air or sea to hospitals. Four were reported in critical condition with severe burns. Others suffered burns, broken legs and smoke inhalation.\nNearly 100 other workers made it aboard a supply boat and were expected to reach the Louisiana shore by evening.\nKelly Eugene waited with nine family members for husband Kevin Eugene, 46, a cook on the Deepwater Horizon. A catering company operating on the rig notified her he was safe.\n“He’s on the boat. That’s all we know. And that’s all we need to know,” she said.\nThe rig was tilting as much as 10 degrees after the blast, but earlier fears that it might topple over appeared unfounded. Coast Guard environmental teams were on standby, though officials said the damage to the environment appeared minimal so far.\nThe rig, which was under contract to the oil giant BP, was doing exploratory drilling but was not in production, Transocean spokesman Greg Panagos said. Seventy-nine Transocean workers, six BP employees and 41 contract workers were aboard.\nTed Bourgoyne, a retired professor of petroleum engineering at Louisiana State University, said the explosion was probably caused by natural gas or a mixture of oil and gas coming up through the well, combined with some kind of ignition source.\nHe said there are numerous defenses on a modern rig to prevent something like that from happening. For instance, fluids used in drilling are weighted with barium sulfite to prevent gas from traveling up the well, and there are alarms to alert workers to gas. Machinery is built to prevent sparking and is placed as far away as possible from places where gas might leak.\n“In almost all of these things, there’s not one thing that happens; it’s a series of things,” Bourgoyne said.\nRose said the crew had drilled the well to its final depth, more than 18,000 feet, and was cementing the steel casing at the time of the explosion.\n“They did not have a lot of time to evacuate. This would have happened very rapidly,” he said.\nAccording to Transocean’s website, the Deepwater Horizon is about twice the size of a football field. Built in 2001 in South Korea, it is designed to operate in water up to 8,000 feet deep, drill 5 1/2 miles down, and accommodate a crew of 130. It floats on pontoons and is moored to the sea floor by several large anchors.\nThe site of the accident is known as the Macondo prospect, in 5,000 feet of water.\nWorkers typically spend two weeks on the rig at a time, followed by two weeks off. Offshore oil workers are typically well paid, earning $40,000 to $60,000 a year more if they have special skills.\nLast September, the Deepwater Horizon set a world deepwater record when it drilled down just over 35,000 feet at another BP site in the Gulf of Mexico, Panagos said.\n“It’s one of the more advanced rigs out there,” he said. Panagos did not know how much the rig cost to build but said a similar one today would run $600 million to $700 million.\nKelly Eugene said her husband flew to work on the rig, and until Tuesday’s explosion, that was the part of his job that scared her most. Kevin Eugene has worked in the offshore industry about 12 years and had been on the Deepwater Horizon about a month. Until now, she said, hurricane evacuations were the worst he had been through.\n“My biggest fear is the helicopter ride,” she said.\nWorking on offshore oil rigs is a dangerous job but has become safer in recent years thanks to improved training, safety systems and maintenance, said Joe Hurt, regional vice president for the International Association of Drilling Contractors.\nSince 2001, there have been 69 offshore deaths, 1,349 injuries and 858 fires and explosions in the Gulf, according to the federal Minerals Management Service.\nThere are 42 rigs either drilling or doing upgrades and maintenance in depths of 1,000 feet or greater in the Gulf of Mexico, according to the agency. They employ an estimated 35,000 people. Transocean has 14 rigs in the Gulf and 140 worldwide.\nIn 1964, a catamaran-type drilling barge operated by Pan American Petroleum Corp. near Eugene Island, about 80 miles off Louisiana in the Gulf of Mexico, suffered a blowout and explosion while drilling a well. Twenty-one crew members died.\nThe deadliest offshore drilling accident took place in 1988, when an Occidental Petroleum platform about 120 miles off Aberdeen, Scotland, was rocked by explosions and fire. A total of 167 men were killed.\n___\nFAMILIES OF LOUISIANA OIL RIG BLAST SURVIVORS WAIT\nFamilies eagerly waited to welcome survivors of a thunderous blast that rocked the oil platform they were aboard as Coast Guard rescuers combed Gulf of Mexico waters Thursday for signs of 11 missing from the still-burning rig.\nAbout 100 workers aboard the Deepwater Horizon when it blew Tuesday made it onto a supply boat. The boat reached shore Thursday morning, according Dana Eugene, the sister of Kevin Eugene, one of the survivors. Seventeen people were injured and taken to hospitals, four critically, in what could be one of the nation’s deadliest offshore drilling accidents of the past half-century.\nEugene said before the workers can be reunited with about five or six waiting families, they must be checked by doctors in Port Fourchon, where the boat docked. Afterward, they were expected to be taken to a hotel about 70 miles north in suburban New Orleans where more families were waiting.\n“We just want to see him,” Eugene said.\nMeanwhile, Coast Guard rescuers in two cutters searched overnight for the missing, though no one had been spotted, said Lt. Sue Kerver. The air search was suspended until first light, she said.\nThe rig, which is owned by Transocean Ltd., was under contract to the oil giant BP and doing exploratory drilling. Company officials would not comment on the survivors reaching shore or their conditions.\nCarrol Moss, 33, of Jayess, Miss., was waiting at the hotel for her husband.\nShe said Transocean notified her about the explosion early Wednesday. Nine hours later, the company said her 37-year-old crane operator husband, Eugene Moss, was safe.\n“That was pure freaking hell,” Moss said late Wednesday. “To have your kids look at you and say, ‘Mama, my daddy may not come home.’” The Mosses have four children.\nAuthorities could not say when the flames might die out on the 400-by-250-foot rig, which is roughly twice the size of a football field, according the Transocean’s website. A column of boiling black smoke rose hundreds of feet over the Gulf of Mexico as fireboats shot streams of water at the blaze. Officials said the damage to the environment appeared minimal so far.\nAdrian Rose, vice president of Transocean, said the explosion appeared to be a blowout, in which natural gas or oil forces its way up a well pipe and smashes the equipment. But precisely what went wrong was under investigation.\nA total of 126 workers were aboard. Seventy-nine were Transocean workers, six were BP employees and 41 were contracted. The Coast Guard said the 17 taken by air or sea to hospitals suffered burns, broken legs and smoke inhalation.\nCompany officials had not identified the missing workers. The Neshoba County Democrat newspaper in Philadelphia, Miss., reported that the county sheriff’s office notified a Sandtown family that a relative was among the missing.\nOne of the deadliest U.S. offshore drilling accidents was in 1964, when a catamaran-type drilling barge operated by Pan American Petroleum Corp. near Eugene Island, about 80 miles off Louisiana, suffered a blowout and explosion while drilling a well. Twenty-one crew members died. The deadliest offshore drilling explosion was in 1988 about 120 miles off Aberdeen, Scotland, in which 167 men were killed.\nRose said the Deepwater Horizon crew had drilled the well to its final depth, more than 18,000 feet, and was cementing the steel casing at the time of the explosion.\n“They did not have a lot of time to evacuate. This would have happened very rapidly,” he said.\nAccording to Transocean’s website, the rig was built in 2001 in South Korea and is designed to operate in water up to 8,000 feet deep, drill 5 1/2 miles down, and accommodate a crew of 130. It floats on pontoons and is moored to the sea floor by several large anchors.\nWorkers typically spend two weeks on the rig at a time, followed by two weeks off. Offshore oil workers typically earn $40,000 to $60,000 a year more if they have special skills.\nWorking on offshore oil rigs is a dangerous job but has become safer in recent years thanks to improved training, safety systems and maintenance, said Joe Hurt, regional vice president for the International Association of Drilling Contractors.\nSince 2001, there have been 69 offshore deaths, 1,349 injuries and 858 fires and explosions in the Gulf, according to the federal Minerals Management Service.\nDespite the long wait for word her husband was safe, Moss said she’s not upset and that the company didn’t want to give bad information.\nShe said her husband has been working in the oil industry most of his life and that even though he tells her it’s safe, she can’t help but worry.\n“I’m a wife and a mother. Of course I worry,” she said.", "url": "https://apnews.com/7914d11149279a44e6b600c57292960d"}