{"authors": [], "date_download": "2020-05-04 20:24:28", "date_modify": "2020-05-04 20:24:28", "date_publish": "2020-04-03 00:39:37", "description": "SYDNEY (AP) — LaMelo Ball’s bid to be a club owner before making his NBA debut isn’t a done deal, yet. Australia’s National Basketball League issued a statement Friday in response to reports...", "filename": "_7462ce1abef88d92455b6bb36f362775_1588623868.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b5d9db8cb9144e4a871f4b08092d988b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7462ce1abef88d92455b6bb36f362775_1588623868.html", "title": "LaMelo Ball's bid to buy club not a done deal", "title_page": "Aussie league: LaMelo Ball's bid to buy club not a done deal", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Nov. 17, 2019, file photo, LaMelo Ball of the Illawarra Hawks carries the ball up during their game against the Sydney Kings in the Australian Basketball League in Sydney. LaMelo Ball's bone bruise on his left foot is expected to keep him out of the Illawarra Hawks lineup for the remainder of the National Basketball League season in Australia. The 18-year-old American, who joined Illawarra as part of the NBL's Next Stars program, is expected to be a first-round pick in this year's NBA draft.(AP Photo/Rick Rycroft, File)\nFILE - In this Nov. 17, 2019, file photo, LaMelo Ball of the Illawarra Hawks carries the ball up during their game against the Sydney Kings in the Australian Basketball League in Sydney. LaMelo Ball's bone bruise on his left foot is expected to keep him out of the Illawarra Hawks lineup for the remainder of the National Basketball League season in Australia. The 18-year-old American, who joined Illawarra as part of the NBL's Next Stars program, is expected to be a first-round pick in this year's NBA draft.(AP Photo/Rick Rycroft, File)\nSYDNEY (AP) — LaMelo Ball’s bid to be a club owner before making his NBA debut isn’t a done deal, yet.\nAustralia’s National Basketball League issued a statement Friday in response to reports overnight that Ball had bought the Illawarra Hawks, the club south of Sydney where he played 12 games last season.\nBall’s business manager, Jermaine Jackson, on Thursday told ESPN: “We own the team. It’s a done deal.”\nThe 18-year-old American, who is expected to be first-round pick in the NBA draft, had an injury-shortened season with the Hawks because of a bone bruise on his left foot.\n“Melo loves the Illawarra fans. He loves that community. They opened their arms to him. They made us feel like we are at home,” Jackson told ESPN. “When we started hearing about the issues they were going through, we talked about it and decided, ‘Let’s own the team.’\n“He is going to be locked into his NBA career, but we are going to hire the right people to oversee everything.”\nThe NBL confirmed Ball and his manager had discussions with the Hawks’ owners while he was in Australia, but “at this point we are continuing to work with current license holder Simon Stratford on a number of options for what we hope will be a fruitful outcome for Illawarra and the NBL.”\n“The NBL has final approval on any transfer of license and no application has been made to date,” the league’s statement said.\nBall joined Illawarra as part of the NBL’s Next Stars program and averaged 17 points, seven assists and seven rebounds in 12 games until December\nHe helped draw big crowds, including a league-record 17,514 for the Hawks’ November game against the Sydney Kings in Sydney.\nBall also donated a month of his salary, which was not disclosed, to a national relief fund in aid of wildfire victims in Australia in January.\n___\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports", "url": "https://apnews.com/7462ce1abef88d92455b6bb36f362775"}