{"authors": ["Ed White"], "date_download": "2020-05-04 20:15:33", "date_modify": "2020-05-04 20:15:33", "date_publish": "2020-04-07 18:10:40", "description": "DETROIT (AP) — A judge has cleared the way for a trial or financial settlement in the case of a Detroit man who spent 25 years in prison before proving that a gun seized from his mother couldn’t...", "filename": "_f73e72197752f751a629ff943c86bb4d_1588623333.html", "image_url": "https://storage.googleapis.com/afs-prod/media/500bbdab93b445e5ba2ae6b9951d79f1/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f73e72197752f751a629ff943c86bb4d_1588623333.html", "title": "Judge: Man wrongly convicted can take Detroit cops to trial", "title_page": "Judge: Man wrongly convicted can take Detroit cops to trial", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this June 1, 2017 file photo, Desmond Ricks listens to Judge Richard Skutt during a hearing in Detroit. A judge has cleared the way for a trial or financial settlement in the case of Ricks who spent 25 years in prison before proving that a gun seized from his mother couldn't have been the murder weapon. (Clarence Tabb Jr./Detroit News via AP, File)\nFILE - In this June 1, 2017 file photo, Desmond Ricks listens to Judge Richard Skutt during a hearing in Detroit. A judge has cleared the way for a trial or financial settlement in the case of Ricks who spent 25 years in prison before proving that a gun seized from his mother couldn't have been the murder weapon. (Clarence Tabb Jr./Detroit News via AP, File)\nDETROIT (AP) — A judge has cleared the way for a trial or financial settlement in the case of a Detroit man who spent 25 years in prison before proving that a gun seized from his mother couldn’t have been a murder weapon.\nU.S. District Judge Paul Borman said retired police sued by Desmond Ricks don’t have immunity in the lawsuit. The case centers on a murder conviction that was overturned in 2017 after students at the University of Michigan law school reopened the case.\nExperts agree that bullets removed from the victim couldn’t have been fired from a Rossi-style handgun owned by Ricks’ mother.\nA 1992 report from the Detroit gun lab “has not simply been impugned,” Borman said last Thursday, “but rather has been indisputably shown to be wrong.”\nThe Associated Press on Tuesday sent an email seeking comment to an attorney for the city.\nRicks claims he was intentionally framed in the fatal shooting of a friend, Gerry Bennett, outside a burger joint. He is seeking more than $100 million. There was no dispute that Ricks was at the Top Hat, but he insisted he had no role in the shooting.\nRicks, 53, was released from prison after 25 years, mostly on the weight of a gun expert’s affidavit. David Townshend said bullets recovered from the victim and discovered in police storage weren’t the ones he examined when he was hired by Ricks’ defense lawyer in ’92.\nOther experts, including one retained by the city during the litigation, also said the bullets couldn’t have come from the type of handgun held up as the murder weapon.\nA jury can determine whether police “intentionally or, at least, recklessly falsified or fabricated the conclusion in their report,” Borman said in a 78-page opinion.\nDuring arguments last fall, a city attorney, Jerry Ashford, denied there was a “grand conspiracy” to pin the murder on Ricks by firing bullets from his mother’s gun and then presenting them as critical evidence.\n“At worse, it’s a mistake in judgment,” Ashford said of the report by the police gun lab. “There’s no malice here.”\nRicks said he hopes the city now negotiates a settlement. Separately, he was awarded $1 million under a state program that compensates the wrongly convicted.\n“There are no more games to be played. Otherwise I’ll let a jury decide,” Ricks said Tuesday.\n___\nFollow Ed White at http://twitter.com/edwhiteap", "url": "https://apnews.com/f73e72197752f751a629ff943c86bb4d"}