{"authors": ["Review Brian Lowry"], "date_download": "2020-05-04 16:55:37", "date_modify": "2020-05-04 16:55:37", "date_publish": "2020-04-09 02:32:42", "description": "After 11 years of family togetherness, \"Modern Family\" wrapped up its Emmy-winning run with perhaps the most obvious set-up -- namely, a string of fairly sudden developments that would scatter the extended clan in different directions.", "filename": "2020_04_08_entertainment_modern-family-finale-review_index_1588611337.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406100729-modern-family-finale-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_entertainment_modern-family-finale-review_index_1588611337.html", "title": "'Modern Family' turns out the lights with a warm, funny series finale", "title_page": "'Modern Family' series finale review: The ABC comedy turns out the lights with warmth and humor - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "The following contains spoilers about the \"Modern Family\" series finale.\n(CNN) After 11 years of family togetherness, \"Modern Family\" wrapped up its Emmy-winning run with perhaps the most obvious set-up -- namely, a string of fairly sudden developments that would scatter the extended clan in different directions.\nThe ABC comedy has, admittedly, been running on fumes a bit the past few seasons, a seemingly inevitable byproduct of hanging around this long. So the writers had some work to do in terms of pulling it all together, offering a finale that was worthy of the show's mix of big, broad laughs and tender, family-oriented heart.\nFor the most part, the show delivered just that, with an hour that highlighted not just the show's legacy, but coming at an unsettling moment when such fare is sorely needed . That included -- in what felt like an homage to \"The Mary Tyler Moore Show\" -- a big group hug, where nobody wanted to be the first to let go.\nEach family faced its own crossroads. After adopting a baby boy, Cam (Eric Stonestreet) got offered his dream job back in Missouri, which would force him and his husband Mitchell (Jesse Tyler Ferguson) to uproot themselves, vacating the new house they just finished lovingly furnishing.\nThe Dunphys, meanwhile, were dealing with a not just full but overflowing house, with all of their now-adult kids still living at home.\nRead More", "url": "https://www.cnn.com/2020/04/08/entertainment/modern-family-finale-review/index.html"}