{"authors": ["Janet Mcconnaughey", "Rebecca Santana"], "date_download": "2020-05-04 20:22:54", "date_modify": "2020-05-04 20:22:54", "date_publish": "2020-04-20 05:20:04", "description": "NEW ORLEANS (AP) — Ten years after a well blew wild under a BP platform in the Gulf of Mexico, killing 11 men and touching off the nation’s worst offshore oil spill, gulf waters sparkle in the...", "filename": "_46127a3fa6f70154c2aaa0d48b83de03_1588623774.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9718bc2bfeed49609d1f0dd347d70a2d/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_46127a3fa6f70154c2aaa0d48b83de03_1588623774.html", "title": "Sparkling waters hide some lasting harm from 2010 oil spill", "title_page": "Sparkling waters hide some lasting harm from 2010 oil spill", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this June 26, 2010 file photo, Plaquemines Parish Coastal Zone Director P.J. Hahn rescues a heavily oiled bird from the waters of Barataria Bay, La., which are laden with oil from the Deepwater Horizon oil spill. Ten years after the nation's biggest offshore oil spill fouled its waters, the Gulf of Mexico sparkles in the sunlight and its fish are safe to eat. But scientists who have spent $500 million dollars from BP researching the impact of the Deepwater Horizon disaster have found much to be concerned about. (AP Photo/Gerald Herbert, File)\nFILE - In this June 26, 2010 file photo, Plaquemines Parish Coastal Zone Director P.J. Hahn rescues a heavily oiled bird from the waters of Barataria Bay, La., which are laden with oil from the Deepwater Horizon oil spill. Ten years after the nation's biggest offshore oil spill fouled its waters, the Gulf of Mexico sparkles in the sunlight and its fish are safe to eat. But scientists who have spent $500 million dollars from BP researching the impact of the Deepwater Horizon disaster have found much to be concerned about. (AP Photo/Gerald Herbert, File)\nNEW ORLEANS (AP) — Ten years after a well blew wild under a BP platform in the Gulf of Mexico, killing 11 men and touching off the nation’s worst offshore oil spill, gulf waters sparkle in the sunlight, its fish are safe to eat, and thick, black oil no longer visibly stains the beaches and estuaries. Brown pelicans, a symbol of the spill’s ecological damage because so many dived after fish and came up coated with oil, are doing well.\nBut scientists who spent the decade studying the Deepwater Horizon spill still worry about its effects on dolphins, whales, sea turtles, small fish vital to the food chain, and ancient corals in the cold, dark depths.\nThe gulf’s ecosystem is so complex and interconnected that it’s impossible to take any single part as a measure of its overall health, said Rita Colwell, who has led the Gulf of Mexico Research Initiative.\nBP put up $500 million for the independent GoMRI program soon after the spill, part of more than $69 billion it says it has spent overall, including spill response, cleanup, settlements, restoration and other costs.\nThe Deepwater Horizon disaster has reshaped the Gulf Coast with a flood of post-spill spending across five states. (April 16)\nSome scientists say the recovery has been remarkable since those dark spring days in 2010, when oil billowing from the sea floor began killing wildlife and blackening marshes and beaches from Texas to Florida.\nEd Overton, a Louisiana State University chemist who has studied oil dispersal since the 1970s, said today’s visitors to Louisiana’s marshes would have to know just where to look to find damage: “So there’s still oil there 10 years later. Is it significant compared to what we saw in 2010? And the answer is not only no, but hell no.”\nBut major concerns remain. Steven A. Murawski , chief scientist of the National Marine Fisheries Service when the well blew, said, “We will see environmental impacts from this for the rest of our lifetimes.”\nHere’s a look at how some key aspects of the ecosystem are doing.\nDOLPHINS AND WHALES\n“Initially, industry experts were saying, ‘The dolphins and the whales, they’re smart. They’re not going to swim into oiled areas,’” recalled Nancy Kinner, co-director of the Coastal Response Research Center and Center for Spills and Environmental Hazards at the University of New Hampshire.\nBut cetaceans must surface to breathe, rising through oil that spread across more than 15,300 square miles (40,000 square kilometers) - nearly as big as Switzerland. Each exhalation vaporized oil and gas into minuscule droplets, which they then inhaled, Kinner said.\nLung disease and other ailments caused by the spill killed more than 1,000 bottlenose dolphins over several years, many of them in Louisiana’s hard-hit Barataria Bay, the National Oceanic and Atmospheric Administration reported. More than one-fifth were aborted, stillborn or died soon after birth. Pregnant Barataria and Mississippi Sound dolphins still give birth far more rarely than in healthy populations. Health checks of Barataria Bay dolphins in 2018 found that lung problems “in some cases ... may be even getting worse,” said Lori Schwacke of the National Marine Mammal Foundation.\nWhales almost certainly suffered similar oil-caused ailments but can’t be safely examined, Schwacke said. NOAA estimated the spill killed 17 percent of the gulf’s Bryde’s whales, declared endangered in 2019 after their population dwindled to fewer than 100. Other whales are suffering, too.\n“The toothed whales, sperm whales, Bryde’s whales, right whales ... these populations which were somewhat in jeopardy prior to the oil spill have been declining 5 or 10% a year ever since the oil spill,” said Ian MacDonald of Florida State University.\nGoing forward, some BP money will go toward improving conditions for dolphins and whales. These include studies on reducing effects of human-produced noise, such as seismic airguns and ship propellers, on whales and dolphins, which communicate and navigate by sound.\nFISH\nHow fisheries would survive was hard to fathom while slicks fouled estuaries where many fish spawn, but scientists haven’t found any widespread species die-offs, said Chuck Wilson, chief science officer for GoMRI.\n“Fisheries in the marshes where the oil came on shore have continued to flourish. Recreational fishing continues to be productive and a very popular activity even in Barataria Bay, Louisiana, where the highest oil impact was,” he said.\nIt’s a different story farther out and deeper down, where small fish feed top food and sport fish such as tuna or grouper, as well as whales. Murawski, now a professor at the University of South Florida and director of a GoMRI consortium, said small fish that live about 660 to 3,300 feet (200 to 1,000 meters) deep seemed to be doing well a year after the spill, but then their numbers plummeted by 60 to 80 percent, and haven’t returned. Because they hadn’t been surveyed before the spill, there’s no way to say whether the drop was caused by the spill or 2011 was an exceptional year and numbers are back to normal, he said.\nLaboratory research has found that oil damaged fish larvae’s developing hearts and bones, MacDonald said.\nFuture restoration projects include plans to get anglers to use equipment that would slowly lower reef fish they don’t keep, rather than simply tossing them back. Another project aims to find the best escape hatches for “bycatch” hauled up in shrimp nets, and persuade shrimpers to use them.\nMARSHES\nThe oil turned tall marsh grass as black as cinders and sank into the muck across Louisiana’s coastal marshes, a nursery for an array of birds and fish.\n“Once all the roots and so on disintegrate, the whole marsh surface, all the soil, is lost. Given the fact that there is rapid sea-level rise and the land is sinking, it’s almost impossible to recover,” said University of Maryland marine scientist Donald Boesch. Oiled marsh shorelines that weren’t lost immediately were more likely to wash away later.\nGoMRI surveys found birds, snails and crabs back at pre-spill densities, Wilson said.\nBut the insects worry Louisiana State University researcher Linda Hooper-Bui. She found that most insect and spider species were back to 68% to 72% of pre-spill populations by 2016, and she was expecting to tell a story of insect recovery on the 10th anniversary.\nThen her funding dried up, but in August 2019, she collected one last round of samples and found surprisingly few insects. “Something is going on right now, and it’s deeply affected,” she said, but she can’t tell what caused it.\nThe vast majority of oiled wetlands were in Louisiana, where officials expect to use more than $7 billion in oil spill money to restore the coast , including marshes and barrier islands.\nDEEP CORAL AND SEA BOTTOM\nFar below the surface, deep-sea corals can live hundreds of years, creating habitats for multitudes of creatures near the bottom of the food web. Because of the BP spill, we also know how they can die.\nSwaths of such coral were killed, and they grow so slowly — only a few millimeters a year — that it’s hard to imagine how they could be replaced, Boesch said. Researchers found that seven years later, affected but surviving coral were less healthy than unoiled reefs.\nBefore the spill, scientists didn’t know that deep-sea corals were severely hurt by oil dispersing in a plume far below the surface. They discovered that rising oil interacts with plankton and then “snows down from the surface and eventually lands,” changing the chemical biology of the sea bed, MacDonald said.\n“So these are things we’ve learned. And none of these are good things,” MacDonald said.\nScientists plan to study these deep habitats more extensively, including mapping the gulf’s seafloor. To protect the fragile corals, money is being spent to develop techniques for growing and transplanting corals and installing buoys in some places to alert trawlers to the corals’ underwater presence.", "url": "https://apnews.com/46127a3fa6f70154c2aaa0d48b83de03"}