{"authors": ["Llazar Semini"], "date_download": "2020-05-04 20:25:22", "date_modify": "2020-05-04 20:25:22", "date_publish": "2020-04-20 17:29:25", "description": "TIRANA, Albania (AP) — Kosovo's acting prime minister on Monday accused a United States envoy of being “directly involved” in toppling his government last month, calling it part of a plan to...", "filename": "_0d9243a8a85b0e411b727e46b7ea6c25_1588623922.html", "image_url": "https://storage.googleapis.com/afs-prod/media/74faaf74050a4134b1e16edb50aa2158/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0d9243a8a85b0e411b727e46b7ea6c25_1588623922.html", "title": "Kosovo PM accuses US envoy involved in his govt' overthrown", "title_page": "Kosovo PM accuses US envoy involved in his govt' overthrown", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE- In this Friday, Jan. 24, 2020 file photo, U.S. President Donald Trump's envoy for the Kosovo-Serbia dialogue, Ambassador Richard Grenell during a press conference after their meeting, in Belgrade, Serbia. Kosovo’s acting prime minister has on Monday, April 20 accused a United States envoy of being “directly involved” in toppling his government last month. He said Grenell is insisting on a final deal in talks between Kosovo and Serbia to score political points. (AP Photo/Darko Vojinovic, file)\nFILE- In this Friday, Jan. 24, 2020 file photo, U.S. President Donald Trump's envoy for the Kosovo-Serbia dialogue, Ambassador Richard Grenell during a press conference after their meeting, in Belgrade, Serbia. Kosovo’s acting prime minister has on Monday, April 20 accused a United States envoy of being “directly involved” in toppling his government last month. He said Grenell is insisting on a final deal in talks between Kosovo and Serbia to score political points. (AP Photo/Darko Vojinovic, file)\nTIRANA, Albania (AP) — Kosovo’s acting prime minister on Monday accused a United States envoy of being “directly involved” in toppling his government last month, calling it part of a plan to achieve a major diplomatic victory in a U.S. election year.\nAlbin Kurti said Richard Grenell, U.S. President Donald Trump’s envoy to the Kosovo-Serbia talks, was involved in splitting Kurti’s party and its partner in the coalition government.\nAfter about 50 days in power, Kurti’s government fell in late March, losing a no-confidence vote initiated by the junior partner, which broke under pressure from Grenell, he said.\nKurti, now heading the government in a caretaker role, was speaking at an online news conference.\n“My government wasn’t overthrown for anything else but simply because Ambassador Grenell is in a rush to sign a deal with Serbia which I strongly believe is harmful since it includes territorial exchange,” he said.\nA spokesman for Grenell — the U.S. ambassador to Germany — did not address the question of whether Grenell had been involved in bringing down the Kosovo government in his response to questions from The Associated Press.\nDick R. Custin referred to a recent tweet by Grenell in which he said there had been “absolutely no talk of land swaps from me.”\nKurti said Grenell had “hijacked” the Kosovo-Serbia dialogue process and “cares very much about the signature at the bottom of the paper not about the text on the paper.”\n“What he needs is a quick deal to show that they can fix crises in the world, perhaps in contrast to Clintons, Bushes and Obama, without any military intervention, and this can be presented as a success in this electoral year,” he said.\nKurti opposes a final deal with Serbia involving a land swap, something that politicians in both countries have said has been discussed behind the scenes for two years by Kosovar President Hashim Thaci and his Serb counterpart, Aleksandar Vucic.\n“I am ready to discuss about needs of the communities, rights of the citizens but not about territorial exchange,” said Kurti.\nKosovo was part of Serbia until an armed uprising by the ethnic Albanian majority population in 1998-1999 triggered a bloody Serb crackdown. This in turn prompted a NATO bombing campaign against Serbia to force its troops out of Kosovo.\nBelgrade refuses to recognize Kosovo’s 2008 declaration of independence.\nKurti has lifted a 100% tariff on Serb goods that was imposed by Kurti’s predecessor in November 2018 in a bid to put pressure on Serbia, which is blocking Kosovo’s international recognition and preventing it from joining international organizations.\nKurti said Kosovar authorities now require that Serb goods are certified for quality, a requirement already in place for Kosovar products shipped to Serbia.\nSince the start of the EU-facilitated talks in 2011, 33 deals have been signed to ensure the countries recognize each other in areas such as education and professional degrees.\nKosovo claims Serbia has not fulfilled its side of the agreements. Kosovo recognizes diplomas from Serbian universities, but Serbia does not accept the degrees of Kosovar university graduates. That is also the case with drivers’ licenses.\nKurti has said the government will monitor whether Serbia moves toward reciprocity by June 15, and if not, the tariffs will be restored.", "url": "https://apnews.com/0d9243a8a85b0e411b727e46b7ea6c25"}