{"authors": [], "date_download": "2020-05-04 20:09:09", "date_modify": "2020-05-04 20:09:09", "date_publish": "2020-04-09 21:30:06", "description": "PORTLAND, Ore. (AP) — Although Oregon’s mountain snow accumulation started slowly this season, the snowpack now appears to be in good shape. Recent snowstorms have lifted the state’s overall...", "filename": "_0ef118cbc1194a7277611090c53d773c_1588622949.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0ef118cbc1194a7277611090c53d773c_1588622949.html", "title": "Oregon's overall average snowpack 109% of normal", "title_page": "Oregon's overall average snowpack 109% of normal ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Ore. (AP) — Although Oregon’s mountain snow accumulation started slowly this season, the snowpack now appears to be in good shape.\nRecent snowstorms have lifted the state’s overall average snowpack to 109% of normal as of April 8, compared to 91% of normal at the beginning of March, according to the USDA Natural Resources Conservation Service.\nThe highest totals are in Eastern Oregon, the Capital Press reported .\nThe Willamette Valley — home of 60% of Oregon’s population and nearly half its gross farm sales — is also above average for snow, at 110% of normal.\nAgriculture relies on snowpack to act as a natural reservoir into the spring and summer, gradually replenishing streams and filling reservoirs used to water crops and livestock.\nSnowpack in Oregon got off to a slow start in November and December before rebounding significantly in January. February and early March brought another round of warmer and drier weather, which turned to snow again by month’s end.\nScott Oviatt, snow survey supervisor for NRCS Oregon, said snowpack typically peaks in April and May across the state. “The key,” he said, “is going to be how quickly or rapidly that snowmelt runs off.”\n“We don’t want it to come out in a sudden flush, with warm temperatures or rain on snow,” Oviatt said.\nThat sudden flush was felt especially hard earlier this year, when those conditions contributed to massive flooding on the Umatilla and Walla Walla rivers in northeast Oregon and southeast Washington, damaging farms and homes.\nDespite relatively strong snowpack, the optimism is tempered by lower-than-normal total precipitation, Oviatt said, which remains at 80% statewide.\nThe driest areas are in southwest Oregon. Gov. Kate Brown has already declared a drought emergency in Klamath County.\nThere is still time for areas facing water shortages to recover, Oviatt said.\n“We’re not necessarily in complete dire straits, but time is running out,” he said.", "url": "https://apnews.com/0ef118cbc1194a7277611090c53d773c"}