{"authors": ["Keith Ridler"], "date_download": "2020-05-04 20:25:56", "date_modify": "2020-05-04 20:25:56", "date_publish": "2020-04-07 22:02:07", "description": "BOISE, Idaho (AP) — A plan to help in the battle against devastating wildfires creates fuel breaks 400 feet (120 meters) wide along 987 miles (1,600 kilometers) of roads in southwestern Idaho and...", "filename": "_3c4449a5e26445991ef4055e3668a61e_1588623956.html", "image_url": "https://storage.googleapis.com/afs-prod/media/3289550123a14ea1a7ab910d4aa4f43a/1939.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3c4449a5e26445991ef4055e3668a61e_1588623956.html", "title": "Wildfire fighting plan eyes 1,000 miles of new fuel breaks", "title_page": "Wildfire fighting plan eyes 1,000 miles of new fuel breaks", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE- In this April 26, 2013, file photo, male sage grouse inflate their chests and make their unique noises in the desert near Millican, Ore. The U.S. Bureau of Land Management on Friday, April 3, 2020, released a final environmental impact statement for the Tri-State Fuel Breaks Project, opening a 30-day comment period. The agency says fuel breaks will help firefighters stop wildfires and protect key habitat for sage grouse and other wildlife on land also used by cattle ranchers. (Rob Kerr/The Bulletin via AP, File)\nFILE- In this April 26, 2013, file photo, male sage grouse inflate their chests and make their unique noises in the desert near Millican, Ore. The U.S. Bureau of Land Management on Friday, April 3, 2020, released a final environmental impact statement for the Tri-State Fuel Breaks Project, opening a 30-day comment period. The agency says fuel breaks will help firefighters stop wildfires and protect key habitat for sage grouse and other wildlife on land also used by cattle ranchers. (Rob Kerr/The Bulletin via AP, File)\nBOISE, Idaho (AP) — A plan to help in the battle against devastating wildfires creates fuel breaks 400 feet (120 meters) wide along 987 miles (1,600 kilometers) of roads in southwestern Idaho and southeastern Oregon that will be tied into an existing fuel break system in northern Nevada.\nThe U.S. Bureau of Land Management on Friday released a final environmental impact statement for the Tri-State Fuel Breaks Project, opening a 30-day comment period. The plan involves treating about 65 square miles (168 square kilometers).\nThe agency said creating fuel breaks by clearing vegetation will help firefighters stop wildfires and protect key habitat for sage grouse and other wildlife on land also used by cattle ranchers and outdoor enthusiasts.\n“Because of the area’s remoteness, high potential for large wildfires, long firefighter response time, and limited sites for firefighters to establish safe anchor points to engage wildfires, strategic measures must be taken to protect one of the last remaining large, contiguous sage grouse habitats,” the agency wrote in the 177-page document.\nCreating fuel breaks would be accomplished with mowing, seeding less-flammable plants, herbicide, prescribed fire and targeted grazing by cattle.\n“In general, the ranchers are supportive of it because they want to try to help stop large fires in the future,” said Steve Stuebner, spokesman for the Idaho Rangeland Resource Commission.\nScott Lake of Western Watersheds Project said the fuel breaks create disturbed areas and ideal conditions for invasive, fire-prone plants.\n“There’s a serious potential to make this fire situation worse by making a corridor for these weeds to travel and spread,” he said, adding the primary goal should be the elimination of the invasive species.\nThe bureau’s plan falls between other options of doing nothing and more aggressive actions that included 1,500 miles (2,400 kilometers) of fuel breaks. The chosen plan, for example, results in 25% fewer sage grouse leks within the fuel breaks.\nLeks are breeding grounds for greater sage grouse, and the area contains one of the largest strongholds for the bird in the northern Great Basin. But the region faces wildfire threats from invasive annual grasses, notably fire-prone cheatgrass. Cheatgrass is an annual that quickly returns, while native, slow-growing sagebrush can take decades to recover.\nFederal officials in 2015 declined to list sage grouse as needing protection under the Endangered Species Act.\nThe Idaho Department of Fish and Game said that in 2019 sage grouse numbers in the state have dropped more than 50% since 2015. In Oregon, bird numbers last year reached their lowest number — 14,000 — since reliable estimates have been recorded beginning in 1996, according to the Oregon Department of Fish and Wildlife.\nGiant wildfires have impacted the bird’s habitat. In the last decade, the area has seen repeated giant rangeland wildfires up to 870 square miles (2,250 square kilometers). The bureau said that at least five of the wildfires, mainly fueled by cheatgrass, burned more than 150 square miles (390 square kilometers) in the first 24 hours.", "url": "https://apnews.com/3c4449a5e26445991ef4055e3668a61e"}