{"authors": ["Kathryn Vasel", "Cnn Business"], "date_download": "2020-05-04 16:26:50", "date_modify": "2020-05-04 16:26:50", "date_publish": "2020-04-07 15:48:15", "description": "Many workers have taken on new roles recently: remote worker, caregiver and teacher.", "filename": "2020_04_07_success_work-from-home-productivity-multitask_index_1588609610.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407070512-20200407-stay-at-home-gfx-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_success_work-from-home-productivity-multitask_index_1588609610.html", "title": "Work. Kids. A global pandemic. Six tips from experts on how to handle it all", "title_page": "Work. Kids. A global pandemic. Six tips from experts on how to handle it all  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Many workers have taken on new roles recently: remote worker, caregiver and teacher.\nWith most of the country under stay-at-home orders , workers are trying to juggle all their new demands -- all at the same time.\nExpectations will need to be set a little lower under these extraordinary circumstances.\nHere's how to best handle all the demands:\nIdentify your 'must dos'\nYou aren't going to be able to get as much done as you did in the office, which is why you need to prioritize which tasks need to be completed by the end of the day and then figure out the best way to tackle them.\nIf you know a \"must-do\" task requires quiet time, look for ways to create that time.\nFor instance, Laura Vanderkam, author of \"Off the Clock: Feel Less Busy While Getting More Done\" records her podcasts in the morning before her kids wake up.\n\"It's the only time that is quiet,\" she said. \"I don't do things like clean out my inbox at that time because that would be a total waste. I can delete emails when my kids are asking me to help them troubleshoot Zoom classes for school, but I can't record during that time.\"\nEllen Faye, a productivity and leadership coach, recommended creating four buckets to help manage your priorities: critical (must do today), hot (needs to be done in the next few days), soon (not critical, but should be done soon), and later (the least important tasks).\nTo help determine where a task should land, she suggested asking yourself questions like: Am I going to let myself or someone else down if this doesn't get done? Will I miss a deadline or will it cost me money?\nTake note of when you are most productive (for many people it's in the morning) and try and tackle the most important or involved tasks during that time.\nMultitask strategically\nMultitasking often gets a bad rap, but it can be useful if you do it strategically.\nIt's unproductive to try to do two complex tasks at the same time, like writing a report for work and helping your kid with science homework. But you might have more success tackling two things if one of the activities is more mindless.\nFor instance, listening in on a conference call while folding laundry or unloading the dishwasher.\n\"You can't be thinking about two things at once,\" said Faye. \"You can't be solving two problems at once.\"\nGroup similar tasks together\nIf you know you have a bunch of phone calls to make or expense reports to fill out, don't spread them out throughout the day, said Kathryn McKinnon, a time management expert.\nBlock off a time where you knock them out all at once.\n\"Your mind works more efficiently when you do several of the same type of tasks right after another instead of switching,\" said McKinnon.\nGo all in with the kids\nIt's hard to focus when a child is begging you to play a game or read a book. It's time to give in and spend some undivided time with them.\n\"They will pester all morning to play Candy Land. If you bite the bullet and play it you can buy yourself some peace for a while,\" said Vanderkam. \"Often, it doesn't take that much undivided attention to make them happy for awhile.\"\nGoing outside (safely, of course) and letting them get out a little energy can also be a boon to your productivity.\n\"Getting some active time in early can tire them out and maybe they'll be more content to do quiet things later and you can get some work done,\" said Vanderkam.\nStart delegating\nNow's the time to start looking at your to-do list and see who else might be able to cross some items off.\n\"Use your executive skills to delegate family chores to other family members instead of thinking they all have to be done by you,\" said McKinnon.\nGive yourself a break\nHere's the thing: the demands on your time have increased dramatically, but there are still only 24 hours in a day.\nSome things aren't going to get done, and that's okay.\nWhile some tasks will slip, take the time for self care, whether that means hopping on a call with a friend, watching your favorite show or getting some quiet alone time.\n\"You won't be successful in getting anything done if you don't focus on yourself a little,\" said McKinnon. \"Trying to at least get some sleep and eat well, and having a sense of physical, spiritual and mental wellness is really important. If you don't take care of yourself you will be no good to anyone else.\"", "url": "https://www.cnn.com/2020/04/07/success/work-from-home-productivity-multitask/index.html"}