{"authors": [], "date_download": "2020-05-04 20:21:40", "date_modify": "2020-05-04 20:21:40", "date_publish": "2020-04-10 23:08:20", "description": "FORT LAUDERDALE, Fla. (AP) — A man died shortly after a confrontation with deputies at a Florida airport, officials said. Kevon Todd, 29, was pronounced dead Thursday morning at a Fort...", "filename": "_919192424674064f36b912523bd78609_1588623700.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_919192424674064f36b912523bd78609_1588623700.html", "title": "Man dies after fight with deputies at Florida airport", "title_page": "Man dies after fight with deputies at Florida airport", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Man dies after fight with deputies at Florida airport\nFORT LAUDERDALE, Fla. (AP) — A man died shortly after a confrontation with deputies at a Florida airport, officials said.\nKevon Todd, 29, was pronounced dead Thursday morning at a Fort Lauderdale hospital, according to a Broward County Sheriff’s Office news release.\nDeputies at the Fort Lauderdale-Hollywood International Airport stopped Todd several hours earlier as he attempted to breach a security checkpoint, authorities said. He had been yelling at JetBlue staff members before he rushed the security area, officials said. Deputies said Todd had seemed irrational, but it wasn’t clear what caused the condition.\nAfter a physical struggle, deputies detained Todd and brought him to the front of the terminal. Broward Sheriff Fire Rescue was evaluating Todd when he became unresponsive, the release said. Rescue workers began life-saving measures and transported Todd to the hospital, where he died.\nThe Broward County Medical Examiner’s Office will perform an autopsy to determine an official cause of death.\nDeputies involved in the struggle sustained minor injuries. Homicide detectives continue to investigate.", "url": "https://apnews.com/919192424674064f36b912523bd78609"}