{"authors": ["Dr. Sanjay Gupta", "Cnn Chief Medical Correspondent"], "date_download": "2020-05-04 16:59:13", "date_modify": "2020-05-04 16:59:13", "date_publish": "2020-04-08 23:47:33", "description": "Charlotte Figi changed the world. She certainly changed my world and my mind. She opened my eyes to the possibility of cannabis being a legitimate medicine. She showed me that it worked to stop her crippling seizures, and that it was the only thing that worked.", "filename": "2020_04_08_health_sanjay-gupta-weed-charlotte-figi-tribute_index_1588611553.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409145416-sanjay-gupta-charlotte-figi-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_health_sanjay-gupta-weed-charlotte-figi-tribute_index_1588611553.html", "title": "Dr. Sanjay Gupta remembers Charlotte Figi, the little girl who changed the world", "title_page": "Dr. Sanjay Gupta remembers Charlotte Figi, the little girl who changed the world - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) For the last 20 years, I have straddled the world of medicine and journalism. Many times along the way, I worried that my personality was not suited for either. Both expose you to tremendous joy and inspiration, but can also take you to the depths of despair and sadness.\nAll along, you are asked to maintain an objective arm's-length from the emotional pain and suffering of those around you. Do your best work, we are told, but don't get too close. The problem is that I often dive in headfirst, and not only do I get close, I embrace and hold tight. Such was the case with sweet Charlotte Figi.\nCharlotte changed the world. She certainly changed my world and my mind. She opened my eyes to the possibility of cannabis being a legitimate medicine. She showed me that it worked to stop her crippling seizures, and that it was the only thing that worked. She was proof that withholding a medication, even one that comes in the form of a plant, would be as much a moral failing as a medical one. She set me on a journey throughout the world to visit the scientists, the researchers and the countless patients just like her. She inspired me to dig deeper and not simply dismiss this plant as I had done in the past. She made me smarter, more informed and more thoughtful.\nCharlotte Figi walks near medical marijuana known as Charlotte's Web in 2014.\nCharlotte Figi was more than an individual, she was an entire movement wrapped up into a sweet girl with a big smile and an even bigger heart.\nYes, I got close. It's hard not to when her mother, Paige, described holding baby Charlotte and feeling her seize every few minutes, wondering if this would be the last movement she would ever sense from her daughter. Yes, I embraced, when I saw Charlotte healthy, and she took me by the hand, walking me around a holiday party in Colorado. Yes, I held tight. Paige reminded me that I once asked to turn off the camera during an interview because my tears flowed too freely and my heart ached at the injustice being heaped on this little girl.\nRead More", "url": "https://www.cnn.com/2020/04/08/health/sanjay-gupta-weed-charlotte-figi-tribute/index.html"}