{"authors": [], "date_download": "2020-05-04 16:16:44", "date_modify": "2020-05-04 16:16:44", "date_publish": "2020-04-03 20:12:20", "description": null, "filename": "2020_04_03_cnn-underscored_how-to-work-from-home-outbrain-2_index_1588609004.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200310112400-wfhlead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored_how-to-work-from-home-outbrain-2_index_1588609004.html", "title": "Everything you need to comfortably work from home", "title_page": "Everything you need to comfortably work from home - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Working from home definitely has its perks: No stressful commute, the ability to spend the day in your comfiest sweats and avoid potentially sick co-workers, and the option to work outside or at a local coffee shop (weather and Wi-Fi permitting, of course).\nBut aside from some of the obvious positives, we understand that working from home is not for everyone: Distractions (like pets and television) or not having a proper desk or home office to work from can contribute to an unproductive work day.\nIf you do find yourself working from home in the near future, or decide to make the change from an office to a home office, it's important to make your space as comfortable, clean and functional as possible.\nTo help get you started, we've rounded up 23 of our favorite tech, home and organizational items to shop to make working from home as easy (and comfortable) as possible. From a four-port USB charging station to a cozy heated blanket, there's something for everyone. Scroll down to check them out now and get ready for your most productive work days yet.\nMind Reader Adjustable 8 Position Laptop Desk ($16.01; amazon.com)\nMind Reader Adjustable 8 Position Laptop Desk\nNo desk? No problem. This portable laptop desk adjusts into eight positions to help ease back and neck pain while you're working from a couch, car or anywhere in your home. Plus, it's complete with a cushioned bolster pillow for additional support, comfort, and stability. _______________________________________________________________________________\nHamilton Beach Breakfast Sandwich Maker ($24.99, originally $29.99; amazon.com)\nHamilton Beach Breakfast Sandwich Maker\nBreakfast is the most important meal of the day, and this easy-to-use breakfast sandwich maker will have your custom sandwich ready in just five minutes.\n______________________________________________________________________________\nTozo T10 Bluetooth 5.0 Wireless Earbuds with Wireless Charging Case ($39.99; amazon.com)\nTozo T10 Bluetooth 5.0 Wireless Earbuds with Wireless Charging Case\nCalling in to a meeting from home? Allow yourself to go hands-free with a pair of wireless earbuds. With nearly 21,000 5-star customer reviews, these Tozo Bluetooth wireless earbuds are top-notch and only a fraction of the price of Apple AirPods.\n_______________________________________________________________________________\nHerschel Supply Co. Anchor 13-Inch MacBook Sleeve ($40; nordstrom.com)\nHerschel Supply Co. Anchor 13-Inch MacBook Sleeve\nWhether you're working at home or from a local coffee shop, protecting your laptop is a must.\n_______________________________________________________________________________\nNordstrom at Home Kennebunk Bliss Plush Throw ($39.50; nordstrom.com)\nNordstrom at Home Kennebunk Bliss Plush Throw\nWorking from home basically requires a supersoft throw blanket to keep you warm and comfortable, and this Kennebunk Bliss plush throw will do just that.\n_______________________________________________________________________________\nDotted Line Gus Bamboo Desk Organizer ($25.99, originally $39.99; wayfair.com)\nWayfair Dotted Line Gus Bamboo Desk Organizer\nKeep your notes, paperwork and office supplies organized and tidy with this bamboo desk organizer. Complete with two drawers and six open compartments, it will keep your space neat and clean so you can focus on your tasks ahead.\n_______________________________________________________________________________\nBlack + Decker 12-cup Programmable Coffee Maker ($29.99; amazon.com)\nBlack + Decker 12-cup Programmable Coffee Maker\nIf you're a coffee person, this 12-cup programmable coffee maker is going to be your best friend while working from home. Set it the night before and wake up to the smell of freshly brewed coffee to get your day started in the best possible way.\n_______________________________________________________________________________\nEmber Temperature Control Smart Mug 2 ($99.95; amazon.com)\nEmber Temperature Control Smart Mug 2\nPair this smart mug with the Ember app to control all settings and functions from your phone, so no matter where you're working in your home, your coffee or tea is hot and ready to sip.\n_______________________________________________________________________________\nMr. Coffee Mug Warmer ($9.89, originally $10.99; amazon.com)\nMr. Coffee Mug Warmer\nIf you're looking for a more simple (and affordable) coffee mug warmer that will do the trick without an app, this Mr. Coffee mug warmer is under $10 and boasts over 4,500 5-star customer ratings.\n_______________________________________________________________________________\nMirabelle Deskpad ($16; anthropologie.com)\nAnthropologie Mirabelle Deskpad\nKeep your day and thoughts organized with this stylish desk pad.\n_______________________________________________________________________________\nMirabelle Journal ($20; anthropologie.com)\nMirabelle Journal\nAnd don't forget this stylish journal to match the desk pad above, so you can jot down notes when calling in to a meeting.\n_______________________________________________________________________________\nCosta Farms Clean Air 3-Pack O2 for You Live House Plant Collection ($28.99; amazon.com)\nCosta Farms Clean Air 3-Pack O2 for You Live House Plant Collection\nNot only are they aesthetically pleasing, but plants in your work space can help to filter indoor pollutants and create a healthy breathing environment.\n_______________________________________________________________________________\nSimicore 4-Port USB Charging Station ($27.99, originally $29.99; amazon.com)\nSimicore 4-Port USB Charging Station\nDeclutter your cords once and for all with this USB charging station. It has four slots and four USB ports that can hold and charge up to four devices simultaneously, and it works with just about any and every device.\n_______________________________________________________________________________\nDotted Line Holden Wall Mounted Calendar Board ($53.99; wayfair.com)\nWayfair Dotted Line Holden Wall Mounted Calendar Board\nKeep on top of your deadlines and meetings with this simple and easy-to-hang dry-erase calendar board.\n_______________________________________________________________________________\nHydro Flask 32-Ounce Wide Mouth Cap Bottle ($44.95; nordstrom.com)\nHydro Flask 32-Ounce Wide Mouth Cap Bottle\nStay hydrated throughout the day with this 32-ounce BPA- and phthalate-free Hydro Flask water bottle. This insulated water bottle keeps liquids hot for up to six hours and cold for up to 24 hours and comes in 10 fun colors.\n_______________________________________________________________________________\nLinenspa Shredded Foam Pillow ($33.99, originally $39.99; amazon.com)\nLinenspa Shredded Foam Pillow\nWith nearly 2,000 5-star customer ratings, this foam reading pillow is ideal for working from home in comfort and provides extra back support for long work hours.\n_______________________________________________________________________________\nMophie Powerstation Mini Portable Charger ($39.95; nordstrom.com)\nMophie Powerstation Mini Portable Charger\nThe Mophie Powerstation Mini portable charger is a sleek and convenient source of phone power on the go. Whether you're working outside or from a Starbucks, you can count on your phone being fully charged.\n_______________________________________________________________________________\nSerene House Ultrasonic Cool Mist Aromatherapy Diffuser ($39.99; nordstrom.com)\nSerene House Ultrasonic Cool Mist Aromatherapy Diffuser\nKeep your office or home refreshed with this cool mist aromatherapy diffuser. It's easy to use and looks chic in any space.\n_______________________________________________________________________________\nMaxKare Electric Blanket Heated Throw ($41.99, originally $69.99; amazon.com)\nMaxKare Electric Blanket Heated Throw\nIf you're really looking to get comfy while you work, this heated throw blanket is a must-have. It's supersoft and machine-washable with an extra long cable and four heat levels.\n_______________________________________________________________________________\nUgg Genuine Shearling Slippers ($119.95; nordstrom.com)\nUgg Genuine Shearling Slippers\nA pair of cozy slippers is essential not just for working at home, but in life, and you can't get much more comfortable than this pair of classic Ugg slippers.\n_______________________________________________________________________________\nBlack + Decker Handheld Vacuum ($42.99; amazon.com)\nBlack + Decker Handheld Vacuum\nAs mentioned, a tidy space is one key to productivity. Cleaning up paper scraps and crumbs is a cinch with this handheld vacuum.\n_______________________________________________________________________________\nDotted Line Cady Vintage Mount Office File and Letter Holder Wall Organizer ($38.99, originally $44.99; wayfair.com)\nWayfair Dotted Line Cady Vintage Mount Office File and Letter Holder Wall Organizer\nNo one likes working in the middle of a mess, especially in a smaller space. Keep your office supplies organized and out of the way with these vintage-looking hanging baskets.\n_______________________________________________________________________________\nSnailax Memory Foam Massage Seat Cushion ($56.99, originally $60.99; amazon.com)\nSnailax Memory Foam Massage Seat Cushion\nBecause our obsession with comfort knows no boundaries, this memory foam massage seat cushion makes the list. Complete with five program levels and four vibration levels, this heated seat cushion provides the ultimate comfort for your home office chair.\n_______________________________________________________________________________\nPhoneSoap 3 UV Smartphone Sanitizer & Universal Charger ($79.95; phonesoap.com)\nPhoneSoap 3 UV Smartphone Sanitizer & Universal Charger\nYou can never keep your smartphone too clean, especially if you're constantly using it for work. Enter: the PhoneSoap 3 UV smartphone sanitizer, which blasts your phone with UV light to kill up to 99.99% of bacteria living on it.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/how-to-work-from-home-outbrain-2/index.html"}