{"authors": [], "date_download": "2020-05-04 20:14:09", "date_modify": "2020-05-04 20:14:09", "date_publish": "2020-02-03 07:17:27", "description": "Today in History Today is Monday, Feb. 3, the 34th day of 2020. There are 332 days left in the year. Today's Highlight in History:", "filename": "_fbce2f61fc8d4dd9bb49e6b965246d1a_1588623249.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fbce2f61fc8d4dd9bb49e6b965246d1a_1588623249.html", "title": "Today in History", "title_page": "Today in History", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Today in History\nToday is Monday, Feb. 3, the 34th day of 2020. There are 332 days left in the year.\nToday’s Highlight in History:\nOn Feb. 3, 1943, during World War II, the U.S. transport ship SS Dorchester, which was carrying troops to Greenland, sank after being hit by a German torpedo in the Labrador Sea; of the more than 900 men aboard, only some 230 survived. (Four Army chaplains on board gave away their life jackets to save others and went down with the ship.)\nOn this date:\nIn 1690, the first paper money in America was issued by the Massachusetts Bay Colony to finance a military expedition to Canada.\nIn 1877, the song “Chopsticks,” written by 16-year-old Euphemia Allen under the pseudonym Arthur de Lulli, was deposited at the British Museum under the title “The Celebrated Chop Waltz.”\nIn 1913, the 16th Amendment to the U.S. Constitution, providing for a federal income tax, was ratified.\nIn 1917, the United States broke off diplomatic relations with Germany, the same day an American cargo ship, the SS Housatonic, was sunk by a U-boat off Britain after the crew was allowed to board lifeboats.\nIn 1930, the chief justice of the United States, William Howard Taft, resigned for health reasons. (He died just over a month later.)\nIn 1959, rock-and-roll stars Buddy Holly, Ritchie Valens and J.P. “The Big Bopper” Richardson died in a small plane crash near Clear Lake, Iowa.\nIn 1966, the Soviet probe Luna 9 became the first manmade object to make a soft landing on the moon.\nIn 1969, “Candid Camera” creator Allen Funt and his family were aboard an Eastern Airlines flight that was hijacked to Cuba. (Fellow passengers who recognized Funt thought the whole thing was a stunt for his TV show.)\nIn 1988, the U.S. House of Representatives handed President Ronald Reagan a major defeat, rejecting his request for $36.2 million in new aid to the Nicaraguan Contras by a vote of 219-211.\nIn 1991, the rate for a first-class postage stamp rose to 29 cents.\nIn 1994, the space shuttle Discovery lifted off, carrying Sergei Krikalev (SUR’-gay KREE’-kuh-lev), the first Russian cosmonaut to fly aboard a U.S. spacecraft.\nIn 1998, Texas executed Karla Faye Tucker, 38, for the pickax killings of two people in 1983; she was the first woman executed in the United States since 1984. A U.S. Marine plane sliced through the cable of a ski gondola in Italy, causing the car to plunge hundreds of feet, killing all 20 people inside.\nTen years ago: A suicide bomber killed seven people in northwestern Pakistan, including three U.S. soldiers. Motivational speaker James Arthur Ray was arrested on manslaughter charges after three people died following a northern Arizona sweat lodge ceremony he’d led in Oct. 2009. (Ray was convicted of three counts of negligent homicide and spent nearly two years in prison.) Actress Frances Reid, 95, died in Los Angeles.\nFive years ago: An evening rush-hour commuter train with 750 people aboard slammed into a SUV at a crossing in Valhalla, New York, killing the vehicle’s driver and six people on the train. A video released on militant websites purportedly showed a Jordanian pilot who was captured by the Islamic State group being burned to death.\nOne year ago: In the lowest-scoring Super Bowl ever, featuring just one touchdown, the New England Patriots beat the Los Angeles Rams, 13-3. Grammy-nominated rapper 21 Savage was arrested in Georgia by immigration authorities, who said it was a targeted operation over his expired visa; the rapper is a British citizen who moved to the U.S. when he was 7. (21 Savage spent 10 days in a detention center in southern Georgia before being released.) The wreckage of the plane carrying soccer player Emiliano Sala was located two weeks after it disappeared from radar over the English Channel; Sala and the pilot were both killed.\nToday’s Birthdays: Former Sen. Paul Sarbanes, D-Md., is 87. Football Hall of Famer Fran Tarkenton is 80. Actress Bridget Hanley is 79. Actress Blythe Danner is 77. Football Hall of Famer Bob Griese is 75. Singer-guitarist Dave Davies (The Kinks) is 73. Singer Melanie is 73. Actress Morgan Fairchild is 70. Actress Pamela Franklin is 70. Actor Nathan Lane is 64. Rock musician Lee Ranaldo (Sonic Youth) is 64. Actor Thomas Calabro is 61. Rock musician/author Lol Tolhurst (The Cure) is 61. Actor-director Keith Gordon is 59. Actress Michele Greene is 58. Country singer Matraca (muh-TRAY’-suh) Berg is 56. Actress Maura Tierney is 55. Actor Warwick Davis is 50. Actress Elisa Donovan is 49. Reggaeton singer Daddy Yankee is 44. Actress Isla (EYE’-luh) Fisher is 44. Musician Grant Barry is 43. Human rights activist Amal Clooney is 42. Singer-songwriter Jessica Harp is 38. Actor Matthew Moy is 36. Rapper Sean Kingston is 30. Actor Brandon Micheal (cq) Hall is 27.\nThought for Today: “Your friend will argue with you.” — Alexander Solzhenitsyn, Russian writer (1918-2008).\nCopyright 2020, The Associated Press. All rights reserved.", "url": "https://apnews.com/fbce2f61fc8d4dd9bb49e6b965246d1a"}