{"authors": [], "date_download": "2020-05-04 20:19:21", "date_modify": "2020-05-04 20:19:21", "date_publish": "2020-04-14 23:31:34", "description": "WATERLOO, Iowa (AP) — An Iowa mayor on Tuesday named a fired Texas police chief to take on the same role for the city of Waterloo. Mayor Quentin Hart tapped Joel Fitzgerald to be Waterloo's...", "filename": "_7069d36c65a2d5cb3d45b6fc81298fe8_1588623561.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7069d36c65a2d5cb3d45b6fc81298fe8_1588623561.html", "title": "Fired Texas police chief tapped for job in Waterloo, Iowa", "title_page": "Fired Texas police chief tapped for job in Waterloo, Iowa", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WATERLOO, Iowa (AP) — An Iowa mayor on Tuesday named a fired Texas police chief to take on the same role for the city of Waterloo.\nMayor Quentin Hart tapped Joel Fitzgerald to be Waterloo’s next police chief, The Courier reported .\nHart told the newspaper that Fitzgerald stood out because of his “level of education, professional experience, and success in implementing community problem solving, the use of intelligence-led policing, and enacting evidence-based strategies to abate crime.”\nIf the city council ratifies Fitzgerald next week, he’ll be Waterloo’s first black police chief.\nFitzgerald was fired from his job as Fort Worth, Texas police chief last year following an incident in Washington, D.C. that city officials had said brought his “judgment and leadership” into question.\nThe Fort Worth Star-Telegram reported that he got into a heated confrontation with a Texas union leader after it was discovered that Fitzgerald wasn’t a local union member. Fitzgerald denied acting unprofessionally.\nFitzgerald had applied to be Baltimore’s police chief, and the city’s then mayor named Fitzgerald as her nominee for police commissioner in 2018.\nBut Fitzgerald abruptly withdrew from consideration after The Baltimore Sun reported that his resume overstated some achievements from his tenure in Fort Worth.\nFitzgerald now serves as the Philadelphia Sheriff’s Office’s chief deputy.", "url": "https://apnews.com/7069d36c65a2d5cb3d45b6fc81298fe8"}