{"authors": [], "date_download": "2020-05-04 20:05:10", "date_modify": "2020-05-04 20:05:10", "date_publish": "2020-04-07 01:54:36", "description": "LAPLACE, La. (AP) — Authorities in Louisiana said a second man has been arrested in connection with the weekend kidnapping and fatal shooting of a woman in the great New Orleans area. Kevin...", "filename": "_f3ae4c803232b3879d55595fa1db4a09_1588622710.html", "image_url": "https://storage.googleapis.com/afs-prod/media/5657db08606448ebb7efd92242222932/2000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f3ae4c803232b3879d55595fa1db4a09_1588622710.html", "title": "Sheriff: 2nd arrest in connection with kidnapping, killing", "title_page": "Sheriff: 2nd arrest in connection with kidnapping, killing", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This undated photo provided by the St. John the Baptist Parish Sheriff's Office shows Corrie Wallace. Authorities in Louisiana said Wallace kidnapped a woman and fatally shot her when she escaped. He was charged Monday, April 6, 2020, with first-degree murder in the death of 25-year-old Ja'Riel Sam. (St. John the Baptist Parish Sheriff's Office via AP)\nThis undated photo provided by the St. John the Baptist Parish Sheriff's Office shows Corrie Wallace. Authorities in Louisiana said Wallace kidnapped a woman and fatally shot her when she escaped. He was charged Monday, April 6, 2020, with first-degree murder in the death of 25-year-old Ja'Riel Sam. (St. John the Baptist Parish Sheriff's Office via AP)\nLAPLACE, La. (AP) — Authorities in Louisiana said a second man has been arrested in connection with the weekend kidnapping and fatal shooting of a woman in the great New Orleans area.\nKevin Hollinger, 36, was arrested Monday and charged with being a principal to first-degree murder, The New Orleans Advocate/The Times-Picayune reported.\nSt. John the Baptist Parish Sheriff Mike Tregre said Hollinger knew what Corrie Wallace, 37, had planned when Wallace kidnapped 25-year-old Ja’Riel Sam, who was later found fatally shot in the head.\nWallace turned himself in Monday and was charged with first-degree murder.\nTregre said Sam and Wallace were acquaintances. The sheriff said Wallace attacked the woman on Sunday morning at her apartment in LaPlace and later put her in the trunk of her own car, leaving her 4-year-old home alone. LaPlace is a community west of New Orleans.\nSam managed to open the trunk and jump out and ran, scraping herself on the knees, legs and elbows as she tried to flee, Tregre said. But Wallace also jumped out of the moving car and caught up to the woman, later shooting her in the head, according to the sheriff.\nDeputies later identified Wallace from crime cameras and other surveillance footage, including some showing him throwing the gun away, Tregre said.\nInvestigators also noticed a car following Wallace as he drove away from Sam’s apartment, Tregre said. Hollinger, who was Wallace’s co-worker, was behind the wheel, authorities said.\nA motive for the abduction and killing wasn’t immediately released.\nIt’s unclear whether the two men have attorneys who could comment on their behalf.", "url": "https://apnews.com/f3ae4c803232b3879d55595fa1db4a09"}