{"authors": ["On Assignment For Huffpost"], "date_download": "2020-05-04 20:17:01", "date_modify": "2020-05-04 20:17:01", "date_publish": "2020-04-28 09:45:09", "description": "We sat down with four individuals who wear wigs in their professional and daily lives to learn about their experiences.", "filename": "entry_power-of-wearing-wigs_l_5ea0a9d1c5b6a486d0839d65_1588623421.html", "image_url": "https://img.huffingtonpost.com/asset/5ea1d96b2500003d2b6b86e2.jpeg?cache=t2PX3Tk7Lx&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_power-of-wearing-wigs_l_5ea0a9d1c5b6a486d0839d65_1588623421.html", "title": "The Transformative Power Of Wearing Wigs", "title_page": "The Transformative Power Of Wearing Wigs | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Style and aesthetics can play a large role in building and maintaining feelings of self-confidence, and wigs have incredible transformative powers. For many, they’re more than just “fake hair” ― they’re a way of life.\nSome use wigs to try on an entirely different personality from that of their day-to-day lives. Think of the “wig out” bachelorette party in “The 40-Year-Old Virgin.”\nOthers wear wigs every day as a form of modesty. In some Orthodox Jewish communities, religious law requires married women to wear a head covering in order to maintain tzniut (that’s Yiddish for modesty). Often, this head covering is a sheitel (wig), many of which are made of human hair and styled in a modern manner.\nAmerican society still maintains a stigma against the wearing of wigs, particularly by Black women. Snide and invasive comments ― “Is that your real hair?” ― are aimed at everyday people even as we celebrate performers whose hairdos are clearly styled to look larger than life.\nSo why does society continue to pass judgment upon people who are simply trying to look the way they want to look? We sat down with four individuals who wear wigs in their professional and daily lives to learn about their experiences.\nChad Jones\nCourtesy of Chad Jones Chad Jones, before and after drag transformation.\nCourtesy of Chad Jones More photos of Jones in drag.\nI’ve always been in theater and performance, and I started doing drag about seven years ago, so I have been in wigs for some time.\nWhen I started doing drag, I had pretty limited access to wigs so I learned how to style them to make the most out of what I had. I really only wear two to three wigs, but I change them up as much and as often as I can.\nI’m not only a drag queen, but I’m also a costume designer. I like to think about an outfit from the very top of my head to my feet, and want to exaggerate every part of me as much as I can. Not only does a wig perhaps make me appear more feminine for drag, but the color is on purpose, the styling is deliberate, and it’s personally the key to a complete costume.\nI think nowadays we’re learning that wigs are an easy way to really change your look without having to go all-in on a cut or color. I’ve actually seen a lot of men wearing wigs and pieces to change up their look, which I think in the past was a lot harder to do without ridicule.\nI think a place where the stigma is still relevant is in regards to how people view Black communities, especially Black women, and their use of wigs. A lot of the reason wigs are becoming popular now is because of female Black artists, who are very open about their wigs and how necessary it is for their particular brand of styling, so it’s kind of wild to see such pressure put on them for doing exactly what everyone else is copying. Absolutely no one had a problem with Dolly Parton in wigs for the past 40 years, but Nicki Minaj is suddenly “too much” for wearing pink hair.\nNox Falls\nCourtesy of Nox Falls Nox Falls, before and after a burlesque transformation.\nCourtesy of Nox Falls More burlesque looks from Falls.\nI am a burlesque dancer, so in each one of my performances I become a different character or persona, and the wigs help with those types of transformations visually.\nAs said by Sarah Breedlove (aka Madame C.J. Walker) from “Self Made”: Hair is power. I’ve worn wigs since I was 23 due to an unfortunate appointment with an unexperienced hairdresser, wig glue and the inevitable buzz cut. I never thought years later I would use wigs to become other people ― on a stage, nonetheless. For Black people, wigs were an act of assimilation, and now with the glorious push of the natural hair movement, wigs are an expression, seen as acceptable accessories rather than a cover-up or something to be ashamed of. Now we use wigs as crowns.\nWhen I wear a wig, my desire is to become a different person. I wear wigs as one carries a handbag ― to go with whatever I’m wearing. My main focus now with wigs is that they match my actual hair texture and complement me in a way that never quite felt right when I first began wearing them years ago. I suppose it was because I was wearing a wig for what I consider to be the wrong reason for me. As many characters as I become, my main wig is an Afro not because I cannot grow one myself but because of what it represents ― rebellion against the original assimilation I once sought, and the celebration of Black hair and overall my Black beauty.\nClaire Smith\nCourtesy of Claire Smith Claire Smith, without her wig and in costume.\nCourtesy of Claire Smith More photos of Smith in costume.\nWigs really help me look different than I do in daily life. I mostly wear wigs for cosplay, masquerades, costume parties, events like Labyrinth of Jareth or Wastelanders Ball, and random theme nights. I feel like wigs complete my look and, as I am not talented with styling my own hair, I prefer to style a wig. It’s easier for me to get the height, color and look that I am trying to achieve for a costume with a wig than with my own hair.\nOne of the ways a wig boosts my confidence at these events is in my pride at having created something. I look at it as making a piece of my costume. If I can achieve what I’ve imagined, I feel extremely accomplished. I think wigs are great fun and I’d encourage anyone to try one. There are cheap wigs and tons of styling tutorials online. A little trim, steaming, rollers and spray can be a great polish to any look you are going for.\nThe first time I wore a wig, I was young, maybe around 7 or 8. My grandparents lived in Santa Monica, near the Brentwood Country Club, in a small 1939 home and there was an alley behind it. My grandparents would walk the alley and collect interesting items that were discarded: scarves, two random wigs and two fox stoles. They started a “play chest,” and my sister and I would play dress up. I remember feeling disguised and different!\nIt wasn’t until I was in my 20s that I bought my first wigs. My cousin and I were in downtown Los Angeles and bumbled into a store that happened to have wigs and bought six wigs each. (Apparently, there was a sale if you bought a dozen!) I still have them and have used them for club theme nights, theme bars and masquerades.\nI grew up with a lot of wigs, falls, hair extensions and weaves, so I’ve always seen it as a creative way to achieve how you want to look when your hair has different plans. I think they are amazing tools for those who wear wigs for medical reasons. Overall, I find them to be a simple way to feel more empowered.\nSeraphina Wilder\nCourtesy of Seraphina Wilder Seraphina Wilder, without and with her wig.\nAs a burlesque performer, wigs make my transformation complete. I use wigs to accentuate an act and believe that a wig is just as crucial to an act’s aesthetic as any other costume piece. It’s all about details. Often I will think of a wig and what its color, length, cut and style will communicate to an audience about an act. Often I resort to styling and customizing wigs for this very purpose. Pro tip: always pluck your wig’s part for a realistic hairline.\nWigs are so commonplace now and the stigma around them should be gone. There’s this negative correlation specifically between Black women and wigs ― that wearing wigs it’s somehow wrong when in reality all kinds of people wear wigs. And in some cases, people feel so entitled that they ask Black women if their hair is fake, i.e., “Is that your real hair?” ― and that usually doesn’t extend to non-Black women. I think of the Ariana Grande song where she brags about her ponytail ― “Thanks, I just bought it” ― and people applauded her for that. But that same sort of celebration or admiration is not granted to Black women.\nMost of the time, people are very lovely and supportive about my wig wearing, but I think there’s still some work to be done collectively about wearing wigs. I think it’s a taboo for people despite its ubiquity.", "url": "https://www.huffpost.com/entry/power-of-wearing-wigs_l_5ea0a9d1c5b6a486d0839d65"}