{"authors": ["Bill Barrow"], "date_download": "2020-05-04 20:18:22", "date_modify": "2020-05-04 20:18:22", "date_publish": "2020-04-08 16:28:43", "description": "California Sen. Kamala Harris made two notable fundraising moves Wednesday that are sure to fuel speculation about her prospects to be Joe Biden's running mate on the Democratic presidential...", "filename": "_c9231d4a160c51abe91d3008a7daf9df_1588623502.html", "image_url": "https://storage.googleapis.com/afs-prod/media/0ce93fa633934da8919830a40fbb4aba/2698.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c9231d4a160c51abe91d3008a7daf9df_1588623502.html", "title": "VP talk could intensify with Harris fundraising moves", "title_page": "VP talk could intensify with Harris fundraising moves", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sen. Kamala Harris, D-Calif., speaks at a campaign rally for Democratic presidential candidate former Vice President Joe Biden at Renaissance High School in Detroit, Monday, March 9, 2020. (AP Photo/Paul Sancya)\nSen. Kamala Harris, D-Calif., speaks at a campaign rally for Democratic presidential candidate former Vice President Joe Biden at Renaissance High School in Detroit, Monday, March 9, 2020. (AP Photo/Paul Sancya)\nCalifornia Sen. Kamala Harris made two notable fundraising moves Wednesday that are sure to fuel speculation about her prospects to be Joe Biden’s running mate on the Democratic presidential ticket.\nHarris, who dropped out of the White House race in December, set up a joint fundraising operation with the Democratic National Committee, an arrangement that is typically reserved for nominees trying to attract large donations from the party’s biggest boosters. Hours later, she made a surprise appearance on a virtual fundraiser, introducing Biden to donors.\nHarris, 55, will host her own virtual fundraiser Thursday. The deal allows contributors to give a maximum of $357,800, with $2,800 going to retire Harris’ presidential campaign debts and the rest going to the national party.\nThe senator and the DNC filed paperwork for the arrangement Wednesday with the Federal Election Commission, in the first joint fundraising agreement of its kind for Democrats this election cycle. Biden and the party chairman, Tom Perez, had been hesitant to enter into such an arrangement while Vermont Sen. Bernie Sanders was still actively campaigning against Biden. But Sanders suspended his campaign Wednesday, making Biden the presumptive nominee.\nParty officials did not say whether they have asked other former candidates for a similar fundraising arrangement, but that could become moot now that Biden no longer must navigate Sanders as a rival. Regardless, it’s a testament to Harris’ good standing among some of the party’s top donors.\nIn her Biden fundraising cameo Wednesday afternoon, Harris appeared on video from Washington, blasting Trump as a “complete failure” and, in an effusive introduction, asserting that Biden would be the right president at a time when people “need to have hope ... need to have faith.” The former vice president responded in kind, praising Harris for running a “helluva race” and reminding attendees that “we go back a long way,” a reference to Harris’ friendship with Biden’s late son, Beau. Harris was California’s attorney general the same time that Beau Biden held the post in Delaware.\nSeemingly teasing the running mate chatter, Biden added: “I’m so lucky to have you be a part of this partnership going forward. Working together, we can make a great deal of progress. ... I’m coming for you, kid.”\nHarris endorsed Biden last month after Elizabeth Warren, the last of her female colleagues from the Senate, had dropped out of the race.\nThe California senator has tried to sidestep speculation about joining the Democratic ticket. “I know that conversation is taking place in the press and among the pundits, and I’m honored to even be considered, if that’s the case,” Harris said earlier Wednesday on ABC’s “The View.”\nBiden has committed to selecting a woman as his running mate, and there’s a considerable push in the party for him to select a woman of color, recognizing both black women’s place as anchors of Biden’s coalition and the rising influence of Hispanic voters. Harris is the daughter of Indian and Jamaican immigrants.\nBiden has said previously that Harris is qualified to be president or vice president and noted that the former prosecutor could be an able attorney general or Supreme Court justice. His aides have dismissed any notion that hard feelings carried over from Harris’ aggressive attacks on Biden in a June presidential primary debate.\nHarris said on ABC that she has “a great deal of affection” for Biden and believes “he’ll be an extraordinary president.”\nTheir interaction and comments Wednesday stand in sharp contrast to their most headline-grabbing encounter of the Democratic presidential primary. Harris blistered the 77-year-old Biden in the first Democratic debate for having opposed federal court-ordered busing in the 1970s as a way to integrate public schools like the one she attended at the time in Oakland, California.\n“I do not believe you are a racist,” Harris said to open a critique that clearly rattled Biden.\nHis advisers at the time said Harris’ approach surprised Biden based on their ties through Beau, who died in 2015, a year before Harris was elected to the Senate. The former vice president has since sharpened his explanation of his Senate record on race, and aides have said he holds no grudge from that Harris exchange.\n___\nCatch up on the 2020 election campaign with AP experts on our weekly politics podcast, “Ground Game.”", "url": "https://apnews.com/c9231d4a160c51abe91d3008a7daf9df"}