{"authors": ["Review Brian Lowry"], "date_download": "2020-05-04 16:54:02", "date_modify": "2020-05-04 16:54:02", "date_publish": "2020-04-08 18:32:57", "description": "\"The Good Fight\" returns with an audacious fourth-season premiere that considers what Hillary Clinton's election would have looked like.", "filename": "2020_04_08_entertainment_the-good-fight-review_index_1588611242.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406100918-the-good-fight-season-4-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_entertainment_the-good-fight-review_index_1588611242.html", "title": "'The Good Fight' Season 4 preview", "title_page": "'The Good Fight' Season 4 preview - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Adopting an anything-goes attitude from the freedom afforded by playing on CBS All Access, \"The Good Fight\" returns with an audacious fourth-season premiere that considers what Hillary Clinton's election would have looked like, and the associated fallout. As what-if episodes go, it's an especially good one, while setting up a mystery that will drive the quirky drama through this latest run.\nHaving spent most of last season finding ways to oppose the Trump administration, lawyer Diane Lockhart (Christine Baranski) awakens in the midst of what feels like a \"Twilight Zone\" episode: Hillary is president, and she's the only one who can remember a time when things turned out differently.\nWhat follows, though, is a pretty spot-on exploration of the Butterfly Effect -- that is, when you change one thing in the timeline, other ramifications that ripple out from it. That ranges from the media and Diane's associates nitpicking the president's accomplishments to what Trump did after the election, and closer to home, a new ripped-from-the-headlines client for Diane who, as spoilers go, is simply too good to share.\nIt's a particularly inspired flight of fancy, but it serves a purpose. Not only does it reinforce \"The Good Fight's\" status as one of the smartest shows streaming into living rooms, but it allows producers Robert and Michelle King to introduce a plot that drives the episodes previewed -- something called Memo 618, which appears to be a kind of get-out-of-jail-free card for the rich and connected when dealing with the judicial system.\nThe new episodes also find turmoil within Diane's law firm, Reddick, Boseman & Lockhart, as the partners (including the splendid Delroy Lindo and Audra McDonald) chafe against the multinational firm that acquired them, STR Laurie. For starters, the new boss allows dogs to run free in the halls, while their offbeat representative, Gavin Firth (John Larroquette, wonderfully weird), is somehow both strangely accommodating and almost impossible to trust.\nRead More", "url": "https://www.cnn.com/2020/04/08/entertainment/the-good-fight-review/index.html"}