{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:05:20", "date_modify": "2020-05-04 20:05:20", "date_publish": "2020-04-08 23:00:16", "description": "Division 2 All-State The 2020 Associated Press Division 2 boys basketball All-State team as selected by a panel of Michigan sports writers. Player of the Year", "filename": "_a597c684588e19a5527cf74f92c7a437_1588622720.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a597c684588e19a5527cf74f92c7a437_1588622720.html", "title": "Johnson, Barnes win AP Division 2 awards", "title_page": "Johnson, Barnes win AP Division 2 awards", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Division 2 All-State\nThe 2020 Associated Press Division 2 boys basketball All-State team as selected by a panel of Michigan sports writers.\nPlayer of the Year\nCarlos ‘Scooby’ Johnson, Benton Harbor, Sr.\nFirst-Team All-State\nCarlos ‘Scooby’ Johnson, Benton Harbor, Sr.\nPierre Brooks, Detroit Douglass, Jr.\nKobe Bufkin, Grand Rapids Christian, Jr.\nBrad Simonsen, Houghton, Sr.\nQuindarius Davis, Benton Harbor, Sr.\nKe’Ontae Barnes, Muskegon Orchard View, Jr.\nMason Docks, Williamston, So.\nColin Golson, Ferndale, Sr.\nTyson Davis, Goodrich, Jr.\nCharlie Woodhams, Otsego, Sr.\nCoach of the Year\nGary Barns, Goodrich\nSecond-Team All-State\nOrlando Lovejoy, Romulus Summit Academy, So.\nJaylen Hodges, Bridgeport, Jr.\nMykel Bingham, Grand Rapids Catholic Central, Sr.\nRyan Corner, Allendale, Sr.\nJack Karasinski, Grand Rapids Catholic Central, So.\nCaron Clayton, Flat Rock, Sr.\nBrendan Young, Fowlerville, Jr.\nCoach of the Year\nMark McDaniel, Eaton Rapids\nHonorable Mention\nJayland Randall, Harper Woods Chandler Park; Damon Terrelle, Detroit CMA; Zavion McClendon, Detroit Douglass; Tamario Adley, Harper Woods Chandler Park; Hunter Soper, Croswell-Lexington; DJ Voltz, Carrollton; Pete Calcaterra, Boyne City; Devon Boyd, Grand Rapids Catholic Central; Zac Velthouse, Hudsonville Unity Christian; Soloman White, Forest Hills Eastern; Ethan Alderink, Holland Christian; Tyler Zomerlei, Hopkins; Chase Wilson, Sparta; Joe Francis, Adrian; Ross Stofflet, Chelsea; Peyton Fedell, Escanaba; Rane Castor, Gladstone; Cam Ballard, Gladstone; Carter Hudson, Escanaba; Lucas Lyyski, Spring Lake; Chris Young, Buchanan; Braiden McDonald, Fremont; Rae’Quan Funches, Battle Creek Harper Creek; Ryne Petersen, Battle Creek Pennfield; Nick Szymanski, Ionia; Shayne Loynes, Ovid-Elsie; Caleb Leykauf, Perry; Griffin Gleeson, Eaton Rapids; Treyvon Lewis, Ferndale; Julian Scott, Detroit Country Day; LaTa’Vius Vaughter, Clio; Ryan Zimmer, St. Clair; Aidan Rubio, Goodrich; Tay Jones, Carrollton; Corey Thompson, Frankenmuth; Tyler Johnson, Crosswell-Lexington; Keagan Wendel, Standish-Sterling; Thomas Alfano, Shepherd; Paul Gadde, Alma; Case Martin, Alma; Hunter Woolston, Clare; Shane Jenkins, Clare; Charlie Nylander, Lansing Catholic; Jacob Wallace, Williamston; Justin Moore, Ovid-Elsie; Caleb Hardies, Macomb Lutheran North; Tipp Baker, Cadillac; Johnny Mistretta, Marine City; Daveyn Henderson, Richmond; Brent Wiles, New Haven; Sean Donaldson, St. Clair; Gavin Fisher, Fruitport.\nCoach of the Year\nDave Jones, Lansing Eastern.\n___\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports", "url": "https://apnews.com/a597c684588e19a5527cf74f92c7a437"}