{"authors": ["Rachel D'Oro"], "date_download": "2020-05-04 21:06:53", "date_modify": "2020-05-04 21:06:53", "date_publish": "2020-04-21 00:45:53", "description": "ANCHORAGE, Alaska (AP) — An Alaska Native cultural organization is suing luxury retailer Neiman Marcus, saying the Dallas-based company violated copyright and American Indian arts protection laws...", "filename": "_5ae5b2bbbe6bf84ce742e9d7ec9d5434_1588626413.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5ae5b2bbbe6bf84ce742e9d7ec9d5434_1588626413.html", "title": "Alaska Native group sues Neiman Marcus over coat's design", "title_page": "Alaska Native group sues Neiman Marcus over coat's design", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ANCHORAGE, Alaska (AP) — An Alaska Native cultural organization is suing luxury retailer Neiman Marcus, saying the Dallas-based company violated copyright and American Indian arts protection laws in selling a knit coat with a geometric design borrowed from indigenous culture.\nIn the federal lawsuit filed Monday, Sealaska Heritage Institute maintains the retailer falsely affiliated the $2,555 “Ravenstail” coat with northwest coast native artists through the design and use of the term, Ravenstail.\nThe plaintiffs say the Ravenstail term and style has been associated for hundreds of years with Tlingit, Haida and Tsimshian tribes. According to the lawsuit, the coat also mimics a Ravenstail coat created by a Tlingit weaver nearly a quarter century ago.\nSealaska attorney Jacob Adams said the case is part of a larger movement to recognize the rights of indigenous people to their cultural items.\n“For a very long time, they’ve been seen as kind of resources that anyone can use,“ Adams said. “And that goes beyond inspiration to outright violation.“\nNeiman Marcus representatives did not immediately respond to an email seeking comment. It is unclear if the coat is still for sale. It did not appear in a search on the retailer’s website Monday.\nNieman Marcus has 43 stores throughout the U.S., none in Alaska.\nSealaska says it discovered the retailer was selling the coat in 2019. Adams said the garment was still being sold last month.\nAccording to the lawsuit, Neiman Marcus violated the Indian Arts and Crafts Act that requires that products marketed as “Indian” are actually made by indigenous people. The Juneau-based nonprofit works to preserve and enhance the culture of southeast Alaska’s Tlingit, Haida and Tsimshian tribes.\nSealaska also says the Neiman Marcus robe violates the copyright of Clarissa Rizal, a late master weaver who created the Ravenstail robe in 1996. When she died in 2016, her family obtained the rights to the robe, Adams said.\nLast year, Rizal’s heirs registered the robe with the U.S. copyright office, the lawsuit says. The copyright was then exclusively licensed to Sealaska, the lawsuit says.\nPlaintiffs seek an injunction prohibiting Neiman Marcus or parent companies from selling the coat, as well as unspecified compensatory, punitive and other damages.\n___\nFollow Rachel D’Oro at https://twitter.com/rdoro", "url": "https://apnews.com/5ae5b2bbbe6bf84ce742e9d7ec9d5434"}