{"authors": ["Lauren Fox", "Paul Leblanc"], "date_download": "2020-05-04 16:55:29", "date_modify": "2020-05-04 16:55:29", "date_publish": "2020-04-09 00:57:10", "description": "The Treasury Department's acting inspector general has sent a report to the House Ways and Means Committee that examines the handling of Chairman Richard Neal's request for President Donald Trump's tax returns, a personal familiar with the report tells CNN.", "filename": "2020_04_08_politics_treasur_af96ebd9a8141027c23655de103ec417_index_1588611329.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190403183711-trump-tax-returns-house-democrats-request-kildee-intv-tsr-vpx-00000028-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_treasur_af96ebd9a8141027c23655de103ec417_index_1588611329.html", "title": "Acting Treasury watchdog sends to House committee report on handling of request for Trump's tax returns", "title_page": "Acting Treasury inspector general sends to House committee report on handling of request for Trump's tax returns  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The Treasury Department's acting inspector general has sent a report to the House Ways and Means Committee that examines the handling of Chairman Richard Neal's request for President Donald Trump's tax returns, a personal familiar with the report tells CNN.\nThe report from Richard Delmar was sent to both Neal and the top Republican on the committee, Rep. Kevin Brady of Texas.\nThe contents of the report are not known and a Democratic aide on the House Ways and Means Committee told CNN that they did not plan to comment on the report or its contents Wednesday evening.\nNeal had requested six years of Trump's business and personal tax returns in April 2019. In a letter to the Internal Revenue Service at the time, Neal explained that the request is part of his oversight role and that the committee needed Trump's tax returns to consider legislation related to the IRS's practice of auditing sitting presidents.\n\"Under the Internal Revenue Manual, individual income tax returns of a President are subject to mandatory examination, but this practice is IRS policy and not codified in the Federal tax laws,\" Neal wrote in a letter to the IRS.\nRead More", "url": "https://www.cnn.com/2020/04/08/politics/treasury-inspector-general-trump-tax-returns-house/index.html"}