{"authors": ["Steve Douglas"], "date_download": "2020-05-04 20:29:01", "date_modify": "2020-05-04 20:29:01", "date_publish": "2020-04-20 13:41:52", "description": "The buildup to the World Rugby elections has been plunged into turmoil by a Fijian candidate for a place on the governing body’s executive committee facing allegations of discriminatory...", "filename": "_99050b4fc215f819b962c1a86a5f36b4_1588624141.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_99050b4fc215f819b962c1a86a5f36b4_1588624141.html", "title": "World Rugby looking into allegations against Fiji chairman", "title_page": "World Rugby looking into allegations against Fiji chairman", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The buildup to the World Rugby elections has been plunged into turmoil by a Fijian candidate for a place on the governing body’s executive committee facing allegations of discriminatory conduct.\nThe accusations against Francis Kean, who is chairman of the Fiji Rugby Union, are being taken “extremely seriously,” World Rugby said in a statement, and could disrupt the final week of campaigning ahead of voting for its next chairman.\nThat’s because the Fijian union seconded the nomination of Bill Beaumont to stand for re-election as World Rugby chairman. Beaumont is battling former Argentina international Agustin Pichot for the most powerful position in the sport and the vote opens on April 27, with the result on May 12.\nMeanwhile, Kean is among eight officials seeking one of seven available places on World Rugby’s executive committee, the main decision-making body in the sport. Kean’s bid has been supported by the French Rugby Federation, whose head is Bernard Laporte — Beaumont’s running partner to become World Rugby vice-chairman.\nBritish newspaper The Sunday Times said in an article published at the weekend it has heard “graphic recordings” of Kean using violent and homophobic language when in charge of Fiji’s prison service.\n“World Rugby is currently in dialogue with the Fiji Rugby Union about the nature of the allegations,” said the governing body, which stressed that rugby “is a sport built on strong and inclusive values” and it “does not in any way condone any abusive or discriminatory behaviour.”\nNo formal investigation has been launched against Kean, who was convicted of manslaughter in 2007, or the FRU.\nWorld Rugby emphasized that it was the FRU, and not specifically Kean, who seconded Beaumont.\nKean — whose brother-in-law, Frank Bainimarama, is prime minister of Fiji and president of the FRU — represents the Pacific Island nation on World Rugby’s council. The body said a place on the council is awarded to the union, not an individual, and that Fiji met the relevant criteria following a revised governance process launched in November 2015.\nBeaumont said in January he would undertake a full governance review, including on “fit persons,” if he got re-elected.\nBut Pacific Rugby Players Welfare, an independent group that supports players of Pacific Island heritage in Europe and boasts 700 members, can’t believe how Kean was accepted on the ballot in the first place, given his criminal record.\nIn an open letter to the governing body, PRPW director and former Samoa international Dan Leo asked why World Rugby has “some of the most elaborate and exhaustive eligibility checks for those who play the game but apparently no checks for someone wanting to run the game.”\n“It is extraordinary to anyone involved in the game in the Pacific that Kean is even on the ballot,” Leo wrote.\nHe added World Rugby’s self-claimed values of integrity, respect, solidarity, passion, and discipline “will be utterly debased if Kean is elected.”\n___\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports", "url": "https://apnews.com/99050b4fc215f819b962c1a86a5f36b4"}