{"authors": ["On Assignment For Huffpost"], "date_download": "2020-05-04 20:17:03", "date_modify": "2020-05-04 20:17:03", "date_publish": "2020-04-28 09:45:09", "description": "The journalist digs deep into the past in this touching debut book on sexuality, gender identity and the power of family.", "filename": "entry_george-m-johnson-book-all-the-boys-arent-blue_n_5ea70d5cc5b6a30004e62a79_1588623423.html", "image_url": "https://img.huffingtonpost.com/asset/5ea713213000002c11154fa8.jpeg?cache=4hnajowj6t&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_george-m-johnson-book-all-the-boys-arent-blue_n_5ea70d5cc5b6a30004e62a79_1588623423.html", "title": "George M. Johnson's New Memoir Reminds Us That ‘All Boys Aren't Blue’", "title_page": "George M. Johnson's New Memoir Reminds Us That ‘All Boys Aren't Blue’ | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "If you follow George M. Johnson on Twitter or read any of their articles, it’s apparent that they (Johnson embraces plural pronouns) suffer no fools, especially racist, transphobic and homophobic ones. And that they have a profound love for their family, especially their grandmother Nanny, who died of brain cancer last year.\nThankfully, their debut book, ”All The Boys Aren’t Blue,” beautifully captures both personas, giving a much-needed pushback to the oppressive powers that be, while showing their softer side. One that celebrates their relationships, however complicated, with their kin and how that unconditional love helped create the Johnson audiences know and love today.\nDubbed a young adult “memoir-manifesto,” this fearless collection of “stories through essays” explores this little Black boy from Plainfield, New Jersey, who at an early age knew they were “different.” With each page, readers travel back in time with Johnson on this moving journey of self-discovery, self-love and, eventually, joy.\nWhile it’s an empowering read, it also embodies a lot of pain. From their frank description of being bullied, to learning early on to hide their true, more effeminate self from the world and the sexual abuse they endured, Johnson doesn’t sanitize their story. “All Boys Aren’t Blue” is an unflinching testimony that carves out space for Black queer kids to be seen while serving as a much-needed resource for parents who need more affirming tools to raise their children.\nJohnson, 34, sat down with HuffPost to talk about sharing their pain and joy with the world and why we have to love our children for who they are, instead of who we want them to be.\nI won’t lie; this wasn’t always easy to read, especially the chapters that dealt with your pain. I didn’t know you had gone through a lot of that. Do you think other people, whether they know you in real life or from social media, are going to be surprised, too?\nYes, and not just from the things you mentioned, but also because I believe there is this assumption that if you turned out a certain way, you didn’t have traumatic experiences. I experienced some trauma and shared it. Also, there are other little unknown facts, like I didn’t know my first name until I was 7. I had been using my middle name “Matthew” for years, and just learning that truth about myself helped me learn to adapt in different environments and different situations down the road.\nThen there is Dominique, your childhood alter ego named after Olympic gymnast Dominique Dawes. That was eye-opening.\nI don’t think many people know about that either [laughs]. But I am letting the readers into my mind and you start to understand my thought process at that time of thinking I may have wanted to be a girl, but not having any language to know what that was back then. Too often, we assume that kids don’t know anything or can’t process adult things, but they can, and they are having these conversations with themselves even if they don’t know that they are queer or know what queer even means.\nMacmillan Cover of \"All Boys Aren't Blue\" by George M. Johnson\nThroughout your journalism career, you have written for BuzzFeed, BET and Vice, to name a few. But what prompted you to write a book, and a YA one at that?\nAs a journalist, I had been writing my story in pieces for years, and it never seemed that I could get enough in an article that addressed every moment in my life. Also, at that point, I had been freelancing for five years and started realizing how I wanted my body of work to look like and how I wanted to use my platform and my voice.\nIn terms of YA, the choice was my editor’s and mine. I didn’t really know much about book genres or categories; I just knew I had this story about this Black queer kid growing up. Looking back now, it made sense, because I have always shown love to Black children, especially Black queer kids and Black girls, who are thrust in a world to face so many forms and oppression at such a young age. So I wanted to put something in their hands.\nI recently chatted with Evette Dionne, who wrote the YA nonfiction book “Lifting As We Climb: The Story of America’s First Black Women’s Club,” and like you, she believes that children can grasp much more than we think. So she didn’t hold back in her book when talking about racism, sexism and slavery. You didn’t hold back in yours either.\nYoung people are so smart and are having conversations about gender and sex that adults are struggling with, so no, I didn’t want to hold back. I did have to make a decision about how much of myself I wanted to give, but I realized that I had to go all the way in. Kids are inquisitive and want to know more than just the surface, and deserve more. So I dug into those deeper parts with honesty — and without the white gaze.\nThere is such richness and nuance for how you write about your family and your experiences. Who did you look to for guidance when you started writing your story?\nI once tweeted that Tarell Alvin McCraney [the Oscar-winning screenwriter for “Moonlight”] is one of the greatest storytellers in our generation, especially the ways he cares for Black people in his work. It’s something we don’t always see and it made me think of my own book and how I was going to tell this story. I had conversations with him, and he gave me some great advice.\nYou know, the world doesn’t give Black people empathy and so I could have written about all the wrongs my dad did, but I’d rather write about how he and other family members were trying to do the best they could with the tools they were given. Even when I talk about my cousin, who sexually abused me, I could have talked about it in a much different way, but I didn’t.\nThat chapter really made me pause. It’s incredibly empathetic, but you also made sure to let others know that this was a process for you, and no one else has to come to this same conclusion. Why did you write it this way?\nWriting that chapter, I had to talk to my family about it first. At that time, I had gotten to a place of empathy because I realized that someone must have harmed him for him to hurt me. What was going on with him? Yes, he needs to be held accountable, but also I still felt this need to protect Black queer boys, no matter what. To not have empathy only does justice for white people, who will be like, “See, look how they treat their own.” So, I had to give my cousin humanity.\nYou worked on this book for nearly two years. What was the hardest part of the process?\nGoing in, I thought it would have been the actual writing, but it was reliving that trauma, along with my grandmother being sick and dying as I finished it. For me, this wasn’t just writing a book. I am writing this history, her story, my mom’s story, my dad’s story, and a lot of other people’s story. It was incredibly tough to birth into the world the biggest thing in my life, while also losing the biggest thing in my life.\nI appreciated the chapter “Honest Abe Lied To Me” where you talk about how your mother instilled in you this strong sense of Black pride. Often, there is this tired notion that Black LGBTQ folks choose their sexual orientation or gender identity first before their Blackness. That just isn’t necessarily true.\nSean Howard George M. Johnson\nI remember when Don Lemon said that he left Black communities to go toward white communities because of the homophobia in the Black community. Now, I am not saying that’s not true or doesn’t happen. If that’s his story, it’s his story. But I wanted to push back from that because I only exist in Black communities. I don’t care how bad it gets; I never wanted to go then be part of a community that oppresses us even more.\nMy Blackness is tied to my queerness. So for people to say, “You are choosing your sexuality over your race,” no, I’m not. I am existing in my race. I am only with you. I am only in Black spaces, where you are othering me for my sexuality, so I am going to lean into my sexuality, but be clear: You already knew I was Black when I walked through the door.”\nWhat are some other myths about being Black and queer you hope “All Boys Aren’t Blue” will dispel?\nHopefully, the myth that sexual abuse is the only reason that people are “homosexual.” As I point out in the book, I was already having these thoughts and feelings before I was sexually assaulted. That, and being raised by a single mother makes you “soft,” because yes, I was raised by my grandmother, but I lived in the house with my mother and my father and was constantly surrounded by masculinity and I am still who I am. Most importantly, pushing back on the idea that Black boys don’t get sexually abused, which we do, and we need to create spaces to talk about that abuse.\n“All Boys Aren’t Blue” would always be timely, but looking at Black queer children such as singer Lil Nas X and Zaya Wade, along with adults such as Billy Porter, who have been mistreated by the public for stepping outside of the hetero norm, this book is even more critical.\nIt makes no sense for people to tear down Zaya and Lil Nas X. What we need to be doing instead is protecting them at all costs. And if you don’t understand it or don’t like it, then you need to interrogate that for yourself, but still love these children in the process.\n“All Boys Aren’t Blue” is fighting against toxic masculinity, but is also a way to let heterosexual men in. Let me say it publicly: I understand why queer people give up on heterosexuals. Sometimes that pain is too deep, but for me, I feel like working with them is part of my mission to educate. I did it with my cousins and my family, so this is an extension of that.\nBut I also want to say that this book is more than just pain, because white people love reading about Black trauma and often shun Black joy, so I wanted to show all the sides of my life because I had and have happiness and lean into mine as much as possible.\nIn “Losing My Virginity Twice,” you talk about having consensual sex for the first time and go into graphic detail. You also write that you might get pushback for it. Why?\nPeople in this country already have an issue around sex, it’s always so taboo, but I am not writing about “traditional” sex, I’m talking about queer sex, so I know that there are going to be some folks who say, “I don’t want my kids reading this.” But I had to write about it, in the way I did, because kids are not learning about it at school. They are learning about it on the internet or in real life with trial and error, and so I wanted this book to be a resource.\nFinally, what does “all boys aren’t blue” mean to you?\nIt’s a pushback against the ideology of the gender reveal, that just because blue confetti comes out of some balloon or the doctor tells you that it’s a boy, it doesn’t mean they are going to follow that trajectory or be that type of boy. We have to stop trying to force children to follow this script and instead nurture and love our children to become who they are, not who we think they should be.\nThis interview has been edited for clarity and length.", "url": "https://www.huffpost.com/entry/george-m-johnson-book-all-the-boys-arent-blue_n_5ea70d5cc5b6a30004e62a79"}