{"authors": ["Katelyn Polantz", "Veronica Stracqualursi"], "date_download": "2020-05-04 17:01:42", "date_modify": "2020-05-04 17:01:42", "date_publish": "2020-04-10 14:31:05", "description": "Attorney General William Barr defended President Donald Trump's removal of intelligence community inspector general Michael Atkinson, saying Trump \"did the right thing,\" while a bipartisan group in Congress is demanding answers as to why the watchdog was fired.", "filename": "2020_04_10_politics_william_9f899d80f8cf5154011fbe1f9f0addd2_index_1588611702.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200213163906-01-barr-lead-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_william_9f899d80f8cf5154011fbe1f9f0addd2_index_1588611702.html", "title": "Barr defends Trump's firing of intel community watchdog as the 'right thing' to do", "title_page": "Barr defends Trump's firing of intel community watchdog as the 'right thing' to do - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Attorney General William Barr defended President Donald Trump's removal of intelligence community inspector general Michael Atkinson , saying Trump \"did the right thing,\" while a bipartisan group in Congress is demanding answers as to why the watchdog was fired.\nIn an interview on Fox News that aired Thursday, Barr alleged that Atkinson had used his role in the intelligence community as \"a commission to explore anything in the government and immediately report it to Congress without letting the executive branch look at it and determine whether there was any problem.\"\nAtkinson notified Congress of the existence of a whistleblower complaint about Trump pressuring the Ukrainian president for political help in a July phone call that set off impeachment proceedings against the President.\nAtkinson had asked the Justice Department for a legal opinion on whether the complaint was concerning enough to alert Congress, getting word back from the department that he shouldn't transmit it to the Hill. Atkinson tried to corroborate the whistleblower complaint and forwarded it to the Director of National Intelligence.\nAtkinson's disclosure of a whistleblower ultimately led to Trump's impeachment for abuse of power and obstruction of Congress. Trump was then acquitted by the Senate.\n\"He is obliged to follow the interpretation of the Department of Justice, and he ignored it,\" Barr told Fox News. \"So I think the President was correct in firing him.\"\nWhile Barr defended Trump, a bipartisan group of senators, led by Republican Sen. Chuck Grassley of Iowa, have asked the President to provide a \"detailed written explanation\" for his decision to remove Atkinson.\nBarr has drawn criticism in the past for his handling of the Mueller report and intervening on legal matters seemingly to the benefit of the President, undermining the Justice Department's independence from politics.\nHis greenlight of a review into the FBI's Russia investigation aligns with Trump's claims that he's the victim of a \"deep state\" spy operation attempting to thwart his presidency.\nBarr told Fox News that US Attorney John Durham, who he tapped in May to examine the origins of the Russia investigation , is attempting to build criminal cases and not merely issue a report on his findings.\n\"His primary focus isn't to prepare a report, he is looking to bring to justice people who were engaged in abuses if he can show criminal violations and that's what the focus is on,\" Barr said.\n\"My own view is that the evidence shows that we're not dealing with just mistakes or sloppiness. There's something far more troubling here,\" Barr said.\nBarr didn't share details this week about what Durham is pursuing, and hedged his opinion by saying that Durham would have to find evidence of people breaking the law if he is to bring cases and that building these cases \"takes some time.\"\nThe country's top law enforcement officer called the FBI's investigation into possible ties between Russia and Trump's campaign \"one of the greatest travesties in American history.\"\n\"Without any basis, they started this investigation of his campaign, and even more concerning, actually, is what happened after the campaign -- a whole pattern of events while he was president -- to sabotage the presidency, or at least have the effect of sabotaging the presidency,\" Barr said.\nBut special counsel Robert Mueller documented many interactions between the Trump campaign and Russians in 2016, and ultimately charged two dozen Russians for interfering in the election and several Trump campaign officials for lying about their interactions in 2016.\nIn a report released in December , the Justice Department's inspector general found that the FBI properly opened its investigation into Russian election interference but said there were major errors in how the agency conducted the probe.\nBarr and Durham both issued statements at the time, disagreeing with some of the key findings of the report.", "url": "https://www.cnn.com/2020/04/10/politics/william-barr-john-durham-russia-investigation/index.html"}