{"authors": ["Ashley Strickland"], "date_download": "2020-05-04 16:34:24", "date_modify": "2020-05-04 16:34:24", "date_publish": "2020-04-07 11:14:23", "description": "April's full moon, also known as the pink moon, happens to be the closest of the year -- resulting in the biggest and brightest supermoon of the year.", "filename": "2020_04_07_world_april-supermoon-pink-moon-scn-trnd_index_1588610064.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/170411215310-02-pink-moon-social-discovery-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_world_april-supermoon-pink-moon-scn-trnd_index_1588610064.html", "title": "April's 'pink moon' is the biggest supermoon of 2020", "title_page": "Supermoon tonight: April's 'pink moon' is the biggest supermoon of 2020 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) If you've been stargazing as part of your at-home activities since the pandemic began, prepare to see the biggest and brightest supermoon of the year on Tuesday night.\nSupermoons occur when the moon is within 90% of perigee -- which is its closest approach to Earth in orbit. The moon will appear brighter and bigger in the night sky, and hopefully no clouds and inclement weather will obscure the view.\nApril's full moon, also known as the pink moon, happens to be the closest of the year. People around the world should be able to see the supermoon at its best around 10:35 pm ET to midnight on Tuesday night and even into the early morning hours of Wednesday, according to EarthSky.org\nThe first full moon of spring, its name comes from native North American wildflowers that bloom in early springtime: Phlox subulata, known as \"moss pink,\" according to the Old Farmer's Almanac\nApril's full moon has also been known as the \"sprouting grass moon\" or \"egg moon,\" heralding other first signs of spring.\nRead More", "url": "https://www.cnn.com/2020/04/07/world/april-supermoon-pink-moon-scn-trnd/index.html"}