{"authors": ["Senior Culture Reporter"], "date_download": "2020-05-04 20:03:32", "date_modify": "2020-05-04 20:03:32", "date_publish": "2020-05-04 17:38:59", "description": "\"Outer Banks\" tops the Netflix list for the second week in a row.", "filename": "entry_outer-banks-netflix-popular_l_5eb0197dc5b64d204963a59e_1588622612.html", "image_url": "https://img.huffingtonpost.com/asset/5eb02403300000bb1415562a.jpeg?cache=DBnEyAaPir&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_outer-banks-netflix-popular_l_5eb0197dc5b64d204963a59e_1588622612.html", "title": "The 10 Most Popular Shows On Netflix Right Now (May 4)", "title_page": "The 10 Most Popular Shows On Netflix Right Now (May 4) | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "The teen drama features hot young people searching for hidden treasure at the beach. The show has been near the top spot since its debut on April 15. Another Netflix beach show, “Too Hot to Handle,” had the top spot when they both debuted. But that reality show has proven to have far less staying power. This week it fell to the ninth-place spot.\n“Hollwood,” the new Ryan Murphy Netflix Original, nabbed the second-place spot. The show focuses on young actors and filmmakers trying to make their dreams come true in 1940s Hollywood.\nNetflix gave Murphy a deal worth around $300 million to create ambitious projects like “Hollywood.” The company probably doesn’t see it as ideal that his expensive new show didn’t debut at number one against a teen beach show.\nSince Netflix introduced this ranking system in February, “The Office” has often occupied 10th place. It’s interesting that it remains popular enough to hold that spot consistently, but doesn’t surge higher. It’s a quirk of the ranking that will likely continue until “The Office” leaves Netflix in 2021.", "url": "https://www.huffpost.com/entry/outer-banks-netflix-popular_l_5eb0197dc5b64d204963a59e"}