{"authors": ["Ariane De Vogue", "Devan Cole"], "date_download": "2020-05-04 16:22:44", "date_modify": "2020-05-04 16:22:44", "date_publish": "2020-04-06 14:32:10", "description": "The Supreme Court declined on Monday to hear a dispute concerning a Washington, DC, transit agency's ban on allowing religious ads to be placed on the sides of city buses.", "filename": "2020_04_06_politics_supreme-court-wmata-archdioceses_index_1588609364.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200316132303-01-supreme-court-0316-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_supreme-court-wmata-archdioceses_index_1588609364.html", "title": "Supreme Court declines to hear case concerning DC transit agency's ban on religious ads", "title_page": "Supreme Court declines to hear case concerning DC transit agency's ban on religious ads   - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The Supreme Court declined on Monday to hear a dispute concerning a Washington, DC, transit agency's ban on allowing religious ads to be placed on the sides of city buses.\nThe decision to stay out of the case leaves in place the policy of the Washington Metropolitan Area Transit Authority.\nIn 2017, the Archdiocese of Washington sought to advertise its \"Find the Perfect Gift\" campaign on the exterior of public buses operated by the WMATA. The ad depicted three shepherds and sheep. The transit agency refused to run the advertisement because of a policy prohibiting advertisements that promote or oppose religion or reflect a religious perspective.\nLower courts had ruled in favor of WMATA, holding that the policy was viewpoint neutral and violated neither the first amendment nor federal statutes.\nMetro is no stranger to lawsuits over its advertisement policy. In August 2017, the American Civil Liberties Union also sued WMATA, claiming the advertising guidelines violated free speech.\nRead More", "url": "https://www.cnn.com/2020/04/06/politics/supreme-court-wmata-archdioceses/index.html"}