{"authors": [], "date_download": "2020-05-04 16:16:03", "date_modify": "2020-05-04 16:16:03", "date_publish": "2020-04-03 17:34:22", "description": "Don't spend your weekend at home scouring the internet for savings; we've done all the work for you already. See below for the best sales and deals to shop this weekend, and pick up everything you need to stay entertained — activewear, speakers, gaming consoles, kitchenwares, home decor and more — all for less than usual.", "filename": "2020_04_03_cnn-underscored_weekend-sales-deals_index_1588608963.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403133117-weekend-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored_weekend-sales-deals_index_1588608963.html", "title": "The best sales to shop this weekend: Adidas, Sonos, Staples and more", "title_page": "The best sales to shop this weekend: Adidas, Sonos, Staples and more - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Don't spend your weekend at home scouring the internet for savings; we've done all the work for you already. See below for the best sales and deals to shop this weekend, and pick up everything you need to stay entertained — activewear, speakers, gaming consoles, kitchenwares, home decor and more — all for less than usual.\nTech and electronics\nTech and electronics\nRosetta Stone\nInternational travel might not be an option right now, but you can still explore the world via language with deals on Rosetta Stone subscriptions. Now through April 12, get three months of Rosetta Stone for one language for $35.97, 12 months of Rosetta Stone's Unlimited Languages for $95.88, 24 months of Rosetta Stone's Unlimited Languages for $143.76, and a Lifetime Subscription of Rosetta Stone's Unlimited Languages for $199.\nSonos\nHear that? It's the sound of savings on several Sonos speaker models, including the One, the Beam and a few different sets. Upgrade your sound system now, and enjoy your music, TV, podcasts, and any other audio even more while you're at home.\nApple\nTons of Apple products are marked down at B&H Photo Video right now. You'll find discounts on iPad Pro, Macbook Air, AirPods, and more.\nXbox\nAmp up your gaming game at Microsoft's Spring Sale. Take up to 75% off select Xbox games, save up to 30% on Xbox accessories, snag $100 off the Xbox One X console, and enjoy a month of Xbox Game Pass Ultimate for $1.\nHome and health\nHome and health\nSimplehuman\nAs we all work to stop the spread of germs, Simplehuman is doing its part, too. The maker of sleek, smart home products is taking 25% off all touch-free sensor pumps, sensor trash can and soap, so you can wash your hands and throw things away without having to touch any surfaces.\nStaples\nNow that you're working from home, you need an office chair that won't wreck your back. Luckily, Staples is taking up to $100 off more than 70 office chairs, so you can select the seating that best suits your home office and comfort preferences.\nThe Company Store\nTreat yourself to new bedding, bath linens, home decor and much more at The Company Store's Friends & Family Event with promo code BFF2020. Through this weekend, you take 25% off the retailer's Luxury Collection, which includes items featuring intricate details and from fine textiles. Plus, save 20% on everything else on site.\nOxo\nOxo makes many well-priced kitchen, cleaning and organization basics, and now, you can take 20% off all of them with promo code HOME20. Load up on peelers, choppers, measuring cups, leftover storage, sinkware, shower organizers, brooms, dusters, and much, much more on their site now.\nWayfair\nApril means it's time to start spring cleaning. Shop everything you need to get the job done at Wayfair's Spring Cleaning & Kitchen Sale. You'll find discounts on everything from small appliances and dishware, to bathroom storage and laundry essentials.\nFashion and beauty\nFashion and beauty\nThe North Face\nBe prepared for when it's time to venture outside again, or just gear up for next winter, with 25% off your purchase at The North Face. Promo code STAYCOZY will ensure the discount is applied to your cart. Just note that gift cards, clearance items, the Black Series, Summit Series, Steep Series, Flight Series and Icon Shop are all excluded from this sitewide deal.\nAdidas\nUpgrade your work-from-home uniform with 20% off select loungewear from Adidas. Use promo code AIDWEAR for savings on sweatshirts, tees, sweatpants, shorts, slides and more because if you have to stay home, at least you'll look good doing it.\nNordstrom\nThe department store is running two big promotions that will help you save on tons of designer styles. At the Spring Sale, you'll enjoy 40% off apparel, accessories, home decor and more, while The Better Together Sale, which lasts through Sunday at noon, is offering 25% off jeans for the whole family from best-selling brands like Frame, Rag & Bone, Good American, AG, Paige and more.\nPublic Rec\nRight now, all the casual cool basics for guys from Public Rec are 20% off with promo code TAKECARE. These wardrobe staples will keep you feeling comfortable and looking more put together than you have in weeks, probably.\nCrocs\nPick up a pair of some of the most comfortable shoes on the market. Crocs is taking 25% off sitewide, so trade in your slippers for some rubber-y slip-ons, or opt for some of Crocs' less distinctive sandals, flats, boots and more.\nUnder Armour\nWhether you're committed to at-home workouts or you're just lounging around, apparel from Under Armour will serve you well. Right now, take 25% off sitewide with code WFH25, and bring home tons of new activewear (or activewear that will double as loungewear).\nMadewell\nIf you're getting sick of sweatpants, get ready to slide on some quality denim thanks to Madewell's latest promotion. Select jeans from the brand are now just $75 and denim shorts are down to $35. Not to mention, all sale items are an extra 30% off with promo code SWEETDEAL.\nGap\nEverything at the Gap — and at sister stores Banana Republic and Old Navy — is 50% off the Family Event. There's no promo code necessary to snag discounts on apparel for the entire family.\nPuma\nGet moving at home or go for a socially distanced run in some stylish workout gear from Puma. Select styles from the activewear brand — including a whole bunch of sneakers — are 30% off with promo code REFRESH30 through April 6, so you can update your entire workout wardrobe now.\nCalvin Klein\nClassic loungewear from Calvin Klein, including bodysuits, robes, tees and hoodies, is an extra 20% off with code COZY, on top of an existing 30% off sitewide promotion. Staying home has never looked so stylish.\nLulus\nDon't hesitate to fill your cart at Lulus. Right now, everything from the retailer is buy two, get one free. No promo code is needed to snag the discount, so grab all the dresses, cute tops and stylish loungewear you've been eyeing now.\nFor more great deals, check out CNN Coupons.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/weekend-sales-deals/index.html"}