{"authors": ["Elissa Strauss"], "date_download": "2020-05-04 16:51:11", "date_modify": "2020-05-04 16:51:11", "date_publish": "2020-04-08 08:21:27", "description": "Most popular psychology today tells us to battle stress with calculated calm and solitude. But sometimes, we just need to dance.", "filename": "2020_04_08_health_family-dance-parties-coronavirus-wellness_index_1588611071.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407191245-family-dancing-living-room-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_health_family-dance-parties-coronavirus-wellness_index_1588611071.html", "title": "The power of family dance parties when the world is falling apart", "title_page": "The power of family dance parties when the world is falling apart - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) It took us about three days of social distancing before we decided to permanently relocate our coffee table to the corner.\nThe family dance party, once an at most weekly affair, had quickly become a nightly ritual and we needed our space.\nThere was the bouncing to Lil Nas X's \"Old Town Road,\" the swaying to Antonín Dvořák's \"Cello Concerto\" (the kids are into it, I swear), and the tributary grooving to Bill Withers' \"Lean on Me.\"\nMost popular psychology today tells us to battle stress with calculated calm and solitude. We are to take a step back and observe the crashing waterfalls of our lives from a distance. Breath in. Breath out.\nWhile it's true that mindfulness and meditation work, they're not cure-alls. Sometimes what we need to feel better is not detachment but other people and release. Sometimes we just need to dance.\nYes, there's science for music and movement to — as Madonna put it in \"Like a Prayer,\" another house favorite — \"take you there.\" This feeling is sometimes referred to as \"collective effervescence,\" a term created by Émile Durkheim over 100 years ago to describe the feelings of euphoria people experience during group religious ceremonies.\nWhen we share an experience with others, we tend to feel it more deeply and feel like we are connected to something larger than ourselves. The whole is greater than a sum of its parts.\nIt goes without saying that our opportunities to effervesce collectively have been exponentially reduced by social distancing. But for those of us living with our families or friends, not everything's off-limits. Really, turn off the lights and turn on Marvin Gaye and Tammi Terrell's \"Ain't No Mountain High Enough,\" or Martha and the Vandellas' hit \"Dancing in the Street,\" and I dare you to not effervesce.\nFamily dance parties — literally house parties — are giving us a chance to experience that special mix of connection and abandon on a regular basis. They're free, easy to execute and quite possibly the difference between my family holding it together and losing our minds during these extremely trying times. Here's why they might do the same for you.\nWhy dancing feels so good\nWhen we move our muscles, our bodies release endorphins, and those endorphins make us feel good. This is the case whether we kayak, play baseball, or dance.\nWhat makes dance special to this moment is that it's accessible — just clear out some space in your living room and turn on music — and it can be done together. And yet, somewhat paradoxically but also quite magnificently, it's a group activity that also allows for a lot of individual expression.\n\"What is unique about dance is that it is not just movement. It is movement that is connected to self-expression and our feelings,\" said Jody Wager, a board-certified dance therapist and director of the expressive therapy program at Dominion Hospital in Falls Church, Virginia. (Her favorite dance-along songs are Prince's \"Let's Go Crazy\" and \"Cha Cha\" from Balkan Beat Box.)\nI know I'm not the only parent who has asked her kids about their day or how they are feeling and has received a bored stare in response. Sometimes they're just not in the mood, and sometimes they just don't know what to say.\nWhile it's a parent's job to help children match words to feelings, it's also our job to help them express their feelings in other, nonverbal modes. This is especially the case in situations like our current one, when an unprecedented and scary new reality might have even us grown-ups at a loss for words ourselves.\nWhen we communicate with our bodies, we are not expected to make sense of things or string together a cohesive narrative. Movement taps into deeper feelings — more primal urges — and makes room for an inventiveness and silliness that language does not.\n\"Kids learn to move before they learn to read or sing. To allow them to move is to allow them to be some essential part of themselves with you in an important way,\" said Aili Bresnahan, a former dancer who teaches philosophy at the University of Dayton in Ohio.\nWhen kids dance freely, \"they're not on the receiving end of learning experiences. They are the givers, the makers, they are doing it themselves,\" said Bresnahan, who turns on Latin jazz when she needs a good, cathartic dance. (Some of her favorites for family dance parties include \"I Like It Like That\" by Pete Rodriguez and \"Mambo No. 5\" by Lou Bega.)\n\"In terms of making memories with the family, the songs chosen could be ones that have meaning to the family's cultural tradition,\" Bresnahan said. \"I grew up in East Harlem so Latin music does that for me — it was the neighborhood feel.\"\nAlong with self-expression, dancing also allows for a release of the anxiety that is rapidly accumulating in our bodies and minds and replaces it with something much nicer feeling.\n\"When we dance, the pleasure centers in our brains light up,\" Wager said, explaining that the playfulness of dance and the attendant freedom is a big reason why.\nIf you are, as Billy Idol put it in another extremely effervescent song, \"Dancing by Myself,\" you still have a lot to gain from grooving solo. The movement and music alone will likely boost your mood, and there's always the option of joining an Instagram house party, or creating a more intimate one through Zoom, to feel the rhythm alongside others.\nHow to get the family dancing\nWager said the first step to getting a family dance party routine going is to start with making smart music choices. Pick something with a beat that is irresistible — more Motown, less art rock — and allow the children to pick their favorite songs.\nFor younger children, add some role-playing to it. Maybe everyone has to dance like a particular animal, or even a particular color. Another option is freeze dance, which kids love — especially when they get to be in charge of the pause button. Or, someone can be the leader and everyone has to copy their moves.\nWager also suggests alternating faster music with slower music, which can help create a sense of ease whenever necessary. \"Put on some lyrical music and dance in a sustained way. When we do slow movements it can help trigger the relaxation response in our bodies.\"\nFor the dance-party resistant, Bresnahan suggests shutting off the lights, or throwing around a ball to the rhythm. \"Ask your kids: 'What do you want to do to that sound? How do you want to move to it?'\" she said.\n\"The earlier you get your kids dancing, the less self-conscious they will be about it later in life,\" she added.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nWhen we dance in our house, we let improvisation color the entire experience. Sometimes the lights are on, and sometimes they are off. Sometimes the music's fast, and sometimes it's mellow.\nSometimes we use instruments and props, and sometimes it's just bodies moving in space. Sometimes we dance for close to an hour, and sometimes it's just one or two songs.\nSometimes we \"Shake it Off\" (thank you Taylor Swift); some days we \"Fight Song\" (thank you Rachel Platten); and some days we bop around to wordless E.D.M. (electronic dance music), my older son's new favorite genre. Fortification comes in many flavors.\nMy kids know that unlike going outside or homeschooling, or the million things that were canceled overnight, this is something that can't go wrong.\nInstead, it's a reliable moment to reconnect with our bodies, our minds and each other. Unlike almost anything else we are doing right now, the million acts of family maintenance required to make it through the day, the dance party is one thing that is truly for us, and by us — together.", "url": "https://www.cnn.com/2020/04/08/health/family-dance-parties-coronavirus-wellness/index.html"}