{"authors": ["Por Berenice Bautista"], "date_download": "2020-05-04 20:18:57", "date_modify": "2020-05-04 20:18:57", "date_publish": "2020-04-16 17:32:59", "description": "CIUDAD DE MÉXICO (AP) — Ana de la Reguera presenta su lado más chistoso en una nueva serie semiautobiográfica con la que espera mejorar los ánimos del público durante la cuarentena. La...", "filename": "_4fea108f6b954ee3a82f0b0a05dd4c34_1588623537.html", "image_url": "https://storage.googleapis.com/afs-prod/media/655ea64daa464454aec2a638e1a2351b/1280.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4fea108f6b954ee3a82f0b0a05dd4c34_1588623537.html", "title": "De la Reguera presenta su lado más chistoso en serie “Ana”", "title_page": "De la Reguera presenta su lado más chistoso en serie “Ana”", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nEn esta imagen proporcionada por Comedy Central Latinoamérica la actriz Ana de la Reguera en una escena de la serie \"Ana\" que se estrena en Comedy Central el 20 de abril de 2020. (Comedy Central Latinoamerica via AP)\n1 of 2\n1 of 2\nEn esta imagen proporcionada por Comedy Central Latinoamérica la actriz Ana de la Reguera en una escena de la serie \"Ana\" que se estrena en Comedy Central el 20 de abril de 2020. (Comedy Central Latinoamerica via AP)\n1 of 2\n1 of 2\nCIUDAD DE MÉXICO (AP) — Ana de la Reguera presenta su lado más chistoso en una nueva serie semiautobiográfica con la que espera mejorar los ánimos del público durante la cuarentena.\nLa actriz mexicana, conocida por “Nacho Libre”, “Jane the Virgin” y “El crimen del cácaro Gumaro”, dice que siempre ha sido “súper desparpajada y desmadrosa”, con un “humor muy ácido”, pero que nunca había tenido oportunidad de mostrarlo en cámara.\n“Siempre he sido así... (pero) creo que la gente sólo conocía un lado mío”, dijo en una entrevista telefónica reciente desde su casa en Los Ángeles.\nEso cambiará el lunes cuando “Ana” se estrene por Comedy Central Latinoamérica con un doble capítulo seguido de episodios semanales, así como en Pantaya en Estados Unidos, donde debuta la temporada completa. El martes también llegará toda la temporada a Amazon Prime Video.\nPara la actriz, la serie de 10 capítulos refleja un momento de cambio personal y rompimiento con su familia. “Ana” surgió después de haber hecho muchas pruebas para un personaje de comedia que soñaba hacer pero que no se dio, y eso fue algo que le pegó duro.\n“De pronto dije, ‘¿sabes qué? Yo no me voy a quedar con las ganas de hacer algo que me gusta tanto y que yo tenga que depender de otros para poder hacer un personaje como ese’”, señaló.\nEn “Ana”, su personaje casi puede saborear la victoria de ser elegida en un casting importante en Los Ángeles cuando se entera que le dieron el papel a una “influencer” más joven que de paso no le cae nada bien. A sus casi 40 años, con la renta atrasada meses, las revistas de farándula retratándola en situaciones comprometedoras y su madre llamándola por teléfono para decirle qué hacer, Ana se enamora de la hija de uno de sus galanes.\n“Siempre tenemos a la mamá o al papá o algún familiar dentro de nuestra cabeza cuando vas a hacer algo que no debes”, dijo De la Reguera sobre su madre, interpretada en la serie por la actriz Tina Romero, quien la acompaña como una especie de consciencia que se le aparece cuando hace cosas “tremendas” como salir en público sin usar labial.\nLa hermana de Ana en la vida real, la rockera mexicana Ali Gua Gua, tiene una participación especial en la serie.\n“Casi la obligué a hacerlo porque no quería”, dijo alegre De la Reguera. “Mi hermana siempre ha sido una de las inspiraciones más grandes en mi vida y yo le agradezco mucho que haya estado en mi vida”.\nLa hermana de la actriz es lesbiana, fuma marihuana, siempre la está empujando a romper las reglas y a atreverse a salir de los esquemas. Es un contraste muy grande con su madre, quien fue Miss Veracruz y vive muy preocupada de las apariencias.\n“Yo crecí entre de esas dos personas y para mí fue muy interesante, me ayudó mucho a mi personalidad porque no soy nada más de un lado o del otro, creo que tengo un punto medio entre las dos y eso me gusta”, dijo De la Reguera.\nOtro de los temas recurrentes es precisamente la marihuana, cuyo uso recreacional en California es legal. En la serie, Ana también es consumidora y a veces imagina musicales cuando fuma, otras veces canta con choferes de Uber.\n“Siempre ha sido un tema que me ha llamado mucho la atención en general, cómo socialmente y cómo durante años han criminalizado la marihuana”, dijo De la Reguera. “Si metes en una discoteca a 500 chavos (chicos) y les das un churrito de marihuana todos van a acabar abrazados y bailando y felices o sentados en el sillón. Si los metes todos borrachos, van a acabar en pleitos, vomitando”.\n“Cuando mucho, si les das demasiada marihuana van a acabar dormidos, pero nadie se ha muerto de una sobredosis de marihuana”, añadió. “Para mí era importante también hablar de eso. Yo no estoy queriendo promoverlo, pero también sentía que era un buen momento para hablar”.\nDe momento De La Reguera quisiera que la serie tenga unas tres temporadas, pero no muchas más. La actriz además fungió como productora de la primera, una experiencia que calificó como muy gratificante.\n“Fue un aprendizaje bien intenso”, dijo. “Sobre todo cuando es algo tan personal porque cada cosa, cada coma, cada foto, todo te importa... Ha sido muy entretenido y también ha sido mi mayor escuela, yo creo. El último año he aprendido de todo, de edición, sonido, de números, de negociaciones. Ha sido súper interesante”.\nEntre sus próximos estrenos como actriz también están la secuela de “The Purge” (“La Purga”) y la película de terror “Army of the Death” de Netflix, por ahora sin fecha de estreno definida debido a la pandemia.\nPor lo pronto está disfrutando su casa en Los Ángeles mientras pasa la cuarentena. Es algo que no siempre tiene oportunidad de hacer porque se la pasa entre Miami, Ciudad de México y Veracruz.\n“Como viajo tanto y siempre estoy trabajando, cuando estoy en Los Ángeles lo que más me gusta es estar en mi casa”, dijo De la Reguera. “El año pasado creo que estuve en mi casa dos semanas y este año llevaba también como dos semanas nada más”.", "url": "https://apnews.com/4fea108f6b954ee3a82f0b0a05dd4c34"}