{"authors": [], "date_download": "2020-05-04 20:17:46", "date_modify": "2020-05-04 20:17:46", "date_publish": "2020-03-13 00:06:08", "description": "Today in History Today is Friday, March 13, the 73rd day of 2020. There are 293 days left in the year. Today's Highlight in History:", "filename": "_0a0eca170d4f4ffd805937d5bf3f9a74_1588623466.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0a0eca170d4f4ffd805937d5bf3f9a74_1588623466.html", "title": "Today in History", "title_page": "Today in History", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Today in History\nToday is Friday, March 13, the 73rd day of 2020. There are 293 days left in the year.\nToday’s Highlight in History:\nOn March 13, 2013, Jorge Bergoglio (HOHR’-hay behr-GOHG’-lee-oh) of Argentina was elected pope, choosing the name Francis; he was the first pontiff from the Americas and the first from outside Europe in more than a millennium.\nOn this date:\nIn 1639, New College was renamed Harvard College for clergyman John Harvard.\nIn 1862, President Abraham Lincoln signed a measure prohibiting Union military officers from returning fugitive slaves to their owners.\nIn 1865, Confederate President Jefferson Davis signed a measure allowing black slaves to enlist in the Confederate States Army with the promise they would be set free.\nIn 1901, the 23rd President of the United States, Benjamin Harrison, died in Indianapolis at age 67.\nIn 1925, the Tennessee General Assembly approved a bill prohibiting the teaching of the theory of evolution. (Gov. Austin Peay (pee) signed the measure on March 21.)\nIn 1933, banks in the U.S. began to reopen after a “holiday” declared by President Franklin D. Roosevelt.\nIn 1934, a gang that included John Dillinger and “Baby Face” Nelson robbed the First National Bank in Mason City, Iowa, making off with $52,344.\nIn 1954, the Battle of Dien Bien Phu began during the First Indochina War as Viet Minh forces attacked French troops, who were defeated nearly two months later.\nIn 1969, the Apollo 9 astronauts splashed down, ending a mission that included the successful testing of the Lunar Module.\nIn 1975, the first Chili’s restaurant was opened in Dallas by entrepreneur Larry Lavine.\nIn 1980, Ford Motor Co. Chairman Henry Ford II announced he was stepping down, the same day a jury in Winamac, Indiana, found the company not guilty of reckless homicide in the fiery deaths of three young women in a Ford Pinto.\nIn 1996, a gunman burst into an elementary school in Dunblane, Scotland, and opened fire, killing 16 children and one teacher before killing himself.\nTen years ago: At least 30 people were killed in a series of Taliban suicide bombings in Afghanistan in what appeared to be a failed attempt to free inmates from a Kandahar prison. The Vatican denounced what it called aggressive attempts to drag Pope Benedict XVI into the spreading scandal of pedophile priests in his German homeland. With the biggest fight crowd in the U.S. in 17 years cheering him on at Cowboys Stadium, Manny Pacquiao dominated Joshua Clottey from the opening bell to retain his welterweight title.\nFive years ago: In his first visit to the Phoenix Veterans Affairs hospital whose practices sparked a health care scandal, President Barack Obama acknowledged lingering weaknesses in the federal government’s response to the chronic delays and false waiting lists in the VA health system. Al Rosen, the muscular third baseman who won the 1953 AL MVP and played on the last Cleveland Indians team to win the World Series, died in Rancho Mirage, California, at age 91.\nOne year ago: A late winter storm brought blizzards, floods and a tornado across more than 25 states from the northern Rocky Mountains to Texas and beyond. A federal judge in Washington increased to a total of seven and a-half years the prison sentence for former Trump campaign chairman Paul Manafort for misleading the government about his foreign lobbying work; Manafort was also hit with fresh state charges in New York accusing him of giving false information on mortgage loan applications. (A state judge later threw out those charges.) Cardinal George Pell, the most senior Catholic to be convicted of child sex abuse, was sentenced in Australia to six years in prison for molesting two choirboys in an Australian cathedral. California Gov. Gavin Newsom signed an executive order granting reprieves to all 737 condemned inmates on the nation’s largest death row, putting a moratorium on executions during his term as governor.\nToday’s Birthdays: Jazz musician Roy Haynes is 95. Country singer Jan Howard is 90. Songwriter Mike Stoller (STOH’-ler) is 87. Singer-songwriter Neil Sedaka is 81. R&B/gospel singer Candi Staton is 80. Opera singer Julia Migenes is 71. Actor William H. Macy is 70. Comedian Robin Duke is 66. Actress Dana Delany is 64. Sen. John Hoeven, R-N.D., is 63. Rock musician Adam Clayton (U2) is 60. Jazz musician Terence Blanchard is 58. Actor Christopher Collet is 52. Rock musician Matt McDonough (Mudvayne) is 51. Actress Annabeth Gish is 49. Actress Tracy Wells is 49. Rapper-actor Common is 48. Rapper Khujo (Goodie Mob, The Lumberjacks) is 48. Singer Glenn Lewis is 45. Actor Danny Masterson is 44. Bluegrass musician Clayton Campbell (The Gibson Brothers) is 39. Actor Noel Fisher is 36. Singers Natalie and Nicole Albino (Nina Sky) are 36. Actor Emile Hirsch is 35. Olympic gold medal skier Mikaela Shiffrin is 25. Tennis star Coco Gauff is 16.\nThought for Today: “History repeats itself. That’s one of the things wrong with history.” — Clarence Darrow, American lawyer (born 1857, died this date in 1938).", "url": "https://apnews.com/0a0eca170d4f4ffd805937d5bf3f9a74"}