{"authors": [], "date_download": "2020-05-04 16:27:00", "date_modify": "2020-05-04 16:27:00", "date_publish": "2020-04-07 16:08:00", "description": "We're big fans of Animal Crossing New Horizons and our full review is just the tip of the iceberg. As is the nature with any game, the more you play the more you discover. That's no different with New Horizons.", "filename": "2020_04_07_cnn-underscored__66cbe5352e53fcba5de907ca52bfe5ff_index_1588609620.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330121447-underscored-animal-crossing-picnic-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_cnn-underscored__66cbe5352e53fcba5de907ca52bfe5ff_index_1588609620.html", "title": "Animal Crossing New Horizons Tips", "title_page": "Animal Crossing New Horizons Tips - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "We're big fans of Animal Crossing New Horizons and our full review is just the tip of the iceberg. As is the nature with any game, the more you play the more you discover. That's no different with New Horizons.\nThe team at CNN Underscored has been playing New Horizons, as well as searching the web for the best tips. We're presenting them to you right here. And of course, if you haven't joined the New Horizons party, you can get the game for $59.99 and pair it with a Switch Online plan.\nMake money trees\nYes, there's no better feeling than finding a glowing spot in the ground. After all, it signifies that a bag of money is underneath. But rather than pocketing it, you can play the long card and start growing a money tree. Simply bury that bag in the same hole (it needs to be the same glowing hole) and a money tree will appear in a few days. By default, that 1,000 Bell bag will transfer into 3,000 bells in a few day's time. But you can increase the investment by putting more money back into the hole.\nMake big bucks with fruit\nEverybody starts New Horizons with a native fruit, one of six varieties. On your home island, the fruit you started with sells for a measly 100 Bells, with coconuts going for 250. But the real money lies in foreign fruit! That's right, when you visit a Nook Miles or friend's island, be sure to bring back some of its fruit if it's different from your own. You can sell it right away for 500 a piece or plant it for future profits. Alternatively, you can bring your own fruit to a friend's island and sell it there. Just be sure to ask for permission if the island belongs to a player.\nCreate hybrid flowers\nAnimal Crossing: New Horizons\nFirst off, you should water your flowers. Not only does it encourage them to bloom faster, but flowers next to each other, when watered properly and regularly, will crossbreed into new color variations. The possibilities are endless. You can grow brown tulips or orange roses. You'll know that flowers are watered properly as they will glisten with water sparkles. A pro tip for crossbreeding flowers: plant them in a checkerboard pattern that has an open space between your two seedings. This way your new flowers have a place to call home.\nFish with your ears and hands\nFishing is one of the main ways to grow your museum collection and make money in New Horizons. But catching fish can sometimes be easier said than done. Visually, the fish first needs to be attracted to your rod, then it will fake you out one or two times before latching on. You can clearly hear or feel the difference between the sound and rumble effect on the Joy-Cons of the Switch. Try fishing with your eyes closed, you can hear or feel the difference. Chances are you'll catch more fish.\nBe friendly to your villagers\nAnimal Crossing: New Horizons\nYes, you're tasked as being the resident representative of your island. But your work isn't just making the island look beautiful and getting residents to move there. Forming relationships by talking with other villagers not only will help you earn Nook Miles, but they can give you gifts. Those gifts can be DIY recipes or even new items.\nStrike luck with tarantula island\nYou likely know that you can use your Nook Miles to get tickets to go to random islands. There, you can pillage the environment by collecting fruit, chopping down trees for wood, breaking stones for resources and, of course, collecting creatures. And if you get lucky, you might just board a flight to tarantula island. It'll be stressful and catching tarantulas is a tricky process, but the reward is you walking away with several creatures that you can sell for around 6,000 bells. It's best to sneak up on them, so walk close then hold down \"A\" when the net is selected. Then approach the tarantula and pounce. Repeat until your inventory is full.\nAnd you're not out of luck if you don't land on tarantula island, as you can make it yourself. You'll need to clear out the island, so tarantulas have clear grass to spawn on. The solution? Move flowers to the beach, pluck up some weeds, chop down trees and crack rocks. Now with some clear glass, give it a few minutes and you should be in tarantula heaven. Or maybe just in a place where you can catch them and make a ton of bells. Be warned though a new one will spawn about every minute.\nShoot down balloons\nOnce you've acquired a slingshot (either as a gift or by purchasing it from your store), you'll be able to shoot down the floating balloons. These are red and white present boxes floating high above you, with a balloon attached to the top. You'll want to line up and then press \"A\" with the slingshot selected to fire at the balloon. If you make contact, the balloon pops and the present falls to the ground. What's inside? Well, it could be resources (aka stone or wood), furniture, DIY recipes to make new items, bells or even clothing.\nTurnips are like the stock market\nSundays in Animal Crossing New Horizon are turnip days. This is the day you can buy turnips, generally at a cost between 90 bells to a little over 100 bells. The choice on how many you purchase is ultimately yours, but the goal is to turn the turnips for a profit. A good selling price is someone in the realm of 600 bells per turnip, which would allow you to make a good investment. You can check the buy-back price on turnips in your store Monday through Saturday, but we also recommend visiting other islands to get the best price.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/07/cnn-underscored/animal-crossing-new-horizon-tips-nintendo-switch/index.html"}