{"authors": ["Senior Women'S Reporter"], "date_download": "2020-05-04 20:17:31", "date_modify": "2020-05-04 20:17:31", "date_publish": "2020-04-28 09:45:09", "description": "In a quarantine world increasingly dominated by loungewear, bralessness and soft pants, underboobs are all the rage on our TV screens and iPhones.", "filename": "entry_netflix-too-hot-to-handle-underboob_n_5ea74bb9c5b6dd3f908958d6_1588623451.html", "image_url": "https://img.huffingtonpost.com/asset/5ea7561e220000e10b827bdb.png?cache=5ahtcaaa70&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_netflix-too-hot-to-handle-underboob_n_5ea74bb9c5b6dd3f908958d6_1588623451.html", "title": "What’s The Deal With All The Underboob On ‘Too Hot To Handle’?", "title_page": "What’s The Deal With All The Underboob On ‘Too Hot To Handle’? | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Netflix Haley, a contestant on Netflix reality show \"Too Hot To Handle,\" shows off some subtle underboob in the interview booth.\nIf being nearly seven weeks into quarantine has taught us anything, it’s that certain fashion-based discomforts are, if not oppressive, at least wholly unnecessary. Jeans? Goodbye. Restrictive waistbands? Farewell. High Heels? Sayonara. Bras? Never heard of ’em.\nBut while white-collar workers around the world settle into their “soft pants,” the women of Netflix’s new “Love Island”-esque reality show “Too Hot To Handle” are showing us the summer styles of the conventionally uber-attractive and under-30 set. One major theme? Underboob.\n“The real winner of this show is under boob” - my roommate on #TooHotToHandle — Natalie Johnson (@Natalieej11) April 22, 2020\nFor the uninitiated, underboob describes the curved underbelly of the breast, usually shown off via inexplicable-tan-line-causing swimsuit tops or extra, extra cropped T-shirts. Sometimes, the underboob is paired with some traditional cleavage. Sometimes, it stands on its own.\nAll I know is that it’s present in nearly every scene of “Too Hot To Handle,” a show in which swipe-addicted, sex-crazy single people have to avoid physical touch and make “deeper connections.”\nThese singles hail from across the English-speaking globe — Ireland, England, the United States, Canada, Australia — but underboob apparently knows no borders. If “Too Hot To Handle” is to be believed, the one thing that unites Very Conventionally Hot Women is the desire to display just a tad of the under-areola portion of the breast. See below for a sampling:\nThere’s this underboob:\nNetflix\nAnd this underboob:\nNetflix\nAnd this dual underboob:\nNetflix\nOh, and this slightly more subtle underboob:\nNetflix\nAfter binge-watching all of “Too Hot To Handle” in one weekend, I noticed the underboob but didn’t think much of it. A few days later, a friend who had also just watched the show came to me with questions. Namely: What was the deal with all of the underboob?\nOur discussion brought up more questions than answers: Was this a new trend, or did we all just have too much time on our hands during quarantine? Where did this start? How did it work with that whole gravity thing? Was it even hot?\nI remained confused, so I decided to conduct a (very light) investigation. First, I tried to turn to the experts, but for some reason, the fashion historians at the Museum of FIT decided to “pass on this topic.” Perhaps they, too, find areola-strip T-shirts to be confounding. Despite the minor setback, I pressed on: to Google.\nTurns out that people have been talking about the curious case of underboob for at least 15 years.\nThe Guardian bemoaned the ever-multiplying breast-centric categorizations (and their commercial censorship) all the way back in 2006. “Underboobs are an invention of the glamour industry,” wrote Tim Lott, “desperate for new patches of flesh for women to reveal and excite gullible men.”\nThe underboob-focused subreddit (r/underboob, naturally), a space “devoted to the best part of the boob: the underboob!” was created in January 2009. And Jezebel declared it to be the ”golden age of innerboob, sideboob and underboob” in 2013, the year that Beyoncé rocked some tasteful underboob on the cover of GQ Magazine.\nGQ\nThis current wave of underboob mania seems to be spurred on, like so many aesthetic trends, by Instagram. Models, celebrities and influencers like Bella Hadid, Kendall Jenner and Olivia Culpo regularly show off their perfectly rounded underboobs in magazine spreads, on beaches, under cropped tees worn while dog-walking. More than 400,000 posts are hashtagged #underboob, though many of them will not show up in a search because of Instagram’s community guidelines. Fast fashion followed suit, and a simple Google search now turns up underboob-baring bikinis from brands like SheIn, ASOS, Nasty Gal and Fashion Nova.\nIt seems that the “glamour industry” has succeeded in making underboob mainstream. And so it ended up all over a Netflix reality show binged by thousands of people stuck in their homes who are switching back and forth between day and night leggings.\nFor posterity and journalism and science, I decided that I needed to experiment with some underboob in the safety and privacy of my own, solitary home. I put on a form-fitting cami and tucked it under halfway, just to the areola.\nThe aesthetic worked — sort of. By “worked” I mean that my breast stayed generally in place, didn’t completely flatten like a pancake, and there were no nip slips. But was it flattering? Not really. (I remain convinced that to recreate this style without a tight top requires the wearer's hands to stay constantly raised and/or a breast augmentation.)\nGuess I’ll be leaving the Underboob Adventures to the sexy influencer reality television set. Godspeed.", "url": "https://www.huffpost.com/entry/netflix-too-hot-to-handle-underboob_n_5ea74bb9c5b6dd3f908958d6"}