{"authors": ["Neal Meyer", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Miles Kampf-Lassin", "Branko Marcetic"], "date_download": "2020-05-04 19:53:43", "date_modify": "2020-05-04 19:53:43", "date_publish": "2020-01-07 00:00:00", "description": null, "filename": "2020_01_aoc-joe-biden-alexandria-ocasio-cortez-same-party_1588622023.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/01/07082616/GettyImages-1188748717.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_01_aoc-joe-biden-alexandria-ocasio-cortez-same-party_1588622023.html", "title": "AOC Is Right: She and Joe Biden Should Not Be in the Same Party", "title_page": "AOC Is Right: She and Joe Biden Should Not Be in the Same Party", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Alexandria Ocasio-Cortez is right. She, Bernie Sanders, and the millions of working-class people ready to fight for a “political revolution” don’t belong in the same political party as Joe Biden. The fact that they nevertheless are all “Democrats” is one of the most frustrating facts of American politics.\nIn a recent interview with New York magazine, AOC seemed to indicate that the thought of a Joe Biden presidency does not inspire her — to put it politely. AOC groaned, according to the article, and then confessed: “Oh God. In any other country, Joe Biden and I would not be in the same party, but in America, we are.”\nUnsurprisingly, Ocasio-Cortez’s comments are making the rounds. Ben McAdams, the Democratic representative for Utah’s 4th congressional district, pounced on AOC for supposedly forgetting that as Democrats “we’re all on the same team.” Fred Guttenberg, a prominent gun safety advocate, called her points “disturbing and wrong.” And many random liberal Twitter users expressed some version of “Why don’t you join another party then?”\nBut are we really on the same team?\nThe political distance between AOC and Bernie Sanders on the one hand, and Joe Biden on the other, is stunning. They’re not on the same team when it comes to their vision for America — and thank God for that.\nOn Medicare for All? AOC and Sanders believe that health care is a right, and that it should be guaranteed to everyone from birth to death via a single-payer plan. Biden disagrees, and he supports preserving the for-profit health insurance system that bankrupts millions but lines the pockets of billionaires.\nOn the environment? AOC and Sanders back a multitrillion-dollar Green New Deal that will transform our economy, pushing us rapidly toward one-hundred-percent renewable energy to avert the worst effects of climate change. On the other hand, as the Sunrise Movement details extensively in their candidate scorecard, Biden’s plan fails in almost every regard to measure up to the moment. The kind of tepid transition to renewable energy — the kind that Biden argues for — is so insufficient that it is, in AOC’s words, “a form of denialism.”\nOn mass incarceration? AOC and Sanders want to end it. Biden built his early career pushing Ronald Reagan from the right to create it.\nOn Social Security? AOC and Sanders want to dramatically expand it. Biden has a history — first in the 1990s and then again in the early 2010s — of trying to slash it.\nOn abortion rights? AOC and Sanders are categorically in favor. Biden has consistently equivocated.\nOn war? AOC and Sanders vigorously oppose US military action abroad. Biden voted for the Iraq War and has been a reliable hawk in Washington, DC, for decades.\nThese are not candidates running on the same agenda or cut from the same cloth. AOC, Sanders, and other democratic socialists run their campaigns exclusively through the support of working-class volunteers and contributors. Meanwhile, Biden (and Pete Buttigieg, Amy Klobuchar, and almost every other Democrat) run campaigns bankrolled by Wall Street and other big-money donors and managed by mercenary consultants.", "url": "https://www.jacobinmag.com/2020/01/aoc-joe-biden-alexandria-ocasio-cortez-same-party"}