{"authors": ["Senior Reporter", "Huffpost Life"], "date_download": "2020-05-04 21:09:07", "date_modify": "2020-05-04 21:09:07", "date_publish": "2020-05-01 00:08:37", "description": "Here's what to know about guest etiquette for a Zoom ceremony during the coronavirus pandemic.", "filename": "entry_rudest-things-at-virtual-wedding_l_5eab1949c5b6c470eedee6f1_1588626547.html", "image_url": "https://img.huffingtonpost.com/asset/5eab6146220000690d827f75.jpeg?cache=E76P4axVIN&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_rudest-things-at-virtual-wedding_l_5eab1949c5b6c470eedee6f1_1588626547.html", "title": "The Rudest Things You Can Do At A Virtual Wedding", "title_page": "The Rudest Things You Can Do At A Virtual Wedding | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "As social distancing practices have forced more couples to move their weddings online, the rest of us are left wondering about the proper etiquette for participating in such an event.\n“A wedding is a wedding, whether virtual or in person,” etiquette expert Diane Gottsman — author of “Modern Etiquette for a Better Life” and founder of The Protocol School of Texas — told HuffPost. “Following some etiquette rules will keep the ceremony and the mood upbeat and celebratory.”\nWe asked experts to reveal the rudest things someone could do at one of these virtual gatherings so you know which faux pas to avoid.\n1. Forgetting to mute yourself.\nIf the host of the videoconference doesn’t do it for you, be sure to mute your audio until the end of the ceremony.\n“Nothing is worse than hearing your shuffling or kids yelling in the background as the couple is declaring ’til death do them part,” said Janessa White, founder of Simply Eloped. “There will be a time when the officiant or couple will invite you to un-mute and either acknowledge having acted as witness or to simply celebrate with the newlywed couple.”\n2. Looking like you just rolled out of bed.\nYou don’t have to wear a floor-length gown or a tuxedo, but do try to look presentable. Style your hair, change out of your pajamas and put on a proper outfit.\n“If there is a theme, honor it. If there is no theme, don’t let the fact that you are sitting in your living room give you cover for wearing a T-shirt and shorts,” said etiquette columnist Thomas P. Farley, also known as Mister Manners.\nAnd even if you’re attending from afar, you still shouldn’t wear white.\n“Even virtually, a guest should dress to show respect,” Gottsman said. “Underdressing or wearing white will be noticed by the couple and fellow attendees.”\n3. Trying to multitask during the ceremony.\nAt home, distractions abound, with pets, kids, deliveries, work obligations and a pile of laundry all vying for your attention. But do your best to stay fully present for the duration of the ceremony, just as you would if you were attending in real life. That means no multitasking.\n“Although you may be in the comfort of your own home, refrain from doing things such as eating or talking to others,” said etiquette expert Elaine Swann, founder of the Swann School of Protocol. “It’s rude to not give the bride and groom your undivided attention.”\n“Just because you think Charlie from accounting might enjoy a break from Netflix to watch his co-worker get married does not mean it’s your place to extend such an invite.” - Thomas P. Farley, also known as Mister Manners\n4. Showing up late.\nWith some video conferencing platforms, a chime may sound when a new participant enters the meeting (though you can disable the setting). So if you’re late, you could potentially disrupt the ceremony and ruin the moment.\n“Enter the meeting — aka ceremony — at the right time and resolve any computer issues beforehand to avoid technical difficulties,” Gottsman said.\nWhite said she encourages guests to be ready five minutes before the ceremony start time, “so that when the virtual room opens, they can be there and prepared to witness a beautiful moment on time.”\n5. Sharing the videoconference link without the couple’s permission.\n“Just because you think Charlie from accounting might enjoy a break from Netflix to watch his co-worker get married does not mean it’s your place to extend such an invite,” Farley said. “If there is someone you think the couple may have inadvertently missed, ask the couple before sharing the link and/or conference password.”\nIn the same vein, Swann said it would be inappropriate to record the ceremony or livestream it from your accounts without talking to the couple first.\n“A wedding is still a private affair, and the invitation is meant for specific attendees only,” she said. “Sharing it is like bringing a large group of uninvited people to someone’s wedding.”\n6. Posting screengrabs on social media without asking the couple.\nHold off on sharing that photo of the newlyweds’ first kiss unless you’ve gotten their blessing to do so.", "url": "https://www.huffpost.com/entry/rudest-things-at-virtual-wedding_l_5eab1949c5b6c470eedee6f1"}