{"authors": [], "date_download": "2020-05-04 16:02:48", "date_modify": "2020-05-04 16:02:48", "date_publish": "2020-03-25 19:54:57", "description": "While you're stuck at home, keep your furry friends entertained with these chew toys, scratch pads, treat-dispensing toys and more.", "filename": "2020_03_25_cnn-underscored_best-toys-treats-cats-dogs_index_1588608168.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200323132038-pettoyslead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_25_cnn-underscored_best-toys-treats-cats-dogs_index_1588608168.html", "title": "All the toys and treats you need to keep your pet happy at home", "title_page": "Best toys and treats for cats and dogs: Entertaining pets at home - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "If you're staying close to home to practice social distancing, it's essential to find ways to keep your pets entertained, healthy and happy.\nWhile you're trying to work from home, you may be faced with a cat who wants to sit on your keyboard, or a dog who decides to yap during a conference call — or just sits there looking at you with wistful eyes, holding a favorite toy or a leash.\nLuckily, there are plenty of toys that provide ways to keep them busy while boosting their mental and physical skills.\nFrom a treat-dispensing puzzle for dogs to a tower of spinning balls for cats, we've picked out some of our favorite interactive toys to keep your furry friends happy and healthy (and your furniture scratch- and chew-free!) while you WFH. The best part? Prices start at just $6.\nFrisco Cat Tracks Butterfly Cat Toy ($7.98; chewy.com)\nFrisco Cat Tracks Butterfly Cat Toy\nStimulate your cat's senses with this scratch-resistant tiered tower of spinning balls to keep Kitty entertained for hours.\n_______________________________________________________________________________\nPet Qwerks Blinky Babble Ball Interactive Dog Toy ($8.54, originally $11.99; chewy.com)\nPet Qwerks Blinky Babble Ball Interactive Dog Toy\nIf your dog perks up every time he hears the sound of another furry friend, he'll love this Babble Ball, which flashes and makes up to 18 different sounds.\n_______________________________________________________________________________\nHaute Diggity Dog Woof Cliquot Rosé Dog Toy (starting at $12.95; nordstrom.com)\nHaute Diggity Dog Woof Cliquot Rosé Dog Toy\nGive your pup this Dog Woof Cliquot Rosé squeaky toy so she can enjoy happy hour with you, too!\n_______________________________________________________________________________\nSuck UK DJ Deck Cat Scratching Pad ($20.98, originally $35; nordstrom.com)\nSuck UK DJ Deck Cat Scratching Pad\nYour cat will love laying down some beats on this cardboard DJ deck.\n_______________________________________________________________________________\nIFetch Interactive Ball Launcher for Dogs ($115, originally $126.50; chewy.com)\niFetch Interactive Ball Launchers for Dogs\nYour dog can still play fetch while you work from home, thanks to this interactive ball launcher.\n_______________________________________________________________________________\nHaute Diggity Dog Lick Croix Barkling Water Plush Dog Toy ($15.95; nordstrom.com)\nHaute Diggity Dog Lick Croix Barkling Water Plush Dog Toy\nIf your dog loves plush toys, this adorable \"Lick Croix\" bottle will be her new favorite.\n_______________________________________________________________________________\nSuck UK Laptop Cat Scratching Pad ($20.98, originally $35; nordstrom.com)\nSuck UK Laptop Cat Scratching Pad\nWorking from home? Now your cat can stay busy right alongside you. This kitty laptop even includes a mouse.\n_______________________________________________________________________________\nPetstages Cheese Chase Tracks Cat Toy ($14.22, originally $24.99; chewy.com)\nPetstages Cheese Chase Tracks Cat Toy\nYour cat can chase, bat and play for hours with this interactive Cheese Chase toy. It's even got a catnip-filled mouse to keep Kitty interested.\n_______________________________________________________________________________\nOutward Hound Nina Ottosson Puzzle Brick Dog Toy ($18.08, originally $24.99; chewy.com)\nOutward Hound Nina Ottosson Puzzle Brick Dog Toy\nIncrease stimulation and challenge your dog's mind with this brick puzzle. He can flip and slide to reveal hidden treats in each compartment.\n_______________________________________________________________________________\nYoungever 24 Cat Toy Assortment ($9.95, originally $11.95; chewy.com)\nYoungever 24 Cat Toy Assortment\nThis 24-pack of toys will keep your cat entertained for hours. It's got tunnels, teaser wands, fluffy mice and more.\n_______________________________________________________________________________\nKong Classic Dog Toy (starting at $7.49, originally $7.99; petco.com)\nKong Classic Dog Toy\nIf your pup loves peanut butter, then this Kong rubber toy is a must-have. Fill it and freeze it for a treat or let her chew and play with it all day long. (Just make sure the peanut butter doesn't contain the sweetener xylitol, which is toxic to dogs.)\n_______________________________________________________________________________\nLoveThyBeast Avocado Suede Dog Toy ($14.95; nordstrom.com)\nLoveThyBeast Avocado Suede Dog Toy\nAnother cute toy (for light chewers!) in the shape of an avocado.\n_______________________________________________________________________________\nTuff Mutt Hands-Free Bungee Leash ($22.97, originally $24.99; chewy.com)\nTuff Mutt Hands-Free Bungee Leash\nThis hands-free dog leash allows you to multitask while guiding your dog. Its strong dual bungee construction also absorbs Rover's jerks and lunges.\n_______________________________________________________________________________\nBergan Turbo Scratcher Cat Toy ($9.44, originally $10.49; chewy.com)\nBergan Turbo Scratcher Cat Toy\nIt's hard to go wrong with a cat scratcher surrounded by a rolling ball that your kitty can bat around all day.\n_______________________________________________________________________________\nPooch Cake Wheat-Free Peanut Butter Cake Mix ($6.99; chewy.com)\nPooch Cake Wheat-Free Peanut Butter Cake Mix\nJust add water, an egg and vegetable oil to this peanut butter cake mix for dogs and soon you'll be their best friend, too.\n_______________________________________________________________________________\nOurPets IQ Treat Ball Interactive Dog Toy ($9.95; chewy.com)\nOurPets IQ Treat Ball Interactive Dog Toy\nProlong playtime with this treat-dispensing ball. Not only does it slow down feeding for dogs who eat too fast, but it stimulates their minds while keeping them entertained for hours.\n_______________________________________________________________________________\nP.L.A.Y. Nova Stick Toy ($14; nordstrom.com)\nP.L.A.Y. Nova Stick Toy\nIf your dog is a heavy chewer, she will love this Nova Stick Toy that's ultradurable and cleans her teeth while she chews.\n_______________________________________________________________________________\nBarkBox subscription (starting at $22; barkbox.com)\nBarkBox subscription\nAn easy way to prevent your dog from distracting you is treating Rover to a BarkBox. These are delivered right to your door and are full of exciting toys and snacks to keep your pooch occupied while you try out one of your new hobbies. Plus, if you sign up before April 2, you can double your first box for free.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/03/25/cnn-underscored/best-toys-treats-cats-dogs/index.html"}