{"authors": ["Nicole Winfield"], "date_download": "2020-05-04 20:16:13", "date_modify": "2020-05-04 20:16:13", "date_publish": "2020-04-15 14:39:57", "description": "ROME (AP) — The Vatican on Wednesday replaced the director of its financial watchdog agency, completing a coup that began in October with controversial police raids on the watchdog offices and an...", "filename": "_075ef7e4633662c0a7c7a6d31bd1ac56_1588623373.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_075ef7e4633662c0a7c7a6d31bd1ac56_1588623373.html", "title": "Vatican removes financial watchdog head as scandal continues", "title_page": "Vatican removes financial watchdog head as scandal continues", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ROME (AP) — The Vatican on Wednesday replaced the director of its financial watchdog agency, completing a coup that began in October with controversial police raids on the watchdog offices and an investigation into a London real estate deal.\nThe Vatican secretary of state named a Bank of Italy official, Giuseppe Schlitzer, to head the day-to-day operations of the Financial Information Authority, known by its Italian acronym AIF. Schlitzer replaces Tommaso di Ruzza, who was suspended as part of the investigation.\nSeven months after the raids, neither di Ruzza nor anyone else has been charged. The delay and gaps in the prosecutors’ case suggest the investigation was sparked by a Vatican turf war over fears that AIF was being too aggressive in rooting out financial malfeasance that could have implicated high-ranking Vatican officials.\nIn addition to di Ruzza’s removal, Pope Francis decided in November not to renew the mandate of AIF’s president, Rene Bruelhart. Half the AIF board resigned to protest their treatment, and the board as a whole issued a statement defending their integrity and that of their investigations.\nThe raids and the scandal over the replacement of AIF’s leadership has raised questions once again about the Vatican’s murky finances and Francis’ failure to truly reform them. The pope was elected on a mandate of reform, after the Holy See worked for a decade to erase its reputation as a financial pariah and offshore tax haven.\nMuch of that effort was spearheaded by di Ruzza, who helped rewrite the Vatican’s anti-money laundering laws and helped manage the Vatican’s relations with the Council of Europe’s Moneyval evaluators. Under di Ruzza and Bruelhart’s leadership, the Vatican secured agreements with more than 60 nations to exchange financial information in the fight against money laundering and tax evasion.\nIn a statement to The Associated Press, di Ruzza thanked the pope for having given him the chance to serve the Holy See.\n“I know that in these years AIF gave its utmost to build a solid and internationally credible anti-money laundering system,” he said.\nVatican prosecutors are investigating allegations of corruption in the Secretariat of State’s 2012 purchase of a stake in a luxury residence in London. The Vatican bought the other investors out at the end of 2018, but then realized it had taken on an onerous mortgage as well as Italian middlemen who were fleecing the Holy See of tens of millions of euros in fees, according to officials familiar with the deal.\nThe AIF got involved in March 2019, after the deal was closed, when the No. 2 in the secretariat of state filed a suspicious transaction report that prompted AIF to launch a five-nation intelligence investigation to trace the financial flows from the deal and try to nab the people who had allegedly defrauded the Vatican.\nIt appears Vatican prosecutors didn’t realize that the AIF was in the middle of its own international investigation when they raided AIF headquarters and essentially torpedoed the intelligence investigation di Ruzza had launched.", "url": "https://apnews.com/075ef7e4633662c0a7c7a6d31bd1ac56"}