{"authors": [], "date_download": "2020-05-04 20:09:09", "date_modify": "2020-05-04 20:09:09", "date_publish": "2020-04-09 22:21:58", "description": "PORTLAND, Ore. (AP) — This year’s race for Oregon secretary of state so far has seen Democrats trying to regain their dominance of the executive branch while Republicans work to defend the sole...", "filename": "_af4ad82283cd140e5a41e1af2ac219c1_1588622949.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_af4ad82283cd140e5a41e1af2ac219c1_1588622949.html", "title": "Secretary of state candidate leaves GOP to run nonpartisan", "title_page": "Secretary of state candidate leaves GOP to run nonpartisan", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Ore. (AP) — This year’s race for Oregon secretary of state so far has seen Democrats trying to regain their dominance of the executive branch while Republicans work to defend the sole statewide office they hold.\nThe only candidate who has experience in the Secretary of State’s Office, Rich Vial, hopes to change that narrative, Oregon Public Broadcasting reported .\nVial resigned his position as deputy secretary of state in January and says instead of being a presumed leading contender for the Republican nomination, he will run as a non-affiliated candidate.\nHe’s hoping that the roughly 34% of Oregon voters who don’t currently subscribe to a single party, can propel him to the November ballot.\n“I think voters generally will come to a place where they say that the two-party system is broken and we need to do something different,” Vial told OPB, nodding to repeated legislative sessions marred by disputes and Republican walkouts. “It sure feels like with the last couple of sessions we’ve had, this could be the time.”\nOthers in the running for Secretary of State include Democratic state Sens. Shemia Fagan and Mark Hass, and former Congressional candidate Jamie McLeod-Skinner — and state Sen. Kim Thatcher, who is vying for the Republican nomination.", "url": "https://apnews.com/af4ad82283cd140e5a41e1af2ac219c1"}