{"authors": [], "date_download": "2020-05-04 20:24:19", "date_modify": "2020-05-04 20:24:19", "date_publish": "2020-04-08 22:11:45", "description": "TULSA, Okla. (AP) — A $500,000 grant from the National Park service will be used to renovate buildings along Tulsa's former Black Wall Street, nearly 100 years after the area was largely destroyed...", "filename": "_bf91973f1a642884504fbcc554bcd568_1588623859.html", "image_url": "https://storage.googleapis.com/afs-prod/media/72dafef5df034bd492f20c16e7647370/2800.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bf91973f1a642884504fbcc554bcd568_1588623859.html", "title": "Tulsa's former Black Wall Street to be modernized with grant", "title_page": "Tulsa's former Black Wall Street to be modernized with grant", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Feb. 12, 2019 file photo, historic buildings on Greenwood, the Historic Black Wall Street, house new businesses in Tulsa, Oklahoma. A $500,000 grant announced Tuesday, April 8, 2020, from the National Park service will be used to renovate buildings along Tulsa's former Black Wall Street. It comes nearly 100 years after the area was largely destroyed and as many as 300 people were killed in one of the nation's deadliest outbreaks of racial violence. (John Clanton/Tulsa World via AP File)\nFILE - In this Feb. 12, 2019 file photo, historic buildings on Greenwood, the Historic Black Wall Street, house new businesses in Tulsa, Oklahoma. A $500,000 grant announced Tuesday, April 8, 2020, from the National Park service will be used to renovate buildings along Tulsa's former Black Wall Street. It comes nearly 100 years after the area was largely destroyed and as many as 300 people were killed in one of the nation's deadliest outbreaks of racial violence. (John Clanton/Tulsa World via AP File)\nTULSA, Okla. (AP) — A $500,000 grant from the National Park service will be used to renovate buildings along Tulsa’s former Black Wall Street, nearly 100 years after the area was largely destroyed and as many as 300 people were killed in one of the nation’s deadliest outbreaks of racial violence.\nThe Greenwood Chamber of Commerce, which manages the one-block long business district on the city’s iconic North Greenwood Avenue, announced the funding on Tuesday, the Tulsa World reported.\nChamber President Freeman Culver said the money should be enough to replace roofs and pay for reconstruction of the exteriors on the Greenwood Centre’s 10 buildings, many of which were built in the 1920′s. Culver added that they hope the restoration efforts will bolster people’s confidence in the organization and attract more funding.\n“We hope that it’s obvious we’re committed to preserving the history our ancestors left us,” said Culver, who noted that the chamber submitted paperwork to include the buildings with the National Register of Historic Places.\nThe block on the north side of Tulsa is the only remnant left of a once-thriving African American business community that was revitalized after its destruction in the 1921 race riots. The racist violence took place two years after the summer of 1919 when hundreds of African Americans across the country were slain at the hands of white mob violence during the “Red Summer.” It was branded “Red Summer” because of the bloodshed and amounted to some of the nation’s worst white-on-black violence.\nBlack people then rebuilt the area in the decades that followed, only to see their work wiped out during the so-called urban progress of the 1960s.\nThe remaining buildings were refurbished in the early 1980s, formally becoming the Greenwood Centre, but have not undergone substantial overhauls since then.\nMany residents of near-downtown district believe not enough has been done to protect black culture in the Greenwood District from outsiders who historically haven’t sought to respect it.\nAttempting to make good on failed hopes of an eventual Black Wall Street renaissance, black leaders have expressed that they want to bring 100 businesses to the area by 2021, which marks the race riot’s 100th anniversary.", "url": "https://apnews.com/bf91973f1a642884504fbcc554bcd568"}