{"authors": ["Manu Raju", "Cnn Senior Congressional Correspondent"], "date_download": "2020-05-04 16:54:53", "date_modify": "2020-05-04 16:54:53", "date_publish": "2020-04-08 17:27:37", "description": "Democratic leaders are on a collision course with top Republicans over the next round of emergency funding to help the struggling economy, with the two sides at odds over the scope of a package that GOP leaders are pushing to immediately approve in the Senate.", "filename": "2020_04_08_politics_emergency-relief-package-fight_index_1588611293.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200115150823-pelosi-mcconnell-split-0115-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_emergency-relief-package-fight_index_1588611293.html", "title": "Democrats and GOP on collision course over new emergency relief package", "title_page": "Democrats and GOP on collision course over new emergency relief package - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Democratic leaders are on a collision course with top Republicans over the next round of emergency funding to help the struggling economy, with the two sides at odds over the scope of a package that GOP leaders are pushing to immediately approve in the Senate.\nWhile leaders in both parties support a quick infusion of cash for small businesses, the efforts to quickly pass a new package are running into the realities of Congress -- where every member needs to sign off in order to ensure a bill can become law without lawmakers having to return to Washington. Adding to the challenges: A conservative House Republican, Rep. Thomas Massie of Kentucky, warned he's ready to again force lawmakers to return to Washington amid the public health crisis because of his concerns over the measure.\nThe latest round of jockeying came after the White House proposed an additional $251 billion for a small business loan program that was enacted as part of the new $2.2 trillion economic stimulus package, the largest rescue measure in US history. And Senate Majority Leader Mitch McConnell announced he would move to quickly approve the bill in his chamber on Thursday, with calls from the Trump administration for the House to quickly clear the plan by Friday.\nBut on Wednesday morning, House Speaker Nancy Pelosi and Senate Minority Leader Chuck Schumer laid out several major demands, including $150 billion for state and local governments, $100 billion for hospitals and community health centers and more money for food stamp programs. In addition, the Democrats said half of the money in the $251 billion for the small business program should be directed toward local lenders that benefit farmers, women, veterans and minority-owned companies.\nOn a conference call with her caucus Wednesday afternoon, Pelosi said that the House will attempt to pass by unanimous consent any deal reached with the White House, something that House Majority Leader Steny Hoyer expressed optimism could occur by Friday. She explained that while she's optimistic about the small business program, she raised concerns that not all loans are reaching communities who need it, citing that as a reason why they are asking for changes to the program.\nRead More", "url": "https://www.cnn.com/2020/04/08/politics/emergency-relief-package-fight/index.html"}