{"authors": [], "date_download": "2020-05-04 15:56:36", "date_modify": "2020-05-04 15:56:36", "date_publish": "2020-04-15 14:31:20", "description": "Dalgona coffee, or whipped coffee, is probably all over your Instagram feed right now. Here's how to make it.", "filename": "2020_04_15_cnn-underscored_how-to-make-whipped-coffee_index_1588607796.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200414101551-whippedcoffeelead2-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_15_cnn-underscored_how-to-make-whipped-coffee_index_1588607796.html", "title": "How to make whipped coffee", "title_page": "How to make whipped coffee: Dalgona coffee recipe from experts  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "If you're spending any amount of time on Instagram or TikTok these days, you've likely been inspired to whip up your own mug of dalgona coffee.\nThe frothy caffeinated concoction — also referred to as whipped coffee — has been trending since going viral in South Korea earlier this year. Search #dalgonacoffee on Instagram, and you'll net more than 265,000 posts. On TikTok, that number reaches 207 million views.\n\"I think the trend took off really quickly because people are feeling stir-crazy at home while social distancing and want a quick and easy distraction,\" says Michelle Lopez, founder of the food blog Hummingbird High. \"The recipe is pretty low commitment — it takes five minutes — and serves as a good replacement for a lot of folks' morning coffee routine. I also think this recipe just brought a lot of joy into people's lives by being tasty and fun to make and share online.\"\nJulie Resnick, co-founder of feedfeed, a popular crowd-sourced digital food publication and community, agrees. \"This recipe is easy, approachable, only requires a few ingredients, looks really cool and it tastes pretty good,\" she says. \"It's a cloud of happiness for sweet coffee lovers. It tastes mostly sweet and creamy with a tiny bit of bitterness.\"\nLopez says she'd compare the taste to a Starbucks Frappuccino. \"They have the same kind of airy texture,\" she says. \"I think Starbucks gets their texture by blending coffee with crushed ice, but you don't do that with dalgona coffee at all.\"\nReady to make your own happiness cloud at home? Here's what you'll need and how to whip it — and whip it good, with all products recommended by the pros and from our favorite brands.\nHow to make whipped coffee\nTo make one dalgona coffee, Lopez says, you'll need 2 tablespoons each of instant coffee, granulated sugar and boiling water. You'll also need ½ cup of ice, 8 ounces of milk, and cocoa powder for garnish, if you like. (\"Don't try it unless you are using instant coffee,\" Resnick advises, as regular coffee does not work with this recipe.)\nCombine the instant coffee and sugar in a bowl, then add the hot water. \"The dalgona coffee recipe works best if you use hot water — it dissolves both the instant coffee and sugar more quickly and leads to a fluffier, frothier coffee,\" Lopez says.\nNow you'll either use a whisk to beat the mixture until it's light and fluffy (about five minutes) or use an electric or stand mixer (it'll save a lot of arm strength, Resnick says) for about one to two minutes.\n\"I typically whisk my coffee by hand, but I'm a professional baker so I have a lot of practice whipping whipped cream and meringue, too,\" Lopez says. \"If you don't do what I do for a living, I definitely recommend using a hand-held electric mixer. It's the fastest and easiest way to get maximum fluff for your coffee.\"\nFrom there, spoon the creamy coffee into a glass of iced milk using a rubber spatula and garnish with the cocoa powder if you like. Snap your photo, then stir it up and enjoy.\nWhat you'll need\nFolgers Instant Coffee Crystals Classic Roast Single Serve Packets ($14.61; amazon.com)\nFolgers Instant Coffee Crystals Classic Roast Single Serve Packets\nThese single-serve packets are perfect for those who want to try the dalgona coffee trend without making a major commitment.\n_______________________________________________________________________________\nFolgers Classic Medium Roast Instant Coffee ($5.99; target.com)\nFolgers Classic Medium Roast Instant Coffee\nIf you're looking to either make a lot of whipped coffee, or just prefer instant over drip, why not buy a larger container that's miraculously still in stock? And if you love a French roast, try this.\n_______________________________________________________________________________\nCirculon Morning Bird Tea Kettle ($39.99; bedbathandbeyond.com)\nCirculon Morning Bird Tea Kettle\nBoil your water in style with this 2-quart stovetop kettle that will be a chic addition to your kitchen. We love it in bright turquoise, but it also comes in black, chocolate and orange.\n_______________________________________________________________________________\nBodum Bistro Electric Tea Kettle ($38.32; wayfair.com)\nBodum Bistro Electric Tea Kettle\nWhen you want your water boiled quickly, go electric. This sleek, modern design includes a see-through water level scale, so you know exactly how much water you're boiling.\n_______________________________________________________________________________\nOxo 9\" Softworks Whisk ($7.99; target.com)\nOxo 9\" Softworks Whisk\nBeloved by Target shoppers, this whisk is smaller in order to mix together something as simple as instant coffee, sugar and water.\n_______________________________________________________________________________\nKate Aspen \"The Perfect Mix\" Kitchen Whisk ($1.99; bedbathandbeyond.com)\nKate Aspen \"The Perfect Mix\" Kitchen Whisk\nHere's a sweet pink whisk at a lower price point, which features a stainless steel handle and silicone-coated wires.\n_______________________________________________________________________________\nBreville Handy Mix Scraper Hand Mixer ($129.95; amazon.com)\nBreville Handy Mix Scraper Hand Mixer\nHummingbird High's Lopez says this sturdy number is her go-to handheld mixer. \"It's powerful but lightweight, and I love that it has a little light in the mixer that shines on whatever you're making to enable you to see what you're doing,\" she says.\n_______________________________________________________________________________\nKitchenAid 5-Quart Stand Mixer (starting at $239.99; bedbathandbeyond.com)\nKitchenAid 5-Quart Stand Mixer\nWhipping up dalgona coffee is just one reason to invest in this kitchen must-have. From kneading dough to stirring wet and dry ingredients to beating fluffy coffee, you'll use it again and again and again.\n_______________________________________________________________________________\nLuminarc 10-Piece Set Stackable Bowl Set ($29.99; amazon.com)\nLuminarc 10-Piece Set Stackable Bowl Set\nThe key to making dalgona coffee is in the mixing. This set of 10 lead-free glass bowls stacks easily for storage and ensures you'll always have the perfect size on hand.\n_______________________________________________________________________________\nCuisinart 3-Piece Mini Spatula Set ($8.99; bedbathandbeyond.com)\nCuisinart 3-Piece Mini Spatula Se\nSpoon up your whipped coffee with a pretty rubber spatula. Durable and smaller in size, this version will help get your coffee Instagram-perfect.\n_______________________________________________________________________________\nFellow Set of 2 Coffee Glasses ($30; nordstrom.com)\nFellow Set of 2 Coffee Glasses\nWhipped coffee is made for social media display and will look extra impressive photographed in glass rather than a ceramic mug. These handblown 10-ounce glasses are almost as awe-inspiring as your drink.\n_______________________________________________________________________________\nIridescent Stainless Steel Straws ($7.90; amazon.com)\nIridescent Stainless Steel Straws\nTop your coffee masterpiece off with a reusable iridescent stainless steel straw. Extra long, they fit 30-ounce tumblers and are BPA-free.\n_______________________________________________________________________________\nSilicone Reusable Drinking Straws ($9; uncommongoods.com)\nSilicone Reusable Drinking Straws\nOr, add a pop of color to your dalgona coffee with this fun set of six silicone bendy straws that you can toss in the dishwasher between uses.\n_______________________________________________________________________________\nGhirardelli Chocolate 100% Unsweetened Baking Cocoa (price varies; instacart.com)\nGhirardelli Chocolate 100% Unsweetened Baking Cocoa\nMake your drink extra special with a decadent sprinkle of cocoa powder on top.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/15/cnn-underscored/how-to-make-whipped-coffee/index.html"}