{"authors": ["Tom Canavan"], "date_download": "2020-05-04 20:24:14", "date_modify": "2020-05-04 20:24:14", "date_publish": "2020-04-16 16:07:30", "description": "While he didn't come close to filling all the New York Giants' needs in free agency, general manager Dave Gettleman has put the struggling franchise in position to pick into the strength of the...", "filename": "_81c13a59affa7dda763b5112fbbb194c_1588623854.html", "image_url": "https://storage.googleapis.com/afs-prod/media/3b941d43ff9f4c62aa39d3d3c1622948/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_81c13a59affa7dda763b5112fbbb194c_1588623854.html", "title": "Giants seek tackles, defensive playmakers with No. 4 pick", "title_page": "Giants seek tackles, defensive playmakers with No. 4 pick", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Sunday, Dec. 22, 2019 file photo, New York Giants quarterback Daniel Jone warms up prior to an NFL football game against the Washington Redskins in Landover, Md. Jones seemingly has plenty of targets for his second season with Darius Slayton, Golden Tate and Sterling Shepard returning at wide out and Evan Engram at tight end. (AP Photo/Mark Tenally, File)\nFILE - In this Sunday, Dec. 22, 2019 file photo, New York Giants quarterback Daniel Jone warms up prior to an NFL football game against the Washington Redskins in Landover, Md. Jones seemingly has plenty of targets for his second season with Darius Slayton, Golden Tate and Sterling Shepard returning at wide out and Evan Engram at tight end. (AP Photo/Mark Tenally, File)\nWhile he didn’t come close to filling all the New York Giants’ needs in free agency, general manager Dave Gettleman has put the struggling franchise in position to pick into the strength of the draft.\nSigning cornerback James Bradberry, linebackers Blake Martinez and Kyler Fackrell and running back Dion Lewis in free agency will help new coach Joe Judge field a better team.\nIt also leaves the Giants with two major holes: one at offensive tackle and the other being a playmaker on defense.\nEither can be gotten with the No. 4 overall pick.\nMany draft experts have LSU quarterback Joe Burrow, Ohio State defensive lineman Chase Young and Buckeye cornerback Jeff Okudah going 1-2-3 to Cincinnati, Washington and Detroit, respectively.\nThat leaves the board open for Gettleman to either take multi-dimensional Clemson linebacker Isaiah Simmons or an offensive tackle to protect second-year quarterback Daniel Jones, the No. 6 overall pick in 2019.\nWhat makes Simmons exciting is his versatility. He is 6-foot-4, 238 pounds and runs a 40-yard dash in 4.3 seconds. That’s as fast as most wide receivers. He can play inside or outside linebacker, a slot corner, safety and rush the passer. He had 102 tackles last season with eight sacks and three interceptions.\nThis also is an offensive tackle-heavy draft. There four very good ones: Alabama’s Jedrick Wills, Iowa’s Tristan Wirfs, Georgia’s Andrew Thomas or Louisville’s huge Mekhi Becton.\nAny can step into a starting lineup.\n“You have to keep building, we are excited about the draft, there are some good players there,” Gettleman said. “We are just going to continue to get better. Nothing is ever done.”\nGil Brandt, the Dallas Cowboys’ player personnel director from 1960-1989 and a current analyst for SiriusXM NFL Radio, noted Simmons had 787 plays for Clemson last season at either linebacker, safety or cornerback.\n“I think it is fine to get a guy with all that versatility,” Brandt said. “But I do think it is harder and has more of an impact on a team right now is to get an offensive lineman. So if I were the Giants, I would take one of those hog mollies as Gettleman refers to it.”\nThe third option would be to trade to a lower spot in the first round for an extra pick. That takes some control out of the Giants’ hands.\nNew York didn’t lose much in free agency. Veteran starting right tackle Mike Remmers signed with Kansas City.\nBesides Bradberry, Martinez, Fackrell and Lewis, the Giants also added depth. They signed quarterback Colt McCoy, tackle Cam Fleming, safety and special teams maven Nate Ebner, tight ends Levine Toilolo and Eric Tomlinson, nose tackle Austin Johnson and long snapper Casey Kreiter.\nTHE PASS RUSH:\nNew coordinator Patrick Graham has to find a pass rush. Linebacker Markus Golden, who led the team with 10 sacks, was not re-signed.\nYoung linebackers Lorenzo Carter and Oshane Ximines, who tied for second with 4 1/2 sacks apiece, need to pick up some of the slack. Gettleman hopes Fackrell can return to his 2018 form, when he had 10 1/2 sacks with Green Bay.\n“What it really comes down to is it doesn’t matter who gets the sacks, it’s about how many sacks you actually get,” Gettleman said. “It really is about how much pressure you apply.”\nTHE O-LINE:\nTackle is only part of the question mark.\nLT Nate Solder is coming off a bad year and needs to improve. With Remmers gone, the right side is open. If a tackle is the No. 1 pick, expect him to start there. Gettleman believes third-year pro Nick Gates showed enough last year to fit in the mix.\nThe guards are set with Will Hernandez and Kevin Zeitler. The center is uncertain. Jon Halapio is coming off an Achilles tendon injury and his status won’t be known until June. Gates and veteran Spencer Pulley are possible replacements.\nDEFENSIVE WOES:\nThe Giants ranked 25th overall last season, allowing an average of 377.3 yards and 28.18 points.\nAdding Bradberry, Martinez and Fackrell will help.\nThe kids need to improve, particularly linemen Dexter Lawrence II and B.J. Hill and defensive backs DeAndre Baker, Sam Beal, Corey Ballentine and Julian Love. Lawrence and Baker were first-round picks last year.\nSafety Jabrill Peppers has to stay healthy.\nTARGETS:\nJones seemingly has plenty of targets for his second season with Darius Slayton, Golden Tate and Sterling Shepard returning at wide receiver and Evan Engram at tight end.\nThere is concern. While Shepard led the team with 57 catches for 576 yards and three touchdowns. He missed six games with two concussions.\nEntering his fourth season, Engram has missed 13 games in the past two seasons because of injury. He had 44 catches for 467 yards and three TDs in eight games. His last game was on Nov. 4.\nSlayton was the big surprise as a rookie, catching 48 passes for team highs of 740 yards and eight touchdowns. He was a fifth-round pick.\n____\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/81c13a59affa7dda763b5112fbbb194c"}