{"authors": [], "date_download": "2020-05-04 20:07:37", "date_modify": "2020-05-04 20:07:37", "date_publish": "2020-04-09 19:50:23", "description": "CHARLOTTE, N.C. (AP) — A conservative-leaning group sued North Carolina election officials on Thursday, accusing them of not doing enough to thin out voter registration rolls as federal law...", "filename": "_3d0a14fa4efafcbe689eb998e8baf659_1588622857.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3d0a14fa4efafcbe689eb998e8baf659_1588622857.html", "title": "Group sues for more robust N. Carolina voter roll cleanup", "title_page": "Group sues for more robust N. Carolina voter roll cleanup", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHARLOTTE, N.C. (AP) — A conservative-leaning group sued North Carolina election officials on Thursday, accusing them of not doing enough to thin out voter registration rolls as federal law directs.\nIn Charlotte federal court, Washington-based Judicial Watch filed a lawsuit against the state, state election administrators and those in Guilford and Mecklenburg counties. Judicial Watch lawyers say the officials aren’t complying with laws demanding they carry out a program that reasonably attempts to cancel registrations of people deemed ineligible to vote. The defendants also have failed to hand over records showing how the program is being implemented, the lawsuit said.\nNorth Carolina law directs that registered voters who don’t cast ballots in two federal election cycles — four years — and fail to respond to mail are listed as inactive. The inactive voter is then removed permanently from the rolls if they don’t vote for two additional cycles.\nJudicial Watch alleges the number of people on Mecklenburg and Guilford rolls exceed the number of people old enough to vote in each county — a sign that the removal program isn’t robust, the group said. The state has nearly 1 million inactive registrations, the lawsuit said. North Carolina currently has almost 7 million registered voters. Critics say a weak voter maintenance system can encourage voter fraud.\n“We want cleaner elections, as the law requires, and we expect this lawsuit will cause North Carolina to take the simple steps necessary to clean from its rolls the names of voters who have moved away or died,” Judicial Watch President Tom Fitton said in a news release.\nState elections director Karen Brinson Bell, writing last month to Judicial Watch, said the voter maintenance program is carried out in a uniform and nondiscriminatory way. She said she had concerns that the group’s analysis relied on “outdated, inaccurate data” and said counties with higher transient populations may have higher percentages of voters than other counties.\n“This does not mean that required list maintenance is not occurring,” Bell wrote on March 18.\nIn December, Judicial Watch told 19 counties in five states — North Carolina, California, Pennsylvania, Virginia and Colorado — that it was poised to sue over voter maintenance work unless changes were made.", "url": "https://apnews.com/3d0a14fa4efafcbe689eb998e8baf659"}