{"authors": ["Senior Political Reporter"], "date_download": "2020-05-04 20:27:56", "date_modify": "2020-05-04 20:27:56", "date_publish": "2020-04-30 09:39:18", "description": "Former Sen. Chris Dodd, Los Angeles Mayor Eric Garcetti and Rep. Lisa Blunt Rochester will co-chair the presumptive Democratic nominee's selection commit...", "filename": "entry_joe-biden-vice-presidential-selection-co-chairs_n_5eaa436bc5b6edf4130e123b_1588624076.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa452a2500003111eb0980.jpeg?cache=liaocp9daz&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_joe-biden-vice-presidential-selection-co-chairs_n_5eaa436bc5b6edf4130e123b_1588624076.html", "title": "Here’s Who Will Help Decide Joe Biden’s Vice Presidential Pick", "title_page": "Here’s Who Will Help Decide Joe Biden’s Vice Presidential Pick | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Former Vice President Joe Biden will rely on two longtime allies and two other key backers to help select his running mate, his Democratic presidential campaign announced Thursday morning.\nFormer Sen. Chris Dodd (D-Conn.), Los Angeles Mayor Eric Garcetti, Rep. Lisa Blunt Rochester (D-Del.) and longtime Biden aide Cynthia Hogan will serve as co-chairs of a vice presidential selection committee.\nDodd served for decades in the Senate with Biden and was considered one of his closest friends in the upper chamber. More recently, he’s served as the head of the Motion Picture Association of America and now works at the law and lobbying firm Arnold & Porter. Hogan was the top staffer on the Senate Judiciary Committee when Biden was chair and was his top legal aide in the vice president’s office during the Obama administration.\nBlunt Rochester and Garcetti are more recent allies. Blunt Rochester, the first Black woman elected to Congress from Delaware, endorsed Biden on the first day of his presidential bid. Garcetti endorsed Biden in January.\n“Selecting a vice presidential candidate is one of the most important decisions in a presidential campaign, and no one knows this more than Joe Biden,” Biden’s campaign manager, Jen O’Malley Dillon, said in a statement. “These four co-chairs reflect the strength and diversity of our party, and will provide tremendous insight and expertise to what will be a rigorous selection and vetting process.”\nKris Connor via Getty Images Former Vice President Joe Biden, the presumptive Democratic nominee for president, is relying on former Sen. Chris Dodd, one of his closest friends in politics, to help pick his running mate.\nBiden has already pledged to select a female running mate. Sens. Kamala Harris (D-Calif.), Amy Klobuchar (D-Minn.), Elizabeth Warren (D-Mass.) and Catherine Cortez Masto (D-Nev.), and Michigan Gov. Gretchen Whitmer and former Georgia gubernatorial candidate Stacey Abrams are considered the leading contenders.\nNone of the contenders has noticeably close ties to the selection committee, though Garcetti and Harris share a home state and Dodd’s and Klobuchar’s Senate tenures overlapped.\nThe Biden campaign said the four co-chairs would “conduct conversations across the party” and also work with vetting teams led by former White House counsel Bob Bauer, Biden campaign counsel Dana Remus and Lisa Monaco, a former White House homeland security adviser.", "url": "https://www.huffpost.com/entry/joe-biden-vice-presidential-selection-co-chairs_n_5eaa436bc5b6edf4130e123b"}