{"authors": [], "date_download": "2020-05-04 20:12:27", "date_modify": "2020-05-04 20:12:27", "date_publish": "2020-04-07 23:24:09", "description": "BALTIMORE (AP) — A popular Maryland beach town can ban women from going topless in public, a federal judge ruled Tuesday. Judge James Bredar noted in his ruling that the U.S. Supreme Court...", "filename": "_6e58b1670b3bd6e2fc2173f230e32481_1588623147.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6e58b1670b3bd6e2fc2173f230e32481_1588623147.html", "title": "Judge: Maryland beach town can ban women from going topless", "title_page": "Judge: Maryland beach town can ban women from going topless", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BALTIMORE (AP) — A popular Maryland beach town can ban women from going topless in public, a federal judge ruled Tuesday.\nJudge James Bredar noted in his ruling that the U.S. Supreme Court has consistently maintained that physical differences between men and women provide a constitutionally sound basis for laws that treat men and women differently.\nBredar also determined that protecting the public sensibilities from the public display of areas of the body traditionally viewed as erogenous zones, including female, but not male, breasts, is an important government objective.\n“Whether or not society should differentiate between male and female breasts is a separate inquiry from whether it is constitutional to do so,” wrote Bredar, adding that Ocean City’s ban on female toplessness is substantially related to protecting the public sensibilities.\nFive women sued Ocean City officials in 2018, arguing that they had the right to appear topless in public like men.\nThe lawsuit was filed after city officials passed an emergency ordinance in 2017 prohibiting the nude display of a person’s specified anatomical areas. Those areas included the male and female genital regions and the female breast.\nLocal officials passed the ordinance after one of the plaintiffs sent letters to local authorities stating her intention to go topless, touching off a community debate.", "url": "https://apnews.com/6e58b1670b3bd6e2fc2173f230e32481"}