{"authors": ["Sara Spary"], "date_download": "2020-05-04 16:06:26", "date_modify": "2020-05-04 16:06:26", "date_publish": "2020-04-02 12:23:03", "description": "The editing of any feature movie can be a painstaking process. But that doesn't mean those in charge always spot every little detail, as one self-confessed \"very big fan\" of \"Little Women\" discovered while rewatching the 2019 adaptation directed by Greta Gerwig.", "filename": "2020_04_02_movies_little-women-water-bottle-scli-intl_index_1588608386.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402120911-01-little-women-drink-containers-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_movies_little-women-water-bottle-scli-intl_index_1588608386.html", "title": "Eagle-eyed 'Little Women' fans spot modern drinks bottles on set", "title_page": "Eagle-eyed 'Little Women' fans spot modern drinks bottles on set - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The editing of any feature movie can be a painstaking process. But that doesn't mean those in charge always spot every little detail, as one self-confessed \"very big fan\" of \"Little Women\" discovered while rewatching the 2019 adaptation directed by Greta Gerwig.\nMadelyn Rancourt spotted a drinks canister and a water bottle in the background of one scene, which she recorded and posted to the social networking site TikTok in a video viewed more than 91,000 times.\nBecause there are no timestamps on TikTok it is not clear when the video was posted, although it started to go viral this week.\nThe scene shows the March family -- including lead character Jo March, played by Saoirse Ronan, meeting their neighbor Laurie in his home. A plastic water bottle and a hydro flask can be seen on a table in the background.\nAfter Rancourt posted the video other fans took to social media to say they had also spotted it.", "url": "https://www.cnn.com/2020/04/02/movies/little-women-water-bottle-scli-intl/index.html"}