{"authors": ["Leigh Phillips", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Alex Lenferna", "Dean Snyder", "Matt Guardino", "Meagan Day", "Luke Savage"], "date_download": "2020-05-04 19:49:22", "date_modify": "2020-05-04 19:49:22", "date_publish": "2020-05-04 00:00:00", "description": null, "filename": "2020_05_planet-of-the-humans-michael-moore-documentary-climate-change_1588621762.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/05/04103008/GettyImages-1151623969.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_05_planet-of-the-humans-michael-moore-documentary-climate-change_1588621762.html", "title": "Planet of the Anti-Humanists", "title_page": "Planet of the Anti-Humanists", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThere is probably no contemporary filmmaker who is more associated with advocacy for trade unions and workers than documentarian Michael Moore. His 1989 breakout documentary, Roger & Me , takes us from the Flint, Michigan, sit-down strike of 1936 that led to the formation of the United Auto Workers through to the deindustrialization of the ’80s that devastated his hometown and so many other communities. His cheeky, innovative 1990 docuseries TV Nation , which exposed episode after episode of jaw-dropping corporate malfeasance, developed the Roger concept further and laid down a format that has been emulated ever since. Every film he has ever made furiously, humorously, humanistically sides with the many and not the few. The same can’t be said for his most recent work. Planet of the Humans — this time produced by Moore and directed by Jeff Gibbs (switching their roles from Fahrenheit 9/11 and Bowling for Columbine ) — concludes that climate change solutions such as wind, solar, and electric vehicles do not live up to their hype. They reckon that from global warming and biodiversity loss to freshwater scarcity and soil fertility depletion, there are no technological or political solutions up to the task, and the only solution to environmental challenges is for there to be not so many of the many. Moore and Gibbs may not have embraced the few, but they certainly do want fewer. In a swerve toward the Malthusian politics of degrowth and, remarkably, even embracing the fringe ideology of “anti-civilization,” Planet of the Humans declares that the problems caused by industrial civilization cannot be solved by industrial civilization. Progress is a dangerous myth, the film argues; there are too many humans consuming too much stuff, so everyone in developed countries — including the working class — needs to consume less, while the planet as a whole must be depopulated down to a more sustainable number. For all of Michael Moore’s many and generous contributions to progressive and humanist politics over the decades, such arguments are, well, literally anti-progressive and anti-human. And we don’t need them anyway. Our host of very real and challenging environmental problems are primarily caused not by growth — either of people or of the economy — but by the incentive structure inherent to any market system. Rather than telling a world currently wracked by a global pandemic that is already slashing economic growth while killing hundreds of thousands that this is basically what we want but done in a nicer fashion, we should be embracing the regulation and economic planning we need to save the planet and all the people on it.\nApocalyptic Travelogue Planet of the Humans offers a bleak, at times apocalyptic, travelogue listing the multiple, often overlapping ecological challenges going far beyond climate change — from overfishing and biodiversity loss to water consumption and soil fertility depletion. But its focus is primarily on the failure of renewable energy sources, in particular solar and wind. Director Jeff Gibbs journeys from a solar music festival that, when it starts to rain, draws its electricity from biodiesel generators and the region’s coal-dominant power grid, to abandoned California solar arrays that he claims have destroyed ancient desert ecosystems, and Vermont conservationists campaigning against the clearing of the forests covering Lowell Mountain to make way for a wind farm. He also highlights how, alongside wind and solar, biomass predominates in production of renewable energy, and in so doing levels even more forest. Gibbs certainly gets in some clever jabs regarding the irony of it all, calling the dunes of Daggett, California, a “solar dead zone,” and the ravaging caused by the turbines in Vermont “mountaintop removal for wind instead of coal.” But overall, the analysis of clean energy production is not clever at all. Its figures on the efficiency of solar panels is incredibly dated. There continue to be solar arrays supplying clean electricity to the grid just around the corner from where Gibbs thought he saw his dead zone. The documentarians are correct when they remind us that wind and solar cannot on their own maintain a reliable electricity grid. The wind does not always blow, and the sun does not always shine, and, as a director of the Lansing Board of Water & Light in Michigan tells us in the film, sometimes there is no sun or wind. This makes them intermittent, and so they have to be backed up with a source that is what energy systems experts call “firm,” available 24-7. We don’t want our hospitals to have to wait for it to be sunny so that we can operate dialysis machines. Gibbs and Moore are also not wrong when they highlight how wind and solar power tend to be backed up by natural gas plants. Alberta, which opted for building out its wind capacity as it weans itself off coal without depending on firm hydroelectricity or nuclear power alongside this variable source of energy is actually using renewable energy credits to build new natural gas plants. Natural gas produces about half the emissions of coal over its full life cycle of extraction, distribution, and combustion, so this is better than nothing. In fact, the move from coal to natural gas is responsible for the bulk of America’s reduction in emissions. And the ongoing switch by freighters from bunker fuel (one of the dirtiest fuels that exists, coming as it does from what is left over after all other fuels are refined) to liquefied natural gas is an essential step along the path to carbon-neutral synthetic hydrocarbons (as most shipping cannot be electrified due to the weight and volume of the batteries that would be necessary for transoceanic crossings). But one day, likely sometime over the next ten to fifteen years, we will have to sunset conventional natural gas combustion as well in order to reach net-zero greenhouse gas emissions by mid-century.\nThe Real Limits of Vairable Renewables Some variable renewables advocates have responded to the film by saying that we can resolve these problems with a mixture of batteries, other forms of grid storage, and continent-spanning smart grids that are able to shift energy from those places where the sun is shining or the wind blowing to those places where it isn’t. These are all good ideas. But they can only ameliorate the problem of intermittency of solar and wind — they can’t solve it. Ignoring for the moment the horrendous climate impacts of fossil fuels, we can now see how great they are for a grid, or for any other activity for which we require energy such as transport and industrial production: we can use them whenever we want. We can also use them wherever we want. There is a reason why Lenin defined communism as “workers’ power plus electrification of the whole country.” The stratigraphers, geologists, paleontologists, and ecologists who are working to define the Anthropocene epoch have concluded that what they call the “Great Acceleration,” the explosion of human impact on the Earth system, did not begin in the eighteenth century with the Industrial Revolution, but instead in the 1950s, with the advent of the welfare state, the institutionalization of trade unions, and the concomitant growth of the “middle class.” Of course, we now know that we cannot ignore the impacts of fossil fuels on the atmosphere. But there are clean energy sources that are firm, such as nuclear, hydroelectricity, and geothermal, which the film does not discuss, and biomass, which the film does talk about at length. Planet of the Humans is right to be concerned about the aggressive uptake of biomass, including biofuels. Germany gets a lot of press for its Energiewende clean energy transition and its vast build-out of wind and solar, but the reality is that in order to do this at the same time that it has been eliminating low-carbon and firm nuclear from its electricity mix, it has had to build new coal plants and establish new coal mines. It has also had to depend on biomass, primarily in the form of wood pellets, for about as much of its electricity mix as it does from solar (respectively 8.7 percent and 9.1 percent). The film gets some things incorrect, however. The use of what is called “slash,” or the leftover twigs, branches, and other forestry waste, has to be burned in many jurisdictions so that it isn’t left on the ground as dry fuel increasing wildfire risk. If it has to be burned anyway, we might as well use it to make electricity. But Planet of the Humans is not wrong that too many jurisdictions play fast and loose with what counts as forestry waste. And much of what Europe uses for its biomass plants are indeed trees that have been turned into wood pellets; trees that would have a much greater decarbonization impact if they were used as long-lived wood products as furniture or replacing the use of steel and cement in buildings. And at the scale we need for fossil fuels to be entirely replaced, dependence on biomass, including biofuels, would have a massive land footprint, competing with food and feed production for arable land. Once land-use change is considered, most first-generation biofuels such as bioethanol actually produce more carbon pollution than their fossil fuel equivalents. It is indeed something of a hidden scandal that so much of Europe’s emissions reduction effort has been dependent on a renewable energy source that isn’t really clean. But instead of exploring how variable renewables like wind and solar can be paired with forms of energy that are clean but firm, Planet of the Humans concludes that the whole effort to decarbonize the grid is an impossible dream.\nGetting Over the Fear of Nuclear In fact, it’s already happened in eight large economies. France, Québec, Ontario, Sweden, Norway, British Columbia, Paraguay, and Switzerland have already completely or largely decarbonized their electricity grids. We can do this. However, every single one depends primarily on hydro and/or nuclear, allowing them to integrate wind, solar, and other variable renewables with no challenge to the reliability of the grid. Indeed, the fastest decarbonization rate ever achieved was that of France in the 1970s and 1980s, when it nuclearized its electricity production. Finland and the UK are doing very well, too, and both have embraced nuclear power as key to their decarbonization efforts. Iceland’s grid is also pretty much completely clean, dependent on hydro and geothermal, but Iceland, we have to remember, is a tiny economy of just 360,000 people. The reason we can’t just rely on hydroelectricity and geothermal energy alone and not nuclear alongside them is that the former two are geographically limited. You can build a fossil fuel plant or a nuclear plant anywhere, but you have to have mountains and valleys for hydro, or sit atop a geologically active zone (such as the Pacific’s “Ring of Fire”) for conventional geothermal. (The reach of geothermal can be extended significantly via enhanced geothermal systems, or EGS, which depends upon hydraulic fracturing to pump water into cracks in hot rocks underground, but this is still not an option that can be used everywhere.) While the filmmakers don’t touch nuclear energy in the documentary, as part of promotion, they have made it clear they oppose that option, too. Michael Moore told a YouTube livestream that one of his earliest actions as a political activist was to take part in the anti-nuclear movement of the late 1960s and early ’70s (which, ironically, at the time, argued that we should embrace more coal instead of uranium). It’s time for the post–Cold War environmental movement — and, yes, figures like Bernie Sanders — to rethink their stance on nuclear power. We now know that nuclear power has the fewest deaths per kilowatt-hour of any energy source, that a single return flight from New York to London exposes a passenger to more ionizing radiation than a lifetime’s exposure of a nuclear plant worker, and that in any case, next-generation reactors physically cannot melt down. There is a reason why each of the four illustrative pathways toward net-zero emissions by 2050, compatible with keeping within 1.5°C of warming above pre-industrial times and offered by the UN Intergovernmental Panel on Climate Change (IPCC), assumes between 100 and 500 percent of current nuclear generation. According to the IPCC’s latest climate change assessment, nuclear energy has an average carbon intensity across its full life cycle of just 12 grams of CO 2 -equivalent per kilowatt-hour, the same as offshore wind — but, unlike wind, it’s available 24-7. Utility-scale solar photovoltaic power, which is intermittent, hits a median of 48 grams. Planet of the Humans gets it very wrong on hydrogen, too, and in a way that explains many of the other problems the film has with all the low-carbon technologies it mentions. Gibbs at one point interviews a public relations figure for a hydrogen vehicle at a clean-tech expo. When asked where you get hydrogen from, the PR guy responds that it comes mainly from breaking up methane (natural gas) into hydrogen and carbon dioxide (CO 2 ) molecules via a process known as steam methane reforming (SMR), after which the CO 2 is released into the atmosphere. The director rightly asks why you would release CO 2 in order to avoid releasing CO 2 . “Everywhere I encountered green energy, it wasn’t what it seemed,” he says. He and the academics he interviews keep stressing how surprised they are to find that fossil fuels are still used in the production of clean energy. But this isn’t the whole story. Steam methane reforming is just currently the cheapest way to make hydrogen (and we need to make hydrogen for all sorts of purposes, not just for clean fuels). We could apply carbon capture and storage technology to the SMR-sourced hydrogen, eliminating the CO 2 releases, in what is described in energy systems circles as “blue hydrogen” for the blue flame of natural gas, but it significantly increases the cost. Another option is to use some of the excess solar and wind energy to manufacture hydrogen by splitting water (electrolysis). This is called “green hydrogen” because it doesn’t involve the use of natural gas. This is still very energy intensive, so the best estimates we have at the moment suggest this will also not be competitive with steam methane reforming. And it is more efficient, with less wear and tear on equipment, if hydrogen production runs 24-7 rather than ramping production up and down dependent on the weather. However, we could instead use heat from nuclear reactors instead of their electricity to split water (via thermochemical process instead of electrolysis), a much less expensive process. Reactors actually first produce heat that they then use to turn into electricity, so we could even have ones that are solely dedicated to the production of heat for hydrogen manufacture — without ever needing the electricity step — to bring the cost down still further. Another alternative still in the early stages of development in Alberta would be, in effect, mining hydrogen by breaking up methane underground and using a special membrane to prevent the release of CO 2 . The initial projections of costs make this form of hydrogen production competitive with conventional steam methane reforming. And we will almost certainly need hydrogen as an input alongside CO 2 directly captured from the air (DAC, sometimes referred to as “artificial trees”) to produce carbon-neutral synthetic hydrocarbons for those transport sectors like long-haul trucking, shipping, and aviation that are hard to electrify. (Medium-haul trucks can be electrified, and a lot of trucking can be shifted over to railways, but not all. And there are temperature considerations as well; during cold winters, fuels do not face the challenges that batteries do). This is not pie-in-the-sky, untested technology but is currently in production, albeit at pilot commercial scale.\nClean Up the Grid The use of natural gas to back up variable renewables is indeed unavoidable if wind and solar (and other variable sources such as tidal and wave energy) are not twinned with firm energy sources like nuclear, hydro, or geothermal. But the use of fossil fuels elsewhere in the supply chain of the production of clean energy options steadily declines over time as more and more of the economy decarbonizes. This aspect of clean energy options — their current and declining carbon intensity — is crucial to understand. Wind, solar, geothermal, nuclear, and so on do not produce zero emissions. They just produce far fewer than coal, oil, and gas when they run. But the resources that they are made of still have to be extracted and processed. These then have to be transported, and the final product still has to be manufactured. Extraction is often remote and unconnected to the grid, so diesel generation is often used to power these processes. Transportation in most places has yet to be decarbonized, so there is another source of emissions in the supply chain, and if manufacturing occurs pretty much anywhere other than those eight major economies that have decarbonized their grids, this is another part of the supply chain that adds a carbon footprint. But each of these stages can be decarbonized as well. Gibbs is somewhat right to be horrified at finding out that electric cars get their electricity from a coal-dominated grid, but then the solution is to clean up the grid. Decarbonization represents a virtuous circle: the cleaner everything is in part of the economy, the cleaner everything will be everywhere else in the economy. Small modular nuclear reactors are probably our best bet for the replacement of diesel generation for extraction. Electrification of short- and medium-haul trucks, ships, and planes, along with synthetic hydrocarbons for long-haul trucking, shipping, and aviation, will likely get us most of the way for the transportation challenge. Having clean grids also cleans up most manufacturing. There are particular difficulties posed by steel and cement production, because emissions here come not only from fossil fuel combustion but primarily from the chemical processes used to make the materials. But there are experimental manufacturing processes currently at various stages, from lab bench through to pilot projects that, given the appropriate public-sector supports, should be able decarbonize even these hard-to-decarbonize processes. All these technological solutions need the guiding hand of the public sector to fully realize their decarbonization capabilities. There is a lot to criticize about the injustices associated with the Obama administration’s $800 billion Great Recession economic stimulus legislation, the American Recovery and Reinvestment Act of 2009. But it gives a hint of what is possible. If you squint, you can even think of it as the first Green New Deal. Little remembered now, but the stimulus also included some $90 billion (admittedly down from $150 billion promised in Barack Obama’s 2008 platform) invested in clean electricity and transportation — including for advanced vehicle technologies, a smarter electric grid, and energy efficiency. It laid the foundation for the clean transition in the United States that had not really taken off prior to this point. Obama’s “mini” Green New Deal drove a twentyfold increase in spending on US clean energy, and it enabled construction of what was at the time the world’s largest wind farm and a number of the world’s largest solar arrays. In essence, the Obama stimulus, alongside China’s embrace of clean-tech manufacturing, shepherded what had previously been very expensive technologies down the cost curve. US wind capacity is now three times what it was in 2008, and solar capacity six times. LED lightbulbs were barely 1 percent of the US lighting market at the time; now they own more than half of the sector. The stimulus also created the Advanced Research Projects Agency–Energy (ARPA-E), a research lab modeled on the Pentagon’s Defense Advanced Research Projects Agency (DARPA) that was famously responsible for the development of the internet but also most of the dozen or so technologies in the smartphone in your pocket. Whatever we think of Elon Musk’s union-busting, it is likely that there would never have been a Tesla without the stimulus’s electric battery manufacturing subsidies and risk-sharing. The boost in spending on renewables in particular, together with the shift from coal to cheaper shale gas, were roughly equally responsible for cutting US CO 2 emissions in the power sector by 28 percent since 2005. Where Obama’s mini Green New Deal failed was in its scale: $90 billion over ten years was a great catalyst but far from sufficient to achieve the scale of deep decarbonization required: 100 percent net emissions reduction by mid-century. A much more ambitious and much more interventionist effort will be needed in the United States and beyond. We need a Green New Deal with a multitrillion-dollar price tag this time, on the scale of what Bernie Sanders had called for. The irony is that such gargantuan interventionism — colossal public-sector build-out of infrastructure, sharp increases in spending on clean-tech research and development at government and university labs, risk-sharing with firms with promising technologies to ensure they don’t disappear if venture capital dries up — requires exactly the sort of critiques of markets left to their own devices that should be Michael Moore’s bread and butter.", "url": "https://jacobinmag.com/2020/05/planet-of-the-humans-michael-moore-documentary-climate-change"}