{"authors": ["Yoga", "Meditation Instructor"], "date_download": "2020-05-04 20:22:15", "date_modify": "2020-05-04 20:22:15", "date_publish": "2020-04-28 18:07:42", "description": "So you suck at teaching Math and Science. Why not just bake a cake?", "filename": "entry_real-life-lessons-to-teach-your-kid-at-home-during-the-pandemic_l_5ea86ed2c5b66d8003aabe48_1588623735.html", "image_url": "https://img.huffingtonpost.com/asset/5ea870be3000004a10155107.jpeg?cache=NBhwquaaFP&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_real-life-lessons-to-teach-your-kid-at-home-during-the-pandemic_l_5ea86ed2c5b66d8003aabe48_1588623735.html", "title": "Real-Life Lessons to Teach Your Kid At Home During The Pandemic", "title_page": "Real-Life Lessons to Teach Your Kid At Home During The Pandemic | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Homeschooling during the pandemic has many of us struggling. While our teachers continue to go above and beyond providing resources and assignments, the message for us as parents is to just do what you can.\nWhile some of us thrive on color-coded schedules, others of us are finding the struggle all too real, in between work demands, our kids’ attitudes to homeschooling, and, oh yeah, our lack of a teaching degree. Don’t worry. This is not forever and your kids will catch up academically, if kitchen-table classes have been a fail.\nSo instead, we’ve compiled a list of real-life lessons your kids will actually enjoy:\n1. Bake a cake\nWhat happens to a solid fat (butter or coconut oil) when it’s heated? How do raising agents work? What happens to the batter after it spends time in the oven? As you make a cake with your kids, talk about the science behind the magic. You should also get them to do all the measuring and weighing of ingredients, so they’re working with fractions, weights and conversions. You could even have them prepare a grocery list for the ingredients, sticking to a budget.\nHave them read the recipe and follow the step-by-step instructions. Then talk about the nutritional value of the ingredients you use: How apple sauce, bananas or carrots are better for you as sweeteners than just sugar; or how you can bump up the protein by with nuts or nut flours. Last part: Pure joy, as you savor the freshly baked end results.\nLife skills: Being able to make food from scratch and budgeting\nAcademic skills: Home economics, chemistry, math, literacy, nutrition\ngpointstudio via Getty Images Close up of family in the kitchen\n2. Grow something edible\nNurture your kid’s green thumb by having them plant something in soil or sprout something on damp cotton. You can try fast-growing cress or mustard seeds, or seeds scooped from a fresh tomato, or even an old potato that’s started growing new roots in the bag. Cleaned-out yogurt tubs or even empty toilet paper rolls make cheap and convenient pots for easy-to-grow seedlings like kale, mesclun mix and endive. Older kids can collect data every couple of days, about the growth and condition of the plants, then you can chat about important variables, like sunlight, shade and watering.\nLife skills: Surviving the apocalypse (JK!) and gardening\nAcademic skills: Botany, environmental science, social studies\n3. Learn to relax\nSo soccer fields, monkey bars and basketball courts are closed for business right now. But your kid can still do something with their excess energy and big emotions at home through yoga. All you need is a little floorspace to lay out a mat or folded blanket. To do a more formal kids’ yoga class, you’ll need internet access too, but really, the most important thing about yoga is learning how to breathe.\nYou can keep the at-home practice simple, having your kid lie down on the floor with their eyes closed, while you talk them through stretches or tightening and relaxing their muscles, from head to toe. Encourage them to take slower and deeper breaths, with their hand on their belly, so they can feel their abdomen rise and fall. Older kids might enjoy learning about the origins and history of yoga too. Here’s a great resource that explains the basics.\nLife skills: Emotional regulation, coordination, self-discipline\nAcademic skills: Phys. ed., health sciences, world religions, geography\n“Audiobooks give us the opportunity to listen to a story together, and they take the monotony out of tasks such as folding laundry.”\n4. Drop off donations at a shelter or food bank ― or help a neighbor\nWith so many people in our communities experiencing income loss and food and housing insecurity right now, a hands-on lesson in human kindness is probably the most valuable thing we can give our kids. Chat with your children about how the pandemic is affecting more vulnerable people, in age-appropriate ways, then do some research together, either online or by picking up the phone, to see how you can help.\nYou could have your kids earn money doing extra chores, to buy things to give to the charity of their choice. Or you could get involved with a grassroots neighborhood group that supports frontline health workers, by walking their dogs and dropping off prepared meals. Maybe your kids can check in on a senior on your street who lives alone by video chat, and then chat or play a game together, to break their isolation. There are so many ways to help!\nLife skills: Serving others, budgeting and community-mindedness\nAcademic skills: Research and math (high-school kids could get their volunteer hours too)\n5. Fold laundry together while listening to a podcast or audiobook\nWith all of the additional demands and ongoing stress of the pandemic, sometimes we are beyond exhausted, and reading to our kids or persuading them to read a book might just feel like one thing too much. Audiobooks give us the opportunity to listen to a story together and they take the monotony out of tasks such as folding laundry, turning them into moments for bonding.\nSites like Audible currently offer a selection of kids books that can be streamed for free, as do many public libraries. It’s fun to chat afterwards about what you listened to together. Consider things like how the details of the story were revealed, what the surprises were and what you both thought of the main characters.\nLife skills: Marie-Kondo-like folding abilities, multi-tasking and listening\nAcademic skills: Literacy, media literacy, critical thinking, home economics", "url": "https://www.huffpost.com/entry/real-life-lessons-to-teach-your-kid-at-home-during-the-pandemic_l_5ea86ed2c5b66d8003aabe48"}