{"authors": ["Trends Reporter"], "date_download": "2020-05-04 20:16:11", "date_modify": "2020-05-04 20:16:11", "date_publish": "2020-04-28 07:39:13", "description": "Jimmy Kimmel, Trevor Noah, Stephen Colbert and Seth Meyers roasted Trump's attempt to walk back his disinfectant injection blunder.", "filename": "entry_late-night-disinfectant-injection-trump_n_5ea7a8e4c5b6085825782ba5_1588623371.html", "image_url": "https://img.huffingtonpost.com/asset/5ea7b7c9250000450feb071e.jpeg?cache=4nqxq6og4a&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_late-night-disinfectant-injection-trump_n_5ea7a8e4c5b6085825782ba5_1588623371.html", "title": "Late Show Hosts Annihilate Trump's ‘Sarcasm’ Defense", "title_page": "Late Show Hosts Annihilate Trump's ‘Sarcasm’ Defense | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "“I was asking a question sarcastically to reporters like you just to see what would happen,” Trump said on Friday, after facing enormous backlash for his comments a day earlier.\nIn the wake of the nationally televised briefing, multiple governors reported an uptick in calls seeking guidance about Trump’s idea, and the manufacturer of Lysol and Dettol felt it necessary to issue a statement advising that its products should “under no circumstance” be administered into the human body.\nStephen Colbert, Jimmy Kimmel, Trevor Noah and Seth Meyers’ late-night shows all dedicated segments to the debacle.\n“If there’s one thing people want from leadership during a pandemic, it’s sarcasm,” Meyers said. “And that was me, using sarcasm.”\nKimmel joked that “the Tide Pods appear to be turning on” Trump, and wondered if people could “claim we were being sarcastic when we elected him president?”\nAnd Colbert wondered if Trump was also being sarcastic when he took his oath of office.\nCheck out Kimmel’s from-home roast on “Jimmy Kimmel Live” below:", "url": "https://www.huffpost.com/entry/late-night-disinfectant-injection-trump_n_5ea7a8e4c5b6085825782ba5"}