{"authors": ["Katie Lobosco"], "date_download": "2020-05-04 17:03:47", "date_modify": "2020-05-04 17:03:47", "date_publish": "2020-04-10 17:16:55", "description": "The Internal Revenue Service said Friday that some stimulus payments will start going out next week, starting with people who have filed tax returns for 2018 or 2019 and authorized direct deposit.", "filename": "2020_04_10_politics_stimulus-check-free-tax-filing_index_1588611827.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409164525-money-b-roll-briefing-04092020-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_stimulus-check-free-tax-filing_index_1588611827.html", "title": "IRS says stimulus payments will begin next week", "title_page": "Stimulus money: IRS says payments will begin next week - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Internal Revenue Service said Friday that some stimulus payments will start going out next week, starting with people who have filed tax returns for 2018 or 2019 and authorized direct deposit.\nThe first round of direct-deposit payments will be made automatically to qualifying taxpayers.\nThe timeline keeps the first payments on the schedule promised by Treasury Secretary Steven Mnuchin , who said April 2 that the payments would begin going out within two weeks. He had earlier pushed for distributions, part of the $2.2 trillion economic relief package passed by Congress in March, to start as early as April 6.\nAlso on Friday, the IRS launched a new tool to help low-income people who aren't normally required to file returns to input some basic information so that they can receive the stimulus money. They'll have to provide their Social Security number, name, address, and the number of their dependents -- as well as bank account information if they want to receive a direct deposit.\nNext week, the IRS is planning to roll out a web portal that will give people whose bank account information is not on file with the agency the ability to submit it in order to get their stimulus payments faster, without waiting for paper checks. It will also help people check on the status of their payments.\nThe free \"Get My Payment\" web application will be accessible on the IRS website and allow taxpayers who provide their social security number, birth date and mailing address to monitor their payment status, according to a Treasury press release on Friday.\nThose who also submit their adjusted gross income from their most recent -- either 2019 or 2018 -- submitted tax return, the corresponding refund or amount owed, and their bank account information \"will get their Economic Impact Payments in their bank accounts quickly, instead of waiting for a check to arrive in the mail,\" according to the press release.\nSee how much you're eligible for here:", "url": "https://www.cnn.com/2020/04/10/politics/stimulus-check-free-tax-filing/index.html"}