{"authors": [], "date_download": "2020-05-04 20:13:00", "date_modify": "2020-05-04 20:13:00", "date_publish": "2020-04-15 19:28:18", "description": "MINNEAPOLIS (AP) — Minnesota has added two accomplished frontcourt players to its roster, bringing in Liam Robbins from Drake and Brandon Johnson from Western Michigan. The Gophers announced...", "filename": "_817f2dedfba428db056548c9c12df7b0_1588623180.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ec632cc5cb6b4acfa0a51f2086617f3c/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_817f2dedfba428db056548c9c12df7b0_1588623180.html", "title": "Gophers get big men transfers Liam Robbins, Brandon Johnson", "title_page": "Gophers get big men transfers Liam Robbins, Brandon Johnson", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this March 6, 2020, file photo, Northern Iowa's AJ Green (4) has his shot blocked by Drake's Liam Robbins (21) during the second half of an NCAA college basketball game in the quarterfinal round of the Missouri Valley Conference men's tournament in St. Louis. Minnesota has added two accomplished frontcourt players to the roster, bringing in Liam Robbins from Drake and Brandon Johnson from Western Michigan. The Gophers announced the signing of both big men on Wednesday, April 15, 2020. (AP Photo/Jeff Roberson)\nFILE - In this March 6, 2020, file photo, Northern Iowa's AJ Green (4) has his shot blocked by Drake's Liam Robbins (21) during the second half of an NCAA college basketball game in the quarterfinal round of the Missouri Valley Conference men's tournament in St. Louis. Minnesota has added two accomplished frontcourt players to the roster, bringing in Liam Robbins from Drake and Brandon Johnson from Western Michigan. The Gophers announced the signing of both big men on Wednesday, April 15, 2020. (AP Photo/Jeff Roberson)\nMINNEAPOLIS (AP) — Minnesota has added two accomplished frontcourt players to its roster, bringing in Liam Robbins from Drake and Brandon Johnson from Western Michigan.\nThe Gophers announced the signings of both big men on Wednesday.\nThe 7-foot, 235-pound Robbins has applied to the NCAA for immediate eligibility. He’ll have two seasons left with Minnesota. As a sophomore in 2019-20, Robbins led Drake with 14.1 points, 7.1 rebounds and 2.9 blocks per game, landing on the All-Missouri Valley Conference second team. His 99 blocks were fifth in the country and a program record. Robbins is a nephew of Gophers assistant coach Ed Conroy and a cousin of rising senior Hunt Conroy, a reserve guard.\nThe 6-foot-8, 220-pound Johnson is a graduate transfer who’ll be eligible immediately for his senior season with Minnesota. He averaged 15.4 points per game in 2019-20 and led Western Michigan with 8.1 rebounds and 1.0 blocks per game, landing on the All-Mid-American Conference third team.\nThe Gophers will lose star center Daniel Oturu, who turned pro after his sophomore season. Point guard Marcus Carr also declared for the draft but did not sign with an agent, making him likely to return. Shooting guard Payton Willis is transferring to Charleston.\n___\nMore AP college basketball: https://apnews.com/Collegebasketball and https://twitter.com/AP_Top25", "url": "https://apnews.com/817f2dedfba428db056548c9c12df7b0"}