{"authors": ["Stephen Whyno"], "date_download": "2020-05-04 20:10:30", "date_modify": "2020-05-04 20:10:30", "date_publish": "2020-04-07 20:12:08", "description": "WASHINGTON (AP) — It has long seemed like a virtual certainty that the Redskins will take Chase Young with the second pick in the NFL draft. If the Cincinnati Bengals select LSU quarterback...", "filename": "_e548f82616ae3a8cbdbb3bae781783e2_1588623030.html", "image_url": "https://storage.googleapis.com/afs-prod/media/73c2ffed110945e5aac27df61b5a2a4a/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e548f82616ae3a8cbdbb3bae781783e2_1588623030.html", "title": "Redskins weigh drafting Chase Young vs. trading No. 2 pick", "title_page": "Redskins weigh drafting Chase Young vs. trading No. 2 pick", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Nov. 30, 2019, file photo, Ohio State defensive end Chase Young plays against Michigan in the first half of an NCAA college football game, in Ann Arbor, Mich. Record-setting defensive end Chase Young is leaving Ohio State early to enter the NFL draft, a widely expected move. The junior Heisman Trophy finalist made the announcement Friday, Jan. 3, 2020, on Twitter. He says he looks forward to \"joining a new family in the NFL this spring and being part of something special.” (AP Photo/Paul Sancya, File)\nFILE - In this Nov. 30, 2019, file photo, Ohio State defensive end Chase Young plays against Michigan in the first half of an NCAA college football game, in Ann Arbor, Mich. Record-setting defensive end Chase Young is leaving Ohio State early to enter the NFL draft, a widely expected move. The junior Heisman Trophy finalist made the announcement Friday, Jan. 3, 2020, on Twitter. He says he looks forward to \"joining a new family in the NFL this spring and being part of something special.” (AP Photo/Paul Sancya, File)\nWASHINGTON (AP) — It has long seemed like a virtual certainty that the Redskins will take Chase Young with the second pick in the NFL draft.\nIf the Cincinnati Bengals select LSU quarterback Joe Burrow first overall as expected, the Ohio State pass-rusher and Heisman Trophy finalist would fall into Washington’s lap.\nThe Redskins have taken calls about trading down, but the smart money’s still on them sticking at No. 2 and plugging Young into their lineup.\nNew coach Ron Rivera said on a video call Tuesday, “I’d like to believe in the back of my mind I know what we want to do,” and laid out the ramifications of trading back versus getting someone who can help right away.\n“If you’re going to make a trade and you’re going to go back, that guy you’re going to take at that spot has to be able to make the kind of impact you need to validate missing an opportunity to take a player that’s a high-impact guy,” Rivera said.\n“You’ve got to be able to sit there and say that the next guy that I’m going to take is going to be that high-impact guy, and that’s what I’m looking for. That’s what I believe we need is we need a guy that’s going to come in and really change our football team.”\nYoung fits that bill. The D.C. area native had 46 tackles and 16 1/2 sacks during his junior season at Ohio State and would provide a big boost to a defense that ranked sixth-worst in the league in 2019.\nRivera already acquired quarterback Kyle Allen from his old team, the Carolina Panthers, and there’s a wow factor to taking Alabama’s Tua Tagovailoa that would fit owner Dan Snyder’s persona. But Snyder is a big proponent of 2019 first-rounder Dwayne Haskins, and Tagovailoa might be more attractive to another team interested in trading up.\nRivera said he sees only a few players in the draft as immediate-impact rookies.\n“If you’re going to pass up Player A and you go back and you’re going to take Player D, Player D has to be equal to Player A,” Rivera said. “Because if Player A is going to play for you for 10 years and Player D may not, then did you really get value or did you just get a whole bunch of picks?”\nWashington doesn’t have a second-round pick after trading into the first round last year to take edge rusher Montez Sweat. Rivera said trying to acquire a new second-round pick is a possibility that he and vice president of player personnel Kyle Smith are evaluating.\n“There’s a lot to think about,” Rivera said. “We’ve talked as a group the last three days, four days, about what everybody needs to be aware of, what everybody needs to be ready to happen.”\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/e548f82616ae3a8cbdbb3bae781783e2"}