{"authors": [], "date_download": "2020-05-04 20:16:39", "date_modify": "2020-05-04 20:16:39", "date_publish": "2020-04-09 03:18:29", "description": "EUGENE, Ore. (AP) — A Eugene teen who beat a man to death in 2018 has become the first to be sentenced under a new law designed to keep teens accused of serious crimes in Juvenile...", "filename": "_24d78889c962711ff249b513bf1bc183_1588623399.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_24d78889c962711ff249b513bf1bc183_1588623399.html", "title": "Teen who killed sleeping man will serve up to 7 years", "title_page": "Teen who killed sleeping man will serve up to 7 years ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Teen who killed sleeping man will serve up to 7 years\nEUGENE, Ore. (AP) — A Eugene teen who beat a man to death in 2018 has become the first to be sentenced under a new law designed to keep teens accused of serious crimes in Juvenile Court.\nJonathan Daniel Kirkpatrick, now 18, admitted during a Tuesday hearing that he killed Ovid Neal, a 56-year-old homeless man, The Oregonian/OregonLive reported . Kirkpatrick’s crimes -- murder, first-degree robbery and second-degree assault -- are offenses that for adults carry long mandatory minimum sentences.\nKirkpatrick was initially charged as an adult but the law underwent a significant change while his case was pending and he was returned to juvenile court because the crimes occurred when he was 16.\nLane County Circuit Judge Jay McAlpin ordered Kirkpatrick into the custody of the Oregon Youth Authority. The most he could serve is about seven years because the state cannot hold or supervise juvenile offenders past their 25th birthdays.\nThe case represents the first test of Oregon’s overhauled juvenile justice system. Instead of automatically being waived into adult court, juveniles between ages 15 and 17 face a court hearing where a judge decides whether they should be tried as adults.\nLane County prosecutor Erik Hasselman said Neal was asleep Oct. 3 when Kirkpatrick used a rock the size of a football to bash his head. Kirkpatrick then “stood or stomped” on Neal, he said.\nKirkpatrick grabbed Neal’s backpack and fled. He found $11, prosecutors said.\nKirkpatrick apologized to Neal’s family during the hearing.", "url": "https://apnews.com/24d78889c962711ff249b513bf1bc183"}