{"authors": ["Connor Kilpatrick", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Luke Savage", "Michael Arria", "Branko Marcetic"], "date_download": "2020-05-04 19:51:59", "date_modify": "2020-05-04 19:51:59", "date_publish": "2020-02-25 00:00:00", "description": null, "filename": "2020_02_chris-matthews-crybully-bernie-sanders-nevada-bloomberg_1588621919.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/02/25095824/GettyImages-1207524557.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_02_chris-matthews-crybully-bernie-sanders-nevada-bloomberg_1588621919.html", "title": "Chris Matthews Is Just Another Crybully", "title_page": "Chris Matthews Is Just Another Crybully", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Chris Matthews likes to fart on TV. I’m not making this up. He’s done it more than once, live, on the air.\nHere he is just a couple months ago, really letting one rip, not just loud but tuba-loud. Here he is again a few years ago, holding his tongue for just a beat while he fires one off.\nI used to think it was stress relief — blowing off a little steam under those hot MSNBC cameras. But lately, it’s a different kind of gaseous substance emanating from Matthews’s bowels — squeaking out not through his ample rear cushion but through his mouth. And Bernie Sanders seems to be the catalyst of the tummy turmoil.\nAfter Bernie’s victory in New Hampshire, Matthews crossed his arms and explained on live television that while Bernie talks a good game about Nordic social democracy, he feared something much darker lurking within the Vermont senator:\nI have an attitude about [socialists]. I remember the Cold War . . . I believe if Castro and the Reds had won the Cold War, there would have been executions in Central Park, and I might have been one of the ones getting executed. And certain other people would be there cheering.\nAnd when Bernie won his crushing victory in Nevada, Matthews doubled down, comparing Sanders’s win to the fall of France in 1940, neglecting to mention the name of the nation and its dictator responsible for that fall. Sanders wasn’t just a Red anymore for Matthews — now he’s one of those Commie-Nazis McBain tried to warn us about!\nAfter hearing that, I wondered if perhaps Matthews wasn’t so much passing gas on TV these days as filling his diaper.\nA Central Park revolutionary tribunal is a vivid image, to say the least — so vivid that I can’t help but think I’ve seen that movie, too. It sounds vaguely like the 1979 Walter Hill classic The Warriors , with Bernie Sanders declaring a revolution against bourgeois society from Van Cortlandt Park with a thunderous “Can . . . you . . . dig it?” Or maybe it’s Red Dawn ’s Harry Dean Stanton, screaming, “Avenge me!” from his Colorado reeducation camp.\nBut maybe with Matthews it’s all just projection — the guilty conscience of a self-described true-believing Cold Warrior. A man who saw the anti-communist crusade as a series of well-intentioned and strictly defensive measures, in which every act of US aggression was necessary to keep the last domino from falling. An American who shrugged or maybe even breathed a sigh of relief as his own government helped Suharto slaughter almost a million Indonesians from 1965 to 1966 under the same anti-communist banner (“one of the worst mass murders of the 20th century,” according to a 1968 CIA report), to say nothing of the other anti-Red crusades of Matthews’s adulthood, like the Vietnam War, Operation Condor, and the Dirty Wars in Latin America, all of which Sanders vigorously opposed.\nThis is the “side” Matthews so proudly and publicly stands behind in the year 2020 — as a Democrat on the liberal network MSNBC, no less.\nIt’s easy to dismiss his McCarthyist fever dream as the ramblings of an old man in a changing world. But the same weaponized paranoia has an infinitely milder, though no less politicized, successor waiting in the wings — another strategy that turns on the perceived victimhood of the powerful, and points toward a rapid mobilization of elite networks to crush any challenge to the status quo. I’m talking about the Crybully.\nAnyone who’s followed the Discourse Wars of the late 2010s has encountered the Crybully. The Crybully is the blue-check journalist or celebrity screaming about a barrage of “online harassment” from supposed Sanders fans — screaming with so much stridency that their peers in the media breathlessly cover the accusation as a national emergency. Anyone who challenges that narrative is smeared and steamrolled.\nThis year, the Crybully went into full swing just before the Nevada caucus, when the leadership of the influential and powerful Culinary Union claimed that they were being “mobbed” by harassers — the dreaded Bernie Bros — for daring to question Medicare for All. Sanders’s rivals grabbed every network camera they could find to demand that Bernie call off his Red dogs.\nEven the moderators at the Nevada debate demanded that Sanders apologize for any anonymous emails or pig poop balls that might have been tweeted at his rivals or any of their supporters. Mayor Pete Buttigieg could hardly contain his excitement, confronting Sanders directly: “I think you have to accept some responsibility and ask yourself what it is about your campaign in particular that seems to be motivating this behavior more than others.”\nBut then reality came crashing down. Media narratives are no match for a mobilized social base. And a few days later, rank-and-file members of the Culinary Union — apparently unruffled by tweets sent to their union’s officials — delivered a victory to Sanders so overwhelming that he’s poised to receive more than half of all delegates from the state.\nAnd in the 2020 Democratic primary, there is perhaps no more perfect Crybully at the moment than the Michael Bloomberg campaign — a sort of upper-middle-class WPA for liberal NGOs and campaign advisers currently milking Mayor Mike’s ego to the tune of millions every month.\nSome Americans seem to be bristling at the prospect of one of the richest men in the world attempting to buy the highest office of the land — he’s already spent $464 million of his nearly $62 billion fortune — and some of his campaign offices have been defaced.\nRandom acts of vandalism? No. Not for a Crybully. Someone has to pay, and for a Crybully in the Discourse, the person who must pay is probably the crusty but massively popular socialist in the $250 Kohl’s suit calling into question the privileges of the billionaire class:\nYet again, one of our campaign offices has been vandalized with derogatory language — using the word “oligarch” — in an act of hate . . . While we do not know who is directly responsible, we do know Senator Bernie Sanders and his campaign have repeatedly invoked this language.\nWith no evidence, one of the richest and most powerful men in the world — so confident he could buy the presidency that he actually skipped the first four contests — uses the pretext of a broken window to turn his ginormous media blitz against Sanders, going so far as to frame “oligarch” — or rather, “the O-word” — as a new kind of hate speech.\nAnd yet, once again, Sanders went up in the national polls. And Bloomberg went down.\nThe problem with Crybullies is that while, in the short term, they can make a lot of noise and shut down questioning with wilder and wilder histrionics, sooner or later, people notice the pattern: the tactic’s consistent deployment for the purpose of defending moneyed interests from any challenge.\nAnti-communism was the animating force behind a belligerent, often murderous international crusade that simultaneously claimed perpetual victimhood; it had the added perk of destroying the New Deal labor left here in the United States. Every massacre, every load of napalm, no matter how powerless its target, was somehow never the act of a much wealthier, much-better-armed aggressor, but a defense against the onrushing hordes, the Red barbarians at the gates ready to destroy us.\nThe fact that a self-identified socialist is now the most popular presidential candidate in the former global headquarters of the anti-communist crusade suggests that, eventually, people take notice when the bogeyman they’re constantly warned about never shows up.\nWe’re only a couple of months into 2020, but so far, it’s feeling like a real turning point in this country. The scare stories about Medicare for All, Venezuela, and the dangers of electing a “divisive” radical to the White House seem to be losing their grip on the public imagination. March is almost here, and it’s already beginning to feel like an American Spring: despite all the media smears, Bernie Sanders is now poised to win the Democratic nomination.\nSo I hope they keep Chris Matthews on the air for the rest of the campaign. He might convince a few viewers with his paranoia, but he’s far more likely to expose the Crybully for what he really is — and what he’s really protecting.\nEven if that’s all the political revolution turned out to be, I’d still take it.", "url": "https://www.jacobinmag.com/2020/02/chris-matthews-crybully-bernie-sanders-nevada-bloomberg"}