{"authors": ["Por Astrid Galvan"], "date_download": "2020-05-04 20:22:07", "date_modify": "2020-05-04 20:22:07", "date_publish": "2020-04-21 02:38:06", "description": "PHOENIX (AP) — El gobierno de Donald Trump apeló el lunes una orden de un tribunal federal que requiere que la Patrulla Fronteriza proporcione camas, frazadas, duchas, alimentos de calidad y...", "filename": "_715b864ddbaee8cbbf52c21a303bbad1_1588623727.html", "image_url": "https://storage.googleapis.com/afs-prod/media/7392114441eb49848ad48d5000292140/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_715b864ddbaee8cbbf52c21a303bbad1_1588623727.html", "title": "EEUU apela orden de darle camas a migrantes en Arizona", "title_page": "EEUU apela orden de darle camas a migrantes en Arizona", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nPHOENIX (AP) — El gobierno de Donald Trump apeló el lunes una orden de un tribunal federal que requiere que la Patrulla Fronteriza proporcione camas, frazadas, duchas, alimentos de calidad y evaluaciones médicas para los migrantes que sean detenidos en muchas instalaciones de Arizona durante más de 48 horas.\nEn febrero, el juez David C. Bury falló en favor de los migrantes que demandaron hace casi cinco años por lo que describieron como condiciones inhumanas y peligrosamente sobrepobladas en el Sector Tucson de Arizona, que abarca la mayor parte del estado.\nBury escribió que la Patrulla Fronteriza y las agencias de las que depende, incluyendo la Oficina de Aduanas y Protección Fronteriza (CBP, por sus siglas en inglés), “administran un sistema de detención que priva a los que son detenidos... más de 48 horas, de condiciones de confinamiento que estén a la altura de las necesidades humanas básicas”.\nEl juez emitió la orden final la semana pasada, pidiéndole al gobierno que proporcione camas de verdad, no colchonetas, y frazadas lavables, no las isotérmicas que se les dan ahora. Requiere también que los inmigrantes que sean detenidos más de dos días reciban alimentos aprobados por un nutriólogo y sean evaluados por un doctor, enfermera u otro profesional médico.\nDesde hace tiempo los migrantes han denunciado las condiciones de vida en las instalaciones de la Patrulla Fronteriza, y la demanda a la que se hace referencia se entabló en junio de 2015. En un video mostrado durante el juicio en enero podía verse a un hombre caminando entre varias personas acostadas para llegar a un baño. La celda en la que se encontraba estaba tan atestada que también había migrantes durmiendo en los baños.\nEl gobierno dice que las instalaciones están diseñadas para estancias cortas y que los inmigrantes sólo se quedan allí por períodos extendidos cuando otras agencias carecen de la capacidad para recibirlos.\nEl gobierno del presidente Donald Trump no mencionó una razón para su apelación. Pero abogados gubernamentales argumentaron en la corte que no se había demostrado ninguna violación constitucional, y que la Patrulla Fronteriza ha tomado medidas para reducir el tiempo que las personas están detenidas. Un abogado también dijo en un juicio que no había fondos para construir instalaciones con camas.\nLa orden sólo es aplicable al Sector Tucson, que incluye ocho instalaciones donde los migrantes son detenidos antes de ser deportados o transferidos al Servicio de Control de Inmigración y Aduanas.", "url": "https://apnews.com/715b864ddbaee8cbbf52c21a303bbad1"}