{"authors": [], "date_download": "2020-05-04 21:06:12", "date_modify": "2020-05-04 21:06:12", "date_publish": "2020-04-17 23:14:32", "description": "PORTLAND, Ore. (AP) — Multnomah County placed its mental health court monitors on paid administrative leave, and the four employees all resigned after investigations of misconduct, county...", "filename": "_8aa6d95860895c8dd513d628d8725e43_1588626372.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8aa6d95860895c8dd513d628d8725e43_1588626372.html", "title": "Mental health court staff gone after misconduct probe", "title_page": "Mental health court staff gone after misconduct probe", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Ore. (AP) — Multnomah County placed its mental health court monitors on paid administrative leave, and the four employees all resigned after investigations of misconduct, county documents show.\nThree of them worked as mental health court program case managers, and one served as a mental health consultant. The county opened an investigation into the employees in late 2019, The Oregonian/OregonLive reported .\nThe mental health court is one of Multnomah County’s specialized treatment courts that function like diversion programs for defendants with certain underlying issues. Court monitors are tasked with helping clients follow through with the court’s recommendations and connecting them with community services.\nThe court focuses on defendants with severe and persistent mental illness, said Ebony Clarke, the director for the Multnomah County Mental Health and Addiction Services division. Case managers typically handle between 15 and 20 cases, she said.\n“This is one of the most vulnerable populations,” Clarke said. “When this happened, I was significantly concerned, appalled and had to take immediate action.”\nThe county investigated complaints that the employees were not meeting with clients face-to-face as often as they were supposed to and failed in several ways to support their clients.\nOne employee allegedly used time that she was supposed to be meeting with county clients to operate her own business. Another reportedly made repeated racist comments to a coworker. The third employee allegedly failed to meet with at least one client for more than a year, and the fourth was accused of failing to connect clients to needed meal vouchers and medications.\nThree of the employees received a letter of proposed dismissal. The fourth received a written reprimand. The workers resigned in lieu of being terminated this year.\nIn addition to the mental health court investigation, Multnomah County Chair Deborah Kafoury assigned interim chief operating officer Peggy Brey to investigate the entire mental health division and identify the root causes of the division’s problems, mitigate the damage to clients, and ensure that the same thing wouldn’t happen again.\nNow, Clarke said, two people have been hired as permanent case managers for the mental health court, and two more are in the process of being hired.", "url": "https://apnews.com/8aa6d95860895c8dd513d628d8725e43"}