{"authors": [], "date_download": "2020-05-04 20:06:38", "date_modify": "2020-05-04 20:06:38", "date_publish": "2020-04-07 19:08:55", "description": "TAMPA, Fla. (AP) — The Tampa Bay Buccaneers are all in for a new look in 2020. Building on momentum created by the signing of six-time Super Bowl champion Tom Brady in free agency, the Bucs...", "filename": "_192e12cec1fc33c9403482653f717d69_1588622798.html", "image_url": "https://storage.googleapis.com/afs-prod/media/0fcbe555399b4f46a8d0cc63edaae0db/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_192e12cec1fc33c9403482653f717d69_1588622798.html", "title": "Buccaneers unveil new, yet familiar look for next season", "title_page": "Buccaneers unveil new, yet familiar look for next season", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Buccaneers unveil new, yet familiar look for next season\nIn this handout released by the Tampa Bay Buccaneers Tuesday, April 7, 2020, from left, wide receiver Chris Godwin, linebacker Lavonte David, and linebacker Devin White, wear the team's new uniforms that they will debut during the 2020 NFL football season. (Tampa Bay Buccaneers via AP)\nIn this handout released by the Tampa Bay Buccaneers Tuesday, April 7, 2020, from left, wide receiver Chris Godwin, linebacker Lavonte David, and linebacker Devin White, wear the team's new uniforms that they will debut during the 2020 NFL football season. (Tampa Bay Buccaneers via AP)\nTAMPA, Fla. (AP) — The Tampa Bay Buccaneers are all in for a new look in 2020.\nBuilding on momentum created by the signing of six-time Super Bowl champion Tom Brady in free agency, the Bucs on Tuesday unveiled new uniforms for next season — a move that also figures to be embraced by fans.\nGone are jerseys sporting difficult to read digital alarm clock-style numbers, replaced by more traditional red, white and pewter ensembles similar to the uniforms the team wore from 1997-2013 — the most successful stretch in franchise history.\nThe Bucs have missed the playoffs 12 consecutive seasons and haven’t won a postseason game since their Super Bowl championship run 18 years ago.\n“This new but familiar look is a direct result of the valuable feedback we received from our fans,” team owner/co-chairman Ed Glazer said. “We are excited to return to our classic Super Bowl era uniforms while also introducing a sleek color rush uniform that showcases our signature pewter in a new and dramatic way.”\nIn addition to red home and white away jerseys that will be worn with pewter or white pants, the team for the first time is introducing a pewter jersey that will be worn with matching pants and socks as part of its head-to-toe “color rush” ensemble.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/192e12cec1fc33c9403482653f717d69"}