{"authors": ["Amy Woodyatt"], "date_download": "2020-05-04 16:07:40", "date_modify": "2020-05-04 16:07:40", "date_publish": "2020-04-02 14:45:58", "description": "Marine life in the world's oceans could recover to healthy levels in the next thirty years if decisive and urgent action is taken, an international review has found.", "filename": "2020_04_02_world_ocean-recovery-marine-intl-scli-scn_index_1588608460.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402140256-02-marine-life-study-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_world_ocean-recovery-marine-intl-scli-scn_index_1588608460.html", "title": "Marine life in the world's oceans 'can recover by 2050'", "title_page": "Marine life in the world's oceans 'can recover by 2050' - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Marine life in the world's oceans could recover to healthy levels in the next thirty years if decisive and urgent action is taken, an international review has found.\nA team of scientists from around the world found marine life to be \"remarkably resilient\" despite damage caused by human activity and interference, they said in a review published Wednesday in science journal Nature.\nResearchers said ocean populations could be restored as soon as 2050, but warned that there is limited time to achieve this change.\nRising temperatures, marine pollution and acidic water are all affecting marine life. About 70-90% of all existing coral reefs are expected to disappear in the next 20 years due to warming oceans, acidic water and pollution, scientists from the University of Hawaii Manoa said in February.\nResearchers found that in spite of marine biodiversity losses during the 20th century, population losses have slowed and in some cases seen a resurgence during the 21st century.\nScientists nodded to a series of successful interventions that were shown to have an impact on ocean populations, including a resurgence in the numbers of nearly extinct humpback whales following the end of commercial hunting in the southwest Atlantic.\nIn the review, scientists said that the rate of recovery of marine life could be accelerated for many ocean ecosystems, and that a \"substantial recovery\" could be achieved within two to three decades if pressures on the world's oceans -- including climate change -- were addressed, and wide reaching interventions were put into place.\nResearchers said the integrity of reef fish communities adds resilience to coral reefs and facilitates their recovery once pressures are removed.\n\"The success of many marine conservation projects in recent years illustrates how we can make a real difference to life in our oceans if we apply the lessons learnt from them at scale and with urgency,\" Professor Callum Roberts from the department of environment and geography at the University of York and co-author of the study, said.\nResearchers found that species and spaces should be protected, habitats should be restored, harvesting done wisely, pollution reduced, and climate change mitigated for ocean recovery to be successful.\nExperts identified nine components that are key to restoring marine life, which include seagrass, saltmarshes, mangroves, coral reefs, kelp, oyster reefs, fisheries, megafauna and the deep sea.\n\"Over-fishing and climate change are tightening their grip, but there is hope in the science of restoration. We now have the skills and expertise to be able to restore vital marine habitats such as oyster reefs, mangrove swamps and salt marshes -- which keep our seas clean, our coasts protected and provide food to support entire ecosystems,\" Roberts added.\nBut researchers warned that despite having the tools and knowledge to achieve change, time is of the essence.\n\"We have a narrow window of opportunity to deliver a healthy ocean to our grandchildren's generation, and we have the knowledge and tools to do so,\" lead author Dr Carlos Duarte, professor of marine science and Tarek Ahmed Juffali research chair in Red Sea Ecology at King Abdullah University of Science and Technology, said.", "url": "https://www.cnn.com/2020/04/02/world/ocean-recovery-marine-intl-scli-scn/index.html"}