{"authors": [], "date_download": "2020-05-04 21:07:10", "date_modify": "2020-05-04 21:07:10", "date_publish": "2020-04-16 21:35:45", "description": "GOSHEN, Ind. (AP) — A northern Indiana man faces welfare fraud and other charges alleging that he hid his father’s body for two years so that he could cash his father's benefit checks....", "filename": "_61db2c9857056b9fe7260fd92a93bbfb_1588626430.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_61db2c9857056b9fe7260fd92a93bbfb_1588626430.html", "title": "Indiana man facing charges of welfare fraud over hidden body", "title_page": "Indiana man facing charges of welfare fraud over hidden body", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GOSHEN, Ind. (AP) — A northern Indiana man faces welfare fraud and other charges alleging that he hid his father’s body for two years so that he could cash his father’s benefit checks.\nIrvin Nicholson Jr., 57, was charged Tuesday with three counts of felony welfare fraud and one misdemeanor count of failure to report a dead body. The charges came seven months after officers responding to a report of a dead body discovered Irvin Nicholson Sr.’s remains in a wheelbarrow in the backyard of an Elkhart County residence.\nThe younger Nicholson told investigators he had found his father dead in the garage in May 2017, one day after they argued about his plans to put the elder man in a retirement home, according to court records.\nInstead of reporting it to the authorities, authorities allege that he wrapped his dad’s body in a blanket. The remains were held mostly at one house before they were later moved to the Goshen home where they were found.\nInvestigators subpoenaed Social Security records and found that between May 2017 and August 2019, $27,210 was deposited into Nicholson Sr.’s account. Another $9,828 was deposited between June 2017 and August 2019, according to the state’s Public Retirement System records.\nThe defendant allegedly told investigators that he would use a card to spend some of the money that his father continued to get deposited in an account.\nFrom May 2017 through September 2019, Nicholson Jr. admitted to using $9,318 that was paid into a bank account owned by his father, according to U.S. Office of Personnel Management records.\nOnline court records do not list an attorney who could speak on the younger Nicholson’s behalf.\nA judge has not set an initial hearing date yet, but the prosecutor expects a summons will be issued for Nicholson Jr.\nIf convicted, he faces up to 2 and a half years in prison.", "url": "https://apnews.com/61db2c9857056b9fe7260fd92a93bbfb"}