{"authors": ["Anneken Tappe", "Annalyn Kurtz", "Cnn Business", "Daniel Zhao", "Senior Economist"], "date_download": "2020-05-04 16:16:07", "date_modify": "2020-05-04 16:16:07", "date_publish": "2020-04-03 12:34:10", "description": "The American economy lost more jobs than it gained for the first time in a decade.", "filename": "2020_04_03_economy_march-jobs-report-coronavirus_index_1588608967.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402163303-closed-business-0324-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_economy_march-jobs-report-coronavirus_index_1588608967.html", "title": "The US economy lost 701,000 jobs in March — worst report since 2009", "title_page": "The US economy lost 701,000 jobs in March -- worst report since 2009 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) The American economy lost more jobs than it gained for the first time in a decade.\nIn March, the economy shed 701,000 jobs, according to the Bureau of Labor Statistics. It was the first time the economy lost jobs in a month since September 2010, and the worst month for American jobs since the depths of the Great Recession in March 2009.\nThe unemployment rate shot up to 4.4%, from a near 50-year low of 3.5%. It was the highest unemployment rate since August 2017 and the largest single-month change in the jobless rate since January 1975.\nMost of the job destruction took place at restaurants and bars, where the economy lost 417,400 jobs. Retailers cut 46,200 jobs and health care employment fell by 43,000 jobs as routine visits at dentists and physicians offices fell.\nIf there's an ounce of good news in the March report, it's that bulk of the layoffs were temporary: 1.8 million people were unemployed temporarily last month, up from 1 million in February.\nRead More", "url": "https://www.cnn.com/2020/04/03/economy/march-jobs-report-coronavirus/index.html"}