{"authors": [], "date_download": "2020-05-04 21:06:44", "date_modify": "2020-05-04 21:06:44", "date_publish": "2020-01-20 07:03:53", "description": "OFFICIALS SMOKE OUT SUSPECTS IN POT DISPENSARY THEFT ALBUQUERQUE, N.M. (AP) — How did authorities get a pair of suspects in a marijuana dispensary break-in out of the building? For officials...", "filename": "_bbf53f1347164565bda29211e200354a_1588626404.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bbf53f1347164565bda29211e200354a_1588626404.html", "title": "AM-Prep: Kickers", "title_page": "AM-Prep: Kickers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "OFFICIALS SMOKE OUT SUSPECTS IN POT DISPENSARY THEFT\nALBUQUERQUE, N.M. (AP) — How did authorities get a pair of suspects in a marijuana dispensary break-in out of the building? For officials in Albuquerque, New Mexico, the answer was simple: smoke them out. Authorities say a SWAT team fired tear gas into the dispensary to end a standoff that lasted about four hours. One suspect fled into the arms of police immediately as soon as the tear gas canister exploded; the second suspect emerged later. Both face burglary charges.\nMEXICAN PRESIDENT SELLING OFF JET\nMEXICO CITY (AP) — The question these days in Mexico is: who is going to pay for it? In this case, “it” has nothing to do with a border wall — but the luxurious plane used by the country’s president. Andres Manuel López Obrador has been looking to sell the presidential jet as part of an austerity program. Only problem is, no one wants to buy it. The jet, a Boeing Dreamliner, had been sent to the U.S. to attract a buyer — but there are no takers. And the delay is affecting the price tag. While it sat in the U.S., the aircraft piled up about $1.5 million in maintenance costs.\nFIVE MOUNTAIN LIONS SPOTTED TOGETHER\nJACKSON, Calif. (AP) — There are a lot of animals that travel in packs. But mountain lions aren’t usually among them. And that’s why it was such a big deal when a home surveillance camera in California spotted five of the lions together. A TV station in Sacramento reports the footage of the mountain lions was recorded at a home near the El Dorado National Forest. State wildlife experts say they have never heard of five mountain lions hanging out together. They say the group appears to be a mother lion and her cubs. Even that would be extraordinary, since mother mountain lions often chase off their cubs after a year.\nby Oscar Wells Gabriel II", "url": "https://apnews.com/bbf53f1347164565bda29211e200354a"}