{"authors": ["Dee-Ann Durbin"], "date_download": "2020-05-04 20:28:07", "date_modify": "2020-05-04 20:28:07", "date_publish": "2020-04-13 18:23:15", "description": "Two McDonald’s workers in Florida are filing a $500 million class action lawsuit against the company, claiming a “systemic sexual harassment problem” at company-owned stores. The lawsuit was...", "filename": "_6ac43816281c1d1c1b0e633ae9dbda6a_1588624087.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f596410389d84fa3a0f21b3a9ca73b84/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6ac43816281c1d1c1b0e633ae9dbda6a_1588624087.html", "title": "Workers sue McDonald's over harassment at Florida stores", "title_page": "Workers sue McDonald's over harassment at Florida stores", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - This June 28, 2016, file photo shows a McDonald's sign in Miami. A few McDonald’s workers in Florida are filing a $500 million class action lawsuit against the company, claiming a \"systemic sexual harassment problem\" at company-owned stores. The lawsuit was filed Monday, April 13, 2020, in federal court in Illinois. (AP Photo/Alan Diaz, File)\nFILE - This June 28, 2016, file photo shows a McDonald's sign in Miami. A few McDonald’s workers in Florida are filing a $500 million class action lawsuit against the company, claiming a \"systemic sexual harassment problem\" at company-owned stores. The lawsuit was filed Monday, April 13, 2020, in federal court in Illinois. (AP Photo/Alan Diaz, File)\nTwo McDonald’s workers in Florida are filing a $500 million class action lawsuit against the company, claiming a “systemic sexual harassment problem” at company-owned stores.\nThe lawsuit was filed Monday in federal court in Illinois, where McDonald’s is based. In the complaint, current McDonald’s employee Jamelia Fairley and former employee Ashley Reddick say they were repeatedly subjected to sexual harassment and physical assaults at a company-owned McDonald’s in Sanford, Florida.\nFairley and Reddick initially filed charges last May with the U.S. Equal Employment Opportunity Commission. The commission dismissed the case in January but informed both women they had the right to sue McDonald’s within 90 days.\nAt least 50 workers have filed sexual harassment charges against McDonald’s with the commission over the past four years, and McDonald’s has acknowledged the problem.\nIn 2018, the company introduced harassment training for its U.S. franchisees and general managers. Last year, it released an enhanced anti-discrimination policy, started a hotline for employees to report problems and said it would provide a new training program for all of its 850,000 U.S. employees.\nBut in the lawsuit, Fairley and Reddick said McDonald’s is not ensuring that franchisees provide the training. Franchisees own approximately 95% of McDonald’s 14,000 U.S. restaurants. The lawsuit also said McDonald’s isn’t training store managers or adequately punishing serial harassers.\nIn a statement Monday, McDonald’s said it is committed to ensuring that employees work in an environment free from discrimination and harassment. The company said employees at all of its company-owned stores are receiving training, and it is encouraging franchisees to provide it as well.\n“The plaintiffs’ allegations of harassment and retaliation were investigated as soon as they were brought to our attention, and we will likewise investigate the new allegations that they have raised in their complaint,” the company said.\nThe lawsuit seeks $100,000 in damages for about 5,000 women who have worked at 100 company-owned stores in Florida since April 2016.", "url": "https://apnews.com/6ac43816281c1d1c1b0e633ae9dbda6a"}