{"authors": [], "date_download": "2020-05-04 16:07:56", "date_modify": "2020-05-04 16:07:56", "date_publish": "2020-04-02 15:21:54", "description": "Looking to upgrade your home office setup? Now is the perfect time, as B&H Photo Video is having a sale on select Apple products for a limited time. The discounted lineup includes a 2019 MacBook Air, first and second generation AirPods, Mac minis and the 2018 iPad Pro.", "filename": "2020_04_02_cnn-underscored_apple-sale-bhphotovideo-deals_index_1588608476.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402105811-apple-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_cnn-underscored_apple-sale-bhphotovideo-deals_index_1588608476.html", "title": "Apple sale: Save on select devices at B&H Photo Video", "title_page": "Apple sale: Save on select devices at B&H Photo Video - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Looking to upgrade your home office setup? Now is the perfect time, as B&H Photo Video is having a sale on select Apple products for a limited time. The discounted lineup includes a 2019 MacBook Air, first and second generation AirPods, Mac minis and the 2018 iPad Pro.\nMacBook Air\nMacBook Air\nThe 2019 MacBook Air is on sale in gold for $999, down from $1,299, and in silver for $899, down from $1,099. The 13.3-inch screen features a Retina Display with True Tone Technology for an ultra clear, colorful picture. It's also particularly thin and lightweight; the thickest part of the laptop is just 0.61 inches, and at just 2.75 pounds, it's an excellent choice for carrying in a briefcase or backpack, once you're back to commuting. Meanwhile, the Air's front-facing HD camera provides high-quality FaceTime views, which definitely come in handy right now.\n2019 MacBook Air in Gold ($999, originally $1,299; bhphotovideo.com )\n2019 MacBook Air in Silver ($899, originally $1,099; bhphotovideo.com)\nAirPods\nAirPods\nIf you've been frustrated taking conference calls with your wired headphones, now is the perfect time to get yourself some AirPods, since both the first and second gen models are on sale. The most prominent difference between the first and second generations is the wireless charging feature. The first generation AirPods have a 24-hour battery life with the charging case, delivering five hours of listening time after a single charge. The second generation's wireless charging case gives it more than 24 hours of battery life, since placing your AirPods back into the case for just 15 minutes will provide another three hours of use. Read our full review of the second generation AirPods here.\nApple AirPods Wireless Bluetooth Earphones, 1st Generation ($129, originally $159; bhphotovideo.com )\nApple AirPods with Wireless Charging Case, 2nd Generation ($169.95, originally $199.95; bhphotovideo.com)\nMac mini\nMac mini\nThe Mac mini's sleek design will take up less space on your desk while packing a punch for your computer experience, and two storage options are on sale now. The smaller storage option (128GB) runs on a 3.6 GHz Intel Core i3 Quad-Core processor, while the larger storage version (512GB) operates on a 3.2 GHz Intel Core i7 Six-Core processor. Depending on your storage needs, and your budget, either of these Mac mini options will serve you well.\n2018 Mac mini, 128GB ($649, originally $819; bhphotovideo.com )\n) 2018 Mac mini, 512GB ($1,299, originally $1,499; bhphotovideo.com)\niPad Pro\niPad Pro\nFinally, the 2018 iPad Pro is on sale in both space gray and silver. The 11-inch screen features a Liquid Retina Display, providing a high-quality screen experience. The 2018 iPad Pro removed the home button and features Face ID security. This device's battery will last 10 hours, even when running multiple apps and using Wi-Fi. This on-sale model is Wi-Fi only and boasts 512GB of storage, which should be plenty for average users.\n2018 iPad Pro in Space Gray and Silver ($999, originally $1,149; bhphotovideo.com)\nFor more great Apple deals, check out CNN Coupons.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/02/cnn-underscored/apple-sale-bhphotovideo-deals/index.html"}