{"authors": ["Nicole Aschoff", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:39", "date_modify": "2020-05-04 19:59:39", "date_publish": "2020-03-09 00:00:00", "description": null, "filename": "2020_03_amazon-go-cashierless-grocery-seattle_1588622379.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/09121541/GettyImages-1203051220.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_amazon-go-cashierless-grocery-seattle_1588622379.html", "title": "Jeff Bezos Wants America to Be One Giant Amazon Marketplace", "title_page": "Jeff Bezos Wants America to Be One Giant Amazon Marketplace", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Amazon has opened a 10,000-square-foot cashierless grocery store in Seattle, signaling that it’s going big on its “just walk out shopping” model. Customers at Amazon Go Grocery simply check in with their smartphone, take what they want off the shelves, and walk out the door. Amazon’s store is more than just a new way to shop, however. It is part of the company’s vision for the future — a future in which more and more of the spaces in our lives are transformed into one giant Amazon marketplace.\nGranted, there is much that is appealing in Amazon’s cashier-less model. Those of us who lack the zen-like calm of Kurt Vonnegut — who professed to enjoy standing in line for stamps at the post office — might relish the opportunity to skip the early evening checkout rush. The ability to drop milk and bread into your basket and just walk out removes the key bottleneck in the grocery store shopping experience.\nRemoving consumption bottlenecks appears to be a core aim of Amazon’s business empire. There are few faster ways to order products online than Amazon’s smartphone app. Need a new umbrella or a pack of batteries? Just tap the app, and, like magic, your purchase will appear on your doorstep in a day or so. Or, better yet, just ask Alexa. The cloud-based voice service is always listening, ready to help.\nRetailers have been trying to remove consumption bottlenecks for generations. Sears, Roebuck and Company, the original Amazon, made huge strides in doing so. Its “Consumers’ Bible” provided rural Americans unprecedented access to what, at the time, was a mind-boggling range of household goods.\nToday, Amazon is bringing us the next evolution of shopping. But despite its appeal, Amazon’s cashier-less grocery store is not something to celebrate.\nFor one thing, the model is designed to destroy jobs — its number-one selling point is that it could potentially eliminate an entire category of employment. Obviously, Amazon did not inaugurate job-destroying automation in the grocery sector. Self-checkout machines have been around for years, and Walmart and 7-Eleven are testing out their own cashierless strategies.\nIn fast food, McDonald’s has installed self-service ordering kiosks to replace cashiers. By the end of 2020, kiosks will be present at all McDonald’s locations in the United States. But Amazon is leading the pack in using the latest technology to control and rationalize the labor process.\nCashier jobs, which are typically low paid and monotonous, are not great jobs. Most of them do not provide a living wage or a pathway to better employment. Nonetheless, millions of Americans rely on them. Is the convenience of not having to wait in line for a few minutes at the grocery store worth destroying millions of jobs?\nThese trade-offs are rarely considered in capitalism. Amazon, like all corporations, is primarily concerned with the bottom line. The workers who make Amazon’s frictionless consumption model possible are seen as little more than production inputs — marched around, used up, and discarded. Cashiers, like the company’s “pickers” and drivers who toil in grueling conditions to make sure that a package gets to our door in record time, are dispensable. If costs are cut, technological change is chalked up as a success, regardless of the cost to families and communities.\nBeyond the issue of job destruction, Amazon’s business model highlights other trade-offs to consider. The company’s huge strides in providing frictionless consumption threaten to promote unthinking consumption — tapping that app for an impulse buy (which arrives in a veritable nesting doll of cardboard and plastic) or wandering into the store, despite not really needing anything, just because we know we won’t have to wait in line. Buying becomes effortless, a reflexive response rather than a conscious decision.\nThis is not to promote anti-consumerist hand-wringing in the place of working-class politics, but in a moment of ecological crisis and resource overuse, Amazon’s shopping model, whether it’s brick-and-mortar or online, is nudging us in the wrong direction. Well-off consumers should be thinking more about what and how much they consume, not less.\nYet Amazon’s consumption architecture is so seductive that it is sometimes difficult to grasp the trade-offs involved. Counterintuitively, each addition to its sprawling empire creates a more streamlined user experience, reducing the complex social relationships of global capitalism to an intimate exchange between individuals and their smart devices. The relations of power underpinning modern-day capitalism recede ever further into the background — including the relationship between Amazon customers and the company itself.\nThe profitability of the “Everything Store’s” empire rests not just on its ability to squeeze workers and exploit economies of scale, but also on its ability to forge a seamless connection between millions of individuals and Amazon — a connection that is difficult to perceive, and that we are encouraged not to ponder.\nWhen we grab our groceries and “just walk out,” we cement yet another pathway through which Amazon appropriates our personal data and normalizes an always-on digital connection in which our movements and rhythms are tracked twenty-four hours a day. The cashierless grocery is simply the newest addition to an evolving consumer ecosystem that includes its data-sucking smartphone app, its ballooning family of always-listening devices that millions of Americans have installed in their homes, and its monopoly in online shopping.\nAmazon’s cashierless grocery is one component of the company’s broader vision for the future. Behind Amazon’s promise to provide convenient shopping is a drive to control and commodify everyday life. The eagerness with which we are welcoming it should give us pause.", "url": "https://www.jacobinmag.com/2020/03/amazon-go-cashierless-grocery-seattle"}