{"authors": ["Peter Valdes-Dapena", "Cnn Business"], "date_download": "2020-05-04 16:23:45", "date_modify": "2020-05-04 16:23:45", "date_publish": "2020-04-06 17:47:23", "description": "Tesla engineers are working on a ventilator made largely from car parts, according to a YouTube video the automaker posted on Sunday.", "filename": "2020_04_06_business_tesla-ventilators-car-parts_index_1588609425.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406131825-06-tesla-ventilator-prototype-0406---screenshot-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_business_tesla-ventilators-car-parts_index_1588609425.html", "title": "Tesla's working on making ventilators from car parts", "title_page": "Tesla's working on making ventilators from car parts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Tesla engineers are working on a ventilator made largely from car parts, according to a YouTube video the automaker posted on Sunday.\nIn the video, engineers at Tesla Engineering show off prototypes and a schematic laying out the proposed ventilator design as they explain how they are re-purposing various auto parts for the much needed medical devices.\n\"We want to use parts we know really well, we know the reliability of and we can go really fast and they're available in volume,\" Tesla Engineering Director Joseph Mardall said in the four-minute video , which has racked up more than 1.5 million views in less than 24 hours. Mardall stood in front of a diagram that indicated that many of the parts in the ventilator's design are used in Tesla vehicles.\nA Tesla engineer shows off a prototype ventilator that's made with a Tesla Model 3 display screen.\nTesla TSLA A prototype ventilator laid out on a table in the lab included a \"mixing chamber\" that, according to a Tesla engineer, was a part used incars.\nAnother more complete prototype shown later in the video used a touchscreen display from a Model 3, as well as vehicle control machinery from a Model 3, according to other Tesla employees in the video.\nRead More", "url": "https://www.cnn.com/2020/04/06/business/tesla-ventilators-car-parts/index.html"}