{"authors": ["Se Cupp"], "date_download": "2020-05-04 17:00:02", "date_modify": "2020-05-04 17:00:02", "date_publish": "2020-04-10 01:12:30", "description": "There is a man at the center of this story, but it is really about three women, writes SE Cupp. One went on to become a US Senator and run for president, twice, unsuccessfully. Another spent decades trying to hide, heal, reinvent and give back. The third--her name was Linda Tripp--lived in relative obscurity. She died Wednesday.", "filename": "2020_04_09_opinions_linda-tripp-death-cupp_index_1588611602.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/180730104941-01-linda-tripp-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_opinions_linda-tripp-death-cupp_index_1588611602.html", "title": "Linda Tripp, and the trailing damage of the Clinton affair", "title_page": "Linda Tripp, and the trailing damage of the Clinton affair (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "SE Cupp is a CNN political commentator and the host of \"SE Cupp Unfiltered.\" The views expressed in this commentary are solely hers. View more opinion articles on CNN.\n(CNN) There is a man at the center of this story, but it is really about three women. One went on to become a US senator and run for president, twice, unsuccessfully. Another spent decades trying to hide, heal, reinvent and give back.\nS.E. Cupp\nThe third -- her name was Linda Tripp -- lived in relative obscurity. She died Wednesday.\nShe and the other two women, Hillary Clinton and Monica Lewinsky, were central figures in one of the biggest political scandals in modern American history, their lives, each of them, rearranged and upended by events that would define them forever -- notably in ways that the man in this story, former President Bill Clinton, has largely escaped.\nFor Hillary Clinton, her husband's affair with then-White House intern Lewinsky locked her into a steely defensiveness -- and an inconveniently anti-feminist position as she stood by him even as humiliating details emerged -- that she never could shake.\nAt the time, she joined other liberal apologists in defending Bill Clinton ( Gloria Steinem was one defender) and also discrediting and shaming Lewinsky. Hillary Clinton allegedly called Lewinsky a \"narcissistic loony toon,\" according to an entry in the diary of her close friend Diana Blair (it was released after Blair's death; asked to react to the disclosure at the time, Clinton's spokesperson said \"no comment\" ).\nRead More", "url": "https://www.cnn.com/2020/04/09/opinions/linda-tripp-death-cupp/index.html"}