{"authors": [], "date_download": "2020-05-04 20:19:20", "date_modify": "2020-05-04 20:19:20", "date_publish": "2020-04-14 18:32:18", "description": "DES MOINES, Iowa (AP) — A newly-released report by the Iowa State Auditor says a former Buffalo city employee failed to deposit more than $42,000 in collections over a three-year period into the...", "filename": "_74bb45ec75447f7b17fed4d816d5e122_1588623560.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_74bb45ec75447f7b17fed4d816d5e122_1588623560.html", "title": "More than $42K not deposited into Iowa town's account", "title_page": "Audit: More than $42K not deposited into Iowa town's account", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Audit: More than $42K not deposited into Iowa town’s account\nDES MOINES, Iowa (AP) — A newly-released report by the Iowa State Auditor says a former Buffalo city employee failed to deposit more than $42,000 in collections over a three-year period into the city’s bank account.\nThe audit was released Tuesday. State Auditor Rob Sand said the special investigation came on a request from Buffalo city officials, who had concerns about transactions processed by the former Deputy City Clerk Riki Harrington.\nThe audit found $42,390 in undeposited collections from April 2015 through August 2018. That amount included $28,039.42 of checks substituted for cash collections recorded in the city’s accounting system but not deposited, as well as $5,079 in utility customers’ payments and $3,600 in utility security fees not deposited. The amount also included $2,641 of city fees recorded in the accounting system but not deposited.\nIn addition, the report found $774 in improper disbursements and $842 of unsupported disbursements related to city credit cards.\nCopies of the report have been filed with the Scott County Sheriff’s Office, the Iowa Division of Criminal Investigation, the Scott County Attorney’s Office, and the Iowa Attorney General’s Office, Sand said.\nA telephone listing for Harrington was not operable Tuesday.", "url": "https://apnews.com/74bb45ec75447f7b17fed4d816d5e122"}