{"authors": ["Jim Salter"], "date_download": "2020-05-04 20:19:20", "date_modify": "2020-05-04 20:19:20", "date_publish": "2020-04-14 17:06:32", "description": "O'FALLON, Mo. (AP) — The nation's two largest rivers top a new listing of the most endangered waterways, according to a report released Tuesday. The Washington, D.C.-based conservation...", "filename": "_eae68916813e1c07f74f2890ca837833_1588623560.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_eae68916813e1c07f74f2890ca837833_1588623560.html", "title": "2 largest US rivers top new listing of endangered waterways", "title_page": "2 largest US rivers top new listing of endangered waterways", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "O’FALLON, Mo. (AP) — The nation’s two largest rivers top a new listing of the most endangered waterways, according to a report released Tuesday.\nThe Washington, D.C.-based conservation organization American Rivers released its list of the 10 most endangered rivers in the United States. The Upper Mississippi River in Minnesota, Wisconsin, Iowa, Illinois and Missouri was cited as the most endangered, followed by the lower Missouri River in Kansas, Nebraska, Iowa and Missouri.\nAmerican Rivers, in its annual listing, cited increasingly severe flooding driven by climate change on both the Mississippi and Missouri rivers.\n“Mixing poor river management with climate change has created a recipe for disaster,” Bob Irvin, American Rivers’ president and CEO, said in a statement. “Lives, businesses and property are at risk. It’s time for our leaders to prioritize solutions that protect rivers and strengthen communities.”\nThe Mississippi River had major flooding last year and it is flooding again , though damage this spring has been minimal. The river was 2-4 feet (0.7-1.2 meters) above flood stage Tuesday throughout much of Iowa, Illinois and Missouri, and the National Weather Service has warned of a high risk of flooding through May.\nExtreme flooding has become more common along the Mississippi. For example, Hannibal, Missouri, Mark Twain’s hometown, has seen seven of the 10 worst floods on record since 2000.\nMeanwhile, parts of the lower Missouri River saw record and near-record flooding last spring, damaging and destroying levees, shutting down major roadways and displacing hundreds of residents. Water remained so persistently high that the Army Corps of Engineers has been unable to repair several damaged levees.\nAmerican Rivers said communities of color and economically disadvantaged places are most likely to suffer because wealthier towns are able to build higher levees that worsen flooding for those who can’t.\nThe organization urged federal officials and leaders in Upper Mississippi River states to fund a Corps of Engineers plan aimed at better management of the river and floodplains.\nFor the lower Missouri River, American Rivers promoted flood protection plans that “give the river room,” and urged the Corps of Engineers to prioritize flood risk reduction and habitat restoration.\nOther waterways listed as among the 10 most endangered include the Big Sunflower River in Mississippi at No. 3, followed by the Puyallup River in Washington state, the South Fork Salmon River in Idaho, the Menominee River in Michigan and Wisconsin, Rapid Creek in South Dakota, Okefenokee Swamp in Georgia and Florida, the Ocklawaha River in Florida, and the Lower Youghiogheny River in Pennsylvania.", "url": "https://apnews.com/eae68916813e1c07f74f2890ca837833"}