{"authors": ["Susan Montoya Bryan"], "date_download": "2020-05-04 20:05:16", "date_modify": "2020-05-04 20:05:16", "date_publish": "2020-04-08 19:01:49", "description": "ALBUQUERQUE, N.M. (AP) — The killing of four Mexican gray wolves by U.S. wildlife officials has drawn the ire of environmentalists who say management of the species is undercutting efforts to...", "filename": "_666ee332c57c2db2583f141e21a456e2_1588622716.html", "image_url": "https://storage.googleapis.com/afs-prod/media/479a73baca444b1eb58a2f72ccdc3b64/2000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_666ee332c57c2db2583f141e21a456e2_1588622716.html", "title": "Cattle conflicts prompt killing of endangered Mexican wolves", "title_page": "Cattle conflicts prompt killing of endangered Mexican wolves", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This Jan. 30, 2020 image shows members of the Mexican gray wolf recovery team preparing to load a wolf into a helicopter in Reserve, N.M., so it can be released after being processed during an annual survey. The Fish and Wildlife Service on Wednesday, March 18 announced the result of the latest survey, saying there are at least 163 wolves in the wild in New Mexico and Arizona. That marks a nearly 25% jump in the population from the previous year. (AP Photo/Susan Montoya Bryan)\nThis Jan. 30, 2020 image shows members of the Mexican gray wolf recovery team preparing to load a wolf into a helicopter in Reserve, N.M., so it can be released after being processed during an annual survey. The Fish and Wildlife Service on Wednesday, March 18 announced the result of the latest survey, saying there are at least 163 wolves in the wild in New Mexico and Arizona. That marks a nearly 25% jump in the population from the previous year. (AP Photo/Susan Montoya Bryan)\nALBUQUERQUE, N.M. (AP) — The killing of four Mexican gray wolves by U.S. wildlife officials has drawn the ire of environmentalists who say management of the species is undercutting efforts to restore the endangered predators to the American Southwest.\nDocuments made public Tuesday show the U.S. Fish and Wildlife Service took the action in March after hazing, diversionary food caches and other non-lethal means failed to get the predators to stop killing cattle in two rural areas of western New Mexico.\nThe latest deaths highlight a conflict that has persisted since reintroduction began more than 20 years ago. Over the last year, ranchers have seen a record number of cattle kills as the wolf population has increased .\nRegional officials issued the removal order last month as a last resort, agency spokeswoman Aislinn Maestas said.\n“The purpose of a removal is to influence and/or change wolf pack behavior to reduce the potential for recurrent wolf depredations on livestock, while continuing to promote wolf recovery,” she said in an email.\nOne wolf was killed by federal workers on March 23. Three others were taken out a few days later.\nIt’s still too soon for the wolf recovery team to determine the effect on pack dynamics or prey habits.\nMichael Robinson of the Center for Biological Diversity is a long-time critic of how the recovery effort has been managed. He said last month’s actions amounted to the largest lethal removal in the Southwest since 2009, when nine members of an Arizona pack were killed.\n“This killing spree shows us how little has changed in the mindset of wolf managers since the days of federal wolf extermination a century ago,” he said. “The Fish and Wildlife Service would rather shoot wolves than require ranchers to protect their animals on public lands.”\nTwo wolves from the Mangas pack, which roams near Arizona-New Mexico state line, and two members of the Prieto pack further to the southeast were targeted as part of the removal orders. Both packs are in known problem areas where wolf-livestock conflicts have been regularly documented.\nThe Prieto pack began preying on livestock after several members of the pack had been injured by non-government traps, environmentalists said.\nEnvironmental groups contend that ranchers aren’t doing enough to protect their herds. They point to instances in which cow carcasses have been left on the range, drawing wolves in.\nRanchers argue they have tried to haze the wolves or have hired range riders to scare off the animals to no avail. They describe the wolves as brazen and unafraid of people. Some have reported annual losses in the tens of thousands of dollars, saying reimbursement often amounts to just a fraction many months later — if it comes at all.\nFederal officials have acknowledged that coexistence is one of the biggest challenges for the wolf program and that finding ways to solve the conflicts is the top priority for 2020.\nThe rarest subspecies of gray wolf in North America, the Mexican wolf was all but eliminated by the 1970s, prompting the federal government to develop a captive breeding program.\nThere are more Mexican wolves in the wild now than at any time since reintroduction began. The results of the latest survey show there are at least 163 wolves in the wild in New Mexico and Arizona, a nearly 25% jump from the previous year.\nEnvironmentalists say federal employees have shot and killed 20 wolves since 1998 and an additional 22 have died inadvertently as a result of capture operations.", "url": "https://apnews.com/666ee332c57c2db2583f141e21a456e2"}