{"authors": ["Alicia Lee"], "date_download": "2020-05-04 16:12:04", "date_modify": "2020-05-04 16:12:04", "date_publish": "2020-04-03 04:14:48", "description": "Ever since it first emerged in 1958 on a beach in York, Maine, the 50-foot skeleton of a shipwreck has intrigued both locals and experts alike. It reappeared in 1978, 2007, 2013 and 2018 after powerful storms swept away the sand burying it. But then the wreck disappeared again, frustrating those who desired to know more about the ship's history.", "filename": "2020_04_03_us_maine-shipwre_ec256f1b32ea39900cb6afb489cf69ff_index_1588608724.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402134743-01-maine-shipwreck-pre-revolutionary-war-defiance-trnd-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_us_maine-shipwre_ec256f1b32ea39900cb6afb489cf69ff_index_1588608724.html", "title": "Maine shipwreck uncovered by waves every 20 or so years dated to pre-Revolutionary War times", "title_page": "Maine shipwreck uncovered by waves every 20 or so years dated to pre-Revolutionary War times  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Ever since it first emerged in 1958 on a beach in York, Maine, the 50-foot skeleton of a shipwreck has intrigued both locals and experts alike. It reappeared in 1978, 2007, 2013 and 2018 after powerful storms swept away the sand burying it. But then the wreck disappeared again, frustrating those who desired to know more about the ship's history.\nNow, the decades-long mystery has been somewhat solved after marine archaeologist Stefan Claesson discovered evidence that links the shipwreck to a Colonial-era ship called the Defiance that was built in 1754.\nTo identify the origin of the shipwreck, Claesson, who is also the owner of Nearview, an aerial drone and archaeological surveying company, sent pieces of the wreck to the Cornell University Tree-Ring Laboratory.\n\"The sampled timbers matched a New England tree-ring index indicating a felling date of approximately 1753,\" Claesson told CNN.\nA person photographs a shipwreck's remains after the nor'easter that battered the New England coast made it visible Monday, March 5, 2018, on Short Sands Beach in York, Maine.\nHe then looked through nearly 50 years of notary records to discover that a sloop called Defiance had wrecked at the York Beach location in 1769. Research also showed that a sloop of the same name was \"coincidentally built in 1754 in Massachusetts, which fits well with our tree-ring dates of circa 1753,\" Claesson said.\nRead More", "url": "https://www.cnn.com/2020/04/03/us/maine-shipwreck-revolutionary-war-defiance-trnd/index.html"}