{"authors": ["Devan Cole"], "date_download": "2020-05-04 15:59:00", "date_modify": "2020-05-04 15:59:00", "date_publish": "2020-03-31 19:02:22", "description": "Former President Barack Obama issued a rare criticism of the Trump administration Tuesday after it announced it's rolling back his signature fuel standards aimed at combating the climate crisis, saying Americans \"have to demand better\" of their elected leaders.", "filename": "2020_03_31_politics_barack-_90367226906f1e5cb69445e9197a9c8a_index_1588607940.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200126175745-barack-obama-102618-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_politics_barack-_90367226906f1e5cb69445e9197a9c8a_index_1588607940.html", "title": "Obama slams rollback of vehicle emission standards in rare rebuke of Trump", "title_page": "Obama slams rollback of vehicle emission standards in rare rebuke of Trump - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Former President Barack Obama issued a rare criticism of the Trump administration Tuesday after it announced it's rolling back his signature fuel standards aimed at combating the climate crisis, saying Americans \"have to demand better\" of their elected leaders.\n\"We've seen all too terribly the consequences of those who denied warnings of a pandemic. We can't afford any more consequences of climate denial. All of us, especially young people, have to demand better of our government at every level and vote this fall,\" Obama wrote in a tweet.\nThe comment is notable as the former President seldom publicly criticizes his successor, who has focused on undoing his legacy -- particularly his environmental and climate policies. Three years ago, Obama similarly lamented President Donald Trump's decision to pull the US out of the landmark Paris climate agreement , saying the move adds the administration to \"a small handful of nations that reject the future.\"\nEarlier Tuesday, the Trump administration, which has already nixed a number of Obama-era environmental protections, announced it is replacing fuel standards rolled out in 2012 with a plan that calls for substantially lower annual increases.\nThe finalized rule, prepared by the Environmental Protection Agency and the Department of Transportation, calls for fuel economy and emission standards to increase by 1.5% annually, rather than the approximately 5% increases in the 2012 rule. According to the rule, the standards will increase to 40.4 miles per gallon by vehicle model year 2026, about six miles per gallon fewer than the 2012 rule.\nIn introducing the rule, the Trump administration said it was performing what it called \"the largest deregulatory initiative of this administration.\"\nThe change \"reflects the realities of today's markets,\" the administration said, such as more interest in SUVs over smaller cars and automakers' current use of credits to meet their targets.\nAccording to The New York Times, which first reported on the details of the finalized rule, a recent draft plan showed that the rule would allow for nearly a billion more tons of carbon dioxide released, as well as 80 billion more gallons of gasoline consumed.\nThe administration said Tuesday that it believes the rule will cut the average cost of a new car by $1,000, resulting in more Americans replacing their older vehicles with newer ones that have more advanced safety features. That will result in fewer highway fatalities, it said.\nThe former President wasn't alone in his criticism of the change on Tuesday.\nGina McCarthy, his former EPA administrator who now heads the Natural Resources Defense Council, argued that \"gutting the clean car standards makes no sense.\"\n\"It will harm the air we breathe, stall progress in fighting the climate crisis and increase the cost of driving. The only winner from this action is the oil industry, which wants us stuck driving dirty gas guzzlers as long as possible,\" McCarthy said in a statement Tuesday.\nThe rule, expected to be implemented in late spring, is likely to draw legal challenges from several states, according to The New York Times.", "url": "https://www.cnn.com/2020/03/31/politics/barack-obama-fuel-standard-rollback-trump-administration/index.html"}