{"authors": [], "date_download": "2020-05-04 20:06:18", "date_modify": "2020-05-04 20:06:18", "date_publish": "2020-04-09 23:36:46", "description": "FAYETTEVILLE, Ark. (AP) — The Arkansas Court of Appeals upheld a lower court’s decision that dismissed claims brought against officials by reality TV personality Josh Duggar who challenged the...", "filename": "_ecac696d7c0bd03634db94fbb20a9b7a_1588622778.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ecac696d7c0bd03634db94fbb20a9b7a_1588622778.html", "title": "Court spikes TV personality's claims in molestation probe", "title_page": "Court spikes TV personality's claims in molestation probe", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FAYETTEVILLE, Ark. (AP) — The Arkansas Court of Appeals upheld a lower court’s decision that dismissed claims brought against officials by reality TV personality Josh Duggar who challenged the release of investigation records related to the alleged molestation of his sisters when they were juveniles.\nThe appeals court on Wednesday agreed with the dismissal of the lawsuit Duggar filed in 2018, which alleged that Springdale and Washington County officials invaded his privacy by making public investigation records that should’ve remained sealed.\nThe court concluded that a state law Duggar cited didn’t prohibit release of the documents because he wasn’t a juvenile at the time the molestation investigation was done in December 2006, the Northwest Arkansas Democrat-Gazette reported Thursday.\nDuggar wasn’t charged after an anonymous tip spurred an investigation into his alleged fondling of five girls in 2002 and 2003. He acknowledged wrongdoing in a statement after news reports were published in 2015. His parents and two of his sisters later confirmed the actions.\nThe lawsuit was initially filed in Washington County Circuit Court, alleging that making the facts of the molestation investigation publicly available caused Duggar significant emotional distress, mental anguish and substantial loss in income. The lawsuit alleged that publicizing records that should’ve remained sealed made Duggar appear as a sex offender in the eyes of the public.\nCircuit Judge Doug Martin initially dismissed the lawsuit without trial, ruling Duggar failed to state allegations to support his claims.\nThe appeals court’s ruling allows Duggar to refile a civil rights claim, which Martin had initially prohibited.\nThe judges said Duggar’s case failed to show how he suffered damages or why he should expect privacy when he and his family were subjects of a reality television series “from which a certain level of celebrity locally, nationally and internationally was attributable to each and every member of the immediate family.”\nThe siblings were featured on the “19 Kids and Counting” reality show that appeared on the TLC network.", "url": "https://apnews.com/ecac696d7c0bd03634db94fbb20a9b7a"}