{"authors": ["Rebekah Riess", "Christina Maxouris"], "date_download": "2020-05-04 17:02:15", "date_modify": "2020-05-04 17:02:15", "date_publish": "2020-04-10 16:46:55", "description": "A 24-year-old man who was pardoned by former Kentucky Gov. Matt Bevin was arrested this week on a federal child pornography charge, the US Attorney for the Western District of Kentucky said.", "filename": "2020_04_10_us_kentucky-man-pardoned-arrest-child-pornography_index_1588611735.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410002649-dayton-jones-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_kentucky-man-pardoned-arrest-child-pornography_index_1588611735.html", "title": "Man pardoned by Kentucky's former governor after teen sexual assault was arrested on federal child pornography charges", "title_page": "Man pardoned by Kentucky's former governor after teen sexual assault was arrested on federal child pornography charges - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A 24-year-old man who was pardoned by former Kentucky Gov. Matt Bevin was arrested this week on a federal child pornography charge, the US Attorney for the Western District of Kentucky said.\nDayton Jones pleaded guilty and was convicted in 2016 of sexually assaulting a 15-year-old boy. He was one of hundreds who had their sentences commuted in December, during Bevin's last days in office.\nThe new charges against Jones stem from an October 2014 video he allegedly created and shared through Snapchat which depicts child pornography, the US Attorney's office said.\n\"This prosecution is about one thing and one thing only, Mr. Jones' conduct in harming someone's child in the Western District of Kentucky in violation of federal law,\" US Attorney Russell Coleman said in a statement. \"It serves as a reminder that despite these uncertain times, Kentucky families are well-served by some inspiring federal, state and local law enforcement professionals that put themselves at risk to protect our kids.\"\nAn attorney for Jones, when reached by CNN, didn't comment on his client's arrest and charge.\nRead More", "url": "https://www.cnn.com/2020/04/10/us/kentucky-man-pardoned-arrest-child-pornography/index.html"}