{"authors": ["Jeff Baenen"], "date_download": "2020-05-04 21:06:05", "date_modify": "2020-05-04 21:06:05", "date_publish": "2020-04-20 19:43:50", "description": "PLYMOUTH, Minn. (AP) — A western Minnesota man has admitted that he killed a 19-year-old woman, dismembered her in his garage and disposed of the body parts in dumpsters outside his apartment,...", "filename": "_c05232d8a533f61c2d9a91bb0c18d7e5_1588626365.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b35fa7f28fa64ca884aac59b976b6619/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c05232d8a533f61c2d9a91bb0c18d7e5_1588626365.html", "title": "Minnesota man accused of dismembering woman, dumping remains", "title_page": "Minnesota man accused of dismembering woman, dumping remains", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This April 17, 2020 photo provided by Clay County (Minn.) Jail, shows Ethan Broad. Broad, a western Minnesota man, killed a missing 19-year-old woman, dismembered her in his garage and disposed of the body parts in dumpsters outside his apartment, prosecutors alleged Monday April 20, 2020. (Clay County Jail via AP)\nThis April 17, 2020 photo provided by Clay County (Minn.) Jail, shows Ethan Broad. Broad, a western Minnesota man, killed a missing 19-year-old woman, dismembered her in his garage and disposed of the body parts in dumpsters outside his apartment, prosecutors alleged Monday April 20, 2020. (Clay County Jail via AP)\nPLYMOUTH, Minn. (AP) — A western Minnesota man has admitted that he killed a 19-year-old woman, dismembered her in his garage and disposed of the body parts in dumpsters outside his apartment, prosecutors said Monday.\nEthan Broad, 27, was charged Monday in Clay County court with second-degree murder without intent while committing a felony. Bail was set at $1 million, without conditions, and Broad remained in jail Monday.\nAccording to the complaint, Broad killed Dystynee Avery, cut up her body with a saw, put the remains into garbage bags and dumped them near his apartment in south Moorhead, on the border with North Dakota.\nBroad initially told investigators that someone else had hit Avery over the head with a lead pipe and cut her throat, but later admitted that he killed and dismembered the young woman. He called it an act of self-defense.\nThe complaint does not say when the killing took place. Avery was last seen in Moorhead on April 3 and friends reported her missing April 5. Avery’s worried mother reached out to police April 9 to say she hadn’t heard from her daughter.\nBroad was arrested on Friday.\nThe complaint does not explain the relationship between the two. Broad told police that Avery had lived with him for a short time but that she had recently removed her belongings from his home.\nAccording to the complaint, police found a bloodied saw with what appeared to be human tissue inside Broad’s garage. A blue bin in the garage had “a large amount of blood inside,” according to the complaint, and surveillance video showed Broad dragging a blue tote from the apartment building to the garage area, police said.\nSeveral spots in Broad’s apartment appeared to be cleaned-up blood, the complaint said. Broad said he cleaned the apartment with bleach but that several bloodstains turned pink on the carpet.\nRex Tucker, chief public defender for the district, told The Associated Press on Monday that Broad will be represented by a public defender. Tucker had no comment on the case.\nBroad is due back in court May 14. A conviction would carry a sentence of up to 40 years in prison.", "url": "https://apnews.com/c05232d8a533f61c2d9a91bb0c18d7e5"}