{"authors": [], "date_download": "2020-05-04 20:05:58", "date_modify": "2020-05-04 20:05:58", "date_publish": "2020-04-09 00:28:38", "description": "DENVER (AP) — The Natural Resources Conservation Service found the statewide level of Colorado snowpack is higher than normal for this time of year. The service’s data indicate the statewide...", "filename": "_c0adf7f3557733bfa0aa5ad361823b5a_1588622758.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c0adf7f3557733bfa0aa5ad361823b5a_1588622758.html", "title": "Colorado snowpack level reported to be higher than normal", "title_page": "Colorado snowpack level reported to be higher than normal", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Colorado snowpack level reported to be higher than normal\nDENVER (AP) — The Natural Resources Conservation Service found the statewide level of Colorado snowpack is higher than normal for this time of year.\nThe service’s data indicate the statewide snowpack is 102% of normal, Colorado Public Radio reports .\nThe state’s snowpack is “in a good spot right now,” Colorado Snow Survey Supervisor Brian Domonkos said.\nThe majority of the water used by Colorado residents comes from melting snowpack.\nThis is the time of year when snowpack peaks in the southern mountains, where the level is currently about 93% of the season-to-date average, Domonkos said.\nThe northern mountains are at 109% of normal and snowpack can continue to accumulate for at least a few more weeks as winter conditions continue.\nThe Front Range’s South Platte River basin is at 112% of normal, the highest of the state’s eight basins.\nThe statewide precipitation is at 91% of the norm, Domonkos said.\n“We had a particularly dry fall through a few of the months in different locations,” Domonkos said. “That will likely decrease the effects of the normal to above-normal snowpack and the runoff numbers we’ll see this spring.”", "url": "https://apnews.com/c0adf7f3557733bfa0aa5ad361823b5a"}