{"authors": ["Steve Reed"], "date_download": "2020-05-04 21:07:12", "date_modify": "2020-05-04 21:07:12", "date_publish": "2020-04-16 16:21:08", "description": "CHARLOTTE, N.C. (AP) — Look for the Panthers to get defensive in the upcoming NFL draft. Carolina lost nine defensive starters from last year’s team, including five-time All-Pro linebacker...", "filename": "_06fc77e526d8b86354f240a3f8f3d7dc_1588626432.html", "image_url": "https://storage.googleapis.com/afs-prod/media/24c55caffc324995a4ab32b607f4f8ec/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_06fc77e526d8b86354f240a3f8f3d7dc_1588626432.html", "title": "Panthers expected to turn attention to defense in NFL draft", "title_page": "Panthers expected to turn attention to defense in NFL draft", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Dec. 22, 2019, file photo, Carolina Panthers' Luke Kuechly (59) charges Indianapolis Colts running back Marlon Mack (25) during the first half of an NFL football game in Indianapolis. The Panthers will look to upgrade their defense in the NFL draft after losing nine starters from last year’s unit, including five-time All-Pro linebacker Kuechly. (AP Photo/Michael Conroy, File)\nFILE - In this Dec. 22, 2019, file photo, Carolina Panthers' Luke Kuechly (59) charges Indianapolis Colts running back Marlon Mack (25) during the first half of an NFL football game in Indianapolis. The Panthers will look to upgrade their defense in the NFL draft after losing nine starters from last year’s unit, including five-time All-Pro linebacker Kuechly. (AP Photo/Michael Conroy, File)\nCHARLOTTE, N.C. (AP) — Look for the Panthers to get defensive in the upcoming NFL draft.\nCarolina lost nine defensive starters from last year’s team, including five-time All-Pro linebacker Luke Kuechly, who abruptly retired at age 28 following three concussions during his eight-year NFL career.\nEdge rusher Mario Addison, who had 39 sacks in the past four seasons, and top cover cornerback James Bradberry left via free agency, while veteran safety Eric Reid was released.\nThe only returning defensive tackle is two-time Pro Bowler Kawann Short — and he didn’t even play in 2019 because of a shoulder injury.\nEven Panthers general manager Marty Hurney, who is normally not forthcoming on the team’s draft plans, admits the team’s focus in the draft will be on defense.\n“When you look at the defensive side that is where we probably haven’t added as much (in free agency or trades) as we have on offense,” Hurney said on a conference call. “If you were to say what area you look at the most you could say it would be defense rather than offense.”\nNew coach Matt Rhule agreed, saying that adding depth on defense is the team’s top priority.\nThe Panthers have added a few pieces on defense in free agency — most notably Vikings defensive end Stephen Weatherly, Raiders linebacker Tahir Whitehead and Browns defensive back Juston Burris. But the departures still far outweigh the additions.\nThe defensive line, for instance, will look entirely different than last season after Gerald McCoy, Dontari Poe and Vernon Butler followed Addison in signing with other teams. With the team expected to shift from a 3-4 base defense last year to a 4-3 scheme this year, they’ll need to add a few more linemen to the mix.\nThat has made Auburn defensive tackle Derrick Brown a popular pick for the Panthers in a lot of mock drafts. But Clemson linebacker Isaiah Simmons and Ohio State cornerback Jeff Okudah could be in play in either were to unexpectedly fall to No. 7.\nHere are some things to know about the Panthers entering the NFL draft:\nALL OPTIONS OPEN\nHurney made it clear he’s open for business when it comes to potential draft day trades.\nHowever, unless presumptive No. 1 overall pick Joe Burrow — who worked under new Panthers offensive coordinator Joe Brady last season at LSU — or perhaps Simmons unexpectedly becomes available it’s hard to imagine a scenario where the Panthers might trade up in the first round.\nWith the team in rebuilding mode, trading down and acquiring more draft picks seems more likely.\n“We’re going to explore all options either way, whether it’s trading up, sticking or trading back – we will have all kinds of different scenarios,” Hurney said. “Not only for that pick, but for every round.”\nBAYLOR HIGHWAY?\nIt wouldn’t be a shock if the Panthers draft a player from Baylor, where Rhule coached last season. Carolina has already signed a number of Rhule’s former players from Temple, where he previously coached, including wide receiver Robby Anderson, linebacker Tahir Whitehead and quarterback P.J. Walker.\n“It’s probably very similar to seeing some of the guys who were here (in Carolina) end up at some of the other places where coaches knew them,” Rhule said.\nPOSITIONLESS PLAYERS\nRhule has emphasized a desire for “positionless players,” which essentially means players who have the versatility to play multiple positions. That’s why Carolina signed Burris, who can play cornerback, nickel and safety.\nSimmons would be another player who fits that mold.\n“I think when you start saying, ‘Oh, this guy’s got to play this,’ then you’re never playing guys that are the next best player,” Rhule said. “I think we just felt like, hey, let’s get the best couple of players.”\nMcCAFFREY A CENTERPIECE\nThere was some question over whether the Panthers might attempt to move All-Pro Christian McCaffrey before the NFL draft given the team is in the midst of a rebuild. But Carolina silenced those rumors by making McCaffrey the highest-paid running back in the league with a contract extension worth $16 million per year.\n“I think Christian McCaffrey is a centerpiece player that you can build around,” Rhule said. “And I think he really builds to the culture that you want to have within the building.”\nEIGHT PICKS\nThe Panthers have eight picks in all, including two in the fifth round.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/06fc77e526d8b86354f240a3f8f3d7dc"}