{"authors": [], "date_download": "2020-05-04 20:10:53", "date_modify": "2020-05-04 20:10:53", "date_publish": "2020-04-09 16:56:19", "description": "SEATTLE (AP) — U.S. Rep. Denny Heck said Thursday he is running for Washington lieutenant governor following last month’s surprise announcement by incumbent Cyrus Habib that he would not seek...", "filename": "_d99d5300c3e840fe5d10483e020ab48f_1588623053.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d99d5300c3e840fe5d10483e020ab48f_1588623053.html", "title": "Heck joins crowded field WA for lieutenant governor", "title_page": "Heck joins crowded field WA for lieutenant governor", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SEATTLE (AP) — U.S. Rep. Denny Heck said Thursday he is running for Washington lieutenant governor following last month’s surprise announcement by incumbent Cyrus Habib that he would not seek re-election.\nHabib plans to join the Jesuit religious order.\nThe lieutenant governor is officially responsible for presiding over the Senate while the Legislature is in session and filling in when the governor travels out of state. But occupants of the office have sought to broaden their scope of influence by going on trade missions and supporting other favored causes.\nHeck was elected to the newly formed 10th Congressional District, which included Olympia, in 2012.\nDemocratic state Sens. Marko Liias, D-Lynnwood, and Steve Hobbs, D-Lake Stevens, are already running for lieutenant governor, with Liias this week receiving an endorsement from Habib.\nOn the Republican side, candidates include Ann Sattler, an attorney who ran unsuccessfully for Seattle City Council last year; and Joseph Brumbles, who ran unsuccessfully against Heck in the 10th Congressional District in 2018.\nHeck, a Democrat, was endorsed by former Gov. Christine Gregoire, who said Heck will bring a steady hand to the office and use it to promote the state’s economy.\nThe Seattle Times reports there has been speculation that the position could be an easy steppingstone to the governor’s office if Gov. Jay Inslee wins a third term this fall but later accepts a job in a Democratic presidential administration. But Heck said while he’d be ready to assume the duties of governor temporarily in such a scenario, he would not become a candidate for the office in any subsequent election.\n“I will not stand for election, period,” he said.", "url": "https://apnews.com/d99d5300c3e840fe5d10483e020ab48f"}