{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:21:40", "date_modify": "2020-05-04 20:21:40", "date_publish": "2020-04-29 18:55:17", "description": "\"Everybody kind of gave me credit, and I was just like, ‘no,'\" the comedian joked on \"The Howard Stern Show.\"", "filename": "entry_amy-schumer-son-name-genital-joke_n_5ea99b6fc5b6106b8ed0c16f_1588623700.html", "image_url": "https://img.huffingtonpost.com/asset/5e960a2c250000641a6b7c23.png?cache=ho4olcqhdj&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_amy-schumer-son-name-genital-joke_n_5ea99b6fc5b6106b8ed0c16f_1588623700.html", "title": "Amy Schumer Says Son's 'Genital' Name Wasn't A Joke: 'Just A Huge F**k Up'", "title_page": "Amy Schumer Says Son's 'Genital' Name Wasn't A Joke: 'Just A Huge F**k Up' | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "New parents Amy Schumer and her husband, Chris Fischer, aren’t quite ready to tell their son why they had to change his name.\nSchumer was on Howard Stern’s SiriusXM show Tuesday, and her almost-1-year-old boy joined for part of the call, before she talked about originally naming him Gene Attell Fischer (which sounds like “genital fissure”).\n“Oh my god, don’t tell him ― we’re not telling him,” Schumer joked when Stern brought it up, as she quickly covered Gene’s ears with her hands. The “I Feel Pretty” actor said that she and Fischer realized their naming mistake about a month in.\nSiriusXM/The Howard Stern Show\n“You’re like the new parents, just kind of tired and in ecstasy. And then ― I don’t know if some troll on the internet or somebody ― and I read it, and I was like, ‘Oh my god,’” after she realized what her son’s name sounded like, she said.\n“Because, you know, you’re going ‘Gene Attell.’ Me ― who’s like, a filthy person ― it never dawned on me,” she continued. “All the blood rushed to my head and I was like ‘Chris!’”\nSchumer said that people told her the naming mishap wasn’t a big deal, but she wasn’t having it.\n“I’m like, ‘What are you talking [about]? I “Boy Named Sue,” sue-d my son,’” she joked, referencing the famous Johnny Cash song. “All you want to do is protect your baby and I right out the gate [did this] ... the first of many failures.”\nStern said that at first, he thought Schumer gave Gene the funny name on purpose. Some media outlets also thought the baby’s name was a prank when Schumer announced it back in May 2019.\n“Everybody kind of gave me credit, and I was just like, ‘No. That is just a huge fuck up,’” she said.\nSchumer opened up about the moniker mistake on her podcast, “3 Girls, 1 Keith,” two weeks ago.\nShe revealed that she and Fischer had finally changed their son’s name, from Gene Attell Fischer to Gene David Fischer. The baby is named after her close friend and fellow comedian Dave Attell. David is also Schumer’s father’s middle name.", "url": "https://www.huffpost.com/entry/amy-schumer-son-name-genital-joke_n_5ea99b6fc5b6106b8ed0c16f"}