{"authors": [], "date_download": "2020-05-04 20:05:16", "date_modify": "2020-05-04 20:05:16", "date_publish": "2020-04-08 21:14:06", "description": "TUCSON, Ariz. (AP) — The U.S. Air Force plans to retire 42 A-10 aircraft at Davis-Monthan Air Force Base next year, a move that would cut the base’s fleet of “Warthogs” in half, a member of...", "filename": "_79aa620a418aff333451a8c6443a29b7_1588622716.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_79aa620a418aff333451a8c6443a29b7_1588622716.html", "title": "Air Force to retire A-10 aircraft at Arizona base next year", "title_page": "Air Force to retire A-10 aircraft at Arizona base next year", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "TUCSON, Ariz. (AP) — The U.S. Air Force plans to retire 42 A-10 aircraft at Davis-Monthan Air Force Base next year, a move that would cut the base’s fleet of “Warthogs” in half, a member of Arizona’s congressional delegation said.\nDemocratic U.S. Rep. Ann Kirkpatrick identified the proposed cuts in letters to the Air Force and to U.S. House committees, The Arizona Daily Star reports .\nThe move will “bring serious harm to the economy in the community I represent,” Kirkpatrick said. She said she was not briefed on the plan and called the move “inexcusable” in a statement Monday.\n“The A-10 Warthog has a mission to protect our men and women in battle and I am committed to fighting in Congress to protect its mission,” Kirkpatrick’s statement said.\nThe Air Force unveiled plans to reduce the A-10 fleet in the fiscal 2021 budget proposal released in February but did not identify specific sites.\nThe proposal called for retiring 44 of the “oldest and least ready” A-10s as the Air Force shifts to newer aircraft.\nThe Air Force did not comment directly on Kirkpatrick’s statement Monday, but said the service was committed to a $161 million upgrade of remaining A-10s.\nA-10 pilots are trained and deployed at Davis-Monthan. The base nine miles (14 kilometers) east of Tucson had 83 Warthogs in its fleet as of Tuesday.\nDavis-Monthan spokesman Capt. Elias J. Small said it would be inappropriate for him to comment on “possible programming plans” because those decisions occur at levels above the air base.", "url": "https://apnews.com/79aa620a418aff333451a8c6443a29b7"}