{"authors": ["Reporter"], "date_download": "2020-05-04 21:06:15", "date_modify": "2020-05-04 21:06:15", "date_publish": "2020-04-30 18:39:42", "description": "Joey, a cat in Canada, woke up his owners Sunday morning after the slow cooker caught on fire.", "filename": "entry_joey-hero-cat-burning-crock-po_n_5eab0b43c5b61ed1311df519_1588626375.html", "image_url": "https://img.huffingtonpost.com/asset/5eab0d4424000010028ea099.png?cache=rllx6gx2s7&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_joey-hero-cat-burning-crock-po_n_5eab0b43c5b61ed1311df519_1588626375.html", "title": "Hero Cat Alerts Sleeping Family To Burning Slow Cooker", "title_page": "Hero Cat Alerts Sleeping Family To Burning Slow Cooker | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Courtesy of Scott White A cat in Newfoundland saved his owner's house by waking him when the crock pot was on fire.\nThink cats are just selfish creatures who only want to eat, sleep and clean themselves?\nWell, that’s a crock, according to a Canadian man who says his cat woke him up to let him know a slow cooker was on fire.\nScott White of Portugal Cove-St. Philip’s in the province of Newfoundland and Labrador, said he went to sleep Sunday morning around midnight after setting some onions in the slow cooker to make jam.\nA few hours later, around 4:30 a.m., White said his cat, Joey, did something strange. “Usually, Joey doesn’t bother us when we sleep, but I could sense him pacing around the bed and I woke up with a paw on my face,” White told HuffPost.\nSensing something was wrong, White got up and saw the kitchen filling up with smoke from the slow cooker. “There was a lot of haze in the kitchen, but not enough to alert the fire alarm about 20 feet away,” White said.\nIn the aftermath of Joey’s alertness, White and his fiancee have been giving Joey extra attention and treats from a “hero basket” donated to them as word about the cat spread around town.\nBut Joey’s heroism may have left White’s other pet, a 10-month-old puppy, in the metaphorical doghouse. “The dog was always in the window growling at people, so we thought he’d be a good watchdog,” White said.\nInstead, the pooch slept through the entire incident.\n“I guess we found out the real hero is the cat,” White told the CBC.", "url": "https://www.huffpost.com/entry/joey-hero-cat-burning-crock-po_n_5eab0b43c5b61ed1311df519"}