{"authors": [], "date_download": "2020-05-04 20:27:37", "date_modify": "2020-05-04 20:27:37", "date_publish": "2020-04-17 15:49:58", "description": "LINCOLN, Neb. (AP) — The Nebraska Supreme Court on Friday upheld the murder conviction and death penalty sentence of a state prisoner who admitted killing his cellmate in 2017 for being too...", "filename": "_415a92c5f51397ee1f8e407335b62966_1588624057.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_415a92c5f51397ee1f8e407335b62966_1588624057.html", "title": "Nebraska Supreme Court upholds death sentence for inmate", "title_page": "Nebraska Supreme Court upholds death sentence for inmate", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LINCOLN, Neb. (AP) — The Nebraska Supreme Court on Friday upheld the murder conviction and death penalty sentence of a state prisoner who admitted killing his cellmate in 2017 for being too talkative.\nPatrick Schroeder, 42, was sentenced to death by a panel of three judges in 2018 for strangling 22-year-old Terry Berry in April 2017 at the Tecumseh State Prison in southeast Nebraska. At the time, the two were sharing a 10-by-12 cell meant for solitary confinement. Schroeder told investigators that he killed Berry for being too talkative and said he had warned Berry several times that he needed to “shut up.” Schroeder said he attacked Berry because Berry kept talking during a televised mixed martial arts match.\nSchroeder — who was already serving a life sentence for the 2006 killing of 75-year-old Pawnee City farmer — pleaded guilty to first-degree murder for killing Berry. He also served as his own attorney and did not contest prosecutors’ death penalty case, saying he wanted to be put to death for his crimes.\nFriday’s ruling by the state’s high court came on a direct appeal of his conviction and sentence filed by lawyers on Schroeder’s behalf. Nebraska law requires a mandatory appeal of all death penalty convictions.", "url": "https://apnews.com/415a92c5f51397ee1f8e407335b62966"}