{"authors": ["Shannon Liao", "Cnn Business"], "date_download": "2020-05-04 16:16:19", "date_modify": "2020-05-04 16:16:19", "date_publish": "2020-04-03 17:54:46", "description": "Esports are already online (obviously), but the pandemic is still creating huge challenges", "filename": "2020_04_03_tech_esports-sports-canceled-coronavirus_index_1588608979.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402125730-online-game-playing-home-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_tech_esports-sports-canceled-coronavirus_index_1588608979.html", "title": "Sports are canceled. Esports are still around", "title_page": "Sports are canceled. Esports are still around - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Golf, basketball, hockey and other sports have all suspended their seasons. Major league baseball says it may start up in late spring. But competitive video gaming is going strong as esports tournaments move their operations completely online.\nActivision Blizzard ATVI Some companies, including the Electronic Sports League, Riot Games and, resumed their competitions online after pulling events in the US, Europe and Asia with a brief hiatus or no delay.\n\"It's pretty incredible that both Overwatch League and Call of Duty League will be the only city-based leagues still fortunate enough to operate in this current environment,\" Pete Vlastelica, president and CEO of Activision Blizzard Esports, said in a statement to CNN Business.\n\"I miss traditional sports, like we all do. At the same time I'm proud our leagues can compete online,\" he said, noting that Call of Duty League is still delayed but will be back online \"soon.\" Activision did not comment on the delay.\nEsports experienced a 37% increase in the average number of viewers per tournament last quarter, compared to the same period last year, according to Stream Hatchet, a video game analytics company.\nRead More", "url": "https://www.cnn.com/2020/04/03/tech/esports-sports-canceled-coronavirus/index.html"}