{"authors": [], "date_download": "2020-05-04 16:59:02", "date_modify": "2020-05-04 16:59:02", "date_publish": "2020-04-09 19:07:04", "description": "Puma is bringing people together at its Friends and Family Sale, where your entire purchase is 40% off when you use promo code PUMAFAM at checkout.", "filename": "2020_04_09_cnn-underscored_puma-sale-sitewide_index_1588611542.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409143751-puma-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_cnn-underscored_puma-sale-sitewide_index_1588611542.html", "title": "Take 40% off your entire Puma purchase", "title_page": "Puma sale: Take 40% off your purchase at the Friends and Family Sale - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Whether you're working hard to stay active, or just working from home in outfits consisting completely of activewear, you could use something new from this Puma sale. The brand is bringing people together at its Friends and Family Sale, where your entire purchase is 40% off when you use promo code PUMAFAM at checkout.\nWhile some exclusions do apply, this sale applies to the entire Puma site, including the clearance section. So it's the perfect time to snag some new sweats, tees, sneakers and whatever else you need to be comfortable and look cool during quarantine.\nTake note: This sale seems to appear on site as a 30%-off deal, but if you use the above promo code, you should still see the 40% discount in your cart. Browse through Puma's hundreds of apparel, shoe and accessory offerings, or just check out a few of our top picks from the sale below. Just don't wait too long to shop; this discount will disappear after April 14.\nWomen's styles\nTailored for Sport Women's Hoodie ($39, originally $65; puma.com)\nPuma Tailored for Sport Women's Hoodie\nThis isn't your average, slubby hoodie. A retro-inspired style, the sweatshirt style features distinctive cutlines and a performance fit, which majorly up the cool factor.\n___________________________________________________________________________________________\nClassics T7 Women's Hooded Dress ($36, originally $60; puma.com)\nPuma Classics T7 Women's Hooded Dress\nPerhaps the comfiest outfit of all time, this dress also happens to be a hoodie. It's available in either black or mist green, and it's all you need for a laid-back vibe — no pants necessary.\n___________________________________________________________________________________________\nLogo Elastic Women's 7/8 Leggings ($17.99, originally $45; puma.com)\nPuma Logo Elastic Women's 7/8 Leggings\nThese boldly branded, cropped leggings are made with dryCELL fabric to wick away moisture during your workouts, but they're comfortable for just hanging around, too.\n___________________________________________________________________________________________\nClassics T7 Women's Shorts ($18, originally $30; puma.com)\nPuma Classics T7 Women's Shorts\nSpring has arrived, and temperatures are steadily climbing. Free your legs from the confines of pants with this pair of classic drawstring shorts, a comfortable, breezy choice whether you're outdoors or inside.\n___________________________________________________________________________________________\nRS-X³ Puzzle Women's Sneakers ($66, originally $110; puma.com)\nPuma RS-X³ Puzzle Women's Sneakers\nNothing brightens up your look — and your day — like a bold, colorful pair of sneakers. And it doesn't get bolder than this pair of neon RS-X³ Puzzle kicks, now just $66.\nMen's styles\nClassics Men's Cuffed Sweatpants ($20.99, originally $50; puma.com)\nPuma Classics Men's Cuffed Sweatpants\nAdd to your sweatpants collection with this flattering pair. With their slim fit and tapered leg, you'll look great and feel as comfortable as ever.\n___________________________________________________________________________________________\nReactive Men's 3/4 Knitted Pants ($30, originally $50; puma.com)\nPuma Reactive Men's 3/4 Knitted Pants\nOr if you're looking to show some leg as the weather warms up, consider these ultra moisture-wicking dryCELL knitted pants, featuring extra pockets and ergonomic cutlines for freedom of movement.\n___________________________________________________________________________________________\nIconic MCS Summer Men's Track Jacket ($42, originally $70; puma.com)\nPuma Iconic MCS Summer Men's Track Jacket\nA colorblocked track jacket is a modern throwback to the '80s. In addition to its iconic silhouette, it feels especially lightweight, and the burnt olive hue goes with just about anything.\n___________________________________________________________________________________________\nClassics Men's Logo Tee ($16.80, originally $28; puma.com)\nPuma Classics Men's Logo Tee\nYou can never have too many tees. This logo shirt comes in 19 colorways, so choose the one (or ones!) that suits your personal style best.\n___________________________________________________________________________________________\nCarson 2 Knit Men's Training Shoes ($29.99, originally $60; puma.com)\nPuma Carson 2 Knit Men's Training Shoes\nKeep up with your workouts at home with this pair of knit trainers. The Softfoam footbed makes for a plush feel underfoot, and the EVA outsole is grippy enough for any activity you opt to take on.\nFor more great Puma deals, check out CNN Coupons.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/09/cnn-underscored/puma-sale-sitewide/index.html"}