{"authors": ["Kathy Mccormack"], "date_download": "2020-05-04 20:13:41", "date_modify": "2020-05-04 20:13:41", "date_publish": "2020-04-09 19:16:08", "description": "CONCORD, N.H. (AP) — A judge struck down a New Hampshire law that added more steps to the voter registration process as unconstitutional “for unreasonably burdening the right to vote.\" The...", "filename": "_d4092e61f753a888cd433e51e41eec68_1588623221.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d4092e61f753a888cd433e51e41eec68_1588623221.html", "title": "Judge: New Hampshire voter registration law unconstitutional", "title_page": "Judge: New Hampshire voter registration law unconstitutional", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CONCORD, N.H. (AP) — A judge struck down a New Hampshire law that added more steps to the voter registration process as unconstitutional “for unreasonably burdening the right to vote.”\nThe New Hampshire Democratic Party and the League of Women Voters sued Secretary of State William Gardner over the 2017 law, saying it was confusing and created a two-tier system with added paperwork for those who register within 30 days of an election. The groups also were concerned the requirements would create long lines at the polls.\nSupporters said the law ensured that people are registered in the correct city, town or ward, and that no one was prevented from voting.\nThe law was passed by a then- Republican-majority Legislature after President Donald Trump alleged widespread voter fraud in New Hampshire, claiming it led to his loss to Hillary Clinton in the state in 2016. But there has been no evidence to support that, and both sides agreed in court that voter fraud cases are rare in the state.\nMonths before the trial, a judge allowed the law to take effect, but blocked penalties of a $5,000 fine and a year in jail for fraud.\nThe state Democratic Party issued a statement that it was pleased with the ruling and that New Hampshire citizens “will not be burdened with a long and confusing voter registration form in the elections this fall.”\nDaniel Will, New Hampshire Solicitor General, said after an initial review of the ruling, “we expect to appeal the decision to the New Hampshire Supreme Court.”\nState Sen. Regina Birdsell, a Republican from Hampstead who sponsored the bill, said it’s disappointing the judge ruled against legislation “intended to bring transparency and accountability to our elections, without infringing on Granite Staters’ right to vote. “\nJudge David Anderson, who presided over a bench trial in Manchester last year agreed Wednesday with the state that the burdens imposed by the law are not severe in that they didn’t outright exclude voters from the process. But he said the burdens themselves are “neither reasonable nor nondiscriminatory.”\nAnderson described the language on the forms as “confusing or outright misleading in several respects” and noted that two witnesses for the state gave competing testimony on the matter. He also noted that some voters were turned away to get the right documents, and it wasn’t known if they ever came back to vote.\nAnderson wrote that towns displayed inconsistent information about the law on their websites. Election workers testified they weren’t sure what the wording on some of the forms meant and felt they couldn’t explain it to voters.\nAnderson also wrote that voters also would be discouraged by the high penalties and possible post-election investigations. He agreed with a witness for the plaintiffs that those who use same-day registration more frequently — young, mobile, low-income, and homeless voters — would be exposed to its penalties at a higher rate.\nUnder the law, if someone registered within 30 days before an election and on an election day and didn’t have documents, they might submit a sworn statement affirming they will send the missing documents within a certain amount of time.\nThe documents could be mailed or hand-delivered to the town clerk, along with a form. If the documents weren’t submitted, a voter’s name would have been subject to removal from the voter checklist. Supervisors could try to verify the person’s address by looking at public records, have municipal officers visit the address or refer the information to the secretary of state’s office.", "url": "https://apnews.com/d4092e61f753a888cd433e51e41eec68"}