{"authors": ["Lisa Respers France"], "date_download": "2020-05-04 16:00:28", "date_modify": "2020-05-04 16:00:28", "date_publish": "2020-04-01 13:20:24", "description": "Colton Underwood talks about his questioning his sexuality in his new book, \"The First Time: Finding Myself and Looking for Love on Reality TV,\" and now he says he knows he's straight.", "filename": "2020_04_01_entertainment_colton-underwood-sexuality-book_index_1588608028.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200320144651-colton-underwood-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_entertainment_colton-underwood-sexuality-book_index_1588608028.html", "title": "Colton Underwood: 'The Bachelor' helped him figure out his sexuality", "title_page": "Colton Underwood: 'The Bachelor' helped him figure out his sexuality - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Colton Underwood talks about his questioning his sexuality in his new book, \"The First Time: Finding Myself and Looking for Love on Reality TV,\" and now he says he knows he's straight.\nAnd he can thank his appearance on \"The Bachelor\" where he fell in love with Cassie Randolph for that, he said.\n\"[The show taught me] that I'm straight and I'm very, very attracted to Cassie [Randolph] and women -- but it would have been OK if it would have been the other way too,\" Underwood told \"Entertainment Tonight.\" \"I think that's the biggest message I have for people.\"\nJon Kopaloff/Getty Images\nUnderwood, 28, was the show's first virgin \"Bachelor,\" having initially shared that he was a Christian and waiting when he competed for Becca Kufrin's heart during the 2018 season of \"The Bachelorette.\"\nThe former football player said revealing his virginity on \"The Bachelorette\" kicked off speculation about his sexuality.\nRead More", "url": "https://www.cnn.com/2020/04/01/entertainment/colton-underwood-sexuality-book/index.html"}