{"authors": [], "date_download": "2020-05-04 16:10:06", "date_modify": "2020-05-04 16:10:06", "date_publish": "2020-04-02 22:00:05", "description": "Apple has a Magic Keyboard dropping in May for the iPad Pro. But you don't have to wait that long: Any iPad that's running iPadOS 13.4 can already support a trackpad or a mouse, and it's a really impressive user experience.", "filename": "2020_04_02_cnn-underscored_ipad-trackpad-setup_index_1588608606.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200323212022-16-underscored-apple-ipad-pro-2020-review-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_cnn-underscored_ipad-trackpad-setup_index_1588608606.html", "title": "Here's how to set up a trackpad with your iPad", "title_page": "Here's how to set up a trackpad with your iPad - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Apple has a Magic Keyboard dropping in May for the iPad Pro. But you don't have to wait that long: Any iPad that's running iPadOS 13.4 can already support a trackpad or a mouse, and it's a really impressive user experience.\nIt doesn't replace finger gestures; iPadOS still stands strong as a touch-first experience. You'll still tap to open apps, swipe with a finger to scroll and even use gestures. But in the same vein as an Apple Pencil or a Smart Keyboard, there are better ways to control some experiences.\nIn our testing with the most recent iPad Pro, we found the trackpad to be an ideal pairing with the keyboard for writing tasks, working in spreadsheets and even web browsing. Having a cursor and the level of control that comes with a trackpad makes it easier to select more minute user interface components, like a cell in a large spreadsheet, or even when browsing an online store with hundreds of options.\nBetter yet, it won't cost you an arm and a leg to get this experience. Trackpad support is built into iPadOS, and it works with a Bluetooth mouse or trackpad. Or, if you have a wired USB Type-A mouse with the right adapter, you can plug it into your iPad. Pretty neat, right? And across the board, you'll get that shape-shifting cursor that transforms, based on what it's touching and the specific use case.\nTo get this going, here's everything you need to know about setting up a trackpad or mouse with your iPad.\nThe basics of setup\nFirst things first: You'll want to make sure you're running iPadOS 13.4 on your device. This version of the operating system supports a long list of tablets.\nHead over to Settings, then General and then About to see what version of iPadOS you're running. If you're not on 13.4, head one tab back to General and tap \"Software Update.\" We recommend you back up your iPad to iCloud or iTunes just to be safe. You shouldn't lose any data, but it's good to be on the cautious side.\nConnect a Bluetooth mouse or trackpad\nIf you're looking to pair a Bluetooth mouse or trackpad to your iPad, start by turning the device on. We tested this with a Logitech Mouse and a Magic Trackpad ($129.99; bhphotovideo.com). Once you've turned it on, open Settings on the iPad and hit Bluetooth. You should see the mouse or trackpad appear under the list of devices already paired with your iPad. From there, tap to connect and you'll be set. It's really that simple.\nConnect a wired mouse\nYou can even connect a wired mouse to an iPad with a proper ad\nFor a wired mouse, you'll need an adapter. For iPads with a Lightning port, you'll need the Lightning to USB Type-A dongle. Apple calls it the Lightning to USB Camera Adapter, but fear not, it works with a wired mouse. Both Amazon.com and B&H Photo sell this dongle for $29. If you have an iPad with a USB Type-C port, you'll need a USB Type-C to USB Type-A adapter, which is $19 from B&H Photo.\nYou'll first plug the adapter into your iPad and then the mouse into the adapter. From there, it should be a simple plug-and-play situation. So if you have a wired mouse at home, all you need is the adapter.\nAdjust the trackpad settings to your liking\nAs with a typical laptop or desktop setup, you can customize the cursor and some settings for it. After all, most of us have a cursor speed we like. To customize these, go to Settings and General. You'll then see just \"Trackpad\" or \"Trackpad and Mouse\"; click either of those. Here you'll be able to turn on Tap to Click, select your scrolling style and even customize different click types. It's very similar to the experience in System Preferences on a macOS laptop or desktop.\nAfter these quick steps, you'll be able to use a trackpad or mouse on your iPad. Apple made it pretty simple, and this handy guide should make it even easier. For right now, the full operating system and most pre-installed apps are optimized for trackpad and mouse control. Just this week, Apple updated Pages, Keynote and Numbers for trackpad, along with iMovie and Garageband. A number of third-party apps have started rolling out updates, and you can expect new ones to keep arriving.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/02/cnn-underscored/ipad-trackpad-setup/index.html"}