{"authors": ["Kyle Hightower"], "date_download": "2020-05-04 20:23:48", "date_modify": "2020-05-04 20:23:48", "date_publish": "2020-04-16 18:26:17", "description": "BOSTON (AP) — For the first time in two decades, the New England Patriots are preparing for the NFL draft without a clear starting quarterback for next season. Following Tom Brady’s...", "filename": "_8ebc291d44bb05fbc20c323dfa7d271c_1588623828.html", "image_url": "https://storage.googleapis.com/afs-prod/media/53632c18c8a14b8c98ffa2f53d874f0b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8ebc291d44bb05fbc20c323dfa7d271c_1588623828.html", "title": "Loaded with picks, Pats could draft QB after Brady's exit", "title_page": "Loaded with picks, Pats could draft QB after Brady's exit", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Thursday, Feb. 27, 2020, file photo, Utah State quarterback Jordan Love works out at the NFL football scouting combine in Indianapolis. For the first time in two decades the New England Patriots are preparing for the NFL draft without a clear picture of who their starting quarterback will be in 2020. (AP Photo/Charlie Neibergall, File)\nFILE - In this Thursday, Feb. 27, 2020, file photo, Utah State quarterback Jordan Love works out at the NFL football scouting combine in Indianapolis. For the first time in two decades the New England Patriots are preparing for the NFL draft without a clear picture of who their starting quarterback will be in 2020. (AP Photo/Charlie Neibergall, File)\nBOSTON (AP) — For the first time in two decades, the New England Patriots are preparing for the NFL draft without a clear starting quarterback for next season.\nFollowing Tom Brady’s departure to Tampa Bay , 23-year-old Jarrett Stidham currently sits atop the Patriots’ depth chart.\nWhether he will still be there entering the season is an open question.\nCoach Bill Belichick so far hasn’t made a big move for one of the veteran quarterbacks available in free agency. Though he did add a little depth, re-signing former Brady backup Brian Hoyer.\nA rookie in 2019, Stidham beat out Hoyer for the spot behind Brady, impressing New England’s coaching staff with his ability to grasp its complex offense.\nBut Hoyer only threw four passes during the regular season, the last of which was an interception.\n“We’ve spent quite a bit of time with both Brian and Stid,” Belichick said during a recent conference call. “(Offensive coordinator) Josh (McDaniels) and myself certainly have a pretty good feel for both those players. The circumstances will be different this year and we’ll see how everything plays out. ... I think the main thing is to give everyone a chance to compete.”\nBrady was in his second year when he became the Patriots’ starter after Drew Bledsoe suffered an injury. But he inherited an offense that had more stability than the current roster does.\nNew England holds the 23rd pick in the first round. It has five picks in the first four rounds and 12 overall. Even with top QB prospects like Joe Burrow, Tua Tagovailoa and Justin Herbert expected to be selected early, former Utah State quarterback Jordan Love might still be on the board when the Patriots pick.\nBelichick acknowledged this year’s draft is ripe with quarterback talent.\n“Interesting group and probably one that has decent depth to it,” he said.\nHere are some other things to watch for from New England during the draft:\nQUIET SECOND ROUND?\nThe Patriots currently are without a second-round pick. Unless something changes, after making their first-round pick they won’t make another until the third round at 87th overall.\nNew England has had its share of hits and misses in the second round under Belichick.\nReceiver Deion Branch, who was named Super Bowl MVP when the Patriots won it all after the 2004 season, was a second-round pick in 2002. Tight end Rob Gronkowski was also a second-round pickup in 2010, as were linebacker Jamie Collins (2013) and quarterback Jimmy Garoppolo (2014).\nBut each of New England’s three most recent second-rounders have been far less successful. Fumble-prone Cyrus Jones (2016) started just one game before being waived in 2018. The Patriots tried again in 2018 with Duke Dawson, but because of injuries he didn’t appear in a single game before being traded to Denver in 2019.\n“There’s plenty of second rounders that had good careers here. So, we’ll see how it goes,” Belichick said. “But each draft is different, every year is different, each player is different.”\nLOOKING FOR LINEBACKERS\nOne of the reasons the Patriots have been so successful under Belichick is how frugal he has been with spending on players. It has often meant letting talent go in free agency, and the defense was hit hard this offseason.\nLinebackers Kyle Van Noy (Dolphins), Collins (Lions) and Elandon Roberts (Lions) all departed. Former LSU linebacker Patrick Queen could be one of the first targets to help rebuild the group.\nSECONDARY DEPTH\nWhile the middle of the defense has holes to fill, New England’s secondary is pretty solid.\nCornerback is set with Defensive Player of the Year Stephon Gilmore under contract for two more seasons. Safety Devin McCourty was re-signed and his brother, cornerback Jason McCourty, had his team option picked up.\nBut Belichick did trade safety Duron Harmon to the Lions last month in a cost-saving move. Devin McCourty and Patrick Chung are the starters, but they are both 32 years old. So look for the Patriots to go after some youth at the position.\nPossible candidates include Alabama’s Xavier McKinney, Minnesota’s Antoine Winfield, Jr. and Clemson’s K’Von Wallace.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/8ebc291d44bb05fbc20c323dfa7d271c"}