{"authors": ["Gene Johnson"], "date_download": "2020-05-04 20:09:01", "date_modify": "2020-05-04 20:09:01", "date_publish": "2020-04-16 18:08:46", "description": "SEATTLE (AP) — The Washington Supreme Court has ordered a lower court to reconsider the largest penalty for campaign finance violations ever assessed in the state. A Thurston County Superior...", "filename": "_7df6bfe2cc72839e4f7137dfa79a3cf5_1588622941.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7df6bfe2cc72839e4f7137dfa79a3cf5_1588622941.html", "title": "Justices: $18M campaign finance penalty to be reconsidered", "title_page": "Justices: $18M campaign finance penalty to be reconsidered ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SEATTLE (AP) — The Washington Supreme Court has ordered a lower court to reconsider the largest penalty for campaign finance violations ever assessed in the state.\nA Thurston County Superior Court judge imposed a $6 million penalty against the Grocery Manufacturers Association — now known as the Consumer Brands Association — for violations in 2013.\nThe judge then tripled it to $18 million, finding the violations were intentional; the state appeals court, however, reduced it back to $6 million, saying it was inappropriate to triple the fine.\nThe GMA — whose members included PepsiCo., Nestle and Coca Cola — had spent $11 million to defeat Initiative 522, which would have required labeling of genetically modified organisms on food packaging.\nIn a ruling Thursday , a majority of the justices agreed that the organization intentionally concealed the source of money by not identifying which of its member companies had contributed it. Because the violations were intentional, five of the justices said, the organization could be required to have its fine tripled, and it reinstated the $18 million penalty.\nHowever, the majority also said such a penalty might be so high as to violate constitutional protections against excessive punishment. It sent the case back to the appeals court to consider that question.\n“This penalty must be scrutinized carefully to ensure that it is based on constitutionally permissible considerations and is not grossly disproportional to GMA’s violations,” Justice Mary Yu wrote for the majority.\nIn spending to defeat the initiative, the group had attributed its expenditures only to itself, trying to protect the individual companies who had contributed the money from scrutiny. The state Attorney General’s Office sued, seeking a base penalty of more than $14 million — the amount GMA collected from its members — tripled to nearly $44 million.\nWhile the penalty was unprecedented, so was the underlying conduct, Attorney General Bob Ferguson said in a news release praising the ruling.\n“My philosophy is straightforward — penalties must be more than a cost of doing business for those, like GMA, who intentionally violate our transparency laws,” he said.\nConsumer Brands Association CEO Geoff Freeman said the organization would review the ruling “in due time.”\n“Right now we, and our industry, are rightly focused on providing Americans with the essential products they need to stay home and stay safe,” he said in an emailed statement.\nThe court also rejected GMA’s insistence that its decision not to identify the specific companies to protect them from re\nFour justices signed partial dissents in which they argued that triple penalties should not apply. Justice Charles Johnson argued that the violations should not have been considered intentional and said he was concerned the penalties were so far beyond the largest previous fine for such violations in Washington, which just under $1 million.\nJohnson also expressed concern that the state’s decision to seek such high penalties was politically motivated. He noted that the attorney general’s office had publicly stated that it “’took this case to trial because the GMA needed to be held accountable for their arrogance.”\n“It is worthwhile to note that the ‘arrogance’ of a violator is irrelevant,” Johnson wrote.", "url": "https://apnews.com/7df6bfe2cc72839e4f7137dfa79a3cf5"}