{"authors": ["Senior White House Correspondent"], "date_download": "2020-05-04 21:10:27", "date_modify": "2020-05-04 21:10:27", "date_publish": "2020-04-30 22:54:15", "description": "The former national security adviser pleaded guilty to lying to FBI investigators looking into his conversations with Russia’s ambassador.", "filename": "entry_trump-rehire-michael-flynn_n_5eab4ae5c5b62da419ee9b38_1588626627.html", "image_url": "https://img.huffingtonpost.com/asset/5eab4b9c300000fa1215539a.jpeg?cache=ruqfmf76vn&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_trump-rehire-michael-flynn_n_5eab4ae5c5b62da419ee9b38_1588626627.html", "title": "Trump Would ‘Consider’ Rehiring Michael Flynn Because He'll Likely Be ‘Exonerated’", "title_page": "Trump Would ‘Consider’ Rehiring Michael Flynn Because He'll Likely Be ‘Exonerated’ | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Win McNamee via Getty Images “It looks to me like Michael Flynn would be exonerated, based on everything I’ve seen,” President Donald Trump said.\nWASHINGTON ― President Donald Trump said Thursday that he would “consider” rehiring retired Army Gen. Michael Flynn if he is “exonerated,” as Trump’s first national security adviser seeks to withdraw his guilty plea for lying about conversations with the Russian ambassador.\n“I would certainly consider it,” the president told reporters at the White House, adding that he might not even need to think about pardoning Flynn. “It looks to me like Michael Flynn would be exonerated, based on everything I’ve seen,” the president said.\nFlynn pleaded guilty in federal court in December 2017, admitting that he had lied to FBI investigators looking into his discussions with the Russian ambassador about economic sanctions, which at the time of the conversations had just been imposed by President Barack Obama because of Russia’s interference in the 2016 election.\nThe conversations took place after Trump had been elected, but before he had taken office. The new president ousted Flynn within weeks because, he said at the time, Flynn had lied about those talks to Vice President Mike Pence, who then repeated his false assertions to the news media.\nBut Pence said on Thursday that he believes Flynn may not have purposefully lied to him. “I know what Gen. Flynn told me and I’m more inclined to believe it was unintentional than ever before,” he told reporters traveling with him on a trip to Indiana.\nFlynn’s new defense lawyers have been claiming that the former general was unfairly targeted by the FBI in the closing days of the Obama administration. On Wednesday, they released FBI memos they obtained about the case. One had the handwritten notation: “What’s our goal? Truth/Admission or get him to lie, so we can prosecute him or get him fired?” Another note read: “we have a case on Flynn + Russians.”\nThe judge in the case, Emmet Sullivan of the U.S. District Court for the District of Columbia, has put off sentencing Flynn until his original lawyers finish turning over files to his new team.", "url": "https://www.huffpost.com/entry/trump-rehire-michael-flynn_n_5eab4ae5c5b62da419ee9b38"}