{"authors": [], "date_download": "2020-05-04 20:05:59", "date_modify": "2020-05-04 20:05:59", "date_publish": "2020-04-08 20:39:34", "description": "DENVER (AP) — A fiber network built to provide broadband internet access to 14 mountain communities across northwest Colorado has gone online. The Northwest Colorado Council of Governments...", "filename": "_dbc3e1ad9bf00694017353aac0a0f30e_1588622759.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dbc3e1ad9bf00694017353aac0a0f30e_1588622759.html", "title": "Broadband fiber network launches across northwest Colorado", "title_page": "Broadband fiber network launches across northwest Colorado ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DENVER (AP) — A fiber network built to provide broadband internet access to 14 mountain communities across northwest Colorado has gone online.\nThe Northwest Colorado Council of Governments spearheaded the work on the project that went live Tuesday, The Denver Post reports .\nProject Thor is a 400-mile (644-kilometer) loop starting in Denver running west using Colorado Department of Transportation fiber along Interstate 70.\nThe network includes a combination of fiber services going north through Meeker, Craig, Steamboat Springs, and Grand County.\nThe network is designed to provide redundancy for communities experiencing regular outages, while filling a need for high-quality, affordable broadband that is lacking in many rural areas, the council of governments said in a statement.\nWork began in 2014 on Project Thor, named after the hammer-wielding Norse god.\nThe project received a $1 million grant from the state Department of Local Affairs for infrastructure and a $270,000 grant to lease the cable from the state transportation department for the first three years. Local governments provided matching funds.\nThe network is designed with a capability of up to 400 gigabytes, with additional capacity possible, officials said.\nThe network will allow partners to provide service to underserved areas directly or through private internet service providers, officials said.", "url": "https://apnews.com/dbc3e1ad9bf00694017353aac0a0f30e"}