{"authors": [], "date_download": "2020-05-04 20:04:46", "date_modify": "2020-05-04 20:04:46", "date_publish": "2020-04-06 23:59:37", "description": "CHEYENNE, Wyo. (AP) — A Wyoming judge has ordered the release of a school district's investigative report on bullying and harassment at a junior high school in Cheyenne that was prompted by racist...", "filename": "_6c768083d69799fc228324773beff89e_1588622686.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6c768083d69799fc228324773beff89e_1588622686.html", "title": "Judge orders release of report on offensive school flyers", "title_page": "Judge orders release of report on offensive school flyers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHEYENNE, Wyo. (AP) — A Wyoming judge has ordered the release of a school district’s investigative report on bullying and harassment at a junior high school in Cheyenne that was prompted by racist and homophobic flyers posted last year.\nThe ruling by Laramie County District Judge Peter Froelicher, dated last Thursday but only received on Monday, upholds the argument by news organizations and an open-government advocacy group that the report is a public record.\n“This matter involves the public’s access to governmental records subject to the presumption of openness and the notion that disclosure should prevail under” Wyoming law, Froelicher’s order said.\nThe flyers posted by at least one student at McCormick Junior High School in March 2019 read “Join the KKK” and “It’s not OK to be gay.”\nLaramie County School District No. 1 launched an investigation after a person filed a complaint that alleged there was ongoing harassment and discrimination at the school beyond the posting of the flyers.\nThe school district released a statement in May that said it investigated the complaint and had drafted an action plan as a result of the investigation.\nSchool district officials denied a request by the Wyoming Tribune Eagle newspaper to release the full report or a summary.\nThe newspaper’s owner, Adams Publishing Group, along with The Associated Press, Gray Television Inc., Townsquare media and Wyoming Liberty Group, sued the school district and its superintendent, Boyd Brown. The plaintiffs argued that the report and summary are public records that should be available for inspection.\nSchool district officials argued in part that the documents were protected from release because of attorney-client privilege.\nThe judge rejected that argument, saying the final report is a detailed description of the investigation conducted by a school district employee, and it doesn’t contain any legal strategies, advice or impressions.\nFroelicher ordered the release of the full report that blacks out any identifying information about students, parents or the person who filed the complaint. In doing so, he dismissed claims by the school district that such a redacted release would not be enough to conceal the identity of students.\nThe judge said he himself would redact the document, after school district officials provided a version that contained “additional and broader redactions” than the judge believed was appropriate.\nAfter the judge releases the blacked-out report, both sides will have 10 days to object before any information can be publicly released.\nForelicher also ruled that the summary of the report, which was written by attorneys, was subject to attorney-client privilege and could not be released.\nBoyd did not respond to a phone message and an email for comment.", "url": "https://apnews.com/6c768083d69799fc228324773beff89e"}