{"authors": ["Harmeet Kaur", "Dan Shepherd"], "date_download": "2020-05-04 16:33:59", "date_modify": "2020-05-04 16:33:59", "date_publish": "2020-04-06 21:33:12", "description": "The candy was found in bags distributed to families by the Utah Food Bank and contained packaging and labeling similar to Nerds Rope.", "filename": "2020_04_06_us_children-thc-candy-food-bank-trnd_index_1588610039.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406140643-nerds-rope-thc-candy-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_us_children-thc-candy-food-bank-trnd_index_1588610039.html", "title": "Two children hospitalized after eating THC-infused candy accidentally given out by a local food bank", "title_page": "Two children hospitalized after eating THC-infused candy accidentally given out by a local food bank  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Two children were hospitalized after eating THC-infused candy that was accidentally distributed to their families by the Utah Food Bank.\nLast week, the First Baptist Church of Roy, a partner agency with the food bank, handed out 63 bags of food to 63 families at a distribution point set up at the church. The bags contained Nerds Rope candy infused with a high dosage of THC, the Roy City Police Department said on Facebook\nFerrara Candy Company, the parent company of Nerds, called the product a counterfeit and said it is not affiliated with their company.\nPolice said that they believe each bag of food contained three to four packages of candy, and that each family received one bag. Law enforcement and the Utah Food Bank are reaching out to families who may have received the candy. They do not yet know where it came from.\n\"We are absolutely horrified that this product went out to any of our partner agencies, and can easily see how volunteers would not have known what to look for,\" Ginette Bott, president and CEO of the Utah Food Bank, said in a statement to CNN affiliate KUTV\nRead More", "url": "https://www.cnn.com/2020/04/06/us/children-thc-candy-food-bank-trnd/index.html"}