{"authors": [], "date_download": "2020-05-04 20:09:02", "date_modify": "2020-05-04 20:09:02", "date_publish": "2020-04-16 22:32:57", "description": "SEATTLE (AP) — A Washington state family filed a lawsuit against Seattle Children’s hospital for allowing a newborn child to develop a mold infection on his heart. The negligence lawsuit...", "filename": "_103edd136f2a6cbb6941144ea025101e_1588622942.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_103edd136f2a6cbb6941144ea025101e_1588622942.html", "title": "Family sues Seattle hospital over infant's heart infection", "title_page": "Family sues Seattle hospital over infant's heart infection", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SEATTLE (AP) — A Washington state family filed a lawsuit against Seattle Children’s hospital for allowing a newborn child to develop a mold infection on his heart.\nThe negligence lawsuit filed Monday was the latest in a series of legal actions against the hospital, which has struggled to contain Aspergillus mold at the facility since 2001, The Seattle Times reported .\nThe child was six days old when he had open-heart surgery at Seattle Children’s Oct. 1.\nA family member said they would not have allowed the surgery to occur there if they had known about the facility’s history of mold, but no one from the hospital informed them.\nThe hospital closed its operating rooms in the spring of 2019 after a spate of Aspergillus infections it attributed to small gaps in walls and air filters.\nAir testing did not detect mold after operating rooms reopened in July, and the hospital’s chief medical officer said the risk to patients was “incredibly low.”\nThe hospital’s monitoring since then went beyond legal requirements. But an investigation by the state Department of Health found monitoring failed to detect Aspergillus in the hospital’s operating rooms for more than a month after the infant’s October surgery.\nThe hospital responded to questions about the lawsuit by referring to a page on its website explaining what has been done to address the Aspergillus problem.\nChildren’s officials have confirmed 14 Aspergillus infections, including six patient deaths, since 2001.\nA lawsuit filed in December on behalf of four children or their estates seeks class-action status for patients who were sickened by Aspergillus at Seattle Children’s between 2005 and 2017. A fifth patient was added to the complaint in January.", "url": "https://apnews.com/103edd136f2a6cbb6941144ea025101e"}