{"authors": ["Connor Kilpatrick", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Dustin Guastella", "Meagan Day", "Michael Brooks", "Ben Burgis"], "date_download": "2020-05-04 19:52:03", "date_modify": "2020-05-04 19:52:03", "date_publish": "2020-03-02 00:00:00", "description": null, "filename": "2020_03_kyle-kulinski-bernie-bros-secular-talk-joe-rogan-youtube_1588621923.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/02164453/GettyImages-1183847969-e1583255080114.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_kyle-kulinski-bernie-bros-secular-talk-joe-rogan-youtube_1588621923.html", "title": "Kyle Kulinski Speaks, the Bernie Bros Listen", "title_page": "Kyle Kulinski Speaks, the Bernie Bros Listen", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Yet against all odds, slowly but surely, Kulinski has quietly become one of the most influential voices on the American left. He’s a Westchester bro in a suit, but one whose instincts just so happen to align perfectly with Bernie’s political revolution. And much like Bernie himself, nothing about his rise makes any sense at all.\nIt’s probably for the best — the very woke and very WASP-ish decorum haunting much of the media world is nowhere to be found in Secular Talk . “Corporate Democrats over-focus on identity as a trick to divert you from the issues that unite us all — class issues,” he said on a recent episode. “That Raytheon decided they don’t hate gays or trans people — frankly, I don’t really give a shit what their take on that is. They’re a horrendous company, and they need to be reeled the fuck in.”\nMuch like Sanders himself, Kulinski’s show has a massive audience that just doesn’t compute with our media’s understanding of “what the kids want” or even “what the left-wing kids want.”\nAnd yet he’s astonishingly plugged-in for a young man in the suburbs. Wondering how Sanders ended up on the Joe Rogan Experience ? Kulinski, a frequent guest on Rogan’s wildly popular show, introduced them. “You make the most sense to me,” Rogan told Kulinski on a recent episode. “You’re a normal person.”\nI suspect there are a few reasons for that. There is nothing “cool” about Kulinski’s show. (As a friend put it, “‘Welcome to Secular Talk ’ sounds like something you’d hear on Egyptian radio.”) His no-nonsense social-democratic politics won’t get him much cred with the Full Communism crowd. He records his show not in Brooklyn or Los Angeles, but in a studio he built himself in his modest Westchester home. His hair is too groomed and his taste in clothes too preppy to qualify as “Dirtbag Left.” Nor has he ever attended an n+1 release party. “Not only have I not attended one,” he says, “I have no idea what that means.”\nJust last week, his Wikipedia page was deleted. The reason? “There is very simply no [reliable source] coverage of this person,” according to one moderator. In new media, he’s king — the Sean Hannity of the Berniecrat left. In old media, he’s nobody.\nBut unlike Hayes, Amy Goodman, or his friend Cenk Uygur of The Young Turks — who began airing Secular Talk on his web network seven years ago — the thirty-two-year-old Kulinski is virtually invisible in the mainstream media. Despite his enormous fan base, his show has never once been mentioned in the obligatory trend pieces on “the Millennial Left” pumped out by the prestige media. Nor has Kulinski’s name ever popped up at all in the New York Times , Vox , the New Yorker , New York Magazine , or the Washington Post , despite his leading role in cofounding Justice Democrats, the organization widely credited with sweeping Alexandria Ocasio-Cortez and the rest of “the Squad” to power.\nWhile Secular Talk might be more likely to be looped in with the progressive networks around Air America and Pacifica alums like Sam Seder than the more resolutely socialist world, Kulinski’s fiery rhetoric, razor-sharp class instincts, and knack for withering takedowns sets him apart from his peers. Judging by his rhetoric alone, he’s closer to a Eugene Debs than a Chris Hayes.\nWith over 800,000 subscribers and nearly 670 million total views on YouTube, selling a progressive agenda is clearly something Kulinski knows how to do — even Democracy Now , the long-standing flagship of progressive media, cannot match his reach on the platform. Chapo Trap House can certainly boast a wildly devoted fan base (and a not insignificant degree of media influence), but their audience is roughly half the size of Kulinski’s.\n“I have no time for philosophical, airy bullshit,” Kulinski tells me from his home in Westchester, New York. “I don’t want to hear about Lenin. I don’t want to hear about Marx. I just want a super plainspoken, straightforward agenda with a straightforward way of selling it.”\nBut I was surprised to hear Kulinski’s name mentioned in the same breath as Bernie Sanders, particularly with such adoration. Because what I did remember about Kulinski’s show struck me as mostly capital-P “progressive” takes on the news — the left wing of the Netroots crowd more than the democratic socialism Sanders has popularized.\nThe driver, Ahmed, was a recent immigrant and apparently a die-hard fan of Secular Talk , the political talk show that Kulinski broadcasts on YouTube. I told him, yes, in fact. I do like Kulinski, had come across his show several years ago, and, all things considered, he seemed pretty good.\nThe first time I ever really listened to Kyle Kulinski’s show was in the back of a cab last summer. The driver had his phone hooked up through the stereo and was pumping out an episode through the car speakers — loudly, as if looking to convert a captive audience.\nA twenty-year-old Kyle Kulinski is staring at the camera, sitting in a pitch black room — his grandmother’s basement. “I’m sure a lot of you guys out there listening to this are concerned about the direction the country is going in.”\nHe gives off the vibe of a kid up way past his bedtime.\n“And if you are, I want you to please subscribe to my videos,” he says, his face barely visible. “Please subscribe to my videos.”\nIt’s the very first episode of Secular Talk , posted to YouTube in spring 2008 — little more than an announcement of things to come. At the time, Kulinski was living with his grandmother, attending Iona College as a political science major while his mom went back to work. “In my private life I’m not all that outgoing. I’m kind of a reserved person, and I keep to myself,” he says. “So just turning on a camera and going off and then uploading it seemed like a very good avenue to really express myself.”\nKulinski had grown up solidly upper-middle-class — the son of a car dealership owner. But the dot-com crash wiped out his family’s finances. A few years later, his parents split up with Kulinski and his mom moving in with his grandmother — the kind of downwardly mobile trajectory so common for much of his generation.\nWith his whole world now uprooted, broadcasting his politics across YouTube became a kind of vehicle for a young Kulinski to come out of his shell. “I used to listen to Thom Hartmann’s radio show, and he just seemed so free. Like he just has the airwaves, and he can say whatever he wants.”\nAlong with Hartmann, Kulinski cites Bill Maher, Richard Dawkins, and Noam Chomsky as his biggest early influences — with the exception of the latter, not exactly names you’d expect to see on Democratic Socialists of America reading lists. “I wasn’t just obsessed with politics and being a lefty,” he says, “but also with the New Atheism movement and Richard Dawkins. So that’s where the name comes from.”\nThe first couple of dozen episodes of Secular Talk are some variation of the same: Kulinski in a comically darkened room, wearing a T-shirt or hoodie, offering a media criticism of the week in a kind of Daily Show tradition, awarding titles like “Nutjob of the Week” to Joe Scarborough, or the “Common Sense” award to Cenk Uygur. Sanders got one too in the show’s early days — Kulinski first discovered the Vermont senator on Hartmann’s weekly “Brunch with Bernie” call-ins.\nOn these early videos Kulinski comes across as a precocious kid, eager — like so many other liberals of the Bush era — to steal the mantle of tough talk from the Right. Some titles from the early uploads: “Take Back the Word ‘Liberal,’” “McCainomics,” “Republican Bullsh*t (Healthcare Debate).”\nIt all feels like an audition tape for an Air America internship. Watching them, you just want to give the kid the job, he’s trying so damn hard. You could tell he was, like most young people facing the Great Recession, working out his politics in real time — trying out big ideas like a kid putting on his dad’s suit for the first time.\n“I graduated from college then I went out in the real world, and I got slapped in the face with the reality of like, ‘Oh wait, there’s no track anymore. There’s no path anymore. What the hell do I do?’”\nHe took a job as a salesman at a car dealership — his father’s old line of work. But with business at an all-time low, he was lucky to collect a couple hundred bucks a week. “You feel like it’s a dead end and there’s no hope and you have no idea what you’re going to do with the rest of your life or your time.”\nInstead, he poured out that angst into Secular Talk . And by the end of 2009, Kulinski’s show finally stepped out of the dark and into the light, literally — moving up from his grandmother’s basement and into a charming little suburban hallway. He calls out Republican hypocrisy on abortion and religion. He’s wearing button-downs now and has a little swagger, earrings in both ears.\nThe show was mostly a hobby at that point, with only sporadic new videos for the next couple of years. The end of Obama’s first term, however, was the turning point — both for Kulinski and many other young millennials who’d put their faith in the president.\n“I got disillusioned with the mainstream left when I saw that at least half of the people kind of shut their brain off and went along with Obama,” Kulinski says. “So I think that’s where you started to see me turn a little bit more. Now my show wasn’t just about ‘Republicans are wrong.’ Now it’s like, hey, and the entire system is messed up, and at least half the Democrats are corrupt, too!”\nThe show moved into Kulinski’s bedroom. He slipped on a headset, along with a large, seemingly redundant broadcasting microphone on the desk in front of him, signaling that he is, in fact, now a for-real talk show host. But his YouTube views at the time were only in the high hundreds. Totally undaunted, he turned his bedroom into an official studio, a black backdrop hanging behind him. He unbuttoned his shirt collar a bit, showing off a gold necklace. (Upload titles: “4 day work week,” “Michigan ‘Right to Work’ Bill Explained,” “Bradley Manning is an American Hero,” “Walmart Workers – Common Sense Award.”)\nBut what he couldn’t have known at the time was that the entire mainstream media landscape was collapsing from the inside out. And that those who’d placed bets on unlikely formats like YouTube were going to reap the rewards.\n“I had gotten into a fight with one of the managers at the dealership, verbal altercation or whatever. I just ended up leaving and not coming back. Then that’s when I decided, I’m going to try to do my show full-time.” In late 2012, he put on a tie and flooded his channel with videos — a new recording nearly every day, diced up into multiple pieces with click-bait titles like “Does Alien Life Exist?” and “Hologram Porn Being Made” sprinkled in with the meat-and-potatoes political discussions.\nIt was a “if you build it, they will come” growth model and, shockingly, it worked. In 2015, he hit a hundred thousand subscribers. After just two years of “mostly talking to myself,” Kulinski was earning a living from Secular Talk . That same year Glenn Greenwald came on the show for over an hour, spending much of it criticizing torture apologist Sam Harris. A couple of weeks later, Harris went on Kulinski’s show to fire back, racking up over six hundred thousand views. And with that, Kulinski’s audience became one worth fighting for.\n“The key to Kyle’s success — as is true for almost everyone who succeeds in developing an audience without having to rely on large media institutions — is authenticity, independence, and honesty,” Greenwald says. “His viewership, of which for years I’ve been a part, knows that they may not always agree with what he says but will always hear what he really thinks, without regard to appeasing media groupthink or placating prevailing orthodoxies.”\nLike with Kulinski’s friend Joe Rogan, his listeners understand that above all else his voice hasn’t been bought. And in the era of “Fake News,” it’s a priceless commodity. “He’s of the generation and background that understands why there is so much justifiable rage toward the political and media elite class in America,” Greenwald says.\nAs much as people may roll their eyes and giggle at the “logic warriors” of YouTube, it’s clearly a battleground that attracts young, alienated men looking to test out big ideas. It’s how Jordan Peterson built his empire. And, from the left, it’s how Kulinski’s built his following as well.\n“I just do it in the same way a bug is attracted to a bug light,” he says. “A lot of things that are conventional wisdom or sacred cows in the media are just idiotic, and I want to be the one to point at them and say, hey that’s really dumb!”\nAnd yet how did a fan of the New Atheist movement end up as one of YouTube’s most effective class warriors? Kulinski’s quick to remind me that he’s “pretty much a mild social democrat,” not a socialist. But if anything, he’s downplaying his political development — and his radicalism.\nIt turns out a lot had changed in the nearly ten years since I first ran across his show. And by 2016, the whole “progressive” universe was increasingly facing a schism between the Democratic Party­–approved liberalism of many in the Daily Kos crowd — to this day still trying to rally enthusiasm for Elizabeth Warren — and the increasingly feisty Berniecrat brigade of which Kulinski is most certainly a member.\nUnlike most of his progressive peers and even some self-identified socialists, Kulinski didn’t spend months waffling between Warren and Sanders. As a veteran of the “logic wars,” the choice was simple.\nIn the summer of 2017, Kulinski posted a video titled “Elizabeth Warren Can’t Explain Why She Didn’t Support Bernie,” breaking down an awkward and evasive Young Turks interview she did on the topic. (Kulinski: “This is a supposed straight shooter giving the classic politician dodge and not even in any artful way.”) A year ago, Kulinski was holding Warren’s feet to the fire for her “wishy-washy” answer on Medicare for All. And last June, when Warren was up in the polls, Secular Talk did an entire segment on her lackluster foreign policy views.\n“Understand what her blind spots are because they are large,” he added, “and you do with that information whatever you will.”\n“I think Kyle has a very clear understanding of power and how it works,” podcast host Michael Brooks says. “So, regardless of label, his politics are about delivering vital universal programs, and he understands what gets in the way of achieving them.”\nBut there was another major factor in Kulinski’s turn from MSNBC-ready to raging Berniecrat — one that took Kulinski himself a while to recognize. “In the fog of the moment, I didn’t even realize what had really happened. I just didn’t really piece it together until much later. But I’m sure that there was, you know, pent-up anger and aggression over that specifically.”\nKulinski’s talking about his father — in 2011, he began to experience severe recurrent back pain. But as one of the forty million Americans without health insurance, he ruled out a doctor visit. Instead, he opted for the cheaper option.\n“He went to a chiropractor, and the chiropractor would crack his back and then at the end of every session he’d be like, ‘Hey man, we’ll get that kink out. Just keep coming.’ And so he would keep showing up there.”\nBut the pain kept getting worse and worse until, eventually, Kulinski’s father was forced to go to the emergency room — risking a four-to-five-figure hospital bill. “It turns out that that back pain he was experiencing all along was cancer that had metastasized from his lungs into his spine.”\nOnly a few weeks later his father passed away in hospice care, joining the estimated forty-five thousand Americans who die annually from lack of health insurance.\n“It finally clicked a year later — my dad was actually one of those people that if he had the ability to just go to the doctor and didn’t have to worry about the bill, he almost certainly would’ve done it a hell of a lot earlier,” he says. “And maybe you could have caught the cancer in like stage two and stopped it.”\nIt’s a clarity as well as a source of rage that might elude many members of the mainstream media, the Democratic Party, and even certain segments of the more academic left. But not Kulinski. And increasingly, not the public either.\n“All I care about is Medicare for All and free college and a living wage and ending the wars and a Green New Deal and legalizing marijuana,” Kulinski says. “Like this is what it’s all about.”", "url": "https://www.jacobinmag.com/2020/03/kyle-kulinski-bernie-bros-secular-talk-joe-rogan-youtube"}