{"authors": [], "date_download": "2020-05-04 16:03:47", "date_modify": "2020-05-04 16:03:47", "date_publish": "2020-04-01 20:48:19", "description": "Samsung's Galaxy S20 family has been around for a little over a month now. We were impressed with the S20 and S20+ (though not over the moon about the S20 Ultra). But now Samsung is offering something truly unprecedented: a guaranteed 50% buy-back on these phones for 24 months.", "filename": "2020_04_01_cnn-underscored__ed5d7f615526e6b0e0d35cc7fc7c75a2_index_1588608227.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200306161518-8-underscored-samsung-galaxy-s20-s20-review-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_cnn-underscored__ed5d7f615526e6b0e0d35cc7fc7c75a2_index_1588608227.html", "title": "Samsung has a new 50% buy-back guarantee for the Galaxy S20 family", "title_page": "Samsung Galaxy S20 Buy-back: Here's what you need to know about Samsung's guaranteed trade-in program - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Samsung's Galaxy S20 family has been around for a little over a month now. We were impressed with the S20 and S20+ (though not over the moon about the S20 Ultra). But now Samsung is offering something truly unprecedented: a guaranteed 50% buy-back on these phones for 24 months.\nEssentially, when you purchase an S20, S20+ or S20 Ultra from Samsung directly, you're presented with the \"guaranteed buy-back program.\" That means you'll get half the retail price back when you're done with the S20.\nYou'll just have to send it back in satisfactory condition, which means no cracks or water damage, within 24-months. Samsung will then give the agreed-upon amount back in whichever form of payment you originally used. So, purchase an S20 on a credit card, and get the $500.00 in credit sent back when you return it.\nSamsung will not let you combine offers either. You'll have to weigh the buy-back offer with two others: a trade-in deal, which gives you up to $600 off any S20 with eligible trade-in, or $200 off an unlocked S20 or S20+.\nImportant note: You don't need to get or purchase a new Samsung device when you send the S20 back, as you're not locked into a contract. You're simply guaranteed a trade-in value for your S20, S20+ or S20 Ultra — and that's pretty awesome, especially since device values can tend to shrink over months and years.\nAs you might expect, the more expensive your phone, the more you'll get back through this program. Here are the rates Samsung will give you:\nGalaxy S20 5G, 128GB — $500\nGalaxy S20+, 128GB — $600\nGalaxy S20+, 512GB — $675\nGalaxy S20 Ultra, 128GB — $700\nGalaxy S20 Ultra, 512GB — $800\nYou can see the full terms on Samsung's Guaranteed Buy-back Program here.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/01/cnn-underscored/samsung-galaxy-s20-buy-back-trade-in/index.html"}