{"authors": ["General Assignment Reporter"], "date_download": "2020-05-04 20:18:17", "date_modify": "2020-05-04 20:18:17", "date_publish": "2020-04-29 12:04:56", "description": "And get this: Smith says in an upcoming ESPN documentary that he hopes to play again.", "filename": "entry_alex-smith-tour-leg-espn_n_5ea945e9c5b6fb98a2b54d35_1588623497.html", "image_url": "https://img.huffingtonpost.com/asset/5ea94b2930000027111551c5.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_alex-smith-tour-leg-espn_n_5ea945e9c5b6fb98a2b54d35_1588623497.html", "title": "NFL Quarterback Alex Smith Gives Tour Of Mangled Leg After 17 Surgeries (GRAPHIC VIDEO)", "title_page": "NFL Quarterback Alex Smith Gives Tour Of Mangled Leg After 17 Surgeries (GRAPHIC VIDEO) | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Alex Smith’s right leg is a road map showing his pain since he broke it during a November 2018 game as the Washington quarterback.\nThe Houston Texans’ J.J. Watt and Kareem Jackson sacked Smith in that NFL game, snapping the fibula and tibia bones in his lower leg.\nThe injury led to a dangerous infection, possible amputation and 17 surgeries.\nIn a clip posted Tuesday from an upcoming documentary on his recovery on the ESPN show “E:60” titled “Project 11,” Smith showed off his leg after all the procedures. (Note to readers: Stop here if you’re squeamish.)\nSmith, who was his team’s No. 11, plays a tour guide of sorts, describing the skin grafts and scarring, the transfer of thigh muscles from his good leg onto his damaged leg, the insertion of rods.\n“It did its job,” he said of the operations. “Saved my leg.”\nWhen @Redskins QB Alex Smith broke his leg in 2018, no one thought it would take 17 surgeries to fix. Here’s a look at #Project11 pic.twitter.com/lwcj1l0fV6 — E60 (@E60) April 28, 2020\nSmith said he’s “lucky to be alive,﻿” but that hasn’t stopped him from pondering the inconceivable: a return to the game.\n“Football might not be out of the question,” he says in “Project 11,” per For the Win. “Can I go play quarterback again? Can I push it that far?”\n“Project 11” premieres May 1 on ESPN.", "url": "https://www.huffpost.com/entry/alex-smith-tour-leg-espn_n_5ea945e9c5b6fb98a2b54d35"}