{"authors": [], "date_download": "2020-05-04 20:29:13", "date_modify": "2020-05-04 20:29:13", "date_publish": "2020-04-30 13:22:37", "description": "The gunfire broke out around 2 a.m. outside the embassy in northwest Washington.", "filename": "entry_cuban-embassy-shooting_n_5eaacf55c5b6efb0d33cf120_1588624153.html", "image_url": "https://img.huffingtonpost.com/asset/5eaad059220000c20d827ec8.jpeg?cache=qfcnjcaxyb&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_cuban-embassy-shooting_n_5eaacf55c5b6efb0d33cf120_1588624153.html", "title": "Suspect Arrested For Shooting At Cuban Embassy With Assault Rifle, D.C. Police Say", "title_page": "Suspect Arrested For Shooting At Cuban Embassy With Assault Rifle, D.C. Police Say | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Olivier Douliery via Getty Images The Cuban flag waves outside of the Embassy of Cuba in Washington, DC on October 3, 2017 in Washington, DC.\nWASHINGTON (AP) — Someone opened fire using an assault rifle outside the Cuban Embassy in Washington early Thursday and was arrested, authorities said.\nThe gunfire broke out around 2 a.m. outside the embassy in northwest Washington. Metropolitan Police Department officers were called to the scene after neighbors reported hearing gunshots, authorities said.\nOfficers found the suspect with an assault rifle and took the person into custody without incident, police said. Investigators say they believe the person had been shooting toward the embassy, though details about any potential motivation remained unclear.\nThe suspect, whose name was not immediately released, was arrested on charges of possessing an unregistered firearm and ammunition, assault with intent to kill and possessing a high-capacity magazine, a U.S. Secret Service spokeswoman said. No injuries were reported.\nDamage to the Cuban embassy in DC following a shooting there early this morning. No one was injured. pic.twitter.com/dI541HZ0uE — Patrick Oppmann CNN (@CNN_Oppmann) April 30, 2020\nCuba’s Ministry of Foreign Affairs said in a statement that embassy staff members were “safe and protected” but that the shooting caused “material damage” to the building. Photos posted on the embassy’s Twitter account showed large holes left in the building’s facade near the front door and in pillars outside the building.\nThe Cuban government doesn’t know the suspect’s identity or their potential motives, the statement said, adding that the U.S. State Department was also aware of the incident.\n“It is the obligation of States to adopt appropriate steps to protect the premises of diplomatic missions accredited to their country against any intrusion or damage and to prevent any disturbance of the peace of the mission or impairment of its dignity,” the statement said.\nPhotos from the scene posted to social media showed a group of police officers outside the embassy after the shooting and investigators searching through an SUV parked there. Other images showed investigators surveying the damage in front of the ornate embassy in Washington’s Adams-Morgan neighborhood, including a bullet hole in a window over the front door and damage to a flagpole and a column flanking a statue of Cuban independence hero José Martí.\nOfficers from the Metropolitan Police Department and the Secret Service were investigating.", "url": "https://www.huffpost.com/entry/cuban-embassy-shooting_n_5eaacf55c5b6efb0d33cf120"}