{"authors": ["Chloe Melas"], "date_download": "2020-05-04 16:19:21", "date_modify": "2020-05-04 16:19:21", "date_publish": "2020-04-04 19:13:07", "description": "Joe Exotic's ex-husband, John Finlay, has his sights set on two of Hollywood's biggest stars should Netflix's \"Tiger King\" be turned into a feature film.", "filename": "2020_04_04_entertainment_ti_c54934cc320735014ebcf7a0c0dd91ed_index_1588609161.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404144352-john-finlay-channing-tatum-shia-labeouf-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_entertainment_ti_c54934cc320735014ebcf7a0c0dd91ed_index_1588609161.html", "title": "'Tiger King': John Finlay wants Shia LaBeouf or Channing Tatum to play him in a movie", "title_page": "'Tiger King': John Finlay wants Shia LaBeouf or Channing Tatum to play him in a movie  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Joe Exotic's ex-husband, John Finlay, has his sights set on two of Hollywood's biggest stars should Netflix's \"Tiger King\" be turned into a feature film.\n\"Either Shia LaBeouf or Channing Tatum,\" Finlay told CNN in an interview on Friday.\nWhen told that his ex-husband reportedly hoped Brad Pitt would play him, he laughed and said, \"Brad Pitt, no. Dax Shephard, he would probably be the better choice.\"\nFinlay, who is remarried, with a whole new set of teeth, said he was disappointed that the docuseries made him look like a \"drugged-out hillbilly.\"\n\"Overall, it was good but there were quite a few parts I didn't agree with,\" Finlay said. \"They should have done follow-through stories at the end. They made me look like a drugged-out hillbilly. They didn't even show my new teeth or the actual tattoo finished. There was quite a bit they didn't even touch on.\"\nRead More", "url": "https://www.cnn.com/2020/04/04/entertainment/tiger-king-john-finlay-shia-labeouf-channing-tatum/index.html"}