{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:26:43", "date_modify": "2020-05-04 16:26:43", "date_publish": "2020-04-07 15:38:46", "description": "Stephanie Grisham was the White House press secretary in name only.", "filename": "2020_04_07_politics_stephanie-grisham-press-secretary_index_1588609603.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407101458-03-stephanie-grisham-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_stephanie-grisham-press-secretary_index_1588609603.html", "title": "How Stephanie Grisham made a mockery of the job of White House press secretary", "title_page": "How Stephanie Grisham made a mockery of the job of White House press secretary - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "As in, the title on her business cards -- at least until today ! -- said that she was the chief spokesperson for the White House. But Grisham never actually did that job. Not even close.\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!\nGrisham began serving as White House press secretary on July 1, 2019. In the 288 days between that day and Tuesday -- when, as CNN has reported, Grisham is leaving the job to return to her prior post running first lady Melania Trump's press shop -- Grisham held a total of 0 \"daily\" press briefings. None. Zilch. Nada.\n\"People may have a preconceived notion that I belong behind the podium, but I think this administration has gone beyond traditional roles in a variety of ways,\" she told CNN in August 201 9\nSo what did she do instead? Go on Fox News and attack the media!\n\"She is a near-staple on the network, appearing 26 times for extended interviews since August, more than all of her other network TV appearances combined,\" noted The Washington Post's Paul Farhi in a January piece entitled \" Why is press secretary Stephanie Grisham always on Fox News? It's because 'they ask,' she says .\"\nAnd, even a quick look at Grisham's average appearance on Fox shows why she liked being on the network so much. This back-and-forth between Grisham and the \"Fox & Friends\" anchors in September 2019 -- highlighted by WaPo media critic Erik Wemple -- is particularly egregious. Asked why she hadn't held a single daily press briefing since become White House press secretary, Grisham said this:\n\"Ultimately if the President decides it's something we should do, we can do that but right now he's doing just fine,\" said Grisham, who'd noted the President's frequent availability for Q&A sessions. \"And to be honest, the briefings have become a lot of theater and I think that a lot of reporters were doing it to, uh --\"\nAt which point Brian Kilmeade finished Grisham's thought. \"Get famous,\" he said.\n\"Get famous, yeah,\" responded Grisham. \"They're writing books now. They're all getting famous off of this presidency and I think it's great what we're doing now.\"\nRiiiiiiight.\nNow, to be clear, Grisham didn't kill the daily press briefing. That was President Donald Trump and Grisham's predecessor in the job, Sarah Sanders. While Trump initially loved the daily back-and-forth between reporters and Sean Spicer, his first press secretary, he grew increasingly frustrated with what he believed was the poor treatment that he (and his press secretary) received at the hands of the media.\n\"The reason Sarah Sanders does not go to the 'podium' much anymore is that the press covers her so rudely & inaccurately, in particular certain members of the press,\" Trump tweeted in January 2019 . \"I told her not to bother, the word gets out anyway!\"\nSanders left the post a few months later, moving back to her native Arkansas to explore a run for Arkansas governor in 2022. Grisham was named to the job soon after, having won the loyalties of the Trump family during the 2016 campaign, As CNN's Kate Bennett and Kaitlan Collins wrote of Grisham in an August 2019 profile\n\"Grisham's relationship with Trump is close, aides say, as it remains with the first lady, who gave her approval for Grisham to take on her new jobs with the President as long as she stayed with her as well.\"\nWhat Grisham never seemed to care about is that the White House press secretary was long seen as having two bosses: the President and the American public, who, not for nothing pay the salary of the press secretary. Balancing the interests of the administration and what the public deserved to know was always a challenge for past press secretaries. But they tried to find that balance -- most times.\nNot so with Grisham. She took the job knowing that she had only one boss: Donald Trump. She agreed to a role that fundamentally undermined the idea of what a White House press secretary should and could do.\nGrisham's legacy won't be killing the \"daily\" press briefing. It will be of making a mockery of the entire job of White House press secretary.", "url": "https://www.cnn.com/2020/04/07/politics/stephanie-grisham-press-secretary/index.html"}