{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:19:55", "date_modify": "2020-05-04 20:19:55", "date_publish": "2020-04-28 15:09:58", "description": "The new project also might give royal fans a clue about the Duke of Sussex's title going forward.", "filename": "entry_prince-harry-thomas-and-friends_n_5ea78ea7c5b6a30004e726a8_1588623595.html", "image_url": "https://img.huffingtonpost.com/asset/5ea82d21240000ae008e9dca.png?cache=kwdcm5kqre&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_prince-harry-thomas-and-friends_n_5ea78ea7c5b6a30004e726a8_1588623595.html", "title": "Prince Harry Heads To Netflix For A Very Nostalgic Reason", "title_page": "Prince Harry Heads To Netflix For A Very Nostalgic Reason | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Prince Harry is heading to Netflix this week to celebrate a beloved children’s TV show ― and his appearance may give royal fans a clue to the new title he now prefers.\nThe royal recorded a sweet introduction to mark the 75th anniversary of “Thomas & Friends.” He appears in a special episode of the program called “The Royal Engine,” which heirs ― um, airs ― on Netflix in the U.S. on Friday. The prince recorded his part in January.\nActor Rosamund Pike will voice a new train engine character on the show — the Duchess of Loughborough. Animated versions of Queen Elizabeth and a young Prince Charles will also appear in the episode.\nGetty Images Prince Harry recorded a special introduction for the episode.\nMattel said it made a donation to one of Harry’s initiatives in lieu of payment.\n“Thomas the Tank Engine has been a comforting, familiar face to so many families over the last 75 years — entertaining, educating and inspiring children on important issues through exciting stories and characters,” Harry said in a statement about his role.\n“I certainly have fond memories of growing up with ‘Thomas & Friends’ and being transported to new places through his adventures,” Harry said, adding that he was “very proud” to have been a part of the show’s special episode.\nIt’s certainly true that the prince is a longtime fan, as ITV News royal reporter Chris Ship pointed out that Harry carried a Thomas the Tank Engine bag as a child.\nPA Images via Getty Images Prince Harry, then 3 years old, arrives for his first day of nursery school at Chepstow Villas in West London with a Thomas the Tank Engine bag.\nGeorges De Keerle via Getty Images Prince Harry looks at photographers with a pair of binoculars as he leaves on his first day at Mrs. Mynor's nursery school on Sept. 16, 1987 in Notting Hill, London.\nIt’s interesting to note that in both a written statement and a video clip about the duke’s role in the TV special, the 35-year-old is referred to not as Prince Harry, but as “Harry, Duke of Sussex.” It could provide a clue as to what Harry would like to be called at future engagements.\nEarlier this year, after announcing his intention to step back as a senior working member of the royal family, Harry headed back to the U.K. for his final round of engagements. At a working summit for Travalyst, the sustainable travel initiative he launched last year, the duke dropped the titles for his introduction.\n“He’s made it clear that we are all just to call him Harry,” former Labour adviser and broadcaster Ayesha Hazarika said, according to Hello magazine. “So, ladies and gentlemen, please give a big, warm, Scottish welcome to Harry.” Both Harry and Meghan dropped the use of their His and Her Royal Highness titles in the terms of their step back, though they still retain them.\nChris Jackson via Getty Images The Duke and Duchess of Sussex made an official visit to the Joff Youth Centre in Peacehaven, Sussex, on Oct. 3, 2018.\nSince stepping back, Meghan has headed back to film with her new Disney nature documentary, “Elephant.” The Duchess of Sussex recorded narration for the film in October in London. The Duke and Duchess of Sussex recently relocated to Meghan’s hometown of Los Angeles, where they’ve stayed busy amid the pandemic. The couple were spotted delivering meals on behalf of Project Angel Food, a Los Angeles nonprofit that prepares and delivers food to people with AIDS and other critical illnesses. The couple is also making video calls for their U.K. charities. Subscribe to HuffPost’s Watching the Royals newsletter for all things Windsor (and beyond).", "url": "https://www.huffpost.com/entry/prince-harry-thomas-and-friends_n_5ea78ea7c5b6a30004e726a8"}