{"authors": [], "date_download": "2020-05-04 20:06:31", "date_modify": "2020-05-04 20:06:31", "date_publish": "2020-04-09 20:29:52", "description": "INDIANAPOLIS (AP) — An Indianapolis police officer was shot and killed Thursday while responding to a domestic violence call, authorities said. Officer Breann Leath, 24, was shot at an...", "filename": "_e38ed44f5c32669d0218a3d2cb767f82_1588622791.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e38ed44f5c32669d0218a3d2cb767f82_1588622791.html", "title": "Indianapolis officer fatally shot on domestic violence call", "title_page": "Indianapolis officer fatally shot on domestic violence call", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "INDIANAPOLIS (AP) — An Indianapolis police officer was shot and killed Thursday while responding to a domestic violence call, authorities said.\nOfficer Breann Leath, 24, was shot at an apartment complex on the city’s far east side. Leath died at Eskanazi Hospital, Chief Randal Taylor said.\nA suspect was taken into custody, said Deputy Police Chief Chris Bailey. A female civilian also was shot, he said.\n“Officer Leath turned toward the danger,” Mayor Joe Hogsett said at a news conference outside the hospital.\n“Officer Leath made the ultimate sacrifice on behalf of her brothers and sisters and made the ultimate sacrifice for an ever-grateful city.”\nHogsett directed that flags be lowered to half-staff across the city.\nLeath’s death is heartbreaking, Gov. Eric Holcomb said Thursday afternoon in a statement.\n“Officer Leath gave her life as she answered the call of duty,” Holcomb said. “She will be forever remembered for being the finest among us.”\nBailey said Leath had been on the force 2 1/2 years. She was among three officers who responded to the call, Bailey said.\nTraffic on Interstate 70 was shut down to clear the way for the officer’s transport to a downtown hospital, local television stations reported.", "url": "https://apnews.com/e38ed44f5c32669d0218a3d2cb767f82"}