{"authors": [], "date_download": "2020-05-04 16:57:22", "date_modify": "2020-05-04 16:57:22", "date_publish": "2020-04-09 14:08:56", "description": "Resident Evil 2's 2019 remake was the gold standard for video game reboots. When its sequel Resident Evil 3 was confirmed to be receiving a similar treatment, fans were understandably ecstatic. But could another of Capcom's survival horror masterpieces offer the same kind of greatness when released in such a short period of time following the first game's greatness?", "filename": "2020_04_09_cnn-underscored_resident-evil-3-remake-review_index_1588611442.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409095820-underscored-re3-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_cnn-underscored_resident-evil-3-remake-review_index_1588611442.html", "title": "Resident Evil 3 Remake Review", "title_page": "Resident Evil 3 Remake Review - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Resident Evil 2's 2019 remake was the gold standard for video game reboots. When its sequel Resident Evil 3 was confirmed to be receiving a similar treatment, fans were understandably ecstatic. But could another of Capcom's survival horror masterpieces offer the same kind of greatness when released in such a short period of time following the first game's greatness?\nIn a word, mostly. This return to Raccoon City is a thrilling and slick update for a series of horror games that defined an entire console generation, but in many ways it's missing some of the finer touches that Resident Evil 2 wowed audiences with. It's clear Capcom could have used more time with the game, but what's here is a delectable treat for anyone who appreciates being scared out of their wits.\nWhen S.T.A.R.S. come out to play\nResident Evil 3's Jill Valentine\nResident Evil 3 Remake is simultaneously a prequel and sequel to Resident Evil 2. Players take on the role of Jill Valentine as she mounts an escape from Raccoon City ahead of Leon and Claire's sojourn into town. Jill is a member of S.T.A.R.S., the \"Special Tactics and Rescue Service,\" a special forces unit under the Raccoon Police Department created to combat emergencies and terroristic threats.\nThe game extends about a day beyond that as well as it follows Jill's plight and rendezvous with the Umbrella Biological Containment Service (UBCS). That's where Jill meets the kind-hearted and rugged Carlos Olivera, whose team is unreachable thanks to a massive sea of zombies waiting to swoop in and devour him.\nCarlos and Jill work together as the story fills out the gaps in the original title's blueprint. The result is a spotlight on one of the most underrated pairings throughout the Resident Evil mythos, with Jill and Carlos working in tandem to problem solve in a believable manner.\nBut in this game, even minor characters get extra love, with plenty of backstory and buildup to help you understand and get to know everyone's motivations, even when they aren't initially clear. And much of this is taken from the original PlayStation release of the game, but numerous changes have been made, as well.\nWhile 2019's Resident Evil 2 Remake was indeed a slick reboot with extended sequences, Resident Evil 3 feels much more like a reimagining with content peeled away in some instances and supplemented in others. With this in mind, some fans may be put off by the liberal changes to the source material — though none of it feels out of place or unfaithful to the series' legacy.\nAnd let's not forget that the game, its models, voice acting and music were all handled beautifully, which is something to be proud of. Jill looks better than she ever has, with the perfect mixture of modern and classic coming together to make her character model as memorable as Leon and Claire's new looks. The entire game uses the RE Engine, and in turn, looks absolutely fantastic. The RE Engine is a special gaming engine created by Capcom for Resident Evil 7. It's since been adopted for development on both the Resident Evil 2 and Resident Evil 3 remakes. It's certainly put to good use here.\nMaking enemies\nFighting Nemesis\nThis series is known for much more beyond developing its characters. Fans will undoubtedly flock to this game for its hardcore survival horror combat and challenging enemies. They'll certainly be rewarded with austere, face-to-face encounters with flesh-eating zombies and undead creatures at every turn. There's no shortage of them here.\nOf course, the main draw (and the star of the subtitle for the original game) is Nemesis. Nemesis, clad in a slick trench coat, is Jill's foil throughout. He's a threatening villain who can't be killed, at least not via traditional means. He's been resurrected to follow Jill around and stalk her until he can finally bring her down, and he's just as steadfast as ever.\nAs before, you can choose to stand your ground and fight him until he's weak enough to drop a case of items you want to stockpile (they're usually pretty good). But he won't just go away after being \"defeated.\" He'll take time to catch his breath and then go right after Jill once more, which makes him tougher to deal with this time around.\nHowever, beyond a few set encounters with Jill, this menacing behemoth simply doesn't show up as much as he should, which makes for a disappointing few moments when he does. There are several places he simply can't go. When you're forced into chase sequences, he'll let up after a few moments. There are grand encounters with Nemesis, but he doesn't feel like the constant threat he was in the original game, which is a letdown.\nA fighting chance\nFighting off zombies in Resident Evil 3\nLuckily, the rest of the game's combat is stellar. You have plenty of options at your disposal to keep the shambling dead at bay. There's one move, the dodge mechanic, that you have to quickly learn or you may be toast. You get a dedicated button for doing so, and you can perform a regular dodge by tapping the button. Hitting the dodge button right when an enemy comes in for the kill, however, will give you a perfect dodge. This means you'll escape getting hit. You can then draw and shoot at the enemy to bag a headshot. Boom! Zombie threat eliminated.\nAnd there are tons of them to dispatch. Around every corner, another bloodthirsty beast awaits to take you down. You've got plenty of weaponry to use to eliminate them, but it's all up to you to be thrifty with ammo and conserve it when needed. It still feels irresistible to pop a cap in a zombie's head, though, just like in Resident Evil 2 Remake. Combat feels meaty, and you'll quickly get the hang of it, especially if you master the dodge and implement it at the right time.\nBut there's more to the game then combat, of course. There are puzzles scattered around that Jill has to solve, mostly released to unlocking doors with ID cards or finding ways to pass through certain areas. Unfortunately, Capcom has done away with several segments of the game that were in the original, such as the random events in the PlayStation classic. The \"Live Selection\" system that made for intriguing variations during the game appears to have been removed entirely, as well as a variety of enemies and areas: perhaps there wasn't enough time to rework it in the development. There wasn't much additional content added to make up for these losses either, which was frustrating to discover.\nBottom line\nResident Evil 3 is a competent, thrilling take on one of the genre's favorites. Unfortunately, there are aspects of the game that cause it to flounder when it should flourish. It's already concluded in what feels like the blink of an eye, though what it offers is suspenseful and terrifying in many ways. It simply feels as though Capcom could have taken more time to work its magic and sprinkle in the locations and set pieces that had been removed during the \"remastering\" process.\nAs it stands, Resident Evil 3 is definitely worth your time, as a fan of the series or a newcomer looking to be scared out of your wits.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/09/cnn-underscored/resident-evil-3-remake-review/index.html"}