{"authors": [], "date_download": "2020-05-04 20:19:32", "date_modify": "2020-05-04 20:19:32", "date_publish": "2020-04-04 20:38:06", "description": "COLLEGE PARK, Ga. (AP) — The Georgia Bureau of Investigation has been called in to look into a shooting Saturday that has left an officer injured and a murder suspect in custody. Gerald...", "filename": "_c5740792070174fd72e787462780f269_1588623572.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c5740792070174fd72e787462780f269_1588623572.html", "title": "Georgia officer shot during chase; murder suspect arrested", "title_page": "Georgia officer shot during chase; murder suspect arrested", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "COLLEGE PARK, Ga. (AP) — The Georgia Bureau of Investigation has been called in to look into a shooting Saturday that has left an officer injured and a murder suspect in custody.\nGerald Walker, a spokesman for College Park, a suburb of Atlanta, said one of the city’s officers was shot while chasing a murder suspect, The Atlanta Journal-Constitution reported . The chase began when a license plate reader spotted a vehicle believed to have been driven by the suspect and alerted police, Walker said.\nOfficers from East Point and Hapeville and Georgia State Patrol troopers were also involved.\nThe suspect was engaged with authorities near an intersection and it was “during this encounter that College Park Sgt. Charles Landrum suffered a gunshot wound to the neck,” Walker said.\nPolice said Landrum’s injury doesn’t appear to be serious. Doctors at Grady Memorial Hospital removed the bullet and he’s expected to remain hospitalized overnight for observation, the newspaper reported.\nIt wasn’t immediately clear Saturday who shot Landrum.\nThe suspect, whose name was not released, was taken into custody. He’s being treated at Grady Memorial, but authorities did not say how he was injured or the extent of his injuries. Details of his alleged crime were not immediately released.", "url": "https://apnews.com/c5740792070174fd72e787462780f269"}