{"authors": ["Manu Raju", "Jeremy Herb"], "date_download": "2020-05-04 16:00:50", "date_modify": "2020-05-04 16:00:50", "date_publish": "2020-04-01 15:30:47", "description": "House Democrats are beginning their review of how the US government is implementing trillions of dollars of taxpayer money approved by Congress -- and are starting to discuss probing what went wrong with the initial federal response.", "filename": "2020_04_01_politics_democrats-oversight-trillions_index_1588608050.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191112155932-07-adam-schiff-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_democrats-oversight-trillions_index_1588608050.html", "title": "House Democrats focus on how trillions of dollars are being spent", "title_page": "House Democrats focus on how trillions of dollars are being spent and may probe US response later  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) House Democrats are beginning their review of how the US government is implementing trillions of dollars of taxpayer money approved by Congress -- and are starting to discuss probing what went wrong with the initial federal response.\nThe focus at the moment is to scrutinize whether the federal government is effectively spending the money -- and to pressure the White House if there are delays in implementing programs that could amount to roughly $3 trillion in the first three massive bills that were rammed through Congress.\nTo that end, House Democrats are holding a series of conference calls starting Wednesday with key committee chairmen to discuss what they are learning about how the money is being spent -- and whether there needs to be additional action taken by Congress to draw attention to lags in implementing the laws. On Wednesday, Democrats plan to discuss how the direct payments to Americans are being implemented, as well as funding to states and localities -- along with the enhanced unemployment benefits approved in the stimulus that was enacted last Friday. On Thursday, additional conference calls will focus on food security, infrastructure, public health and housing, according to a notice that was sent to House Democratic members.\nHouse Intelligence Chairman Adam Schiff, a Democrat from California, also said that he has started to work on legislation to create a commission modeled after the body that investigated the 9/11 attacks. But he told a Washington Post columnist that such an investigation would need to wait \"until the crisis is abated to ensure that it does not interfere with the agencies that are leading the response.\"\nHouse Speaker Nancy Pelosi said on CNN's \"State of the Union\" on Sunday that Congress would review the Trump administration's handling of the pandemic -- at some point.\nRead More", "url": "https://www.cnn.com/2020/04/01/politics/democrats-oversight-trillions/index.html"}