{"authors": ["Trends Reporter"], "date_download": "2020-05-04 21:10:31", "date_modify": "2020-05-04 21:10:31", "date_publish": "2020-04-30 22:54:28", "description": "The supermodel talked about her pregnancy and her birthday cake with Jimmy Fallon on \"The Tonight Show.\"", "filename": "entry_gigi-hadid-zayn-malik-pregnant_n_5eaa77b3c5b66b48cf95eab2_1588626631.html", "image_url": "https://img.huffingtonpost.com/asset/5eab4d92250000e211eb0a9a.jpeg?cache=zhslac5ix9&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_gigi-hadid-zayn-malik-pregnant_n_5eaa77b3c5b66b48cf95eab2_1588626631.html", "title": "Gigi Hadid Confirms She And Zayn Malik Are Having A Baby: 'We're Very Excited'", "title_page": "Gigi Hadid Confirms She And Zayn Malik Are Having A Baby: 'We're Very Excited' | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "It’s official: Gigi Hadid and Zayn Malik are having a baby.\nAfter reports circulated earlier in the week that the pair were expecting, the supermodel called in to Jimmy Fallon’s “The Tonight Show” on Thursday to share the happy news.\n“Obviously, we wish we could’ve announced it on our own terms, but we’re very excited and happy and grateful for everyone’s well-wishes and support,” Hadid said.\nHadid, who is isolating with Malik on her family’s Pennsylvania farm, said it was a “silver lining to be able to be home and together and really experience it day by day.”\nHer mom, Yolanda Hadid, had shared the due date earlier on Thursday, telling Dutch broadcaster RTL Boulevard that the family is feeling “very blessed” and that she “can’t wait to become Oma [‘Grandma’ in Dutch] in September.”\nThe model had celebrated her 25th birthday with her nearest and dearest on the farm last week. Hadid said her main craving has been for everything bagels, and the surprise everything bagel cake her family got her for her birthday — made by Buddy Valastro, aka “Cake Boss” — had her crying “every five minutes for like an hour.”\nHear the rest of Hadid’s interview below:", "url": "https://www.huffpost.com/entry/gigi-hadid-zayn-malik-pregnant_n_5eaa77b3c5b66b48cf95eab2"}