{"authors": ["Reporter"], "date_download": "2020-05-04 20:03:53", "date_modify": "2020-05-04 20:03:53", "date_publish": "2020-05-04 19:31:56", "description": "Lack has come under fire for his handling of sexual misconduct at the network.", "filename": "entry_nbc-news-chairman-andy-lack-resigns_n_5eb06af7c5b62efb9d7e3617_1588622633.html", "image_url": "https://img.huffingtonpost.com/asset/5eb06d31300000a112155684.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_nbc-news-chairman-andy-lack-resigns_n_5eb06af7c5b62efb9d7e3617_1588622633.html", "title": "NBC News Chairman Andy Lack Stepping Down", "title_page": "NBC News Chairman Andy Lack Stepping Down | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "NBC News chairman Andy Lack is stepping down and will “transition out of the company,” the network announced Monday.\nThe move comes as part of a company reorganization that houses NBC News, MSNBC and CNBC under the newly formed NBC Universal News Group. Cesar Conde, who oversees NBCUniversal International Group, will now lead that department.\nLack has come under fire for not adequately addressing the systemic causes of sexual harassment cases at the network after allegations against Matt Lauer, one of its biggest stars, emerged in 2017.\nUnder Lack’s leadership, the network was scrutinized for refusing to run Ronan Farrow’s landmark story on sexual assault allegations against Harvey Weinstein that year. Lack later defended that decision, saying Farrow “had nothing yet fit to broadcast” when he brought the story to NBC News.\nBut sources at the network told HuffPost in 2017 that NBC News’ leaders actively crippled Farrow’s reporting, insisting that he could not use an NBC News camera crew to interview a woman accusing Weinstein of rape and forcing him to pay out of pocket for a camera crew.\nThis is a developing story. Please check back for updates.", "url": "https://www.huffpost.com/entry/nbc-news-chairman-andy-lack-resigns_n_5eb06af7c5b62efb9d7e3617"}