{"authors": [], "date_download": "2020-05-04 20:08:58", "date_modify": "2020-05-04 20:08:58", "date_publish": "2020-04-07 01:46:01", "description": "BRISBANE, Australia (AP) — A shark fatally mauled a young Australian wildlife worker on the Great Barrier Reef, officials said Tuesday. Queensland state Premier Annastacia Palaszczuk said...", "filename": "_ee1698f1d3ae4bd9a94d3349a589f2ac_1588622938.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ee1698f1d3ae4bd9a94d3349a589f2ac_1588622938.html", "title": "Shark kills Australian wildlife worker on Great Barrier Reef", "title_page": "Shark kills Australian wildlife worker on Great Barrier Reef", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BRISBANE, Australia (AP) — A shark fatally mauled a young Australian wildlife worker on the Great Barrier Reef, officials said Tuesday.\nQueensland state Premier Annastacia Palaszczuk said the 23-year-old victim worked for the Queensland Parks and Wildlife Service.\n“Once again a family out there is grieving for a young man who tragically has lost his life in this horrific shark attack,” she told reporters.\nPolice said the man was in the water, returning to a vessel chartered by the service when he was attacked Monday near North West Island, 75 kilometers (47 miles) northeast of Gladstone. He suffered extensive injuries to his leg and arm and died at a hospital hours later.\nDetective Senior Sergeant Tony Anderson said the ranger had been doing maintenance work before the attack. The victim was the last person out of the water.\n“At the end of the day there were four people swimming off the back of a boat, cooling down after a day’s work,” he told reporters.\nThere have been at least three shark attacks on the Great Barrier Reef over the past 18 months.\nLast October, two British backpackers were attacked while snorkeling at Hook Island in the Whitsunday Islands. One of the men lost his foot.\nIn March 2019, a 25-year-old man suffered serious thigh injuries when a shark attacked him at Hardy Reef, near Hamilton Island, also in the Whitsundays chain.\nAnd in November 2018, Victorian doctor Daniel Christidis, 33, was killed at Cid Harbour at Whitsunday Island.", "url": "https://apnews.com/ee1698f1d3ae4bd9a94d3349a589f2ac"}