{"authors": [], "date_download": "2020-05-04 16:58:27", "date_modify": "2020-05-04 16:58:27", "date_publish": "2020-04-09 17:06:34", "description": "Even though the iPhone 11 family has been out for eight months, they're still some of the most powerful phones available. And just for one day, Woot! has discounts on unlocked, refurbished models of Phone 11 Pro and iPhone 11 Pro Max.", "filename": "2020_04_09_cnn-underscored_apple-iphone-11-sale-woot_index_1588611507.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409115801-iphone-11-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_cnn-underscored_apple-iphone-11-sale-woot_index_1588611507.html", "title": "Refurbished iPhone 11 Pro and iPhone 11 Pro Max are discounted for one day only", "title_page": "Apple iPhone 11 Pro sale: Save on refurbished models iPhone 11 Pro and iPhone 11 Pro Max\n - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Even though the iPhone 11 family has been out for eight months, they're still some of the most powerful phones available. And just for one day, Woot! has discounts on unlocked, refurbished models of Phone 11 Pro and iPhone 11 Pro Max.\nThe iPhone 11 Pro 64GB is available in midnight green and silver for just under $900., while the 256GB model is under $1,000 in silver.\niPhone 11 Pro\niPhone 11 Pro, 64GB ($899.99, originally $999.99; woot.com )\niPhone 11 Pro, 256GB ($999.99, originally $999.99; woot.com)\nThe iPhone 11 Pro Max comes in space gray, silver, midnight green and gold at $989.99 for the 64GB model and $1,099.99 for 256GB. Finally, the 512GB model is only available in space gray and is on sale for $1,199.99.\niPhone 11 Pro Max\niPhone 11 Pro Max, 64GB ($899.99, originally $1,099; woot.com )\niPhone 11 Pro Max, 256GB ($999.99, originally $1,249; woot.com )\niPhone 11 Pro Max, 512GB ($1,199.99, originally $1,449; woot.com)\nThe discounted devices are all refurbished, which means these devices were returned, so they could have some cosmetic damage or replacement parts. Fortunately, Woot! throws in a 90-day limited warranty with your purchase.\nThe crown jewel of the iPhone 11 family is, of course, the camera. You get a 12-megapixel wide lens, as well as a 12-megapixel ultrawide lens. The latter camera mode provides a greatly extended field of view, and at 12 megapixels, it will capture some great photos for you. Plus, the 11 Pro and 11 Pro Max take things even further with a telephoto lens that's also 12 megapixels. Both phones have Night Mode, which uses software and artificial intelligence to take incredible night photos without the need for flash. For more info, take a look at our user guide here.\nIt's not just about the camera, though. Each phone has Apple's latest and greatest processor, the A13 Bionic chip, built with speed in mind. The 11 Pro and 11 Pro Max feature OLED screens, providing additional contrast, deeper blacks and improved color vibrancy.\nSo pick up an iPhone 11 Pro or iPhone 11 Pro Max now, and find out firsthand why Apple's flagship iPhone is a top dog. For more great Apple deals, check out CNN Coupons.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/09/cnn-underscored/apple-iphone-11-sale-woot/index.html"}