{"authors": ["Connor Kilpatrick", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Meagan Day", "Paul M. Renfro", "Colin Gordon"], "date_download": "2020-05-04 19:52:05", "date_modify": "2020-05-04 19:52:05", "date_publish": "2020-02-04 00:00:00", "description": null, "filename": "2020_02_iowa-caucus-results-disaster-pete-buttigieg_1588621925.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/02/04113031/bernie_sanders_petebuttigieg.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_02_iowa-caucus-results-disaster-pete-buttigieg_1588621925.html", "title": "“Mayor Pete Was the Kinda Kid Who Unplugged the Sega If He Was Losing.”", "title_page": "“Mayor Pete Was the Kinda Kid Who Unplugged the Sega If He Was Losing.”", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "I can’t think of a bigger endorsement of “political revolution” than last night’s clusterfuck in Iowa.\nIt’s hard to tell where incompetence ends and corruption begins. Or if there’s really any difference. Incompetence, in this instance, is functioning like a fifty-foot shit-heap upon which Mayor Pete is more than happy to scale and plant his flag.\nThe Sanders campaign, however, was ready with their own internal data, reporting totals from nearly half the precincts. According to their count, Sanders is in first place, five points ahead of Buttigieg. This seems to be the growing consensus. According to Dave Wasserman of the Cook Political Report , “there’s virtually no question Sanders won the most caucus support” in the first round and that the final tally “leans Sanders,” an assessment echoed by Nate Cohn of the New York Times .\nIn every meaningful sense, Sanders won Iowa. It’s unclear when official results will be reported and who, after all this (including viral videos of coin tosses used to award delegates), will even believe them.\nAnd this is just one of many signs of rot. In the last two decades, we’ve had two American presidents who lost the popular vote, the first of whom was seated in the White House thanks to the Supreme Court and the latter of whom lost by nearly three million votes. Imagine what mainstream pundits would think about a Latin American republic with this kind of record.\nLiberal skeptics of the Sanders campaign often focus their ire more on his call for “political revolution” than any individual policy. They believe that anger at our institutions is not only misplaced but dangerous.\nNot only is that anger anything but unjust, the fact is the real danger is letting the rot deepen as it did last night, breeding more cynicism and more alienation from even the general idea that we live in anything vaguely resembling a democracy.\nWhile Sanders is correct to make Medicare for All and full employment the center of his economic platform, it’s his call to upend the political system that makes a lot of loyal Democrats — and their donors — nervous. Sanders has called for a party and a country run by and for working people, and the need for that kind of “political revolution” has never been more apparent. Historically, workers’ parties have been locked out of parliamentary systems by exactly the same kinds of anti-democratic, arcane (and easily corruptible) voting systems as those used in the caucuses last night.\nAnd we’ve seen who takes over in their absence. Pete Buttigieg’s campaign lobbied CNN to spike the most consequential poll in American politics — which had correctly predicted the last three caucus victories — just forty-eight hours prior to the caucuses after the poll reportedly showed him in third place. And last night, with no votes verified, Mayor Pete declared victory. As comedian Ian Fidance put it, “Mayor Pete was the kinda kid who unplugged the Sega if he was losing.”\nWhile no single fact proves corruption, piece it together — along with the unfolding drama about the mysterious new app used to report results — and there’s an eggy aroma in the air, to say the least, and it seems to be emanating out from the Buttiegieg camp. All of this only deepens the suspicion that Mayor Pete is, in fact, an objectively creepy figure, practicing the kind of shadowy corporate black ops for which his former employer McKinsey & Company is infamous. That he is so disliked by the American public while Sanders is so beloved is one of many facts that should hearten us all.\nBiden’s performance last night by all accounts was beyond abysmal, and Warren has proven time and time again that her deeply confused mission to reconcile the left-wing of the Democratic Party with the right — on the Right’s terms, of course — has no chance of winning mass support.\nBut make no mistake, while Pete Buttigieg has no chance of becoming the nominee in 2020, he is the future the Democratic Party so desperately wants for us all. He is the Barry Goldwater of the liberal donor class — we don’t want to meet their Reagan.", "url": "https://www.jacobinmag.com/2020/02/iowa-caucus-results-disaster-pete-buttigieg"}