{"authors": ["Lauren Fox", "Clare Foran"], "date_download": "2020-05-04 17:03:01", "date_modify": "2020-05-04 17:03:01", "date_publish": "2020-04-10 18:49:35", "description": "A Treasury Department watchdog has concluded that the department \"properly\" processed a request from House Democrats for President Donald Trump's tax returns -- a request that was denied by Treasury Secretary Steven Mnuchin last year.", "filename": "2020_04_10_politics_trump-t_8c11acc066768825389819bb7327de05_index_1588611781.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200311160249-02-trump-branded-properties-charge-taxpayers-1-million-invs-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_trump-t_8c11acc066768825389819bb7327de05_index_1588611781.html", "title": "Watchdog finds Treasury acted properly in denying request for Trump tax returns", "title_page": "Watchdog finds Treasury acted properly in denying request for Trump tax returns - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) A Treasury Department watchdog has concluded that the department \"properly\" processed a request from House Democrats for President Donald Trump's tax returns -- a request that was denied by Treasury Secretary Steven Mnuchin last year.\nHouse Ways and Means Committee Chairman Richard Neal, a Massachusetts Democrat, formally requested the President's tax returns from the Internal Revenue Service in April 2019 , a request that House Democrats argued was necessary as part of their oversight role, but that the President pushed back against and criticized as partisan.\nMnuchin denied the request and subsequently defied subpoenas from the committee over the tax returns.\nRichard Delmar, the Treasury Department's acting inspector general, wrote in a letter to Neal and Kevin Brady, the panel's ranking Republican member, on Wednesday that an inquiry that examined the handling of the tax return request determined that \"the Department processed the request properly.\"\nThe letter stated that the department \"sought legal guidance from the Department of Justice's Office of Legal Counsel (OLC), determined that it was bound by that office's advice, and based on that advice determined not to provide the returns and tax information sought.\"\nRead More", "url": "https://www.cnn.com/2020/04/10/politics/trump-tax-returns-treasury-watchdog-report/index.html"}