{"authors": ["Dennis Waszak Jr."], "date_download": "2020-05-04 20:24:13", "date_modify": "2020-05-04 20:24:13", "date_publish": "2020-04-16 16:29:49", "description": "NEW YORK (AP) — Joe Douglas and the New York Jets were busy in free agency, filling some of the many holes that marked the team's talent-needy roster. There are still plenty more to...", "filename": "_b8a33ec3b47b5bef11981517e39580d3_1588623853.html", "image_url": "https://storage.googleapis.com/afs-prod/media/aebbadafe91e41bfa19e8fdce1af0a1e/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b8a33ec3b47b5bef11981517e39580d3_1588623853.html", "title": "Jets might have tough choice between top OL or WR at No. 11", "title_page": "Jets might have tough choice between top OL or WR at No. 11", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jets might have tough choice between top OL or WR at No. 11\nFILE - In this Feb. 25, 2020, file photo, New York Jets general manager Joe Douglas speaks during a press conference at the NFL football scouting combine in Indianapolis. Douglas and the Jets were busy in free agency, filling some of the many holes that marked the team's talent-needy roster. There are still plenty more to plug. With the No. 11 overall pick in the NFL draft, the Jets will have the opportunity to add an impact player early. (AP Photo/Michael Conroy, File)\nFILE - In this Feb. 25, 2020, file photo, New York Jets general manager Joe Douglas speaks during a press conference at the NFL football scouting combine in Indianapolis. Douglas and the Jets were busy in free agency, filling some of the many holes that marked the team's talent-needy roster. There are still plenty more to plug. With the No. 11 overall pick in the NFL draft, the Jets will have the opportunity to add an impact player early. (AP Photo/Michael Conroy, File)\nNEW YORK (AP) — Joe Douglas and the New York Jets were busy in free agency, filling some of the many holes that marked the team’s talent-needy roster.\nThere are still plenty more to plug.\nWith the No. 11 overall pick in the NFL draft, the Jets will have the opportunity to add an impact player early.\n“We’re going to look at multiple positions throughout the rest of free agency and the draft,” Douglas said, “and if there’s an opportunity for us to upgrade, I think we have the flexibility to do it.”\nEither an offensive lineman or wide receiver would be the likely choice with New York’s first pick this year. And it all depends, of course, on who’s still on the board.\nDouglas’ goal entering the offseason was to improve the offensive line and add playmakers. The GM recently revealed to reporters he promised quarterback Sam Darnold’s parents last summer that he’d help aid their son’s progress by focusing on those areas. He started to fulfill that vow with some solid if not splashy moves in free agency.\nThe O-line has lots of new faces with the additions of center Connor McGovern, tackle George Fant and guards Greg Van Roten and Josh Andrews. Left guard Alex Lewis was re-signed after he began last season as a backup before moving into a starting role.\nThe Jets lost wide receiver Robby Anderson to Carolina, but Douglas quickly brought in a speedy replacement in Breshad Perriman.\nThey also revamped the cornerback spot by cutting starters Trumaine Johnson and Darryl Roberts, and signing veteran Pierre Desir to help bolster one of New York’s weakest spots.\nDouglas, in his first full offseason as GM, has a chance to make the Jets better — now and in the future — with eight scheduled draft picks, including four in the first three rounds. Here’s a look at what they might do:\nBIG BOYS UP FRONT\nThe Jets could have a completely different starting five on the offensive line than what they had in Week 1 of last season.\nFant is the likely left tackle, with Chuma Edoga in the running to start on the right side. But, Fant could be switched to the other side if any of the top tackles — Iowa’s Tristan Wirfs, Alabama’s Jedrick Wills, Georgia’s Andrew Thomas or Louisville’s Mekhi Becton — are still on the board at No. 11.\nAny of those four would be considered a key building block on an offensive line charged with helping keep Darnold upright. USC’s Austin Jackson could also be an option.\nTANTALIZING TARGETS\nThere will be quite a bit of intrigue for Douglas and the Jets if any of the top four tackles and any of the touted wide receivers are still there when New York goes on the clock.\nNew York lacks a true No. 1 receiver, with Perriman and Jamison Crowder the top two at the position — while Quincy Enunwa’s future remains uncertain as he continues to recover from his second neck injury in three seasons.\nSo, if Alabama’s Jerry Jeudy, Oklahoma’s CeeDee Lamb or Alabama’s Henry Ruggs III are on the board, Douglas will have to make the tough — and potentially franchise-changing — decision on who to take.\nSACK ATTACK\nJordan Jenkins, the Jets’ leader in sacks last season, was re-signed to a one-year deal, but New York still lacks a consistent offense-wrecking force from the edge.\nBut that has been the case for years, with the last consistently successful pass rusher drafted by the franchise being John Abraham in 2000.\nOhio State’s Chase Young will likely be long gone by the time the Jets pick, but LSU’s K’Lavon Chaisson — who projects as a game-changing outside linebacker after foregoing his final two college seasons — might still be available.\nCORNERING THE MARKET\nDesir insists he’s up to the challenge of being the Jets’ No. 1 cornerback and putting last year’s injury-plagued season with the Colts behind him. Who he’ll have joining him on the other side of the field remains to be seen.\nBless Austin was a sixth-rounder last year who showed promise and started six games after recovering from a knee injury that shortened his final year at Rutgers. Arthur Maulet also started six games and was re-signed. But, it’s uncertain if either is a long-term solution.\nThe Jets have two scheduled third-round picks, so they could try for a starting-caliber cornerback with one of them.\n—\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/b8a33ec3b47b5bef11981517e39580d3"}