{"authors": ["Washington Bureau Chief"], "date_download": "2020-05-04 20:26:13", "date_modify": "2020-05-04 20:26:13", "date_publish": "2020-04-28 20:12:40", "description": "They're not due to be released until long after the 2020 election.", "filename": "entry_joe-biden-senate-papers_n_5ea83f9ec5b6e55df8d86846_1588623973.html", "image_url": "https://img.huffingtonpost.com/asset/5ea840282200007b0c827cab.jpeg?cache=8kl1wktga6&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_joe-biden-senate-papers_n_5ea83f9ec5b6e55df8d86846_1588623973.html", "title": "Documents That Could Shed Light On Joe Biden Sexual Assault Allegation Remain Locked Up", "title_page": "Documents That Could Shed Light On Joe Biden Sexual Assault Allegation Remain Locked Up | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "In April 2019, the university changed its mind and pushed the date back even further. The website now states: “The records will be available no sooner than the later date of December 31, 2019, or two years after the donor retires from public life.”\nThe University of Delaware still considers Biden to be in “public life” while he is running for office.\nTherefore, documents that could help shed light on Biden’s extensive record in office ― including, potentially, the Reade matter ― are closed to the public.\nReade worked in Biden’s office, overseeing the interns, in 1993. She has alleged that while she was employed there, the senator pinned her to a wall and sexually assaulted her.\nReade filed a police report this month, reviewed by The New York Times, saying she was a victim of sexual assault in 1993. She does not name her assaulter. She also said she filed a complaint with a Senate personnel office, but she does not have a copy of the complaint and no record of it has been located.\nThe Biden campaign did not respond to a request for comment on whether it would support the University of Delaware releasing any documents regarding Reade, or other personnel records in 1993.\nAmerica Rising PAC, a GOP opposition research group, has a petition calling on Biden to “unseal his Senate papers.”\nReade has said she did complain about sexual harassment at the time to her supervisors, and that afterward, her job duties were scaled back. Two former interns who worked with Reade told The New York Times that they didn’t know anything about her allegations, but did remember that “she abruptly stopped supervising them in April, before the end of their internship.”\nBiden’s aides who worked with him at the time have disputed Reade’s account.\n“I never once witnessed, or heard of, or received, any reports of inappropriate conduct, period — not from Ms. Reade, not from anyone,” said Marianne Baker, Biden’s executive assistant, in a comment to The Associated Press. Baker is one of the staffers Reade said she turned to about the harassment.\nThe New York Times wrote that in its recent investigation of Reade’s allegation, no other accusation of sexual assault “surfaced in the course of reporting, nor did any former Biden staff members corroborate any details of Ms. Reade’s allegation. The Times found no pattern of sexual misconduct by Mr. Biden.”\nOn Monday, Business Insider published an interview with Lynda LaCasse, who lived next door to Reade in the mid-1990s and said she remembered hearing about the incident.\n“This happened, and I know it did because I remember talking about it,” she said.\nLast year, Reade and seven other women came forward and accused Biden of behaving toward them in ways that made them uncomfortable. But she did not make her assault allegation until March 25, in an interview on a podcast with writer Katie Halper.\n“Vice President Biden has dedicated his public life to changing the culture and the laws around violence against women,” Kate Bedingfield, communications director for Biden’s campaign, said earlier this month. “He authored and fought for the passage and reauthorization of the landmark Violence Against Women Act. He firmly believes that women have a right to be heard — and heard respectfully. Such claims should also be diligently reviewed by an independent press. What is clear about this claim: It is untrue. This absolutely did not happen.”\nUPDATE: MAY 1 ― Biden addressed the Reade allegations for the first time publicly during a May 1 interview with MSNBC’s Morning Joe. He said there are no personnel files in his papers at the University of Delaware, which is why he would not release them or authorize a search of her name in those files. If there is a complaint, he said, it would be with the National Archives, and he was asking the institution to release anything it had on the matter.\nThe National Archives, however, told HuffPost it had no such records: “Any records of Senate personnel complaints from 1993 would have remained under the control of the Senate. Accordingly, inquiries related to these records should be directed to the Senate.”\nCORRECTION: This piece originally stated that Reade filed a police report in 1993. She filed a police report in April 2020 about the alleged 1993 incident.", "url": "https://www.huffpost.com/entry/joe-biden-senate-papers_n_5ea83f9ec5b6e55df8d86846"}