{"authors": ["Natalie Shure", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Branko Marcetic", "Eric Blanc", "Connor Kilpatrick", "Bhaskar Sunkara", "Natasha Fernández-Silber"], "date_download": "2020-05-04 19:51:20", "date_modify": "2020-05-04 19:51:20", "date_publish": "2020-03-06 00:00:00", "description": null, "filename": "2020_03_why-elizabeth-warren-should-endorse-bernie-sanders_1588621880.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/06112048/GettyImages-1207412282.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_why-elizabeth-warren-should-endorse-bernie-sanders_1588621880.html", "title": "Why Elizabeth Warren Should Endorse Bernie Sanders", "title_page": "Why Elizabeth Warren Should Endorse Bernie Sanders", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Massachusetts senator Elizabeth Warren dropped out of the Democratic presidential primary on Thursday, joining former South Bend mayor Pete Buttigieg and Minnesota senator Amy Klobuchar as recent exits from the race.\nButtigieg and Klobuchar rapidly endorsed former Vice President Joe Biden and apparently inspired their supporters to fall in line, with Biden’s victories in ten states on Super Tuesday clearly buoyed by a consolidated moderate front. Warren has the capacity to reverse the centrists’ momentum. For the project of progressive change to have a fighting chance, she should immediately endorse Bernie Sanders — and urge her supporters to back the Vermont senator as well.\nOne of the most progressive Democrats in the Senate, Elizabeth Warren entered the political arena in the early aughts by picking a fight with Sanders’s sole remaining viable opponent. Joe Biden allied with credit card companies and Senate Republicans behind a bill to tighten eligibility requirements for personal bankruptcy, a move the then-law professor and consumer rights advocate fiercely opposed. This fight would become a crucial piece of Warren’s political origin story — she’s cited it as the episode that whet her appetite for an uphill populist fight, as well as what educated her about monied interests’ chokehold on the political system.\nDuring the financial crisis a few years later — which some researchers have found was worsened by fallout from the very bill Warren fought — the progressive law professor again went to bat for consumers against Wall Street, forming the Consumer Finance Protection Bureau in the process. The political DNA of these early battles was obvious in her presidential campaign, which advocated policies like a wealth tax, student debt relief, and universal childcare — all encapsulated within her call for “big structural change.”\nSanders and Warren, to be sure, come from different political traditions and harbor divergent visions: while Sanders sees bottom-up movements as the key driver of social change, Warren is keener on fighting for tough regulation and out-battling corporate-friendly policies from the inside. But that makes them both rare breeds within the modern Democratic Party, and certainly makes them natural allies within the current primary field.\nBoth correctly regard unfettered corporate power as oppressive and exploitative, and see it as their public duty to confront the worst actors. Both are clear-eyed about the financial sector’s role in beating down the working class over decades, and both have ruffled feathers by confronting Democrats’ complicity in its rise. Both are resentful of billionaires, with Warren’s evisceration of Michael Bloomberg — the ninth richest person on Earth — a highlight of the campaign season. And both take seriously the need to expand the dried-up welfare state, with Warren’s array of “plans” directly addressing major parts of it.\nUltimately, Warren’s campaign failed to thread the needle — by attempting to find a middle ground between Sanders’s platform and those of centrist Democrats, she won over neither side. But she did retain a sizable chunk of supporters, an enthusiastic core of whom are undeniably more passionate about their candidate’s goals than backers of the ostensibly pragmatic Joe Biden.\nThere’s still a campaign fighting for many of the things that made Warren so inspiring to her supporters. We can still confront the antidemocratic impact of extreme wealth, and we can still fight for humane childcare policies that allow women to lead autonomous lives. We can still fight poverty, and for better health outcomes for the marginalized and people of color. And we can still win perhaps the biggest fight of them all: blunting the power of fossil-fuel executives so we can build a sustainable and equitable future.\nBy endorsing Sanders and partnering with the movement beside him, Elizabeth Warren can play a critical role in the fight for many of the things she’s spent her career on. She can either cement her legacy as one of her generation’s most formidable opponents of oligarchy, or taint it by shying away from the fight that needed her most.\nJoe Biden will not fight for big structural change. He does not want big structural change. He played no small role in entrenching decades of neoliberalism that we need big structural change to escape. For Warren and her progressive supporters, Bernie Sanders offers not just a retreat from Trumpism, but an alternate path forward. It’s time to keep dreaming big, and fighting hard for it.", "url": "https://www.jacobinmag.com/2020/03/why-elizabeth-warren-should-endorse-bernie-sanders"}