{"authors": ["Katelyn Polantz"], "date_download": "2020-05-04 17:02:50", "date_modify": "2020-05-04 17:02:50", "date_publish": "2020-04-10 19:00:34", "description": "The Justice Department discovered last year the FBI made two material errors in foreign intelligence wiretap applications, and also omitted significant information from another surveillance warrant renewal, federal law enforcement disclosed publicly this week.", "filename": "2020_04_10_politics_fisa-applications-justice-department_index_1588611770.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/151021174029-fbi-seal-logo-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_fisa-applications-justice-department_index_1588611770.html", "title": "Justice Department says it found mistakes in more FISA applications", "title_page": "Justice Department says it found mistakes in more FISA applications - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The Justice Department discovered last year the FBI made two material errors in foreign intelligence wiretap applications, and also omitted significant information from another surveillance warrant renewal, federal law enforcement disclosed publicly this week.\nEven with the errors, there was enough probable cause to still surveil suspected foreign agents, the DOJ wrote in a recent redacted court filing to the Foreign Intelligence Surveillance Court.\nExecutive branch attorneys had told the court about the errors and omissions previously, the department disclosed.\nThe new public disclosures amount to another black eye on the FBI and its use of wiretaps in foreign intelligence investigations as it faces increased scrutiny for sloppiness, including during its efforts to surveil former Trump campaign adviser Carter Page in late 2016 and 2017.\nThe disclosure of more problems with foreign intelligence surveillance efforts came tucked deep in a 54-page filing the DOJ made to the court on April 3, explaining steps to stamp out possible mishaps. The department released the court filing this week with redactions, not saying anything more about its national security targets.\nRead More", "url": "https://www.cnn.com/2020/04/10/politics/fisa-applications-justice-department/index.html"}