{"authors": [], "date_download": "2020-05-04 20:25:50", "date_modify": "2020-05-04 20:25:50", "date_publish": "2020-04-29 23:12:11", "description": "The FAA is looking into the actor’s incident after he lost control of a small plane Friday. He crossed the runway after mishearing an instruction from ai...", "filename": "entry_harrison-ford-investigation-plane-crossed-runway_n_5eaa0749c5b6edf4130dd625_1588623950.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa08642500003b11eb096a.jpeg?cache=idtkprapos&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_harrison-ford-investigation-plane-crossed-runway_n_5eaa0749c5b6edf4130dd625_1588623950.html", "title": "Harrison Ford Investigated After Piloting Plane That Wrongly Crossed Runway", "title_page": "Harrison Ford Investigated After Piloting Plane That Wrongly Crossed Runway | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "HAWTHORNE, Calif. (AP) — Harrison Ford was piloting a plane that wrongly crossed a runway where another plane was landing, and federal authorities are investigating, officials and a representative for the actor said Wednesday.\nFord was at the controls of a small plane Friday at Hawthorne Airport in the Los Angeles area when, according to a statement released by Ford’s publicist, he crossed the runway after mishearing an instruction from air traffic control.\n“He immediately acknowledged the mistake and apologized to ATC for the error,” according to the statement from publicist Ina Treciokas. ”No one was injured and there was never any danger of a collision.”\nWithout naming Ford, the Federal Aviation Administration said in its own statement that a two-seat Aviat Husky plane crossed the runway while another aircraft was performing a touch-and-go landing.\nThe other plane was just over a half-mile away, according to the FAA.\nFord’s statement says the purpose of his flight was “to maintain currency and proficiency in the aircraft.”\nThe 77-year-old who played Han Solo and Indiana Jones is a frequent flier of planes and helicopters and generally has a good record as an aviator, but has had several close calls over the years.\nMost recently he flew low over an airliner with 116 people aboard moments before mistakenly landing on a taxiway at another Southern California airport in 2017.\nIn 2015, he was injured when he crashed his World War II-era plane on a Los Angeles golf course after engine failure. Federal investigators found that Ford was not at fault for the crash.", "url": "https://www.huffpost.com/entry/harrison-ford-investigation-plane-crossed-runway_n_5eaa0749c5b6edf4130dd625"}