{"authors": ["David Blank"], "date_download": "2020-05-04 16:54:12", "date_modify": "2020-05-04 16:54:12", "date_publish": "2020-04-08 19:06:09", "description": "Twenty years after ABC's \"Who Wants to Be a Millionaire\" with Regis Philbin introduced \"phone-a-friend\" into the American lexicon, the television quiz show returns Wednesday night with a new host and celebrity contestants.", "filename": "2020_04_08_entertainment_wh_b6081177d76e274dda59f79b51d9fc4f_index_1588611252.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408121335-who-wants-to-be-a-millionaire-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_entertainment_wh_b6081177d76e274dda59f79b51d9fc4f_index_1588611252.html", "title": "Here are the celebs who will compete for charity on who wants to be a millionaire", "title_page": "Here are the celebs who will compete for charity on who wants to be a millionaire  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Twenty years after ABC's \"Who Wants to Be a Millionaire\" with Regis Philbin introduced \"phone-a-friend\" into the American lexicon, the television quiz show returns tonight with a new host and celebrity contestants.\nLate-night talk show host Jimmy Kimmel will star in the special anniversary edition, asking questions to other celebrities with winnings going to the charity of their choice.\nCelebrities will be the contestants on the 'Who Wants to Be a Millionaire' reboot.\nKimmel will be sure to crack jokes with the stars as he tests their trivia knowledge. He didn't wait for the show to air: In a statement Kimmel said Philbin came to him in a dream and asked him to do the show with the promise of his own necktie collection.\n\"I had little choice but to say yes,\" Kimmel said.\nJimmy Kimmel is hosting the 20th anniversary celebrity episodes of 'Who Wants to Be a Millionaire.'\nThe show's comeback consists of eight hour long prime time episodes.\nRead More", "url": "https://www.cnn.com/2020/04/08/entertainment/who-wants-to-be-millionaire-2020-premiere-trnd/index.html"}