{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:10:10", "date_modify": "2020-05-04 20:10:10", "date_publish": "2020-03-24 17:28:23", "description": "April 2 1939 — Ralph Guldahl beats Sam Snead by one stroke to capture the Masters. 1983 — New York Islander Mike Bossy becomes the first player to score 60 or more goals in three...", "filename": "_5dcc4140577443bc99285c7bac625cd6_1588623010.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5dcc4140577443bc99285c7bac625cd6_1588623010.html", "title": "AP Sportlight", "title_page": "AP Sportlight", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "April 2\n1939 — Ralph Guldahl beats Sam Snead by one stroke to capture the Masters.\n1983 — New York Islander Mike Bossy becomes the first player to score 60 or more goals in three cosecutive seasons.\n1984 — Georgetown, led by junior center Patrick Ewing and freshman forward Reggie Williams, beats Houston 84-75 to win the NCAA championship in Seattle.\n1986 — The 3-point field goal, at 19 feet, 9 inches, is adopted by the NCAA.\n1990 — UNLV pounds Duke 103-73 to win its first NCAA championship and extend the Blue Devils’ streak to eight Final Four appearances without a title. The Runnin’ Rebels become the first team to score more than 100 points in a championship game and the 30-point margin is the largest ever.\n1995 — Connecticut caps an unbeaten season by defeating Tennessee 70-64 for the NCAA women’s championship. The Huskies, 35-0, become the winningest basketball team for one season in Division I.\n2000 — Connecticut wins its second women’s national championship with a 71-52 victory over Tennessee. The top-ranked Huskies beat No. 2 Tennessee for the second time in three meetings this season.\n2005 — Roger Powell Jr. and Luther Head score 20 points apiece leading Illinois to a 72-57 win over Louisville in semifinals of the Final Four. With the win, the Illini (37-1) ties the single-season NCAA record for victories.\n2007 — The Florida Gators keep their stranglehold on the college basketball world with an 84-75 victory over Ohio State for their second straight national championship.\n2012 — Doron Lamb scores 22 points as Kentucky wins its eighth men’s national championship, holding off Kansas for a 67-59 victory.\n2014 — The Sacramento Kings beat the Los Angeles Lakers 107-102 to give the Lakers their 50th loss of the season. The last time the Lakers had 50 or more losses was 1974-75 (30-52).\n2016 — Villanova advances to the national championship game with the biggest margin of victory in Final Four history, overwhelming Oklahoma 95-51. The margin topped 34-point Final Four wins by Cincinnati over Oregon State in 1962 and Michigan State over Penn in 1979.\n2017 — So Yeon Ryu wins the ANA Inspiration in a one-hole playoff with Lexi Thompson, who was given a four-stroke penalty late in the final round for an incorrect ball placement a day earlier. Ryu birdies the 18th hole in the playoff to win her second major title.\n2017 — A’ja Wilson scores 23 points to help coach Dawn Staley and South Carolina win their first women’s national championship with a 67-55 victory over Mississippi State. Staley made the Final Four three times as a player at Virginia but never won. She also led the Gamecocks to the national semifinals two years ago before losing to Notre Dame.\nApril 3\n1930 — The Montreal Canadiens win the NHL Stanley Cup with a two-game sweep of the Boston Bruins.\n1933 — Ken Doraty’s overtime goal gives the Toronto Maple Leafs and 1-0 victory over the Boston Bruins in semifinals of the Stanley Cup playoffs. The goal comes at one hour, 44 minutes and 46 second of the overtime beyond the one-hour regulation game.\n1977 — Jean Ratelle of the Boston Bruins scores his 1,000th point with an assist in a 7-4 triumph over the Toronto Maple Leafs.\n1982 — Buffalo’s Gil Perrault scores his 1,000th point with an assist in a 5-4 victory over the Montreal Canadiens.\n1988 — Louisiana Tech wins the NCAA women’s basketball championship with a 56-54 come-from-behind victory over Auburn.\n1988 — Amy Alcott shoots a 1-under 71 to win the Dinah Shore by two shots over Colleen Walker.\n1989 — Michigan beats Seton Hall 80-79 in overtime to win the NCAA basketball championship. Rumeal Robinson hits two free throws with 3 seconds left for the Wolverines.\n1993 — For the first time in its 157-year history, the Grand National steeplechase is declared void because of a false start. Esha Ness crosses the line first, but most of the jockeys are unaware a false start is called and the majority of the 39-horse field continue the 4½-mile race around the Aintree course even though nine stay behind at the start line.\n1993 — Jim Montgomery’s three goals in the third period carry Maine to a 5-4 comeback win over Lake Superior State for the NCAA hockey title.\n1994 — Charlotte Smith’s 3-pointer at the buzzer gives North Carolina a 60-59 victory over Louisiana Tech in the NCAA women’s basketball championship game.\n1994 — The St. Louis Cardinals beat the Cincinnati Reds 6-4 in Major League Baseball’s first Sunday night opener, sending baseball into a new era with three divisions and a new playoff format.\n1995 — UCLA wins its first national basketball championship in 20 years and record 11th NCAA title, keeping Arkansas from repeating with an 89-78 victory.\n2002 — Utah sets an NBA record by clinching its 17th straight winning season after defeating the Los Angeles Clippers 99-87.\n2004 — St. Louis clinches its 25th consecutive NHL playoff berth, the longest in major league sports, with a 4-1 win over Nashville.\n2006 — Joakim Noah dominates UCLA with 16 points, nine rebounds and a record seven blocks to key a 73-57 blowout for Florida’s first national title in men’s basketball.\n2007 — After a nine-year title drought, Tennessee and coach Pat Summitt are NCAA champions. The Lady Vols capture an elusive seventh national title, beating Rutgers 59-46.\n2008 — Jamar Butler scores 19 points and hands out eight assists in his final college game, leading Ohio State to a 92-85 win over Massachusetts for the National Invitation Tournament title.\n2008 — Alex Ovechkin breaks Luc Robitaille’s single-season NHL record for most goals by a left wing with his 64th and 65th scores to lead Washington to a 4-1 victory over Tampa Bay.\n2010 — David Haye mounts a successful first defense of his WBA heavyweight title after punishing John Ruiz for nine rounds in Manchester, England.\n2010 — Bernard Hopkins wins a brutal unanimous decision over Roy Jones Jr. in their long-delayed rematch, emphatically avenging his loss in the famed champions’ first fight nearly 17 years earlier.\n2011 — Stacy Lewis holds off defending champion Yani Tseng to win the Kraft Nabisco Championship by three strokes, earning her first LPGA Tour title in the year’s first major. Lewis shoots a 3-under 69 to finish at 13-under 275.\n2011 — Texas A&M upsets its second straight top-seeded team in the NCAA women’s tournament to advance to its first national championship game. Tyra White drives the length of the court to give Texas A&M the go-ahead layup and a 63-62 victory over Stanford. Skylar Diggins scores 28 points and Notre Dame upsets Connecticut 72-63, ending the brilliant career of Maya Moore and the Huskies’ quest for a third straight national championship.\n2012 — Brittney Griner scores 26 points and grabs 13 rebounds to help Baylor finish off an undefeated season with an 80-61 win over Notre Dame in the women’s national championship game. Baylor becomes the first team in NCAA history to win 40 games.\nApril 4\n1937 — Byron Nelson shoots a 283 to win the Masters by two strokes over Ralph Guldahl.\n1938 — Henry Picard beats Ralph Guldahl and Harry Cooper by two strokes to capture the Masters.\n1983 — Lorenzo Charles scores on a dunk after Derek Whittenburg’s 35-foot desperation shot falls short to give North Carolina State a 54-52 triumph over Houston in the NCAA championship.\n1986 — Edmonton’s Wayne Gretzky breaks his NHL season points record with three assists to increase his total to 214. He scored 212 points in 1981-82.\n1987 — New York’s Denis Potvin, the highest-scoring defenseman in NHL history, scores his 1,000th point.\n1988 — Danny Manning scores 31 points and grabs 18 rebounds as Kansas wins its second NCAA championship with an 83-79 victory over Oklahoma.\n1993 — Sheryl Swoopes shatters the women’s championship game record by scoring 47 points to lead Texas Tech to an 84-82 victory over Ohio State.\n1993 — Mario Andretti, at 53, wins the Valvoline 200 in Phoenix to become the oldest driver to win an Indy car race and the first driver to win a race in four different decades.\n1994 — Arkansas wins its first men’s national championship with a 76-72 victory over Duke, depriving the Blue Devils of a third title in four years.\n1998 — Mark McGwire ties Willie Mays’ National League record by hitting a home run in each of his first four games. McGwire launches a towering three-run shot in the sixth inning of an 8-6 victory over the San Diego\n2001 — Hideo Nomo becomes the fourth pitcher in major league history to throw a no-hitter in both leagues in Boston’s 3-0 victory over Baltimore. The others are Cy Young, Jim Bunning and Nolan Ryan.\n2003 — Toronto’s Lenny Wilkens sets the NBA record for most career losses when the Raptors lose to the Spurs 124-98. Wilkens, in his 30th year as an NBA coach, was already the winningest coach in league history with 1,292 victories.\n2003 — Sammy Sosa of the Chicago Cubs becomes the 18th player to hit 500 career homers, connecting for a solo shot in a 10-9 loss to Cincinnati.\n2005 — Dmitri Young becomes the third player to hit three homers on opening day to lead Detroit over the Kansas City Royals 11-2.\n2005 — North Carolina defeats Illinois to win the NCAA Division I men’s basketball championship. Sean May has 26 points and the Tar Heels don’t allow a basket over the final 2 1/2 minutes to defeat Illinois 75-70.\n2010 — Yani Tseng shoots a 4-under 68 to win the Kraft Nabisco Championship for her second major title. Tseng, of Taiwan, finishes at 13-under 275 at Mission Hills to hold off Suzann Pettersen by one stroke.\n2011 — Kemba Walker scores 16 points and Alex Oriakhi has 11 points, 11 rebounds and four blocks to lead Connecticut to a 53-41 win over Butler in the NCAA championship game. UConn coach Jim Calhoun wins his third national championship, something only four other coaches have done.\n2013 — Pierre Jackson has his fourth straight double-double with 17 points and 10 assists to lead Baylor to its first NIT title with a 74-54 win over Iowa.\nApril 5\n1915 — Jess Willard beats Jack Johnson in the 26th round to win the world heavyweight boxing title in Havana, Cuba.\n1927 — Johnny Weissmuller breaks his own 200-meter freestyle record by seven seconds in 2:08. He also lowers his own record in the 100-yard freestyle to 51 seconds, a record that stood for 17 years.\n1959 — Art Wall birdies five of the last six holes to cap a final-round 66 and edge Fred Hawkins by one stroke to win the Masters.\n1967 — Wilt Chamberlain sets an NBA record with 41 rebounds to lead the Philadelphia 76ers to a 115-104 victory over the Boston Celtics and a 3-0 lead in the Eastern Division playoffs.\n1970 — New York beat Detroit 9-5 to take fourth place and the final playoff berth in the NHL’s East Division. The Rangers, with 246 goals, become the first team in NHL history to advance to the playoffs on the basis of goals scored when they finish in a tie with Montreal at 92 points and 38 wins. The Canadiens, who lose to Chicago 10-2 in a night game, finishes with 244 goals.\n1972 — For the first time in history, major league baseball fails to open because of a general player strike, which started April 1 and would be settled April 13.\n1984 — Kareem Abdul-Jabbar hits a sky hook with 8:53 left to play in the Los Angeles Lakers’ 129-115 victory over the Utah Jazz to become the NBA’s top career scorer. Wilt Chamberlain, with 31,419 points, held the record since his retirement in 1973.\n1993 — Donald Williams scores 25 points to lead North Carolina to a 77-71 win over Michigan in the NCAA championship.\n1997 — Bruce Baumgartner wins a record eighth World Cup wrestling gold medal, beating David Musolbes 2-1 in overtime at 275 1/2 pounds as the United States routs Russia 25-7.\n2004 — Led by 24 points from Emeka Okafor and 21 from Ben Gordon, the Connecticut Huskies outclass Georgia Tech 82-73 to win the men’s national championship.\n2008 — The Boston Celtics sets an NBA record for biggest single-season turnaround with a 101-78 win over the Charlotte Bobcats. The Celtics improve to 61-15, 37 more wins than last season.\n2009 — Brittany Lincicome sinks a 6-foot eagle putt on No. 18 to win the Kraft Nabisco Championship, capturing her first victory in a major.\n2010 — Duke wins its fourth national men’s basketball championship holding off Butler 61-59 and surviving Gordon Hayward’s last second desperation shot that clangs off the rim.\n2011 — Danielle Adams scores 22 of her 30 points in a dominating second half to help Texas A&M win its first NCAA women’s basketball championship with a thrilling 76-70 victory over Notre Dame.\n2016 — UConn wins an unprecedented fourth straight women’s national championship, capping another perfect season by routing Syracuse 82-51. Geno Auriemma passes UCLA’s John Wooden with his 11th national title and a sixth undefeated season.\n2017 — Golden State holds off Phoenix 120-111 for their season-high 13th straight win, clinching the best record in the NBA for the third straight season. The Warriors are the first team have the NBA’s best record for three consecutive seasons since the Boston Celtics did it in 1983-84, ’84-‘85 and ‘85-’86. The Warriors also are the first team to win at least 65 games in three straight seasons.\nEND ADV", "url": "https://apnews.com/5dcc4140577443bc99285c7bac625cd6"}