{"authors": [], "date_download": "2020-05-04 16:53:55", "date_modify": "2020-05-04 16:53:55", "date_publish": "2020-04-08 18:01:15", "description": "As school districts across the country shut down, some for the rest of the school year, a lot of them have switched to some form of remote learning. With online teaching, kids are still able to interact with their teachers and fellow students while they learn. Schools are relying on services like Google Classroom or i-Ready to facilitate assignments and provide feedback on classwork.", "filename": "2020_04_08_cnn-underscored__b76bbc95894a7615a3836b70b12076c2_index_1588611235.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408123612-underscored-remote-learning-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_cnn-underscored__b76bbc95894a7615a3836b70b12076c2_index_1588611235.html", "title": "E-learning: Best chromebooks, tablets and devices for remote education", "title_page": "E-learning: Best chromebooks, tablets and devices for remote education - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "As school districts across the country shut down, some for the rest of the school year, a lot of them have switched to some form of remote learning. With online teaching, kids are still able to interact with their teachers and fellow students while they learn. Schools are relying on services like Google Classroom or i-Ready to facilitate assignments and provide feedback on classwork.\nOf course, remote learning requires some form of computer in order to participate. But that doesn't mean every parent should rush out and buy the latest MacBook Air or a fancy Windows laptop. While those are most definitely excellent tools for the job, they're expensive, and they're really not necessary.\nWe've rounded up some tablets and Chromebooks that will help keep your kids' education going, without putting too much strain on your checking account. We picked the following devices based on personal experience, prior testing and, in some cases like with the HP Chromebook 11, based on price and availability. We've also included the Raspberry Pi as an option. The small circuit board is a full computer and one of the cheapest setups we can think of (we're talking potentially under $100), but it'll take a bit of effort on your part to make it all work.\nLet's dive in.\nTablets\nApple 10.2-inch iPad ($329, amazon.com or bhphotovideo.com)\nApple's base iPad is more than powerful enough for your kids' schoolwork. With the recent addition of mouse and trackpad support to iPadOS, the $329 tablet can be paired with a keyboard to convert it into a miniature computer.\nSamsung Galaxy Tab A 9 ($149.99, samsung.com)\nWith an 8-inch display, the Tab A doesn't have the biggest screen real estate, but it will get the job done. It runs Android, giving you access to education apps in the Play Store. You can use a micro SD card to expand its storage beyond the included 32GB. Currently priced at $149.99, the Galaxy Tab A is a good deal for someone who needs a device for remote learning.\nSamsung Galaxy Tab A 10.1 ($229.99, samsung.com)\nFor a little more, you can get a larger display in the Galaxy Tab A 10.1. With a 10.1-inch screen, your child will have more room to work and not feel as cramped. Again, you're able to expand the base 32GB of storage via a microSD card, should you need extra space. With access to the Play Store and the Chrome browser, you should have access to most remote learning services and apps. Buy the Galaxy Tab A 10.1 for $229.99.\nChromebooks\nGoogle's Chromebooks aren't full-fledged computers, but they're close. You get access to Google's Chrome browser and the Android app catalog in the Play Store. So yes, you should be able to access a majority of the e-learning solutions on the Chromebook. Better yet, Chromebooks aren't all that expensive. Here are some of our recommendations:\nSamsung Chromebook 4+ ($299, bestbuy.com)\nSamsungs's Chromebook 4+ has a 15.6-inch display and is powered by an Intel Celeron processor. It has 32GB of storage built in, with 4GB of memory, and a dedicated micro SD card reader. There's also a built-in webcam for Zoom calls or class meetings, and it costs just $299 from Best Buy.\nHP Chromebook 11 ($199.99, newegg.com)\nFor just under $200, you can get the HP Chromebook 11 from Newegg. It's surely not the fastest or most capable Chromebook you can find, but it is affordably priced. For $200, you get a Chromebook with 4GB of memory, 16GB of storage, powered by a dual-core processor. It has an 11.6-inch screen and an HDMI port so you can connect it to your TV. Order the HP Chromebook 11 for $199.99 on Newegg.\nRaspberry Pi\nIt doesn't look like much, but the Raspberry Pi is a small computer that's only slightly larger than a deck of playing cards. The benefit of a Raspberry Pi is that it's inexpensive, but powerful enough to run a full web browser so your kid(s) can access education services like Google Classroom.\nBuying a Raspberry Pi is more involved than buying an off-the-shelf tablet or Chromebook. But don't let that intimidate you. View it as a learning experience for you and your child.\nYou can buy the boards on their own, but you'll also need a micro SD card and a power supply, and we strongly recommend putting it in a case.\nThe Raspberry Pi 4 is the latest version, but that also means it can be the most expensive. Pricing starts at $35 for 2GB of memory and tops out at $55 for 4GB of memory.\nYou can buy a Raspberry Pi 4 Desktop kit, which includes everything you need, including the proper cables, power supply, keyboard and mouse, for $120. Even so, still pretty affordable when compared with a Chromebook.\nIf you put a Pi 4 build together yourself, keep in mind that you'll need a micro HDMI-to-HDMI cable or adapter in order to connect it to your TV.\nThe $35 Raspberry Pi 3B+ is more affordable. Its performance won't be as fast as the Pi 4, but it's more than adequate for completing classwork.\nAnd, as an added bonus, the 3B+ uses a standard HDMI connector, allowing you to connect it to a monitor or the TV in your living room using a cable you likely already own. This CanaKit 3B+ starter kit includes everything you need, including a micro SD card and a setup guide, for $84.99.\nYou'll also need a keyboard and mouse, but any USB model will work. If you have an older keyboard and mouse tucked away in a closet, now's the time to dig them out. Otherwise, you can find an inexpensive combo pack like this Logitech Desktop MK120 combo for $15.99.\nJust as the purchase process for the Raspberry Pi is more involved than a regular computer, so too is the initial setup. If you buy a kit that comes with a micro SD card with NOOBS installed, you only need to put the card in the Pi, connect a display, keyboard, and mouse to it, then power it up and follow the prompts. You'll want to install Raspbian Buster with Desktop when prompted.\nHowever, if you piece a build together, you'll need to install the operating system on the micro SD card using your own computer. The process is simple: Download and run the Raspberry Pi Imager on your computer. It will ask you to select the memory card you want to use, and the operating system, which is Raspbian Buster with Desktop.\nOnce it's finished, you can put the microSD card into the Raspberry Pi and turn it on. Follow the prompts to finish setting it up.\nAnd yes, any old monitor that can connect to the Pi will work. We'd recommend checking out Amazon.com or Staples for a decent size (19-inches to 24-inches) affordable display.\nLet's Recap\nIf one thing is clear, it should be that you don't need to drop hundreds or thousands of dollars to power the e-learning experience. A tablet and a Chromebook are two capable alternatives that will easily get the job done. And while a Raspberry Pi might seem a little daunting, it can be a rewarding setup experience for you and your student.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/08/cnn-underscored/e-learning-best-chromebooks-tablets-devices/index.html"}