{"authors": [], "date_download": "2020-05-04 16:16:54", "date_modify": "2020-05-04 16:16:54", "date_publish": "2020-04-03 21:01:00", "description": "The world of coding is full of awesome and lucrative possibilities, not the least of which is web development and database management. If you're looking to dive right in or up your existing skills, The 2020 Learn to Code Full Stack Developer Certification Bundle is the right place to look.", "filename": "2020_04_03_cnn-underscored_learn-to-code-bundle-review_index_1588609014.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403114115-5-underscored-learn-to-code-bundle-review-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored_learn-to-code-bundle-review_index_1588609014.html", "title": "Bolster your skills or start out fresh with this coding bundle", "title_page": "2020 Learn to Code Full Stack Developer Certification Bundle Review - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "The world of coding is full of awesome and lucrative possibilities, not the least of which is web development and database management. If you're looking to dive right in or up your existing skills, The 2020 Learn to Code Full Stack Developer Certification Bundle is the right place to look.\nThis nine-course bundle is priced at $38.99 on stacksocial.com and includes courses that cover C#, Python, a variety of SQL services, HTML, PHP and Angular. If these names don't mean much to you, don't worry. Courses with beginners in mind do a good job of explaining how the language is used before getting into the nitty gritty. And with over 50 hours of content, there is something for everybody. We especially appreciate that most of these courses start with an outline of what the instructor plans to cover.\nCheck out what we thought after our hands-on experience with this comprehensive coding bundle.\nHere's how these courses work\nMost of the lessons in this bundle are geared toward beginners and near-beginners. Instructors start things slow, showing you the ropes of programs, including how to install them. Once you've gotten your feet wet, lessons will build on each other toward more advanced ones. Along the way, you can skip forward and back to any lesson you like, and listen to them however many times you need. Even better, once you purchase this course, it's yours for life. You'll be able to access its contents 24/7 from any device capable of streaming.\nHTML Programming for Everyone\nThis course is led by John Elder, a web developer who runs codemy.com. He introduces HTML and distinguishes it as a markup language rather than a programming language. It's essentially a series of tags that affect the information within them, tags that you must learn to master HTML. At the same time, he recommends free programs such as Sublime Text, which is used to write HTML.\nOnce everything is set up, you can start writing code. Elder keeps things simple at first, explaining in more detail why tags are important. He also shows you how your site would look without them (spoiler: far less organized). You'll learn a number of common tags by example, such as paragraphs, links, images and tables. These are vital tools for adding content to a website and keeping things organized. Eventually, you'll start using tags to affect content on the site, not just display it. For example, you can use additional text in an image tag to change an image's dimensions. And while Elder doesn't always explain the purpose of his coding, he teaches strongly by example. Any time he changes the code, he shows you the effect it has on the website.\nThe final lessons cover the basics of CSS. If HTML is the core of a site's code, CSS is the style. He doesn't set out to teach it, but rather shows you the main methods for applying CSS. The most useful way of doing so is using Bootstrap. After Elder walks you through the installation of this free program, he covers how to apply essential website elements, such as a navigation bar or a jumbotron.\nLearn C# by Building Applications\nFor this one, you'll be instructed by Avetis Ghukasyan, a web developer. The first lessons are dedicated to explaining what you'll learn throughout the course. If you look to the sidebar with the list of lessons, the course takes you through the process of building C# applications. Ghukasyan does a great job at outlining this, as well as helping you find the right mindset. You shouldn't be afraid of being confused at first, as this is part of the learning process. After these introductions, he'll help you install Visual Studio Community 2019, a free coding program.\nGhukasyan starts each course with the step everyone should take: planning. He presents a concept called acceptance criteria. These are the preestablished standards a project or product must meet, defined by a client or employer. Each application has its own acceptance criteria, and Ghukasyan emphasizes the importance of clarifying its parameters by asking questions. He also places importance on planning through the use of flowcharts, which we found especially helpful.\nFinally, the coding begins. The course covers simple versions of these applications: a calculator, word unscrambler, web scraper and sudoku solver. Like other Stack instructors, Ghukasyan starts with the basics. In this case, they're functions like expressions, conditional statements, objects and much more. He does a great job of laying out the code he uses and its results, explaining that there are multiple paths to most solutions. As you move to other applications, the learning structure stays the same, but you'll build on previous lessons to learn more advanced functions and programming skills. We were impressed with his explanations of concepts and his organization — you will have a lot to learn from this instructor. And when things get confusing, you can always click or tap a previous lesson for a refresher.\nUsing MySQL Databases with Python\nDuring this course, you'll once again be under Elder's tutelage. Since you'll be working with databases, he starts by explaining a database. His conclusion is that it's essentially a big fancy spreadsheet,. After this and introduction on what he plans to cover, he goes over the downloading/installation of three free programs: Python, MySQL Connector and Git Bash. The first program is a coding language, the second connects the code to the database manager and the third is a simple program for running terminal commands.\nNext comes the coding, where Elder shows you how to create a database and connect your Python script to it. He also explains the SQL interface, which you won't interact with as much. From here, he'll systematically introduce and exemplify methods to add data to and pull data from your database. Then you will learn how to create reports that are readable and useful. We wish he would have provided more in-depth explanations of everything he was typing into Python, but he compensates for this by frequently displaying the results of the changes he makes.\nBottom line\nIt's no doubt that web development and database management are in-demand skills. After our hands-on with this developer certification bundle, we can safely say it's a great place to learn a host of coding languages. Even if you have experience, you'll find new tricks from these awesome instructors.\nAccess The 2020 Learn to Code Full Stack Developer Certification Bundle for life ($38.99; stacksocial.com) and see how far you can take your skills.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/learn-to-code-bundle-review/index.html"}