{"authors": [], "date_download": "2020-05-04 20:29:03", "date_modify": "2020-05-04 20:29:03", "date_publish": "2020-04-30 12:29:12", "description": "The ruling against former U.S. Olympic coach Maggie Haney came after two months of hearings.", "filename": "entry_maggie-haney-gymnastics-suspended_n_5eaac2afc5b633a854461263_1588624143.html", "image_url": "https://img.huffingtonpost.com/asset/5eaac3a8220000700d827eb2.jpeg?cache=9myjqm8cpq&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_maggie-haney-gymnastics-suspended_n_5eaac2afc5b633a854461263_1588624143.html", "title": "Elite Gymnastics Coach Suspended 8 Years For Verbal, Emotional Abuse Of Athletes", "title_page": "Elite Gymnastics Coach Suspended 8 Years For Verbal, Emotional Abuse Of Athletes | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "LUIS ROBAYO via Getty Images US Riley McCusker (L) is hugged by her coach Maggie Haney during the Lima 2019 Pan-American Games in Lima, on July 30, 2019.\nFormer U.S. Olympic coach Maggie Haney has been suspended for eight years by USA Gymnastics for verbal and emotional abuse of athletes.\nUSA Gymnastics confirmed the penalty in a statement Wednesday.\nThe decision came after two months of hearings that included Olympic champion Laurie Hernandez testifying against her longtime coach and world champion Riley McCusker writing a letter critical of Haney.\n“The independent hearing panel ― comprised of three members of the gymnastics community, including an attorney, a club owner, and a former national team athlete ― found that Ms. Haney violated the USA Gymnastics Code of Ethical Conduct, Safe Sport Policy, and other policies,” USA Gymnastics said in the statement.\nHaney is suspended from membership and any coaching of USA Gymnastics athletes or in member clubs for eight years, effective immediately, followed by a two-year probationary period. After the suspension concludes, USA Gymnastics said Haney may reapply for membership after submitting proof of completing certain specified Safe Sport courses.”\n“The ruling is regrettable but in no way surprising considering the heavy-handed nature of the investigative and hearing process,” Russell Prince, Haney’s attorney, told the Southern California News Group. “There is no fundamental fairness to the manner in which these matters are resolved. Clearly, I would anticipate an arbitration.”\nThe 42-year-old Haney coached Hernandez and McCusker at MG Elite Gymnastics in Monmouth Junction, New Jersey.", "url": "https://www.huffpost.com/entry/maggie-haney-gymnastics-suspended_n_5eaac2afc5b633a854461263"}