{"authors": ["Veronica Stracqualursi", "Kelly Mena"], "date_download": "2020-05-04 17:01:13", "date_modify": "2020-05-04 17:01:13", "date_publish": "2020-04-10 12:04:53", "description": "A legal challenge against a Florida law that requires former felons to pay back all legal financial obligations before they vote is now a class action lawsuit.", "filename": "2020_04_10_politics_amendme_94e7e70ddb8b9599d1f7a79c3190c577_index_1588611673.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/180124145119-florida-voting-booths-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_amendme_94e7e70ddb8b9599d1f7a79c3190c577_index_1588611673.html", "title": "Florida felons voting right case is now a class action lawsuit", "title_page": "Florida felons voting right case is now a class action lawsuit - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A legal challenge against a Florida law that requires former felons to pay back all legal financial obligations before they vote is now a class action lawsuit.\nOn Tuesday, the federal judge overseeing the case granted class certification to the lawsuit, paving the way for any final decision issued, following a trial in late April, to apply not just to the original 17 plaintiffs but to all Florida felons.\nUS District Court Judge Robert Hinkle's final ruling would extend to over 430,000 felons who would be eligible to vote but for unpaid financial obligations.\nConvicted felons in Florida had their voting rights restored with a constitutional amendment passed in November 2018.\nAfter Amendment 4 went into effect in January 2019, the GOP-led Florida legislature passed a bill that clarified all terms of sentence to include legal financial obligations such as fines, fees and restitution.\nRead More", "url": "https://www.cnn.com/2020/04/10/politics/amendment-4-florida-felons-voting-rights-class-action-lawsuit/index.html"}