{"authors": ["Women'S Reporter"], "date_download": "2020-05-04 20:26:20", "date_modify": "2020-05-04 20:26:20", "date_publish": "2020-04-28 20:30:28", "description": "Only Stacey Abrams responded to HuffPost’s request for comment.", "filename": "entry_joe-biden-vp-tara-reade_n_5ea86f02c5b66d8003aac14f_1588623980.html", "image_url": "https://img.huffingtonpost.com/asset/5ea86f85240000de008e9e25.jpeg?cache=u6sn1tfocx&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_joe-biden-vp-tara-reade_n_5ea86f02c5b66d8003aac14f_1588623980.html", "title": "Potential Joe Biden VP Candidates Largely Silent On Latest Tara Reade Revelations", "title_page": "Potential Joe Biden VP Candidates Largely Silent On Latest Tara Reade Revelations | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "An allegation of sexual assault against Joe Biden, the presumptive Democratic presidential nominee, gained new credibility Monday when Business Insider published a report in which a former neighbor of the accuser, Tara Reade, said that Reade confided in her about the alleged 1993 assault in 1995 or 1996, in very similar terms to how Reade has recently described the alleged assault.\nThe news comes on top of accounts from two other people ― a former co-worker at a different job, and Reade’s brother ― who also said they remember Reade telling them about the assault. Additionally, a video surfaced last week of Reade’s mother calling in to a live broadcast of “Larry King Live” on CNN in 1993 and asking King what she should do if her daughter had a problem with a “prominent senator.”\nThe new revelations came as the Biden campaign began searching for a vice presidential candidate. Biden promised last month during the final Democratic debate to select a woman as his running mate and has since given several interviews about the type of person he is searching for.\nHuffPost contacted nine people on Biden’s rumored shortlist: Sen. Elizabeth Warren (D-Mass.), Sen. Kamala Harris (D-Calif.), Sen. Amy Klobuchar (D-Minn.), Michigan Gov. Gretchen Whitmer (D), Sen. Tammy Duckworth (D-Ill.), Sen. Catherine Cortez Masto (D-NV), Sen. Tammy Baldwin (D-WI), Rep. Val Demings (D-Fl.) and Stacey Abrams, the Democratic nominee in the 2018 Georgia governor’s race.\nIn response to questions about Reade’s allegations in general and the Business Insider report Monday with contemporaneous corroboration from Reade’s neighbor, only Abrams responded.\n“I believe women deserve to be heard, and I believe that has happened here,” Abrams told HuffPost in an email. “The allegations have been heard and looked into, and for too many women, often, that is not the case. The New York Times conducted a thorough investigation, and nothing in the Times review or any other later reports suggests anything other than what I already know about Joe Biden: That he will make women proud as the next President of the United States.”\nHowever, The New York Times told HuffPost that its investigation made “no conclusion either way” as to whether Reade’s allegation did or did not happen.\nAbrams’ statement echoes past comments about the allegation from Whitmer and Klobuchar, which they made before the Business Insider report came out. In those prior statements, the potential candidates struck a similar note: They said there should be a fair investigation of her claims. But like Abrams, they also did not offer a specific defense of Biden in relation to this alleged incident.\nKlobuchar told NPR in mid-April that “all women in these cases have the right to be heard and have their claims thoroughly reviewed.” She also pointed to the former staffers who worked with Biden at the time who could not corroborate Reade’s story and noted Biden’s past work championing women’s rights, like drafting the Violence Against Women Act.\nWhitmer, who has publicly discussed being a survivor of sexual assault, said she also believes women should be able to tell their stories. “I think that it is important that these allegations are vetted, from the media to beyond. And I think that it is something that no one takes lightly,” she told NPR in mid-April. “But it is also something that is personal. And so it’s hard to give you greater insight than that, not knowing more about the situation.”\nThe Biden campaign has denied the accusation, telling HuffPost last month: “Women have a right to tell their story, and reporters have an obligation to rigorously vet those claims. We encourage them to do so, because these accusations are false.” A subsequent New York Times investigation could not corroborate Reade’s allegation with Biden staffers at the time and found “no pattern of sexual misconduct.”\nThe Biden campaign did not immediately respond to HuffPost’s request for comment.\nA significant part of a vice presidential candidate’s job is defending the presidential nominee — including their policy positions, their fitness for office, and their experience. Whoever Biden chooses will be going around the country convincing people that Biden deserves to be in the White House. Yet at the same time, there is perhaps an unfairness in demanding that all of these women answer for the alleged misdeeds of a man.\nAs Rebecca Traister wrote in The Cut on Tuesday:\nWhat’s sickeningly clear is that if Biden remains the Democratic nominee, whichever woman gets the nod to be his running mate will wind up drinking from a poisoned chalice. Because the promise to choose a woman ensures that whoever she is, she will be forced to answer — over and over again — for Biden’s treatment of other women, including the serious allegations of assault leveled by Tara Reade.\nLast year, Reade was one of eight women who accused Biden of inappropriate touching.\nReade originally told podcast host Katie Halper, who broke the story, that Biden kissed her and penetrated her with his fingers without her consent. She said she pushed Biden off of her and he allegedly became annoyed and said: “Come on, man! I heard you liked me.” Reade said she was abruptly let go from her position after she filed a complaint against Biden.\n“It was like everything shattered in that moment,” Reade said. “He was, like, my father’s age. He was this champion of women’s rights in my eyes. I couldn’t believe it was happening.”\nLynda LaCasse, the neighbor who corroborated part of Reade’s story to Business Insider, said she doesn’t remember all the details Reade told her in 1995 or 1996, including where the alleged assault took place or what Biden may have said to Reade.\nBut LaCasse did say she remembers how upset Reade was. “This happened, and I know it did because I remember talking about it,” LaCasse said. “I don’t remember all the details. I remember the skirt. I remember the fingers. I remember she was devastated.”\nAfter Reade left her job with Biden, she worked for California state Sen. Jack O’Connell. She later worked in the domestic violence unit for the King County prosecutor in Seattle and in 2004 got her law degree from Seattle University School of Law. She went on to serve as a legal-services director for the Snohomish County Center for Battered Women in Washington state.\nAs a legislator, Biden has a generally positive track record with women’s rights issues. In 2014, he launched It’s On Us, an organization combatting sexual assault on college campuses, with President Barack Obama. Biden also drafted the Violence Against Women Act of 1994, a landmark piece of legislation that solidified important protections for survivors of domestic and sexual violence.\nAccording to Reade’s story, Biden was drafting language for the Violence Against Women Act right around the time he assaulted her.\nThe former vice president has been widely criticized for how he handled Anita Hill’s accusations of sexual harassment against Clarence Thomas during Thomas’ 1991 Supreme Court confirmation hearings. Biden, the then-chairman of the Senate Judiciary Committee, has been condemned for not doing enough to ensure Hill’s allegations were given full consideration.", "url": "https://www.huffpost.com/entry/joe-biden-vp-tara-reade_n_5ea86f02c5b66d8003aac14f"}