{"authors": ["Review Brian Lowry"], "date_download": "2020-05-04 16:26:17", "date_modify": "2020-05-04 16:26:17", "date_publish": "2020-04-06 13:26:39", "description": "Quibi -- the \"quick bite\" streaming platform kicking off with a 90-day free trial -- appears to want to be some things to all people, delivering a hodgepodge of ideas ultimately defined more by the format than its content.", "filename": "2020_04_06_entertainment_quibi-review_index_1588609577.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403134316-chrissys-court-quibi-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_entertainment_quibi-review_index_1588609577.html", "title": "What to watch (and skip) on Quibi", "title_page": "What to watch (and skip) on Quibi - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Based on its business model, Quibi -- designed to be an \"on the go\" streaming service that you can watch in quick bites (hence the name) on your phone -- has seemingly had bad luck in the timing of its launch, with most of the world sheltering at home. But sampling its lineup, a more controllable flaw is that the shows generally aren't very good, which -- for a programming venture -- is more than a mere quibble.\nAlthough the highest-profile fare includes \"Movies in chapters\" -- slicing dramatic stories into 7-to-9-minute sections as \"episodes\" -- the titles that work best are unscripted, which feels more suited to snack-sized video consumption.\nAs for any coherence to the selections, there really isn't any. Seemingly emulating Netflix, Quibi -- which is kicking off with a 90-day free trial -- appears to want to be some things to all people, delivering a hodgepodge of ideas ultimately defined more by the format than its content.\nQuibi made more than two dozen individual offerings available to preview, so depending on personal preferences and interests your mileage might vary. That includes self-help fare, cooking shows, a revival of \"Punk'd\" (with Chance the Rapper) and news, sports, entertainment and latenight compilations, the last group basically approximating what you can see on those screens offering clips at the gas station.\nThere's utility in that, although it's tough to envision a true test of Quibi's value until life returns to semblance of normalcy, with people moving about and having small windows of time to fill while they wait in lines and the like.\nRead More", "url": "https://www.cnn.com/2020/04/06/entertainment/quibi-review/index.html"}