{"authors": ["Kathy Willens"], "date_download": "2020-05-04 20:23:39", "date_modify": "2020-05-04 20:23:39", "date_publish": "2020-04-20 19:44:11", "description": "NEW YORK (AP) — Without their usual flow of patrons to their three businesses in Chinatown and the Lower East Side neighborhoods of Manhattan, Abby and Paul Sierros needed a plan. They saw a...", "filename": "_821d4f8db9c48bb4aa7035c5fd3513cb_1588623819.html", "image_url": "https://storage.googleapis.com/afs-prod/media/4df1866e1c304d038aa1598bcd7750a4/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_821d4f8db9c48bb4aa7035c5fd3513cb_1588623819.html", "title": "Small businesses pivoting during pandemic", "title_page": "AP PHOTOS: Small businesses pivoting during pandemic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "AP PHOTOS: Small businesses pivoting during pandemic\nNEW YORK (AP) — Without their usual flow of patrons to their three businesses in Chinatown and the Lower East Side neighborhoods of Manhattan, Abby and Paul Sierros needed a plan. They saw a neighborhood need and went to work, replacing the tables and chairs with shelving and refrigerators in their bar, Forgtmenot, transforming it into a grocery store.\nAcross the East River in Brooklyn, at Clementine Bakery, similar changes are happening. Michelle Barton’s bakery and café added fresh produce, fresh local bread, and protective gloves to their normal vegan fare.\n“We just made it happen,” Forgtmenot managing partner Derek Tigue said. “About five or six of us mobilized and made the adjustments in less than 24 hours with wood from a Chinese lumber yard across the street.”\nUsing the suppliers from their restaurants, Kiki’s Grill and Kiki’s, the Forgtmenot bar, now called the FMN General Store, sells bread, jam, peanut butter, flour, Campbell’s soup, beans, pasta, fresh produce, and specialty items like homemade Greek yoghurt, olives, spicy pickles, burrata cheese, and thyme honey along with kitty litter and pet food. They also carry high-demand items like toilet paper, paper towels, and hand sanitizer. Customers can also pick up a canned alcoholic beverage or a cocktail to-go after purchasing their groceries, since the bar is still open, but only to take away.\n“It’s been a harsh pill to swallow, not only for us but for all small businesses,” said Tigue, referring to the three businesses’ 90% staff and revenue loss. “It’s a small service we’re providing to the neighborhood. We owe a huge gratitude to the community for being there for us. We just want to keep our restaurants alive, and keep our doors open.”\nAt Clementine Bakery, assistant manager Tiffany Wong says two of three customers purchase produce, even though they might have come for baked goods. After moving out the tables, half the bakery resembles a small farmer’s market.\n“We’ve stopped taking cash…we’re contactless payment as much as possible. We started enforcing the five-people-at-a-time rule.” Wong added. “So far, people are really patient, and no one has complained about having to wait outside.\n“Our customers have let us know how much they appreciate us being open,” she said. “Some people don’t want to wait in line at a grocery store where there’s a lot more traffic. And they want to support small businesses like our café.”", "url": "https://apnews.com/821d4f8db9c48bb4aa7035c5fd3513cb"}