{"authors": ["Dave Collins"], "date_download": "2020-05-04 20:27:29", "date_modify": "2020-05-04 20:27:29", "date_publish": "2020-04-20 18:43:30", "description": "HARTFORD, Conn. (AP) — The parents of a University of Connecticut student who was run over and killed by a campus fire department truck in 2016 have settled a wrongful death lawsuit against the...", "filename": "_1f680fb266e9f83eb449ca65b3e073c4_1588624049.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1f680fb266e9f83eb449ca65b3e073c4_1588624049.html", "title": "$1 million settlement reached in UConn student death", "title_page": "$1 million settlement reached in UConn student death", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HARTFORD, Conn. (AP) — The parents of a University of Connecticut student who was run over and killed by a campus fire department truck in 2016 have settled a wrongful death lawsuit against the state and other defendants for about $1 million, according to a probate court official.\nJeffny Pally, a 19-year-old sophomore from West Hartford, fell asleep in front of a fire department garage door after drinking alcohol at an off-campus party, authorities said. A department SUV accidentally ran over her while responding to what turned out to be a false alarm.\nA probate court official told The Associated Press on Monday that the case was settled for just over $1 million, after legal fees and other costs were subtracted. Details of the settlement were filed with the probate court late last month and the lawsuit was withdrawn on April 9.\nThe total settlement amount was just under $1.5 million, according to the state attorney general’s office, which said the state is insured for accidents involving state employees driving vehicles and an insurer will pay the settlement.\nPally’s parents, Abraham and Shinymol Chemmarappally, sued the state, the fire department driver and the Kappa Sigma fraternity, which the lawsuit alleged hosted the party where Pally drank alcohol, for negligence, recklessness and other claims. The civil allegations against the driver, Dana Barrow, were dismissed by a judge.\nA lawyer for the parents, Michael Walsh, released a statement on their behalf Monday.\n“The Chemmarappally family believes the case was resolved in a fair and just manner,” the statement said. “Everyday they still mourn the loss of their beautiful daughter Jeffny. Beyond that, they have no comment.”\nUConn also released a statement Monday.\n“This was a tragic case and the University hopes the lawsuit’s resolution is able to bring some comfort to the Chemmarappally family, with whom the University continues to collaborate to ensure that Jeffny’s memory and legacy as a UConn student lives on,” the statement said.\nSix UConn students who were members of the fraternity were arrested on alcohol-related charges in connection with the off-campus party. All of them received a probation program that resulted in the charges being erased.\nSurveillance video recorded the accident at about 1 a.m. on Oct. 16, 2016. It shows Barrow stopping the vehicle briefly after officials said he felt a bump, then driving over Pally and not stopping on his way to the call.\nBarrow was not criminally charged. Police said Barrow believed he drove over a piece of equipment and was focused on responding to a reported dormitory fire. He thought he would check on the equipment when he got back to the firehouse, authorities said. He retired in 2017.", "url": "https://apnews.com/1f680fb266e9f83eb449ca65b3e073c4"}