{"authors": ["Mark Long"], "date_download": "2020-05-04 20:24:41", "date_modify": "2020-05-04 20:24:41", "date_publish": "2020-04-20 17:09:27", "description": "JACKSONVILLE, Fla. (AP) — The Jacksonville Jaguars are ready to move on from running back Leonard Fournette. A person familiar with the decision says the Jaguars are actively looking to...", "filename": "_824509065023e4c7b6ec4ea12b1f1a65_1588623881.html", "image_url": "https://storage.googleapis.com/afs-prod/media/6500453b62e24910a49e95db5d391afc/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_824509065023e4c7b6ec4ea12b1f1a65_1588623881.html", "title": "AP source: Jaguars looking to trade RB Leonard Fournette", "title_page": "AP source: Jaguars looking to trade RB Leonard Fournette", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Sunday, Dec. 15, 2019 file photo,Jacksonville Jaguars running back Leonard Fournette runs with the ball during the second half of an NFL football game against the Oakland Raiders in Oakland, Calif. The Jacksonville Jaguars are ready to move on from running back Leonard Fournette, Monday, April 20, 2020. A person familiar with the decision says the Jaguars are actively looking to trade the fourth overall pick in the 2017 NFL draft. The person spoke to The Associated Press on condition of anonymity because the team hasn’t made its plans public.(AP Photo/D. Ross Cameron, File)\nFILE - In this Sunday, Dec. 15, 2019 file photo,Jacksonville Jaguars running back Leonard Fournette runs with the ball during the second half of an NFL football game against the Oakland Raiders in Oakland, Calif. The Jacksonville Jaguars are ready to move on from running back Leonard Fournette, Monday, April 20, 2020. A person familiar with the decision says the Jaguars are actively looking to trade the fourth overall pick in the 2017 NFL draft. The person spoke to The Associated Press on condition of anonymity because the team hasn’t made its plans public.(AP Photo/D. Ross Cameron, File)\nJACKSONVILLE, Fla. (AP) — The Jacksonville Jaguars are ready to move on from running back Leonard Fournette.\nA person familiar with the decision says the Jaguars are actively looking to trade the fourth overall pick in the 2017 NFL draft. The person spoke to The Associated Press on condition of anonymity because the team hasn’t made its plans public.\nThe person said Fournette could get moved before or during the NFL draft, which begins Thursday night. ESPN first reported Jacksonville’s desire to part with the former LSU star.\nIf Fournette gets traded, he would join quarterback Nick Foles (Chicago), defensive end Calais Campbell (Baltimore), cornerback A.J. Bouye (Denver) and defensive tackle Marcell Dareus (free agent) as starters Jacksonville has dumped in the last six weeks. The team also traded cornerback Jalen Ramsey (Los Angeles Rams) last October.\nDisgruntled defensive end Yannick Ngakoue has publicly asked to play elsewhere and could be another trade option for Jacksonville.\nFournette, meanwhile, is entering the final year of his rookie contract and is due to make $4.17 million in 2020. If he stays in Jacksonville, he would count $8.64 million against Jacksonville’s salary cap. The Jaguars would take on $4.47 million in dead money by trading him.\nCoaches have seemingly grown tired of dealing with Fournette, whose ability is often overshadowed by his baggage.\nStill, the 25-year-old running back is coming off a career year. He topped 1,600 yards from scrimmage in 15 games last season, carrying 265 times for 1,152 yards and catching 76 passes for 522 yards. He only scored three touchdowns. He also fumbled just once.\nThe former LSU star has 2,631 yards rushing, 1,009 yards receiving and 19 touchdowns in three seasons since he was now-fired personnel chief Tom Coughlin’s first draft pick since returning to Jacksonville.\nCoughlin wanted Fournette to be the centerpiece of his old-school, run-first philosophy. It worked in 2017, although it became clear that Fournette needed to be a better pro. He was fined repeatedly for being late and skipping mandatory functions.\nFournette’s tenure in Jacksonville took a turn in 2018, which ended up being the worst season of his football life. He was injured, suspended and on the bench in crunch time. He was fined, criticized and admittedly not in ideal shape late in the year.\nThe Jaguars voided the remaining guarantees in his rookie contract following his one-game suspension for fighting with Buffalo linebacker Shaq Lawson, and Coughlin ripped him for being “disrespectful” and “selfish” for sitting on the bench — while injured and inactive — during the season finale. Adding to the chaos, Fournette was arrested in April 2019 for driving with a suspended license.\nHe bounced back last year with his best season.\nBut with Coughlin fired, it was unlikely general manager Dave Caldwell would have picked up the fifth-year option in Fournette’s rookie deal — especially because Jacksonville plans to shift to a West Coast offense.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/824509065023e4c7b6ec4ea12b1f1a65"}