{"authors": [], "date_download": "2020-05-04 20:19:05", "date_modify": "2020-05-04 20:19:05", "date_publish": "2020-01-16 07:48:50", "description": "WEST POINT CADET TRIES TO LURE PORN STAR TO EVENT UNDATED (AP) — An effort by a West Point cadet to get a porn star to be his date for an event at the military school has been deflated. The...", "filename": "_e157b0b4977142ceb16b119759c06e84_1588623545.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e157b0b4977142ceb16b119759c06e84_1588623545.html", "title": "AM-Prep: Kickers", "title_page": "AM-Prep: Kickers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WEST POINT CADET TRIES TO LURE PORN STAR TO EVENT\nUNDATED (AP) — An effort by a West Point cadet to get a porn star to be his date for an event at the military school has been deflated. The cadet set up a GoFundMe page to raise money to cover travel and lodging costs for the adult film star Diamond Foxxx. The cadet wanted her to be his date at the annual Yearling Winter Weekend, thrown for sophomores at the storied academy in New York State. The site went up last weekend and had listed $370 in donations. But the U.S. Military Academy says the cadet has since removed the page from the site. West Point didn’t identify the cadet involved — and it’s unclear whether he will face any discipline from the academy.\nMEXICO SUBWAY ESCALATORS\nMEXICO CITY (AP) — Don’t eat yellow snow. That sound advice is being tweaked for riders on the Mexico City subway system: don’t use yellow escalators. Seems the people-movers break down often — and travelers often blame authorities for poor maintenance. But it seems the problem isn’t officials holding back maintenance — rather it’s riders who can’t hold their bladders. Officials say so many people urinate on the escalators, pee seeps into the machinery, causing corrosion and ultimately breakdowns. Many Twitter users have noted that Mexico City subways have no public bathroom facilities.\nTELEGRAPH LAWS BOOTED FROM FLORIDA BOOKS\nTALLAHASSEE, Fla. (AP) — When is the last time you — or anyone you know — sent or received a telegram? If you can’t even remember when that was — or wonder what a telegraph even is — Florida lawmakers hear you. One representative, Tommy Gregory, was thumbing through a state law book — and found there were still laws governing the telegraph industry. Gregory says it’s been more than a decade since he’s seen a telegraph, so he figured the laws are obsolete. A committee of lawmakers agreed, voting unanimously to repeal that portion of the law.\nby Oscar Wells Gabriel II", "url": "https://apnews.com/e157b0b4977142ceb16b119759c06e84"}