{"authors": [], "date_download": "2020-05-04 20:05:31", "date_modify": "2020-05-04 20:05:31", "date_publish": "2020-04-09 05:57:44", "description": "ISLAMABAD (AP) — Pakistan's military said Thursday its troops shot down a small Indian spy drone after it violated the country's airspace in the disputed Himalayan region of Kashmir. In a...", "filename": "_e2b7458768191926a81701bdfe9e095f_1588622731.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e2b7458768191926a81701bdfe9e095f_1588622731.html", "title": "Pakistan's army says it shot down Indian drone in Kashmir", "title_page": "Pakistan's army says it shot down Indian drone in Kashmir ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Pakistan’s army says it shot down Indian drone in Kashmir\nISLAMABAD (AP) — Pakistan’s military said Thursday its troops shot down a small Indian spy drone after it violated the country’s airspace in the disputed Himalayan region of Kashmir.\nIn a statement, it said Pakistani troops downed the drone when it “intruded 600 meters inside Pakistan’s territory” for surveillance along the Line of Control that divides the Pakistani- and Indian-controlled portions of Kashmir.\nThe military released a picture of what it said was the downed drone.\nThere was no immediate comment from India on Thursday.\nKashmir is split between Pakistan and India, both of which claim the territory in its entirety. They have fought two wars over it since their independence from British rule in 1947.\nThe military has been on high alert since last February, when India launched an airstrike inside Pakistan, saying it targeted Pakistan-based militants responsible for a suicide bombing that killed 40 Indian troops in Indian-administered portion of Kashmir.\nPakistan at the time retaliated and said it shot down two Indian jets. One Indian pilot was captured and later released.", "url": "https://apnews.com/e2b7458768191926a81701bdfe9e095f"}