{"authors": [], "date_download": "2020-05-04 20:12:54", "date_modify": "2020-05-04 20:12:54", "date_publish": "2020-04-16 18:32:45", "description": "WICHITA, Kan. (AP) — Sedgwick County has settled a lawsuit with a former jail inmate who alleged he was has beaten unconscious by a deputy for $50,000. The Wichita Eagle reports that...", "filename": "_db5b162439a9bee17cdb0aeb4ae18e22_1588623174.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_db5b162439a9bee17cdb0aeb4ae18e22_1588623174.html", "title": "Former jail inmate reaches $50K settlement in abuse lawsuit", "title_page": "Former jail inmate reaches $50K settlement in abuse lawsuit", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WICHITA, Kan. (AP) — Sedgwick County has settled a lawsuit with a former jail inmate who alleged he was has beaten unconscious by a deputy for $50,000.\nThe Wichita Eagle reports that commissioners approved the settlement Wednesday with 32-year-old Kristopher Welch, who sued last year in federal court. Welch’s lawsuit originally sought $75,000 in damages.\nAmong those named in the suit was Cody Alexander, the jail sergeant whom Welch said beat him. The sheriff’s office says Alexander is now a lieutenant.\nThe lawsuit said Alexander “forcibly removed” Welch from a bed at the jail, ordered him into handcuffs and then slammed him against a cell wall when he didn’t comply quickly enough with an order to move bunks on March 13, 2017.\nThe lawsuit says the sergeant then reacted to a comment from a handcuffed Welch by punching Welch “from behind in the left side of his face” while Welch was “in a defenseless position and was facing away.” The blow fractured “multiple bones” and caused Welch “to black out.”\nCourt records show Welch was in jail at the time of the alleged assault in connection with violating the terms of his probation in two 2016 cases. He pleaded guilty in those cases to damaging a 2012 Camaro and possessing marijuana and methamphetamine.", "url": "https://apnews.com/db5b162439a9bee17cdb0aeb4ae18e22"}