{"authors": [], "date_download": "2020-05-04 20:18:37", "date_modify": "2020-05-04 20:18:37", "date_publish": "2020-04-09 19:57:10", "description": "SYRACUSE, N.Y. (AP) — Elijah Harris Jr., a Syracuse street musician known to serenade fans outside the Carrier Dome on Marshall street for decades, died Tuesday. He was 62. Harris was struck...", "filename": "_dbb0686f4c76f26de6acab977bea8d78_1588623517.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dbb0686f4c76f26de6acab977bea8d78_1588623517.html", "title": "Syracuse street musician Elijah Harris Jr. dies at 62", "title_page": "Syracuse street musician Elijah Harris Jr. dies at 62", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SYRACUSE, N.Y. (AP) — Elijah Harris Jr., a Syracuse street musician known to serenade fans outside the Carrier Dome on Marshall street for decades, died Tuesday. He was 62.\nHarris was struck in a double hit-and-run while riding his bike, the Syracuse Police Department said in a news release Wednesday.\nAuthorities say Harris was struck by a vehicle around 9:40 p.m. and was struck again by a second vehicle while sitting on the ground waiting for an ambulance.\nHarris referred to Marshall Street as his alleyway and appointed himself the musical mayor of the street, according to musician and Syracuse common councilor Joe Driscoll.\nDriscoll rode his bike to Marshall street at 12 years old to watch Harris play, the Post Standard reported.\n“He changed my perception of what you could do with a guitar,” Driscoll said.\nHarris also played outside NBT Bank Stadium during baseball games. He also played outside the Landmark Theatre and the Westcott Theater during shows.\n“We lost a prince. He was Syracuse music royalty, as far as I’m concerned,” said Frank Malfitano, founder and executive producer of Syracuse Jazz Fest.\nMalfitano called Harris a “human jukebox” who could rap, tap dance, play the guitar and sing.", "url": "https://apnews.com/dbb0686f4c76f26de6acab977bea8d78"}