{"authors": [], "date_download": "2020-05-04 20:28:59", "date_modify": "2020-05-04 20:28:59", "date_publish": "2020-04-13 22:12:55", "description": "MANSON, Iowa (AP) — An Iowa sheriff charged with assault and domestic abuse also faces allegations that he harassed female employees. Calhoun County Sheriff Scott Anderson was arrested in...", "filename": "_bbb82aad8926d47f71955f660fe37839_1588624139.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bbb82aad8926d47f71955f660fe37839_1588624139.html", "title": "Iowa sheriff charged with assault now faces harassment claim", "title_page": "Iowa sheriff charged with assault now faces harassment claim", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MANSON, Iowa (AP) — An Iowa sheriff charged with assault and domestic abuse also faces allegations that he harassed female employees.\nCalhoun County Sheriff Scott Anderson was arrested in Manson, about 110 miles (177.03 kilometers) northwest of Des Moines, for alleged domestic abuse against his wife and assaulting an officer Sunday, the Des Moines Register reported . He has since been released on bond.\nAnderson dragged his wife into their bedroom and choked her as she cried for him to stop, according to a criminal complaint released Monday. The complaint alleges Anderson headbutted a Manson police officer as he was being arrested. It took six officers to get him a patrol car after he was handcuffed, according to the complaint.\nAnderson has applied for a court-appointed lawyer. An Associated Press request for comment was not immediately returned Monday.\nCounty Attorney Tina Meth-Farrington on Monday said a special prosecutor will handle the case.\nAnderson’s ex-wife filed a petition for relief from domestic violence when she was married to him in October, but the petition was denied.\nA former county dispatcher in December also filed a civil rights complaint alleging Anderson harassed her and retaliated when she complained. Iowa’s Civil Rights Commission on April 2 found the complaint, which accuses the county of not doing enough to stop Anderson, worthy of further investigation.\nThe complaint, provided to the Des Moines Register by the complainant’s attorney, claims that Anderson implied she should have sex with him and at one point asked her to move to Kentucky with him.\nThe complainant and other dispatchers in 2018 told the county attorney that Anderson would scream at them, according to the complaint. When he found out that someone had contacted the county attorney about him, the complaint says Anderson undertook a “witchhunt” to find out which employees complained about him.\nAnderson is up for re-election this year.", "url": "https://apnews.com/bbb82aad8926d47f71955f660fe37839"}