{"authors": ["Lisa Respers France"], "date_download": "2020-05-04 16:03:05", "date_modify": "2020-05-04 16:03:05", "date_publish": "2020-04-01 19:29:56", "description": "Bhagavan \"Doc\" Antle doesn't think people should take \"Tiger King\" very seriously.", "filename": "2020_04_01_entertainment_doc-antle-jeff-lowe-tiger-king_index_1588608185.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401113723-bhagavan-antle-tiger-king-netflix-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_entertainment_doc-antle-jeff-lowe-tiger-king_index_1588608185.html", "title": "'Tiger King': 'Doc' Antle and Jeff Lowe speak out against docuseries", "title_page": "'Tiger King': 'Doc' Antle and Jeff Lowe speak out against docuseries - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "\"This is a salacious, outrageous ride through a television show produced to create drama, to just tie you in to some crazy train wreck of a story between the feud of Carole Baskin and Joe Exotic and the meltdown that ensued between two people who both are far too close to murder themselves, and I think a little bit of madness thrown in on their parts,\" Antle said in a video interview.\n\"Tiger King: Murder, Mayhem and Madness\" follows the life and alleged crimes of big cat enthusiast Joseph Allen Maldonado-Passage aka Joe Exotic aka Tiger King who was sentenced to 22 years in prison in January after he was convicted on multiple charges including an alleged murder-for-hire plot against his nemesis, Baskin.\nAntle said he didn't expect the docuseries to become as popular as it has.\n\"I never thought it could get to this level,\" he said. \"I guess in some ways because so many people are trapped on their couch (because of the pandemic) and this train wreck of an adventure into magical wildlife land has somehow just caught everybody's attention.\"\nAntle is not the only one who doesn't love how they were portrayed on screen.\nBaskin wrote that the directors told her they wanted to make a version of \"Blackfish\" (the documentary that exposed abuse at SeaWorld) that focused on the exploitation of big cat cubs.\n\"There are not words for how disappointing it is to see that the series not only does not do any of that, but has had the sole goal of being as salacious and sensational as possible to draw viewers,\" she wrote.\n\"Tiger King's\" co-directors and writers, Eric Goode and Rebecca Chaiklin, responded to Baskin in an interview with the Los Angeles Times\nChaiklin said they \"were completely forthright with the characters.\"\n\"With any project that goes on for five years, things evolve and change, and we followed it as any good storyteller does,\" she said. \"We could have never known when we started this project that it was going to land where it did.\"\nGoode said Baskin \"talked about her personal life, her childhood, abuse from her first and second husband, the disappearance of her ex, Don Lewis.\"\n\"She knew that this was not just about ... it's not a 'Blackfish' because of the things she spoke about,\" Goode said. \"She certainly wasn't coerced.\"\nJeff and Lauren Lowe currently run Maldonado-Passage's zoo and told The Media Exchange in a separate interview that they were unhappy as well.\n\"They touched on about 10 percent of the story and, you know, the portrayal of us stealing the zoo from Joe was very unfair because we came here to help him, we got it back on its feet,\" Jeff Lowe said. \"We left to move away because we didn't want to be in a zoo in Oklahoma, so the notion that we tried to steal the zoo from him is just ridiculous.\"\nCNN has reached out to Netflix and the filmmakers for comment.", "url": "https://www.cnn.com/2020/04/01/entertainment/doc-antle-jeff-lowe-tiger-king/index.html"}