{"authors": [], "date_download": "2020-05-04 16:27:48", "date_modify": "2020-05-04 16:27:48", "date_publish": "2020-04-07 19:05:55", "description": "Adidas is marking down its most iconic footwear styles, including Ultraboost, Stan Smith, Superstar and more. Through April 13, save up to 40% on select sneakers with promo code ADIFAVS.", "filename": "2020_04_07_cnn-underscored_adidas-sale-ub20-originals_index_1588609668.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407144252-adidas-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_cnn-underscored_adidas-sale-ub20-originals_index_1588609668.html", "title": "Adidas is marking down some of its most iconic footwear now", "title_page": "Adidas sale: Save 40% on the UB20 sneaker and Originals footwear - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Get your kicks at Adidas' latest sale. Right now, the brand is marking down its most iconic footwear styles, including Ultraboost, Stan Smith, Superstar and more. Through April 13, save up to 40% on select sneakers with promo code ADIFAVS.\nAlmost all of the on-sale styles are available in both men's and women's sizes and come in myriad colorways (though not every colorway is included in the promo, so be sure to give your cart a second look before you check out).\nOver 280 shoe styles are marked down, though sizes in some of the most in-demand styles have already sold out. Browse through all the discounted sneakers here, or see below for a breakdown of some of the best-selling shoes.\nSuperstar Shoes ($48, originally $80; adidas.com)\nAdidas Superstar Shoes\nEveryone knows that those three stripes mean Adidas, so become a Superstar at a discount now. This classic street style shoe features a recognizable shell toe, full-grain leather upper and those stripes that never go out of style.\n___________________________________________________________________________________\nUltraboost 20 Shoes (starting at $108, originally $180; adidas.com)\nAdidas Ultraboost 20 Shoes\nGet your best run ever in a pair of UB20s. The Ultraboost hugs your foot, thanks to stitched-in reinforcements and a supportive Primeknit upper, and it gives your stride a boost with the help of a comfortable elastane heel and responsive cushioning.\n___________________________________________________________________________________\nNMD_R1 Shoes (starting at $78, originally $130; adidas.com)\nAdidas NMD_R1 Shoes\nThe NMD_R1 has a retro look that's bolstered by the best in current running shoe technology. The sneaker has a super responsive Boost midsole and molded EVA inserts, paired with a textile upper that offers a light, sock-like feel.\n___________________________________________________________________________________\nStan Smith Shoes (starting at $40, originally $80; adidas.com)\nAdidas Stan Smith Shoes\nThese classic kicks are still as relevant today as they were in the '70s, the decade when they made their debut. Three perforated stripes, leather upper and colored heel tabs make them as recognizable as ever.\nFor more great Adidas deals, check out CNN Coupons.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/07/cnn-underscored/adidas-sale-ub20-originals/index.html"}