{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:11:16", "date_modify": "2020-05-04 20:11:16", "date_publish": "2020-04-07 22:09:44", "description": "Division 3 All-State The 2020 Associated Press Division 3 boys basketball All-State team as selected by a panel of Michigan sports writers. Player of the Year", "filename": "_92f3f85cb08bf130dc1d2665b3366c4b_1588623076.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_92f3f85cb08bf130dc1d2665b3366c4b_1588623076.html", "title": "Terry, Kemp win Division 3 awards from The Associated Press", "title_page": "Terry, Kemp win Division 3 awards from The Associated Press", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Terry, Kemp win Division 3 awards from The Associated Press\nDivision 3 All-State\nThe 2020 Associated Press Division 3 boys basketball All-State team as selected by a panel of Michigan sports writers.\nPlayer of the Year\nJalen Terry, Flint Beecher, Sr.\nFirst-Team All-State\nJalen Terry, Flint Beecher, Sr.\nReece Hazelton, Maple City Glen Lake, Sr.\nJeffrey Carrier, Mason County Central, Sr.\nSam Vasiu, Grand Rapids NorthPointe Christian, Sr.\nJoey Liedel, Erie Mason, Sr.\nFoster Wonders, Iron Mountain, Jr.\nMarcus Johnson, Iron Mountain, Sr.\nJaVaughn Hannah, Mt. Clemens, So.\nWilliam Dunn, Quincy, Sr.\nTy Horky, Manchester, Sr.\nCoach of the Year\nCourtney Kemp, Ravenna\nSecond-Team All-State\nJayden Alfred, Mancelona, Jr.\nRaynard Williams, Detroit Edison, Sr.\nTyler Starbuck, Bloomingdale, Sr.\nEarnest Sanders, Flint Beecher, Sr.\nAaron Bearss, Pewamo-Westphalia, Sr.\nKaeler Stafne, Marcellus, Sr.\nCoach of the Year\nGary Sullivan, Blissfield\nJacob Briney, Potterville\nHonorable Mention\nLogan Chilman, Beal City; Connor Arnold, Coleman; Evan Solomon, Charlevoix; Jackson Raymond, East Jordan; David Harrell, Harbor Springs; Jacob Mueller, Charlevoix; Wyatt Nausadis, Traverse City St. Francis; Brock Stevens, Grandville Calvin Christian; Ty Mulder, Grand Rapids Covenant Christian; Ty Wyman, Blissfield; Dallas Bolster, Dundee; Brendan Dafoe, Summerfield; Maurice Anderson, Ypsilanti Arbor Prep; Jason Waterman, Negaunee; Mary Mayberry, Detroit Loyola; Bryce George, Detroit Edison; Tharran Hill, Detroit Pershing; Eli Carlson, Kent City; Kellen Mitchell, Western Michigan Christian; Kendall Chrismon, Niles Brandywine; Darrion Gatson, Cassopolis; Hunter Adams, Bridgman; Aaron Sinclair, Hartford; Nathan Slowik, Holton; Bryce VanderWiere, Schoolcraft; Lowyind Pullen, Homer; Kobe Clark, Schoolcraft; Zac Yorke, Millington; Landin Zimmer, Unionville-Sebewaing; Damarquss Palmreuter, Reese; Tyler Nelson, Sandusky; Nash Morton, Unionville-Sebewaing; Keyon Menifield, Flint Beecher; Luc Laketa, Hanover-Horton; Gabe Hawes, Laingsburg; Cole Krause, Potterville; Chris Hall, Stockbridge; Owen Franklin, Oscoda; Brayden Mallak, Oscoda; Nolan Finkbeiner, Hemlock; Dana Thorson, Whittemore-Prescott; Gage White, Sanford-Meridian; Nathaniel Wandrie, Indian River Inland Lakes; Jacob Haun, Manton; Grant Richardson, Harbor Springs; Brian Britt, Bendle; Mitch Sauber, Hanover-Horton; Jack Brockie, Hanover-Horton; Trey Plichta, Sanford-Meridian; Jayden Evans, Hemlock; Jacob Hecht, Saginaw Valley Lutheran; Trent Ordiway, Houghton Lake; Axel Woolworth, Morley-Stanwood; Gavin Etter, Marcellus.\nCoach of the Year\nLuke Pohl, Pewamo-Westphalia\nChad Mortimer, Hanover-Horton\nMitch Bohn, Sanford-Meridian\nClark Swerdan, Coleman\nMatt Bauer, Hemlock\nKevin Skaggs, Erie Mason\n___\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports", "url": "https://apnews.com/92f3f85cb08bf130dc1d2665b3366c4b"}