{"authors": ["Randall Chase"], "date_download": "2020-05-04 20:11:03", "date_modify": "2020-05-04 20:11:03", "date_publish": "2020-04-07 23:20:05", "description": "DOVER, Del. (AP) — A former Delaware inmate who escaped conviction for his alleged involvement in a fatal prison riot is back behind bars on unrelated charges. Obadiah Miller, 27, was being...", "filename": "_aebc1c703199584359d2295a60d03b33_1588623063.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_aebc1c703199584359d2295a60d03b33_1588623063.html", "title": "Ex-inmate who escaped conviction in fatal riot back in jail", "title_page": "Ex-inmate who escaped conviction in fatal riot back in jail", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DOVER, Del. (AP) — A former Delaware inmate who escaped conviction for his alleged involvement in a fatal prison riot is back behind bars on unrelated charges.\nObadiah Miller, 27, was being held Tuesday at Howard Young prison in Wilmington after being charged with violating probation and possession of marijuana with intent to distribute.\nMat Marshall, a spokesman for the attorney general’s office, said a violation of probation hearing that was scheduled for Tuesday was continued pending resolution of Miller’s drug charge, and that his bond was lowered to $50,000. Miller had initially been ordered held without bond.\nMiller was released from custody in November and began a probationary sentence of home confinement after serving a 10-year-sentence for manslaughter involving the 2010 shooting death of a 10-year-old boy.\nMiller was one 18 inmates who were charged in the 2017 riot at Delaware’s maximum-security prison, in which a prison guard was killed. Two other guards were released by inmates after being beaten and tormented. A female counselor was held hostage for nearly 20 hours before tactical teams burst through a wall with a backhoe and rescued her.\nA jury acquitted Miller last year on charges of assault, kidnapping and conspiracy. Jurors were unable to agree on charges of murder and riot. Before Miller could be retried on those charges, prosecutors decided after a series of trial losses involving other riot defendants not to pursue any more prosecutions.\nThose trial losses included the failed prosecution of Roman Shankaras, who was accused of leading the riot but acquitted on charges of murder, assault, kidnapping, riot and conspiracy. The acquittal spared him from a mandatory life sentence. Shankaras, who had completed a seven-year sentence for unrelated riot and robbery charges while awaiting trial for the riot, was released from custody just hours later.\nShankaras was arrested by Wilmington police in February and charged with possession of a firearm or ammunition by a person prohibited, possession of a deadly weapon by a person prohibited, violating probation, and other charges.", "url": "https://apnews.com/aebc1c703199584359d2295a60d03b33"}