{"authors": ["Lauren M. Johnson"], "date_download": "2020-05-04 16:55:47", "date_modify": "2020-05-04 16:55:47", "date_publish": "2020-04-08 23:08:28", "description": "Workers discovered a 14th century cave and drawings while doing construction on a railroad in Great Britain earlier this week, adding to the other historic finds they previously uncovered.", "filename": "2020_04_08_world_14th-centu_f60449d643db9e90378305c1c325b386_index_1588611347.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408163212-14th-century-cave-england-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_world_14th-centu_f60449d643db9e90378305c1c325b386_index_1588611347.html", "title": "Rail workers discover a 14th century cave while making repairs in England", "title_page": "Rail workers discover a 14th century cave while making repairs in England  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Workers discovered a 14th century cave and drawings while doing construction on a railroad in Great Britain earlier this week, adding to the other historic finds they previously uncovered.\nThe workers were repairing a landslip near Guildford in Surrey, England, when they discovered the cave, according to NetworkRail , which owns and runs Britain's railway infrastructure.\nA specialist archaeological contractor suggested the cave may have been used in Medieval times as a shrine or hermitage associated with St. Catherine's Chapel. The ruins of the early 14th century chapel sit on a hill nearby the railroad.\nThe cave may have been much bigger in its prime, but it seems only a small section survived, according to experts who examined the findings. The drawings show a Gothic niche decorated in dots with a Christian cross over to the side.\nExperts found seven or eight niches and the remains of two suspected fire pits as well. They said they are hoping to use charcoal and soot found in the cave to do radiocarbon dating, in order to determine the exact period of time when the cave was used.\nRead More", "url": "https://www.cnn.com/2020/04/08/world/14th-century-cave-discovered-during-rail-work-trnd/index.html"}