{"authors": [], "date_download": "2020-05-04 16:23:54", "date_modify": "2020-05-04 16:23:54", "date_publish": "2020-04-06 18:18:25", "description": "If you're only leaving the house for socially distanced runs, consider upgrading your sneaker options with this expansive sale from Nike. Right now, all Nike footwear is 25% off with promo code LOGIN25, so you can keep moving — even during a quarantine — for less.", "filename": "2020_04_06_cnn-underscored_nike-sale-footwear_index_1588609434.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406141154-nike-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_cnn-underscored_nike-sale-footwear_index_1588609434.html", "title": "Nike sale: Take 25% off all footwear", "title_page": "Nike sale: Take 25% off all footwear - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "If you're only leaving the house for socially distanced runs, consider upgrading your sneaker options with this expansive sale from Nike. Right now, all Nike footwear is 25% off with promo code LOGIN25, so you can keep moving — even during a quarantine — for less.\nWhile a few exclusions do apply, this promotion means that hundreds of shoes are on sale from the activewear giant. In order to take advantage of this deal, you'll need to log into your Nike account (it's free to make one if you don't already have).\nSo whether you've been staking out a pair of sneakers for your at-home workouts and neighborhood jogs, or you've had your eye on some Nike classics, now's the time to buy. Check out all the on-sale shoes, or see below for some of our favorite Nike footwear.\nNike Renew Run ($67.50, originally $90; nike.com)\nNike Renew Run\nThis bright, durable sneaker was designed for the everyday runner. A breathable mesh upper helps increase airflow, while an ultra-soft inner foam surrounded by a slightly firmer foam increases stability and smoothness.\n__________________________________________________________________________________________\nNike Air VaporMax Flyknit 3 ($150, originally $200; nike.com)\nNike Air VaporMax Flyknit 3\nLet VaporMax Air technology put a spring in your step with soft, lightweight responsiveness. Plus, a bright, stretchy Flyknit upper provides support in tandem with a contour cushioned footbed.\n__________________________________________________________________________________________\nNike Classic Cortez ($52, originally $70; nike.com)\nNike Classic Cortez\nSnag a classic Nike style at a major discount. The iconic Cortez sneaker goes with anything and will never go out of style.\nNike Air Max 97 ($135, originally $180; nike.com)\nNike Air Max 97\nAdd a classic to your sneaker collection with a discounted pair of Air Max shoes, featuring retro ripple design lines\n__________________________________________________________________________________________\nNike React Infinity Run Flyknit ($120, originally $160; nike.com)\nNike React Infinity Run Flyknit\nDesigned to reduce injury, this lightweight shoe keeps you running with a stable feel, increased flexibility and maximum responsiveness.\n__________________________________________________________________________________________\nNike Metcon 5 ($97.50, originally $130; nike.com)\nNike Metcon 5\nPick up Nike's legendary crosstrainer at a discount. It features stability for heavy lifting, traction made for speed, and durability so you can train like a pro.\nFor more great Nike deals, check out CNN Coupons.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/06/cnn-underscored/nike-sale-footwear/index.html"}