{"authors": ["Daniel Burke", "Cnn Religion Editor"], "date_download": "2020-05-04 15:59:22", "date_modify": "2020-05-04 15:59:22", "date_publish": "2020-03-31 19:43:32", "description": "For the second time in two days, police have charged a pastor with defying public orders against large gatherings by holding church services with hundreds of members. And despite the charge, he says the church doors will still be open Sunday.", "filename": "2020_03_31_us_louisiana-pastor-arrest-tony-spell_index_1588607962.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200318105619-02-louisiana-church-service-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_us_louisiana-pastor-arrest-tony-spell_index_1588607962.html", "title": "A second pastor has been charged with violating public orders against large gatherings", "title_page": "A second pastor has been charged with violating public orders against large gatherings - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) For the second time in two days, police have charged a pastor with defying public orders against large gatherings by holding church services with hundreds of members. And despite the charge, he says the church doors will still be open Sunday.\nOn Tuesday police in suburban Baton Rouge, Louisiana, issued Pastor Tony Spell of Life Tabernacle Church a misdemeanor summons for six counts of violating the governor's executive order barring large gatherings.\n\"Instead of showing the strength and resilience of our community during this difficult time, Mr. Spell has chosen to embarrass us for his own self-promotion,\" said Central Police Chief Roger Corcoran Tuesday in a statement\n\"Mr. Spell will have his day in court where he will be held responsible for his reckless and irresponsible decisions that endangered the health of his congregation and our community,\" Corcoran added.\nSpell told CNN that opening the church is no more risk than the hundreds of people shopping at stores.\nRead More", "url": "https://www.cnn.com/2020/03/31/us/louisiana-pastor-arrest-tony-spell/index.html"}