{"authors": [], "date_download": "2020-05-04 16:23:03", "date_modify": "2020-05-04 16:23:03", "date_publish": "2020-04-06 16:33:15", "description": "Bring the \"happiest place on earth\" to your home during ShopDisney's Pixie Perfect Sitewide Savings Event, where you can take 25% off orders of $100 or more, 20% off orders of $75 or more, 15% off orders pf $50 or more, plus free shipping on orders of $75 or more.", "filename": "2020_04_06_cnn-underscored_shop-disney-sale-pixie-perfect_index_1588609383.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406113140-disney-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_cnn-underscored_shop-disney-sale-pixie-perfect_index_1588609383.html", "title": "ShopDisney sale: Save on toys at the Pixie Perfect Savings Event", "title_page": "ShopDisney sale: Save on toys at the Pixie Perfect Savings Event - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Disney theme parks may be closed, and kids are bummed about being stuck inside — but help is on the way. Bring the \"happiest place on earth\" to your home during ShopDisney's Pixie Perfect Sitewide Savings Event, where you can take 25% off orders of $100 or more, 20% off orders of $75 or more, 15% off orders pf $50 or more, plus free shipping on orders of $75 or more.\nFill the playroom with \"Frozen\" royalty with a Queen Anna and Snow Queen Elsa Classic Doll Set, the power of the speedway with a Lightning McQueen RC Racer Remote Control Car Set inspired by the movie \"Cars\" or cook up some fun with Tiana from \"The Princess and the Frog.\"\nJust be sure to apply code SAVEMORE during checkout to snag the savings, through April 8 only. Browse through everything on sale, or check out a few of the toys we think your kiddos will love below.\nMickey Mouse Barbeque Grill Play Set ($49.95; shopdisney.com)\nMickey Mouse Barbeque Grill Play Set\nShow your little one the joy of summertime grilling with this Mickey Mouse Barbeque Grill Play Set. This battery-powered toy even features a sizzling noise when \"grilling\" and charcoal that lights up.\n_________________________________________________________\nAnna Classic Doll with Ring — Frozen ($14.95; shopdisney.com)\nAnna Classic Doll with Ring — Frozen\nBring the magical world of Arendelle to your home with the Anna Classic Doll. She also comes with a human-sized jeweled ring — so your kid and their doll can both look stylish.\n_________________________________________________________\nMickey Mouse Plush — runDisney 2019 — Small ($5.50, originally $21.99; shopdisney.com)\nMickey Mouse Plush — runDisney 2019 — Small\nMade exclusively for Walt Disney World Resort, this collectible Mickey Mouse Plush celebrates \"runDisney2019\" with his felt \"I Did It!\" metal.\n_________________________________________________________\nCars Neon Race-Off Track Set ($12.98, originally $39.95; shopdisney.com)\nCars Neon Race-Off Track Set\nShow off Lightning McQueen's speed with this glow-in-the-dark racetrack. Look out for the secret trap door! Use the code EXTRA25 for an additional 25% off this item.\n_________________________________________________________\nErnesto Shufflerz Walking Figure — Coco ($5.98, originally $12.95; shopdisney.com)\nErnesto Shufflerz Walking Figure -- Coco\nDance the day away with the Ernesto Shufflerz Walking Figure. Press his head 10 times to watch him strut. If you want to keep the party going, collect all the Coco Shufflerz (like this one).\n_________________________________________________________\nRey Action Figure from \"Star Wars: The Last Jedi\" The Black Series ($11.98, originally $19.95; shopdisney.com)\nRey Action Figure from \"Star Wars: The Last Jedi\" The Black Series\nThe Rey Action Figure is inspired by the \"Star Wars: The Last Jedi\" movie and a part of the Star Wars: The Black Series by Hasbro. She comes with four accessories including the must-have lightsaber.\n_________________________________________________________\nPatriot Doll — Marvel Rising ($11.99, originally $19.95; shopdisney.com)\nPatriot Doll -- Marvel Rising\nFight the forces of evil with the Patriot Doll inspired by the Disney Channel original movie, \"Marvel Rising: Secret Warriors.\"\n_________________________________________________________\nThe Lion King Deluxe Figure Set ($12.98, originally $26.99; shopdisney.com)\nThe Lion King Deluxe Figure Set\nParents may experience nostalgia from their own childhood with The Lion King Deluxe Figure Set. Let your children play pretend with the original 1994 Pride Rock characters.\n________________________________________________________\nCars L.A. International Speedway Launcher Case with Chick Hicks ($29.95; shopdisney.com)\nCars L.A. International Speedway Launcher Case with Chick Hicks\nTake your need for speed all over the USA with the Cars L.A. International Speedway Launcher Case. Pull your car back with the lever at the starting line, and watch Chick Hicks fly all the way to the Piston Cup finish line.\n________________________________________________________\nAladdin Action Figure with Abu ($12.95; shopdisney.com)\nAladdin Action Figure with Abu\nLet the Aladdin Action Figure with Abu show you the world. He might even invite you on a magic carpet ride.\nFor more great deals, check out CNN Coupons.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/06/cnn-underscored/shop-disney-sale-pixie-perfect/index.html"}