{"authors": ["Barbara Starr", "Cnn Pentagon Correspondent"], "date_download": "2020-05-04 16:06:09", "date_modify": "2020-05-04 16:06:09", "date_publish": "2020-04-01 22:18:31", "description": "President Donald Trump tweeted Wednesday, without citing any evidence, that the administration has information that \"Iran or its proxies are planning a sneak attack on US troops and/or assets in Iraq.\" Trump added, \"If this happens, Iran will pay a very heavy price, indeed!\"", "filename": "2020_04_01_politics_trump-iran-threat_index_1588608369.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200314100721-al-taji-base-attack-0314-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_trump-iran-threat_index_1588608369.html", "title": "Trump threatens heavy price if Iran conducts 'sneak attack' on US troops", "title_page": "Trump threatens heavy price if Iran conducts 'sneak attack' on US troops - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) President Donald Trump tweeted Wednesday, without citing any evidence, that the administration has information that \"Iran or its proxies are planning a sneak attack on US troops and/or assets in Iraq.\" Trump added, \"If this happens, Iran will pay a very heavy price, indeed!\"\nThe President's tweet, which the White House did not elaborate upon, comes as the US has picked up more intelligence in the last several days from an ongoing stream indicating that Iranian-backed militias inside Iraq are potentially planning an attack against US forces in the near future, one US official said.\nThe intelligence is some of the latest in a threat stream that the US has been monitoring in Iraq in recent months, the official said. It follows the US killing of Iran's second most powerful official, Gen. Qasem Soleimani , in January, and tit-for-tat strikes between the US and Iraq-based militias in March.\nLater on Wednesday, when a reporter asked for details on what his tweet meant, Trump said he didn't want to elaborate.\n\"I don't want to say, but we just have information that they were planning something, and it's very good information,\" the President said. He added that the plot \"was led by Iran.\"\nRead More", "url": "https://www.cnn.com/2020/04/01/politics/trump-iran-threat/index.html"}