{"authors": [], "date_download": "2020-05-04 20:23:43", "date_modify": "2020-05-04 20:23:43", "date_publish": "2020-04-17 11:51:15", "description": "CROOKSTON, Minn. (AP) — The widow of an East Grand Forks man is suing an attorney who drew up a will that left her husband's estate of more than $5 million to a church the couple did not attend....", "filename": "_2e2585d58e6e4a7550dc4a13c459ac30_1588623823.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2e2585d58e6e4a7550dc4a13c459ac30_1588623823.html", "title": "Widow sues lawyer who drew up will leaving estate to church", "title_page": "Widow sues lawyer who drew up will leaving estate to church", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CROOKSTON, Minn. (AP) — The widow of an East Grand Forks man is suing an attorney who drew up a will that left her husband’s estate of more than $5 million to a church the couple did not attend.\nCindy Driscoll is suing East Grand Forks attorney Gerard Neil and his law firm in Polk County District Court, alleging malpractice, negligence and fraudulent misrepresentation.\nDriscoll says Neil, who wrote a new will for her husband Randy in the weeks before his death in 2015, was the registered agent for the Sacred Heart Catholic Church foundation and a board member.\nThe Star Tribune says Neil vehemently denies the allegations in Driscoll’s lawsuit which focuses on Neil’s actions in drawing up Randy Driscoll’s will and trust and gaining Cindy Driscoll’s consent to them.\nThe money issues over Randy Driscoll’s estate have been largely settled. In 2018, the Driscoll family and Sacred Heart agreed to a deal that gave the church $1.5 million. Cindy Driscoll got the title to her home and $1 million in cash.\nFive hundred acres of prime Red River Valley farmland went to other Driscoll family members, who had to come up with nearly $900,000 to complete the deal.", "url": "https://apnews.com/2e2585d58e6e4a7550dc4a13c459ac30"}