{"authors": [], "date_download": "2020-05-04 20:18:45", "date_modify": "2020-05-04 20:18:45", "date_publish": "2020-02-05 07:15:09", "description": "Today in History Today is Wednesday, Feb. 5, the 36th day of 2020. There are 330 days left in the year. Today's Highlight in History:", "filename": "_c9ab8949044a4c9d91f12c112e6a3837_1588623525.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c9ab8949044a4c9d91f12c112e6a3837_1588623525.html", "title": "Today in History", "title_page": "Today in History", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Today in History\nToday is Wednesday, Feb. 5, the 36th day of 2020. There are 330 days left in the year.\nToday’s Highlight in History:\nOn Feb. 5, 2001, four disciples of Osama bin Laden went on trial in New York in the 1998 bombings of two U.S. embassies in Africa. (The four were convicted and sentenced to life in prison without parole.)\nOn this date:\nIn 1811, George, the Prince of Wales, was named Prince Regent due to the mental illness of his father, Britain’s King George III.\nIn 1917, Mexico’s present constitution was adopted by the Constitutional Convention in Santiago de Queretaro. The U.S. Congress passed, over President Woodrow Wilson’s veto, an act severely curtailing Asian immigration.\nIn 1918, during World War I, the Cunard liner SS Tuscania, which was transporting about 2,000 American troops to Europe, was torpedoed by a German U-boat in the Irish Sea with the loss of more than 200 people.\nIn 1937, President Franklin D. Roosevelt proposed increasing the number of U.S. Supreme Court justices; the proposal, which failed in Congress, drew accusations that Roosevelt was attempting to “pack” the nation’s highest court.\nIn 1971, Apollo 14 astronauts Alan Shepard and Edgar Mitchell stepped onto the surface of the moon in the first of two lunar excursions.\nIn 1983, former Nazi Gestapo official Klaus Barbie, expelled from Bolivia, was brought to Lyon (lee-OHN’), France, to stand trial. (He was convicted and sentenced to life in prison -- he died in 1991.)\nIn 1988, the Arizona House impeached Republican Gov. Evan Mecham (MEE’-kuhm), setting the stage for his trial in the state Senate, where he was convicted of obstructing justice and misusing state funds allegedly funneled to his Pontiac dealership.\nIn 1993, President Bill Clinton signed the Family and Medical Leave Act, granting workers up to 12 weeks unpaid leave for family emergencies.\nIn 1994, white separatist Byron De La Beckwith was convicted in Jackson, Mississippi, of murdering civil rights leader Medgar Evers in 1963, and was immediately sentenced to life in prison. (Beckwith died Jan. 21, 2001 at age 80.)\nIn 1999, Former heavyweight boxing champion Mike Tyson was sentenced in Rockville, Md., to a year in jail for assaulting two motorists following a traffic accident (he ended up serving 3 1/2 months).\nIn 2002, A federal grand jury in Alexandria, Va., indicted John Walker Lindh on ten charges, alleging he was trained by Osama bin Laden’s network and then conspired with the Taliban to kill Americans. (Lindh later pleaded guilty to lesser offenses and was sentenced to 20 years in federal prison. He was released in May 2019 after serving more than 17 years.)\nIn 2009, Supreme Court Justice Ruth Bader Ginsburg underwent surgery for pancreatic cancer.\nTen years ago: Toyota’s president, Akio Toyoda, emerged from seclusion to apologize and address criticism that the automaker had mishandled a crisis over sticking gas pedals.\nFive years ago: Jordan stepped up its air attacks on Islamic State facilities in Syria and expanded its airstrikes into Iraq for the first time after a captured Jordanian pilot was burned to death by the militant group. At the National Prayer Breakfast, President Barack Obama called the Islamic State group a “death cult” and condemned those who seek to use religion as a rationale for violence. RadioShack filed for Chapter 11 bankruptcy protection and said it would sell up to 2,400 stores.\nOne year ago: In his State of the Union address, President Donald Trump called on Washington to end what he called “ridiculous partisan investigation” and cast aside “revenge, resistance and retribution;” Trump accepted no blame for the rancorous atmosphere and refused to yield on the hard-line immigration policies that had infuriated Democrats and forced a government shutdown. In the Democratic response, Stacey Abrams, who had lost her bid in Georgia to become America’s first black woman governor, accused Trump of abandoning working Americans and bringing partisan and cultural discord. Chanting for yet another title, hundreds of thousands of fans jammed downtown Boston for a parade celebrating the New England Patriots’ sixth Super Bowl victory.\nToday’s Birthdays: Baseball Hall of Famer Hank Aaron is 86. Actor Stuart Damon is 83. Tony-winning playwright John Guare (gwayr) is 82. Financial writer Jane Bryant Quinn is 81. Actor David Selby is 79. Singer-songwriter Barrett Strong is 79. Football Hall of Famer Roger Staubach is 78. Movie director Michael Mann is 77. Rock singer Al Kooper is 76. Actress Charlotte Rampling is 74. Racing Hall of Famer Darrell Waltrip is 73. Actress Barbara Hershey is 72. Actor Christopher Guest is 72. Actor Tom Wilkinson is 72. Actor-comedian Tim Meadows is 59. Actress Jennifer Jason Leigh is 58. Actress Laura Linney is 56. Rock musician Duff McKagan (Velvet Revolver) is 56. World Golf Hall of Famer Jose Maria Olazabal is 54. Actor-comedian Chris Parnell is 53. Rock singer Chris Barron (Spin Doctors) is 52. Singer Bobby Brown is 51. Actor Michael Sheen is 51. Actor David Chisum is 50. Country singer Sara Evans is 49. Country singer Tyler Farr is 36. Neo-soul musician Mark Shusterman (Nathaniel Rateliff & the Night Sweats) is 35. Actor-singer Darren Criss is 33. Actor Alex Brightman is 33. Actor Henry Golding is 33. Rock musician Kyle Simmons (Bastille) is 32. Actor Jeremy Sumpter is 31. Drummer Graham Sierota (Echosmith) is 21.\nThought for Today: “Men do not desire to be rich, but to be richer than other men.” — John Stuart Mill, English philosopher and economist (1806-1873).\nCopyright 2020, The Associated Press. All rights reserved.", "url": "https://apnews.com/c9ab8949044a4c9d91f12c112e6a3837"}