{"authors": [], "date_download": "2020-05-04 20:08:52", "date_modify": "2020-05-04 20:08:52", "date_publish": "2020-04-08 21:24:34", "description": "CINCINNATI (AP) — Cincinnati had a list of top targets heading into free agency, and coach Zac Taylor says the Bengals got the players they wanted. The Bengals announced Wednesday they had...", "filename": "_7ce0a3181d3e54315821408ffa2b3a03_1588622932.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f68b681948404d40a556f9df6e6faf67/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7ce0a3181d3e54315821408ffa2b3a03_1588622932.html", "title": "Taylor encouraged by free agent haul as Bengals rebuild", "title_page": "Taylor encouraged by free agent haul as Bengals rebuild", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Dec. 1, 2019, file photo, Cincinnati Bengals wide receiver A.J. Green practices before an NFL football game against the New York Jets in Cincinnati. The Bengals used their franchise tag on A.J. Green, giving them time to try to work out a long-term deal with the star who is one of the most accomplished receivers in franchise history and would be a vital part of breaking in a new quarterback.(AP Photo/Frank Victores, File)\nFILE - In this Dec. 1, 2019, file photo, Cincinnati Bengals wide receiver A.J. Green practices before an NFL football game against the New York Jets in Cincinnati. The Bengals used their franchise tag on A.J. Green, giving them time to try to work out a long-term deal with the star who is one of the most accomplished receivers in franchise history and would be a vital part of breaking in a new quarterback.(AP Photo/Frank Victores, File)\nCINCINNATI (AP) — Cincinnati had a list of top targets heading into free agency, and coach Zac Taylor says the Bengals got the players they wanted.\nThe Bengals announced Wednesday they had reached agreements with eight unrestricted free agents since the new league year started March 18, though all eight still must pass physicals. The Bengals’ top targets included defensive tackle D.J. Reader and cornerback Trae Waynes as Cincinnati spent lots of money after going 2-14 in Taylor’s inaugural season.\nTaylor said the players Cincinnati landed in free agency speaks to how the Bengals are viewed outside their own building.\n“It’s just encouraging to know that there’s a lot of excitement building around our organization right now,” Taylor said on a Zoom call with reporters.\n“Guys are excited to be a part of it and look forward to getting to know those guys. Who knows the next time we’ll get a chance to actually meet them physically. But it was certainly a fun process.”\nNext will come the NFL draft with the Bengals holding the No. 1 overall draft pick and expected to take quarterback Joe Burrow after using the franchise tag on wide receiver A.J. Green last month.\nReader was the biggest piece of Cincinnati’s new free agents, agreeing to a four-year, $53 million deal. The 6-foot-3, 347-pound tackle spent the past four years with Houston, and he has started 52 of his 61 games. He has 154 tackles with 6 1/2 sacks and was a fifth-round pick out of Clemson in 2016. The Bengals like his versatility.\n“Can play a lot of different positions up front,” Taylor said. “He can be a three-down player for you and really affect the game,” Taylor said. “He’s great against the run, really affects the pass during the pass game. Great energy. He’s somebody (defensive line coach) Nick Eason has known a long time back to both their Clemson days.”\nCornerback Trae Waynes agreed to a three-year contract for $42 million. The other new Bengals include safety Vonn Bell, linebacker Josh Bynes, cornerbacks LeShaun Sims and Mackensie Alexander, wide receiver Mike Thomas and guard Xavier Su’a-Filo.\nSix of the free agents come from playoff teams this past season, which Taylor said didn’t hurt either.\n“When you get a guy fresh off a playoff run, that’s still very fresh in his mind of how he approached the season, how they attacked it as a team,” Taylor said. “It certainly helps our culture when you add guys that have recently been playing for a championship, and obviously that’s where we intend to be very quickly.”\nSix of the free agents brought in also play defense.\nWaynes had seven interceptions in his 74 games after being the 11th pick overall in 2015 out of Michigan State by Minnesota. Bell has eight sacks, seven forced fumbles and seven recovered fumbles in four seasons with New Orleans.\n“Trae was certainly a guy we felt good about,” Taylor said. “I watched every target he had this year. He brings a lot of toughness to that side of the ball as well, that position as well. He’s a hungry guy who’s played some good football.”\nBynes, who received a one-year contract, now is with his fourth team after playing for Baltimore, Detroit and Arizona. He has 4 1/2 career sacks, four interceptions and three forced fumbles. Sims and Alexander also are on one-year deals.\nThe Bengals landed Su’a-Filo with a three-year deal the day after free agency started. The 6-foot-4, 310-pound Su’a-Filo has started 53 of 75 games starting his career with Houston before spending the past two seasons with Dallas.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/7ce0a3181d3e54315821408ffa2b3a03"}