{"authors": [], "date_download": "2020-05-04 20:25:57", "date_modify": "2020-05-04 20:25:57", "date_publish": "2020-04-08 20:26:03", "description": "NEW YORK (AP) — Stocks that moved heavily or traded substantially on Wednesday: FedEx Corp., up $9.59 to $125.54. Amazon will suspend a delivery service that competed with FedEx and...", "filename": "_769d07998fb92089b85564255ba0e694_1588623957.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_769d07998fb92089b85564255ba0e694_1588623957.html", "title": "FedEx, Levi Strauss rise; TAL Education, Party City fall", "title_page": "FedEx, Levi Strauss rise; TAL Education, Party City fall", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NEW YORK (AP) — Stocks that moved heavily or traded substantially on Wednesday:\nFedEx Corp., up $9.59 to $125.54.\nAmazon will suspend a delivery service that competed with FedEx and UPS in the U.S.\nMcDonald’s Corp., up $1.90 to $177.49.\nSales fell 22% in March, and the company withdrew its financial forecasts and suspended its stock buyback program.\nLevi Strauss & Co., up $1.12 to $13.13.\nThe jeans maker reported earnings that easily beat analysts’ forecasts.\nTAL Education Group, down $3.76 to $52.06.\nThe Beijing-based company said it discovered that an employee had been fraudulently inflating sales.\nParty City Holdco, Inc., down 3 cents to $0.47.\nThe company said it would furlough 90% of its store employees and cut back on spending.\nPinterest, Inc., up $1.77 to $16.83.\nThe company forecast that its first-quarter revenue would meet forecasts, but it pulled its full-year outlook.\nGroup 1 Automotive, Inc., up $5.47 to $50.62.\nThe owner of auto dealerships said it was canceling its dividend and share repurchase program.\nSage Therapeutics, Inc., up 98 cents to $30.01.\nThe biopharmaceuticals company announced a restructuring that will cut its staff count by about half.", "url": "https://apnews.com/769d07998fb92089b85564255ba0e694"}