{"authors": ["Overnight Editor"], "date_download": "2020-05-04 20:14:56", "date_modify": "2020-05-04 20:14:56", "date_publish": "2020-04-29 09:30:03", "description": "His attorney asked a question. The subject of the hit Netflix series replied with some TMI.", "filename": "entry_joe-exotic-nsfw-court-story_n_5ea92ce1c5b6fb98a2b5131b_1588623296.html", "image_url": "https://img.huffingtonpost.com/asset/5ea2714e2500007d2b6b8738.jpeg?cache=5wvzs0xcem&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_joe-exotic-nsfw-court-story_n_5ea92ce1c5b6fb98a2b5131b_1588623296.html", "title": "'Tiger King' Juror Reveals The NSFW Story Joe Exotic Tried To Tell In Court", "title_page": "'Tiger King' Juror Reveals The NSFW Story Joe Exotic Tried To Tell In Court | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "A juror in the trial of Joe Exotic, the subject of the hit Netflix documentary “Tiger King,” says he went off on a raunchy tangent during one line of questioning that left her “dumbfounded.”\nWhen his attorney asked where he was when he received a certain phone call, Exotic answered with his trademark TMI.\n“I think he said he was in Oklahoma City or Edmond or something and so he headed back to the zoo, but they stopped at a motel on the way and filmed a softcore porn,” the juror, identified only as Kristin, told Fox Nation’s Nancy Grace in an extended version of an interview from “A Tiger King Investigation.”\nKristin also said the comment left Exotic’s attorney shaking his head.\n“He said ‘OK, that’s enough,’” she recalled.\nExotic ― real name Joseph Maldonado-Passage ― was convicted in a failed murder-for-hire plot to kill Big Cat Rescue founder Carole Baskin as well as multiple federal wildlife charges. He is currently serving a 22-year sentence, but Kristin said some of her fellow jurors felt for Exotic even as they convicted him.\n“We had a few jurors that were crying when we went back into the courtroom,” she said, adding that some kept their heads down.\n“I think they just felt bad,” she added.", "url": "https://www.huffpost.com/entry/joe-exotic-nsfw-court-story_n_5ea92ce1c5b6fb98a2b5131b"}