{"authors": [], "date_download": "2020-05-04 20:13:37", "date_modify": "2020-05-04 20:13:37", "date_publish": "2020-04-16 18:34:58", "description": "LEMON GROVE, Calif. (AP) — Twin 15-year-old girls were killed and a suspect was arrested after an apparent domestic-violence shooting near San Diego that also left a man wounded, authorities said...", "filename": "_20ed1d964fa03872992797f6c58cdb19_1588623217.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e2e85e835e9042d4a215a7d979deb4c2/2400.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_20ed1d964fa03872992797f6c58cdb19_1588623217.html", "title": "Twin girls killed, suspect arrested in California shooting", "title_page": "Twin girls killed, suspect arrested in California shooting", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This Wednesday, April 15, 2020 photo shows Sheriff's deputies block off a street in front of the scene where two teens were found dead in in Lemon Grove , Calif. Twin 15-year-old girls were killed and a suspect was arrested after an apparent domestic-violence shooting near San Diego that also left a man wounded, authorities said Thursday. (John Gibbins/The San Diego Union-Tribune via AP)\nThis Wednesday, April 15, 2020 photo shows Sheriff's deputies block off a street in front of the scene where two teens were found dead in in Lemon Grove , Calif. Twin 15-year-old girls were killed and a suspect was arrested after an apparent domestic-violence shooting near San Diego that also left a man wounded, authorities said Thursday. (John Gibbins/The San Diego Union-Tribune via AP)\nLEMON GROVE, Calif. (AP) — Twin 15-year-old girls were killed and a suspect was arrested after an apparent domestic-violence shooting near San Diego that also left a man wounded, authorities said Thursday.\nGunfire was reported around noon Wednesday and a man was seen running from a home in the city of Lemon Grove, the San Diego County Sheriff’s Department said.\nArriving deputies found two girls shot to death and a man suffering from a gunshot wound, Lt. Thomas Seiver said. The man was hospitalized and is expected to survive, he said.\nThe suspected shooter was found about two hours later hiding in the backyard of a nearby home after a manhunt that included a sheriff’s helicopter crew, the Union-Tribune reported.\nDwayne Edward Groves, 38, was arrested on suspicion of murder and attempted murder, sheriff’s department said. It wasn’t immediately known if he has an attorney.\nGroves is the ex-boyfriend of a woman who lived at the home where the shooting occurred, investigators said.\nThe victims were not immediately identified.\nSharon Worth-Hatlee, who lives nearby, told the newspaper that one of her granddaughters was about the same age as the twins.\n“I watched them grow up for years,” Worth-Hatlee said, calling them “really good kids.”", "url": "https://apnews.com/20ed1d964fa03872992797f6c58cdb19"}