{"authors": ["Tom Foreman Jr"], "date_download": "2020-05-04 21:06:44", "date_modify": "2020-05-04 21:06:44", "date_publish": "2020-04-07 13:38:57", "description": "A doctor who was jailed overnight in North Carolina after being accused of paying for a beer at a concert with a counterfeit $100 bill is suing, saying she was singled out for malicious...", "filename": "_67001af42dddd9f543f30da5357da1b2_1588626404.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_67001af42dddd9f543f30da5357da1b2_1588626404.html", "title": "Black doctor jailed over $100 bill sues Charlotte, police", "title_page": "Black doctor jailed over $100 bill sues Charlotte, police", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A doctor who was jailed overnight in North Carolina after being accused of paying for a beer at a concert with a counterfeit $100 bill is suing, saying she was singled out for malicious prosecution because she’s African American.\nDr. Cordula Lutz says she was discriminated against because of her race, falsely accused of a crime and repeatedly humiliated before the case was dropped for lack of probable cause.\n“The lawsuit is all about accountability and making sure that the discrimination, the presumption of guilt, does not continue to become a pattern of habit when dealing with people who are productive citizens who don’t have a criminal history and who do all they can to stay on the straight and narrow,” the doctor’s attorney, Alesha Brown, told The Associated Press.\nThe lawsuit, filed on Jan. 31, also alleges negligence in hiring, false imprisonment, infliction of emotional distress and discrimination at a public accommodation based on race and ethnicity. The defendants include three Charlotte-Mecklenburg officers, the city of Charlotte and Live Nation Entertainment.\nLutz said she went to the Charlotte Amphitheater at the Music Factory in June 2019 to meet a friend at a concert by rapper Jon Bellion. While she waited, she bought a beer with one of two $100 bills her mother had given her during a visit to her parents’ home in Maryland.\nLutz said the bartender marked the bill, indicating it was not counterfeit, and gave her change. She then found her friend and they went to their seats, about ten rows back in front of the stage. Lutz said a Live Nation Entertainment employee approached demanding to see her ticket; she said she was the only African American in the group and the only one asked about her seat.\nShortly afterward, three Charlotte-Mecklenburg police officers approached Lutz, escorted her out of the venue and accused her of presenting a counterfeit bill, the lawsuit said. She asked why they believed it was counterfeit, and one of the officers responded, “Oh, it’s counterfeit because I know,” the lawsuit said.\nThe lawsuit said that the bill had been marked five times with a marker, showing it wasn’t counterfeit.\nAfter they arrived at the jail, she said she was kept in handcuffs while she used the bathroom.\n“Despite the fact that Dr. Lutz did not pose any physical risk or threat to the CMPD Officer, the officer would not remove the handcuffs. As such, Dr. Lutz had to experience the humiliation of having the officer pull her pants up after she finished using the restroom,” the lawsuit said.\nAs morning approached, Lutz had to use the jail phone to cancel her first patient of the day at Atrium Health.\nThe lawsuit suggests that at least one of the officers was surprised to learn who they were arresting: After she was released, a friend said she had told one of the officers that Lutz is a doctor, to which the officer replied “She’s (with emphasis) a doctor?”\n“The way I was treated was inhumane, and I believe the way I was treated was based on the color of my skin,” Lutz told The Charlotte Observer.\nBrown wouldn’t make Lutz available for another interview by the AP, but she told the newspaper in an email that her client still suffers nightmares as a result of her experience. The lawsuit says she’s had to miss work at her family medicine practice in Charlotte to get therapy.\n“To date, Dr. Lutz’s trauma and anguish continues for which she continues to see medical care,” according to the lawsuit.\nNone of the lawyers representing the city of Charlotte, the arresting officer and Live Nation Entertainment responded to emails seeking comment.", "url": "https://apnews.com/67001af42dddd9f543f30da5357da1b2"}