{"authors": [], "date_download": "2020-05-04 16:52:53", "date_modify": "2020-05-04 16:52:53", "date_publish": "2020-02-05 16:49:25", "description": "Now's a great time to upgrade your Apple tech, since a range of tablets, smartwatches and even computers are on sale at Amazon. And since there are so many Apple discounts available now, here's all the information you need in one place:", "filename": "2020_02_05_cnn-underscored__ea926c43e218d65c48bf1bad79648258_index_1588611173.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200205110131-underscored-apple-amazon-sale-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_02_05_cnn-underscored__ea926c43e218d65c48bf1bad79648258_index_1588611173.html", "title": "Amazon is discounting AirPods, the Apple Watch, the whole iPad family and many Mac computers", "title_page": "Apple sale: Amazon is marking down AirPods, the iPad line, AirPods, the Apple Watch and Mac desktops and laptops - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Now's a great time to upgrade your Apple tech, since a range of tablets, smartwatches and even computers are on sale at Amazon. And since there are so many Apple discounts available now, here's all the information you need in one place:\nAirPods\nThis discount applies to Second Generation AirPods and AirPods Pro with either the charging case or the wireless charging case, which dropped last spring.\nThese feature a stronger Bluetooth connection, better battery life and a wider soundstage than the original AirPods. And if you have a pair of first-generation AirPods, you can upgrade to the wireless charging case, thanks to the discount. Plus, it's a way to get a new, clean case if yours has started to show signs of wear.\nAirPods with Charging Case ($139, originally $159; amazon.com )\nAirPods with Wireless Charging Case ($169, originally $199; amazon.com )\nWireless Charging Case for AirPods ($69, originally $79; amazon.com)\nAnd in October 2019, Apple released the impressive AirPods Pro — so impressive, in fact, that we declared them the best true wireless earbuds. They feature an updated design that adds active noise cancellation and a transparency mode with Adaptive EQ for a customized listening experience, along with silicone ear tips for a tighter and more secure fit. Essentially, they're our favorites on every level, and with a discount, they're even easier to love.\nAirPods Pro ($234.98, originally $249; amazon.com)\nApple Watch\nOver the past few years, Apple Watch has gone from an iPhone accessory to a standalone device, and now the newest model, Series 5, is seeing steep discounts across the GPS and Cellular models on Amazon. In fact, the 40mm GPS Gold Aluminum Case with Pink Sport Band is at an all-time low price of $349, down from $399. With Series 5 Apple Watch, the display is always on, so there's no need to raise your arm to see the time. Ultimately, this change makes it feel more like a real watch. You can see our full review of the Series 5 here, and see our best smartwatches roundup here.\n40mm Apple Watch Series 5 GPS Gold Aluminum Case with Pink Sport Band ($349, originally $399; amazon.com )\n44mm Apple Watch Series 5 GPS Gold Aluminum Case with Pink Sport Band ($379, originally $429; amazon.com )\n44mm Apple Watch Series 5 GPS Silver Aluminum Case with White Sport Band ($379, originally $429; amazon.com )\n44mm Apple Watch Series 5 GPS + Cellular Gold Aluminum Case with Pink Sport Band ($479; amazon.com )\n44mm Apple Watch Series 5 GPS + Cellular Silver Aluminum Case with White Sport Band ($479; amazon.com )\n44mm Apple Watch Series 5 GPS + Cellular Space Gray Aluminum Case with Black Spot Band ($479, originally $529; amazon.com )\n44mm Apple Watch Series 5 GPS + Cellular Gold Stainless Steel Case with Gold Milanese Loop ($749, originally $799; amazon.com )\n44mm Apple Watch Series 5 GPS + Cellular Space Black Stainless Steel Case with Black Sport Band ($699, originally $749; amazon.com )\n40mm Apple Watch Series 5 GPS + Cellular Stainless Steel Case with White Sport Band ($649, originally $699; amazon.com )\n44mm Apple Watch Series 5 GPS + Cellular Stainless Steel Case with White Sport Band ($699, originally $749; amazon.com )\n44mm Apple Watch Series 5 GPS + Cellular Stainless Steel Case with Milanese Loop ($749, originally $799; amazon.com)\niPad\nThe entire iPad family has grown into a dynasty thanks to a huge update this past fall with iPad OS, a specific version of iOS 13 for the iPad that brought performance improvements and new computer-like features to all models. It makes every version even more powerful, from the entry-level 7th Generation iPad to the 12.9-inch iPad Pro.\n7th Gen iPad\nRight now, the 7th Generation iPad with a 10.2-inch Retina True Tone display is seeing a solid discount, which makes entering the iPad market more affordable. The base Wi-Fi model with 32GB of storage is just $279 from $329.\n7th Generation iPad Wi-Fi with 32GB in Silver ($299, originally $329; amazon.com )\n7th Generation iPad Wi-Fi with 128GB in Silver ($379.99, originally $429; amazon.com )\n7th Generation iPad Wi-Fi with 128GB in Space Gray ($379, originally $429; amazon.com)\niPad mini\nThose looking for a more portable tablet can turn to the iPad mini. It's in its fifth generation, with a 7.9-inch Retina True Tone display, a Touch ID sensor for secure unlocking and payments, an A12 Bionic Chip to power iOS 13, and support for the first-generation Apple Pencil. Discounts are rare on the iPad mini, but Amazon has shaved $20 off the price of the 64GB Wi-Fi model in silver.\niPad mini Wi-Fi 256GB in Space Gray ($522, originally $549; amazon.com)\n10.5-inch iPad Air\nVersions of the 10.5-inch iPad Air are seeing competitive discounts when compared with the current iPad Pro line. Those who want Face ID will not find it on the iPad Air; it uses a Touch ID sensor for unlocking and secure payments. But you will get a 10.5-inch Retina True Tone Display, an A12 Bionic Chip and stereo speakers.\niPad Air Wi-Fi 64GB in Space Gray ($479, originally $499; amazon.com)\nThe current 11-inch iPad Pro and 12.9-inch iPad Pro are getting a longer than normal life cycle, and both still represent the top of the line iPad experience. You'll get an edge-to-edge Liquid Retina Display which boasts True Tone, a wide color gamut, and Apple's \"Pro-Motion\" 120Hz refresh rate on both. Plus, these run iPadOS swimmingly, thanks to an A12X Bionic Chip with a Neural Engine. And of course, you'll get Face ID that works no matter how you hold the iPad.\n11-inch iPad Pro\n11-inch iPad Pro Wi-Fi + Cellular 256GB in Silver ($935.97, originally $1,099; amazon.com )\n11-inch iPad Pro Wi-Fi 512GB in Silver ($979.96, originally $1,149; amazon.com )\n11-inch iPad Pro Wi-Fi 1TB in Silver ($1,183.45, originally $1,349; amazon.com )\n11-inch iPad Pro Wi-Fi + Cellular 1TB in Space Gray ($1,349, originally $1,499; amazon.com)\n12.9-inch iPad Pro\n12.9-inch iPad Wi-Fi + Cellular 64GB in Space Gray ($1,049.98, originally $1,149; amazon.com )\n12.9-inch iPad Wi-Fi + Cellular 64GB in Silver ($999.93, originally $1,149; amazon.com )\n12.9-inch iPad Wi-Fi 256GB in Silver ($949.95, originally $1,149; amazon.com )\n12.9-inch iPad Wi-Fi + Cellular 256GB in Space Gray ($1,149.98, originally $1,299; amazon.com )\n12.9-inch iPad Wi-Fi + Cellular 512GB in Silver ($1,349.99, originally $1,499; amazon.com)\nMac\nNow might be the perfect time to treat yourself to a new computer. Amazon has discounted the current generation MacBook Air, the 13-inch MacBook Pro, the 16-inch MacBook Pro and even a few iMacs.\nMacbook Air\nThe MacBook Air is Apple's entry-level Mac laptop and offers solid specs, especially with a discount of over $100. No matter the model, you'll be able to pick from gold, silver or Space Gray. You'll also get a 13.3-inch Retina display with True Tone, which is quite vibrant. And for secure unlocking and payments, there's a built-in Touch ID sensor. Right now, take $149.01 off the base model with an Intel Core i5, 8GB of RAM and 128GB of storage.\nMacBook Air — Intel Core i5 processor, 8GB of RAM and 128GB SSD in Silver ($898.95, originally $1,099; amazon.com )\nMacBook Air — Intel Core i5 processor, 8GB of RAM and 256GB SSD in Silver ($949.95, originally $1,299; amazon.com)\n13-inch Macbook Pro\nApple updated the 13-inch MacBook Pro with more efficient processors this past summer. It still has the butterfly keyboard design, and it's the preferred laptop of most creatives on a budget, thanks to a sharp and vibrant 13-inch Retina True Tone display paired with a 1.4GHz or 2.4GHz Intel Core i5 processor and fast SSD storage. Plus, all models feature the Touch Bar for easy control and four USB-C ports for charging on any side.\n13-inch MacBook Pro — 1.4GHz Intel Core i5 processor, 8GB of RAM, 128GB of storage in Silver ($1,219.92, originally $1,299; amazon.com )\n13-inch MacBook Pro -- 1.4GHz Intel Core i5 processor, 8GB of RAM, 256GB of storage in Space Gray ($1,349, originally $1,499; amazon.com)\n16-inch Macbook Pro\nApple introduced the 16-inch MacBook Pro last fall, shortly after AirPods Pro. It has an all new keyboard, much better speakers, more efficient processors and a new thermal cooling system. Basically, it's a top-notch update.\n16-inch MacBook Pro — Intel Core i9 processor, 16GB of RAM, 1TB of storage in Silver ($2,547.92, originally $2,799; amazon.com)\niMac\nOn the desktop side, Apple's iMac represents the complete package. You can get this all-in-one in your choice of a 21.5-inch or 27.5-inch size.\n27-inch Retina 5K iMac — 3.1GHz Intel Core i5 processor, 8GB of RAM, 1TB of storage ($1,899, originally $1,999; amazon.com)\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/02/05/cnn-underscored/apple-ipad-airpods-mac-watch-sale-amazon/index.html"}