{"authors": ["Veronica Stracqualursi", "Lindy Royce"], "date_download": "2020-05-04 16:18:50", "date_modify": "2020-05-04 16:18:50", "date_publish": "2020-04-03 20:02:37", "description": "The search for two members of the Kennedy family -- Maeve Kennedy McKean and her son, Gideon -- was suspended 26 hours after they were reported missing in the Chesapeake Bay near Annapolis, Maryland, the Coast Guard said Friday night.", "filename": "2020_04_03_politics_kennedy-boat-missing-chesapeake-bay_index_1588609130.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403151722-maeve-kennedy-mckean-family-2019-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_kennedy-boat-missing-chesapeake-bay_index_1588609130.html", "title": "Search suspended for two members of Kennedy family lost in Chesapeake Bay", "title_page": "Maeve Kennedy McKean and her son, Gideon: Search suspended for two members of Kennedy family lost in Chesapeake Bay - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The search for two members of the Kennedy family -- Maeve Kennedy McKean and her son, Gideon -- was suspended 26 hours after they were reported missing in the Chesapeake Bay near Annapolis, Maryland, the Coast Guard said Friday night.\nAuthorities confirmed McKean and her 8-year-old son were the missing individuals. They were last seen on Thursday evening.\n\"This was a difficult case, and even more difficult to make the decision to suspend the search,\" said Cmdr. Matthew Fine, deputy sector commander and active search suspension authority at Sector Maryland-National Capitol Region command center, late Friday night. \"Our crews and partners did everything they could to find them. We've kept the family informed at every step during the search, and our thoughts are with them tonight.\"\nFormer Maryland Lt. Gov. Kathleen Kennedy Townsend, McKean's mother, said earlier in the evening that the search had turned from a rescue to a recovery mission.\n\"With profound sadness, I share the news that the search for my beloved daughter Maeve and grandson Gideon has turned from rescue to recovery,\" Townsend said in a statement.\nRead More", "url": "https://www.cnn.com/2020/04/03/politics/kennedy-boat-missing-chesapeake-bay/index.html"}