{"authors": [], "date_download": "2020-05-04 20:21:37", "date_modify": "2020-05-04 20:21:37", "date_publish": "2020-04-17 16:18:33", "description": "PROVIDENCE, R.I. (AP) — Two men have been charged with defrauding banks in Rhode Island and Massachusetts out of a total of $150,000 through ATM skimming schemes, federal prosecutors in Rhode...", "filename": "_38334a9ff942d4b8b46104c0e66a2d27_1588623697.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_38334a9ff942d4b8b46104c0e66a2d27_1588623697.html", "title": "2 charged in connection with bank ATM fraud scheme", "title_page": "2 charged in connection with bank ATM fraud scheme", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PROVIDENCE, R.I. (AP) — Two men have been charged with defrauding banks in Rhode Island and Massachusetts out of a total of $150,000 through ATM skimming schemes, federal prosecutors in Rhode Island say.\nRafael Pedro Dutra DaSilva, 29, of Miami, and Guilherme Mendes Altafin, 28, of Sao Paulo, Brazil, allegedly accessed bank accounts at nearly a dozen bank branches with the use of gift and credit cards activated with stolen personal identifying information, prosecutors said in a release Friday.\nDaSilva was apprehended in November after authorities say he attempted several transactions, completing several of them, at an Acushnet, Massachusetts bank.\nAltafin was arrested in December after several attempted transactions at the same ATM, prosecutors said.\nAltafin was ordered detained Thursday by U.S. District Court Magistrate Judge Lincoln Almond on bank fraud and access device fraud charges. An email seeking comment was left with his public defender.\nDaSilva remains in custody in Massachusetts. His appearance in U.S. District Court in Providence has not yet been scheduled. It’s unclear if he has an attorney.", "url": "https://apnews.com/38334a9ff942d4b8b46104c0e66a2d27"}