{"authors": ["Chloe Melas"], "date_download": "2020-05-04 16:54:11", "date_modify": "2020-05-04 16:54:11", "date_publish": "2020-04-08 14:01:45", "description": "Lady Gaga has finally explained her incredibly awkward interview with Jimmy Fallon last week.", "filename": "2020_04_08_entertainment_la_afee8fb491fb6005a37afe8990f63d19_index_1588611251.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408143715-lady-gaga-jimmy-fallon-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_entertainment_la_afee8fb491fb6005a37afe8990f63d19_index_1588611251.html", "title": "Lady Gaga apologizes to Jimmy Fallon after awkward interview", "title_page": "Lady Gaga apologizes to Jimmy Fallon after awkward interview  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Lady Gaga has finally explained her incredibly awkward interview with Jimmy Fallon last week.\nFallon had called Gaga via FaceTime on April 2 and she immediately tried to stop the interview from even taking place.\n\"I can't, Jimmy. I can't talk right now. I'm really sorry, it's just like, a really weird time,\" Lady Gaga said during the Wednesday interview, later adding, \"I can't see you. Am I on TV?\" Frazzled, Gaga first suggested she chat again with Fallon on Friday before quickly pivoting to a Monday appointment. \"I can't tell you everything right now, because I'm still ironing out the details. I have a lot of phone calls to make.\"\nIt turned out that the big news was the announcement of the Global Citizen and the World Health Organization virtual benefit concert titled \"One World: Together At Home,\" which is set for April 18. Fallon is actually one of the hosts alongside Jimmy Kimmel and Stephen Colbert.\n\"I'm so sorry,\" Lady Gaga said on Monday referring to last week's odd chat. \"We weren't quite ready yet, and I really appreciate you being so nice about it. Thank you. I love you; I love your viewers and everyone at home watching; I just wish everybody well.\"\nRead More", "url": "https://www.cnn.com/2020/04/08/entertainment/lady-gaga-interview-jimmy-fallon-apology-video-trnd/index.html"}