{"authors": [], "date_download": "2020-05-04 20:05:17", "date_modify": "2020-05-04 20:05:17", "date_publish": "2020-04-02 20:16:01", "description": "Sunday, April 12 On this date in 1886, Gen. Nelson A. Miles arrived at Bowie Station to open a new campaign against the Apaches. On this date in 1889, Flagstaff residents burned in...", "filename": "_7d3be9bdb6dea3c3eafb9ee64c298215_1588622717.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7d3be9bdb6dea3c3eafb9ee64c298215_1588622717.html", "title": "Arizona history April 12-18", "title_page": "Arizona history April 12-18", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sunday, April 12\nOn this date in 1886, Gen. Nelson A. Miles arrived at Bowie Station to open a new campaign against the Apaches.\nOn this date in 1889, Flagstaff residents burned in effigy Gov. Lewis Wolfley to protest his veto of a bill that was to create Coconino County.\nOn this date in 1902, the Village of Yuma was incorporated as a town. It became a city in 1914.\nOn this date in 1910, A.W. Stewart, a Prescott electrician, built a new airship embodying the principals of the Wright Brothers machine, but with many new improvements of his own.\nMonday, April 13\nOn this date in 1820, Thomas Gardner, one of the earliest pioneers in Santa Cruz County, was born.\nOn this date in 1877, the first Desert Land entry was made by William A. Hancock at Florence.\nOn this date in 1892, Charles D. Poston filed a claim on land which he called “Hole-in-the-Rock.” The land was set aside as the Papago Saguaro National Monument in 1914 and in 1930, became Papago Park.\nOn this date in 1905, the Arizona Dam on the Salt River was washed out.\nOn this date in 1917, the town of Florence turned on its first electric street lights.\nTuesday, April 14\nOn this date in 1919, 2nd Lt. Frank Luke Jr. of Phoenix was posthumously awarded the Medal of Honor for gallantry in action beyond the call of duty.\nOn this date in 1920, delegates to the district meeting of the State Women’s Clubs in Phoenix exchanged heated words over the required medical examinations of students in public schools. Some called the requirements “un-American.”\nOn this date in 1927, the first passenger train of the Southern Pacific of Mexico Railroad left Nogales for Guadalajara.\nOn this date in 1928, Mexican and American firefighters in Nogales joined efforts to save the famous Nogales Brewery, but the building was completely destroyed by the fire.\nWednesday, April 15\nOn this date in 1859, Camp Colorado was established on the Colorado River as a base for California-bound immigrants. One week later the name was changed to Fort Mohave. It was abandoned in 1861 and regarrisoned by troops from California on May 19, 1863.\nOn this date in 1893, an advertisement in the Mohave County Miner offered “loaded dice, perfect work and weight & cannot be detected by outsider. Guaranteed to win. Also the finest marked cards made.”\nOn this date in 1911, President William Howard Taft announced he would veto the joint resolution of Congress providing statehood for Arizona because the proposed state constitution allowed for the recall of judges.\nOn this date in 1915, state offices were closed in the Salt River Valley as thousands gathered to witness the first spillage of water over Roosevelt Dam.\nOn this date in 1928, Arizona Pioneers’ Historical Society and the Southern Pacific Railroad erected a stone shaft over the graves of Union soldiers who were killed in the skirmish with Confederate forces at Picacho Pass on April 15, 1862.\nThursday, April 16\nOn this date in 1915, melting snow in the White Mountains caused floods which took out two dams on the Little Colorado River near St. Johns. Eight people drowned and the reported property damage was $500,000.\nFriday, April 17\nOn this date in 1911, Sarah Bernhardt performed at the Tucson Opera House.\nOn this date in 1894, the business district of Jerome, then the largest mining camp in Arizona, was completely destroyed by fire.\nOn this date in 1913, an air blast, generated by the fall of 3 million tons (2,721,552 metric tonnes) of capping in the Miami mine, killed seven miners. The blast blew ore cars up to 100 feet (30 meters) .\nOn this date in 1930, 17 stills, 2000 gallons (7,571 litres) s of mash and 40 gallons (151 litres) of whiskey were confiscated by Greenlee County officers.\nOn this date in 1931, a government order was issued for the extinction of the wild horse herds in the Coconino National Forest.\nSaturday, April 18\nOn this date in 1924, the Chiricahua National Monument was established.\nOn this date in 1924, 1,600 motorists were stranded at points of entrance to Arizona because of the embargo on all vehicular traffic due to a hoof and mouth quarantine. The occupants of 115 cars at Needles threatened to overpower Arizona border guards, and Governor Hunt ordered the National Guard readied for duty.\nOn this date in 1931, construction began on an Army Airways Operations Building at Fly Field in Yuma.", "url": "https://apnews.com/7d3be9bdb6dea3c3eafb9ee64c298215"}