{"authors": [], "date_download": "2020-05-04 20:24:07", "date_modify": "2020-05-04 20:24:07", "date_publish": "2020-04-21 03:08:40", "description": "CHICAGO (AP) — The Roman Catholic Archdiocese of Chicago has settled a lawsuit that alleged a 7-year-old girl was sexually assaulted at a church camp in 2015, an attorney for the girl announced...", "filename": "_7a97d535a1bf37ea97862bc2747b4a2a_1588623847.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7a97d535a1bf37ea97862bc2747b4a2a_1588623847.html", "title": "Chicago archdiocese settles suit in 2015 abuse of 7-year-old", "title_page": "Chicago archdiocese settles suit in 2015 abuse of 7-year-old", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHICAGO (AP) — The Roman Catholic Archdiocese of Chicago has settled a lawsuit that alleged a 7-year-old girl was sexually assaulted at a church camp in 2015, an attorney for the girl announced Monday.\nAttorney Antonio Romanucci in a news release release did not name the camp where the alleged assault took place. However, he said the girl, now 12, was repeatedly abused by a camp counselor in multiple locations at a suburban Chicago church.\nThe girl told a teacher about the assault, who notified the girl’s father. According to Romanucci, the archdiocese discouraged the father from calling police, contending the allegations would ruin the girl’s reputation and hurt attendance at the church.\nA spokesperson for the archdiocese declined to comment on the case.\nRomanucci asserted the unidentified counselor who the girl accused of abusing her had aroused suspicions about his mental health. It wasn’t immediately known if charges were filed in the case.\n``The church leaders involved had knowledge that this man should not be responsible for young girls,” said Martin Gould, another attorney representing the girl.\nRomanucci said the case reflected ``continued negligence by church leaders.”", "url": "https://apnews.com/7a97d535a1bf37ea97862bc2747b4a2a"}