{"authors": [], "date_download": "2020-05-04 16:24:01", "date_modify": "2020-05-04 16:24:01", "date_publish": "2020-02-28 21:03:32", "description": "If you're a United Airlines flyer looking for a credit card that earns United miles, or one that has United perks, you'll find the best options on our list.", "filename": "2020_02_28_cnn-underscored_best-united-credit-cards_index_1588609441.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200228133835-underscored-united-airlines-plane-against-blue-sky-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_02_28_cnn-underscored_best-united-credit-cards_index_1588609441.html", "title": "The best credit cards for United flyers in 2020", "title_page": "Best United credit card offers of 2020: Rewards & benefits - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through The Points Guy affiliate network if you apply and are approved for a card, but our reporting is always independent and objective.\nYou're almost certainly not thinking about travel right now, but eventually airlines like United will return to the skies. And when that happens, United still has one of the best loyalty programs to use for traveling around the world.You can redeem United MileagePlus miles to go almost anywhere, thanks not only to the airline's large route network of its own, but also its membership in the Star Alliance with 25 other airlines.\nFortunately, there are also many opportunities to rack up United miles with seven different credit cards. This includes four United credit cards as well as three separate Chase cards which earn points that can be transferred over to your United account. With so many credit card options, there truly is something for everyone.\nThe best United credit cards of 2020:\nUnited Explorer Card: Best for occasional United flyers\nUnited Club Infinite Card: Best for United lounge access\nUnited Business Card: Best for occasional United business flyers\nUnited TravelBank Card: Best United credit card with no annual fee\nChase Sapphire Reserve: Best for earning United miles on travel purchases\nChase Sapphire Preferred Card: Best for the everyday United traveler\nInk Business Preferred Credit Card: Best for earning United miles on business purchases\nLet's dive into each of these cards to see how they compare to one another. And let's look at how a few non-United cards could potentially maximize the number of miles you earn on your everyday purchases.\nBest for occasional United flyers: United Explorer Card\nThe United Explorer card features solid benefits for occasional United flyers.\nIf you're looking for a United credit card with a low annual fee but rich benefits, the United Explorer Card is one to consider. As an occasional United flyer, you'll save money by receiving your first checked bag for free for you and one traveling companion on United flights, priority boarding, two United Club day passes per year and 25% back on inflight United purchases. Although this card comes with a $95 annual fee (which is waived for the first year), the perks alone can be well worth the cost and ultimately save you money.\nWith the United Explorer Card, you'll earn 2 miles for every dollar you spend on all United purchases, as well as restaurant and hotel purchases. The card also comes with a statement credit worth up to $100 on the application fee for either Global Entry or TSA PreCheck. Although this is becoming a more common benefit on many credit cards these days, it's still typically found on cards that come with high annual fees, not one that costs less than $100 per year.\nThe United Explorer is currently offering a sign-up bonus where you can earn 60,000 bonus miles after you spend $3,000 on purchases in the first three months from account opening. Based on the point valuations of CNN Underscored's partner The Points Guy, United miles are worth 1.3 cents apiece, which makes this bonus worth $780.\nRelated: Earn 60,000 bonus miles with the United Airlines personal credit card.\nThis is also the only United credit card that waives its annual fee for the first year. That makes it the perfect choice to make sure a United credit card is right for you without paying for it right away.\nBest for United lounge access: United Club Infinite Card\nAccess the United Club lounges at Chicago's O'Hare airport with the United Club Infinite Card.\nIf you're normally a frequent United flyer, the brand-new United Club Infinite Card offers a better travel experience. One of the best benefits of the card is its included United Club lounge membership. For those who find themselves in airports often, lounge access gives you a place to relax, eat and drink before your flight.\nThis does come at a high price as the annual fee on this card will cost you $525. But, if you travel on United enough, you'll absolutely find that high cost to be worth it, especially since you can bring another adult and dependent children under 21 into the lounge with you, or up to two guests, for no additional fee. Bring your co-workers into the United Club with you during business travel, or your family during personal travel.\nJust remember that with this United lounge membership, you'll only be able to enter a United Club if you're holding a same-day boarding pass on United or a partner airline — you can't be flying a different airline. If you'd prefer lounge access privileges with more flexibility, then you might find the Priority Pass Select membership that comes with the Chase Sapphire Reserve or The Platinum Card® from American Express is a better option.\nYou'll also be able to check both your first and second bag for free with the United Club Infinite Card, unlike the United Explorer card which is capped at one checked bag. This is extended to both the cardholder and another person on the same reservation, although it's limited to just United-operated flights.\nYou'll also get Premier Access travel services with the United Club Infinite Card. That gives you access to designated airport check-in lines, exclusive security lines (where available), priority boarding and priority baggage handling after your flight deplanes. Best of all, if someone is traveling with you on the same reservation, they'll also receive complimentary Premier Access.\nIn addition to the better perks on this card, you'll also earn more miles on your everyday purchases. You'll earn a higher 4 miles per dollar on United purchases, plus 2 miles per dollar on all other travel and dining and 1 mile per dollar on everything else you purchase.\nFinally, although it has a higher annual fee, the United Club Infinite Card is currently also offering a higher sign-up bonus. For a limited time, you'll earn 100,000 bonus miles after you spend $5,000 on purchases in the first three months of account opening. Based on The Points Guy's point valuations, that bonus is worth $1,300 towards travel — a $520 increase over the bonus on the personal Explorer card.\nBest for occasional United business flyers: United Business Card\nOccasional United business flyers will find value in the United Business Card.\nThe United Business Card is also a relatively new credit card, and it's one you won't want to miss out on if you have a business. For starters, it's also offering 100,000 bonus miles, but in this case, after you spend $10,000 on purchases within your first three months of being a cardholder. Based on The Points Guy's 1.3 cents per mile valuation, this makes the sign-up offer worth a solid $1,300.\nOn the earning side, you'll receive 2 miles per dollar spent on United purchases, local transit and commuting, at restaurants, gas stations and office supply stores. You'll also earn 1 mile per dollar on all other purchases.\nSimilar to the personal United Explorer Card, with the United Business Card you'll be able to check your first bag for free for you and a traveling companion on the same reservation, receive priority boarding, receive two one-time United Club passes each year and 25% back on inflight United purchases.\nOne unique benefit to this card is that you'll receive a $100 United travel credit after seven United flight purchases of $100 or more in a calendar year. If you fly often, this should be an easy $100 credit to obtain, which fully offsets the card's annual fee.\nUnited is also incentivizing flyers to hold both the United Business Card and the United Explorer Card. If you have both, you'll receive 5,000 bonus miles each anniversary year. Those extra miles are worth $65 toward travel based on The Points Guy's valuations.\nBest United credit card with no annual fee: United TravelBank Card\nThe United TravelBank Card earns TravelBank cash instead of United miles.\nThe United TravelBank Card is perfect for the traveler who wants to be able to use their credit card rewards on any United flight they desire, all without paying an annual fee.\nWith this card, you'll earn United TravelBank cash, which can be used toward a United-operated flight. This means you aren't earning traditional United miles, which are typically restricted based on seat availability when you try to redeem them. Instead, if there's a United seat for sale, it's yours using TravelBank cash.\nUsing the United TravelBank Card, you'll earn 2% back on tickets purchased from United and 1.5% back on all other tickets. To redeem your rewards, you just use your TravelBank cash during the booking process with United instead of charging the ticket to a credit card. The current sign-up offer will also start you off with $150 cash in your TravelBank account after you spend $1,000 on purchases in the first three months from account opening.\nHowever, when compared to CNN Underscord's benchmark credit card, the Citi® Double Cash Card, you'll actually find that the United TravelBank Card isn't nearly as valuable as it appears. With the Citi Double Cash, you earn 2% cash back on everything — 1% when you make a purchase and another 1% as you pay it off. This means you're earning 2% on all purchases, not just United purchases.\nNot only that, you can redeem your cash back earned from the Citi Double Cash as a statement credit, which means you can use that money for a United ticket purchase. But with the Citi Double Cash card, the cash back can actually be used for any purchase, not just United flights. Or it can go straight into your pocket.\nRelated: Earn 2% cash back on everything with the no-annual-fee Citi Double Cash credit card.\nUnlike many of the other United credit cards, there aren't too many United-specific benefits that come along with this card. If you're looking for a card with strong United benefits, this probably isn't the card for you. The only real benefit is the 25% statement credit you'll receive on United inflight purchases.\nBest for earning United miles on travel purchases: Chase Sapphire Reserve\nEarn points on your travel purchases that can be converted to United miles with the Chase Sapphire Reserve.\nAlthough the Chase Sapphire Reserve isn't a United-specific credit card, United flyers might actually find it to be one of the more useful cards to have in their purse or wallet. The Chase Sapphire Reserve earns Chase Ultimate Rewards points that can be transferred into United miles at a 1-to-1 ratio, meaning you'll get 1,000 United miles for every 1,000 Ultimate Rewards points. But they can also be transferred to a dozen other airline and hotel loyalty programs, making them significantly more flexible.\nWith the Chase Sapphire Reserve, you'll earn 3 points for every dollar you spend on travel, which is significantly more than what you'll earn on any of the United credit cards. You'll earn this multiplier not only on paid United flights, but also for purchases on any other airline, plus hotels, car rentals, taxis and much more. You'll also earn 10 points per dollar on Lyft rides, 3 points per dollar on dining and 1 point per dollar on all other purchases.\nOn the benefits side, you'll receive up to $300 in statement credits each year on the Chase Sapphire Reserve, which can be used for any travel-related purchases, including United flights. Although the card has a steep $550 annual fee, if you're able to maximize this $300 statement credit on a yearly basis, it will significantly offset the fee and bring it down to a more moderate $250 cost.\nRelated: Is the Chase Sapphire Reserve worth the increased annual fee?\nYou'll also receive a complimentary Priority Pass Select membership, which will give you access to more than 1,200 airport lounges worldwide. If you travel often but don't have lounge access through another program, this is a great perk to have. It also doesn't pigeonhole you to just the United lounges like the United Club credit cards do.\nOther non-United related benefits on the Chase Sapphire Reserve include up to $120 in credits for DoorDash purchases and complimentary Lyft Pink membership. Plus, with a 50,000-point bonus offer after you spend $4,000 on the card in the first three months, you can very quickly find yourself with another 50,000 United miles in your account.\nBest for the everyday United traveler: Chase Sapphire Preferred\nThe everyday United flyer can convert Ultimate Rewards points to United miles with the Chase Sapphire Preferred.\nSimilar to the Chase Sapphire Reserve, the Chase Sapphire Preferred also earns highly-desirable Chase Ultimate Rewards points that can be transferred to United. But the annual fee is significantly lower at just $95 a year, which makes it the perfect starter card for those looking to dip their toes into the Ultimate Rewards program.\nFor the cheaper price, you'll only earn 2 points for every dollar you spend on all travel and dining purchases with the Chase Sapphire Preferred. But if you don't already have this card, it'll also provide you with a stronger sign-up bonus than the Sapphire Reserve card — you can earn 60,000 bonus points on the Chase Sapphire Preferred when you spend $4,000 in the first three months.\nRelated: Get the classic Chase Sapphire Preferred travel credit card with a 60,000-point bonus.\nThe Ultimate Rewards points earned with this card are worth 1.25 cents apiece when redeemed for travel through the Chase travel portal, which means the 60,000 bonus points are worth a minimum of $750 toward travel. But you can also transfer the points to United or another loyalty partner and potentially receive even more value for them if you're willing to put in the effort of finding award space.\nSimilar to many other Chase credit cards, the Chase Sapphire Preferred also comes with trip cancellation insurance, trip delay protection and baggage delay protection. This type of baked-in insurance can help with unexpected costs if you need to cancel your United flight or any other non-refundable travel purchase due to a covered reason, or if your flight gets delayed by more than 12+ hours (or requires an overnight stay) or your bags never make it to your destination. It's a benefit that you hope to never use, but the coverage can be invaluable if you ever experience such an incident.\nBest for earning United miles on business purchases: Ink Business Preferred\nBusinesses can earn points that convert to United miles with the Ink Business Preferred credit card.\nBusiness owners also have an opportunity to increase their United frequent flyer account balance with transferable Ultimate Rewards points, but this time on business purchases.\nWith the Ink Business Preferred, not only will you earn 3 points for every dollar your business spends on travel, you'll also earn 3 points per dollar on shipping purchases, internet/cable/phone services and advertising purchases with social media sites and search engines. All those 3x categories are up to the first $150,000 in combined purchases each account anniversary year — after that, you'll get 1 point per dollar in those categories.\nRelated: 8 reasons to consider the Chase Ink Business Preferred credit card.\nOf all the Chase credit cards that earn Ultimate Rewards points, the Ink Business Preferred has the highest current sign-up bonus. With the Ink Business Preferred, right now you can earn 100,000 bonus points after you spend $15,000 on purchases in the first three months from account opening.\nThat's a significant amount of money to spend in three months, but for many businesses, it's not uncommon to have that much in regular monthly expenses. And again, these points can be transferred to United at a 1-to-1 ratio, meaning you can end up with 100,000 United miles if you prefer, or you can transfer them to other Chase airline and hotel partners.\nAm I eligible for a business card?\nAlthough most of the credit cards on our list are personal cards, some of the best ones are business cards. But even if you don't own a large business or work for a huge corporation, don't immediately write off these cards. You might in fact have a business without even realizing it.\nIf you sell products online, work as a ride-share driver, write an online blog or even have a side hustle that you do in your spare time, you may already be a business owner. If that's the case, you're able to legitimately apply for a business credit card using your Social Security number instead of a company Employer Identification Number. And even if you're just starting out in your new business venture, don't let that deter you — just always be completely honest on your credit card application.\nWhich United credit card is right for you?\nIt's important to pick the United credit card that fits your flying habits.\nGetting any sort of airline credit card right now is obviously an investment in the future, since you won't be able to use the perks immediately. But if you're thinking about stockpiling some United miles for when travel returns to normal, you're probably wondering which card is best for you.\nIf you're committed solely to flying United when it returns to full service but won't likely find yourself flying very often, at least at first, your best bet is probably the United Explorer Card. However, if you have that same dedication to United Airlines but expect to be in the air quite often right away when travel resumes, the United Club Infinite Card is the way to go.\nOn the other hand, if you have a business and are looking to increase your United MileagePlus account balance right away, apply for the United Business Card to earn the 100,000-point sign up bonus. Alternatively, if you prefer flexibility in how you redeem your miles, the Ink Business Preferred should be your go-to card. And for those people without a business but looking for flexible points, the Chase Sapphire Reserve or Chase Sapphire Preferred are the way to go.\nFor United credit cards:\nLearn more about the United Explorer Card.\nLearn more about the United Club Infinite Card.\nLearn more about the United Business Card.\nFor flexible credit cards:\nLearn more about the Chase Sapphire Reserve.\nLearn more about the Chase Sapphire Preferred Card.\nLearn more about the Ink Business Preferred Credit Card.\nLooking for a credit card but not interested in travel? Check out CNN Underscored's guide to the best credit cards of 2020.\nEditorial Disclaimer: Opinions expressed here are the author's alone, not those of any bank, credit card issuer, airlines or hotel chain, and have not been reviewed, approved or otherwise endorsed by any of these entities.\nNote: While the offers mentioned above are accurate at the time of publication, they're subject to change at any time and may have changed, or may no longer be available.", "url": "https://www.cnn.com/2020/02/28/cnn-underscored/best-united-credit-cards/index.html"}