{"authors": [], "date_download": "2020-05-04 20:23:37", "date_modify": "2020-05-04 20:23:37", "date_publish": "2020-04-20 13:10:51", "description": "HEADLAND, Ala. (AP) — Suspected tornadoes killed at least two people as severe weather blasted the Deep South, and a house fire believed started by lightning claimed a third person, officials said...", "filename": "_fcdd02ca7a239c696225d3eb93b03405_1588623817.html", "image_url": "https://storage.googleapis.com/afs-prod/media/1d313255571f42fe9b44ef907c462155/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fcdd02ca7a239c696225d3eb93b03405_1588623817.html", "title": "3 killed by suspected tornado, lightning as storms hit South", "title_page": "3 killed by suspected tornado, lightning as storms hit South", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Baxterville, Miss. of home Brian and Penny Templesis seen Monday, April 20, 2020 after it was heavily damaged after being struck by a tornado on Sunday evening. Severe storms are raking parts of the Deep South, a week after Easter storms pounded the Deep South, killing dozens. (Cam Bonelli/The Clarion-Ledger via AP)\nThe Baxterville, Miss. of home Brian and Penny Templesis seen Monday, April 20, 2020 after it was heavily damaged after being struck by a tornado on Sunday evening. Severe storms are raking parts of the Deep South, a week after Easter storms pounded the Deep South, killing dozens. (Cam Bonelli/The Clarion-Ledger via AP)\nHEADLAND, Ala. (AP) — Suspected tornadoes killed at least two people as severe weather blasted the Deep South, and a house fire believed started by lightning claimed a third person, officials said Monday.\nJerry Oliver Williams, 61, died late Sunday night when winds flipped the home Williams shared with his wife and child in a rural Alabama county, authorities said. The area was under a tornado warning at the time.\n“He was in a mobile home, and the mobile home was destroyed by a tornado. He was in the wreckage of the mobile home. His wife and child were with him, and they were OK,” said Coroner Derek Wright of Alabama’s Henry County.\nA suspected twister also resulted in one death in Marion County, Mississippi, said Coroner Jessie Graham. Jerry Johnson, 70, died when his home took a “direct hit” from the storm in the Sandy Hook community, Graham said.\nThe National Weather Service said it had received reports of large hail and broken power poles in the area, and emergency management officials said 20 homes were damaged.\nIn south Georgia, Wilcox County Coroner Janice Brown a 95-year-old woman died in a house fire early Monday that the state fire marshal’s office suspected was caused by a lightning strike. Heavy storms were in the area at the time, said Brown, who declined to identify the victim since extended family members hadn’t been notified.\nThe deaths came as firefighters worked through storms to contain a blaze at the main music building at the University of Alabama in Tuscaloosa. Authorities haven’t determined the cause of the fire, but it happened while strong storms with lightning were in the area.\nFirefighters saved most of the instruments and uniforms belonging to Alabama’s “Million Dollar Band,” Mayor Walt Maddox said in a tweet.\nFull Coverage: Tornadoes\nRainfall totals in excess of 2 inches (5.08 centimeters) were widespread, and isolated spots in central Alabama received more than 8 inches (20.32 centimeters) of rain in a day, the weather service said.\nMore than 35,000 homes and businesses in Alabama and Mississippi were still without power around noontime Monday.\nThe Storm Prediction Center received more than 250 reports of possible tornadoes, high winds, hail and storm damage from east Texas to central Florida on Sunday and Monday. A tornado touched down on Interstate 75 in north Florida, tossing a portable building being hauled by a truck into a nearby pickup truck, where the driver suffered minor injuries, authorities said.\nTeams from the National Weather Service will assess tracks to determine where tornadoes struck.\nThe storms hit a week after a two-day outbreak of more than 100 tornadoes that began Easter Sunday killed at least 36 people across the region.", "url": "https://apnews.com/fcdd02ca7a239c696225d3eb93b03405"}