{"authors": ["Nicholas K. Geranios"], "date_download": "2020-05-04 20:22:51", "date_modify": "2020-05-04 20:22:51", "date_publish": "2020-04-20 18:44:37", "description": "SPOKANE, Wash. (AP) — The wolf population in Washington state increased by at least 19 animals in 2019, despite multiple lethal removals due to wolf-livestock conflict, the Washington Department...", "filename": "_4996356e4c74037163601fdfae9c1d1e_1588623771.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4996356e4c74037163601fdfae9c1d1e_1588623771.html", "title": "State report finds population of wolves grew 11% in 2019", "title_page": "State report finds population of wolves grew 11% in 2019", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SPOKANE, Wash. (AP) — The wolf population in Washington state increased by at least 19 animals in 2019, despite multiple lethal removals due to wolf-livestock conflict, the Washington Department of Fish and Wildlife said Monday.\nThe agency estimated that the wolf population grew to an estimated 145 wolves in 26 packs. That compared to 126 wolves in 27 packs in 2018.\nWashington’s wolf population was virtually wiped out in the 1930s, but the state documented a resident pack in Okanogan County in 2008. Since then, the number of wolves has increased every year.\nThe state found a minimum of 108 wolves in areas managed by WDFW and 37 wolves reported on the Confederated Tribes of the Colville Reservation in 2019.\nThe wolf population grew by 11% in 2019, well below the historical average of more than 20%, the state said.\n“The actual number of wolves in Washington is likely higher,″ the state report said, because this is a minimum count.\nMost packs range across public and private land in Ferry, Stevens, and Pend Oreille counties in the northeast corner of the state, but increasing numbers are found in southeast Washington and the north-central region.\n“Washington has seen modest improvement in our wolf populations in recent years, but these numbers are not indicative of a sustainable population statewide,″ said Zoe Hanley of the conservation group Defenders of Wildlife. “Last year, nine wolves were lethally removed due to conflicts with livestock.’”\nConflicts between wolves and livestock could have been reduced had the state implemented more non-lethal measures, Hanley said. Such measures can include the use of range riders to patrol cattle herds.\n“Wolves still face an uncertain future in Washington state, as progress has been slow for wolves dispersing to ... suitable habitat in the southern and western portions of the state,″ Hanley said.\nIt was the third straight year the growth rate for Washington’s wolf population was relatively low, according to the Center for Biological Diversity, a conservation group.\n“Washington’s wildlife agency keeps killing wolves, so it’s no wonder the population is struggling,” said Sophia Ressler of the center. “For these wolves to have a fighting chance at recovery, state managers need to stop slaughtering them.’”\nIn 2019, the Colville Tribe changed its methodology for counting wolves so the WDFW started reporting the counts separately. The tribe changed count methodology because they consider wolves recovered on their lands. Instead of track, aerial, and camera surveys, the tribe relied on information from hunters, trappers and public observations.\nThe WDFW reported 10 breeding pairs in 2019, one less than the 2018 count.\nIn 2019, 21 wolf deaths were confirmed. Of these deaths, nine were lethal removals in response to wolf-livestock conflicts. In 2018, 12 wolf deaths were recorded, including four from lethal removal. Fourteen confirmed cattle deaths were attributed to wolves in 2019, with 11 confirmed cattle injuries.\nGray wolves have been classified as endangered in all or part of Washington since 1973.\nIn 2011, the U.S. Fish and Wildlife Service ended Endangered Species Act protection for wolves in the eastern third of the state but preserved it for those in the western two-thirds.\nUnder state law, wolves were listed as endangered in 1980 and have retained that status statewide.", "url": "https://apnews.com/4996356e4c74037163601fdfae9c1d1e"}