{"authors": ["Associate Commerce Editor"], "date_download": "2020-05-04 20:20:53", "date_modify": "2020-05-04 20:20:53", "date_publish": "2020-04-29 15:03:53", "description": "From \"granny chic\" to '90s grunge, here are the style trends to look forward to trying out when you can go outside again.", "filename": "entry_spring-and-summer-fashion-trends-2020_l_5ea74496c5b62c80cbb0af05_1588623653.html", "image_url": "https://img.huffingtonpost.com/asset/5ea75d822400005a008e9d1d.png?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_spring-and-summer-fashion-trends-2020_l_5ea74496c5b62c80cbb0af05_1588623653.html", "title": "Spring And Summer 2020 Fashion Trends To Watch, According To Style Experts", "title_page": "Spring And Summer 2020 Fashion Trends To Watch, According To Style Experts | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "HuffPost may receive a share from purchases made via links on this page. Prices and availability subject to change.\nHuffPost It might not seem like it now, but we will find occasions worth dressing up for again. From tie-dye everything to \"birth flower jewelry,\" these are the trends you can look forward to when that time comes.\nBy early May, we at HuffPost Finds would usually be scouring the internet for sandal sales, figuring out how to stuff another midi dress into our closets and checking the weather each morning to see if we can leave home without a jacket.\nBut this is not your usual spring season.\nAs the world has come to terms with the reality of pandemic life, the lucky among us are working from home so that those who can’t do their jobs from a desk feel safer going to theirs.\nAs a result, many of us have canceled special events, from weddings to birthday celebrations. Even less momentous outings like brunch with friends or going on first dates have been put on pause, which means we’re swapping our usual clothing for comfortable loungewear that might not make us feel like our best selves.\nDon’t get me wrong: Loungewear is the reasonable and practical choice, given all the time we’re spending indoors and on our own. But there is a reason you feel more like yourself when you express your personal style through fashion and beauty. Appropriately, it is called “the lipstick effect.” A study out of Harvard Medical School found that wearing makeup can give people a confidence boost. That’s why putting on an outfit that makes you feel great and doing your makeup might lift your mood, even if it seems frivolous.\nThere will come a time where we can meet with friends and family again to do fun (and even mundane) things. We will find occasions to dress up — even if our outfits will be paired with fashionable and functional face masks and we keep a 6-foot distance between ourselves and others.\nIt might be a good distraction to start planning for those summer outfits, or even experimenting with some new looks around the house.\nI’ve developed a WFH makeup routine and started wearing the two new pairs of strappy sandals I got from a Nordstrom sale around the house, just to feel more like myself and give me something to look forward to.\nA while back, I spoke with style and trend experts from Etsy, Pinterest and online consignment and thrift store ThredUp for their predictions on spring and summer 2020’s biggest fashion trends to watch.\nIf you want to know more about what you can look forward to wearing this spring and summer, take a look through our guide to the season’s top looks, including shoe trends, fresh prints and fun colors — because we all need something to look forward to for when we can go outside again.", "url": "https://www.huffpost.com/entry/spring-and-summer-fashion-trends-2020_l_5ea74496c5b62c80cbb0af05"}