{"authors": [], "date_download": "2020-05-04 20:23:47", "date_modify": "2020-05-04 20:23:47", "date_publish": "2020-04-16 22:16:22", "description": "PUEBLO, Colo. (AP) — Four Pueblo police officers were cleared of any wrongdoing after they fatally shot a man in November, a district attorney’s office said. District Attorney Jeff Chostner...", "filename": "_23908442f95322e14d956b56c8bf9e63_1588623827.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_23908442f95322e14d956b56c8bf9e63_1588623827.html", "title": "4 Pueblo police officers cleared in fatal November shooting", "title_page": "4 Pueblo police officers cleared in fatal November shooting", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PUEBLO, Colo. (AP) — Four Pueblo police officers were cleared of any wrongdoing after they fatally shot a man in November, a district attorney’s office said.\nDistrict Attorney Jeff Chostner said the officers were justified in their actions by the self-defense and defense of others provisions under Colorado law, the Pueblo Chieftain reported .\nMultiple officers from the Pueblo Police Department were dispatched Nov. 23 to a home on Rex Street after receiving reports of an active domestic disturbance, authorities said.\nOfficers formed a perimeter around the home when they arrived and repeatedly identified themselves and asked for everyone to come outside, police said. The officers then broke down the door when their requests were ignored.\nA woman came out of one of the rooms with her hands up, followed shortly by 24-year-old Estevon Cruz, who held a handgun pointed at officers, authorities said.\nOfficers Reid Herrera, Megan Chapman, Logan O’Hayre, and Patrick Cancino fired their guns at Cruz. One other officer in the home did not fire a weapon.\nIt was later determined that the gun Cruz had was a nonlethal BB gun, but “police were unable to know that. Officers reasonably believed that Estevon (Cruz) intended to fatally harm them and (the female),” Chostner said. “They had reasonable ground to believe, and did believe, that they were in imminent danger of being killed or receiving great bodily injury.”\nAn autopsy report showed Cruz died from 11 gunshot wounds.\n“Given the facts and circumstances of the situation and the governing law, criminal charges against the officers would not be appropriate, and therefore no criminal charges will be filed,” Chostner said.", "url": "https://apnews.com/23908442f95322e14d956b56c8bf9e63"}