{"authors": [], "date_download": "2020-05-04 20:06:47", "date_modify": "2020-05-04 20:06:47", "date_publish": "2020-04-07 19:12:05", "description": "CRIPPLE CREEK, Colo. (AP) — A Colorado man sentenced to life in prison after he was convicted of fatally beating his fiancee with a baseball bat has written a letter to a local television reporter...", "filename": "_f9e66049d2b4d13284ee69e369668110_1588622807.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f9e66049d2b4d13284ee69e369668110_1588622807.html", "title": "Convicted Colorado murderer writes letter claiming innocence", "title_page": "Convicted Colorado murderer writes letter claiming innocence", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CRIPPLE CREEK, Colo. (AP) — A Colorado man sentenced to life in prison after he was convicted of fatally beating his fiancee with a baseball bat has written a letter to a local television reporter arguing his innocence.\nPatrick Frazee, 33, wrote a letter after not testifying at his trial or speaking at his sentencing, KCNC-TV reported . The letter to KCNC-TV reporter Rick Sallinger came after Frazee has appealed his life sentence.\nThe return address is from the Colorado Department of Correction Arkansas Valley Correctional Facility in Ordway.\n“Let me start by telling you I did not kill Kelsey!” Frazee said in the letter. “I want my daughter to know the truth. Most of all I want my daughter to know I did not kill her mother!”\nKelsey Berreth, the mother of their child, went missing on Thanksgiving 2018. She was last seen on video in a Woodland Park Safeway, authorities said, adding that her body was never found.\nIdaho nurse Krystal Lee, who was having an affair with Frazee, was the key witness against him, testifying that he asked her three times to kill Berreth, but she couldn’t do it, prosecutors said.\nThe 33-year-old nurse was sentenced to three years in a plea deal after she helped clean up Berreth’s townhome in Woodland Park where she died, court officials said.\nFrazee argued in the letter that unknown male DNA was found in the sink in Kelsey’s bathroom despite investigators telling reporters that all DNA was identified. Frazee also argued his attorneys did not even try to present a defense and told him not to speak to the media.", "url": "https://apnews.com/f9e66049d2b4d13284ee69e369668110"}