{"authors": ["Review Brian Lowry"], "date_download": "2020-05-04 16:07:08", "date_modify": "2020-05-04 16:07:08", "date_publish": "2020-04-02 14:03:02", "description": "\"Slay the Dragon\" does an extraordinarily good job of taking a complex issue and connecting the dots, which seems particularly appropriate for a documentary about gerrymandering. Well timed to the current election season -- especially after voting issues that beset recent primaries -- it's an overtly partisan film that admirably illustrates how an arcane term helps explain why the country is so starkly polarized.", "filename": "2020_04_02_entertainment_slay-the-dragon-review_index_1588608428.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200305122002-slay-the-dragon-documentary-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_entertainment_slay-the-dragon-review_index_1588608428.html", "title": "'Slay the Dragon' connects the dots on the political battle over gerrymandering", "title_page": "'Slay the Dragon' review: Gerrymandering explained in this smart and timely documentary - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) \"Slay the Dragon\" does an extraordinarily good job of taking a complex issue and connecting the dots, which seems particularly appropriate for a documentary about gerrymandering. Well timed to the current election season -- especially after voting issues that beset recent primaries -- it's an overtly partisan film that admirably illustrates how an arcane term helps explain why the country is so starkly polarized.\nFor those who might not be entirely clear on the process, gerrymandering refers to political parties drawing district lines in ways that are most advantageous to their election. The result is often comically shaped boundaries, allowing the party in power to essentially lock in statehouse majorities.\nDale Schultz, a former Republican member of the Wisconsin Legislature who has spoken out against the practice, notes that the effect is to have \"legislators picking voters rather than voters picking legislators.\"\nAs a related consequence, grouping conservatives within safely drawn Republican districts has served to insulate elected officials. Not only has it benefited the GOP, but experts note that the dynamic prompts legislators to adopt more extreme positions, since the only threats they potentially face are primary challenges from within their own party.\nWhile gerrymandering has long existed -- yes, on both sides -- what's different now is the way GOP strategists, led by Chris Jankowski and a well-funded effort named Project Redmap, aggressively turned it into a full-blown effort after Barack Obama's election in 2008. Targeting swing states, the party secured victories in 2010 -- a Census year -- and then leveraged that, cleverly using big data, to strengthen and protect its gains.\nRead More", "url": "https://www.cnn.com/2020/04/02/entertainment/slay-the-dragon-review/index.html"}