{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:59:41", "date_modify": "2020-05-04 16:59:41", "date_publish": "2020-04-09 22:30:26", "description": "The headline out of CNN's new national poll released on Thursday morning was not good for President Donald Trump: He trails de facto Democratic presidential nominee Joe Biden by 11 points in a hypothetical general election matchup.", "filename": "2020_04_09_politics_donald-trump-joe-biden-poll-support_index_1588611581.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408162244-03-hf-trump-coronavirus-test-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_donald-trump-joe-biden-poll-support_index_1588611581.html", "title": "Here's the silver lining in the CNN poll for Donald Trump", "title_page": "Here's the silver lining in the CNN poll for Donald Trump - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The headline out of CNN's new national poll released on Thursday morning was not good for President Donald Trump: He trails de facto Democratic presidential nominee Joe Biden by 11 points in a hypothetical general election matchup.\none data point that the President and his supporters can rightly note as good news. Much of the poll was equally dire for Trump -- Biden leads among women by 30 points, for example -- but there isdata point that the President and his supporters can rightly note as good news.\nIt's this: 8 in 10 Republican voters are either \"extremely\" or \"very\" enthusiastic about voting in the fall election as compared to just more than half of Democratic voters (56%) who describe themselves as equally excited about casting a ballot in November.\nThat's a significant enthusiasm gap -- and it shows up in other subgroups that favor Trump in the poll too. Whites (63%) are far more likely than non-whites (41%) to say they are \"extremely\" or \"very\" enthusiastic about voting this fall. Ditto self-identified conservatives (69%) vs self-identified liberals (56%).\nWhat all those numbers make clear is that, at the moment, voters likely to cast a ballot for Trump are more excited about doing so than those who will likely vote against Trump.\nRead More", "url": "https://www.cnn.com/2020/04/09/politics/donald-trump-joe-biden-poll-support/index.html"}