{"authors": [], "date_download": "2020-05-04 20:13:08", "date_modify": "2020-05-04 20:13:08", "date_publish": "2020-04-16 19:43:18", "description": "TOPEKA, Kan. (AP) — Kansas is asking jobless workers to limit when they file claims for unemployment benefits and has temporarily suspended a website function allowing people to check the status...", "filename": "_402e426828d0d0ddc08447a8d87f321a_1588623188.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_402e426828d0d0ddc08447a8d87f321a_1588623188.html", "title": "Jump in claims spurs Kansas to ask people to limit filings", "title_page": "Jump in claims spurs Kansas to ask people to limit filings", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jump in claims spurs Kansas to ask people to limit filings\nTOPEKA, Kan. (AP) — Kansas is asking jobless workers to limit when they file claims for unemployment benefits and has temporarily suspended a website function allowing people to check the status of their claims because of a surge in claims overwhelming the computer system for processing them.\nState officials announced the changes Thursday. They’re asking people whose last names begin with A through M to file claims Sunday afternoons, Tuesdays and Thursdays and people whose last names begin with N through Z to file Mondays, Wednesdays and Fridays.\nThe state received nearly 31,000 initial claims for unemployment benefits last week and handled more than 75,000 ongoing claims. For the last week before the surge began, ending March 14, it received about 1,800 initial claims and handled fewer than 10,000 ongoing claims.\nDemocratic Gov. Laura Kelly’s administration has faced criticism from GOP legislators partly because the state spent $47 million between 2003 and 2011 to upgrade the Department of Labor’s computers.\nBut Kelly said Thursday that the 1970s system never was completely modernized and Republican Gov. Sam Brownback’s administration canceled the last parts of a planned modernization in 2011.\nThe department began planning last year for another modernization and hopes to solicit proposals from potential vendors next year.", "url": "https://apnews.com/402e426828d0d0ddc08447a8d87f321a"}