{"authors": ["Fred Goodall"], "date_download": "2020-05-04 20:16:08", "date_modify": "2020-05-04 20:16:08", "date_publish": "2020-04-08 16:06:37", "description": "TAMPA, Fla. (AP) — Tom Brady entered his final season in New England with a strong inkling that it would be his last with the Patriots. The six-time Super Bowl champion who signed with the...", "filename": "_b839eb7d350e972410d3095e5b09e482_1588623368.html", "image_url": "https://storage.googleapis.com/afs-prod/media/5d5f3e3284a54dc790cb970ded1e029d/2500.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b839eb7d350e972410d3095e5b09e482_1588623368.html", "title": "It was 'just time' to leave Pats for new challenge", "title_page": "Brady: It was 'just time' to leave Pats for new challenge", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Jan. 10, 2015, file photo, New England Patriots quarterback Tom Brady holds up the game ball after an NFL divisional playoff football game against the Baltimore Ravens in Foxborough, Mass. Brady was selected to the 2010s NFL All-Decade Team announced Monday, April 6, 2020, by the NFL and the Pro Football Hall of Fame. (AP Photo/Elise Amendola, File) FILE - In this Jan. 10, 2015, file photo, New England Patriots quarterback Tom Brady holds up the game ball after an NFL divisional playoff football game against the Baltimore Ravens in Foxborough, Mass. Brady was selected to the 2010s NFL All-Decade Team announced Monday, April 6, 2020, by the NFL and the Pro Football Hall of Fame. (AP Photo/Elise Amendola, File)\nTAMPA, Fla. (AP) — Tom Brady entered his final season in New England with a strong inkling that it would be his last with the Patriots.\nThe six-time Super Bowl champion who signed with the Tampa Bay Buccaneers in free agency last month said Wednesday on SiriusXM’s “The Howard Stern Show” it was “just time” for a change, reiterating he has no hard feelings about coach Bill Belichick not making him a Patriot for life.\n“I think he has a lot of loyalty and I think he and I have had a lot of conversations that nobody’s ever been privy to, and nor should they be,” Brady told Stern during a wide-ranging interview lasting more than two hours.\n“So many wrong assumptions were made about our relationship, or about how he felt about me. I know genuinely how he feels about me,” the four-time Super Bowl MVP added.\n“Now I’m not going to respond to every rumor or assumption that’s made other than what his responsibility as coach is to try to get the best player for the team, not only in the short term, but in the long term as well.”\nWith Brady and Belichick leading the way, the Patriots won 17 division titles and appeared in nine Super Bowls and 13 AFC championship games over the past 20 years.\nBrady, who’ll turn 43 in August, said he entered “unchartered territory as an athlete” when continued to perform at a high level in recent years.\n“I was an older athlete, and he started to plan for the future, which is what his responsibility is. And I don’t fault him for that,” Brady said of Belichick. “That’s what he should be doing. That’s what every coach should be doing.”\nBrady signed a two-year, $50 million contract with the Bucs last month, joining a team with the worst winning percentage in league history.\nTampa Bay hasn’t made the playoffs since 2007 and doesn’t have a postseason win since its lone Super Bowl championship run 18 years ago.\n“I never cared about legacy. ... I never once, when I was in high school, said, ‘Man, I can’t wait for what my football legacy looks like.’ I mean, that’s just not me. That’s not my personality. So why would I choose a different place? It’s because it was just time. I don’t know what to say other than that,” Brady said.\n“I had done everything. I accomplished everything I could in two decades with an incredible organization, an incredible group of people. That will never change,” the three-time NFL MVP said. “And no one can ever take that away from me. No one can ever take those experiences or Super Bowl championships away from us.”\nBrady also talked about moving his family into a furnished mansion he’s renting from Derek Jeter in Tampa, as well as his marriage to supermodel Gisele Bündchen, trying marijuana and alcohol as a teenager but not enjoying the lifestyle, and his college career at Michigan.\nThe quarterback also spoke in detail about his decision to skip OTAs in recent years with the Patriots after reading a letter from his wife, who at the time was unhappy with some aspects of their marriage.\n“What was important to her, what was important to me was our family and our relationship, and at different times, like any married couple, things need to be changed,” said Brady, who said he kept the letter.\n“A couple years ago she didn’t feel like I was doing my part for the family. ... She felt like I would play football all season, and she would take care of the house, and then all of a sudden when that season would end I’d be like: ‘Great, let me get into all my other business activities, let me get into my football training,’ and she’s sitting there going, ‘Well, when are you going to do things for the house? When are you going to take the kids to school?’ Brady said.\n“I had to make a big transition in my life to say, ‘I can’t do all the things that I wanted to do for football like I used to,” he added. “I’ve got to take care of things with my family,’ because my family ... the situation wasn’t great. She wasn’t satisfied with our marriage.\nBrady was asked several questions about his relationship with Belichick, who selected him in the sixth round of the 2000 draft — No. 199 overall.\nThe quarterback insisted there has never been a rift between him and the coach over who was most responsible for New England’s success.\n“I can’t do his job and he can’t do mine. So the fact that you could say: ‘Would I be successful without him, the same level of success?’ I don’t believe I would have been. But I feel the same in vice-versa as well,” Brady said. “To have him allowed me to be the best I could be. So I’m grateful for that. And I very much believe that he feels the same about me.”\n___\nAP Sports Writer Tim Reynolds in Miami contributed to this report.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/b839eb7d350e972410d3095e5b09e482"}