{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Abdullah Younus", "Mark Meinster", "Toni Gilpin"], "date_download": "2020-05-04 19:49:18", "date_modify": "2020-05-04 19:49:18", "date_publish": "2020-05-01 00:00:00", "description": null, "filename": "2020_05_join-socialist-organization-dsa-working-class_1588621758.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/05/01151923/Image-from-iOS.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_05_join-socialist-organization-dsa-working-class_1588621758.html", "title": "Why You Should Join a Socialist Organization", "title_page": "Why You Should Join a Socialist Organization", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nLet’s say you understand the basics of how capitalism works, and you’re convinced that organizing society around the maximization of private profit is a bad way to go about things, responsible for all kinds of unnecessary hardship and misery. And let’s say you also understand the basic thrust of socialism, and you’re convinced that society would be fairer and people would generally be happier if we moved toward a collective ownership model that didn’t rely on and encourage exploitation. If this describes you and you haven’t yet joined a socialist organization, now is the time. To paraphrase socialism’s chief philosopher Karl Marx, a lot of people have made valiant and fruitful efforts to interpret the world, but that isn’t the extent of the socialist project. Our objective is not just to analyze our conditions, but to transform them. The particular way we want to change society is to make it operate in the interests of the vast majority instead of a small privileged minority. In order to overcome the wealth and power currently possessed by the minority, the majority must consolidate. In other words, in order to make a real impact toward socialism, individuals need to link up with others and become organized. Something you hear a lot on the Left is that “An unorganized socialist is a contradiction in terms.” If you’re on your own reading Jacobin and agreeing with it, but you aren’t yet part of a socialist organization, you’re perhaps best described as a socialist sympathizer. It’s helpful for organized socialists to have fellow travelers cheering us on, but we’d much rather you join us, because we need as many people dedicating their time and energy to transforming society as possible. When you do join us, you cross the threshold from being someone who not only believes socialism is preferable to capitalism to someone who demonstrates and acts on that belief through strategic collective action. Becoming a member of a socialist organization is the best way to get the political education, the organizing skills, and the institutional support and solidarity you need to not just think like a socialist but act like one. There’s a reason the phrase “card-carrying socialist” has entered the English lexicon — it underscores the difference between someone who gets it and someone who makes it happen.\nSocialist Smarts The canonical Marxist texts contain all kinds of contradictory wisdom. First we learn how foolish it is to liquidate socialists’ political identity and extinguish working-class militancy by settling for incremental reform. Then we turn the page only to discover that part of building working-class confidence and power is picking winnable fights around reforms that expand ordinary people’s political imagination without crossing over into fantasyland. It’s hard to know from reading the socialist tradition’s luminaries which of these applies to a given scenario in our own context. You could become well-versed in the history of class struggle and the classic texts of the socialist tradition all on your own. But even if you spent years reading everything you could lay your hands on, you would still be missing a crucial component of political education: a profound familiarity with — and gut feeling about — your own political context, including all its historical specificities and its unique limitations and possibilities. This kind of political intuition doesn’t come naturally, and it can’t be developed in a vacuum. It must be honed through experience. Without it, socialists can’t know whether this or that political insight is applicable in a given real-world situation. This intuition is the difference between an educated guess and warmed-over dogma — and in the actual heat of battle, when we need to make tough calls with real stakes, that difference means the world. In recent decades, socialists haven’t always had their finger on the pulse. This isn’t entirely their own fault: throughout the twentieth century, socialist organizations experienced sustained assaults from capitalists and their allies in the state. After the McCarthyist offensive of the fifties, the overt police repression of the sixties, and the covert sabotage of the seventies, there was very little left in the way of US socialist institutions. The ascent of neoliberalism and the winding down of the Cold War seemed to close the book on socialism. What few organized socialists remained were barred from participating in mass working-class activity, which itself was grinding to a halt throughout the eighties, nineties, and aughts. Some socialist groups during those dark decades made a good-faith effort to embed themselves in the lives and struggles of the broader working class, but their small numbers yielded a limited capacity to act. Other socialist groups stopped making attempts to integrate with the working class and became essentially monastic orders, where monkish socialists memorized and reproduced the holy texts, cut off from the outside world. Sometimes their political ideology became not merely ossified but deformed. Today socialists have a responsibility to take advantage of significantly more favorable political conditions and be perpetually active, always on the lookout for ways to support and advance class struggle on as big a stage as possible. This is not at all to argue against reading socialist texts. On the contrary, it’s an encouragement to join an active socialist organization where traditional political education — exposure to and rigorous engagement with the ways people have thought about the major enduring political problems of building socialism throughout history — is combined with external-facing political activity that brings socialists into contact with the broader working class. This means staying busy year-round with electoral campaigns, workplace organizing, and campaigns around national or neighborhood issues that affect the working class. No matter how smart you are, you won’t have a trustworthy intuition about if a given strike has actually petered out or is about to catch a second wind, for example, unless you’ve spent a while getting your hands dirty with workplace or labor-solidarity organizing. And you can’t get that kind of experience on your own: if you walk around trying to organize workplaces or support strikes by yourself, representing nobody, people will just think you’re eccentric. To really get in the mix and learn the rhythms of class struggle, you need to join a group that’s committed to on-the-ground organizing.\nSocialist Skills Socialists can’t be content to keep our opinions to ourselves, as though socialism were a recreational pursuit or a personal hobby. Socialists have a responsibility to try to convince other people to think and act in certain ways. Otherwise, again, we’re treating socialism like an intellectual tradition alone, instead of a living project of intervening in current affairs to produce favorable real-world outcomes. Convincing people is not easy. Whether you’re shy or outgoing, persuasion requires a set of skills that aren’t likely to come naturally. The best place to develop the techniques, comportment, and emotional constitution that we need to convince ordinary people to unionize or strike or vote for socialists is in a democratic organization. Our society boasts few democratic organizations. Actual elections are abstract affairs, consisting for most people of merely casting a ballot, if they even vote at all. Only about 10 percent of Americans belong to labor unions, and even then many unions are top-down and undemocratic, preventing or discouraging decision-making by members. A handful of people belong to co-ops or other groups that make decisions collectively, but these are pretty rare. Probably the most common experience of deliberative democracy in American life is being on the Board of Elders at a church or the governing body of a service club, like the Kiwanis, Rotary, or Lions Clubs. But as the decades pass, even fewer people belong to these kinds of social formations, much less routinely participate in making decisions in them. The alienation of modern life and the absence of democratic organizations in our social landscape go hand in hand, and they have dire implications for socialism: few people, no matter how charismatic, are equipped through experience with the skills necessary to confidently maneuver in groups of people, much less persuade and lead them. Like a democratic labor union, a democratic socialist organization is a school of organizing. A rarity in society, it gives members the opportunity to discover and take ownership over what they think, to learn how to articulate their ideas effectively, and to practice convincing others. Only in a democratic organization can a socialist really learn through trial and error when to push the envelope and when to go with the flow, how to wage an effective internal campaign, and how to gracefully proceed in the face of defeat. Through the democratic process, socialists also learn the actual technical skills involved in organizing. These include curating demands, writing clear and convincing arguments, delivering speeches, creating effective design and messaging, identifying and meeting with potential supporters, whipping votes, keeping track of progress, and so on. Active membership in a democratically run socialist organization is a crash course in all the skills socialists need to organize the broader working class. If the organization is multi-tendency — or “big tent,” welcoming a wide range of ideologies — then the training a socialist receives in that organization is that much more valuable. This is because in order to secure favorable outcomes in a democratically run, multi-tendency organization, socialists need to learn how to build coalitions with people who disagree with them, and how to resist devolving into petty factionalism when a coalition isn’t in the cards. In other words, in a multi-tendency democratic-socialist organization, a socialist can learn not only how to find and develop relationships with kindred spirits, but also how to behave around adversaries in times of conflict. This will sometimes mean ignoring them, other times confronting them, and still at other times might mean attempting to win them over. It’s impossible to develop a good sense of which strategy is appropriate for a given scenario until you’ve had a lot of these kinds of experiences. One of the biggest excuses people give for not joining a socialist organization is that they find some people in a given organization aggravating, for one reason or another. But we’ll get nowhere if we let ourselves off the hook and abstain from organizing out of dislike or social discomfort. After all cranks, scolds, zealots, provocateurs, and other troublesome characters exist outside of socialist organizations and in the broader society, too. There are jerks in every workplace and weirdos in every neighborhood. If socialists refuse to learn how to organize around difficult personalities or constituencies, then they certainly won’t be equipped to build a mass movement. Lots of ordinary people spend most of their lives quietly avoiding confrontation with neighbors and coworkers only to occasionally curse out an unwitting stranger. That clumsy vacillation won’t teach a person how to navigate the human world adroitly enough to persuade people when it counts. But in a democratic, multi-tendency socialist organization, a person can learn the skills they would need to organize a strike support campaign involving multiple different organizations across a city, or to organize an electoral campaign that gets buy-in from diverse sections of the working class. In short, socialists can learn how to lead. And socialist leadership is a necessary precondition of achieving socialism.", "url": "https://jacobinmag.com/2020/05/join-socialist-organization-dsa-working-class"}