{"authors": ["Andrew Selsky"], "date_download": "2020-05-04 20:29:03", "date_modify": "2020-05-04 20:29:03", "date_publish": "2020-04-20 17:49:01", "description": "SALEM, Ore. (AP) — Until Monday, Oregon was the only state that still allowed nonunanimous jury convictions. The U.S. Supreme Court ended that in a decision involving a murder conviction in...", "filename": "_9eb56d5b027a55262ea6056e1ba2a00b_1588624143.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b4bbc2d94be0486185dabcaa626918a4/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9eb56d5b027a55262ea6056e1ba2a00b_1588624143.html", "title": "US Supreme Court bans nonunanimous jury verdicts in Oregon", "title_page": "US Supreme Court bans nonunanimous jury verdicts in Oregon", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - This is a Jan. 27, 2020 file photo of The Supreme Court in Washington. The Supreme Court has ruled that juries in state criminal trials must be unanimous to convict a defendant, settling a quirk of constitutional law that had allowed divided votes to result in convictions in Louisiana and Oregon. The justices’ vote Monday overturned the conviction of a Louisiana man who is serving a life sentence for killing a woman after a jury voted 10-2 to convict him. (AP Photo/Mark Tenally)\nFILE - This is a Jan. 27, 2020 file photo of The Supreme Court in Washington. The Supreme Court has ruled that juries in state criminal trials must be unanimous to convict a defendant, settling a quirk of constitutional law that had allowed divided votes to result in convictions in Louisiana and Oregon. The justices’ vote Monday overturned the conviction of a Louisiana man who is serving a life sentence for killing a woman after a jury voted 10-2 to convict him. (AP Photo/Mark Tenally)\nSALEM, Ore. (AP) — Until Monday, Oregon was the only state that still allowed nonunanimous jury convictions.\nThe U.S. Supreme Court ended that in a decision involving a murder conviction in Louisiana, a state which, until 2019, had also allowed nonunanimous jury convictions. But the ruling also applied to Oregon’s law.\nState Attorney General Ellen Rosenblum said Oregon will now address “the many cases” that require review because of the decision.\n“We have been expecting this ruling, and we’re well-prepared to address its significant consequences for Oregon’s justice system,” Rosenblum said.\nThe Supreme Court decision “has finally ended an unjust rule with a shameful past in Oregon,” said professor Aliza Kaplan, director of the Criminal Justice Reform Clinic at Lewis & Clark Law School in Portland, Oregon.\nIn 1934, Oregon voters decided to amend the state constitution to allow split-jury verdicts — a decision fueled by white supremacy and anti-minority sentiment. First-degree murder convictions still required a unanimous jury verdict.\nCash Spencer was one of two jurors in a 2016 trial in Portland who voted that the defendant was innocent. She was also the only African-American on the jury in which the defendant was also black.\nThe 10-2 conviction of Olan Williams for felony sodomy was all the more remarkable because a third juror had said she believed Williams was innocent, but changed her vote because she didn’t have child care and didn’t want to return the next day.\nOn Monday, Spencer applauded the Supreme Court ruling and said Williams’ conviction should be thrown out.\n“I think it’s great news,” Spencer said. “When you think about something as serious as whether someone is guilty or innocent, you would want to know at least that it was determined unanimously.”\nMarc Brown, an Oregon public defender who works on appeals, represents Williams.\n“We are waiting to hear from the state about which cases they will agree should have new trials,” Brown said. “Our position is that any case in which the jury was not unanimous should go back for a new trial.”\nIt will be impossible to rectify cases going back almost 90 years, Brown noted.\n“For many of those individuals, this decision comes too late but for many others, today’s decision will allow them an opportunity to have a new trial in which the state will truly have to prove its case beyond a reasonable doubt,” he said in an email.\nThe Oregon District Attorneys Association said the change to unanimous verdicts could make criminal convictions more difficult, but added: “It is a hallmark of our justice system that it should be difficult to take someone’s liberty.”\nThe Supreme Court ruled in a 6-3 vote Monday that juries in state criminal trials must be unanimous to convict a defendant.\nJustice Neil Gorsuch wrote that the practice is inconsistent with the Constitution’s right to a jury trial and that it should be discarded as a vestige of Jim Crow laws in Louisiana and racial, ethnic and religious bigotry that led to its adoption in Oregon in the 1930s.\nKaplan said her justice clinic is available to assist those with non-unanimous jury convictions who remain in custody along with those no longer incarcerated who wish to revisit their convictions.\n“Now Oregon will be able to join the rest of the country and require unanimous juries in all criminal cases ensuring a more fair trial for all those accused of crimes and ensuring that all jurors’ voices are heard,” the Lewis & Clark Law School professor said.\nThe Supreme Court overturned the conviction of Evangelisto Ramos. He is serving a life sentence in Louisiana for killing a woman after a jury voted 10-2 to convict him in 2016. In 2018, Louisiana voters changed the law for crimes committed beginning in 2019.\n___\nFollow Andrew Selsky on Twitter at https://twitter.com/andrewselsky", "url": "https://apnews.com/9eb56d5b027a55262ea6056e1ba2a00b"}