{"authors": [], "date_download": "2020-05-04 20:06:58", "date_modify": "2020-05-04 20:06:58", "date_publish": "2020-04-07 22:50:04", "description": "DANA POINT, Calif. (AP) — A tall ship that sank at its dock in Dana Point will be demolished because there is no safe way to lift and salvage it. The decision was made over the weekend...", "filename": "_a4a8647a199b344e25b7aa85f722cf1c_1588622818.html", "image_url": "https://storage.googleapis.com/afs-prod/media/50d53b794d6f4f848e0001c0197dd7ad/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a4a8647a199b344e25b7aa85f722cf1c_1588622818.html", "title": "Sunken Southern California tall ship will be demolished", "title_page": "Sunken Southern California tall ship will be demolished", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this March 30, 2020 file photo, workers and a crane operator attempt to right the historic tall ship Pilgrim at The Ocean Institute in Dana Point, Calif. The ship will be demolished because there is no way to lift it. The Orange County Register says the decision was made over the weekend after the U.S. Coast Guard stopped salvage efforts deemed too risky for divers. (Jeff Gritchen/The Orange County Register via AP, File)\nFILE - In this March 30, 2020 file photo, workers and a crane operator attempt to right the historic tall ship Pilgrim at The Ocean Institute in Dana Point, Calif. The ship will be demolished because there is no way to lift it. The Orange County Register says the decision was made over the weekend after the U.S. Coast Guard stopped salvage efforts deemed too risky for divers. (Jeff Gritchen/The Orange County Register via AP, File)\nDANA POINT, Calif. (AP) — A tall ship that sank at its dock in Dana Point will be demolished because there is no safe way to lift and salvage it.\nThe decision was made over the weekend following extensive efforts to save the Pilgrim, the Orange County Register reported . It keeled over in its slip on March 29, leaving its masts out of the water.\nThe 130-foot-long (39.6-meter) vessel is a replica of the sailing ship that Richard Henry Dana Jr. wrote about in the classic book “Two Years Before the Mast.” The original Pilgrim that Dana sailed on from Boston in 1834 carried New England goods to California for sale or trade and in return carried back a load of cattle hides.\nThe Ocean Institute, the organization that maintained the vessel that was built in 1945, had warned it probably was beyond repair.\nEfforts were made to lift the ship on air cushions so it could be taken to a shipyard for inspection but the U.S. Coast Guard halted efforts on Thursday because the work was considered too risky for divers, the Register said.\nIt wasn’t clear what caused the vessel to sink.\nThe ship served as a classroom for marine science and maritime history programs.\n“It is unreal to think that the vessel that had so faithfully served as a living classroom to so many students is definitely no longer with us,” said Wendy Marshall, president and CEO of the Ocean Institute.", "url": "https://apnews.com/a4a8647a199b344e25b7aa85f722cf1c"}