{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:31:47", "date_modify": "2020-05-04 20:31:47", "date_publish": "2020-04-30 15:26:54", "description": "Biden's presidential campaign has denied the claim, but the candidate himself has been silent.", "filename": "entry_nancy-pelosi-satisfied-joe-biden-tara-reade_n_5eaad7cbc5b6efb0d33d1064_1588624307.html", "image_url": "https://img.huffingtonpost.com/asset/5eaadc84250000b011eb0a0d.png?cache=qki4eswmce&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_nancy-pelosi-satisfied-joe-biden-tara-reade_n_5eaad7cbc5b6efb0d33d1064_1588624307.html", "title": "Nancy Pelosi 'Satisfied' With Biden's Non-Response To Sexual Assault Allegation", "title_page": "Nancy Pelosi 'Satisfied' With Biden's Non-Response To Sexual Assault Allegation | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "House Speaker Nancy Pelosi (D-Calif.) on Thursday said she’s “satisfied” with Joe Biden’s response to former Senate staffer Tara Reade’s sexual assault allegation against him. But the presidential candidate himself hasn’t yet addressed it.\nThough his campaign has vehemently denied Reade’s claim, Biden has been publicly silent on it to the frustration of many liberal activists and women’s rights advocates.\nPelosi, who endorsed Biden on Monday, wouldn’t say whether Biden should address the allegation head-on when asked during an appearance on CNN’s “New Day.”\n“Well, I have great sympathy for any women who bring forth an allegation,” Pelosi said. “I’m a big, strong supporter of the Me Too movement. I think it’s made a great contribution to our country and I do support Joe Biden.”\n“I’m satisfied with how he has responded,” she continued. “I know him.”\n.@SpeakerPelosi says she supports Joe Biden and is “satisfied with how he has responded\" to a sexual assault allegation against him. https://t.co/HtLbqYaRAq pic.twitter.com/v3mH3jWXMc — New Day (@NewDay) April 30, 2020\nHost Alisyn Camerota asked Pelosi again to answer whether she believes the former vice president should “directly, publicly” address it.\n“You know, it’s a matter that he has to deal with,” Pelosi said. “But I am impressed with the people who worked for him at the time saying that they absolutely never heard one iota of information about this. Nobody ever brought forth a claim or had anybody else tell them about such a claim.”\n“We have an important election at hand,” she added. “I supported [Biden] because he’s a person of great values, integrity, authenticity, imagination and a connection to the American people.”\nReade has alleged Biden pushed her against a wall and penetrated her with his fingers when she worked as a staff assistant in his Senate office in 1993. She said she was fired after she complained to senior staffers in the office and filed a formal complaint about Biden’s alleged sexual misconduct.\nA New York Times investigation published earlier this month confirmed Reade worked for Biden’s Senate office from December 1992 through August 1993.\nThree former Senate aides whom Reade said she complained to contemporaneously told the Times that they either did not remember the incident or said that it did not happen. Ted Kaufman, who was Biden’s chief of staff at the time, said he “did not know her” and that she didn’t complain to him about Biden’s behavior.\nThe Times said no other person accused Biden of sexual assault during its review of Reade’s allegation.\nDuring an interview with MSNBC on April 17, Pelosi said she was “satisfied” with Biden’s response to Reade’s allegation. But that was before new developments surrounding the allegation emerged this week.\nReade’s former neighbor Lynda LaCasse told Business Insider in a report published Tuesday that Reade told her in the mid-1990s that Biden sexually assaulted her. Reade’s brother Collin Moulton said he recalled his sister telling him that Biden “had his hand under her clothes at some point.”\nReade has said she also told her mom about the alleged assault at the time. Last week, video surfaced of a woman, who Reade said is her mother, calling into a live broadcast of “Larry King Live” on CNN in 1993. King was airing a segment called “Washington: The Cruelest City on Earth?” “I’m wondering what a staffer would do besides go to the press in Washington,” the caller said. “My daughter has just left there, after working for a prominent senator, and could not get through with her problems at all, and the only thing she could have done was go to the press, and she chose not to do it out of respect for him.”", "url": "https://www.huffpost.com/entry/nancy-pelosi-satisfied-joe-biden-tara-reade_n_5eaad7cbc5b6efb0d33d1064"}