{"authors": ["Lauren Del Valle"], "date_download": "2020-05-04 16:05:18", "date_modify": "2020-05-04 16:05:18", "date_publish": "2020-04-02 06:48:21", "description": "Attorneys for parents in the college admissions scandal case, including Lori Loughlin and her husband Mossimo Giannulli, filed a collection of motions to the dismiss charges against them in Massachusetts federal court Wednesday.", "filename": "2020_04_02_us_lori-loughlin-college-admissions-scandal_index_1588608318.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190502152030-lori-loughlin-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_us_lori-loughlin-college-admissions-scandal_index_1588608318.html", "title": "Lori Loughlin and 13 other defendants move to dismiss charges in college admissions scandal", "title_page": "Lori Loughlin and 13 other defendants move to dismiss charges in college admissions scandal - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Attorneys for parents in the college admissions scandal case, including Lori Loughlin and her husband Mossimo Giannulli, filed a collection of motions to the dismiss charges against them in Massachusetts federal court Wednesday.\nOne memo filed on behalf of 14 defendants including Loughlin and Giannulli argues that charges should be dismissed because the venue was chosen to \"accommodate the government's venue preferences.\"\nThe motion says in reality the alleged scheme described in the indictment involves \"moving defendants, residing outside of Massachusetts, conspired outside of Massachusetts, with an individual from outside of Massachusetts to obtain admission to universities outside of Massachusetts. For Moving Defendants, the purported crimes have no connection to Massachusetts which could establish venue.\"\nLoughlin didn't participate in quid pro quo, attorneys argue\nIn one motion, attorneys for Loughlin and her husband say they shouldn't be charged with honest services fraud because they didn't knowingly participate in a quid pro quo with the University of Southern California. The attorneys say the couple thought they were making a legitimate donation and had no knowledge that the checks they wrote would personally benefit the involved administrators.\nRead More", "url": "https://www.cnn.com/2020/04/02/us/lori-loughlin-college-admissions-scandal/index.html"}