{"authors": [], "date_download": "2020-05-04 20:03:17", "date_modify": "2020-05-04 20:03:17", "date_publish": "2020-05-04 18:02:36", "description": "Police seized 90 dogs from the Trixie Foundation shelter, which identifies itself as a no-kill shelter and an “Eden” for animals.", "filename": "entry_dead-animals-in-kentucky-shelter-freezer_n_5eb05212c5b65d611ceeba11_1588622597.html", "image_url": "https://img.huffingtonpost.com/asset/5eb0565e24000029038ea386.jpeg?cache=h6tst8jkfh&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_dead-animals-in-kentucky-shelter-freezer_n_5eb05212c5b65d611ceeba11_1588622597.html", "title": "Kentucky Police Find Dead Dogs And Cats In Shelter's Freezer", "title_page": "Kentucky Police Find Dead Dogs And Cats In Shelter's Freezer | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "WEBBVILLE, Ky. (AP) — Police seized 90 dogs from a no-kill animal shelter in Kentucky due to its allegedly poor conditions, and charged its owner after dead cats and dogs were found in the facility’s freezer.\nThe dogs were taken Saturday because of “poor living conditions” at the Trixie Foundation’s shelter, Kentucky State police said in a news release reported by news outlets. The shelter’s website advertises itself as an “Eden” for animals and the “best kept secret in animal welfare.”\nMelissa Bowman, president of Kentuckians Vote for Animals, accompanied police during the raid. She told the Lexington Herald-Ledger that the dogs suffered “medical neglect” and some were found with tumors. Other dogs had to be tranquilized before leaving the shelter, and one dog was euthanized at the facility.\nPolice obtained a search warrant after receiving complaints about the shelter in April, the Herald-Ledger reported.\nShelter owner Randy Skaggs, who was scheduled to stand trial this June on misdemeanor animal cruelty charges from 2018, said he provides medical care when the animals need it. He said he neglected to bury the seven cats and five dogs found in the freezer because of a high workload.\n“I’ve not intentionally done anything except try to help these animals,” Skaggs said. “Everyone makes mistakes, and I’ve made plenty of them.”\nSkaggs blames critics of his no-euthanization policy with influencing this latest raid, to pressure him to plead guilty to the earlier charges. Skaggs, 68, now faces 12 additional counts, of improper disposal. He was not arrested, and said he intends to fight all the charges.", "url": "https://www.huffpost.com/entry/dead-animals-in-kentucky-shelter-freezer_n_5eb05212c5b65d611ceeba11"}