{"authors": ["Jennifer Hansler"], "date_download": "2020-05-04 17:03:25", "date_modify": "2020-05-04 17:03:25", "date_publish": "2020-04-10 20:54:05", "description": "The State Department has repatriated more than 10,000 Americans over the course of this week alone as the department looks to eventually phase out government-chartered repatriation flights.", "filename": "2020_04_10_politics_state-department-repatriation-flights_index_1588611805.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409092842-new-york-jfk-coronavirus-travel-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_state-department-repatriation-flights_index_1588611805.html", "title": "State Dept brings back 10,000 Americans this week as it looks to phase out government repatriation flights", "title_page": "State Dept brings back 10,000 Americans this week as it looks to phase out government repatriation flights - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The State Department has repatriated more than 10,000 Americans over the course of this week alone as the department looks to eventually phase out government-chartered repatriation flights.\nPrincipal Deputy Assistant Secretary of State for Western Hemisphere Affairs Julie Chung said Friday that they had brought home a total of 56,000 people from overseas, including 30,000 from Latin America and the Caribbean. The head of the department's repatriation task force, Ian Brownlee, told reporters Monday that the overall number was more than 45,000.\nBrownlee said Friday that the department was tracking roughly 20,000 travelers who may still seek assistance coming back to the US, but said that number \"remains somewhat fuzzy.\" Chung recounted that in her time on the ground in Peru, for example, \"somebody changed their mind, right before they boarded and said, 'Actually I do want to stay here and just wait it out here.'\"\n\"We will 'finish' our State Department chartered flights sometime soon\"\nBrownlee has repeatedly urged those travelers who remain abroad to come home or prepare to wait out the pandemic-related travel restrictions from where they are.\nRead More", "url": "https://www.cnn.com/2020/04/10/politics/state-department-repatriation-flights/index.html"}