{"authors": [], "date_download": "2020-05-04 20:22:18", "date_modify": "2020-05-04 20:22:18", "date_publish": "2020-04-10 22:42:20", "description": "SANDY SPRINGS, Ga. (AP) — A Georgia construction company was fined around $170,000 after a worker fell to his death in February at the Interstate-285/Georgia 400 interchange, officials said....", "filename": "_ffc89c4d5cc083d873cea837c97b7be0_1588623738.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ffc89c4d5cc083d873cea837c97b7be0_1588623738.html", "title": "Georgia contractor cited after worker falls to death", "title_page": "Georgia contractor cited after worker falls to death", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SANDY SPRINGS, Ga. (AP) — A Georgia construction company was fined around $170,000 after a worker fell to his death in February at the Interstate-285/Georgia 400 interchange, officials said.\nMartin-Pinero Construction was cited by the U.S. Department of Labor’s Occupational Safety and Health Administration for “exposing employees to fall hazards,” news outlets reported, citing a press release. The construction contractor, located in North Druid Hills, was fined $170,020.\nLeoniso Sandoval, 49, was working on the interchange’s improvement project in Sandy Springs when on Feb. 13 he fell and suffered fatal injuries.\nOSHA said the worker fell while attempting to install permanent metal decking on the Ga. 400/I-285 flyover bridge ramp. The agency said Martin-Pinero failed to ensure workers used a horizontal lifeline system and failed to secure metal decking before workers were allowed to walk on it.\nThe agency said the contractor also failed to provide fall protection training or conduct regular job site instructions.\nThe contractor has 15 days to either comply, request an informal conference or contest the findings, the agency said.\nIt’s unclear whether the contraction company could be reached for comment.", "url": "https://apnews.com/ffc89c4d5cc083d873cea837c97b7be0"}