{"authors": [], "date_download": "2020-05-04 20:21:34", "date_modify": "2020-05-04 20:21:34", "date_publish": "2020-04-14 04:03:36", "description": "SOCORRO, N.M. (AP) — Federal land managers have finished an environmental review of a planned 100-megawatt wind farm near the Arizona-New Mexico border. The Bureau of Land Management says...", "filename": "_b3aed67bf57d19ada94281e302d03182_1588623694.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b3aed67bf57d19ada94281e302d03182_1588623694.html", "title": "New Mexico wind farm to provide power for Arizona customers", "title_page": "New Mexico wind farm to provide power for Arizona customers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SOCORRO, N.M. (AP) — Federal land managers have finished an environmental review of a planned 100-megawatt wind farm near the Arizona-New Mexico border.\nThe Bureau of Land Management says anyone with concerns about the Borderlands Wind project has until May 11 to file a protest.\nResidents are worried about the lack of economic benefits to the rural area as well as the degradation of property values, views, the night sky and negative effects on eagles, bats and other avian species.\nUnder the agency’s preferred alternative, the wind farm would include 34 turbines on more than two dozen square miles (67 square kilometers) of federal land southwest of Quemado, New Mexico. Aside from turbines that will be limited to a height of 630 feet (192 meters), the wind farm will include access roads, transmission lines and a substation.\nThe developer — Borderlands Wind LLC, a subsidiary of NextEra Energy — proposed building the wind farm near the state line to meet the needs of Tucson Electric Power, which is looking to add more power generated from renewable resources as it works to meet standards in Arizona.\nBorderlands Wind has said the wind farm will generate tax revenue for Catron County and create five permanent jobs.", "url": "https://apnews.com/b3aed67bf57d19ada94281e302d03182"}