{"authors": [], "date_download": "2020-05-04 20:16:09", "date_modify": "2020-05-04 20:16:09", "date_publish": "2020-04-08 19:31:12", "description": "SCOTTSDALE, Ariz. (AP) — A federal agency’s findings in the investigation of a 2018 plane crash in Arizona that killed all six people aboard is expected to shape lawsuits in Nevada against the...", "filename": "_18344cb525567e3b033736d516c07f69_1588623369.html", "image_url": "https://storage.googleapis.com/afs-prod/media/611def192eda47928efbe0b9c16db6a9/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_18344cb525567e3b033736d516c07f69_1588623369.html", "title": "NTSB report on Arizona plane crash to shape Nevada lawsuits", "title_page": "NTSB report on Arizona plane crash to shape Nevada lawsuits", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this April 10, 2018, file photo, police tape cordon off an area near the site of a plane crash that killed several people in Scottsdale, Ariz. A federal agency's findings in the investigation of a 2018 plane crash in Arizona that killed all six people aboard is expected to affect at least two lawsuits filed in Nevada against the estates of the dead pilots, the aircraft owner and casino giant MGM Resorts International. The pilot radioed during the ill-fated takeoff from Scottsdale Airport that the flight was \"in training mode,\" according to a National Transportation Safety Board factual report, and post-crash blood tests found that the student pilot aboard the aircraft had the hallucinogenic stimulant ecstasy and metabolic remnants of cocaine in his system. (AP Photo/Ross D. Franklin, File)\nFILE - In this April 10, 2018, file photo, police tape cordon off an area near the site of a plane crash that killed several people in Scottsdale, Ariz. A federal agency's findings in the investigation of a 2018 plane crash in Arizona that killed all six people aboard is expected to affect at least two lawsuits filed in Nevada against the estates of the dead pilots, the aircraft owner and casino giant MGM Resorts International. The pilot radioed during the ill-fated takeoff from Scottsdale Airport that the flight was \"in training mode,\" according to a National Transportation Safety Board factual report, and post-crash blood tests found that the student pilot aboard the aircraft had the hallucinogenic stimulant ecstasy and metabolic remnants of cocaine in his system. (AP Photo/Ross D. Franklin, File)\nSCOTTSDALE, Ariz. (AP) — A federal agency’s findings in the investigation of a 2018 plane crash in Arizona that killed all six people aboard is expected to shape lawsuits in Nevada against the estates of the dead pilots, the aircraft owner and casino giant MGM Resorts International.\nA pilot radioed during the ill-fated takeoff from Scottsdale Airport that the flight was “in training mode,” according to a National Transportation Safety Board report. Post-crash blood tests found the student pilot who may have been at the controls had the hallucinogenic stimulant ecstasy and metabolic remnants of cocaine in his system.\nThe single-engine Piper PA-24 Comanche also was over its weight limit when it banked low and crashed in a fireball on a golf course 70 seconds after takeoff in April 2018. The flight was bound for North Las Vegas Airport, authorities said.\nA lawsuit filed Friday in Nevada state court by the family of internet “social influencer” Anand Patel, a passenger who was killed, alleges the pilot, Erik Valente, and trainee James Pedroza, both of Las Vegas, were employees or agents of MGM Resorts and the registered aircraft owner, Blake Brooksby, of Pahrump, Nevada.\nA telephone call Wednesday to a number possibly associated with Brooksby rang unanswered.\nMGM Resorts spokeswoman Debra DeShong did not immediately comment about the lawsuit. Deshong on Monday told the Las Vegas Review-Journal that it was unclear why MGM Resorts had been named as a defendant.\nAnother wrongful death lawsuit filed last year in Las Vegas against Pedroza and Valente is on hold pending a final NTSB report. It was filed by by Stacey and Christopher Coogan, parents of internet model Mariah Coogan, a passenger who died.\nValente was a certified airport pilot, but the NTSB report didn’t say who was handling the controls of the plane at the time of the fatal nighttime flight.\nNTSB factual reports summarize findings while conclusions on crash causes are provided in a final report. NTSB spokesman Keith Holloway said Wednesday a final report is pending.\nNo drugs were found in Valente’s system, according to the NTSB. He was described as an experienced airline transport pilot and flight instructor who flew the six-seat plane to Scottsdale from North Las Vegas to pick up Pedroza and four passengers, also including Helena Lagos and Iris Carolina Rodriguez Garcia.\nThe report said the plane was 135 pounds (61.2 kilograms) over its weight limit of 3,200 pounds (1,451 kilograms) and its center of gravity was more than 2 inches (5 centimeters) too far toward the tail.", "url": "https://apnews.com/18344cb525567e3b033736d516c07f69"}