{"authors": ["Alex Chaet"], "date_download": "2020-05-04 17:01:46", "date_modify": "2020-05-04 17:01:46", "date_publish": "2020-04-10 14:31:11", "description": "A star singer explains her awkward interview, a massive \"silly string\" sea creature is discovered, and an Olympian takes on Spider-Man. These are the must-watch videos of the week.", "filename": "2020_04_10_app-news-section_ca1df0263180a95e1ccd409f822a58f0_index_1588611706.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407104707-deep-sea-silly-string-creature-super-tease.png", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_app-news-section_ca1df0263180a95e1ccd409f822a58f0_index_1588611706.html", "title": "Must-watch videos of the week", "title_page": "Must-watch videos of the week - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A star singer explains her awkward interview, a massive \"silly string\" sea creature is discovered, and an Olympian takes on Spider-Man. These are the must-watch videos of the week.\nSeclusion confusion\nJUST WATCHED Lady Gaga explains awkward appearance on Jimmy Fallon's show. Replay More Videos ... MUST WATCH Lady Gaga explains awkward appearance on Jimmy Fallon's show. 01:50\nLike many of us working from home recently, Lady Gaga had some teleconference issues while making an appearance with Jimmy Fallon on \"The Tonight Show.\" Days later, she gave a second interview to explain what went wrong. The pop star also announced she is helping to organize a broadcast called \"One World: Together at Home.\"\nA new creature from the deep\nJUST WATCHED Scientists find massive 'silly string' creature in deep sea. Replay More Videos ... MUST WATCH Scientists find massive 'silly string' creature in deep sea. 00:56\nJust when you think we've discovered it all, nature will throw a curveball. Scientists have discovered a new creature called a siphonophore (trying saying that five times fast) lurking in the Indian Ocean, with an outer ring measuring 154 feet in length. A relative of the jellyfish, they are made up of millions of interconnected clones, each of which performs a different job.\nRead More", "url": "https://www.cnn.com/2020/04/10/app-news-section/videos-of-the-week-mobile-april-10/index.html"}