{"authors": [], "date_download": "2020-05-04 20:05:29", "date_modify": "2020-05-04 20:05:29", "date_publish": "2020-04-09 20:45:38", "description": "KINGSTON, Wash. (AP) — Three people were rescued in Washington state after their boat ran aground off President Point near Kingston, authorities said. No one was reported injured. North...", "filename": "_16712f712a7977fb7315b5ccb28a79c4_1588622729.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_16712f712a7977fb7315b5ccb28a79c4_1588622729.html", "title": "Vessel runs aground, spills some fuel near Kingston", "title_page": "Vessel runs aground, spills some fuel near Kingston", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "KINGSTON, Wash. (AP) — Three people were rescued in Washington state after their boat ran aground off President Point near Kingston, authorities said. No one was reported injured.\nNorth Kitsap Fire and Rescue crews responded to the scene Wednesday around 5 a.m. after the Coast Guard received a distress call of a vessel taking on water, the Kitsap Sun reported .\nThose on the 65-foot (20-meter) vessel escaped in life rafts because the rescue boat could not access them through shallow waters, rescue crew members said.\n“The boat’s owner and operator told firefighters that he likely he fell asleep while underway from Gig Harbor and was awakened only when the bilge alarm sounded as the grounded and listing vessel began taking on water,” North Kitsap Fire and Rescue said in a statement.\nSome fuel spilled out of the recently filled tanks through vents, which were then closed to prevent additional spillage, Department of Ecology spokesman Larry Altose said.\n“With it being recently filled, we’re very glad to get those vents plugged,” Altose said, adding that the vessel can hold up to 8,000 gallons (30,283 litres) of fuel.\nThe Coast Guard and the vessel owner have started to develop a salvage plan to get the boat on its way.", "url": "https://apnews.com/16712f712a7977fb7315b5ccb28a79c4"}