{"authors": [], "date_download": "2020-05-04 16:01:32", "date_modify": "2020-05-04 16:01:32", "date_publish": "2020-03-31 19:01:40", "description": "Keeping your online accounts and personal information secure is a never-ending job. It feels like there are weekly reports of database leaks containing usernames and passwords. At first, it's easy to dismiss a new hack as being part of just one account for a service you no longer use, but if you reuse passwords across your other online accounts, that leak has effectively provided the keys to the rest of your accounts.", "filename": "2020_03_31_cnn-underscored_best-password-manager_index_1588608092.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331130553-underscored-password-managers-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_cnn-underscored_best-password-manager_index_1588608092.html", "title": "Five password managers to keep your online accounts secure", "title_page": "Best Passwords Managers: 1Password vs NordPass vs LastPass vs Keeper Security - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Keeping your online accounts and personal information secure is a never-ending job. It feels like there are weekly reports of database leaks containing usernames and passwords. At first, it's easy to dismiss a new hack as being part of just one account for a service you no longer use, but if you reuse passwords across your other online accounts, that leak has effectively provided the keys to the rest of your accounts.\nUsing a complex password and two-factor authentication for all of your accounts is paramount to keeping your information secure, but it's also a complicated task.\nEnter a password manager. We're not talking about sticky notes just below your monitor or a notebook you carry around at all times. A modern password manager is an app or service on your phone or computer that you use to generate and store your passwords. Handy right?\nWhen looking for a password manager, it's important to look for providers that support multiple platforms. Most of us don't use just one device — we have a phone, computer and maybe even a tablet — and it's important you're able to access your passwords on any device you use. Otherwise, entering a 24-character password containing random letters, numbers and symbols by hand will surely frustrate you enough to go back to simple passwords.\nOther important factors to consider are the cost, family plans, two-factor authentication support, multiple vaults and the app's ability to perform a security audit on your current passwords.\nBelow are five password managers that do some, if not all, of those tasks and will help you keep your online accounts secure.\nKeeper Security's password manager has an app for macOS, Windows, Linux, iOS and Android, and a web vault, allowing you to create and access your login credentials from nearly every device. You'll need to install the KeeperFill browser extension for autofill capabilities.\nThere's a free 30-day trial for the Unlimited Plan, which will cost $29.99 a year for the individual plan or $49.99 a year for the family plan.\nYou don't have to sign up for a paid account, but keep in mind the free version is limited to just one device with no backup protection. The unlimited plan allows you to access your passwords from unlimited devices, has cloud backups and allows the sharing of passwords with trusted contacts.\n1Password is a name that's synonymous with password managers. It's been around since 2006, offering support for a growing list of devices. Right now, you can access your 1Password vault on macOS, Windows, Linux, ChromeOS, iOS and Android. Of course, 1Password has extensions for all major browsers to create, store and fill your passwords.\nThere isn't a free plan. Instead, you can try the service for 30 days before you have to pay. An individual plan will set you back $36 a year, or $60 a year for a family plan.\nBoth plans include unlimited passwords on an unlimited number of devices. The family plan will allow up to five people to share one account, with the account owner being able to manage what members have access to, and restore an account for someone who gets locked out.\nNord is better known for its VPN service, but has recently branched out into password management. NordPass does all of the typical password management tasks like create, store and fill passwords on your behalf across all major computing platforms.\nThere's a free plan that allows you to store an unlimited number of passwords in your account, but you can only use one device at a time. In our testing, that means when you sign into the app on one device, you'll be signed out on the last device you accessed your NordPass account with. You can see a complete rundown of the NordPass plans here.\nThe cost of the premium plan depends on its length. It's $59.76 for two years, $38.88 for one year or $4.99 a month. With that, you gain access to your account on six devices, encrypted password sharing and trusted contacts (the ability to share your vault with a few trusted individuals).\nLastPass is often hailed as the best free password manager, and for good reason. You'll have access to an unlimited number of passwords on any and every device you own, complete with autofill. You can even share a password with someone on the free plan.\nIn other words, it's a fully capable password manager that won't cost you anything.\nThere are paid plans, of course. The Premium plan adds more sharing options, emergency access and 1GB of encrypted file storage for $36 a year. The family plan is $48 a year for six licenses, a family manager dashboard, and unlimited shared folders.\nDashlane's offering has all the right features for a password manager, but it has something else that's quite impressive. Dashlane can change your account password across a long list of services with just a few clicks. You don't need to go to each account, navigate to your password settings, then copy and paste the new password from your password manager.\nDashlane has a free plan, but it's limited to 50 passwords on a single device. A premium Dashlane account will cost $60 a year for unlimited passwords and devices. There's also a $120 a year premium plus plan that includes identity theft insurance and restoration.\nLet's recap\nAll of these options fit different budgets and needs based on their unique features and approaches. Whether you only need only something for one device and a limited number of accounts, or you want something that can change numerous account passwords with the click of a button — there's something for everyone.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/03/31/cnn-underscored/best-password-manager/index.html"}