{"authors": [], "date_download": "2020-05-04 20:28:38", "date_modify": "2020-05-04 20:28:38", "date_publish": "2020-04-09 13:52:42", "description": "SPARTANBURG, S.C. (AP) — A traveling minister who was arrested this week in South Carolina on charges of sexual misconduct involving teenage boys has had multiple addresses throughout the United...", "filename": "_994eb23593d8fea0c8b15494502cc3ed_1588624118.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_994eb23593d8fea0c8b15494502cc3ed_1588624118.html", "title": "Traveling minister accused of sexual misconduct with boys", "title_page": "Traveling minister accused of sexual misconduct with boys", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SPARTANBURG, S.C. (AP) — A traveling minister who was arrested this week in South Carolina on charges of sexual misconduct involving teenage boys has had multiple addresses throughout the United States, leading authorities to believe there may be more victims.\nWilliam Coats was arrested Wednesday in Spartanburg County and charged with indecent exposure, disseminating obscene material and contributing to the delinquency of a minor, news outlets reported.\nA teenage boy told officials with the Child’s Advocacy Center that Coats asked him to take off his clothes inside a home and that Coats had twice gotten in the shower with him, according to a sheriff’s office news release.\nCoats is the pastor of Newberry Christian Ministries, a church that meets in people’s houses, according to the news release. He’s accused of ministering to young teenage boys about explicit topics.\nCoats was also accused of running a website only accessible through an approved login. Investigators said the site includes a sexually explicit fictional book.\nThe investigation began March 23. Since then, investigators learned “Coats has resided at multiple addresses throughout the United States,” so there’s a potential that there could be more victims, the news release said. Anyone with information was asked to contact the Spartanburg County Sheriff’s Office.\nJail records showed Coats booked on a $100,000 bond. It’s unclear whether he had an attorney who could comment on his behalf.", "url": "https://apnews.com/994eb23593d8fea0c8b15494502cc3ed"}