{"authors": ["Mark Long"], "date_download": "2020-05-04 20:29:02", "date_modify": "2020-05-04 20:29:02", "date_publish": "2020-04-20 18:45:21", "description": "JACKSONVILLE, Fla. (AP) — Disgruntled Jacksonville Jaguars defensive end Yannick Ngakoue goaded minority owner Tony Khan into a Twitter exchange Monday in hopes of escalating his public trade...", "filename": "_3aadf30c4e05e35557d30f43028db30d_1588624142.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e376e13a64184f59823d92daca4a58ee/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3aadf30c4e05e35557d30f43028db30d_1588624142.html", "title": "Jaguars' Ngakoue calls owner's son spoiled in Twitter spat", "title_page": "Jaguars' Ngakoue calls owner's son spoiled in Twitter spat", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Oct. 27, 2019, file photo, Jacksonville Jaguars defensive end Yannick Ngakoue (91) rushes New York Jets quarterback Sam Darnold (14) during the first half of an NFL football game, in Jacksonville, Fla. Ngakoue made another public plea to be traded, this one on his 25th birthday. Ngakoue said in a Twitter post Tuesday, March 31, 2020,“ why hold a man from taking care of his family. It’s obvious my time is up in my current situation. Let’s both move on.” (AP Photo/Stephen B. Morton, File)\nFILE - In this Oct. 27, 2019, file photo, Jacksonville Jaguars defensive end Yannick Ngakoue (91) rushes New York Jets quarterback Sam Darnold (14) during the first half of an NFL football game, in Jacksonville, Fla. Ngakoue made another public plea to be traded, this one on his 25th birthday. Ngakoue said in a Twitter post Tuesday, March 31, 2020,“ why hold a man from taking care of his family. It’s obvious my time is up in my current situation. Let’s both move on.” (AP Photo/Stephen B. Morton, File)\nJACKSONVILLE, Fla. (AP) — Disgruntled Jacksonville Jaguars defensive end Yannick Ngakoue goaded minority owner Tony Khan into a Twitter exchange Monday in hopes of escalating his public trade demand.\nIt may have backfired.\nKhan, the team’s senior vice president of football administration and technology and the son of majority owner Shad Khan, eventually told Ngakoue to “show me the compensation. I’m sure you’re really driving up the price.”\nNgakoue has been vocal about his displeasure with the franchise since the end of last season and has repeatedly said his time in Jacksonville is done. The Jaguars placed the franchise tag on Ngakoue last month, a move that would guarantee him about $18 million next season.\nBut Ngakoue has refused to sign the tender in hopes of forcing a trade. He started Monday’s Twitter rant by calling out Khan, posting “@TonyKhan stop hiding moe.”\nKhan responded: “I’m not in hiding sir, I’m in isolation getting ready for the draft. I’ve been pretty active on social media in isolation, but you wouldn’t know that since you unfollowed me (again).”\nNgakoue: “Since your feeling might today let’s both let the world in on the truth. We been had a discussion that the chargers game was my last game. Yet you try to back door the situation without answering any of my camps calls. Smh you spoiled bra.. holding up people for no reason.”\nNgakoue added a clown emoji.\nKhan: “It’s a new regime here sir. I thank you from the bottom of my heart for all of the contributions you made here. That said, tweeting insults at me won’t get you traded any faster. Only good trade compensation will do that. Please redirect your efforts into a more productive outlet.”\nNgakoue: “Just trade me. I don’t need the speech.”\nNgakoue added a checkered flag emoji.\nKhan: “Show me the compensation. I’m sure you’re really driving up the price today btw.”\nAbout six hours later, Ngakoue tried to do damage control.\n“To my new future team whomever it may be,” he posted. “I can’t wait to bring great discipline, integrity, and work ethic to that new city. Wherever I may land your going to get the hardest working defensive end in the league!”\nNgakoue has 37 1/2 sacks and 14 forced fumbles in four seasons in Jacksonville. The speedy strip-sack specialist made the Pro Bowl in 2017 and was an alternate the past two seasons. He clearly outplayed his $3.84 million rookie contract. He made $2.025 million in 2019 — far less than other top playmakers at his position.\nNgakoue said he’s “not going to play for pennies” the day after the season ended. He had been seeking around $22 million a year to remain in Jacksonville, but the Jaguars don’t seem to consider him a complete or elite defensive end worthy of that much annually.\nJacksonville also selected Ngakoue’s potential replacement, Josh Allen from Kentucky, with the seventh overall pick in the 2019 draft. Allen had 44 tackles, 10 1/2 sacks and two forced fumbles as a rookie and made the Pro Bowl as an alternate.\nThe Jaguars reportedly offered Ngakoue a short-term contract last year that would have paid him about $19 million annually and would have included more than $50 million guaranteed during the first two years. But Ngakoue’s camp balked at the deal.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/3aadf30c4e05e35557d30f43028db30d"}