{"authors": ["On Assignment For Huffpost"], "date_download": "2020-05-04 20:19:54", "date_modify": "2020-05-04 20:19:54", "date_publish": "2020-04-28 14:41:11", "description": "From finding a suitable menstrual cup for beginners to mastering the folds and figuring out how to use one, here's what it's actually like to ditch...", "filename": "entry_saalt-menstrual-cup-review-beginners-folds-how-to-use_l_5ea1d023c5b6395826b8a12a_1588623594.html", "image_url": "https://img.huffingtonpost.com/asset/5ea716543000002711154fae.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_saalt-menstrual-cup-review-beginners-folds-how-to-use_l_5ea1d023c5b6395826b8a12a_1588623594.html", "title": "Review: Using Menstrual Cups Might Be The Best Thing I've Ever Done, Period", "title_page": "Review: Using Menstrual Cups Might Be The Best Thing I've Ever Done, Period | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "HuffPost may receive a share from purchases made via links on this page. Prices and availability subject to change.\nElena Feodrina via Getty Images Are menstrual cups worth it? Nearly a year after swapping to a menstrual cup, our writer swears by hers for reducing period cramps and feeling more in touch with her body. Keep scrolling for her Saalt menstrual cup review.\nUnlike most 30-year-old women, my experience with periods has been blissfully limited. At age 19, after six years of dealing with painful, heavy and migraine-inducing menstrual cycles, my gynecologist suggested I go on continuous birth control. From then on, I gleefully kept Auntie Flo at bay for nearly a decade.\nLast year — for no reason other than curiosity — I decided to go off birth control to see what would happen to my body, mind and emotional state. This decision was in no way an indictment of hormonal birth control: It is completely healthy for most women to be on birth control and use it to skip their periods, and I will forever cherish the nine years I spent without ruining a single pair of fancy undies. Mostly, I made the choice to welcome “shark week” back into my life because I wanted to know what would happen.\nReaders, it did not go well at first.\nGoing off of birth control is different for everyone, but my first period of the decade arrived without warning and kept me confined to my bed with what I can only describe as hell cramps ripping at the inside of my uterus. I bled through super-plus tampons in record time and messed up a really nice set of new sheets. By the end of the week, I was tempted to bust out the birth control pills and give up on my experiment, but I decided to give it another month.\nWhy? Because while frantically Googling my symptoms, I stumbled across a small but hyperenthusiastic portion of the internet made up of uterus-owning people who I will call Period Cup Evangelists. The PCEs preached nonstop about how menstrual cups had changed their lives and how they no longer dreaded their periods. After a few hours of obsessively scouring Twitter threads, Amazon reviews and message boards, I caved and forked over $29 for a size small Saalt menstrual cup — which the PCE community highly recommended for comfort and ease of use for period cup beginners. (For curious minds, there’s also a regular size Saalt menstrual cup.)\nWhile menstrual cups have arguably been around longer than many period products, it has taken until now for them to actually gain traction as a viable alternative to pads and tampons. There are many reasons for this, but things are changing. With the help of social media, what once seemed like something only alt girls would be into is now making its way into mainstream culture.\nHow do you use a menstrual cup if you’re a beginner?\nphotoguns via Getty Images Learning how to put in a menstrual cup is challenging. Familiarize yourself with the different ways of folding a menstrual cup for insertion. (The author is a fan of the “punchdown” or “shell” fold.)\nMenstrual cups, which are made of a rubbery or silicone material, create a seal inside your body that keeps period blood safe inside the cup until it’s full, at which point you empty the cup, wash it off and reinsert. This typically needs to be done every 12 hours or so, although on heavier flow days you may want to check it every six to eight hours, just in case.\nWhen inserted properly, you won’t be able to feel the cup, and it should stay in place whether you’re doing Olympic-level gymnastics or — yes, I am going there! — taking a poo.\nI received my Saalt cup just days after my first period ended and waited around for a month, weirdly excited for my next one to start. When it finally did, I removed the millennial pink cup from its protective cotton bag and set to work figuring out how to insert it.\nFirst-time use is tricky, but practice makes perfect\nsirawit99 via Getty Images The author recommends menstrual cup beginners try using it on a day they'll be home. She also recommends practicing inserting it in the shower to master the movements.\nTo create a leak-free suction, you have to fold up the cup, insert it, and then twist it around to form a seal. This was difficult at first, since I wasn’t sure what the perfect seal felt like. It was also very messy. I was on the first day of my period, which, as most uterus-owners will tell you, is usually one of the messier times in a cycle.\nFor first-timers, I recommend practicing inserting your cup in the shower until you master the hand motions you need to quickly get it in and out without making your bathroom look like a crime scene. Some experts say lubricants or water can make insertion easier, too.\n“The best way to insert the cup is to wet it or use a small amount of personal, water-soluble lubricant on the cup prior to insertion,” said Dr. Mitchell Kramer, chairman of the Department of Obstetrics and Gynecology at Huntington Hospital in New York. “It should be inserted in a very similar manner to the position the individual is comfortable using with inserting a tampon. The cup can be squeezed for insertion and it will automatically expand after insertion to cover the cervix.”\nBased on my experience, I’d also recommend using the cup for the first time on the weekend or a day when you don’t need to go anywhere and can experiment with the different ways of folding a menstrual cup for insertion. (My first time wasn’t super successful because the seal wasn’t right, but now I’m a fan of the “punchdown” or “shell” fold.)\nNow for the nitty gritty: Cup-emptying 101\nAtlasStudio via Getty Images Most menstrual cups can be left in for up to 12 hours. But if you need to empty yours anywhere but the comfort of your own home, it can be removed, emptied and reinserted quickly with minimal risk of infection, experts say.\nOnce I had the cup correctly inserted, I left it in for eight hours. Technically, I could have waited longer, but I was very curious about the emptying process and excited to try it out. When the time came, I climbed into the shower — again, my pro-tip for first-timers — put my leg up on the side of the tub, and reach inside to grab the cup, which had moved up a bit since I first put it in.\nWhile most cup brands have a stem at the end (which you can trim if it pokes out of you or is uncomfortable), it isn’t really that useful when you’re pulling it out because it’ll likely be slippery. After a few minutes of mild panic, I realized all I needed to do was break the seal. With a single finger, I pushed one side of the cup against the other. I finally pulled it out, emptied it, washed it off and reinserted. This process will be different for everyone, but it gets easier with practice.\n“The cup can be removed and replaced without cleaning without significantly increasing infection risk.” - Dr. Nathan Riley, OB-GYN and host of the Obgyno Wino Podcast\nAnd, as long as you keep the cup facing upward, it shouldn’t spill. I eventually got good enough at pulling it out that I can easily do it in a public restroom if I have to. If you’re emptying it at work or somewhere you don’t have a personal sink to rinse it out in, you can quickly empty it while on the toilet and put it right back in with very minimal risk of infection, according to Dr. Nathan Riley, an OB-GYN with Norton Healthcare in Louisville, Kentucky, and host of the Obgyno Wino Podcast.\n“The cup can be removed and replaced without cleaning without significantly increasing infection risk,” Riley said. “There are so many bacterial strains that naturally live in the vagina, and many that cross-contaminate from the anus. This is just normal physiology!”\nWhat are the benefits of a menstrual cup?\nAlina Buzunova via Getty Images Since swapping to a menstrual cup, the author has experienced fewer and less severe cramps, as well as shorter periods. She's not alone. But there's little research on the phenomenon.\nRemember how my pre-birth control periods were an exercise in extreme pain tolerance? Somehow, they’re just … not anymore. Since I started using the Saalt cup, my period cramps are now just a mild annoyance rather than completely debilitating.\nAnd I know I’m not alone in this. I’ve scoured the internet looking for studies and answers to this phenomenon, but there has been very little research about it — most just a lot of personal anecdotes of similar experiences to mine. This survey of 1,500 women from feminine hygiene company Intimina is the closest thing I uncovered; it found that 36% of menstrual cup users reported a decrease in period cramps while using the cup.\n“There have been anecdotal reports of the use of the menstrual cup reducing period related cramping,” Kramer said. “However, physiologically this is unlikely based on the nature of the causes of menstrually related cramping.”\n“There have been anecdotal reports of the use of the menstrual cup reducing period related cramping.” - Dr. Mitchell Kramer, chairman of the Department of Obstetrics and Gynecology at Huntington Hospital\nAdditionally, my periods used to last six to seven days, but now they’re usually only three or four. Could the suction of the cup have something to do with the uterine lining to shedding faster, I wondered?\nThe answer is probably not, according to Dr. Lily Spencer, an OB-GYN resident.\n“The suction created by a period cup likely wouldn’t cause the lining to shed faster,” Spencer said. “Cramping has to do more with the actual work done by the uterus in response to prostaglandin hormones. The only theory I might consider would be that tampons are more likely to irritate/touch the cervix, which can cause some people to cramp more.”\nSpencer said further studies on this topic is needed.\n“Period cups make women a lot more conscious of the patterns and flow of their period because they can actually visualize how much and when they are bleeding and that allows more awareness of their body during their period,” she said. “I definitely think there needs to be some more research on this subject because I have heard many stories like yours: So many women are so happy using the cup!”\nLike many women, I have long grappled with deeply ingrained feelings of shame and disgust around my period. I think a lot of that has to do with the products I’ve used to manage them. You can kind of tell what’s going on with your period by examining your tampons and pads when you’re changing them, but it just feels gross — like looking at a dirty Band-Aid.\nBut periods aren’t wounds that need to be healed. They’re a natural, normal thing that happens to about half the world’s population once a month. Using the Saalt cup has given me the opportunity to see what my body is producing and when, and has given me a better grasp on the inner workings of my cycle.\nBesides the health benefits I’ve experienced, I like knowing that I don’t have to shell out upward of $10 a month for a box of tampons. Saalt menstrual cups claim to be good for up to 10 years, and if I can make mine last that long, I’ll be saving thousand dollars on tampons over that time (and a whole lot of cotton waste).\nNot everyone wants to consider the color, consistency and volume of their period blood. But for weirdos like me, every time I use my menstrual cup feels like a fascinating, Magic School Bus-style trip inside my own body. And after 30 years, it’s thrilling to know there are still things to learn about my own body.", "url": "https://www.huffpost.com/entry/saalt-menstrual-cup-review-beginners-folds-how-to-use_l_5ea1d023c5b6395826b8a12a"}