{"authors": [], "date_download": "2020-05-04 16:58:42", "date_modify": "2020-05-04 16:58:42", "date_publish": "2020-04-09 18:02:00", "description": "We were impressed when Apple launched the iPhone 11, and especially loved the spectacular camera setup of the 11 Pro and 11 Pro Max.", "filename": "2020_04_09_cnn-underscored_iphone-features-tips-hacks_index_1588611522.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190920093643-10-underscored-iphone-11-review-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_cnn-underscored_iphone-features-tips-hacks_index_1588611522.html", "title": "6 iPhone features you aren't using and totally should be", "title_page": "6 iPhone features you aren't using and totally should be - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "We were impressed when Apple launched the iPhone 11, and especially loved the spectacular camera setup of the 11 Pro and 11 Pro Max.\nAnd there's so much these smartphones can do that you may have overlooked, be it a preloaded app that you tossed to the side or an easy way to create a PDF. That's why we've been hunting and finding great tips and tricks that are making us more productive with our iPhones. And better yet, there's no extra charge, as your iPhone can do these out of the box.\nTap with three fingers to undo or redo\nUndo or redo typing with a three finger tap\nWhile it's a known feature, it's fair to say that \"Shake to Undo\" is sometimes forgotten. Truthfully, it's an easy way to go back a step and to undo text. But now you can also tap with three fingers to \"undo\" or \"redo\" when in a text field. This is handy for messages, typing in a URL and even with emails.\nShare a website as a PDF\nSend an entire webpage as a PDF\nYes, you can screenshot on an iPhone (just click the power button and volume up at the same time on models with Face ID, and power and home button for older models). But you can also tap \"Full Page\" to have iOS capture the entirety of the webpage. It's a great way to share news articles, your favorite listicle or even a recipe. From there, you can save it to your iPhone or share it in an email or message.\nYour iPhone can be a tape measure\nMeasure nearly anything with this built-in app\nApple first introduced the Measure app with iOS 12, and while it's a perfect demo of augmented reality, it can actually come in handy. Essentially, through the combination of the cameras on your iPhone and software smarts, it measures distances. You can mark those with different starting and stopping points, while also being able to easily change what standard you're using to measure.\nSwitch Wi-Fi on the fly\nEasily access nearby Wi-Fi networks\nIn the Control Center, you can easily turn on or off Wi-Fi, but you can also switch between different networks. Swipe down from the top left-hand corner, press the long-press into the square with connections and then long press again on the Wi-Fi symbol. It will then show the network you're currently connected to and then show a list of other networks in your range. You can switch on the fly to a known network or join a new one. Plus, this also works for Bluetooth connections.\nYour keyboard can be a mouse cursor\nHold down the screen to turn your finger into a cursor\nThere's nothing worse than writing a long email and having to oh-so-carefully click to change a double space or to fix a sentence structure. But holding down your keyboard will let you turn it into a mouse cursor, allowing you to quickly get to the spot you need to fix. It's super helpful for those quick changes.\nSwipe away a number in Calculator\nClear numbers in Calculator with a swipe\nWhile the Calculator is pretty basic, it's a handy app. But did you know hitting Clear (aka the \"C\" button) isn't the only way to start fresh? You can swipe an individual number away to remove it. This is super handy, especially if you add an extra digit. Just swipe left or right on a number to remove it.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/09/cnn-underscored/iphone-features-tips-hacks/index.html"}