{"authors": ["Analysis Daniel Dale"], "date_download": "2020-05-04 16:28:10", "date_modify": "2020-05-04 16:28:10", "date_publish": "2020-02-25 21:51:01", "description": "President Donald Trump has a long history of dubiously distancing himself from allies who have turned on him or found themselves in trouble.", "filename": "2020_02_25_politics_fact-check-trump-stone-campaign-2016_index_1588609690.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200224175241-03-trump-stone-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_02_25_politics_fact-check-trump-stone-campaign-2016_index_1588609690.html", "title": "Fact check: Trump falsely claims Roger Stone was 'never' involved in his campaign", "title_page": "Fact check: Trump falsely claims Roger Stone was 'never' involved in his campaign - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) President Donald Trump has a long history of dubiously distancing himself from allies who have turned on him or found themselves in trouble.\nHe is now doing the same with Roger Stone, the political operative who was sentenced last Thursday to 40 months in prison for five counts of lying to Congress about issues related to his relationship with WikiLeaks , one count of witness tampering and one count of obstructing the congressional investigation into Russia's interference in the 2016 election.\nTrump's comments about Stone's relationship with his campaign have grown more inaccurate over the past two weeks. The President has gone from saying Stone \"wasn't even working\" for his campaign -- leaving open the possibility that he was accurately talking about the 2017 period when Stone committed his crimes -- to falsely saying Stone never worked for his 2016 campaign at any time, to saying even more falsely that Stone was never even \"involved\" in his 2016 campaign.\nTrump repeated the first version of the claim in a February 25 tweet attacking the jury forewoman in Stone's trial, saying, \"Roger wasn't even working on my campaign.\"\nFacts First: Stone officially worked for the Trump campaign until August 2015, about a month and a half after Trump announced his candidacy. Stone remained an informal adviser after that and communicated with top Trump campaign officials in 2016 about the activities of WikiLeaks, according to witness testimony and phone records presented at Stone's trial. Stone also communicated in 2016 with Trump himself.\nWhat Trump has said\nOn February 12, Trump complained on Twitter about the seven- to nine-year prison sentence that prosecutors had originally recommended for Stone before being overruled by the Department of Justice. Trump added that Stone \"was not even working for the Trump Campaign.\"\nThis claim is arguably not false if you interpret it generously. There is no evidence that Stone was working for Trump's 2020 campaign in the fall of 2017, when Stone made his false statements to Congress and engaged in the witness tampering.\nBut then Trump escalated.\n\"Roger Stone, just so you know, never worked -- he didn't work for my campaign. There might've been a time -- way early, long before I announced -- where he was somehow involved a little bit. But he was not involved in our campaign at all,\" Trump told reporters on February 18.\nTrump then said in a speech February 20 that Stone was \"never\" involved in the Trump campaign.\n\"Roger was never involved in the Trump campaign for president. He wasn't involved. I think early on, long before I announced, he may have done a little consulting work or something, but he was not involved when I ran for president,\" Trump said.\nTrump's relationship with Stone\nThe relationship between Stone and Trump goes back more than 40 years , though it has sometimes been tumultuous.\nAs Trump suggested, Stone did do consulting work for his 2016 campaign before he announced his candidacy on June 16, 2015. Between April 2015 and May 2015, Trump's campaign paid $30,000 to a Stone company, Drake Ventures, for communications consulting, then an additional $20,000 in July 2015.\nStone's work did not stop upon Trump's announcement speech. On July 19, 2015, more than a month into Trump's campaign, the Wall Street Journal reported : \"Mr. Trump's top strategic advisers include longtime political aide Roger Stone, who ran his 2000 presidential exploratory campaign, and a team of relative political neophytes. Nobody besides Mr. Stone in the Trump inner circle has been involved in presidential campaign at a national level before. ...\"\nTrump's campaign announced on August 8, 2015, that Stone had been fired from the campaign, with a spokesperson saying he had been seeking too much personal publicity. Stone said he wasn't fired, he quit. Regardless, his official work for the campaign lasted for 53 days after Trump's announcement speech.\nBut that was not the end of his involvement. As in the past -- \"Years ago, I fired him and then he came back,\" Trump told The New York Times on the day of Stone's supposed firing in August 2015 -- Stone returned to Trump's circle even after he supposedly had been pushed away.\nStone, WikiLeaks and the Trump campaign\nDuring Stone's criminal trial in 2019, multiple witnesses testified that he had been in contact with Trump and top Trump campaign officials in 2016.\nProsecutors introduced phone records that suggested Stone and Trump spoke repeatedly by phone in 2016 -- sometimes on the same day as important news related to WikiLeaks.\nStone also communicated with his former business partner and then-Trump campaign chairman Paul Manafort, then-campaign deputy chairman Rick Gates and then-campaign chief executive officer Steve Bannon. Gates and Bannon testified that Stone had communicated with them about WikiLeaks' plans to release emails hacked from Democrat Hillary Clinton's presidential campaign and the Democratic National Committee; Bannon testified that the campaign viewed Stone as an \"access point\" to WikiLeaks.\nGates testified that he was in an SUV with Trump in New York as Trump spoke to Stone by phone on July 31, 2016, less than two weeks after WikiLeaks had released the first trove of emails hacked from the DNC (by Russia, according to US intelligence agencies and special counsel Robert Mueller). Gates testified that, after Trump got off the phone with Stone, \"he indicated more information would be coming,\" an apparent reference to WikiLeaks releases.\nStone acknowledged in his testimony to Congress that he continued to talk to Trump \"from time to time\" after his official departure from the campaign in August 2015, saying some conversations were brief but some could last \"as long as an hour.\" He claimed that the conversations were about standard election matters like Trump's prospects in key states, never about WikiLeaks. (It's safe to say Stone's word here should be treated with caution: One of his five convictions for lying to Congress was about his false denial of some of his WikiLeaks-related communications with the Trump campaign.)\nIn a written answer to questions from Mueller, Trump said , \"I do not recall discussing WikiLeaks with him, nor do I recall being aware of Mr. Stone having discussed WikiLeaks with individuals associated with my campaign, although I was aware that WikiLeaks was the subject of media reporting and campaign-related discussion at the time.\"\nProsecutors argued at Stone's trial that Stone had lied to Congress to protect Trump. Upon sentencing Stone, Judge Amy Berman Jackson echoed this argument, saying he was \"not prosecuted, as some have complained, for standing up for the president. He was prosecuted for covering up for the president.\"\nRegardless of Stone's motives, Trump's claims last week are clearly untrue. Stone worked for the campaign in the early weeks of Trump's candidacy, and he continued to be \"involved\" in the campaign long after the formal relationship ended.", "url": "https://www.cnn.com/2020/02/25/politics/fact-check-trump-stone-campaign-2016/index.html"}