{"authors": ["Aj Willingham"], "date_download": "2020-05-04 16:17:55", "date_modify": "2020-05-04 16:17:55", "date_publish": "2020-04-04 02:57:36", "description": "Social distancing heroes, hope for our oceans and story time with Dolly Parton", "filename": "2020_04_03_us_the-good-stuff-040420_index_1588609075.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330205622-dolly-parton-bedtime-stories-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_us_the-good-stuff-040420_index_1588609075.html", "title": "All The Good Stuff that happened this week", "title_page": "All The Good Stuff that happened this week - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "We've gotten to a point where fresh air is a luxury, where just being able to buy food is cause for thankfulness. Isn't it strange that the hardest times seem to command our deepest gratitude? It's not that we take good health, security and our neighborhood parks for granted. It's just that, when our worlds are turned upside down, these simple things become even more precious. Everything else seems to matter so much less. What will your gratitude inspire you to do? When all of this is over, will you live differently? Will you keep caring for those who are hurting, for those who can't step into the sunshine or put food on the table? Yes, the world is upside down right now. It's the least we can do to make it a better place when it comes upright.\nOur favorites this week\nGet going with some of our most popular good news stories of the week\nWe challenge you to recreate a work of art with objects (and people) in your home. 🥇 Choose your favorite artwork 🥈 Find three things lying around your house⠀ 🥉 Recreate the artwork with those items And share with us. pic.twitter.com/9BNq35HY2V\nPicture perfect\nLet's start off a little silly, shall we? Art institutions are closed around the world, but the J. Paul Getty Museum, based in Los Angeles, managed to curate an exhibit full of masterpieces. They asked art lovers on Twitter to recreate their favorite works of art using only items from around their house and wow, did people deliver. The Birth of Venus on a pizza? Delicious. A French bulldog as a Byzantine-style baby Jesus? Unholy, but adorable. It's a perfect example of how, even when our cultural lifelines are cut off, creativity can still thrive — even if it does involve a Swiffer and or a can of tuna.\nSpecial delivery\nFood workers are facing lost wages and even lost jobs, yet they're still managing to brighten lives and fill bellies in their communities. After citywide restrictions closed restaurants in Detroit, five chefs from local eateries took stock of their kitchens, pooled their perishables and started cooking up creations for the city's homeless and food insecure. They call their program Too Many Cooks in the Kitchen for Good , and with additional food donations, they are preparing meals for three homeless shelters that are desperately trying to keep the city's homeless citizens safe. \"The healthy meals are boosting the morale of the population, as well as lifting a financial burden from the mission,\" a representative from one of the shelters said. Meanwhile, Cliff \"Cooks\" restaurant in Barneveld, Wisconsin, is offering their food via carryout or drive-thru — for free. Barneveld is a rural town, and owner Clifford Hooks says he wants to make sure struggling neighbors know there's a meal for them if they need one.\nWhat a doll!\nRaise a glass to...\nkeanonlowe\nKeanon Lowe, a high school track and football coach who disarmed a distraught student gunman last May and then hugged him close, averting a possible tragedy and displaying compassion in one gesture. Lowe , a high school track and football coach who disarmed a distraught student gunman last May and then hugged him close, averting a possible tragedy and displaying compassion in one gesture. Lowe will be honored for his bravery with the Congressional Medal of Honor Citizen Honor by the Congressional Medal of Honor Society. The Medal of Honor is only awarded to members of the US military, but the society that gives out the awards said Lowe and the other citizen honorees \"exemplify the values embodied in the Medal of Honor: courage, sacrifice, commitment, integrity, citizenship, and patriotism.\"\nYou gotta see this\nThese creative, chilly souls are some of the winners of this year's Hair Freezing Contest, which ran this winter at the Takhini Hot Pools in Canada's Yukon Territory . Creating such elaborate icy 'dos takes more than a cool head: First, dip your head in the hot springs and wet your hair completely. Then, let the cold air slowly freeze it all, taking care to wet your ears and other vulnerable parts with hot water (because an ear freezing contest would be much less fun). Et voila! A 'do Jack Frost would be proud of.\nHeroes among us\nWanna get away?\nIt seems odd to share pictures of beautiful places since the world is so closed off right now, but the CNN Travel team has an excellent idea if you're feeling some melancholy wanderlust : Organize photos from past trips! Scanning, uploading, organizing and curating photo collections to print or share online can bring back that favorite trip feeling while reminding you of all the beauty there is to see in the world. Here, get started with a perfectly serene picture from the banks of Cape Clear in County Cork, Ireland.\nWho knew?\nMice can make different facial expressions based on how they feel. While they're probably not going to win any Academy Awards for the emoting, the teeny facial changes they make, like pricked ears or a drooped nose , could impact how we treat mood disorders. Studying how and when mice make different expressions, and what parts of the brain are triggered when they do, could help scientists understand the neurological origins of human emotions like anxiety, fear and depression.\nImpact your world\nSo we've all agreed to try and leave this world a little better than we found it. Let's start with the oceans. An international team of scientists has found that, if we all commit to serious action, the world's marine populations could be restored by as soon as 2050 . The team found marine life to be \"remarkably resilient\" despite damage caused by human activity and interference. With conservation measures like habitat restoration, responsible harvesting and pollution reduction, countless species could get a huge boost over the next few decades. \"We have a narrow window of opportunity to deliver a healthy ocean to our grandchildren's generation, and we have the knowledge and tools to do so,\" the paper's lead author wrote.\nShameless animal video\nThere's always time for cute animal videos. That time is now.", "url": "https://www.cnn.com/2020/04/03/us/the-good-stuff-040420/index.html"}