{"authors": ["Por Peter Orsi", "Gonzalo Solano Y Elliot Spagat"], "date_download": "2020-05-04 20:07:45", "date_modify": "2020-05-04 20:07:45", "date_publish": "2020-03-03 22:05:40", "description": "TAPACHULA, México (AP) — Donald Trump no es el único líder mundial que hace casi imposible que los africanos consigan asilo en Estados Unidos. Está recibiendo bastante ayuda de aliados...", "filename": "_845c15351b834e0ab8a77496085ec0d8_1588622865.html", "image_url": "https://storage.googleapis.com/afs-prod/media/7e1461c4ef974d869fcce5d365e9dc06/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_845c15351b834e0ab8a77496085ec0d8_1588622865.html", "title": "Latinoamérica les cierra las puertas a los africanos", "title_page": "Latinoamérica les cierra las puertas a los africanos", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\n1 of 2\n1 of 2\n1 of 2\n1 of 2\nTAPACHULA, México (AP) — Donald Trump no es el único líder mundial que hace casi imposible que los africanos consigan asilo en Estados Unidos. Está recibiendo bastante ayuda de aliados latinoamericanos.\nEcuador, uno de los pocos países de la región que recibían a los africanos, les está cerrando sus puertas, privándolos de un punto de partida para el peligroso viaje por tierra hacia el norte. Si los africanos llegan a México, tropiezan con otra virtual barricada en su frontera sur con Guatemala.\nLos aliados de Estados Unidos están poniendo obstáculos a los africanos que le huyen a la violencia de sus países en respuesta a las presiones de Trump, que usa el poderío económico de su nación para forzarlos a colaborar en su objetivo de reducir la inmigración. Ecuador busca un pacto comercial con Estados Unidos, en tanto que México trata de complacer a su vecino del norte, que el año pasado amenazó con imponer aranceles a sus exportaciones. Fue así que adoptó mano dura contra la inmigración ilegal.\nLos cameruneses, que le escapan a un feroz baño de sangre en el que murieron decenas de miles de personas, a menudo reciben asilo en Estados Unidos, en porcentaje más alto que el de otros africanos, pero primero deben pisar suelo estadounidense. La mayoría hablan inglés y le huye a las torturas de un gobierno francoparlante en guerra con separatistas.\nDecenas de ellos languidecen en Tapachula, una ciudad mexicana de unos 300.000 habitantes en una región bananera y cafetera junto a la frontera con Guatemala.\n“No puedo volver a mi país y no puedo salir de aquí. Estoy varado. No sé qué hacer”, expresó un camerunés de 25 años hace poco en la casa donde le permiten dormir. Come lo que le pasan otros residentes.\nEl joven habló a condición de no ser identificado por temor a comprometer su situación migratoria en México.\nTrump dice que los pedidos de asilo son “una farsa” e impuso varias políticas restrictivas, incluso la de negar asilo a toda persona que pase por otro país camino a Estados Unidos sin haber pedido refugio allí. Los arrestos en la frontera cayeron un 78% en enero respecto a mayo, en que se registró su nivel más alto en 13 años.\nSi bien la constitución de Ecuador reconoce la “ciudadanía universal”, válida para todo visitante, su gobierno dijo en agosto que las personas de 11 países, incluidos Camerún y otras seis naciones africanas, necesitarían visas para poder ingresar. Otros 12 países, la mitad de ellos de África, ya requerían visa.\nEl ministro de relaciones exteriores de Ecuador José Valencia dijo que las últimas restricciones a los visados son producto de estudios detallados de las tendencias migratorias.\n“La ciudadanía universal es un principio que no se discute ni cuestiona en el sentido que es válido, una aspiración”, expresó en una entrevista con el diario El Universo. El reto, agregó, “es evitar ahora que por tener un régimen de ciudadanía universal excesivamente abierto tengamos que recibir todas esas amenazas que nos pueden afectar a nosotros y a terceros”.\nLa medida de Ecuador llega en momentos en que busca un pacto comercial con Estados Unidos. Trump dijo que estaba trabajando en ese pacto cuando el presidente ecuatoriano Lenín Moreno fue el primer líder de su país recibido por un mandatario estadounidense en Washington en 17 años.\nTrump resaltó el contraste entre Moreno y su predecesor izquierdista Rafael Correa.\n“Ecuador tenía una visión muy inusual de la vida”, expresó Trump ante periodistas. Acto seguido describió a Moreno como “un gran presidente que entiende lo importante que es llevarse bien con Estados Unidos”.\nDespués del encuentro en la Casa Blanca del mes pasado, el subsecretario interino de Seguridad Nacional Ken Cuccinelli dijo en Twitter: “Esperamos poder colaborar para reducir la inmigración ilegal procedente de Ecuador”.\nEl 81% de los cameruneses que pidieron asilo en Estados Unidos en el año fiscal del 2019 lo recibieron, de acuerdo con información analizada por la Transactional Records Access Clearinghouse de la Universidad de Syracuse. También lo consiguieron el 77% de los etíopes, el 67% de los eritreos y el 58% de los nigerianos.\nLos africanos que quieren pedir asilo en Estados Unidos a menudo viajan por aire a América del Sur y luego siguen por tierra hacia el norte. Con frecuencia les roban o mueren de hambre o de sed. El pedido de asilo toma menos tiempo que el de refugiado, un status muy difícil de alcanzar y que puede tomar años, sobre todo ahora que Trump redujo enormemente la cantidad de refugiados que admite Estados Unidos.\nBolivia, que está en el extremo sur del continente americano, mucho más lejos que Ecuador, es el único país de las Américas que acepta cameruneses y eritreos sin visa, de acuerdo con el Henley Passport Index. Congoleses y nigerianos necesitan visa en todas las naciones de las Américas.\nLos cameruneses que hablan inglés empezaron a ir a Estados Unidos no hace mucho, pensando que tenían un aliado en Trump, según Alexandra Lamarche, experta en África de Refugees International, organización que ayuda a los refugiados. El año pasado Estados Unidos redujo la asistencia militar a Camerún, un viejo aliado, y Trump eliminó algunos de los beneficios por violaciones a los derechos humanos, incluidas matanzas extrajudiciales, detenciones arbitrarias y torturas.\nLos cameruneses sentían cierta afinidad con Estados Unidos por el idioma compartido, dijo Lamarche. Muchos se radicaron en Washington, Dallas y Houston.\n“Todo el mundo tenía una conexión” con Estados Unidos, indicó Lamarche.\nMás de 2.400 cameruneses llegaron a Ecuador en el 2019, más de tres veces el total del año previo, de acuerdo con cifras del gobierno, incluido el hombre de 25 años que está varado en México.\nEscapó de Camerún después de ser apresado dos veces, acusado de oponerse al gobierno, y dice que fue golpeado, obligado a yacer tendido sobre agua y a caminar sobre sus rodillas en un piso duro.\nDijo que sus estadías en la cárcel “fueron muy estresantes. No te das cuenta dónde te golpean. Te patean con botas pesadas. Me destrozaron los dedos del pie”.\nYa en América del Sur, caminó seis días por la selva en el Tapón del Darién entre Colombia y Panamá. Se quedó sin comida y vio cómo unos amigos eran arrastrados por las aguas de los ríos. Dijo que asaltantes violaron a algunas mujeres, le robaron 500 dólares y se llevaron también teléfonos y relojes.\nDespués de esperar tres meses por documentos de viaje para encaminarse desde el sur de México hacia Estados Unidos, partió sin ellos en octubre y estuvo detenido dos meses cuando su autobús fue parado en un puesto de control.\nDe vuelta en Tapachula, la ciudad mexicana más grande de la frontera con Guatemala, durmió en las calles y mendigó dinero hasta que el dueño de una casa de huéspedes le permitió dormir sobre almohadones en el piso de un pasillo. Come lo que le pasan otros residentes de la casa, que duermen de a cuatro por habitación.\n“No sé qué hacer para salir de aquí”, expresó. “No me dan mis papeles”.\nLos cameruneses están desesperados y no tienen adónde ir, dijo Salva Lacruz, del Centro de Derechos Humanos Fray Matías de Córdova de Tapachula.\nEl verano pasado, decenas de cameruneses llegaron a diario a Tijuana y se anotaron en una lista de espera para radicar su pedido de asilo en Estados Unidos. Ahora casi nadie llega a esa ciudad mexicana de la frontera mexicano-estadounidense.\nUn hotel del distrito rojo de Tijuana les alquiló 15 habitaciones a los cameruneses el verano pasado. En cada una dormían tres personas. En febrero, un empleado de la recepción dijo que había solo dos habitaciones con cameruneses.\n___\nSolano informó desde Quito y Spagat desde Tijuana.", "url": "https://apnews.com/845c15351b834e0ab8a77496085ec0d8"}