{"authors": ["Toyin Owoseje"], "date_download": "2020-05-04 16:24:43", "date_modify": "2020-05-04 16:24:43", "date_publish": "2020-04-06 13:49:55", "description": "Duffy has revealed details of the incident, in a bid, she said, to free herself of her emotional burden and help others who \"have suffered the same.\"", "filename": "2020_04_06_entertainment_duffy-rape-ordeal-intl-scli-gbr_index_1588609483.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200226121153-singer-duffy-thumbnail-lon-orig-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_entertainment_duffy-rape-ordeal-intl-scli-gbr_index_1588609483.html", "title": "Duffy says she was drugged, taken to another country and raped", "title_page": "Duffy says she was drugged, taken to another country and raped - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN) Duffy has revealed harrowing details of a four-week ordeal during which she says she was drugged at a restaurant on her birthday, taken to a foreign country and raped by an unnamed attacker.\nIn a post on her own website , the Welsh singer said she was making the details public in order to free herself of her emotional burden and help others who \"have suffered the same.\"\nThe \"Mercy\" singer, who first revealed her trauma in an Instagram post in February , started by warning readers that they might find her account upsetting and advised those unable to \"take on someone else's suffering\" not to read it.\n\"It was my birthday, I was drugged at a restaurant, I was drugged then for four weeks and travelled to a foreign country. I can't remember getting on the plane and came round in the back of a travelling vehicle,\" she wrote.\n\"I was put into a hotel room and the perpetrator returned and raped me. I remember the pain and trying to stay conscious in the room after it happened.\"\nDuffy said she escaped by \"fleeing\" but did not provide details of how she got away, adding she \"cannot remember getting home.\"\nThe singer's representatives declined to provide further clarification to CNN.\nDuffy went on to say that she does not know how she had \"the strength to endure those days\" and that the perpetrator made \"veiled confessions of wanting to kill me.\"\nShe said she decided to tell her \"dark story\" after growing tired of \"allowing the rape to become a companion.\"\n\"I no longer wanted to feel that intimacy with it, a decade of that intimacy has been destructive. I had to set myself free. I have been hurt and it would have been dangerous to talk from that hurt place in the past, prior to feeling ready,\" she explained.\nIn the post, to which she linked from her Instagram account, Duffy revealed that she had been warned that telling her story would mean the end of her music career.\n\"I have been very warned by some I know not to tell you what I am about to tell you. Some alluded that I would pretty much be finished in whatever chances I have to make music publicly again, some have said I would be scorned by the public, another said I would be called selfish that the rapist is still at large.\"\nBut the 35-year-old said: \"Deep down I do know it would have been a shame and done such an immense disservice to my existence to just delete myself and forget what I had experienced in music publicly.\"\nShe added that she eventually told a female police officer what happened, after someone threatened to go public with the story.\nHowever, she wrote, \"the identity of the rapist should be only handled by the police, and that is between me and them.\"\nDuffy said she has spent \"almost 10 years completely alone,\" but now feels she can \"leave this decade behind.\" She thanked her psychologist for helping her through the trauma.\nShe concluded the online outpouring by saying she hoped sharing her story \"brings me the smile in my eyes, the light in my life, that has been absent for just so long.\"\n\"I can now leave this decade behind. Where the past belongs. Hopefully no more 'what happened to Duffy questions', now you know ... and I am free.\"\nDuffy took home the best pop vocal award at the 2009 Grammys for her breakthrough album, \"Rockferry.\" Her second album, \"Endlessly,\" was released in 2010, before she retreated from the spotlight.", "url": "https://www.cnn.com/2020/04/06/entertainment/duffy-rape-ordeal-intl-scli-gbr/index.html"}