{"authors": ["Amanda Lee Myers"], "date_download": "2020-05-04 20:05:24", "date_modify": "2020-05-04 20:05:24", "date_publish": "2020-04-06 21:40:55", "description": "LOS ANGELES (AP) — After five years on TV, it seemed like “Schitt’s Creek” was just starting to hit its stride. The critically acclaimed comedy — about a shallow, filthy rich family who lose...", "filename": "_45a83f8b5acb816af83e430669d17ade_1588622724.html", "image_url": "https://storage.googleapis.com/afs-prod/media/07b6771e436549d3a69d3d382f063554/2624.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_45a83f8b5acb816af83e430669d17ade_1588622724.html", "title": "Beloved 'Schitt's Creek' ending at its peak", "title_page": "Beloved 'Schitt's Creek' ending at its peak", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This image released by Pop TV shows, from left, Annie Murphy, Eugene Levy, Catherine O'Hara and Dan Levy from the series \"Schitt's Creek.\" After six seasons, “Schitt’s Creek” is coming to a close. Its last episode airs Tuesday on Pop TV. (Pop TV via AP)\nThis image released by Pop TV shows, from left, Annie Murphy, Eugene Levy, Catherine O'Hara and Dan Levy from the series \"Schitt's Creek.\" After six seasons, “Schitt’s Creek” is coming to a close. Its last episode airs Tuesday on Pop TV. (Pop TV via AP)\nLOS ANGELES (AP) — After five years on TV, it seemed like “Schitt’s Creek” was just starting to hit its stride.\nThe critically acclaimed comedy — about a shallow, filthy rich family who lose their fortune and are forced to live in a small town they bought as a joke — debuted in Canada in 2015, and soon after on Pop TV in the United States.\nIts popularity exploded when it became widely available on Netflix in 2017, and it received its first Emmy nominations last year, including one for best comedy series. Now it’s firmly fixed in TV culture and its success is at its peak.\nYet co-creator Dan Levy decided it was time for it to come to an end, just as everything was truly coming up roses for “Schitt’s Creek.” The last episode of the show’s six seasons airs Tuesday night on Pop TV.\n“It was important for me that this show remains something that people cherish and that people go back to and revisit year after year or put on when they’re feeling blue,” Levy said. “And in order to do that, you really need to be aware of when is the right time to say goodbye.”\nIt might be the right time, but it was still an emotional roller-coaster for the “Schitt’s Creek” cast, which includes its other creator, veteran actor (and Dan Levy’s real-life father) Eugene Levy, and Catherine O’Hara, who was wearing her character Moira Rose’s heavy mascara and eyeliner during the show’s final table reads.\nShe said she cried so much “our makeup artist was calling me Alice Cooper.”\n“That last table read of the last two episodes was killer,” said O’Hara, whose character is an outrageously accented, wacky wig-wearing former soap star who can’t wait to ditch the town of Schitt’s Creek.\nEugene Levy, O’Hara’s longtime colleague in comedy, plays Moira’s dapper husband Johnny Rose, an optimistic entrepreneur who seems almost as mystified by his own family as he is by the townsfolk.\nHe said of his tenure on the show: “This has been six of the most incredible years of my life, and I’ve had a kind of a chunky career.”\nPart of what’s been so gratifying for the cast is how it’s connected so deeply with its audience.\n“I think when the show started out, it was kind of this quirky little Canadian thing,” said Annie Murphy, who plays Alexis, the Roses’ Paris Hilton-esque daughter. “And then as it gained momentum and we got added to Netflix it reached a much, much wider audience and the responses went from like, ‘Oh it’s the dad from ‘American Pie’ and the mom from ‘Home Alone’ and the creepy, creepy guy from ‘Scary Movie,’ to ‘Oh, my God, this show just got my mom through her chemotherapy treatments,’ or ‘This show allowed me to summon up the courage to come out to my family.’”\nDan Levy purposefully chose to avoid stereotypes and portray a small, rural town as comfortable with all sexuality (Levy’s character has had relationships with with both a woman and a man during the show, with not a single eyebrow raised).\n“To show bigotry and homophobia only emboldens people who have those beliefs,” he said. “It was an unintentional message. But I guess in removing the negativity from the town, the message was just that: Look at the world without hatred and see how much better it is. That was really the goal.”\nAs for the Roses, Dan Levy says the aim was to show “a family of people who used money to bandage problems” finally getting to know and appreciate one another. “The thesis of the whole show was, ‘Watch this family realize that money can’t buy love.’”\nAs O’Hara put it, “he wrote a world that he wants to live in.”\nThere’s been talk of a possible movie spin-off, in the vein of “Downton Abbey,” but Dan Levy says that’s premature.\nMurphy remains hopeful.\n“Oh God, I’ve been sending Dan edible arrangement baskets for years now to convince him,” she said, adding some advice for fans. “Join me in writing letters and sending gifts to him.”\nFor now, the show’s admirers will have to be OK with the series finale, which will be followed by an hour-long documentary showing behind-the-scenes footage of auditions, outtakes and the tearful last table reads.\nEmily Hampshire, who plays the sarcastic and plaid-cloaked Stevie Budd, joked that she “can’t wait ’til I can release that footage.”\n“We were all bawling ... It was tough because you’re also not only saying goodbye to each other, but these characters are saying goodbye,” she said. “It is an ending on both in real life and in the show.”\nIt won’t all be tears, she promised: “I think people are going to laugh and be very satisfied.”", "url": "https://apnews.com/45a83f8b5acb816af83e430669d17ade"}