{"authors": [], "date_download": "2020-05-04 16:54:03", "date_modify": "2020-05-04 16:54:03", "date_publish": "2020-03-10 17:36:18", "description": "If you check a bag on at least two Delta round-trips per year, the American Express Delta Gold credit card is worth the cost.", "filename": "2020_03_10_cnn-underscored_american-express-delta-gold-card_index_1588611243.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200210234048-underscored-delta-plane-with-logo-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_10_cnn-underscored_american-express-delta-gold-card_index_1588611243.html", "title": "Delta SkyMiles Gold Amex Review: Miles & Perks", "title_page": "Delta SkyMiles Gold Amex Review: Miles & Perks - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Story highlights The Delta SkyMiles® Gold American Express Card was recently revamped with a new list of perks and revised earning rates.\nThe card is a good choice for the occasional Delta flyer without elite status.\nOther perks include priority boarding, 20% savings on inflight purchases and no annual fee for the first year.\nCNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through The Points Guy affiliate network if you apply and are approved for a card, but our reporting is always independent and objective.\nOur quick take: If you check a bag on at least two round-trip flights with Delta each year, the Delta SkyMiles® Gold American Express Card will easily pay for itself. Plus, you'll earn a welcome bonus, gain priority boarding and have an opportunity to grab a $100 Delta flight credit.\nPros:\nEarn 2 miles for every dollar you spend at restaurants and U.S. supermarkets.\nFirst checked bag is free on Delta flights for you and up to eight companions.\nPriority boarding on Delta flights.\nGet a $100 Delta flight credit when you spend $10,000 on the card in a calendar year.\nAnnual fee is waived for the first year ($99 thereafter).\nCons:\nEveryday earning rate isn't as good as comparable cash back.\nDelta SkyMiles aren't as valuable as flexible travel points.\nDelta elites can't waive the airline's Medallion Qualification Dollars requirement with the card.\nNo complimentary lounge access.\nCurrent welcome bonus: Earn 35,000 bonus miles after you spend $1,000 in purchases on your new card in your first three months after opening the account.\nBest for: Casual Delta travelers who don't want to fuss with checked bag fees, or heavier travelers that only choose Delta on occasion.\nDigging into the Delta Gold card\nObviously most people aren't thinking about travel at the moment, but eventually planes will return to the skies. And when they do, if you plan on flying Delta even a few times a year, the Delta SkyMiles Gold credit card can easily pay for itself.\nThe card was recently revamped with a new list of perks and revised earning rates — overall, the changes are positive compared to the previous version of the card. There's also a welcome bonus on the card — new card members can earn 35,000 bonus miles after spending $1,000 in purchases in the first 3 months after opening the account.\nBased on the point valuations of CNN Underscored's partner The Points Guy, those miles are worth $420 in travel. And if you're able to plan a bit, you can cash in on Delta's frequent SkyMiles award sales to extract even more value from your miles (and even more free flights).\nThe Delta SkyMiles Gold card also earns 2 Delta SkyMiles for every dollar you spend at restaurants and U.S. supermarkets, and on eligible purchases made directly with Delta. It earns 1 mile per dollar on everything else.\nEarn 2 miles for every dollar you spend on eligible Delta purchases with the Delta Gold card.\nAside from granting a free checked bag for you and up to eight companions booked on the same reservation, the most eye-catching perk of the Delta Gold card is the opportunity to earn a $100 Delta flight credit after spending $10,000 on the card within a calendar year. Even if you can't currently fly Delta, this credit alone more than offsets the card's $99 annual fee, which itself doesn't even kick in until the second year you have the card.\nAdvantages of the Delta Gold card\nNothing squashes the buzz of an exciting trip quite like having to fork out $30 each way to check a bag. On a single round-trip, that's $60 per person. That means having the Delta SkyMiles Gold credit card saves you $120 on two round-trip a year or just one round-trip with a companion, which is already more than the card's annual fee.\nBetter still, the free checked bag perk isn't tied directly to the card. Instead, it's associated with your Delta SkyMiles number, which means that even flights booked with a different credit card are eligible. That's an important consideration if you hold a card like the Chase Sapphire Reserve, which earns 3 points per dollar on all travel purchases (including Delta airfare), compared to 2 miles per dollar on the Delta Gold card.\nRelated: Is the Chase Sapphire Reserve worth the increased annual fee?\nOther advantages of the Delta SkyMiles Gold card include a statement credit of 20% back on eligible Delta in-flight purchases such as food, beverages, audio headsets and more, Main Cabin 1 priority boarding, no foreign transaction fees and car rental loss and damage insurance.\nPlus, if you plan to spend $10,000 or more on the card in a calendar year, you'll have a $100 Delta flight credit to look forward to as well. While $10,000 may sound like a lot of money to spend on a credit card, it's actually only $833 a month.\nGet a $100 Delta flight credit each year with just $833 a month in spending on the Delta Gold card.\nWhat if you only fly a few times a year and you're concerned that you'll struggle to amass enough miles to cover an entire trip? For those folks, there's the Delta Gold card's Pay With Miles feature. This allows cardmembers to take $50 off the cost of your flight for every 5,000 miles you redeem when you book on delta.com.\nDisadvantages of the Delta Gold card\nDelta credit cards from American Express are focused on providing perks for Delta flyers. So if you don't find yourself on a Delta flight very often even when travel is normal, there aren't too many other strong points of the Delta SkyMiles Gold credit card that you can't find elsewhere.\nFor instance, while double miles on U.S. supermarkets and restaurants is appreciated, there are dozens of other credit cards that offer similar earning rates. CNN Underscored's benchmark credit card, the Citi® Double Cash Card, offers 2% cash back on everything you buy — 1% when you make a purchase, and another 1% when you pay it off — and charges no annual fee.\nRelated: Earn 2% cash back on everything with the no-annual-fee Citi Double Cash credit card.\nFurthermore, the miles earned with the Delta SkyMiles Gold card are Delta SkyMiles. For avid Delta flyers, this is fine, but people who aren't completely focused on Delta may prefer to earn either cash back — which gives you ultimate flexibility in spending your credit card rewards — or flexible points such as American Express Membership Rewards, Citi ThankYou Rewards, Chase Ultimate Rewards or Capital One miles, since all of these can be transferred to multiple different airline program and even hotels.\nAlso, while the Delta Gold card's Pay With Miles feature is useful for redeeming Delta SkyMiles without having to find award space, you'll only get 1 cent per mile in value when redeeming them this way. That negates the purpose of collecting frequent flyer miles over cash back — usually, you're trading off flexibility when you earn credit card rewards in miles instead of cash because you hope to get more value for your miles when you redeem them.\nFinally, if you normally fly Delta a lot, you'll likely find the Delta SkyMiles Gold card doesn't have all the perks an elite Delta flyer wants. Unlike more expensive Delta credit cards, you can't use large amounts of annual spending on the Delta Gold card to waive Delta's Medallion Qualification Dollars requirement for earning elite status. And there's no ability to enter Delta Sky Clubs with the Delta Gold card, even if you're willing to pay on a per-visit basis.\nStacking up the Delta Gold card against our benchmark\nCNN Underscored has chosen the Citi® Double Cash Card as our \"benchmark\" credit card. That doesn't mean it's the best credit card on the market — rather, it means we use it as a basic standard to compare other credit cards and see where they score better, and where they're worse.\nHere's how the Delta Gold card scores against our benchmark. The features of each card in the below chart are colored in green, red or white. Green indicates a card feature that is better than our benchmark. Red indicates the feature is worse than our benchmark, and white indicates the feature is either equivalent or cannot be directly compared to our benchmark.\nWhen reviewing other credit cards, we use this format and these criteria to compare them with our benchmark. You can read our credit card methodology for more details on what we take into account when it comes to perks, protections and redemption value.\nOther credit cards similar to the Delta Gold card\nGiven the deep integration with Delta and its SkyMiles program, the credit cards that are most similar to the Delta SkyMiles Gold credit card are, perhaps unsurprisingly, other Delta Amex cards.\nThe Delta SkyMiles® Platinum American Express Card — not to be confused with the standalone Platinum Card® from American Express — has a $250 annual fee which isn't waived in the first year, but it offers a more compelling list of perks, especially for regular Delta flyers.\nThe most notable benefit of the Delta Platinum card is an annual companion certificate starting after the first year you have the card — essentially, a buy-one-get-one-free domestic flight in coach on Delta. The card also offers a higher 3 miles per dollar on eligile purchases with Delta and purchases made directly with hotels, the ability to purchase Delta Sky Club access (at a cost of $39 per person per visit), and a Global Entry or TSA PreCheck application fee credit worth up to $100.\nBeyond the Delta credit card sphere, there's the Chase Sapphire Preferred Card. It too has a $95 annual fee (which isn't waived for the first year) but earns 2 points per dollar on all travel and dining — a much more inclusive earning rate — and 5 points per dollar on Lyft rides through March 2022.\nRelated: Get the classic Chase Sapphire Preferred travel credit card with a 60,000-point bonus.\nPlus, the Chase Sapphire Preferred earns points in the form of Ultimate Rewards, which can be redeemed directly for travel within the Chase travel portal at a rate of 1.25 cents per point (higher than Delta's Pay With Miles redemption rate), or transferred to a variety of airline and hotel partners for stronger redemptions. The CSP also carries better travel protections, including trip cancellation and interruption insurance, trip delay protection and primary car rental insurance (versus the Delta Gold's secondary coverage).\nShould you get the Delta Gold card?\nThe Delta SkyMiles Gold credit card.\nIf you almost never find yourself on a Delta plane even in the best of times, the Delta Gold card probably won't be a good fit. Unless you're flying Delta enough to justify the free checked bag, you're better off with the Chase Sapphire Preferred for earning travel rewards. For a slightly lower annual fee, you'll still earn double miles on restaurants and airfare (all airfare and travel, not just on Delta) and you'll have far more redemption options. Or if you prefer simplicity above all, our benchmark Citi Double Cash card probably makes more sense.\nOn the other hand, if you're normally a diehard Delta loyalist, chances are you'll reach Delta's lowest elite status tier, Silver Medallion, just by flying. In that case, you're better off casting your gaze on the Delta Platinum card. While it has a higher annual fee ($250), the card's annual companion certificate starting after the first year can easily offset it.\nBut if you're in the middle — an occasional Delta flyer without elite status who almost always checks a bag — the Delta SkyMiles Gold credit card could make sense, especially since you can try it out for the first year without an annual fee, so it won't cost you anything even while travel is restricted. Just make sure you're taking advantage of the card's perks enough after the first year when travel returns to normal to make the $99 annual fee worth it.\nLearn more about the Delta SkyMiles Gold American Express Card.\nFind out which cards CNN Underscored chose as our best travel credit cards of 2020.\nEditorial Disclaimer: Opinions expressed here are the author's alone, not those of any bank, credit card issuer, airlines or hotel chain, and have not been reviewed, approved or otherwise endorsed by any of these entities.\nNote: While the offers mentioned above are accurate at the time of publication, they're subject to change at any time and may have changed, or may no longer be available.", "url": "https://www.cnn.com/2020/03/10/cnn-underscored/american-express-delta-gold-card/index.html"}