{"authors": ["Leah Asmelash"], "date_download": "2020-05-04 17:00:59", "date_modify": "2020-05-04 17:00:59", "date_publish": "2020-04-10 00:27:58", "description": "Netflix is bringing back its widely talked about docuseries \"Tiger King\" for one more episode.", "filename": "2020_04_09_entertainment_tiger-king-and-i-joel-mchale-trnd_index_1588611659.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200329125429-tiker-king-joe-exotic-netflix-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_entertainment_tiger-king-and-i-joel-mchale-trnd_index_1588611659.html", "title": "Netflix is bringing 'Tiger King' back for one more episode", "title_page": "Netflix is bringing 'Tiger King' back for one more episode - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Netflix is bringing back its widely talked about docuseries \"Tiger King\" for one more episode.\nThe streaming giant announced Thursday that it would release an eighth episode of the show, titled \"The Tiger King and I,\" on April 12.\nThe episode is an aftershow hosted by comedian Joel McHale, who is featured in Netflix's announcement wearing themed attire (a cowboy hat and a a leopard print shawl).\nThe Tiger King and I — a Tiger King after show hosted by Joel McHale and featuring brand new interviews with John Reinke, Joshua Dial, John Finlay, Saff, Erik Cowie, Rick Kirkman, and Jeff and Lauren Lowe — will premiere April 12 pic.twitter.com/8fbbNdaiDA — Netflix (@netflix) April 9, 2020\nMcHale said he interviewed people from the show, including John Reinke, Joshua Dial, John Finlay, Saff, Erik Cowie, Rick Kirkman, and Jeff and Lauren Lowe.\n\"I talk to a lot of people involved in the project,\" McHale says in the video. \"To see what's happened in their lives since the release of the series. It's eye-opening and, hopefully, funny.\"\nRead More", "url": "https://www.cnn.com/2020/04/09/entertainment/tiger-king-and-i-joel-mchale-trnd/index.html"}