{"authors": [], "date_download": "2020-05-04 20:13:09", "date_modify": "2020-05-04 20:13:09", "date_publish": "2020-04-16 20:20:46", "description": "A University of Kansas law professor whose student was charged last year with making a false rape report has filed to run for the office of the prosecutor who eventually dropped the charge amid...", "filename": "_d15dbaa46e68c4d9c7eedc8269498043_1588623189.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d15dbaa46e68c4d9c7eedc8269498043_1588623189.html", "title": "Prosecutor who filed false rape case faces new challenger", "title_page": "Prosecutor who filed false rape case faces new challenger", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A University of Kansas law professor whose student was charged last year with making a false rape report has filed to run for the office of the prosecutor who eventually dropped the charge amid intense pressure.\nSuzanne Valdez said she believes Douglas County District Attorney, Charles Branson has been “asleep at the wheel,” The Kansas City Star reports .\nValdez, the former president of University Senate at KU and special prosecutor in Wyandotte County, said she hopes to address “systemic and cultural” issues, placing a focus on victim needs.\nShe told The Star last year that law enforcement in Lawrence failed to protect women.\nBranson hasn’t yet filed to run for reelection and said in an email that he isn’t ready to announce his plans. A defense attorney also announced his candidacy for Branson’s job last week.\n“I believe the criticism aimed at this office and those that work with me is misdirected, shortsighted and uninformed,” Branson said.\nHis office faced criticism last year after it filed, then dropped, false report cases against three women who had reported sexual assault and domestic violence. One of those women was Valdez’s student. Branson has since announced changes in policy and training on sexually violent crime in his office.", "url": "https://apnews.com/d15dbaa46e68c4d9c7eedc8269498043"}