{"authors": [], "date_download": "2020-05-04 16:00:00", "date_modify": "2020-05-04 16:00:00", "date_publish": "2020-04-01 13:00:29", "description": "Sony's introducing a duo of new headphones: the WF-XB700 true wireless earbuds and the WH-CH710N over-ear.", "filename": "2020_04_01_cnn-underscored__7bc3637b36353d5af63f649fff5e21f3_index_1588608000.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331175014-7-underscored-sony-wf-xb700-true-wireless-earbuds-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_cnn-underscored__7bc3637b36353d5af63f649fff5e21f3_index_1588608000.html", "title": "Sony's new true wireless earbuds and over-ear ANC headphones have us excited", "title_page": "New from Sony: Affordable WF-XB700 true wireless earbuds, intriguing WH-CH710N ANC headphones - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Sony's introducing a duo of new headphones: the WF-XB700 true wireless earbuds and the WH-CH710N over-ear.\nThese aren't new flagships replacing the WF-1000XM3 true wireless earbuds and the acclaimed WH-100XM3 over-ear headphones, and will, in fact, be a bit more affordable at $129.99 and $199.99 respectively. Both are up for preorder right now and will ship this month. Let's dive into what's new and what has us excited.\nWF-XB700 True Wireless Earbuds\nAt just shy of $130, the WF-XB700 are cheaper than Sony's best-in-class WF-1000XM3. But these don't pack in all the features. Notably, there's no active noise cancellation found on these. You might get a bit of passive noise cancellation, though, since these sit in-ear and likely make a solid seal. We're looking forward to testing these for sound quality and to see just how much noise makes it in.\nThe XB700s get Sony's Extra Bass technology, which is designed to boost bass and low tones. It should be a crisp and clean experience with those tones, and it should keep vocals just as clear and vibrant, adding up to a well-balanced experience. Powering the whole audio experience will be a 12mm Neodymium driver.\nUnlike AirPods or Powerbeats, these won't have fast pairing with iOS or macOS devices. With Bluetooth inside, this will be a standard pairing experience. Like all true wireless earbuds, these live in a case that doubles as a charger. You'll get 18 hours of battery life in total, according to Sony, with nine hours on the buds and nine from the case. Charging for 10 minutes should get you 60 minutes of playback as well.\nThese seem to have a pretty similar design to the WF-1000XM3, with the ear tips resting tightly in your ears and the buds sticking out a bit or resting flush with your ear. The buds use Sony's Tri-hold structure, which gives the earbuds three points of contact so they don't fall out. Additionally, the WF-XB700s have an IPX4 rating, which means they're good for splashes of water and sweat, so they should be a solid option for workouts.\nWH-CH710N Over-Ear ANC Headphones\nColor us intrigued, but the WH-CH710N has us quite excited. For $199.99, you're getting a pair of over-ear cans with active noise cancellation and up to 35 hours of battery life.\nThe cans have artificial intelligence noise cancellation, which will analyze the space you're in to select the proper level of noise cancellation. There are dual microphones on the WH-CH710N as well, which allow them to listen in front and behind you. For instance, on a plane seated near the engines, AINC might increase the level, but if you're using them at a library, it might lower the level. Pretty cool, and similar to what we saw on WH-100XM3 from Sony and 700s from Bose. There's also an ambient sound mode which will pump select environmental sounds in.\nOn the audio side, these should push out some terrific sound with 30mm drivers inside. It should be a well-balanced experience that doesn't shy away from impressive low and high tones. Since these are over-ear headphones, you'll be able to adjust them to your liking. After all, not all heads are the same size. There are metal sliders that will give you some room for adjustments. From the photos, the earcups look ample in size and should fit most ears.\nOn the battery side, you'll likely get up to 35 hours of playback, which is pretty impressive. There's a lithium-ion battery inside the WH-CH710N and it supports quick charging. Ten minutes of charging will get you an hour of playback. These charge with a USB Type-C port and cable as well.\nThe last feature that caught our attention is near-field communications. NFC is the same technology that powers Apple Pay and other contactless payment solutions. Sony is using it here for fast pairing and music playback with just a tap. You'll simply tap an NFC-enabled device to the WH-CH710N and it will establish a connection. This won't work on the iPhone since the NFC connection isn't always casting, but this should work on Android devices.\nLet's recap\nSony's new true wireless earbuds and over-ear AINC headphones are up for preorder Wednesday and will ship this month. The true wireless WF-XB700 are available in black or blue for $129.99. The over-ear WH-CH710N only come in black and cost $199.99. And if you want to go high-end, Sony's WH-100XM3 are available now for $349.99, along with the WF-1000XM3 for $229.99. We will start hands-on testing soon, so stay tuned for a full review on CNN Underscored.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/01/cnn-underscored/sony-wfxb700-earbuds-whch710n-anc-headphones-pricing-buy/index.html"}