{"authors": [], "date_download": "2020-05-04 20:06:55", "date_modify": "2020-05-04 20:06:55", "date_publish": "2020-04-08 19:55:40", "description": "PORTLAND, Ore. (AP) — Portland Public Schools will pay $410,000 to a former employee who said she was fired for raising red flags over a lack of safety for seventh-graders working with dangerous...", "filename": "_a7f4a8b2f2bd82a6e10181f51b62eb6d_1588622815.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a7f4a8b2f2bd82a6e10181f51b62eb6d_1588622815.html", "title": "School district pays $410K to employee who raised concerns", "title_page": "School district pays $410K to employee who raised concerns", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Ore. (AP) — Portland Public Schools will pay $410,000 to a former employee who said she was fired for raising red flags over a lack of safety for seventh-graders working with dangerous equipment including band saws and nail guns.\nThe Portland school board unanimously approved the settlement Tuesday, The Oregonian/OregonLive reported .\nOnly $60,000 of that settlement will be covered by the district’s insurance while the rest will come from the general fund, district spokeswoman Karen Werstein said.\nMarie Tyvoll sued the district for $930,000 in 2018, alleging she was fired for being a whistleblower.\nTyvoll was hired in 2016 and ran a program which allowed students to spend time at off-site career experiences including the ReBuilding Center,a local nonprofit.\nOver the next year, Tyvoll said she and Joe Crelier, the school district’s director of risk management, saw students at the ReBuilding Center wearing loose clothing around band saws and drill presses, putting their fingers too close to saw blades and a lack of ReBuilding Center supervision.\nTyvoll said she and Crelier intervened when they witnessed unsafe behavior.\nShe and Crelier submitted their concerns to various district officials. Tyvoll claimed officials told her to stop documenting those concerns.\nIn November 2017, she suggested Jackson Middle School Principal Kevin Crotchett might wish to choose an alternative job site, given her concerns. Crotchett agreed.\nThe next day, Tyvoll said, she was placed on administrative leave for insubordination.\nDistrict officials called her claims of unsafe woodshop practices unsubstantiated. She appealed the decision and was fired.\nThe district does not have a current contract with the ReBuilding Center.\n“While we are settling this case, we stand by denial of the allegations in the complaint and other court documents,” Werstein said.\nTyvoll’s settlement is among the largest the district has paid out in recent years.", "url": "https://apnews.com/a7f4a8b2f2bd82a6e10181f51b62eb6d"}