{"authors": ["Rob Picheta"], "date_download": "2020-05-04 16:15:41", "date_modify": "2020-05-04 16:15:41", "date_publish": "2020-04-03 16:07:44", "description": "A Venezuelan naval boat picked and lost a fight with a passenger cruise liner off the country's northern coast this week, ramming it several times before accidentally taking on water and sinking.", "filename": "2020_04_03_americas_venezue_f1921eae2b51e71eedd03a340a6d09fd_index_1588608941.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403113716-rcgs-resolute-columbia-cruise-services-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_americas_venezue_f1921eae2b51e71eedd03a340a6d09fd_index_1588608941.html", "title": "Venezuelan naval boat rams cruise liner, damages itself, sinks", "title_page": "Venezuelan naval boat rams cruise liner, damages itself, sinks - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A Venezuelan naval boat picked and lost a fight with a passenger cruise liner off the country's northern coast this week, ramming it several times before accidentally taking on water and sinking.\nThe proprietors of the German-owned RCGS Resolute cruise ship said its vessel had been receiving maintenance in international waters on Tuesday morning when the armed navy boat approached it and ordered it to change direction.\nThe encounter escalated when, according to the company, \"gun shots were fired and, shortly thereafter, the navy vessel approached the starboard side at speed with an angle of 135 degrees and purposely collided with the RCGS Resolute.\"\n\"The navy vessel continued to ram the starboard bow in an apparent attempt to turn the ship's head towards Venezuelan territorial waters,\" Columbia Cruise Services' statement read.\nHowever, the RCGS Resolute is reinforced with steel plating to help it navigate through ice.\nRead More", "url": "https://www.cnn.com/2020/04/03/americas/venezuela-navy-cruise-liner-incident-intl/index.html"}