{"authors": ["Tom Foreman Jr."], "date_download": "2020-05-04 20:27:51", "date_modify": "2020-05-04 20:27:51", "date_publish": "2020-04-15 18:04:18", "description": "CHARLOTTE, N.C. (AP) — Two lawsuits have been filed against the Catholic Diocese of Charlotte claiming two boys were sexually abused in separate instances by the two priests they sought out for...", "filename": "_6f3e94f49d2faa15d6d659d6695aea89_1588624071.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6f3e94f49d2faa15d6d659d6695aea89_1588624071.html", "title": "Charlotte diocese faces 2 suits over alleged priest abuse", "title_page": "Charlotte diocese faces 2 suits over alleged priest abuse", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHARLOTTE, N.C. (AP) — Two lawsuits have been filed against the Catholic Diocese of Charlotte claiming two boys were sexually abused in separate instances by the two priests they sought out for help with personal problems decades ago.\nOne of the lawsuits filed Monday in Mecklenburg County Superior Court involves an unidentified Georgia man who was 14 in the 1970s when he sought help from a priest, Joseph Kelleher, to deal with a family move. The lawsuit says the diocese should have known Kelleher, who died in 2014, should have been thoroughly investigated before being allowed to spend time with children.\nA second lawsuit was filed on behalf of a North Carolina man who alleges he was abused at age 14 by a different priest, Richard B. Farwell. That lawsuit said the diocese should have known Farwell should also have been investigated before being allowed near children.\nThe lawsuits, both signed by Charlotte attorney Sam McGee, each seek in excess of $25,000 in damages.\nThe Diocese of Charlotte said in a statement Tuesday that it disagrees that it is liable and will respond in court at the appropriate time to the lawsuits.\nAccording to the lawsuit involving the plaintiff from Georgia, the then-teen was having problems with a family move in 1977 and sought counseling from the diocese at his grandmother’s urging. The teen met with Kelleher at an Albemarle church and soon saw the priest as a grandfather figure, according to the suit.\nIn their second counseling session, the lawsuit states, Kelleher had the plaintiff lie down on the floor and imagine he was “floating in space.” According to the suit, the priest rubbed the plaintiff’s chest, legs and arms, and then pulled up his shirt to massage his chest before sexually assaulting the youth.\nThe plaintiff was assaulted over several months in 1977 and 1978, the lawsuit said. In 2010, the Georgia man came forward to allege he was abused by Kelleher, leading to a civil lawsuit against the Catholic Diocese. A judge in Mecklenburg County threw out two lawsuits against the diocese, ruling that the claims of child sex abuse against Kelleher and another priest missed the state’s deadline for filing such complaints, according to The Charlotte Observer.\nA North Carolina judge dismissed a child sex abuse charge against Kelleher in 2014, saying his dementia prevented him from going to trial. Kelleher died in a retirement community in the state at the age of 86.\nIn the other lawsuit, the plaintiff was described as having a strained relationship with his stepmother that led him to run away from home. The boy’s father encouraged him to seek out Farwell for counsel, that lawsuit said. Farwell began touching the boy inappropriately and used the contact to gain control over him, according to the suit.\nThe abuse increased after the boy sought out Farwell for help after he was assaulted by a truck driver when he ran away from home, according to the suit. It added the boy was ultimately placed in a children’s home and that his condition worsened and that he attempted suicide.\nThe diocese ultimately removed Farwell from ministry.\nIn 2002, a second man claimed Farwell had sexually abused him as a teenager in 1984 in Charlotte and Salisbury. The diocese reported the claims to police and in 2004, Farwell pleaded no contest to contributing to the delinquency of a minor and was sentenced to probation. A lay review board found the allegations credible in 2005.\nFarwell declined comment when reached by phone in Florida on Wednesday.", "url": "https://apnews.com/6f3e94f49d2faa15d6d659d6695aea89"}