{"authors": ["Jennifer Gray"], "date_download": "2020-05-04 17:02:22", "date_modify": "2020-05-04 17:02:22", "date_publish": "2020-04-10 08:01:28", "description": "A severe weather outbreak is possible this weekend across parts of the South.", "filename": "2020_04_10_weather_easter-weekend-tornado-storm-forecast_index_1588611742.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410083215-weather-severe-storms-easter-sunday-card-20200610-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_weather_easter-weekend-tornado-storm-forecast_index_1588611742.html", "title": "Tornadoes and damaging winds are likely Easter weekend", "title_page": "Easter weekend weather: tornadoes and damaging winds are likely - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A severe weather outbreak is possible this weekend across parts of the South.\nAccording to the Storm Prediction Center (SPC) , \"tornadoes (potentially strong/long-tracked) and widespread damaging winds are expected to be the primary hazards.\"\nThe threat stretches from Texas on Saturday to Georgia by Sunday night.\nThe Easter weekend will start relatively quiet Friday into Saturday morning.\nWe will start to see showers developing across the South during the day on Saturday, mainly across West Texas.\nThis region is currently drought-stricken, so the rain will be beneficial. The showers could be heavy at times, but shouldn't be many on the severe side.\nAs we get into Easter Sunday, things ramp up.\nAn outbreak of tornadoes appears likely on Sunday\n\"Easter Sunday could be a very dangerous day in the Southeast,\" CNN meteorologist Dave Hennen said. \"All of the ingredients for severe weather are likely coming together. You have strong low pressure, strong wind shear, ample Gulf of Mexico moisture, that could lead to multiple tornadoes across the Southeast.\"\nWhen these ingredients come together, the threat increases for a severe outbreak, with long-track, large tornadoes. The worst of the storms will occur from the afternoon through the overnight time frame.\nThe SPC, which is part of the National Weather Service, has issued a moderate risk -- level 4 of 5 -- for severe storms Sunday, from Louisiana to Alabama. It includes places like Jackson, Mississippi, Tuscaloosa and Birmingham in Alabama.\n\"It is very rare for the Storm Prediction Center to have this high a threat level three days in advance,\" Hennen says.\nThey have also deemed stretches from Texas to Georgia to have an enhanced risk -- level 3 of 5. Larger cities like Atlanta, New Orleans and in Tennessee, Memphis and Nashville, are all this enhanced risk area.\nAnd the slight risk -- level 2 of 5 -- stretches even farther from Texas to Virginia. This larger risk area includes Houston, Texas, and in North Carolina, Charlotte and Raleigh.\nThese risk areas together are home to over 55 million people who are at risk for dangerous severe weather Sunday.\nStorms will begin firing up in the Arklatex region (Arkansas, Louisiana and Texas) early Sunday afternoon, and travel east through the rest of the day.\nPlaces like Shreveport and New Orleans, in Louisiana, Jackson, Mississippi, Montgomery and Birmingham in Alabama and Atlanta, Georgia, need to be on the lookout for dangerous storms and possible tornadoes.\nIf you are in the target area for severe weather, make sure your family has a safety plan.\nRemember, in the event of a tornado, get to the lowest floor of your home. Then crouch in a small, interior room or closet away from windows.\nMake sure you have a way to get weather alerts on your phone or a weather radio that will alert you if a storm is coming.", "url": "https://www.cnn.com/2020/04/10/weather/easter-weekend-tornado-storm-forecast/index.html"}