{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:25:44", "date_modify": "2020-05-04 20:25:44", "date_publish": "2020-04-29 23:10:02", "description": "The former vice president has remained quiet following new Tara Reade revelations.", "filename": "entry_washington-post-editorial-board-biden-sexual-assault-allegation_n_5ea9f0c0c5b633a85444c64f_1588623944.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9fc0e300000301215526f.jpeg?cache=lllorvvivt&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_washington-post-editorial-board-biden-sexual-assault-allegation_n_5ea9f0c0c5b633a85444c64f_1588623944.html", "title": "Washington Post Editorial Board Calls On Joe Biden To Address Sexual Assault Allegation", "title_page": "Washington Post Editorial Board Calls On Joe Biden To Address Sexual Assault Allegation | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "“Tara Reade deserves to be heard, and voters deserve to hear her. They deserve to hear from Joe Biden, too,” The Washington Post’s editorial board wrote on Wednesday.\nReade has accused Biden of assaulting her when she worked as his aide in 1993. She said then-Sen. Biden shoved her against a wall and penetrated her with his fingers.\nSeveral people ― including her brother, a friend and a former co-worker ― have said Reade told them about the incident back in the ’90s. The accusation gained even more credibility when a recording surfaced last week of an unnamed woman calling in to a broadcast of CNN’s “Larry King Live” in 1993 and asking King what she should do for her daughter who had a problem with a “prominent senator.” Reade has identified the caller as her mother, who died in 2016.\n“My daughter has just left there, after working for a prominent senator, and could not get through with her problems at all, and the only thing she could have done was go to the press, and she chose not to do it out of respect for him,” the woman said in the call.\nThis week, Lynda LaCasse, Reade’s former neighbor, came forward to Business Insider to say that Reade discussed the incident with her in the mid-’90s as well.\nBiden’s campaign has said the incident never happened, and some people in his senatorial office at the time dispute Reade’s claim that she reported it.\nThe Washington Post said the presidential candidate himself should address the accusation.\n“Mr. Biden may have little to say besides what his campaign has already said — that he did not do this, and that this is not something he ever would do,” the editorial board wrote. “Yet the way to signal he takes Ms. Reade’s case seriously, and the cases of women like her seriously, is to go before the media and the public ready to listen and to reply.”\nRead the full editorial at The Washington Post.", "url": "https://www.huffpost.com/entry/washington-post-editorial-board-biden-sexual-assault-allegation_n_5ea9f0c0c5b633a85444c64f"}