{"authors": [], "date_download": "2020-05-04 20:03:55", "date_modify": "2020-05-04 20:03:55", "date_publish": "2020-04-08 16:49:15", "description": "IDAHO FALLS, Idaho (AP) — A woman was arrested on charges of kidnapping, robbery and aggravated battery after she and two others attacked another woman last month Idaho Falls police said. The...", "filename": "_0d3f6e830315c1ff8ab6a96dad551b12_1588622635.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0d3f6e830315c1ff8ab6a96dad551b12_1588622635.html", "title": "Suspect arrested in Idaho kidnapping, 2 others not found", "title_page": "Suspect arrested in Idaho kidnapping, 2 others not found", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "IDAHO FALLS, Idaho (AP) — A woman was arrested on charges of kidnapping, robbery and aggravated battery after she and two others attacked another woman last month Idaho Falls police said. The other suspects have not yet been found.\nMaddeline McKenzie Ovard was arrested Monday after the victim told police Ovard hit her with a socket wrench, punched her multiple times while wearing brass knuckles, then stole $400, her phone and her keys, the Post Register reported Tuesday.\nThe victim told police that she recognized two of the three masked women who attacked her March 24.\nA friend of the victim called authorities the following day after he allegedly received videos of her tied up with her face covered.\nThe victim was beaten for about two hours while held captive, then taken to two other locations before she was stripped of her clothing and left on a rock exposed with only a towel, a sweater and the blindfold for about four hours. She was found by Bingham County deputies.\nThe woman was taken to Bingham Memorial Hospital after suffering bruises and injuries, including a skull fracture, authorities said.\nOvard, 29, and the others seemed to believe she was in a relationship with Ovard’s ex-boyfriend, the victim said.\nOvard has not yet had a chance to enter a plea and her public defender could not be immediately reached for comment.\nHer bond was set at $75,000 and a no-contact order was issued. A preliminary hearing is scheduled for April 17 in the Bonneville County Courthouse.", "url": "https://apnews.com/0d3f6e830315c1ff8ab6a96dad551b12"}