{"authors": ["Brian Lowry"], "date_download": "2020-05-04 16:14:38", "date_modify": "2020-05-04 16:14:38", "date_publish": "2020-04-03 14:00:11", "description": "After 10 years and 240 episodes, \"Hawaii Five-O\" washes ashore for the last time on April 3, at a moment when escaping into the series -- whose predecessor embodied what came to be known as \"blue sky\" shows -- has perhaps never felt quite so welcome.", "filename": "2020_04_03_entertainment_hawaii-fiveo-series-finale_index_1588608878.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331120236-hawaii-five-o-finale-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_entertainment_hawaii-fiveo-series-finale_index_1588608878.html", "title": "'Hawaii Five-O' says 'Aloha' after 10 seasons with its series finale", "title_page": "'Hawaii Five-O' says 'Aloha' after 10 seasons with its series finale - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) After 10 years and 240 episodes, \"Hawaii Five-O\" washes ashore for the last time on April 3, at a moment when escaping into the series -- whose predecessor embodied what came to be known as \"blue sky\" shows -- has perhaps never felt quite so welcome.\nProducers of the CBS drama weren't certain that this would be the end until shortly before filming had begun, but executive producer Peter M. Lenkov said they had been approaching every season as if it might be their last for the last few years.\nAccording to Lenkov, the writing team wouldn't have done much differently if they had known farther in advance that the show would be officially concluding.\nThe long-running program had become expensive to produce, and star Alex O'Loughlin, who plays Five-O leader Steve McGarrett, had been discussing departing for some time. While there was the possibility that the series could have continued without him, the finale -- subtitled \"Aloha\" -- will bring an element of closure to McGarrett's story, while incorporating some familiar faces to pick up old threads.\n\"I was pretty sure that this would be his last year,\" Lenkov told CNN, noting that there were many factors that went into deciding to finish the series. \"It just felt like the right time,\" he said.\nRead More", "url": "https://www.cnn.com/2020/04/03/entertainment/hawaii-fiveo-series-finale/index.html"}