{"authors": [], "date_download": "2020-05-04 20:24:39", "date_modify": "2020-05-04 20:24:39", "date_publish": "2020-04-20 18:10:54", "description": "NEW YORK (AP) — Artist, adventurer and celebrated wildlife photographer Peter Beard was found dead in woods near his cliff-side home at the tip of Long Island nearly a month after his family...", "filename": "_17280b30b32d2101cf17609a1c9f38bc_1588623879.html", "image_url": "https://storage.googleapis.com/afs-prod/media/6997c0ea2c03457290079d65b9c34cb7/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_17280b30b32d2101cf17609a1c9f38bc_1588623879.html", "title": "Wildlife photographer Peter Beard found dead near his home", "title_page": "Wildlife photographer Peter Beard found dead near his home", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - This June 20, 2013 file photo shows, photographer Peter Beard, flanked by Zara Beard, left, and Nejma Khanum at a screening of \"Blackfish\" in New York. Beard has been found dead three weeks after being reported missing from his cliff-side home at the tip of Long Island. He was 82. His family posted a statement on Beard's website Sunday night saying “He died where he lived: in nature.” Beard was best known for his photos of African wildlife, taken in the decades when he lived and worked at his tent camp in Kenya. (Photo by Andy Kropa/Invision/AP, File)\nFILE - This June 20, 2013 file photo shows, photographer Peter Beard, flanked by Zara Beard, left, and Nejma Khanum at a screening of \"Blackfish\" in New York. Beard has been found dead three weeks after being reported missing from his cliff-side home at the tip of Long Island. He was 82. His family posted a statement on Beard's website Sunday night saying “He died where he lived: in nature.” Beard was best known for his photos of African wildlife, taken in the decades when he lived and worked at his tent camp in Kenya. (Photo by Andy Kropa/Invision/AP, File)\nNEW YORK (AP) — Artist, adventurer and celebrated wildlife photographer Peter Beard was found dead in woods near his cliff-side home at the tip of Long Island nearly a month after his family reported him missing. He was 82.\n“He died where he lived: in nature,” his family said in a statement posted on Beard’s website Sunday night.\nIn recent years, the once-swashbuckling explorer had developed dementia and had at least one stroke, according to the New York Times. His family confirmed that a body found Sunday in Camp Hero State Park in Montauk was Beard’s.\nThe Suffolk County Medical Examiner hasn’t made an official identification but East Hampton Police Capt. Christopher Anderson said Monday “we’re reasonably confident” it’s Beard. He said the cause of death hasn’t been determined but neither foul play nor suicide is suspected.\n“Peter defined what it means to be open: open to new ideas, new encounters, new people, new ways of living and being,” his family said in its statement. “Always insatiably curious, he pursued his passions without restraints and perceived reality through a unique lens.”\nBeard was renowned for his photos of African wildlife, taken in the decades when he lived and worked at his tent camp in Kenya. His best-known work was “The End of the Game,” published in 1965. It documented the beauty and romance of Africa and the tragedy of its endangered wildlife, especially the elephant.\nHe also photographed women in magazine fashion shoots and had well-documented romances with many of them, including Candice Bergen and Lee Radziwill, sister of Jacqueline Kennedy Onassis, according to the New York Times . He was married for a time to model Cheryl Tiegs and was friends with Andy Warhol, Truman Capote, Salvador Dali and the Rolling Stones.\nBeard was born into a wealthy family in Manhattan in 1938 and graduated in 1961 from Yale, where he studied with the artist Josef Albers and art historian Vincent Scully.\nFull Coverage: Entertainment\nAfter graduation, he traveled to Denmark and met and photographed Karen Blixen, who had written the memoir “Out of Africa” under the pen name Isak Dinesen. He later bought 45 acres abutting the African coffee farm where Blixen had lived.\nBeard is survived by his wife Nejma Beard, and daughter Zara.", "url": "https://apnews.com/17280b30b32d2101cf17609a1c9f38bc"}