{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:22:45", "date_modify": "2020-05-04 20:22:45", "date_publish": "2020-04-28 19:34:45", "description": "The actor, who shares two daughters with Kristen Bell, opened up about sobriety and addiction with Rob Lowe.", "filename": "entry_dax-shepard-psychedelic-mushrooms_n_5ea84522c5b644a83773a692_1588623765.html", "image_url": "https://img.huffingtonpost.com/asset/5ea876eb300000271115511c.jpeg?cache=vlfm8kmtwt&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_dax-shepard-psychedelic-mushrooms_n_5ea84522c5b644a83773a692_1588623765.html", "title": "Dax Shepard Wants His Daughters To Try Some Drugs, But Avoid Others", "title_page": "Dax Shepard Wants His Daughters To Try Some Drugs, But Avoid Others | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Rob Lowe joined Dax Shepard’s “Armchair Expert” podcast on Monday, and the two had an honest and open conversation on talking about drugs with their kids.\nLowe is nearly 30 years sober and has two sons in their twenties. He asked Shepard about his feelings on discussing drugs with his and Kristen Bell’s two daughters ― Delta Bell, 5, and Lincoln Shepard, 7.\n“I’m so glad you just said that because I was going to ask you the same thing,” Shepard, who is over 15 years sober, said. “I am pro my children doing mushrooms at some point.”\n“There’s a lot of different studies that have pretty conclusively shown that you have long-lasting creative advantages, right?” he added. “People who have done mushrooms have markedly more creativity that lasts. So, yeah, I guess I’m going to tell my girls to do shrooms and to smoke pot and to drink and just don’t do cocaine or opioids. If you don’t do those two things, you’ll likely be able to do all the others ones for the rest of your life. But if you get involved with those two, it’s probably going to end the party. Or at least it did for me.”\nLowe said he agreed, but pointed out that the “wildcard” is Adderall, a stimulant typically used to treat attention-deficit/hyperactivity disorder and narcolepsy.\nAmy Sussman via Getty Images Dax Shepard of \"Top Gear America\" speaks during the 2020 Winter TCA Press Tour on Jan. 16, 2020 in Pasadena, California.\n“What kids are doing ― they tell me that ’Why would we do coke when we can do Adderall?′ For my oldest son Matthew, it saved his life ― studying,” he said. “It’s a great thing, but it’s easily abused.”\nEarlier on in the conversation, the two spoke about addiction, and what drugs and technology they are grateful they missed out on.\n“I got lucky in that I got out of the game before coke was really cheap, before there was Viagra, before there was gnarly sleeping pills easily available, and before Facetime and all of that,” Lowe said.\n“Because that combination, would’ve killed me,” he added.\nShepard said that he was also grateful he missed Facetime, as there would have been “video record trail” of all of his “reptilian thoughts and actions.”\nShepard and Kristen Bell spoke with HuffPost last year about parenting while sober, and what it’s like when the two hang out with other couples or people who want to drink.\n“Dax has never been triggered by people drinking around him,” Bell said. “In fact, our friends are usually sensitive to it, and they look to me like, ‘Is it OK if I pour myself a drink?’ And Dax will notice and say, ’Oh no listen, I lost my privilege of drinking, but you didn’t lose your privilege. I think you should have a drink.’ So I’m very lucky there.” Head here to listen to more of Shepard’s interview with Lowe.\nNeed help with substance use disorder or mental health issues? In the U.S., call 800-662-HELP (4357) for the SAMHSA National Helpline.", "url": "https://www.huffpost.com/entry/dax-shepard-psychedelic-mushrooms_n_5ea84522c5b644a83773a692"}