{"authors": [], "date_download": "2020-05-04 16:54:46", "date_modify": "2020-05-04 16:54:46", "date_publish": "2020-03-18 22:00:42", "description": "The Delta Reserve card is ideal for devoted Delta flyers who want access to high-end Delta perks such as lounge access and upgrades.", "filename": "2020_03_18_cnn-underscored__b17ab270099d2a4e269bff06fe5ed419_index_1588611286.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200305212424-underscored-amex-centurion-lounge-las-dining-area-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_18_cnn-underscored__b17ab270099d2a4e269bff06fe5ed419_index_1588611286.html", "title": "Delta SkyMiles Reserve Amex Review: Miles & Perks", "title_page": "Delta SkyMiles Reserve Amex Review: Miles & Perks - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Story highlights The Delta SkyMiles® Reserve American Express Card offers extensive perks for elite Delta flyers\nCard members get access to Delta Sky Clubs and Amex Centurion Lounges when flying Delta.\nOther perks include a free checked bag, priority boarding and more.\nCNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through The Points Guy affiliate network if you apply and are approved for a card, but our reporting is always independent and objective.\nOur quick take: If you want access to Delta's global network of Sky Club airline lounges along with American Express Centurion lounges, the Delta SkyMiles® Reserve American Express Card is your ticket. Plus, you'll earn a welcome bonus, gain priority boarding and enjoy a slew of Delta-centric perks.\nPros:\nEarn 3 miles for every dollar you spend on eligible Delta purchases.\nComplimentary access to Delta Sky Club lounges.\nComplimentary access to Amex Centurion Lounges.\nAccess to complimentary upgrades on Delta flights.\nFirst checked bag is free on Delta flights for you and up to eight companions.\nUp to $100 fee credit for Global Entry or TSA PreCheck.\nAnnual companion certificate after your first cardmember anniversary.\nNo foreign transaction fees.\nTerms apply.\nCons:\nLofty $550 annual fee.\nNo opportunity for bonus categories beyond Delta purchases.\nNo cell phone insurance.\nDelta SkyMiles aren't the most valuable frequent flyer miles.\nCurrent welcome bonus: Earn 40,000 bonus miles and 10,000 Medallion Qualification Miles (MQMs) after you spend $3,000 in purchases on your new card in the first three months of account opening.\nBest for: Devoted Delta flyers who desire access to high-end Delta perks to make their travels calmer and more productive.\nDigging into the Delta Reserve card\nYou may not be thinking much about travel at the moment, and that's certainly understandable. But eventually flights will resume. And when that happens, the Delta SkyMiles Reserve credit card is in a class of its own when it comes to benefits that frequent Delta flyers will enjoy.\nThere's one primary reason you'd want to pay $550 annually to hold this card: airline lounge access. The Delta Reserve card grants complimentary access to Delta's global network of Sky Club lounges, as well as American Express' growing network of Centurion Lounges.\nGiven that an individual Sky Club membership costs $495 annually from Delta, you're essentially paying $55 more to also get Centurion Lounge access and all the other perks of the card, which include a free checked bag for you and up to eight companions booked on the same reservation, along with a host of other perks.\nIn other words, once travel resumes and Delta is fully flying again, if you're toying with the idea of ponying up for a Sky Club membership, holding the Delta Reserve card instead probably makes more sense.\nThe Delta SkyMiles Reserve card also earns 3 miles for every dollar you spend on eligible Delta purchases — these miles are Delta SkyMiles, deposited directly to your Delta frequent flyer account. It earns 1 mile per dollar on everything else.\nNew card members can also earn a welcome bonus of 40,000 bonus miles plus 10,000 Medallion Qualification Miles (MQMs) after spending $3,000 in purchases in the first three months after opening the account. Those miles are worth at least $400 in travel just by using them on Delta flights with Delta's Pay With Miles program. But if you're able to plan a bit, you can cash in on Delta's frequent SkyMiles award sales to extract even more value (and even more free flights).\nAdvantages of the Delta Reserve card\nUse the Delta Reserve credit card to gain entry to the new Centurion Lounge at LAX.\nAvid flyers understand how precious a lounge can be. Many have showers — a godsend between long flights or after a turbulent redeye — and the ability to grab a bite, freshen up or find a workspace during a layover becomes more important if you travel more frequently. Plus, lounge access makes life a little less hectic if you're stuck in an airport during bad weather that triggers delays and cancellations.\nBoth Delta and Amex are expanding their lounge networks globally while improving food options, seating and Wi-Fi speeds. Amex recently opened a new Centurion Lounge in Los Angeles, and three more lounges are expected in 2020 (though that schedule may change depending on worldwide events).\nRelated: Get a sneak peek at LAX's new Amex Centurion Lounge.\nDelta elite flyers who'd rather not fuss with worrying over earning Medallion Qualification Dollars (MQDs) for elite status will appreciate that the Delta SkyMiles Reserve card waives the MQDs requirement for Delta Platinum, Gold or Silver elite status if you make at least $25,000 in purchases on the card in that calendar year.\nThose same big spenders will also appreciate that every time you spend $30,000 in purchases on the card, you'll get 15,000 bonus MQMs, pushing you closer to the next Delta elite status tier. You can grab that big spending bonus up to four times per calendar year, and Delta has announced that MQMs earned in 2020 will roll over to 2021, so you won't lose out on your elite status progress even if you can't currently fly.\nOther advantages of the Delta Reserve card include 20% back on eligible Delta in-flight purchases (which include food, beverages, audio headsets and more), Main Cabin 1 priority boarding, no foreign transaction fees, trip delay/cancellation coverage, and car rental loss and damage insurance.\nBetter still, the free checked bag perk isn't tied directly to the card. Instead, it's associated with your Delta SkyMiles number, which means that even flights booked with a different credit card are eligible.\nFinally, if you haven't signed up for Global Entry yet, the Delta SkyMiles Reserve credit card will cover up to $100 of the fee. It'll also cover TSA PreCheck, but here's a tip: Sign up for Global Entry if you can, as that membership includes TSA PreCheck.\nRelated: 4 ways to get through the airport faster even if you can't get Global Entry.\nDisadvantages of the Delta Reserve card\nThe Delta Reserve card has great perks, but its earning rates aren't as competitive.\nThe biggest downside of the Delta SkyMiles Reserve is its limited earning rates. The card's only bonus category is 3x on eligible Delta purchases, while everything else earns just 1x. It's also worth noting that the 3x earning bonus only applies to purchases made directly with Delta. If you prefer to use an online travel agency like Expedia or Orbitz — or your company requires the use of a platform such as Concur — you won't earn that bonus when paying with the Delta Reserve card.\n(If this scenario describes your reality, consider the Chase Sapphire Preferred Card or the Chase Sapphire Reserve, which earn 2x or 3x points respectively on all travel regardless of who you book with.)\nRelated: Get the classic Chase Sapphire Preferred travel credit card with a 60,000-point bonus.\nDelta SkyMiles are also less flexible and valuable than points like Chase Ultimate Rewards, American Express Membership Rewards, Citi ThankYou Rewards or Capital One miles. While there are ways to transfer Delta SkyMiles into other programs, the transfer ratios are unattractive.\nUnfortunately, the annual domestic first class companion certificate that comes with the Delta Reserve card doesn't appear until the start of your second year of card membership. In other words, it's not until you pay your annual fee for the second time that you'll receive this perk. Also, \"domestic\" has a major caveat: The certificate only applies to flights in the lower 48, which excludes jaunts to Alaska and Hawaii.\nFinally, you'll need to be flying on a same-day Delta flight in order to access either Sky Clubs or Centurion Lounges with this card, and you can't bring guests in with you without paying a guest fee of $39 per person for Sky Clubs or $50 for Centurion Lounges.\nStacking up the Delta Reserve card against our benchmark\nCNN Underscored has chosen the Citi® Double Cash Card as our \"benchmark\" credit card. That doesn't mean it's the best credit card on the market — rather, it means we use it as a basic standard to compare other credit cards and see where they score better, and where they're worse.\nHere's how the Delta Reserve card scores against our benchmark. The features of each card in the below chart are colored in green, red or white. Green indicates a card feature that is better than our benchmark. Red indicates the feature is worse than our benchmark, and white indicates the feature is either equivalent or cannot be directly compared to our benchmark.\nWhen reviewing other credit cards, we use this format and these criteria to compare them with our benchmark. You can read our credit card methodology for more details on what we take into account when it comes to perks, protections and redemption value.\nOther credit cards similar to the Delta Reserve card\nFor those seriously considering the Delta SkyMiles Reserve, there's one other top-tier travel card to ponder: The Platinum Card® from American Express.\nNot to be confused with the Delta SkyMiles® Platinum American Express Card, the Amex Platinum also carries a $550 annual fee and grants complimentary individual access to Delta Sky Club and Centurion Lounges.\nBut for those who don't need the MQD waiver or the MQM boosts available on the Delta Reserve, the Amex Platinum arguably offers a more robust set of perks. This includes annual fee credits at retailers like Saks Fifth Avenue and Uber, complimentary elite status at major hotel and car rental brands, and a host of transfer partners that make earned points easier to exchange for free travel.\nRelated: Travel with luxury perks using the American Express Platinum card.\nPlus, if you have the Amex Platinum, you don't need to be flying on a Delta flight to access the Centurion Lounges as you do with the Delta Reserve card (though you do need to be on a same-day Delta flight to access Delta Sky Clubs with either card).\nShould you get the Delta Reserve card?\nThe Delta Reserve credit card from American Express.\nOnce the nation's skies return to normal, if you plan to fly on Delta on a regular basis — or through airports with Centurion Lounges — the Delta SkyMiles Reserve credit card will improve your quality of life at the airport. Lounge access is a luxury, sure, but for busy professionals, it's also a place where you can get work done while in transit, freeing up precious time at your destination.\nWe'll likely see higher welcome bonuses on this card again in the future, so you'll probably want to hold off applying for this card right now since you won't be able to use the perks at the moment. But if you're looking to increase your stash of Delta SkyMiles and MQMs at some point in preparation for the eventual resumption of flights, the Delta SkyMiles Reserve could be a card to consider.\nLearn more about the Delta SkyMiles Reserve American Express Card.\nFind out which cards CNN Underscored chose as our best credit cards of 2020.\nEditorial Disclaimer: Opinions expressed here are the author's alone, not those of any bank, credit card issuer, airlines or hotel chain, and have not been reviewed, approved or otherwise endorsed by any of these entities.\nNote: While the offers mentioned above are accurate at the time of publication, they're subject to change at any time and may have changed, or may no longer be available.", "url": "https://www.cnn.com/2020/03/18/cnn-underscored/american-express-delta-reserve-card/index.html"}