{"authors": ["Amanda Lee Myers"], "date_download": "2020-05-04 20:11:17", "date_modify": "2020-05-04 20:11:17", "date_publish": "2020-04-06 21:55:03", "description": "LOS ANGELES (AP) — In Moira Rose, Catherine O’Hara has created a character that will arguably go down as one of the best in TV history. Even though Moira lost her fortune and lives in a roadside...", "filename": "_78c4fcc88b9c53b53a79b2d778e4ff2d_1588623077.html", "image_url": "https://storage.googleapis.com/afs-prod/media/5d5c4f420c954b09833658a8d208297b/2243.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_78c4fcc88b9c53b53a79b2d778e4ff2d_1588623077.html", "title": "O'Hara says 'Schitt's Creek' went beyond her expectations", "title_page": "O'Hara says 'Schitt's Creek' went beyond her expectations", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - This Feb. 9, 2020 file photo shows actress Catherine O'Hara, star of “Schitt’s Creek,” at the Vanity Fair Oscar Party in Beverly Hills, Calif. After six seasons, “Schitt’s Creek” is coming to a close. Its last episode airs Tuesday on Pop TV. (Photo by Evan Agostini/Invision/AP, File)\nFILE - This Feb. 9, 2020 file photo shows actress Catherine O'Hara, star of “Schitt’s Creek,” at the Vanity Fair Oscar Party in Beverly Hills, Calif. After six seasons, “Schitt’s Creek” is coming to a close. Its last episode airs Tuesday on Pop TV. (Photo by Evan Agostini/Invision/AP, File)\nLOS ANGELES (AP) — In Moira Rose, Catherine O’Hara has created a character that will arguably go down as one of the best in TV history. Even though Moira lost her fortune and lives in a roadside motel in a town called Schitt’s Creek, the former soap opera star is always dressed to kill, complete with a different wig every day. She speaks unlike anyone else, using words like “frippet” and “unasinous” in a wild, unplaceable accent.\nWith “Schitt’s Creek” set to end Tuesday, O’Hara — nominated for an Emmy for her role in the show last year — talked with The Associated Press about how she fine-tuned Moira and what she got to keep from her killer closet. This interview has been edited for brevity and clarity.\nQ: How did you create Moira?\nA: I thought of women that were married to wealthy men who used to be actresses who sort of, oftentimes, want to remind everyone that they’re special, too. ... And I love the idea of somebody reinventing themselves. And I always thought of Moira as coming from a small town and getting out and then marrying and getting a career, marrying this rich, lovely man and then being thrown back into a town, so she’s more threatened than anyone else.\nQ: Where did Moira’s look come from?\nA: I went online looking for interesting women. And I found (socialite) Daphne Guinness, and my first lunch with Eugene and Daniel (Levy, the show’s creators) to talk about the character, our characters, I brought a ton of pictures of Daphne Guinness, and we all instantly agreed that that was a great direction to go in. ... And the wigs: I knew a woman who would have dinner parties at her house and she would keep disappearing and coming back with different wigs. And she would appear like, ‘Tada!’ Like really excited to show them off ... So whatever Moira was feeling on a particular day would dictate what kind of wig she would wear.\nQ: What about her insane accent?\nA: It’s part of Moira, you know, reminding people, especially in this town, that she is different, that she’s special, that she appreciates the beauty that the world has to offer that she isn’t living in right now. ... I had great dialogue written for me but it was really fun to be able to go through my arcane vocabulary books and Moira-ize my dialogue even more.\nQ: What has this show meant to you?\nA: It was really a great experience right from the beginning, and that’s all you can hope for. Really, beyond that, you don’t know who’s going to be interested in watching or how long you’re going to get to do this. So no matter what happened with the show, it was always going to be a lovely working experience, and then to have it have this positive fun-loving effect on these fun-loving people who watch the show as a bonus -- that I, for one, never expected or dreamed of. It’s gone way beyond anyone’s expectations ... and I’m really proud to be part of it.\nQ: Did you get to keep anything from Moira’s killer wardrobe?\nA: I’ve worn a little (Alexander) McQueen double-breasted shirt jacket several times now. I love that and my Givenchy 6-inch booties. They were by most favorite shoe to wear on the show if only because they were the most comfortable. But also they’re just really cool.", "url": "https://apnews.com/78c4fcc88b9c53b53a79b2d778e4ff2d"}