{"authors": [], "date_download": "2020-05-04 20:04:08", "date_modify": "2020-05-04 20:04:08", "date_publish": "2020-04-07 21:29:05", "description": "YAKIMA, Wash. (AP) — The Yakima Basin water reservoir is about 102% of normal for this time of year, meaning farmers and fish in Washington state are expected to receive a healthy supply of water...", "filename": "_819d95c6f70b9416951d9a1e3be0abb3_1588622648.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_819d95c6f70b9416951d9a1e3be0abb3_1588622648.html", "title": "Report: Healthy water supply available for irrigation season", "title_page": "Report: Healthy water supply available for irrigation season", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "YAKIMA, Wash. (AP) — The Yakima Basin water reservoir is about 102% of normal for this time of year, meaning farmers and fish in Washington state are expected to receive a healthy supply of water this year, a report said.\nThe Washington state Bureau of Reclamation released the April report showing that farmers with junior water rights are expected to receive a 96% supply, a 1% increase compared to March, the Yakima Herald-Republic reported .\nThe water supply for junior rights holders can be reduced during water shortages to ensure senior rights holders get their allotment amount, department officials said.\nThe increased water supply levels can be attributed to accumulation in earlier months.\n“Fortunately, we had three decent months prior to March, so we’re still riding on those,” said Chris Lynch, Reclamation’s river operations engineer.\nThe slight improvement reflects a dry March and a dry April, Lynch said, adding that the percentage didn’t drop like it has in previous years.\nDemocratic Gov. Jay Inslee declared a drought last year after April showed a 16% decrease for junior rights holders compared to their estimated 90% allocated in March, officials said.\nDepartment officials expect to release more water reports in the coming months scheduled for May 7, June 4 and July 9.", "url": "https://apnews.com/819d95c6f70b9416951d9a1e3be0abb3"}