{"authors": [], "date_download": "2020-05-04 16:16:37", "date_modify": "2020-05-04 16:16:37", "date_publish": "2020-04-03 18:35:42", "description": "From a Godiva bunny to a butterfly filled with M&Ms, we're here to make sure your Easter baskets are overflowing with cute, creative gifts.", "filename": "2020_04_03_cnn-underscored_easter-basket-ideas_index_1588608997.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402145239-easterlead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored_easter-basket-ideas_index_1588608997.html", "title": "25 adorable Easter gift ideas kids will love", "title_page": "Easter basket ideas: 25 adorable Easter gift ideas for kids  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Easter will be different this year. What with social distancing, canceled family gatherings and familiar routines suspended, we all just want something to feel normal for our kids.\nAnd that includes having an Easter full of sweet, creative gifts. This year, we've helped out the Easter Bunny by curating an irresistible collection of spot-on basket stuffers and gifts. Kids from tiny tots to teens will feel the love big-time this spring.\nAges 1-2\nBe Amazing Tee ($16.50; etsy.com)\nBe Amazing Tee\nIt's never too soon to inspire a child to be their best self. This 100% cotton jersey tee won't shrink. Each one is made by hand to order.\n_______________________________________________________________________________\nWavehello Lovebub ($29.99; amazon.com)\nWavehello Lovebub\nA sweet lamb made of marshmallow-soft minky fabric is the perfect Easter present for a toddler. But the Lovebub goes several steps further, adding soothing sounds and soft light effects for naptime. And the electronic component is easily taken out, allowing you to toss your tot's new best friend right in the wash.\n_______________________________________________________________________________\nPals Socks ($9.99; amazon.com)\nPals Socks\nWho knew socks could be fun? Stretchy and comfy, each pair of (intentionally) unmatched socks has grips on the bottom to help new walkers stay steady. They come in tons of designs, but we fell for cookies and milk, shown.\n_______________________________________________________________________________\nWeeFarers ($34.99; amazon.com)\nWeeFarers\nEven the littlest eyes need protection during the sun-filled days ahead. Aside from being too cute for words, these provide UVA and UVB protection. Plus, if they break or get lost within a year, you get a free replacement pair!\nAges 3-4\nGodiva 2020 Bunny ($29.95; bergdorfgoodman.com)\nGodiva 2020 Bunny\nEaster morning is hardly Easter morning without waking up to a plushy bunny smiling at you. This one comes with a cache of colorfully wrapped chocolate eggs. Drugstore Easter candy may have its place, but why not introduce your kid to the really good stuff early?\n_______________________________________________________________________________\nMiniland Emotiblocks ($20.95; target.com)\nMiniland Emotiblocks\nPreschoolers can create scores of characters expressing various emotions with this award-winning toy. Playing with the blocks builds visual and spatial-relation skills, but can also jump-start a conversation about feelings. That might be helpful this Easter, when even a 3-year-old might sense things aren't quite right, but doesn't understand why.\n_______________________________________________________________________________\nPiccolina Female Trailblazer Tee (starting at $22.40; amazon.com)\nPiccolina Female Trailblazer Tee\nYou go, girl! Roll up one of these vibrant tees and tuck it into the corner of her basket. Choose from a killer lineup of designs honoring female role models across different fields, from astronauts to Supreme Court icons.\n_______________________________________________________________________________\nPersonalized M&M's Gift Box (starting at $9.95; mms.com)\nPersonalized M&M Gift Box\nThe iconic chocolate candies that melt in your mouth, not in your hands are always a hit. But the M&M's in this basket-worthy butterfly are personalized with your kid's name, short message from you, or clip art. Also available in a flower design.\n_______________________________________________________________________________\nCustomized Story Book ($31.99, originally $39.99; shutterfly.com)\nCustomized Story Book\nYour child will get a thrill from a book starring... your child! Each story is personalized with a photo and name worked into the narrative. You'll have lots of tales to choose from, but My Cross Country Road Trip seems apropos, since none of us are going anywhere at the moment.\nAges 5-7\nEggsperiments ($19.95; kiwico.com)\nEggsperiments\nYou've been egged! Curious kids will have a ball concocting science experiments, with bubbly, sparkly, fizzy and bouncy results.\n_______________________________________________________________________________\nThe Hair Edit Ribbon Scrunchie ($7.99; ulta.com)\nThe Hair Edit Ribbon Scrunchie\nGirly girls will be tickled with this glam hair accessory. You can pull her hair up into a pony with a lush bow, without the hassle of actually trying to tie a bowl — and keep it tied.\n_______________________________________________________________________________\nCrayola Pet Paw Print Keepsake Kit ($8.99; crayola.com)\nCrayola Pet Paw Print Keepsake Kit\nKids this age likely love nothing more than their dog or kitty. This will be a super-fun activity to keep your child (and your pet!) entertained indoors. One more day of quarantine down!\n_______________________________________________________________________________\nHappy Easter Cake Pops ($32.99 for six; 1800baskets.com)\nHappy Easter Cake Pops\nWhat child doesn't like a good cake pop? But they can be tricky to make. These are almost too pretty to eat. But being they're filled with moist chocolate truffle cake, trust us, they will. They're just the right size and shape to fill in those little empty spots in baskets, for a perfect presentation.\n_______________________________________________________________________________\nFoodie Surprise Yolkies ($5.99; target.com)\nFoodie Surprise Yolkies\nThe \"unboxing\" trend is still going strong with this age group, and this collectible egg is a prime basket candidate. The yolk is gummy candy, and it contains a surprise Yolkie character. The egg itself can then be used to store all the figurines your kid gathers.\nAges 8-12\nColgate Magik Toothbrush ($17.99; amazon.com)\nColgate Magik Toothbrush\nYes, we are suggesting a toothbrush as an Easter gift that will tickle your kid. Hear us out. This first-of-its-kind brush connects to your smartphone, unleashing an augmented reality game that will have your kid running to brush their teeth. It's not only fun, it coaches good brushing habits.\n_______________________________________________________________________________\nSwimWays Toypedo Bandits Pool Toy ($7.04; amazon.com)\nSwimWays Toypedo Bandits Pool Toy\nWater toys are a blast, but they don't make much sense to buy for your kids at Christmas or fall/winter birthdays (if you can even find them). Picking one up as an Easter gift is a great idea. This inexpensive find glides up to 20 feet in and out of water, lending itself to games galore.\n_______________________________________________________________________________\nBrick Headz Easter Sheep ($19.99; lego.com)\nBrick Headz Easter Sheep\nLego bricks are awesome, but a regular set won't fit in an Easter basket. This holiday-themed kit will... and it's so darn cute. The lamb is painting two eggs, and has a tulip at his side.\n_______________________________________________________________________________\nYoobi Gel Pens ($14.99; target.com)\nYoobi Gel Pens\nEncourage your budding artist with this set of 24 rainbow gel pens. The sturdy case will keep them all organized. Your kid can even tote them to school (when it finally re-opens).\n_______________________________________________________________________________\nLittle Words Project Strength Bracelet ($25; nordstrom.com)\nLittle Words Project Strength Bracelet\nSparkly and stretchy, this bracelet will tell them what you would if you were with them. You've got this. Other inspirational words available, including \"Inspire,\" \"Fearless,\" \"Have Hope\" and \"Sparkle.\" Hey, that last one is important, too.\nAges 13-17\nChipolo One ($25; amazon.com)\nChipolo One\nNo more missing the bus while searching for a backpack: This tiny Bluetooth tracker easily attaches to one (as well as keys, a wallet, and more). Your teen will love the selfie mode. Click on the Chipolo, and a phone can take a selfie from a distance.\n_______________________________________________________________________________\n1Sock2Sock Donut Socks ($14.99; amazon.com)\n1Sock2Sock Donut Socks\nThese vibrant crew-length socks are made of soft, stretchy cotton. They'll add a bit of cheer to her lounging-around-the-house outfits — now her every-single-day outfits.\n_______________________________________________________________________________\nBeanBoozled Fiery Five Spinner Tin ($11.99; jellybelly.com)\nBeanBoozled Fiery Five Spinner Tin\nJelly beans are an old Easter standard, but can be a bit of a boring basket stuffer for a high-schooler. But this sweet treat/challenge game couldn't be further from basic. It's built around five hot pepper-flavor beans, ranging in heat from Sriracha up to Carolina Reaper. The candy is spiced up with real chili puree.\n_______________________________________________________________________________\nI Heart Revolution Bunny Stardust Palette ($8; revolutionbeauty.com)\nI Heart Revolution Bunny Stardust Palette\nEight mini eyeshadow pans (shaped like little eggs, no less) are hidden inside the shiny bunny. The earthy shades are split between matte and shimmer. Oh, and it's packaged in a little rabbit hutch.\n_______________________________________________________________________________\nRifle Paper Co. AirPods Pro Case ($25; riflepaperco.com)\nRifle Paper Co. AirPods Pro Case\nThis hard case adds fabulous flair to an otherwise bland-looking piece of tech. The chic golden carabiner attaches to her bag, key ring or belt loop for easy access.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/easter-basket-ideas/index.html"}