{"authors": ["Larry Lage"], "date_download": "2020-05-04 20:24:17", "date_modify": "2020-05-04 20:24:17", "date_publish": "2020-04-16 16:09:20", "description": "The Detroit Lions should have an opportunity to turn a weakness into a strength in the NFL draft. If Detroit chooses to keep the No. 3 pick overall, cornerback Jeff Okudah is expected to be...", "filename": "_6a3f0bcb2a015dafccdff6fa12c47f2a_1588623857.html", "image_url": "https://storage.googleapis.com/afs-prod/media/aff18c705ff8475288bae86513f62e2a/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6a3f0bcb2a015dafccdff6fa12c47f2a_1588623857.html", "title": "Lions might fill void with Ohio State CB Okudah in NFL draft", "title_page": "Lions might fill void with Ohio State CB Okudah in NFL draft", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Nov. 30, 2019, file photo, Ohio State cornerback Jeff Okudah get ready for a Michigan play during an NCAA college football game in Ann Arbor, Mich. If the Detroit Lions choose to keep the No. 3 pick overall in the draft, Okudah is expected to be available for the taking. The Ohio State star appears to be worth being the highest-drafted player at his position since one was selected from the same school two-plus decades ago. (AP Photo/Paul Sancya, File)\nFILE - In this Nov. 30, 2019, file photo, Ohio State cornerback Jeff Okudah get ready for a Michigan play during an NCAA college football game in Ann Arbor, Mich. If the Detroit Lions choose to keep the No. 3 pick overall in the draft, Okudah is expected to be available for the taking. The Ohio State star appears to be worth being the highest-drafted player at his position since one was selected from the same school two-plus decades ago. (AP Photo/Paul Sancya, File)\nThe Detroit Lions should have an opportunity to turn a weakness into a strength in the NFL draft.\nIf Detroit chooses to keep the No. 3 pick overall, cornerback Jeff Okudah is expected to be available. The Ohio State star appears worth being the highest-drafted player at his position since Shawn Springs was selected from the same school two-plus decades ago.\nThe Lions were last in the league against the pass last season. Their chances to give up more big plays through the air seemed to increase by trading three-time Pro Bowl cornerback Darius Slay to Philadelphia for draft picks.\nDetroit did attempt to fill the void at cornerback by signing Desmond Trufant, who turns 30 in September, after Atlanta released him last month. The team, coming off a three-win season, also improved depth at the position by adding Darryl Roberts and Tony McRae in free agency.\nAssuming Cincinnati drafts Joe Burrow and Washington selects Chase Young as expected, Okudah will be there for Detroit.\nWhile Alabama quarterback Tua Tagovailoa and Clemson linebacker Isaiah Simmons may end up being NFL stars, Okudah fills a bigger need.\nThe Lions’ leaders need production this year more than potential to help them keep their jobs in 2021.\nTeam owner Martha Firestone Ford decided late last season general manager Bob Quinn would be back for a fifth year and coach Matt Patricia would get a third year, but made it clear contending for the playoffs was an expectation.\nDetroit’s best shot to make the playoffs for the first time since 2016 is to keep Matthew Stafford healthy. The 32-year-old Stafford, who has three years left on his $135 million contract, missed the second half of last season with a back injury to trigger a nine-game losing streak, and showed how valuable he is to the franchise.\nIt is perhaps too risky for the Lions’ embattled general manager and coach to draft Tagovailoa, coming off hip surgery. And with solid linebackers in place, Simmons does not seem as as safe a pick as Okudah.\nQuinn, though, may decide he doesn’t want to make Okudah the first cornerback drafted No. 3 overall since Springs was in 1997 or to take Simmons. He will likely have a chance to trade down slightly to get additional draft picks.\n“We’re just trying to make our team better,” Quinn said. “Everything’s kind of on the table.”\nSAYING ABOUT SIMMONS\nQuinn sounds very interested in Simmons, adding NFL teams will have a lot of conversations internally about whether he projects to linebacker, a safety or a hybrid. The 6-foot-4, 238-pound Simmons played linebacker, covered the slot and the deep middle for the Tigers.\n“His ability just to make plays in both the run and pass game was really intriguing,” Quinn said.\nTHE CASE FOR TUA\nQuinn insists he will make decisions in the best interest of the Lions, even if a move for the long term doesn’t help his job security in 2020. Tagovailoa showed he’s capable of being a star when he was healthy for the Crimson Tide.\n“Athletic, explosive, dynamic playmaking ability,” Patricia said, sharing some of his scouting report on Tagovailoa.\nDAY 2 TARGETS\nThe Lions will have opportunities to add potential starters on the second night of the draft, holding the No. 35 pick along with early and late slots in the third round. They may want to bolster both lines with two of those three selections. A guard drafted on the second day could replace Graham Glasgow, who the Lions let leave in free agency, and he signed a $44 million, four-year deal with the Denver Broncos.\nFINDING A FLYER\nDetroit’s receiving corps is an asset with Kenny Golladay, Marvin Jones and Danny Amendola. However, each player is entering the last season of his deal. The receiving crop is the strongest in this draft.\nSLEW OF SELECTIONS\nDetroit enters the draft with nine picks, including an additional selection in both the third and fifth rounds from the Slay trade.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/6a3f0bcb2a015dafccdff6fa12c47f2a"}