{"authors": ["Ryot Studio Is Verizon Media'S Global Creative Studio."], "date_download": "2020-05-04 20:22:09", "date_modify": "2020-05-04 20:22:09", "date_publish": "2020-04-28 18:06:04", "description": "“It strengthens our workplace culture . . . and ultimately helps us meet global healthcare needs.”", "filename": "entry_medtronics-leadership-amidst-pandemic-proves-the-power-of-innovation-and-inclusion_n_5e99d19dc5b6ea335d5ac367_1588623729.html", "image_url": "https://img.huffingtonpost.com/asset/5ea0c067250000342a6b85c9.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_medtronics-leadership-amidst-pandemic-proves-the-power-of-innovation-and-inclusion_n_5e99d19dc5b6ea335d5ac367_1588623729.html", "title": "Medtronic’s Leadership Amidst Pandemic Proves The Power Of Innovation And Inclusion", "title_page": "Medtronic’s Leadership Amidst Pandemic Proves The Power Of Innovation And Inclusion | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "The worldwide pandemic has generated an overwhelming number of public health challenges, and Medtronic has stepped up as a leader among their healthcare industry peers. The biomedical giant has responded to the public health crisis by ramping up their production of ventilators and distributing them to the highest risk populations along their global supply chain at a fixed price. They’ve even publicly shared their portable ventilator design specifications with other manufacturers.\nMedtronic is already producing 400 ventilators per week, with a goal to reach 1,000-ventilators per week by the end of June. To date, the open-source version of the company’s PB 560 ventilator design has been downloaded more than 185,000 times. That’s a fast response time for a corporation with more than 90,000 employees.\nHow can such a large, established company mobilize to help people beyond the organization’s global supply chain, refocus priorities to support other companies’ crisis solutions, and create tangible change during a pandemic beyond the biomedical sphere?\nThe answer is simple: by nurturing a culture of innovation through D&I.\nAt the forefront of healthcare innovation\nAs the company’s chairman and CEO since 2011, Omar Ishrak has played a pivotal role in advancing Medtronic’s holistic approach towards D&I and equity.\nHaving lived, studied and worked all over the world, Ishrak has been positioned to understand the value of diversity and inclusion initiatives, particularly when it comes to analytical thinking. “Better decisions are made when there are more perspectives in the room,” Ishrak says. “In the end, the success of a business is based on judgment calls and decisions that are made throughout the organization every day, literally thousands of them. The collection of all of these judgment calls results in the performance of the business.”\nThat sentiment is shared across Medtronic’s leadership team. Before she was the vice president of research and development at one of the world’s leading global healthcare solutions companies, Carol Malnati was one of only five women in her graduating electrical engineering class. She’s no stranger to the struggles of gender diversity and inclusion and knows firsthand how much innovation women engineers can contribute to the development of healthcare technology solutions.\n“There are lots of data and research reports that say that diverse teams are more creative; they innovate and they out-perform competitors,” she says. “Research shows that diversity increases innovation by nearly 20 percent. It strengthens our workplace culture, distinguishes us from competitors, and ultimately helps us meet global healthcare needs. And simply put, innovation is the lifeblood of Medtronic.”\nIshrak and Malnati agree that diversity and inclusion contribute not only to Medtronic’s success, but to the success of the entire industry. As does Andrea Goldsmith who, with more than 20 years of experience in entrepreneurial, corporate and academic engineering spheres, deems Medtronic to have the most diverse board she has ever been a member of.\n“It’s really about excellence,” Goldsmith says. “It’s not about fairness. I truly believe, based on my experience, that having diverse perspectives makes a big difference in better engineering outcomes, in better designs and better formulation of problems. It means that we have to make a concerted effort to increase diversity of the profession and make sure that those diverse voices are included in order to get the benefits of these diverse perspectives in solving the grand challenges that engineering can help solve.”\nMedtronic’s leadership values diversity and inclusion as a necessary ingredient to the recipe for innovation, and their priorities reflect that.\nDiversity and inclusion in action\nStatistics have their place in diversity and inclusion. For instance, last year, Medtronic conducted a global pay equity analysis and was able to measure that they had achieved 100 percent gender pay equity in the United States and 99 percent global gender pay equity. However, metrics aren’t the only measure of impact: The experiences of individuals who benefit from corporate diversity and inclusion initiatives demonstrate the power and potential of this work as well. The support systems and resources currently available to Medtronic employees, for example, are already set up to help individuals and groups in times of crisis and uncertainty. Medtronic has established five Diversity Networks and more than a dozen Employee Research Groups (ERGs). The Women’s Network alone has over 15,000 members in over 68 countries worldwide and the ERGs support thousands of members across ethnic identities, disabilities, religious beliefs and more.\nThe ripple effects of this crisis will result in messy complications for many engineering professionals. From students stranded in the talent pipeline to individuals who need to take leaves of absence from their work, there are a great many problems that need solutions. But Medtronic programs like Careers 2.0 and ERGs like Women in Science and Engineering (WISE) provide the infrastructure needed to address challenges facing those talent pools.\nWISE is an initiative that aims to advance gender equality in the field through outreach, acquisition and professional development programs. The ERG’s programs and sponsorships are deliberately designed to support female engineers along the entirety of the long and complex STEM funnel. Careers 2.0 centers around professionals returning to work after a leave of absence, which is a subgroup of the workforce that faces unique challenges.\nBut these programs and resource groups weren’t established overnight. The principles behind Medtronic’s approach to diversity and inclusion helped Omar, and the entire company, transform intent to action.\nMedtronic’s diversity and inclusion “secret sauce”\nWeaving diversity and inclusion into the fabric of a company is easier said than done. Why has Medtronic been so successful with D&I efforts in ways other companies have not? There are three pieces to this puzzle.\nThe first piece is a firm commitment from leadership to close the diversity gap through accountability. Carol Malnati refers to this as Medtronic’s “top-down bottom-up” approach. “We need our top leaders to help us handcraft our initiatives and then really leverage the bottom-up power of the engineering teams and the power of the passion of the individuals that want to participate in this,” Malnati says.\nThe second piece of the puzzle is having an integrated and holistic approach to creating sustainable practices at all levels of the organization. Ishrak considers inclusion, sincerity and consistency to be the drivers of diversity. It’s not only an executive or human resources responsibility, according to Ishrak. “You need to listen to team members throughout the organization and then use that input to create mechanisms through which there’s true D&I engagement in your day-to-day work, in addition to specific forums and initiative projects,” he says. “If you remember the inclusion part of it, the rest of it will come.”\nThe last piece of the puzzle is setting goals and regularly measuring the progress you’ve made. “Defining metrics and collecting them is important,” Andrea Goldsmith says. “What are the metrics that we want to measure with respect to diversity and inclusion? Some of them are quantitative metrics. It’s not just about the percentages of women or minorities that we have, but how we measure their success and retention in the organization.” Medtronic publishes the goals and metrics related to their global D&I initiatives each year in a public report.\nBut metrics aside, “It really starts with the CEO making a commitment to diversity and inclusion throughout the organization,” she says. “Not just saying it’s important, but really coming up with actionable mechanisms to track progress, to hold people accountable, to infuse the entire organization with the sense that diversity and inclusion is critical to the success of the organization and to the leaders in the organization and to the groups in the organization.”\nWhen it comes to global healthcare needs, industry leaders who support the employees of their companies are able to also support the global community. As Goldsmith says, “You can really make a difference in people’s lives by being an engineer, by being at Medtronic.”\n__________________\nFrom PwC:\nPwC’s new series, Why I Act, produced in association with the CEO Action for Diversity and Inclusion™, follows CEOs as they meet their employees face-to-face to discuss the issues that matter. With more than 900 CEOs committed, CEO Action is the largest CEO-led business coalition focused on advancing diversity and inclusion in the U.S. To learn more, visit CEOAction.com.", "url": "https://www.huffpost.com/entry/medtronics-leadership-amidst-pandemic-proves-the-power-of-innovation-and-inclusion_n_5e99d19dc5b6ea335d5ac367"}