{"authors": [], "date_download": "2020-05-04 16:34:09", "date_modify": "2020-05-04 16:34:09", "date_publish": "2020-03-10 17:36:27", "description": "Whether you love or hate the AirPods or AirPods Pro, it's no secret that they're powerful little earbuds. In fact, our testing showed them to be some of the best true wireless earbuds on the market.", "filename": "2020_03_10_cnn-underscored_airpods-tips-tricks_index_1588610049.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191029174013-underscored-airpods-buying-guide-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_10_cnn-underscored_airpods-tips-tricks_index_1588610049.html", "title": "Get more out of AirPods and AirPods Pro with these handy tips", "title_page": "Get more out of AirPods and AirPods Pro with these handy tips - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Whether you love or hate the AirPods or AirPods Pro, it's no secret that they're powerful little earbuds. In fact, our testing showed them to be some of the best true wireless earbuds on the market.\nAirPods aren't just the best in name. Whether you're looking at sound quality or battery life, they are some of the best around. But part of Apple's appeal — let's call it magic — is that it works cohesively with iOS, macOS, watchOS and even tvOS. There are just so many ways these buds can interact with Apple technology.\nSo while you love your AirPods (or maybe begrudgingly use them while hating them), let's go through a few tips and tricks to make sure you're getting the most out of them.\nEasy pairing doesn't end after setup\nDid you know that opening the AirPods or AirPods Pro case next to your iPhone will show you the battery level of the right and left buds along with the case? It's an easy way to monitor battery life without digging through Notifications to find the right widget. Easy trick, but big reward.\nHook up to your Apple TV\nB&H Photo Video Apple Shopping Event\nLike we mentioned in our introduction, you can pair your AirPods with tvOS. That way, you won't distract anyone in the house, and they certainly won't distract you. To sync things up, go to Settings on your Apple TV, click Remotes and Devices and then Bluetooth. From there, select your AirPods or AirPods Pro.\nShare your tunes and audio\nIf you're running iOS 13 or later, you can stream music from your iPhone or iPad to two sets of AirPods. It's like the 2020 version of sharing earbuds. To get started, first connect your AirPods as you normally would and start listening to music. Next, pull down Control Center and press on the Now Playing Window. Then tap Share Audio and have your friend put their AirPods in pairing mode. You can easily enable this by flipping the case open. Soon you'll see their buds appear on the screen, prompting you to tap Share Audio to get started. It's that simple.\nCustomize what each tap does\nWhen your AirPods are connected to your iPhone, it's a good bet to check out Settings. Navigating to Bluetooth and then selecting your AirPods will give you a world of customizations, and you can set what each tap or click on a bud does. For instance, you can set it so the left side pauses or resumes and the right side activates Siri. Of course, AirPods Pro and second-generation AirPods support hands-free \"Hey Siri\" as well.\nCheck and respond to your messages\nSpeaking of Siri, iOS 13.2 and beyond brings the Announce Messages feature. With it, you can ask Siri to give you the heads up on any incoming messages while your AirPods are on. When you receive a message while your iPhone is locked and your AirPods are connected, you'll hear a chime followed by Siri reading your message. To enable Announce Messages, go to Settings, Siri & Search and then Announce Messages. It's pretty handy.\nHear who's calling\nIf you thought Siri was done, think again. When you have AirPods in, Siri can tell you who's calling you without having to even look at your iPhone. This is particularly useful for avoiding spam phone calls or, if you prefer, calls from your mother. To enable this feature, go to Settings, Phone and then Announce Calls. From there, tap Select Headphones and you'll be good to go.\nFind My app works for AirPods\nIf you're prone to losing your AirPods, you don't have to buy a new pair if they go missing. You can use the Find My iPhone app to locate them just as you would with a phone. From your iPhone, iPad or iPod Touch, open up the app and sign in with your Apple ID and password. Your AirPods should then show up on the list. Select them, and then you should be able to figure out their approximate location anytime you lose track of them. You can even do it on a MacBook — just sign into your iCloud, open Find iPhone, click All Devices and select your AirPods.\nFrom the map, they'll show up as a green dot if they have battery, or a gray dot if they're out of battery, powered off or out of range. When they're green, you can use the app to make them emit a sound, or even do so for each individual bud if both are lost.\nAirPods can be hearing aids on the spot\nIf you're hard of hearing, you'll definitely want to try this trick. Starting with iOS 12 and beyond, Apple has a feature called Live Listen, which lets you turn your AirPods into makeshift hearing aids. To activate it, go to Settings, Control Panel and then Customize Controls. Next to Hearing, tap the green plus and then tap back (at the top left) to save the setting.\nNow, open up Control Center, which you can do by swiping inward from the top right of your screen. One of the buttons should look like an ear. Tap that, and then select Live Listen. Finally, place your device near the sound source you want to hear. While your AirPods are in, your device will play the sound right into your ears — you can adjust the volume if it's too quiet.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/03/10/cnn-underscored/airpods-tips-tricks/index.html"}