{"authors": ["Leo Panitch", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Erik Bengtsson", "Michael A. Mccarthy", "Marcel Liebman", "Ralph Miliband", "Joseph M. Schwartz"], "date_download": "2020-05-04 19:54:04", "date_modify": "2020-05-04 19:54:04", "date_publish": "2020-01-15 00:00:00", "description": null, "filename": "2020_01_social-democracy-democratic-socialism-capital-unions-strategy_1588622044.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/01/15133600/sdlspd553a6-nh-1920x1210.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_01_social-democracy-democratic-socialism-capital-unions-strategy_1588622044.html", "title": "The Long Shot of Democratic Socialism Is Our Only Shot", "title_page": "The Long Shot of Democratic Socialism Is Our Only Shot", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "LP\nThe agreement they made with the small, centralized class of employers back in the early 1950s was the Rehn–Meidner model. Meidner was a socialist, by the way, but Rehn was not. The Rehn–Meidner model was that we will narrow the inequalities within the working class through a deal with capital.\nIn exchange for agreeing to wage restraint for the highest-paid workers in centralized collective bargaining arrangements, more poorly paid workers were allowed to get higher wages. But their higher wages would mean that less competitive businesses, those with lower profits, couldn’t afford higher wages and would go out of business. Those workers would lose their jobs by not accommodating their wages to those less competitive firms, and then big capital with the aid of the state would retrain those workers so that they could come to work in the larger, more centralized export-competitive industries. And that involved a change in regional inequalities as well.\nIt above all involved securing from capital the obligation that they would reinvest the profits that they were getting from highly paid workers who are restraining their wage demands. And they did, until about the late 1960s when these large Swedish corporations, Electrolux for instance, started using their profits to invest abroad, for example in the Italian electrical goods industry, as capital began to internationalize.\nSo insofar they increasingly weren’t only interested in exporting from Sweden, and more and more interested in internationalizing their capital accumulation, Meidner responded to that very early. I know this because I got know him rather well in the early 1990s, and he’s told me himself that he had realized by the late 1960s,”Look, we can’t hold on to the old deal that we struck, what we now need to begin to do is take capital away from capital.” And that’s how the famous Meidner Plan, the “wage-earner funds” proposal to acquire ownership shares in the largest companies, was spawned.\nTo Meidner’s credit, it wasn’t just formulated at the top. The plan was passed by the LO only after a long process of consultation with the union membership. He once showed me a sixteen-page, single-space response by a steelworker to a survey done as part of the consultations with the LO research department, which Meidner headed up, on what should this plan look like.\nAnd very interestingly when it was finally brought to the LO convention, it was proposed that the Meidner Plan would require of all firms with over one hundred employees to set aside a portion of their profits into a wage-earners fund that the unions would control, which would then be used to take over more and more shares of the large corporations. And there was a revolt from the floor whereby an amendment on that proposal that the wage-earners fund applied to all firms with twenty-five or more employees was passed. And when it was passed, delegates spontaneously started singing the “Internationale,” according to Meidner it was the first time in decades he had heard it sung at an LO convention. Yet Meidner took a view that this extension of the plan to smaller firms was a disastrous mistake because it allowed big capital to mobilize small capital behind it, in opposition to the plan.", "url": "https://www.jacobinmag.com/2020/01/social-democracy-democratic-socialism-capital-unions-strategy"}