{"authors": ["Jeffrey Knight Of Capital News Service"], "date_download": "2020-05-04 20:25:40", "date_modify": "2020-05-04 20:25:40", "date_publish": "2020-04-16 19:40:50", "description": "RICHMOND, Va. (AP) — Gov. Ralph Northam recently signed a bill that would define hemp extract, such as CBD, as food and usher in state regulations on these products. Senate Bill 918,...", "filename": "_6c633f15d7723152e2547473187c24de_1588623940.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6c633f15d7723152e2547473187c24de_1588623940.html", "title": "Northam signs bill to regulate CBD products as food", "title_page": "Northam signs bill to regulate CBD products as food", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "RICHMOND, Va. (AP) — Gov. Ralph Northam recently signed a bill that would define hemp extract, such as CBD, as food and usher in state regulations on these products.\nSenate Bill 918, patroned by Sen. David Marsden, D-Fairfax, will help guide the budding industrial hemp industry in Virginia by regulating facility conditions and requirements for the production of hemp-derived products intended for human consumption.\nThis bill also allows the Virginia Department of Agriculture and Consumer Services to regulate and enforce certain standards for hemp extract, including labeling requirements, identifying contaminants and batch testing.\nCharlotte Wright, a hemp farmer based in Brunswick County and owner of the CBD business Hemp Queenz, said she feels encouraged by Marsden’s bill.\n“It gives validity to the CBD industry,” Wright said. “Right now, there is no testing required, no labeling, you have no idea what is in it. It’s like the Wild West.”\nHowever, Wright is worried about the federal law and said keeping to that level of THC makes it difficult to produce competitive CBD products.\nHemp plants can not exceed THC levels of 0.3% or they must be destroyed, which complies with federal standards. THC is the intoxicating component in marijuana. CBD, also found in marijuana and hemp plants, does not cause a high and is used for a wide variety of treatments from anxiety to pain relief, according to a report from the World Health Organization.\nThe hemp plant produces significantly low THC levels and high CBD levels, according to the WHO report. Hemp, a relative of the marijuana plant, is used for a variety of things from making fibers to beauty products. CBD also has various applications; it can be used for edibles, oils and oral supplements.\n“If we go over the limit, we have wasted all of our time and money,” Wright said. “It is ridiculous to argue over seven-tenths of a percent when any hemp farmer can easily grow a crop that is under 1% total THC. You can’t easily grow a crop that is under 0.3%.”\nWright said the longer the hemp plant grows, the more CBD and THC it produces. A higher CBD percentage will make the product more valuable.\n“To get those relevant CBD percentages up over 13% or 14%, you have to leave it in longer, the longer you leave the plant in the ground, that THC number creeps up,” Wright said. “After all is said and done, that seven-tenths of a percent isn’t going to impair anyone anyway.”\nSince the passage of the 2018 Farm Bill, hemp has been removed from the definition of marijuana and taken out of the Controlled Substances Act. Hemp can currently be grown, processed and distributed by licensed individuals in most states.\nHowever, under the federal Food, Drug and Cosmetic Act, it is illegal to add CBD or hemp products to food or market them as a dietary supplement.\nCurrently, the only pharmaceutical drug containing CBD that has been approved by the FDA is Epidiolex, which treats two rare, severe forms of epilepsy in young children. There are no over-the-counter CBD products that are approved by the FDA.\n“If the FDA does not start approving CBD products people are going to take them without regulation,” said Kyle Shreve, executive director of the Virginia Agribusiness Council. “That’s what the bill says, we are going to treat them like they are approved by the FDA so we can start regulating them.”\nShreve said it’s important to add another viable cash crop for agribusiness in the state.\n“Right now we are losing tobacco and dairy farms in the commonwealth, so it is another opportunity for Virginia producers to diversify and grow something that would help sustain their business,” Shreve said.\nDuring the 2019 growing season, approximately 1,200 registered industrial hemp growers planted around 2,200 acres of hemp in Virginia, according to Erin Williams, VDACS senior policy analyst. As of April 10, there were 1,280 active industrial hemp grower registrations, 357 processor and 219 dealer registrations.\n“I think it has a strong future,” Marsden said about the hemp industry in Virginia. “We just need to regulate it and hold other states to our standards.”\nMarsden said over-the-counter CBD products like those sold at gas stations or convenience stores might not have CBD in them at all and could contain harmful ingredients.\n“We can’t have inferior products coming in from other states,” Marsden said. “We are going to try to do a good job with this stuff and it is up to VDACS to make sure other states don’t ruin our market with crap.”\nThree bills were signed by the governor recently regulating industrial hemp in Virginia. One of those bills, House Bill 962, introduced by Del. Daniel Marshall III, R-Danville, regulates smokable hemp products for those over 21 and allows the sale of these products in vending machines.\nThe governor also approved SB 1015 which protects certain people involved with the state’s medical cannabis program expected to begin this year. SB 2 and HB 972 decriminalize possession of certain amounts of marijuana and allows for the expungement of a prior misdemeanor offense. Northam recommended changes to the decriminalization bill that would still need to be approved when lawmakers reconvene on April 22. One recommendation is to move the deadline for a legislation study back to 2021 and another proposes that a marijuana violation occurring during the operation of a commercial vehicle would be included on the driver’s Department of Motor Vehicles record.", "url": "https://apnews.com/6c633f15d7723152e2547473187c24de"}