{"authors": ["Judson Jones", "Cnn Meteorologist"], "date_download": "2020-05-04 16:22:55", "date_modify": "2020-05-04 16:22:55", "date_publish": "2020-04-06 15:19:06", "description": "A powerful winter-like storm began striking Southern California on Monday. The late-season storm is expected to bring a foot to 2 feet of snow to mountain peaks and flooding rains to lower elevations.", "filename": "2020_04_06_weather_california-snow-flooding-storm_index_1588609375.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406102550-weather-california-storm-satellite-20200406-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_weather_california-snow-flooding-storm_index_1588609375.html", "title": "A slow-moving storm will dump feet of snow and flooding rain across California Monday", "title_page": "California weather: A slow-moving storm will dump feet of snow and flooding rain on Monday - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "The late-season storm is expected to bring a foot to 2 feet of snow to mountain peaks and flooding rains to lower elevations.\n\"A slow-moving storm will hug the California coast over the next couple of days as it drifts slowly south,\" CNN meteorologist Dave Hennen said.\nA flood advisory covers over 11 million people in Southern California, including Los Angeles, where rain could bring mudslides and debris flows over recent fire burn areas.\nA cold front is slowly pushing toward the region, drawing moisture in from the Pacific Ocean. This is leading to enhanced moisture in the area.\nFlooding rains across Southern California\nThe heaviest rain fell in Ventura and Santa Barbara counties before dawn Monday.\nSome of the south-facing slopes have collected 2 to 5.5 inches so far, says the National Weather Service in Los Angeles.\nBetween 1 to 2 inches of rain is forecast along the coast and valleys Monday, with up to 5 inches of rain forecast for the foothills.\nModerate to heavy rain impacting #LosAngeles County right now. RSeveral areas seeing 0.50 to 0.75 inches per hour, which can crate roadway and small creek flooding. Be prepared for sudden slow downs on the roads. #CAwx #larain pic.twitter.com/6KJxmVvDoP — NWS Los Angeles (@NWSLosAngeles) April 6, 2020\nThe weather service expected the most torrential rain in Los Angles to begin just before sunrise Monday.\nThe most significant amounts of precipitation will fall Monday but showers will linger through Thursday.\nThere is also a Winter Storm Warning in effect for the mountains in Ventura and Los Angeles counties.\nIn the higher elevations, the bulk of the snow will fall Monday.\nSnow accumulations of 15 to 30 inches or more are possible above 6,000 feet, and about 4 to 12 inches between 4,500 and 6,000 feet, forecast the weather service in Los Angeles.\nSnow could accumulate at an elevation as low as the town of Grapevine, the weather service said.\nCooler temperatures will arrive the next few days.\n\"Much of California, Nevada and Arizona will be 10 to 20 degrees below average over the next 3 days,\" CNN meteorologist Monica Garrett said.\nFeet of snow expected in the Sierra\nFarther north in the Sierra, 3 to 4 feet of total snow accumulation is likely above 7,000 feet, while a total of 2 to 3 feet of snow expected from 5,000 to 7,000 feet.\nAvalanche danger has been high in the region since Sunday. A Backcountry Avalanche Warning was issued for the Greater Tahoe Area Sunday into Monday.\nTravel will be treacherous through the mountains. In addition to snow, crosswinds will be strong. Wind gusts up to 45 to 55 mph are expected in the mountains Monday.\nCloser to the center of the storm, there is an increased risk of sneaker waves and strong rip currents.\nSneaker waves can knock unsuspecting beach goers over and into the sea. Rip currents can pull swimmers and surfers out to sea, the National Weather Service in San Francisco said.\nThis beach hazard stretches from Sonoma County to Monterey County Tuesday through Wednesday.", "url": "https://www.cnn.com/2020/04/06/weather/california-snow-flooding-storm/index.html"}