{"authors": ["Trends Reporter"], "date_download": "2020-05-04 21:09:44", "date_modify": "2020-05-04 21:09:44", "date_publish": "2020-05-01 03:01:20", "description": "\"This is Wyatt Cooper. He is 3 days old. He is named after my dad, who died when I was 10,\" the CNN anchor said.", "filename": "entry_anderson-cooper-baby-boy_n_5eab84cbc5b65156135b0b3b_1588626584.html", "image_url": "https://img.huffingtonpost.com/asset/5eab8d0d24000099028ea0e6.png?cache=8ha1s06zgo&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_anderson-cooper-baby-boy_n_5eab84cbc5b65156135b0b3b_1588626584.html", "title": "Anderson Cooper Announces Birth Of Baby Boy On Air: 'I Am Beyond Happy'", "title_page": "Anderson Cooper Announces Birth Of Baby Boy On Air: 'I Am Beyond Happy' | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Anderson Cooper is officially dad to a brand new baby boy.\nThe CNN anchor announced the big news on-air Thursday, sharing images of his son, Wyatt Morgan Cooper, who was born Monday.\n“It has been a difficult time in all of our lives, and there are certainly many hard days ahead,” Cooper began. “It is, I think, especially important in these times of trouble to try to hold on to moments of joy and moments of happiness. Even as we mourn the loss of loved ones, we are also blessed with new life and new love.”\nWith that, he shared his big news: “On Monday, I became a father,” he said. “I’ve never actually said that before, out loud, and it still kind of astonishes me. I am a dad. I have a son. And I want you to meet him.”\n“He is sweet and soft and healthy, and I am beyond happy.”\nWelcome Wyatt Morgan Cooper! @AndersonCooper's son was born on Monday. New life, new love. pic.twitter.com/L3Af2TtYAq — Brian Stelter (@brianstelter) May 1, 2020\nWyatt was named after Cooper’s father, who died when he was 10 years old. His son’s middle name, Morgan, is a family name from his mother Gloria Vanderbilt, who died last year.\nCooper added: “As a gay kid, I never thought it would be possible to have a child, and I’m grateful for all those who have paved the way, and for the doctors and nurses and everyone involved in my son’s birth.”\nExplaining that the baby was carried by a surrogate, who “carried Wyatt and watched over him lovingly and tenderly and gave birth to him,” Cooper said he was “eternally grateful” that she was able to bring his son into his life.\n“My surrogate has a beautiful family of her own, a wonderfully supportive husband and kids, and I am incredibly thankful for all the support they have given Wyatt and me,” he said.\nCooper also shared his happy news on Instagram, along with some more photos of his bundle of joy.\nThe CNN anchor had not spoken publicly about his plans to become a father, and social media was quickly flooded with congratulations after his joyful on-air announcement.", "url": "https://www.huffpost.com/entry/anderson-cooper-baby-boy_n_5eab84cbc5b65156135b0b3b"}