{"authors": [], "date_download": "2020-05-04 16:09:10", "date_modify": "2020-05-04 16:09:10", "date_publish": "2020-04-02 18:27:49", "description": "Rifle Paper Co., one of the most beloved stationery, art and decor brands, is hosting its annual BOGO Art Prints Sale, so you can pick up two whimsical prints for the price of one through April 3.", "filename": "2020_04_02_cnn-underscored__088bb09d6bfdf5742d83b6c189e3e8c5_index_1588608550.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402141548-rifle-paper-co-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_cnn-underscored__088bb09d6bfdf5742d83b6c189e3e8c5_index_1588608550.html", "title": "Rifle Paper Co. sale: Shop BOGO art prints", "title_page": "Rifle Paper Co. sale: Shop BOGO art prints - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Hanging art on your walls is an easy way to upgrade your space, and this is the perfect time to add a few new prints to your gallery wall-in-progress. Rifle Paper Co., one of the most beloved stationery, art and decor brands, is hosting its annual BOGO Art Prints Sale, so you can pick up two whimsical prints for the price of one through April 3.\nEvery art print is based on illustrations hand-painted by Rifle Paper Co. co-founder and chief creative officer Anna Bond. Choose from bright florals, uplifting quotes, travel destinations, adorable animals and much more, all created in Rifle Paper Co.'s distinctive style.\nPrints start at just $24, and you can choose your preferred size. There's also the option to add a frame in one of five finishes for $65 and up. (Framed prints will ship in two to three weeks.) The two-for-one discount will be applied at checkout.\nTake a look below for the prints we find most delightful.\nJuliet Rose Art Print (starting at $24; riflepaperco.com)\nJuliet Rose Art Print\nRifle Paper Co. is perhaps best known for its colorful florals. Add a bouquet to your wall for less now.\n__________________________________________________________________________________________________\nSwan Art Print (starting at $24; riflepaperco.com)\nSwan Art Print\nThese swans placidly floating on a flower-bedecked lake make a soothing image to hang up in these uncertain times.\n__________________________________________________________________________________________________\nLemons to Lemonade Art Print (starting at $24; riflepaperco.com)\nLemons to Lemonade Art Print\nThis bright, fruit-filled print is a literal take on the phrase, \"When life gives you lemons, make lemonade.\"\n__________________________________________________________________________________________________\nYou're the Bee's Knees Art Print (starting at $24; riflepaperco.com)\nYou're the Bee's Knees Art Print\nGift this print, featuring metallic gold ink, to a friend or loved one to let her know she's your queen bee.\n__________________________________________________________________________________________________\nHairbrush Art Print (starting at $24; riflepaperco.com)\nHairbrush Art Print\nArt is for every part of your home! This hairbrush illustration would look fantastic in the bathroom.\n__________________________________________________________________________________________________\nMarie Antoinette Art Print (starting at $24; riflepaperco.com)\nMarie Antoinette Art Print\nHistory buffs will lose their heads over this Marie Antoinette portrait.\n__________________________________________________________________________________________________\nBon Voyage NYC Art Print (starting at $24; riflepaperco.com)\nBon Voyage NYC Art Print\nGet some travel inspiration for when the pandemic passes, with prints that feature highlights from a favorite destination. Choose from cities around the world, including the Big Apple.\n__________________________________________________________________________________________________\nDog Days of Summer Art Print (starting at $24; riflepaperco.com)\nDog Days of Summer Art Print\nYou don't have to own a dog to display 20 of man's best friends in your home.\nFor more great deals, check out CNN Coupons.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/02/cnn-underscored/rifle-paper-co-sale-bogo-art-prints/index.html"}