{"authors": ["Sarah Rankin"], "date_download": "2020-05-04 20:20:15", "date_modify": "2020-05-04 20:20:15", "date_publish": "2020-04-08 17:04:16", "description": "RICHMOND, Va. (AP) — Dominion Energy Virginia recently told state regulators “significant build-out\" of natural gas-fired power plants is no longer viable because of renewable energy legislation...", "filename": "_3c711d503a304e67310a62e63a123b74_1588623615.html", "image_url": "https://storage.googleapis.com/afs-prod/media/7325ff0d082143049fbb307513cff74d/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3c711d503a304e67310a62e63a123b74_1588623615.html", "title": "Dominion: Significant new natural gas generation not viable", "title_page": "Dominion: Significant new natural gas generation not viable", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - This Feb. 8, 2018, file photo shows signs that mark the route of the Atlantic Coast Pipeline in Deerfield, Va. Dominion Energy Virginia recently told state regulators \"significant build-out\" of natural gas-fired generating facilities is no longer viable because of renewable energy legislation lawmakers passed earlier this year. (AP Photo/Steve Helber, File)\nFILE - This Feb. 8, 2018, file photo shows signs that mark the route of the Atlantic Coast Pipeline in Deerfield, Va. Dominion Energy Virginia recently told state regulators \"significant build-out\" of natural gas-fired generating facilities is no longer viable because of renewable energy legislation lawmakers passed earlier this year. (AP Photo/Steve Helber, File)\nRICHMOND, Va. (AP) — Dominion Energy Virginia recently told state regulators “significant build-out” of natural gas-fired power plants is no longer viable because of renewable energy legislation lawmakers passed earlier this year.\nThe disclosure came in a filing with the State Corporation Commission several weeks before Dominion has to file its integrated resource plan, or IRP, a long-range planning document that describes how the utility will generate power to comply with regulations and meet customer needs.\nThe company’s critics called it the latest development to raise questions about why the Atlantic Coast Pipeline, the approximately $8 billion multistate natural gas pipeline the utility’s parent company is spearheading, is needed.\nWhen Dominion proposed the pipeline in 2014, it was planning to build several thousand megawatts of additional natural gas generation in Virginia, said Will Cleveland, an attorney with the Southern Environmental Law Center.\n“Now, not only are they not planning to do it, they’re saying that that kind of a build-up isn’t even possible. Which just begs the question that we’ve been asking for years: What is that pipeline for?”\nDominion spokesman Jeremy Slayton said the pipeline is still “urgently needed for electricity, home heating and manufacturing in Virginia and North Carolina.”\n“Dominion Energy Virginia is just one of several public utility customers of the ACP, with a large portion of the capacity going to North Carolina utilities,” Slayton said in a statement.\nDominion’s filing asked the commission to waive a requirement it had previously instituted that said all future IRPs must include a risk analysis of constructing significant new natural gas and nuclear power generation.\nDominion said doing that modeling would be time- and resource-intensive work on something that was “no longer relevant.”\n“Significant build-out of natural gas generation facilities is not currently viable, with the passage by the General Assembly of the Virginia Clean Economy Act of 2020,” the filing said.\nThat bill, which is awaiting Gov. Ralph Northam’s signature, sets a goal of zero carbon emissions by 2045, paving the way for an enormous expansion of offshore wind generation, solar or onshore wind generation, and the use of battery storage technology.\nThe legislation also requires utilities to meet certain energy efficiency standards, establishes annual goals for the sale of renewable energy, and contains provisions advocates say remove barriers to rooftop and shared solar energy.\nDominion also cited the bill in a filing last week with the U.S. Securities and Exchange Commission as part of the reason it anticipates recording an abandonment charge in the first quarter of 2020 as a result of the probable early retirement of coal- and oil-fired units. The charge is expected to be between $500 million and $650 million after-tax, the filing said.\nSlayton called the filing with the State Corporation Commission a “procedural step to remove some outdated reporting requirements.” He said natural gas remains an important part of Dominion’s reliability.\nThe company has not canceled natural gas plant projects in Chesterfield and Pittsylvania County that are currently in the permitting process, he said.\nA move away from natural gas would mark a significant shift from Dominion’s last IRP in 2018 , which called for at least eight new gas-fired plants.\nThe SCC granted Dominion’s request to skip the modeling. The IRP is due by May 1.", "url": "https://apnews.com/3c711d503a304e67310a62e63a123b74"}