{"authors": [], "date_download": "2020-05-04 20:08:59", "date_modify": "2020-05-04 20:08:59", "date_publish": "2020-04-07 14:03:07", "description": "KNOXVILLE, Tenn. (AP) — A man fatally stabbed three people and wounded a fourth at a Tennessee travel center Tuesday morning before a deputy shot and killed him, authorities said. The Knox...", "filename": "_fbff828577e5e8a4aa0c1db02e090126_1588622939.html", "image_url": "https://storage.googleapis.com/afs-prod/media/09d4698d046946cfa15b40fb0db102b3/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fbff828577e5e8a4aa0c1db02e090126_1588622939.html", "title": "3 fatally stabbed, suspect killed by deputy at travel center", "title_page": "3 fatally stabbed, suspect killed by deputy at travel center", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Law enforcement investigates at the scene of a multi-victim stabbing at a Pilot truck stop on Strawberry Plains Pike in Knoxville, Tenn. on Tuesday, April 7, 2020. A man fatally stabbed three employees and wounded a customer at a Tennessee rest stop and travel center Tuesday morning before a deputy shot and killed him, authorities said.(Calvin Mattheis/Knoxville News Sentinel via AP)\nLaw enforcement investigates at the scene of a multi-victim stabbing at a Pilot truck stop on Strawberry Plains Pike in Knoxville, Tenn. on Tuesday, April 7, 2020. A man fatally stabbed three employees and wounded a customer at a Tennessee rest stop and travel center Tuesday morning before a deputy shot and killed him, authorities said.(Calvin Mattheis/Knoxville News Sentinel via AP)\nKNOXVILLE, Tenn. (AP) — A man fatally stabbed three people and wounded a fourth at a Tennessee travel center Tuesday morning before a deputy shot and killed him, authorities said.\nThe Knox County Sheriff’s Office responded to a call at the Pilot Travel Center off Interstate 40 to find a person with stab wounds outside the store and a man armed with a knife in the parking lot, the Tennessee Bureau of Investigation said in a statement. Witnesses identified the man as the suspect and he refused deputies’ demands to drop the weapon, the bureau said. As some point during the encounter, a deputy fired, striking and killing the suspect, the statement said.\nAuthorities found four stabbing victims. Three were pronounced dead at the scene and the fourth was taken to a hospital for treatment. The victims include Pilot employees, Tennessee Bureau of Investigation spokeswoman Leslie Earhart told news outlets.\nTravel centers like Pilot offer gas, food, parking and other amenities to truckers and other travelers.\nInvestigators were still working determine a motive for the violence, Earhart said. The bureau did not release the names of any victims or the suspect.\nKnox County Sheriff Tom Spangler said the deputy who fired the shot was not hurt.\nThe investigation remains active and ongoing.\n“It’s a very large scene — it involves outside and inside,” said Earhart.\nPilot CEO Jimmy Haslam came to the center and could be seen conferring with Spangler and other authorities, the Knoxville News Sentinel reported.", "url": "https://apnews.com/fbff828577e5e8a4aa0c1db02e090126"}