{"authors": ["Reporter"], "date_download": "2020-05-04 20:25:26", "date_modify": "2020-05-04 20:25:26", "date_publish": "2020-04-29 22:17:50", "description": "The veteran journalist said the Oscar-winner verbally went “after me in a way that was completely, weirdly uncalled for” during a 2004 “Dateline” interview.", "filename": "entry_katie-couric-denzel-washington-shaken-uncomfortable-interview_n_5ea9d86bc5b60db2c79dbe67_1588623926.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9ed99240000c6018e9f8d.jpeg?cache=pngioaub05&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_katie-couric-denzel-washington-shaken-uncomfortable-interview_n_5ea9d86bc5b60db2c79dbe67_1588623926.html", "title": "Katie Couric Says Denzel Washington Left Her ‘Shaken’ After ‘Uncomfortable’ Interview", "title_page": "Katie Couric Says Denzel Washington Left Her ‘Shaken’ After ‘Uncomfortable’ Interview | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Katie Couric recalled “a very uncomfortable interview” she had with Denzel Washington several years ago.\n“I think he totally misconstrued a question I asked and kind of jumped all over me,” the veteran journalist said on the “Everything Iconic with Danny Pellegrino” podcast Monday.\nCouric shared the story after the podcast’s host asked her if she ever conducted an interview in which she felt “bamboozled.”\nCouric couldn’t immediately think of an interview in which she felt her subject wasn’t forthcoming, but the question did spark the memory of a very awkward 2004 “Dateline” interview with Washington while he was promoting “The Manchurian Candidate.” Washington played a war veteran in the political thriller who discovers that U.S. soldiers are being brainwashed by the government.\nCouric did not specify in the podcast which part of the interview she was referring to, but a transcript of their conversation includes a bumpy exchange in which Couric asked the Oscar-winning actor if he agreed with the idea that “Hollywood folks should stick to acting” and not talk about politics.\nASSOCIATED PRESS Denzel Washington and Meryl Streep, his co-star in “The Manchurian Candidate,” arrive at the Venice Film Festival in 2004.\n“I don’t know what Hollywood folks are, first of all,” Washington responded. “Hollywood is a town that has some stars on the sidewalk. I don’t know anybody from there. So, I don’t … that’s like saying … calling you a type of folks. I’m not a Hollywood folk. I don’t know who they are.”\nCouric then tried to rephrase her question by asking, “Are you one of those people that —”\nWashington then interrupted saying:\n“Ah, there you go. ‘Am I one of those people?’ Hmmm, isn’t that interesting?”\nAfter Couric tried again to explain her question, Washington answered: “No, don’t stop. I heard what you just said. ‘Am I one of those people?’ No, I’m not.”\nCouric tried to rephrase a third time, this time asking, “Are you an actor who would rather not —,” but Washington cut her off again.\n“No, I’m not that either,” Washington said. “I’m a human being. My job is acting.”\nReflecting on the experience on Monday’s podcast, Couric said she felt that she didn’t say “anything wrong” and doesn’t “know what happened.”\nBut she ultimately chalked it up to Washington’s having a bad day. She added that he later wrote a “really big” check to the colon cancer foundation she started.\n“I love him. I admire him so much,” Couric said. “He’s one of my favorite actors. But I remember walking out and feeling really kind of shaken that he had kind of gone after me in a way that was completely, weirdly uncalled for.”\nHuffPost reached out to Washington for comment but did not receive an immediate response.", "url": "https://www.huffpost.com/entry/katie-couric-denzel-washington-shaken-uncomfortable-interview_n_5ea9d86bc5b60db2c79dbe67"}