{"authors": ["Branko Marcetic", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Derek Davison", "Greg Shupak"], "date_download": "2020-05-04 19:54:19", "date_modify": "2020-05-04 19:54:19", "date_publish": "2020-01-03 00:00:00", "description": null, "filename": "2020_01_iran-qassem-soleimani-killing-drone-donald-trump-war_1588622059.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/01/03114103/GettyImages-1195147317.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_01_iran-qassem-soleimani-killing-drone-donald-trump-war_1588622059.html", "title": "The Imperial Presidency Helped Bring Us to the Brink of War in Iran", "title_page": "The Imperial Presidency Helped Bring Us to the Brink of War in Iran", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Yesterday’s assassination of Qassem Soleimani, an illegal and reckless escalation of the US-Iran tensions Trump has deliberately stoked throughout his term, is a bit like Trump’s victory in 2016: nothing that came before should make us the least bit surprised it happened, yet the outcome is so alarming that you can’t help but feel shaken.\nAs experts have already pointed out, Soleimani’s killing has the potential to spark something very dangerous. Soleimani was one of the country’s most powerful military figures, the head of its elite Quds Force who essentially ran Iranian military and foreign policy in the region. A war hero labeled “a living martyr of the revolution” by Iran’s Supreme Leader, he was a hugely popular figure who was the subject of rhapsodizing state propaganda, and who had future political leadership possibly in his sights.\nSo there’s a high likelihood his death will prompt reprisals against, for example, the numerous US bases, embassies, and troops surrounding Iran, with many of the latter deployed in the middle of Trump’s attempts to incite a conflict with Iran in earnest last year. And those reprisals will prompt their own reprisal from Trump, and perhaps even serve as a pretext for the war the president’s been fumbling toward. The administration seems to have been trying all of last year to goad Iran into doing something, anything, that would justify a US attack on the country; this is their best chance yet. It’s not for nothing one expert called the idea of his assassination “a real act of war” in 2018.\nA war with Iran would, of course, be another largely US-engineered calamity for the Middle East to add to the ever-growing list. The lesson should’ve been learned in the 2000s with Iraq. Far from a quick, easy war of no longer than five months — as George Bush’s defense secretary had predicted — Iraq swiftly became the “long, long, long battle” he denied it would ever be.\nNot only did the military fail to stabilize the country in the power vacuum that followed, it faced a prolonged insurgency, unleashed a torrent of violent sectarianism and eventually civil war, helped produce the rise of an even more vicious terrorist organization in the form of ISIS, and, in the darkest of ironies, opened the door for Iranian meddling in the country — specifically, that of Soleimani himself. The conditions created by a foolish war against Iran would no doubt create the same kind of pretext for war against another state years later.\nThe US elite naturally learned nothing from this, launching another short-sighted war to depose Libyan dictator Muammar Gaddafi in 2011, with similarly dire, destabilizing consequences, which continue roiling today. The results were no prettier in Afghanistan, where the United States deposed the Taliban government, only to replace it with its own corruption-infused creation and remain trapped in the country for going on two decades fighting a seemingly never-ending battle. All three of these wars were also toxic for US global standing, fueling the anger that underwrites anti-American violence.\nA war with Iran would be no different, nor would it produce the kind of quick and temporary public relations victory that regime change offered Obama and Bush in their wars. As a number of experts have outlined, Iran is a physically and populously massive country whose imposing physical geography makes it, in the words of intelligence firm Stratfor, a “fortress” that “is extremely difficult to conquer.” At the same time, it can strike back at the United States through regional proxies or cyberattacks all over the world. And the past two decades have, if nothing else, been a horrific reminder of the profound limits of US military power.\nUnfortunately, reality has very little to do with Washington foreign policy, including under this president. It may well take a show of massive popular opposition to sway Trump away from pulling the trigger this year. After all, he won in 2016 by presenting himself, however dishonestly, as an antiwar candidate. Does he really want to go into the 2020 election facing down large protests against a protracted, unpopular war he started?", "url": "https://www.jacobinmag.com/2020/01/iran-qassem-soleimani-killing-drone-donald-trump-war"}