{"authors": [], "date_download": "2020-05-04 16:23:37", "date_modify": "2020-05-04 16:23:37", "date_publish": "2020-04-06 18:19:16", "description": "Group FaceTime isn't a new feature of the just-released iOS 13.4, but it's a feature that is coming in handy now more than ever. We frequently use it to connect with family and friends, but with the on-going social distancing practice, it's appropriate to call it a daily ritual.", "filename": "2020_04_06_cnn-underscored_how-to-group-facetime_index_1588609417.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406101654-underscored-facetime-how-to-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_cnn-underscored_how-to-group-facetime_index_1588609417.html", "title": "Here's how to make a Group FaceTime Call", "title_page": "Here's how to make a Group FaceTime Call - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Group FaceTime isn't a new feature of the just-released iOS 13.4, but it's a feature that is coming in handy now more than ever. We frequently use it to connect with family and friends, but with the on-going social distancing practice, it's appropriate to call it a daily ritual.\nAnd the best part is that almost any Apple device can join the party, iPhone, iPad, iPod Touch and macOS computers included. For the latter, you'll just need a built-in webcam or plug a third-party option into your Mac.\nWe're going to walk you through how to make a FaceTime Call across devices — but we're also letting loose on some of our favorite features that take FaceTime beyond just a simple video call.\nFaceTime on the iPhone, iPad or iPod Touch\nOn any iOS device, you'll start by opening the FaceTime app. It should be on your home screen by default, but there's a chance you might have tucked it away into a folder. Once in the app, you'll start by hitting the blue \"+\" in the top right corner. From there, it will open your keyboard and a text field. Here you can search your contacts by a name, email or phone number.\nYour results will populate, and those highlighted in blue (rather than gray), can be added to the call. You can add just one person or multiple people to initiate a group FaceTime call. It's handy once you've added all the contacts, as at the bottom you can tap \"Audio\" or \"Video\" to start a call. An audio call will be voice only, while a video uses the front-facing or rear-facing camera.\nFrom there, you can eagerly wait for you or your friends to join. The bottom bar lets you easily add effects, mute yourself, flip your camera or end the call.\nFaceTime on the Mac\nMaking a FaceTime audio or video call on the Mac is just as simple. You'll open the FaceTime app on your Mac. By default, the app will be in your dock, but you can also search for it via Spotlight (click the magnifying glass in the top toolbar and then search).\nWith FaceTime on the Mac, you'll click the blue \"+\" sign in the top right corner of the window. From there, you can search for someone by name, number or email. It's the same setup as on iOS, so you'll be able to add the contacts that appear in blue. Once you have just one lucky person or a group of pals, you can tap the Audio or Video button to start a FaceTime Call. On the Mac, you'll be able to easily see those in your call in the left-hand toolbar next to the FaceTime view. The mute, end and camera off buttons live at the bottom of the window. You can also hide the left-hand toolbar by clicking the button next to the mute icon.\nSo there you have it! It's not that hard to make a FaceTime call and it's a great way to connect with friends or family. Better yet, you can FaceTime with up to 32 people! Plus, we have more tips to enhance your FaceTime and to get more out of the calls.\nAnimoji and Memojis\nUsing an Animoji or Memoji is the perfect way to spice up your FaceTime calls. These 3D figures are supported on any iOS device with a True Depth Sensor. This is the hardware that powers Face ID and is available on the iPhone X, iPhone XR, iPhone XS, iPhone XS Max, iPhone 11, iPhone 11 Pro, iPhone 11 Pro Max, 1st and 2nd Gen 11-inch iPad Pro and 2nd or 3rd Gen 12.9-inch iPad Pro.\nWhen in a FaceTime call, you'll tap the effect button and then hit the first effect button that pops up — it should have a Monkey with its mouth open on the icon. Once you tap this icon, you'll be able to scroll through all the available Memojis or Animojis. You'll need to have created your Memoji ahead of time. There are quite a bit to choose from, including your own Memojis, a shark, a poop, a monkey and even a dragon.\nFrom the Effects panel, you can also add a color gradient to your video. This is similar to PhotoBooth on the Mac or iPad. You can also add text, scribble art and add any normal emoji to your Facetime. Additionally, some apps have custom stickers that you can add to your FaceTime.\nCapture a moment in a FaceTime\nYes, you can screenshot any screen on an iOS device, but with FaceTime, you can easily capture a Live Photo, this way your memory will capture a 3-second period of time. In FaceTime, just tap the white circular shutter button that sits in the bottom left-hand corner to capture a Live Photo.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/06/cnn-underscored/how-to-group-facetime/index.html"}