{"authors": [], "date_download": "2020-05-04 20:09:34", "date_modify": "2020-05-04 20:09:34", "date_publish": "2020-01-07 06:12:51", "description": "MAN CARRIES MOTHER DOWN 10 FLIGHTS OF STAIRS TO ESCAPE FIRE A Pennsylvania man says he carried his mother down 10 flights of stairs to escape an early Saturday morning fire at a senior...", "filename": "_f4e18f96f4aa41829a0233ddabb7fa26_1588622974.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f4e18f96f4aa41829a0233ddabb7fa26_1588622974.html", "title": "AM Prep-Kickers", "title_page": "AM Prep-Kickers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MAN CARRIES MOTHER DOWN 10 FLIGHTS OF STAIRS TO ESCAPE FIRE\nA Pennsylvania man says he carried his mother down 10 flights of stairs to escape an early Saturday morning fire at a senior living facility. Officials say one person was treated at the scene after a fire broke out on the fourth floor of the Brith Sholom House in Wynnefield Heights around 1:40 a.m. Shawn Smith tells WPVI-TV that he started smelling smoke on the 10th floor hallway. Smith says he put his mother on his shoulder and carried her all the way down to escape. Fire officials say they had the fire under control in about 20 minutes.\nANIMAL HOUSE: SQUIRREL WRECKS HOME, INSURANCE WON’T FIX IT\nATLANTA (AP) - An Atlanta couple said they came home from a winter vacation to find their house had been ransacked by an unusual suspect: a squirrel. Kari and Dustin Drees returned to find their house in disarray with floors scratched, baseboards chewed, and squirrel feces all around. Reports say a squirrel had fallen down their chimney and became trapped in the house, defecating and scratching at everything to get out. The couple’s home insurance provider won’t cover the damages, saying a squirrel is considered a rodent not covered by the policy. But the insurer offered to pay for alternative housing while the couple cleans the home.\nFEDS, COLORADO SEEK ANSWERS IN MYSTERIOUS DRONE SIGHTINGS\nFORT MORGAN, Colo. (AP) — The Federal Aviation Administration is working with state and local authorities to determine who’s behind a series of mysterious nighttime drone flights over northeastern Colorado and western Nebraska. A Colorado sheriff hosted a meeting with law enforcement agencies and government officials Monday to talk about the recent rural sightings. The drones reportedly have 6-foot wingspans and fly in grid-like patterns hundreds of feet in the air in groups of six to 10. The FAA says it’s taking the sightings seriously and working to find out who’s operating the devices and why. Sheriff’s officials say it appears that no laws are being broken.\nPHOENIX TRIPLETS OPT TO ENLIST IN MARINE CORPS\nPHOENIX (AP) — Teenage triplets in one Phoenix family are joining the Marines at the same time. Hayley, Ian and Andrew Mase, who were born a minute apart, will be separated for an extended period for the first time. Hayley, the oldest, tells ABC15.com that it will be hard. But she knows that next time they are together, it will feel like they never spent time apart. The teens joined ROTC in high school. Andrew, the youngest, is already in combat training. Hayley will leave next month for boot camp. Ian is looking to go to boot camp in March.\nCHIHUAHUA LOST IN NEW YEAR’S EVE CRASH REUNITED WITH OWNER\nBUNNELL, Fla. (AP) — A Chihuahua named Max is back with his owner after going missing following a car crash on New Year’s Eve. The Flagler County Sheriff’s Office says the 6-year-old dog’s owner was involved in car crash last Tuesday morning in Bunnell, in north Florida. Max ran from the accident scene and his owner couldn’t find him. For the next few days, deputies and the owner returned to the scene to look for the dog and to leave food for him in case he returned. When they arrived on Saturday, Max was waiting. He ran into his owner’s arms. The owner said Max smelled terrible but was “such a good boy.”\nEGGS FROM ENDANGERED SEA TURTLE STOLEN FROM THAI BEACH\nBANGKOK (AP) — A community in southern Thailand has offered a reward for catching whoever stole dozens of unhatched eggs of an endangered turtle species. A marine resources official says the Pacific Leatherback turtle eggs were stolen before dawn Sunday from a beach in the southern province of Phang-nga (pang nar). Local residents donated 50,000 baht ($1,660) for a reward to catch the thieves, and the sum was matched by provincial authorities, bringing the total to 100,000 baht ($3,320). The Pacific Leatherback is the world’s largest sea turtle but also critically endangered, and its nests had not been seen in Thailand for five years until January 2019.\nSIOUX FALLS COMPANY AWARDS $10 MILLION IN HOLIDAY BONUSES\nSIOUX FALLS, S.D. (AP) — A Sioux Falls company has awarded holiday bonuses its 120 employees likely won’t forget. Myrl & Roy’s Paving gave its workers $10 million in bonuses ranging from $5,000 to $400,000 depending on length of employment and job duties. One of the owners, Sue Unzelman, says they wanted to thank the employees for their hard work and loyalty. Unzelman and her siblings are selling the second-generation company to L.G. Everist, a rock mining company with pits and quarries in the region. Myrl & Roy’s Paving began over five decades ago after Myrl Unzelman and Roy Schultz bought a $500 dump truck.", "url": "https://apnews.com/f4e18f96f4aa41829a0233ddabb7fa26"}