{"authors": [], "date_download": "2020-05-04 16:22:12", "date_modify": "2020-05-04 16:22:12", "date_publish": "2020-04-06 10:01:31", "description": "Final Fantasy VII is back, and come April 10, you'll be able to play what is certainly one of the most anticipated titles of 2020. Final Fantasy VII Remake isn't just a straight remake, either — it's a retelling born from much of the same time at SquareEnix (the publisher behind it), when it launched nearly 30 years ago in 1997.", "filename": "2020_04_06_cnn-underscored_final-fantasy-vii-remake-review_index_1588609332.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405204143-2-underscored-final-fantasy-vii-remake-review-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_cnn-underscored_final-fantasy-vii-remake-review_index_1588609332.html", "title": "Final Fantasy VII Remake Review", "title_page": "Final Fantasy VII Remake Review - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Final Fantasy VII is back, and come April 10, you'll be able to play what is certainly one of the most anticipated titles of 2020. Final Fantasy VII Remake isn't just a straight remake, either — it's a retelling born from much of the same time at SquareEnix (the publisher behind it), when it launched nearly 30 years ago in 1997.\nAnd for the remake, VII is being split into multiple parts. The first installment, which is exclusive to the PlayStation 4, can be preordered for $59.99. By doing this, you can pre-download the game and be ready to play on April 10.\nWe've spent a weekend with the VII Remake and here's our quick take: the graphics are impressive, the updated take on controls makes this an engaging RPG, and the story is still one that pulls you in. Let's dive further into the world of Final Fantasy VII and ultimately, the city of Midgar.\nKnow your characters and story\nYou'll start the game by taking control of Cloud — formally Cloud Strife, a mercenary who carries a massive sword and who can deal massive attacks to enemies — wiping out enemies and ultimately breaking into a power plant reactor.\nThe main thing to know with the Final Fantasy VII Remake is that you're going up against the evil Shinra Electric Power Company. An immediate sense of concern likely comes with that name as it seems to be a front for something larger — we're not giving away too much here. The power company is using the planet's natural resources, essentially stealing all that is left. That resource is referred to as Mako, and it's safe to say that Shinra is using a lot of it. It's powering the reactors, and in turn, is powering the city of Midgar.\nYou'll see elements of the city in the opening scenes. In fact, the opening might even trick the uninformed who are entering this title with a clean slate. You'll see what looks like a normal city, but as it pans down streets and through a bustling metropolis, you'll begin to notice that infrastructure is massive and greedy.\nFor instance, one of the core reactors for Shinra Electric Power Company sits right in the middle of the city and is definitely putting out some chemicals that can't be good for the environment. There are some weird parallels here to the current state of Earth, especially from an environmental standpoint. But we digress on that point.\nCloud is working with a resistance group intent on disrupting Shinra and trying to take down the corporation. They don't like the tactics the company is using or the negative effects it's having on the planet, and of course on the city of Midgar. Barret, the leader of that group is big, strong and has an in-your-face attitude. One of his arms is a barrel gun, and he's dressed like a committed resistance member.\nIt's a lot to know, but the story arcs in Final Fantasy VII Remake are presented quite clearly. You'll get the full down-low and have an understanding after completing the first chapter. It's a stormy evening and one that pulled us in quite quickly.\nAs we said in our Animal Crossing New Horizons review, video games are a great escape. There's a lot going on in our real world right now, and it can be hard to take your mind off of it. Final Fantasy VII sits in that same bucket with a story that's engaging and leaves you wanting more.\nControls\nSo yes, this is an RPG, or role-playing game, that takes you through one main story with several other stories and characters weaving in and out. It's orchestrated well, but what's a good video game with an engaging story, without decent controls?\nWell, when Final Fantasy VII first launched in 1997, it was an understandably different lay of the land. It was one of the first RPGs with full motion, cut scenes and great graphics (for the time), but it also used more average controls. For this reimagining, it's going full real-time with an RPG style by default. It will lead you to smashing buttons on your controller.\nSimilar to how the story fills you in, you'll get acclimated as you get control of Cloud. In fact, there's a sidebar that will pop out from the right side to provide small descriptions of each attack. Starting off, you'll have one main attack with Cloud's massive sword. You can stab, slash, wind up and pounce with an ultimate strike. It's pretty cool and there's excellent feedback through the control. This way you can see it on the screen, feel it with a press and ultimately see if you hit or miss with the haptics inside the controller.\nAdditionally, with this new real-time system in both easy and difficult game modes, you'll be able to apply points, switch attacks and even coordinate power-ups. This is all housed in a small widget box on the bottom left of the screen. You can select your character to switch fighting modes, heal with potions and engage special attacks. Even cooler, you can control other characters ---- either by switching to them or by commanding their attacks. It adds an impressive strategy layer to the title and it makes you think about the overall fight. Do you keep yourself as the main attack, while you order the other fighters to serve as distractions? The choice is yours.\nYou'll put all of this together when navigating facilities, roaming through streets and, ultimately, when faced with a boss. A lot of Final Fantasy VII Remake builds to you having to defeat one big enemy or a big boss.\nYou'll start by entering a space, getting through some layers of doors or security, fighting a single enemy or some groups and then ending against a larger, more powerful one. These enemies range from security officers to mercenaries and even giant robots with lasers and massive tails that can deal a large amount of damage.\nIt feels like a true action role-playing game, and it eliminates the need for a newcomer to understand the classic true-based gameplay. You have the power to make Cloud strike at the same time in however many ways you've unlocked, as Barret is controlled by the game and makes his way by destroying big bots. It's up to the standards of a 2020 game. This is the experience you'll get with easy and difficult modes in the remake.\nBut there is also a classic mode which aims to re-envision the original controls from the 1997 title. We're not the biggest fans of it, but it allows more interested parties to play the title.\nVisuals are quite stunning\nThe Final Fantasy VII Remake delivers visuals that are stunning and immersive.\nThe opening scene takes you through a desert-scape and into present-day Midgar. You start by seeing normal streets filled with kids riding bikes, infrastructure being repaired and commuters walking to various locations. It then pans out to show you what Shinra has done, and it's really like a show and tell. You see a nice looking city, but then realize it's in the backdrop and surrounded by massive power reactors. It makes you wonder why is this occurring? Is it good for the planet? And surely we can help stop this, right? And you'll be pleasantly happy for sure.\nYou're thrown right in from this opening into the action of Final Fantasy VII Remake. There isn't a loading screen, which is always a big accomplishment for any video game, especially one of this caliber and size. Our download came in at more than 85GBs. That's not chump size for sure. We really have to hand it to SquareEnix for paying attention to details. Loading screens distract from gameplay. And in Final Fantasy, you won't want to be pulled away from the action, so a lot of the details and next scenes are rendered in the background. This way you can go from sneaking into a factory to opening the next set of doors via a cut scene. You're never kicked out of the main gameplay.\nAnd it stays immersive throughout the story. You'll see it in day and night, outside and inside and so much more. Midgar is a bustling city and you can see it at its fullest. Seeing the rest of the Final Fantasy VII worlds and locations will take some time, though. This is just Part 1 of what SquareEnix is referring to as the Final Fantasy VII Remake Project and it just focuses on Midgar, so we'll have to wait (hopefully not another 30 years) for the next installment.\nBottom line\nFinal Fantasy VII Remake has a lot to live up to. It needs to appease original players and fans, bring new gamers into the franchise and deliver a compelling experience that's worthy of $59.99 for anybody who chooses to play. Fortunately, it does that, which you can see for yourself by playing the demo. We think you're going to dig this especially as the story itself can prove to be an escape from what we're enduring.\nAt $59.99 you're getting a massive game that will provide hours upon hours of enjoyment. Plus, don't you want to see what Shinra is up to?\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/06/cnn-underscored/final-fantasy-vii-remake-review/index.html"}