{"authors": ["Review Brian Lowry"], "date_download": "2020-05-04 16:02:45", "date_modify": "2020-05-04 16:02:45", "date_publish": "2020-03-20 18:16:55", "description": "Netflix has made a lot of noise with unscripted programming, but it's going to roar with this beyond-bizarre docu-series distraction, which demonstrates that outlandish people who love filming themselves are a formula for TV that's grrrr-reat.", "filename": "2020_03_20_entertainment_tiger-king-review_index_1588608165.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200316160850-tiger-king-netflix-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_20_entertainment_tiger-king-review_index_1588608165.html", "title": "'Tiger King' is the weird docu-series distraction we can use right now", "title_page": "'Tiger King' review: 'Tiger King' is the weird docu-series distraction we can use right now - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) People who own big cats are unusual, we're told near the outset of \"Tiger King: Murder, Mayhem and Madness,\" which proceeds to prove that -- and then some -- over seven jaw-dropping episodes. Netflix has made a lot of noise with unscripted programming, but it's going to roar with this beyond-bizarre docu-series distraction, which demonstrates that outlandish people who love filming themselves are a formula for TV that's grrrr-reat.\nIt's hard to know, frankly, where to begin with all the strange twists and turns, but directors Eric Goode and Rebecca Chaiklin rightly assume that it's easiest to work backward from the (almost) end: Joseph Maldonado-Passage , an eccentric keeper of tigers, lions and other big cats in Oklahoma who goes by the name \"Joe Exotic,\" allegedly having orchestrated a murder-for-hire plot against Carole Baskin, a woman who runs a facility called Big Cat Rescue, who had lobbied to shut down operations like his.\nAfter that, though, there's a whole lot to chew on. Big cats, it turns out, are a kind of aphrodisiac, inspiring what can only be described as cultish devotion -- including Joe's marriage to not one but two men; another big-cat owner, Bhagavan \"Doc\" Antle, who is basically a polygamist; and Jeff Lowe, who comes into Joe's orbit later and brags about using exotic pets as a come-on to find partners for threesomes.\nBut wait, there's more: The colorful characters that Joe attracts to work for him (including one who loses a limb to a tiger attack); Joe's desire to create his own media kingdom, enlisting a former \"Inside Edition\" correspondent, Rick Kirkham, to oversee his TV efforts; and finally, Joe's forays into politics, running for president before mounting a libertarian bid for governor of Oklahoma, despite being a little unclear on what a libertarian actually is.\nJoe Exotic in 'Tiger King'\nFinally, there's Baskin, who would seemingly be the voice of reason in all this, objecting, as she does, to people housing and trading in dangerous cats. Still, she finances those efforts largely through the fortune she inherited from her late husband, who disappeared under the kind of mysterious circumstances that even a \"Dateline NBC\" producer might consider too good to be true.\nRead More", "url": "https://www.cnn.com/2020/03/20/entertainment/tiger-king-review/index.html"}