{"authors": ["Michael Callahan"], "date_download": "2020-05-04 16:00:12", "date_modify": "2020-05-04 16:00:12", "date_publish": "2020-04-01 13:40:31", "description": "Thousands of South Koreans who work on US bases in South Korea were furloughed on Wednesday after the Trump administration and South Korea failed to reach a new cost-sharing formula for the cost of US troops stationed.", "filename": "2020_04_01_politics_south-koreans-on-us-bases-furloughed_index_1588608012.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401072043-01-camp-humphreys-south-korea-2018-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_south-koreans-on-us-bases-furloughed_index_1588608012.html", "title": "US furloughs thousands of South Koreans who work on US bases over cost sharing dispute", "title_page": "US furloughs thousands of South Koreans who work on US bases over cost sharing dispute - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Thousands of South Koreans who work on US bases in South Korea were furloughed on Wednesday after the Trump administration and South Korea failed to reach a new cost-sharing formula for the cost of US troops stationed.\nCNN previously reported that top officials warned in February the move could undermine the US military mission amid tensions with North Korea. Approximately 4,500 South Korean workers are furloughed from their jobs on various US military installations on Tuesday.\nThe dispute over the cost of the 28,500 US troops stationed on the Korean peninsula erupted after President Donald Trump asked for a 400% increase in South Korea's contribution under the so-called Special Measures Agreement. The demand outraged Seoul and concerned US lawmakers in both parties.\nIn February, a senior State Department official said US officials had \"adjusted our stance\" during the course of negotiations, and said they are not currently laser-focused on getting the South Koreans to increase the amount they pay by 400%.\nThe last deal agreed upon in February 2019 boosted South Korea's contribution from about $800 million to nearly $1 billion.\nRead More", "url": "https://www.cnn.com/2020/04/01/politics/south-koreans-on-us-bases-furloughed/index.html"}