{"authors": [], "date_download": "2020-05-04 21:06:52", "date_modify": "2020-05-04 21:06:52", "date_publish": "2020-04-20 13:59:47", "description": "JUNEAU, Alaska (AP) — Opponents have lost a court case against the proposed copper and gold mine near a major salmon fishery in Alaska’s Bristol Bay region. U.S. District Court Judge Sharon...", "filename": "_9ff006c660f8feb30d7ce916682f9fd3_1588626412.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9ff006c660f8feb30d7ce916682f9fd3_1588626412.html", "title": "Opponents lose court case against Alaska mine near fishery", "title_page": "Opponents lose court case against Alaska mine near fishery", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "JUNEAU, Alaska (AP) — Opponents have lost a court case against the proposed copper and gold mine near a major salmon fishery in Alaska’s Bristol Bay region.\nU.S. District Court Judge Sharon Gleason ruled the U.S. Environmental Protection Agency could withdraw a “proposed determination” about potential negative mine impacts dating from 2014, Alaska Public Media reported Sunday.\nThe determination had concluded the mining project, named the Pebble Mine, posed too great a threat to the salmon-rich waters of Bristol Bay.\nThe judge’s ruling was based on the amount of latitude government agencies have and what is subject to legal review, rather than the merits or dangers of the mine.\nThe case focused on a “preemptive veto” the EPA issued during the administration of President Barack Obama, before Pebble Limited Partnership filed an application for the mine in Southwest Alaska.\nThe mine’s federal permit application is pending with the U.S. Army Corps of Engineers, and the EPA retains the right to veto the permit, a power that was not diminished by Friday’s ruling.\nThe mine proposal has loomed over the region for years. But Pebble Limited Partnership did not apply for a permit while Obama was in office.\nThe mining company and Alaska’s congressional delegation have complained of government overreach, saying the EPA tried to veto the project before seeing an application. The mining company eventually applied for a Clean Water Act permit in 2017.\nThe EPA said last year it would withdraw its proposed determination against the mine, which prompted the lawsuit by mine foes including the organizations Trout Unlimited, SalmonState and Bristol Bay Economic Development Corp.\nThe Corps of Engineers plans to issue its final environmental impact statement on the project this summer, one of the last steps before issuing a decision on the permit.\nThe EPA has said the science that the Corps is relying upon is inadequate and likely understates the harm to the bay.", "url": "https://apnews.com/9ff006c660f8feb30d7ce916682f9fd3"}