{"authors": ["Dave Campbell"], "date_download": "2020-05-04 20:18:56", "date_modify": "2020-05-04 20:18:56", "date_publish": "2020-04-16 16:08:23", "description": "MINNEAPOLIS (AP) — The Minnesota Vikings deftly used the draft to build a sturdy defense under head coach Mike Zimmer, a smart, proud, cohesive unit that could control games as effectively as any...", "filename": "_fe4024212fbc143c103444f4edafd346_1588623536.html", "image_url": "https://storage.googleapis.com/afs-prod/media/4c14b821f6de436da4ee35937af632b2/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fe4024212fbc143c103444f4edafd346_1588623536.html", "title": "Backed into a corner: Vikings must restock defense in draft", "title_page": "Backed into a corner: Vikings must restock defense in draft", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Jan. 11, 2020, file photo, Minnesota Vikings coach Mike Zimmer speaks at a news conference after the Vikings lost to the San Francisco 49ers in an NFL divisional playoff football game in Santa Clara, Calif. The Vikings built a dominant defense under Zimmer on the strength of their first and second-day draft picks, but the time has come to restock after the departure of five starters this offseason. (AP Photo/Marcio Jose Sanchez, File)\nFILE - In this Jan. 11, 2020, file photo, Minnesota Vikings coach Mike Zimmer speaks at a news conference after the Vikings lost to the San Francisco 49ers in an NFL divisional playoff football game in Santa Clara, Calif. The Vikings built a dominant defense under Zimmer on the strength of their first and second-day draft picks, but the time has come to restock after the departure of five starters this offseason. (AP Photo/Marcio Jose Sanchez, File)\nMINNEAPOLIS (AP) — The Minnesota Vikings deftly used the draft to build a sturdy defense under head coach Mike Zimmer, a smart, proud, cohesive unit that could control games as effectively as any in the league.\nNow the foundation needs to be shored up.\nFive starters and three key backups have departed from the defense this offseason, once again turning the focus to that side of the ball when the draft begins.\n“We’ve got a lot of work to do,” Zimmer said at the NFL scouting combine. “First of all, figuring out players, and then figuring out the scheme they can do. My first year when I came here, we looked at the depth chart. It was pretty ugly at that point, so we had to manipulate that.”\nWhen he was hired in 2014, Zimmer inherited a defense that finished last in the league in points allowed and second-to-last in yards the prior season. This time, the project does not appear as daunting. The Vikings fell to 14th in yards allowed last year, but they surrendered the fifth-fewest points. Still, the offseason exodus, prompted by a salary cap crunch, thinned the Vikings out at cornerback, safety and defensive end.\nEspecially cornerback .\nXavier Rhodes, Trae Waynes and Mackensie Alexander, the top three players at that critical position last year, went elsewhere. That leaves Mike Hughes, the 2018 first-round draft pick, as the most reliable incumbent. Two other 23-year-olds, Holton Hill and Kris Boyd, have potential as rotation players, but landing another cornerback or two on the first or second day of the draft is a must.\n“We’re not going to cry because we don’t have some of those guys. Our job is to figure out how to get guys in there and get them to play,” Zimmer said.\nHere are some other key angles to follow with the Vikings in the draft:\nCORNER THE MARKET: By trading wide receiver Stefon Diggs to Buffalo, the Vikings acquired additional picks in the first, fifth and sixth rounds for next week. They now own the 22nd overall selection, as well as the 25th, in the first round.\nAlabama cornerback Trevon Diggs, the brother of the now-departed wide receiver, could be available at one of those spots. LSU’s Kristian Fulton, Clemson’s A.J. Terrell and TCU’s Jeff Gladney are other cornerbacks widely valued for that range of the draft.\nSPIELMAN’S DOZEN: Thanks to a compensatory pick in the third round for free agent losses last year, the Vikings have five of the top 105 selections. They’ll start the draft with 12 choices, giving general manager Rick Spielman plenty of capital for his usually active dealing. That makes moving up in the first round for a favored prospect an even more realistic option.\nUP FRONT: Mainstay defensive end Everson Griffen became a free agent, and backup Stephen Weatherly also departed at that position. Danielle Hunter is one of the league’s best pass rushers at age 25, Ifeadi Odenigbo broke out late last season as a productive rotation player, and Anthony Zettel was added during the bargain stage of free agency. Still, more help is needed on the edge. Yetur Gross-Matos (Penn State) and A.J. Epenesa (Iowa) are two prospects who could entice the Vikings in the first round.\nPASS-CATCHERS, APLENTY: Diggs had been dissatisfied with his role in Minnesota for awhile, but another contributing factor in the willingness of the Vikings to part with him was undoubtedly the depth of this draft at wide receiver. Most analysts have pegged between 15 and 20 wide receivers for the first three rounds. Last year, 13 were taken over the first two days, 10 in 2018.\nQUARTERBACK OUTLOOK: The $66 million extension the Vikings gave Kirk Cousins last month took them out of the hunt for a starting quarterback for at least another two or three years. That doesn’t mean they wouldn’t draft a backup, though. Perhaps a prospect like Oklahoma’s Jalen Hurts would be too tantalizing to pass up if he were to last until the third day.\nThe Vikings have drafted only five quarterbacks in the last 20 years. Green Bay took seven over that span, even with Brett Favre and Aaron Rodgers on the job. New England selected 11, even with Tom Brady at the helm. Tarvaris Jackson (second round, 2006), Christian Ponder (first round, 2011) and Teddy Bridgewater (first round, 2014) were targeted as starters. Tyler Thigpen (seventh round, 2007) and John David Booty (fifth round, 2008) were the only attempts at using the draft for a backup in two decades.\n___\nMore AP NFL coverage: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/fe4024212fbc143c103444f4edafd346"}