{"authors": [], "date_download": "2020-05-04 20:13:25", "date_modify": "2020-05-04 20:13:25", "date_publish": "2020-04-09 16:17:12", "description": "COLUMBIA, S.C. (AP) — A teenager who a police officer in South Carolina wanted to talk to about breaking into nearby cars was shot and killed by an officer after pulling out a gun during a chase,...", "filename": "_e32cee7d8a598548382293cf22574853_1588623205.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e32cee7d8a598548382293cf22574853_1588623205.html", "title": "17-year-old killed by police in SC checking on car break ins", "title_page": "17-year-old killed by police in SC checking on car break ins", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "COLUMBIA, S.C. (AP) — A teenager who a police officer in South Carolina wanted to talk to about breaking into nearby cars was shot and killed by an officer after pulling out a gun during a chase, authorities said.\nThe Columbia police officer was patrolling an area near Eau Clare High School around 6 p.m. Wednesday when he saw the 17 year old walking along state Highway 215, Columbia Police Chief Skip Holbrook said.\nAs the officer got out of his patrol car, the teen started to run away and during the 20-second chase, pulled out a gun, Holbrook said.\nThe officer fired at him, hitting him at least once, the chief said.\nA gun and a woman’s purse with cash inside was found beside the teen, Holbrook said.\nThe chief said he didn’t know how many shots were fired and in his statement didn’t say if police think the teen fired.\nThe Richland County Coroner’s Office identified the teenager as Joshua Dariandre Ruffin. The chief said he was shot once in the front of his upper body, leading investigators to think he was turned toward the officer when he was struck.\nThe State Law Enforcement Division is investigating whether the shooting was justified, while Columbia Police investigate if the officer followed the department’s rules.\nThe officer was not hurt and has been placed on leave with pay while state agents investigate, Holbrook said.\nThe chief said he would release the officer’s name later, but said he worked for Columbia Police for more than four years and hasn’t been involved in any other on-duty shootings.\nThe chief said the officer is a white male. Neither statement from the coroner nor the chief gave the race of the teenager killed.\nThe officer’s body camera footage of the shooting will be released when investigators allow, Holbrook said.", "url": "https://apnews.com/e32cee7d8a598548382293cf22574853"}