{"authors": ["Jeanne Sahadi", "Cnn Business", "Kelly Conklin", "Owner"], "date_download": "2020-05-04 16:54:07", "date_modify": "2020-05-04 16:54:07", "date_publish": "2020-04-08 14:43:34", "description": "The biggest lifeline in the economic aid package for small businesses -- $350 billion in forgivable loans -- may be too little, too late for many.", "filename": "2020_04_08_success_small-business-frustration-loan-program_index_1588611247.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407200953-01-small-businesses-frustration-forgivable-loans-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_success_small-business-frustration-loan-program_index_1588611247.html", "title": "Small business owners need cash now. But they don't know when it will come", "title_page": "Small business owners need cash now. But they don't know when it will come - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Small business owners feel they're in a race for their livelihoods . When they learned $349 billion in forgivable loans would be paid out on a first-come, first-served basis, they made a mad dash to apply the day the program opened.\n\"It's a wild grab for cash . People's livelihoods are on the line,\" said Evan Brownstein, who operatesfive restaurants in Los Angeles.\nBut the Paycheck Protection Program, or PPP, as it's known, wasn't ready for prime time when it launched on April 3. Many lenders have been slow to accept applications because they needed more technical guidance from the Treasury Department and the Small Business Administration. The SBA's electronic system went down for a spell. And with both agencies updating guidance and amending forms, there is still confusion as to what the rules really are.\nBorrowers' fears thatthe program's funding could run dry are warranted. There has been outsized demand for the loans already and one banking analyst predicts it will all be spoken for by next week. There is, however, an expectation that Congress will consider adding more money to the fund.\nHere's a look at six people's experience applying for a forgivable PPP loan.\n'Like throwing a rock out into the night'\nBrownstein is a restaurant operator and controller for five restaurants, which are owned by three different LLCs in Los Angeles. Combined, they employ 250 people, all of whom are now laid off.\nHe has spent days trying to apply for separate PPP loans for each restaurant at Chase Bank. On Tuesday afternoon, Chase sent him an email telling him to act quickly and submit his application online, noting that \"the digital application may require you to enter information similar to what you've already submitted.\"\nThe site kept crashing, he said.\nBut by late Tuesday afternoon, he was finally able to submit his loan applications.\nBrownstein said he was told that once they get through underwriting, \"money would move within three business days.\" But he was given no indication how long the underwriting would take. The whole process, he said, \"feels a bit like throwing a rock out into the night.\"\n'Do I bring my employees back on payroll and then let them go again?'\nAndrew and Briana Volk, owners of the Portland Hunt & Alpine Club, a cocktail bar in Portland, Maine, said without any financial assistance they have enough cash left to last another month. \"But only because we have a great relationship with our staff and creditors,\" Andrew said.\nThe good news: They learned Sunday in an email from Bangor Savings Bank that they were approved for a PPP loan. But it still has to close and they still have no idea when they'll see the funds.\nAndrew Volk had to close his cocktail bar in Portland, Maine, in mid-March and furlough his employees.\nThe Volks had to lay off their nine full-time employees and two part-timers when they shuttered the bar in mid-March. Under the terms of the loan, they'll hire them back. But since the loan only covers eight weeks of payroll expenses and some overhead, the question is \"Then what?\"\n\"Do I bring my employees back on payroll and then let them go again?,\" Andrew asked, noting that it's very possible his bar won't be able to reopen by then.\n'We lost out on our peak season'\nPaul Hollowell, owner of Lux Tan Spa in Dallas, was just about to start his peak season when he had to temporarily shutter his two locations on March 22. Combined, they employ 8 full-time and 8 part-time staff, all of whom have been furloughed.\n\"I would have loved to pay them during this period but because we lost out on our peak season and I'm still paying rent and utilities, I only had about one-and-a-half months of cash available to pay those bills [as of March 22],\" Hollowell said.\nAnd that cash is actually coming from a line of credit he had coincidentally taken out before the pandemic.\nHollowell tried to get all his documents in order before the loan program launched, so he'd be ready to go on April 3. He first approached BBVA bank, where he already had an SBA loan. But the bank told him he would also need a deposit account with them to use their online application portal. BBVA told him to check with Bank of America, where he had a business checking account. But Bank of America told him he would also need to have a loan with the bank.\nSo late Friday afternoon, a BBVA representative agreed to meet him at a closed branch so he could open a deposit account and then go home to submit a \"pre-application\" online.\nsuggestion that borrowers could get loan approval and the funds the On Saturday morning, he submitted payroll and tax records through the bank's web site. \"My banker says that I should expect to hear from them with additional information later this week,\" Hollowell said. But, he added, he doesn't expect to see the funds this week. That's a far cry from Treasury Secretary Steven Mnuchin'ssuggestion that borrowers could get loan approval and the funds the same day they apply.\n'The process is confusing'\nIt used to be all about the cake pops at Baked By Yael, which sits across the street from the National Zoo in Washington, DC. But with tourism gone, and big corporate events and birthday parties canceled, the bakery has shifted more resources into bagels and challah bread for its online business. It no longer accepts walk-in customers.\nYael Krigman, the bakery's owner, has 20 employees, a quarter of them full-time. She scrambled to be ready for the loan program's launch last Friday, but found the experience frustrating.\n\"Every time I submit my paperwork, the rules change or the SBA provides more clarification. My bank then relays the information to me, and I have to resubmit my paperwork. The process is confusing, but if I get accepted into the program, it will have been worth it,\" she said.\nOn Saturday, her lender, Revere Bank, asked her to submit one other form. On Monday, she was told the bank was ready to submit her application to the SBA. It couldn't tell her, however, if or when she would receive funding.\nKrigman feels supported by her lender and is happy with the service she's received, but also notes it's in Revere Bank's interest for her business not to go under, because she already has other loans there.\n'It was a very seamless process for us'\nAmy Wright, who owns Bitty & Beau, a coffee shop located in four states, said she has already received money from a PPP loan for her Wilmington, North Carolina, location.\nThe loan came from Live Oak Bank, where she has done business before. \"When they heard we had to close our shops, we got on their radar quickly. They walked us through the process so we were prepared when applications went live. They're a wonderful bank. It was a very seamless process for us. I know that's not the case with everybody,\" Wright said.\nAmy Wright's coffee shops across four states employ 120 people, all with intellectual or developmental disabilities.\nBitty and Beau is named after two of her children, both of whom have Down Syndrome. And all 120 employees -- including her eldest child, who has autism -- are people with intellectual or developmental disabilities.\nWright, who was honored as the 2017 CNN Hero of the Year , is optimistic she'll be able to get PPP loans for her other locations as well. In the meantime, she said, she and her husband, Ben -- who co-owns the business -- have leveraged themselves with personal loans to keep everything going.\n'I just don't really trust the programs'\nKelly Conklin, owner of Foley-Waite woodworking company in Kenilworth, New Jersey, has no interest in taking another loan he has to pay back. He knows the PPP loans are forgivable if used on payroll and overhead costs for the first eight weeks, but he still worries the rules could change when those eight weeks are up.\n\"I'm having a hard time believing it will be forgiven. I just don't really trust the programs,\" Conklin said.\nNevertheless, he applied at 4:30 pm Monday afternoon when his lender, Provident Bank, first started accepting applications online.\nHe'd been working days in advance with the help of his accounting firm to gather the documents he thought he'd need. But the process of applying on Monday still took him another two-and-a-half hours, he said.\n[W]e need to stop making everything we do in this crisis a reaction -- too late, too poorly designed, too sloppily executed, too small and too complicated.\" Kelly Conklin, owner, Foley-Waite\nConklin has had to furlough his 13 employees, but is still paying their health benefits. He estimates that if the company is paid all the money it's owed for completed jobs, he'll have a cash reserve that could keep the business afloat for 75 days. If those payments don't roll in, his cash reserves might cover 45 days.\nLike most business owners, he doesn't know what will happen to his business after the loan is used up.\n\"If countless small- and medium-sized companies are to survive, if we are serious about avoiding a depression, we need to stop making everything we do in this crisis a reaction -- too late, too poorly designed, too sloppily executed, too small and too complicated,\" Conklin said. \"Who is the economy's 'Dr. Fauci' that will provide a plan and the dedicated workforce that will execute it?\"", "url": "https://www.cnn.com/2020/04/08/success/small-business-frustration-loan-program/index.html"}