{"authors": [], "date_download": "2020-05-04 21:08:57", "date_modify": "2020-05-04 21:08:57", "date_publish": "2020-04-15 14:57:09", "description": "A waste systems company that’s proposed a 180-acre landfill near a New Hampshire state park has filed a defamation lawsuit against project opponents. Casella Waste Systems hasn’t yet filed...", "filename": "_725bd134c0d8c066024ed2e04065bd41_1588626537.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_725bd134c0d8c066024ed2e04065bd41_1588626537.html", "title": "Landfill company sues project opponents, alleges defamation", "title_page": "Landfill company sues project opponents, alleges defamation", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A waste systems company that’s proposed a 180-acre landfill near a New Hampshire state park has filed a defamation lawsuit against project opponents.\nCasella Waste Systems hasn’t yet filed an application for the landfill proposed in Dalton, near Forest Lake State Park.\nThe Caledonian-Record reports the lawsuit, filed in Merrimack County, alleges Jon Swan, the Forest Lake Association and Save Forest Lake disparaged the reputation of the company and CEO John Casella “by publishing and disseminating throughout the state of New Hampshire false statements of fact about the plaintiff online, in print, and in person.”\nSwan said, “I stand by everything I’ve done, and when I have made error, I correct it. I try to make sure everything I say is supported by fact and data. I stand by what I’ve said.”\nThe lawsuit asks for an injunction and order against the defendants saying they defamed the company, and damages.\nNearby Whitefield and Sugar Hill also have expressed their objections to the project, citing concerns of increase truck traffic, unwanted odors, and declining property values.\nBethlehem voters in 2017 and 2018 rejected a proposal to expand a 61-acre Casella landfill to 161 acres. The landfill’s scheduled to close in 2026.", "url": "https://apnews.com/725bd134c0d8c066024ed2e04065bd41"}