{"authors": [], "date_download": "2020-05-04 20:14:22", "date_modify": "2020-05-04 20:14:22", "date_publish": "2020-04-15 16:41:17", "description": "ALBUQUERQUE, N.M. (AP) — A New Mexico married couple have been arrested in Oklahoma after failing to appear in court for sentencing for financial crimes involving vulnerable clients of a...", "filename": "_5497a7072386d9a80da422cc72ab6d5e_1588623262.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5497a7072386d9a80da422cc72ab6d5e_1588623262.html", "title": "New Mexico couple who ducked sentencing arrested in Oklahoma", "title_page": "New Mexico couple who ducked sentencing arrested in Oklahoma", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "New Mexico couple who ducked sentencing arrested in Oklahoma\nALBUQUERQUE, N.M. (AP) — A New Mexico married couple have been arrested in Oklahoma after failing to appear in court for sentencing for financial crimes involving vulnerable clients of a non-defunct firm that offered guardianship services.\nSusan and William Harris were arrested Wednesday in Shawnee with the assistance of the Bernalillo County Sheriff’s Department, the U.S. Marshals Service’s office in New Mexico said.\nThe couple had pleaded guilty to conspiracy to commit money laundering, mail fraud, and aggravated identity theft.\nAuthorities said the couple used money transferred from accounts of Ayudando Guardians Inc. clients to pay over $11 million in credit card charges made by the defendants and family members.\nA judge issued arrest warrants for the couple last month.\nA co-defendant, 64-year-old Sharon Moore, was sentenced on March 2 to 20 years in prison after previously pleading guilty to conspiracy and financial crimes.\nSusan Harris faced at least 30 years in prison when they fled, while William Harris faced seven years. They pleaded guilty last year.\nThe couple had been free pending sentencing after surrendering their passports and putting up their home in an affluent Albuquerque neighborhood as security.\nTheir son, Craig M. Young, awaits sentencing in June after pleading guilty November 12, 2019.", "url": "https://apnews.com/5497a7072386d9a80da422cc72ab6d5e"}