{"authors": [], "date_download": "2020-05-04 20:23:07", "date_modify": "2020-05-04 20:23:07", "date_publish": "2020-04-16 20:54:58", "description": "SPOKANE, Wash. (AP) — Gonzaga has added a graduate transfer from Southern Illinois and signed the highest-rated high school player in the basketball program's history. The team said Thursday...", "filename": "_be5634c8fea68e83cecf58a8c9efecf1_1588623787.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_be5634c8fea68e83cecf58a8c9efecf1_1588623787.html", "title": "Gonzaga adds graduate transfer, highly rated recruit", "title_page": "Gonzaga adds graduate transfer, highly rated recruit", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SPOKANE, Wash. (AP) — Gonzaga has added a graduate transfer from Southern Illinois and signed the highest-rated high school player in the basketball program’s history.\nThe team said Thursday that Southern Illinois point guard Aaron Cook will be eligible to play next season.\nThe 6-foot-2 Cook played in just six games last season before breaking his shooting hand against Murray State. He will receive a medical red shirt that allows him to play next season, the team said.\nCook was leading the Salukis in scoring (15 points per game) and assists (3.3) when his season was cut short. He was shooting 55.2% from the field.\nMeanwhile, the signing of 6-foot-5, 195-pound guard Jalen Suggs from St. Paul, Minnesota, wrapped up perhaps the best recruiting class in program history. Suggs ranks fifth on ESPN’s Top-100 list in the class of 2020.\nSuggs averaged 23.5 points per game during his senior season at Minnehaha Academy. He also averaged 7.3 rebounds, 5.1 assists and 3.8 steals.\nSuggs is only the second recruit in Gonzaga history to be named a McDonald’s All-American, joining former Zag Zach Collins. Suggs was also one of five finalists for Naismith High School Boys National Player of the Year.\nThe two players join a Gonzaga team that finished 31-2 last season and qualified for a 22nd straight appearance in the NCAA Tournament, which was canceled this year.", "url": "https://apnews.com/be5634c8fea68e83cecf58a8c9efecf1"}