{"authors": ["Jamie Gangel", "Caroline Kelly"], "date_download": "2020-05-04 16:56:31", "date_modify": "2020-05-04 16:56:31", "date_publish": "2020-04-08 22:02:44", "description": "Linda Tripp, who secretly recorded her conversations with Monica Lewinsky about the then-intern's relationship with President Bill Clinton in the White House, has died, according to her mother, Inge Carotenuto, and her former attorney, Joseph Murtha.", "filename": "2020_04_08_politics_linda-tripp-dead_index_1588611391.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408155215-linda-tripp-july-9-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_linda-tripp-dead_index_1588611391.html", "title": "Linda Tripp, whose tapes were pivotal in Clinton impeachment scandal, dies", "title_page": "Linda Tripp, whose tapes were pivotal in Clinton impeachment scandal, dies - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Linda Tripp, who secretly recorded her conversations with Monica Lewinsky about the then-intern's relationship with President Bill Clinton in the White House, has died, according to her mother, Inge Carotenuto, and her former attorney, Joseph Murtha.\nCarotenuto told CNN that Tripp had been diagnosed with late stage pancreatic/lymph node cancer in the last few days. Tripp had previously been treated for breast cancer. She was 70.\nTripp, a friend of Lewinsky's at the time, turned the 20 hours of tapes over to special prosecutor Kenneth Starr. The scandal ultimately led to Clinton's impeachment for perjury and obstruction of justice, though he was ultimately acquitted in the Senate.\nLewinsky, despite their prior experiences, expressed well wishes to Tripp as reports indicated Wednesday that her health was failing.\n\"(No) matter the past, upon hearing that linda tripp is very seriously ill, i hope for her recovery. i can't imagine how difficult this is for her family,\" Lewinsky tweeted.\nRead More", "url": "https://www.cnn.com/2020/04/08/politics/linda-tripp-dead/index.html"}