{"authors": ["Jack Guy"], "date_download": "2020-05-04 16:01:01", "date_modify": "2020-05-04 16:01:01", "date_publish": "2020-04-01 15:21:49", "description": "Up until now, scientists believed that humans were the only animals that worked together, synchronizing their actions and noises with their friends. But some new research shows that male bottlenose dolphins do it, too.", "filename": "2020_04_01_world_bottlenose-dolphins-teamwork-scli-intl-scn_index_1588608061.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401095350-02-allied-male-dolphins-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_world_bottlenose-dolphins-teamwork-scli-intl-scn_index_1588608061.html", "title": "Male bottlenose dolphins form gangs to get a mate", "title_page": "Male bottlenose dolphins form gangs to get a mate - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) If you've ever seen a production of \"West Side Story,\" you'll be familiar with gangs of males, clicking their fingers in synch while seeing off rivals or prowling for a mate.\nUp until now, scientists believed that humans were the only animals that worked together, synchronizing their actions and noises with their friends. But some new research shows that male bottlenose dolphins do it, too.\nWhile many male animals coordinate their calls or displays as part of a rivalry -- for example, the flashing of fireflies -- humans and dolphins are the only species that do it in order to cooperate, a team of researchers from the Universities of Western Australia and Bristol in the UK has found.\nThree allied males are pictured here swimming behind a female.\nScientists had already observed the bottlenose dolphins in Shark Bay, Western Australia synchronizing their movements -- swimming, leaping and surfacing at the same time.\nThe new research finds that they match sounds to their movements, much like humans dancing or marching to music, according to a press release from the University of Bristol.\nThe findings, published in the journal Proceedings of the Royal Society B, show how important this coordination is in allowing male bottlenose dolphins to reproduce.\nIn order to fertilize a female, the males form groups of 4-14 individuals, made up of smaller alliances of two or three dolphins, according to the paper.\n\"They stay in these alliances their entire lives,\" researcher Stephanie King, a behavioral biologist at the University of Bristol's School of Biological Sciences, told CNN, despite the fact that the individual members aren't related.\nKing explained that individual male dolphins that aren't part of an alliance wouldn't be able to fertilize a female, and pairs or trios from the same larger alliance may compete for females.\nThey use synchronized movements to maintain social bonds and show their strength to rival groups.\n\"It shows alliance unity,\" said King.\nThe researchers wanted to see whether the alliances also synchronized their sounds, so they recorded the dolphins using microphones dragged through the water behind a small boat.\nBetween 2016 and 2018, they recorded 59 dolphins from seven different alliances, capturing sounds known as \"pops.\"\nAfter analyzing pop sequences from five pairs of dolphins, the researchers found that four pairs changed the tempo of their sounds to match their partner's.\nOnly males make these sounds, and they only make them when they are herding a female in order to fertilize her.\nThe pops are used to defend the female against attacks from rivals and issue a warning to her if she swims too far from the males, King said.\nIn humans, coordinated behavior, such as marching or dancing, promotes bonding, thanks to the release of the hormone oxytocin. King says the effect may be similar in dolphins.\n\"Such synchronous and coordinated behaviour between allied males may therefore promote cooperative behaviour and regulate stress, as it has been shown to do in humans,\" said King in the press release.\nDuring the next stage of the research the scientists will play recordings of the pop sounds to both male and female dolphins to see how they react, King said.\nThen the team will investigate whether synchronized behavior affects success in mating.\nRight now, scientists aren't sure if each male in an alliance mates with the female repeatedly during herding, or if only one of them gets the chance.\nHowever, research shows that each male in a long-term alliance appears to father a similar number of babies.\nThe team want to build on their research to see if certain pop sounds mean some groups are more successful at mating than others.", "url": "https://www.cnn.com/2020/04/01/world/bottlenose-dolphins-teamwork-scli-intl-scn/index.html"}