{"authors": ["Josh Funk"], "date_download": "2020-05-04 20:18:35", "date_modify": "2020-05-04 20:18:35", "date_publish": "2020-04-08 19:20:47", "description": "OMAHA, Neb. (AP) — Flooding remains a concern in several states along the Missouri River, even though the weather has been kind so far this spring, according to the National Weather...", "filename": "_e16b24f70c2ec5328ecf217cbfea67d3_1588623515.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b751df32e28049908cba70d6fb8ad5dd/2213.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e16b24f70c2ec5328ecf217cbfea67d3_1588623515.html", "title": "Flood risk remains a concern along eastern Missouri River", "title_page": "Flood risk remains a concern along eastern Missouri River", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Oct. 22, 2019 photo, a barn sits in floodwaters in Pacific Junction, Iowa. Flooding remains a concern in several states along the Missouri River even though the weather has been kind so far this spring. The flood risk remains high in eastern South Dakota, eastern North Dakota, eastern Nebraska, western Iowa, eastern Kansas and Missouri because the soil remains wet, but the lack of rain and warm temperatures this spring allowed snow to melt gradually across the Plains without worsening the risk. (AP Photo/Nati Harnik File)\nFILE - In this Oct. 22, 2019 photo, a barn sits in floodwaters in Pacific Junction, Iowa. Flooding remains a concern in several states along the Missouri River even though the weather has been kind so far this spring. The flood risk remains high in eastern South Dakota, eastern North Dakota, eastern Nebraska, western Iowa, eastern Kansas and Missouri because the soil remains wet, but the lack of rain and warm temperatures this spring allowed snow to melt gradually across the Plains without worsening the risk. (AP Photo/Nati Harnik File)\nOMAHA, Neb. (AP) — Flooding remains a concern in several states along the Missouri River, even though the weather has been kind so far this spring, according to the National Weather Service.\nThe agency said Wednesday that the flood risk is high in eastern South Dakota, eastern North Dakota, eastern Nebraska, western Iowa, eastern Kansas and Missouri because the soil remains wet. However, a lack of rain and the warm temperatures this spring has allowed snow to melt gradually across the Plains without increasing the risk.\nThe U.S. Army Corps of Engineers has trimmed its forecast for how much water will flow down the Missouri River in 2020, but it is still expected to be a wet year.\n“We still are looking at above-average risk, but things are improving,” said Kevin Low, a National Weather Service hydrologist at the Missouri River Basin River Forecast Center. “The soil moisture conditions are slowly improving. It’s getting drier, and the fact that we haven’t had any rain is a godsend.”\nIt helped that the ground didn’t remain frozen deep into March across the region, and there were few problems related to ice jams along the Missouri River and its tributaries, Low said.\n“We are in a lot better shape than I thought we would be two months ago,” Low said.\nEven if the weather remains mild, some places could still see flooding. Many levees are still in need of repairs after last year’s massive flooding , particularly in Kansas and Missouri. If there is significant rainfall in the coming months, the Corps could increase releases from upstream dams on the river to prevent the reservoirs from overflowing.\nMuch of the land in low-lying areas near the Missouri River is cropland, so that often floods first, limiting damage to homes and businesses.\nThe Corps now estimates 2020 runoff will be 35.5 million acre feet (43.8 cubic kilometers), which would rank in the top 10% of the wettest years in the past 122 years. That is down slightly from last month’s forecast of 36.9 million acre-feet (45.5 cubic kilometers). The highest runoff year was 2011 with 61 million acre-feet (75.2 cubic kilometers), followed by 2019, with 60.9 million acre-feet (75.1 cubic kilometers).\nSeveral of the rivers that flow into the Missouri River remain high, such as the James and Big Sioux rivers in South Dakota.\nMountain snowpack has yet to melt and flow into the river. The mountain snowpack is slightly above average so far this year. Low said at this stage it doesn’t appear the snowpack will create problems along the Missouri River.\nSeparately, fears of significant flooding along the Red River in North Dakota that were stoked by record rain fall and early winter precipitation have fallen by the wayside thanks, in part, to a slow spring thaw.\nModerate flooding, particularly in Grand Forks and other northern areas, has closed some bridges and roads and “an extended period” of moderate to major flooding is expected along the Red’s tributaries, the weather service said. Fargo, North Dakota, and Moorhead, Minnesota, suffered millions of dollars worth of damage in the record 2009 Red River flood, but has not suffered any serious losses since.\n___\nAssociated Press writer Dave Kolpack contributed to this report from Fargo, North Dakota.", "url": "https://apnews.com/e16b24f70c2ec5328ecf217cbfea67d3"}