{"authors": ["General Assignment Reporter"], "date_download": "2020-05-04 20:22:27", "date_modify": "2020-05-04 20:22:27", "date_publish": "2020-04-28 18:41:27", "description": "The \"Tonight Show\" host's crush on his \"Almost Famous\" co-star wasn't unrequited.", "filename": "entry_kate-hudson-jimmy-fallon-almost-famous_n_5ea85225c5b69600887cf47e_1588623747.html", "image_url": "https://img.huffingtonpost.com/asset/5ea866673000009a111550f8.png?cache=rnft7ntzkw&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_kate-hudson-jimmy-fallon-almost-famous_n_5ea85225c5b69600887cf47e_1588623747.html", "title": "Kate Hudson To Jimmy Fallon: If You'd Made A Move, I Would Have Gone There", "title_page": "Kate Hudson To Jimmy Fallon: If You'd Made A Move, I Would Have Gone There | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Jimmy Fallon and Kate Hudson were almost romantic while working on “Almost Famous.”\nBut on “The Tonight Show” Monday, Hudson made it clear that she was waiting for Fallon to take their friendship to the next level.\nHudson told the flustered host he gave no indication of wanting more, even though, as Fallon recalled, they were good together and hung out all the time.\n“Jimmy, if you would have actually made a move, I would have totally gone there,” she said in the online interview.\n“No, you wouldn’t,” Fallon replied.\n“I remember thinking to myself, like, ‘Why has Jimmy never made, like, a move?’ And then I just kind of realized, ‘Oh, he’s not into me like that,’” Hudson said.\nFallon had confessed on his show in 2018 that he once had a thing for Hudson. But on Monday, he disputed Hudson’s retelling of events and added, “Everything turned out perfect.”\nAnyway, Hudson said she later met her future husband, Black Crowes singer Chris Robinson. She divorced Robinson in 2007 and is now dating musician Danny Fujikawa.\nFallon married producer Nancy Juvonen in 2007.\nHudson playfully wondered what could have been if Fallon had been just a bit bolder. “Who knows?” she said. “Our whole life trajectory could have been different.”", "url": "https://www.huffpost.com/entry/kate-hudson-jimmy-fallon-almost-famous_n_5ea85225c5b69600887cf47e"}