{"authors": ["Anna Bahney", "Cnn Business"], "date_download": "2020-05-04 15:56:47", "date_modify": "2020-05-04 15:56:47", "date_publish": "2020-04-15 18:12:25", "description": "Early Monday morning, Kimberly Horton got a text notification from her bank that her account had received a deposit from the Internal Revenue Service for $1,700. A wave of relief came over her: the stimulus money had arrived.", "filename": "2020_04_15_success_stimulus-payment-arrived-coronavirus_index_1588607807.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200415052510-stimulus-arrived-coronavirus-kimberly-horton-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_15_success_stimulus-payment-arrived-coronavirus_index_1588607807.html", "title": "She got her stimulus payment. Here's how she plans to use it", "title_page": "She got her stimulus payment. Here's how she plans to use it - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Early Monday morning, Kimberly Horton got a text notification from her bank that her account had received a deposit from the Internal Revenue Service for $1,700. A wave of relief came over her: the stimulus money had arrived.\n\"Getting that stimulus money was a lifesaver for me,\" she said. \"It took so much stress away.\"\nHorton qualified for the full $1,200 payment for a single person, and she received an additional $500 for her 13-year-old son.\nThe maximum payment for a single person is $1,200 and for couples $2,400. Payments also include $500 per child under 17. Eligibility for the one-time payment is based on income and excludes people earning more than $99,000 and married couples earning more than $198,000. Those who can be claimed as a dependent for tax purposes, like many college students, are ineligible for the payments, as well as undocumented immigrants who don't have Social Security numbers.\nAs soon as the money hit Horton's account, she began putting it to use.\nNow, to spend it\nHorton, a payroll administrator in Jackson, Mississippi, is still able to work, mostly from home and has not seen her income reduced. But her daughter, Tyra, a college student at Mississippi State University who was not eligible for a payment because she is older than 17 and claimed as a dependent, lost her retail job in early March and with it, her ability to pay bills.\nTyra, who studies veterinary medicine, stayed in her apartment near the university even though classes are now virtual, to provide care for the animals in her program. She was able to make her April rent, but May's rent looks daunting and bills are piling up.\n\"It is hard to keep her afloat right now and keep my son and I in good shape,\" Horton said. \"But I was able to send her money as soon as I saw it come in.\"\nKimberly Horton received a stimulus payment of $1,700 on Monday.\nHorton immediately sent her daughter half of her $1,700 payment so she can catch up on bills and for food.\nShe didn't want her daughter falling behind on things like her phone bill or car insurance. \"They are waiving fees, but you still have to pay it,\" she said.\nHorton is holding the remaining $850 in reserve because her daughter will likely need it to pay her $625 rent in May. The remainder, she said, will go toward her increased food costs since she and her son are now home for all their meals.\nWhen can you expect your payment?\nreceiving their payments as soon as April 15. Many Americans typically pay their taxes by April 15th, but the due date has been extended to July 15th this year. Those who qualify for the stimulus payments and who are authorized for direct deposit with the IRS should startreceiving their payments as soon as April 15.\nHorton was surprised to receive her stimulus money before the 15th.\n\"I was expecting the payment, but I had been hearing it would arrive on the 15th,\" she said.\nShe got the money on Monday because she has an account with Chime, an online banking company that advances its users direct deposits days before the money would ordinarily become available.\nBut not everyone will receive their payments this week.\nPeople who have filed tax returns, but did not authorize direct deposit payment are expected to begin to receive paper checks next week with the roll out lasting weeks\nIf you do not normally file a tax return because you don't earn enough or were not otherwise required to, the IRS has revised guidance and launched a new online tool to help you input some basic information and receive the stimulus money.\nTo find the status of your payment, the IRS created Get My Payment , which shows when your payment is expected.\nHorton said while the money has been a huge help, it's not likely to be enough to cover most people's financial problems for long.\n\"It comes hard and it goes easy,\" she said.", "url": "https://www.cnn.com/2020/04/15/success/stimulus-payment-arrived-coronavirus/index.html"}