{"authors": [], "date_download": "2020-05-04 20:20:34", "date_modify": "2020-05-04 20:20:34", "date_publish": "2020-04-16 22:57:37", "description": "OMAHA, Neb. (AP) — A former basketball coach at a private Omaha girls’ high school has been sentenced to 20 to 30 years in prison for sexually assaulting a freshman player at the school years ago....", "filename": "_98898d0ffd343b366a0fba21b4109bb5_1588623634.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_98898d0ffd343b366a0fba21b4109bb5_1588623634.html", "title": "Ex-basketball coach sentenced for sexually assaulting teen", "title_page": "Ex-basketball coach sentenced for sexually assaulting teen", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "OMAHA, Neb. (AP) — A former basketball coach at a private Omaha girls’ high school has been sentenced to 20 to 30 years in prison for sexually assaulting a freshman player at the school years ago.\nThe Omaha World-Herald reports that 34-year-old Andrea Lightfoot Knecht, who appeared via videoconference from her attorneys’ conference room, broke into tears Thursday at her sentencing. Knecht, who’d had a stellar basketball career at Marian and Idaho State University, now is the mother of a toddler. She had entered a no contest plea in January.\nShe will have to serve 10 years before she is eligible for parole.\nProsecutors said Knecht abused the girl at Omaha Marian during the 2012-13 school year, when the girl was 14 and 15 and a member of the basketball team. The case came to the attention of police when she took to social media last year to accuse her former high school of covering up her assault.\nThat prompted the principal to dig into personnel files and report the matter to authorities. It also raised questions about why Marian officials didn’t report the assault in 2013.\nA former Marian official said she fired Knecht immediately for improperly communicating with a student, but said she didn’t report the relationship because she wasn’t told that it was sexual in nature.\nAt the hearing, the girl’s mother said her daughter is in therapy.", "url": "https://apnews.com/98898d0ffd343b366a0fba21b4109bb5"}