{"authors": ["Caroline Kelly"], "date_download": "2020-05-04 17:03:30", "date_modify": "2020-05-04 17:03:30", "date_publish": "2020-04-10 22:39:35", "description": "Democratic Virginia Gov. Ralph Northam signed bills on Friday rolling back multiple abortion restrictions in the state, including some that had been in place for decades.", "filename": "2020_04_10_politics_virginia-abortion-protections_index_1588611810.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200305160614-11-week-in-photos-0306-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_virginia-abortion-protections_index_1588611810.html", "title": "Virginia governor signs abortion protections into law", "title_page": "Virginia governor signs abortion protections into law - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Democratic Virginia Gov. Ralph Northam signed bills on Friday rolling back multiple abortion restrictions in the state, including some that had been in place for decades.\nThe new laws make Virginia the first state to codify new abortion protections in 2020, according to Elizabeth Nash, the senior state issues manager at the Guttmacher Institute, a reproductive health think tank.\nThe legislation removes longstanding regulations requiring abortion seekers to undergo an ultrasound at least 24 hours prior to receiving an abortion and to get counseling on alternatives to abortion. It also strikes the requirement that facilities providing more than five abortions per year be designated as hospitals.\n\"No more will legislators in Richmond -- most of whom are men -- be telling women what they should and should not be doing with their bodies,\" Northam said in a statement, adding that the legislation \"will make women and families safer, and I'm proud to sign it into law.\"\nRead More", "url": "https://www.cnn.com/2020/04/10/politics/virginia-abortion-protections/index.html"}