{"authors": ["Overnight Editor"], "date_download": "2020-05-04 20:23:49", "date_modify": "2020-05-04 20:23:49", "date_publish": "2020-04-30 04:53:58", "description": "Richard Wilkerson had served on Graham's short-lived presidential campaign. Now he's backing the senator's rival, Jaime Harrison.", "filename": "entry_lindsey-graham-donor-switches-sides_n_5eaa48cdc5b6edf4130e1989_1588623829.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa54dc3000003012155289.jpeg?cache=aflnylsu1w&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_lindsey-graham-donor-switches-sides_n_5eaa48cdc5b6edf4130e1989_1588623829.html", "title": "Top Lindsey Graham Donor Switches Sides, Now Backs Democratic Rival", "title_page": "Top Lindsey Graham Donor Switches Sides, Now Backs Democratic Rival | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "A top donor to Sen. Lindsey Graham (R-S.C.) is switching sides.\nRichard Wilkerson, former head of Michelin’s North America unit, based in Greenville, South Carolina, has endorsed Democrat Jaime Harrison.\nWilkerson told the Charleston Post and Courier that he got to know Harrison when he worked as a lobbyist for the company on issues such as setting new tire standards for better fuel efficiency and reduced greenhouse gas emissions.\nThe newspaper said Wilkerson has contributed more than $10,000 to Graham since 2011 and served on the South Carolina finance committee of his brief attempt at running for president in 2015.\nWilkerson told The Hill in a statement that Harrison will be a “tireless advocate” for improving the economy, healthcare and job training.\n“Jaime is the perfect candidate to bring together South Carolinians from all walks of life,” he said. “I am proud to endorse Jaime today, and I know first hand he is the change South Carolina needs.”\nThe website noted that, despite his longtime support for Graham, Wilkerson has donated to Democrats and Republicans alike over the years.\nHarrison celebrated the endorsement on Twitter:\nEven @LindseyGrahamSC’s strongest supporters know he’s forgotten about them and that it’s time for change.\nDick Wilkerson brought jobs and opportunity to SC during his time at Michelin. Grateful for his support. Together, we’re going to #SendLindseyHome!https://t.co/KT7LPtUTLi — Jaime Harrison (@harrisonjaime) April 28, 2020\nGraham has won by double-digit margins in each of his three previous Senate races on the solid red state. There is little polling in his 2020 race so far; a partisan poll in March showed Harrison trailing him by just 4 percentage points, but a Marist College poll in February had Graham up by 17 points, according to FiveThirtyEight.\nCook Political Report rates the seat a “Solid R.”\nBut though Graham leads in limited polls, Harrison is outraising him this year so far, bringing in $7.36 million over the first three months versus $5.6 million for Graham.", "url": "https://www.huffpost.com/entry/lindsey-graham-donor-switches-sides_n_5eaa48cdc5b6edf4130e1989"}