{"authors": [], "date_download": "2020-05-04 20:03:38", "date_modify": "2020-05-04 20:03:38", "date_publish": "2020-04-07 13:58:07", "description": "FORT MADISON, Iowa (AP) — A judge has ordered DNA testing on a hat left at the scene of a fatal 1976 shooting that an Iowa inmate hopes will prove he has been wrongly imprisoned for...", "filename": "_e20d82641297b2c68038fe6795758f50_1588622618.html", "image_url": "https://storage.googleapis.com/afs-prod/media/2a367961ba974ae98dbe579003a294ab/500.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e20d82641297b2c68038fe6795758f50_1588622618.html", "title": "Judge grants Iowa inmate's request for DNA test in 1976 case", "title_page": "Judge grants Iowa inmate's request for DNA test in 1976 case", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This undated photo released by the Iowa Department of Corrections shows Gentric Hicks, an inmate at the Anamosa State Penitentiary in Anamosa, Iowa. Lawyers for Hicks, 73, maintain that he was wrongly convicted of first-degree murder in 1977 and are seeking DNA testing on an orange hunting cap that the killer left at the crime scene. (Iowa Department of Corrections via AP) This undated photo released by the Iowa Department of Corrections shows Gentric Hicks, an inmate at the Anamosa State Penitentiary in Anamosa, Iowa. Lawyers for Hicks, 73, maintain that he was wrongly convicted of first-degree murder in 1977 and are seeking DNA testing on an orange hunting cap that the killer left at the crime scene. (Iowa Department of Corrections via AP)\nFORT MADISON, Iowa (AP) — A judge has ordered DNA testing on a hat left at the scene of a fatal 1976 shooting that an Iowa inmate hopes will prove he has been wrongly imprisoned for decades.\nJudge John Wright ordered the orange hunting cap shipped to a Virginia laboratory for testing that could show whether Gentric Hicks or someone else was responsible for the killing at a Fort Madison motel.\nScientists will seek to extract genetic material from inside the cap to create a DNA profile that could be compared to Hicks. Results from the Bode Cellmark laboratory could be available in coming months.\nIowa has never had an inmate exonerated by DNA evidence.\nHicks, 73, is serving life for the May 1976 slaying of 28-year-old Jerry Foster at the Hill Crest Motel, which was owned by Foster’s parents.\nA man robbing the motel shot and killed Foster and fled on foot, leaving behind the cap.\nAn accomplice initially implicated Hicks’ half brother as the shooter. Hours later, the man changed his story and said Hicks was responsible.\nThe Midwest Innocence Project and the state’s wrongful conviction unit are representing Hicks, who is an inmate at the Anamosa State Penitentiary. Lee County prosecutors didn’t oppose their request for DNA testing.", "url": "https://apnews.com/e20d82641297b2c68038fe6795758f50"}