{"authors": ["Jacqueline Howard"], "date_download": "2020-05-04 16:03:13", "date_modify": "2020-05-04 16:03:13", "date_publish": "2020-04-01 16:40:30", "description": "The US Food and Drug Administration is requesting that manufacturers pull all prescription and over-the-counter ranitidine drugs, known by the brand name Zantac, from the market immediately, the agency announced on Wednesday.", "filename": "2020_04_01_health_zantac-fda-remove-from-market-bn_index_1588608193.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190930134533-01-zantac-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_health_zantac-fda-remove-from-market-bn_index_1588608193.html", "title": "Zantac products should be pulled from market immediately, FDA says", "title_page": "Zantac products should be pulled from market immediately, FDA says - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The US Food and Drug Administration is requesting that manufacturers pull all prescription and over-the-counter ranitidine drugs, known by the brand name Zantac, from the market immediately, the agency announced on Wednesday.\nThe FDA noted that an ongoing investigation has determined that levels of a contaminant in the heartburn medications increase over time and when stored at higher-than-normal temperatures, pose a risk to public health.\nThe contaminant, N-nitrosodimethylamine or NDMA, is a probable human carcinogen and the FDA has been investigating levels of it in ranitidine since the summer of 2019.\n\"We didn't observe unacceptable levels of NDMA in many of the samples that we tested,\" Dr. Janet Woodcock, director of the FDA's Center for Drug Evaluation and Research, said in Wednesday's announcement.\n\"However, since we don't know how or for how long the product might have been stored, we decided that it should not be available to consumers and patients unless its quality can be assured,\" Woodcock said in part. \"The FDA will continue our efforts to ensure impurities in other drugs do not exceed acceptable limits so that patients can continue taking medicines without concern.\"", "url": "https://www.cnn.com/2020/04/01/health/zantac-fda-remove-from-market-bn/index.html"}