{"authors": ["Scottie Andrew"], "date_download": "2020-05-04 15:56:25", "date_modify": "2020-05-04 15:56:25", "date_publish": "2020-04-15 14:24:12", "description": "In an act of social media solidarity with high school seniors who are finishing out their final semester at home, Facebook users are sharing their own senior photos with the hashtag #ClassOf2020.", "filename": "2020_04_15_tech_facebook-senior-photo-scam-trnd_index_1588607785.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190520145446-01-graduation-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_15_tech_facebook-senior-photo-scam-trnd_index_1588607785.html", "title": "Here's why you probably shouldn't share your old senior photos on Facebook", "title_page": "Here's why you probably shouldn't share your old senior photos on Facebook - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) In an act of social media solidarity with high school seniors who are finishing out their final semester at home, Facebook users are sharing their own senior photos with the hashtag #ClassOf2020.\nIt's a sweet sentiment, sure, but beware: Your post could help potential hackers crack into your private accounts, according to the Better Business Bureau , a nonprofit that tracks, among other things, internet scams.\nMalevolent scammers can scan sites for this hashtag and find the name of your high school and your graduating year -- two common online security questions. And if your social media account isn't locked up, they can find out a lot more about you.\nHackers looking to break into your private accounts could use any piece of information you share in a viral challenge, the bureau said: Your favorite TV shows and the makes and models of all the cars you've owned are two examples.\nSo before you share, the bureau suggests you tighten your security settings so strangers can't find your information as easily and regularly change the security questions you use to access online banking and other services.\nRead More", "url": "https://www.cnn.com/2020/04/15/tech/facebook-senior-photo-scam-trnd/index.html"}