{"authors": ["Paul R. La Monica", "Cnn Business"], "date_download": "2020-05-04 16:07:58", "date_modify": "2020-05-04 16:07:58", "date_publish": "2020-04-02 15:09:05", "description": "Luckin Coffee has become a phenomenon in China -- and with Wall Street investors -- due to stunning growth. But it turns out some of its sales may have been fake.", "filename": "2020_04_02_investing_luckin-coffee-accounting-probe-stock_index_1588608478.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402093659-luckin-coffee-beijing-0324-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_investing_luckin-coffee-accounting-probe-stock_index_1588608478.html", "title": "Luckin Coffee stock plunges 80% on accounting probe", "title_page": "Luckin Coffee stock plunges 80% on accounting probe - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Luckin Coffee has become a phenomenon in China -- and with Wall Street investors -- due to stunning growth. But it turns out some of its sales may have been fake.\nLuckin Coffee LK Shares ofplunged 80% in early trading Thursday after the company disclosed in a regulatory filing with the Securities and Exchange Commission that its board had formed a committee to look into accounting irregularities.\nLuckin said in the filing that beginning in the second quarter of 2019, chief operating officer Jian Liu and several of his direct reports \"had engaged in certain misconduct, including fabricating certain transactions.\" Luckin said Liu has since been suspended.\nThe company added that the fabricated transactions amounted to about 2.2 billion yuan (approximately $310 milion US) from the second quarter to the fourth quarter of last year.\n\"Certain costs and expenses were also substantially inflated by fabricated transactions during this period,\" Luckin added in the SEC filing.", "url": "https://www.cnn.com/2020/04/02/investing/luckin-coffee-accounting-probe-stock/index.html"}