{"authors": [], "date_download": "2020-05-04 16:28:07", "date_modify": "2020-05-04 16:28:07", "date_publish": "2020-02-11 21:06:02", "description": "If you're a longtime Delta loyalist, or if you're considering flying the airline more often, it's worth understanding which Delta credit cards will serve you best.", "filename": "2020_02_11_cnn-underscored_best-delta-credit-cards_index_1588609687.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200302180827-underscored-delta-credit-cards-personal-revised-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_02_11_cnn-underscored_best-delta-credit-cards_index_1588609687.html", "title": "The best credit cards for Delta flyers in 2020", "title_page": "Best Delta credit card offers for 2020: Rewards & benefits - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through The Points Guy affiliate network if you apply and are approved for a card, but our reporting is always independent and objective.\nWhile you're undoubtedly not thinking much about travel at the moment, when planes return to the skies, you may find yourself on the road again. And Delta has been a strong performer in recent years.\nThe airline is widely revered for its best-in-class seatback entertainment screens (with free content for all), ample power ports on most jets, and Wi-Fi on the majority of its flights. Plus, the carrier paid out $1.6 billion in profit-sharing bonuses to employees this year, which leads to flight crews who are actually happy to see you board.\nSo if you're a longtime Delta loyalist, or you're considering flying the airline more often when travel returns to normal, it's worth understanding which Delta credit cards will serve you best as you fly, especially since there are seven Delta credit cards now available. Here's our list of the best Delta credit cards of 2020:\nThe best Delta credit cards of 2020\nDelta SkyMiles® Blue American Express Card: Best Delta credit card with no annual fee\nDelta SkyMiles® Gold American Express Card: Best for occasional Delta flyers\nDelta SkyMiles® Platinum American Express Card: Best for regular Delta flyers\nDelta SkyMiles® Reserve American Express Card: Best Delta companion certificate\nThe Platinum Card® from American Express: Best for Delta lounge access\nDelta SkyMiles® Gold Business American Express Card: Best for business owners who fly Delta\nDelta SkyMiles® Platinum Business American Express Card: Best for Delta business travelers\nDelta SkyMiles® Reserve Business American Express Card: Best for Delta road warriors\nHow do these Delta credit cards compare with each other, and why is the Amex Platinum on our list? Let's break down the pros and cons of each, while also exploring this alternative card that includes Delta lounge access.\nBest Delta credit card with no annual fee: Delta SkyMiles Blue Amex\nIf you normally don't fly Delta that often — even when travel isn't disrupted — and just want to earn Delta SkyMiles without paying an annual fee, the Delta Blue Amex is a basic, no-frills Delta credit card. With 2 miles earned for every dollar you spend at restaurants worldwide, access to Delta's Pay with Miles program, and no foreign transaction fees, this card actually has a decent number of features for an airline credit card in the no-annual-fee camp.\nPeople who check bags on Delta for at least two trips each year will want a more powerful Delta credit card, since the Delta Blue Amex doesn't have a checked bag fee waiver. But for the once-in-a-while traveler, Delta's no-annual-fee credit card may be worth considering, especially right now while it has a limited-time welcome offer.\nYou can also earn 10,000 bonus miles after you spend $500 in purchases on your new Delta Blue Amex card in your first three months after opening your account. Based on the points valuations of CNN Underscored's partner The Points Guy, Delta SkyMiles are worth 1.2 cents apiece, meaning these 10,000 bonus miles are worth $120.\nBest for occasional Delta flyers: Delta SkyMiles Gold Amex\nThe Delta Gold Amex credit card offers a first checked bag free on all Delta flights.\nThe Delta Gold Amex credit card has no annual fee the first year, and then a $99 annual fee starting at your first renewal, so you can try out the card for a year to see if it's right for you.\nThis version of the card also carries a welcome bonus of 35,000 bonus miles after you spend $1,000 in purchases on your new card in your first three months after opening the account. That's worth a decent $420 based on The Points Guy's point valuations.\nWith the Delta Gold Amex, you'll receive 2 miles per dollar at restaurants and US supermarkets, plus up to $100 in Delta flight credit after spending $10,000 in a calendar year. In other words, people who can put $834 per month in purchases on this card can essentially offset the entire annual fee with the flight credit.\nYou'll also get your first checked bag free on all Delta flights with this card, which further whittles down the net cost of carrying the card, and 20% inflight savings on purchases made while flying Delta. However, it's worth noting that this card lacks the Delta Medallion Qualification Dollars (MQD) elite status waiver found on other higher-end Delta credit cards, and it won't grant you discounted access to Delta Sky Club lounges.\nBest for regular Delta flyers: Delta SkyMiles Platinum Amex\nThe newly revamped Delta Platinum Amex credit card currently features a welcome bonus of 40,000 bonus miles and 5,000 Medallion Qualification Miles (MQMs) after you spend $2,000 in purchases on your new card in your first three months after opening the account, plus a $100 statement credit after you make a Delta purchase with your new card within your first three months.\nThose 40,000 miles are worth $480 based on The Points Guy's valuations, and potentially even more with some simple planning and strategy, meaning you can get a total of $580 in value when you include the $100 statement credit.\nYou won't receive complimentary lounge access with the Delta Platinum Amex, but you'll still earn 2 miles per dollar spent on eligible Delta purchases, Main Cabin 1 priority boarding, a domestic main cabin round-trip companion certificate each time you renew the card starting at the beginning of your second year, your first checked bag free on Delta flights, no foreign transaction fees, a Global Entry or TSA PreCheck fee credit worth up to $100, and the ability to purchase Delta Sky Club access at a daily rate of $39 per person for you and up to two guests when traveling on a Delta flight.\nThose who tend to fly a lot on cheap tickets will also appreciate the MQD waiver that comes with this card. If you spend at least $25,000 on the card in a calendar year, you won't have to meet the MQD requirement for any Delta elite status level up through Platinum (though you'll still need to meet either the mileage or segment requirements).\nAnd if you're chasing Delta elite status, you may also like the Status Boost feature of the Delta Platinum Amex, which effectively rockets you to Delta elite status just by using the card. When you hit $25,000 in spending on the card in a calendar year, you're granted 10,000 bonus Medallion Qualification Miles (MQM), and when you hit a total of $50,000, you're given another 10,000 MQMs.\nAlso, Delta has announced that MQMs earned in 2020 will roll over to 2021 and count toward elite status for 2022, so you won't be losing out on your status progress just because planes aren't currently flying.\nBest Delta companion certificate: Delta SkyMiles Reserve Amex\nAccess Delta Sky Clubs like this one in Atlanta with the Delta Reserve Amex credit card.\nIf you're a Delta fanatic and want to maximize your Delta experience, you'll ideally want a credit card that adds a layer of luxury to your trip by granting Delta Sky Club lounge access, as well as enhancing the journey in other ways.\nWith a $550 annual fee, the Delta Reserve Amex packs a set of Delta-focused perks, and right now you can earn 40,000 bonus miles and 10,000 Medallion Qualification Miles (MQMs) after you spend $3,000 in purchases on your new card in your first three months after you open the account. Not only are those bonus miles worth $480 in travel, but the bonus MQMs will help you out if you're aiming for Delta elite status.\nAfter your first renewal of the card, you'll gain access to a lucrative annual companion certificate. This is essentially a buy-one-get-one for any domestic first class, Comfort+ or Main Cabin ticket to anywhere in the lower 48 US states. If you use this benefit on what would otherwise be an expensive round-trip ticket, you can get enough value from this perk alone to make the annual cost of the card worth it.\nBut the top reason to hold the Delta Reserve Amex is lounge access. This credit card includes an Individual membership to Delta's global network of Sky Club lounge locations, which serve as an oasis with food, seating, fast Wi-Fi and cleaner restrooms than what you'll find in the general terminal area. Outright membership to the Sky Club normally costs $545 annually, so those planning to pay up for access anyway should give strong consideration to getting this card instead, as the outlay is essentially equal in both scenarios.\nWith this card in your purse or wallet, however, you're entitled to even more value. New this year is even more lounge access — Delta Reserve Amex cardholders receive complimentary access to American Express' network of Centurion Lounge locations when you're flying Delta and use your card to book the flight. Plus, you'll get two one-time Delta Sky Club guest passes (valued at $39 apiece), and those who are new to Delta's frequent flyer program will be eligible for complimentary upgrades on Delta flights when available.\nYou'll also earn 3 miles per dollar on all eligible Delta purchases, and there's a Status Boost feature that's more generous than the one on the Delta Platinum Amex. When you hit $30,000 in annual spending on the Delta Reserve Amex, you're granted 15,000 bonus MQMs, and for each additional $30,000 spent, you're given another 15,000 MQMs, up to a total of 60,000 MQMs each calendar year.\nToss in a first checked bag free, Main Cabin 1 priority boarding, no foreign transaction fees, 20% back on Delta inflight purchases, MQM gifting, the same MQD waiver as the Delta Platinum Amex, and a Global Entry or TSA PreCheck fee credit worth up to $100, and you've got a compelling value proposition.\nBest for Delta lounge access: American Express Platinum\nThough it's not a Delta credit card, the Amex Platinum can be a Delta flyer's best friend. You can earn 60,000 Membership Rewards bonus points after you use your new card to make $5,000 in purchases in the first three months after opening the account, and those points are transferable to Delta at a 1-to-1 ratio or to 20 other airline and hotel partners. Plus, flashing this card at any Delta Sky Club location will grant you access, so long as you have a same-day boarding pass for a Delta flight.\nThe Amex Platinum also opens the door to Amex's own Centurion Lounges, international American Express lounges, a collection of partner lounges, and Priority Pass Select lounges. In total, it unlocks access to more than 1,200 airport lounges across 130 countries (and counting).\nIn other words, the Amex Platinum provides more lounge access, but charges the same $550 annual fee as the Delta Reserve Amex.\nA unique perk of this card is the ability to unlock elite status in a variety of programs. Just by holding the Amex Platinum, you're granted Gold status in Hilton's Honors and Marriott's Bonvoy programs. And on the car rental front, you'll get complimentary memberships in Hertz Gold Plus Rewards, Avis Preferred and National Car Rental Emerald Club Executive.\nFor those who rely on ride-sharing to get around, you'll appreciate Uber VIP status. That perk sits alongside up to $200 in annual statement credits for Uber rides, split into monthly $15 credits for US rides plus a bonus $20 each December.\nYou'll also get a credit of up to $100 to cover the fee for applying for either Global Entry or TSA PreCheck, up to $100 in annual Saks Fifth Avenue credits, and up to $200 in annual airline fee credits to cover incidental fees — such as checked bags and inflight refreshments — on an airline of your choice.\nDid we mention that the Amex Platinum earns 5 points for every dollar you spend on airfare purchases made directly with any airline (Delta included), as well as on airfare and prepaid hotels booked through amextravel.com? It does. Plus, there are no foreign transaction fees, and you get car rental loss and damage insurance, return protection, and access to the Platinum Card Concierge — useful for those hard-to-get restaurant reservations and off-the-wall requests.\nBest for business owners who fly Delta: Delta Gold Business Amex\nBusinesses can earn up to a $100 Delta flight credit after spending $10,000 in a year on the Delta Gold Business Amex credit card.\nIf you own a business, large or small, Delta also has welcome offers on its newly refreshed line of business cards.\nRight now you can earn 40,000 bonus miles after you spend $2,000 in purchases on the Delta Gold Business Amex in the first three months after you open the account. The card carries a $0 introductory annual fee for the first year, then $99 a year thereafter.\nSimilar to the personal Delta Gold Amex, the Delta Gold Business Amex offers up to a $100 Delta flight credit after you spend $10,000 in purchases on your card in a calendar year, plus a free checked bag on Delta flights alongside Main Cabin 1 priority boarding, and no foreign transaction fees to sweat.\nWith this business card, you'll earn 2 miles per dollar on all purchases made directly with Delta as well as at restaurants worldwide, but also on US purchases for advertising in select media and eligible US shipping purchases.\nBest for Delta business travelers: Delta Platinum Business Amex\nThe Delta Platinum Business Amex has a $250 annual fee, but that outlay currently comes with a welcome offer of 45,000 bonus miles and 5,000 Medallion Qualification Miles (MQMs) after you spend $3,000 in purchases in the first three months after opening the account, plus a $100 statement credit after you make a Delta purchase with your new card within your first three months.\nYou'll also rack up 3 miles for every dollar spent on eligible Delta purchases and on purchases made directly with hotels. For business owners who tend to make large purchases, you can earn 1.5 miles per dollar on single eligible purchases of $5,000 or more (that's an extra half point per dollar), up to 50,000 additional miles per year.\nFlight benefits include all the same perks as the Delta Gold Business Amex card, like a first checked bag for free, Main Cabin 1 priority boarding, up to a $100 Delta flight credit after you spend $10,000 in purchases on your card in a calendar year, no foreign transaction fees, and a Status Boost feature that earns 10,000 MQMs when you spend $25,000 in purchases on the Delta Platinum Business Amex in a calendar year, and 10,000 more MQMs after spending a total of $50,000 in purchases in a calendar year.\nBest for Delta road warriors: Delta Reserve Business Amex\nAccess the American Express Centurion Lounge in Dallas with the Delta Reserve Business Amex credit card.\nBusiness owners willing to pay the card's $550 annual fee for the privilege of Delta Sky Club access should consider the Delta Reserve Business Amex. This card offers a 45,000-mile welcome bonus, along with 10,000 Medallion Qualification Miles (MQMs) after you spend $5,000 in purchases on your new card in your first three months after account opening.\nLike its personal counterpart, the most notable perk of the Delta Reserve Business Amex is complimentary Delta Sky Club and Centurion Lounge access when flying on a same-day Delta flight. Outright membership to Delta's network of Sky Club lounges is $545 annually, so if that's of utmost importance to you as a businessperson, you're better off holding this card than buying a membership.\nYou'll earn 3 miles per dollar spent on Delta purchases, but the business version of the card also has another feature: After you spend $150,000 on your card in a calendar year, you'll earn 1.5 miles per dollar on all your eligible purchases for the rest of the year, except eligible Delta purchases, which continue to earn 3 miles per dollar.\nWith the Delta Reserve Business Amex's Status Boost feature, you can earn 15,000 MQMs after you spend $30,000 in purchases on the card in a calendar year, up to four times per year. Finally, the card provides complimentary upgrades for non-elites when available, an annual companion certificate that can be used for domestic first-class travel each year upon renewal of your card, and you won't have to fret over foreign transaction fees.\nDelta credit cards versus our benchmark card\nAll seven Delta credit cards top CNN Underscored's benchmark credit card, the Citi® Double Cash Card, on several of our criteria. They offer welcome bonuses, bonus categories and travel benefits, and don't charge foreign transaction fees. If you're a regular Delta flyer, you'll likely find value in at least one if not all of these areas.\nHowever, all the Delta cards (except the Delta Blue Amex) either have annual fees immediately or after the first year, which our benchmark card doesn't. And unless you're really good at maximizing Delta SkyMiles, the Citi Double Cash card's 2% return — 1% when you make a purchase, and another 1% when you pay it off — beats the Delta cards when it comes to everyday spending. You can read more about our benchmark credit card concept in our methodology.\nWhich credit card is best for Delta flyers?\nThe best Delta credit card for you depends on your flying and spending habits.\nOnce travel is back to normal, for people who can utilize the free checked bag feature at least twice a year but likely won't use any of the other Delta perks, either the personal Delta Gold Amex or Delta Gold Business Amex will make the most sense. If you're aiming for mid-tier Delta elite status, you might pick up a Delta Platinum Amex or a Delta Platinum Business Amex to take additional advantage of the MQM waiver and the Status Boost feature.\nIf you expect to be on the road regularly once Delta is back to full service and want Delta Sky Club access, the American Express Platinum is a more well-rounded credit card than the Delta Reserve Amex. It offers broader lounge access, throws in elite status with a handful of top hotel and car rental companies, and offers a variety of annual credits that help offset the $550 annual fee.\nHowever, the main reasons you might choose a personal Delta Reserve Amex or a Delta Reserve Business Amex over the Amex Platinum are the annual companion certificates or the MQD waivers or Status Boosts — all of which are exclusive to Delta credit cards.\nAnd if you don't plan to be on a Delta flight even once planes are back in the air, you might want to skip all the Delta credit cards and instead choose a card that aligns better with your needs. In that case, check out our guide to \"The best credit cards of 2020\" for other options.\nFor Delta personal credit cards:\nLearn more about the Delta SkyMiles Blue Amex card.\nLearn more about the Delta SkyMiles Gold Amex card.\nLearn more about the Delta SkyMiles Platinum Amex card.\nLearn more about the Delta SkyMiles Reserve Amex card.\nFor Delta business credit cards:\nLearn more about the Delta SkyMiles Gold Business Amex card.\nLearn more about the Delta SkyMiles Platinum Business Amex card.\nLearn more about the Delta SkyMiles Reserve Business Amex card.\nFor lounge access and other luxury perks:\nLearn more about The Platinum Card from American Express.\nEditorial Disclaimer: Opinions expressed here are the author's alone, not those of any bank, credit card issuer, airlines or hotel chain, and have not been reviewed, approved or otherwise endorsed by any of these entities.\nNote: While the offers mentioned above are accurate at the time of publication, they're subject to change at any time and may have changed, or may no longer be available.", "url": "https://www.cnn.com/2020/02/11/cnn-underscored/best-delta-credit-cards/index.html"}