{"authors": ["Katie Hunt"], "date_download": "2020-05-04 16:58:43", "date_modify": "2020-05-04 16:58:43", "date_publish": "2020-04-09 18:00:19", "description": "A crew of a now-extinct monkeys made a treacherous transatlantic journey on a natural raft from Africa to settle in South America around 35 million years ago, according to a study of fossilized teeth found in Peru.", "filename": "2020_04_09_world_prehistoric-monkeys-crossed-atlantic-scn_index_1588611523.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409075053-02-prehistoric-monkeys-crossed-atlantic-scn-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_world_prehistoric-monkeys-crossed-atlantic-scn_index_1588611523.html", "title": "Prehistoric monkeys rafted across the Atlantic to South America", "title_page": "Prehistoric monkeys rafted across the Atlantic to South America - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A crew of now-extinct monkeys made a treacherous transatlantic journey on a natural raft from Africa to settle in South America around 35 million years ago, according to a study of fossilized teeth found in Peru.\nIt's believed the prehistoric Ucayalipithecus monkeys made the more than 900-mile trip across the Atlantic (a narrower ocean at the time) on floating islands of vegetation that broke off from coastlines, possibly during a tropical storm.\n\"It would have been extremely difficult, though very small animals the size of Ucayalipithecus would be at an advantage over larger mammals in such a situation, because they would have needed less of the food and water that their raft of vegetation could have provided,\" said lead author Erik Seiffert, a professor of clinical integrative anatomical sciences at Keck School of Medicine, University of Southern California. The study published Thursday in the journal Science.\n\"This is presumably why most of these overwater dispersal events that we know of in the fossil record involve very small animals,\" Seiffert said.\nOnly two other species of \"immigrant\" mammals are thought to have made what would have been a harsh crossing across the Atlantic, although exactly how they got there has long been a topic of heated discussion.\nRead More", "url": "https://www.cnn.com/2020/04/09/world/prehistoric-monkeys-crossed-atlantic-scn/index.html"}