{"authors": ["Anna Bahney", "Cnn Business"], "date_download": "2020-05-04 16:04:02", "date_modify": "2020-05-04 16:04:02", "date_publish": "2020-04-01 21:25:20", "description": "When Brooklyn Ramsey paid her $800 rent for April, she also sent the management company a message.", "filename": "2020_04_01_success_rent-help-coronavirus_index_1588608242.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401034627-rent-coronavirus-brooklyn-ramsey-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_success_rent-help-coronavirus_index_1588608242.html", "title": "Here's what to do if you can't pay your rent", "title_page": "Here's what to do if you can't pay your rent - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) When Brooklyn Ramsey paid her $800 rent for April, she also sent the management company a message.\n\"I'll be able to pay this month, but not May or anything after,\" she told them. \"Rent depleted everything I saved.\"\nRamsey is more fortunate than many Americans who've lost their job and won't be able to pay their share of the nearly $50 billion in rent that's due today, according to the Urban Institute.\nShe still has her job at a gas station in Circleville, Ohio. But her hours were cut from 40 a week to nine, taking her pay down to $88 weekly. She is also concerned about her exposure to the public, and has to care for her 5-year-old son, Garrett, who is home from school.\n\"I've always been able to pay my rent and I've never been late,\" she said. \"This is freaking me out. Everything is due at once. I can't even rob Peter to pay Paul.\"\nWhile government agencies and banks are offering aid to homeowners by suspending mortgage payments, getting direct relief to the country's 44 million renter households is harder. What help is there for those who can't pay the rent?\nCan the federal government help?\nRenters are more economically vulnerable than homeowners, said Solomon Greene, a senior fellow in housing policy at the Urban Institute. \"They make less money, they have less saved up to weather emergencies and they are at greater risk for displacement and homelessness than homeowners.\"\nMost rental properties are owned by private landlords and therefore don't have direct exposure to the aid provided by federal government. But there are some renters, like those in federally assisted housing, who will receive relief from the government's $2 trillion stimulus bill, including a 120-day moratorium on evictions and late fees for people in almost all the nation's affordable housing properties.\nTomorrow is April 1st, here's America's housing tab (roughly). Unclear who can pay! More needs to be done to protect renters, landlords, homeowners, and stabilize the housing market. #protectrenters #paylandlords #stabilizethehousingmarket #StayAtHome @urbaninstitute pic.twitter.com/RMZ3kuL6Bo — Mary Cunningham (@marykcunningham) March 31, 2020\nThe stimulus bill also allows multifamily landlords with federally backed mortgages to receive forbearance on their payments. In order to get this forbearance, they can't evict their tenants. But Greene says this will help only a small share of renters.\n\"Most renters don't know what kind of mortgage their landlord has,\" he said.\nSome housing experts say the most beneficial assistance for renters will be the direct payments the government is providing to Americans. But the stimulus payments are not expected for three weeks or more.\nMillions are wondering how they'll pay their rent until then, said Justin Ruben, co-director of ParentsTogether, a parent run organization that is calling on Congress to freeze rents and stop evictions. \"Parents are telling us they won't be able to pay rent unless they cut back on vital food or medication.\"\nOnly 38% of parents said they'll be able to pay their full rent or mortgage on April 1, without cutting back on other necessities like food, according to a ParentsTogether survey that included 1,200 of its two million members. And just 30% are confident they'll be able to pay their May rent or mortgage.\nHelp closer to home\nA better place to look for help may be your state, county or city, said Greene.\nAt least half of states have temporary eviction moratoriums in place, and dozens of cities have adopted measures as well.\n\"But the key message is that rent will still be due,\" said Greene. \"This is not a rent holiday. It is smart policy to issue these moratoria during a crisis, but it doesn't eliminate the need to pay your rent or the landlord's right to recover rent.\"\nBrooklyn Ramsey, with her 5-year-old son Garrett, has depleted her savings to pay her $800 rent.\nIn many cases, the burden is on the tenant to alert the landlord to their inability to pay. Tenants will be obligated to repay full rent in a timely manner and could still face eviction after the enforcement moratorium is lifted.\n\"We don't want to see a wave of evictions as these moratoria are lifted,\" said Greene. \"We need to look at forms of emergency rent relief where philanthropy or government is covering the rent during the job loss.\"\nSearching for services on a local level may help residents find legal aid or rent relief more quickly.\nSome cities, like Oakland, California, have enacted stronger protections for tenants than the state. Through the Keep Oakland Housed program, for example, the city offers emergency financial assistance to help with rent, legal services or other housing-related costs.\nBe open about the struggle\nTalk with your landlord about your financial situation. You may find that your landlord has voluntarily adopted rent discounts or other accommodations.\nClay Grubb, CEO of Grubb Properties, a multifamily housing developer based in Charlotte, North Carolina, was disappointed to find \"Rent Strike 2020\" spray painted on one of his buildings.\n\"It is a scary time,\" he said. \"People are trying to incite everyone not to pay. We want to give people some flexibility. But the rent is still due.\"\nGrubb decided to offer a 10% rent discount to tenants who pay on time. He's also extending payment deadlines and split payments for those who missed the April 1st deadline. He will let them pay half the rent by April 10th and the other half by the 25th.\nIn Ohio, Brooklyn Ramsey is happy the rent is paid. For now.\n\"This is something nobody can control,\" said Ramsey. \"There are a lot of people that are really struggling and who will be homeless if they can't get back to work.\"", "url": "https://www.cnn.com/2020/04/01/success/rent-help-coronavirus/index.html"}