{"authors": ["Ronan Burtenshaw", "Marcus Barnett", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Daniel Finn", "Richard Seymour", "Duncan P. Thomas", "Grace Blakeley"], "date_download": "2020-05-04 19:55:28", "date_modify": "2020-05-04 19:55:28", "date_publish": "2019-12-28 00:00:00", "description": null, "filename": "2020_01_salford-uk-working-class-rebecca-long-bailey-labour_1588622128.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/12/28143337/GettyImages-1149548156.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_01_salford-uk-working-class-rebecca-long-bailey-labour_1588622128.html", "title": "The City Where British Working-Class History Is Still Alive", "title_page": "The City Where British Working-Class History Is Still Alive", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "If you head down toward The Crescent in Salford, on your way toward Manchester on the A6, you’ll run into a peculiar building. Opposite the Salford Museum and Art Gallery on the dual carriageway stands a mock Elizabethan red brick with gabled ends. Jubilee House was built to mark the Queen’s Diamond Jubilee at the end of the nineteenth century and began life as a nurses’ home, but now it goes by quite a different name: the Working Class Movement Library (WCML). It is one of Salford’s charming ironies that this building — along with other working-class landmarks such as the Salford Lads Club and the Coronation Street red bricks — was designed by a staunch Tory, Henry Lord. You suspect the vice-chairman of the South Salford Conservative Association might have thought twice about this particular commission had he been aware of its afterlife. Engineering worker Eddie Frow and his wife, the teacher Ruth Haines, began the WCML in their home in the 1950s. For decades, “Eddie and Ruth” traveled Britain salvaging archive materials from the labor movement, many of which would otherwise have been lost or discarded. By the 1980s, the collection had outgrown their semidetached house, and Salford City Council took on the task of finding a home for it, offering Jubilee House as the location. The WCML’s archive spans the breadth of socialist history, through the Peterloo Massacre and the Chartists to the foundations of the trade union movement and Labour Party. Tribune ’s own Barbara Castle, Ellen Wilkinson, and Frank Allaun are among its many collected papers, which also includes works by Eleanor Marx, Tom Mann, Thomas Paine, and the Pankhursts. It is, in short, the memory of a movement.\nRadical History It’s likely that Salford will play an important role in the coming Labour leadership campaign being, as it is, the home of left-wing candidate Rebecca Long-Bailey. It is little surprise, then, that we are hearing about its apparently mafiosi-like local organizer and trustee of the WCML — Alex Halligan. In the care homes and pubs of the city, Halligan’s reputation certainly carries weight, but not for the reasons the Murdoch press would have you believe. As a young man, he spent his twenties organizing unemployed workers, strengthening communities against the far right, and rebuilding the Salford Credit Union from a moribund organization into one that — in his words — was “driving Wonga off the estates.” Salford has a long and storied radical history. It was in The Crescent pub that Karl Marx and Friedrich Engels formed ideas that became central to The Communist Manifesto . Down the road, in The Black Lion, Salford foundrymen and dockers met with impoverished immigrants from the local Irish and Jewish communities to establish the local branch of the Social Democratic Federation, an early socialist group that counted the likes of James Connolly and William Morris among its members. The offices of the Amalgamated Engineering Union and the Transport and General Workers’ Union, both now Unite, were situated in the same stretch of road. Unfortunately, local heritage is worth increasingly little in a country with few political priorities beyond the building of luxury flats for the rich. In place of the old T&G offices today stands a pricey apartment block with that famous Shelley line about Peterloo — “ye are many, they are few” — emblazoned on its front. And yet, in recent years, Salford’s left-wing council has been one of the few in the country to push back against the housing nightmare. Last month it announced the first new council houses in the area in forty years — high-quality homes, provided for below-market rent and excluded from Right to Buy. There are plans for hundreds more. Salford was once represented by reliable socialist MPs such as Stan Orme, a local trade unionist and early anti-colonial activist, and Frank Allaun, who was radicalized as a young Jewish worker by the rise of fascism and spent his life crusading against slum landlords. As in many parts of the country, the defeat of the Left and the rise of Blairism changed all that. By the 1990s and 2000s, Salford came to be represented by Blair loyalist Hazel Blears — an architect of “War on Terror” policies and totemic figure in the 2009 expenses scandal. Local protests against her during the latter period grew so intense that she was forced to live in a hotel. That is not the case in Salford anymore. In fact, it is one of the few places that voted Leave in 2016 where Labour’s left-wing turn of recent years has made headway. It has a socialist-led council making meaningful improvements in working people’s lives. It has a vibrant local left, not only politically but culturally, evidenced by projects like the Salford Community Theatre. And the constituency of Salford and Eccles has a socialist MP in Rebecca Long-Bailey, who might have shed some votes to the Brexit Party in the general election but retained comfortably over 50 percent of the share — and a total almost twice that the party achieved in 2010. Salford is somewhere between the Manchester metropolis and the surrounding Lancashire towns, suffering decades of deindustrialization and casualization on its once-mighty docks and in Trafford Park, while also seeing an influx of new jobs in the BBC’s MediaCityUK and around the university. It has, as a result, both a postindustrial working class and a growing student population. Shaped by waves of migration, yet decidedly English; on the one hand, a proud, old, and tight-knit community, on the other, a city of the world. In many ways, Salford is at the crossroads of today’s Labour Party.\nClass Culture Born a stone’s throw away from Trafford Park, a former engineering hub that remains the largest industrial estate in Europe, Rebecca Long-Bailey has spent her life immersed in Salford and its working-class life. Her father Jimmy was a union man who worked on the Barton freight docks, and her mother Una is a lifelong Labour activist. The rounds of redundancy that threatened her dad and his friends injected the politics of Thatcher’s Britain into her life from an early age. Already, the tabloid press is attacking Long-Bailey over this — claiming she couldn’t possibly have been proximate to the docks closure. It closed in 1982, the line goes, when she was only two years old. How could she possibly have felt the effects? This date refers to Salford docks, not the Barton docks where her father actually worked, but that doesn’t matter to a press machine that only cares about tearing down socialists. Tearing down socialists is not an alien concept to Salford. Ewan MacColl, its most famous son, was on an MI5 watch list by the time he was seventeen. He was born James Henry Miller in Salford a little over a century ago, to a socialist father who was only in the area because he had been blacklisted from every foundry in Scotland. Ewan MacColl was the godfather of a folk revival that stretched across most of the middle of the twentieth century — and did as much to shape the country as any factory or pit. His songs spoke to the reality of working-class life at that time, that it was often hard but that there was pride in it, pride that was won by struggles against those who would reduce working people to immiseration if they had their way. He wrote “The Manchester Rambler” about the Kinder Scout Mass Trespass, when northern workers escaped from the smoggy slum air into the Pennines to challenge the landed gentry’s ownership of moor and mountain, and “The Shoals of Herring” as a tribute to Norfolk’s vanishing fishing communities. His “Schooldays End” spoke of the transition from childhood to pit life in the Welsh Valleys. There were bitter ballads, too, about the impacts of deindustrialization, like “My Old Man,” and the anthem of the miners’ strike, “Daddy, What Did You Do in the Strike?” But MacColl’s most famous song is undoubtedly “Dirty Old Town,” written about Salford itself. It is here that you feel the real meaning of his music, expressing the moments in working-class towns that made people want to sing: finding love by the gasworks croft, dreaming a dream by the old canal, kissing a girl by the factory wall. It was not all toil and struggle, it was a life as well. And it aspired to be a better one, when working-class people would forge the ax to cut down that old dead tree. Salford’s contributions to culture stretch far beyond MacColl, of course. It may have once been the city of cloth-capped workers in the foundries and docks, but it was on those docks that a young Mark E. Smith worked while he was writing the first modernist punk songs that would make The Fall. It was the backdrop for A Taste of Honey , written by Shelagh Delaney — who worked at an engineering works and was, like Long-Bailey, a proud member of Salford’s Irish diaspora — which gave British cinema its first humane depiction of a gay man, as well as a pioneering effort to sensitively display mixed-race relationships and teenage pregnancies in what was, in many aspects, a deeply conservative country. For decades, Salford has been a place where working-class institutions and culture have flourished, where working people could tell their own stories in their own voice. It was one of the abiding failures of Corbynism that too few working-class communities in too few places felt the project was their own. If we are to learn the lessons of how this might be different, Salford is a good place to start.", "url": "https://www.jacobinmag.com/2020/01/salford-uk-working-class-rebecca-long-bailey-labour"}