{"authors": ["Opinion Issac Bailey"], "date_download": "2020-05-04 16:28:38", "date_modify": "2020-05-04 16:28:38", "date_publish": "2020-04-07 18:42:29", "description": "Issac Bailey says the patchwork coronavirus response across the South, including in his native South Carolina, reveals persistent Old South attitudes still prevalent among some in his home state and region.", "filename": "2020_04_07_opinions_the-south-and-coronavirus-bailey_index_1588609718.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404223203-tybee-island-georgia-mayor-beaches-open-kemp-dnt-vpx-00005908-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_opinions_the-south-and-coronavirus-bailey_index_1588609718.html", "title": "What Covid-19 is showing us about the South", "title_page": "Southern governors' bizarre response to Covid-19 (opinion)  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Issac Bailey is a longtime journalist based in South Carolina and the Batten Professor for Communication Studies at Davidson College. He's the author of \" My Brother Moochie: Regaining Dignity in the Face of Crime, Poverty and Racism in the American South .\" His next book, \"A Black Man in Trumpland: Why We Didn't Riot -- But Should Have,\" will be released by Other Press in 2020. The views expressed in this commentary are his own. View more opinion on CNN.\n(CNN) My 15-year-old daughter Lyric noted how flimsy she thought the barriers blocking public beach access seemed. The aluminum barriers stood just a few feet high and could be felled by a brisk wind gust. It would be easy for just about anyone to climb over or walk around.\nThey were placed up and down the oceanfront in South Carolina after Gov. Henry McMaster ordered public beach accesses closed . At that time, he declined to implement a statewide stay-at-home plan, giving us the distinction of being one of a dwindling number of states to not be under such an order.\nMcMaster, only days after describing the state as a \"unique\" place where a stay-at-home order wasn't needed, issued an order requiring South Carolinians to stay home -- unless they're at work, visiting family, exercising or shopping for necessary items. When a reporter pushed him on whether this \"home or work\" order is a \"stay-at-home\" order, McMaster said, \"This is a stay-at-home order. You call it what you like.\"\nIn the Palmetto State, we refuse to be like others, even if it causes more confusion than necessary.\nWe were heading home from a Department of Motor Vehicles office when Lyric spotted the barriers at the beach. My daughter became eligible late last week to get her driver's license and wanted to see if she could take the driver's test. She couldn't, but I could renew my license plate.\nOn the DMV sidewalk, we had seen X's marked -- a couple pieces of gray tape crossed over each other, actually -- to remind people to remain at least 6 feet apart in line. Inside, though, no one was wearing masks and no one seemed interested in ensuring they were at least 6 feet away as they passed us walking through the entrance or standing at the counters inside.\nThe whole experience represented an accurate distillation of what's been happening in South Carolina and in some, though not all, other parts of the South -- a confusing, haphazard, bizarre kind of social distancing mixed with a healthy dose of the kind of defiance that has long defined -- and always will define -- a certain kind of Southerners.\nIt's our relentless attempt to bend reality to our will and never give in even when reality gets the upper hand, like a virus, an invisible enemy, for which we currently have no vaccine and no known treatment.\nOur defiance, even in the direst of circumstances, has been helping and hurting us and the rest of the United States since our country's founding. It is widely known that South Carolina was the first state to secede from the Union to preserve slavery and where the first shots of the Civil War were fired. But the state was also among the first to take up arms against the British at the outset of the American Revolution and the second colony to ratify the Articles of Confederation, the nation's first constitution.\nFrom the beginning, our state and much of its region have largely been composed of a curious mix of those wanting independence -- even if it cost us our lives in war or during a pandemic -- and those more pragmatic, with the former often getting the most attention because they usually held much of our electoral power.\nThat's why I can answer the question Dr. Anthony Fauci, the face of the Trump administration's Covid-19 response, asked on CNN recently, about why there isn't a stay-at-home order in every state. At least I can answer it for Southern states like my native South Carolina.\nBecause so much of the Old South is still with us -- it's never really gone away. Because defiance and skepticism of centralized power runs through our veins. Because it was born and bred into us from the beginning. Because it is simply the case that many people here believe there are worst things than dying, such as having to listen to a highly educated egghead in DC or a good ole boy politician in Columbia tell us we can't shop when and how we want, can't congregate on the sidewalk in large numbers if we want to, can't walk on the beach to dip our toes in sand our tax dollars are used to renourish from time to time.\nThat dedicated intransigence is why so many in South Carolina and elsewhere in the Deep South cling to God and guns, even if a gun in the house is more likely to harm a member of the household than stop an intruder at the front door, why so many have gone along with elected officials who denied lifesaving policies, such as an expansion of Medicaid through the Affordable Care Act, even though the state of health and size of our bank accounts suggest we should crave such things like we yearn for sweet tea.\nSo for some, like me, it's not a surprise to see certain Southern states left with a confusing patchwork of coronavirus response. It's complicated.\nSome Southern states, like Kentucky and Virginia, have been more coherent and responsive in their efforts to address the crisis, and some of the governors still hesitant about sweeping action -- or implementing responses that are confusing at best -- are in the Midwest or West.\nStill, even when the most resistant Southern states implement a stay-at-home order, like Georgia Gov. Brian Kemp did recently, it's full of loopholes. It's why a mayor in that state, Savannah's Van Johnson, is legally trying to override the governor's edict to maintain Savannah's more robust plans. In South Carolina, when Charleston and Columbia implemented local stay-at-home orders, Attorney General Alan Wilson challenged the legality of such local moves (before the governor's Monday \"work or home\" order).\nThat it takes a collection of mayors and council members and county administrators instead of governors to enforce what seem like sensible policies during a pandemic no one knows will subside should surprise no one who knows anything about us. Concepts like \"states' rights\" and \"home rule\" and \"a man's home is his castle\" have been written in blood here, for good and for ill. Not even a coronavirus at least 10 times as deadly as the flu will change that.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nAfter South Carolina seceded in 1860, lawyer James L. Petigru said the state was \"too small for a republic and too large for an insane asylum.\" It's a quote that is recycled every time we do something mind-boggling, and that seems to be often. And there's truth to it, for my home state and my home region. We do dumb, dangerous things that endanger our lives, and those of our neighbors.\nBut it's also true that our defiance in the face of potential calamity is one of the reasons the United States ever became the world's lone superpower. Anything less, and we simply could not have achieved that status. But it's the one thing that might jeopardize that status now.", "url": "https://www.cnn.com/2020/04/07/opinions/the-south-and-coronavirus-bailey/index.html"}