{"authors": ["Senior Reporter"], "date_download": "2020-05-04 21:06:23", "date_modify": "2020-05-04 21:06:23", "date_publish": "2020-04-30 19:08:15", "description": "Protesters in the state have demanded a reopening of businesses despite the continued threat of the coronavirus.", "filename": "entry_michigan-court-rules-stay-home-stay-safe-order-doesnt-infringe-on-rights_n_5eab0fd8c5b633a854471ded_1588626383.html", "image_url": "https://img.huffingtonpost.com/asset/5eab15f3250000b711eb0a6d.jpeg?cache=ofhklbmfqx&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_michigan-court-rules-stay-home-stay-safe-order-doesnt-infringe-on-rights_n_5eab0fd8c5b633a854471ded_1588626383.html", "title": "Michigan Court Backs Governor's Stay-At-Home Orders In Face Of Challenge", "title_page": "Michigan Court Backs Governor's Stay-At-Home Orders In Face Of Challenge | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "A Michigan court refused to block Gov. Gretchen Whitmer’s shelter-in-place orders in a lawsuit demanding that businesses reopen despite the continued threat of the coronavirus.\nThe case filed by business owner Steve Martinko and four other Michigan residents argues that the governor’s orders infringe on their constitutional rights. Judge Christopher M. Murray of the state Court of Claims disagreed, Michigan Live reports.\n“Although the Court is painfully aware of the difficulties of living under the restrictions of these executive orders, those difficulties are temporary, while to those who contract the virus and cannot recover (and to their family members and friends), it is all too permanent,” Murray ruled in Wednesday’s order denying a preliminary injunction.\nASSOCIATED PRESS Protesters with rifles stand outside the state Capitol in Lansing, Michigan, on April 15 to demonstrate against Gov. Gretchen Whitmer's stay-at-home orders, meant to combat the coronavirus pandemic.\nMichigan is one of several states in recent weeks where protesters gathered in large clusters to call for businesses to reopen, even as governors and health officials have repeatedly warned to stay home when possible and practice social distancing to slow the spread of the virus.\nDespite the prominent coverage anti-lockdown protesters have gotten in recent weeks, the overwhelming majority of Americans of both parties support state stay-at-home orders, according to a HuffPost/YouGov poll from last week.\nHundreds flocked to Michigan’s Capitol on Thursday morning to protest Whitmer’s request to extend a statewide state of emergency. Some who attended were without masks and did not practice social distancing, WXYZ reported.\nProtest moves inside Michigan Capitol. Crowd attempts to get onto Hoise floor. Lots of Michigan State Police and House sergeants at arms blocking door. pic.twitter.com/4FNQpimP4W — Rod Meloni (@RodMeloni) April 30, 2020\nLater that afternoon, men armed with guns flooded the capitol building. State Sen. Dayna Polehanki tweeted a photo of the incident, saying she was grateful to have the Sergeant-at-Arms present as men holding rifles yelled at her.\nDirectly above me, men with rifles yelling at us. Some of my colleagues who own bullet proof vests are wearing them. I have never appreciated our Sergeants-at-Arms more than today. #mileg pic.twitter.com/voOZpPYWOs — Senator Dayna Polehanki (@SenPolehanki) April 30, 2020\nMore than 3,000 people in the state have died from the virus, with more than 60,000 dead across the U.S.", "url": "https://www.huffpost.com/entry/michigan-court-rules-stay-home-stay-safe-order-doesnt-infringe-on-rights_n_5eab0fd8c5b633a854471ded"}