{"authors": ["Ryan Bruckenthal", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Bue Rübner Hansen", "Sarah Lazare", "Adam Johnson", "Jedediah Britton-Purdy"], "date_download": "2020-05-04 19:58:05", "date_modify": "2020-05-04 19:58:05", "date_publish": "2020-03-18 00:00:00", "description": null, "filename": "2020_03_new-york-city-public-school-teacher-organizing_1588622285.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/18133556/GettyImages-1213248382.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_new-york-city-public-school-teacher-organizing_1588622285.html", "title": "Go on Strike for Your Health and Safety", "title_page": "Go on Strike for Your Health and Safety", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "With so many inessential industries remaining open, and so many workers faced with unsafe conditions, there is no time to lose. Educators fought back and won in New York, saving countless lives. Workers everywhere can do the same.\nBut the truth is that just as in more normal times, at a time of pandemic, workers need to fight to win a just response. Which is exactly what , educators, students, and parents in New York City recently did, showing that an organized working class can rise to the occasion.\nWe’re in the midst of the worst public health crisis of our lifetimes. Many of us would probably like to curl into a ball and trust some body of experts somewhere to handle the proper response to coronavirus .\nWhile districts, cities, and states around the country last week shut down schools, businesses, and public areas to try to contain the spread of the coronavirus pandemic, New York City and Mayor Bill de Blasio failed to follow suit. This meant that New York’s roughly 1,400 public schools were slated to remain open, with over one million students and almost 100,000 educators being put at risk of contracting and spreading the virus to their families, friends, and neighbors.\nNYC public schools and the workers that staff them keep the city running. Given our weak social safety net, school workers are tasked with providing the services of an entire social safety net — food, health care, mental health counseling, and childcare for the children of the working class. De Blasio acknowledged the crucial role of NYC public schools and educators in his initial justification for keeping the schools open: who, the Mayor asked, would look after the children of health care workers while they are on the frontlines battling this pandemic?\nBut given the clear threat that inaction posed to millions of students, staff, and their families, educators across the city began to take matters into their own hands. At the Grace Dodge Campus in the Bronx last Thursday, a staff member had tested positive for Covid-19, yet staff were still told to report to school the following day. The test administered to the educator by Montefiore Hospital wasn’t officially recognized by the Department of Health, and therefore the school wasn’t legally required to close.\nEducators, students, and parents sprung to action to protect one another. Staff collectively organized themselves to all call out on Friday, while students simultaneously organized themselves over social media and followed suit.\nSimilarly, at Stuyvesant High School in Manhattan, educators began talking about taking action as early as last Wednesday afternoon; by Thursday morning, educators throughout the building were discussing a mass sick-out. Social studies teacher and union delegate Ellen Schweitzer noted that, “As teachers talked with each other, they realized the gravity of the situation and the power that they needed to exercise in the absence of leadership from the mayor.”\nSchweitzer said that as soon as educators began raising the prospect of taking action in their departments, they became more confident. Educators and union members communicated in emails, meetings, and when initially clocking in on Thursday morning. By Friday, there was a school-wide movement with student and parent support for a sick-out.\nWhile educators organized actions and responses in their separate schools, rank-and-file union activists in the Movement of Rank and File Educators (MORE), a social justice caucus within the New York educators union, the United Federation of Teachers (UFT), sought to consolidate the widespread sentiment into citywide organizing.\nAs educators from Grace Dodge Campus and Stuyvesant began sharing their stories with coworkers and friends, MORE activists stepped in to provide a platform to share these stories and tips to educators and schools who wanted to take action. What started in a handful of schools quickly escalated into a coordinated campaign across the boroughs towards a citywide wildcat sick-out.\nKnowing that it would take collective action to move the Mayor and the City, MORE called for a city-wide organizing call this past Saturday, in which more than 400 educators from schools throughout New York joined in preparation for the sick-out. Additionally, a growing network of “Educators for Bernie,” which had formed in recent months, quickly jumped on board, spreading news of the action into additional schools throughout NYC.\nWithin hours, the news went viral, with teachers and educators making plans specific to their schools and media outlets covering the movement around the city and country. Some educators feared that taking this type of job action would violate the state’s Taylor Law which forbids public sector workers from striking, but educator organizers and leaders maintained that the health and safety threat to their coworkers and students made the action both legal and morally justified.\nThe UFT leadership took the hint that educators were ready to take action to shut down the largest school district in the country and began making more aggressive demands on the Mayor. As MORE’s statement on the sick-out from this past Sunday notes, “On Friday night President (of the UFT) Mulgrew had said he and the mayor ‘respectfully agreed to disagree’ on closure. By Saturday he denounced the mayor’s irresponsibility and by Sunday he was threatening to sue the DOE over unsafe working conditions.”\nUnion members and activist educators saw a developing crisis and quickly stepped up to lead the union. The union leadership, City Council, and NY State governor did eventually call for New York City to close its schools. But the prospect of mass actions by educators like sick-outs and mass wildcat work stoppage surely forced the Mayor’s hand.", "url": "https://jacobinmag.com/2020/03/new-york-city-public-school-teacher-organizing"}