{"authors": ["Opinion Dean Obeidallah"], "date_download": "2020-05-04 16:23:19", "date_modify": "2020-05-04 16:23:19", "date_publish": "2020-04-06 16:23:57", "description": "Dean Obeidallah writes that President Trump and Fox News' criticism of Gov. Andrew Cuomo and Dr. Anthony Fauci is another example of it being impossible to know where Trump stops and Fox News begins or vice versa. But what's abundantly clear is that both have one common interest: Defend Trump at all costs -- even if that means undermining doctors and lying about a deadly virus that is killing our fellow Americans.", "filename": "2020_04_06_opinions_trump-f_1af4b59b025923262af8bd21922fcdb1_index_1588609399.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330090605-01-trump-fox-news-virtual-town-hall-0324-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_opinions_trump-f_1af4b59b025923262af8bd21922fcdb1_index_1588609399.html", "title": "The Trump-Fox News feedback loop now going after Andrew Cuomo and Dr. Anthony Fauci", "title_page": "The Trump-Fox News feedback loop now going after Andrew Cuomo and Dr. Anthony Fauci - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Dean Obeidallah, a former attorney, is the host of SiriusXM radio's daily program \"The Dean Obeidallah Show\" and a columnist for The Daily Beast. Follow him @DeanObeidallah. The opinions expressed in this commentary are his own. View more opinion articles on CNN.\n(CNN) The Trump-Fox News feedback loop -- where President Donald Trump gets ideas from Fox News or the network gets its talking points from Trump -- has been with us for years. The goal has always been the same: Help the President at all costs.\nPotentially the most disturbing example of this unholy alliance has come recently regarding the deadly coronavirus. Some (not all) Fox News hosts, along with Trump, have spewed misleading information about the risks posed by Covid-19, making it hard to determine who was leading whom. For example, in late February, various Fox News hosts framed the Democrats' criticism of Trump's then handling of the outbreak as simply another attempt to hurt Trump politically.\nTrump's chief cheerleader Sean Hannity, on his February 27 show , did note that the \"rapid spread\" of the coronavirus was \"concerning.\" But Hannity gave his political spin, slamming \"some on the left\" for \"literally whipping this country into a frenzy,\" as he claimed that Democrats were \"sadly politicizing and weaponizing an infectious disease as their next effort to bludgeon President Trump.\"\nUnsurprisingly, the very next night, Trump downplayed the threat of the coronavirus at a rally, instead going on the attack and, like Fox News, claiming the Democrats \"are politicizing the coronavirus.\" The President then ticked off what he views as the Democrats' other attempts to take him down which he has deemed in the past \"hoaxes,\" from \"Russia\" to \"impeachment\" then adding, \"and this is their new hoax.\"", "url": "https://www.cnn.com/2020/04/06/opinions/trump-fox-news-cuomo-fauci-criticism-obeidallah/index.html"}