{"authors": ["Ed White", "David Eggert"], "date_download": "2020-05-04 20:21:30", "date_modify": "2020-05-04 20:21:30", "date_publish": "2020-04-07 18:29:16", "description": "DETROIT (AP) — Michigan deaths from the coronavirus rose 16% and made the largest daily jump since the outbreak hit the state, officials said Tuesday. The state reported 118 additional...", "filename": "_6f469bbf6c3453ffc18bdb47532e2886_1588623690.html", "image_url": "https://storage.googleapis.com/afs-prod/media/80160077bdf14d40af92c2eb13820ba4/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6f469bbf6c3453ffc18bdb47532e2886_1588623690.html", "title": "Michigan virus cases approach 19,000; 118 new deaths", "title_page": "Michigan virus cases approach 19,000; 118 new deaths", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A sign reading We Are In This Together and a Winnie the Pooh bear are pictured Tuesday, April 7, 2020, in the window of the Maud Preston Palenske Memorial Library in St. Joseph, Mich. The library remains closed due to the COVID-19 pandemic. (Don Campbell/The Herald-Palladium via AP) A sign reading We Are In This Together and a Winnie the Pooh bear are pictured Tuesday, April 7, 2020, in the window of the Maud Preston Palenske Memorial Library in St. Joseph, Mich. The library remains closed due to the COVID-19 pandemic. (Don Campbell/The Herald-Palladium via AP)\nDETROIT (AP) — Michigan deaths from the coronavirus rose 16% and made the largest daily jump since the outbreak hit the state, officials said Tuesday.\nThe state reported 118 additional deaths related to COVID-19, the respiratory disease caused by the virus, raising the total to 845. The number of confirmed coronavirus cases rose 10% to nearly 19,000.\n“It’s another tough 24 hours here in Michigan,” Gov. Gretchen Whitmer said. “We know that we are continuing on what is an upward trajectory at this point in time.”\nTHE LATEST\nIn Detroit, where residents have more than 25% of Michigan’s cases and deaths, Mayor Mike Duggan said the city will begin testing residents at nursing homes with a fast virus test used on police and firefighters. At least 12 deaths have been reported in nursing homes, he said.\nDuggan predicted “some really bad days” ahead for the city but also said that staying home and keeping a distance from each other outside homes is working.\nThe mayor said deaths in the city are doubling every five or six days, a slower rate than when the outbreak began and a “glimmer of light.”\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. Older adults and people with existing health problems are among those particularly susceptible to more severe illness, including pneumonia. The vast majority of people recover.\nUNEMPLOYMENT\nStaffing at the state’s unemployment agency doubled to 300 last week and 200 more people are joining from outside contractors, said Jeff Donofrio of the state Department of Labor and Economic Opportunity.\nHe estimated that 95% of people are getting through and filing claims online or by phone without any issues. Whitmer plans to take calls at her residence. Nearly 800,000 people have filed claims since mid-March.\nElsewhere, a privately run relief fund for people laid off from restaurant and lodging jobs stopped accepting online applications due to an overwhelming response. The $500 grants were just announced Monday.\nNICE TO SEE YOU (MAYBE)\nGoing to the western Upper Peninsula? A health department that covers five counties has noticed an influx of people and is concerned about the possibility of a “substantial strain” on services. The health agency recommends a 14-day quarantine for people arriving from hot spots.\n“Many rural communities may not be equipped with personnel, supplies or resources for a surge in population,” the department said.\nFUNERALS SUSPECTED Berrien County health officials in southwestern Michigan believe funerals attended by many people have fueled coronavirus cases there, although the governor has greatly limited the size of gatherings with her stay-at-home order. The county has at least 64 cases and two deaths.\n___\nEggert reported from Lansing. Associated Press reporter Corey Williams in West Bloomfield contributed to this report.", "url": "https://apnews.com/6f469bbf6c3453ffc18bdb47532e2886"}