{"authors": [], "date_download": "2020-05-04 20:26:44", "date_modify": "2020-05-04 20:26:44", "date_publish": "2020-04-20 22:52:25", "description": "TERRE HAUTE, Ind. (AP) — The former CEO of a central Indiana compounding pharmacy is trying to win release from federal prison, saying he fears he’ll die behind bars from COVID-19 while serving...", "filename": "_b10717d5c12e6a195befa4c51e9163ab_1588624004.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b10717d5c12e6a195befa4c51e9163ab_1588624004.html", "title": "Imprisoned CEO says COVID-19 justifies release from prison", "title_page": "Imprisoned CEO says COVID-19 justifies release from prison", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "TERRE HAUTE, Ind. (AP) — The former CEO of a central Indiana compounding pharmacy is trying to win release from federal prison, saying he fears he’ll die behind bars from COVID-19 while serving time on charges stemming from drug-potency problems.\nPaul Elmer, the 69-year-old former CEO of Pharmakon Pharmaceuticals, has Type II diabetes, sleep apnea, vertigo and osteoarthritis — conditions that create “a very serious, and very real, risk of dying in federal prison if infected,” his attorney, Richard Kammen, wrote in an April 1 motion for compassionate release.\nElmer was sentenced in September to almost three years in prison for manufacturing and selling drugs that were as much as 25 times more potent than they should have been.\nKammen argues the Terre Haute Federal Correctional Complex where Elmer is assigned is “even more dangerous than a cruise ship,” given three inmates sleep in one 8-foot-by-12-foot room, making social distancing impossible.\nHis request on April 8 was denied by Federal Judge James Sweeney, in part because he had not exhausted all administrative remedies, including giving the prison warden 30 days to make a determination.\nIn his motion for Elmer’s release, Kammen noted at-risk inmates who are non-violent might be safer serving their sentences in home confinement, pointing to U.S. Attorney General Bill Barr’s announcement that federal prisons would begin releasing some elderly and sick people to reduce crowding that can fan the spread of the virus.\nBureau of Prisons spokesperson Emery Nelson told the Indianapolis Business Journal that officials could not comment on any inmates inmate’s eligibility for compassionate release.\n“Depending on the warden’s action, or if he fails to act, we will pursue all available remedies for Mr. Elmer,” Kammen said in an email. “He like many elderly inmates are at grave risk due to COVID-19.”", "url": "https://apnews.com/b10717d5c12e6a195befa4c51e9163ab"}