{"authors": ["Eliott C. Mclaughlin"], "date_download": "2020-05-04 16:21:05", "date_modify": "2020-05-04 16:21:05", "date_publish": "2020-04-05 14:06:34", "description": "Tom Dempsey, a journeyman NFL kicker who despite missing the toes on his right foot set a field goal record that stood for more than four decades, has died of coronavirus, according to reports.", "filename": "2020_04_05_us_tom-dempsey-nfl-kicker-dies-coronavirus-trnd_index_1588609265.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405083200-01-tom-dempsey-saints-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_us_tom-dempsey-nfl-kicker-dies-coronavirus-trnd_index_1588609265.html", "title": "Tom Dempsey, NFL kicker who set a record for the longest field goal, dies of coronavirus", "title_page": "Tom Dempsey, NFL kicker who set a record for the longest field goal, dies of coronavirus  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Tom Dempsey, a journeyman NFL kicker who despite missing the toes on his right foot set a field goal record that stood for more than four decades, has died of coronavirus , according to reports.\n\"Tom's life spoke directly to the power of the human spirit and exemplified his resolute determination to not allow setbacks to impede following his dreams and aspirations,\" said Gayle Benson, owner of the New Orleans Saints, where Dempsey began his career.\n\"He exemplified the same fight and fortitude in recent years as he battled valiantly against illnesses but never wavered and kept his trademark sense of humor,\" she said in a statement.\nThe 73-year-old, who suffered from dementia, died from complications with Covid-19 on Saturday at Lambeth House Retirement Community in New Orleans, his family told The Times-Picayune/The New Orleans Advocate\nCNN has previously reported state officials were monitoring the facility after discovering a \"cluster\" of cases at the retirement home, where numerous residents have died\nFollowing a March 25 diagnosis, Dempsey initially fought the virus \"promisingly,\" but his condition worsened in the last week, daughter Ashley told the newspapers that form nola.com.\nBecause Lambeth House residents were quarantined, his family was not able to visit with him before he passed, but Ashley Dempsey was able to speak to him via video chat, she told the news outlet.\n\"We didn't want him to think we had abandoned him,\" she told the papers. \"We wanted him to know we still loved him -- always.\"\nDempsey was born in Milwaukee and attended high school and college in Southern California.\nHe was born without toes on his right foot and with no fingers on his right hand. To compensate, he wore a custom, flat-front kicking shoe that ended where his toes were supposed to begin.\nTom Dempsey breaks the NFL's field goal record with a 63-yarder during a November 1970 game.\nAt a time when NFL kickers were increasingly moving to soccer-style field goals and extra points -- booting the ball with the laces of their shoes -- Dempsey was a relic, preferring the old-school, straight-ahead style (which, for other kickers, meant kicking with their toes) that had dominated the early days of football.\nOn November 8, 1970, Dempsey's basement-dwelling Saints were losing 17-16 to the playoff-bound Detroit Lions at home in Tulane Stadium. With only seconds left, safety Joe Scarpati took the snap and Dempsey booted a 63-yarder, shattering Bert Rechichar's record of 56 yards, which had stood for 17 years.\nSome claimed his specially designed $200 shoe gave Dempsey an unfair advantage, but he shrugged off the critics, according to \"Game of My Life Detroit Lions: Memorable Stories of Lions Football.\"\n\"How about you try kicking a 63-yard field goal to win it with two seconds left and you're wearing a square shoe -- oh, yeah and no toes either,\" he told reporters, according to the book.\nIn 1974, the NFL moved to discourage long kicks like Dempsey's by moving the goal posts 10 yards, to the back of the end zone, and giving opposing teams the ball at the spot of the kick after a missed field goal.\nA few years later, the league mandated that kickers' shoes \"must have a kicking surface that conforms to that of a normal kicking shoe.\"\nDempsey shrugged off critics who said his flat shoe gave him an unfair advantage.\nDempsey's shoe now sits in Canton, Ohio, site of the Pro Football Hall of Fame, which hails the modified cleat as a memento from 50 great NFL moments , along with the bench Green Bay Packers coach Vince Lombardi used in his final game and the shoes the Dallas Cowboys' Tony Dorsett wore when he ran for the first 99-yard touchdown.\nDempsey's record was tied numerous times -- first by Jason Elam in 1998, Sebastian Janikowski in 2011 and David Akers in 2012 -- but Dempsey's defenders point out that two of the three kicks came in Denver, where the balls fly farther in thinner air.\nIn 2013, more than 43 years after Dempsey's historic kick, Matt Prater, who played for -- you guessed it, the Denver Broncos -- broke the record with a 64-yarder. The record still stands.\nWhen Carolina Panthers kicker Graham Gano booted a 63-yarder in 2018 to tie Dempsey's record for the longest game-winning field goal (giving the Panthers a 33-31 win over the New York Giants), Gano honored Dempsey the next day.\nIn a tweet, Gano said he'd always wanted to win a game in record fashion as Dempsey had done, and that one of the \"coolest gifts\" he'd ever received was a kicking tee signed by Dempsey.\n\"Honored to be able to put the ball from yesterday's kick onto the tee that he signed,\" Gano tweeted, including a photo of the ball resting atop the orange tee.\nAfter two seasons with the Saints, including his All-Pro rookie year, Dempsey went on to play for the Philadelphia Eagles, Los Angeles Rams, Houston Oilers and Buffalo Bills before retiring in 1979.\nHe was diagnosed with dementia in 2012.\nDempsey is survived by Ashley and her siblings, Toby Dempsey and Meghan Dempsey Crosby, according to nola.com. He also had three grandchildren, the paper said.", "url": "https://www.cnn.com/2020/04/05/us/tom-dempsey-nfl-kicker-dies-coronavirus-trnd/index.html"}