{"authors": ["Rob Gillies"], "date_download": "2020-05-04 20:14:09", "date_modify": "2020-05-04 20:14:09", "date_publish": "2020-04-06 18:39:52", "description": "TORONTO (AP) — Manufacturing giant 3M said Monday it has an agreement with the Trump administration that will allow the company to continue to export N95 protective masks to Canada and Latin...", "filename": "_6fc6fefcd3054b11df83704bd3c4b500_1588623249.html", "image_url": "https://storage.googleapis.com/afs-prod/media/46e25983862545319929035739e0a820/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6fc6fefcd3054b11df83704bd3c4b500_1588623249.html", "title": "3M, U.S. reach agreement that allows mask exports to Canada", "title_page": "3M, U.S. reach agreement that allows mask exports to Canada", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A patient is wheeled into the emergency unit of the Verdun Hospital in Montreal on Monday, April 6, 2020. Prime Minister Justin Trudeau says he’s confident Canada will still be able to import N95 protective masks form the U.S. despite an export ban and says he will talk to U.S. President Donald Trump in the coming days. (Paul Chiasson/The Canadian Press via AP)\nA patient is wheeled into the emergency unit of the Verdun Hospital in Montreal on Monday, April 6, 2020. Prime Minister Justin Trudeau says he’s confident Canada will still be able to import N95 protective masks form the U.S. despite an export ban and says he will talk to U.S. President Donald Trump in the coming days. (Paul Chiasson/The Canadian Press via AP)\nTORONTO (AP) — Manufacturing giant 3M said Monday it has an agreement with the Trump administration that will allow the company to continue to export N95 protective masks to Canada and Latin America amid the coronavirus pandemic.\nThe company said the U.S. government and 3M have a plan to produce 166.5 million masks over the next three months to support healthcare workers in the United States. They will primarily come from its manufacturing facility in China.\nPresident Donald Trump had used his authority under the 1950 Defense Production Act to stop exporting such masks, also known as respirators. The move to block such masks, which are crucial in protecting healthcare workers on both sides of the border from the virus that causes COVID-19 disease, outraged many officials in Canada.\n“3M and the Administration worked together to ensure that this plan does not create further humanitarian implications for countries currently fighting the COVID-19 outbreak,” the company said in a statement. “The plan will also enable 3M to continue sending U.S. produced respirators to Canada and Latin America, where 3M is the primary source of supply.”\n3M issued a statement last week saying that could have “significant humanitarian implications” for healthcare workers in Canada and Latin America. The company had said possible retaliation by other nations could actually lead to fewer of the masks being available in the U.S.\nThe premier of Canada’s most populous province, Ontario, said earlier Monday that U.S. officials had stopped 3 million masks from getting to Ontario from 3M, though he said was told that 500,000 of them were being released Monday.\nOntario Premier Doug Ford said that he was hopeful Canada would get an exemption and that he felt better about that after speaking with U.S. Trade Representative Robert Lighthizer.\n“It is absolutely critical that they except Canada from this presidential order,” Ford said.\nFord said delays in global shipments and recent restrictions at the U.S. border had left Ontario with about a one-week supply of critical protective equipment.\nCanadian Deputy Prime Minister Chrystia Freeland said the flow of medical equipment benefits both countries and needs to continue.\nState Department spokeswoman Morgan Ortagus said in a statement that U.S. Secretary of State Mike Pompeo had spoken to Canada’s foreign minister about it and “reiterated the United States’ desire to work with Canada to ensure the viability of international supply chains for crucial medical supplies and personnel, while also meeting the needs of regions with the most severe outbreaks.”\nCanadian Prime Minister Justin Trudeau has noted Canada supplies the U.S. with many supplies for the medical sector, including pulp for surgical-grade N95 masks, test kits and gloves. Canadian nurses also work in the U.S.", "url": "https://apnews.com/6fc6fefcd3054b11df83704bd3c4b500"}