{"authors": ["Analysis Stephen Collinson"], "date_download": "2020-05-04 16:06:11", "date_modify": "2020-05-04 16:06:11", "date_publish": "2020-04-02 04:07:57", "description": "President Donald Trump's White House appears powerless to halt an increasingly tragic trajectory in the coronavirus pandemic as the death toll climbed by nearly 1,000 on a single, dark day.", "filename": "2020_04_02_politics_donald-trump-coronavirus-leadership_index_1588608371.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191104123751-04-trump-1101-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_donald-trump-coronavirus-leadership_index_1588608371.html", "title": "As tragic toll from virus rises, so do questions about Trump's leadership", "title_page": "Trump's leadership raises questions as tragic toll from coronavirus rises - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "For all the formidable power of the White House, Trump and his top officials can do little more to urge Americans to stay home to ease the terrible demands being placed on medical staff in hospitals in worst-hit areas that are crammed with sick patients and running out of basic supplies. There is a feeling of a terrible storm approaching with the government predicting the worst over the next month or so.\n\"It's still heartbreaking when we think about the lives that could be lost -- and so our message yesterday, our message over the next 30 days, is the future is in our hands,\" Pence told CNN.\nThe vice president was speaking after the administration Tuesday warned that between 100,000 and 240,000 Americans could die from the virus -- even if mitigation efforts, like stay-at-home orders now affecting 9 in 10 Americans , are properly observed.\nThe deepening sense of foreboding is focusing debate on whether Trump -- who spent weeks downplaying the likely impact of the pandemic -- had cost lives by not being more proactive.\nDemocratic House Speaker Nancy Pelosi told CNN's Jake Tapper Sunday that Trump's \"denial at the beginning was deadly,\" saying that as the President \"fiddles, people are dying.\"\nThen there were calls Wednesday for the President to mandate a nationwide shutdown with some states still dragging their feet, even as Johns Hopkins University reported 216,515 confirmed cases in the US and 5,119 deaths as of midnight Wednesday -- figures that show that nowhere in the country is likely to be immune.\nAdding to the evidence that the federal government is falling short, officials confirmed that a national stockpile of ventilators and protective medical gear , desperately needed by frontline health workers, is all but exhausted.\nTrump has moved from denying the severity of the pandemic and agitating to open the economy to a recognition of how bad things could get.\n\"America continues to wage all-out war to defeat the virus -- this horrible, horrible virus,\" Trump said Wednesday. The President has extended nationwide self-distancing guidelines until April 30\nBut after an unusually somber appearance in the briefing room on Tuesday, the President was back to his habitual efforts to distract from any personal culpability for the situation.\nHe didn't even want to start his regular dinner time appearance before reporters by talking about the virus, on the deadliest day yet for Americans.\nInstead he highlighted a new anti-narcotics initiative in a fresh example of how he has often sought to turn coronavirus briefings into the political platform he lacks with campaign rallies canceled.\nBizarrely, the President also boasted about his popularity on Facebook, and suddenly floated a scheme to build two new hospital ships -- a project that would take years in the event the Navy commissions them.\nAnd Trump and Pence dodged on tough questions about the crisis -- for instance, on loopholes in Florida's belated stay-at-home directives finally imposed by Republican Gov. Ron DeSantis, a Trump ally. After Pence waffled on a query over whether Obamacare exchanges could be opened up to help Americans who lost insurance along with their jobs when the economy was shut down, Trump poured praise on his vice president.\n\"That was one of the greatest answers I've ever heard, because Mike was able to talk for five minutes and not answer your question,\" Trump told a reporter.\nHis performance appeared to confirm the skepticism of critics who saw his much hailed change of previous tone about the scope of the virus as a temporary departure from his unchained norm.\nNew questions about Trump's responsibility\nAs the crisis gets worse, with the federal government now predicting between 100,000 and 240,000 Americans could die, even if self-distancing works, the question over whether the death toll could have been eased with an earlier White House response are becoming ever more acute.\nThe White House claims that Trump's leadership has been all but perfect, despite his downplaying of the virus and failure to order a huge preparation effort when it took hold in China.\nBut a Trump adviser working with the task force told CNN's Jim Acosta that Trump bet that warmer weather in the spring would cause the virus to dissipate.\n\"He took a gamble and got it wrong,\" the adviser said. \"He analyzed the data and opinions of experts and sided with the one that said warm weather will likely slow the virus.\"\nSuch a decision could turn out to be one of the most fateful moments of the US response to the pandemic. The indications of how Trump handled the approaching storm will fuel claims by Democrats that he cost lives by not acting more quickly.\nThe President also tried to deflect blame on Wednesday, insisting no one could have predicted that the US could be struck by a disease that would spread like wildfire among the population.\n\"This is so contagious. Nobody's ever seen anything like this, where large groups of people all of a sudden, just by being in the presence of somebody, have it,\" he said in the briefing.\nThat argument was untrue. As China faced a rising challenge from the virus and quarantined the city of Wuhan, the virulence of the pandemic was obvious and could be gleaned from news sources.\nAt the end of February, a senior Centers for Disease Control and Prevention official, Nancy Messonnier, warned publicly that \"disruption to everyday life may be severe.\"\nTrump also confirmed Wednesday that the government was nearing the end of its stocks of items like protective personal equipment and ventilators.\nOfficials said that the stockpile was never meant to be the sole source of supply for items like protective equipment and that local authorities should seek to fill their need on the open market. That will come as terrible news to state governors and frontline health care workers who are pleading for more equipment -- and for Trump to fully unleash the power of government to surge manufacturing of such items.\nRepublicans blame impeachment for virus response delays\nThe scale of the looming disaster would have tested any administration and was bound to highlight flaws in governance at the local and state level as well. But Trump is being criticized so vehemently because he was so vocal in dismissing the threat from the virus for weeks. It also took him a prolonged period to fully embrace the warnings of his scientific advisers on the need for national self-distancing measures.\nAs the continuing inadequacy of the federal government effort becomes clear, a coordinated effort by the White House and Republican allies to redirect blame is under way.\n\"I will be very candid with you and say that in mid-January the CDC was still assessing that the risk of the coronavirus to the American people was low,\" Pence said.\n\"The very first case, which was someone who had been in China -- in late January around the 20th day of January,\" Pence told CNN's Wolf Blitzer. \"The reality is that we could've been better off if China had been more forthcoming.\"\nThere are serious questions about China's cooperating in sharing data about the specifics of the virus. But anyone watching the news could have concluded the new respiratory disease sooner or later was likely to arrive on US shores.\nIn fact, Miami Mayor Francis Suarez told CNN's Wolf Blitzer on Wednesday that his fire chief made such an evaluation on Super Bowl weekend -- February 1 and 2 -- and ordered protective equipment for his crews, who are as a result now well stocked.\nSenate Republican Majority Leader Mitch McConnell opened another front in the effort to deflect criticism from the President on Tuesday, saying that the impeachment saga had distracted Washington from the looming threat of the virus.\nHis spin was enthusiastically taken up by Republican senators.\n\"I think there's no question it was a huge distraction,\" Missouri Sen. Roy Blunt told Hugh Hewitt on his radio show Wednesday. \"Now it doesn't mean we weren't paying any attention to what was happening in China or other places, but there's no doubt it was a huge distraction.\"\nOn the same show, Texas Republican Sen. Ted Cruz said there was \"zero interest manifested by either (House Speaker) Nancy Pelosi and (Senate Democratic Minority Leader) Chuck Schumer in the coronavirus outbreak, in anything problematic occurring in China and the Chinese Communist government's coverup of the coronavirus outbreak.\"\nSuch arguments ignore the primary responsibility of the executive in keeping Americans safe. A future investigation will for sure probe whether Washington as a whole took the investigation sufficiently seriously and may find that Congress was asleep at the switch.\nBut the impeachment argument is questionable for several reasons. First, the most visible public official dismissing the seriousness of the coronavirus threat was the President himself.\nAnd Trump was acquitted on charges of abusing power and obstructing Congress after a Senate trial on February 5.\nOn January 26, Schumer, the top Senate Democrat, called on the administration to declare a public health emergency over coronavirus to free up funding.", "url": "https://www.cnn.com/2020/04/02/politics/donald-trump-coronavirus-leadership/index.html"}