{"authors": ["Natalie Gallón"], "date_download": "2020-05-04 16:24:47", "date_modify": "2020-05-04 16:24:47", "date_publish": "2020-04-07 00:47:44", "description": "Venezuelans who once fled their homes for neighboring Colombia are now returning to their country.", "filename": "2020_04_06_americas_coronavirus-venezuela-refugees-intl_index_1588609487.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406202626-01-venezuela-migrants-0405-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_americas_coronavirus-venezuela-refugees-intl_index_1588609487.html", "title": "Venezuelan refugees are returning home amid coronavirus", "title_page": "Venezuelan refugees are returning home amid coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Venezuelans who once fled their homes for neighboring Colombia are now returning to their country.\nAs the coronavirus pandemic shuts down Colombia's flights, borders and economy, some Venezuelan migrants say they see little choice but to return home -- where they may face still worse economic devastation and a crumbling health infrastructure.\nAs of Monday, the deadly virus has killed 46 and infected 1,579 people in Colombia, which is under a nationwide quarantine expected to end April 26.\n\"We want these days which are going to change our daily lives, which are going to alter our common and ordinary life, to serve to protect those who need it most,\" said Colombian President Iván Duque, when he announced the quarantine. The country's most vulnerable residents, he said, would receive the state's support.\nBut many of the 1.6 million Venezuelans in the country, cannot access help. According to the United Nations Refugee Agency, nearly 60% of Venezuelans in Colombia have not registered with the government and therefore cannot access vital services. Those who work irregular jobs are finding their only income dried up, and some are so desperate that they're picking up their few belongings and beginning the long, arduous trek home by foot.\nYormedis Quevedo, 21, was working at a café in Colombia's capital of Bogotá for about three months before the virus found its way into the country. After business slowed down, she was let go.\nA week ago, she and her 2-year-old son lived in a hotel room. Now, they are living on the streets. Speaking to CNN on the phone, Quevedo said she's debating going back to Caracas, the home she left over a year ago. \"I am thinking about returning to Venezuela, but I don't have the money to leave,\" she said. \"I can't walk there because of my son, but the streets here in Bogotá are hard and I have nowhere to go.\"\n\"I sold bags. I also worked in delivery restaurants because several people gave me that opportunity, but with the situation that is happening with the coronavirus, it is no longer the same,\" Paul Regales told Reuters as he walked on the side of a highway behind a light blue facemask.\n\"If there are no people on the street, how will we work?\" he said.\nAccording to a statement from Colombia's migration agency on Sunday, nearly 600 Venezuelans have returned to their country via the Simón Bolívar International Bridge in the border city of Cúcuta. More than 20 buses carrying children, women and men arrived on the border carrying \"foreigners\" who had voluntarily decided to leave for Venezuela, the statement said. According to the agency, their health was checked before they crossed the border.\nBut Venezuela may be an even more dangerous destination. With the country's health care system in a state of collapse and an economy on a constant downward spiral, local doctors fear Venezuela will be hard-hit by the virus. Lack of water, food, electricity and medical supplies, compounded with skyrocketing inflation and crushing US sanctions have left the country largely unprepared for a contagion. On Monday, Venezuela's Communication Minister Jorge Rodriguez announced 165 cases of Coronavirus and 7 deaths so far on state-run VTV.\nOn Saturday, Colombian President Duque called for solidarity between the neighboring nations. \"Colombia cannot fall into xenophobia or stigmatization of Venezuelan migrants,\" he said on Facebook, urging the country not turn their backs on those who are victims of a political crisis, and now victims of the pandemic.\nDespite the challenges caused by the virus's spread, Duque promised to continue with the assistance programs already in place to help migrants. But the pandemic has brought local and federal economic havoc to the country, and assistance is also needed by Colombian citizens.\n\"We can't pay their rent. We aren't paying it for the Colombians, let alone the Venezuelans. I am so sorry that we can't pay that. We already pay for food, births, daycare, schools, we offer employment,\" Bogotá's mayor Claudia López said Tuesday.\n\"I am so sorry that the only thing we can't cover is rent,\" she said, asking that the federal government provide more funds.\nEdyd Briceño, 29, from Maracay, Venezuela told CNN on the phone that ever since the virus crept in, there has been no work, making his already difficult life even more challenging.\nFor months, he's survived recycling items and selling \"tinto,\" black coffee in the streets of Bogotá. Today, he finds himself alongside Queveda and others, sleeping in the streets, debating when he should return to the place he once called home.\nHe has not been able to contact his family inside Venezuela, but he hopes to figure out how to make the trip by bus and avoid the journey on foot. \"I wish things were different, I really do\" he said with a hint of desperation in his voice. \"But with this virus there is nothing left for me.\"", "url": "https://www.cnn.com/2020/04/06/americas/coronavirus-venezuela-refugees-intl/index.html"}