{"authors": ["Senior Politics Reporter"], "date_download": "2020-05-04 20:25:38", "date_modify": "2020-05-04 20:25:38", "date_publish": "2020-04-29 22:52:47", "description": "The delay in disbursing the money \"is unnecessary and works against the federal government’s trust responsibility,\" House Democrats told Treasury.", "filename": "entry_tribes-covid-19-federal-relief-treasury-deb-haaland_n_5ea9decac5b633a8544487d9_1588623938.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9e3262500003111eb0953.jpeg?cache=ymyeujxx4f&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_tribes-covid-19-federal-relief-treasury-deb-haaland_n_5ea9decac5b633a8544487d9_1588623938.html", "title": "Tribes Were Supposed To Get $8 Billion In COVID-19 Aid. They've Gotten $0.", "title_page": "Tribes Were Supposed To Get $8 Billion In COVID-19 Aid. They've Gotten $0. | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Tribal governments were supposed to get $8 billion in direct emergency relief from the CARES Act, the $2 trillion COVID-19 stimulus bill that became law on March 27.\nMore than a month later, they haven’t gotten any of it.\nPart of the reason is that the Treasury Department, which is charged with distributing that money, has been flailing in its dealings with tribes.\nAnother reason stems from a lawsuit over whether Alaska Native Corporations are entitled to the money. A federal court on Monday agreed to stop funds from going to those corporations for now, which means Treasury has no reason to not funnel money immediately to the 574 federally recognized tribal governments struggling with the public health and economic fallout from the coronavirus pandemic.\nBill Clark via Getty Images Rep. Deb Haaland (D-N.M.), one of two historic Native American women in Congress, is urging the Treasury Department to hurry up and get emergency COVID-19 relief to tribes.\nIn a Wednesday letter, House Democrats pressed Treasury Secretary Steven Mnuchin and Interior Secretary David Bernhardt to distribute the money now because lives are at stake.\n“As you are aware, the detrimental impacts of the COVID-19 pandemic have had a disproportionate health care and economic impact on federally recognized tribes due a chronic lack of essential resources,” reads the letter signed by Democratic lawmakers including Deb Haaland of New Mexico, co-chair of the Congressional Native American Caucus; Ruben Gallego of Arizona, chair of the House Natural Resources Subcommittee for Indigenous Peoples of the U.S.; Raul Grijalva of Arizona, chair of the House Natural Resources Committee; and Assistant House Speaker Ben Ray Lujan of New Mexico.\n“We respectfully request the Treasury Department immediately begin to disburse the $8 billion of Coronavirus Relief Funds to eligible federally recognized tribal governments ... in recognition of the negative impact that every day of delay has on Tribes.”\nHere’s a copy of their letter:\nA request for comment from the Treasury Department was not returned on why it’s taken so long to get this money to tribes and when it expects to distribute it.\nTribal communities are among the most vulnerable to a rapid and devastating spread of the coronavirus. They face some of the highest rates of health conditions like diabetes, heart disease and asthma, all of which leave them more susceptible to the virus. They are often in remote parts of the country, where it’s tough to quickly disseminate resources and where families live in small homes shared with elderly family members who are particularly at risk. And the Indian Health Service, which provides health care to nearly 3 million Native Americans, is already notoriously and chronically underfunded.\nPut those pieces together and add to the situation that tribal governments still haven’t gotten their fair share of federal relief, and it’s not hard to imagine how quickly this could become a disaster.\n“It is a perfect storm,” Sen. Tom Udall (D-N.M.) told HuffPost in a recent interview.\nTo date, the Indian Health Service has reported more than 3,100 confirmed COVID-19 cases among federally recognized national tribes. Navajo Nation, for one, has reported more coronavirus cases per capita than all but two states.\nUdall, vice chair of the Senate Committee on Indian Affairs, said Wednesday that he plans to request oversight hearings on the way the federal government has distributed resources ― or not ― to tribes. He and other ranking Democrats on Senate committees wrote to Majority Leader Mitch McConnell (R-Ky.) urging him to focus on taking action on the coronavirus when the Senate comes back in session on May 4.\n“There is currently no scheduled legislative or committee business related to the COVID-19 public health and economic emergencies,” reads their Wednesday letter. “We respectfully urge you to have the Senate focus on COVID-19 related matters and oversight of all COVID-related legislation enacted by Congress.”", "url": "https://www.huffpost.com/entry/tribes-covid-19-federal-relief-treasury-deb-haaland_n_5ea9decac5b633a8544487d9"}