{"authors": ["Analysis Stephen Collinson"], "date_download": "2020-05-04 16:22:45", "date_modify": "2020-05-04 16:22:45", "date_publish": "2020-04-06 04:02:24", "description": "The United States is heading into one of the darkest chapters of its modern history so far deprived of the unifying and clear-sighted leadership that helped it prevail in earlier times of crisis.", "filename": "2020_04_06_politics_donald-_49bf81bd83b7ce7bd0065db0f9b98d54_index_1588609365.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405190737-02-coronavirus-briefing-0405-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_donald-_49bf81bd83b7ce7bd0065db0f9b98d54_index_1588609365.html", "title": "Trump sees 'light at the end of the tunnel' at start of 'Pearl Harbor' week", "title_page": "Donald Trump sees 'light at the end of the tunnel' at start of 'Pearl Harbor' week - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The United States is heading into one of the darkest chapters of its modern history so far deprived of the unifying and clear-sighted leadership that helped it prevail in earlier times of crisis.\nOne of Trump's top public health lieutenants Sunday reached for grave historical parallels when describing the agony of the days to come.\n\"The next week is going to be our Pearl Harbor moment. It's going to be our 9/11 moment. It's going to be the hardest moment for many Americans in their entire lives,\" US Surgeon General Jerome Adams warned on NBC's \"Meet the Press.\"\nThe analogies may be apt in expressing the historic enormity of the pandemic. But they also contain implications that are not flattering to the administration.\nThe United States was caught by surprise by Japan's attack on Hawaii and al Qaeda's strike on US soil, although in retrospect there were warning signs of both days that will live in infamy.\nBut contrary to Trump's claims that no one saw the approach of the virus, its advance on the US was obvious since at least January. Previous administrations also prepared for a pandemic and left plans that the Trump administration apparently ignored.\nAnd in the immediate aftermath of the attacks in 1941 and 2001, Presidents Franklin Roosevelt and George W. Bush unified the nation, bound its wounds and set it on a new course. But despite a small spike in his approval rating, which appears to be reversing in some recent polls, Trump is as divisive a figure as he has been for his three years in power.\nAfter one briefing hailed by pundits as a \"change of tone\" last week, when he admitted between 100,000 and 240,000 Americans could die, the President reverted to type. He blamed the Obama administration for the shortage of tests for the coronavirus, even though the pathogen was not discovered until last year.\nTrump predicted Sunday the storm would soon pass.\n\"We see light at the end of the tunnel,\" Trump said at his daily briefing, though he admitted that a \"horrific\" period lay ahead in an oddly upbeat message, given the earlier remarks by Adams.\nThe anti-malaria drug is being pushed by Trump's conservative supporters as a treatment for Covid-19 despite a lack of peer-reviewed clinical trials proving that it works. That push was on full display this weekend, during a heated disagreement in the Situation Room between Fauci and Trump's top trade adviser Peter Navarro, who is not a formal part of the task force but tried to make the case for the drug's effectiveness, a person familiar with the meeting said, CNN's Jim Acosta and Kaitlan Collins reported.\n\"What are you talking about?\" Fauci asked.\nAsked about the exchange and why he feels qualified to engage and disagree with Fauci on coronavirus treatment despite not being a medical doctor, Navarro told CNN's John Berman on \"New Day\" Monday, \"I'm a social scientist. I have a Ph.D. And I understand how to read statistical studies, whether it's in medicine, the law, economics or whatever.\"\nStates compete for supplies in a 'global jungle'\nIn recent days, Trump has anticipated a looming national shortage of ventilators for critically ill Covid-19 patients and accused governors of failing to properly prepare for a pandemic. He has also boasted that he has ordered the crash manufacture of thousands of ventilators, even though delays in activating his wartime powers will mean most will only be available by the end of June.\n\"If they had started in February building ventilators, getting ready for this pandemic, we would not have the problems that we have today, and, frankly, very many fewer people would die,\" Illinois Democratic Gov. J.B. Pritzker charged on CNN's \"State of the Union\" on Sunday.\nTrump lashed out at Pritzker later Sunday, saying that 600 ventilators from the federal stockpile had been or would be sent to Illinois and claiming the governor had failed to staff an overflow hospital.\n\"He has not performed well,\" Trump said.\nThe federal government has also been criticized for failing to put in place a central system for the procurement.\n\"We have had circumstances that we're trying to collect our PPE, our protective masks and we've been outbid by another state after we had the order confirmed,\" Arkansas Republican Gov. Asa Hutchinson told \"Meet the Press.\"\n\"So yes, that has been challenging for us. But we recognize that the federal government has said 'we're your backstop. You've got to get out there and compete,' And it literally is a global jungle that we're competing in now.\"\nWhile the President's daily briefings often begin with useful information for the public, they soon become an extension of his reality show. Last week, he cracked a joke about fashion models and boasted about his Facebook ratings while Americans died, raising questions about his capacity to shoulder the woes of a nation in mourning.\nOften, the President repeats details taken by the federal government day after day. He keeps mentioning the deployment of a Navy hospital ship to New York harbor and a hospital built in the Javits Center in New York City as if they are new announcements.\nThe President's daily updates of huge numbers of masks, gloves and gowns sent to hospitals may be a sign the government is catching up after a slow start.\nWhen there is important news — for instance when Americans were advised to wear masks when out in public — the President muddles the message and undercuts his own top public health officials in real time.\nHe has accused journalists and Democrats of hyping the coronavirus threat. He has swung backward and forward between stressing America's need to stay at home and offering overly optimistic predictions that the economy could soon start firing again.\nWhile his decision to close US borders to flights from China turned out to be shrewd, he has used it as a card to absolve him of any criticism of his approach before the virus arrived in the US.\nA month ago, the President promised that every American who wants a test can get one — a pledge that is still not close to being fulfilled despite misleading boasts that no nation has tested more suspected coronavirus patients than the United States when the most valuable metric in this regard is how many tests have been conducted per head of the population. The continuing shortages of tests could complicate the effort to get people back to work in the longer term.\nTrump's chaotic leadership style is not always reflected in the lower levels of his administration.\nTop medical officials on the task force like Fauci and Dr. Deborah Birx are trusted by many Americans -- though not by those on the conservative fringe who believe they are hyping the magnitude of the crisis. And Vice President Mike Pence, notwithstanding his incessant praise of Trump in public, has been important in keeping lines of communication open with governors who incur the President's wrath. Treasury Secretary Steven Mnuchin has been an effective dealmaker with Congress in framing plans to put the economy in suspended animation and to help millions of Americans who have lost their jobs.\nTrump 'the fighter' is back\nThe President has an obligation to keep national spirits up during a time of extremis. But optimism ought to be based on data and he is also duty-bound not to sugarcoat bad news -- especially given that the US figures are moving toward 350,000 and there have been more than 9,500 deaths\nThere has often been the impression that Trump is playing to his Fox News gallery in his attacks on reporters asking straight questions about the federal response and assaults on governors asking for more federal help.\n\"Donald Trump the fighter is back,\" Fox News host Laura Ingraham tweeted approvingly.\nThat the bottom has not entirely fallen out of Trump's presidency after such a shaky and self-regarding performance is testimony to his success in discrediting objective sources of news and accountability in the eyes of his followers.\nBut the President has spent so much time defending his earlier comments that the virus didn't represent a threat -- that it was like the flu and it would go away -- that it has hampered his capacity to get a grip on the administration's public message.\nSome critics have accused Trump of turning the briefings into the campaign rallies that he can no longer hold with the more than 90% of Americans currently advised to stay in their homes. He seems to be trying to dominate television airtime and to prepare the ground to declare a great victory over the virus ahead of his reelection.\nIronically, the best way for Trump to have secured reelection in November would have been to eschew politics altogether and devote his presidency entirely to mobilizing a nation in the worst domestic crisis since World War II.\nEven with his late start, Americans who did not necessarily support him might have given him a break. Almost every national crisis reveals deficiencies in government. Trump is not alone in not being prepared; states also failed to ready themselves for a pandemic. And there's sufficient blame left over for previous administrations in some respects.\nBut instead of putting politics aside, Trump on Friday fired the intelligence community inspector general who had told Congress about the whistleblower complaint that led to his impeachment.\nMeanwhile the President has not been flattered by comparison with several governors who have emerged as the faces of the fight against the pandemic, for instance New York Democratic Gov. Andrew Cuomo.\nTrump is not wrong to press his medical aides on whether hydroxycholoroquine, an anti-malaria drug should be prescribed to Covid-19 patients given anecdotal evidence that it has helped alleviate symptoms in some cases in Italy and China.\nYet his enthusiasm for the drug ignores that it hasn't been approved by the Food and Drug Administration for coronavirus patients.\nAfter all but prescribing it for himself on Saturday, the President said the drug, which could cause serious side effects and can be toxic in combination with other therapies, should be used to keep Americans alive.\n\"What do I know? I am not a doctor. But I have common sense,\" Trump said Sunday.", "url": "https://www.cnn.com/2020/04/06/politics/donald-trump-coronavirus-history-health-economy/index.html"}