{"authors": ["Andrew Demillo"], "date_download": "2020-05-04 20:07:39", "date_modify": "2020-05-04 20:07:39", "date_publish": "2020-04-08 04:26:01", "description": "LITTLE ROCK, Ark. (AP) — Arkansas Gov. Asa Hutchinson spoke to lawmakers wearing face masks and spread out across two locations — including a basketball arena — as they met Wednesday for a...", "filename": "_d677352c887285ad18260ef6f4b6357f_1588622859.html", "image_url": "https://storage.googleapis.com/afs-prod/media/1dd50747625a4d72ac164e28ece4d441/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d677352c887285ad18260ef6f4b6357f_1588622859.html", "title": "Arkansas governor addresses state of the state amid outbreak", "title_page": "Arkansas governor addresses state of the state amid outbreak", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Arkansas Gov. Asa Hutchinson gives the State of the State address on Wednesday, April 8, 2020, in the senate chamber of the state Capitol in Little Rock, Arkansas. The Arkansas House of Representatives, which met across town at the Jack Stephens Center, watched the address via live video stream. (Tommy Metthe/Arkansas Democrat-Gazette via AP)\nArkansas Gov. Asa Hutchinson gives the State of the State address on Wednesday, April 8, 2020, in the senate chamber of the state Capitol in Little Rock, Arkansas. The Arkansas House of Representatives, which met across town at the Jack Stephens Center, watched the address via live video stream. (Tommy Metthe/Arkansas Democrat-Gazette via AP)\nLITTLE ROCK, Ark. (AP) — Arkansas Gov. Asa Hutchinson spoke to lawmakers wearing face masks and spread out across two locations — including a basketball arena — as they met Wednesday for a legislative session against the backdrop of the coronavirus crisis.\nWith schools and many businesses closed because of the pandemic, the Republican governor told lawmakers that he’ll need their help cutting his proposed budget.\n“We are here today for regular business at a time in our world when everything seems irregular,” Hutchinson told a sparsely filled Senate chamber during his State of the State address. His remarks were broadcast live to the 5,600-seat Jack Stephens Center at the University of Arkansas at Little Rock, which was serving as a makeshift House chamber.\nHutchinson proposed a $5.8 billion budget for the coming year last month, a week before the state logged its first coronavirus case. Finance officials have since lowered their revenue projections by $205 million.\n“We will maintain our commitment to funding public education, public safety and Medicaid, but to do so we will need to have some reserve funds with flexibility and oversight to be sure there is no gap in essential services,” he said.\nThe session, which House and Senate leaders say they hope to wrap up in less than two weeks, is the second time the Legislature has met during the pandemic. It met for a marathon session last month to create a $173 million coronavirus rainy day fund.\nAt least 1,071 people in Arkansas have tested positive for the virus, including three House members. For most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia.\nEighteen people in the state have died from COVID-19, the illness caused by the virus.\n“We have seen firsthand how quickly it hits and how slowly it leaves,” House Speaker Matthew Shepherd said.\nHutchinson has closed the state’s public schools, banned gatherings of more than 10 people and closed many businesses to slow the spread of the disease. But he has stopped short of a broader stay-at-home order as have been issued in most other states.\nBoth chambers of the Legislature have imposed restrictions, including requiring members, reporters and staff to be screened before entering. The Senate has limited how many members can be in its chamber. The public has been barred from the proceedings, which are being broadcast live on the Internet. Both chambers are also allowing members to vote by proxy.\nSenate President Jim Hendren said leaders hope to move 90 budget bills out of committee this week and to release the legislation outlining the state’s overall budget by Friday.\nThe majority-Republican Senate on Wednesday rejected a long-shot bid by Democrats to delay individual income tax cuts approved last year for the state’s top earners, which the move’s supporters say would save the state $100 million.\n“When the Legislature passed the tax cut, nobody knew COVID-19 was going to hit,” said House Minority Leader Fred Love, who proposed the delay.\n___\nCheck out more of the AP’s coronavirus coverage at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/d677352c887285ad18260ef6f4b6357f"}