{"authors": [], "date_download": "2020-05-04 20:24:46", "date_modify": "2020-05-04 20:24:46", "date_publish": "2020-04-17 15:37:23", "description": "WICHITA, Kan. (AP) — A major aircraft parts supplier in Kansas is expected to bring about 2,100 furloughed workers back to work next week as Boeing prepares to resume production of its commercial...", "filename": "_b4fdbbd4081b05d163f85be60209509e_1588623886.html", "image_url": "https://storage.googleapis.com/afs-prod/media/bbe2b7ae6be54abbb2280a27889dfca1/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b4fdbbd4081b05d163f85be60209509e_1588623886.html", "title": "Spirit AeroSystems bringing back some furloughed workers", "title_page": "Spirit AeroSystems bringing back some furloughed workers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this undated photo Boeing 737 Max fuselages sit on a tarmac outside of the Spirit AeroSystems' factory in Wichita, Kansas. Spirit is expected to bring about 2,100 furloughed workers back to work Monday, April, 20, 2020, as Boeing prepares to resume production of its commercial airplanes. Boeing is Spirit AeroSystem's biggest customer. (Travis Heying/The Wichita Eagle via AP)\nIn this undated photo Boeing 737 Max fuselages sit on a tarmac outside of the Spirit AeroSystems' factory in Wichita, Kansas. Spirit is expected to bring about 2,100 furloughed workers back to work Monday, April, 20, 2020, as Boeing prepares to resume production of its commercial airplanes. Boeing is Spirit AeroSystem's biggest customer. (Travis Heying/The Wichita Eagle via AP)\nWICHITA, Kan. (AP) — A major aircraft parts supplier in Kansas is expected to bring about 2,100 furloughed workers back to work next week as Boeing prepares to resume production of its commercial airplanes.\nSpirit AeroSystems also is planning resume work for more than 1,700 other workers in Wichita over the next three weeks, The Wichita Eagle reported .\n“As our customer, Boeing, begins to resume production, Spirit AeroSystems will work with our employees, customers and suppliers to begin a phased-in return to work for some furloughed employees,” Spirit spokeswoman Keturah Austin said.\nShe added that “this will be a slow process as we work to continue to support our customer’s operations in a manner that is safe for all involved.”\nBoeing said Thursday it will restart production of its commercial airplanes next week in the Seattle area, putting about 27,000 people back to work at its facilities in the Seattle area after operations were suspended because of the COVID-19 pandemic. Boeing employees for the 737, 747, 767 and 777 airplanes will return as early as Monday with most returning to work by Tuesday,\nBoeing is Spirit AeroSystem’s biggest customer, and the impact has rippled to its suppliers.\nAbout 2,100 workers, hourly and salaried, are scheduled to return to various production lines at the Spirit plant in Wichita on Monday, according to a union officials and numbers obtained by the newspaper. They’ll be joined by another 200 workers on April 27; an additional 1,100 on April 29 and nearly 400 on May 4.\nCornell Beard, president of Machinists District Lodge 70, said the returning union workers are still a fraction of the plant’s full work force, “but anything’s better than nothing.”\nThe coronavirus has exacerbated Boeing’s crisis surrounding the 737 Max, which remains grounded after two deadly crashes. Boeing said Thursday its 737 program “”will resume working toward restarting production”″ of the 737 MAX.\nSpirit produces about 70% of the 737 Max, including the fuselage. Contracts with Boeing for the Max represents more than half of Spirit’s annual income.\nFuture callbacks at Spirit will be largely dependent on Boeing’s performance in getting the 737 Max back in the air, Beard said.\n“If another mistake is found, or another defect, or if we just encounter another problem, those projections will change again (and) we’re going to be right back in this pickle,” Beard said.", "url": "https://apnews.com/b4fdbbd4081b05d163f85be60209509e"}