{"authors": ["Jacqueline Howard", "Gina Yu"], "date_download": "2020-05-04 16:19:41", "date_modify": "2020-05-04 16:19:41", "date_publish": "2020-04-04 14:30:24", "description": "It's a question that many want answered: Exactly how many people recover from Covid-19?", "filename": "2020_04_04_health_recovery-_e977852dc7840f06a22d91be6708656c_index_1588609181.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200221130556-coronavirus-image-university-of-hong-kong-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_health_recovery-_e977852dc7840f06a22d91be6708656c_index_1588609181.html", "title": "Most people recover from Covid-19. Here's why it's hard to pinpoint exactly how many", "title_page": "Most people recover from Covid-19. Here's why it's hard to pinpoint exactly how many - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Atlanta (CNN) It's a question that many want answered: Exactly how many people recover from Covid-19?\nMost people with Covid-19 have mild illness and are able to recover at home without medical care, while severe cases often receive supportive care in the hospital, according to the US Centers for Disease Control and Prevention.\nAlthough there have been regional, national and global data on confirmed cases and deaths, not much has been reported on recovery.\nJohns Hopkins University, which is among few institutions that have been tracking recovered cases, has been doing so since its data collection on Covid-19 cases was first made public in an online dashboard in January, Douglas Donovan, a spokesman for the university in Baltimore, said in an email on Friday.\n\"The category for recoveries began when the outbreak was centered in China, which was issuing official reports on recoveries,\" Donovan said in the email.\nThen as the outbreak spread around the world, the researchers realized that there were few methods for reporting recoveries and so they decided to limit reports to country estimates only.\n\"Recovered cases outside China are country-level estimates based on local media reports and may be substantially lower than the true number,\" Donovan said.\nAs for US cases, \"the dashboard is not reporting estimates for state and county recoveries in the United States. That may change as more uniform reporting for recoveries expands among local and state governments,\" he said. \"Currently there is no uniform method for reporting recoveries across the United States. If that changes the dashboard will reflect those numbers accordingly.\"\nAs of Saturday, more than 223,000 people worldwide have recovered from Covid-19, according to data from the Johns Hopkins University dashboard. The actual figure is likely to be higher since the data only cover confirmed cases.\nWhy tracking recovered cases is important\nKnowing the number of recovered cases could help provide an accurate measure of the total number of people that have been infected, said Dr. Bala Hota , a professor of infectious diseases and the associate medical officer for Rush University Medical Center in Chicago.\n\"Knowing the real number of infected people in the population would be very useful to have better models of when disease will peak and decline, and also when we can begin to return people to work,\" Hota said.\nRecovery data also could indicate how easily people can build immunity against the virus.\n\"Previously infected people will be able to be excluded as susceptible individuals in modeling, which would impact the prediction of how many cases will occur in the near future,\" Hota said. \"At an individual level, if people can know if they were asymptomatically or mildly infected and recovered, they can know that they are immune and can safely return to work once the shelter at home is eliminated.\"\nThere's no evidence to date that people who recover from Covid-19 can get re-infected with the novel coronavirus -- though there isn't a lot of data in general, Hota said. He added that identifying those who recover could help indicate those who have built immunity, at least in the short term.\n\"This is a little bit of an understudied group,\" Hota said about recovered Covid-19 patients. \"Being able to [identify recovered patients]...and say you've been exposed, you've recovered, and we believe you're immune, I think that'll be very powerful.\"\n'Recovery ... can take some time'\nCurrently there is no treatment for Covid-19 approved by the US Food and Drug Administration, but those infected can recover with appropriate care to relieve and treat symptoms.\nThe CDC has noted that for those with Covid-19 isolated at home, they are considered recovered if they meet three criteria:\nNo fever for at least 72 hours without using fever-reducing medications Improvement in other coronavirus-related symptoms, such as cough or shortness of breath A period of at least seven days has passed since symptoms first appeared\nIf they have access to testing, the criteria includes two consecutive tests that are negative and 24 hours apart, along with no longer having a fever and seeing improvement in symptoms.\nRecovered doesn't mean that a patient immediately returns to feeling healthy. Hota said that many of his patients feel tired and still have a lingering cough even if they meet the recovery criteria.\n\"Recovery ... can take some time,\" Hota said.\nIt can take several weeks to fully recover from illness caused by the novel coronavirus, Dr. Mike Ryan, executive director of the World Health Organization's Health Emergencies Programme, said during a briefing in Geneva in early March\n\"It takes anything up to six weeks to recover from this disease,\" Ryan said. \"People who suffer very severe illness can take months to recover from the illness.\"\nRyan added that recovery is often measured as the patient no longer exhibiting symptoms and having two consecutive negative tests for the virus at least one day apart -- but some countries may measure \"recovery\" differently.\nAlso, confirming recovery can differ from confirming whether someone is still carrying the virus -- and that's where some confusion may emerge.\nHow long can the virus linger in the body?\nEstimates have ranged regarding how long the novel coronavirus may linger in the body.\nOne paper published in the medical journal JAMA in February tracked the recovery of four medical professionals in Wuhan, China, who were confirmed to have Covid-19. One was hospitalized and the three others were quarantined, but they were all treated at Zhongnan Hospital of Wuhan University in January and February.\nThe paper found that traces of the novel coronavirus still could be detected in all four patients up to 13 days after their symptoms had ended and they met criteria for hospital discharge or discontinuation of quarantine.\n\"Further studies should follow up patients who are not health care professionals and who have more severe infection after hospital discharge or discontinuation of quarantine,\" the researchers wrote in that paper.\nA separate study , published in The Lancet medical journal in March, found that the virus might be detected for up to 37 days in patients who recover from Covid-19.\nThat study included data on 191 Covid-19 patients in Wuhan who had either been discharged from the hospital or died by the end of January.\nThe data showed that among the survivors, the median duration of which the virus could be detected was 20 days from the onset of their illness. The shortest observed duration of viral shedding among survivors was eight days and the longest was 37 days, the researchers found.\nAmong those who died, the researchers found that \"the virus was continuously detectable until death.\" The researchers wrote in the study, \"sustained viral detection in throat samples was observed in both survivors and non-survivors.\"\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nOverall, Rush University Medical Center's Hota, who was not involved in either study, has cautioned against thinking someone who tests positive for the virus is also infectious.\nThe CDC notes that Covid-19 is thought to spread mainly through close contact between people in respiratory droplets, such as droplets that come from coughs or sneezes. While people who are infected often have symptoms of illness, the CDC warns that some people without symptoms also may be able to spread the virus.\nSpecifically, testing \"doesn't give you any information if that virus is what we call viable or can live and can cause subsequent infections,\" Hota said. \"So the testing can detect the genetic material, but it doesn't mean that somebody's necessarily still infectious.\"", "url": "https://www.cnn.com/2020/04/04/health/recovery-coronavirus-tracking-data-explainer/index.html"}