{"authors": ["Reporter"], "date_download": "2020-05-04 21:06:49", "date_modify": "2020-05-04 21:06:49", "date_publish": "2020-04-30 19:43:04", "description": "Kentucky is facing a potential 20% decline in tax revenues and a $300 million-plus budget shortfall thanks to the coronavirus pandemic.", "filename": "entry_mitch-mcconnell-kentucky-bailouts-coronavirus_n_5eaafabdc5b633a85446d7d2_1588626409.html", "image_url": "https://img.huffingtonpost.com/asset/5eab052d300000c91215535b.jpeg?cache=gysfvmvllu&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_mitch-mcconnell-kentucky-bailouts-coronavirus_n_5eaafabdc5b633a85446d7d2_1588626409.html", "title": "Mitch McConnell’s Plan To Let States Go Bankrupt Could Devastate His Own", "title_page": "Mitch McConnell’s Plan To Let States Go Bankrupt Could Devastate His Own | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Senate Majority Leader Mitch McConnell’s reluctance to approve what he dismissively called a “blue state bailout” for states struggling to shore up their budgets could devastate the Republican leader’s home state of Kentucky, which is looking at massive budget problems of its own.\nKentucky will face a budget shortfall of at least $318.7 million this year as the coronavirus pandemic hammers tax revenues, state budget director John Hicks said in a quarterly revenue report sent to Gov. Andy Beshear (D) on Thursday. Under the worst-case scenario, Hicks predicted, the shortfall could be nearly $500 million.\nKentucky’s “revenue outlook has changed dramatically due to the COVID-19 pandemic,” Hicks wrote in a letter that accompanied the updated projections. “The economic outlook” for Kentucky, he said in the forecast, “is bleak.”\nThe figures provide a glimpse of the crisis facing many states as declines in tax revenue leave them with gaping budget holes they cannot fill without deep spending cuts ― or help from Washington.\nBeshear has already said that Kentucky will need federal aid in order to blunt the pain the crisis is causing.\n“It will cripple our efforts to rebuild if we don’t see a relief package, not just for states, but for cities and counties,” Beshear said at a news conference last week.\nPatrick Semansky/AP Photo Let 'em go bankrupt, says Senate Majority Leader Mitch McConnell.\nBut McConnell rejected congressional Democrats’ calls for billions of dollars in state aid last week, saying that he would oppose efforts to “borrow money from future generations” to bail out the states. McConnell placed blame for shortfalls on states’ underfunding of their public pension systems and said Senate Republicans had “no desire” to help address those problems.\nLetting states go bankrupt ― which would require a change in the law, one that some prominent conservatives have been arguing for ― would be a better option, McConnell said. On Monday, following a flood of criticism, he changed course slightly, saying that bankruptcy was only a suggestion states should be able to consider and that the next relief bill may include aid to states, although he attached conditions that Democrats aren’t likely to support.\nAsked for comment on the new Kentucky budget projections and increasing calls for federal help, McConnell’s Senate office pointed to statements he made during a Thursday morning appearance on Fox News.\n“The point is we are not interested in borrowing money from future generations to send down to states to help them with bad decisions they’ve made in the past unrelated to the coronavirus epidemic,” McConnell said. “We are more than happy, and already have, sent $150 billion down to states and localities to deal with the pandemic.”\nRyan C. Hermens/Lexington Herald-Leader via AP Kentucky Gov. Andy Beshear warned, “It will cripple our efforts to rebuild if we don’t see a relief package, not just for states, but for cities and counties.”\nKentucky, which McConnell has represented in the Senate since 1985, had 4,539 confirmed coronavirus infections and 235 deaths as of Wednesday evening, a relatively modest number compared to other states. Although Beshear’s aggressive early moves to close schools, businesses and churches helped limit the spread of the virus, Kentucky’s economy has been among the nation’s hardest hit. About 500,000 Kentuckians, or roughly a quarter of its workforce, have filed for unemployment since the outbreak began, according to the U.S. Department of Labor.\nThe state will feel the effects for months.\nLost jobs and declines in consumer spending mean state tax revenues could be 18% to 24% lower in the current fiscal quarter than they were last year, Hicks projected. That would cause Kentucky’s first yearly decline in revenues in a decade, the budget office said. It projected that every source of state tax revenue will experience declines that will last through the end of 2020. Kentucky could face a total shortfall of more than $1 billion next fiscal year.\nKentucky state lawmakers have already taken steps to prepare for the looming financial crisis. They scaled back spending and revenue plans in early April, approving a budget well below the revenue levels that forecasters had initially projected the state would reach this year. The shoestring plan froze public education spending and salaries for public employees, including teachers, at 2019 levels, despite Beshear’s proposals to increase both. State Senate President Robert Stivers (R) said a month ago that the budget would still leave Kentucky facing a $200 million shortfall.\nThe new forecasts suggest it will be even worse than lawmakers planned for when they outlined the budget, said state Sen. Morgan McGarvey (D), the Senate minority leader.\n“We know there’s going to be big revenue shortfalls, and we know states provide vital and essential services for the citizens,” said McGarvey, who sits on the state Senate budget committee. “As revenues continue to decline, those services are going to be hit in a way that impacts people’s daily lives.”\nCity Budgets In Peril\nCity leaders across Kentucky have also forecast massive shortfalls. Louisville has taken a $46 million revenue hit since stay-at-home orders went into effect in mid-March, and further declines will leave it with a $115 million projected shortfall for the fiscal year that ends July 1. That hole is about five times larger than it faced in 2019, Mayor Greg Fischer said in his annual budget address last week.\nLouisville received more than $100 million of the $2.4 billion in federal aid sent to Kentucky under the Coronavirus Aid, Relief, and Economic Security Act, but the law prevents cities and states from using the funds to generally replace lost revenues. Without federal relief, Fischer warned, Kentucky’s largest city could be forced to furlough 1,000 public workers ― a fifth of the city government’s workforce. Sixty percent of city employees are first responders, Fischer said.\n“During this very time when we’re struggling as a country and as communities, we don’t need to be cutting back on our first responders,” Fischer said in an interview. “We need direction from D.C., hopefully sooner rather than later, that they’re going to be helping states and local governments here.”\nLexington, Kentucky’s second-largest city, is facing a $40 million shortfall, and the Lexington-based University of Kentucky, one of the state’s biggest employers, has already furloughed 1,700 workers as it attempts to close a $70 million budget hole.\nSmaller cities and counties, especially across large parts of long-struggling eastern Kentucky, are anticipating revenue declines as large as 30%, the Lexington Herald-Leader reported.\nCounty leaders from both parties have suggested the hits could leave them unable to provide basic services, and they’ve called for assistance from lawmakers in Frankfort. But Kentucky is required to balance its budget, limiting how much aid it can provide its cities and counties.\n“We can’t take on debt, so we can’t come up with a plan like the feds did, where they inject billions of dollars to help people,” McGarvey said.\n‘Trying To Blow Up The Pension System’\nKentucky teachers, who in 2018 staged protests over pension overhauls proposed by then-Gov. Matt Bevin (R), are increasingly worried that the state fiscal crisis will be used to target their retirement benefits, said Eddie Campbell, president of the Kentucky Education Association, the state’s largest teachers union.\nOther Kentucky labor leaders see McConnell’s support for letting states go bankrupt as merely his latest effort to undermine state pension systems.\n“It’s a purely political move on McConnell’s part,” said Ron Richmond, the political and communications director for American Federation of State, County, and Municipal Employees Local 962, the union that represents public workers in Kentucky and Indiana. “A lot of people have had their eye on the prize of trying to blow up the pension system. They have targets they want to take out ― structures that are typically worker-based. It’s opportunistic.”\nKentucky’s public pension system is among the nation’s worst-funded, although lawmakers made a full contribution to it even in the scaled-back budget they approved in early April.\nDavid Frum, a former speechwriter for President George W. Bush, wrote last week that state bankruptcies are McConnell’s backdoor for the GOP to “impose its priorities upon the budgets” of states it doesn’t control ― and potentially shed state pension obligations that are often enshrined in state constitutions.\nBankruptcy, Frum wrote for The Atlantic, could allow states to prioritize the interests and finances of wealthy investors and bondholders, some of whom rank among McConnell and the GOP’s top campaign donors, over current and future pensioners, many of whom are state employees less likely to vote Republican. That would especially benefit Republicans and their backers in the blue states that McConnell is so reluctant to help, Frum wrote.\nASSOCIATED PRESS Amy McGrath, who is seeking the Democratic nomination to run against McConnell, blasted his suggestion that states should be allowed to go bankrupt, saying it threatened public worker pensions.\nMcConnell’s initial refusal to support federal aid has already factored into his bid for a seventh term in Washington. Retired fighter pilot Amy McGrath, widely considered the front-runner in Kentucky’s Democratic Senate primary, said in a statement highlighting local budget problems that McConnell was “telling all the Kentucky teachers, police and firefighters that their pensions aren’t worth saving.”\n“Special interests win. We lose. Same old Mitch,” McGrath said in a new ad campaign that hammered McConnell over his suggestion that states should go bankrupt.\nMcConnell’s bankruptcy idea would mean “that every hardworking public employee is in danger of losing his or her job, health care, and retirement benefits,” state Rep. Charles Booker, who is also seeking the Democratic Senate nomination, said in a statement.\n“I’ll be damned,” Booker said, “if we’re gonna let Mitch McConnell kick our families off the cliff.”", "url": "https://www.huffpost.com/entry/mitch-mcconnell-kentucky-bailouts-coronavirus_n_5eaafabdc5b633a85446d7d2"}