{"authors": ["Rob Picheta"], "date_download": "2020-05-04 16:52:49", "date_modify": "2020-05-04 16:52:49", "date_publish": "2020-04-08 10:04:59", "description": "Cat owners who are self-isolating or have Covid-19 symptoms should consider keeping their pets indoors to stop them carrying the virus on their fur, a veterinary body has advised.", "filename": "2020_04_08_health_coronavir_c3f2b211144bbc62b3d511a327323ec6_index_1588611169.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191026120640-04-black-cat-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_health_coronavir_c3f2b211144bbc62b3d511a327323ec6_index_1588611169.html", "title": "Keep your cat indoors if you're self-isolating to limit spread of coronavirus, vets advise owners", "title_page": "Cats should be kept indoors if you're self-isolating to limit spread of coronavirus, vets advise owners - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Cat owners who are self-isolating or have Covid-19 symptoms should consider keeping their pets indoors to stop them carrying the virus on their fur, a veterinary body has advised.\nThe British Veterinary Association said animals \"can act as fomites\" (objects that can become contaminated with infectious organisms) and could hold the virus on their fur if they are petted by someone who has contracted it.\n\"For pet owners who have Covid-19 or who are self-isolating we are recommending that you keep your cat indoors if possible, during that time,\" the BVA said in a statement. \"The virus could be on their fur in the same way it is on other surfaces, such as tables and doorknobs.\"\nThe body said, however, that its main advice to pet owners was to practice good hand hygiene.\nIt stressed that it is not suggesting all cats should be kept indoors, and said owners should do so \"only if the cat is happy to be kept indoors,\" acknowledging that \"some cats cannot stay indoors due to stress-related medical reasons.\"\nRead More", "url": "https://www.cnn.com/2020/04/08/health/coronavirus-cats-bva-advice-gbr-scli-intl-wellness/index.html"}