{"authors": ["Sandee Lamotte"], "date_download": "2020-05-04 17:02:05", "date_modify": "2020-05-04 17:02:05", "date_publish": "2020-03-13 09:40:44", "description": "It's World Sleep Day, but if you follow these 10 commandments you can get better sleep every day of the year.", "filename": "2020_03_13_health_10-sleep-commandments-wellness_index_1588611725.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190114161637-sleep-work-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_13_health_10-sleep-commandments-wellness_index_1588611725.html", "title": "10 commandments for better sleep", "title_page": "World Sleep Day: 10 commandments for better sleep on  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Air, water, food -- and some would argue sex -- are key ingredients to human survival. In reality, there should be another \"s\" word in that list: sleep.\nWe're supposed to get between seven and 10 hours of sleep each night, depending on our age, but the US Centers for Disease Control and Prevention says that a third of Americans sleep fewer than seven hours a night. It's a global problem too.\n\"Sleep problems constitute a global epidemic that threatens health and quality of life for up to 45% of the world's population,\" according to the World Sleep Society, a non-profit organization of sleep professionals dedicated to advancing \"sleep health worldwide.\"\nYet how does anyone get to sleep today in the turmoil over the coronavirus pandemic? Workplaces and schools are shutting down, meaning hourly workers are without paychecks if they can't work and children used to free lunch are not getting fed -- never mind our concerns about elections, global stock market meltdowns or escalating border or trade wars.\nIt's a lot, folks, but failing to sleep isn't going to make things better.\nPoor sleep contributes to weight gain, a lack of sex drive, a dysfunctional immune system, high blood pressure, cardiovascular disease, stroke, diabetes, Alzheimer's, depression, anxiety and other disorders.\nYet despite this nuclear fallout for our health, we still don't prioritize sleep -- even when the stock market isn't crashing.\nTo combat that, sleep experts from the World Sleep Society have created these ten commandments of sleep hygiene for weary adults.\nEstablish a regular bedtime and waking time\nMessing with our circadian rhythm, the internal sleep clock that tells us when it's time to sleep and rise, has been linked to hypertension, insulin resistance, diabetes and, most recently, the risk of having a heart attack or heart disease.\nChanging your regular sleep-wake time by 90 minutes in either direction, which many of us do on the weekends, doubled the risk of cardiovascular disease over a five-year period. The more days you sleep irregularly, the higher the risk, a study found.\n\"People are living busy, stressful lives and not getting a lot of sleep during the week,\" Dr. David Goff, who directs the division of cardiovascular sciences at the US National Heart, Lung and Blood Institute, told CNN in a recent interview.\n\"Then they are trying to get catchup sleep on the weekend, and that's not a healthy pattern,\" Goff said.\nWatch your napping\nWhile an occasional short snooze can be healthy, the World Sleep Society's second commandment warns: \"If you are in the habit of taking siestas, do not exceed 45 minutes of daytime sleep.\"\nOne reason is because we typically enter a \"deep sleep\" cycle about 30 to 40 minutes into a nap. Waking up from deep sleep produces that \"Where am I?\" grogginess that is worse than no nap at all. A long nap can also interfere with your body clock, making it more difficult to fall asleep later that night.\nGenerally, catnaps that are approximately 15 to 20 minutes are fine, experts say, and may reduce fatigue; boost creativity; increase alertness; jumpstart cognitive performance; and improve mood. But try to do them earlier in the day -- before 3 p.m. -- to avoid affecting that night's full sleep cycle.\nNo alcohol or cigarettes\nThe third commandment is to \"avoid excessive alcohol ingestion four hours before bedtime, and do not smoke.\"\nIt's truly a myth that a drink will help you sleep better at night. Instead, it traps you in the lighter stages of sleep and \"dramatically reduces the quality of your rest at night,\" said Rebecca Robbins, a fellow at Brigham & Women's Hospital and Harvard Medical School, in a prior CNN interview.\n\"It continues to pull you out of rapid eye movement and the deeper stages of sleep, causing you to wake up not feeling restored,\" Robbins said.\nAvoid caffeine six hours before bedtime\nHere's a no-brainer: Boycott caffeine at least six hours before your normal bedtime (some experts say nothing after 3 p.m.). And caffeine is in more than just coffee, so the World Sleep Society also warns about tea and many sodas, as well as chocolate.\nYes, chocolate. That cup of hot chocolate you think may help you sleep could contain 25 milligrams of caffeine, while a cup of green or black tea will provide 50 milligrams of caffeine.\nAvoid eating certain foods\nThe fifth commandment: \"Avoid heavy, spicy, or sugary foods four hours before bedtime.\"\nHeavy and spicy foods may give you heartburn or other digestive issues, thus affecting your ability to get and stay asleep. As for sugar, studies show it's linked to restless, disturbed sleep and may possibly affect hormones that control cravings.\nA light snack before bed \"is acceptable,\" according to the commandment. The National Sleep Foundation recommends munching on a handful of nuts; a few cherries (which are high in melatonin); a banana (which contains muscle relaxers potassium and magnesium) and decaffeinated teas such as chamomile, ginger and peppermint.\nExercise regularly, but not right before bed\nSurveys of vigorous exercisers by the National Sleep Foundation show they are almost twice as likely to report high-quality, regular sleep compared to non-exercisers, and sitting for long periods of time is thought to be connected to poor sleep.\nWhile studies haven't proven that exercise just before bed will harm sleep, many experts -- like the World Sleep Society -- recommend avoiding it. Why? Because moderate exercise heats up your core temperature, signaling the body that it's time to be awake, while the release of endorphins is thought to keep some of us alert.\nOf course if you're a night owl, that may not apply to you -- so listen to your body clock. For any of us, however, doing some yoga, Tai chi or light stretching before bed could help with relaxation.\nImprove your sleep environment\nHaving just the right sleep environment is so important that the remaining four commandments focus on how to do that.\nFirst, keep your bedroom well-ventilated and pick a comfortable sleep temperature setting. Science is pretty much sure that a cool temperature is best, so aim for between 60 and 67 degrees Fahrenheit (15 to 20 degrees Celsius).\nMake sure you have \"comfortable, inviting bedding\" that fits your personal preferences (and hopefully that of any significant bed partner). \"Block out all distracting noise\" -- I sleep with a fan every night -- and get rid of any light, even the blue light from your charging smartphone.\nWhile you're at it, go ahead and turn off any work alerts (Slack or email ping at 2 a.m., anyone?). Better still, just charge the thing outside your bedroom.\nAnd last, but not least, \"reserve your bed for sleep and sex.\" As normal as it seems to work from home in bed or play games with the kids in bed, that doesn't teach your brain to view the bedroom as a place for slumber.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nThat's right, just like your dog knows a walk is coming when it sees the leash, you can train your brain to associate your bed with sleep.\nAnd there you have it. Hopefully these 10 commandments can help you part the seas to successful slumber.\nCan't do all 10 things? Pick just one, and see if you can make it happen. Little successes will build upon each other and lead to a happier (and more rested) you.", "url": "https://www.cnn.com/2020/03/13/health/10-sleep-commandments-wellness/index.html"}