{"authors": ["Por Dave Skretta"], "date_download": "2020-05-04 20:06:53", "date_modify": "2020-05-04 20:06:53", "date_publish": "2020-04-09 19:31:40", "description": "KANSAS CITY, Missouri, EE.UU. (AP) — Los Chiefs de Kansas City retuvieron los servicios del cornerback Bashaud Breeland mediante un contrato de un año que podría alcanzar los 4,5 millones de...", "filename": "_202cc631115d42f4aac71657cf9b9f14_1588622813.html", "image_url": "https://storage.googleapis.com/afs-prod/media/37e67ed30a6d4c2181892370bd56bab3/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_202cc631115d42f4aac71657cf9b9f14_1588622813.html", "title": "Fuente AP: Chiefs retienen al cornerback Bashaud Breeland", "title_page": "Fuente AP: Chiefs retienen al cornerback Bashaud Breeland", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "KANSAS CITY, Missouri, EE.UU. (AP) — Los Chiefs de Kansas City retuvieron los servicios del cornerback Bashaud Breeland mediante un contrato de un año que podría alcanzar los 4,5 millones de dólares, informó una persona con conocimiento del convenio.\nLa persona habló con The Associated Press con la condición de no ser identificada debido a que el contrato no ha sido anunciado. ESPN.com reportó primero que ambas partes habían acordado reunirse luego que Breeland desempeñó un papel importante para que la organización ganara un Super Bowl por primera vez en cinco décadas.\nMantener a Breeland significa un alivio para los actuales campeones. La posición de cornerback era una que generaba preocupación con miras al próximo draft.\nTres cornerbacks de los Chiefs se declararon agentes libres: Breeland, Kendall Fuller y Morris Clairborne. Fuller firmó por cuatro años y 40 millones de dólares con Washington y se creía que Breeland buscaría un contrato similar a largo plazo.\nEn vez de ello, obtuvo otro convenio por un año para ayudar a los Chiefs en su intento por revalidar el cetro del Sper Bowl. El equipo ha contratado ya al tackle defensivo Mike Pennel, al quarterback Chad Henne, al receptor Demarcus Robinson y al fullback Anthony Sherman, integrantes del plantel del año pasado.\nEntretanto, los Chiefs reestructuraron los convenios del defensive end Frank Clark y del receptor Sammy Watkins, con el objetivo de abrir el espacio necesario respecto del tope salarial para redondear su plantel.\n“Absolutamente, mientras más chicos podamos conservar, más encantados estaremos”, manifestó el entrenador Andy Reid, quien añadió que el beneficio de traer de vuelta a 20 de 22 titulares podría ser incluso mayor ante el hecho de que la pandemia de coronavirus podría impedir que se realice parte de la pretemporada.\nCon ello, los equipos dispondrían de menos tiempo para adaptarse a los cambios.\nLos Chiefs estuvieron cerca de contratar a Breeland hace un par de años, después de que una lesión arruinó sus posibilidades de suscribir un convenio de largo plazo con Carolina. Las partes no lograron pactar durante los campamentos de pretemporada, y Breeland terminó firmando con Green Bay por dos millones de dólares a la mitad de la campaña.\nPero a la temporada siguiente, accedió a un contrato de dos millones de dólares con Kansas City.\nBreeland fue titular en 15 de los 16 partidos de la pasada temporada regular con los Chiefs. Disputó la campaña con un contrato de un año a prueba, después de que su campaña previa con Green Bay fue truncada por una lesión.\nTambién fue titular en los tres juegos de playoffs y fue fundamental para que Kansas City venciera a los 49ers de San Francisco en el Super Bowl.", "url": "https://apnews.com/202cc631115d42f4aac71657cf9b9f14"}