{"authors": ["Mark Scolforo"], "date_download": "2020-05-04 20:15:35", "date_modify": "2020-05-04 20:15:35", "date_publish": "2020-04-07 14:44:26", "description": "HARRISBURG, Pa. (AP) — As officials consider releasing some inmates to lessen the impact of COVID-19 on Pennsylvania prisons, county prosecutors are telling lawmakers that passing legislation to...", "filename": "_91cdb122b0758213a5ee3ea26bf642d5_1588623335.html", "image_url": "https://storage.googleapis.com/afs-prod/media/d914ffa91756477489656ba28861b1bf/2775.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_91cdb122b0758213a5ee3ea26bf642d5_1588623335.html", "title": "Prosecutors urge lawmakers to help decide on freeing inmates", "title_page": "Prosecutors urge lawmakers to help decide on freeing inmates", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Nov. 27, 2017 file photo, a guard stands watch at the State Correctional Institution in Chester, Pa. As officials consider releasing some inmates to lessen the impact of COVID-19 on Pennsylvania prisons, county prosecutors are telling lawmakers that passing legislation to address that would avoid leaving those decisions to the governor alone. (AP Photo/Matt Rourke, File)\nFILE - In this Nov. 27, 2017 file photo, a guard stands watch at the State Correctional Institution in Chester, Pa. As officials consider releasing some inmates to lessen the impact of COVID-19 on Pennsylvania prisons, county prosecutors are telling lawmakers that passing legislation to address that would avoid leaving those decisions to the governor alone. (AP Photo/Matt Rourke, File)\nHARRISBURG, Pa. (AP) — As officials consider releasing some inmates to lessen the impact of COVID-19 on Pennsylvania prisons, county prosecutors are telling lawmakers that passing legislation to address that would avoid leaving those decisions to the governor alone.\nThe Pennsylvania District Attorneys Association considers “a temporary, legislative solution” to be reasonable, considering the health threat from the pandemic, said Lindsay Vaughan, the group’s executive director.\nVaughan was responding to a letter sent Monday by Corrections Secretary John Wetzel to state lawmakers about the prospect for legislation that would lay out which state inmates might qualify for early release.\nWetzel told The Associated Press on Tuesday that under the administration’s proposal, about 1,500 prisoners would qualify for potential release, but not all will end up getting out after they are fully evaluated. They would all need to have a place to live, for one thing.\nHe said he still hopes lawmakers will act but if not, he will recommend that Gov, Tom Wolf, a Democrat, act on his existing authority.\n“My letter said Friday. I’m not walking away from that, certainly,” Wetzel said.\nHouse Majority Leader Bryan Cutler, R-Lancaster, told reporters in a phone conference late Tuesday that he expected legislative work to continue on the prisoner release issue, with his chamber on 12-hour callback.\n“The secretary expressed his desire to do it legislatively, and I personally think that’s the best way to do things,” Cutler said.\nHe said an approach to “go it alone,” which he compared to the state’s closed business waiver process, “will most likely verify concerns that many of our members have.”\nThe state’s population of roughly 45,000 inmates has fallen by more than 600 since the start of March, due partly to the agency’s pandemic-driven efforts to get all those eligible for parole out the door.\nHe said the number of new inmates coming into the state system from county courts has fallen to about 150 a week, and the Corrections Department expects that stream to continue to diminish, as courts have shut down much of their operations.\nEleven Corrections employees at scattered sites and four inmates at the State Correctional Institution-Phoenix outside Philadelphia have COVID-19. The prison system has been on inmate quarantine since March 29, with inmates being fed in their cells and all movement being controlled to achieve social distancing.\nWetzel said lawmakers should pass the administration’s proposal to release inmates serving time for nonviolent offenses who are within nine months of scheduled release, or within 12 months for those considered at heightened risk from the coronavirus.\nThe virus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause severe illness or death.\nThe administration’s proposal would send most of those released to home confinement, although some could end up in halfway houses, Wetzel said. Judges or prosecutors would get about five days to veto any release, and the program would expire in two months.\nThe proposal that Wetzel was objecting to was more limited, drafted by House Republicans, would have capped at 450 the number of state prison releases. After a lengthy, private caucus on Monday, House Republican spokesman Mike Straub indicated their debate on the issue had stopped and prisoner release language was not in bills that were moving in that chamber Tuesday.\n“We diligently worked to create an appropriate process for releasing non-violent offenders who a judge would rule are not considered a threat to their communities,” Straub said in a statement. “However, we have no confidence that any process would properly protect the public and victim’s interest and will not be considering any legislation relating to the release of inmates from state correctional facilities at this time.”\nVaughan’s letter said the association worked with Wetzel on draft legislation but was “not involved in any internal legislative discussions.”\n“We believe any legislative solution should be thoughtful, focused on non-violent inmates, provide supervision, and include the input of the local district attorney and the sentencing judge,” Vaughan said.", "url": "https://apnews.com/91cdb122b0758213a5ee3ea26bf642d5"}