{"authors": ["Ryan Bergeron"], "date_download": "2020-05-04 16:16:29", "date_modify": "2020-05-04 16:16:29", "date_publish": "2020-04-03 19:20:46", "description": "For many kids spring break is just around the corner. Instead of breaking off to the beach this year, however, many families will find themselves in the same place -- home.", "filename": "2020_04_03_us_volunteering-_a2e2ea59343cc1337a0e5f803987c1ec_index_1588608989.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403135317-spring-break-volunteering-allie-farber-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_us_volunteering-_a2e2ea59343cc1337a0e5f803987c1ec_index_1588608989.html", "title": "How to spend your spring break volunteering with your kids", "title_page": "How to spend your spring break volunteering with your kids - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) For many kids spring break is just around the corner. Instead of breaking off to the beach this year, however, many families will find themselves in the same place -- home.\nHere are a couple of ways that you can get creative, spend some quality time with your family and help others during this time of need.\nMake cards for the elderly\nWith many long-term care facilities and nursing homes no longer allowing visitors, this can be a lonely and stressful time for those most vulnerable to the coronavirus. One way to help brighten someone's day is with a handwritten letter or card. It's an art project that the whole family can do and allows kids to put their creativity to work.\nThe nonprofit, Love For The Elderly , collects and delivers letters to senior facilities all over the country.\n\"It's a great way to bring some physical presence, something tangible and beautiful into somebody's life who might be restricted to their room in a nursing home right now,\" said founder Jacob Cramer.\nThere is little risk of the coronavirus spreading through the mail and Cramer says that they are seeing an uptick in the amount of letters they've received in the past couple of weeks.\n\"I think the best thing we can do right now is fight loneliness with love for our elders and for everyone.\"\nAllow your kids to get as colorful as they want and ask them to write about anything that would make them happy to read.\nFind ways to make your spring cleaning helpful\nJennifer Guynn, the founder of Pebble Tossers , a youth service organization, says you can do plenty of good from home no matter where you are.\n\"Even just cleaning out your house, going through closets and old toys,\" and then \"donate it to a children's shelter or to a foster care home. Assemble a little care package ... things like that.\"\nPebble Tossers has a list of service projects that can be done either at home or with proper social distancing in the Atlanta-area, but Guynn says the key to getting your kids involved is finding their passions and interests.\n\"Ask kids, 'What are three things that you love? And what are three things that make you sad?' Those six things become your passion areas. If you are really sad about something, then you may be more moved to make a change. If you have something that makes you happy, it's going to be easier to participate. It helps kids and even adults figure out where you want to help,\" Guynn said.\nDeliver two smiles at once\nGrey Cohen started The Meal Bridge to help two industries in need at once.\nThe quarantine has forced many to spend a lot more time in the kitchen cooking. While you're planning your next family dinner, you can also order a thank you meal from a local restaurant to a hospital. Hospitals have restrictions on food deliveries, but in Atlanta and Washington, DC sites like The Meal Bridge work with local hospitals and restaurants to allow you to help two industries in need at once.\nThe site is a family project that 16-year-old high school sophomore Grey Cohen started with her parents and uncle.\n\"My mom works in health care and my dad does lots of advertising for restaurants so we have lots of close friends in both industries. It's really meaningful to be able to give back and show our support for them,\" Cohen said.\nYou can order food for three to five people or a crew of 20 to 25. \"Some people are going in with other families so they can provide food for more people,\" she said.\nCohen is now in talks with people in several other states and anticipates that the service will be available in more cities soon.\n\"Any little bit you can give, especially when people are stuck at home, just sitting around not knowing what to do, this is a really amazing way to spend your time and give back to your community,\" Cohen said. \"You never know what your volunteering can bring.\"\nIt doesn't take much, but Guynn says that having kids participate in activities that help others, helps them grow as people.\n\"It teaches you empathy and compassion,\" Guynn said. \"It gives you a broader sense of the world. It helps develop self-awareness, self-advocacy, and it's empowering. It boosts kids' confidence in their own abilities.\"\nSo instead of being stuck with the spring break blues, spread some kindness and make someone else smile.", "url": "https://www.cnn.com/2020/04/03/us/volunteering-coronavirus-kids-spring-break-trnd/index.html"}