{"authors": ["Mike Stobbe"], "date_download": "2020-05-04 20:15:22", "date_modify": "2020-05-04 20:15:22", "date_publish": "2020-04-15 20:32:01", "description": "NEW YORK (AP) — The U.S. tally of coronavirus cases and deaths could soon jump because federal health officials will now count illnesses that are not confirmed by lab testing. The Centers...", "filename": "_dea52e0a0eb179d51ac5eed99a99bf10_1588623322.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c07ace0957b84326a6523b779dfe2263/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dea52e0a0eb179d51ac5eed99a99bf10_1588623322.html", "title": "US virus numbers now include probable cases without tests", "title_page": "US virus numbers now include probable cases without tests", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Monday, April 13, 2020 file photo, a patient arrives in an ambulance cared for by medical workers wearing personal protective equipment due to COVID-19 coronavirus concerns outside NYU Langone Medical Center in New York. The official U.S. count of coronavirus cases and deaths may grow a bit more dramatically, after a decision by federal health officials on Tuesday, April 15, 2020, to green light the inclusion of illnesses that are not confirmed by lab testing. (AP Photo/John Minchillo)\nFILE - In this Monday, April 13, 2020 file photo, a patient arrives in an ambulance cared for by medical workers wearing personal protective equipment due to COVID-19 coronavirus concerns outside NYU Langone Medical Center in New York. The official U.S. count of coronavirus cases and deaths may grow a bit more dramatically, after a decision by federal health officials on Tuesday, April 15, 2020, to green light the inclusion of illnesses that are not confirmed by lab testing. (AP Photo/John Minchillo)\nNEW YORK (AP) — The U.S. tally of coronavirus cases and deaths could soon jump because federal health officials will now count illnesses that are not confirmed by lab testing.\nThe Centers for Disease Control and Prevention told states Tuesday to include probable COVID-19 cases in their reports to the agency. Previously, most states reported only lab-confirmed cases and deaths.\nThe change hasn’t caused U.S. counts to rise much faster than they had been, but officials in some states said they were just learning about the change. Pennsylvania, for example, has begun to follow the CDC and expand its reporting, Dr. Rachel Levine, the state’s secretary of health, said in a Wednesday call with reporters.\nCDC officials said Wednesday in a statement that the change would give them “a better picture of the burden of COVID-19 in the U.S.”\nThere was already a big rise in New York City, where officials this week started counting people who had never tested positive for the coronavirus. That caused the city’s death count to jump by more than 3,700 on Tuesday.\nStates can report such illnesses how they want, but the CDC provides guidance. The federal agency often relies on an organization called the Council of State and Territorial Epidemiologists to help define cases.\nEarlier this month, the council revised its COVID-19 definition to include illnesses that don’t have positive test results but in which the evidence points to the disease. The council made the change in part because of growing evidence that some infected people don’t exhibit symptoms and may not have been tested.\n___\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "url": "https://apnews.com/dea52e0a0eb179d51ac5eed99a99bf10"}