{"authors": [], "date_download": "2020-05-04 20:04:56", "date_modify": "2020-05-04 20:04:56", "date_publish": "2020-04-09 22:34:44", "description": "AUSTIN, Texas (AP) — The volume of patients in Texas with the illness caused by the novel coronavirus topped 10,000 cases Thursday, with the number of deaths topping 200, according to Johns...", "filename": "_264aa174ddc08744a3cef26653885038_1588622696.html", "image_url": "https://storage.googleapis.com/afs-prod/media/7a448f3d293747de85579c63685c2edd/2400.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_264aa174ddc08744a3cef26653885038_1588622696.html", "title": "Texas COVID-19 cases top 10,000, deaths go past 200", "title_page": "Texas COVID-19 cases top 10,000, deaths go past 200", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "People wait in their cars Thursday, April 9, 2020, at Traders Village for the San Antonio Food Bank to begin food distribution. The need for emergency food aid has exploded in recent weeks due to the coronavirus epidemic. (William Luther/The San Antonio Express-News via AP)\nPeople wait in their cars Thursday, April 9, 2020, at Traders Village for the San Antonio Food Bank to begin food distribution. The need for emergency food aid has exploded in recent weeks due to the coronavirus epidemic. (William Luther/The San Antonio Express-News via AP)\nAUSTIN, Texas (AP) — The volume of patients in Texas with the illness caused by the novel coronavirus topped 10,000 cases Thursday, with the number of deaths topping 200, according to Johns Hopkins University researchers.\nThe case numbers updated hourly by the university’s Center for Systems Science and Engineering tallied 10,439 cases in Texas as of late Thursday afternoon, up from just over 9,300 reported by state health officials on Wednesday morning.\nFatalities in Texas from COVID-19, the illness caused by the coronavirus, reached 205 Thursday afternoon, according to the university, up from the 177 Texas deaths reported by state health officials Wednesday morning.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia.\nHarris County reported the most cases with 2,341 and the most deaths with 31 as of Thursday afternoon. Dallas County was second with 1,432 cases and 22 deaths. Tarrant County reported 637 cases and 20 deaths, the same number of deaths reported in Bexar County.\nMAMMOTH RUSH FOR FOOD\nAs millions of Americans remain jobless because of the coronavirus pandemic, thousands lined up at a San Antonio flea market Thursday for a distribution of household essentials.\nAbout 10,000 households were aided in a jammed flea market lot as the San Antonio Food Bank served more people than at any time in its 40-year history, Food Bank President Eric Cooper told the San Antonio Express-News .\nCooper says the Food Bank has fed about 15,500 households in the past 10 days.", "url": "https://apnews.com/264aa174ddc08744a3cef26653885038"}