{"authors": [], "date_download": "2020-05-04 20:19:26", "date_modify": "2020-05-04 20:19:26", "date_publish": "2020-04-16 21:12:16", "description": "PORTLAND, Ore. (AP) — The Oregon Health Authority has announced six more deaths from COVID-19, raising the state’s death toll to 64. The agency said Thursday that the number of cases...", "filename": "_375ae223670dbdbca781e2d51c26b56c_1588623566.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_375ae223670dbdbca781e2d51c26b56c_1588623566.html", "title": "6 new COVID-19 deaths, cases top 1,730 in Oregon", "title_page": "6 new COVID-19 deaths, cases top 1,730 in Oregon", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Ore. (AP) — The Oregon Health Authority has announced six more deaths from COVID-19, raising the state’s death toll to 64.\nThe agency said Thursday that the number of cases increased by 73 for more than 1,730 cases statewide.\nThe newly-reported deaths include four men ages 56, 69, 78 and 84 in Multnomah County, a 74-year-old woman in Benton County and a 92-year-old man in Marion County. All had underlying medical conditions, according to the agency.\nAlso on Thursday, Gov. Kate Brown said Oregon will waive the one-week waiting period before newly laid off workers are eligible for jobless benefits, reversing the state’s policy on the issue.\nThe change could provide over $100 million in additional benefits to Oregonians who have lost their jobs amid the pandemic, The Oregonian/OregonLive reported .\nIt’s not clear if the waiver will apply retroactively to workers who have already filed jobless claims.\nThe coronavirus package Congress approved in March included funding to eliminate the waiting week and many states moved to drop it.\nBut the Oregon Employment Department had said that the state’s antiquated computer systems made it impractical to waive the waiting week. The department said a waiver would require “thousands of hours” of reprogramming and would delay other benefits to workers.\nAll seven members of the state’s congressional delegation said this week that the governor should implement the waiver. In a reply to the delegation dated Wednesday, the governor said she will comply.", "url": "https://apnews.com/375ae223670dbdbca781e2d51c26b56c"}