{"authors": ["Katelyn Polantz"], "date_download": "2020-05-04 16:28:07", "date_modify": "2020-05-04 16:28:07", "date_publish": "2020-04-07 17:58:53", "description": "A massive plan by the federal government to buy 600 million N95 face masks may not even help fight the coronavirus pandemic at its peak because the federal government had such a low supply of masks heading into the crisis.", "filename": "2020_04_07_politics_masks-contract-n95_index_1588609687.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407150225-3m-n93-mask-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_masks-contract-n95_index_1588609687.html", "title": "600 million facemask order won't help fight coronavirus epidemic at its peak", "title_page": "600 million facemask order won't help fight coronavirus epidemic at its peak - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) A massive plan by the federal government to buy 600 million N95 face masks may not even help fight the coronavirus pandemic at its peak because the federal government had such a low supply of masks heading into the crisis.\nThe Department of Health and Human Services is spending almost half a billion dollars on the largest push this year so far for N95 masks, according to government contracts. The masks, once made, will go to the country's health care stockpile and to states at no cost, yet it'll take months for the manufacturers to be fully up to speed.\nFor instance, one of five companies that won multi-million dollar contracts late last month to make the N95 masks for HHS said it won't even begin production until September. Another company to win one of the major HHS orders had sent the stockpile almost 2 million masks initially, and is making another three million in 90 days at a manufacturing plant running 24 hours a day. But the plant won't be able to multiply the masks it can make for several months.\nThe mask-buying plans highlight how slow the ramping up of production has been in the US, several weeks after the federal government realized it would face a shortage and hospitals and state governments began pleading for more protective equipment for health care workers.\nThe Trump administration had touted the mask buying plan throughout March as a way to help a worsening supply problem. There's no quick fix, however. An HHS spokesperson said the federal government at least hoped the major purchase would encourage companies in the longer term.\nThe N95 contracts with HHS are some of the most significant coronavirus-related contracts signed by the federal government to date, representing an enormous purchase of the kind of face mask most needed for preventing the virus' spread.\nThe effort is separate from the deal President Donald Trump and 3M announced Monday to import 55.5 million N95 masks a month for the next three months from their foreign factories. That plan may help quickly and initially--but won't fully solve the supply problem.\nThat's because the US government had shockingly low supplies of American-made N95 masks even before the pandemic. Scientists and manufacturers warned elected officials over the past several years that the country would need more than 3 billion masks in a pandemic, but the national stockpile in late February only had about 30 million N95 masks on hand, Congress had learned.\nThe H1N1 epidemic in 2009 nearly depleted the national stockpile, and N95 mask manufacturing in the US didn't increase to replenish it, James Hornstein, general counsel of the second-largest disposable respiratory mask-maker Moldex-Metric, told CNN this week. Moldex won one of the five major mask-making contracts with HHS.\nThe order of \"600 million is a good down payment on what's needed,\" Hornstein told CNN this week. \"That national stockpile should have been there to defend the country in a war like we're in.\"\nWhat HHS bought\nDHS's Office of the Assistant Secretary for Preparedness and Response, which oversees the national stockpile, signed contracts on March 21 with five companies that would make the N95 masks.\nThe masks will cost the federal government between about 50 cents to almost a dollar per mask, depending on the company, at a total price tag of about $443 million, according to contract information obtained by CNN on Monday.\nHHS initially had sought the masks over the next 18 months, emphasizing it wanted them to be delivered \"quickly without overwhelming the supply chain during a national emergency,\" according to contract solicitation paperwork.\nHHS bought this many masks to encourage manufacturers to make them now--and to reassure the companies they won't be left with piles of unneeded masks once the epidemic subsides and if orders from groups outside the government are canceled, according to the agency spokesperson.\nHoneywell International Inc. and 3M, under the contracts, will make the most N95 masks--contributing 190 million to the stockpile each. Honeywell will make them for cheaper, at about 78 cents a mask or $148 million total, while 3M will earn $172.9 million, or about 91 cents a masks.\n3M didn't respond to questions about their HHS contract terms on Monday.\nA Honeywell spokesman said on Monday the company will start delivering some of the masks it'll make this month. But it won't be able to produce up to 20 million masks a month until May, the spokesman Eric Krantz told CNN. Honeywell is planning on making the masks for HHS in Rhode Island and, later, Phoenix, where it's building out manufacturing to accommodate the massive order.\nMoldex-Metric already agreed to send 1.8 million N95 masks to HHS's stockpile in March, even before signing the contract, Hornstein said. Now, it plans to send about 3 million masks over the next three months. By then, the company will be ramping up production so it can double the amount of masks it makes in that time, delivering another 21 million masks from July through next spring, Hornstein said.\nIn total, the company plans to delivery about 38 million masks for $28.5 million, according to the contract data.\nBut in order to make masks more quickly, it'll take adding equipment and production lines. The company is still talking to federal officials about that possibility, Hornstein said.\n\"There's only so much capacity to make these in the United States. Most of the manufacturers here have their plants, and we can run them 24/7 and hit capacity,\" Hornstein said. After H1N1, \"No one came to us and said we want you to ramp up your automated manufacturing lines, so you can make more when you turn on the switch.\"\nTens of millions more N95 masks are many months away from getting to the stockpile and to health care workers.\nDraeger, a German company, will earn more than $31 million to make almost 50 million masks at a plant it will build on the East Coast, according to its contract. The company said last week it doesn't expect to begin producing masks until September.\nThe company O&M Halyard Inc. will make the cheapest masks for HHS, charging 48 cents a mask. The company's contract says it'll deliver 130 million masks for about $62 million.\nO&M Halyard hasn't said when it will have the contributions of masks ready, and didn't respond to CNN requests for comment on Monday. A spokesperson for HHS declined to describe the delivery schedules.\nBy fall, the manufacturers will be churning out millions more masks than they can now.\n\"September may not be soon for the purpose of this first surge,\" Hornstein said. \"The country is going to need lots of N95s until there's a vaccine or a treatment. Neither one of those is coming before September.\"", "url": "https://www.cnn.com/2020/04/07/politics/masks-contract-n95/index.html"}