{"authors": ["Marilynn Marchione"], "date_download": "2020-05-04 20:24:04", "date_modify": "2020-05-04 20:24:04", "date_publish": "2020-04-20 04:07:07", "description": "A flood of new research suggests that far more people have had the coronavirus without any symptoms, fueling hope that it will turn out to be much less lethal than originally feared. While...", "filename": "_d20f283318c86bec3cc2d3d7936a9612_1588623844.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f782d164e2684b7a8494182146baf111/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d20f283318c86bec3cc2d3d7936a9612_1588623844.html", "title": "Reports suggest many have had coronavirus with no symptoms", "title_page": "Reports suggest many have had coronavirus with no symptoms", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Friday, April 10, 2020, file photo, amid coronavirus concerns, a healthcare worker takes the temperature of a visitor to Essentia Health who was crossing over a skywalk bridge from the adjoining parking deck, in Duluth, Minn. A flood of new research suggests that far more people have had the novel coronavirus without any symptoms, fueling hope that it will turn out to be much less lethal than originally feared. While that’s clearly good news, it also means it’s impossible to know who around you may contagious, since people who don’t feel sick can still carry and spread the bug. (Alex Kormann/Star Tribune via AP, File)\nFILE - In this Friday, April 10, 2020, file photo, amid coronavirus concerns, a healthcare worker takes the temperature of a visitor to Essentia Health who was crossing over a skywalk bridge from the adjoining parking deck, in Duluth, Minn. A flood of new research suggests that far more people have had the novel coronavirus without any symptoms, fueling hope that it will turn out to be much less lethal than originally feared. While that’s clearly good news, it also means it’s impossible to know who around you may contagious, since people who don’t feel sick can still carry and spread the bug. (Alex Kormann/Star Tribune via AP, File)\nA flood of new research suggests that far more people have had the coronavirus without any symptoms, fueling hope that it will turn out to be much less lethal than originally feared.\nWhile that’s clearly good news, it also means it’s impossible to know who around you may be contagious. That complicates decisions about returning to work, school and normal life.\nIn the last week, reports of silent infections have come from a homeless shelter in Boston, a U.S. Navy aircraft carrier, pregnant women at a New York hospital, several European countries and California.\nThe head of the U.S. Centers for Disease Control and Prevention says 25% of infected people might not have symptoms. The vice chairman of the Joint Chiefs of Staff, Gen. John Hyten, thinks it may be as high as 60% to 70% among military personnel.\nNone of these numbers can be fully trusted because they’re based on flawed and inadequate testing, said Dr. Michael Mina of Harvard’s School of Public Health.\nCollectively, though, they suggest “we have just been off the mark by huge, huge numbers” for estimating total infections, he said.\nWorldwide, more than 2.3 million infections and more than 160,000 deaths have been confirmed. The virus has caused nearly unprecedented economic and social harm since its existence was reported in early January.\nSTEALTH CASES\nBased on known cases, health officials have said the virus usually causes mild or moderate flu-like illness. Now evidence is growing that a substantial number of people may have no symptoms at all.\nScientists in Iceland screened 6% of its population to see how many had previously undetected infections and found that about 0.7% tested positive. So did 13% of a group at higher risk because of recent travel or exposure to someone sick.\nAboard the aircraft carrier USS Theodore Roosevelt, where one crew member died from the virus, “the rough numbers are that 40 percent are symptomatic,” said Vice Adm. Phillip Sawyer, deputy commander of naval operations. The ratio may change if more develop symptoms later, he warned.\nIn New York, a hospital tested all pregnant women coming in to deliver over a two-week period. Nearly 14% of those who arrived with no symptoms of coronavirus turned out to have it. Of the 33 positive cases, 29 had no symptoms when tested, although some developed them later.\nPreviously, tests on passengers and crew from the Diamond Princess cruise ship found nearly half who tested positive had no symptoms at the time. Researchers estimate that 18% of infected people never developed any.\nFLAWED METHODS\nThese studies used tests that look for bits of the virus from throat and nose swabs, which can miss cases. Someone can test negative one day if there’s not much virus to detect and then positive the next.\nSymptoms also may not appear when someone is tested but turn up later. One Japanese study found more than half of those who had no symptoms when they tested positive later felt sick.\nBetter answers may come from newer tests that check blood for antibodies, substances the immune system makes to fight the virus. But the accuracy of these, too, is still to be determined.\nOn Friday, researchers reported results from antibody tests on 3,300 people in California’s Santa Clara county: Between 1.5% and 2.8% have been infected, they claimed. That would mean 48,000 to 81,000 cases in the county — more than 50 times the number that have been confirmed.\nThe work has not been formally published or reviewed, but some scientists were quick to question it. Participants were recruited through Facebook ads, which would attract many people likely to be positive who have had symptoms and want to know if the coronavirus was the reason. Some neighborhoods also had way more participants than others, and “hot spots” within the county might have made infections seem more common than they are elsewhere.\nOn Monday, Los Angeles County and University of Southern California researchers released preliminary, partial results from a similar effort using a rapid antibody test at six drive-through sites. Based on results from 863 people, they estimate that 4% of adults in the county have had the virus. But the small sample size and other variables including test accuracy mean the rate could be anywhere from 2.8% to 5.6%, if more study confirms it. The results have not been published or reviewed by other scientists.\nStudies like these are bound to find far more people were infected than confirmed case tallies, because diagnostic testing shortages have caused many infections to go uncounted.\nBut ships, maternity wards and single counties don’t provide data that can be used to generalize about what’s happening elsewhere. And many of the figures have come from snapshots, not research on wide populations over time.\nNEXT STEPS\nAntibody testing in particular needs to be done “in an unbiased approach” on groups of people that are representative of the geographic, social, racial and other conditions, Mina said.\nThe CDC and other groups plan such studies, and they could guide public health advice on returning to normal life for people in certain areas.\nIf infections are more widespread than previously understood, it’s possible that more people have developed some level of immunity to the virus. That could stifle the spread through what’s called herd immunity, but scientists caution that there is still much to learn about whether mild illnesses confer immunity and how long it might last.\nIt will probably be months before enough reliable testing has been done to answer those questions and others, including how widespread infections have been and the virus’s true mortality rate, which has only been estimated so far.\n“If they’ve all seen the virus before, then maybe you can relax in that neighborhood” and ease social distancing, Mina said. “We’re not anywhere close where we need to be” on antibody testing to do that yet, he said.\n___\nAP writers Mike Stobbe in New York, Brian Melley in Los Angeles and Robert Burns and Lolita Baldor in Washington contributed to this report.\n___\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/d20f283318c86bec3cc2d3d7936a9612"}