{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:18:52", "date_modify": "2020-05-04 16:18:52", "date_publish": "2020-04-03 15:24:25", "description": "As the coronavirus task force gathered for their now-daily press briefing, a familiar figure joined them on stage: President Donald Trump's son-in-law Jared Kushner.", "filename": "2020_04_03_politics_jared-kushner-coronavirus_index_1588609132.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190808211655-02-kushner-trump-clemency-rubashkin-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_jared-kushner-coronavirus_index_1588609132.html", "title": "Wait, Jared Kushner is the coronavirus guru now?", "title_page": "Wait, Jared Kushner is the coronavirus guru now? - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "\"Today you're going hear from Jared Kushner, senior adviser to the President of the United States, but someone that the White House Coronavirus Task Force directed to work with FEMA on supply chain issues,\" explained Vice President Mike Pence. \"And in recent weeks, he has been leading a working group, in conjunction with FEMA, that literally has identified millions of medical supplies around the nation and around the world. And we're grateful for his efforts and his leadership.\"\nEr, OK?\nKushner, it would appear, has insinuated himself into a prominent role in coordinating the administration's coronavirus response despite no obvious qualifications -- he isn't a doctor, an infectious disease expert or someone who has run large organizations -- for such a prominent role.\n\"Because of his unique status, he has made himself the point of contact for many agency officials who know that he can force action and issue decisions without going to the president. But while Mr. Kushner and his allies say that he has brought more order to the process, the government's response remains fragmented and behind the curve.\"\nThis -- a powerful yet amorphous role in which he carries special status due to being married to President Trump's eldest daughter, Ivanka Trump -- is familiar territory for Kushner.\nIn the early days of Trump's presidency, Kushner was dubbed the \"Secretary of Everything\" because it seemed as though he, literally, had a hand in every single White House pot. Kushner's portfolio included, among many other things: Managing the US-China relationship, overseeing Middle East peace negotiations, strengthening the US's relationship with Mexico, running a task force to push innovation in government and oversee the administration's efforts at criminal justice reform.\n\"Multiple White House and administration officials say Kushner has now eclipsed nearly all of Trump's West Wing and Cabinet advisers in terms of influence, establishing himself as the key envoy for those outside the administration -- including foreign diplomats, business executives and even some members of Congress -- to direct their bidding.\"\nBy the following year, Kushner's star had dimmed somewhat. Questions regarding his financial dealings during the presidential transition period slowed his efforts to get a permanent security clearance . (The New York Times reported in 2019 that Trump had ordered then-chief of staff John Kelly to give Kushner a security clearance.)\nBut he was still Trump's son-in-law. And for a President who seems to trust no one beyond his family members, that mattered. A lot. So the re-emergence of Kushner -- and his role as a sort of shadow CEO -- of the coronavirus efforts of the Trump administration shouldn't really surprise anyone who has been paying attention.\nSo how did Kushner do in his first major public appearance addressing the coronavirus pandemic? Uh, not great.\nLet's go through what Kushner said:\n1) Asked about states' complaints that they weren't getting the medical supplies they needed from the federal government, Kushner said this : \"The notion of the federal stockpile is that it's supposed to be our stockpile. It's not supposed to be states' stockpiles that they then use.\"\n\"Strategic National Stockpile is the nation's largest supply of life-saving pharmaceuticals and medical supplies for use in a public health emergency severe enough to cause local supplies to run out. When state, local, tribal, and territorial responders request federal assistance to support their response efforts, the stockpile ensures that the right medicines and supplies get to those who need them most during an emergency.\"\n2) To explain the role he was taking within the coronavirus task force, Kushner told the story of how Trump heard \"from friends of his\" that the New York Public Hospital System was running low on critical medical supplies. Kushner recounted how he got on the phone with the head of the state's public hospitals, asked him what he needed and then secured a month's worth of N95 masks for the system.\nWhich is a good thing for New York public hospitals! But the process Kushner outlined -- the President hears something from friends, Kushner makes calls at the President's behest, that group goes to the front of the line -- is, uh, probably not a blueprint that we want to follow in terms of best practices on how to distribute needed medical supplies.\nKushner, no matter what he says or does, of course, isn't going anywhere. He is blood -- or at least blood via marriage -- to Trump. And nothing matters more to Trump than that.\nBut that doesn't mean that Kushner being sandwiched into an already confusing and decidedly disorganized response to the coronavirus pandemic is smart or will make things better. Time will tell on that, but the early reruns are not promising.", "url": "https://www.cnn.com/2020/04/03/politics/jared-kushner-coronavirus/index.html"}