{"authors": ["Reporter"], "date_download": "2020-05-04 20:28:57", "date_modify": "2020-05-04 20:28:57", "date_publish": "2020-04-30 12:44:08", "description": "The late night comedian ripped Donald Trump's son-in-law's coronavirus \"great success story\" claim.", "filename": "entry_jimmy-kimmel-jared-kushner-robot-coronavirus_n_5eaa9411c5b6f56615fc6141_1588624137.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa9c9424000010028e9ff1.png?cache=8n7hye9fgk&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_jimmy-kimmel-jared-kushner-robot-coronavirus_n_5eaa9411c5b6f56615fc6141_1588624137.html", "title": "Jimmy Kimmel Thinks He's Finally Found Proof That Jared Kushner Is A Robot", "title_page": "Jimmy Kimmel Thinks He's Finally Found Proof That Jared Kushner Is A Robot | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Jimmy Kimmel joked on Wednesday that “we may have just happened upon proof” that Jared Kushner is a robot.\nThe “Jimmy Kimmel Live!” host joined the chorus of criticism and mockery that was leveled at President Donald Trump’s adviser and son-in-law for claiming earlier in the day that the government’s response to the coronavirus pandemic “is a great success story.”\nKushner also promised the government would “make sure that the Americans will have all the food supply that they need.”\nIt was that comment that gave Kimmel food for thought.\n“If we are they, what are you? It?” he responded. “I think we may have just happened upon proof that Jared is a robot.”\nKimmel then presented further evidence, noting how “the Ivanka 3000-Bot seemed to know in advance that we would be goofing on him” by predicting that late night television comedians would make fun of his claim.\n“I love the idea that he’s watching late night television to see if we make jokes about him,” said Kimmel, who then dished out a few more gags aimed at Kushner for good measure.\nCheck out the clip here:\n“The Late Show” host Stephen Colbert also riffed on Kushner’s boast.\n“Yes, it’s a great story,” Colbert agreed, imitating Kushner. “More people dying under this administration in 100 days than died in 20 years of the Vietnam War. That’s a story that needs to be told. Perhaps in the blockbuster movie ‘Preventable Apocalypse Now.’”\nCheck out that clip here:", "url": "https://www.huffpost.com/entry/jimmy-kimmel-jared-kushner-robot-coronavirus_n_5eaa9411c5b6f56615fc6141"}