{"authors": [], "date_download": "2020-05-04 20:23:54", "date_modify": "2020-05-04 20:23:54", "date_publish": "2020-04-30 05:21:13", "description": "Newsom used crowds of beachgoers as an example of “what not to do” if the state wants to continue its progress fighting the coronavirus.", "filename": "entry_california-beaches-state-parks-closed-coronavirus_n_5eaa5e29c5b62eaf043eed9b_1588623834.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa5f2a300000301215528e.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_california-beaches-state-parks-closed-coronavirus_n_5eaa5e29c5b62eaf043eed9b_1588623834.html", "title": "California Gov. Gavin Newsom To Order All Beaches, State Parks Closed", "title_page": "California Gov. Gavin Newsom To Order All Beaches, State Parks Closed | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "SACRAMENTO, Calif. (AP) — Gov. Gavin Newsom will order all beaches and state parks closed Friday after tens of thousands of people flocked to the seashore last weekend during a heat wave despite his stay-at-home order, according to a memo sent Wednesday evening to police chiefs around the state.\nEric Nuñez, president of the California Police Chiefs Association, said it was sent to give chiefs time to plan ahead of Newsom’s expected announcement Thursday.\nA message to the governor’s office seeking comment wasn’t immediately returned.\nASSOCIATED PRESS Tens of thousands of people flocked to the seashore last weekend during a heatwave despite Gov. Gavin Newsom's stay-at-home order.\nNewsom this week targeted beachgoers in Orange and Ventura counties, calling them an example of “what not to do” if the state wants to continue its progress fighting the coronavirus. While many beaches and trails throughout the state have been closed for weeks, others have remained open with warnings for visitors to practice social distancing and more have reopened.\nIn Newport Beach, some 80,000 visitors hit the beach over the weekend, although lifeguards said most people exercised social distancing. With criticism swirling, the Newport Beach City Council met Tuesday and rejected a proposal to close the beaches for the next three weekends.\nNearby Laguna Beach approved a limited reopening. Beaches across San Diego County reopened Monday, with a few exceptions.\nThe governor’s order is sure to draw fire as pressure is building to ease restrictions and slowly reopen the state.\nSix San Francisco Bay Area counties that imposed the first broad stay-at-home orders in California because of the coronavirus loosened them — slightly — for the first time Wednesday, joining a growing list of local governments that are cracking the door to a less-restrictive life.\nThe announcement was part of a dizzying list of modified orders making it difficult to keep up with what is allowed and what is not. Tennis will be OK in Sacramento starting Friday, but not in San Francisco, where public health officials say it’s still not safe for people to share a ball.\nCompounding the confusion: Some elements of the revised orders won’t take effect because they conflict with the statewide stay-at-home order, which is still in place.\n“I want to remind everyone that we must all abide by all the local health orders and the state health orders. That means whichever is stricter, in some cases that is the state order,” Santa Clara County legal counsel James Williams said. “It is important that we adhere to the stricter of both.”\nThe Bay Area order allows for landscaping, construction and other outdoor businesses, such as flea markets and nurseries, so long as social distancing is maintained. And in what could be a critical addition for many parents, it specifies that summer camps are allowed, but only for children of people allowed to work under the state order. The children must remain in groups of 12 or fewer and with the same supervisor and may not mingle with kids outside their group.\nIt’s not clear if that element complies with the state order. When asked about it Wednesday, Newsom said it was “a point of clarification” his administration will be discussing with local officials.\nThe changes in local orders reflect the growing unrest among some residents and government officials over Newsom’s order and his plan for a slow and methodical reopening of the nation’s most populous state even as other states such as Florida move much more quickly.\nWith much of the economy closed, more than 3.7 million Californians have filed for unemployment benefits since March 12. In Auburn, northeast of Sacramento, salon owner Tisha Fernhoff said she has started taking an occasional client to help pay her rent and meet other expenses. She’s among a smattering of owners across the state who have dodged public health orders that closed their businesses because they are considered nonessential.\nNewsom reiterated Wednesday it would be weeks before he makes the first significant modification to the state order, urging people to remain at home to prevent unintended outbreaks among the state’s most high-risk populations, including nursing homes.\n“It won’t be on the basis of pressure, it won’t be on the basis of what we want, but what we need to do,” Newsom said. “And what we need to do from my humble perspective is listen to the public health experts.”\nBut each of the state’s 58 counties have their own public health experts, and many are starting to ask Newsom to open up the state. On Monday, six rural Northern California counties sent a letter to the governor asking him to let them reopen, noting they only had 69 confirmed virus cases among a combined population of 500,000 people.\nSanta Clara County Health Director Dr. Sara Cody said local officials have come up with their own metrics to measure infection rates, hospitalizations and testing to ensure that infections don’t start rising again. If that happens, she said, stricter rules will be back.\nBut she acknowledged there may be other health effects from forcing people to stay home, as well as the burgeoning unemployment the pandemic restrictions have caused.\n“I wish I could give you a set timeline for when this was going to end. My family asks me, my friends ask me — we don’t have a date,” she said, noting that there still is no vaccine, so “we are going to need to have protections in place for a very, very long time.”\n___\nDazio reported from Los Angeles. Associated Press writers Janie Har and Juliet Williams in San Francisco contributed reporting.", "url": "https://www.huffpost.com/entry/california-beaches-state-parks-closed-coronavirus_n_5eaa5e29c5b62eaf043eed9b"}