{"authors": ["Chris Isidore", "Gregory Wallace", "Cnn Business"], "date_download": "2020-05-04 16:18:27", "date_modify": "2020-05-04 16:18:27", "date_publish": "2020-04-03 21:47:23", "description": "Delta Air Lines expects revenue over the next three months to be down 90%, with no end of the industry's troubles site.", "filename": "2020_04_03_business_airlines-revenue-outlook_index_1588609107.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403165637-delta-idle-planes-0403-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_business_airlines-revenue-outlook_index_1588609107.html", "title": "Delta CEO: 'We still haven't seen the bottom'", "title_page": "Delta CEO: 'We still haven't seen the bottom' - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Delta Air Lines expects revenue over the next three months to be down 90%, with no end of the industry's troubles in sight.\n\"Even as Delta is burning more than $60 million in cash every day, we know we still haven't seen the bottom,\" said CEO Ed Bastian warned employees that Friday. He said April's schedule will be down \"at least 80% smaller than originally planned, with 115,000 flights canceled.\"\nAs an example of the drop in traffic he said that on March 28, Delta carried only 38,000 customers, versus its normal late-March Saturday of traffic of 600,000.\n\"I wish I could predict this would end soon, but the reality is we simply don't know how long it will take before the virus is contained and customers are ready to fly again,\" he said.\nAirline fan Buffett dumping shares\nBerkshire Hathaway BRKA Delta DAL In a separate filing, disclosed that it sold 18% of its stake inearlier this week, dumping nearly 13 million shares for $314 million.\nSouthwest Airlines LUV Berkshire also disclosed it had sold 2.3 million shares offor $74 million. That only represented 4% of Berkshire's Southwest holdings though.\nAmerican AAL United UAL Berkshire and its chairman Warren Buffett have been major investors in a number of airlines in recent years. It previously held 11% of Delta's shares, and 10.3% of Southwest before the recent sales, along with 10% ofand 9% of\nBerkshire is among the three largest shareholders of all four airlines. Buffett typically does not sell shares simply due to a decline in price or difficult economic times.\nOther airlines also see tough times ahead\nDelta wasn't the only airline issuing a grim outlook for business Friday evening. United and JetBlue did as well.\nUnited said that its average revenue in March was $100 million a day less than a year ago. It also cut April capacity by 80%, and said that it still only expected to fill a small portion of the seats it flies - a percentage between the low teens and single digits. United filled 84% of its seats with paying customers throughout 2019. An airline typically needs to sell at least two-thirds of the available seats on a flight in order for it to be profitable.\nUnited said because of the low traffic it expects to make even deeper cuts in the May schedule and it will continue to cut the schedule until it sees signs of a recovery in demand. But it's not expecting any significant rebound soon. It said revenue for the last three months of this year is still expected to be down 30% from the final quarter of 2019.\nJetBlue said that it expects to fly only 7,000 customers a day in April and possibly in May, compared to the normal 120,000 it would handle. It said it was taking in just $1 million a day in bookings and ancillary fees, down from $22 million during April last year. And it is issuing $11 million per day of travel bank credits for canceled bookings.\nAirlines file for help\nBastian confirmed that Delta filed Friday for its share of $25 billion in federal grants for the airline industry approved by Congress last week. Most other airlines confirmed that they, too, filed or planned to file for such support. Airlines that did not file by Friday stood the risk that there would not be money available to them when they did.\nThere's another $25 billion in loan support available as part of the package. American Airlines CEO Doug Parker told his employees a week ago that American stood to get $12 billion of the $50 billion of help available because of it is the world's largest airline.\nJetBlue JBLU Spirit Airlines SAVE Alaska ALK Allegiant Airlines ALGT United, Southwest,and Hawaiian airlines disclosed their requests for help in statements or company filings with the Securities and Exchange Commission. Sun County,andtold CNN on that they had filed.", "url": "https://www.cnn.com/2020/04/03/business/airlines-revenue-outlook/index.html"}