{"authors": ["David Shortell"], "date_download": "2020-05-04 16:18:29", "date_modify": "2020-05-04 16:18:29", "date_publish": "2020-04-04 12:52:32", "description": "Attorney General William Barr has directed prison officials at a number of federal facilities besieged by growing coronavirus cases to immediately maximize early release programs for a wide swath of vulnerable inmates.", "filename": "2020_04_04_politics_barr-early-release-inmates-prisons_index_1588609109.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200216121448-william-barr-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_politics_barr-early-release-inmates-prisons_index_1588609109.html", "title": "Barr expands early release for inmates at prisons hard hit by coronavirus", "title_page": "Barr expands early release for inmates at prisons hard hit by coronavirus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Attorney General William Barr has directed prison officials at a number of federal facilities besieged by growing coronavirus cases to immediately maximize early release programs for a wide swath of vulnerable inmates.\n\"We are experiencing significant levels of infection at several of our facilities,\" Barr wrote in a memo Friday, singling out federal prisons in Louisiana, Connecticut and Ohio that have been especially hard hit by the pandemic. \"We have to move with dispatch in using home confinement, where appropriate, to move vulnerable inmates out of these institutions.\"\nThe new memo expands on guidance Barr issued last week to the federal prison system , encouraging early release programs and triggering a provision of the federal stimulus law signed by President Donald Trump last month to expand the group of inmates eligible for early release. The move comes at the end of a week that saw eight federal inmates die after contracting the virus.\nIn the three-page memo, Barr told the Bureau of Prisons director to double down on the release programs at FCI Oakdale, a prison in Oakdale, Louisiana; FCI Danbury in Danbury, Connecticut; and FCI Elkton in Lisbon, Ohio.\nFive inmates have died at the Oakdale prison in a week and three at the Lisbon facility, including two on Friday. Most of the inmates who died had long-term, pre-existing medical conditions, the Bureau of Prisons has said. As of Friday, there were 91 inmates with confirmed cases of coronavirus, including 18 in Oakdale, two in Lisbon and 20 in Danbury. Also, 50 Bureau of Prisons staff members have been confirmed to have the virus.\nRead More", "url": "https://www.cnn.com/2020/04/04/politics/barr-early-release-inmates-prisons/index.html"}