{"authors": ["Mary E. Lovely For Cnn Business Perspectives", "Mary E. Lovely For"], "date_download": "2020-05-04 16:01:33", "date_modify": "2020-05-04 16:01:33", "date_publish": "2020-04-01 17:00:23", "description": "Getting rid of these tariffs will remove a painful yoke that had depressed American manufacturing and farming long before the coronavirus hit our shores, writes Mary E. Lovely, a professor of economics at Syracuse University.", "filename": "2020_04_01_perspectives_tariffs-factories-farms-coronavirus_index_1588608093.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401125413-us-medical-supply-company-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_perspectives_tariffs-factories-farms-coronavirus_index_1588608093.html", "title": "Trump should lift tariffs to rescue America's factories and farms (opinion)", "title_page": "Trump should lift tariffs to rescue America's factories and farms (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Mary E. Lovely is a professor of economics at Syracuse University and non-resident senior fellow at the Peterson Institute for International Economics. The opinions expressed in this commentary are her own.\nAs federal, state and local officials race to contain the spread of Covid-19, intense efforts have begun to address the mounting economic damage of the virus. President Trump and the US Congress have passed a $2 trillion fiscal stimulus package to funnel immediate help to American families while minimizing closures and layoffs. But Washington should not overlook one other simple and effective tool: suspending the remaining tariffs on Chinese imports.\nAlthough President Trump signed a \"phase one\" agreement with China in January, high tariffs remain on an original $350 billion in US imports. Getting rid of these tariffs will remove a painful yoke that had depressed American manufacturing and farming long before the coronavirus hit our shores. What's more, tariff rollbacks signal a desire to reduce mounting US-China trade tensions, offering a much-needed model of global cooperation at a time of shared crisis.\nSuspending tariffs would put the onus on China to remove retaliatory tariffs on American agricultural exports, a move it would be likely to take. Throughout the trade war, China responded proportionally to each US action , meeting each tariff increase and rollback in kind. Given this pattern, China can be expected to cut its own tariffs in response to American actions to keep trade flowing during the crisis.\nTrump's trade war has put US farms at risk since its inception in 2018. Farm bankruptcies have risen, despite the distribution of emergency aid to farmers, and the administration has found it difficult to locate alternative markets for American grains and meats. As the economic impact of the coronavirus reduces consumption in major American agricultural markets around the globe, farmers are at heightened risk of further losses. The American Farm Bureau Federation states that \"COVID-19 impact on agriculture includes a rapid and unanticipated decline in commodity prices.\" With the Chinese economy already beginning to recover from the virus, reopening their market to US exports will help to counteract these price declines and help American farmers avoid further unnecessary bankruptcies.\nRead More", "url": "https://www.cnn.com/2020/04/01/perspectives/tariffs-factories-farms-coronavirus/index.html"}