{"authors": ["David Axelrod", "Cnn Senior Political Commentator"], "date_download": "2020-05-04 16:11:06", "date_modify": "2020-05-04 16:11:06", "date_publish": "2020-04-03 00:35:46", "description": "There will be an election this fall and the crisis the country faces as a result of the pandemic has only underscored the consequences of that choice, writes David Axelrod. That is a message Bernie Sanders can deliver with characteristic passion to his faithful supporters as he gets behind Joe Biden to defeat Donald Trump.", "filename": "2020_04_02_opinions_you-hav_c042479ab322b7e7cd499adb26075c00_index_1588608666.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402192129-bernie-sanders-axelrod-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_opinions_you-hav_c042479ab322b7e7cd499adb26075c00_index_1588608666.html", "title": "You have a lot to be proud of, Sen. Sanders. Now it's time to go", "title_page": "You have a lot to be proud of, Sen. Sanders. Now it's time to go (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "David Axelrod, a senior CNN political commentator and host of \"The Axe Files,\" was senior adviser to President Barack Obama and chief strategist for the 2008 and 2012 Obama presidential campaigns. The opinions expressed in this commentary are his. View more opinion articles on CNN.\n(CNN) Bernie Sanders has a lot to be proud of.\nFive years ago, the shambling, stoop-shouldered septuagenarian launched a quixotic campaign for the presidency and pushed Hillary Clinton -- a brand name in Democratic politics -- to the limit.\nThis year, he did it again, defying those who said the Vermont senator's day had passed --even overcoming a mid-campaign heart attack -- to forge another potent challenge to the Democratic establishment.\nAlong the way, he shined a bright light on the weaknesses in the country's social safety net (which have been further bared by the current Covid-19 crisis); the yawning and growing inequality in our economy; the mounting burden of student debt; the corrupting power of special interests; and the mortal threat of climate change.\nIt is a message that galvanized millions, particularly the young. They are demanding wholesale changes to address what they see as shameful systemic failures that conspire against working class Americans and the poor.\nRead More", "url": "https://www.cnn.com/2020/04/02/opinions/you-have-a-lot-to-be-proud-of-senator-sanders-axelrod/index.html"}