{"authors": ["Harmeet Kaur"], "date_download": "2020-05-04 16:18:44", "date_modify": "2020-05-04 16:18:44", "date_publish": "2020-04-04 00:05:46", "description": "Baker, a longtime NFL agent, has been speaking publicly about the loss of his parents, using his family's tragedy to reiterate the seriousness of the global coronavirus pandemic.", "filename": "2020_04_03_us_nfl-agent-buddy-baker-parents-coronavirus-trnd_index_1588609124.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403171107-02-adrian-and-stuart-baker-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_us_nfl-agent-buddy-baker-parents-coronavirus-trnd_index_1588609124.html", "title": "Married for 51 years, they died of Covid-19 six minutes apart", "title_page": "Married for 51 years, they died of Covid-19 six minutes apart - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "The inseparable couple had been married for more than 51 years and were living in Boynton Beach, Florida, in retirement. Neither of them had any serious health conditions. Then in mid-March, they started feeling ill.\nOn Sunday, they both died -- six minutes apart -- due to complications from Covid-19, their son Buddy Baker said.\nStuart Baker was 74. Adrian Baker was 72.\nWhat you need to know about coronavirus\nBuddy Baker, a longtime NFL agent, has been speaking publicly about the loss of his parents, using his family's tragedy to reiterate the seriousness of the global coronavirus pandemic. In a widely shared video on Twitter, he urged people to heed social distancing and stay-at-home recommendations from public health officials.\n\"Until it touches you or touches somebody you know or you hear a story, you kind of feel removed from it,\" Baker, president and CEO of Exclusive Sports Group, told CNN. \"... Hopefully my parents' passing doesn't go in vain.\"\nAt first, the family was optimistic\nBaker detailed the events leading up to his parents' passing in a phone interview with CNN.\nAbout three weeks ago, Stuart and Adrian went to the doctor after they weren't feeling well, according to Baker. They were eventually sent home.\nA few days later, their symptoms still hadn't improved so their doctor recommended that they visit the hospital. Baker said that they were also sent home from the hospital and told to self-quarantine until they felt better.\n\"This is pre- the world shutting down, pre- the NCAA tournament getting canceled, so you're still not thinking this is going to be something which is life threatening,\" he said.\nAdrian and Stuart Baker, at the time of their marriage.\nBaker said he'd call to check on his parents regularly, but their health didn't seem to be improving. One day, they seemed to be on the up, and then the next day, they'd be feeling worse again.\nAfter a few more days, on March 19, they were told to return to the hospital. Baker's father, who had a fever and also had asthma, was admitted. His mother, who did not have a fever, was not.\nDespite the circumstances, Baker said he and his family were optimistic. They were talking to Stuart regularly on his phone, and it seemed like he'd be able to push through.\nAbout 48 hours later, his father was admitted to the ICU -- but the family was still hopeful. Stuart went from being on 60% oxygen to 50%, a sign that things were going in the right direction.\nThen, the couple started to deteriorate\nMeanwhile, Baker's mother was at home. Though she didn't have a fever or other worrying symptoms, knowing that her husband was in the hospital was taking a serious toll on her mentally.\n\"We just thought that was the result of my dad being away from her for the last five days, which was very very very infrequent in their lives together,\" Baker said.\nBaker said he and his sister would visit their mother a few times a day, sitting outside the garage while their mom sat inside. Then on March 24, they got a call from the hospital. Their father had tested positive for Covid-19 and the doctor said it didn't look like he would make it.\nThe call was shattering, Baker said. They didn't want to upset their mother with the news, and decided to take her to the hospital as a precautionary measure. They wanted to see if she too could be tested, though because she had no fever or other related symptoms, they thought she would be fine.\nWithin 45 minutes of their mother being checked in, Baker said the doctor called to report that her oxygen levels were very low. She wouldn't make it either.\nWith their parents' organs failing, Baker said he and his sister decided to move their parents to hospice care at the counsel of medical professionals. His mother and father were both moved to the same room and taken off ventilators to be comfortable. Within minutes of each other, they had passed.\n\"They were as compatible and inseparable as two human beings have ever been married and existed on earth,\" Baker said.\nBaker's message for others\nOn Thursday, Baker, his three children and his sister's family gathered for his parents' memorial service in Boynton Beach. The service was live-streamed for other friends and relatives and watched by people all over the world, he said.\n\"Hopefully people hear our story and it motivates them to do the right thing,\" he said. \"By doing that, maybe it won't affect them or it won't affect their family but maybe they help another family not endure the pain and agony that me and my sister and our kids and the rest of our family are enduring right now.\"\nBaker said he hopes his family's story can be a catalyst for change. He's calling on people to listen to what health officials have been saying: practice social distancing, wash their hands regularly and most importantly, stay at home.", "url": "https://www.cnn.com/2020/04/03/us/nfl-agent-buddy-baker-parents-coronavirus-trnd/index.html"}