{"authors": ["Bill Barrow", "Brian Slodysko"], "date_download": "2020-05-04 20:11:19", "date_modify": "2020-05-04 20:11:19", "date_publish": "2020-04-16 19:02:03", "description": "WASHINGTON (AP) — A leading Democratic super PAC has promised it will tangle in court with President Donald Trump's reelection campaign to keep airing television ads the Republican president is...", "filename": "_7843b9119b5194d5ec3c17a305a9c75f_1588623079.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b4155b384c5b4ffe837adf1fc3d8b819/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7843b9119b5194d5ec3c17a305a9c75f_1588623079.html", "title": "Democratic super PAC: We will fight Trump in court over ads", "title_page": "Democratic super PAC: We will fight Trump in court over ads", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Donald Trump, followed by Vice President Mike Pence, walks on the Colonnade to speak about the coronavirus in the Rose Garden of the White House, Wednesday, April 15, 2020, in Washington. (AP Photo/Alex Brandon)\nPresident Donald Trump, followed by Vice President Mike Pence, walks on the Colonnade to speak about the coronavirus in the Rose Garden of the White House, Wednesday, April 15, 2020, in Washington. (AP Photo/Alex Brandon)\nWASHINGTON (AP) — A leading Democratic super PAC has promised it will tangle in court with President Donald Trump’s reelection campaign to keep airing television ads the Republican president is trying to keep off the airwaves.\nPriorities USA Action chief Guy Cecil said Thursday that his group will intervene as a defendant in a lawsuit that Trump’s campaign filed in Wisconsin state court to block a local NBC affiliate from airing one of the super PAC’s ads that blasts the president’s response to the coronavirus pandemic.\n“The Trump campaign is trying to railroad a TV station into censorship of ads critical of the president, and we will not let that stand,” Cecil said. “We stand by the facts in the ad and will defend it in court if necessary.”\nThe lawsuit, filed against WJFW-TV, an NBC affiliate in northern Wisconsin, sets up a notable battle between Trump’s financially flush reelection campaign and one of the biggest spending groups in Democratic politics. Priorities USA has spent much of Trump’s term researching voters’ views in key battleground states, including Wisconsin, that delivered Trump his Electoral College victory in 2016, and the PAC has committed to an extended television and digital advertising campaign to potential swing voters in those states.\nThe ad in question pieces together audio clips of the president downplaying the threat posed by the COVID-19 virus, while a chart that is splashed across the screen gradually begins to shoot upward as cases of the virus skyrocketed across the nation.\n“The coronavirus ... this is their new hoax,” Trump is heard in the ad’s opening, with two clips that are different recordings.\nTrump’s campaign alleges that the ad is “defamatory” because it splices together the clips in a way that makes it appear as though the president said the virus itself was a “hoax.” Trump’s campaign argues that the president did not call the virus a “hoax,” but was referring to Democrats politicizing his handling of it.\nCecil countered that the ad simply uses the president’s own words. The remainder of the ad features full Trump quotes dismissing or softening the COVID-19 threat.\nTrump spent the first months of 2020 downplaying the pandemic, accusing Democrats and media of hysteria as he pointed to low numbers of confirmed cases and death from the virus. Trump’s full “hoax” quote at a Feb. 28 rally in South Carolina, however, came in the context of Democrats’ criticism of his response.\n“Now the Democrats are politicizing the coronavirus, you know that right? Coronavirus, they’re politicizing it. We did one of the great jobs,” he said, later continuing, “They tried the impeachment hoax. That was on a perfect conversation. They tried anything. They tried it over and over. They’d been doing it since you got in. It’s all turning. They lost. It’s all turning. Think of it. Think of it. And this is their new hoax.”\nThe Trump campaign lawsuit comes after Trump’s campaign late last month threatened legal action against local TV stations across five states if they didn’t pull the commercial.\nSteve Shanks, general manager at WJFW in Wisconsin, did not immediately respond Thursday to a request for comment.\n___ Barrow reported from Atlanta.", "url": "https://apnews.com/7843b9119b5194d5ec3c17a305a9c75f"}