{"authors": ["Bruce Schreiner"], "date_download": "2020-05-04 20:04:01", "date_modify": "2020-05-04 20:04:01", "date_publish": "2020-04-07 13:27:14", "description": "FRANKFORT, Ky. (AP) — Democrat Amy McGrath raised substantially more campaign cash than Senate Majority Leader Mitch McConnell in the first three months of 2020, showing her staying power against...", "filename": "_50986e4e812c1ae9a7c31dccac84abd7_1588622641.html", "image_url": "https://storage.googleapis.com/afs-prod/media/7a39509accb04a04b869c59372931b42/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_50986e4e812c1ae9a7c31dccac84abd7_1588622641.html", "title": "McGrath outpaces McConnell in fundraising for Kentucky race", "title_page": "McGrath outpaces McConnell in fundraising for Kentucky race", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this March 17, 2020 file photo, Senate Majority Leader Mitch McConnell of Ky., speaks during a news conference on Capitol Hill in Washington. McConnell flexed his fundraising strength in the midst of a global pandemic, raising nearly $7.5 million in the first three months of 2020, his campaign said Tuesday, April 7. The first-quarter haul was the Kentucky Republican's best three-month fundraising performance since entering the Senate in the mid-1980s. (AP Photo/Susan Walsh, File)\nFILE - In this March 17, 2020 file photo, Senate Majority Leader Mitch McConnell of Ky., speaks during a news conference on Capitol Hill in Washington. McConnell flexed his fundraising strength in the midst of a global pandemic, raising nearly $7.5 million in the first three months of 2020, his campaign said Tuesday, April 7. The first-quarter haul was the Kentucky Republican's best three-month fundraising performance since entering the Senate in the mid-1980s. (AP Photo/Susan Walsh, File)\nFRANKFORT, Ky. (AP) — Democrat Amy McGrath raised substantially more campaign cash than Senate Majority Leader Mitch McConnell in the first three months of 2020, showing her staying power against the Republican lawmaker in setting a blistering fundraising pace in Kentucky.\nHours after McConnell’s campaign reported raising nearly $7.5 million in the quarter, McGrath upped the ante. She reported taking in $12.8 million during the same period. She’s dramatically ahead of fundraising by other Democrats vying to challenge McConnell this November.\nBoth campaigns used their fundraising hauls to solidify their narratives for what’s expected to be a bruising general election battle. McConnell’s campaign pointed to his leadership role, especially while the nation battles the coronavirus pandemic. McGrath has offered a different narrative, accusing McConnell of taking a “victory lap” for what she said was a sluggish response to the pandemic.\n“What our numbers show is that voters are fed up with Mitch McConnell continually putting corporate handouts ahead of working people,” McGrath campaign spokesman Terry Sebastian said.\nMcGrath’s fundraising bonanza came while McConnell’s campaign said he was amassing his best three-month fundraising performance since entering the Senate in the mid-1980s.\n“Kentuckians know that at a time of great consequence, there is no substitute for the proven leadership of Mitch McConnell,” said the senator’s campaign manager, Kevin Golden.\nMcConnell, a prolific fundraiser who is seeking his seventh term, has raised $25.6 million so far for the 2020 election cycle. He had nearly $14.9 million on hand for the coming months.\nMcGrath has taken in $29.8 million in contributions since entering the race last summer. She had $14.7 million on hand, putting her on par with McConnell. As the top-ranking Republican in Congress, McConnell is a lightning rod for Democrats across the nation. McConnell plays up his close ties to President Donald Trump, including putting conservatives on the federal bench and leading the effort to defend the president after House Democrats impeached him.\nBoth campaigns have already dipped into their campaign funds to run TV ads.\nMcConnell recently launched a campaign ad in his home state that touts his role in passing the $2.2 trillion economic rescue package as the coronavirus outbreak damages the nation’s economy.\nMcGrath punched back with her own ad accusing McConnell of seeking a political windfall from the aid package while the public health crisis worsens.\nMcGrath has run a series of ads since last year to raise her name recognition statewide. The retired Marine combat pilot narrowly lost her race against a Kentucky Republican congressman in 2018.\nDespite all her campaign cash, unseating McConnell remains a formidable task. McConnell is one of the most entrenched officials in Washington and a key ally of Trump, who remains popular in the Bluegrass State and will be atop the ballot this year. Kentucky has not elected a Democrat to the Senate since Wendell Ford in 1992.\nBoth campaigns also will benefit from outside groups pouring money into the Kentucky race.\nMcConnell has outpaced his 2014 fundraising, when he had nearly $10.4 million on hand at the same point in his last reelection campaign. His campaign signaled that it won’t ease up on fundraising in the coming months.\n“The enthusiasm from across the Bluegrass State to uphold our conservative values and reelect Senator McConnell will only grow as Election Day approaches,” Golden said.\nMcGrath’s campaign said her huge fundraising haul shows the lack of confidence in McConnell’s leadership.\n“After 35 years of Mitch McConnell putting partisan politics and special interests ahead of doing what’s right for the country, working Americans don’t trust his leadership and are demanding new leaders like Amy McGrath who they know will have their back,” Sebastian said.\nKentucky’s primary election, usually in late May, was pushed back to June 23 due to the virus.", "url": "https://apnews.com/50986e4e812c1ae9a7c31dccac84abd7"}