{"authors": ["Geneva Sands"], "date_download": "2020-05-04 16:55:27", "date_modify": "2020-05-04 16:55:27", "date_publish": "2020-04-09 01:10:10", "description": "The Department of Homeland Security warned the faith-based community ahead of Passover and Easter about an \"increase in online hate speech intended to encourage violence or use\" the ongoing coronavirus pandemic situation as an excuse to spread hatred.", "filename": "2020_04_08_politics_dhs-war_f51c0314ed62fe3d138698eaa15a070d_index_1588611327.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408134711-02-coronavirus-easter-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_dhs-war_f51c0314ed62fe3d138698eaa15a070d_index_1588611327.html", "title": "DHS warns faith community about increase in online hate speech ahead of Passover and Easter", "title_page": "DHS warns faith community about increase in online hate speech ahead of Passover and Easter - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Department of Homeland Security warned the faith-based community ahead of Passover and Easter about an \"increase in online hate speech intended to encourage violence or use\" the ongoing coronavirus pandemic situation as an excuse to spread hatred.\nIn a letter to community members Wednesday, the department reminded houses of worship to review security plans and procedures ahead of congregant gatherings, acknowledging that many people are worshiping remotely at this time.\n\"[T]here has been an increase in online hate speech intended to encourage violence or use the ongoing situation as an excuse to spread hatred,\" states the letter from the department's Cybersecurity and Infrastructure Security Agency, obtained by CNN.\nAdditionally, stressors caused by the pandemic may contribute to an individual's decision to commit an attack or influence their target of choice, according to DHS.\nThe letter is aimed at providing the faith community with guidance for planning \"restoration of normal operations, whenever that may be.\"\nRead More", "url": "https://www.cnn.com/2020/04/08/politics/dhs-warning-online-hate-speech-passover-easter/index.html"}