{"authors": ["Jackie Wattles", "Cnn Business"], "date_download": "2020-05-04 16:24:41", "date_modify": "2020-05-04 16:24:41", "date_publish": "2020-04-07 00:32:42", "description": "Boeing said it will repeat a test flight of its Starliner spacecraft after several major issues plagued its first attempt. The decision casts more uncertainty on when Starliner can be used to begin carrying NASA astronauts into orbit — a milestone that's already years overdue.", "filename": "2020_04_06_tech_boeing-star_865168dc571e4e5e11d792f5ba93b29c_index_1588609481.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191222085201-01-boeing-starliner-spacecraft-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_tech_boeing-star_865168dc571e4e5e11d792f5ba93b29c_index_1588609481.html", "title": "Boeing will redo bungled test flight of its Starliner spacecraft", "title_page": "Boeing will re-do bungled test flight of Starliner spacecraft, further delaying first astronaut mission - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Boeing said it will repeat a test flight of its Starliner spacecraft after several major issues plagued its first attempt. The decision casts more uncertainty on when Starliner can be used to begin carrying NASA astronauts into orbit — a milestone that's already years overdue.\nThe company said in a statement Monday that it will repeat the uncrewed test flight so that it can complete \"all flight test objectives\" and fully evaluate Starliner's design. The news was first reported by the Washington Post\nThe do-over flight will likely happen this fall, according to a person familiar with the matter.Evenif the test flight goes off without a hitch, it's not clear how soon after that Boeing would be able to get a crewed mission off the ground. Butcould conceivably have two Starliner spacecraft — one for the test flight and another for the first crewed mission —ready for both missions by the end of the year, the person said.\nBoeing and NASA declined to comment on the matter beyond the statements they issued Monday.\nBoeing launched Starliner into space for the first time in December, and problems arose almost immediately. A software issue caused the spacecraft to misfire. One of the primary goals of the mission, to prove Starliner can safely dock with the International Space Station, had to be abandoned. And the craft was forced to return from space days earlier than expected.\nNASA and Boeing officials revealed several other major software and communications issues in the weeks after the botched December test flight.\nBoeing had said in an earnings release in January that the company set aside $410 million to pay for a second uncrewed test flight. But until Monday, it was not clear if the aerospace giant would need to repeat the uncrewed test or if it would move forward with a crewed mission.\nNASA and Boeing officials had not ruled out the latter option when asked by reporters at several press briefings over the past few months.\nBut NASA said in a statement Monday that Boeing had \"decided\" it would conduct a full redo of the December mission, and the space agency agreed to that proposal. NASA added that it \"will not speculate\" on whether it would have required the mission to be repeated if Boeing hadn't made that decision.\nBoeing said in its statement Monday that the test flight will come \"at no cost to the taxpayer.\"\nNASA announced earlier this month that it would launch a full-scale safety review of Boeing's work on Starliner, noting that there were \"numerous instances where the Boeing software quality processes either should have or could have uncovered the defects.\"\nA separate review carried about by a team of NASA and Boeing experts sought to determine what went wrong during the first uncrewed test flight. It found that Boeing would need to carry out a thorough review of Starliner's software, among other things.\nNASA said in its statement that a \"second uncrewed flight does not relieve Boeing from completing\" those reviews.\nThe company has worked for the past decade to prepare Starliner for crewed missions, ever since NASA retired its space shuttle program and asked the private sector to design spacecraft capable of ferrying astronauts to the International Space Station.\nThe space agency allocated $4.2 billion to Boeing and $2.6 billion to SpaceX in 2014 for that task. NASA initially hoped Boeing's and SpaceX's new vehicles would be up and running by 2017. Meanwhile, the space agency has paid Russia to fly American astronauts to the space station aboard Soyuz spacecraft.\nSpaceX, which developed a spacecraft called Crew Dragon, is also behind schedule. But the company already completed an uncrewed demo flight last year, and it is currently preparing to launch its first crewed mission this spring.\nIt's not yet clear if the COVID-19 pandemic might affect that schedule. So far, the government has allowed rocket launches and work on Crew Dragon and Starliner to continue despite lockdown orders that have practically shuttered other industries.", "url": "https://www.cnn.com/2020/04/06/tech/boeing-starliner-spacecraft-flight-test-repeat-scn/index.html"}