{"authors": ["Andrew Demillo"], "date_download": "2020-05-04 20:16:03", "date_modify": "2020-05-04 20:16:03", "date_publish": "2020-04-16 20:44:59", "description": "LITTLE ROCK, Ark. (AP) — Arkansas' governor said Thursday that reopening the state's hospitals to elective surgeries is a priority when the state prepares to ease restrictions imposed to slow the...", "filename": "_9a27dbd076362bd16cfb01d22417b60f_1588623363.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8c3ab5884e9b462d8a34cc85b23cda35/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9a27dbd076362bd16cfb01d22417b60f_1588623363.html", "title": "Arkansas governor: Easing virus surgery limits a priority", "title_page": "Arkansas governor: Easing virus surgery limits a priority", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this April 15, 2020 photo, volunteers Natalie Wolfe, right, and Anna Kidd, left, load chicken product donated by OK Foods to the River Valley Regional Food Bank at Kay Rodgers Park in Fort Smith Ark. (Thomas Saccente/The Arkansas Democrat-Gazette via AP, File)\nIn this April 15, 2020 photo, volunteers Natalie Wolfe, right, and Anna Kidd, left, load chicken product donated by OK Foods to the River Valley Regional Food Bank at Kay Rodgers Park in Fort Smith Ark. (Thomas Saccente/The Arkansas Democrat-Gazette via AP, File)\nLITTLE ROCK, Ark. (AP) — Arkansas’ governor said Thursday that reopening the state’s hospitals to elective surgeries is a priority when the state prepares to ease restrictions imposed to slow the spread of the coronavirus.\nGov. Asa Hutchinson said he plans to meet Friday with a medical panel he formed to consider criteria for lifting some of the state’s restrictions.\nArkansas’ restrictions have included requiring health providers to reschedule elective procedures that can be safely postponed. Hutchinson said the state’s coronavirus hospitalizations, currently at 85, are below what had been projected for the state.\n“We want to get them back to the important health care delivery that is important in their communities,” Hutchinson said. “So that is something that is very high on the list.”\nHealth officials said Thursday that the number of coronavirus cases in the state had risen to at least 1,620, an increase over the 1,569 reported a day earlier. Four more people had died from the virus, bringing the state’s death toll to 37.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia.\nHutchinson did not give a timeline for when he might consider easing or lifting the state’s restrictions. The governor has said the state is expected to hit its peak of cases on May 2.\n“We don’t want Arkansans to think we’re over this,” Hutchinson said.\nThe governor spoke to reporters shortly before President Donald Trump issued a phased approach for restoring normal commerce and services. Hutchinson has not issued a broad stay-at-home order like most other states, but he has temporarily closed some businesses and banned gatherings of more than 10 people.\n___\nCheck out more of the AP’s coronavirus coverage at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/9a27dbd076362bd16cfb01d22417b60f"}