{"authors": ["Opinion Luma Mufleh"], "date_download": "2020-05-04 16:28:20", "date_modify": "2020-05-04 16:28:20", "date_publish": "2020-04-05 01:42:55", "description": "While the shutdown of routine daily life, including the closure of schools due to the Covid-19 outbreak, is like nothing most of us have ever experienced, I can't help feeling a little bit of déjà vu, writes Luma Mufleh.", "filename": "2020_04_04_opinions_homesch_864400fe565211f6279a70326c1ead7f_index_1588609700.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200316032045-03-homeschooling-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_opinions_homesch_864400fe565211f6279a70326c1ead7f_index_1588609700.html", "title": "How to smooth the transition to learning at home during the Covid-19 lockdown", "title_page": "Smoothing the transition to learning at home during the Covid-19 lockdown (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Luma Mufleh is the founder of Fugees Family, a non-profit that works with child refugees and their families. In 2016, she was honored as a CNN Hero . The opinions expressed in this commentary belong to the author. View more opinion articles on CNN.\n(CNN) While the shutdown of routine daily life, including the closure of schools due to the Covid-19 outbreak, is like nothing most of us have ever experienced, I can't help feeling a little bit of déjà vu.\nWhen I was 15 and living in what was then my home in Aman, Jordan, my school closed for three months during the 1990-1991 Persian Gulf War. I was terrified. Even though we were living through a war — Jordan had sided with Iraq — it was hard for me to imagine that it would come to this; school closures, not being able to see friends and constant worry about what would happen next.\nToday, I lead schools for refugee children in grades six to 12 near Atlanta, Georgia, and in Columbus, Ohio. And, as you can imagine, this isn't the first time my students have faced disruptions in their education. So, while I know this is tough for families — I'm a mom to three young children myself — parents should take comfort in knowing that kids are resilient, and we will get through this.\nI do think there are steps we can take, though, to ensure we do so as smoothly as possible.\nPrioritize mental and physical health\nFirst, I think it's important to remember that families' mental and physical health needs to be our top priority. Kids can't learn if they're hungry or sick. I know from working with my students at Fugees Academy schools that we can help kids catch up academically. But overcoming trauma — and families will face trauma in the current environment — will take more time.\nWe need to make sure those who are food insecure or facing urgent health care needs are getting access to meals and services. Communities that have activated their bus routes to deliver meals to those in need are setting a great example. And we need to ensure everyone is taking the time to exercise, get outdoors safely and connect by calling, texting and using social media tools.\nFor example, the teachers at Fugees Academy schools are having morning check-ins using the Zoom videoconference service with 10 to 15 students at a time. Each day, they pose a question to their students to try to spark a conversation that will help them process their feelings. One of the questions we ask is, \"What are you afraid of?\" This lets us know if there are families in crisis that we need to try to help.\nTime to bridge the digital divide\nIt's vital to be honest about the fact that connecting this way means ensuring all students have access to the internet and computer devices, which is not the reality for many kids. A Pew Research Center analysis of 2015 US Census Bureau data showed that 15% of households with school-age children do not have a high-speed internet connection at home. The center's analysis also found that 12% of teens in the country do not have a computer at home, adding to the burden of what has come to be known as the \"homework gap.\"\nAt our tuition-free independent schools, we've made computers available to our students. Thankfully, internet providers in our communities are giving free service to those in need at this time. That should happen broadly, and any government relief efforts around the current crisis ought to tackle bridging the digital divide.\nBuild routine and support teachers\nIt's not by chance we're having our teachers check in with students at 10 a.m. every day. Kids need routine and structure, and we've generally asked them to make 10 a.m. to 2 p.m. traditional learning time with breaks for lunch and exercise.\nSchools and school systems need to support teachers, who are being asked to do something entirely new. We first took a week for teacher training and then put class structures in place using tools like Zoom, ClassDojo and Google Classroom. We're being creative about using a private Facebook group to run soccer practices remotely. We can't debate who gets the corner kick, but we can run sprint drills and practice pushups and burpees together. We're also using the group for yoga classes and dance parties!\nGreater accountability and flexibility\nWhile we're trying to make this version of school fun for our students, we're letting them know we're holding them accountable. I know some school systems are saying the semester will be graded on a pass/fail basis, but we want to motivate kids to try hard and have decided to give grades but be flexible on how we assess student work.\nWe're taking care to assign homework that's manageable. Without access to a teacher in person, it probably doesn't make sense to assign problem sets that are going to have kids getting stuck or spinning their wheels.\nIdeas for parents\nAs I mentioned, I'm a mom to three kids, ages 1, 4 and 5 — a lot younger than the students who attend Fugees Academy schools. My wife, Emily, and I are only asking our pre-K and kindergarten daughters to do about an hour's worth of academic work each day. But that doesn't mean we're not sneaking in learning when we plant a garden and space out the plants or bake a cake and measure the ingredients.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nAnd while this is a great time to try activities you might not ordinarily have time to do, it's important to stick with routines and traditions. That's why we still have Friday family movie nights, focusing on funny and uplifting films. Olaf, from \"Frozen,\" had us all giggling last week. Humor is such a help.\nPerspective is critical, too. We'll get through this. I know firsthand that it can be hard to keep perspective at times like this. But I'm hopeful we'll come out of it for the better — having kept a close eye on the most vulnerable among us, a clear-eyed view of the need for greater equity in our education system, a deep appreciation for our schools and teachers and great love for our family and friends.", "url": "https://www.cnn.com/2020/04/04/opinions/homeschooling-education-fun-coronvirus-mufleh/index.html"}