{"authors": ["Alaa Elassar"], "date_download": "2020-05-04 16:34:41", "date_modify": "2020-05-04 16:34:41", "date_publish": "2020-04-08 02:58:19", "description": "A small clinic in central Pennsylvania has set up drive-through coronavirus testing that accommodates horse and buggies for its local Amish and Mennonite communities.", "filename": "2020_04_07_us_amish-coronav_34e853431c9a7b1702d2082c782a2c6b_index_1588610081.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407181627-01-amish-coronavirus-drive-through-testing-trnd-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_us_amish-coronav_34e853431c9a7b1702d2082c782a2c6b_index_1588610081.html", "title": "Pennsylvania clinic is bringing the Amish drive-through coronavirus testing for their horse and buggies", "title_page": "Pennsylvania clinic is bringing the Amish drive-through coronavirus testing for their horse and buggies - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A small clinic in central Pennsylvania has set up drive-through coronavirus testing that accommodates horse and buggies for its local Amish and Mennonite communities.\nThe Central Pennsylvania Clinic in Belleville, a town known for its majority Amish and Mennonite population, is one of the only coronavirus testing facilities in the area.\nThe clinic's founder and medical director, Dr. D. Holmes Morton, collaborated with Regina Lamendella, the co-founder of a start-up which detects and diagnoses infectious diseases, to develop a new way to test for the virus.\nMedical personnel at the clinic collect the swab samples before sending them to the lab at Lamendella's company, Contamination Source Identification (CSI), to be processed. Since launching drive-through testing on April 1, the clinic provided nearly 65 coronavirus tests.\nProfessor Regina Lamendella, in the purple shirt, conducts research with two Juniata College students at the Contamination Source Identification (CSI) lab.\nWhile the clinic is also utilizing the currently available FDA-approved RT-qPCR test, Lamendella said the test has \"as little as 66% sensitivity\" and can fail to detect the virus in asymptomatic carriers.\nRead More", "url": "https://www.cnn.com/2020/04/07/us/amish-coronavirus-drive-through-testing-horse-and-buggies-trnd/index.html"}