{"authors": ["Steve Leblanc", "Mark Pratt"], "date_download": "2020-05-04 20:26:45", "date_modify": "2020-05-04 20:26:45", "date_publish": "2020-04-20 13:22:12", "description": "BOSTON (AP) — The number of COVID-19-related deaths in Massachusetts rose to 1,809 Monday. That’s an increase of 103 in the past day, according to public health officials. There were more...", "filename": "_186e70feba09300980948931255f1cec_1588624005.html", "image_url": "https://storage.googleapis.com/afs-prod/media/a17b043a537641a3990c4059b251ffd8/2690.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_186e70feba09300980948931255f1cec_1588624005.html", "title": "COVID-19 deaths rise to 1,809; schools may not open May 4", "title_page": "COVID-19 deaths rise to 1,809; schools may not open May 4", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A medical worker, center, takes a sample from the nose of a woman at a coronavirus testing tent outside MGH Healthcare Center, Monday, April 20, 2020, in Chelsea, Mass. (AP Photo/Steven Senne)\nA medical worker, center, takes a sample from the nose of a woman at a coronavirus testing tent outside MGH Healthcare Center, Monday, April 20, 2020, in Chelsea, Mass. (AP Photo/Steven Senne)\nBOSTON (AP) — The number of COVID-19-related deaths in Massachusetts rose to 1,809 Monday. That’s an increase of 103 in the past day, according to public health officials.\nThere were more than 1,500 new COVID-19 cases, for a total of more than 39,600 confirmed cases since the start of the outbreak.\nThe number of people tested since the start of the outbreak has topped 169,000.\nMassachusetts is in the middle of a surge of patients, Republican Gov. Charlie Baker has said.\n___\nFIELD HOSPITALS\nTwo more field hospitals set up to deal with a surge of COVID-19 patients are opening Monday in Massachusetts.\nThe hospitals at Joint Base Cape Cod in Bourne and at the University of Massachusetts Lowell’s Recreation Center were tentatively scheduled to open Monday and can each handle about 100 patients who are not in critical condition but are not well enough to be sent home.\nCape Cod Healthcare is managing and staffing the Cape Cod hospital, while Lowell General Hospital is managing the UMass site.\nField hospitals have also opened at the DCU Center in Worcester and the Boston Convention and Exhibition Center. A fifth is expected to open at UMass Dartmouth in about a week.\nMassachusetts is in the middle of a surge of patients, Gov. Charlie Baker has said.\n___\nSCHOOL CLOSINGS\nBoston students won’t be going back to school May 4 and may not return for the rest of the school year, Mayor Marty Walsh said Monday.\n“I don’t think there’s any question. Kids aren’t going back to school May 4,” the Democrat said at an afternoon news conference. “I’ve been talking along with other mayors and school superintendents to the state about what do we do here. Do we open it up a little later in June and try to get a couple of weeks in or not?”\nWalsh said he’s “not too confident we’ll have school this year.” The current state of emergency order extends until May 4. Baker has yet to say whether schools in the state will remain closed beyond that point.\n“I also think next year when school comes back in September, it could be a very different looking situation in the classrooms,” Walsh said, adding that he is also likely to extend the city’s overnight curfew beyond May 4.\n___\nBAN ON EVICTIONS, FORECLOSURES\nA bill banning all non-essential evictions and foreclosures was signed into law by Baker on Monday.\nThe new law — which provides mortgage borrowers with forbearance options and protects tenants from late fees — creates a moratorium on all stages of the eviction and foreclosure process for 120 days from the bill’s signing or 45 days after the state of emergency has been lifted, whichever comes first.\nIt also prohibits all non-essential evictions for small businesses.\nLandlords are banned from issuing late fees and reports to credit agencies for nonpayment of rent, provided that a tenant offers notice and documentation to the landlord within 30 days of the missed rent that the non-payment was related to a financial impact from COVID-19.\n___\nUNEMPLOYMENT BENEFITS\nMassachusetts residents not eligible for regular unemployment benefits can now apply online for the new Pandemic Unemployment Assistance program.\nThe federal program provides up to 39 weeks of unemployment benefits for people unable to work because of a COVID-19-related reason but are not eligible for regular or extended unemployment benefits, including the self-employed, independent contractors, gig workers, and those with limited work history.\nApproved applicants will initially receive the minimum weekly benefit amount, plus an additional $600. Benefits may not be more than the state’s maximum weekly benefit rate for regular unemployment, which is $823 in Massachusetts.\n___\nSOLDIERS HOME DEATHS\nThe number of residents who have died at the Soldiers’ Home in Holyoke climbed to 62 on Monday, 52 of whom tested positive for the coronavirus.\nState health officials said another 89 residents have also tested positive, as have 81 employees.\nThe number of veteran resident deaths at a second facility — the Chelsea Soldiers’ Home — increased to 16 on Monday, with 12 testing positive for the coronavirus. Another 25 residents have also tested positive, as have 52 employees.", "url": "https://apnews.com/186e70feba09300980948931255f1cec"}