{"authors": ["Omar Jimenez"], "date_download": "2020-05-04 17:00:13", "date_modify": "2020-05-04 17:00:13", "date_publish": "2020-04-09 23:57:38", "description": "It was a grim precaution. Now, it's an unimaginable reality.", "filename": "2020_04_09_us_inside-chicago-refrigerated-warehouse-bodies_index_1588611613.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409200423-05-chicago-refrigerated-warehouse-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_us_inside-chicago-refrigerated-warehouse-bodies_index_1588611613.html", "title": "Inside Chicago's refrigerated warehouse for bodies", "title_page": "Inside Chicago's refrigerated warehouse for bodies - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) It was a grim precaution. Now, it's an unimaginable reality.\nJust a 20-minute drive from the heart of downtown Chicago sits a refrigerated warehouse, which is now being prepped as a space to potentially store more than 2,000 bodies amid the increase in coronavirus-related deaths.\nLocal officials call it \"the surge center.\"\nFrom the outside, a nondescript exterior gives no indication of the type of work going on inside the facility, which stretches nearly an entire neighborhood block. Inside, the frigid temperatures reach as high as 40 degrees Fahrenheit, and as low as five degrees Fahrenheit.\nWarehouse workers have been replaced by doctors in scrubs and masks, who are familiarizing themselves with what may very well become their new primary working environment.\nSome rooms are big enough to fit multiple semi-trailers, which this week were being deconstructed in order to accommodate rows of three-tiered racks for bodies to be transported and worked on within the facility.\nEach rack has a number. One, two, three, and so on -- each able to support three to four bodies.\n\"We're going to get them mostly in refrigerated trailers from the hospitals, so the staff wear all their protective equipment and lift bodies from the trailers and take out bodies from the trailers and then move them into racks,\" Dr. Ponni Arunkumar, Chief Medical Examiner for Cook County, told CNN.\nDr. Ponni Arunkumar, Chief Medical Examiner for Cook County.\nThe warehouse officially went into operation on Thursday. Arunkumar said she expects they'll need the space for its grim new purpose in a matter of days.\nCoronavirus-related death toll in Chicago continues to rise\nThe second confirmed coronavirus in the US was identified in Chicago on Jan. 24, according to the US Centers for Disease Control and Prevention.\nThe first confirmed coronavirus-related death in Illinois was reported in Chicago on March 17.\nLike many other states across the US, Illinois has implemented a stay-at-home order . Gov. J.B. Pritzker issued the order on March 21, and it extends through at least April 30.\nBut the number of cases and deaths has continued to rise, with no end in sight as the pandemic spreads across the US.\nOf the more than 16,000 confirmed cases in the state of Illinois, 10,520 of them are in Cook County, which has reported more than 300 deaths, according to data from Johns Hopkins University.\n\"Just in two weeks we started with 10 or 20 (deaths) a week, and now we're at 40 a day,\" Arunkumar said. \"This increase is occurring at a very rapid pace so we expect to see hospitals, hospital morgues getting filled up, and we'll need to use refrigerated trailers to start moving these patients to the surge center soon.\"\nThe Cook County Medical Examiner's office sits just five miles away from the warehouse, and has a capacity for 285 bodies. However, once the office hits 270 bodies, Arunkumar said they will need to use the warehouse.\nA doctor with the Cook County Medical Examiner's Office testing the device used to weigh and transfer bodies into their respective racks.\nThere were 240 bodies at the Medical Examiner's Office as of Wednesday night, Arunkumar said.\nSeeing the surge in coronavirus-related deaths nationwide, county officials knew they had to make a plan.\nBill Barnes, executive director of Cook County's Department of Emergency Management and Regional Security, said the county began considering options even before the virus hit the US hard.\n\"I would say we began looking for a surge facility such as this well over a month ago,\" Barnes told CNN. \"We had an eye on some percentages and if we were even looking at a 2% fatality rate that would create some very large numbers in this county of 5.5 million people. We knew we had to jump on it fast.\"\nAfter they came up with the idea for a separate space, officials spent weeks looking closely at various facilities to see what they offered, before eventually settling on a final location.\n\"We had to bring in all of our stakeholders, including the Medical Examiner's Office, the hospitals where the patients are going to be discharged from, and the funeral home directors to identify a solution to the problem,\" Barnes said.\n'We want to treat them with the respect and dignity they deserve'\nBoth Barnes and Arunkumar had hoped a place like the \"surge center\" would never have to be used.\nBut in a matter of weeks, that hope diminished -- and county officials turned to real planning for a need that continues to evolve.\nBarnes said the Examiner's Office is dealing with over 60 hospitals in the city of Chicago and in the suburbs.\n\"(We're) keeping tabs on the level of fatalities at all of those hospitals and making sure we have the capacity and ability to transport those fatalities to the surge center to allow it to do the job its intended to do,\" Barnes said.\nArunkumar said the county cannot afford to be unprepared.\n\"We need to be prepared for any eventuality,\" Arunkumar said. \"We're the last physicians to see these patients and we want to treat them with the respect and dignity they deserve.\"", "url": "https://www.cnn.com/2020/04/09/us/inside-chicago-refrigerated-warehouse-bodies/index.html"}