{"authors": ["Tara Subramaniam", "Holmes Lybrand", "Christopher Hickey Cnn"], "date_download": "2020-05-04 16:28:16", "date_modify": "2020-05-04 16:28:16", "date_publish": "2020-04-07 20:32:47", "description": "On Monday, an internal government watchdog issued a sobering report on the situation inside US hospitals battling the coronavirus. Based on interviews with more than 300 hospital administrators over four days in late March, the report describes a dire situation for front-line doctors and medical staff beset by \"severe\" and \"widespread\" shortages of key medical supplies, as well as persistent problems and delays with testing.", "filename": "2020_04_07_politics_hhs-ig-report-trump-claims_index_1588609696.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405190737-02-coronavirus-briefing-0405-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_hhs-ig-report-trump-claims_index_1588609696.html", "title": "The stark difference between what hospitals are going through and how Trump has described the situation", "title_page": "The stark difference between what hospitals are going through and how Trump has described the situation - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) On Monday, an internal government watchdog issued a sobering report on the situation inside US hospitals battling the coronavirus. Based on interviews with more than 300 hospital administrators over four days in late March, the report describes a dire situation for front-line doctors and medical staff beset by \"severe\" and \"widespread\" shortages of key medical supplies, as well as persistent problems and delays with testing.\nThose details stand in stark contrast to the story that the Trump administration has told, and undercuts President Donald Trump's assertion that hospitals have what they need. Asked about the report during Monday's coronavirus briefing, President Trump baselessly called it wrong and suggested, without evidence, it was politically motivated.\nConducted over four days in late March by the inspector general of the Health and Human Services Department, the report's interviews offer a comprehensive look into what was actually happening inside many of the nation's hospitals as the coronavirus spread and workers were stretched to a near breaking point.\nRead More", "url": "https://www.cnn.com/2020/04/07/politics/hhs-ig-report-trump-claims/index.html"}