{"authors": ["Daniel Dale", "Tara Subramaniam", "Marshall Cohen", "Holmes Lybrand"], "date_download": "2020-05-04 16:18:30", "date_modify": "2020-05-04 16:18:30", "date_publish": "2020-04-04 02:41:38", "description": "President Donald Trump made yet another series of inaccurate or misleading claims at a coronavirus briefing on Friday.", "filename": "2020_04_03_politics_facts-c_7afa7708d23d2a74f706ccfc7852215c_index_1588609110.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403193608-trump-press-briefing-4-3-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_facts-c_7afa7708d23d2a74f706ccfc7852215c_index_1588609110.html", "title": "Fact-check: Trump says some states aren't in jeopardy from the virus, denies saying it would go away by April", "title_page": "Fact-check: Trump says some states aren't in jeopardy from the virus, denies saying it would go away by April - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "He incorrectly asserted that some states are not in jeopardy from the virus, incorrectly suggested that his February claims that the virus would simply go away have been proved correct, incorrectly suggested again that nobody could have foreseen the pandemic crisis and again made medical claims not supported by solid evidence.\nStates without stay-at-home orders are 'not in jeopardy'\nDespite recent support from members of his coronavirus task force for a nationwide stay-at-home order, Trump said he'd \"leave it up to the governors.\" As justification for this decision, Trump claimed the states currently without stay-at-home orders are \"not in jeopardy.\"\nFacts First: It's not true that the nine states without active stay-at-home orders at the time of the President's remarks are \"not in jeopardy\" or at risk from the coronavirus. Though they are not current \"hot spots\" for the virus, all of them were dealing with at least 100 reported cases as of Friday, and a third of them had more than 1,000 cases.\nMissouri, South Carolina, Utah, Iowa, Arkansas, Nebraska, South Dakota, North Dakota and Wyoming did not have statewide stay-at-home orders in place as of Friday evening.\nAlthough South Dakota, North Dakota and Wyoming are among the five states with the least amount of cases in the US, South Carolina and Utah had 1,554 and 1,095 cases, respectively.\nMissouri's stay-at-home order goes into effect Monday. The state had at least 1,864 cases before Gov. Mike Parson issued the order Friday evening.\nVirus going away\nReminded by CNN chief White House correspondent Jim Acosta that he had claimed the virus would go away, Trump said, \"It is going to go away.\" Reminded that he had said it would go away in April, Trump said, \"I didn't say a date. ... I said it's going away, and it is going away.\"\nFacts First: Trump never said the virus would go away by one specific day, but he did say repeatedly in February that he believed the virus would go away by or in the month of April -- calling April \"a beautiful date to look forward to.\" (He qualified some of these claims with phrases like \"I hope,\" \"supposedly\" and \"we're not sure yet.\") Also, it's misleading at best for Trump to suggest that what he said in February has been proved accurate. Trump did not mention then that thousands of Americans could die before the virus went away, nor that the country could have to implement drastic measures to try to slow the spread of the virus.\nTrump repeatedly suggested in February that he believed the virus would not exist in the United States by May.\n\"You know in April, supposedly, it dies with the hotter weather. And that's a beautiful date to look forward to,\" he said in a Fox Business interview on February 10.\n\"You know, a lot of people think that goes away in April with the heat -- as the heat comes in. Typically, that will go away in April,\" he told governors that same day\n\"Looks like by April, you know, in theory, when it gets a little warmer, it miraculously goes away. I hope that's true,\" he said at a New Hampshire campaign rally the same day.\n\"There's a theory that, in April, when it gets warm -- historically, that has been able to kill the virus. So we don't know yet; we're not sure yet. But that's around the corner, so that'll be a great thing in China and other places,\" he told National Border Patrol Council members on February 14.\nThe virus may go away in the United States at some point, but all evidence suggests it is still spreading widely. And experts warn that there could be a second wave of the virus in the US even after the immediate crisis is over.\n\"#COVID19 won't go away. It'll infect the southern hemisphere as they winter and will want to come back to U.S. in fall,\" Dr. Scott Gottlieb, who formerly served as Trump's Food and Drug Administration commissioner, wrote on Twitter on Monday. \"But we'll have a massive surveillance system by then, and I believe more than one drug to both prevent and treat infection. Our tool box will be very different.\"\nDetails of coronavirus treatments\nTrump and Vice President Mike Pence both stumbled over medical details, and spread inaccurate information, while touting new coronavirus tests and potential treatments.\nTrump mentioned anti-malaria drugs that are being tested as potential treatments, saying that the clinical trials are \"having some good results,\" even though public health officials say the results are months away.\nMoments later, Pence said the FDA had \"approved\" a new method to test for the coronavirus, even though the FDA only granted emergency authorization for the test, which requires a much lower standard.\nFacts First: Both comments overstate the medical realities a bit. For Trump, he has repeatedly touted and expressed unbridled optimism about the drugs, even without conclusive scientific data to back up his claims. For Pence, he oversold the FDA's confidence in the new Covid-19 test.\nIn recent weeks, Trump has repeatedly touted two pharmaceuticals , chloroquine and the chemically similar hydroxychloroquine, as potential \"game-changers\" that could end the pandemic and save lives.\n\"We continue to study the effectiveness of hydroxychloroquine and other therapies and treatments of the virus,\" Trump said on Friday at the White House press briefing. \"And we will keep the American people informed of our findings.\"\nTrump continued, apparently off-script from his prepared remarks, \"Hydroxychloroquine, I don't know. It's looking like it's having some good results. I hope that would be a phenomenal thing.\"\nThis is the continuation of a glaring messaging gap within the administration. Trump has breathlessly promoted the drugs while the public health officials are cautiously waiting for scientific evidence, and tamping down expectations, by saying that the information out there already is only anecdotal and not proven on a large scale.\nLater in the news conference, Pence brought up the new blood test for coronavirus antibodies\n\"And the big news, of course, over the last few days was that the FDA, once again, in near-record time, has approved an antibody test developed by Cellex,\" Pence said.\nThis isn't quite accurate. The FDA uses very specific terminology about medical drugs, tests and equipment, and the agency would likely disagree with the notion that it \"approved\" the test. These terms are important, as medical professionals need clarity to be sure their use of these items is safe for every patient.\nWhat really happened was that the FDA granted \"emergency use authorization\" for the tests. This essentially means that the agency will let health care providers use the tests during this crisis, even though it hasn't gone through all the steps that medicines and medical tests usually go through before receiving a full \"approval.\"\nFull-blown FDA approvals require more scientific proof than is currently available. In granting emergency authorization, the agency weighs the evidence and makes a tempered assessment during a crisis.\n\"Based on the totality of scientific evidence available to FDA, it is reasonable to believe that your product may be effective in diagnosing COVID-19,\" the agency said in a letter to Cellex, granting the emergency authorization, adding that \"the known and potential benefits of your product when used for diagnosing COVID-19, outweigh the known and potential risks of your product.\"\nNobody could have seen this coming\nWhile discussing federal, state and local stockpiles of medical supplies, Trump said \"nobody could ever have assumed that something like this\" would happen in reference to the coronavirus pandemic.\nFacts First: Public health and national security officials have been warning for years of the potential dangers of a pandemic, including Trump's very own health and human services secretary, Alex Azar, who said in 2019 that the threat of a pandemic flu kept him up at night.\nAs CNN's KFile team reported Friday, Azar and Tim Morrison, then a special assistant to the President and senior director for weapons of mass destruction and biodefense on the National Security Council, spoke at the BioDefense Summit in April 2019, where they specifically talked about the possibility of a flulike pandemic.\nDuring the summit, Azar, when contemplating what keeps him up at night \"in the biodefense world\" said the \"pandemic flu, of course. I think everyone in this room probably shares that concern.\"\nWhen asked about KFile's reporting during Friday's presser, Trump said, \"I assume that he was talking about the concept of a pandemic.\"\nMorrison discussed the concern about a pandemic flu in the same terms as Azar during the summit.\nWhen speaking on the Spanish flu pandemic of 1918 and how it had killed \"more people than any other outbreak of disease in human history,\" Morrison said that \"when people ask me what keeps me up at night, it's issues like that.\"\nYou can read more about Azar's and Morrison's comments here\nWhen it comes to the supplies needed for such a pandemic, many studies and health experts have warned of the medical equipment shortages the US would face.\nDr. David Morens, a top National Institutes of Health official, specifically noted in October 2018 that there would not be enough room in hospitals in the case of a pandemic like the 1918 flu. Morens also said that while the total number of items like drugs, antibiotics, antivirals and ventilators in the US national stockpile is unknown, \"what I do know is it's not nearly enough.\"\nThe role of the Strategic National Stockpile\nTrump was asked about the claim Thursday by his senior adviser and son-in-law, Jared Kushner, that the Strategic National Stockpile is \"supposed to be our stockpile; it's not supposed to be state stockpiles that they then use.\" Trump responded: \"You know what 'our' means? United States of America.\" He added, \"Then we take that 'our' and we distribute it to the states.\"\nAsked why Kushner had said, in that case, that \"it's not supposed to be state stockpiles,\" Trump responded, \"Because we need it for the government, and we need it for the federal government.\" He also said Friday that states \"have to have (supplies) for themselves\" and some states were \"not in good shape.\"\nFacts First: Trump's explanation of Kushner's remark was too vague to call false or misleading, but Kushner's remark itself was false: The Strategic National Stockpile is indeed designed to be accessed by states, even states that have prepared well for a potential emergency. In August, Greg Burel, then the director of the stockpile, : Trump's explanation of Kushner's remark was too vague to call false or misleading, but Kushner's remark itself was false: The Strategic National Stockpile is indeed designed to be accessed by states, even states that have prepared well for a potential emergency. In August, Greg Burel, then the director of the stockpile, wrote on another government webpage: \"Emergencies can overwhelm state and local medical resources even with the best preparation.\"\nThe website for the stockpile was edited on Friday after media outlets pointed out that its home page contradicted Kushner's claim. (A spokesperson for the Department of Health and Human Services office that manages the stockpile said on condition of anonymity that the edit had been in the works for a week, well before Kushner's remark, but would not comment on the record.) Even the new version of the website, though, acknowledges that the stockpile's \"role is to supplement state and local supplies during public health emergencies.\"", "url": "https://www.cnn.com/2020/04/03/politics/facts-check-trump-coronavirus-briefing-april-3/index.html"}