{"authors": ["Meg Kinnard"], "date_download": "2020-05-04 21:07:12", "date_modify": "2020-05-04 21:07:12", "date_publish": "2020-04-16 15:32:53", "description": "COLUMBIA, S.C. (AP) — In his pursuit of a fourth term representing South Carolina, U.S. Sen. Lindsey Graham has been outraised for the first time by his Democratic challenger, in a record-breaking...", "filename": "_17f3c9da6088165b64f134c5f1e81f8e_1588626432.html", "image_url": "https://storage.googleapis.com/afs-prod/media/feccbe49d3aa476aa22fed410b73a4d4/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_17f3c9da6088165b64f134c5f1e81f8e_1588626432.html", "title": "South Carolina's Graham outraised by Democratic challenger", "title_page": "South Carolina's Graham outraised by Democratic challenger", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Dec. 14, 2019 file photo, Democrat Jaime Harrison, who is seeking to challenge Republican U.S. Sen. Lindsey Graham, speaks to Democrats gathered at the Spratt Issues Conference in Greenville, S.C. U.S. Sen. Lindsey Graham has been outraised for the first time by his Harrison, Democratic challenger, in a record-breaking quarterly period that sets up a multimillion-dollar grudge match leading into the general election. Harrison announced late Wednesday, April 14, 2020, that he took in $7.36 million in the first three months of 2020, a figure his campaign said brought his total, overall fundraising to nearly $15 million. (AP Photo/Meg Kinnard, File)\nFILE - In this Dec. 14, 2019 file photo, Democrat Jaime Harrison, who is seeking to challenge Republican U.S. Sen. Lindsey Graham, speaks to Democrats gathered at the Spratt Issues Conference in Greenville, S.C. U.S. Sen. Lindsey Graham has been outraised for the first time by his Harrison, Democratic challenger, in a record-breaking quarterly period that sets up a multimillion-dollar grudge match leading into the general election. Harrison announced late Wednesday, April 14, 2020, that he took in $7.36 million in the first three months of 2020, a figure his campaign said brought his total, overall fundraising to nearly $15 million. (AP Photo/Meg Kinnard, File)\nCOLUMBIA, S.C. (AP) — In his pursuit of a fourth term representing South Carolina, U.S. Sen. Lindsey Graham has been outraised for the first time by his Democratic challenger, in a record-breaking quarterly period that sets up a competitive multimillion-dollar campaign leading into the general election.\nDemocrat Jaime Harrison took in $7.36 million in the first three months of 2020, his campaign announced late Wednesday. Graham took in $5.6 million during the same period, a total his campaign said was achieved despite holding no fundraisers during the Senate impeachment trial of President Donald Trump, as well as during the first two weeks of the quarter, due to the new coronavirus outbreak.\nBoth figures easily eclipsed the $3.9 million raised by Graham last quarter, which had been the state record for money raised in a single quarter. The totals also brought a significant bump to the war chests of both campaigns, with Harrison posting about $8 million cash on hand, and Graham with $12.8 million.\nOver the course of the campaign, Harrison has raised nearly $15 million. Graham has taken in a total of $21 million, according to Federal Election Commission records.\n“We’re so grateful for this outpouring of support from everyday people who are looking for leadership that puts them first,” said Guy King, spokesman for Harrison’s campaign. In a release, Graham campaign manager Scott Farmer called it “truly humbling to see the tremendous support and momentum continue to grow for Sen. Graham.”\nThe 44-year-old Harrison, an associate chairman with the Democratic National Committee and former chairman of the South Carolina Democratic Party, has from the start aimed to draw high-level support that could bring the fundraising and grassroots organizing that would be crucial in trying to flip a Senate seat in the deeply red state. Last spring, he received backing from the Democratic Senatorial Campaign Committee and has since gotten support from former Vice President Joe Biden, as well as other 2020 hopefuls including U.S. Sen. Kamala Harris and U.S. Sen. Cory Booker.\nHe’s also supported by House Majority Whip Jim Clyburn, who has long been a political mentor for Harrison, his former director of U.S. House floor operations.\nGraham, 64, is a popular incumbent seeking a fourth term, supported by Trump in a state where the administration’s favorability remains high and Republicans currently occupy all statewide offices and control both legislative chambers. As Democrats in the state prepared to vote in February’s first-in-the-South presidential primary, Graham appeared alongside Trump at a campaign rally in North Charleston on the eve of the balloting. Vice President Mike Pence helped Graham kick off his reelection bid last year.\nGraham faces three GOP opponents in the primary election, scheduled for June 9. Another Democratic contender, economist Gloria Bromell Tinubu, dropped out and endorsed Harrison earlier this year.\n___\nMeg Kinnard can be reached at http://twitter.com/MegKinnardAP", "url": "https://apnews.com/17f3c9da6088165b64f134c5f1e81f8e"}