{"authors": [], "date_download": "2020-05-04 20:06:13", "date_modify": "2020-05-04 20:06:13", "date_publish": "2020-04-07 21:49:10", "description": "MADISON, Wis. (AP) — Prosecutors on Tuesday charged a teenager with fatally shooting a University of Wisconsin physician and her husband, who were the parents of his girlfriend, and leaving their...", "filename": "_d4d5d230a53599e48bde57d100d6eef9_1588622773.html", "image_url": "https://storage.googleapis.com/afs-prod/media/eba4334f24f94ac9b841c8c570fc7eaa/1280.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d4d5d230a53599e48bde57d100d6eef9_1588622773.html", "title": "Daughter's boyfriend charged in killings of doctor, husband", "title_page": "Daughter's boyfriend charged in killings of doctor, husband ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "1 of 4 In this photo provided by the Dane County, Wisconsin Sheriff's Office, Khari Sanford is pictured in a booking photo dated April 3, 2020. Sanford has been booked into the Dane County Jail on two counts of party to the crime of first-degree intentional homicide, in the slayings of a University of Wisconsin physician and her husband. (AP/Dane County Sheriff's Office)\n1 of 4 In this photo provided by the Dane County, Wisconsin Sheriff's Office, Khari Sanford is pictured in a booking photo dated April 3, 2020. Sanford has been booked into the Dane County Jail on two counts of party to the crime of first-degree intentional homicide, in the slayings of a University of Wisconsin physician and her husband. (AP/Dane County Sheriff's Office)\nMADISON, Wis. (AP) — Prosecutors on Tuesday charged a teenager with fatally shooting a University of Wisconsin physician and her husband, who were the parents of his girlfriend, and leaving their bodies at the school’s arboretum.\nKhari Sanford, 18, was charged with two counts of party to the crime of first-degree intentional homicide, use of a dangerous weapon. A friend of Sanford’s, 18-year-old Ali’jah Larrue, was charged as an accomplice and faces two counts of party to the crime of first-degree intentional homicide. Bail for each was set at $1 million. Sanford’s attorney, Crystal Vera, declined comment, while Larrue’s attorney did not immediately respond to a request for comment Tuesday.\nAccording to the criminal complaint, Sanford’s girlfriend was the daughter of the victims, Dr. Beth Potter, 52, and her husband, 57-year-old Robin Carre. Joggers found the victims at the arboretum, a research and popular recreational area, near the Madison campus on March 31.\nAutopsies found both victims were shot in the back of the head, apparently the night before their bodies were discovered. Several spent shell casings were found around the victims. Potter was wearing pajamas and socks but no shoes in the chilly weather, while Carre wore only underwear, the complaint said.\nA friend of Potter’s told investigators that the couple had moved their daughter and Sanford out of their house and into a rental home because they were not following social distancing rules amid the coronavirus outbreak. Potter’s supervisor at University of Wisconsin Hospital and Clinics said Potter’s medication put her at greater risk of infection and that she needed social distancing.\nHours before the killings, Potter told her friend that her daughter told her “You don’t care about me” and “You don’t talk to me” as she and Sanford were moving out, and that Potter was “clearly frustrated” during the conversation, the complaint said.\nA classmate at Madison West High School told investigators that he overheard a discussion between the victims’ daughter and Sanford in a ceramics class shortly before school was canceled last month, in which she told Sanford her parents had “bands” of money and that they were rich. The friend said “bands” likely meant thousands of dollars in cash.\nThe friend told investigators that Sanford appeared excited and frantic when he stopped by his house on March 31 and made a phone call to Larrue. Sanford said to Larrue he had heard on social media that one of the victims was in the hospital and possibly alive, the friend said.\n“I swear I hit them, how did they survive,” Sanford allegedly said. The friend said Sanford got off the phone and told him he had shot the people at the arboretum “in the back of the head” and that Larrue was with him. When the interview was conducted, authorities had not said publicly how the victims were injured.\nSurveillance video showed a minivan similar to one owned by Carre traveling on streets around campus that matched GPS coordinates on Larrue’s cellphone, the complaint said.\nWhen police interviewed the victims’ daughter, she told them she was with Sanford the night of the killings and that neither one had left their rental home.\nUW police spokesman Marc Lovicott said Tuesday that the investigation remains active. Police have said that the couple was targeted and that Sanford was known to the victims’ family.\nPotter worked at the Wingra Family Medical Center, run by the UW-Madison Department of Family Medicine and Community Health and Access Community Health Centers. She also was medical director of UW Health’s Employee Health Services.\nCarre headed up a Madison youth soccer club. Carre’s professional consulting work involved helping high school students best prepare themselves for college admissions.\nThe couple is survived by three children in their teens and twenties.", "url": "https://apnews.com/d4d5d230a53599e48bde57d100d6eef9"}