{"authors": ["Elizabeth Cohen", "Dr. Minali Nigam"], "date_download": "2020-05-04 17:03:33", "date_modify": "2020-05-04 17:03:33", "date_publish": "2020-04-08 21:10:59", "description": "President Trump has been a cheerleader for the drug hydroxychloroquine, pointing in a tweet and in person to a French study as evidence that one particular drug combination might be \"one of the biggest game changers in the history of medicine.\"", "filename": "2020_04_08_health_drug-hydroxychloroquine-french-study_index_1588611813.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408041447-hydroxychloroquine-bottle-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_health_drug-hydroxychloroquine-french-study_index_1588611813.html", "title": "Publisher of hydroxychloroquine study touted by Trump says the research didn't meet its standards", "title_page": "Publisher of hydroxychloroquine study touted by Trump says the research didn't meet its standards - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Trump has been a cheerleader for the drug hydroxychloroquine, pointing in a tweet and in person to a French study as evidence that one particular drug combination might be \"one of the biggest game changers in the history of medicine.\"\nBut now the medical society that published the French research has issued a statement saying they're reviewing the study again and \"a correction to the scientific record may be considered.\"\n\"The study was a complete failure,\" he said.\n\"It was pathetic,\" added Art Caplan , head of the division of medical ethics at the New York University School of Medicine.\nThe small French study of 20 people found that taking hydroxychloroquine was associated with the \"viral load reduction/disappearance in COVID-19 patients,\" noting that the effect was \"reinforced\" with azithromycin, an antibiotic better known as a Z-pack.\nTracey and Caplan pointed out that several patients who took the drug, and ended up faring poorly, dropped out of the trial, and their outcomes were not factored into the study's final conclusions.\nThe International Society of Antimicrobial Chemotherapy published the study online in its journal, the International Journal of Antimicrobial Agents, on March 20.\nThe society and the publisher of the journal, Elsevier, issued a joint statement that \"concerns have been raised regarding the content, the ethical approval of the trial and the process that this paper underwent to be published within International Journal of Antimicrobial Agents.\"\nAccording to the statement, the study authors had been contacted to address concerns, and that \"additional independent peer review is ongoing to ascertain whether concerns about the research content of the paper have merit.\"\nOne of the study's co-authors, Jean-Marc Rolain, is also editor-in-chief of the journal.\nThe statement noted that Rolain was not involved in the peer review of the manuscript.\nThe statement from the society and Elsevier is dated April 3, but a previous statement with the same date was on the same webpage and has since been removed.\nThat statement by Andreas Voss, president of the society, said the study \"does not meet the Society's expected standard\" and that \"although ISAC recognises it is important to help the scientific community by publishing new data fast, this cannot be at the cost of reducing scientific scrutiny and best practices.\"\nVoss, Rolain and Didier Raoult, a lead study author, did not immediately respond to CNN emails seeking comment.\nTrump's glowing reviews of an unproven drug\nRarely does one unproven drug make such headlines, but hydroxychloroquine did due to Elon Musk, conservative media and Trump.\nA recent article in Vanity Fair laid out the sequence of events.\nOn March 16, Musk, the Tesla CEO, tweeted that it \"maybe worth considering chloroquine for C19.\" Hydroxychloroquine is a derivative of chloroquine, and C19 is Covid-19, the medical term for the disease caused by the coronavirus.\nTwo days later, Breitbart and The Blaze wrote glowing articles about chloroquine.\nThe day after that, Trump said chloroquine was possibly a \"game changer\" at a White House briefing\nTwo days later, on March 21, Trump referred to the French study in a tweet , saying that the combination of hydroxychloroquine and azithromycin \"have a real chance to be one of the biggest game changers in the history of medicine. The FDA has moved mountains -- Thank You!\"\nTrump's enthusiasm for hydroxychloroquine hasn't waned with time, even though it's one of many drugs being studied to prevent or treat coronavirus, and none of them have been proven to be safe or effective.\n\"We have some very good results and some very good tests. You've seen the same test that I have,\" he said at an April 5 briefing . \"In France, they had a very good test.\"\nDoctor says hydroxychloroquine still worth studying\nIn its statement, the society that published the paper mentioned concerns about \"the lack of better explanations of the inclusion criteria\" in the study, which took place at the Méditerrannée Infection University Hospital Institute in Marseille, France.\nThe study started out with 26 patients taking the hydroxychloroquine, but six were \"lost in follow up during the survey because of early cessation of treatment,\" according to the study.\nThree left because they ended up in the intensive care unit, another patient died, and a fifth stopped treatment due to nausea. It turned out the sixth patient didn't actually have coronavirus.\nLeaving out the five patients who took the drug and didn't fare well is \"cherry picking,\" said Caplan, the bioethicist.\n\"That's not science,\" he said. \"You've got your thumb on the scale.\"\nThe remaining 20 patients took hydroxychloroquine, some with the antibiotic azithromycin and some without, and their outcomes were compared with patients who did not take either drug.\nThe study authors wrote that \"100%\" of patients who took the drug combination were \"virologically cured\" compared to 57.1% of the patients who took hydroxychloroquine alone and 12.5% of the control group. The authors did not fully explain what they meant by \"virologically cured.\"\nCaplan added that even without the \"cherry picking\" issue, a study with such a small number of patients is basically meaningless.\n\"It's just a jumbled mess,\" he said.\nSeveral centers are doing clinical trials on hydroxychloroquine to prevent or treat coronavirus, including Harvard, Columbia, New York University and Henry Ford Health System in Detroit.\nTracey, the researcher at the Feinstein Institutes in New York City, is also conducting a study on the drug. He said despite the French study being \"seriously flawed,\" it's still worth looking at hydroxychloroquine to see if it's safe and effective for a subset of coronavirus patients.\nFirst, he noted that hydroxychloroquine has anti-inflammatory properties. The US Food and Drug Administration has approved its use against lupus and rheumatoid arthritis, both diseases that involve inflammation.\nHydroxychloroquine might help coronavirus patients who experience what's called a \"cytokine storm,\" a potentially deadly inflammatory process.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nAnd small studies other than the \"seriously flawed\" French one have shown that the drug might work, he added.\n\"There's a lot of small studies in humans and in the lab that frame an appropriate question that's never been answered in a clinical trial,\" he said. \"It's important to know if it works and if it's safe in some people with coronavirus.\"", "url": "https://www.cnn.com/2020/04/08/health/drug-hydroxychloroquine-french-study/index.html"}