{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:15:53", "date_modify": "2020-05-04 16:15:53", "date_publish": "2020-04-03 14:10:51", "description": "On Thursday afternoon -- moments before he urged people to take politics out of the coronavirus fight -- President Donald Trump sent an absolutely unbelievable letter to Senate Minority Leader Chuck Schumer.", "filename": "2020_04_03_politics_chuck-s_659823303c491f36a6dff5d9e6c6bb22_index_1588608953.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403082550-donald-trump-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_chuck-s_659823303c491f36a6dff5d9e6c6bb22_index_1588608953.html", "title": "The 11 wildest lines from Donald Trump's utterly childish letter to Chuck Schumer", "title_page": "The 11 wildest lines from Donald Trump's utterly childish letter to Chuck Schumer - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) On Thursday afternoon -- moments before he urged people to take politics out of the coronavirus fight -- President Donald Trump sent an absolutely unbelievable letter to Senate Minority Leader Chuck Schumer.\nThe letter, which the White House released (and my producer Alli Gordon transcribed!) reads like a sort of Mad Libs you might fill out and leave in the locker of your 7th grade enemy. It makes abundantly clear that Trump is annoyed with Schumer's push for a more robust federal response to the coronavirus pandemic and angry at the New York Democrat's push for White House trade adviser Peter Navarro to be replaced as the coordinator of the Defense Production Act.\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!\nI went through the letter -- it's about a page and a quarter -- and pulled out the lines you need to see. (You can read the whole thing here .) They're below.\n1. \"Thank you for your Democrat public relations letter and incorrect sound bites, which are wrong in every way.\"\nDemocrat .\" And away we go!\n2. \"Vice President Pence is in charge of the Task Force. By almost all accounts, he has done a spectacular job.\"\nThis is classic Trump stuff here. Pence is receiving rave reviews \"by almost all accounts.\" In fact, many people are saying the vice president is doing the best job of leading the coronavirus task force that anyone has ever done. Spectacular!\n3. \"The Defense Production Act (DPA) has been consistently used by my team and me for the purchase of billions of dollars' worth of equipment, medical supplies, ventilators, and other related items.\"\n4. \"We have given New York many things, including hospitals, medical centers, medical supplies, record numbers of ventilators, and more.\"\n\"I have neither the time, or the inclination, to explain myself to a man, who rises and sleep under the blanket of the very freedom that I provide, and then questions the manner, in which I provide it. I'd rather you just say 'thank you' and go on your way.\" -- Colonel Nathan Jessup\n5. \"As you are aware, the Federal Government is merely a back-up for state governments. Unfortunately, your state needed far more of a back-up than most others.\"\nThe fault, as always, lies with someone other than Trump. See, Schumer should be grateful anything he gets from Trump -- because New York did so poorly in preparation. See, it all makes sense. Right? Right?!?!\n6. \"If you spent less time on your ridiculous impeachment hoax, which went haplessly on forever and ended up going nowhere (except increasing my poll numbers), and instead focused on helping the people of New York, then New York would not have been so completely unprepared for the 'invisible enemy.'\"\nWe're back to impeachment! Also, there is zero indication that the impeachment trial had any significant effect on the ability of Schumer or anyone else to be prepared (or not) for the coming coronavirus. As The Washington Post's Philip Bump details , the trial ended on February 5 and in the months of February and early March, Trump himself \"visited Mar-a-Lago three times, his hotel in downtown Washington once and his hotel in Las Vegas for a three-day stay in late February.\"\n7. \"No wonder AOC and others are thinking about running against you in the primary. If they did, they would likely win.\"\nThere's very little evidence that Rep. Alexandria Ocasio-Cortez is planning a primary challenge to Schumer in 2022 . In fact, the only person who is talking regularly about this is -- wait for it -- Donald Trump\n8. \"You have been missing in action, except when it comes to the 'press.'\"\nWhy, why, WHY is the word press in quotes in the letter? My kingdom for an answer to this eternal question. (Related note: I don't have a kingdom. More of a fiefdom.)\n9. \"While you have stated that you don't like Andrew Cuomo, you ought to start working alongside him for the good of all New Yorkers.\"\nI dug around the internet for some evidence that Schumer said he didn't like the New York governor, but couldn't find it. (Maybe Trump knows something I don't.) The closest I came was the fact that Cuomo was sharply critical of the $2 trillion economic stimulus bill that Schumer negotiated with Treasury Secretary Steve Mnuchin late last month.\n10. \"I've known you for many years, but I never knew how bad a Senator you are for the state of New York, until I became President.\"\nLook, we've known each other for a long time now. But it's only of late I have realized how terrible you are at, well, life. Worth noting: Schumer won reelection with 71% of the vote in 2016.\n11. \"If you have any questions, please do not hesitate to call.\"\nYou're the absolute worst! Call anytime! This feels like a good place to end.", "url": "https://www.cnn.com/2020/04/03/politics/chuck-schumer-donald-trump-letter-coronavirus/index.html"}