{"authors": ["Alicia Lee"], "date_download": "2020-05-04 16:34:23", "date_modify": "2020-05-04 16:34:23", "date_publish": "2020-04-07 21:33:21", "description": "Nearly 60,000 years ago, as prehistoric humans just started venturing out of Africa, a forest of cypress trees grew on the banks of a river near the Gulf of Mexico. As the trees grew old, they fell and were buried under sediment. When the sea level rose, the remains of the forest were covered once again.", "filename": "2020_04_07_us_ancient-underwater-forest-alabama-scn-trnd_index_1588610063.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407131847-ancient-underwater-forest-alabama-scn-trnd-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_us_ancient-underwater-forest-alabama-scn-trnd_index_1588610063.html", "title": "Scientists uncover an ancient underwater forest that could help pioneer new medicines", "title_page": "Scientists uncover an ancient underwater forest that could help pioneer new medicines  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Nearly 60,000 years ago, as prehistoric humans just started venturing out of Africa , a forest of cypress trees grew on the banks of a river near the Gulf of Mexico. As the trees grew old, they fell and were buried under sediment. When the sea level rose, the remains of the forest were covered once again.\nNow, scientists have uncovered that same forest and believe it may hold the secrets to creating new medicines and saving lives.\nFor millennia, the ancient forest remained undisturbed, according to the National Oceanic and Atmospheric Administration, which published an article about the forest last week\nBut in 2004, Hurricane Ivan hit the Gulf Coast, sweeping up the seabed and sediment that kept the forest entombed.\nSince then, the site, which now lies 60 feet underwater off Alabama's coast in Mobile Bay has been visited by a few scientists and filmmakers . But it wasn't until December that a team of scientists from Northeastern University and the University of Utah set out on an expedition funded by NOAA to dive into the waters and bring back pieces of wood to study.\nBrian Helmuth, a professor of marine and environmental sciences at Northeastern University, was one of the scientists who dived in.\n\"It was a really nice day. Pretty calm on the surface and we were expecting it be equally nice on the bottom,\" Helmuth told CNN. \"But we got to the bottom and it was like diving in chocolate milk. We literally could not see our hands in front of our faces.\"\nThe conditions were less than ideal and the fact that previous dive teams saw a lot of sharks in the area made the expedition somewhat risky, but when the scientists finally reached the forest, they were in awe.\n\"It was really amazing. We dove around the edge of this ancient river bed. On our left were these remains of giant stumps and pristine wood coming out of the bank embankment,\" Helmuth recalled. \"Even though the visibility wasn't great, you could pretty easily imagine it being the edge of a cypress forest and it was almost an eerie feeling of stepping back in time.\"\nDespite the wood being 60,000 years old, it was extremely well-preserved because it had been buried under layers of sediment that prevented oxygen from decomposing it.\nA piece of wood that was taken from the ancient underwater forest.\n\"It really looked like something that you could have picked up from today. It still had bark on it. It still had all the coloration on the inside. It was just locked away for 60,000 years,\" Helmuth said.\nBut the real excitement for the scientists started when they took the wood back to the lab.\n\"We were able to take a look at what kind of organisms had taken advantage of this exposed, ancient wood. The different kind of animals buried in there and what kind of animals are living on top of it as well,\" Francis Choi, a senior lab manager at Northeastern University's Marine Science Center, said.\nOut of the more than 300 animals that were removed from the wood, scientists were particularly focused on just one: shipworms, a type of clam that converts wood into animal tissue, according to NOAA.\nShipworms aren't new to science. They're common and can be found in most oceans wherever there's wood. But the bacteria found from the shipworms that had been living inside the 60,000-year-old wood had never been discovered before.\nOcean Genome Legacy Center Director Dan Distel removes a shipworm. The bacteria that shipworms create may lead to new life-saving medicines.\n\"We were able to isolate bacteria from them and get some bacteria that we haven't worked with before, so we're really excited about that,\" Margo Haygood, a research professor of medicinal chemistry at University of Utah, told CNN.\nThe shipworms from the ancient wood produced 100 strains of bacteria, many of them novel, and 12 are undergoing DNA sequencing to evaluate their potential to make new drug treatments.\nPrevious research on shipworm bacteria has already resulted in at least one antibiotic being studied as a drug to treat parasitic infections, according to NOAA. So scientists, including Haygood, are feeling optimistic about these new strains of shipworm bacteria.\nResearcher Marvin Altamia taking pictures of organisms collected from the submerged forest.\n\"We screened for antimicrobials and for neurological activity, which is in the direction of pain drugs as well as anti-cancer drugs,\" Haygood said. \"We have not been (working on antivirals) in the past, but right now my department at University of Utah is spinning up to start including viral assays in the program.\"\nIn addition to lifesaving medicines, scientists will study the new samples to see whether they can be applied in production of paper, textiles, food, animal feeds, fine chemicals and renewable fuels, according to NOAA.\nWhile the coronavirus pandemic has put any future dives to the ancient forest on hold, Haygood said she and the team of scientists will continue to study the samples and hope to publish the results within a year.\nChoi said they're also working on getting AUVs, which are unmanned underwater robots, to capture images and make 3D visualizations to share the wonder of this 60,000-year-old forest with the rest of the world.", "url": "https://www.cnn.com/2020/04/07/us/ancient-underwater-forest-alabama-scn-trnd/index.html"}