{"authors": ["Jason Farkas", "Frank Pallotta", "Cnn Business"], "date_download": "2020-05-04 16:11:08", "date_modify": "2020-05-04 16:11:08", "date_publish": "2020-04-02 23:27:57", "description": "Facing a complete standstill across its entertainment empire due to the coronavirus crisis, the Walt Disney Company notified its employees that it would furlough employees \"whose jobs aren't necessary at this time\" starting on April 19th.", "filename": "2020_04_02_business_disney-world-disneyland-furloughs_index_1588608668.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402183100-disneyland-closed-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_business_disney-world-disneyland-furloughs_index_1588608668.html", "title": "Disney furloughs employees 'whose jobs aren't necessary at this time'", "title_page": "Disney furloughs employees 'whose jobs aren't necessary at this time' - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Facing a complete standstill across its entertainment empire due to the coronavirus crisis, the Walt Disney Company notified its employees that it would furlough employees \"whose jobs aren't necessary at this time\" starting on April 19th.\nDisney DIS Disney has been crippled by the coronavirus pandemic. Its theme parks around the world have shuttered, its cruise line is suspended and many of its biggest films of the year have been delayed . Live sporting events, the lifeblood of the Disney-owned ESPN, have also been suspended. Shares ofhave plummeted more than 30% year to date.\nThe impact is hitting Disney's theme park employees especially hard. All of Disney's twelve theme parks have been shuttered since March 15th , after which the company committed to paying salaries through April 18th. In the statement, the company said there was \"no clear indication of when we can restart our businesses,\" and that it was \"forced to make the difficult decision to take the next step and furlough employees.\" More than 75% of the company's 223,000 employees work for the Parks and Products division\nThe furloughed workers would remain employees of the company and keep their health and education benefits, while also being able to access federal and state aid like unemployment benefits. Among those impacted could be the Disney Parks' storied \"Imagineers\" — the designers of the parks, rides and hotels.\nDisney's announcement is one of the signs of the economic destruction rippling through the travel industry, which employs some 319 million workers globally.\nRead More", "url": "https://www.cnn.com/2020/04/02/business/disney-world-disneyland-furloughs/index.html"}