{"authors": ["Reporter"], "date_download": "2020-05-04 20:27:26", "date_modify": "2020-05-04 20:27:26", "date_publish": "2020-04-28 23:55:17", "description": "\"There’s been a learning loss because of this disruption,\" he said, as schools have gone online during the coronavirus crisis.", "filename": "entry_california-schools-reopen-july_n_5ea8a6a3c5b6106b8eced5c8_1588624046.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8b1193000002711155163.jpeg?cache=zljawvcwli&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_california-schools-reopen-july_n_5ea8a6a3c5b6106b8eced5c8_1588624046.html", "title": "California May Reopen Schools In July, Gov. Gavin Newsom Says", "title_page": "California May Reopen Schools In July, Gov. Gavin Newsom Says | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "California Gov. Gavin Newsom (D) said Tuesday he’s considering kicking off the coming school year as early as July to account for in-person learning that students are missing right now.\n“As a parent myself and having talked to many other parents and educators, even the kids, I think we might want to consider getting that school year moved up a little bit,” Newsom said at a press briefing.\nCalifornia schools have been closed since mid-March to mitigate the spread of the coronavirus and are expected to remain closed for the rest of the academic year. While classrooms have moved online, so-called “distance learning” cannot entirely replace the benefits of in-person instruction, and it’s especially challenging for the millions of U.S. students without computers or Wi-Fi at home.\n“Learning continues at home, distance learning and the like, but we recognize there’s been a learning loss because of this disruption,” Newsom said. “We’re concerned about that learning loss even into the summer. So we are considering the prospect of an even earlier school year into the fall, as early as late July, early August.”\nFor now, that’s just one of the plans under consideration.\n“We have made no decisions definitively in that space, but I just want folks to know the concern around learning loss and the concern about waiting until later in the year into the fall for the new school year,” Newsom said.\nNewsom’s approach comes as President Donald Trump pushes states to reopen schools, saying Tuesday that governors should “get going on it” despite 43 states and Washington, D.C., having already ordered or recommended that all schools stay closed for the remainder of the academic year.", "url": "https://www.huffpost.com/entry/california-schools-reopen-july_n_5ea8a6a3c5b6106b8eced5c8"}