{"authors": ["Story Alexis Benveniste", "Cnn Business Video Richa Naik", "Cnn Business"], "date_download": "2020-05-04 16:01:14", "date_modify": "2020-05-04 16:01:14", "date_publish": "2020-04-01 16:05:52", "description": "As the coronavirus continues to spread, fitness studios around the country are shutting their doors and adjusting to a new reality.", "filename": "2020_04_01_business_fitness-studios-coronavirus_index_1588608074.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200318093906-02-mirror-fitness-home-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_business_fitness-studios-coronavirus_index_1588608074.html", "title": "The $94 billion fitness industry is reinventing itself as Covid-19 spreads", "title_page": "The $94 billion fitness industry is reinventing itself as Covid-19 spreads - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) As the coronavirus continues to spread, fitness studios around the country are shutting their doors and adjusting to a new reality. The sudden shift has inspired creativity and flexibility for gyms and studios, which are largely dependent on physical locations and on-site staff.\nThe changes have rocked the fitness industry, which was worth $94 billion in 2018, according to The International Health, Racquet & Sportsclub Association.\nSome studios -- such as Modo Yoga, which has locations in the United States, Canada, Australia and France -- are offering free classes on Instagram Live. Other studios, including SoulCycle, closed all of its locations globally, hoping to reopen when conditions improve and the curve flattens. The cult-favorite cycling studio doesn't have any online classes, but bikes are available for pre-order with a price tag of $2,500, and the company will release on-demand virtual classes later this year.\nAnd as gyms and boutique fitness studios continue to close, fitness instructors are getting creative and amping up their side hustles.\n\"I've still been training clients that live in my building, though we've been using Lysol and in some cases latex gloves to be safe,\" Julie Verhage, a group fitness instructor at Equinox, said. Verhage also said that startups are reaching out to her and asking her to lead virtual workouts \"so they can still have team bonding while everyone is working remotely.\"\nRead More", "url": "https://www.cnn.com/2020/04/01/business/fitness-studios-coronavirus/index.html"}