{"authors": ["Marianne Garvey"], "date_download": "2020-05-04 16:27:18", "date_modify": "2020-05-04 16:27:18", "date_publish": "2020-04-07 15:55:36", "description": "The jokes are still out there just waiting to be heard.", "filename": "2020_04_07_entertainment_comedians-coronavirus_index_1588609638.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407154054-mike-berbiglia-grab-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_entertainment_comedians-coronavirus_index_1588609638.html", "title": "Comedians find new ways to their audience amid the coronavirus outbreak", "title_page": "Comedians find new ways to their audience amid the coronavirus outbreak - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The jokes are still out there just waiting to be heard.\nBecause of the coronavirus pandemic, the biggest names in comedy united on April 4 to livestream material and raise money for newer comics whose gigs are now gone\nMarc Maron, Ray Romano, Whitney Cummings, Adam Sandler, Nikki Glaser and Patton Oswalt were just a few who offered up some humor and worked out ideas on \"Comedy Gives Back COVID-19 Emergency Relief Fund, \" which was available to stream on social media and Comedy Central's YouTube channel for those of us at home.\nComedian Maria Bamford is using Zoom to her advantage, performing new material for fans every afternoon. Admission for the first 100 people is a $5 donation to your local food bank or a $1 Venmo to Bamford herself.\nMike Birbiglia has been going live on Instagram for a series he's calling #tipyourwaitstaff , designed to raise money for the staff of now-shuttered comedy clubs.\nUntil just a few weeks ago Birbiglia was on tour, excited to be working out material for a new one-hour special he was set to film. Much of his jokes were on the topic of death. Now, he's home, sheltering in place with his wife and 5-year-old daughter, and he's not sure many of those same live-in-person jokes work anymore.\nLike Birbiglia, many comics are evolving their material and finding new ways to perform.\n\"In some ways, comedy is like one of the most timely art forms,\" Birbiglia tells CNN. \"It's very much about what's happening in the room at the moment. And death today is different than talking about death six weeks ago. You know, you can do it, but there's some degree of sensitivity you have to have that acknowledges the tragedy that's happening.\"\nWhile staying home, Birbiglia has been chatting with fellow comics on his series, with the goal of raising funds for staffers at comedy clubs who are suddenly out of work. It's in those conversations, he says, where he's finding little gems that may eventually spark bigger jokes when he can perform on an actual stage again.\n\"The first one, the other day, that started to feel like a joke was I was talking to [comic] Chris Gethard and I go, 'How are you?' And I just joked, 'It's funny, like, how are you means something completely different than it did like a month ago. It's so weird. How are you used to mean, Hey, I'm not interested in you at all, how are you? And now it's like, how are you, is everyone alive?\"\nWe will come out of this with comedy clubs ready to open again, Birbiglia hopes.\n\"We want these clubs to survive, we want these clubs to live,\" he says.\nLos Angeles-based comic Sarah Colonna still loves to tour, even though she's also a bestselling author of books like, \"Has Anyone Seen My Pants?\"\nColonna says that it's during \"stressful, sad or strange times that people are used to being able to turn to comedians and live entertainment\" as an escape, and she and her fellow comedians are feeling the impact of not being able to take the stage. She's using Instagram Stories to try and connect with her fans.\n\"Most comedians I know are struggling with the fact we don't have that outlet anymore, along with what so many others here -- and all over the world -- are dealing with right now, the impact of not being able to work,\" she says. \"When you're panicking about your future every 10 minutes, it can be hard to write a joke.\"\nWhen the coronavirus pandemic eventually fades, Colonna hopes her mind is still joke-smart.\n\"For now, I am writing down any and everything I think of that I believe can be worked into material on stage,\" she says. \"The issue becomes that people are struggling, people are dying, people are hurting, so how the hell do we find laughter, or things to write about, in times like this?\"\nStill, she's trying.\n\"The answer to writing humor right now has been the things that I believe everyone will be able to relate to when we come out the other side. Strange daily activities people have taken up. The things that should be 'no big deal,' but fully annoy you about someone you love simply because you're locked up with them all the time. The odd food you're panic buying or combining in your pantry because you haven't been to the store. The mishaps on Zoom meetings,\" Colonna says. \"There are so many topics in all of this that we can find humor in, that aren't sad. I try to look for those daily.\"\nShe ultimately hopes to share her material on stage when the venues are open again.\n\"It'll be challenging, since as comedians we are used to working out material on stage before we do a larger show, and now it'll be more raw,\" she says, adding, \"But maybe that'll be part of the fun.\"\nComic after comic is finding creative ways to tell their jokes.\nNew York-based comedian Sam Morril sits inside his apartment, trying out his new material on his mom. He holds a microphone and treats each one like a mini set, calling it \"Bombing Jokes For My Mom.\"\nSometimes mom gets the jokes, sometimes she doesn't.\nComedian Mark Normand took a stool to the actual streets, sitting on it to do short sets around Manhattan, while staying the recommended 6 feet away from his \"audience.\"\n\"The day after the clubs closed, I still needed that live response,\" he wrote on Instagram.\nAmy Schumer is also working out material over social media, things that can lead to quarantine bits like having to shave her husband's neck ( that's on video ) or joking about his back hair.\nOthers aren't really feeling like delivering the perfect joke right now.\nComedian Jim Gaffigan, isolating at home in Manhattan with his wife and five kids, says he's been using his children for feedback, but says ultimately, \"I don't see this as a creative time period. I see this as kind of a crash course in family bonding.\"\n\" allowfullscreen>\nHe's turning that exercise into an ongoing show called \"Dinner with the Gaffigans,\" where viewers get a glimpse at their dinner table conversations every night.\nIn the age of coronavirus, we're all trying to find a little humor at home.", "url": "https://www.cnn.com/2020/04/07/entertainment/comedians-coronavirus/index.html"}