{"authors": ["Keith Ridler"], "date_download": "2020-05-04 20:03:56", "date_modify": "2020-05-04 20:03:56", "date_publish": "2020-04-08 15:14:36", "description": "BOISE, Idaho (AP) — Idaho Gov. Brad Little has ordered the creation of a committee to oversee the state's $1.25 billion share of the $2.2 trillion coronavirus economic rescue package approved by...", "filename": "_54940add1d925b4cba6b5aa39a30b406_1588622636.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9ee1a74f3c1a481daf1019e9e63c5bdd/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_54940add1d925b4cba6b5aa39a30b406_1588622636.html", "title": "Idaho panel to oversee $1.25 billion virus rescue package", "title_page": "Idaho panel to oversee $1.25 billion virus rescue package ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Small business owner, Liyah Babayan tapes up a sign while getting set up to donate masks to those that need them Monday, April 6, 2020, on Main Avenue in Twin Falls, Idaho. Babayan and her family spent three days making around 200 masks to give out to the community, though donations are encouraged so they can continue to make masks. (Drew Nash/Times-News via AP)\nSmall business owner, Liyah Babayan tapes up a sign while getting set up to donate masks to those that need them Monday, April 6, 2020, on Main Avenue in Twin Falls, Idaho. Babayan and her family spent three days making around 200 masks to give out to the community, though donations are encouraged so they can continue to make masks. (Drew Nash/Times-News via AP)\nBOISE, Idaho (AP) — Idaho Gov. Brad Little has ordered the creation of a committee to oversee the state’s $1.25 billion share of the $2.2 trillion coronavirus economic rescue package approved by Congress last month.\nLittle’s budget chief, Alex Adams, will head the 14-member committee announced late Tuesday that is responsible for using the money to support businesses, health care providers and struggling families during the pandemic.\n“I can assure Idahoans that the federal funds will not be used to create new government programs in Idaho, and we will uphold our Constitutional mandate to provide a long-term, structurally balanced budget for the people of Idaho,” Little said in a statement.\nThe governor’s office said State Controller Brandon Woolf will report where the money is spent on his agency’s website.\n“Transparency in government spending is one of my highest priorities,” Woolf said.\nThe coronavirus is mainly spread through coughs and sneezes. For most people, it causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.\nRepublican Sen. Steve Bair and Republican Rep. Rick Youngblood, co-chairmen of the Legislature’s powerful budget-setting committee, are on the committee that also includes various state agency heads and representatives.\nRepresentatives from city, county and tribal governments and from the business community are also taking part.\nIdaho has 1,210 confirmed virus cases and 15 deaths as of Wednesday morning, according to a Johns Hopkins University.", "url": "https://apnews.com/54940add1d925b4cba6b5aa39a30b406"}