{"authors": ["Veronica Stracqualursi"], "date_download": "2020-05-04 17:03:37", "date_modify": "2020-05-04 17:03:37", "date_publish": "2020-04-10 21:19:38", "description": "Democratic Virginia Gov. Ralph Northam on Friday signed five gun measures into law, including a background checks bill and an \"extreme risk protective order.\"", "filename": "2020_04_10_politics_ralph-northam-signs-gun-bills_index_1588611817.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190601170122-01-governor-northam-0531-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_ralph-northam-signs-gun-bills_index_1588611817.html", "title": "Virginia governor signs background checks, 'red flag' and other gun control bills into law", "title_page": "Ralph Northam: Virginia governor signs background checks, 'red flag' and other gun control bills into law - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "The slate of bills prompted a large gun-rights rally in January , with about 22,000 gathering in protest at Virginia's state capitol. The legislation has also fueled a pro-gun movement across the state known as \" Second Amendment sanctuaries ,\" or localities that vow not to enforce what some officials in those regions have called \"unconstitutional\" gun laws.\nThe gun measures had been a priority for Northam since he first introduced them in the 2019 legislative session -- and he made them an even more urgent priority in the wake of mass shooting at a Virginia Beach municipal building last year that left 12 people dead.\nNortham called for a special session at that time to debate gun control, but it was adjourned by Republican lawmakers without action after just 90 minutes.\nNortham reintroduced the legislative package in January, when his party began its control of both chambers of the Virginia General Assembly.\nThe governor also signed a bill requiring background checks for all state gun sales and a bill that limits the purchase of handguns to one a month.\nHe also signed a bill that requires a person to report the loss or theft of a firearm within 48 hours, or face a civil penalty of up to $250 and one that raises the punishment for leaving a \"loaded, unsecured firearm\" that endangers anyone under the age of 14.\n\"We lose too many Virginians to gun violence, and it is past time we took bold, meaningful action to make our communities safer,\" Northam said in a statement Friday. \"I was proud to work with legislators and advocates on these measures, and I am proud to sign them into law. These commonsense laws will save lives.\"\nPhilip Van Cleave, the president of Virginia Citizens Defense League, told CNN via email that the pro-gun rights group \"has been readying lawsuits for weeks to overturn some of the new gun-control laws in the courts.\"\nHe credited Virginia gun owners to the defeat of some of the \"worst\" gun legislation.\n\"Most of the gun-control bills that made it to the governor's desk had been scaled back. Those bills are still bad, but not as bad as they once were,\" he wrote, adding that \"the laws signed today can be repealed in future legislatures.\"\nNot all of the bills the governor supported made it to his desk this year. An assault weapons ban died in a Senate committee in February. Northam has promised to revisit the issue next year.\nThe governor also sent two bills back to the legislature to be amended. For a bill that allows localities to regulate firearms in public places, Northam proposed an exemption for higher education institutions.\nThe other bill requires individuals under protective orders to turn over their firearms within 24 hours and prove that they've done so. Northam recommended allowing judges to hold individuals in contempt of court if they don't comply.\nState lawmakers will consider those changes on April 22, however, due to coronavirus concerns and the social distancing guidelines, they reportedly won't be convening at the state capitol building.", "url": "https://www.cnn.com/2020/04/10/politics/ralph-northam-signs-gun-bills/index.html"}