{"authors": ["Brynn Gingras"], "date_download": "2020-05-04 17:03:26", "date_modify": "2020-05-04 17:03:26", "date_publish": "2020-04-10 22:15:12", "description": "As coronavirus ravages the city, New York Police Department detectives are responding to a significant rise in calls to homes where a death is reported, an increase one detective called \"overwhelming.\"", "filename": "2020_04_10_us_nypd-doa-calls-coronavirus_index_1588611806.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200222074635-01-nypd-badge-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_nypd-doa-calls-coronavirus_index_1588611806.html", "title": "The rising number of deaths at homes have NYPD detectives fighting an 'invisible bullet'", "title_page": "The rising number of deaths at homes have NYPD detectives fighting an 'invisible bullet' - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As coronavirus ravages the city, New York Police Department detectives are responding to a significant rise in calls to homes where a death is reported, an increase one detective called \"overwhelming.\"\nDetectives are often the first to go inside homes where a death is reported. Lately, most of the calls involved a person who died from a Covid-19 infection.\n\"Any death, detectives have to respond and make sure it's of natural causes and conduct an investigation,\" says NYPD Detective Endowment Association President Paul DiGiacomo, who estimates his members are seeing triple the amount of dead on arrival (DOA) calls they normally have.\nComforting families while wearing full protective gear\nAn NYPD detective in Queens who's been with the department for about 15 years estimated he would have three to four DOA calls a month. Over the last month, he's had 17.\nIt \"is completely overwhelming to have this many in this short of time,\" the detective said\nFor a call where coronavirus is suspected, detectives must dress in protective coveralls and wear a mask, gloves, face shield and booties covering their shoes. They enter the home, examine the body, take pictures and interview family members before calling the medical examiner's office.\nThe detective, who spoke to CNN on condition of anonymity, says normally when police respond to a home with a deceased body, one or two family members usually take charge and answer detectives' questions. With everyone at home, each case brings more emotion because there are more people.\n\"Now, I am a pair of eyeballs and a mask trying to do my job,\" he said. \"Imagine someone in a complete plastic suit trying to comfort you.\"\nIn many cases, patrol officers must stay outside the house waiting hours for either a funeral home or the medical examiner's office to remove the body, according to DiGiacomo.\nOfficers risk their lives\nDiGiacomo described the job as abnormally stressful for his members because of the risk they're taking with their lives as well as the fear that officers could bring the virus home to their family.\n\"This is 10 times harder because of the invisible bullet. You don't know where its coming from. You are in harm's way and so is your family,\" DiGiacomo said.\nTwo detectives have died due to coronavirus, the latest being Detective Jack Polimeni of the Manhattan Warrant Squad, who died on Friday. DiGiacomo said two other detectives are in \"very critical condition\" at New York City hospitals.\nSo far, a total of 19 members of the NYPD have died due to coronavirus.\nAccording to the union, 800 NYPD detectives are out sick with 200 testing positive for Covid-19.\nThe DEA mourns the loss of Detective Jack Polimeni -- another hero in blue taken too soon by #COVID19. A 23-year veteran, Jack exemplified what it means to be one of \"The Greatest Detectives in the World.\" Our prayers are with his wife and family, who we will forever support. pic.twitter.com/gRJY4NIRW6 — Detectives' Endowment Association (@NYCPDDEA) April 10, 2020\nMembers who have lost loved ones call the union \"daily,\" DiGiacomo said.\nThe Queens detective said he takes a deep breath and double checks his gear before responding to every home, but every day \"is scary.\"\n\"I know I am going to get it. It's completely, utterly unavoidable. I just don't know where I am going to get it from -- a house I go into, am I going to get it from the guy next to me? But we have no choice, this is what we do.\"\nLike other first responders, the detective said he and fellow officers fear that they will bring the virus home to their families.\nThe detective said he has coworkers who are looking to rent recreational vehicles, so they don't have to go home to their families and knows others who stay in hotels. He said he sent his 2-year-old twins to his parents' home since the pandemic started and only communicates with them through FaceTime.\nSeparately, DiGiacomo said Detective Joe Bonner, on patrol in Midtown Manhattan South, has been staying in an Airbnb for the last few weeks because his wife was diagnosed with cancer.\nDiGiacomo said Bonner goes to work, then returns to his Staten Island home every night to wave hello to his two daughters and wife from his yard. His wife leaves food on the house doorstep and Bonner leaves for his temporary home each night.", "url": "https://www.cnn.com/2020/04/10/us/nypd-doa-calls-coronavirus/index.html"}