{"authors": ["Reporter"], "date_download": "2020-05-04 21:09:39", "date_modify": "2020-05-04 21:09:39", "date_publish": "2020-05-01 03:46:08", "description": "Gretchen Whitmer's orders extending coronavirus restrictions 28 more days come as conservatives in the state demand she reopen businesses.", "filename": "entry_michigan-governor-new-emergency-disaster-declarations-legislature-refuses-extend-coronavirus_n_5eab8dbfc5b65156135b1756_1588626579.html", "image_url": "https://img.huffingtonpost.com/asset/5eab9222250000b711eb0ab7.jpeg?cache=vmaeyiigp8&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_michigan-governor-new-emergency-disaster-declarations-legislature-refuses-extend-coronavirus_n_5eab8dbfc5b65156135b1756_1588626579.html", "title": "Michigan Governor Issues New Emergency Orders After Legislature Refuses Extensions", "title_page": "Michigan Governor Issues New Emergency Orders After Legislature Refuses Extensions | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Michigan Gov. Gretchen Whitmer issued new emergency and disaster declarations on Thursday after the state’s Republican-controlled Legislature refused to extend the existing ones set to expire at midnight.\nThe Democratic governor signed three new executive orders extending the state’s restrictions meant to slow the spread of COVID-19, the disease caused by the novel coronavirus. Under the orders, Whitmer stated that an emergency still exists under one law and declared a new 28-day state of emergency under another law.\n“COVID-19 is an enemy that has taken the lives of more Michiganders than we lost during the Vietnam War,” Whitmer said in a statement. “While some members of the legislature might believe this crisis is over, common sense and all of the scientific data tells us we’re not out of the woods yet.\n“By refusing to extend the emergency and disaster declaration, Republican lawmakers are putting their heads in the sand and putting more lives and livelihoods at risk,” she added. “I’m not going to let that happen.”\nThe orders come amid protests within the state to reopen the economy. Earlier this month, an estimated 4,000 protesters drove their cars to Lansing, the state capital, to demand that Whitmer ease Michigan’s coronavirus restrictions.\nOn Thursday, hundreds of anti-lockdown demonstrators arrived at the state Capitol to protest Whitmer’s plan to extend Michigan’s state of emergency. Many who attended were not wearing masks or social distancing, and at one point a group of men armed with rifles stormed the building (It is legal to openly carry guns in the statehouse). Whitmer was not in the building during Thursday’s protest.\nPAUL SANCYA/ASSOCIATED PRESS Hundreds of anti-lockdown demonstrators arrived Thursday at Michigan's Capitol in Lansing to protest Gov. Gretchen Whitmer’s plan to extend a state of emergency. Many who attended were not wearing masks or social distancing. At one point, a group of armed men stormed the Capitol.\nThat same day, the Republican-led state House and Senate voted along party lines for a bill that would temporarily codify many of her directives but not her stay-at-home order. The Michigan Legislature also voted to authorize a lawsuit challenging Whitmer’s authority and actions to combat the outbreak, according to The Associated Press.\nWhitmer has already been sued for her coronavirus restrictions. Business owner Steven Martinko and four other Michigan residents filed a lawsuit demanding businesses reopen, arguing that Whitmer’s orders infringe on their constitutional rights. A Michigan judge disagreed with the plaintiffs, saying that the difficulties of living under restrictive orders are temporary, “while to those who contract the virus and cannot recover … it is all too permanent.”\nWhitmer said Thursday that the GOP bill passed on Thursday “does not comply with constitutional requirements,” according to a news release from her office.\n“Moreover, the governor will not sign any bills that constrain her ability to protect the people of Michigan from this deadly virus in a timely manner,” the release stated. “The governor intends to veto this bill when presented to her.”\nMore than 41,000 Michigan residents have been infected with the coronavirus and nearly 3,800 have died, many in the Detroit area, according to Whitmer.\nAccording to a recent HuffPost/YouGov poll, an overwhelming majority of Americans on both sides of the political aisle support stay-at-home directives as the pandemic’s toll climbs.", "url": "https://www.huffpost.com/entry/michigan-governor-new-emergency-disaster-declarations-legislature-refuses-extend-coronavirus_n_5eab8dbfc5b65156135b1756"}