{"authors": ["Analysis Harry Enten"], "date_download": "2020-05-04 16:20:12", "date_modify": "2020-05-04 16:20:12", "date_publish": "2020-04-05 12:30:43", "description": "Poll of the week: A new AP-NORC poll finds that President Donald Trump's approval rating stands at 44%, while disapproval rating comes in at 56% among registered voters.", "filename": "2020_04_05_politics_trump-approval-poll-of-the-week_index_1588609212.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402181407-trump-coronavirus-test-briefing-04022020-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_trump-approval-poll-of-the-week_index_1588609212.html", "title": "Trump's popularity bump may have already plateaued ahead of schedule", "title_page": "Trump's popularity bump may have already plateaued ahead of schedule - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Poll of the week: A new AP-NORC poll finds that President Donald Trump's approval rating stands at 44%, while disapproval rating comes in at 56% among registered voters.\nThat's nearly the same as it was in February's AP-NORC poll , when Trump's approval rating was 43% and disapproval rating was 56%.\nTrump clearly experienced a bump in his popularity (i.e. a rally around the flag effect) thanks to his response to the coronavirus pandemic. We saw that in numerous polls such as the ABC News/Washington Post poll and the Monmouth University poll that came out in the latter part of March.\nThe latest data, however, suggests that Trump's rise may have stopped, which isn't shocking based on the history of rally around the flag events.\nIt's not just the AP-NORC poll that indicates this. You see it in the ABC News/Ipsos poll , which shows that approval of Trump's handling to the coronavirus is down 8 points over the last two weeks.\nIndeed, the average of all the polling is pretty stable over the last week. The good news for Trump is that he's clearly in a better position now than he was a month ago, but his net approval (approve - disapprove) is still around -5 points with voters across all polling.\nIf it is, in fact, the case that Trump's bump has hit a wall, it would have occurred a little bit before I might have expected. I went back and examined eight different rally around the flag events from six presidents since the beginning of World War II.\nThe median event saw the president's bounce peak a little bit more than a month after his approval rating began to rise. Trump's would have peaked only about two weeks into it.\nThere is precedent for a bounce plateauing so quickly. After Osama Bin Laden was killed, Barack Obama's bounce began to recede after two weeks. That event, like the current pandemic, is taking place in a modern media environment with its 24/7 news cycle.\nStill, you might have expected Trump's popularity to continue to rise because this is an ongoing situation. It took nearly three months for Jimmy Carter's approval to peak during the Iranian hostage crisis back in 1979 and 1980.\nBut perhaps the bigger question for Trump isn't whether or not his approval bounce has peaked, but how long he can hold onto any of his bounce.\nHistory provides for a slew of potential pathways.\nIt took a little more than 200 days for the median rally around the flag bounce to completely abate, which we would be about a month before the 2020 election.\nNow, some like George W. Bush after 9/11 saw lasting effects of their bounce for even longer. Bush's bump went on for two years after it started. He, though, had the largest rally round the flag bump in polling history to begin with, so it makes sense that it took a long time for it to completely disappear.\nOther bounces like Obama's and Carter's completely reversed themselves in fewer days than we have until the 2020 election. Given that those might be the best parallels for Trump's (one occurring in the modern era and one occurring during a prolonged event with an economy in trouble ), those are not particularly encouraging analogs for Trump.\nBut at the end of the day, history is just a guide. There's no perfect analogy to what's currently occurring in this country. We'll just have to wait and see.", "url": "https://www.cnn.com/2020/04/05/politics/trump-approval-poll-of-the-week/index.html"}