{"authors": ["Fernando Alfonso Iii"], "date_download": "2020-05-04 16:20:43", "date_modify": "2020-05-04 16:20:43", "date_publish": "2020-04-05 06:01:32", "description": "People around the world are revisiting old hobbies during this health crisis due to spending more time at home and as a way to cope with coronavirus anxiety.", "filename": "2020_04_05_world_old-hobbie_a197b2c1bd55178c2cb3420276b83f87_index_1588609243.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403180630-hobbies-quarantine-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_world_old-hobbie_a197b2c1bd55178c2cb3420276b83f87_index_1588609243.html", "title": "Pandemic 2020: The long lost hobbies people are the world are revisiting", "title_page": "Pandemic 2020: The long lost hobbies people are the world are revisiting  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) When Larry Ginsberg began working from his New Jersey home last week due to the coronavirus pandemic, he never expected a faint smell of smoke and the sound of a roaring locomotive to emanate from his basement.\nThe sound and smell were from a beloved model train set passed down through generations that Ginsberg's son had found and erected for the first time in a decade.\nThis train set belongs to one of the forgotten hobbies people around the world have revisited during this health crisis, thanks to self-quarantine orders confining millions at home . For people like Ginsberg, these hobbies have been a respite from the grim reality of the coronavirus and a reminder of life before the outbreak.\n\"In that moment, despite all the uncertainty and fear about Covid-19 and the world, I smiled as the best moments of my childhood with my grandfather and memories of wonderful times with my son flowed back to me,\" Ginsberg told CNN in an email. \"It was calming and wonderful. Somehow, something that was so special to me was there and I shared a wonderful 15 minutes with my son reminiscing and enjoying this simple pleasure. It was warm and nostalgic.\"\nSports like soccer are many of the old hobbies people are revisiting during the pandemic. That includes Brittany Boen in Arizona.\nGinsberg joins other home-bound Americans like Trevor Dieterle, in Monterey Peninsula, California, who has picked up origami, and Brittany Boen, of Phoenix, Arizona, who has started juggling soccer balls on her knees, a hobby she developed when she was 4.\nDieterle is not home by choice, though. As a personal trainer and yoga instructor, Dieterle is effectively unemployed after his studio shut down, he told CNN in an email.\nThis is just one of the many pieces of orginami Trevor Dieterle has made since picking up his old hobby.\nIn the last couple weeks, the coronavirus outbreak has forced many businesses to suddenly shutter as the US tries to slow the pandemic from infecting every sector of society. For many businesses, that has meant laying off or furloughing workers, at least temporarily. Jobless claims soared to a seasonally adjusted 3.28 million in the week ending March 21 , according to the Department of Labor.\n\"Definitely an overabundance of free time on my hands which has led me to revisit some old hobbies,\" Dieterle told CNN. \"It's been pretty nostalgic. I found a stash of authentic Japanese origami paper that I had apparently been saving. Also dredged up some good memories that I had forgotten about. It's really the perfect distraction, engages your mind and your hands.\"\nWhile the US continues to come to grips with the pandemic, millions more around the world have already adapted to life under the shadow of coronavirus.\nHobbyists around the world unite under adversity\nJoëlle Hol is a retail marketing manager who has used her free time to find a silver lining during the pandemic.\nHol, of the Netherlands, started sewing purses and pillowcases when she was around 12 years old. That passion for sewing lasted through college until a health issue forced her to quit during her second year, she told CNN via email. With her marketing job now on hold due to the coronavirus, she says this is her chance to revisit her old hobby.\n\"I was never in the right head space to start a new sewing project, too much to do, life responsibilities and too much chaos in my mind but now that my country is on lockdown, and there are no job responsibilities calling me, I decided to start a new sewing project,\" Hol said. \"Once I start on something, I get totally consumed by it and lose all sense of time, and while that's usually a problem, in this situation it's quite the opposite. I can devote all my time and energy into this hobby and once the lockdown is over I will probably have a whole new wardrobe and a whole new motivation to continue with this hobby.\"\nSince quarantine is extended i decided to pick up an old hobby so now im working on a pattern for a cute summerdress on my bedroom floor pic.twitter.com/aHlhb9bTSo — Joelle 💕 (@soft4actresses) March 24, 2020\nMore than 3,100 miles away in the United Arab Emirates, Shadi Kandil has used the newly-found time at home to enjoy his family and to pick up the love for drawing he abandoned seven years ago.\n\"I got away from drawing and writing because of life,\" Kandil told CNN via Twitter. \"I have family and two kids, too many work and life and family responsibilities, not enough time anymore for hobbies.\"\nOne person who has had a figurative front seat to the rising wave of people revisiting old hobbies around the globe is Christian Braun, CEO of the Colorado-based company hobbyDB , which he said celebrated its 6th anniversary on March 30.\nWith more than 750,000 registered users and 6,000 volunteers, hobbyDB has grown in popularity among people who want to discuss drawings, corkscrews and every odd hobby in between\n\"Many of our community members have told us our database is a rock for them, providing a little oasis where they can come to forget about viruses and job worries for awhile and indulge themselves in reading up on and enjoying the toys and collectibles they're most passionate about,\" Braun said. \"When people are often feeling alone at this time, we try to bring some fun into their day.\"\nThe therapeutic benefits of hobbies\nAliza Sherman Risdahl is a writer and entrepreneur who has also had her life turned upside down by coronavirus.\nRisdahl and her two teenage children are currently staying with in-laws in Washington state while her husband is home in Alaska with their toddler. The distance has added to the stress of self-quarantining, Risdahl told CNN via email.\n\"The pandemic has forced me to be more isolated than ever before but also to rely on my extended family, and it's given me a chance to get to know them better. It has stripped me of most of my income,\" Risdahl said. \"It has compounded the stress our family has been under due to a series of health scares over the last year and the resulting crippling expenses, but it also has reminded us of what is truly important: family and loved ones.\"\nOne of the ways Risdahl is coping with the stress is through doodling. This childhood activity has been incredibly therapeutic, she said.\nReturning to my much neglected hobby of pen doodling. I don't yet feel confident enough to call it art. Oh what the heck. My ART hobby for coping with self-quarantining. #COVID19 #coronavirus #quarantinelife #hobbies pic.twitter.com/9OV6RseVc7 — alizasherman (@alizasherman) March 27, 2020\n\"Returning to my doodling and drawing is grounding during such chaotic, unpredictable and stressful times,\" Risdahl said.\nHobbies and self-care are crucial during the coronavirus pandemic, clinical psychologist Dr. Jeff Gardere told CNN. The last time the world has had to collectively face something as tragic and all consuming was WWII, Gardere said.\n\"In this time of uncertainty and instability, and a world and existence we no longer recognize, people need an anchor to familiarity and what once brought them comfort, stability, safety, and happiness,\" Gardere said in an email to CNN. \"The psychological shock of this unprecedented, accelerated, dizzying and dangerous time has us grasping for our old lives and customs, which we enjoyed only a few short weeks or months ago.\"", "url": "https://www.cnn.com/2020/04/05/world/old-hobbies-quarantine-coronavirus-wellness-trnd/index.html"}