{"authors": ["Tara Subramaniam", "Daniel Dale", "Lauren Fox", "Priscilla Alvarez", "Holmes Lybrand"], "date_download": "2020-05-04 16:26:15", "date_modify": "2020-05-04 16:26:15", "date_publish": "2020-04-07 01:37:28", "description": "President Donald Trump made yet another series of false and misleading claims at his Monday coronavirus briefing, during which he repeatedly criticized reporters and frequently departed from his prepared text.", "filename": "2020_04_06_politics_fact-ch_9e0047273f5b1498a09cbbd6d8de35e4_index_1588609575.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406175011-01-coronavirus-briefing-0406-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_fact-ch_9e0047273f5b1498a09cbbd6d8de35e4_index_1588609575.html", "title": "Fact Check: Trump disputes HHS IG report, repeats several other false claims at Monday's coronavirus briefing", "title_page": "Fact Check: Trump disputes HHS IG report, repeats several other false claims at Monday's coronavirus briefing  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump made yet another series of false and misleading claims at his Monday coronavirus briefing, during which he repeatedly criticized reporters and frequently departed from his prepared text.\nTrump repeated false claims about coronavirus testing and about the Obama administration's response to the H1N1 pandemic, baselessly dismissed a new report about hospital shortages of critical supplies, and played down early problems with a new small business lending program. He also repeated some of his old false claims about trade with China.\nFact checking Trump's claims on the HHS IG report\nAt Monday's briefing, Fox News correspondent Kristin Fisher asked the President about a recently released report from the Department of Health and Human Services' Office of Inspector General which details challenges facing hospitals in responding to the coronavirus pandemic, including shortages of supplies and equipment, as well as prolonged wait times to get testing results.\nIn response, Trump said, \"It's just wrong. Did I hear the word 'inspector general,' really? It's wrong.\"\nWhen pushed on the fact that the report was released by his own administration, Trump suggested the findings were politically motivated, asking, \"Well where did he come from, the inspector general? What's his name?\" Trump later added, \"So give me the name of the inspector general. Could politics be entered into that?\"\nFacts First: There's no evidence to suggest anything about the report is wrong, or that it was somehow politically motivated. The There's no evidence to suggest anything about the report is wrong, or that it was somehow politically motivated. The report was independently launched by the HHS OIG and based on interviews conducted between March 23 and 27 with administrators at more than 300 hospitals across 46 states, Puerto Rico and Washington, DC. The report found hospitals faced testing shortages and longer than usual wait times for coronavirus test results.\nThe report's findings of shortages at key hospitals also corroborated previous press reports from hospitals in New York and elsewhere, which are facing severe shortages of vital medical equipment. According to the HHS report, its purpose is to provide a snapshot of hospitals' experiences amid a growing number of coronavirus cases and doesn't serve as a review of the department's response to the outbreak.\nThe senior HHS OIG officials who oversaw this watchdog report are both women: Ann Maxwell, the assistant inspector general for evaluation and inspections, and Christi Grimm, the principal deputy inspector general. Grimm, whose name is on the report, is a career official who entered her current role in January but has been with HHS since 1999 , serving under both Republican and Democratic administrations.\nCoronavirus tests\nOn Monday, Trump claimed , as he did last week, that his administration had initially been burdened by an \"obsolete\" test for the coronavirus.\n\"Initially speaking, the tests were old, obsolete, and not really prepared,\" he said Monday.\nFacts First: The faulty initial test for the coronavirus was created during Trump's administration, in early 2020, by the Centers for Disease Control and Prevention. The faulty initial test for the coronavirus was created during Trump's administration, in early 2020, by the Centers for Disease Control and Prevention. Since this is a new virus that was first identified this year, the tests couldn't possibly be \"old\" or \"obsolete.\"\n\"He is lying. He is lying 100%. He is lying because he is trying to shift blame to others, even if the attempt is totally nonsensical,\" Gregg Gonsalves, an assistant professor in the Department of Epidemiology of Microbial Diseases at the Yale School of Public Health, said of a previous version of Trump's claim.\nThe claim \"doesn't make sense because it is false,\" Tara Smith, an epidemiology professor at Kent State University, said of a previous version of the claim. \"This a new virus.\"\nSticking to past practice, the CDC created its own test for the coronavirus rather than use the test being distributed by the World Health Organization. The CDC began developing its test in January 2020 and announced on February 5 that it would begin shipping test kits to public health labs around the US.\nSoon after that, there were reports that some of the test kits were not working properly. The CDC admitted the problem on February 12. It announced February 28 that it had manufactured brand new, functional test kits that addressed the problem , which had been caused by a flaw in one of the three components of the original test.\nTrump on performance of the small business lending program\nDuring Monday's White House coronavirus task force briefing, Trump claimed that the Paycheck Protection Program -- a small businesses lending program -- has \"really been performing well.\"\nTrump said there were a few \"minor glitches that have already been taken care of.\"\nFacts First: CNN has reported significant issues to the Paycheck Protection Program (PPP), with system wide failures as lenders process these loans.\nDays after the launch of the Small Business Administration's rollout of the PPP, there are still delays in the system lenders use to upload loan application information and the money is still largely not going out to the businesses that need it yet.\nAccording to an industry source who spoke to CNN, major system-wide failures continue to crop up in the PPP system, including shutdowns preventing the submission of applications from lenders on their system known as E-Tran. These issues have slowed down the ability for banks to participate in the loan program, this source tells CNN.\nAdditionally, several bank executives tell CNN they want the Treasury Department or the Small Business Administration to offer more guidance on how they are supposed to disburse funds. CNN reporting indicates there are also concerns among lenders who say they won't cut checks until there is clear guidance on how they should distribute the money.\nTo read more about the early glitches in the small business lending program, read here and here\nJUST WATCHED CNN reporter debunks Trump's claim about virus Replay More Videos ... MUST WATCH CNN reporter debunks Trump's claim about virus 01:18\nPlane passengers being tested for the coronavirus\nAsked about the possibility of restrictions on travel between coronavirus hotspots, Trump said: \"There's also testing done when people get onto those planes and also when people get off the planes.\"\nFacts First: There is no evidence that plane passengers in the US are being tested for the coronavirus at all, let alone both when they get on and get off the plane. While it is theoretically possible this is happening under the radar at a particular airport, it is certainly not happening widely.\nTrump might have meant to refer to screening -- which involves questioning and sometimes temperature checks -- rather than actual testing, but major US airlines are not doing screening, either. Some plane passengers are being subjected to government screening upon landing, but most passengers are not -- and this screening, unlike testing, cannot conclusively determine whether someone has the virus.\nTo read a full fact check, read here\nThe Obama administration and H1N1\nTrump slammed the Obama administration for its handling of the H1N1 (swine flu) pandemic in 2009.\n\"The other administration, they didn't even know -- it was like they didn't even know it was here,\" he said.\nFacts First: It's not true that the Obama administration did not notice H1N1 or take significant action to fight the pandemic.\nOn April 26, 2009, less than two weeks after the first US cases of H1N1 were confirmed, the Obama administration declared a public health emergency. Two days later, the Obama administration made an initial $1.5 billion funding request to Congress. (Congress ultimately allocated $7.7 billion.) On that same day, the Food and Drug Administration approved the CDC's test; the CDC began distributing the tests domestically and internationally on May 1, 2009.\nIn October 2009, President Barack Obama declared a national emergency to allow hospitals more flexibility for a possible flood of H1N1 patients.\nThe Obama administration did face criticism over the pace of its vaccination effort, but the suggestion that the administration seemed not to notice H1N1 is unfounded.\nTrump also said Monday that \"17,000 people\" died in the H1N1 pandemic. The CDC estimates that 12,469 people were killed by H1N1 between April 2009 and April 2010. Its estimate range is a minimum of 8,868 to a maximum of 18,306, so Trump's \"17,000\" figure is plausible, but it's worth noting that it's toward the high end.\nTrade with China\nTrump also spoke Monday about topics other than the coronavirus pandemic. He made three false claims in rapid succession about trade with China.\nBiggest trade deal\nTrump said, \"We just signed a trade deal, it's the biggest deal probably ever made...\"\nFacts First: \"Biggest\" is vague, but experts say Trump's \"phase one\" deal with China is \"Biggest\" is vague, but experts say Trump's \"phase one\" deal with China is not the biggest ever\nAlan Deardorff, a University of Michigan professor of international economics who focuses on trade, said it is smaller than both the Trans-Pacific Partnership and the Uruguay Round that created the World Trade Organization in terms of the volume of trade they cover. Gary Clyde Hufbauer, a nonresident senior fellow at the Peterson Institute for International Economics, said that George W. Bush granting China the status of permanent normal trade relations in 2001 was \"far bigger\" than Trump's China deal, covering a far greater number of subjects (tariffs, non-tariff barriers, investment and others).\nNever spent money\nTrump said China is now going to spend billions of dollars on US agriculture and other products, \"whereas China never spent money in our country. We spent money.\"\nFacts First: This is nonsense. Since 1995, China This is nonsense. Since 1995, China has spent at least $10 billion every year on imported US goods. Since 2011, it is more than $100 billion per year.\nTrade deficit And that spending on imports doesn't include tens of billions of dollars in foreign direct investment by China in the United States.\nTrump said, \"We had a deficit, a trade deficit, with China for years, of $500 billion, $400 billion...\"\nFacts First: There has never been a $500 billion trade deficit with China. The 2018 deficit was about $381 billion when counting trade in both goods and services; the goods and services deficit fell to about $308 billion in 2019.", "url": "https://www.cnn.com/2020/04/06/politics/fact-check-trump-coronavirus-briefing-april-6/index.html"}