{"authors": ["Tamara Lush"], "date_download": "2020-05-04 20:13:47", "date_modify": "2020-05-04 20:13:47", "date_publish": "2020-04-08 14:31:06", "description": "PALMETTO, Fla. (AP) — Mounds of harvested zucchini and yellow squash ripened and then rotted in the hot Florida sun. Juicy tomatoes were left to wither — unpicked — in farmers'...", "filename": "_53b783eab84efa228fef8a4bbcf55e7e_1588623227.html", "image_url": "https://storage.googleapis.com/afs-prod/media/03d4a1ad4f5e4a5588f18f1575fbbddc/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_53b783eab84efa228fef8a4bbcf55e7e_1588623227.html", "title": "Coronavirus claims an unexpected victim: Florida vegetables", "title_page": "Coronavirus claims an unexpected victim: Florida vegetables", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this March 28, 2020, photo, a pile of ripe squash sits in a field, in Homestead, Fla. Thousands of acres of fruits and vegetables grown in Florida are being plowed over or left to rot because farmers can't sell to restaurants, theme parks or schools nationwide that have closed because of the coronavirus. (AP Photo/Lynne Sladky)\nIn this March 28, 2020, photo, a pile of ripe squash sits in a field, in Homestead, Fla. Thousands of acres of fruits and vegetables grown in Florida are being plowed over or left to rot because farmers can't sell to restaurants, theme parks or schools nationwide that have closed because of the coronavirus. (AP Photo/Lynne Sladky)\nPALMETTO, Fla. (AP) — Mounds of harvested zucchini and yellow squash ripened and then rotted in the hot Florida sun. Juicy tomatoes were left to wither — unpicked — in farmers’ fields.\nThousands of acres of fruits and vegetables grown in Florida are being plowed over or left to rot because farmers can’t sell to restaurants, theme parks or schools nationwide that have closed because of the coronavirus .\nOther states are having the same issues — agriculture officials say leafy greens in California are being hit especially hard, and dairy farmers in Vermont and Wisconsin say they have had to dump a surplus of milk intended for restaurants.\nWith most of its harvests in the winter months, the problem is acute in Florida. For example, a few dozen people clamored to buy 25-pound (11- kilogram) boxes of Roma tomatoes direct from a packing plant over the weekend in Palmetto, a city on the western coast.\nThe cost per box? Just $5.\n“This is a catastrophe,” said tomato grower Tony DiMare, who owns farms in south Florida and the Tampa Bay area. “We haven’t even started to calculate it. It’s going to be in the millions of dollars. Losses mount every day.”\nFlorida leads the U.S. in harvesting tomatoes, green beans, cabbage and peppers this time of year. While some of the crops are meant for grocery stores, many farmers cater solely to the so-called food service market — restaurants, schools and theme parks — hit hard as cities and states have ordered people to stay home and avoid others.\nThe loss has created a domino effect through the farming industry, Florida’s second-largest economic driver. It yields $155 billion in revenue and supports about 2 million jobs.\nMany growers have donated produce to food banks, but there’s a limit on what the charities can accept and storage is an issue for perishable fruits and vegetables. DiMare said some central Florida food banks are full after theme parks shuttered and donated massive amounts of produce.\n“We gave 400,000 pounds of tomatoes to our local food banks,” DiMare said. “A million more pounds will have to be donated if we can get the food banks to take it.”\nFarmers are scrambling to sell to grocery stores, but it’s not easy. Large chains already have contracts with farmers who grow for retail — many from outside the U.S.\n“We can’t even give our product away, and we’re allowing imports to come in here,” DiMare said.\nHe said 80 percent of the tomatoes grown in Florida are meant for now-shuttered restaurants and theme parks.\nIn the past week, 20 federal lawmakers from Florida and state Agriculture Commissioner Nikki Fried sent letters urging U.S. Agriculture Secretary Sonny Perdue to include Florida farmers in federal food purchase and distribution programs so the surplus crops can help feed the hungry and food insecure. Some 37 million Americans struggled with hunger before the pandemic, according to Feeding America, a nationwide network food banks.\nThe federal coronavirus relief act contains $9.5 billion in aid to farmers.\nSome farmers have tried to branch out and sell produce boxes directly to customers, an approach taken in many places as the pandemic slams the restaurant and catering industries worldwide.\nWholesalers in London who usually sell fruit and vegetables to restaurants have pivoted to home deliveries. But large-scale farmers know selling harvest baskets won’t do much for their bottom line.\nOn the U.S. West Coast, farmers who grow lettuce and other leafy greens are feeling the pinch.\n“The tail end of the winter vegetable season in Yuma, Arizona, was devastating for farmers who rely on food service buyers,” said Cory Lunde, spokesman for Western Growers, a group representing family farmers in California, Arizona, Colorado and New Mexico. “And now, as the production shifts back to Salinas, California, there are many farmers who have crops in the ground that will be left unharvested,” particularly leafy greens.\nHe said a spike in demand for produce at the beginning of the outbreak has now subsided.\n“People are staying home and not visiting the grocery stores as often,” Lunde said. “So the dominoes are continuing to fall.”\nIn southern Florida, Paul Allen, president of R.C. Hatton Farms, took a video last week of row after row of vibrant green beans that were scheduled to be shipped to the restaurant industry.\n“You can see this is a huge field of green beans,” he said, lifting his cellphone camera to show a tractor plowing all the healthy plants and their beans into the soil.\nAllen, who farms about 12,000 acres (4,900 hectares) in Florida and Georgia, is praying that things improve by the time crops in north Florida and Georgia are ready to be harvested over the next two months.\n“You just hope you can live another day,” Allen said.\n___\nAssociated Press writer Amy Taxin contributed to this report from Orange County, California.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/53b783eab84efa228fef8a4bbcf55e7e"}