{"authors": ["Daniel Dale"], "date_download": "2020-05-04 16:17:02", "date_modify": "2020-05-04 16:17:02", "date_publish": "2020-04-03 21:00:33", "description": "The website of the Strategic National Stockpile was edited on Friday to soften language about how the stockpile is supposed to be used by states -- a day after media outlets reported that the original version contradicted a claim by senior White House official Jared Kushner.", "filename": "2020_04_03_politics_stockpile-website-edited-kushner-claim_index_1588609022.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403145419-kushner-federal-stockpile-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_stockpile-website-edited-kushner-claim_index_1588609022.html", "title": "Trump administration edits national stockpile website a day after it contradicted Jared Kushner", "title_page": "Trump administration edits national stockpile website a day after it contradicted Jared Kushner - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The website of the Strategic National Stockpile was edited on Friday to soften language about how the stockpile is supposed to be used by states -- a day after media outlets reported that the original version contradicted a claim by senior White House official Jared Kushner.\nKushner, President Donald Trump's senior adviser and son-in-law, said at Thursday's coronavirus briefing that states themselves have medical equipment stockpiled -- and argued that \"the notion of the federal stockpile was it's supposed to be our stockpile; it's not supposed to be state stockpiles that they then use.\"\nJournalists and others quickly pointed out that the federal stockpile's own website made clear Kushner was wrong.\nAs of early Friday morning, the stockpile's home page had read : \"Strategic National Stockpile is the nation's largest supply of life-saving pharmaceuticals and medical supplies for use in a public health emergency severe enough to cause local supplies to run out. When state, local, tribal, and territorial responders request federal assistance to support their response efforts, the stockpile ensures that the right medicines and supplies get to those who need them most during an emergency. Organized for scalable response to a variety of public health threats, this repository contains enough supplies to respond to multiple large-scale emergencies simultaneously.\"\nThese sentences were gone as of Friday afternoon. In their place were new sentences that emphasized that the stockpile is meant as a temporary backup for states' own supplies.\nThe revised page reads : \"The Strategic National Stockpile's role is to supplement state and local supplies during public health emergencies. Many states have products stockpiled, as well. The supplies, medicines, and devices for life-saving care contained in the stockpile can be used as a short-term stopgap buffer when the immediate supply of adequate amounts of these materials may not be immediately available.\"\nThe Department of Health and Human Services' Office of the Assistant Secretary for Preparedness and Response (ASPR), which manages the stockpile, would not comment on the record. Speaking on condition of anonymity, a spokesperson said that the edit had been in the works before Kushner's remarks.\n\"This is language we have been using in responding to inquiries for weeks now. ASPR first began working to update the website text a week ago to more clearly explain to state and local agencies and members of the public the role of the SNS,\" the spokesperson said.\nJeremy Konyndyk, who served under former President Barack Obama as director of the US Agency for International Development's Office of US Foreign Disaster Assistance, told CNN before the edit that the original home page \"could not be a more literal refutation of Jared's claim.\" He called the edit \"absolutely Orwellian.\"\nRepublican Sen. Cory Gardner of Colorado sent a letter to the inspector general of Health and Human Services on Thursday requesting an investigation into \"mismanagement being reported\" about the stockpile's supply of ventilators. Gardner told Politico that the letter was not a response to Kushner's comment, but he also questioned the comment.\n\"I don't know what Kushner was talking about, what he meant,\" Gardner said to Politico, noting that \"the stockpile is for the country,\" including states.\nStates have established procedures for requesting material from the stockpile, which is meant to be accessible to states in emergencies.\nIn August, Greg Burel, then the director of the stockpile, wrote on another government web page: \"Emergencies can overwhelm state and local medical resources even with the best preparation. To help in those situations, the SNS has evolved to become the nation's largest supply of life-saving pharmaceuticals and medical supplies for use in a public health emergency.\"\nAnd a government web page on the stockpile's history notes that, upon its founding in 1999 under its original name, the National Pharmaceutical Stockpile, \"The mission was to assemble large quantities of essential medical supplies that could be delivered to states and communities during an emergency within 12 hours of the federal decision to use the stockpile.\"\nKonyndyk said in an email that Kushner's Thursday remark \"shows a total misunderstanding of the purpose of the SNS, but more broadly shows a misunderstanding of how federal disaster response operates.\"\n\"Most federal disaster support operates on the model that states/locals lead in assessing need, defining requirements, and executing response operations. The federal level supports them in that, providing resources, coordination, expertise, logistics, etc. as required. That's FEMA's basic operating model and it's how the SNS is supposed to operate as well.\"\nThe stockpile has run low this week. The New York Times also reported this week that thousands of ventilators stockpiled by the federal government were not functional because the Trump administration had allowed a maintenance contract to lapse.\nTrump has argued that he is doing an \"unbelievable job\" helping states. But he has also pushed back against state leaders' urgent calls for supplies from the federal government, arguing that they should have themselves done a better job preparing.", "url": "https://www.cnn.com/2020/04/03/politics/stockpile-website-edited-kushner-claim/index.html"}