{"authors": ["Overnight Editor"], "date_download": "2020-05-04 20:15:35", "date_modify": "2020-05-04 20:15:35", "date_publish": "2020-04-28 03:28:21", "description": "CNN host wants to help others with COVID-19 but is a little nervous about what he has to do.", "filename": "entry_chris-cuomo-blood-donation-cornavirus_n_5ea793d4c5b6dd3f9089b7b4_1588623335.html", "image_url": "https://img.huffingtonpost.com/asset/5ea79c7d24000078008e9d53.jpeg?cache=4wcriet1cz&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_chris-cuomo-blood-donation-cornavirus_n_5ea793d4c5b6dd3f9089b7b4_1588623335.html", "title": "‘Wuss’ Chris Cuomo Says His Next Coronavirus Step Will Likely Make Him Faint", "title_page": "‘Wuss’ Chris Cuomo Says His Next Coronavirus Step Will Likely Make Him Faint | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "CNN’s Chris Cuomo is officially over his coronavirus infection ― and now he’s hoping to help others with COVID-19.\nBut he’s not exactly looking forward to the next step.\nCuomo said he was tested and found to have antibodies for the new coronavirus.\nAnd though he still has questions about how much protection he has against infection, he plans to donate some of his blood.\nThe antibody-rich blood, or convalescent plasma, is being given to people who are sick to help them fight the infection.\n“I have never given blood in my life, and we both know why,” he said to CNN’s Dr. Sanjay Gupta. “It’s because I’m a wuss.”\nAnd that, he said, could complicate the process just a little.\n“The likelihood I faint is like 110%,” he said. “If they want the blood, I’m going to give it to them, because that is the best thing I’ve heard of so far in terms of what I can do to help as someone who was sick.”\nSee more of his discussion with Gupta, including what having the antibodies means in terms of potentially preventing future infection, below:\n.@ChrisCuomo gives an update on his own recovery from coronavirus, reporting that he has two key antibodies but there remains uncertainty on whether or not the provide protection against future reinfection. pic.twitter.com/kTnA4BlCZh — Cuomo Prime Time (@CuomoPrimeTime) April 28, 2020", "url": "https://www.huffpost.com/entry/chris-cuomo-blood-donation-cornavirus_n_5ea793d4c5b6dd3f9089b7b4"}