{"authors": ["Dana Bash", "Bridget Nolan"], "date_download": "2020-05-04 16:18:39", "date_modify": "2020-05-04 16:18:39", "date_publish": "2020-04-04 12:09:58", "description": "Tampa Mayor Jane Castor is used to dealing with disasters like hurricanes that cripple her Florida city. But none have ever come close to the magnitude of destruction she is bracing for with the novel coronavirus pandemic.", "filename": "2020_04_04_politics_tampa-mayor-coronavirus-jane-castor_index_1588609119.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403191125-tampa-mayor-jane-castor-3-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_politics_tampa-mayor-coronavirus-jane-castor_index_1588609119.html", "title": "When coronavirus hit her city, this mayor didn't wait for Florida's governor to sound the alarm", "title_page": "Jane Castor: When coronavirus hit her city, this mayor didn't wait for Florida's governor to sound the alarm - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Tampa Mayor Jane Castor is used to dealing with disasters like hurricanes that cripple her Florida city. But none have ever come close to the magnitude of destruction she is bracing for with the novel coronavirus pandemic.\nWhen there's a hurricane, the rest of the country comes to their rescue. Not now. Covid-19 is like a hurricane hitting everyone, everywhere.\n\"You can't send out the call for help,\" Castor told CNN in a virtual interview from Tampa's Old City Hall.\n\"In this situation, the rest of the country is in the same position as we are, and so it's something that each and every one of us throughout the nation are going to have to address -- really on our own,\" she added.\nLike mayors across the country, Castor is on the front lines of the pandemic trying to protect residents in her city of nearly 393,000 people.\nHer approach: \"Just the facts, ma'am.\"\n\"I'm not painting a pretty picture here. I'm letting the citizens know exactly what we're facing without having complete knowledge myself. Just that we're going to get through this together, but it's going to take all of us,\" Castor said.\nLeaning on her experience -- three decades in law enforcement\nCastor said her \"just the facts\" approach comes from three decades in law enforcement -- capped as Tampa's police chief.\n\"In law enforcement, I always say you have plan A, plan B, plan C and then you have what really happens. That unexpected, you're used to dealing with that. That I think is very important. Then just for our community to give them that sense of calm, but they know when they hear me speak that I'm going to give them the real story,\" she said.\nBut she admitted that even though she has decades of training in putting her emotions aside to get things done, it is hard to do right now.\nWhat keeps her up at night, she said, is that people in her city along Florida's Gulf Coast are \"in the hospital and are dying alone.\"\n\"That really is the part that breaks my heart,\" she said.\nCastor's experience as a police officer makes her even more frustrated at the lack of readiness from the federal government.\n\"All my years in law enforcement, emergency management, I have never seen this level of unpreparedness from the federal government in the supplies of testing kits, collection kits, masks, PPE,\" she said.\n\"No one in the United States has been able to test at an adequate level. I mean, we in essence have lost that battle,\" she added with chilling yet realistic bluntness.\nShe forced a stay-at-home order in Tampa while statewide, Florida Gov. Ron DeSantis held off.\nAs the US last month was wrapping its head around the need for social distancing to fight the virus, some of the starkest images of defiance were apparent at Florida's beaches.\nDeSantis, a Republican, resisted a stay-at-home order until this week, becoming one of the last governors in the nation to do so.\nBut Castor did not wait for DeSantis.\nAlthough the Democratic mayor met steep resistance from the Emergency Policy Group charged with approving such measures, she finally convinced them to put a \"safer at home\" order into effect. That was about a week before DeSantis bowed to criticism and did the same statewide.\nWhat made her do it? She reached out to a network of mayors she is part of that spans the world, and did her homework.\n\"Everything that I saw and really in speaking with other mayors from around the United States and the literature coming out of the health field was that the one thing that was working in flattening the curve was to get people away from each other,\" she recalled, reiterating the advice of the nation's top health officials.\nConfusion after DeSantis' belated stay-at-home order\nFlorida's belated statewide order was not without controversy and confusion for Castor in Tampa. At first, the order said it would not supersede local rules. That was welcome news in the city because the statewide order had an exemption allowing people to still gather in places of worship. Then DeSantis issued another order clarifying that his order applied across the state.\n\"What the (governor's) order says is that religious services are considered essential in the state of Florida,\" Castor said.\nThat means that despite Tampa effectively closing places of worship, the governor reopened them.\n\"The order stays silent on the rules of having no more than 10 individuals at one location and a requirement to stay 6 feet apart in those locations,\" Castor told CNN.\nStill, clearly not looking for a political fight right now, Caster said they are choosing to interpret the governor's order to have those social distancing measures in place.\nShe also said churches and other religious institutions in Tampa are using common sense anyway and mostly holding services virtually.\n\"Everyone understands that this virus is passed very, very quickly through personal contact, through close contact, not even personal contact. And so I don't know that there are hopefully any individuals that would be reckless enough to bring large crowds of individuals together,\" she said.\nBlaming others now is wasted time\nCastor said that dwelling on what went wrong does her no good in her quest to help Tampa residents. Like many of her counterparts, she is working with other local leaders trying to get creative.\n\"Nobody's been through this. There's not a game plan. I mean there'll be a heck of an after action report of this, but there is no game plan right now,\" she said.\nA top Castor aide described the response as building the plane as they are flying it.\nFor example, University of South Florida Medical School is creating 3-D reproductions of swabs for more testing. \"That's a solution right there,\" she said proudly.\n\"We've put together a number of groups to help our small businesses, to help our hospitality industry, our restaurants. We have the brigades that are making the homemade masks,\" she added.\nCastor is also working hard to help the most vulnerable in Tampa's community, like the homeless.\nShe had just come from a homeless shelter put together with Catholic Charities before CNN's interview.\n\"There are just a little over a hundred individuals that are out there. It filled up in just about a day and a half, just through word of mouth,\" Castor said.\nThere are showers, a place to do laundry and mental health experts available.\n\"The aim is while individuals are there, appropriate social distance, receiving medical care, receiving food, that they'll also receive the services that they may need to get them back up on their feet and becoming productive members of our community,\" Castor said.\nAnother population that Castor worries about are Tampa's senior citizens, but she is making sure the city is there for them.\n\"Our parks and recreation personnel are calling every single person that has signed up for a service from parks and recreation, every single day. Sometimes twice a day just to check in and see what they need. We're ensuring that they have food. They have whatever they need, medication. A lot of times it's just that voice, just that conversation. We're trying to provide that for the elderly,\" she said.\nGetting creative with social media and dance parties\nCommunicating with constituents in a time of stay-at-home orders is a lot easier for mayors like Castor in the age of social media. And she and her team are taking advantage as best they can -- from PSAs with local sports figures to compelling TikTok videos that Castor hopes will reach younger residents.\n\"Let me tell you that I'm 60 years old and I have no ability in social media whatsoever,\" Castor admitted.\n\"I have two 21-year-old sons. I always tell everybody, 'My IT department went off to college,'\" she joked.\nLuckily, she said, she has a good social media team. In addition to basic information and facts, they are also reminding people to be good neighbors.\nThey are also using older media, like radio stations to organize a citywide dance party.\n\"People have been inside their homes. They've done everything that they can do. So we're just trying to keep everybody engaged,\" she said.\n\"We want kindness to be more contagious than this virus in Tampa,\" Castor added.\nStill, the Tampa mayor is bracing for what lies ahead.\n\"The month of March has been the longest year of my life.\"", "url": "https://www.cnn.com/2020/04/04/politics/tampa-mayor-coronavirus-jane-castor/index.html"}