{"authors": [], "date_download": "2020-05-04 20:09:38", "date_modify": "2020-05-04 20:09:38", "date_publish": "2020-04-09 00:10:53", "description": "DOVER, Del. (AP) — Several patients and staff members at Delaware’s state-run psychiatric hospital have been infected with the coronavirus, state officials said Wednesday. The Department of...", "filename": "_ad159cb6b44aa995aceccb9483217ba0_1588622978.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ad159cb6b44aa995aceccb9483217ba0_1588622978.html", "title": "Coronavirus cases reported at Delaware psychiatric hospital", "title_page": "Coronavirus cases reported at Delaware psychiatric hospital", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DOVER, Del. (AP) — Several patients and staff members at Delaware’s state-run psychiatric hospital have been infected with the coronavirus , state officials said Wednesday.\nThe Department of Health and Social Services reported that five patients and three staff members at the Delaware Psychiatric Center have tested positive for COVID-19. Officials said the patients are isolated within a unit at DPC and that the staff members are self-isolating at their homes.\nThe psychiatric hospital is the seventh long-term care facility in Delaware where residents have contracted COVID-19.\nMeanwhile, officials reported a sharp increase of more than 180 new cases of coronavirus in Delaware on Wednesday, bringing the total to more than 1,100. The death toll rose by three to 19, and more than 175 people are hospitalized.\nThe Division of Public Health recommended Wednesday that Delawareans wear cloth face coverings in public settings where social distancing is difficult to maintain, such as grocery stores and pharmacies.\nFor most people, the coronavirus causes mild or moderate symptoms, and the vast majority survive. But for others, especially older adults and people with existing health problems, it can cause pneumonia or death.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/ad159cb6b44aa995aceccb9483217ba0"}