{"authors": ["Nikki Carvajal"], "date_download": "2020-05-04 16:55:18", "date_modify": "2020-05-04 16:55:18", "date_publish": "2020-04-08 23:37:27", "description": "One of the top medical officials on the White House coronavirus task force said Wednesday that models projecting the number of US deaths from coronavirus have dropped dramatically in recent days because Americans have drastically changed their behavior.", "filename": "2020_04_08_politics_deborah-birx-social-distancing-models_index_1588611318.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331194410-birx-briefing-3-31-model-acosta-q-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_deborah-birx-social-distancing-models_index_1588611318.html", "title": "Birx says drop in US death projection is due to Americans changing their behavior through social distancing", "title_page": "Birx says drop in US death projection is due to Americans changing their behavior through social distancing - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) One of the top medical officials on the White House coronavirus task force said Wednesday that models projecting the number of US deaths from coronavirus have dropped dramatically in recent days because Americans have drastically changed their behavior.\nCNN's Jim Acosta asked President Donald Trump about the projections during a press briefing at the White House.\n\"My impression is those were the numbers that were set and those were set as an expectation quite a while ago. I think we are doing much better than those numbers,\" the President said, before asking Dr. Deborah Birx, an HIV researcher and the White House coronavirus response coordinator, to come to the podium.\nShe said that the US was doing \"much better in many cases than several other countries, and we're trying to understand that.\"\n\"We believe that our health care delivery system in the United States is quite extraordinary,\" she said, but added that the models were based on \"what America is doing.\"\n\"What has been so remarkable, I think, to those of us that have been in the science field for so long,\" Birx continued, \"is how important behavioral change is, and how amazing Americans are at adapting to and following through on these behavioral changes.\"\n\"That's what's changing the rate of new cases, and that's what will change the rate of mortality going forward,\" she said.\nCNN reported earlier on Wednesday that an influential model tracking the coronavirus pandemic in the United States now predicts that fewer people will die and fewer hospital beds will be needed compared to its estimates from last week.\nAs of Wednesday, the model predicted the virus will kill 60,000 people in the United States over the next four months. That's about 33,000 fewer deaths than the model estimated last Thursday. While the US is still expected to face a shortage of about 16,000 hospital beds, it will need 168,000 fewer beds than previously expected, according to the new analysis.\nNew data on the pandemic's trajectory -- from the United States and around the world -- has been fed into the model almost every day, driving the changes. The downward adjustment suggests social distancing may be working better than expected in some places.\nThe model's first major shift came on Sunday, when a \"massive infusion of new data\" led to changes, according to the model's maker, Dr. Christopher Murray, who serves as director of the Institute for Health Metrics and Evaluation at the University of Washington School of Medicine.\nAdditional data on the pandemic's trajectory has always been expected, along with methodological changes to fine-tune the predictions. And from the start, researchers at IHME, who built the model, have emphasized that it would change.\nBut the newest version of the model underscores just how important social distancing continues to be: It assumes those measures -- such as closing schools and businesses -- will continue through the modeled period, which is until August. And it still predicts tens of thousands of deaths.\nBirx and Dr. Anthony Fauci, another task force member who is the nation's leading infectious disease expert, pushed back on conspiracy theories suggesting that coronavirus deaths in the US are being inflated, especially among those dying with existing underlying conditions.\n\"We've made it very clear, every time I've been up here, about the co-morbidities,\" Birx told Acosta. \"This has been known from the beginning. So those individuals will have an underlying condition, but that underlying condition did not cause their acute death when it's related to a Covid infection.\"\n\"Having an underlying condition and getting this virus, we know, is particularly damaging to those individuals,\" she added.\nFauci took things a step further, saying, \"You will always have conspiracy theories when you have very challenging public health crises. They are nothing but distractions.\"\n\"I would just hope that we just put those conspiracy stuff -- and let somebody write a book about it later on, but not now,\" he added.\nBirx's comments come less than a week after she said in a coronavirus task force news briefing that models showed at the time that not every American was following proper social distancing guidelines.\n\"I know you've seen the slope on the US versus the slope in Italy, and we have to change that slope,\" Birx said at last Thursday's briefing. \"What it means in the US is not everyone is doing it.\"\n\"So we're only as strong as every community, every county, every state, every American following the guidelines to a T,\" Birx added at the time. \"And I can tell by the curve ... that not every American is following it.\"", "url": "https://www.cnn.com/2020/04/08/politics/deborah-birx-social-distancing-models/index.html"}