{"authors": ["Elliott Moore"], "date_download": "2020-05-04 20:09:37", "date_modify": "2020-05-04 20:09:37", "date_publish": "2020-04-08 22:10:18", "description": "The weekly fishing report as compiled for the Texas Parks and Wildlife Department for April 8 and also available on the internet at...", "filename": "_858591d7a38585bb11457635b4d99fae_1588622977.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_858591d7a38585bb11457635b4d99fae_1588622977.html", "title": "Texas Fishing Report", "title_page": "Texas Fishing Report", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The weekly fishing report as compiled for the Texas Parks and Wildlife Department for April 8 and also available on the internet at https://tpwd.texas.gov/fishboat/fish/recreational/fishreport.phtml:\nCENTRAL\nAUSTIN: GOOD. Water clear; 65 degrees; 0.60’ low. Largemouth bass are good on crankbaits, chatter baits, and plastic worms in shallow coves. Sunfish are good on cutworms, and corn in the shallower structure of docks. Catfish are good on prepared baits and cut bait.\nBASTROP: FAIR. Water stained; 65 degrees. Largemouth bass are fair fishing creeks, and coves on Carolina rigged plastics, swimbaits, and crankbaits. Crappie are fair on minnows and jigs. Channel and blue catfish are good on cut bait and stinkbait.\nBELTON: GOOD. Water lightly stained; 67 degrees; 0.03′ high. Black bass are good in creek mouths and coves on bladed spinners with some post-spawn fish in 8-10’. White bass are good. Hybrid stripers are fair trolling jigs and diving crankbaits in main creeks. Crappie are good on minnows and jigs in the creeks. Catfish are excellent on prepared baits.\nBROWNWOOD: FAIR. Water clear; 66 degrees; 0.77’ low. Largemouth bass are fair with crankbaits and plastic worms in shallow water grass. White bass are fair on minnows and Alabama rigs in creeks. Catfish have been good on prepared bait in 12-18’.\nCANYON LAKE: EXCELLENT. Water clear; 69 degrees; 2.72’ low. Striper fishing is good on main lake humps vertically jigging striper jigs. White bass are good in areas in creeks and main lake points and humps. Largemouth bass are excellent in creeks, and grassy shorelines with square billed crankbaits, jerk baits, plastic lizards and worms, and bladed spinners with some fish taken on topwater plugs. Catfish are good with live and cut bait throughout the lake in 6-15’.\nFAYETTE: GOOD. Water lightly stained; 70 degrees. Largemouth bass are good on plastic worms, spinners, and crankbaits. Sunfish are very good on worms and crickets around bank ledges and structure. Catfish are excellent on stinkbait, live bait and cut bait.\nGRANBURY: GOOD. Water clear; 61 degrees; 0.11’ low. Crappie fishing is good around brush piles, boat docks, and creeks with minnows and jigs. Catfishing is good when using cut bait or live bait in 7-15’. White bass are very good with fish spawning in creeks. Largemouth bass are good on chatter baits and flipping jigs in creeks and shallow water. Stripers are good trolling.\nGRANGER: GOOD. Water stained; 65 degrees; 0.53’ high. Black bass are good upriver and creeks on rattle baits, jigs, and soft plastic worms. Crappie are excellent on minnows and jigs. White bass are good upstream around Dickerson’s Bottom with jigs and small spoons. Blue catfish are good on cut shad. Yellow catfish are slow.\nLBJ: EXCELLENT. Water clear; 67 degrees; 0.73’ low. Black bass are excellent in spawn activity in creeks, and spawning coves on topwater (early), Texas rigged plastic worms, spinners, and shallow diving crankbaits. Crappie are good on jigs around brush, marinas and docks. White bass are good fishing the river and creeks. Catfish are good on stinkbait and cut bait in 15’.\nNAVARRO MILLS: GOOD. Water stained; 66 degrees; 7.71’ high. Crappie are good on minnows around the marina and in the creeks. Catfish are very good with punch bait. White bass are good on jigs in shallow inlets and creeks. Black bass are good with top waters, spinners and buzz baits in shallow coves and grass lines.\nPROCTOR: GOOD. Water clear; 67 degrees; 0.52’ high. Largemouth bass are excellent on Carolina rigged creatures and worms and with jigs in shallow water and coves. Hybrid stripers are good. Crappie are excellent with jigs and minnows in shallow water. Catfish remain good on stinkbait and cut bait.\nSOMERVILLE: GOOD. Water clear; 64 degrees; 0.19’ high. White bass and hybrids are good fishing creeks with rooster tails and jigs. Crappie are good with minnows and jigs. Catfish are good throughout the lake with cut shad and stinkbait in 7′-20’. Largemouth bass are good with plastic worms, crankbaits, spinners, and top waters near the creeks and coves.\nSTILLHOUSE HOLLOW: GOOD. Water clear; 65-68 degrees; 1.34’ low. Black bass are good on crankbaits, spinners, and Carolina rigged soft plastic worms working vegetation in creeks and coves. Crappie are good on minnows and jigs in creeks. White bass are good on small crankbaits and jigs in creeks and main lake points. Catfish are very good with live and cut bait.\nTRAVIS: GOOD. Water clear; 66-70 degrees; 8.11’ low. Largemouth bass are excellent when fishing creeks and coves for spawning fish working plastic worms and crankbaits. Post-spawn fish are caught in deeper water. White bass are good in shallow water with spawning activity in creeks working jigs and small crankbaits and slabs working main lake points and humps. Crappie are good on minnows and jigs. Catfish are good on cut bait in 5-15’.\nWALTER E. LONG: GOOD. Water lightly stained; 64 degrees. Largemouth bass are good on plastic worms and lizards, short-billed crankbaits in creeks, grass lines, and shallow coves. Hybrid stripers are good with jigs and live bait. Crappie are excellent on minnows and jigs in shallow water. Catfish are good on live bait and stinkbait. Sunfish are good.\nWACO: GOOD. Water lightly stained; 66 degrees; 0.12’ high. Largemouth bass are good on spinnerbaits, plastic frogs, and other topwater baits as well as chatter baits in the coves and creeks. Crappie are good on minnows and jigs in creeks and inlets. Sunfish are good on worms or crickets. Channel and blue catfish are excellent on cut shad or live bait.\nWHITNEY: GOOD. Water clear; 64 degrees; 0.71’ high. Black bass are fair on crankbaits and plastic creatures while fishing spawning areas and coves 8-10’. White bass are good in creeks with jigs. Stripers are good trolling main lake. Crappie are fair with minnows and jigs in shallow water. Catfish are fair on cut shad and prepared baits.\nNORTHEAST\nARLINGTON: GOOD. Water lightly stained; 65 degrees; 0.18 low. Largemouth bass are good in creeks and coves on topwater plugs, lipless crankbaits, and drop shots. Crappie are good among structures such as boat docks and partially shaded vegetation on small minnows and jigs. Catfish are good on live bait and prepared baits in 12-20’ with some fish caught in 3-6′.\nATHENS: EXCELLENT. Water clear; 65 degrees; 0.56’ high. Largemouth bass are excellent on Carolina rigged worms, chatter baits, and bladed spinnerbaits working the vegetation edges of shoreline and creeks. Crappie are excellent with minnows and jigs among natural and man-made structures and creeks. Catfish are good on cut bait. Sunfish are good on cutworms.\nBENBROOK: FAIR. Water stained; 63 degrees; 8.53’ high. Largemouth bass are fair fishing spinners and crankbaits in creeks and coves. Crappie are good on minnows and jigs in creeks. Hybrid striped bass are slow. White bass are good with small spoons in creeks and lake points. Catfish are good on trotlines with cut bait.\nBOB SANDLIN: EXCELLENT. Water stained; 65-69 degrees; 0.68’ high. Black bass are good on square billed crankbaits, plastic lizards, and topwater baits in coves. Crappie are excellent on jigs and minnows in creeks fishing 1-2’ with spoke fish in 12-18’. Catfish are good on cut bait in 6-18′.\nBRIDGEPORT: FAIR. Water stained; 66 degrees; 0.07’ high. Black bass are good on shallow running crankbaits, top waters, and Texas rigged creature baits in 2-5’. Crappie are good on minnows in creeks. White bass are fair on jigs and swimbaits in creeks. Hybrid stripers are fair. Catfish are good on cut bait and live bait.\nCADDO: GOOD. Water lightly stained; 65-68 degrees; 1.87’ high. Largemouth bass are good in shallow water working trees in 1-4’ with swimbaits, plastic worms and crankbaits. Crappie are excellent on minnows and jigs in creeks. White bass are good on jigs and small crankbaits in shallow water. Chain Pickerel are fair. Catfish are excellent on prepared bait and live bait in 15-20’.\nCEDAR CREEK: GOOD. Water lightly stained; 63-65 degrees; 0.02’ high. Largemouth bass are in coves in 2-7′ also along shorelines leading to the back of spawning coves. Jigs, plastic creatures, and moving baits like chatter baits and spinnerbaits are producing. Hybrids and sand bass are now up in the creeks. Small grubs, spoons, and swimbaits are good in the creeks, and crankbaits can be good in 4-10′ on the points. Crappie are in the creeks and spawning coves. Some docks are starting to hold fish, as well as some of the brush piles in various depths. Jigs and minnows are both effective. Catfish are good on the shallow north end of the lake and also moving shallow all over the lake. There are still some deep fish as well, so don’t rule that out. Fresh cut shad is best.\nCOOPER: GOOD. Water clear; 67 degrees; 3.19’ high. Largemouth bass are good on Carolina rigged worms, crankbaits, and spinners in creeks and coves. The white bass are good in shallow water with crappie jigs or rooster tails. Catfish are good on live and cut bait in 8-16’.\nEAGLE MOUNTAIN: GOOD. Water lightly stained; 64 degrees; 0.14’ high. Black bass are good fishing coves with plastic frogs, jigs and plastic worms in 2-6’. White bass are fair. Crappie are good on minnows and jigs between 8-15’ working docks and structures. Catfish are good on cut bait and punch bait.\nFORK: FAIR. Water lightly stained; 63-66 degrees; 0.09’ low. Largemouth bass are fair on plastic lizards, topwater, and chatter baits spawning in shallow grassy areas with some fish holding on roadbeds and points. White and yellow bass are fair in creeks and shallow water to spawn Crappie are fair on jigs and minnows in creeks in 2-5’. Catfish are good on cut bait.\nGRAHAM: GOOD. Water clear; 65 degrees; 0.12’ high. Largemouth bass are good in shallow water on plastic worms, buzzbaits, and crankbaits. Crappie are excellent on jigs and minnows. White bass are excellent on jigs in creeks. Hybrid stripers are good on slabs in deep water and humps. Catfish are good on cut shad and live bait.\nGRAPEVINE: FAIR. Water muddy; 65 degrees; 14.10’ high. Largemouth bass are fair on buzz baits, and square billed crankbaits. Fish creeks, flooded flats, and shallow structure. White bass are fair in creeks. Crappie are good on minnows and jigs in marinas and creek areas. Catfish are slow on live and prepped bait.\nJACKSONVILLE: GOOD. Water lightly stained; 67 degrees; 0.22′ high. Largemouth bass are fair with crankbaits, creatures, and spinners, moving into spawning areas and coves. Crappie are good on jigs and minnows in creeks and shallow structure. Catfish are good on cut shad and prepared bait.\nJOE POOL: GOOD. Water stained; 61-65 degrees; 4.78’ high. Largemouth bass are good fishing Texas rigged lizards and frogs and shallow running crankbaits along banks of coves. Crappie are fair beneath bridges and in creeks with jigs and minnows. Catfish are good on cut bait and prepared baits.\nLAKE O’ THE PINES: GOOD. Water stained; 64 degrees; 6.09’ high. Largemouth bass are fair on medium size crankbaits, and Texas rigged creature baits in shallow coves. Crappie are good on minnows and jigs in the creeks and timber areas. Catfish are good on cut bait and blood bait in 10-16′.\nLAVON: GOOD. Water stained; 64 degrees; 6.34 high. Crappie are excellent on minnows fishing creek edges and marinas. White bass are excellent on the creek with rooster tails, jigs, and spoons. Black bass are good on crankbaits, top waters, lizards and jigs. Catfish are good on prepared baits and live bait.\nLEWISVILLE: GOOD. Water stained; 67 degrees; 5.73’ high. Black bass are fair fishing the crankbaits, spinners, and Texas rigged plastic creatures. White bass are good on jigs in creeks and main lake points. Crappie are good on minnows and jigs in creeks. Catfish are fair on cut bait and prepared bait.\nMARTIN CREEK: GOOD. Water lightly stained; 68 degrees; 0.04′ high. Largemouth bass are good on crankbaits, and Texas rigged worms in shallow coves. Crappie are good on jigs and minnows in creeks. Catfish are good on cut bait in 8-15’.\nPALESTINE: GOOD. Water clear; 64 degrees; 0.95’ high. Largemouth bass are good in shallow water working Texas-rigged soft plastics and crankbaits. Crappie are good on jigs and minnows in creeks and marinas. Hybrid stripers are fair on slabs and trolling. White bass are excellent on swimbaits and jigs in the creeks. Catfish are good on cut shad, chicken livers and prepared baits.\nPALO PINTO: GOOD. Water lightly stained; 68 degrees; 0.06’ low. Largemouth bass are good in coves and creeks with Carolina rigged creature baits, plastic frogs, and topwater plugs. Crappie are good on minnows and jigs along creeks and brush piles in 20 feet. White bass are good on jigs in creeks and main lake points and humps. Striped bass are fair on live shad and jigs. Catfish are good on prepared baits in 8-18’.\nRAY HUBBARD: GOOD. Water clear; 65-70 degrees; 0.12’ high. Largemouth bass are good on crankbaits, plastics and spinners in water less than 5’. White bass are good spawning in creeks caught on white rooster tails and swimbaits with some fish found on main lake points, humps and flats. Crappie are in the creeks and marinas. Catfish are good on cut bait.\nRAY ROBERTS: GOOD Water stained; 64 degrees; 5.15’ high. Largemouth bass are good flipping plastic lizards and worm and working crankbaits and spinners. White bass are good in creeks and Trinity river on jigs and spinners. Crappie are good on jigs and minnows in the marina and shallow water 8’ in creeks. Catfish are good on live bait and cut bait.\nRICHLAND CHAMBERS: EXCELLENT. Water stained; 69 degrees; 0.39’ high. Largemouth bass are good on crankbaits, plastic lizards and frogs, and bladed jigs working flats, submerged vegetation, and creeks. White bass and hybrids are excellent on jigs and swimbaits. Crappie are good on minnows and jigs near structure and in the creeks. Catfish are excellent on live bait and cut bait.\nSQUAW CREEK: GOOD. Water lightly stained; 74 degrees; 0.41’ high. Catfishing is good working baited areas in 6-15’ using punch bait and cut bait. The largemouth bass fishing is good around shallow structures on soft plastic worms and crankbaits. Crappie are good on minnows and jigs.\nSULPHUR SPRINGS: FAIR. Water stained; 67 degrees; 0.05’ high. Largemouth bass are fair on bladed jigs and plastics in creeks. Crappie are good on minnows and jigs. Catfish are good on cut shad and live bait in 13-20’.\nTAWAKONI: EXCELLENT. Water lightly stained; 68 degrees; 0.92’ high. Catfish are excellent on live bait and cut bait 8-18’. Largemouth bass are good on spinnerbaits, plastic worms, and square billed crankbaits in coves and creeks. White bass and hybrid stripers are excellent on swimbaits and jigs in creeks. Crappie are good on minnows and jigs around structure including docks and marinas.\nTEXOMA: GOOD. Water stained; 62 degrees; 4.26’ high. Striped bass and white bass are good. Largemouth bass are good fishing plastics and crankbaits in shallow water spawning areas. Crappie are good on minnows and jigs by boathouses, marinas, creeks, and inlets. Catfish are good on cut bait and minnows in 5-15’.\nTYLER: EXCELLENT. Water clear; 64-66 degrees; 0.27’ high. Black bass are excellent on Carolina rigged creature baits as well as spinners and jigs fishing dock structures and natural shorelines in creeks and coves. Crappie are excellent on jigs and minnows near creek edges in 1-2’. Catfish are good on stinkbait and live baits. White bass are good in creeks and lakes.\nWEATHERFORD: GOOD. Water stained; 61-65 degrees; 0.11’ high. Largemouth bass are good on spinnerbaits, topwaters, and worms working shallow water coves. White bass are excellent in creeks and shallow water run-offs. Crappie are excellent on minnows and jigs around docks and marinas and creeks. Catfish are good on crawfish and cut bait.\nWORTH: GOOD. Water stained; 67 degrees; 0.27’ high. Largemouth bass are good with spinners, lipless crankbaits and worms working coves and creeks. Crappie are good on minnows and jigs among vegetation beds and under docks and in creeks. Catfish are good on live bait and cut bait.\nWRIGHT PATMAN: FAIR. Water stained; 59 degrees; 11.32’ high. Largemouth bass are fair on slow-moving worms and jigs working creeks and coves. White bass are good on spoons and jigs. Crappie are fair on jigs in creeks. Catfish are fair on cut bait, live bait, and stinkbait.\nSOUTH\nAMISTAD: GOOD. Water lightly stained; 67-68 degrees; 40.14’ low. Working out from the Devil’s River has proven successful this past week with topwaters in less than 6 feet of water, spinners and crankbaits on points, and worms in vegetation. White bass remain fair with minnows. Catfish are fair on cut bait. Remember to stay on the Texas side of the lake unless you possess a Mexican fishing license.\nCALAVERAS: GOOD. Water stained; 70-71 degrees. Red drum are good with crawfish and tilapia with some surface activity. Largemouth remain good with topwater early morning, switching to worms in vegetation, and crankbait along with spinners during the day. Hybrid striped bass remain fair. Catfish are good on chicken livers and cut shad.\nCHOKE CANYON: FAIR. Water lightly stained; 70-71 degrees; 18.11’ low. Largemouth bass remain good with jigs, topwaters, spinners, and worms working points, coves, and creeks. White bass are in the mouth of the Frio River. Crappie are fair on jigs. Catfish are fair in shallow water vegetation and river channels with live bait and cheese bait.\nCORPUS CHRISTI LAKE: GOOD. Water lightly stained; 73-74 degrees; 3.92’ low. Largemouth bass remain good in shallower structures less than 10 feet with spinners, rattletraps, crankbaits, and plastic worms. White bass are in the mouth of the Nueces River, working out. Crappie are good fishing live minnows in structure. Catfish are good on cut bait and cheese bait.\nFALCON: GOOD. Water lightly stained; 72 degrees; 38.94’ low. Check boat ramps before you head out because Zapata County Park is closed. Black bass are good. The ones that are fishing have been seeing success on the south end of the lake. Not much has changed. Mostly on rock, and some flipping fish have also appeared on creek channels in the hardwoods. Crappie are increasing to fair near the hardwoods. Catfish are good on live and prepped baits. Remember to stay on the Texas side unless you possess a Mexican fishing license.\nMEDINA: FAIR. Water lightly stained; 72 degrees; 12.57’ low. Black bass remain good on crankbaits and jigs working the mid-depth structure. White bass remain fair on spoons and jigs near points and feeder streams. Striped bass are slow. Catfish are fair on live bait, chicken livers, and blood baits.\nTEXANA: FAIR. Water stained; 73 degrees; 3.63’ low. Largemouth bass remain good on worms, jigs, buzzbait, some crankbaits and light-colored spinners fishing gravel bars, open water points, and creeks. Crappie are fair on jigs working creek channels. Catfish are good on stinkbait, cut bait, and live bait. Trotlines remain great with live bait.\nSOUTHEAST\nBRAUNIG: GOOD. Water lightly stained; 73 degrees; Largemouth bass are good fishing vegetation and rocky points using Carolina rigged plastic worms, spinners, and jigs. Red drum are good on crawfish and tilapia with surface activity and following birds. Strippers are fair. Catfish are good on live bait and cheese bait.\nB.A. STEINHAGEN: GOOD. Water stained; 73 degrees; 0.29’ low. Largemouth bass are good with topwater, worms, and spinners fishing creek structures, and cove points Crappie remain excellent in shallow structure on the north and west tributaries of the lake. Catfish are good on cut and prepped bait coming out of the river.\nCONROE: GOOD. Water stained; 74 degrees; 0.47’ low. Largemouth bass are good on topwaters, soft plastics, spinners, and shallow on the northern end of the lake. Crappie are good on minnows and jigs fishing structures. Hybrid striped bass remain slow. Catfish are good on stinkbait and cut bait. Sunfish are fair with live worms or crickets in shallow water.\nGIBBONS CREEK: GOOD. Water stained; 74 degrees. Largemouth bass are having the best week of the year! Ten plus pound catches have become regular on Carolina rigged worms, spinners and crankbaits. Crappie are fair on jigs and spinners. Catfish are fair on live bait. Sunfish are fair on cutworms shallow.\nHOUSTON COUNTY: GOOD. Water clear to lightly stained; 66-69 degrees; 0.30’ high. Black bass are good with multiple bass over 10 pounds caught using green brush hogs along the banks, watermelon red weightless worms and flukes, white chatter baits, and crankbaits. Crappie are very good in numbers around structures in 12′ or more using live minnows. Catfish are fair near structure using prepared liver and worms.\nLIVINGSTON: FAIR. Water lightly stained; 72 degrees; 1.18’ high. Black bass are good fishing creeks, points, and drops with worms, spinners, and jigs. Striped bass are fair. Crappie are good on minnows and jigs in most structures under 6′. White bass remain good on spoons. Catfish are fair on live baits.\nNACONICHE: GOOD. Water slightly stained; 73 degrees. Largemouth bass are good on spinners, crankbaits, and creature baits. Stick to fishing the edges of vegetation, and shallow drops. Crappie are good on jigs and minnows around structure, creek structures, and vegetation. Sunfish are fair on jigs and crickets. Catfish are good on dough balls and cut and live bait.\nRAVEN: GOOD. Water stained; 74 degrees. Largemouth bass are consistently good with Carolina rigged plastics, spinners, and jigs fishing the creeks, vegetation, and drops. Sunfish are fair on crickets and cutworms among any shallow structure under 5′.\nSAM RAYBURN: FAIR. Water stained; 73 degrees; 0.48’ high. Largemouth bass are good fishing points, vegetation, and shallow nests with worms, crankbait, jigs and spinners. White bass are fair fishing minnows sticking to creek and drops. Crappie are good on minnows and jigs. Catfish are good on live and stinkbait.\nTOLEDO BEND: FAIR. Water slightly stained; 72 degrees; 0.16’ high. Largemouth bass are good with crankbaits, spinners, and jigs looking for gaps in vegetative cover. Striped bass are fair. White bass are fair in the deeper portions. Crappie are good on minnows in structure. Channel and blue catfish are fair on stinkbait. Louisiana is not allowing fishing due to COVID-19, so ensure your trip is on the Texas side of Toledo Bend.\nPANHANDLE\nCISCO: FAIR. Water clear; 61 degrees; 2.52’ low. Largemouth bass remain good with jigs and spinners sticking to creeks and creek structure. Sunfish remain good on minnows and worms under and around docks. Crappie are fair on jigs and minnows in the same creeks as bass. Catfish are fair at night on nightcrawlers, liver, and cut shad all over the lake.\nMEREDITH: SLOW. Water stained; 61 degrees; 46.54’ low. All docks and piers have been closed to fishing due to COVID-19. Black bass remain fair in the river with crankbaits, spinners, and minnows with spawn activity increasing over the past week. Walleye are responding on crankbait. Crappie are slow on jigs. Channel catfish are fair on cut bait and live bait near the dam.\nMILLERS CREEK: GOOD. Water stained; 61 degrees; 0.88’ high. Largemouth bass are good in full spawn in flooded timber and creeks. There are several other spawning holes. You just have to look for activity early. Crappie are great on minnows and jigs. White bass and hybrids are good on rattle traps. Catfish are good in the upper lake with live, blood and liver prepared baits.\nWEST\nALAN HENRY: GOOD. Water clear; 58 degrees; 0.66′ low. Black bass are good on swim jigs, spinnerbaits, and shaky heads. I saw fish moving up on beds today, spotted bass fanning beds. I also saw some very large black bass cruising. The Spawn is on! Crappie are good on minnows off the pier. Catfish are fair on live bait and stinkbait.\nARROWHEAD: FAIR. Water stained; 56-59 degrees; 0.47’ low. Largemouth bass remain good moving frequently amongst vegetation and rip rap on jigs and crankbait. Crappie are good on live minnows and jigs. Catfish are good on cheese bait, stinkbait and shrimp with trotline success.\nCOLEMAN: FAIR. Water slightly stained; 57-59 degrees; 0.44’ low. Hybrid stripers are still great moving in bunches around 10-15′ deep. Largemouth bass remain great on topwaters, jerkbaits, and worms in rivers not getting more than 5′ off the banks. Crappie are good on jigs. Catfish are fair with stinkbait and cut bait.\nFORT PHANTOM HILL: GOOD. Water stained; 56-58 degrees; 0.51’ high. White bass remain good fishing on points and humps with Alabama Rigs. Black bass are good, seeking creeks and vegetation with worms and spinners. Crappie are good on live minnows and jigs. Catfish are fair on cut shad and stinkbait all throughout the lake.\nHUBBARD CREEK: FAIR. Water stained; 56-58 degrees; 0.14’ low. Largemouth bass are good on spinners, worms, and jigs spawning shallow and near untouched banks. Crappie are great in numbers fishing with live minnows. White bass are good deeper in the creeks. Catfish are fair on live and cut shad.\nNASWORTHY: GOOD. Water murky; 55-58 degrees; 0.83’ low. Black bass are amazing when fishing structure and shallower coves. Crappie are good beneath docks and bridges on minnows and jigs. White bass are fair on points. Catfish are fair on live and prepped baits throughout the lake.\nOAK CREEK: FAIR. Water lightly stained; 56-58 degrees; 0.89’ low. Largemouth bass are great in creeks and shallow holes close to the bank. Crappie are good with live minnows. White bass remain fair. Catfish are fair on nightcrawlers, live bait and cut bait.\nO.C. FISHER: FAIR. Water stained; 55-58 degrees. 37.49’ low. Largemouth bass remain good in vegetation, coves, points, and year-round spots during the day. Crappie remain fair on minnows and jigs. White bass are fair fishing creek mouths and points to them. Catfish are fair with limited structure on live and cut bait.\nO.H. IVIE: GOOD. Water clear; 56-60 degrees; 8.94’ low. Black bass are good and spawning in the river with cover and flooded timber by fishing worms and spinners. Crappie are good with live minnows and jigs. Catfish are good on stinkbait and live and cut bait. White bass are fair in creeks and river structures.\nPOSSUM KINGDOM: FAIR. Water clear; 59- 61 degrees; 0.25’ low. Largemouth are good with Carolina rigged worms, spinners, and crankbaits near rocky banks and shallow vegetative structures. White bass remain good throughout the river channel. Crappie are increasing in coves and under docks. Striped bass are slow. Catfish are good on cut shad.\nSPENCE: FAIR. Water stained; 59-61 degrees; 36.24’ low. Largemouth have settled into spawning spots and are very active. Fish into creeks deeper than normal, and try to fish the mornings with crankbait minnows and worms. White bass remain fair on points of creeks. Catfish are fair on live and cut bait.\nSTAMFORD: FAIR. Water stained; 58-60 degrees; 1.13’ high. Largemouth bass are good in spawning spots now. Try coves, creeks, any vegetative structure with worms, spinners, and topwater before 11 a.m. Crappie are good on minnows fishing stumps and drops. White bass are fair on live shad and slabs. Catfish are fair on live bait and stinkbait.\nTWIN BUTTES: FAIR. Water stained; 59-60 degrees; 7.46’ low. Black bass are good with topwater, spinners, and jigs, especially in North Lake, in their holes and structure while spawning. Crappie are good on minnows and jigs in less than 4′ with structure. White bass continue in the backs of creek channels. Catfish are fair on live and prepped baits throughout the lake.\nWHITE RIVER: SLOW. Water stained; 58-60 degrees; 21.01’ low. Drought conditions continue to be in place. Please check boat ramp access. The Largemouth bass continue to spawn successfully, producing on jigs, worms, and spinners near obvious holes and structure. Crappie are good on jigs and minnows shallower than before. Walleye is okay with increased activity. Catfish are fair on live bait, cut bait and stinkbait.\nCOASTAL\nSABINE LAKE: FAIR. Water stained; 75-77 degrees. Speckled trout fishing has been fair, but the recent influx of freshwater from the Neches and Sabine rivers has shut down the trout fishing except in a few areas. Best trout fishing is on the lower half of the lake along shorelines. As soon as winds subside, there should be trout along jetties or beachfront. Best lures are jig and soft plastics or suspending twitch baits. Live shrimp is good if you can find it. Redfish are best on the jetties, the ship channel, or in the marsh areas. The shoreline of the lake is spotty right now. Live finger mullet, mud minnows, or jigs and soft plastics will work. The spring flounder run is on, but I am not finding large numbers. However, there are some nice ones moving into the lake and marsh areas. We have been taking several flounder each day on jigs and soft plastics up to four pounds. Due to the coronavirus, we are not able to cross into Louisiana right now, so we have to launch on the Texas side to fish.\nPORT MANSFIELD: GOOD. 76-77 degrees. Unchanged. All boat ramps are closed in port. Those who have slips on the water can still get out to fish. With that said, the reds are plentiful in the east cut using shrimp. Also, reds and trout can be found out on the flats in 1-2′ using topwater and kwiggler paddle tails. There are good numbers of trout with an occasional red on kwiggler mansfield margarita ball tails and top waters in 4-6′. For those that are stuck at home, use this time to go through and organize your gear. All be safe and follow the rules, and we will all be back on the water in no time.\nTRINITY BAY: GOOD. 72-74 degrees. Unchanged. Follow local ordinances. Wade fishing the shoreline with artificial bait or drifting over the shell reefs off the boat are the best ways to catch redfish or speckled trout here. Flounder are good on minnow around the rocks.\nEAST GALVESTON BAY: GOOD. 73-74 degrees. The City of Galveston is advising against recreational fishing during the shelter in place ordinance. The City of Galveston has closed all beach park amenities. In addition, the following west end beach access points are closed to vehicular traffic: The north and south side of the San Luis Pass bridge, Salt Cedar Drive access point, access point number 35 which is just to the east of the house at 24125 FM 3005 and Estuary Drive at the beach. Moses Lake floodgate closure effective until April 20.\nWEST GALVESTON BAY: GOOD. 73-74 degrees. The City of Galveston is advising against recreational fishing during shelter in place ordinance. The City of Galveston has closed all beach park amenities. In addition, the following west end beach access points are closed to vehicular traffic: The north and south side of the San Luis Pass bridge, Salt Cedar Dr. access point, access point number 35 which is just to the east of the house at 24125 FM 3005 and Estuary Drive at the beach. Moses Lake floodgate closure effective until April 20.\nTEXAS CITY: GOOD. 73-74 degrees. The dike reopened on Monday. Redfish are very good over the flats on live shrimp. Flounder are good on live shrimp or minnow around the jetties. Speckled trout are good along the shoreline on shrimp. Black drum are very good on blue crab. Sheepshead are very good around the dike.\nFREEPORT: GOOD. Water mostly clear, 71-72 degrees. All Freeport beaches are closed until further notice, including Bryan Beach. Black drum are good on a gold spoon, slow bouncing off the bottom. Redfish will be found along the flats and are best on shrimp- on windier days, look for them to be stacked up along the shoreline chasing baitfish. Speckled trout are good on shrimp. Sheepshead will be found around the oyster reeds in the back lakes. Flounder are good around the rockets on mullet.\nROCKPORT: GOOD. Water mostly clear, 72-74 degrees. All beaches and parks have been closed until April 14th. Shore fishing is still allowed at this time. Redfish are very good, using small white shrimp or finger mullet around the flats and edges. Trout are very good on mullet or shrimp and are being found around the shoreline. Flounder have been good on mullet near the rocks. Black drum are very good and will be found around grass beds- blue crab or mullet.\nCORPUS CHRISTI: GOOD. 75-76 degrees. Night curfew for beaches is 8 p.m. Redfish are good on live mullet. Speckled trout are good around the mid-bay reefs on artificial baits or shrimp. Flounder are good on mullet or shrimp around the rocks. Pompano on dead shrimp, Bull reds on cut bait in the surf. Black drum on crab and shrimp off the jetty.\nSOUTH PADRE: GOOD. 78-79 degrees. For now, fishing is allowed; you must maintain a proper distance from others. Soft plastics are still doing well. Mullet and shrimp baits have also been great in the natural colors. Speckled trout are hanging along color changes. Redfish will be found along the grass flats and are better targets when the wind picks up. There have been a couple of large schools of black drum showing up along the deeper water transitions. Expect the bite to remain good for the time being.\nWEST MATAGORDA BAY: GOOD. 73 degrees. Most boat ramps have been closed along with cleaning tables and restrooms. Maintain social distancing. Wading and drifting are the best methods. Black drum are good on blue crab or shrimp. Speckled trout are very good along the shoreline or around flats on shrimp. Redfish are very good on live shrimp. Flounder are good on shrimp around the rocks.\nEAST MATAGORDA BAY: GOOD. 73 degrees. Most boat ramps have been closed. Maintain social distancing. Trout are good in shallow water over mud on shrimp or soft plastics. Black drum have been good on blue crab. Redfish are good on soft plastics around the reefs and shorelines.\nPORT O’CONNOR: GOOD. 72-73 degrees. Some access points may be closed. Please check with local authorities to ensure fishing activities are allowed at this time. Trout and redfish are good on shrimp, mostly in the back lakes. Black drum are good on blue crab or shrimp. Flounder are good around the jetties on shrimp or minnow. Sheepshead are good near the jetty on live shrimp or mullet.\nBAFFIN BAY: VERY GOOD. 79 degrees. The only restriction that pertains to the bay is that there is an 8 pm curfew on the beach, this includes public piers and public boat ramps. There are no fishing restrictions as long as you adhere to the social gathering rules 10-by-6′. This means no more than ten people in an area at a time, ensuring that everyone is 6′ apart on the piers. No one will interfere with commercial and sports fisherman that adhere to the rules. Despite the wind changes we’ve been having in the area, it is still holding good trout, redfish, and flounder. They will most likely be found in 2-3′ and are good on paddle tails in orange or Chicken on a chain using darker colors is best. Using darker colors will perform best in dirty water. The Flats in Alazan have been holding good slot reds on the Eastside, and good solid trout are being caught around the Los Corrallos area. Flounder have been good on the inside of Tide Gauge. Work slow and be patient.\nPORT ISABEL: GOOD. 77-78 degrees. Fishing in the Laguna Madre is permitted and may utilize private docks, MUST follow social distancing guidelines. All public ramps have been closed. Boats cannot hold more than four people at a time. Trout can be found in the shallow grass flats around the Laguna Madre and are good on shrimp. Redfish will be found in less than two feet of water around the grass flats and are best on shrimp. Sheepshead are good on mullet around rocks. Flounder are good on fresh shrimp or mullet. Jack crevalle are fair on live mullet. Black drum are good on crab and shrimp around structure.", "url": "https://apnews.com/858591d7a38585bb11457635b4d99fae"}