{"authors": ["Tom Davies"], "date_download": "2020-05-04 20:26:43", "date_modify": "2020-05-04 20:26:43", "date_publish": "2020-04-20 16:59:19", "description": "INDIANAPOLIS (AP) — Indiana’s governor said Monday he was easing restrictions on hospitals from performing elective surgeries even as the state health commissioner remained concerned over whether...", "filename": "_bfc355e229a3162e7ccd57d79325e256_1588624003.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f830a17240cb4430b9e6c19f4bfee8f6/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bfc355e229a3162e7ccd57d79325e256_1588624003.html", "title": "Indiana governor easing virus restrictions on surgeries", "title_page": "Indiana governor easing virus restrictions on surgeries", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this March 24, 2020 file photo, Indiana Gov. Eric Holcomb answers questions at the Statehouse in Indianapolis. Seven Midwestern governors announced Thursday, April 16, 2020 that they will coordinate on reopening their state economies amid the coronavirus pandemic, after similar pacts were made in the Northeast and on the West Coast. The latest agreement includes Illinois, Ohio, Michigan, Indiana, Wisconsin, Minnesota and Kentucky. (AP Photo/Michael Conroy File)\nFILE - In this March 24, 2020 file photo, Indiana Gov. Eric Holcomb answers questions at the Statehouse in Indianapolis. Seven Midwestern governors announced Thursday, April 16, 2020 that they will coordinate on reopening their state economies amid the coronavirus pandemic, after similar pacts were made in the Northeast and on the West Coast. The latest agreement includes Illinois, Ohio, Michigan, Indiana, Wisconsin, Minnesota and Kentucky. (AP Photo/Michael Conroy File)\nINDIANAPOLIS (AP) — Indiana’s governor said Monday he was easing restrictions on hospitals from performing elective surgeries even as the state health commissioner remained concerned over whether coronavirus infections were slowing in the state.\nGov. Eric Holcomb said while he was extending the statewide stay-at-home order until May 1, hospitals would be allowed starting Tuesday to resume procedures to diagnose and treat medical conditions such as cancer and heart troubles. A halt to elective procedures had been ordered last month to help preserve hospital equipment and protective gear if needed to treated people seriously ill with COVID-19 respiratory infections.\nState officials have not reported shortages of hospital beds and equipment such as ventilators even as Indiana’s coronavirus death toll has topped 550 in little more than five weeks since the state’s first known death from the illness.\nHolcomb said if state medical supplies remain adequate, then more procedures at clinics and surgery centers could be allowed next week.\nDr. Kristina Box, the state health commissioner, has said she expected the coronavirus illness peak to arrive in late April for the Indianapolis area and the first weeks of May for rest of the state, which is the time period Holcomb has said he might start lifting some business and travel restrictions.\nBox said Monday she wasn’t “100% convinced” Indiana has reached its illness peak and will continue reviewing the state’s caseload.\n“It has shown consistently we are running much lower than the original projections and that we are very much running along the lowest-expected line as we model this,” Box said.\nRESTRICTIONS PROTESTS\nAfter more than 200 people protested Saturday against the stay-at-home order outside the governor’s residence, Holcomb said he understood the impatience with the restrictions imposed starting March 25 but that the state can’t “pull up short” in slowing the spread of COVID-19 infections.\nHolcomb said since Indianapolis has more than one-third of the state’s confirmed illnesses, the protest by people largely not wearing masks or following distance precautions presented “almost a perfect petri dish for how this can spread.”\nThe governor said he respected the rights of protesters but worried about the message to health care workers treating COVID-19 patients and concerned about infecting their own families.\n“When we add to that, almost in a flaunting way, it is not helping,” Holcomb said. “There’s nothing government can do to encourage people to care about their neighbors, folks that they may not know.”\nSimilar protests have happened around the country. About two dozen protesters gathered Monday afternoon outside the Statehouse, with one holding a sign saying “Open Indiana.”\nILLNESS UPDATE\nTests have confirmed that another 505 Indiana residents are infected with the coronavirus, bringing the state’s total number of cases to nearly 11,700, state health officials said Monday.\nSeven new COVID-19 deaths occurred between Wednesday and Sunday, boosting the statewide death toll to 569, the Indiana State Department of Health reported.\nAbout 89% of Indiana’s deaths have been among people ages 60 and older, but demographic information on the agency’s website shows that at least one person in their 20s has died with a coronavirus infection.", "url": "https://apnews.com/bfc355e229a3162e7ccd57d79325e256"}