{"authors": ["Analysis Stephen Collinson"], "date_download": "2020-05-04 16:00:37", "date_modify": "2020-05-04 16:00:37", "date_publish": "2020-04-01 02:03:02", "description": "President Donald Trump finally leveled with America about the desperate reality of the coronavirus pandemic, warning of cruel weeks to come in one of the most chilling White House moments in modern history.", "filename": "2020_03_31_politics_trump-coronavirus_index_1588608037.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331180942-04-coronavirus-presser-0331-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_politics_trump-coronavirus_index_1588608037.html", "title": "Trump's alarming message portends tragic days ahead", "title_page": "Trump's alarming coronavirus message to America portends tragic days ahead - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump finally leveled with America about the desperate reality of the coronavirus pandemic , warning of cruel weeks to come in one of the most chilling White House moments in modern history.\nEven with blanket nationwide adoption of stringent mitigation efforts, between 100,000 and 240,000 Americans could face death in the coming weeks in a cascading nationwide ordeal, according to modeling explained by senior members of the President's emergency task force Tuesday.\nIt is in the nature of the presidency, that the commander-in-chief sometimes has to deliver grave news to the nation.\nGeorge W. Bush had to narrate the horror of the 9/11 attacks in 2001. Ronald Reagan movingly eulogized shuttle astronauts after a 1986 disaster . And John Kennedy kept his nerve to address the nation during a showdown with the Soviet Union over Cuba that threatened to erupt in nuclear war.\nBut no president for many decades has had to level with his country over such a sudden impending loss of American life in a medical emergency as Trump is now being forced to do -- after apparently coming to terms about the extent of the crisis himself.\nIt was not the first time that administration experts modeled the staggering possible death toll. But the combination of the President's unusually serious demeanor and the ominous curve charts of his top public health officials struck a note of alarm missing from Trump's previous knockabout briefings.\nThe stark spectacle of a president, especially one who spent weeks dismissing the virus, warning of the imminent demise of so many Americans encapsulated the scale of the crisis.\n\"I want every American to be prepared for the hard days that lie ahead. We're going to go through a very tough two weeks,\" the President said in the White House briefing room.\nTrump's briefing mostly lacked the elements of self-congratulation and false hope that have characterized his heavily criticized leadership in the crisis.\nTo begin with, during his marathon two-hour briefing, he mostly ceded the stage to his credible lieutenants Dr. Anthony Fauci and Dr. Deborah Birx , who convinced him of the seriousness of the situation over the weekend.\nThere have been many false dawns when Trump has failed to match the gravity of a moment during his tenure. Past behavior suggests he may struggle to maintain his unifying tone at a moment of unique national peril.\nAnd the harrowing potential scale of the looming tragedy already have some, like House Speaker Nancy Pelosi , saying lives might have been saved had Trump not spent weeks denying the severity of the approaching pandemic and adopted more aggressive actions to prepare.\nA multi-front battle intensifies\nTrump's appearance came on a day of grave developments that underscored the multi-front nature of the fight against Covid-19. Field hospitals sprang up in New York's Central Park to alleviate overcrowding in the city's hospitals. State governors pleaded with the federal government for more ventilators , and doctors prepared to make grim decisions about who will live and die amid a shortage of the machines.\nFauci and Birx arrived armed with slides showing the rocketing rise of Covid-19 cases in New York and New Jersey in recent weeks, and more shallow curves for other states.\nTheir most hopeful moments involved referring to Italy's belated turn to a downward curve in infections after weeks of agony, reflecting the wrenching substance of their message.\nBut in order to keep deaths to the lower end of their estimates, they warned that maximum mitigation efforts -- including physical distancing and staying at home -- were imperative.\nEven with such a regime in place across the country -- and some states and cities are not yet taking the advice seriously -- there are likely to be between 100,000 and 240,000 deaths.\nFauci vowed, however, not to accept those figures and to strive to keep the mortality curve below expectations.\nHe said there were some early signs that mitigation efforts taken by states and the White House's distancing guidelines, which have been extended until April 30 , are working.\n\"Whenever you're having an effect, it's not time to take your foot off the accelerator,\" Fauci said.\n\"And that's what I hope. And I know that we can that do over the next 30 days.\"\nBirx called on the entire nation to unite, and, in a comment that appeared to jar with Trump's earlier rhetoric on the crisis, added: \"There's no magic vaccine or therapy. It's just behaviors.\"\n\"Each of our behaviors translating into something that changes the course of this viral pandemic over the next 30 days,\" Birx said.\nA grave moment in history\nAs Tuesday's briefing wore on, the President indulged in his familiar misinformation and political shape-shifting that underscored his own erratic leadership and dishonesty\nEmpathizing with the pain in New York and New Jersey, the President who a month ago predicted a \"miracle\" that would make the virus go away bemoaned that \"they got off to a very late start.\"\nNew York's Gov. Andrew Cuomo has repeatedly criticized Trump for not invoking the full power of the Defense Production Act to supercharge the production of ventilators and other vital gear.\nLess than a month ago, the President, resisting calls to shut down the economy and take the pandemic sufficiently seriously, equated coronavirus to the common flu.\n\"So last year 37,000 Americans died from the common Flu. It averages between 27,000 and 70,000 per year. Nothing is shut down, life & the economy go on. At this moment there are 546 confirmed cases of CoronaVirus, with 22 deaths. Think about that!\" Trump wrote in a tweet.\nBut now, with the number of cases of the virus in the United States racing towards 200,000 on Tuesday and 4,000 deaths, Trump admitted the two are not the same.\nThe President invoked an unnamed friend who he said was in a coma because of the disease.\n\"It's not the flu. It's vicious,\" Trump said.\nLater in the marathon briefing -- which became more an attempt to flood the zone for political gain the longer it went on -- Trump claimed of the virus, \"It just reared up and came from nowhere.\" The White House in fact had weeks of notice once the disease emerged in China.\nAs is often the case, the President's off-the-cuff style raised questions about his tone when he ditched his prepared remarks.\nAnd Trump also portrayed himself as a lone force resisting calls to \"ride it out,\" warning such an approach could cost more than 2 million American lives.\nThe President appeared to be setting up a political construct to use in his reelection campaign under which he can claim to have saved hundreds of thousands of lives.\nCNN reported Tuesday that not all of the President's advisers backed extending the distancing guidelines.\nThe decision to shut down the previously purring US economy has thrown millions of Americans out of work and choked off growth. The full scale of the devastation is expected to be revealed in jobs numbers later this week.\nTrump faces an agonizing dilemma, balancing a desire to slow the spread of the virus and the need to return people to work to alleviate the possibility of an economic depression.\nHealth advisers argued a month's extension of the distancing guidelines was necessary.\nBut given that many hotspots may not reach the peak of their pandemics for weeks, it seems unlikely the situation will have improved sufficiently to relax the guidelines in a month.", "url": "https://www.cnn.com/2020/03/31/politics/trump-coronavirus/index.html"}