{"authors": ["Matt Villano"], "date_download": "2020-05-04 16:59:10", "date_modify": "2020-05-04 16:59:10", "date_publish": "2020-04-01 08:02:39", "description": "Shelter-in-place orders, regional lockdowns and overarching health concerns have forced parents to modify their usual custody schedules and rewrite routines.", "filename": "2020_04_01_health_child-custody-wellness-coronavirus_index_1588611550.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331112509-parents-kids-holding-hands-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_health_child-custody-wellness-coronavirus_index_1588611550.html", "title": "Navigating child custody in the time of coronavirus", "title_page": "Navigating child custody in the time of coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) For years, Erika Lenkert's 14-year-old daughter has spent four days a week at Lenkert's house in San Francisco and three days a week at her dad's place in Marin County, about a 30-minute car ride north.\nBut amid the Covid-19 pandemic, the family's custody arrangement has been anything but regular.\nThe girl's father is dating a clinician who is working the front lines at an area hospital, and neither parent was comfortable with the possibility of increased exposure.\nSo Lenkert and her ex talked, and they agreed to temporarily modify the custody agreement until the public health threat diminishes. The teenager has been living in San Francisco full-time ever since.\n\"We wanted to minimize the potential for her to get exposed and the ripple effect that could cause,\" says Lenkert, an editorial services director. \"[She] misses her dad but understands the rationale.\"\nAcross the country, divorced parents are grappling with similar situations and equally difficult decisions. Shelter-in-place orders, regional lockdowns and overarching health concerns have forced parents to modify their usual custody schedules and rewrite routines.\nIn cases like Lenkert's, where the relationship is amicable, the changes have gone relatively smoothly. In other cases where parents are estranged, improvisation has necessitated billable hours with divorce attorneys and unearthed old wounds, making an already stressful time even harder.\nThis anxiety is only exacerbated by a family court system that basically has shut down like all other non-essential parts of society.\n\"Every day, all day long — it's the number one issue we've dealt with in our office over the last three weeks,\" said Jodi Lazar, a divorce and family lawyer in Austin, Texas. \"I'm sure it will be number one for the foreseeable future.\"\nA regular routine disrupted\nOne part of the current custody challenge is logistical. Many divorced parents who live close to each other exchange kids at schools or workplaces, most of which are closed. What's more, parents who live in separate towns risk violating shelter-in-place orders if they go too far out of their way to drop-off or pick-up a child.\nAs for parents who live in different states? Most would agree it's too risky right now to have children fly alone.\nAnother part of the conundrum is medical. How do you know your ex is taking social distancing as seriously as you are? How do you know your ex's new partner is keeping himself or herself safe enough not to infect your child? These are legitimate questions that many divorced parents are asking right now.\n\"I'm not worried about [my ex-wife] exposing our kids to risk, but I have thought about variables I can't control when they're there,\" said Jason Schoenfelder, a single dad in Chicago.\nSchoenfelder's girls, ages 10 and 7, usually split their time evenly between his place and their mother's house. But because she works in a hospital, they've been spending more time with him.\n\"I think it's natural for a single parent to wonder, 'How safe are my kids going to be when I'm not controlling the environment?' But ultimately I trust that their mom has their best interests in mind,\" Schoenfelder said.\nCurrent custody orders are in effect\nThe biggest obstacle for divorced parents during the coronavirus pandemic is legal. Most state and county family courts are closed, or open only for emergencies involving abuse or endangerment. This means that even if parents wanted to formally modify pre-existing custody agreements, they can't.\nLazar, the Austin attorney who specializes in family law, said the Texas Supreme Court issued an emergency ruling that indicated parents should follow current custody orders pursuant to the schedule that was in place before the shutdown. The order also stipulated that stay-at-home provisions of specific counties or cities do not override the possession schedule.\n\"This might not have been what parents wanted to hear, but the [ruling] provided certainty,\" said Lazar.\nOther states have left rulings vague. In Massachusetts, for example, John D. Casey, chief justice of probate and family court, last week issued an open letter that said, \"both parents should cooperate.\"\nInterpretation of divorce laws are equally vague in Connecticut, where attorneys are advising clients to put any temporary tweaks to the original custody agreement in writing, save hard copies of all correspondence about changes to the agreement, and embrace flexibility on both sides.\nErik Broder, a divorce attorney in Westport, said in particular he's advising clients to propose virtual meet-ups on FaceTime, Zoom or Skype for parents who don't actively have custody, and \"makeup time\" for those parents who offer to tweak the schedule now in exchange for additional time with their children later in the year.\nStill, Broder admitted that even with outside mediation, some situations will never be easy.\n\"There's no question there will be parents who try to weaponize the [pandemic] to prevent another parent from spending time with a child,\" he said. \"Unfortunately, without cooperation, there's not much recourse [right now].\"\nNegotiating with an ex\nSome parents say it's hard to trust their kids will be OK away from them.\nJihong Larson, a Chinese-Canadian living in Dallas, Texas, understands the frustration that ensues when agreements can't be modified.\nLarson and her ex-husband currently operate under a split custody arrangement — a plan that says they get equal time with their two children, ages 14 and 11. Earlier this month, when Larson began to worry about growing anti-Asian sentiments in her community, she asked her ex-husband for permission to take their half-Chinese children back to Canada until the pandemic passed. Her ex refused, and Larson has relented, at least for now.\n\"We're in the middle of a custody battle, and he doesn't want to lose his position,\" she explained. \"I'm worried about the safety of our kids, and I got a letter from [my ex-husband's] attorney warning me not to do anything to jeopardize the custody arrangement.\"\nThe threat is real.\nMarcia Zug, professor of law at the University of South Carolina, wrote in a March 24 post for The Conversation that judges may reduce visitation and custody for parents who interfere with their ex's custodial rights.\n\"You want to do what you feel is in the best interest of your child, but it's a real gamble because you don't know what the courts are going to do once they get going again,\" Zug told CNN in a subsequent interview.\n\"Normally the court isn't going to rule in favor of a parent who violates a custody and visitation agreement. It's possible courts will change the approach because of [coronavirus], but if they apply the same framework as they always have, it will be rare for them to find this sort of thing justifiable.\"\nIn these crazy times, perhaps the best option for navigating a contentious custody situation is mediation. This process can provide a roadmap of where each parent stands; a roadmap that could help judges sort out specifics of custody changes down the line.\nIt's better to mediate if possible\nAlison L. Patton, a family attorney who has practiced mediation for 11 years, said notarized temporary modification agreements also can serve to provide answers at a time when most courts can and will not.\n\"We're writing stipulations that specify they are binding at the time you sign them, even if it's not made into an enforceable court order until later,\" said Patton, who is based in La Jolla, California.\n\"When we put together mediated agreements and stipulations, we make clear this is a temporary change, no precedent is being set, and that things will return to normal once the extenuating circumstances have ended,\" she said. \"We spell out that these modifications can't be used later as part of a power play.\"\nOf course, the best-case scenario is still for parents to work it out amongst themselves.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nJust ask Betsy Carmody, chaplain of a boarding school near Washington, D.C. She and her ex-husband have been divorced since December 2019, and they amicably revised the custody agreement for their 12-year-old daughter in March after her father started working from home.\nSpecifics of the new agreement are simple. Previously, every week their tween spent more time with Carmody than her dad. Now, after some minor tweaks to the schedule, she spends about 50 percent of the time with each parent.\nThe arrangement frees up both parents to do their jobs and be present for their daughter, who has expressed a certain degree of anxiety over the pandemic herself.\n\"We're still a family, we just live in different homes,\" Carmody said. \"That was true for all of us before [the coronavirus] became an issue, and it will be true for us afterward, too. We have to do what's best for everyone. And I know we will.\"", "url": "https://www.cnn.com/2020/04/01/health/child-custody-wellness-coronavirus/index.html"}