{"authors": [], "date_download": "2020-05-04 20:15:49", "date_modify": "2020-05-04 20:15:49", "date_publish": "2020-04-08 15:24:52", "description": "ALBUQUERQUE, N.M. (AP) — There's more work to be done in New Mexico, where federal officials say just over one-third of households have responded to the 2020 Census. About a month into the...", "filename": "_d9c3af4f962cea82964c574c49fa15b2_1588623349.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d9c3af4f962cea82964c574c49fa15b2_1588623349.html", "title": "Census: New Mexico response rate near bottom among states", "title_page": "Census: New Mexico response rate near bottom among states", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ALBUQUERQUE, N.M. (AP) — There’s more work to be done in New Mexico, where federal officials say just over one-third of households have responded to the 2020 Census.\nAbout a month into the start of the head count, New Mexico ranks near the bottom among states with a 35% response rate. Nationally, the self-response rate is approaching half of all households, with most responding online.\nBernalillo County, which includes New Mexico’s largest metropolitan area, is slightly ahead of the national rate but other areas are lagging. For example, nearly 11% of households in Taos County and about 5% of households in Rio Arriba County have responded.\nStarting Wednesday, the U.S. Census Bureau is mailing paper forms to 64 million homes whose residents haven’t yet answered the once-a-decade questionnaire.\nDue to the coronavirus outbreak, the bureau is adjusting its timeline to give people more time to respond as public health orders and other restrictions are keeping advocacy and civic groups from conducting face-to-face outreach. Officials say that’s considered the most effective way of encouraging participation.\nThe 2020 Census will guide the distribution of some $1.5 trillion in federal spending and help determine how many congressional seats each state gets.", "url": "https://apnews.com/d9c3af4f962cea82964c574c49fa15b2"}