{"authors": ["Alicia Lee"], "date_download": "2020-05-04 16:54:26", "date_modify": "2020-05-04 16:54:26", "date_publish": "2020-04-08 17:35:46", "description": "On top of ventilators, face masks and health care workers, you can now add COBOL programmers to the list of what several states urgently need as they battle the coronavirus pandemic.", "filename": "2020_04_08_business_coronav_46f4a62deb8c6df12e3bb814d9afd21e_index_1588611266.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408114904-mainframe-computer-1960-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_business_coronav_46f4a62deb8c6df12e3bb814d9afd21e_index_1588611266.html", "title": "Wanted: People who know a half century-old computer language so states can process unemployment claims", "title_page": "Wanted: People who know a half century-old computer language so states can process unemployment claims - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) On top of ventilators, face masks and health care workers, you can now add COBOL programmers to the list of what several states urgently need as they battle the coronavirus pandemic.\nIn New Jersey, Gov. Phil Murphy has put out a call for volunteers who know how to code the decades-old computer programming language called COBOL because many of the state's systems still run on older mainframes.\nIn Kansas, Gov. Laura Kelly said the state's Departments of Labor was in the process of modernizing from COBOL but then the virus interfered. \"So they're operating on really old stuff,\" she said.\nConnecticut has also admitted that it's struggling to process the large volume of unemployment claims with its \"40-year-old system comprised of a COBOL mainframe and four other separate systems.\" The state is working to develop a new benefits system with Maine, Rhode Island, Mississippi and Oklahoma. But the system won't be finished before next year\n\"Literally, we have systems that are 40-plus-years-old,\" New Jersey Gov. Murphy said over the weekend. \"There'll be lots of postmortems and one of them on our list will be how did we get here where we literally needed COBOL programmers?\"", "url": "https://www.cnn.com/2020/04/08/business/coronavirus-cobol-programmers-new-jersey-trnd/index.html"}