{"authors": ["Sarah Skidmore Sell"], "date_download": "2020-05-04 20:17:26", "date_modify": "2020-05-04 20:17:26", "date_publish": "2020-04-16 18:42:12", "description": "Americans are beginning to see the first economic impact payments hit their bank accounts. The Treasury Department says about 80 million Americans received checks as of Wednesday. The...", "filename": "_61b3d38360745d64a98a2ab813501b13_1588623446.html", "image_url": "https://storage.googleapis.com/afs-prod/media/43b7392c964c4ca0ab862a43bde0739a/2400.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_61b3d38360745d64a98a2ab813501b13_1588623446.html", "title": "Here's what to know about your relief check from the gov't", "title_page": "Here's what to know about your relief check from the gov't ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Here’s what to know about your relief check from the gov’t\n1 of 2 FILE - In this April 3, 2020, file photo, a car exits the drive-thru of a PNC Bank in downtown Scranton, Pa. Americans are beginning to see the first economic impact payments hit their bank accounts this week. The IRS tweeted Saturday, April 11, 2020, that it had begun depositing funds into taxpayers’ bank accounts and would be working to get them out as fast as it can. (Christopher Dolan/The Times-Tribune via AP, File)\n1 of 2 FILE - In this April 3, 2020, file photo, a car exits the drive-thru of a PNC Bank in downtown Scranton, Pa. Americans are beginning to see the first economic impact payments hit their bank accounts this week. The IRS tweeted Saturday, April 11, 2020, that it had begun depositing funds into taxpayers’ bank accounts and would be working to get them out as fast as it can. (Christopher Dolan/The Times-Tribune via AP, File)\nAmericans are beginning to see the first economic impact payments hit their bank accounts.\nThe Treasury Department says about 80 million Americans received checks as of Wednesday. The one-time payments were approved by Congress as part of an emergency relief package intended to combat the economic damage from the coronavirus pandemic.\nThe exact timing of when people get their money depends on a few factors, such as income and payment delivery method.\nHere is what you should expect:\nWHO IS GETTING A CHECK?\nAny adult earning up to $75,000 in adjusted gross income who has a valid Social Security number will receive a $1,200 payment.\nThe payment steadily declines for those who make more and phases out for those who earn more than $99,000. For married couples, both adults receive $1,200, with the phase-out starting at $150,000 of income and falling to zero for couples who earn $198,000.\nParents will also get payments of $500 for each eligible child; this is generally those 16 years old or younger.\nFor heads of household with one child, the benefit starts to decline at $112,500 and falls to zero at $136,500.\nEven those who only receive Social Security or other government benefit programs can receive a check.\nWHO DOESN’T GET ONE?\nHigh-income filers are excluded, as is anyone without a valid Social Security number.\nIf someone can be claimed as a dependent on someone else’s return, such as an adult child or student, they will not get a payment.\nPeople who are not a U.S. citizen, U.S. national and do not yet have a green card or have not met the IRS resident requirement known as “substantial presence test” aren’t eligible. People who filed Form 1040-PR or 1040-SS for 2019 are not eligible; these are IRS forms used for certain types of self-employment income in Puerto Rico.\nWHAT DO I HAVE TO DO TO GET ONE?\nThe first batch of payments went to those taxpayers who included their direct deposit information on their 2018 or 2019 tax return.\nAs for others:\n— If you filed a tax return for 2018 or 2019 but didn’t include you bank information, say because you owed taxes, you can use the IRS’ new “ Get My Payment” app to enter that information and receive your check via direct deposit.\n— If you didn’t file a tax return for 2018 or 2019, the IRS urges you to file a return electronically as soon as possible in order to get your payment.\n— Social Security recipients and railroad retirees, who aren’t typically required to file taxes, do not need to take action. The government will send your payment automatically to you either by check or direct deposit, however you typically get benefits.\n—Low-income individuals or others who typically don’t have to file a return, need to file a simple form on the IRS website for “ non-filers ”. Social Security recipients who have an eligible child can also use this form to get payment for that dependent as it is not automatically included in their relief payment.\nAnyone who doesn’t supply direct deposit information will get their check in the mail.\nHOW LONG A WAIT?\nThe IRS says paper checks will begin going out later this month.\nIt’s unclear how long it will take to complete the paper check distribution because many taxpayers are signing up for direct deposit. But a memo obtained earlier by The Associated Press said it could take several month for all the paper checks to be issued due to printing volume limitations. The Treasury and IRS have not said how long they expect the process to take.\nAll payments will be made based on income, with lower-income individuals receiving payment first. The IRS said the “Get My Payment” app will allow taxpayers to track the status of their payment.\nWILL I HAVE TO PAY BACK THE GOVERNMENT?\nVideos and reports have circulated claiming that Americans will have to pay back the relief checks on next year’s taxes.\nThose reports are false , federal agencies confirmed to The Associated Press.\nBoth the U.S. Treasury Department and Internal Revenue Service say these social media reports are misunderstanding language in the $2.2 trillion economic rescue package that resulted in the one-time payments. Americans won’t be required to pay that money back come next year, the Treasury said.\nCAN IT BE TAKEN IF I OWE MONEY?\nIt can happen but not always.\nIf you owe back child support, the relief money can be taken to satisfy that debt.\nIf your bank account is overdrawn and the payment is deposited there, the bank can keep the deposit to satisfy the amount it is due, just as it would any normal deposit. However, a number of banks — including Bank of America, JPMorgan Chase, Citibank and Wells Fargo— have decided the relief payment will not have to go to negative balances or fees, according to a report by the New York Times.\nThere also is nothing in the CARES Act, the massive relief program that includes the payments, that protects them from private debt collectors. A debt collector must have a court judgment that allows them to come after that money, unless a state has opted to put a law in place to protect it.\nBE AWARE\nAdditionally, the IRS is urging people to be on the lookout for any scams related to the economic impact payments.\nThe IRS will not call, text, email or contact people via social media asking for personal or bank account information ever. It also warns taxpayers to watch out for emails with attachments or links claiming to have special information about economic impact payments or refunds.", "url": "https://apnews.com/61b3d38360745d64a98a2ab813501b13"}