{"authors": ["Opinion David A. Andelman"], "date_download": "2020-05-04 16:34:17", "date_modify": "2020-05-04 16:34:17", "date_publish": "2020-04-08 02:59:11", "description": "David A. Andelman writes about his experience self-isolating in the already remote parts of rural Pennsylvania. With food delivery services nearly unavailable, he's had to turn to alternatives -- like ordering prepared meals online that are delivered in ice.", "filename": "2020_04_07_opinions_covid-1_623911bb014381f7d4bac13502496931_index_1588610057.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406161505-natoora-fresh-produce-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_opinions_covid-1_623911bb014381f7d4bac13502496931_index_1588610057.html", "title": "Surviving Covid-19 in the back of beyond", "title_page": "Surviving covid-19 in the back of beyond - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "David A. Andelman, Executive Director of The RedLines Project, is a contributor to CNN where his columns won the Deadline Club Award for Best Opinion Writing. Author of \" A Shattered Peace: Versailles 1919 and the Price We Pay Today ,\" and the forthcoming \"A Red Line in the Sand: Diplomacy, Strategy and a History of Wars That Almost Happened,\" he was formerly a foreign correspondent for The New York Times and CBS News in Europe and Asia. Follow him on Twitter @DavidAndelman . The views expressed in this commentary are his own. View more opinion on CNN.\nCanadensis, Pennsylvania (CNN) America has never really been forced to consider how to feed itself in a rigorous stay-at-home regime. As I am 75 with lifelong asthma, it's something I've suddenly been taking very seriously. I live in a rural area far outside any major city, and this has not been very easy.\nI've managed to survive a host of wars, revolutions and terrorism on four continents in my career as a foreign correspondent. But now, in a stay-at-home era, I am lacking in many options that won't expose my wife and I or others to mortal dangers.\nThere's no Peapod or UberEats or GrubHub out here. Lots of basic goods -- but no fresh meat, milk or veggies -- come to us by Amazon, which drops them off at our local post office, which has quickly become a paragon of social distancing. A stray pizza delivery, perhaps, but that's it. And, it seems, the same situation is happening in a vast number of ZIP codes across the country.\nBut then we discovered Fresh n' Lean , which is able to deliver delicious meals, ready-to-heat in ice pack-lined boxes via FedEx. It's all very tasty, and one of several meal delivery services, like Nurture Life . Based in Anaheim, California, and the brainchild of Laureen Asseo, it actually pre-dates the pandemic by 10 years. Still, lately she's been doing a lot of thinking about how America can feed itself -- safely.\nAsseo believes that the safest way to get food and products in general is through delivery services.\n\"Especially right now, where you can't really trust the other people in your community to take safety precautions when they go out.\" So, not surprisingly, she says her output has surged from 50,000 to 100,000 meals a week two months ago to 250,000 meals. She has a capacity right now of 750,00 meals. And we are enjoying them. Our first night was lemon sautéed cauliflower with quinoa and shrimp (lots of shrimp), then there was curried black eyed peas with beef, pesto bowl with mahi mahi, Spanish kale with beef and squash.\nMy huge fear, however, is that if this pandemic intensifies and quarantining continues, will there be any food to be had at all? How likely is it that food chains will break down utterly, farmers unable to harvest or get their food to market? As CNN has reported , if farmers can't find enough workers or if their farming practices are disrupted because of the pandemic, Americans could have less or pricier food this summer. And because international farmers and their supply chains face similar problems, America could receive fewer food imports, potentially limiting supply and driving up prices.\nAsseo has long-term contracts, she says, with farmers and wholesalers across the West and Midwest, buying out entire crops of some farmers to assure supplies. So, she's not worried. But I am.\nMy wife, Pamela, is already planning our vegetable garden -- tomatoes, zucchini, cucumbers and lots of herbs. Still, given the short Pennsylvania growing season (it's April and temperatures still drop to the 30s at night), the harvest is a long way off. Our local farmer seems to have disappeared and has not even begun laying in a crop for this year. But his former planting partner began taking precautions years ago -- an AK-47 and a brace of shotguns, believing, he's told me, that he may have to defend his food ultimately from desperate folks coming out from the city.\nWhat's really needed is a truly nationwide food delivery system for the vast regions of this country in close proximity to a viral pandemic but utterly out of reach of deliverable foodstuffs. We consider ourselves fortunate to have the means for a Fresh n' Lean. But so very many others do not. In Paris, where my son is still able to find fresh meat and produce down the block for his family, there are still some immediate rumblings. The leading French daily, Le Monde, on Tuesday had a major front page headline : \"Coronavirus: European agriculture paralyzed,\" remarking that closing Europe's national frontiers to ward off spread of the pandemic was freezing the broad availability of food, only confirming my own deepest fears.\nRacing out to our secluded cabin-in-the-woods in what I thought was remote northeastern Pennsylvania, I discovered the virus was following me out here. Scores of New Yorkers were booking summer vacation cabins within a few miles of us, together with clueless locals, while following few of the concepts of social distancing that could keep us safe. So, my goal out here is to become as self-sufficient as possible. Our plan is for a foray once every three weeks to Lewis's, our local market where shoppers wander at will, largely unmasked -- and getting there at 8 a.m. when it opens to help avoid the crowds. For anything fresh or perishable, it's really the only alternative.\nI'm also doing my level best to become self-sufficient in medical terms, should all our efforts prove futile. The last thing I want is to go to the local emergency room and risk exposure, since Monroe County itself is becoming a small hotspot of its own. In fact, with our New York license plates, will we even be welcomed into our local hospital parking lot?\nWhen we first arrived here a month ago and in repeated tries ever since, there were no thermometers available anywhere. But then we found Kinsa which will not only ship a thermometer but its app will tie you into a nationwide network of millions that are monitoring the nationwide spread of fever -- and possibly Covid-19. Then I decided to secure medical gear. My pulmonologist prescribed a nebulizer for albuterol, then an oxygen concentrator to deliver pure oxygen if my lungs get compromised, finally a BiPAP machine, normally for sleep apnea but which can in a pinch force air into blocked lungs.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nA beautiful spring is beginning to blossom out here in northeastern Pennsylvania. There's been a lot of rain, so the stream behind our house is roaring. The pair of eastern phoebes that nest under our eaves are back and diligently constructing a new nest. Their eggs should be hatching soon. The forsythias are in full bloom and the daffodils are just beginning to open their brilliant yellow petals. The trees are starting to bud (which doesn't help my asthma, sadly).\nBut President Donald Trump suggests that this is wartime. If this is wartime, and our government is doing little to help, it's each man or woman very much for him- or herself or their family. That's where we find ourselves this spring, barricaded, in fear, but with hope for our future.", "url": "https://www.cnn.com/2020/04/07/opinions/covid-19-rural-areas-preparation-andelman/index.html"}