{"authors": ["Alan Suderman"], "date_download": "2020-05-04 20:19:59", "date_modify": "2020-05-04 20:19:59", "date_publish": "2020-04-09 05:14:21", "description": "RICHMOND, Va. (AP) — Virginia Gov. Ralph Northam and his top aides were having a meeting about the coronavirus when the discussion turned to neckties. The governor said he had read a study...", "filename": "_0b335429ba647cfe0b648ade1909f8ff_1588623599.html", "image_url": "https://storage.googleapis.com/afs-prod/media/0b2f0359fb1e444cbbeca16e2daa8835/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0b335429ba647cfe0b648ade1909f8ff_1588623599.html", "title": "Nation's only doctor governor offers sober voice on virus", "title_page": "Nation's only doctor governor offers sober voice on virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Virginia Gov. Ralph Northam gestures during a news conference at the Capitol Wednesday April 8, 2020, in Richmond, Va. Northam gave an update on his COVID-19 plans. (AP Photo/Steve Helber)\nVirginia Gov. Ralph Northam gestures during a news conference at the Capitol Wednesday April 8, 2020, in Richmond, Va. Northam gave an update on his COVID-19 plans. (AP Photo/Steve Helber)\nRICHMOND, Va. (AP) — Virginia Gov. Ralph Northam and his top aides were having a meeting about the coronavirus when the discussion turned to neckties.\nThe governor said he had read a study in a medical journal showing that ties worn by doctors at hospitals can host harmful germs and help spread disease. So Northam issued an informal edict to his staff: Keep the ties in the closet until further notice.\n“It was symbolic that we were going to pay attention to every detail as we try to prevent the spread of this pandemic,” said Virginia Secretary of Health and Human Resources Daniel Carey, who was at the meeting.\nAs the Trump administration has offered mixed messages on the virus, governors have become increasingly important in battling the disease. But only one of them is a doctor. Northam, a pediatric neurologist, has emerged as a sober voice of authority cautioning that daily life will probably be disrupted for months.\nVirginia has fewer infections than other states, and other governors have been more aggressive in ordering businesses closed and other social distancing measures. But Northam was one of the first to cancel the school year, and he issued one of the nation’s longest stay-at-home orders, which currently extends until June.\nIn a recent interview with The Associated Press, the governor said he’s relied heavily on his medical training and a fact-based approach in making those decisions, and he criticized the Trump administration’s messaging as too often “aspirational.” Northam said he tries to treat the public as he would a patient.\n“If someone comes in and has a life-threatening brain tumor, they don’t want me to sit there and say, ’You know what, it’s going to be OK,’” Northam said. “People want the truth.”\nWith healthy popularity ratings, he has largely bounced back from a scandal last year involving a racist yearbook photo that nearly ended his political career. Secretary of Finance Aubrey Layne said one reason for those struggles was Northam’s cerebral approach and lack of political guile.\n“What served him not so good a year ago is serving him well now,” Layne said. “I’ve very, very comforted that he is a physician.”\nAs an Army doctor, Northam treated wounded soldiers during the first Gulf War in Germany, including a 45-day stretch where he “basically lived” at a hospital. He later established a private pediatric practice, taught at medical school and volunteered at a hospice where he comforted parents of dying children.\nNortham has largely avoided the national spotlight sought by some other governors. But his calm bedside manner at regular news conferences — sometimes watched live by thousands on social media and TV — contrasts sharply with President Donald Trump’s often pugilistic approach.\nWhile discussing the desperate need for supplies at a recent news conference, the governor methodically listed all the resources a single coronovirus patient in the ICU would use in terms of staff — nurses, an attending physician, a cardiologist, a pulmonologist, an infectious disease specialist, a respirator therapist, a pharmacist and technicians to administer IVs and X-rays. The same patient would also require about about 240 items of protective equipment.\nNortham meets with the state’s medical experts every morning to get briefed on latest data about the virus’ effects in Virginia. Staff said the discussions can often be quite technical, particularly around how to incorporate state-level data into models predicting the outbreak’s severity.\nState Health Commissioner Dr. Norman Oliver said some conversations have lasted more than hour and that Northam is careful to take in several different opinions before making big decisions around closing businesses and schools. Oliver said it’s reassuring that Northam is able to quickly grasp the complicated science of the pandemic.\n“It’s not something you wish for, but if it’s going to happen, we were fortunate enough to have someone who has got an understanding of what this can mean and how we need to respond to it,” Oliver said.\nFull Coverage: Virus Outbreak\nThe governor has faced criticism from state lawmakers both for being too aggressive and not aggressive enough. He has also sparred with Liberty University President Jerry Falwell Jr., who has characterized concerns about the virus as overblown and been reluctant to close the school. But for the most part, the criticism has been muted.\n“It’s probably a good thing to have a doctor in there right now,” GOP Sen. Richard Stuart said.\nLike many governors, Northam’s legacy could be defined by his response to the virus. He said his goal is project calm and empathy, just as he would when counseling a patient.\n“Doctors are trained to save lives and to be out there and take action,” Northam said. “And so I’m just doing it at a different level right now.”\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/0b335429ba647cfe0b648ade1909f8ff"}