{"authors": ["Tami Luhby"], "date_download": "2020-05-04 16:58:39", "date_modify": "2020-05-04 16:58:39", "date_publish": "2020-04-09 14:15:03", "description": "Millions of low-income children who can no longer get free meals at school because of the coronavirus crisis have yet to receive additional federal assistance promised to them by Congress.", "filename": "2020_04_09_politics_school-_38d5bab19c41495c20088680dfc367b5_index_1588611519.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408183816-children-school-meals-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_school-_38d5bab19c41495c20088680dfc367b5_index_1588611519.html", "title": "Millions of low-income children are still waiting for federal food aid", "title_page": "SNAP benefits: Millions of low-income children are still waiting for federal food aid - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Millions of low-income children who can no longer get free meals at school because of the coronavirus crisis have yet to receive additional federal assistance promised to them by Congress .\nLawmakers included several provisions to help needy families obtain more food in their second coronavirus stimulus package that passed weeks ago -- before the historic $2.2 trillion relief package that passed at the end of March.\nThe federal Department of Agriculture acted on many of the measures, including making it easier for kids whose schools have closed to pick up meals, providing additional funds to many food stamp recipients and suspending work requirements for certain adults who receive food stamps.\nHowever, the department only on Thursday approved the first state plan to give low-income families money in place of the meals their children would have received in school for free or a reduced price. This provision, called Pandemic EBT, comes to about $114 a month per child, which is the value of a free breakfast and lunch for five school days a week.\n\"We need to get these benefits to households so that they are not experiencing hunger or food insecurity,\" said Crystal FitzSimons, director of school programs at the Food Research & Action Center. \"This needs to get moving.\"\n22 million children in need\nSome 22 million children eat a free or reduced-price lunch at school each day, on average. While districts are trying to provide alternative arrangements, it's only reaching a small percentage of those in need, FitzSimons said.\nThe department is working with states and will start approving their plans this week, Brandon Lipps, deputy under secretary at the USDA, said Wednesday. It announced the next day that Michigan, which has nearly 750,000 kids in the school meals program, received approval.\nBut even once it does, state agencies face multiple challenges in getting the funds to the families, particularly those not already in the Supplemental Nutrition Assistance Program, or SNAP, the formal name for food stamps. The hurdles include identifying all the eligible children in these households and broadening state electronic benefits transfer systems to incorporate them.\nIn Virginia, there are about 600,000 children in the school meals program, about half of whom are in families who aren't enrolled in food stamps, said Duke Storen commissioner of the Department of Social Services. The agency is waiting to hear from the USDA if it can provide the funding first to children already receiving food stamps, which would be fairly easy since their families already have EBT cards, he said.\nBut it will be at least three weeks before the state has enough cards for the remaining households. Storen had floated the idea of giving them gift cards to use at grocery stores, but the department rejected it.\nHe's concerned about the delays to implementing the new program.\n\"Giving households more money to spend at the grocery store is our best policy option to be able to maintain social distancing and prevent people from going hungry,\" he said.\nDiane Sullivan is hoping to receive her additional funds soon. The mother of two sons in high school, as well as two older daughters, said she needs the money to buy more food.\n\"It is going to help me do some stockpiling that I would otherwise not be able to do,\" said the Medford, Massachusetts, resident who is an anti-hunger advocate. \"I won't have to spend my rent on food. And it will keep me and my family safe by not only keeping us fed but keeping me out of the grocery store.\"\nMore help in the next stimulus package?\nThe second stimulus package, named the Families First Coronavirus Response Act, contained several measures to boost federal nutrition assistance, including allowing states to temporarily increase families' food stamps benefits up to the maximum allowed based on their household size.\nThe USDA plans to distribute $1.7 billion in this additional funding in coming days and weeks, Lipps said.\nPlus, the act allows states to make it easier to sign up for and remain in the program. Enrollment is expected to soar as millions of Americans lose their jobs as businesses shutter their doors amid the pandemic.\nAnd the act, along with the third stimulus package, funneled $850 million to The Emergency Food Assistance Program, which supplies food banks and pantries, who are seeing a surge in clients.\nMore, however, is needed, advocates say. They support House Speaker Nancy Pelosi and Senate Minority Leader Chuck Schumer's call to increase the maximum food stamp benefits by 15% in the upcoming fourth stimulus package. That would add about $25 to each recipient's monthly allotment, on average.\nAlso, Senate Democrats want to raise the minimum monthly benefit to $30, instead of $16, noting that senior citizens and the disabled are the most common recipients.\nSome 37.2 million Americans received food stamps in December, the latest data available. The average monthly household allotment was $256 in fiscal 2018.\nIt's critical for Congress to boost SNAP benefits at this time, said Lisa Davis, senior vice president at Share Our Strength's No Kid Hungry campaign.\n\"When it comes to helping families weather the economic impacts that the coronavirus has had, SNAP is the first responder,\" she said. \"There is no more important and effective way of getting resources to families to buy food and to stimulate the economy than SNAP.\"", "url": "https://www.cnn.com/2020/04/09/politics/school-children-federal-food-aid-covid-crisis/index.html"}