{"authors": ["Analysis Ronald Brownstein"], "date_download": "2020-05-04 16:26:39", "date_modify": "2020-05-04 16:26:39", "date_publish": "2020-04-07 10:06:25", "description": "There's a potential political time bomb ticking for President Donald Trump in the public reaction to his handling of the coronavirus pandemic.", "filename": "2020_04_07_politics_2020-el_9a7564c70beef74fff29cfccecd3bc4e_index_1588609599.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200318121551-02-trump-coronavirus-presser-0318-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_2020-el_9a7564c70beef74fff29cfccecd3bc4e_index_1588609599.html", "title": "2020 Election: Why public approval of Trump's pandemic response may not save him in November", "title_page": "2020 Election: Why public approval of Trump's pandemic response may not save him in November - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Polls now consistently show that almost exactly half of Americans approve of how Trump is handling the outbreak . That's a strikingly solid showing for him given the enormous toll on American life and the widespread and urgent complaints from front-line public health and medical personnel about critical shortages in tests and equipment.\nYet surveys simultaneously show that a lopsided majority of Americans believe he mishandled the outbreak's early stages and failed to mobilize quickly enough against the threat.\nThose paradoxical twin verdicts leave Trump standing on a cracked political foundation when it comes to his re-election. Republicans hope that if the outbreak recedes by this fall, the public will credit Trump with steering the country through the most dangerous waters and reward him in November with another term in office. But many experts believe even if the worst has passed by Election Day, the sense that Trump mishandled the outbreak's initial stages could leave him vulnerable to a judgment that he compounded the problem.\n\"It will not merely be the case of 'Did he see us through this?'\" predicts Duke University political scientist Peter Feaver, who served as a special adviser for strategic planning on the National Security Council under President George W. Bush. \"What will also matter is: 'Did he get us into this, through stumbles, acts of omission and commission?'\"\nPut another way, the political impact of the outbreak may turn not only on how much damage the country suffers in the coming months, but also on whether Americans conclude that Trump's choices minimized or magnified those costs. \"If the Democrats can make a credible case that we ended up in the pandemic through mismanagement, or that a problem that could have been moderate-sized became major-sized because we were slow to act and minimizing the problem, the attack ads write themselves,\" says Feaver. \"If that message sinks in, the public could simultaneously say, 'the President finally figured out to how to beat this, but he got us into it in the first place.'\"\nFlat-footed or caught off-guard?\nAgainst that backdrop, a pivotal question may be whether \"Americans perceive the administration as having been uniquely flat-footed versus all of us being caught off-guard by a lack of information,\" says Republican pollster Kristen Soltis Anderson, a co-founder of the firm Echelon Insights, which recently released a national survey on attitudes about the outbreak.\nYet Matthew Baum, a professor of global communications at Harvard's John F. Kennedy School who has studied public attitudes toward presidents in moments of crisis, says that despite all that, \"it would have been amazing\" if Trump had not received some boost in public opinion as the outbreak exploded.\n\"When people are really worried, in big national crises, people look to the president as the parental figure and they expect the president as the national leader to guide them through it, and protect them and take care of them, so they start with a presumption that he will do that,\" Baum said. \"This is, safe to say, the biggest crisis we've had since World War II, and the notion of there not being any rally behind the president would have been incredible.\"\nBut Baum notes that the \"rally effect\" around Trump has been much smaller than the job approval gains for earlier presidents at big moments, such as George H.W. Bush at the start of the first Iraq War or even the invasion of Panama, much less George W. Bush after the September 11 terrorist attacks. Similarly, while international polling has shown that the tendency to \"rally 'round the flag\" at times of crisis has boosted the approval ratings of almost all leaders across the Western world, Trump's gains have fallen at the lower end of that spectrum. Looking both historically and internationally, Baum says, \"it's pretty telling that [Trump's rise] is as small as it is.\"\nStill, any gain in job approval for Trump is potentially critical for his hopes of reelection. Most experts agree he has a much better chance of winning reelection with an approval rating in the 46% or more range, where it has settled in many surveys since mid-March, than in the lower 40s, where it has languished through much of his presidency.\nPolls have consistently shown approval of Trump on coronavirus\nIn almost all of these surveys, the share of voters who approve of Trump's overall performance as President, while also edging up, lags a few points behind the portion who approve of his response to the virus. Another consistent trend: all of the national polls that measured 2020 matchups still show him trailing former Vice President Joe Biden, the likely Democratic nominee, by margins ranging from as little as two percentage points (in ABC/Washington Post ) to nine ( in a mid-March Fox News survey ).\nThe gap between Trump's approval on the virus and his overall standing \"is probably driven by folks who may not like the tweets or the general way that he conducts himself in normal circumstances but at this point are giving him the benefit of the doubt on the virus,\" says Anderson, the GOP pollster. \"They are thinking he's listening to...his experts and that's what they want him to do, so even if they haven't changed their mind on him as a person and they haven't changed their vote, they are willing to say he's doing an ok job on this.\"\nThe danger for Trump is that even as about half of Americans grant him that acceptable grade, a majority also say they believe he was slow to act in the outbreak's initial stages. In the ABC/Washington Post Poll, less than two-fifths of those surveyed said Trump \"acted with the right amount of speed\" while nearly three-fifths said he was \"too slow to take action.\" A CBS survey in late March similarly found that two-thirds of Americans felt the administration was unprepared to handle the outbreak when it began.\nMargie Omero a pollster at the Democratic firm GBAO -- which conducts the daily Navigator poll with Global Strategy Group -- says that she's seen similar findings. \"If you look at all the concerns and worries that people have about the response, we see consistently that...the top worry is by not acting quickly we are now in worse shape,\" Omero says.\nAnderson believes Americans will ultimately weigh those concerns about Trump's actions at the outbreak's beginning through the lens of their experience at its end. She thinks Americans are effectively viewing the crisis in three distinct phases: \"what happened early on, what is happening now and how this is all going to resolve itself.\" And the public, she says, might reach distinct judgments on Trump's performance in each phase.\nWhile \"voters are saying they don't love that first phase\" of Trump's performance, she argues, it hasn't hurt his overall approval because Americans believe the magnitude of the threat surprised everyone. \"That's why you see that generous 'we were all caught off guard' sentiment on the first phase,\" Anderson says. Conversely, the reason why the generally positive marks for his recent responses \"has not moved his ballot numbers\" is because Americans are so deeply uncertain how much damage the country will ultimately absorb, both economically and in public health. \"We are so far from the end of all this and knowing how this resolves,\" she says. \"That's why people have not begun changing in any permanent way their posture on him and their vote process because we don't know how this movie ends.\"\nMoving the goalposts\nOver the past week, Trump at his daily press briefings conspicuously sought to redefine success against the virus as holding the death toll to a level between 100,000 and 240,000. That's a sharp reversal from his repeated promises through February and early March that the virus would pose only a minimal risk to America. \"The 15 [cases] within a couple of days is going to be down to close to zero, that's a pretty good job we've done,\" he said on February 26.\nAlmost all experts agree that after such repeated reassurances, Trump will face a tough task convincing Americans to view anything approaching a six-figure death toll as success -- despite his repeated suggestion that even that would be better than the millions who might have died had he done nothing. \"It's hard to sustain that sort of diversion from your own words, especially in a presidential election, when there is going to be $1 billion spent on the airwaves in all the places where there are persuadable voters,\" reminding them of Trump's earlier words, Baum notes.\nFeaver, who helped Bush sell his national security policies from the White House, agrees. After the US invasion failed to find the promised weapons of mass destruction in Iraq, he notes, Bush could not convince the public to redefine success as establishing a democracy in that distant country. \"You can't switch the messaging that abruptly or drastically,\" Feaver says. \"It's a pretty dramatic movement of the goal posts and I'd be surprised if Trump pulls it off.\"\nOmero argues that Trump's efforts to define that many deaths as a success, rather than insulating him from political consequences, might actually compound his risks. She believes that to many voters Trump's new language will reinforce their concerns that through this challenge he's been too erratic and overly concerned about his personal political interests rather than the national interest, for instance through his repeated sparring with Democratic governors. \"His moving of the goalposts,\" Omero says, could \"reinforce the disadvantages he already has.\"\nAs America faces a potentially unprecedented domestic death toll, the political situation facing Trump may echo those confronting other presidents during wartime. In classic research on the Korean and Vietnam wars, several political scientists found that public support for those wars, and the presidents pursuing them, declined as casualties increased. In the 2009 book \"Paying the Human Costs of War,\" Feaver and two colleagues qualified that research to argue that in fact, the public is much more tolerant of casualties when it believes that launching the war was the right decision and that the US is headed toward success, than if it concludes the war effort is doomed to fail.\nThat means the casualty level alone typically doesn't decide a president's fate in war-time, Feaver maintains. Instead, presidents face not only a \"prospective\" judgment about whether they will win the war but a \"retrospective\" verdict on whether launching the war was the right choice at all. The equivalent in November, he says, might be a division between a \"prospective\" judgment that the nation is heading out of the coronavirus ordeal and a \"retrospective\" judgment that Trump compounded the problem by initially reacting too slowly and downplaying the problem.\nFeaver says in that way the 2020 election could have similarities to the 1944 contest, when victory was in sight in World War II, but months of hard fighting remained. Just like President Franklin Roosevelt then, he says, Trump this fall could argue that, with the conflict's toughest days behind us, the nation should not \"change horses\" at this point. Roosevelt won that argument (and reelection), but Trump's vulnerability over his early actions will hinder his ability to make the same case, Feaver predicts.\n\"We could well be in a similar position: where the Trump argument is: 'we are finally getting the handle on this, do you really want the disruption of a change in administration?'\" Feaver says. \"The answer to that, I think, hinges heavily on whether the President can win the retrospective judgment on, 'Were you the one who got us into this mess in the first place?'\"", "url": "https://www.cnn.com/2020/04/07/politics/2020-election-trump-approval-covid-pandemic/index.html"}