{"authors": ["Sarah Mucha"], "date_download": "2020-05-04 16:20:24", "date_modify": "2020-05-04 16:20:24", "date_publish": "2020-04-05 14:32:00", "description": "Former Vice President Joe Biden said the Democratic National Convention, which has already been pushed back from July to August, may have to go virtual if the coronavirus continues as a public health threat into the summer.", "filename": "2020_04_05_politics_joe-bid_55ea8ce08201d94710317f236a35088c_index_1588609224.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200318131928-joe-biden-delantera-sanders-carrera-democrata-presidente-juan-carlos-lopez-pkg-00001418-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_joe-bid_55ea8ce08201d94710317f236a35088c_index_1588609224.html", "title": "Joe Biden says Democrats 'should be thinking about' holding a virtual summer convention", "title_page": "Joe Biden says Democrats 'should be thinking about' holding a virtual summer convention - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Former Vice President Joe Biden said the Democratic National Convention, which has already been pushed back from July to August, may have to go virtual if the coronavirus continues as a public health threat into the summer.\n\"We may have to do a virtual convention. I think we should be thinking about that right now. The idea of holding the convention is going to be necessary. We may not be able to put 10, 20, 30,000 people in one place,\" he said in an interview Sunday morning with George Stephanopoulos on ABC's \"This Week.\"\nBiden added that how the convention is held depends on whether the public health threat of the coronavirus has been mitigated by that time. \"Again let's see where it is,\" the former vice president said. \"And what we do between now and then is going to dictate a lot of that as well. But my point is that I think you just got to follow the science.\"\nThe comments from the party's front-runner for the nomination come a day after the Democratic National Committee announced its decision to postpone the convention. Biden currently holds a sizable delegate lead over Vermont Sen. Bernie Sanders in the nomination fight. Both campaigns supported the decision to move the convention, a Democratic official told CNN.\nRead More", "url": "https://www.cnn.com/2020/04/05/politics/joe-biden-democratic-national-convention-virtual/index.html"}