{"authors": ["Trends Reporter"], "date_download": "2020-05-04 21:09:09", "date_modify": "2020-05-04 21:09:09", "date_publish": "2020-05-01 01:30:36", "description": "The president said he had \"evidence\" of a coronavirus-related conspiracy theory, then dissed his own acting intelligence director for casting doubt on it.", "filename": "entry_richard-grenell-trump-covid-19-china_n_5eab5187c5b6995f13fe4667_1588626549.html", "image_url": "https://img.huffingtonpost.com/asset/5eab64bf300000fa121553a5.jpeg?cache=p2ocjgltdp&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_richard-grenell-trump-covid-19-china_n_5eab5187c5b6995f13fe4667_1588626549.html", "title": "Trump Slights Intelligence Boss For Undermining China COVID-19 Theory", "title_page": "Trump Slights Intelligence Boss For Undermining China COVID-19 Theory | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "President Donald Trump claimed Thursday to have seen secret evidence linking the origins of COVID-19 to a laboratory in China — and disdainfully dismissed an apparently contradictory statement from his own acting intelligence director.\nTrump insisted at his press briefing that he had information he could not reveal that the Wuhan Institute of Virology was linked to the outbreak of COVID-19. “I can’t tell you” details, he told reporters, adding that he was “not allowed” to do so.\nBut Fox News reporter John Roberts challenged Trump, pointing to a statement earlier in the day from the office of Acting Director of National Intelligence Richard Grenell that seemed to undermine the president’s statement. “The Intelligence Community ... concurs with the wide scientific consensus that the COVID-19 virus was not manmade or genetically modified,” the statement read.\nThe statement did say an investigation would determine if the coronavirus outbreak began as a “lab accident” — or through human contact with infected animals at a wet market, as most scientists believe. There was no mention of any evidence to support the lab theory.\nGrenell’s office issued the statement a day after The New York Times reported that the Trump administration was pushing the intelligence community to reach a conclusion blaming China.\nTrump asked Roberts who had written the intelligence community statement, but before the journalist could answer, the president added dismissively: “Oh, he would know that, huh?”\nRoberts responded: “That would be your director of national intelligence.” Grenell is a Trump loyalist whom the president named to the post in late February.\n“You’d have to tell me who specifically, who made the statement,” Trump insisted.\nRoberts repeated that it was from the Office of the Director of National Intelligence.\n“I haven’t seen the statement,” Trump replied.\nJOHN ROBERTS: The Director of National Intelligence put out a statement saying they think the coronavirus was naturally occurring\nTRUMP: Who?\nR: It was a statement from the DNI office\nTRUMP: Oh, he would know that, huh?\nR: That would be your Director of National Intelligence pic.twitter.com/ihBTp9HxVe — Aaron Rupar (@atrupar) April 30, 2020\nTrump has railed against China for weeks for what he claims was the nation’s delay in alerting the world to the dangers of COVID-19. But he has also hinted more ominously that the virus may have been cooked up in a lab, echoing a right-wing conspiracy theory. Secretary of State Mike Pompeo has accused China of “hiding” something.\nThe first coronavirus cases likely emerged in China in December. The Chinese government informed the World Health Organization of the growing problem on Dec. 31, and the WHO — another target of Trump’s criticism — in turn alerted the global community.\nTrump praised the Chinese government’s handling of the coronavirus at least 15 times throughout February. On Feb. 28, he said the number of COVID-19 cases that had been reported in the U.S. at that time would quickly “go down close to zero.” There are now more than 1 million confirmed cases of COVID-19 in America.\nJust had a long and very good conversation by phone with President Xi of China. He is strong, sharp and powerfully focused on leading the counterattack on the Coronavirus. He feels they are doing very well, even building hospitals in a matter of only days. Nothing is easy, but... — Donald J. Trump (@realDonaldTrump) February 7, 2020\n“I think that the World Health Organization should be ashamed of themselves because they’re like the public relations agency for China,” Trump said Thursday.\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/richard-grenell-trump-covid-19-china_n_5eab5187c5b6995f13fe4667"}