{"authors": ["Ashley Strickland"], "date_download": "2020-05-04 16:03:38", "date_modify": "2020-05-04 16:03:38", "date_publish": "2020-04-01 20:21:01", "description": "For the first time since the final space shuttle mission in 2011, astronauts will launch into space aboard an American rocket and spacecraft from American soil, according to NASA.", "filename": "2020_04_01_world_nasa-spacex-crew-dragon-launch-scn_index_1588608218.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401161010-01-nasa-spacex-demo-2-mission-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_world_nasa-spacex-crew-dragon-launch-scn_index_1588608218.html", "title": "NASA and SpaceX prepare to launch astronauts from the US again", "title_page": "NASA and SpaceX prepare to launch astronauts from the US again - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) For the first time since the final space shuttle mission in 2011, astronauts will launch into space aboard an American rocket and spacecraft from American soil, according to NASA.\nThe agency, along with SpaceX, is eyeing a mid-to-late May launch for the manned SpaceX Demo-2 flight test from Kennedy Space Center in Florida. Since the last shuttle mission in July 2011, crews launching to the International Space Station have been conducted from Baikonur in Russia aboard the Russian Soyuz spacecraft.\nThe agency is monitoring CDC guidance with regards to mission planning amid the coronavirus pandemic, they said. The launch date could be postponed. All NASA centers are currently operating with non-mission-essential work occurring remotely, which limits employee contact with the crew, according to the agency.\nBut for now, things are going according to plan. NASA astronauts Doug Hurley and Bob Behnken are expected to be on the May flight test in SpaceX's Crew Dragon spacecraft on top of a Falcon 9 rocket. It is the final flight test of the system before SpaceX is certified to carry out operational crew flights to and from the space station for NASA, the agency said.\nHurley and Behnken have been practicing in a Crew Dragon simulator over the last few months. Flight control teams for NASA and SpaceX in Florida, Texas and California have also been simulating different aspects of the mission to practice ahead of the Demo-2 launch.\nRead More", "url": "https://www.cnn.com/2020/04/01/world/nasa-spacex-crew-dragon-launch-scn/index.html"}