{"authors": ["Reporter"], "date_download": "2020-05-04 20:23:14", "date_modify": "2020-05-04 20:23:14", "date_publish": "2020-04-30 02:47:26", "description": "The nation's second-largest city will provide free COVID-19 testing to all 10 million residents of Los Angeles County, including those who don't appear t...", "filename": "entry_los-angeles-free-coronavirus-testing-all-residents_n_5eaa372dc5b633a854451bd9_1588623794.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa3a0f2500003111eb0978.jpeg?cache=6f1667r3ln&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_los-angeles-free-coronavirus-testing-all-residents_n_5eaa372dc5b633a854451bd9_1588623794.html", "title": "Los Angeles Offers Free Coronavirus Testing For All Residents", "title_page": "Los Angeles Offers Free Coronavirus Testing For All Residents | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Los Angeles is now offering free coronavirus testing to all residents of the nation’s second-largest city, including people who don’t have symptoms.\nLos Angeles Mayor Eric Garcetti announced Wednesday that all 10 million residents of Los Angeles County can now get tested for COVID-19, the disease caused by the virus. The city has partnered with Los Angeles County and with Community Organized Relief Effort (CORE) to provide the testing to residents regardless of whether they are experiencing COVID-19 symptoms.\n“Priority for the same or next day testing is still given to people with symptoms, such as fever, cough, and shortness of breath,” the city’s coronavirus testing webpage said. “Testing is also prioritized for certain critical front-line workers who interact with the public while working.”\nAnnouncing that L.A. is now the first major city in America to offer free COVID-19 testing to all residents. While priority will still be given to those with symptoms, individuals without symptoms can also be tested. Sign up at https://t.co/rHWABmXUEl. pic.twitter.com/TYqo6Bzwxe — MayorOfLA (@MayorOfLA) April 30, 2020\nPreviously, testing was provided only to residents with symptoms and to essential workers and people in institutional environments such as hospitals and nursing homes.\nHealth experts have said that increased testing is necessary to better understand how many people have the virus, which could then help government officials decide when and how to phase out stay-at-home orders.\nTesting is by appointment only, and residents can schedule an appointment on the city’s coronavirus website. L.A. County had 35 testing sites as of April 21, according to the Los Angeles Times.\nOn Wednesday, county health officials announced the largest number of new coronavirus cases reported in a single day at 1,541, bringing the county’s total infections past 22,400. Public Health Department Director Barbara Ferrer said the increase is mostly due to the increased testing on top of the trend of lower numbers during weekends.", "url": "https://www.huffpost.com/entry/los-angeles-free-coronavirus-testing-all-residents_n_5eaa372dc5b633a854451bd9"}