{"authors": ["Holly Ramer"], "date_download": "2020-05-04 20:23:32", "date_modify": "2020-05-04 20:23:32", "date_publish": "2020-04-20 15:41:08", "description": "CONCORD, N.H. (AP) — A judge is considering whether Republican Gov. Chris Sununu can spend New Hampshire’s $1.25 billion in coronavirus relief aid without legislative approval. The...", "filename": "_dbbb4b7423cb315c54a6ececcd5a04fc_1588623812.html", "image_url": "https://storage.googleapis.com/afs-prod/media/49e5d7436f4d40629727ee9e8f7618db/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dbbb4b7423cb315c54a6ececcd5a04fc_1588623812.html", "title": "Judge weighs spending power; hospitals detail costs", "title_page": "Judge weighs spending power; hospitals detail costs", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A sign on the front door of a culinary store lists their \"COVID-19\" business hours, with every day shown as closed, in Concord, N.H., Monday, April 20, 2020. All non-essential businesses are closed due to the virus outbreak were until May 4th. (AP Photo/Charles Krupa)\nA sign on the front door of a culinary store lists their \"COVID-19\" business hours, with every day shown as closed, in Concord, N.H., Monday, April 20, 2020. All non-essential businesses are closed due to the virus outbreak were until May 4th. (AP Photo/Charles Krupa)\nCONCORD, N.H. (AP) — A judge is considering whether Republican Gov. Chris Sununu can spend New Hampshire’s $1.25 billion in coronavirus relief aid without legislative approval.\nThe Democratic leaders of the New Hampshire House and Senate and its joint fiscal committee sued the governor last week to halt the new Governor’s Office for Emergency Relief and Recovery.\nHillsborough County Superior Court Judge David Anderson held a hearing on their request Monday, saying he will issue a ruling as quickly as possible.\nRepresenting the governor’s office, Solicitor General Dan Will pointed to a 2002 law granting the governor authority to take immediate action during a statewide crisis.\nIn court documents, Assistant Commissioner of Safety Perry Plummer described missing a chance to purchase a large supply of respirator masks because he took 10 minutes to discuss it with his colleagues, or calling suppliers back only to find that prices had gone up.\n“In many instances to wait an hour is to lose an opportunity, and in many instances, to wait 10 or 15 minutes is to lose an opportunity,” Will said. “It is a scramble.”\nDemocrats argue that the governor’s general powers under the law Sununu cites do not override a more specific law that says during an emergency, “the governor may, with the advice and consent of the fiscal committee, authorize such expenditures, by any department or agency, as may be necessary.”\nTheir attorney, Greg Silverman, said Sununu has tried to usurp the Legislature’s “power of the purse.”\n“The governor has created a false choice between saving lives and restraining the governor from overreaching,” he said. “The governor can effectively manage an emergency as well as prepare spending requests for dealing with an emergency with fiscal committee advice and consent.”\n___\nTHE NUMBERS\nAs of Monday, 1,447 people in New Hampshire had tested positive for the virus, and 42 had died.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and the infirm, it can cause more severe illness, including pneumonia, or death.\n___\nFINANCIAL FALLOUT\nOfficials representing hospitals, nursing homes, doctors and nurses told lawmakers Monday the pandemic has caused widespread financial devastation.\nAfter eliminating elective procedures and most primary care, hospitals are losing about $200 million per month in revenue, said Steve Ahnen, president of the New Hampshire Hospital Association.\nAlex Walker, chief operating officer of Catholic Medical Center, said his facility lost about $11 million in March and expects that to nearly double this month.\n“Right now, we’re waiting for a surge — it’s not come, we’re not sure it’s going to come — and that underscores this crazy, inverse relationship between public health and financial health,” he told a committee advising the Office for Emergency Relief and Recovery. “The longer this goes on financially, the worse it is for hospitals.”\nIn the nursing home sector, a recently announced $300 per week stipend for front-line workers was welcome news, but fearful staffers continue to quit, said Brendan Williams, director of the New Hampshire Health Care Association.\n“Public and policymaker accolades have been reserved for hospital workers,” he said. “The singular focus of the state has been on hospitals during this pandemic, and if that doesn’t change, nursing homes will close.”\nThe group also heard from Tom Mee, CEO of North Country Healthcare, the parent organization for critical access hospitals in the state’s poorest and most rural county.\nA number of hospitals are at risk of closing, he said, in part because even when the economy reopens, he expects lower demand for health care services because more residents will have lost insurance and there will be fewer summer tourists.\nHospitals shouldn’t even think about resuming elective procedures until everyone coming through the door can get tested, he said. One hospital in his organization recently acquired a rapid response testing machine but got enough supplies to run only 60 tests.\n“It’s as if we were given a brand new, state-of-the-art toaster, but only one loaf of bread to feed an entire community,” he said.", "url": "https://apnews.com/dbbb4b7423cb315c54a6ececcd5a04fc"}