{"authors": ["Opinion Lincoln Mitchell"], "date_download": "2020-05-04 16:24:16", "date_modify": "2020-05-04 16:24:16", "date_publish": "2020-04-06 21:12:56", "description": "Lincoln Mitchell writes that while America's federalist system of government might have some upsides with regards to things like tax policy or developing schools and universities, it does not provide the best way to respond to a pandemic.", "filename": "2020_04_06_opinions_coronav_f4172adb43703c85c45f3cafd9abf5d3_index_1588609456.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402115052-us-capitol-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_opinions_coronav_f4172adb43703c85c45f3cafd9abf5d3_index_1588609456.html", "title": "A pandemic is no time to go federal", "title_page": "A pandemic is no time to go federal - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Lincoln Mitchell teaches in the political science department at Columbia University. His most recent book is \"San Francisco Year Zero: Political Upheaval Punk Rock and a Third Place Baseball Team.\" (Rutgers University Press, 2019) Follow him on Twitter @LincolnMitchell. The opinions expressed here are his own. Read more opinion at CNN.\n(CNN) America's federalist system has always fostered political competition. By dividing power between the national government and the states, it contributes to important differences in how individual states are governed. While this might have some upsides with regards to things like tax policy or developing good schools and universities, it is not the best way to respond to a pandemic.\nLincoln Mitchell\nThe inability of our federalist system to address the spread of coronavirus and the confusion it has created was readily apparent in White House senior adviser Jared Kushner's bizarre claim that \"the notion of the federal stockpile was it's supposed to be our stockpile (of crucial medical supplies). It's not supposed to be states' stockpiles that they then use.\"\nPresident Donald Trump exacerbated this strange argument by telling a reporter: \"You know what 'our' means? United States of America. We take that -- 'our' -- and we distribute it to the states,\" adding \"because we need it for the government, we need it for the federal government.\"\nAs coronavirus infections and deaths keep rising, it has become increasingly clear that it is governors who are on the frontlines, finding ways to save American lives during the crisis. Although New York Gov. Andrew Cuomo has drawn the most attention, West Coast governors like Jay Inslee of Washington and Gavin Newsom of California, as well as J.B. Pritzker of Illinois, and several Republican governors, like Larry Hogan of Maryland and Charlie Baker of Massachusetts, were in the vanguard of implementing strong social distancing policies while trying to find ways to support and bolster public health systems in states that are being overrun by the virus.\nAmericans who are not reassured by Trump's daily press conferences and early failure to grasp the severity of the crisis are turning to a few governors for solace and for a road map out of this extraordinary moment. It is therefore tempting to be grateful for our federalist system that allows governors to take over in the absence of national leadership. However, federalism is playing a more complex and mixed role in the American response to the coronavirus. The same Constitution that allows states to have different policies on everything from LGBTQ equality to gun laws or welfare payments also allows governors, not presidents, to make the decisions about pandemic responses that most affect ordinary Americans.", "url": "https://www.cnn.com/2020/04/06/opinions/coronavirus-federalism-states-governors-mitchell-opinion/index.html"}