{"authors": ["Amanda Jackson"], "date_download": "2020-05-04 17:01:10", "date_modify": "2020-05-04 17:01:10", "date_publish": "2020-04-10 11:51:59", "description": "People all over the nation are trying to cope with the new normal of life during a pandemic. Many are dealing with health issues, unemployment, grief and facing uncertainty what the future holds.", "filename": "2020_04_10_us_disaster-hotline-call-increase-wellness-trnd_index_1588611670.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409193208-01-phone-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_disaster-hotline-call-increase-wellness-trnd_index_1588611670.html", "title": "A crisis mental-health hotline has seen an 891% spike in calls", "title_page": "A crisis mental-health hotline has seen an 891% spike in calls - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) People all over the nation are trying to cope with the new normal of life during a pandemic. Many are dealing with health issues, unemployment, grief and facing uncertainty what the future holds.\nThe Disaster Distress Helpline , a federal crisis hotline, has seen a huge spike in calls of people seeking help recently. The national helpline, ran by the at the Substance Abuse and Mental Health Services Administration (SAMHSA), provides counseling for people facing emotional distress during times of natural and human-caused disasters.\nIn March, the helpline saw a 338% increase in call volume compared with February, according to spokesperson with the agency. And compared to last year for the month of March, they had an 891% increase of calls.\nThe pandemic has disrupted normal life routines and lead people isolation as they stay home to curb the spread of the virus. During a recent press briefing, President Donald Trump addressed the mental health crisis stating that it is a big problem and people are struggling.\nAmerican workers are suffering from devastating job losses, last week another 6.6 million people filed for unemployment benefits. Over 16,000 Americans have died because of the coronavirus leaving families grieving and unable to gather due to the social-distancing guidelines.\nRead More", "url": "https://www.cnn.com/2020/04/10/us/disaster-hotline-call-increase-wellness-trnd/index.html"}