{"authors": ["Ryan Browne", "Caroline Kelly"], "date_download": "2020-05-04 16:57:53", "date_modify": "2020-05-04 16:57:53", "date_publish": "2020-04-08 23:37:17", "description": "The recently resigned acting Navy Secretary Thomas Modly's Monday trip to Guam where he addressed the crew of the USS Theodore Roosevelt and slammed their former commander, cost the Defense Department an estimated $243,000, according to a Navy official.", "filename": "2020_04_08_politics_former-navy-secretary-trip-cost_index_1588611473.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407151132-02-thomas-modly-december-2019-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_former-navy-secretary-trip-cost_index_1588611473.html", "title": "Former acting Navy secretary's trip to Guam, which led to his resignation, cost almost a quarter of a million dollars", "title_page": "Former acting Navy secretary's trip to Guam, which led to his resignation, cost almost a quarter of a million dollars - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The recently resigned acting Navy Secretary Thomas Modly's Monday trip to Guam where he addressed the crew of the USS Theodore Roosevelt and slammed their former commander, cost the Defense Department an estimated $243,000, according to a Navy official.\nModly traveled to Guam aboard a C-37B VIP aircraft a modified Gulfstream jet. It costs $6,946.19 per hour to fly and the flight time for the Guam trip was about 35 hours for a total cost of $243,151.65.\nWhile not explicitly mentioning Modly or his resignation, the Navy's top admiral, Chief of Naval Operation Adm. Mike Gilday, sent a message to the Navy on Wednesday acknowledging that \"the events of the past week have been difficult for our Navy and our nation.\"\n'Moving forward'\n\"The events of the past week have been difficult for our Navy and our nation. We will learn from them. But make no mistake, we are moving forward. The Navy has our orders and we are executing them,\" Gilday wrote.\nOn Thursday, senior Pentagon leaders defended Modly's trip.\nDeputy Defense Secretary David Norquist and Vice Chairman of the Joint Chiefs of Staff Gen. John Hyten said it was important for senior leaders to visit personnel in the field and that Modly had the ability to authorize the trip himself.\n\"As Secretary of the Navy, Tom Modly does have the authority to travel, as needed, to see the mission,\" Norquist told reporters at a Pentagon briefing. \"I think we want to be very careful to signal that senior leaders shouldn't be getting out in the field and seeing what's going on. I think it is very difficult if you are all the time in the Pentagon. So even with the challenge of the Covid virus, we are going to continue to look at ways to make sure our leadership stays engaged and informed and through the course of the year, senior leaders need to get out in the field and understand what's going on and be able to work with the forces there.\"\nHyten echoed that sentiment.\n\"If you want to know what's going on in Guam, where I'm standing right now is about the worst place to try to figure that out,\" Hyten said. \"You actually need to talk to folks in the Pacific. And eyes on is always the best way to figure out what's going on. You want to make sure, again, mission with taking care of people. But you do need to get out of the Pentagon, that's for sure.\"\nAs of Thursday, 97% of the Teddy Roosevelt's crew had been tested for coronavirus and 416 had tested positive, according to the Navy.\nNearly a week after Modly fired Crozier for too widely disseminating the memo calling for the urgent evacuation of the ship's crew, the Navy has only evacuated 2,329 of the aircraft carrier's nearly 4,800 sailors.\nThe Navy initially said that it had intended to move 2,700 sailors ashore by April 3. Officials say the process has been slowed due to testing as the government of Guam is requiring that sailors test negative before they can be moved into hotels on the island.", "url": "https://www.cnn.com/2020/04/08/politics/former-navy-secretary-trip-cost/index.html"}