{"authors": ["Brian Fung", "Cnn Business"], "date_download": "2020-05-04 16:27:43", "date_modify": "2020-05-04 16:27:43", "date_publish": "2020-04-07 18:48:31", "description": "Amazon said it may begin firing employees who \"intentionally violate\" the company's social distancing guidelines, despite complaints from workers who say the demands of their job make it impossible to comply with the policy.", "filename": "2020_04_07_tech_amazon-social-distancing-enforcement_index_1588609663.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407123124-amazon-fulfillment-center-file-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_tech_amazon-social-distancing-enforcement_index_1588609663.html", "title": "Amazon says it may fire workers who violate social distancing guidelines", "title_page": "Amazon says it may fire workers who violate social distancing guidelines - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN Business) Amazon said it may begin firing employees who \"intentionally violate\" the company's social distancing guidelines, despite complaints from workers who say the demands of their job make it impossible to comply with the policy.\nThe announcement marks the latest step by the e-commerce giant to keep its operation functioning amid a crush of demand for essential supplies. More than a dozen Amazon facilities in the United States have been hit by the coronavirus , leading to concerns about Amazon's ability to protect its front-line workers who are among the most vulnerable.\nsaid those who deliberately violate social distancing guidelines will receive up to two warnings before, in some cases, being fired. The company's guidelines call for a distance between individuals of six feet.\n\"We've had some instances of employees intentionally violating our clear guidelines on social distancing at our sites, which endangers both the individual and their colleagues,\" said Amazon spokesperson Rachael Lighty in a statement to CNN. \"On the second documented offense, termination may occur.\" The company did not provide examples of the intentional violations.\nLast week, Amazon fired a worker from its Staten Island, New York facility. The employee, Christian Smalls, had \"received multiple warnings for violating social distancing guidelines\" and was fired after attending a worker protest at the facility despite being under a 14-day quarantine, according to spokesperson Kristen Kish.\n(Smalls has told CNN that the protest, which he helped organize, was intended to persuade Amazon to close the facility for deep cleaning. He said he feels he was unfairly targeted by the company for retribution.)\nAmazon told CNN it has taken other steps to allow for social distancing, such as moving chairs and tables and staggering shifts and workstations. The company also said in a recent blog post that it has expanded daily temperature-checks at some facilities and stepped up its cleaning regimen.\nBut Mario Crippen, an employee at an Amazon facility in Romulus, Mich., told CNN that much of what workers do on the job cannot be done while social distancing.\n\"In the packing department, there are no walls, so people are really shoulder-to-shoulder,\" he said in a phone interview with CNN last week. \"And then, in the dock ... sometimes there are two people inside the truck, and they can't get away from each other. The computers they need to run the dock are right next to each other. The way stuff works, you've got to be close to get things done and get packages out.\"\nMeanwhile, a worker at Amazon's Staten Island facility said the company sent a text message to employees this week that read: \"We recommend everyone wears a facemask of some kind covering their nose and mouth from arrival through departure of your shift.\" The company has signage in the facility about picking up facemasks and how to properly use them, which features identical language, according to the worker.\nIn response, the employee — who asked not to be named for fear of retribution — expressed a disconnect over the various policies.\n\"An employee will be written up if they don't observe social distancing, but facemask usage is only recommended?\" the employee said in a message to CNN.\nAmazon declined to respond to multiple questions from CNN asking the company to explain its termination policy in light of the required working conditions described by Crippen and others.", "url": "https://www.cnn.com/2020/04/07/tech/amazon-social-distancing-enforcement/index.html"}