{"authors": ["Todd Richmond"], "date_download": "2020-05-04 20:12:41", "date_modify": "2020-05-04 20:12:41", "date_publish": "2020-04-09 19:48:15", "description": "MADISON, Wis. (AP) — Wisconsin's messy presidential primary election ended for voters, but it's far from finished for nearly 2,000 local clerks who have to guard the ballots for days before...", "filename": "_c877fa704d46edb57534b5cc59bfb241_1588623161.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ec01e1ad3c9c4435bdeef689d09d0c65/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c877fa704d46edb57534b5cc59bfb241_1588623161.html", "title": "Wisconsin clerks guarding ballots for days before counting", "title_page": "Wisconsin clerks guarding ballots for days before counting", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Voters observe social distancing guidelines as they wait in line to cast ballots at Washington High School while ignoring a stay-at-home order over the coronavirus threat to vote in the state's presidential primary election, Tuesday, April 7, 2020, in Milwaukee. (AP Photo/Morry Gash)\nVoters observe social distancing guidelines as they wait in line to cast ballots at Washington High School while ignoring a stay-at-home order over the coronavirus threat to vote in the state's presidential primary election, Tuesday, April 7, 2020, in Milwaukee. (AP Photo/Morry Gash)\nMADISON, Wis. (AP) — Wisconsin’s messy presidential primary election ended for voters, but it’s far from finished for nearly 2,000 local clerks who have to guard the ballots for days before counting can begin.\nThose clerks usually would have begun counting as soon as polls closed on election night, rushing to get their numbers to county clerks. Instead, the court fight over whether to hold the election during the coronavirus crisis resulted in a judge’s order that ballots can’t be counted until Monday afternoon.\nState election officials have warned clerks to safeguard their ballots and voting machines to ensure there’s no tampering that could call results into question. Clerks have responded by placing ballots in sealed bags, locking them in safes, closets and offices, and doing the same with voting machines that hold electronic data.\nDavid Godek, the clerk in Janesville, a city of 64,000 about 40 miles south of Madison, said tampering is possible but would be difficult. Only he and his deputy have keys to the room in City Hall where the city’s materials are stored.\n“Someone could use a crowbar to (get into the storage room), but I would know that,” Godek said. “If someone ripped into a ballot bag that’s sealed, we would know that. I wouldn’t say it’s impossible, but I’m not concerned with it.”\nBillie Hoopman, city clerk in Bayfield, with about 475 people on the shores of Lake Superior, uses only one voting machine, an optical scanner. Voters insert their ballots and the machine tallies them. Bayfield’s ballots are in a locked bag in a safe in her office accessible only by her, her deputy and the city treasurer. The machine is locked in a closet in her office.\n“I feel like we did it as best we could,” she said.\nLana Bero, the clerk in Marinette, a city of 10,600 about 55 miles north of Green Bay, said the city uses touch-screen voting machines and optical scanners. All of them were set up in the city’s only polling site in a recreational center Tuesday, where counting also usually takes place.\nShe sealed the touch-screen machines, powered them down and left them in a locked building at the center. She said police set up a substation at the center as part of social distancing within their ranks, so the machines are protected around the clock.\nShe moved the optical scanners back to City Hall and locked them in the City Council’s chambers. Ballots that were fed through the machines are locked in bins in the chambers. She has the only key to the chambers and the bins, she said. She brought the optical scanners back to City Hall because the mail arrives there and she can walk late-arriving absentee ballots into the chambers, scan them and lock them up in a bin. City Hall is closed due to the pandemic, so members of the public can’t enter the building, she added.\nBarry Burden, a political science professor at the University of Wisconsin-Madison, called tampering a minor concern for clerks who already had processes for securing absentee ballots before election day.\n“There were a lot of parts of this election that were flawed but this concern is pretty far down the list,” Burden said.\n___\nFollow Todd Richmond on Twitter: https://twitter.com/trichmond1", "url": "https://apnews.com/c877fa704d46edb57534b5cc59bfb241"}