{"authors": ["Overnight Editor"], "date_download": "2020-05-04 20:27:45", "date_modify": "2020-05-04 20:27:45", "date_publish": "2020-04-30 08:41:06", "description": "The Washington Post's Jennifer Rubin says there's a simple reason the vice president refused to wear a mask during his trip to the Mayo Clinic.", "filename": "entry_jennifer-rubin-mike-pence-massk_n_5eaa459fc5b6edf4130e1450_1588624065.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa617a300000d112155290.jpeg?cache=61osvsnfts&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_jennifer-rubin-mike-pence-massk_n_5eaa459fc5b6edf4130e1450_1588624065.html", "title": "Conservative Columnist Taunts 'Sniveling Sycophant' Mike Pence Over Mask Stunt", "title_page": "Conservative Columnist Taunts 'Sniveling Sycophant' Mike Pence Over Mask Stunt | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Vice President Mike Pence continues to come under fire over his refusal to wear a mask during a visit to the Mayo Clinic this week.\nPence claimed he didn’t need a mask ― despite the clinic’s policy that everyone should wear one ― because he is frequently tested for coronavirus, as is everyone in close proximity to President Donald Trump.\nJennifer Rubin of The Washington Post suggested another reason.\n“Why would Pence act so recklessly, putting himself and caregivers in further danger?” she asked in her column, before providing an answer:\nWell, Trump does not like the idea of wearing a mask so a sniveling sycophant probably wouldn’t want to be seen in one, either. It is difficult to fathom someone so weak in character as to endanger others because of his boss’s vanity.\nTrump has said he will not wear a mask regardless of recommendations from his own task force that everyone should use facial coverings when going outside.\n“I just don’t want to wear one myself, it’s a recommendation,” Trump said earlier this month. “Somehow sitting in the Oval Office behind that beautiful Resolute Desk, the great Resolute Desk, I think wearing a face mask as I greet presidents, dictators, kings, queens, I don’t know, I don’t see it for myself.”", "url": "https://www.huffpost.com/entry/jennifer-rubin-mike-pence-massk_n_5eaa459fc5b6edf4130e1450"}