{"authors": [], "date_download": "2020-05-04 20:23:42", "date_modify": "2020-05-04 20:23:42", "date_publish": "2020-04-14 16:54:20", "description": "HELENA, Mont. (AP) — Gov. Steve Bullock said he does not have a timeline for things to return to normal after the coronavirus outbreak, but Republican legislative leaders say he should start...", "filename": "_9afea61d01610528aa742dabe4b75c6a_1588623822.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9afea61d01610528aa742dabe4b75c6a_1588623822.html", "title": "Montana governor: No timeline for return to normal", "title_page": "Montana governor: No timeline for return to normal", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HELENA, Mont. (AP) — Gov. Steve Bullock said he does not have a timeline for things to return to normal after the coronavirus outbreak, but Republican legislative leaders say he should start moving in that direction because the state’s economy is in a freefall.\nBullock said during a Tuesday news conference and a Monday telephone town hall that he will continue issuing his stay-at-home orders in two-week intervals based on advice from medical professionals.\nIndicators such as a decline in cases over a two-week period or increased testing capability could lead to easing restrictions, but the state would take a gradual and measured approach toward reopening, he said.\n“We can’t just flip the switch,” he said.\nThe directives in place in Montana include school and business closures that started in March, temperature screenings of passengers at airports, social distancing and a recommendation to wear masks in establishments like grocery stores, where social distancing is difficult.\nRepublican legislative leaders, including Senate President Scott Sales and House Speaker Greg Hertz, wrote to Bullock Tuesday complaining that he hurt private businesses by arbitrarily deciding which were essential and could stay open, but apparently has not furloughed any state employees.\n“It is past time to rethink your response to COVID-19 as it pertains to the citizens of Montana and implement more strategic measures in an effort to re-engage our economy once again,” they wrote.\nThe lawmakers suggested allowing local school districts to decide to bring students back into classrooms and businesses in counties with no recent COVID-19 cases to reopen, while keeping areas with high numbers of infected people such as Gallatin County under heavier restrictions. They also suggest following the example of states like Florida, by directing at-risk populations, such as older residents and those suffering from chronic health conditions, to stay home.\n“If businesses remain closed, income and property taxes, fees and other collections will plummet, causing widespread and catastrophic results to people employed in both the public and private sectors,” the Republican lawmakers wrote.\nBullock said those decisions would be based on data and science, not politics. “We have to have a healthy population to have a healthy economy,” he said.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.\nMontana reported 399 cases on Tuesday morning and seven deaths.\nFifty people have been hospitalized with COVID-19 and 24 remain in hospitals. Five new cases were confirmed Monday. None were in Gallatin County, which has just over one-third of the state’s cases.\nIn other Montana coronavirus-related developments\n— The Montana Department of Labor and Industry has begun paying the additional $600 weekly unemployment benefit established in the recent federal stimulus package, the agency said Tuesday. The state issued the enhanced payments Monday via direct deposit. People who get unemployment checks should receive the extra money this week.\n— Missoula County health officials say they will treat suspected cases of COVID-19 as though they were infected because a shortage of testing supplies means they can’t always confirm them. After people test positive, their close contacts are identified. If any develop symptoms within 14 days, they will be considered unconfirmed cases, the Missoulian reported. The state is asking counties to track those cases, but it is not tallying them until it gets permission from the federal Centers for Disease Control and Prevention, said Stacey Anderson, an epidemiologist for the state health department.\n— Six cases have been tied to a construction site in Big Sky, Gallatin City-County Health Officer Matt Kelly told the Bozeman Daily Chronicle . Suffolk Construction, which is building a $400 million ultra-luxury resort at the Spanish Peaks Mountain Club, said two employees of a subcontractor tested positive on March 24. People who had close contact with them were asked to self-quarantine for 14 days and four more workers tested positive, said Joel Nickel, executive project director for Montage Big Sky.", "url": "https://apnews.com/9afea61d01610528aa742dabe4b75c6a"}