{"authors": ["Holly Ramer", "Kathy Mccormack"], "date_download": "2020-05-04 20:13:41", "date_modify": "2020-05-04 20:13:41", "date_publish": "2020-04-09 12:57:15", "description": "CONCORD, N.H. (AP) — New Hampshire’s top disease expert on Thursday offered glimmers of hope that the state’s coronavirus mitigation efforts are working, as unemployment claims continued to pile...", "filename": "_b8a6a16a2f937a756b988d4856c6f4e3_1588623221.html", "image_url": "https://storage.googleapis.com/afs-prod/media/36d1ebb53e2f44ea8baddef4c8043e35/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b8a6a16a2f937a756b988d4856c6f4e3_1588623221.html", "title": "Jobless claims up; epidemiologist sees early hopeful signs", "title_page": "Jobless claims up; epidemiologist sees early hopeful signs", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A family, wearing masks due to the virus outbreak, carry drinks as they walk through the empty streets of the village of Exeter, N.H., Thursday, April 9, 2020. (AP Photo/Charles Krupa)\nA family, wearing masks due to the virus outbreak, carry drinks as they walk through the empty streets of the village of Exeter, N.H., Thursday, April 9, 2020. (AP Photo/Charles Krupa)\nCONCORD, N.H. (AP) — New Hampshire’s top disease expert on Thursday offered glimmers of hope that the state’s coronavirus mitigation efforts are working, as unemployment claims continued to pile up due to the pandemic.\nMore on developments in New Hampshire:\nCOMMUNITY MITIGATION\nNew Hampshire has not seen exponential growth in confirmed cases or hospitalized patients, said Dr. Benjamin Chan, the state epidemiologist. That suggests community early mitigation efforts such as closing schools and limiting large gatherings could be working, he said.\n“Early data from our New Hampshire strategy appears to show early signs that we are starting to control the outbreak of COVID-19,” he said at a news conference. “But it’s important to continue to work together to protect everyone in our state, especially those who are most vulnerable, and continue our social distancing. This is a critical time to continue that.”\n___\nTHE NUMBERS\nAs of Thursday, 819 people in New Hampshire had tested positive for the virus that causes COVID-19. Twenty-one people died.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and the infirm, it can cause more severe illness, including pneumonia, or death.\nNearly all of the deaths in New Hampshire have involved people age 60 or older, and all of those under 60 had chronic health conditions.\n___\nUNEMPLOYMENT CLAIMS\nMore than 36,000 initial unemployment claims were filed in New Hampshire last week, up nearly 5,000 from the previous week, the U.S. Department of Labor reported Thursday. The latest number covers new claims through April 4.\nThe state has seen more unemployment claims in the past three weeks due to the pandemic than in the previous three years, said George Copadis, commissioner of New Hampshire’s Department of Employment Security.\nThe department has taken more than 79,000 calls since March 17. Among those pitching in at a call center are members of the New Hampshire National Guard.\nFielding the calls requires a certain mindset, said Senior Airman Connor Martin, 23, a crew chief from the Pease Air National Guard Base.\n“You’re going to get yelled at,” he said. “People are upset. People are distraught. But you have to understand that there’s a single mom with two kids on the other end of the line who’s lost her only source of income.”\nIn Manchester, Lauren Boisvert applied for benefits after going from three jobs to zero in the past two weeks.\nBoisvert, 22, had been working at a paint bar and as a substitute teacher for two schools while also finishing her senior year at the Institute of Art and Design at New England College. She had lined up a long-term substitute job that was supposed to start in May, and a summer job at a camp, but those are both uncertain.\n“I’m not actively looking right now, I’m just hoping this subsides and I can just go back to my normal jobs,” she said Thursday.\n___\nEMERGENCY GUARDIANSHIPS\nAnticipating a surge in COVID-19 cases, New Hampshire’s circuit court is speeding up the process for appointing legal guardians to make emergency medical decisions.\nInstead of the usual 15 days, hearings by phone or video an now be held over a 48-hour period.\n___\nPROTECTING THE HOMELESS\nGov. Chris Sununu issued an executive order directing state, local and private sector partners to work together to identify isolation sites for homeless individuals who have tested positive for COVID-19 or have symptoms and to help shelters reduce the number of people staying in their facilities.\nIn Manchester, New Horizons plans to use an empty Roman Catholic school to house 40 homeless people to reduce crowding at its main 138-bed facility.\n___\nBUNNY ON PARADE\nA fire truck escorted by a police cruiser will be hopping down the bunny trail in Portsmouth this weekend.\nThe city’s recreation department arranged to have the Easter bunny ride through neighborhoods from 10 a.m. to 1 p.m. Saturday to wave to children. Officials ask that families watch from their windows or directly in front of their homes, keeping a safe distance from others.", "url": "https://apnews.com/b8a6a16a2f937a756b988d4856c6f4e3"}