{"authors": ["Christina Zdanowicz"], "date_download": "2020-05-04 16:06:29", "date_modify": "2020-05-04 16:06:29", "date_publish": "2020-03-05 19:51:14", "description": "The U.S. Environmental Protection Agency is arming consumers with a list of disinfectants that people can use to protect themselves from the novel coronavirus.", "filename": "2020_03_05_health_epa-disinfectants-coronavirus-trnd_index_1588608389.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200305134353-coronavirus-disinfectant-0304-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_05_health_epa-disinfectants-coronavirus-trnd_index_1588608389.html", "title": "Disinfectants you can use against coronavirus", "title_page": "Disinfectants you can use against coronavirus  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The U.S. Environmental Protection Agency is arming consumers with a list of disinfectants that people can use to protect themselves from the novel coronavirus.\nThe federal agency released a five-page list of chemicals and products Thursday that it says are strong enough to ward off \"harder-to-kill\" viruses than SARS-CoV-2, the virus that's responsible for the disease.\n\"Using the correct disinfectant is an important part of preventing and reducing the spread of illnesses along with other critical aspects such as hand washing,\" EPA Administrator Andrew Wheeler said in a statement.\n\"There is no higher priority for the Trump Administration than protecting the health and safety of Americans. EPA is providing this important information in a public and transparent manner on disinfectant products to help reduce the spread of COVID-19,\" he said.\nThe EPA says it's best to follow the instructions on the disinfectant's label and pay attention to the how long the product should be on the surface you're cleaning.", "url": "https://www.cnn.com/2020/03/05/health/epa-disinfectants-coronavirus-trnd/index.html"}