{"authors": ["Chris Isidore", "Cnn Business"], "date_download": "2020-05-04 16:02:02", "date_modify": "2020-05-04 16:02:02", "date_publish": "2020-04-01 13:37:32", "description": "The US airline industry is about to get smaller. That's bad news for airline employees -- and for airline passengers.", "filename": "2020_04_01_business_airline-industry-outlook_index_1588608122.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331133121-american-airlines-jets-0327-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_business_airline-industry-outlook_index_1588608122.html", "title": "Airlines will offer fewer choices and higher fares after the coronavirus crisis", "title_page": "Airlines will offer fewer choices and higher fares after the coronavirus crisis - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) The US airline industry is about to get smaller. That's bad news for airline employees -- and for airline passengers.\nAirline traffic has plunged and it probably won't recover any time soon. The $50 billion aviation bailout passed last week will keep airlines in business and employees on the job for the the next six months. Still, airline executives suggested they expect fewer flights and slumping demand for air travel for quite some time.\n\"If the recovery is as slow as we fear, it means our airline and our workforce will have to be smaller than it is today,\" said United CEO Oscar Munoz and President Scott Kirby in a message to their employees last Friday.\nA leaner airline industry means some of the 750,000 jobs the industry had at the start of 2020 won't come back. Hundreds of planes will almost certainly stay grounded, which will mean less capacity and higher fares.\nMany of the low-cost seats that passengers have enjoyed booking will disappear.\nFliers will have less choice -- of airlines, of flight times, and of available routes and markets. All of that means passengers will pay more when they return to the air.\n\"Fewer seats flying means fewer cheap seats at the margin,\" Philip Baggaley, chief credit analyst for airlines for S&P Global.\nA long time to recover lost traffic\nAmerican AAL United UAL Delta DAL Southwest LUV This isn't the first time the airline industry has needed to contract in response to a sudden shock. Before the terrorist attack of 9/11 happened, there were nine major US airlines. Today most of those nine airlines -- iconic carriers such as Continental, Northwest, and US Airways - have been merged into four remaining major carriers --and\nSpirit SAVE JetBlue JBLU Allegiant ALGT Those four majors controlled 80% of the miles flown by passengers on US airlines last year. The rest of the market is taken up by smaller carriers offering cheaper fares, such asand. The presence of those carriers helps keep some of the seats on the major carriers available at lower prices.\nBut almost no one is flying today. The number of passengers entering TSA screening points fell 93% between Tuesday and the last Tuesday of March in 2019.\nIt will take a long time for passenger traffic to recover, even after the coronavirus is under control and people can fly again. Traffic finally bounced back in 2004, following the 2001 terrorist attacks.\nAnd after the Great Recession of 2008, it wasn't until 2013 that passenger traffic reached what it was in 2007, the final year before the Great Recession. Those drops in traffic were a mere fraction of the decline that occurred over the last four weeks.\nLess choices for passengers\nThis coronavirus crisis is so much more severe than past downturns in the industry that there's a good chance there could be a new round of mergers and airline failures that the industry has gone through in the past.\n\"In the near term, we're going to see a shakeout,\" said Joe Schwieterman, a transportation expert and professor at DePaul University in Chicago. \"The weaker players may not survive this. Most industry leaders are expecting a long, painful recovery.\"\nEven if all the current US airlines manage to survive, airlines big and small will pull back from markets and routes that have become unprofitable in the new environment. Even on routes they maintain, they'll reduce the frequency of flights to fill up a greater percentage of seats.\nThat will lead to higher fares than before the crisis.\n\"There's going to be fewer airplanes. That means less flying,\" said industry consultant Mike Boyd. \"So there's going to be less choice, and you'll be paying more. There's no way around that.\"\nA new round of mergers?\nGrounded American Airline jets in Pittsburgh. The US airline industry has grounded hundreds of jets due to the huge drop in demand for air travel.\nIn the past, economic problems in the industry have led to bankruptcy and mergers. Many of the deals since 9/11 have taken place as part of a bankruptcy process.\nFrom April through June of last year, US airlines' revenue totaled $64.4 billion, according to Transportation Department data. But the industry is getting only a small percentage of that revenue stream right now. Even with a $50 billion federal bailout, the government is only providing a fraction of the revenue lost in the current drop in air traffic.\nSo it's possible that two of the big carriers could once again merge, further consolidating control of the market.\nWhat might work against a merger of the major carriers could be the nature of this crisis, said Philip Baggaley, chief credit analyst for airlines for S&P Global. He said previous bankruptcies and mergers helped airlines shed debt or get out of labor contracts they couldn't afford. This crisis is different.\n\"More than too much debt or their costs being too high, it's just the loss of revenue,\" he said. \"Unfortunately mergers or even bankruptcies can't address that.\"\nBut a merger among majors is still possible as airlines seek to fill seats and further trim administrative overhead.\nWhile such deals would need the approval of antitrust regulators, the Justice Department has rarely blocked airline mergers in the past, particularly at a time of financial crisis for one or both parties. And they could be approved despite antitrust concerns, said Joe Schwieterman, a transportation expert and professor at DePaul University in Chicago.\n\"There are all kinds of industries where there are only three or even two major players,\" he said. \"You could envision a deal among majors clearing antitrust hurdles, especially if the industry is on the ropes.\"\nAlso possible: the upstart, low-fare carriers could fail and be swallowed up by the bigger carriers. At the very least, they may have to drop out of their less profitable markets.\nBut it's virtually certain that passengers will have fewer choices even if none of the airlines merge or go out out business, as airlines respond to the new, lower traffic environment with smaller operations for the foreseeable future.", "url": "https://www.cnn.com/2020/04/01/business/airline-industry-outlook/index.html"}