{"authors": ["Oliver Darcy", "Cnn Business"], "date_download": "2020-05-04 17:00:46", "date_modify": "2020-05-04 17:00:46", "date_publish": "2020-04-09 14:13:58", "description": "Vice President Mike Pence's office reversed course on Thursday afternoon, after declining for days to allow the nation's top health officials to appear on CNN and discuss the coronavirus pandemic, in what was an attempt to pressure the network into carrying the White House's lengthy daily briefings in full.", "filename": "2020_04_09_media_pence-office-tv-bookings-coronavirus_index_1588611646.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409085613-pence-0408-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_media_pence-office-tv-bookings-coronavirus_index_1588611646.html", "title": "White House reverses position after blocking health officials from appearing on CNN", "title_page": "White House reverses position after blocking health officials from appearing on CNN - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Vice President Mike Pence's office reversed course on Thursday afternoon, after declining for days to allow the nation's top health officials to appear on CNN and discuss the coronavirus pandemic, in what was an attempt to pressure the network into carrying the White House's lengthy daily briefings in full.\nAfter this story was published, Pence's office allowed for the booking of Centers for Disease Control and Prevention Director Dr. Robert Redfield for CNN's Thursday night coronavirus town hall. Dr. Anthony Fauci was also booked for Friday on \"New Day.\"\nPreviously, Pence's office, which is responsible for booking the officials on networks during the pandemic, said it would only allow experts such as Fauci or Dr. Deborah Birx to appear on CNN if the network televised the portion of the White House briefings that includes the vice president and other coronavirus task force members.\nCNN often only broadcasts President Donald Trump's question and answer session, which sometimes includes the health care officials, live on-air.\nAfter Trump leaves the podium, CNN frequently cuts out of the White House briefing to discuss and fact-check what the President has said. A CNN executive said that the network usually returns to such programming because of the extensive length of the full briefing that includes Pence, which can run in excess of two hours.\nRead More", "url": "https://www.cnn.com/2020/04/09/media/pence-office-tv-bookings-coronavirus/index.html"}