{"authors": ["Por Christopher Sherman Y Carlos Rodríguez"], "date_download": "2020-05-04 20:15:59", "date_modify": "2020-05-04 20:15:59", "date_publish": "2020-04-06 21:10:26", "description": "CIUDAD DE MÉXICO (AP) — El presidente mexicano Andrés Manuel López Obrador prometió el lunes apegarse a su modesto plan de recuperación económica luego de que los principales grupos empresariales...", "filename": "_c430b49609624292b41dd52190a5e275_1588623359.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ed4ee6bb5c3249769ab8bec22e8fba8e/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c430b49609624292b41dd52190a5e275_1588623359.html", "title": "Presidente de México se apega a modesto plan económico", "title_page": "Presidente de México se apega a modesto plan económico", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\n1 of 3\n1 of 3\n1 of 3\n1 of 3\nCIUDAD DE MÉXICO (AP) — El presidente mexicano Andrés Manuel López Obrador prometió el lunes apegarse a su modesto plan de recuperación económica luego de que los principales grupos empresariales de la nación reaccionaron negativamente a la propuesta, la cual ampliaría sus programas sociales y reforzaría las medidas de austeridad del gobierno ante los estragos económicos provocados por la pandemia de COVID-19.\nA diferencia del paquete de estímulo por 2 billones de dólares que Estados Unidos aprobó para ayudar al país a contrarrestar los efectos de la pandemia, México aumentará algo de la inversión pública, pero López Obrador dijo en un discurso el domingo por la tarde que evitaría la deuda pública.\n“Algunos pusieron que el presidente no dio a conocer lineamientos generales y que esta semana el secretario de Hacienda va a puntualizar y a desglosar las medidas, pero no, ya no hay más, es esto solamente”, dijo el lunes López Obrador.\nEl Consejo Coordinador Empresarial de México dijo que veía con buenos ojos algunas de las ideas del mandatario, pero calificó el plan como “una respuesta incompleta ante la gran dimensión de la crisis que enfrentamos”.\nManuel Molano, director del Instituto Mexicano para la Competitividad, también señaló una falta de conexión entre el alcance de las propuestas de López Obrador y la dimensión del golpe económico que México recibirá.\n“Tenemos un problema en donde el presidente no está entendiendo la magnitud de la crisis”, comentó Molano. “No está entendiendo el momento histórico que le tocó vivir y cómo tendría que reaccionar ante estos eventos”.\nEl domingo, López Obrador había esbozado medidas que se enfocan en los mexicanos más pobres, y en las últimas semanas ha hablado frecuentemente sobre la necesidad de proteger a la mitad informal de la economía mexicana y a aquellos que viven al día.\nSin embargo, Molano señaló que el presidente parece no comprender la enorme pérdida de empleos que se aproxima en la economía formal y cómo esas pérdidas de empleos afectarán a los mexicanos más pobres.\n“No entender el vínculo entre la persona que vende comida en una esquina y la persona que trabaja en una fábrica y le compra comida al que vende en esa esquina, pues realmente, pues implica que no hay una comprensión real de cómo funciona la economía”, puntualizó Molano. En tanto, López Obrador dijo que crearía 2 millones de empleos en lo que resta del año, un número poco realista para una economía que ya se encontraba en una recesión técnica.\nMolano pronosticó que 1 millón de personas o más quedarían subempleadas o trabajarían menos de 20 horas a la semana, y que entre 500.000 y 600.000 personas perderían sus puestos en la economía formal.\nMéxico sigue esperando el impacto total de la pandemia. El gobierno ha implementado medidas de distanciamiento social en las últimas dos semanas y ha reportado más de 2.100 casos confirmados y 94 muertes. Los negocios no esenciales recibieron instrucciones de enviar a sus trabajadores a sus casas.\nEl lunes, una enorme cementera de México, Cemex, informó que acataría las instrucciones del gobierno y suspendió la producción hasta el 30 de abril.\nEl domingo, López Obrador dijo que los funcionarios de alto rango del gobierno, desde subsecretarios hasta él, tendrían reducciones en sus salarios y cederían sus bonos de fin de año.\nLa moneda mexicana seguía perdiendo valor el lunes por la mañana, cotizándose sobre los 25 pesos por dólar. Gabriela Siller, economista de Banco Base, dijo que el peso era la segunda moneda más depreciada detrás del yen japonés, “debido principalmente a la decisión del ejecutivo en México de no presentar un plan de medidas contracíclicas”, particularmente gasto para estimular la economía.\n“El tipo de cambio reaccionó debido a que, sin política fiscal contracíclica, no hay forma de aminorar el golpe del coronavirus sobre la economía”, explicó Siller en un análisis.\nMolano dijo que la renuencia de López Obrador a asumir más deuda pública es comprensible considerando el accidentado pasado de México de rescatar a empresas en quiebra y la corrupción relacionada. Pero señaló que ayudar a las pequeñas y medianas empresas, que son responsables de la mayoría de los empleos en el país, habría tenido un mayor impacto que simplemente dar pequeñas transferencias de dinero a las familias pobres. Una de esas familias que recibe 100 dólares probablemente lo usará para pagar deudas que tiene, cuando lo que es realmente necesario es que la gente gaste ese dinero o incluso expanda su deuda para contrarrestar la recesión, explicó.\nPero ese un anatema para López Obrador. “Están acostumbrados a que se rescate a los de arriba, que no se les cobre impuestos”, dijo el presidente el lunes. “Algunos dicen ‘¿dónde está el plan para reactivar la economía?’ Porque lo que quieren es un banderazo de salida para de nuevo instaurar la corrupción”, agregó.", "url": "https://apnews.com/c430b49609624292b41dd52190a5e275"}