{"authors": ["Senior Culture Reporter"], "date_download": "2020-05-04 20:21:56", "date_modify": "2020-05-04 20:21:56", "date_publish": "2020-04-28 17:41:52", "description": "Heather McLean said her family's pug, Winston, had been experiencing mild symptoms in the days leading up to his diagnosis.", "filename": "entry_north-carolina-dog-coronavirus-diagnosis_n_5ea84f42c5b6cb5d81e459f9_1588623716.html", "image_url": "https://img.huffingtonpost.com/asset/5ea851f82200006f0c827cc7.png?cache=ntrzbz1dk1&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_north-carolina-dog-coronavirus-diagnosis_n_5ea84f42c5b6cb5d81e459f9_1588623716.html", "title": "North Carolina Dog Thought To Be First In U.S. Confirmed To Have Coronavirus", "title_page": "North Carolina Dog Thought To Be First In U.S. Confirmed To Have Coronavirus | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "In what’s thought to be a U.S. first, a North Carolina family’s dog was confirmed to have tested positive for the coronavirus this week.\nDr. Heather McLean of Chapel Hill said her pug, Winston, had been experiencing mild symptoms in the days leading up to his diagnosis.\n“Pugs are a little unusual in that they cough and sneeze in a very strange way,” she told local NBC affiliate WRAL Monday. “So it almost seems like he was gagging, and there was one day when he didn’t want to eat his breakfast.”\n“If you know pugs, you know they love to eat,” she added. “So that seemed very unusual.”\nMcLean, a pediatrician at Duke University in Durham, had herself already been diagnosed with COVID-19, the disease caused by the coronavirus, as had her husband Samuel and her son Ben. On April 1, she included Winston in a molecular and epidemiological research study at Duke.\nAccording to multiple reports, Winston is thought to be the first dog in the U.S. to have a confirmed case of COVID-19. The family’s other pets ― including a cat, a lizard and another dog ― have all tested negative.\nThe McLeans’ pug is the latest in a growing list of animals to test positive for the coronavirus. In March, two dogs in Hong Kong tested positive for the virus, as did a pet cat in Belgium.\nLast week, it was confirmed that a total of eight big cats at New York’s Bronx Zoo ― five tigers and three African lions ― had been diagnosed with COVID-19, but appeared to be recovering.\nThe Centers for Disease Control and Prevention stress that there is “no evidence that animals play a significant role in spreading the virus that causes COVID-19.” Still, officials recommend you treat your infected pets “as you would other human family members.”\nJane Sykes, chief veterinary medical officer at the University of California, Davis, made a similar point in a March interview with HuffPost.\n“You’re more likely to get infected from another person,” Sykes said at the time.\nAs for Winston, McLean says he is already doing much better.\n“Hopefully we’ll learn more through the research study, and I think because there’s not a lot of studies and sampling pets, we just don’t know yet,” she said, per WRAL. “My advice is just not to get too worried about it.”\nWatch a CBS report on Winston McLean below:", "url": "https://www.huffpost.com/entry/north-carolina-dog-coronavirus-diagnosis_n_5ea84f42c5b6cb5d81e459f9"}