{"authors": ["Jenna Fryer"], "date_download": "2020-05-04 20:28:34", "date_modify": "2020-05-04 20:28:34", "date_publish": "2020-04-05 20:16:29", "description": "CHARLOTTE, N.C. (AP) — William Byron led the most laps in NASCAR's first two virtual races and had nothing to show for his gaming skills. The third time out, he got the win. Byron easily won...", "filename": "_8cf3b1adf47db91091a32c321389cafa_1588624114.html", "image_url": "https://storage.googleapis.com/afs-prod/media/2cc61e7cac4c436f997b8dddf0598693/2593.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8cf3b1adf47db91091a32c321389cafa_1588624114.html", "title": "Byron wins virtual Bristol; Bubba 'rage quits' early in race", "title_page": "Byron wins virtual Bristol; Bubba 'rage quits' early in race", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "William Byron celebrates after winning the second of the two NASCAR Daytona 500 qualifying auto races at Daytona International Speedway, Thursday, Feb. 13, 2020, in Daytona Beach, Fla. (AP Photo/Terry Renna)\nWilliam Byron celebrates after winning the second of the two NASCAR Daytona 500 qualifying auto races at Daytona International Speedway, Thursday, Feb. 13, 2020, in Daytona Beach, Fla. (AP Photo/Terry Renna)\nCHARLOTTE, N.C. (AP) — William Byron led the most laps in NASCAR’s first two virtual races and had nothing to show for his gaming skills. The third time out, he got the win.\nByron easily won the iRacing event Sunday at virtual Bristol Motor Speedway, where NASCAR would have been really racing before the coronavirus pandemic caused sports to shut down.\n“Some things are different but a lot of things are similar and this is a racetrack I’ve always enjoyed coming to,” Byron said. “It’s fun to have some pressure on iRacing; I usually just run it to have some fun and get better.”\nNASCAR changed the format this week and started with single-car qualifying to set the field for a pair of 50-lap heat races. Those heat races determined the starting order. Byron started from the pole and was never challenged.\nThe entertainment again came from the drivers, most of whom streamed their gaming experiences for fans to eavesdrop on the action and the arguing. Clint Bowyer was the in-race reporter and again delivered a hilarious performance.\n“I got Bubbaed!” Bowyer shouted after he was moved out of line by Bubba Wallace. “I need a beer really badly.”\nWallace appeared to “rage quit” the race after the incident. “That’s why I don’t take this (crap) serious. Peace out,” Wallace said on his gaming stream.\nAfter fans ripped him on Twitter, he laughed at how seriously some are taking iRacing with his response.\n“I ruined so many peoples day by quitting ... a video game,” he wrote. “Bahaha. A video game. Damn quarantine life is rough.” He also admitted to rage quitting in a second post.\nBlue-Emu, one of Wallace’s sponsors, was apparently not pleased. “Bye bye Bubba. We’re interested in drivers, not quitters,” said a tweet on the account of the topical pain reliever cream. The company added a second tweet using the image of Donald Trump uttering his “You’re Fired” catchphrase from “The Apprentice.”\nSeven-time NASCAR champion Jimmie Johnson fired his spotter less than 20 laps into the race after falsely being told he was clear of another car, only to crash. Erik Jones had internet issues that caused him to miss qualifying, and Daniel Suarez was parked for the second consecutive week and was joined this time by Kyle Larson after the two tangled on track.\nSuarez was not happy, complaining that Larson should have been disqualified as he was last week “and by the way our ‘racing incident’ was him pushing me to the apron... if this was real life my amigo would get his but kicked,” he tweeted.\nHendrick Motorsports became the first team to actively involve its sponsors in the virtual racing by having Elliott and Alex Bowman live conference with guests who would typically get a pre-race visit with the drivers in a hospitality suite at the track.\nTeams and drivers are doing anything they can to keep the sport moving as all incoming revenue has frozen. Landon Cassill signed a sponsor for his iRacing and had the Blue-Emu logos featured prominently behind him as he raced. He also gave fans a tour of his borrowed rig in a plug to help the simulator company sell the setup.\nThe iRacing has been a savior for the motorsports industry — IndyCar launched a series a week after NASCAR, and Saturday’s second race was aired on NBC Sports — and NASCAR’s first two televised events both set eSports records. More than 1 million people watched last week when Fox made the race available to affiliates and also aired it nationally on its cable channel.\nFor Timmy Hill, winner of last week’s virtual race, the series has given him sudden exposure. Joyce Julius & Associates, which measures and analyzes all forms of media, said Hill had received only two television mentions when racing was suspended four races into the season. The company found he had 46 mentions during his victory race and noted “the Pro Invitational Series is giving spotlight to drivers who do not usually get it.”\nNASCAR during the broadcast aired a public service announcement featuring several top drivers thanking front-line health care workers. The sanctioning body has been donating face shields made on the five 3-D printers at its research center, and several other industry participants are either producing personal protective equipment or making donations of some sort.\nRita Wilson, who along with husband Tom Hanks recovered from the new coronavirus, sang the national anthem from her home in California. The invocation was done by 12-time Bristol winner Darrell Waltrip, and Rob Gronkowski and Mojo Rawley gave the command for drivers to start their (virtual) engines from WrestleMania .\nThe race was plagued with early cautions and drivers get two resets to fix their wrecked cars. Because of all the crashing, iRacing officials mid-race made all the restarts single-file in an attempt to clean up the action. It was met with mixed reviews, as Parker Kligerman noted on his stream: “This changes everything. NASCAR of 2007, we’re back,” but Hill was less pleased. Mired in traffic, he said “it screws everything up. We’ve got a lot work to do.”", "url": "https://apnews.com/8cf3b1adf47db91091a32c321389cafa"}