{"authors": ["Amir Vera", "Konstantin Toropin"], "date_download": "2020-05-04 16:18:43", "date_modify": "2020-05-04 16:18:43", "date_publish": "2020-04-03 22:47:29", "description": "Iowa Gov. Kim Reynolds said that livestock auctions like this one were allowed \"because they are part of the food production supply chain.\"", "filename": "2020_04_03_us_iowa-horse-auction-coronavirus_index_1588609123.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403175042-horse-auction-screengrab-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_us_iowa-horse-auction-coronavirus_index_1588609123.html", "title": "Iowa man holds horse auction drawing 600 people despite coronavirus fears, but he broke no laws, governor says", "title_page": "Iowa man holds horse auction drawing 600 people despite coronavirus fears, but he broke no laws, governor says - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) An Iowa man held a horse auction this week that drew about 600 people, despite pleas from health officials during a time of social distancing and shelter-in-place orders to fight the novel coronavirus outbreak.\nUra Gingerich held the auction Thursday in Wayne County, about 78 miles south of Des Moines. He told local health officials he wanted to sell his horses so that he could move to Ohio, according to a statement from the Wayne County health officials provided to CNN affiliate KCCI . CNN has reached out to Gingerich but has not heard back.\n\"We just wanted to postpone it until this whole coronavirus thing was over,\" Shelly Bickel, Wayne County Health Department administrator, told CNN.\nDespite the health risks that came with hosting the auction, there was legally nothing officials could do, Bickel said. Health officials did screen attendees. There were already 100 people at the location when health officials arrived at 6:15 am to screen attendees, Bickel said.\n\"If we couldn't stop this, we were going to make it as safe as possible,\" she said.\nRead More", "url": "https://www.cnn.com/2020/04/03/us/iowa-horse-auction-coronavirus/index.html"}