{"authors": ["Dan Merica"], "date_download": "2020-05-04 16:21:08", "date_modify": "2020-05-04 16:21:08", "date_publish": "2020-04-05 13:01:21", "description": "Governors across the country have stepped up to combat the coronavirus pandemic in recent weeks, turning a group of one-time anonymous state officials into influential executives with growing national profiles.", "filename": "2020_04_05_politics_governors-national-spotlight_index_1588609268.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404144150-whitmer-cuomo-dewine-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_governors-national-spotlight_index_1588609268.html", "title": "Governors step into national spotlight as they combat coronavirus", "title_page": "Governors emerge into national spotlight as they deftly deal with coronavirus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Governors across the country have stepped up to combat the coronavirus pandemic in recent weeks, turning a group of one-time anonymous state officials into influential executives with growing national profiles.\nWhere the federal government has struggled to respond, many governors have stepped into the void and used their broad powers to stem the spread of the virus.\nRepublicans Mike DeWine of Ohio and Larry Hogan of Maryland bucked some early skepticism inside their party and quickly acted to prepare their states for coronavirus. DeWine, before the state had a single reported case of the virus in early March, shut down a money-making sports festival and later pushed for his state to move its primary. And Hogan, in late February, began to put together early legislation to fund fighting coronavirus and canceled out of state travel for workers.\nDemocrats like New York's Andrew Cuomo , California's Gavin Newsom and Washington's Jay Inslee , at the same time, have deftly dealt with their states' respective outbreaks. Cuomo's daily press briefings have become closely watched television as he delivers need-to-know information about essential services and ventilators to New Yorkers, while Newsom became the first governor to institute a statewide stay-at-home ban. Inslee was in the thick of it early on, meeting with Vice President Mike Pence and leading the response as his state became a hot spot long before many others.\nAnd once nationally unknown names like Michigan's Gretchen Whitmer and Kentucky's Andy Beshear have seen their profiles skyrocket. Whitmer has taken on President Donald Trump after he attacked her as she sought help for her state. Beshear has earned bipartisan plaudits -- including from Senate Majority Leader Mitch McConnell -- for declaring a state of emergency in his home state on March 6, a day before Cuomo in New York and a week before Trump did so nationally.\nThese early actions from a range of governors came at the same time that Trump was dismissing the spread of the virus. On March 9 -- days after multiple states declared a state of emergency -- Trump compared the spread of coronavirus to the flu and tweeted, \"Nothing is shut down, life & the economy go on.\"\n\"We're doing a great job with it,\" Trump said a day later March 10. \"And it will go away. Just stay calm. It will go away.\"\nThe early and aggressive action has been noticed by Americans, with governors -- who were largely ignored in the 2020 Democratic primary -- consistently getting better ratings than Trump for their handling of the crisis. A recent Monmouth poll found that 72% of the public says their state's governor is doing a good job handling the crisis, compared to just 18% who give poor marks. The praise is bipartisan, too, with more than 70% of both Democrats and Republicans responding that they approve of their governor's response.\n'Governors really have led'\nGovernors, since the moment coronavirus came to the United States, have been tasked with both leading their states through outbreaks and preparing state infrastructure for further spread.\nMany, like DeWine, Inslee and Cuomo, have risen to that call, taking swift and aggressive action -- far outflanking the federal government's response to the virus.\n\"Governors ... seem to be emerging as the most trusted official voice in this crisis across the board,\" said Patrick Murray, director of the Monmouth poll that found broad approval for governors.\nLikewise, the pandemic has also highlighted the slow response of other governors, like Florida's Ron DeSantis, who first fought off calls to close his state's beaches despite spring breakers flocking to them and, until recently, the Republican declined to issue a statewide stay-at-home order.\nThe same is true in a state like Georgia where Republican Gov. Brian Kemp deferred to cities and counties to issue stay at home orders until he did just that on Thursday, and Arkansas, where Republican Gov. Asa Hutchinson on Thursday defended his decision not to issue a statewide stay at home order.\n\"People are making their own decision to stay home, and that's exactly what they should be doing,\" Hutchinson said in a press conference.\nHogan, in addition to being the Republican governor of Maryland, also works as the head of the National Governors Association. He has been hesitant to call out any of his less aggressive governors, but the Maryland Republican has also touted those who acted swiftly, like in a recent CBS interview where he said governors had \"been on the front lines\" and \"stepped up to make those tough decisions\" to \"push for more action from the federal level.\"\n\"Governors are leading on the front lines of this crisis, and we need Congress to work together to support our effort,\" Hogan told CNN on Friday. \"This is no time for partisan dysfunction -- it's going to take all of us working together in order to save thousands of lives.\"\nOperatives like James Nash at the National Governors Association, a non-partisan organization that works with the nation's governors, argue that governors have \"have always been leading in response to disasters,\" but that the response to the coronavirus pandemic has been \"more visible.\"\n\"Governors have been taking a lot of initiative,\" Nash said. \"They have been the ones to orders these social distancing measures, business closures, government closures. ... A lot of the action to protect the public have originated from governors.\"\nFour governors. No traction.\nThe recent praise is a significant about-face for governors.\nThe elected position was, for decades, considered the clearest steppingstone to the presidency, with half of the last eight presidents holding the position at some point in their careers. But recent elections, including the 2020 Democratic primary, have been dominated by federal office holders, with most voters unmoved by the executive experience governors were pitching during presidential elections.\nAs coronavirus spreads and responsibility falls on governors to muster an effective response, there is a notable irony that Americans who are now heralding the executive experience that state leaders across the country are bringing to the fight are the same Americans who largely dismissed that experience as a presidential prerequisite.\nIn the last 40 years, four presidents previously held the governor's office in their respective states before becoming president: Jimmy Carter, Ronald Reagan, Bill Clinton and George W. Bush. But since 2008, governors have largely been dismissed in presidential elections, with the exception of Republican Mitt Romney, the former Massachusetts Republican governor who lost the 2012 election to Barack Obama.\nFour governors ran for the Democratic presidential nomination: Inslee, Montana Gov. Steve Bullock, former Colorado Gov. John Hickenlooper and former Massachusetts Gov. Deval Patrick.\nAll four led, at some point, with a message the highlighted their experience. And while they all struggled for different reasons, what unites the four men is this: Voters were unmoved by the idea that executive experience and a record of leading a state is what was needed in the White House.\nThe four men tried to sell voters on their executive experience, but the excitement around their candidacies paled in comparison to the federal office holders who ran against them. All four barely made a blip in national or statewide polling. And while they made a handful of debates collectively, they were all on the outskirts of the debates and ended up largely being seen as afterthoughts in a field that was historically large.\n\"Had governors had this kind of moment six months before the primary started, would voters generally be looking for people with expertise and a body of evidence and executive office experience,\" David Turner, a top operative at the Democratic Governors Association told CNN. \"I wonder if that expertise would be valued more by voters (now).\"\nHickenlooper and Inslee were out by August, while Bullock dropped out in December. Patrick was a unique case: The former Massachusetts governor got into the race in November, only to gain no traction and end his bid in February. No governor received a single tenth of a percentage point in the Iowa caucuses and Patrick was the only governor to win any votes in the New Hampshire primary -- and he only won 0.4%, or a little more than 1,200 votes.\nThe fact that Americans are now heaping praise on governors -- some online are even connecting Cuomo's performance in the face of the coronavirus with a possible future presidential run -- is not lost on those who tried to elect governors in 2020.\nA former Bullock aide described it as \"disappointing\" that a message focused on executive leadership didn't resonate in 2019, but said they are happy \"governors are now proving the point that that experience does matter.\"\nOther former aides pointed to the nationalization of American politics, including the way the primary process was structured, as a key reason for governors struggling. The Democratic National Committee rules for debate qualification included two components -- fundraising and polling -- that led less well-known candidates to pour considerable resources in to garnering the number of donors needed to qualify for the first few debates.\n\"The way the DNC rules were set up made it a lot easier for people who already had big email lists to work from,\" a senior Inslee aide said. \"It culled the field and made it harder for people to grow.\"\nThe media environment also contributed to that nationalization.\nThat dynamic, argued the aides, made it so that the majority of governors who ran were not in the race when most voters were making their decisions.\n\"We always knew the election was going to break late, but it was going to break late amongst five people and we did not have the fundraising or the national profile to be in the five,\" said a senior Hickenlooper adviser. \"If a governor were in that five, I think they would have made a very compelling argument.\"\nThe adviser added: \"There was just no governor left standing when half of the country was paying attention.\"", "url": "https://www.cnn.com/2020/04/05/politics/governors-national-spotlight/index.html"}