{"authors": ["Alice Stewart"], "date_download": "2020-05-04 16:25:03", "date_modify": "2020-05-04 16:25:03", "date_publish": "2020-04-07 00:08:12", "description": "Many people got it wrong in the beginning, including President Donald Trump. But people made mistakes all around--including Nancy Pelosi and New York City Mayor BIll DeBlasio, writes Alice Stewart. And there will be time for a post-mortem on those mistakes. But right now our top priority is to flatten the coronavirus curve.", "filename": "2020_04_06_opinions_coronav_dcaf0351bbcecd59b55d8c991484fb3d_index_1588609503.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406181617-trump-hands-up-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_opinions_coronav_dcaf0351bbcecd59b55d8c991484fb3d_index_1588609503.html", "title": "The coronavirus blame game: It's not just Trump", "title_page": "The coronavirus blame game: it's not just Trump (opinion)  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Alice Stewart is a CNN political commentator, a resident fellow at the Harvard University's Institute of Politics and former communications director for Ted Cruz for President. The views expressed in this commentary belong to the author. View more opinion at CNN.\n(CNN) In our polarized world, we are united by one truth: Covid-19 has no political objective, no media bias, and no social agenda. It is an equal opportunity killer. People are dying in isolation, working alone in their basement, and sobbing on empty street corners normally full of life. As we long for the \"ordinary\" in the midst of these extraordinary times, the reality is that while we are united, we are still divided.\nThe growing global threat has prompted citizens, public officials, and even the news media to, over time, change the way they have viewed, responded to, and reported on this pandemic.\nMany people got it wrong in the beginning, including President Donald Trump. But people made mistakes all around. And there will be time for a post-mortem on those mistakes. Right now, our top priority is to flatten the coronavirus curve.\nIn fact, those intent on aiming blame for a lagging response in just one direction should recall that on January 25, House Speaker Nancy Pelosi encouraged the people of San Francisco to go out and celebrate the Lunar New Year. A month later, she toured Chinatown there and said \"everything is fine here...come because precautions have been taken. The city is on top of the situation.\"\nOn February 8, 2020, New York Health Commissioner Oxiris Barbot tweeted a message for people to go about their lives, and \"not change any plans due to misinformation spreading about #coronavirus.\"\nJUST WATCHED Tapper's plea to Trump: This is not about winning a news cycle on Fox Replay More Videos ... MUST WATCH Tapper's plea to Trump: This is not about winning a news cycle on Fox 03:23\nOn February 27, Trump downplayed the virus, saying the threat to the American people \"remains very low.\"\nOn March 9, he tweeted : \"So last year 37,000 Americans died from the common Flu. It averages between 27,000 and 70,000 per year. Nothing is shut down, life & the economy go on. At this moment there are 546 confirmed cases of CoronaVirus, with 22 deaths. Think about that!\"\nAnd as recently as March 13, New York Mayor Bill de Blasio was telling the people of New York to \"go on about their lives.\" (CNN's Jake Tapper rightly called him out for being \"far behind the curve.\")\nSo, many people got many facts wrong about Covid-19; this includes Trump's conservative news allies. A group of 74 journalists and journalism and communications professors wrote a letter to the heads of Fox News, citing what they say was \"false and misleading reporting\" that downplayed the severity of the coronavirus outbreak.\nJoe Lockhart, former White House Press Secretary for former President Bill Clinton, tells me this false sense of security put many at risk. \"A large portion of Americans will believe anything the President says, and they get their news almost exclusively from Fox,\" he said.\nThere has been a sea change in the president's thinking. In recent days, as reality of the deadly virus has set in, Trump and, to some degree, conservative news outlets have taken on a new tone, one that rightly addresses the challenge of the pandemic. But that has not stopped critics from relentlessly attacking the president and his media allies for their early coverage of Covid-19.\nThe New York Times accuses Fox News of downplaying the pandemic early on, referring to Fox in a headline as part of the \"pro-Trump media's coronavirus distortion.\"\nNew York Times Columnist Kara Swisher blamed her mother's \"misinformation\" about COVID-19 on \" Fox, the whole Fox and nothing but the Fox.\nI don't see how this is helpful at all.\nI asked the former White House press secretary for former President George W. Bush, Ari Fleischer, about the blame game. He said, in a crisis like this \"the normal finger-pointing rules should be thrown out the window.\" He said the public doesn't want to hear about it, adding, \"that's the last war, we're in the middle of a new one.\"\nAs for public officials, including Trump and de Blasio, who may have been slow to respond initially, he says it's proper to acknowledge your mistake and learn from what went wrong, adding \"there's a difference in constructively looking back and finger pointing and playing the blame game.\"\nDemocratic strategist Joe Trippi acknowledges that some people got it wrong a lot longer than others. He tells me, \"everyone can be forgiven for that. But at some point you have to get it right and move on.\"\nHaving spent my career in communications, I am proud of all the media outlets that have shifted their focus to Covid-19 coverage. Their shared sense of responsibility to provide life-saving information is palpable. You can see it in their faces. You can hear it in their voices. You can feel it in their emotions.\nMost outlets have hired new health professionals and physicians to join the existing medical experts on the air. We see town halls, Q&A segments, and news blogs dedicated to educating the public about this deadly pandemic. Broadcast and cable outlets are filling the airwaves with nonstop, valuable information to educate viewers.\nFollow CNN Opinion Join us on Twitter and Facebook\nKevin Madden, former senior advisor and spokesman for Mitt Romney's 2012 presidential campaign, says the daily coronavirus task force briefings, often carried live, are valuable. He tells me, \"what's needed is a steady diet of transactional information provided to the public about the nature of the response. There's a lot of information that needs to get out.\"\nKey components of educating the public involve constant updates and a consistent message. The mixed messages we have seen out of the daily briefings are not helpful and serve as an unnecessary distraction.\nWe are in uncharted territory, but we are all in this together. No amount of blame is going to change that. It does nothing to cure the sick, put kids back in school, or get people back to work. Finger pointing does nothing to protect lives; it endangers them.\nIn the midst of this unprecedented pandemic, six words should be taken to heart: help more, report facts, attack less. We should be fighting against the virus, not each other.", "url": "https://www.cnn.com/2020/04/06/opinions/coronavirus-blame-game-its-not-just-trump-stewart/index.html"}