{"authors": ["Pat Graham"], "date_download": "2020-05-04 20:05:10", "date_modify": "2020-05-04 20:05:10", "date_publish": "2020-04-07 19:30:32", "description": "Olympic snowboard champion Anna Gasser cleaned out her closet in Austria over the weekend and found nine pairs of goggles. They’re all being cleaned, packed and donated, including a pair...", "filename": "_3a4873fa811e09208942b58693fe5582_1588622710.html", "image_url": "https://storage.googleapis.com/afs-prod/media/49546b1ff77a426ca633137529315bf7/2727.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3a4873fa811e09208942b58693fe5582_1588622710.html", "title": "Clear vision: Program provides ski goggles to medical staff", "title_page": "Clear vision: Program provides ski goggles to medical staff", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Feb. 12, 2018, file photo, Anna Gasser, of Austria, smiles after her run during the women's slopestyle final at the 2018 Winter Olympics in Pyeongchang, South Korea. Gasser cleaned out her closet in Austria over the weekend and found nine pairs of snow goggles. They’re all being shipped off, including the one she’s pretty certain she wore at the 2018 Pyeongchang Games. Destination: Health-care workers. (AP Photo/Lee Jin-man, File)\nFILE - In this Feb. 12, 2018, file photo, Anna Gasser, of Austria, smiles after her run during the women's slopestyle final at the 2018 Winter Olympics in Pyeongchang, South Korea. Gasser cleaned out her closet in Austria over the weekend and found nine pairs of snow goggles. They’re all being shipped off, including the one she’s pretty certain she wore at the 2018 Pyeongchang Games. Destination: Health-care workers. (AP Photo/Lee Jin-man, File)\nOlympic snowboard champion Anna Gasser cleaned out her closet in Austria over the weekend and found nine pairs of goggles.\nThey’re all being cleaned, packed and donated, including a pair she’s pretty certain she wore at the 2018 Pyeongchang Games.\nDestination: Healthcare workers.\nOlympic athletes, recreational skiers and snowboarders, resorts and businesses are contributing an assortment of ski goggles with one clear vision: To help those in the medical community who are in need of eye protection as they treat patients with COVID-19.\nIt’s part of a program called “ Goggles for Docs ,” a grassroots effort that began in late March and has already donated more than 18,000 goggles.\n“People are really stepping up to the plate,” said Dr. Ronald Gross, an acute care surgeon at St. Francis Hospital in Connecticut. “People care about each other. That’s the uplifting part.”\nBoth new and used goggles are welcome (medical personnel can disinfect and use them over again). Lenses that are tinted, clear or dark all work. Because as the website states, anything is “better than a COVID cough to the face” at a time when there’s a shortage of personal protective equipment.\nA counter on the website tracks the number of goggles the program has received. In addition, there’s a chart for how many goggles a particular place needs. For instance, 438 pairs throughout California, 288 in Missouri, 48 in Florida and 167 in Puerto Rico.\n“The snow-sports community is attacking this with such intensity,” said Jon Schaefer, the founder of the program. “We all know healthcare workers and you’re like, ‘Oh, man, I want to do something.’”\nA call to action for all of us skiers/snowboarders/anyone with goggles! Our goggles are in demand and can be a huge asset for medical workers on the front lines. My mission for today...please spread the word. https://t.co/dTt56RJrOp — Michelle Parker (@MyshellParker) April 5, 2020\nThe collection of goggles was set in motion by Dr. Michael Halperin out of New York City. He sent an email to friends in the ski community requesting 300 pairs each for three emergency departments. They were in urgent need as they dealt with the coronavirus, which causes mild or moderate symptoms for most but can include fever, cough and sometimes pneumonia requiring hospitalization.\nHis email was forwarded to Schaefer, the general manager of the Catamount (New York) and Berkshire East (Massachusetts) ski areas.\nIt hit home. Schaefer’s ski resorts were among the first to close in the U.S. to help contain the spread of the virus. His wife also is in the healthcare field.\nHe was eager to help. Same with the community. They gathered quite a few.\n“Basically, I was like, ‘I should do him a favor, and try to prevent him from getting about 10,000 goggles shipped to his back porch,’” Schaefer said.\nSo he organized a spreadsheet. From there, he received help from Inntopia, a destination analytics platform that helps keep up-to-date tabs on distribution. And from there, he picked up plenty of support through donations sparked by social media .\nAnother example of industries lending a hand to the medical community:\n— Bauer, the company that normally makes hockey equipment , began making thousands of face shields.\n— Fanatics, the company that manufactures uniforms for Major League Baseball, has suspended production on jerseys and is instead using the polyester mesh fabric to make masks and gowns for hospitals in Pennsylvania and nearby states.\n— NASCAR began using the 3D printers at its North Carolina research center to make face masks.\n“In times like this we should help each other and support each other,” said Gasser, who took home gold when Big Air made its Olympic debut in Pyeongchang. “These goggles were just in my closet. It’s better it helps someone else.”\nFreeskier Michelle Parker, who’s from Squaw Valley, California , found about 10 pairs around the house that she’s donating.\n“Anything we can do to help out,” said Parker. “These random acts of kindness go a long way to help our communities — and our own personal morality, too.”\nAnon Goggles global business director Mark Wakeling and a group of employees recently swapped out the mirrored lenses for clear ones on goggles before shipping. That way, the patients could better see their health-care providers.\nGoggles for Docs is an effort to get goggles into the hands of healthcare workers who are treating patients with COVID-19.\nWe have donated 1,100 pairs of goggles already. With your help, we can continue to support them.\nFind out more: https://t.co/ce4bn8djdb pic.twitter.com/v3383CZkEv — Burton Snowboards (@burtonsnowboard) April 2, 2020\n“We want to make it as easy as we can for these front-line people,” Wakeling said. “We all just want to get through this.”\nAnother goggles manufacturer, Scott Sports , has donated more than 3,800 pairs.\n“The ski community rallies around all kinds of efforts,” said Andrew Putt, the U.S. marketing manager for the company. “It was time for us as a global community to band together.”\nGross assembled a goggles care sheet for those using them. One thing he heavily emphasized — no need to discard the goggles after each use.\n“They’re durable,” Gross said. “Use them more than once. Use them for the entire duration.”\nThe goggles can work for all kinds of health workers, too, from the anesthesiologist to the operating room surgeon to the floor nurse.\nMarcia Glass, an associate professor of internal medicine at Tulane University, has used the goggles while treating patients.\n“Super helpful, much better than regular eye gear,” she wrote in an email.", "url": "https://apnews.com/3a4873fa811e09208942b58693fe5582"}