{"authors": ["Scott Bauer"], "date_download": "2020-05-04 20:26:53", "date_modify": "2020-05-04 20:26:53", "date_publish": "2020-04-17 16:03:27", "description": "MADISON, Wis. (AP) — Wisconsin's tenuous bipartisan detente in fighting the coronavirus pandemic broke down this week with Democratic Gov. Tony Evers’ decision to extend a stay-at-home order...", "filename": "_cbe557278c27ee3a3cfc7814a010aba5_1588624013.html", "image_url": "https://storage.googleapis.com/afs-prod/media/350e9b46fe0349fa8f1941ebe928c97b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cbe557278c27ee3a3cfc7814a010aba5_1588624013.html", "title": "Wisconsin's bipartisan detente in fighting coronavirus ends", "title_page": "Wisconsin's bipartisan detente in fighting coronavirus ends", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Feb. 6, 2020 file photo, Wisconsin Gov. Tony Evers holds a news conference in Madison, Wis. Wisconsin's tenuous bipartisan detente in fighting the coronavirus pandemic broke down this week with Gov. Evers' decision to extend a stay-at-home order through Memorial Day, a divide likely to result in lawsuits that may determine who has the power to say when the state can start to reopen. (Steve Apps/Wisconsin State Journal via AP, File)\nFILE - In this Feb. 6, 2020 file photo, Wisconsin Gov. Tony Evers holds a news conference in Madison, Wis. Wisconsin's tenuous bipartisan detente in fighting the coronavirus pandemic broke down this week with Gov. Evers' decision to extend a stay-at-home order through Memorial Day, a divide likely to result in lawsuits that may determine who has the power to say when the state can start to reopen. (Steve Apps/Wisconsin State Journal via AP, File)\nMADISON, Wis. (AP) — Wisconsin’s tenuous bipartisan detente in fighting the coronavirus pandemic broke down this week with Democratic Gov. Tony Evers’ decision to extend a stay-at-home order through Memorial Day, a divide likely to result in lawsuits that may determine who has the power to say when the state can start to reopen.\n“We’re angry, we’re frustrated and we’re trying to push back in every way that we can so we can succeed,” Republican Assembly Speaker Robin Vos said on WISN-AM on Friday. Vos said his goal was to have a legal strategy in place for next week, but he doesn’t want to file a lawsuit that could lose and result in giving Evers more power.\nWisconsin Department of Health Services Secretary Andrea Palm, at Evers’ direction, issued an order on Thursday extending the stay-at-home order from April 24 until May 26, closing schools for the academic year and most nonessential businesses. The extension gives Wisconsin the latest stay-at-home order date in the Midwest and one of the latest in the country.\nThe order came on the same day that President Donald Trump outlined steps for states seeing a steady decline in cases to start to reopen. Evers stood by his decision Friday.\n“Folks are scared and they need to know who they can trust,” Evers said in a statement. “They should trust science. They should trust our public health experts. And they should be able to trust their elected officials to make the best possible decisions based on science and facts. I can’t speak for any other elected officials, but that’s my commitment.”\nRacine County Sheriff Christopher Schmaling said in a statement Friday that his department wouldn’t enforce the safer-at-home order.\n“The overreaching measures taken by State government will have dire lifetime consequences for businesses, homeowners, and families,” Schmaling said in his statement. “I took an oath to uphold the constitutional rights of our citizens and I can not in good faith participate in the destruction of Racine County businesses or interfere in the freedoms granted to all of us by our Constitution.”\nPrior to the order extension, there were rifts between Evers and Republicans over the state’s response, but they had largely been unified. Evers signed a COVID-19 aid bill Wednesday that passed with near unanimous support in the Legislature.\nHowever, as unemployment skyrocketed with nearly 400,000 people out of work as of Friday, pressure was building to reopen businesses.\n“Republicans think the pandemic is serious. We know that it’s real,” Vos said. What’s missing from Evers is an appreciation for how the economy is “starving,” he said.\nEvers insisted he’s taking action in line with what health officials say is the best course to slow the spread of the virus and it would not help the economy to reopen before it is safe to do so. As of Friday, there were 205 COVID-19 deaths in Wisconsin and more than 4,000 confirmed cases. Health officials have said they think the curve is flattening in Wisconsin, but it could rise without continued mitigation efforts.\nVos on Friday encouraged people to attend a rally scheduled for April 24 at the state Capitol to urge Evers to reopen the state. Before Evers extended the stay-at-home order on Thursday, about 700 people said on Facebook they planned to attend. As of Friday morning that had more than tripled to 2,500, with 11,000 saying they were interested.\nThere have been similar rallies in other states.\n“My personal goal of the rally is to start bringing people together that have common goals in mind, which is to get rid of the stay at home order,” said Madison Elmer, one of the organizers. “Lots of us want to demand Gov. Evers and DHS come up with a plan for ending this. There is no plan in place. He’s not reassuring us this is going to end.”\nRepublicans are also threatening to curb powers of the state health department and fire Palm, who has largely been the most public health official detailing the state’s fight against the virus. Palm has not been confirmed yet by the state Senate.\n___\nFollow Scott Bauer on Twitter: https://twitter.com/sbauerAP", "url": "https://apnews.com/cbe557278c27ee3a3cfc7814a010aba5"}