{"authors": ["Jacob Robbins For Cnn Business Perspectives", "Jacob Robbins For"], "date_download": "2020-05-04 16:58:50", "date_modify": "2020-05-04 16:58:50", "date_publish": "2020-04-08 19:03:31", "description": "To face the coronavirus crisis head on, state governments must use their powers to get masks and other personal protective equipment (PPE) to the doctors and nurses that need them the most.", "filename": "2020_04_08_perspectives_masks-buyback-programs_index_1588611530.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408144616-health-care-worker-new-york-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_perspectives_masks-buyback-programs_index_1588611530.html", "title": "A buyback program could be the answer to mask shortages", "title_page": "A buyback program could be the answer to mask shortages (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Jacob Robbins is assistant professor of economics at the University of Illinois at Chicago and is a fellow at the Roosevelt Institute. The opinions expressed in this commentary are his own.\nTo face the coronavirus crisis head on, state governments must use their powers to get masks and other personal protective equipment (PPE) to the doctors and nurses that need them the most. As a first step, state governments should institute voluntary PPE buyback programs without delay. To pay for the policy, state governments can use some of the $150 billion the recent stimulus package gave them.\nAll across the nation, small groups of Americans are coming together to help get doctors the equipment they need: factories have begun producing masks , concerned citizens are sewing masks and groups are organizing and calling for donations. In an ideal world, the federal government would put the country on a wartime footing using the Defense Production Act (DPA) to purchase all necessary PPE and distribute them to the states that need them the most. However, the current administration has been agonizingly slow in its use of the DPA, only instituting it for the first time last month.\nA buyback program is a short-term stopgap, but a necessary one.\nIn normal times, masks and gloves are used by several types of businesses — construction firms, labs, artists, nail salons and many others. Millions of masks are also in the hands of concerned citizens, who have been buying them since news of the virus began to spread. This stockpiling of masks by private citizens is one of the reasons why there is a shortage in the first place. Under the current shortage of PPE, doctors are contracting the virus at alarming rates, putting the entire health care system at risk of collapse. While the CDC is now recommending Americans wear a mask while outdoors, first priority must go to the health care workers on the frontlines of this public health battle.\nHere's how a buyback program would work. State governments will issue orders for a voluntary buyback of masks, gloves and other protective equipment, advertise the call for the materials widely, and set up collection sites at hospitals where people can bring them in. The owners of the property would be paid fair market value, although undoubtedly some will donate them free of charge as several patriotic businesses have done so already. For those who are unable to safely come to the sites, state employees can come out and collect the equipment.\nRead More", "url": "https://www.cnn.com/2020/04/08/perspectives/masks-buyback-programs/index.html"}