{"authors": ["Charles Riley", "Cnn Business"], "date_download": "2020-05-04 17:01:22", "date_modify": "2020-05-04 17:01:22", "date_publish": "2020-04-10 11:35:13", "description": "EU finance ministers have approved €500 billion in stimulus measures designed to cushion the blow to their economies from the coronavirus pandemic, while leaving open the difficult question of how to pay for the region's recovery.", "filename": "2020_04_10_business_europe-coronavirus-stimulus_index_1588611682.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409115409-macron-merkel-0407-0409-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_business_europe-coronavirus-stimulus_index_1588611682.html", "title": "Europe has a rescue package. But who's going to pay for its coronavirus recovery?", "title_page": "Europe has a rescue package. But who's going to pay for its coronavirus recovery? - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) EU finance ministers have approved €500 billion in stimulus measures designed to cushion the blow to their economies from the coronavirus pandemic, while leaving open the difficult question of how to pay for the region's recovery.\nThe deal was announced Thursday after weeks of back and forth over how to address the crisis, a bruising process that exposed deep divisions and led Italian Prime Minister Giuseppe Conte to warn that a failure to act would mean \" the end of Europe .\"\nThe stimulus package includes up to €100 billion ($110 billion) in wage subsidies aimed at preventing mass layoffs, as well as hundreds of billions in loans to businesses and credit for EU governments. The finance ministers also pledged to work on a recovery fund that will help the region bounce back from what promises to be a historic recession.\nYet little progress was made on how to finance the response.\nNine of the countries that use the euro, including Italy and France, had called for the European Union to issue debt, dubbed corona bonds, to raise long-term finance for all member states to help repair the damage wrought by the pandemic.\nRead More", "url": "https://www.cnn.com/2020/04/10/business/europe-coronavirus-stimulus/index.html"}