{"authors": ["Reporter"], "date_download": "2020-05-04 21:07:05", "date_modify": "2020-05-04 21:07:05", "date_publish": "2020-04-30 21:32:21", "description": "YouTuber Wes Tank mashed up “The Lorax” with “Still D.R.E.” and \"Green Eggs and Ham\" with \"Forgot About Dre\" for fun while social distancing.", "filename": "entry_dr-seuss-books-rapped-over-dr-dre-beats-songs-youtube_n_5eab1a80c5b647c5cb831633_1588626425.html", "image_url": "https://img.huffingtonpost.com/asset/5eab346d220000ef0d827f59.png?cache=hx41wlcmct&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_dr-seuss-books-rapped-over-dr-dre-beats-songs-youtube_n_5eab1a80c5b647c5cb831633_1588626425.html", "title": "Dr. Seuss Books Rapped Over Dr. Dre Beats Go Viral For Being Weirdly Magical", "title_page": "Dr. Seuss Books Rapped Over Dr. Dre Beats Go Viral For Being Weirdly Magical | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "YouTuber Wes Tank has created something that is kind of like Wendy’s fries dipped into a chocolate Frosty. Initially the combination sounds strange, but somehow it works.\nThe YouTube channel of the Milwaukee-based musician and artist has been getting a ton of attention this month thanks to videos of himself rapping Dr. Seuss children’s books over Dr. Dre’s legendary hip-hop beats — and somehow, someway, it just gels.\nSo much so that many of his double-doctor mashups have gotten hundreds of thousands of views. One, in which Tank raps “Fox in Sox” over Dr. Dre’s “What’s the Difference” and “Let Me Ride” (with “much due respect to the flows and styles of Dr. Dre, Eminem, Xzibit and Snoop Dogg,” as his video’s description reads) has received over 2.3 million views.\n“It was just kind of a coincidence, it happened before a show I was playing,” Tank explained to Milwaukee news channel WMTV. “I found a copy of ‘One Fish, Two Fish, Red Fish, Blue Fish,’ and I happened to have a Dr. Dre beat on my phone.”\nHe added: “During the show I just impromptu decided to put them together. It was just kind of a spontaneous moment, and the crowd went crazy.”\nTank told Milwaukee Magazine last week that after that performance, he began getting some local attention for the act.\n“Occasionally I would rap Dr. Seuss books for hire … audiences always love it,” he said.\nSo when the coronavirus pandemic hit Wisconsin, causing some of Tank’s career plans to be put on pause, he told the magazine he found himself wondering “how I could contribute, as a creative, to what’s happening in the world” while he was in social isolation.\nTurning those live performances into a few entertaining YouTube videos was the perfect solution.\nIn each video, Tank introduces himself and what book he’ll be rapping as the music to one of Dr. Dre’s songs begins to play. The videos then shifts to Tank rapping and showing the illustrated pages of whatever Dr. Seuss book he’s reading.\n“It’s helping me stay positive,” Tank told WMTV. “And from the comments that I get reflected and the videos that people send me of their kids dancing, parents and kids dancing together, or cuddling on the couch, it just warms my heart.”\nHe added: “I never expected all of this, it’s really beautiful to see.”", "url": "https://www.huffpost.com/entry/dr-seuss-books-rapped-over-dr-dre-beats-songs-youtube_n_5eab1a80c5b647c5cb831633"}