{"authors": ["Julia Horowitz", "Cnn Business"], "date_download": "2020-05-04 16:22:25", "date_modify": "2020-05-04 16:22:25", "date_publish": "2020-04-06 11:51:30", "description": "The United States is steeling itself for a bruising week in the fight against the novel coronavirus, with President Donald Trump and the US surgeon general warning Sunday of the dark days ahead.", "filename": "2020_04_06_investing_premarket-stocks-trading_index_1588609345.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406072354-02-store-closed-coronavirus-0404-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_investing_premarket-stocks-trading_index_1588609345.html", "title": "Investors brace for a rough week as the US scrambles to fight coronavirus", "title_page": "Premarket stocks: Investors brace for a rough week as the US scrambles to fight coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here\nLondon (CNN Business) The United States is steeling itself for a bruising week in the fight against the novel coronavirus, with President Donald Trump and the US surgeon general warning Sunday of the dark days ahead.\nThe latest: There are now more than 330,000 cases in the United States, and the number of deaths recorded on Saturday was the largest number of US fatalities in a single day to date.\nThe economic picture is expected to look similarly bleak as job losses continue to mount.\nMore layoffs: Roughly 10 million Americans filed initial unemployment claims between March 15 and March 28. And unemployment shows no sign of slowing. Goldman Sachs predicts that another 5.25 million Americans filed initial jobless claims last week.\nOn Friday, Morgan Stanley downgraded its forecast for the US economy again. The investment bank now thinks that the country's economy will shrink at an annualized rate of 38% between April and June, and that the recovery \"will be more drawn out than previously anticipated.\" It predicts that the unemployment rate will spike to a record-breaking 15.7% this quarter.\nRead More", "url": "https://www.cnn.com/2020/04/06/investing/premarket-stocks-trading/index.html"}