{"authors": [], "date_download": "2020-05-04 20:18:36", "date_modify": "2020-05-04 20:18:36", "date_publish": "2020-04-09 13:46:02", "description": "IOWA CITY, Iowa (AP) — A historic surge in unemployment claims continued last week in Iowa as more workers lost their jobs in an economy devastated by the coronavirus. The U.S. Department of...", "filename": "_5dd58ce5d4d2378c760640195ec00800_1588623516.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5dd58ce5d4d2378c760640195ec00800_1588623516.html", "title": "Historic surge in unemployment claims continues in Iowa", "title_page": "Historic surge in unemployment claims continues in Iowa", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "IOWA CITY, Iowa (AP) — A historic surge in unemployment claims continued last week in Iowa as more workers lost their jobs in an economy devastated by the coronavirus.\nThe U.S. Department of Labor reported Thursday that 67,334 people in Iowa filed for unemployment benefits in the week that ended April 4. That is roughly the population of Waterloo, Iowa’s sixth largest city.\nThe labor department said the claims were a 20 percent increase over those filed in Iowa the prior week, which had been a high for the state.\nPandemic-driven layoffs across several industries were tied to Iowa’s continued surge in claims.\nIowa Workforce Development said the most claims were filed by employees in the health care and social assistance industries, manufacturing, retail, lodging and food services.\nThe agency said Monday that unemployment recipients are eligible for an additional $600 per week under a new federal law that temporarily enhanced benefits. The first of those payments should be going out in coming days.\nIn addition, the self-employed, independent contractors, gig economy workers and others who aren’t ordinary eligible for benefits may qualify.\nGov. Kim Reynolds has closed bars and dine-in restaurants and several other categories of businesses to stop the spread of the virus.", "url": "https://apnews.com/5dd58ce5d4d2378c760640195ec00800"}