{"authors": ["General Assignment Reporter"], "date_download": "2020-05-04 20:19:37", "date_modify": "2020-05-04 20:19:37", "date_publish": "2020-04-28 13:56:32", "description": "The coronavirus task force doctor critiqued the Oscar-winning actor's performance on \"Saturday Night Live.\"", "filename": "entry_anthony-fauci-brad-pitt-saturday-night-live_n_5ea8185bc5b6dd3f908aeb2a_1588623577.html", "image_url": "https://img.huffingtonpost.com/asset/5ea82e5030000027111550b1.png?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_anthony-fauci-brad-pitt-saturday-night-live_n_5ea8185bc5b6dd3f908aeb2a_1588623577.html", "title": "Anthony Fauci Tells What Most Impressed Him About Brad Pitt's 'SNL' Impersonation", "title_page": "Anthony Fauci Tells What Most Impressed Him About Brad Pitt's 'SNL' Impersonation | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "But how did it play with the real coronavirus task force expert?\nFauci, who joked earlier this month that he would want the Oscar-winning “Once Upon A Time In Hollywood” star to play him on the comedy show, told Un Nuevo Dia that Pitt nailed it on this weekend’s episode.\n“I think he did great. I mean, I’m a great fan of Brad Pitt and that’s the reason why when people ask me who I would like to play me, I mention Brad Pitt,” Fauci said on the Telemundo segment, posted Monday. (See the clip below.)\nBut Fauci, the director of the National Institute of Allergy and Infectious Diseases, was more impressed with what Pitt did out of character to end the skit.\n“I think he showed that he is really a classy guy when at the end he took off his hair and thanked me and all of the health care workers,” Fauci said. “So, not only is he a really great actor, but he is actually a classy person.”\nPitt’s Fauci, adopting a Brooklyn accent for the skit, needled President Donald Trump for declaring a vaccine would be ready “relatively soon.”\n“Relatively soon is an interesting phrase,” Pitt said as Fauci. “Relative to the entire history of Earth? Sure. ... But if you were to tell a friend I’ll be over relatively soon and then showed up a year and a half later, well your friend may be relatively pissed off.”\nAs for Pitt’s jokes, Fauci commented: “Everything he said on Saturday is what’s going on. He did a pretty good job of putting everything together.”", "url": "https://www.huffpost.com/entry/anthony-fauci-brad-pitt-saturday-night-live_n_5ea8185bc5b6dd3f908aeb2a"}