{"authors": ["Curt Anderson"], "date_download": "2020-05-04 21:09:03", "date_modify": "2020-05-04 21:09:03", "date_publish": "2020-04-04 16:18:57", "description": "ST. PETERSBURG, Fla. (AP) — Two Florida law enforcement officers have died from coronavirus as the number of positive cases in the state topped 11,500, officials said Saturday. The Palm...", "filename": "_ac87b9bccc4f6505e9539b9825b9f64a_1588626543.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ac87b9bccc4f6505e9539b9825b9f64a_1588626543.html", "title": "2 Florida officers die from coronavirus, cases top 11,000", "title_page": "2 Florida officers die from coronavirus, cases top 11,000", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ST. PETERSBURG, Fla. (AP) — Two Florida law enforcement officers have died from coronavirus as the number of positive cases in the state topped 11,500, officials said Saturday.\nThe Palm Beach County Sheriff’s Office said Sgt. Jose Diaz Ayala, 38, died Saturday. He had underlying health issues, the department said in a news release. He worked at the department for 14 years and was assigned to its corrections division.\nThe department didn’t release details about when or how Ayala contracted the disease.\nEarlier Saturday, Broward County Sheriff Gregory Tony announced that Deputy Shannon Bennett, 39, had died from the disease. Bennett, who died Friday night, was a 12-year veteran of the agency.\nThe sheriff said Bennett had worked most recently as a resource officer at Deerfield Beach Elementary School. Bennett called in sick March 23, checked into the hospital that same day and tested positive for coronavirus March 27.\nIt’s unclear exactly where or when Bennett contracted the infection, Tony said.\n“He was on duty when he reported it so as far as I’m concerned this is an ‘in the line of duty’ death,” Tony said during a news conference.\nBennett was one of 21 deputies, firefighters and civilian employees of the Broward Sheriff’s Office who have tested positive for coronavirus, Tony added. Most are self-isolated at home.\nThe law enforcement deaths come as the total number of positive coronavirus cases topped 11,500 in Florida with at least 195 deaths as of Saturday evening, according to statistics released by the Florida Department of Health.\nThe department reported Florida has now tested more than 100,000 people for the virus, second only to New York. About a quarter of those tests have been administered at the eight state-supported sites in key areas, including Hard Rock Stadium in Miami Gardens, Marlins Park in Miami, C.B. Smith Park in Broward County and Raymond James Stadium in Tampa.\n“This is an incredible achievement by any measure, and it is all due to the hard work and great sacrifice by Florida’s thousands of health care workers and first responders who are on the front lines of this fight,” Republican Gov. Ron DeSantis said in a statement. “These professionals will have the full weight of the State of Florida behind them as they continue to devote themselves to keeping Florida’s families safe.”\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough. For some, especially older adults and people with existing health problems, it can cause more severe illness, even death. The vast majority of people recover, but a surge of cases needing hospital support could overwhelm the health care system’s capacity.\n___\nAssociated Press writer Brendan Farrington in Tallahassee contributed to this story.\n___\nFollow AP news coverage of the coronavirus pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/ac87b9bccc4f6505e9539b9825b9f64a"}