{"authors": ["David Shortell", "Jeremy Herb"], "date_download": "2020-05-04 16:05:59", "date_modify": "2020-05-04 16:05:59", "date_publish": "2020-04-02 11:04:17", "description": "When a resident at an elder care facility near Madison, Wisconsin, refused to isolate Monday night after a coronavirus diagnosis, local law enforcement responded to the call for help. On the scene, a Dane County sheriff's deputy helped subdue the person and transport them to a local hospital. She was spat on in the process.", "filename": "2020_04_02_politics_first-responders-coronavirus-supplies_index_1588608359.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330082845-02-phoenix-officer-shot-0329-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_first-responders-coronavirus-supplies_index_1588608359.html", "title": "Police and firefighters warn supplies for first responders running dangerously low", "title_page": "Police and firefighters warn supplies for first responders running dangerously low - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) When a resident at an elder care facility near Madison, Wisconsin, refused to isolate Monday night after a coronavirus diagnosis, local law enforcement responded to the call for help. On the scene, a Dane County sheriff's deputy helped subdue the person and transport them to a local hospital. She was spat on in the process.\nThe sheriff's deputy was lucky. Though she had to pause her shift to deep-clean her uniform with specialized equipment at a fire station, she had been covered head to toe in protective gear -- gloves, goggles, a gown and a face mask separated her from the deadly virus that health officials say is spread through respiratory droplets.\nAs the number of coronavirus cases continues to multiply across the country, supply shortages at hospitals have come into stark view. But similar shortages are also plaguing first responders who are confronting the virus every day in the field — oftentimes before a patient even reaches the controlled environment of a hospital.\nCities and towns big and small, which employ most of the country's police officers, firefighters and EMTs, are turning to unofficial sources as they struggle to procure personal protective equipment and other supplies, like hand sanitizer, and compete for scarce federal resources.\n\"I haven't heard from a place in the United States that they've got an adequate supply of personal protective equipment at every level. Everyone we've heard from has been short or out,\" said Jim Pasco, the executive director of the National Fraternal Order of Police.\nMany cities are looking to the federal government and the Federal Emergency Management Agency for supplies — but have often found a lengthy wait and a cumbersome process before supplies trickle down to them, particularly in locations that aren't in one of the country's coronavirus hotspots.\nThe US Conference of Mayors conducted a survey of cities last week that starkly illustrated the problem for cities: 91% of cities that responded said they did not have an adequate supply of face masks, 88% lacked sufficient personal protective equipment and 62% said they had yet to receive emergency supplies from their state. Much of that equipment would be sent into the field for first responders.\nDuring past national emergencies, such as major hurricanes, earthquakes or wildfires, assistance would pour into cities from across the country, addressing any shortages, local officials said. But that's just not an option in the global coronavirus pandemic, where states are now bidding against one another — and the federal government — for critical supplies.\n\"Nobody has enough of anything, nor do I think any help is on the way,\" said Wade Kapszukiewicz, the mayor of Toledo, Ohio. \"It is our sense we are really left to fend for ourselves in a lot of ways.\"\nPolice seeking supplies elsewhere\nPolice and fire departments across the country are scrambling.\nOne Connecticut town's police department is turning to a supply of expired Army surplus masks for their officers. A rural Washington state county fire department set up a collection box for donations of gloves, masks and other items. Sheriff's deputies working at a northern Wisconsin jail wear bandanas to cover their faces when dealing with inmates. And across the country, distilleries and breweries are turning from producing alcohol to hand sanitizer to keep local departments stocked up.\nIn New York City, where the highest numbers of coronavirus cases in the US has translated to more than 1,400 sickened NYPD employees, a wave of supplies bought from a private company by the New York City Police Foundation with donated funds is on its way to bolster the country's biggest police force.\nShipments of 150,000 masks, 150,000 gloves and 150,000 packets of hand sanitizers for frontline officers are expected in the coming days.\n\"This equipment will help keep our officers physically safe. But beyond that, it sends them a clear message -- that their unwavering commitment to protecting people is deeply appreciated,\" NYPD Police Commissioner Dermot Shea said.\nFor smaller forces across the country, national police associations have played a key role. Groups like the National Fraternal Order of Police, the International Association of Chiefs of Police and the National Sheriffs' Association have leveraged relationships in Washington to sound the alarm about the protective equipment shortages.\nPasco, with the National Fraternal Order of Police, said that the White House has been especially helpful in making connections between the law enforcement group and public health officials at the Department of Homeland Security and Centers for Disease Control and Prevention.\nStill, limited national stockpiles of protective equipment has meant law enforcement is competing with medical professionals for federal prioritization.\n\"There have been promises both at the federal level, as high as the President, and at the state level, that first responders will be a priority, but we're talking weeks until that equipment can be made available,\" said Dane County, Wisconsin, Sheriff Dave Mahoney, the incoming president of the National Sheriffs Association.\n\"We can't neglect our first responders by providing all of our resources to the medical field. Oftentimes it is our first responders -- our police officers and deputy sheriffs and paramedics and our firefighters -- who are having the first contact with individuals who are suffering with the symptoms of Covid-19,\" Mahoney said.\nFrom booze to hand sanitizer\nUS Conference of Mayors President Bryan Barnett, the mayor of Rochester Hills, Michigan, said in an interview that the mayors' survey released last week came at a critical time to show the federal government how many cities were lacking supplies, in addition to the shortages that hospitals are facing.\nBarnett said he was hopeful that the number of cities in need of supplies would decrease in the coming weeks, but the US Conference of Mayors is also pushing for the White House to embrace the Defense Production Act to ramp up supplies, sending a letter Monday urging for \"full enforcement\" of the law.\nIn the interim, states are turning to local businesses, donations and any other means necessary to keep their supply shelves stocked.\nOne particular challenge for cities has been hand sanitizer, a product that's been difficult to come by for hospitals, first responders and the general public. Cities have gotten creative to get their share of sanitizer — and the most popular source seems to be the alcohol industry.\nIn Louisville, Kentucky, Mayor Greg Fischer said the state's bourbon makers have turned to producing sanitizer, helping keep his city supplied.\nA local distillery filled an order for 1,000 gallons of hand sanitizer for Dayton, Ohio, delivering the product to first responders and frontline workers, said Mayor Nan Whaley. Toledo has been getting sanitizer from both a distillery and a brewery.\nIn Santa Clara, California, the first coronavirus hotspot in the Golden State, the city has needed to prioritize giving sanitizer to its employees in the field over those with access to soap and water, according to the city's emergency services manager, Lisa Schoenthal. But she said the city was close to securing a contract to replenish its sanitizer stock — coming from a local distillery.\n\"It's the number one request we get,\" Kapszukiewicz, the Toledo mayor, said of requests from his first responders.\nSupplies from locals -- or China\nAlcohol producers transitioning from liquor to sanitizer is just one of the ways that cities have been able to get their workers the supplies they need.\nCarol Dutra-Vernaci, the mayor of Union City, California, said donations have helped them maintain their supply stockpile. One business donated N95 respirators to local law enforcement. A janitor supply company in the city gave a couple boxes of gloves.\nEven the sister cities program between the United States and China played a role: Union City's sister city, Liyang, China, donated 6,000 masks that arrived this week, now that the pandemic is subsiding in China. Dutra-Vernaci said she's asking if Liyang can spare even more.\nIn Windham, Connecticut, the police department is planning to use a supply of expired Army surplus masks, said the town's public information officer, Matt Vertefuille. The fire department bought machines with ultraviolet light to sanitize equipment and trucks, he said.\n\"We are also scrambling, trying to find space for our first responders and town employees who either get exposed or infected and don't want to take it home,\" he said.\nSome cities are in better shape than others when it comes to supplies. Jersey City, New Jersey, Mayor Steven Fulop said his city currently has an adequate supply of personal protective equipment and hand sanitizer because it stocked up early when the first cases began appearing outside of China.\n\"We got our stuff in January. That has made a huge difference for where we are today, being able to provide resources to other entities that need it,\" Fulop said, adding that the city has provided some of its supplies to local hospitals. \"If we didn't have that, we'd be in a very different place.\"\nWhile the federal government says it's ramping up its supply chain, many local officials said receiving those supplies can be cumbersome. While every state has a different system, cities generally have a two-step process before they receive supplies: Cities typically funnel up their requests to the state, often through counties, and then the state decides where the supplies it receives from the federal government should go.\nWith many states receiving only a fraction of the requests for supplies through the Strategic National Stockpile, the requests from many cities are going unanswered.\n\"The state tries to deliver what they have, but they don't have what they need either,\" Whaley said.\nThe supplies problem is lurking particularly in areas where the pandemic has not had a big impact.\nNoel Hardin, a fire chief in Asotin County, Washington, near the Idaho border, said his rural county is one of the few in Washington state that hasn't had a coronavirus case — yet. As a result, they haven't received supplies from the state, which has only been able to fill a portion of requests from counties for federal equipment.\nHis department asked the public for donations of extra items like gloves and masks, he said, setting up a drop-off point for items. He's not facing a shortage yet — but he's most concerned about needing masks and gowns should cases begin to emerge in the county.\n\"If we were to get hit with a bunch of cases all at once,\" Hardin said, \"we'd be hurting.\"", "url": "https://www.cnn.com/2020/04/02/politics/first-responders-coronavirus-supplies/index.html"}