{"authors": ["Clare Duffy", "Laura He", "Charles Riley", "Cnn Business"], "date_download": "2020-05-04 16:06:59", "date_modify": "2020-05-04 16:06:59", "date_publish": "2020-04-01 22:45:55", "description": "A global stocks sell-off spurred by coronavirus fears eased on Thursday even as new data showed that more than 6 million Americans filed for unemployment benefits last week.", "filename": "2020_04_01_investing_global-stocks_index_1588608419.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401235643-asian-financial-markets-0402-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_investing_global-stocks_index_1588608419.html", "title": "Global stocks sell-off eases despite dire US unemployment report", "title_page": "Global stocks sell-off eases despite dire US unemployment report - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York/Hong Kong/London (CNN Business) A global stocks sell-off spurred by coronavirus fears eased on Thursday even as new data showed that more than 6 million Americans filed for unemployment benefits last week.\nEuropean markets held onto small gains in afternoon trading. Germany'swas little changed while France'sincreased 0.4%. Thegained 0.5% in London.\nUS stock futures shed some gains after the report posted.futures were up 115 points, or 0.6%.futures are 0.5% higher, whilefutures have climbed 0.4%.\nEconomists surveyed by Reuters estimate that 3.5 million people filed initial unemployment claims last week.\nBut the number was much higher than expected. More than 6.6 million workers filed for their first week of unemployment benefits in the week ending March 28, according to US data.\nThat is double the previous record, set a week earlier, of 3.3 million unemployment claims.\nInvestors will get another indication of the damage done to the US labor market on Friday, when the government publishes its jobs report for March.\nNikkei 225 N225 Hang Seng HSI Shanghai Composite SHCOMP Asian markets closed mixed before the weekly US unemployment data was released. Japan'sfell 1.4% on Thursday after suffering heavy losses in the previous trading session. Hong Kong'sadded 0.4% and theincreased 1.7%.\nKevin Giddis, the chief fixed income strategist at Raymond James, said in a research note on Wednesday that investors are still getting to grips with a wave of sobering news about the coronavirus, and realizing the economic recovery may take much longer than expected.\n\"The data suggests that we may be in for a long spring and possibly still dealing with it in the summer,\" he wrote in a research note. Investors, he said, should \"keep in mind that [market] volatility is likely to be with us for a while and that days of extreme highs and lows may be part of what could be a called a 'normal trading pattern.' \"\nCrude oil futures moved sharply higher on Thursday after President Donald Trump said he expected Saudi Arabia and Russia to quickly end a price war that has put US shale producers under huge pressure.\nUS crude jumped 9% to trade at $22.20 a barrel. Brent crude, the global oil benchmark, gained nearly 10% to trade at $27.01 a barrel. Both varieties of crude oil lost roughly half their value last month after Saudi Arabia said it would abandon efforts to restrict supplies.", "url": "https://www.cnn.com/2020/04/01/investing/global-stocks/index.html"}