{"authors": ["Jordan Valinsky", "Cnn Business"], "date_download": "2020-05-04 16:00:08", "date_modify": "2020-05-04 16:00:08", "date_publish": "2020-04-01 13:18:01", "description": "The coronavirus pandemic has forced millions of Americans to stay home, and they're drinking a lot of alcohol to pass time — for now.", "filename": "2020_04_01_business_alcohol-sales-coronavirus-trnd_index_1588608008.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401071347-01-alcohol-coronavirus-brooklyn-0320-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_business_alcohol-sales-coronavirus-trnd_index_1588608008.html", "title": "Booze sales are booming as people stockpile alcohol ... but it may not last", "title_page": "Booze sales are booming as people stockpile alcohol ... but it may not last - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) The coronavirus pandemic has forced millions of Americans to stay home, and they're drinking a lot of alcohol to pass time — for now.\nAlcoholic beverage sales shot up 55% in the third week of March compared to the same time a year ago, according to Nielsen. That's when several states, including New York, ordered people to \"shelter in place.\" Those social distancing guidelines limited people from hanging out and restaurants and bars were ordered to close. However, many stores selling alcohol -- including liquor outlets or grocery stores -- stayed open.\nPeople quickly stocked up on spirits, wine and beer. Ready-to-drink cocktails, such as spiked lemonades or canned gin and tonics, grew the most: a 106% spike in sales, according to Nielsen. Hard seltzer sales also remained strong with White Claw and Truly remaining the top-selling brands.\nSales of beer, which has been gradually falling out favor with the American drinker, also soared. Nielsen said that larger packs of 24 or 30 both grew roughly 90% for the week compared to a year ago as people were preparing to limit their outside errands.\nMarch 21 will probably be the peak for alcohol sales, predicted Danelle Kosmal, vice president of Nielsen's Beverage Alcohol Practice Area. Subsequent weeks will be a \"better indicator of the new normal in how consumers are responding to the crisis,\" as people consume the alcohol they've stockpiled The week ending onMarch 21 will probably be the peak for alcohol sales, predicted Danelle Kosmal, vice president of Nielsen's Beverage Alcohol Practice Area. Subsequent weeks will be a \"better indicator of the new normal in how consumers are responding to the crisis,\" as people consume the alcohol they've stockpiled and as more Americans lose their jobs\nRead More", "url": "https://www.cnn.com/2020/04/01/business/alcohol-sales-coronavirus-trnd/index.html"}