{"authors": [], "date_download": "2020-05-04 20:16:24", "date_modify": "2020-05-04 20:16:24", "date_publish": "2020-04-08 20:13:08", "description": "WRIGHTSVILLE BEACH, N.C. (AP) — A North Carolina beach town is increasing fines for people who violate beach closures in light of rules established as the result of the COVID-19...", "filename": "_0a32099a05ed2104dff295fa61d9df05_1588623384.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0a32099a05ed2104dff295fa61d9df05_1588623384.html", "title": "North Carolina beach increases fines for violators", "title_page": "North Carolina beach increases fines for violators", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WRIGHTSVILLE BEACH, N.C. (AP) — A North Carolina beach town is increasing fines for people who violate beach closures in light of rules established as the result of the COVID-19 pandemic.\nOfficials in Wrightsville Beach say if people are caught on the beach in violation of the public beach closures, they could face fines of up $650 and potential court costs, WWAY reported.\nBefore the change, offenders faced a misdemeanor that carried a $150 fine. After handing out 18 citations to people violating public beach closures over the weekend, the town said changes were needed.\nTown leaders passed an ordinance allowing police to charge anyone caught on the beach with a $500 civil penalty up to the officer’s discretion.\nFormer Wrightsville Beach mayoral candidate Greg Buscemi suggested the only reason for the change is the loss of parking revenues. Mayor Darryl Mills said the change was to give officers some flexibility and an alternative to giving someone a criminal record.\nHowever Buscemi said a civil fine doesn’t give the violator a chance to defend themselves in court. He believes what the town is doing is illegal and said he plans to sue the town if they do not reconsider the ordinance.", "url": "https://apnews.com/0a32099a05ed2104dff295fa61d9df05"}