{"authors": ["Steve Peoples", "Scott Bauer"], "date_download": "2020-05-04 20:20:51", "date_modify": "2020-05-04 20:20:51", "date_publish": "2020-04-08 04:15:39", "description": "MADISON, Wis. (AP) — If Wisconsin was a test case for voting in the age of the coronavirus, it did not go well for many voters. Thousands were forced to congregate for hours in long lines on...", "filename": "_aa523f32485973008fb954f7ef4e4b04_1588623651.html", "image_url": "https://storage.googleapis.com/afs-prod/media/5346da08d3ff471eb3a624ad3fb58e25/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_aa523f32485973008fb954f7ef4e4b04_1588623651.html", "title": "Wisconsin voters forced to choose between health, democracy", "title_page": "Wisconsin voters forced to choose between health, democracy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "An election official cleans a voting booth before a person votes at Riverside High School, in Milwaukee on Tuesday, April 7, 2020. The Wisconsin primary is moving forward in the wake of the coronavirus epidemic after Gov. Tony Evers sought to shut down Tuesday's election in a historic move Monday that was swiftly rejected by the conservative majority of the Wisconsin Supreme Court by the end of the day. (Mike De Sisti/Milwaukee Journal-Sentinel via AP)\nAn election official cleans a voting booth before a person votes at Riverside High School, in Milwaukee on Tuesday, April 7, 2020. The Wisconsin primary is moving forward in the wake of the coronavirus epidemic after Gov. Tony Evers sought to shut down Tuesday's election in a historic move Monday that was swiftly rejected by the conservative majority of the Wisconsin Supreme Court by the end of the day. (Mike De Sisti/Milwaukee Journal-Sentinel via AP)\nMADISON, Wis. (AP) — If Wisconsin was a test case for voting in the age of the coronavirus , it did not go well for many voters.\nThousands were forced to congregate for hours in long lines on Tuesday with no protective gear. Thousands more stayed home, unwilling to risk their health and unable to be counted because requested absentee ballots never arrived.\nVoters reported being afraid, angry and embarrassed by the state’s unwillingness to postpone their presidential primary elections as more than a dozen other states have already done. Neither Joe Biden nor Bernie Sanders will be declared a winner at least until next Monday in accordance with one of several court orders that shaped the contest.\nAnd there was evidence that minority voters were disproportionately impacted by widespread poll closures in their communities. Michael Claus, 66, wore a protective mask and a Tuskegee Airmen cap, as he waited to vote.\nThe African American man said he tried to vote absentee and requested a ballot in March but it never showed up. His only option was to vote in person. He blamed the Republican-controlled state legislature.\n“They could have delayed the election with no problem,” Claus said. “They decided if they can suppress the vote in Milwaukee and Madison, where you have a large minority presence, you can get people elected you want elected. And that’s sad.”\nThe chaos in Wisconsin, a premiere general election battleground, was expected to reverberate across states that still have primaries ahead. Alaska, Wyoming and Ohio are conducting contests by mail this month, and other states, including Georgia, are slated to hold in-person voting in May.\nElection experts warned that Wisconsin was an example of what not to do. And the experience added immediate context to the broader debate about protecting voting rights this November.\n“We have moved forward with an election, but we have not moved forward with democracy in the state of Wisconsin,” warned Neil Albrecht, executive director of Milwaukee’s election commission.\nWith results not coming until next week, the state did not offer Biden the knockout blow he hoped for in his presidential nomination fight against Sanders. The candidates spoke out late Tuesday on separate livestreams from the safety of their homes hundreds of miles (kilometers) away but had little to say about the Wisconsin contest.\nSanders didn’t say a word about the election on Tuesday after warning the night before that the holding the election was “dangerous” and “may prove deadly.” Biden, too, said in-person voting shouldn’t have taken place.\nDemocrats in and out of Wisconsin had pushed for the contest to be postponed, yet Republicans — and the conservative-majority state Supreme Court — would not give in . The fight over whether to postpone the election was influenced by a state Supreme Court election also being held Tuesday. A lower turnout was thought to benefit the conservative candidate.\nLest there be any doubt about the GOP’s motivation, President Donald Trump on Tuesday broke from health experts who have encouraged all Americans to stay home by calling on his supporters to “get out and vote NOW” for the conservative judicial candidate.\nThe election was unlike virtually any other in recent memory. Milwaukee, the state’s largest city, opened just five of its 180 traditional polling places, forced to downsize after hundreds of poll workers stepped down because of health risks. The ensuing logjam forced voters to wait together in lines spanning several blocks in some cases. Many did not have facial coverings .\nAs of Tuesday night, Wisconsin reported more than 2,500 coronavirus infections and 92 related deaths — 49 of them in Milwaukee County, where the voting lines were longest.\nMilwaukee is home to the state’s largest concentration of black voters, a community that has been hit harder than others during the pandemic. Reduced minority turnout would benefit Republicans in a series of state and local elections.\nThe unprecedented challenge created chaotic scenes across the state — and a variety of health risks for voters and the elected officials who fought to keep polls open.\nThey included Robin Vos, the Republican speaker of the state Assembly, who joined more than 2,500 National Guard troops dispatched to help staff voting stations. While many voters stranded in lines for more than an hour did not have any protective equipment, Vos donned a face mask, safety glasses, gloves and a full protective gown.\nIn Madison, city workers erected Plexiglas barriers to protect poll workers, and voters were encouraged to bring their own pens to mark the ballots.\nFull Coverage: Election 2020\nTens of thousands of voters who received absentee ballots had not returned them as of Tuesday, Albrecht said. He noted that his office received hundreds of calls from people who didn’t get an absentee ballot or were concerned theirs hadn’t been delivered to election officials.\nMilwaukee resident Megan Nakkula, 30, was forced to vote in person after requesting an absentee ballot but never receiving it.\n“It’s been a very emotional day thinking about what the outcome of this could be,” she said, holding back tears. “It just doesn’t feel like it was the safest decision to do. I saw a lot of elderly voters, people who were high risk and everyone is taking as many precautions as they could. We were 6 feet apart, but you know, we don’t know what we don’t know about this virus at this point in time, and it’s really scary.”\n___\nPeoples reported from Montclair, New Jersey. Associated Press writers Gretchen Ehlke and Carrie Antlfinger in Milwaukee and Amy Forliti and Doug Glass in Minneapolis contributed to this report.\n___\nCatch up on the 2020 election campaign with AP experts on our weekly politics podcast, “Ground Game.”", "url": "https://apnews.com/aa523f32485973008fb954f7ef4e4b04"}