{"authors": ["David Eggert", "Ed White"], "date_download": "2020-05-04 20:22:16", "date_modify": "2020-05-04 20:22:16", "date_publish": "2020-04-17 15:06:04", "description": "LANSING, Mich. (AP) — Gov. Gretchen Whitmer said Friday that she hopes to begin gradually reopening Michigan's economy on May 1 after weeks of a strict stay-at-home order during the coronavirus...", "filename": "_1fae7f6efd7329285c21284b04a84338_1588623736.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f9bc5dcf76884104b4e548fbb1db46ee/1728.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1fae7f6efd7329285c21284b04a84338_1588623736.html", "title": "Whitmer eyes reopening economy; rise in virus cases slows", "title_page": "Whitmer eyes reopening economy; rise in virus cases slows", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this April 13, 2020 file photo, provided by the Michigan Office of the Governor, Michigan Gov. Gretchen Whitmer addresses the state during a speech in Lansing, Mich. Seven Midwestern governors announced Thursday, April 16, 2020 that they will coordinate on reopening their state economies amid the coronavirus pandemic, after similar pacts were made in the Northeast and on the West Coast. The latest agreement includes Illinois, Ohio, Michigan, Indiana, Wisconsin, Minnesota and Kentucky.(Michigan Office of the Governor via AP, Pool)\nFILE - In this April 13, 2020 file photo, provided by the Michigan Office of the Governor, Michigan Gov. Gretchen Whitmer addresses the state during a speech in Lansing, Mich. Seven Midwestern governors announced Thursday, April 16, 2020 that they will coordinate on reopening their state economies amid the coronavirus pandemic, after similar pacts were made in the Northeast and on the West Coast. The latest agreement includes Illinois, Ohio, Michigan, Indiana, Wisconsin, Minnesota and Kentucky.(Michigan Office of the Governor via AP, Pool)\nLANSING, Mich. (AP) — Gov. Gretchen Whitmer said Friday that she hopes to begin gradually reopening Michigan’s economy on May 1 after weeks of a strict stay-at-home order during the coronavirus crisis that has crippled businesses and caused more than 1 million unemployed people to seek aid.\nMeanwhile, the number of new virus cases statewide rose 2%, a much slower pace. In Detroit, where nearly 600 people have died, Mayor Mike Duggan reported upbeat news from hospitals, declaring: “We are beating this thing.”\nWhitmer didn’t identify which businesses may be allowed to open but said the restrictions will be relaxed in phases. She said there would be many factors: indoors work or outdoors; the number of employees; their proximity to each other; and their interaction with the public.\nIt will be “based on facts, science and what is the best medical advice we can get,” Whitmer said.\nThe Democratic governor’s stay-home order, among the nation’s toughest in a state blitzed by the pandemic, runs through April 30 and prompted a protest Wednesday at the Michigan Capitol that drew thousands of people.\n“I am hopeful that come May 1, we will make some steps forward,” Whitmer said during a tele-town hall hosted by the Detroit Regional Chamber, a business organization.\nThe number of people in Michigan with the coronavirus rose 2% to 30,023, the state said, the day after a 4% rise. Many of those people have long recovered. Deaths from COVID-19, the respiratory illness caused by the virus, increased by 134, or 6%, to 2,227.\n“You’re the reason we’re driving this curve down,” Whitmer said of residents following her stay-home order.\nTRUMP AND TWITTER\nPresident Donald Trump used Twitter to urge his supporters to “LIBERATE” Michigan and two other states led by Democratic governors, employing the same rhetoric some supporters have used to demand the lifting of orders.\nWhitmer hoped the tweet doesn’t encourage more protests.\n“There’s a lot of anxiety, and I think the most important thing that anyone with a platform can do is to try to use that platform to tell people, ‘We’re going to get through this.’ We will re-engage our economy when it’s safe,” she said.\nWhitmer said Michigan has many regions, different types of businesses and places where people travel more than others to work.\n“These are all factors that enhance or bring down risk,” the governor said.\nA REPLY TO SHERIFFS\nWhitmer is being sued for the travel, work and recreation restrictions that she says “protect life.” She’s also been challenged by four sheriffs who said they would not strictly enforce them.\n“I’ve never contemplated that we would have local law enforcement writing tickets for every violation. But the fact of the matter is we have to take this seriously,” said Whitmer, who claimed her orders have saved 17,000 people from being infected.\nDETROIT STRATEGY\nDetroit plans to offer drive-thru virus testing to businesses with employees who are allowed to interact with the public.\n“We got folks going to work every day at gas stations, grocery stores, banks, a whole series of businesses that we need. They aren’t able to shelter in place,” Duggan said.\nSeparately, he said the battle against the virus is focused on the city’s nursing homes, where about 100 residents or staff have died of COVID-19. Aggressive testing will continue.\nAround Michigan, there were at least 243 “congregate care” sites, such as nursing homes, with outbreaks, said Dr. Joneigh Khaldun, the state’s chief medical executive.\nCONTACT TRACING\nKhaldun said the state has been training people to conduct contact tracing to help douse sparks of infection. The process involves calling people who test positive, tracking down their contacts and getting them into quarantine.\nThe state sent a team to the Detroit area and plans to roll out tracing statewide, Khaldun said.\nMONDAY CRUSH\nMichigan’s deluged unemployment agency told people to avoid certifying their claims online Monday. The jobless were advised to consider another day and choose off-peak hours. The unemployment website was down for hours last Monday due to unprecedented demand. More than 1 million people have filed initial claims over a month.\n___\nWhite reported from Detroit. Corey Williams in West Bloomfield, Michigan, contributed to this report.", "url": "https://apnews.com/1fae7f6efd7329285c21284b04a84338"}