{"authors": ["Nicole Chavez", "Dakin Andone", "Faith Karimi"], "date_download": "2020-05-04 17:03:56", "date_modify": "2020-05-04 17:03:56", "date_publish": "2020-04-10 07:53:00", "description": "The number of confirmed coronavirus cases in the United States topped 500,000 on Friday as health officials reported the highest number of death in a single day.", "filename": "2020_04_10_health_us-coronavirus-friday_index_1588611836.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408162250-04-hf-coronavirus-new-york-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_health_us-coronavirus-friday_index_1588611836.html", "title": "US coronavirus cases top 500,000 as researchers say the worst is yet to come in Texas and Florida", "title_page": "US coronavirus cases top 500,000 as researchers say the worst is yet to come in Texas and Florida - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The number of confirmed coronavirus cases in the United States topped 500,000 on Friday as health officials reported the highest number of death in a single day.\nAs of Friday evening, 18,637 people in the United States have died of coronavirus, according to a tally by Johns Hopkins University , an increase of 1,953 deaths from Thursday. Worldwide, there are 1.69 million confirmed cases and more than 102,000 reported deaths.\nThe grim milestone comes as researchers warned that lifting social distancing measures too soon could lead to a setback in the pandemic mitigation.\nThe latest version of an influential model tracking the coronavirus pandemic estimated the US will see peak daily death numbers on Friday instead of Sunday.\nThe peak use of resources -- like hospital beds and ventilators -- will be on or around Saturday as suggested earlier this week, according to the Institute for Health Metrics and Evaluation at the University of Washington in Seattle.\nStates like New York and New Jersey may have already passed their peaks this week, but Florida and Texas could see the worst by the end of the month, according to the IHME model.\nDr. Chris Murray, director at the IHME, said that even if the country sees a decrease in the number of deaths, ending mitigation efforts -- like stay-at-home orders or social distancing -- could have a negative effect by the summer.\n\"If we were to stop at the national level by May 1, we are seeing (in models) a return to almost where we are now sometime in July,\" Murray said on CNN's AC360.\nThe IHME's modeling also estimates more people will die from coronavirus than previously predicted.\nOn Wednesday, the IHME estimated that 60,415 in the US would die of coronavirus by August, assuming social distancing policies continue through May. On Friday, that estimate increased to 61,500.\nWhite House coronavirus response coordinator Dr. Deborah Birx said health officials seeing a leveling of the curve for the first time since the pandemic hit the country but urged Americans to continue mitigation efforts.\n\"So it's really about the encouraging signs that we see, but as encouraging as they are, we have not reached the peak, and so every day we need to continue to do what we did yesterday, and the week before, and the week before that,\" Birx said at a White House news conference on Friday.\nInfections would increase if stay-at-home orders are lifted at 30 days, projections show\nAfter federal officials began discussing what it would take for the US to reopen this week, new government projections indicate that coronavirus infections and deaths may dramatically increase if social distancing and other measures are lifted after only 30 days.\nThe projections, obtained by The New York Times, were drafted by the Department of Homeland Security and the Department of Health and Human Services and dated April 9. The projections don't indicate when those spikes would take place, the Times reported.\nThe Times reported that the documents outline three scenarios, including one where no restrictions are imposed and another where 25% of people telework, some social distancing continues, and schools remain closed until the summer months. The third scenario adds a 30-day shelter-in-place to the restrictions in the second scenario.\nIf stay-at-home orders are lifted after 30 days, report says, there would be a bump in the demand for ventilators and the death toll could reach 200,000, according to the Times.\nA Health and Human Services spokesperson told CNN's Kristen Holmes, \"We do not comment on any alleged, leaked documents.\" CNN has reached out to the Department of Homeland Security for comment.\nPresident Donald Trump said he is hoping to reopen the country by a certain date, but he won't do anything until he knows the country will be healthy.\n\"We don't want to go back and start doing it over again, even though it would be in a smaller scale,\" Trump said during Friday's White House coronavirus briefing.\nEarlier on Friday, the nation's top infections disease expert cautioned against reopening too early, saying there should be a clear indication that the country is \"strongly going in the right direction.\"\n\"So, even though we're in a holiday season, now is no time to back off,\" said Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, told CNN. \"As I say so often, now is the time to actually put your foot on the accelerator. Because we're going in the right direction.\"\nAntibody tests could be available this month\nAntibody tests that would verify whether a person recently had the novel coronavirus could be available within a week, according to the nation's top infectious disease expert.\n\"Within a period of a week or so, we're going to have a rather large number of tests that are available,\" Fauci said on CNN's New Day Friday morning.\nHaving antibodies to the coronavirus could mean someone is protected from getting re-infected, making such tests important for medical workers and others on the front lines fighting the pandemic.\n\"If their antibody test is positive, one can formulate strategies about whether or not they would be at risk or vulnerable to getting re-infected,\" Fauci explained.\nTests that would identify a current infection would still be important, he said, and used in parallel with antibody tests, which still need to be validated.\n\"But as we look forward, as we get to the point of at least considering opening up the country as it were, it's very important to appreciate and to understand how much that virus has penetrated this society,\" Fauci said. \"Because it's very likely that there are a large number of people out there that have been infected, have been asymptomatic and did not know they were infected.\"\nAntibody tests are used in other clinical scenarios, said Dr. Colleen Kraft, associate chief medical officer of Emory University Hospital in Atlanta. Soon, she said, we'll learn whether a coronavirus antibody test \"tells us that somebody can go back to work, for instance, tells us that somebody is no longer infectious, and tells us that somebody cannot get the virus again.\"\nAs officials begin discussing what it would take for the US to reopen, there could be \"merit\" to the idea of Americans carrying certificates of immunity that prove they have tested positive for coronavirus antibodies, Fauci said.\nFauci told CNN, \"It's one of those things that we talk about when we want to make sure that we know who the vulnerable people are and not.\"\nSocial distancing appears to be working, officials say\nAmericans need to continue to adhere to social distancing guidelines throughout the coming holiday weekend, Fauci said Friday.\n\"Because it is working,\" he said. \"The kinds of mitigations that we're doing now, the curves that we're seeing flattening and coming down, that's exactly and precisely because of what the American public is doing.\"\nSome states remain cautiously optimistic with the latest developments.\nIn New York, Gov. Andrew Cuomo said Friday that there was a dramatic decline\" in the hospitalization rate averaged over the past three days.\n\"Overall, New York is flattening the curve,\" Cuomo said.\nThe number of deaths, though, remained close to Wednesday's high, down to 777 from 799. Cuomo described the deaths as a lagging indicator, saying those who don't make it tend to have been hospitalized the longest.\nConnecticut Gov. Ned Lamont said new hospitalizations are dropping, while Arkansas Gov. Asa Hutchinson announced the state has the lowest number of hospitalizations per 100,000 people compared to other neighboring states.\nAnd while the number of coronavirus-related deaths continues to increase in Ohio, the number of people impacted by the virus is lower than previously projected, Gov. Mike DeWine said.\n\"Ohioans have done a great job,\" the governor told CNN's Jim Sciutto Friday. \"They've changed the future, but we've got to keep doing it.\"\nCalifornia Gov. Gavin Newsom said the state has seen a 1.9% drop of people in ICU, and the stay-at-home order appears to be working.\n\"I think we're seeing the consequences of that when we see that our mortality rate is really a lot lower than what have been predicted, and it really shows that this mitigation works,\" said Dr. Robert Redfield, director of the US Centers for Disease Control and Prevention.\nWhile maintaining social distancing measures appears to be holding down the spread in some areas, reopening the country will require a strategy and understanding the extent of the transmission, experts say.\n\"It's not going to be one size fits all. It's going to be using the data that we have from surveillance to really understand where it is the most important places for us to begin to reopen,\" Redfield said.\nCDC won't recommend hydroxychloroquine, director says\nOn Thursday, Trump said more than 2 million coronavirus tests have been completed in the US. But he also suggested mass testing would not happen.\n\"We want to have it and we're going to see if we have it. Do you need it? No. Is it a nice thing to do? Yes,\" the President said. \"We're talking about 325 million people and that's not going to happen, as you can imagine, and it would never happen with anyone else, either.\"\nStates are rushing to get hydroxychloroquine, an antimalarial drug that President Trump has touted as potential treatment and a \"game changer.\" The drug has not been fully tested but some states are gathering doses for their patients. The CDC's Redfield said he does not recommend the drug.\n\"At this stage, at this moment in time, we're not recommending it, but we're not, not recommending that,\" Redfield said. \"We're recommending for the physician and the patient to have that discussion.\"\nThe CDC removed its website guidelines for doctors on how to prescribe hydroxychloroquine and chloroquine. Trump has pressed federal health officials to make the drugs more widely available despite little reliable evidence that they are effective at treating the virus.\nJUST WATCHED CDC director: US coming to the coronavirus peak Replay More Videos ... MUST WATCH CDC director: US coming to the coronavirus peak 02:07\n\"We're very comfortable in responding when we have data that is compelling,\" Redfield said Thursday on CNN's Global Town Hall. \"CDC, as an organization ... we're not an opinion organization. We're a science-based, data-driven organization. So, I do think this is going to be an independent decision of these health care providers and patients.\"\nDespite the lack of a vaccine, the CDC is preparing for what could happen next year, which is expected to be challenging as well, Redfield said, adding that proactive steps will change the way the country deals with another outbreak.\n\"That includes early case identification, isolating people who are sick and tracing those that the person has come into contact with while they were contagious,\" he said. \"We don't have to go through the serious mitigation steps that we're taking to get us under control.\"", "url": "https://www.cnn.com/2020/04/10/health/us-coronavirus-friday/index.html"}