{"authors": ["Entertainment Writer"], "date_download": "2020-05-04 20:03:27", "date_modify": "2020-05-04 20:03:27", "date_publish": "2020-05-04 18:24:20", "description": "Author Stephenie Meyer said that “Midnight Sun” will retell the vampire saga from Edward Cullen’s perspective.", "filename": "entry_twilight-midnight-sun-stephenie-meyer-kristen-stewart_n_5eb03831c5b684fc457a177a_1588622607.html", "image_url": "https://img.huffingtonpost.com/asset/5eb040cc2200000e108281e4.png?cache=c7tw1o4gxd&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_twilight-midnight-sun-stephenie-meyer-kristen-stewart_n_5eb03831c5b684fc457a177a_1588622607.html", "title": "Don’t Tell Kristen Stewart, But A New ‘Twilight’ Book Is Coming This Summer", "title_page": "Don’t Tell Kristen Stewart, But A New ‘Twilight’ Book Is Coming This Summer | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "It’s Edward Cullen’s time to shine — or, well, glitter — in the next chapter of the “Twilight” book saga, which hits shelves this summer, 15 years after the first novel was released.\nFans will finally get to sink their teeth into the long-awaited new story from author Stephenie Meyer, titled “Midnight Sun.” The fifth book in the series retells the vampire love epic from the perspective of the brooding and bloodthirsty heartthrob — played on the big screen by Robert Pattinson — who falls in love with human high schooler Bella Swan (played in the films by Kristen Stewart).\nMeyer broke the news in a prerecorded video message broadcast on “Good Morning America” on Monday.\n“I am very excited to finally, finally announce the release of ‘Midnight Sun’ on Aug. 4th,” she said. “It’s a crazy time right now, and I wasn’t sure it was the right time to put this book out, but some of you have been waiting for just so, so long, it didn’t seem right to make you wait anymore.”\nJUST IN: 15 years after the first novel in the “Twilight” saga was released, author Stephenie Meyer is bringing readers back to Forks, Washington, with her new book, “Midnight Sun.” Find the details here: https://t.co/IHD4UfAkkI pic.twitter.com/ZY3ZqnBahG — Good Morning America (@GMA) May 4, 2020\nMany suspected that major “Twilight” news was on its way after a mysterious countdown appeared on Meyer’s website last week.\nDie-hard fans of the hugely popular young adult novels have been waiting more than a decade for “Midnight Sun,” which Meyer initially intended to publish back in 2008.\nBut hackers leaked her unfinished manuscript online, so she shelved the book indefinitely and chose to release the draft online.\nMeyer said she “thought seriously about delaying” the novel again, given the current coronavirus outbreak, but decided to release it anyway, given just how long fans have waited.\n“I know how much I personally need distractions right now, how much I need something to look forward to, and most of all, how much I need more books to read,” Meyer said in a statement. “So, I hope this book gives my readers a little pleasure to anticipate and, after it arrives, a chance to live in an imaginary world for a while.”\nThe publisher’s description of the 672-page sequel promises readers they will learn “fascinating details about Edward’s past and the complexity of his inner thoughts.”\nMeyer told USA Today that the book will be “definitely darker” and “more desperate” than the previous entries.\nLuca Teuchmann via Getty Images Kristen Stewart and Robert Pattinson attend the 'Twilight Saga: Breaking Dawn Part 2' premiere in 2012.\nThe series, of course, spawned a successful movie franchise, making huge stars out of Pattinson and Stewart, who haven’t exactly hidden their mixed feelings about the films over the years.\nThe “Charlie’s Angels” star sarcastically expressed enthusiasm for rebooting the franchise in an “Entertainment Tonight” interview back in 2018.\nPattison, however, seemed more open to the possibility, telling Yahoo in 2017 that he’s “curious” about the idea.\n“Really, they’re expanding it? So I’ll get my own spin-off?” he told the outlet. “Anything where there’s a mass audience — or seemingly an audience for it — I always like the idea of subverting people’s expectations. There could be some radical way of doing it, which could be quite fun. It’s always difficult when there’s no source material.”", "url": "https://www.huffpost.com/entry/twilight-midnight-sun-stephenie-meyer-kristen-stewart_n_5eb03831c5b684fc457a177a"}