{"authors": ["Veronica Stracqualursi"], "date_download": "2020-05-04 16:18:49", "date_modify": "2020-05-04 16:18:49", "date_publish": "2020-04-04 15:45:38", "description": "When Georgia Gov. Brian Kemp issued a statewide shelter in place order for residents earlier this week, he attracted widespread criticism for saying he and state officials were just \"finding out that this virus is now transmitting before people see signs,\" despite publicly available findings that have circulated for weeks about such risks.\nThe statement drew incredulity from many, especially from some of those in the medical and public health community.", "filename": "2020_04_04_politics_georgia_1178cb61bbf5c683630b594be3b1b1db_index_1588609129.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403013100-georgia-governor-brian-kemp-how-does-covid-19-spread-asymptomatic-transmission-orig-me-00001217-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_politics_georgia_1178cb61bbf5c683630b594be3b1b1db_index_1588609129.html", "title": "Under fire, Georgia governor seeks to explain his delay in implementing shelter in place", "title_page": "Under fire, Georgia governor seeks to explain his delay in implementing shelter in place - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) When Georgia Gov. Brian Kemp issued a statewide shelter in place order for residents earlier this week, he attracted widespread criticism for saying he and state officials were just \"finding out that this virus is now transmitting before people see signs,\" despite publicly available findings that have circulated for weeks about such risks. The statement drew incredulity from many, especially from some of those in the medical and public health community.\n\"It's just inexcusable,\" CNN Chief Medical Correspondent Dr. Sanjay Gupta said Thursday night . \"My kids, who go to school in Georgia, knew that a month ago. I can't even believe that.\"\nThe governor's office says Kemp, a Republican, was referring to fresh guidance from the Centers for Disease Control and Prevention, which said earlier this week that exposure risk could happen two days before symptoms begin. But Kemp's office, in response to questions about his public pronouncement, pointed to public statements they'd put out for weeks about the possibility of asymptomatic people spreading the virus.\n\"There is a significant risk that individuals who seem healthy could visit a facility and unintentionally endanger residents. As such, it is critical that we take these precautions to protect the frail and elderly,\" Kemp's office said in a March 16 news release about the need to restrict visitors from long-term care facilities.\n\"If you continue to go to work, school, or other gatherings -- even if you are not experiencing symptoms -- you may be putting others at risk,\" his office said on March 20 , this time about the need for social distancing\nJUST WATCHED Funerals turn small town into coronavirus hotspot Replay More Videos ... MUST WATCH Funerals turn small town into coronavirus hotspot 03:12\nSuch statements are at odds with Kemp's comments Wednesday in Atlanta -- where the CDC is headquartered -- when he finally issued the statewide stay-at-home order that many experts, including Dr. Anthony Fauci, the country's top infectious disease expert , had already been calling for nationwide.\n\"What we've been telling people from directives from the CDC for weeks now that if you start feeling bad, stay home. Those individuals could have been infecting people before they ever felt bad. But we didn't know that until the last 24 hours,\" Kemp said.\nOn Monday, the CDC updated its guidance on the period of exposure risk, upgrading it from the \"onset of symptoms\" to \"48 hours before symptom onset.\"\nThat shift was a \"game changer\" that moved Kemp to issue the shelter in place order for all of Georgia, he said at Wednesday's news conference.\nBut as of January 30, the CDC was noting in its guidance for managing patients with coronavirus that \"clinical presentation among reported cases of 2019-nCoV infection varies in severity from asymptomatic infection or mild illness to severe or fatal illness.\"\nCDC Director Dr. Robert Redfield was speaking publicly about the possibility of asymptomatic transmission as early as mid-February , when he expressed such concerns to Gupta.\nAnd a month later, Dr. Deborah Birx, one of the most visible members of the White House task force addressing the pandemic, warned of the reality of asymptomatic transmission.\n\"We know there is virus spread before you develop symptoms, and then we know that there's a large group -- we don't know the precise percent yet -- that actually is asymptomatic or has such mild cases that they continue to spread the virus,\" she said at the White House on March 16.\nJUST WATCHED Anderson Cooper stunned by Georgia governor's remarks Replay More Videos ... MUST WATCH Anderson Cooper stunned by Georgia governor's remarks 02:00\nWhen asked by CNN how Kemp could know of the possibility of asymptomatic spread for weeks but say Wednesday that \"we didn't know that until the last 24 hours,\" Cody Hall, a spokesman, said Kemp \"was referring to the updated CDC guidelines and Dr. Redfield's statements about the rate of transmission and prevalence of asymptomatic transmission -- not the existence of asymptomatic transmission.\"\nMeanwhile, correspondence among Georgia officials further suggests the risk of asymptomatic transmission was known for weeks before Kemp's order.\nAn email obtained by progressive watchdog Accountable.US via a public records request and shared with CNN showed that the head of the state's Department of Public Health, Dr. Kathleen Toomey, was advised in early March to inform the public that people who didn't display symptoms of the virus could still spread it to others.\n\"Note that this encourages staying away from others even if a person may not me [sic] experiencing symptoms themselves, but a family member does. Why? Because there is a strong chance that a person could be infected but asymptomatic, but could still infect others,\" Pinar Keskinocak, the director of Georgia Tech's Center for Health and Humanitarian Systems, wrote in the email sent to Toomey and other state officials on March 2. The message was first reported by the Atlanta Journal-Constitution\nAsked about the disparity between Kemp's claim this week that state officials didn't know people could transmit the virus without symptoms despite the state's top health official having been told just that a month ago, Nancy Nydam, a spokeswoman for Toomey, pointed CNN to a news release from Thursday explaining Kemp's shelter in place order.\n\"For weeks it has been known that people who were positive for COVID-19 but did not have symptoms likely were able to transmit the virus,\" says the release, again reiterating Kemp's citation of the updated CDC guidance this week regarding potential spread among asymptomatic people.", "url": "https://www.cnn.com/2020/04/04/politics/georgia-kemp-coronavirus-asymptomatic-spread/index.html"}