{"authors": ["Matthew Perrone"], "date_download": "2020-05-04 20:22:53", "date_modify": "2020-05-04 20:22:53", "date_publish": "2020-04-20 22:37:25", "description": "WASHINGTON (AP) — Testing is critical to controlling the coronavirus and eventually easing restrictions that have halted daily life for most Americans. But there's been confusion about what kinds...", "filename": "_372f519b4f4cc78f33087ecaa52ae0c9_1588623773.html", "image_url": "https://storage.googleapis.com/afs-prod/media/933bf86d39c34b8eb1e125cacd0d8db1/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_372f519b4f4cc78f33087ecaa52ae0c9_1588623773.html", "title": "2 types of testing look for COVID-19 infections new and old", "title_page": "2 types of testing look for COVID-19 infections new and old", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "2 types of testing look for COVID-19 infections new and old\nTaiwan McCall, left, useless a nasal swab to test James Reese for COVID-19 in the Harlem section of New York, Monday, April 20, 2020. While many laboratories and companies are now offering tests, there are still only two main types available. The nasal swab test tells you if you have an active viral infection right now. A separate blood test tells you if you were previously exposed to the virus and fought off the infection. (AP Photo/Seth Wenig)\nTaiwan McCall, left, useless a nasal swab to test James Reese for COVID-19 in the Harlem section of New York, Monday, April 20, 2020. While many laboratories and companies are now offering tests, there are still only two main types available. The nasal swab test tells you if you have an active viral infection right now. A separate blood test tells you if you were previously exposed to the virus and fought off the infection. (AP Photo/Seth Wenig)\nWASHINGTON (AP) — Testing is critical to controlling the coronavirus and eventually easing restrictions that have halted daily life for most Americans. But there’s been confusion about what kinds of tests are available and what they actually measure.\nThere are still just two main types in the U.S. One tells you if you have an active infection with the coronavirus, whether you have symptoms or not. The other checks to see if you were previously infected at some point and fought it off.\nCurrently, almost all testing in hospitals, clinics and drive-thru sites uses the first testing method, to help doctors detect and treat people with active COVID-19.\nThe other method — known as antibody testing — is still getting rolling. But eventually experts predict the blood test will play a key role in allowing many Americans to safely return to work and school by identifying those who are likely immune from the virus.\nNeither test can be done at home yet.\nHere’s a look at both tests and how they work:\nTESTING FOR INFECTION\nGenetic testing is the best method for detecting active COVID-19 infections and making a diagnosis. The process requires several steps and high-tech testing equipment to detect tiny traces of the virus that causes COVID-19.\nFirst, the doctor or nurse gathers samples from a patient’s nose or throat using swabs. The sample is developed through a process called polymerase chain reaction, or PCR, which is used to boost any traces of virus until they are detectable.\nThe same process has long been used to diagnose viruses like HIV and hepatitis.\nThe Food and Drug Administration has now authorized dozens of these types of tests that can be run at hospitals, university laboratories and large testing chains like Quest Diagnostics. The tests typically take 4 to 6 hours to run and can take a day or more to turn around if a sample needs to be shipped to another site for processing.\nLast month, several faster options that don’t require laboratory processing came on the market. The fastest is a 15-minute test from Abbott Laboratories run on small, portable electronic machines found in thousands of hospitals, clinics and doctor’s offices. The test puts all the chemical ingredients into a small cartridge that’s inserted into the Abbott machine along with the swabbed sample.\nThere are caveats to these types of tests: Someone can test negative one day and then positive the next. Much depends on the level of virus and whether the swab picked up enough of it to make a good sample.\nThe FDA recently authorized the first genetic test that uses saliva, rather than a nasal swab, but its availability is limited for now.\nU.S. testing continues to be squeezed by huge demand, limited testing machines and shortages of key supplies like swabs. While the U.S. is now conducting well over 1 million tests per week, most experts say that number will need to increase at least threefold before social distancing is dramatically eased.\nTESTING FOR ANTIBODIES\nThe second type of test won’t tell you whether you’re currently infected with the virus, but whether you were infected sometime in the past.\nInstead of searching for the virus itself, these tests search for blood proteins called antibodies, which the body produces days or weeks after fighting an infection. The same approach — usually a finger-prick of blood on a test strip — is used for HIV, hepatitis and many other infections.\nDr. Anthony Fauci, the nation’s top infectious disease official, says it’s a “reasonable assumption,” that if you have antibodies, you will be protected from another infection. But federal researchers still have to answer several key questions: How accurate are the tests? What antibody level is needed for immunity? How long does that immunity last?\nBy testing broad populations for antibodies, researchers hope to learn how widely the virus spread and how deadly it really is. Both questions remain unresolved since experts believe at least 25% of those infected never show symptoms. Some of those larger studies are getting started.\nFor now, FDA Commissioner Dr. Stephen Hahn suggests the blood tests could be used by front-line health care workers. For example, a doctor who tests positive for antibodies could be in a safer position to treat COVID-19 patients than a colleague who tests negative.\nThe FDA has authorized four antibody tests based on preliminary reviews. But more than 90 others have launched without FDA oversight under a federal emergency policy intended to quickly ramp up testing options. Those tests are supposed to bear disclaimers, including that they have not been FDA-approved, though many don’t.\nSeveral laboratory and physician groups have called for tighter FDA control.\n“They have a responsibility to go back, demand more rigorous clinical trials and probably put some guard rails around these tests,” said Dr. Gary Procop of the Cleveland Clinic who is chair of the American Society for Clinical Pathology’s Commission on Science, Technology and Policy.\n___\nThis story was first published on April 20, 2020. It was updated on April 21, 2020, to correct the position held by Dr. Gary Procop with the American Society for Clinical Pathology.\nFollow Matthew Perrone on Twitter: www.twitter.com/AP_FDAwriter\n___\nThe Associated Press receives support for health and science coverage from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "url": "https://apnews.com/372f519b4f4cc78f33087ecaa52ae0c9"}