{"authors": ["Susan Haigh"], "date_download": "2020-05-04 20:25:34", "date_modify": "2020-05-04 20:25:34", "date_publish": "2020-04-10 16:39:43", "description": "HARTFORD, Conn. (AP) — Connecticut landlords are raising concerns about Gov. Ned Lamont's latest executive order, which automatically grants tenants a 60-day grace period for rent due in April and...", "filename": "_49043a9e92e249373dee7bce5cf39cdb_1588623934.html", "image_url": "https://storage.googleapis.com/afs-prod/media/237661c434b448f5bb2dcd4664a769ce/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_49043a9e92e249373dee7bce5cf39cdb_1588623934.html", "title": "Rent grace periods worry landlords, businesses remain closed", "title_page": "Rent grace periods worry landlords, businesses remain closed", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Patricia Longobardi, owner of Sewing by Patricia trims a coffee filter which she inserts into fabric masks she's sewing for people in need, nurses in particular, many who are using the masks as an extra layer over medical ones, Wednes., April 8, 2020 in Wallingford, Conn. Longobardi isn't charging for them but is asking for donations to give to the Wallingford Wishing Well. The Centers for Disease Control and Prevention now recommends wearing masks in public places to limit the spread of COVID-19. (Dave Zajac/Record-Journal via AP)\nPatricia Longobardi, owner of Sewing by Patricia trims a coffee filter which she inserts into fabric masks she's sewing for people in need, nurses in particular, many who are using the masks as an extra layer over medical ones, Wednes., April 8, 2020 in Wallingford, Conn. Longobardi isn't charging for them but is asking for donations to give to the Wallingford Wishing Well. The Centers for Disease Control and Prevention now recommends wearing masks in public places to limit the spread of COVID-19. (Dave Zajac/Record-Journal via AP)\nHARTFORD, Conn. (AP) — Connecticut landlords are raising concerns about Gov. Ned Lamont’s latest executive order, which automatically grants tenants a 60-day grace period for rent due in April and the opportunity for a second 60-day grace period to help those struggling to pay for housing during the cornoavirus pandemic.\nRick Bush, a West Hartford landlord who owns 38 units and manages 165 more, predicted renters will never be able to catch up on those delayed payments, leaving many landlords in a financial predicament. In a good economy, Bush estimated only 10-to-15% of renters typically pay off their back, unpaid rent.\n“There’s no way they’re going to be able to catch up because in two months or three months, our economy is not going to miraculously rebound,” Bush said. “So what the state of Connecticut just did is basically tax or punish property owners by saying, ‘Now, this is your problem.’”\nShortly after news of Lamont’s order, Bush said he received a call from one unemployed tenant who didn’t plan to make a rent payment until July and didn’t understand the concept of a grace period and the fact he’d have to pay the back rent. Bush said he’d like the state’s congressional delegation to propose a new federal loan program for renters that would enable landlords to still get paid and cover their own expenses, including mortgages.\nNumerous landlords on Bush’s Facebook page echoed his concerns on Friday, predicting Lamont’s order will put them over the financial edge. Bush said many are already adversely impacted by the cornoavirus, including one landlord with 24 units who received only four rent checks for April.\nPaul Mounds, Lamont’s chief of staff, said previous orders provided assistance to landlords and property owners “dealing with their own financial situation.” For example, late last month Lamont announced that certain financial institutions were offering a 90-day grace period for all mortgage payments.\nBut Bush noted that not all landlords have mortgages. Also, he tried to contact his own mortgage holder three times and was put on hold for several hours, with no success.\nLamont’s order also prevents landlords from issuing delinquent tenants a notice to vacate or an eviction notice before July 1, except in cases of serious nuisance. It also allows renters to apply their paid security deposits of more than one month’s rent to all or part of their April, May or June rent.\n“Doing something for the renters was really important to me,” Lamont said. “They’re the ones who are just as likely to have lost all sources of income. ... It at least gives people a 90-day break and a breather until we get this economy going again, or least until we get those other supports going from the federal government.”\nMore than 10,500 residents have tested positive for the virus and there have been 448 COVID-19-associated deaths.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness or death.\nIn other developments around Connecticut:\n___\nBUSINESS CLOSURES TO CONTINUE\nLamont’s executive order also extends social distancing measures, including the closures of restaurants, bars and large shopping malls, until at least May 20.\nThe Democrat said he knows business owners are frustrated by the shutdowns but that Connecticut cannot afford to let up on ts efforts to fight the spread of the coronavirus, which has been blamed for at least 380 deaths in the state.\n“Now is not the time to take your foot off the accelerator,” Lamont said.\nOn Thursday, Lamont signed a similar order requiring schools to stay closed until at least May 20, as well. Schools had been under orders to stay shuttered until April 20.\nMounds, Lamont’s chief of staff, said the latest extension will also apply to other establishments that have been closed, including private clubs, off-track betting facilities, gyms, sports, fitness and recreational facilities, large shopping malls, non-essential retail establishments and places of public amusement. Also, measures imposing safety and distancing measures for workplace and nonessential businesses will be extended.\n___\nCONCERNS ABOUT ORDERS\nThe top Republican in Connecticut’s Senate voiced concern Friday about Lamont’s latest executive order, saying in a letter to the governor that it “does not reflect any collaboration with legislative leaders.” Sen. Len Fasano of North Haven said Lamont’s executive powers are limited to the protection of public health, but he believes the governor’s recent orders “could be interpreted as exceeding” his authority.\nLamont spokesman Max Reiss said the governor has carefully considered every executive order during this public health emergency and “the public health, safety, and welfare of all of Connecticut residents has been and will continue be the governor’s guiding principles, as laid out in state law.” He said Lamont will also continue to collaborate with state lawmakers, especially legislative leaders.\n___\nFOOD TRUCKS\nTruckers and essential workers looking for a meal will be able to find something at Connecticut’s rest stops. Lamont’s latest order lifts restrictions on commercial activity and permits food trucks to set up at rest areas located in Danbury on I-84; Wallingford and Middletown on I-91; and North Stonington on I-95. Interested food truck operators must obtain a permit from the Connecticut Department of Transportation, which requires a valid license issued by a local health department or health district to serve food in Connecticut.\n“These truck drivers are keeping Connecticut moving and are providing critical necessities to our state during this national crisis,” Lamont said. “We need to make it as easy as possible to keep them fed around the clock.”\n___\nThis story corrects that renters will be eligible to seek a second 60-day grace period for rental payments, not a 90-day grace period.", "url": "https://apnews.com/49043a9e92e249373dee7bce5cf39cdb"}