{"authors": ["Eliott C. Mclaughlin"], "date_download": "2020-05-04 16:23:08", "date_modify": "2020-05-04 16:23:08", "date_publish": "2020-04-06 15:55:11", "description": "The prospect of using hydroxychloroquine to treat Covid-19 amid the novel coronavirus pandemic has sparked rancor and disagreement among politicians and scientists.", "filename": "2020_04_06_health_hydroxych_3456d0ba45332506ebf5f07d9e95f190_index_1588609388.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200326235359-hydroxychloroquine-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_health_hydroxych_3456d0ba45332506ebf5f07d9e95f190_index_1588609388.html", "title": "Hydroxychloroquine and Covid-19: an explainer", "title_page": "Hydroxychloroquine and Covid-19: an explainer - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The prospect of using hydroxychloroquine to treat Covid-19 amid the novel coronavirus pandemic has sparked rancor and disagreement among politicians and scientists.\nThere have been indications that the drug is effective in treating or preventing Covid-19, but the tests haven't endured the due diligence of extensive clinical trials.\nStill, many -- including President Donald Trump -- are calling for doctors to prescribe hydroxychloroquine to Covid-19 patients. Here is what you should know:\nWhat is its origin?\nHydroxychloroquine -- also known by the brand name Plaquenil -- and its analog, chloroquine, are derived from quinine, which French chemists in 1820 isolated from the bark of the cinchona tree, according to Medicines for Malaria Venture . In 1934, German scientists created the synthetic chloroquine as part of a class of anti-malarials, MMV said. Hydroxychloroquine is the less-toxic version of chloroquine.\nCan it be used to treat Covid-19?\nIt's unclear. In labs it has demonstrated some efficacy against the severe acute respiratory syndrome coronavirus responsible for the present pandemic. But the White House's coronavirus response coordinator, Dr. Deborah Birx, has said that efficacy in test tubes doesn't mean it will work in humans.\nJUST WATCHED Doctor on unproven drug: You could lose your life Replay More Videos ... MUST WATCH Doctor on unproven drug: You could lose your life 01:52\nStudies on humans have presented conflicting conclusions. For instance, a small Chinese study said the prognosis was \"good\" but the drug requires further investigation. Meanwhile, a French study combining the drug with a popular antibiotic -- which Trump said could be a game changer -- showed \"no evidence of rapid antiviral clearance or clinical benefit.\"\nAnother French study showed promise in treating the virus, according to the medical journal The Lancet , \"but virologists and infectious disease experts caution that the excitement is premature.\"\nSo it's an anti-malarial?\nYes, but since 2006, it has not been recommended for use in severe malaria because of problems with resistance, particularly in the Oceania region, according to the World Health Organization.\nIt also has value as a \"disease-modifying anti-rheumatic drug\" that can decrease the pain and swelling of arthritis, according to the American College of Rheumatology. It is used to treat rheumatoid arthritis, childhood arthritis, some symptoms of lupus and other autoimmune diseases.\n\"It is not clear why hydroxychloroquine is effective at treating autoimmune diseases. It is believed that hydroxychloroquine interferes with the communication of cells in the immune system,\" the college says.\nAre more studies on humans coming?\nYes, lots of them. Drug makers have provided millions of doses to the federal government, and the US Food and Drug Administration, which has not officially approved hydroxychloroquine for treating Covid-19, issued an emergency use authorization to treat Covid-19 patients with it.\nThe drug should be used a last resort for extremely ill patients after they are \"able to have a conversation with their health care provider about everything that they could possibly do to save their lives,\" US Surgeon General Jerome Adams told Fox News.\nIn Detroit, 3,000 patients at Henry Ford Hospital will be part of a trial whose results will be tracked in a formal study, said Vice President Mike Pence, who is heading the White House's coronavirus response. The federal government is also working to get millions of doses into areas with high infection rates, another White House official said.\nWhy does Trump keep mentioning it?\nHe believes the drug can be a powerful weapon against Covid-19 , he says, \"and there are signs that it works on this -- some very strong signs.\" He also feels taking the drug could be useful as a preventative measure for health care workers, he said.\nJUST WATCHED Trump on unproven coronavirus treatment: Try it Replay More Videos ... MUST WATCH Trump on unproven coronavirus treatment: Try it 01:57\nExperts have not suggested the latter , but Trump is correct that there are promising signs. While health experts say it's best to wait until clinical trials determine if hydroxychloroquine is safe and effective in treating Covid-19, Trump wants faster results. It may not work, he said, but he doesn't want to wait 18 months to find out.\nThe US Department of Health and Human Services has also cited the encouraging anecdotal reports, but it, too, insisted more clinical trials are needed.\nBut it's safe?\nTrump points to the fact it's been in use for decades, \"so we know that if things don't go as planned, it's not going to kill anybody.\" Health experts indeed feel better about its safety than they would \"a completely novel drug,\" Adams told Fox.\nHydroxychloroquine is well tolerated in Covid-19 patients, the US Centers for Disease Control and Prevention says, while the American College of Rheumatologists says it's well tolerated in general.\nSide effects are rare, according to the college, and most commonly include nausea and diarrhea. Less common side effects include rashes, hair changes, weakness and, in rare instances, anemia or changes in vision.\nShould people just take it and see what happens?\nLupus patients routinely use the drug to treat their symptoms -- for some, there is no alternative -- and it's the only known therapy for primary Sjögren's syndrome, another autoimmune disorder, The Lancet said.\nBecause of shortages spurred by coronavirus-related interest, the Lupus Foundation of America has called on drug makers to increase their production of hydroxychloroquine, and Kaiser Permanente is no longer filling routine prescriptions for chloroquine, The Lancet reported.\nFDA Commissioner Stephen Hahn, who has called for a \"large, pragmatic clinic trial\" of the drug, has also urged caution, warning against \"treating patients with a product that might not work when they could have pursued other, more appropriate treatments.\"", "url": "https://www.cnn.com/2020/04/06/health/hydroxychloroquine-coronavirus-covid-19-explainer/index.html"}