{"authors": ["Bruce Schreiner"], "date_download": "2020-05-04 20:21:02", "date_modify": "2020-05-04 20:21:02", "date_publish": "2020-04-14 20:21:16", "description": "FRANKFORT, Ky. (AP) — A proposal to add a series of crime victims' rights to Kentucky's Constitution was advanced to the statewide ballot during a flurry of action by state lawmakers...", "filename": "_856de2d6a800e3740f6385f6f8acc76b_1588623662.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_856de2d6a800e3740f6385f6f8acc76b_1588623662.html", "title": "Lawmakers send crime victims' rights proposal to ballot", "title_page": "Lawmakers send crime victims' rights proposal to ballot", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FRANKFORT, Ky. (AP) — A proposal to add a series of crime victims’ rights to Kentucky’s Constitution was advanced to the statewide ballot during a flurry of action by state lawmakers Tuesday.\nThe Republican-led legislature returned to the state Capitol for its wrap-up session as many Kentucky residents remain hunkered down amid the coronavirus outbreak. The House continued to alter its way of doing business to allow members to follow social distancing guidelines.\nAs the end of the 2020 legislative session approached, lawmakers voted to override vetoes by Democratic Gov. Andy Beshear and took final action on a batch of bills sent to the governor. The wrap-up session has to conclude by the end of Wednesday.\nThe House gave final approval to the measure known as Marsy’s Law, putting it on the November ballot. It’s a reprise of a 2018 constitutional amendment that was approved by Kentucky voters. The prior amendment was voided when the Kentucky Supreme Court ruled that the question posed to voters was too vague. The new proposal will remedy those concerns, its supporters say.\nThe proposal seeks to guarantee, among other things, that crime victims have the right to timely notification of court proceedings, the right to be present for those hearings, the right to be heard in any hearing involving a release, plea or sentencing and the right to consult with prosecutors.\n“I am confident that Kentuckians will overwhelmingly support Marsy’s Law once again, and that Kentucky crime victims will finally be granted the equal standing they deserve.” said Republican Sen. Whitney Westerfield, lead sponsor of the proposed constitutional amendment.\nHeather Gatnarek, staff attorney for the American Civil Liberties Union of Kentucky, said the group believes that crime victims deserve justice but warned that the proposal would “undermine a bedrock principle of our legal system: the presumption of innocence.”\nOne new addition to the ballot measure is a response to a flurry of pardons by the state’s previous governor. The new provision seeks to ensure crime victims have the right to be notified and heard when a governor considers granting a pardon or sentence commutation to their assailants.\nFormer Gov. Matt Bevin, a Republican, issued hundreds of pardons between his electoral defeat in November and his final day in office in December. Several pardons stirred outrage from victims or their families, prosecutors and lawmakers.\nMeanwhile, lawmakers started brushing aside gubernatorial vetoes on mostly party-line votes.\nThe legislature voted to override Beshear’s veto of a bill relaxing the requirement to post legal notices in local newspapers. The measure would waive that requirement for local governments in counties with more than 80,000 residents.\nLawmakers also overrode the veto of a campaign-related bill. The measure will allow a gubernatorial candidate to campaign without a running mate during the primary campaign and then select a running mate after winning the party nomination. Candidates for governor and lieutenant governor in Kentucky have had to run for office as a unified slate in primary elections.", "url": "https://apnews.com/856de2d6a800e3740f6385f6f8acc76b"}