{"authors": ["Ashley Strickland"], "date_download": "2020-05-04 16:58:10", "date_modify": "2020-05-04 16:58:10", "date_publish": "2020-04-09 04:03:08", "description": "Two Russian cosmonauts and a NASA astronaut launched to the International Space Station early Thursday morning. NASA and Roscosmos, the Russian Space Agency, closely followed protocol to ensure that the astronauts were quarantined ahead of launch.", "filename": "2020_04_09_world_nasa-expedition-63-launch-space-station-scn_index_1588611490.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409040933-02-iss-launch-0409-screengrab-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_world_nasa-expedition-63-launch-space-station-scn_index_1588611490.html", "title": "NASA astronaut, Russian cosmonauts launch to the space station during a pandemic", "title_page": "NASA astronaut, Russian cosmonauts launch to the space station during a pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Two Russian cosmonauts, Anatoli Ivanishin and Ivan Vagner, and NASA astronaut Chris Cassidy launched to the International Space Station from the Baikonur Cosmodrome in Kazakhstan on Thursday morning at 4:05 a.m. ET.\nThe planned launch comes at a time when many events have been postponed or canceled due to the coronavirus pandemic. Travel restrictions prevented some of the astronauts' families, media and industry officials from attending the launch. Those involved in the launch were all seen keeping six feet apart and wearing masks.\nBut many of the health and safety precautions taken were standard for astronauts launching to the space station.\nNASA has a long history of quarantining astronauts before they go to space to prevent illnesses like cold and flu from occurring off our planet. It was a concern even in the early days of the agency's astronaut program.\n\"The health and welfare of the crew is always paramount,\" said Courtney Beasley, communications specialist at NASA's Johnson Space Center. \"All of our crew must stay in quarantine for two weeks before they launch. This ensures that they aren't sick or incubating an illness when they get to the space station, and is called 'health stabilization.'\"\nRead More", "url": "https://www.cnn.com/2020/04/09/world/nasa-expedition-63-launch-space-station-scn/index.html"}