{"authors": ["Ivana Kottasová", "Brandon Miller"], "date_download": "2020-05-04 16:27:12", "date_modify": "2020-05-04 16:27:12", "date_publish": "2020-04-06 17:17:41", "description": "Vanuatu has been hit by one of the strongest recorded storms to ever make landfall on the tiny Pacific nation, forcing the government to suspend coronavirus social distancing measures for evacuees.", "filename": "2020_04_06_weather_vanuatu-tropical-storm-harold-intl_index_1588609632.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406091618-weather-harold-satellite-20200406-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_weather_vanuatu-tropical-storm-harold-intl_index_1588609632.html", "title": "Vanuatu: Tropical cyclone Harold hits Pacific nation", "title_page": "Vanuatu: Tropical cyclone Harold hits Pacific nation - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Vanuatu has been hit by one of the strongest recorded storms to ever make landfall on the tiny Pacific nation, forcing the government to suspend coronavirus social distancing measures for evacuees.\nTropical Cyclone Harold packed winds of up to 250 kilometers per hour and was approaching the strength of a Category 5 hurricane, making it the strongest storm to hit Vanuatu in five years and the strongest one ever to make landfall on the nation's largest island, Espiritu Santo.\nThe cyclone hit Espiritu Santo on Monday then moved southeast over the island of Pentecost hours later. Harold strengthened even further during the day, with winds increasing up to 270 kph and gusts peaking over 300 kph.\nPhotos shared online Tuesday by the Asia Pacific Office of the Red Cross showed pictures of devastation on the island nation, including fallen trees and flooding.\nWinds over the islands of Vanuatu should lessen on Tuesday as the storms moves away from the nation.\nRead More", "url": "https://www.cnn.com/2020/04/06/weather/vanuatu-tropical-storm-harold-intl/index.html"}