{"authors": ["Francis Eanes", "Eleni Schirmer", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Nicole Aschoff", "Jeff Schuhrke", "Alanna Schubach", "Meagan Day"], "date_download": "2020-05-04 19:56:59", "date_modify": "2020-05-04 19:56:59", "date_publish": "2020-04-04 00:00:00", "description": null, "filename": "2020_04_for-higher-education-a-return-to-normal-isnt-good-enough_1588622219.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/04/04151744/4021033982_d899134393_b.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_04_for-higher-education-a-return-to-normal-isnt-good-enough_1588622219.html", "title": "For Higher Education, a “Return to Normal” Isn’t Good Enough", "title_page": "For Higher Education, a “Return to Normal” Isn’t Good Enough", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "COVID-19 has turned the world of higher education upside down. We’ve sent millions of students home early, left others stranded abroad, called off graduations, canceled job searches, and asked our faculty and supporting staff to transition to online learning within a matter of days. Institutional endowments, the financial lifeblood of many colleges and universities, are in free fall. Campuses are ceasing normal operations, and tens of thousands of hourly workers face furloughs and layoffs.\nAs we stare into this seemingly bottomless abyss, it seems natural to long for the day when things return to “normal,” when we can regain routines in our daily lives. For those of us in higher education, that means talking in person to our students and colleagues, rather than via Zoom, about our weekends, work politics, and lesson plans; being barraged by the regular drone of emails, rather than today’s panic drone; resuming our normal set of anxieties instead of today’s apocalyptic ones.\nBut before COVID-19, “normal” in higher education meant all kinds of harms: spiking debt, precarious work, and social protections that fall somewhere between elusive and imaginary.\n”Normal” has meant that tuition prices have increased eight times faster than wages over the past thirty years. Normal has brought an explosion in student debt, which was already greater in magnitude than credit card debt and a crisis in its own right before this coronavirus. As student debt surpasses $1.5 trillion, individuals assume more and more of the burden for higher education that had once been publicly financed. After accounting for inflation, in 2017 states spent an average of 16 percent less per student than pre-recession levels in 2008, leading to a 35 percent tuition increase on average over that same time period.\nNormal means returning to an already-ravaged academic labor market, in which even runners-up for tenure-track positions join the ever-growing ranks of contingent labor (as both of us can personally attest). Overreliance on contingent labor was already a crisis in “normal” times, and without collective action will likely get worse: with an impending surge in enrollment that graduate schools are likely to see as recent grads flee the bleak nonacademic labor markets, the supply of cheap teaching labor will increase and exert even more downward pressure on deans looking to cut costs.\nResuming normality means endorsing the knowledge profiteers rampant in higher education. Consider the exorbitantly high and still-growing costs of textbooks, which by some estimates have increased tenfold in the last four decades, costing most students hundreds if not thousands of dollars per year. While digital e-books and book-rental start-ups arrived on the scene promising big savings, this “new normal” has largely been a means for traditional publishing firms — among which the largest four hold a staggering 80 percent market share — to maintain their dominance.\nFor those of us who publish, returning to “normal” means donating our intellectual labor to a largely privatized publishing industry in which giants like Elsevier — who posted profits close to $1 billion in 2018 — turn around and charge huge sums for access, further squeezing already-tight library budgets and walling off new knowledge from the masses.\nNone of these “normals” seem worthy of resuscitating in the wake of COVID-19. Yet colleges’ and universities’ initial responses have been business as usual.\nIn the wake of the virus, universities have dialed up austerity programs. For example, layoffs and furloughing of campus dining and custodial staff across the country — even by some of the country’s wealthiest higher education institutions — have gutted the incomes of an already-precarious workforce ravaged by decades of privatized outsourcing to contract labor firms like Sodexo. Countless faculty searches have been frozen, with no guarantee of when, if ever, these positions will be filled. Other institutions are quietly using the crisis as a gateway to significantly and permanently expand online learning, a modality of instruction that squeezes ever-more productivity out of faculty and generates increased tuition revenues without the concomitant need to expand campus facilities or overhead.\nAnd this is just the beginning: we have no idea how the cascading economic fallout will affect next year’s incoming cohort of first-year students, the already-anemic academic job market, or already-underwater institutions that may have to close their doors for good. We can expect that those already most vulnerable will fare worst.", "url": "https://www.jacobinmag.com/2020/04/for-higher-education-a-return-to-normal-isnt-good-enough"}