{"authors": [], "date_download": "2020-05-04 20:22:10", "date_modify": "2020-05-04 20:22:10", "date_publish": "2020-04-21 03:32:15", "description": "LOS ANGELES (AP) — A pair of fans in New York sued Major League Baseball, Commissioner Rob Manfred and the 30 teams, asking for their money back for tickets and for certification of class-action...", "filename": "_cc66e2f253351d5f86a2a6c308891890_1588623730.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f342f3e943ae407fa00102f64299a36f/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cc66e2f253351d5f86a2a6c308891890_1588623730.html", "title": "Fans sue MLB, teams over ticket money, ask for class action", "title_page": "Fans sue MLB, teams over ticket money, ask for class action", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this March 28, 2019, file photo, a large flag is unfurled during the national anthem before an opening day baseball game between the New York Yankees and the Baltimore Orioles at Yankee Stadium in New York. Forbes estimates the New York Yankees are baseball’s most valuable franchise at $5 billion, up 9% over last year and 47% more than the No. 2 Los Angeles Dodgers at $3.4 billion.(AP Photo/Seth Wenig, File)\nFILE - In this March 28, 2019, file photo, a large flag is unfurled during the national anthem before an opening day baseball game between the New York Yankees and the Baltimore Orioles at Yankee Stadium in New York. Forbes estimates the New York Yankees are baseball’s most valuable franchise at $5 billion, up 9% over last year and 47% more than the No. 2 Los Angeles Dodgers at $3.4 billion.(AP Photo/Seth Wenig, File)\nLOS ANGELES (AP) — A pair of fans in New York sued Major League Baseball, Commissioner Rob Manfred and the 30 teams, asking for their money back for tickets and for certification of class-action status.\nThe lawsuit was filed Monday in U.S. District Court in Los Angeles by Matthew Ajzenman, who said he bought a partial season plan for more than 20 Mets games; and Susan Terry-Bazer, who said she purchased six tickets for a May 9 game at Yankee Stadium against Boston.\n“Baseball fans are stuck with expensive and unusable tickets for unplayable games in the midst of this economic crisis,” the lawsuit said. “Under the pretext of `postponing’ games, at the directive of MLB, teams and ticket merchants are refusing to issue refunds for games which are not going to be played as scheduled -- if ever.”\nAjzenman said his Mets plan cost $1,730 and he made a first payment to the team of about $317 last year. Terry-Bazer said she paid $926 to Ticketmaster and planned to take her grandson to the Red Sox-Yankees game.\nTicketmaster, Stubhub, Live Nation and Last Minute Transactions are among the defendants. The caption on the first page included Tampa Bay Devil Rays Ltd. — “Devil” was dropped from the team’s nickname after the 2007 season.\n“The defendants continue to retain enormous profits from tickets sold for the 2020 MLB season at the expense of fans’ financial hardship,” the suit said.\nFans asked for “full restitution, an accounting of all MLB tickets sold for the 2020 season (including season tickets, single game purchases, and public seat licenses), a declaratory judgment that defendants’ conduct of continuing to sell tickets for the 2020 MLB regular season violates California law, as well as a disgorgement of profits from tickets sold during the 2020 MLB season.”\nThey allege violations of California’s Consumer Legal Remedies Act and Unfair Competition Law and of civil conspiracy.\nOpening day on March 26 was pushed back until mid-May at the earliest after a national emergency was declared due to the new coronavirus pandemic.\nMLB said it is awaiting government and medical direction, and it does not know when the season can begin. The league and the players’ union have discussed the possibility of playing at neutral sites or in empty ballparks, but no decisions have been made.\nMLB, the Mets and Yankees did not immediately respond to requests for comment.\n___\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports", "url": "https://apnews.com/cc66e2f253351d5f86a2a6c308891890"}