{"authors": ["Lisa Rathke"], "date_download": "2020-05-04 20:24:38", "date_modify": "2020-05-04 20:24:38", "date_publish": "2020-04-20 13:50:16", "description": "MARSHFIELD, Vt. (AP) — The board of the struggling Vermont State Colleges system on Monday considered a plan to close three campuses because of added financial troubles brought by the coronavirus...", "filename": "_20c24d65a4e9f9c50cff2e6f4e219e51_1588623878.html", "image_url": "https://storage.googleapis.com/afs-prod/media/aa2970fd6b9a4b34a01aeefbe6e36b6c/2400.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_20c24d65a4e9f9c50cff2e6f4e219e51_1588623878.html", "title": "Virus and Vermont: Colleges board weighs closing 3 campuses", "title_page": "Virus and Vermont: Colleges board weighs closing 3 campuses", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A long line of vehicles parade through downtown Montpelier, Vt., honking, waving and holding signs for more than an hour Monday, April 20, 2020, to protest a proposed plan to shutter three campuses in the Vermont state college system due to coronavirus. (Jeb Wallace-Brodeur/The Times Argus via AP)\nA long line of vehicles parade through downtown Montpelier, Vt., honking, waving and holding signs for more than an hour Monday, April 20, 2020, to protest a proposed plan to shutter three campuses in the Vermont state college system due to coronavirus. (Jeb Wallace-Brodeur/The Times Argus via AP)\nMARSHFIELD, Vt. (AP) — The board of the struggling Vermont State Colleges system on Monday considered a plan to close three campuses because of added financial troubles brought by the coronavirus outbreak, while earlier in the day students and other critics protested in a car parade through Montpelier.\nUnder a proposal announced by Chancellor Jeb Spaulding on Friday, the two campuses of Northern Vermont University in Johnson and Lyndon and the campus of Vermont Technical College in Randolph, which has another campus in Williston, would close. Liberal arts programs in Johnson and Lyndon would be moved to Castleton University. Not every program would be transferable, Spaulding said.\nThe four-college system is facing a deficit this school year of between $7 million and $10 million, including $5.6 million in refunds of room and board fees and moving to online learning. This year’s deficit includes the expected $3 million in federal assistance. Next year’s deficit could reach $12 million.\nSpaulding said in a live-streamed board meeting in which several hundred were listening that he was “truly sorry” that he felt the need to make the painful recommendation but that the operation of the college system is unsustainable.\n“Inaction would jeopardize not just one institution, it would jeopardize all the institutions,” Spaulding told the board, which had originally planned to vote Monday. The chairman delayed the vote so trustees could learn more about the weighty proposal. A new voting date hasn’t been scheduled.\nThe board and chancellor said they received more than 1,000 emails over the weekend from students, faculty and community members, with some painful stories.\nThe schools’ faculty assemblies and unions voted no confidence in Spaulding, and a petition was started to keep the Northern Vermont University at Lyndon campus open.\nJesse Streeter, a senior and student government president at Northern Vermont University at Johnson, told the board that he understands that something needs to change but said he was disturbed by the recommendation and what he called a hasty proposed vote and a lack of transparency.\n“I don’t understand how a decision can be reached in such a short amount of time without releasing more information to the public and allowing for public comment to infiltrate the system,” said Streeter who had previously served on the state colleges board as a student member.\nState Rep. Lucy Rogers, a Democrat from Lamoille County, urged the board to consider working with the Legislature to find a year of bridge funding to keep the campuses open and to include those communities in coming up with a solution. “What we need is a creative revamping of the entire Vermont State College system and this is really an opportunity for Vermont to be a national leader in imagining how higher ed can flourish in the 21st century,” she said.\nThe college system has been plagued for years by declining enrollment because of Vermont’s aging population, low state funding and other challenges that some small private colleges in New England have faced.\nLast year, three private schools in Vermont alone — Green Mountain College, Southern Vermont College and the College of St. Joseph in Rutland — all closed after grappling with declining enrollment and financial issues.\nRepublican Gov. Phil Scott said the problems faced by the college system have been building for years and he wants the Legislature involved in what happens.\n“Suffice it to say, some of the decisions we’re going to have to make over the coming months may be as difficult if not more difficult than we’ve made thus far,” Scott said. “So it’s going to be challenging and I want to be sure that we have the legislature involved in this.”\n____\nAssociated Press writer Wilson Ring in Stowe contributed to this report.", "url": "https://apnews.com/20c24d65a4e9f9c50cff2e6f4e219e51"}