{"authors": ["Rick Callahan"], "date_download": "2020-05-04 20:26:58", "date_modify": "2020-05-04 20:26:58", "date_publish": "2020-04-16 12:55:22", "description": "INDIANAPOLIS (AP) — An Indianapolis police officer who was fatally shot while responding to a domestic violence call was remembered Thursday during her funeral as a dedicated, compassionate...", "filename": "_ce675aefd48dc780e3af72d5be666b14_1588624018.html", "image_url": "https://storage.googleapis.com/afs-prod/media/064e45950dfd451d9491f3f56b61b076/2026.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ce675aefd48dc780e3af72d5be666b14_1588624018.html", "title": "Slain Indiana officer remembered as dedicated, compassionate", "title_page": "Slain Indiana officer remembered as dedicated, compassionate", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Indianapolis Metropolitan Police Department Chief Randal Taylor carries the American flag that covered the casket of officer Breann \"Bre\" Leath to the family, Thursday, April 16, 2020, in Indianapolis. Leath was shot through an apartment door while responding with other officers to a domestic violence call. (AP Photo/Darron Cummings)\nIndianapolis Metropolitan Police Department Chief Randal Taylor carries the American flag that covered the casket of officer Breann \"Bre\" Leath to the family, Thursday, April 16, 2020, in Indianapolis. Leath was shot through an apartment door while responding with other officers to a domestic violence call. (AP Photo/Darron Cummings)\nINDIANAPOLIS (AP) — An Indianapolis police officer who was fatally shot while responding to a domestic violence call was remembered Thursday during her funeral as a dedicated, compassionate officer and a devoted young mother, with a police chaplain calling her “a beautiful flower that was picked way too soon.”\nGov. Eric Holcomb was among numerous people who spoke during the service for Officer Breann “Bre” Leath, 24, which was held at the Indianapolis Motor Speedway in adherence with pandemic social distancing rules that limited Leath’s family, friends and dignitaries to no more than 10 people per speedway suite.\nAn estimated 1,000 cars from Indianapolis police and other police agencies lined the speedway’s oval for the service as those officers watched a livestream of the service on cellphones and laptops, said Indianapolis police spokeswoman Aliya Wishner.\nOfficers wearing face masks later stood next to their vehicles, lights flashing, and saluted during a playing of taps before a procession through downtown Indianapolis.\nPolice Chief Randal Taylor told mourners that Leath, who joined the Indianapolis Metropolitan Police Department’s nearly 1,700-office force in December 2017 and was fatally shot April 9, had “courageously stood her post, representing what’s best in society.”\n“By simply putting on the uniform she made the world a better place,” he said.\nHolcomb, who directed that flags across Marion County be flown at half-staff from sunrise to sunset Thursday, said Leath’s death was “a stinging reminder of the risk that those who wear the uniform face every day.”\nTiana Leath, one of the slain officer’s two sisters, offered a heartfelt remembrance, saying she looked up to an older sister who as a child was bossy and wanted to run things. She recalled that her older sister had shown her just two weeks ago how to make her “famous mac and cheese” recipe, and said her late sister was a source of encouragement.\n“She had a way of making you think, `You know what, I really can do better. I want more for myself,’” Tiana Leath said, calling her sister “compassionate, determined, God-fearing and beautiful.”\n“I’m going to make you proud. Most definitely,” she said, speaking of her sister.\nTiana Leath said Bre was an “amazing,” dedicated mother to her 3-year-old son, Zayn, was and promised that she and her family would shower him with love.\n“I want to you know Bre that Zayn will get so much love and kisses and tickles that you’re going to be jealous,” she said, choking up with tears.\nPolice chaplain Patricia Holman called Leath “a beautiful flower that was picked way too soon.”\nPrevious funerals for fallen Indianapolis officers have been held in recent years at Bankers Life Fieldhouse, but the coronavirus pandemic forced the change of venue and social distancing restrictions.\nA funeral procession led by officers on motorcycles later left the speedway and traveled past Indianapolis police headquarters, the Marion County Sheriff’s Department headquarters, downtown Indianapolis’ Monument Circle and the Indianapolis police East District headquarters.\nResidents, many wearing face masks, lined streets to watch the procession as it headed to Crown Hill Cemetery for burial.\nEight uniformed officers, all wearing black face masks, carried Leath’s flag-draped casket into the cemetery’s “Heroes of Public Safety” section for a short graveside service that ended with a bagpipe rendition of “Amazing Grace” and a presentation of a folded American flag to her family.\nLeath was shot to death through an apartment’s door while responding with three other officers to a domestic violence call, police said. Elliahs Dorsey, 27, is charged with murder, criminal confinement and four counts of attempted murder.", "url": "https://apnews.com/ce675aefd48dc780e3af72d5be666b14"}