{"authors": ["Ivana Kottasová"], "date_download": "2020-05-04 16:25:50", "date_modify": "2020-05-04 16:25:50", "date_publish": "2020-04-07 11:49:33", "description": "Schools around the world have been shut to prevent the spread of the novel coronavirus, but one team of scientists is questioning whether the havoc the closures are causing to millions of people is actually worth it -- suggesting that the impact on the pandemic might be smaller than previously thought.", "filename": "2020_04_07_health_school-closures-coronavirus-intl_index_1588609550.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407101355-01-uk-schools-closed-coronavirus-0324-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_health_school-closures-coronavirus-intl_index_1588609550.html", "title": "School closures may only have a small effect on stopping coronavirus, study says", "title_page": "Coronavirus school closures may only have small effect on stopping spread, study says - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Schools around the world have been shut to prevent the spread of the novel coronavirus, but one team of scientists is questioning whether the havoc the closures are causing to millions of people is actually worth it -- suggesting that the impact on the pandemic might be smaller than previously thought.\nThe research, published in The Lancet Child and Adolescent Health medical journal late on Monday, reviewed 16 studies looking at past epidemics of SARS , MERS and seasonal flu, as well as others modeling the spread of the novel coronavirus, and found that the evidence to support national closures of schools to combat Covid-19 is \"very weak.\"\n\"Data from the SARS outbreak in mainland China, Hong Kong, and Singapore suggest that school closures did not contribute to the control of the epidemic,\" the researchers said.\nData so far suggests that while children can be infected with the novel coronavirus, they are likely to experience only mild symptoms\nOf the of first nearly 45,000 confirmed cases in China, there were no deaths of anyone younger than 10 . In the US, cases of Covid-19 in children made up less than 2% of the 149,760 laboratory-confirmed cases occurring in the country between February 12 and April 2.\nBut while their symptoms may be mild compared to those experienced by adults with the virus, children can still spread Covid-19 to more vulnerable people, which is why many governments took the decision to shut schools.\nAccording to UNESCO, nationwide school closures are currently impacting over 91% of the world's student population -- roughly 1.6 billion children and young adults. The UN agency said that 188 countries have implemented nationwide closures.\nThis isn't something policymakers decided on a whim. Past experiences have shown that shutting schools early in a seasonal flu epidemic can help slow down the spread of the disease and reduce the number of people who get sick. But the UCL study suggests that while this may be true for the flu -- which tends to be spread by children -- it doesn't necessary hold true for outbreaks of other diseases.\nThe scientists suggest that policymakers should consider other \"less disruptive social distancing interventions in schools,\" especially if the pandemic-related restrictions need to be in place for a long time.\nKeeping schools open for the children of key workers, or staggering school start and finish times, may be a way forward. Close monitoring of students' health, for example through temperature checks, and sending kids with symptoms home, could be another solution.\nBut some experts have warned against jumping to conclusions based on one study.\nNeil Ferguson, director of the MRC Centre for Global Infectious Disease Analysis at Imperial College London and the author of the epidemiological study that has informed the British government's plan to tackle the epidemic, told the Science Media Centre that the UCL researchers had failed to consider the impact of school closures in combination with other lockdown measures.\n\"While school closure as a measure on its own is predicted to have a limited effectiveness in controlling Covid-19 transmission, when combined with intense social distancing it plays an important role in severing remaining contacts between households, and thus ensuring transmission declines,\" he said.\nWhen considering whether or not to shut schools, policymakers must balance the need to protect public health with the huge disruptive effects such closures can cause.\nScientists are increasingly warning of the potential impact of long-term school closures on the mental health and wellbeing of children, warning that more research is needed.\n\"The longer schools, colleges and universities are closed, we do risk the mental health and wellbeing of children and young people who are vulnerable because of the situation created by self-isolation and social distancing policies,\" Catherine Carroll-Meehan, from the School of Education and Sociology at the University of Portsmouth, told the Science Media Centre\nWith children forced to stay at home, a large proportion of working parents are likely to miss work.\nPrevious studies in the United Kingdom and the United States have shown that as many as 30% of healthcare workers have children they would need to take care of if schools were closed. A separate study published in The Lancet last week estimated that one in seven frontline medical workers in the US may miss work to care for their children when US schools are closed.\nAnother common solution -- leaving children with their grandparents -- is particularly risky in the case of Covid-19, as the elderly are among those most vulnerable to the virus.", "url": "https://www.cnn.com/2020/04/07/health/school-closures-coronavirus-intl/index.html"}