{"authors": ["Guest Writers"], "date_download": "2020-05-04 20:19:08", "date_modify": "2020-05-04 20:19:08", "date_publish": "2020-04-28 13:00:13", "description": "\"We are experiencing collective trauma unlike anything previously experienced in America,\" two experts say.", "filename": "entry_coronavirus-trauma-how-to-cope_n_5ea6fab7c5b6ad9bacf331e1_1588623548.html", "image_url": "https://img.huffingtonpost.com/asset/5ea722bc220000030c827bb5.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_coronavirus-trauma-how-to-cope_n_5ea6fab7c5b6ad9bacf331e1_1588623548.html", "title": "We Are Doctors Who Study Trauma. Here's How To Cope With The COVID-19 Crisis.", "title_page": "We Are Doctors Who Study Trauma. Here's How To Cope With The COVID-19 Crisis. | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Katja Kircher via Getty Images \"Our decades of research on personal and collective traumas make clear that people are incredibly resilient, despite whatever life throws at them.\"\nA patient calls in a panic. She was diagnosed a week ago with COVID-19, and her shortness of breath has been escalating at home. She is no longer allowed to visit her mother, who is dying in a nursing home. By video conference, we determine that her breathlessness likely stems more from her anxiety than the virus itself. Instead of sending her to the ER, I practice breathing techniques with her to calm her surging adrenaline and elevated blood pressure — and it helps.\nA week later, her breathing and blood pressure are improved, but the evening news triggers a new tidal wave of dread. Traumatic images flood her thoughts as the grim reality of post-pandemic life (and perhaps another outbreak in winter?) sets in. Will work, school, relationships and even grocery shopping ever feel safe? The shortness of breath returns.\nOver a month into the pandemic, we recognize this as a mental health crisis. It’s called trauma.\nWe are experiencing collective trauma unlike anything previously experienced in America in our lifetimes. It is devastating to our individual and shared well-being. The virus’ invisibility, asymptomatic spread and ubiquity are uniquely terrorizing. The absence of safe spaces, the possibility of another mass outbreak, and the tragic realities broadcast into our living rooms promote further fear.\nAnd just when we most need our normal coping strategies like exercise, sports and congregating with friends to manage stress and loss, they are severely constrained for our own — and others’ ― good.\nBut naming this disaster as a collective trauma helps introduce a set of specific recommendations for coping — now, and for the long haul.\nWe are doctors. One of us connects with patients one on one, treating physical and mental health in parallel. The other interviews thousands of people who’ve experienced tragedies, both personal and collective. And from our combined 60 years of clinical and research experience, we have seen the immediate and lasting emotional, behavioral, medical and societal effects of traumatic life events. We also know how to help individuals and communities process, cope and move beyond suffering.\nFeeling intermittently (or constantly) on edge, worried or sleepless are normal 'fight-or-flight' reactions to this trauma. We are not going crazy. We are simply coping with a new reality — whether we are sick or not.\nFirst, let’s explicitly recognize that our mental health not only informs our physical health ― it defines our health and humanity. Addressing mental health in the doctor’s office is not a luxury; it is essential for optimizing patients’ health.\nLet’s also acknowledge that feeling intermittently (or constantly) on edge, worried or sleepless are normal “fight-or-flight” reactions to this trauma. We are not going crazy. We are simply coping with a new reality — whether we are sick or not.\nWe can also help ourselves by developing adaptive coping strategies like limiting media exposure, avoiding mistruths, and practicing breathing, yoga or meditation. Asking for help is crucial for some, and can add structure and support to the coping process. Virtual social connections ― whether it’s a weekly online happy hour with friends or joining a support group — can help us make sense of this crisis.\nSome may find the dread is too overwhelming, in which case professional help through psychotherapy or grief counseling, for example, may help the patient manage acute stress while developing strategies to cope with ongoing uncertainty.\nOur decades of research on personal and collective traumas also make clear that people are incredibly resilient, despite whatever life throws at them. A man who lost his home in a firestorm — only to lose his business in an earthquake a month later — was able to rebuild his life with the support of family and a sense of unwavering optimism.\nResearch after tragedy tells us that people often find meaning in adversity and can recognize strengths they did not realize they had. During the pandemic, we are reaching our friends and loved ones through new means, becoming more capable with technology, and finding new ways to connect with neighbors ― all of which can help us make sense of this crisis.\nRecognizing that all of us working together to practice social distancing is helping us save lives can turn feelings of isolation into a sense of purpose. When we realize and yield to our own capabilities, we are better equipped to get through it.\nRecognizing that all of us working together to practice social distancing is helping us save lives can turn feelings of isolation into a sense of purpose.\nTaking care of our mental health is not a luxury. The trauma of COVID-19 is having immediate effects on people’s emotional and physical health. From worry, hopelessness and panic to breathlessness, chest tightness and sleep disturbance, our bodies and minds are on high alert and exhausted at the same time. And when we feel this vulnerable, behaviors like self-medication, substance abuse and self-harm can ensue.\nUnfortunately, the trauma will persist even if we’re able resume some sort of normalcy. Large-scale crises like the COVID-19 pandemic have lasting effects, particularly when trauma is repeated and prolonged. The emotional, physical and behavioral ramifications of PTSD have been well-studied. In the aftermath of SARS in Hong Kong, for example, nearly two-thirds of survey respondents expressed helplessness, and nearly half reported moderate or severely deteriorated mental health.\nNot only does trauma affect us emotionally; there are also compounding physical ramifications. Patients who have experienced adverse childhood events are at significantly higher risk for developing subsequent health problems like obesity, diabetes and heart disease. Individuals who were acutely stressed by watching the 9/11 attacks and their aftermath on TV were more likely to develop heart problems over the ensuing three years.\nWe need to get comfortable talking with our doctors about mental health. Primary care providers have never been more well-positioned to help. Although assessing raw data like weight, blood pressure and cholesterol is important, the role of health care providers should also include recognizing, affirming and incorporating the emotional and behavioral factors that give way to the medical outcomes that directly inform our human experience. Health care providers need access not only to our data but to our true selves, inside and out.\nAfter all, how could a blood pressure reading possibly measure all we’ve been through?\nLucy McBride, M.D., is a practicing internal medicine physician in Washington, D.C. For 20 years, she has focused on treating patients’ physical and mental health in tandem. She did her medical training at Harvard Medical School and Johns Hopkins Hospital and as a Fulbright scholar earned a master’s in Pharmacology at Cambridge University, U.K.\nRoxane Cohen Silver, Ph.D., is a professor in the Department of Psychological Science, the Department of Medicine, and the Program in Public Health at the University of California, Irvine. She has spent almost four decades studying personal traumas and larger collective events such as war, school shootings and other international community disasters. She received her Ph.D. in social psychology from Northwestern University.\nDo you have a compelling personal story you’d like to see published on HuffPost? Find out what we’re looking for here and send us a pitch!\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/coronavirus-trauma-how-to-cope_n_5ea6fab7c5b6ad9bacf331e1"}