{"authors": ["Dana Cassidy Of Fresh Take Florida News Service"], "date_download": "2020-05-04 20:07:27", "date_modify": "2020-05-04 20:07:27", "date_publish": "2020-04-08 21:01:59", "description": "MIAMI (AP) — Hand sanitizer for thousands of dollars? Law enforcement officials in Florida are cracking down on alleged price gougers during the pandemic emergency, shutting down online sales or...", "filename": "_af69a1439a09d9b0255d025fb109cf87_1588622847.html", "image_url": "https://storage.googleapis.com/afs-prod/media/d2f34229461f4322aeff34295cfeed3d/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_af69a1439a09d9b0255d025fb109cf87_1588622847.html", "title": "Florida cracks down on price gouging, virus-related fraud", "title_page": "Florida cracks down on price gouging, virus-related fraud", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Oct. 29, 2019 file photo, Florida's attorney general Ashley Moody speaks at a news conference in Tallahassee, Fla. Moody filed 50 investigative subpoenas to identify sellers as part of price-gouging investigation. (AP Photo/Steve Cannon, File)\nIn this Oct. 29, 2019 file photo, Florida's attorney general Ashley Moody speaks at a news conference in Tallahassee, Fla. Moody filed 50 investigative subpoenas to identify sellers as part of price-gouging investigation. (AP Photo/Steve Cannon, File)\nMIAMI (AP) — Hand sanitizer for thousands of dollars? Law enforcement officials in Florida are cracking down on alleged price gougers during the pandemic emergency, shutting down online sales or auctions, and pursuing virus-related frauds.\nFlorida Attorney General Ashley Moody filed 59 investigative subpoenas to identify sellers as part of price gouging investigations, her office said on Tuesday. Her office also shut down more than 100 listings for items with prices she described as “outrageous” and recovered more than $130,000 in refunds for consumers.\nMeanwhile, the Justice Department announced a new virus fraud task force in Florida operating under the supervision of the U.S. Attorney’s Office in Orlando.\nOn Amazon’s website last week, there were listings for 50-packs of hand sanitizers ranging from $150 to nearly $3,000, though other searches of disposable gloves, Lysol products and more were reasonably priced.\nFlorida’s price gouging laws, enforced by Moody, prohibit charging unreasonable prices for items such as protective masks, sanitizing and disinfecting supplies, personal protective equipment like gloves and other gear, COVID-19 test kits, swabs and similar medical supplies used in administering tests.\n“We will not relent in these efforts to protect Floridians from gouging and COVID-19-related scams during this unprecedented time of crisis,” Moody said in a video posted last week.\nFlorida price gougers can face civil penalties of $1,000 per violation and up to $25,000 for numerous violations done in a single 24-hour period.\nMost of the people investigated by Moody were third-party Amazon sellers.\nOne who was subpoenaed was Lawrence Bryant II, of Orlando, who said he has been selling items regularly on Amazon for about six years. He found out about the subpoena last week, he said during an interview with Fresh Take Florida, a news service operated by the University of Florida College of Journalism and Communications.\n“My whole thing is, let people buy what they want to buy and let people spend what they want to spend,” Bryant said.\nMore than 15 others who were subpoenaed could not be reached immediately because their phone numbers were disconnected or were incorrect in public records. Moody’s office declined to release copies of the subpoenas to Fresh Take Florida because the cases were still under active investigation.\nIn Orlando, U.S. Attorney Maria Chapa Lopez said federal, state and local law enforcement agencies were operating a virus-related fraud task force. It was intended to crack down on sales of fake cures for the virus, and pursue people pretending to be officials of the World Health Organization or the Centers for Disease Control and Prevention. It also will investigate medical providers using patient information from testing to fraudulently bill for other medical procedures or tests.\n___\nThis story was produced by Fresh Take Florida, a news service of the University of Florida College of Journalism and Communications. The reporter can be reached at dcassidy@freshtakeflorida.com.", "url": "https://apnews.com/af69a1439a09d9b0255d025fb109cf87"}