{"authors": ["Luis Andres Henao"], "date_download": "2020-05-04 20:15:50", "date_modify": "2020-05-04 20:15:50", "date_publish": "2020-04-08 17:41:37", "description": "NEW YORK (AP) — “Animo!” Courage! In life, the Rev. Jorge Ortiz-Garay would repeat the word in Spanish when he encouraged teenagers to stay in school, when he fed the homeless, when...", "filename": "_23515903092a8ce9fddf1e61018a6911_1588623350.html", "image_url": "https://storage.googleapis.com/afs-prod/media/79ca1e3cf19c4456be50a2efcbfa221b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_23515903092a8ce9fddf1e61018a6911_1588623350.html", "title": "A sad Holy Week after virus death of 1st Catholic priest", "title_page": "A sad Holy Week after virus death of 1st Catholic priest", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Dec. 7, 2019 photo provided by The Tablet, the Rev. Jorge Ortiz-Garay stands with congregants during a Migration Day Mass at St. Brigid Church in the Brooklyn borough of New York. Ortiz-Garay died on March 27, 2020, from coronavirus-related complications and is now the first known priest in the U.S. to have died from the virus. (Courtesy of The Tablet via AP)\nIn this Dec. 7, 2019 photo provided by The Tablet, the Rev. Jorge Ortiz-Garay stands with congregants during a Migration Day Mass at St. Brigid Church in the Brooklyn borough of New York. Ortiz-Garay died on March 27, 2020, from coronavirus-related complications and is now the first known priest in the U.S. to have died from the virus. (Courtesy of The Tablet via AP)\nNEW YORK (AP) — “Animo!”\nCourage!\nIn life, the Rev. Jorge Ortiz-Garay would repeat the word in Spanish when he encouraged teenagers to stay in school, when he fed the homeless, when he consoled those who lost loved ones.\nNow, parishioners repeat his favorite word to pay homage to the devoted leader of their community, even when the pandemic won’t let them gather to mourn their beloved ‘Father Jorge.’\nThe pastor of St. Brigid Church in Brooklyn was the first Catholic cleric in the United States to die from the coronavirus outbreak. He was 49.\nJust days before he died on March 27, he officiated a Mass. He said he was healthy, and told parishioners that “the only way to fight this virus” was to love God and serve others. Like other churches around the globe, the pews of St. Brigid were empty that day; dozens prayed with him from home, via livestream.\n“The whole world is in crisis,” he said.\n“In this time of crisis and panic, it’s time to love and live our faith.”\nThat faith led Ortiz to leave his native Mexico, where he had just graduated with a law degree, and follow his calling into the priesthood. He enrolled in seminary in Italy in the ’90s, and then studied theology in New Jersey before he was ordained at the Archdiocese of Newark in 2004.\nA decade later, he began his work at St. Brigid in Wyckoff Heights, an area straddling the border of Bushwick, Brooklyn and Ridgewood, Queens that is home to a large Hispanic population. He was the Diocesan Coordinator of the Ministry to Mexican immigrants and he oversaw the Diocese of Brooklyn’s annual ‘Our Lady of Guadalupe Feast Day,’ which includes a Mass attended by thousands and a pilgrimage where the faithful carry flaming torches across New York City’s streets.\n“In the community, he was known to be a father -- a father to many,” said the Rev. Joseph Dutan, a 31-year-old priest at St. Brigid who lived one floor above him in the rectory – and stood beside him as he officiated his last Mass.\n“He was known as someone who was always going to be there for you in presence,” said Dutan. “Someone that they could run to when they needed help.”\nDutan said his mentor was tough when he needed to be, loved busting people’s chops, and pulling pranks. But he had a big heart, and above all, he was devoted to his community.\nIn photographs, Ortiz beams with pride in the pulpit, wearing priestly robes embroidered with an image of the Virgin of Guadalupe. Another shows him refereeing a mock boxing match between teenagers who wear colorful, wide-brimmed sombreros. In videos, he sings Christmas Carols in Spanish with children. He was especially proud of his work leading youth groups, including last year’s trip to Panama for World Youth Day.\nErik Chauca, 18, a former sacristan, credits ‘Father Jorge’ with encouraging him to return to college after he quit school. “I don’t even know what I would have been doing right now. Everything is thanks to him,” he said.\n“He cared so much about me,” Chauca said, crying. “I still can’t believe he’s gone.”\nIt happened quickly, Dutan said: After the Mass, Ortiz fell ill but thought it was a minor cold because for years he had chronic bronchitis. His condition worsened. He felt weak and asked Dutan if he could officiate Masses in English and Spanish. Eventually Ortiz stopped coming out of his room, the younger priest said.\n“On Monday evening he told me: ‘Take me to the hospital.’ Dutan called an ambulance. He wanted to ride with his mentor, but they told him that for safety reasons, it was not allowed.\nThey continued to exchange text messages after he was hospitalized at Wyckoff Heights Medical Center in Brooklyn, where Ortiz tested positive for COVID-19.\n“He told me: Joseph, I’m not scared. I know the Lord is with me. I might be able to celebrate Easter with the Lord,” Dutan said.\n“Father we need you to come back. You know I can’t sing! I need to you to sing ‘The Exsultet’ (The Easter Proclamation).” ‘Father Jorge’ wrote back: “‘You’re right! Hahaha!’”\nHours later, Ortiz died. Dutan officiated Sunday Mass in his memory. He said that Ortiz would have been proud -- more than 1,500 people followed the Facebook livestream of the service, expressing their condolences in the comment section.\nAmong them was Chauca, who saw Ortiz as a fatherly figure.\n“I just said Father George’s favorite phrase, which is ‘animo,’ Chauca said.\n“He would always tell everybody that. He would just say - ‘animo!’ keep your head up and just move on. That’s the only phrase that stuck in my head: ‘animo!’”\n___\nAssociated Press religion coverage receives support from the Lilly Endowment through the Religion News Foundation. The AP is solely responsible for this content.\n___", "url": "https://apnews.com/23515903092a8ce9fddf1e61018a6911"}