{"authors": ["Alanna Durkin Richer"], "date_download": "2020-05-04 20:23:32", "date_modify": "2020-05-04 20:23:32", "date_publish": "2020-04-20 18:31:01", "description": "Massachusetts has become a hot spot of coronavirus infections, drawing the concern of federal officials and promises of aid from hard-hit New York as the state's death toll prepares to double in...", "filename": "_81ccf8ace6ec2285c988106b7e1cdab7_1588623812.html", "image_url": "https://storage.googleapis.com/afs-prod/media/d7fa39336fc5426abc57c8044cdc9950/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_81ccf8ace6ec2285c988106b7e1cdab7_1588623812.html", "title": "Massachusetts becomes coronavirus hot spot as cases surge", "title_page": "Massachusetts becomes coronavirus hot spot as cases surge", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "People wear masks as a precaution against the coronavirus as they wait safely distanced in line to enter a supermarket, Monday, April 20, 2020, in Chelsea, Mass. (AP Photo/Steven Senne)\nPeople wear masks as a precaution against the coronavirus as they wait safely distanced in line to enter a supermarket, Monday, April 20, 2020, in Chelsea, Mass. (AP Photo/Steven Senne)\nMassachusetts has become a hot spot of coronavirus infections, drawing the concern of federal officials and promises of aid from hard-hit New York as the state’s death toll prepares to double in less than a week.\nDeaths from COVID-19 are expected to surpass 2,000 this week in Massachusetts, where officials are scrambling to boost hospital capacity and trace new infections to curb the spread of the disease.\n“We’re right in the middle of the surge now,” Republican Gov. Charlie Baker said Sunday on CBS’ “Face the Nation.”\nVice President Mike Pence said the White House is closely watching the Boston area, and the coordinator of the federal coronavirus task force, Dr. Deborah Birx, said officials are “very much focused” on Massachusetts.\nThere were 103 new deaths reported in Massachusetts on Monday, bringing the state’s death toll to more than 1,800. More than 1,500 new cases were reported, for a total of more than 39,500 across the state. That compares with more than 14,000 deaths in New York state and over 35,000 nationally .\nMassachusetts is hoping to bend the curve by using a group of “contact tracers” to alert people who may have come in contact with someone who tested positive for the virus so they can self-quarantine or be tested themselves.\nAs of Thursday, contact tracers had gotten a hold of 765 people who had tested positive and those people identified more than 1,000 people they had been in close contact with, WBUR reported .\n“We don’t have any other really good tools until we have a vaccine,” said Andrew Lover, an expert at the University of Massachusetts Amherst’s School of Public Health & Health Sciences.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and the infirm, it can cause more severe illness, including pneumonia, and death.\nAs the number of hospitalizations and deaths dropped in New York, which had been the epicenter of the outbreak in the U.S., Democratic Gov. Andrew Cuomo pledged to send 400 ventilators to Massachusetts, if needed.\n“You were there for us and we are going to be there for you,” Cuomo said Sunday.\nTwo field hospitals designed to deal with an expected surge of COVID-19 patients opened Monday in Massachusetts, joining two other sites that have been up and running. A fifth one is expected to open in about a week.\nThere were more than 150 patients on Saturday at a medical center called Boston Hope set up at the city’s convention center. The 1,000-bed hospital could reach capacity as the cases peak, officials said.\n“If the surge really happens, which it feels like it’s here and escalating, then in fact we will be filling all of our beds,” Jeanette Ives Erickson, co-director of the field hospital, told The Boston Globe .\nIn Massachusetts’ hardest-hit community, Chelsea, officials are urging residents not to leave their homes at all as the cases surge unless they are an essential worker or have an essential need.\nThe densely populated city just outside Boston, with a large Latino immigrant community, has Massachusetts’ highest rate of infection, nearly four times the statewide rate. The city’s more than 40,000 residents live across just about 2 square miles in crowded housing units, and many work in essential services like grocery stores, said City Manager Thomas Ambrosino.\n“We have to get it under control here,” Ambrosino said.\nBoston has been ramping up efforts to slow the spread in neighborhoods with the highest rates of infection. But as temperatures climbed Sunday, some people ignored directives to stay at home and gathered with friends or played soccer and golf, Mayor Marty Walsh said.\nThey were “not understanding the severity of what’s happening here in this country and in Boston, in Massachusetts,” Walsh said on CNN. “It’s just wrong,” he said.\nThe city has outfitted public work trucks with speakers that are circling hard-hit neighborhoods broadcasting messages about social distancing, washing hands and covering faces.\n“The worst is yet to come for a lot of people,” Walsh said Monday. “Even when we’re beyond the curve, we’re going to have positive cases of coronavirus, we’re still going to have loss of life.”\n___\nAssociated Press writer Steve Leblanc contributed to this report.", "url": "https://apnews.com/81ccf8ace6ec2285c988106b7e1cdab7"}