{"authors": [], "date_download": "2020-05-04 20:17:24", "date_modify": "2020-05-04 20:17:24", "date_publish": "2020-04-28 11:14:37", "description": "But U.N. Secretary-General Antonio Guterres said that despite the challenges, young people are still finding ways to drive change amid the pandemic.", "filename": "entry_un-chief-extremists-using-covid-19-to-recruit-online-youths_n_5ea7faddc5b6a30004e8207d_1588623444.html", "image_url": "https://img.huffingtonpost.com/asset/5ea80e6b3000000a11155092.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_un-chief-extremists-using-covid-19-to-recruit-online-youths_n_5ea7faddc5b6a30004e8207d_1588623444.html", "title": "UN Chief: Extremists Taking Advantage Of COVID-19 Lockdowns To Recruit Online Youths", "title_page": "UN Chief: Extremists Taking Advantage Of COVID-19 Lockdowns To Recruit Online Youths | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "UNITED NATIONS (AP) — U.N. Secretary-General Antonio Guterres warned Monday that extremist groups are taking advantage of COVID-19 lock downs to intensify social media efforts to spread hatred and recruit young people who are spending more time online.\nEven before the coronavirus pandemic, he said, one of every five young people was not getting an education, training or working, and one of every four was affected by violence or conflict. And he lamented that every year, 12 million girls become mothers when they are still children.\nGuterres told a U.N. Security Council meeting on youth, peace and security that “these frustrations and, frankly, failures to address them by those in power today, fuel declining confidence in political establishments and institutions.”\n“When such a cycle takes hold, it is all too easy for extremist groups to exploit the anger and despair, and the risk of radicalization climbs,” he said.\nBut despite these challenges, the U.N. chief said young people “are still finding ways to engage, support each other, and to demand and drive change” — including in the fight against COVID-19.\nGuterres pointed to young people in Colombia, Ghana, Iraq and several other countries joining humanitarian workers in delivering supplies to front-line health workers and people in need, keeping communications open within communities while maintaining social distancing. He said young people are also supporting his March 23 call for a cease-fire in all conflicts in the world.\nJayathma Wickramanayake, the secretary-general’s envoy on youth, criticized the media for focusing on “the small minority of young people who disregarded guildelines” and put people at risk by going to beaches, pubs and parties — and for “completely sidelining the thousands of young people who were already fighting in the front lines of the crisis.”\nShe pointed to young people in Kenya and Cameroon who immediately adopted their peacebuilding organizations and networks to help their communities face COVID-19, the many young health workers and medical students attending to coronavirus patients in China and Italy, the Scouts, Girl Guides and Red Cross youth volunteers running environment and hand-washing campaigns in Jordan and elsewhere, and young people making face masks and fundraising in the United States.\nWickramanayake dedicated her speech “to all the young people who are putting their communities ahead of themselves within war zones, within refugee camps, within favelas and within settlements, showcasing grit and leadership that sometimes we even fail to see in our own political leaders.”\nSecretary-General Gutteres and many Security Council ambassadors stressed the impact of COVID-19 on young people, from a suspension of their education to lost jobs, family stress, mental health issues and other hardships.\nAccording to the U.N. chief’s recent report to the council, there are 1.85 billion young women and men aged 10 to 24 in the world in 2020, 90 percent of them living in developing countries and many in conflict areas.\n“Young people are a huge source of new ideas, solutions and innovation,” Estonia’s U.N. Ambassador Sven Jürgenson said. “During the current pandemic, however, they can be among the greatest victims.”\nHe cited estimates that an additional 42 million to 66 million children could fall into “extreme poverty” as a result of COVID-19 and an analysis from the U.N. Educational, Scientific and Cultural Organization showing that 91 percent of the world’s students are affected by school closures, and more than 1.5 billion students in 191 countries have trouble continuing their studies normally.\n“This will lead to increased educational gaps, serious damage to the prospects for a better future and can potentially lay seeds of radicalization among young people, constituting a threat to peace and security,” Jürgenson warned.\nU.S. Ambassador Kelly Craft added that the more than 400 million young people directly affected by violence or conflict are most vulnerable.\n“Now, the imperative to protect them is even greater: on top of social, education, and health systems that (are) already weakened by conflict or disaster, the COVID-19 pandemic is triggering multiple, interlinked crises impacting hundreds of millions of young people,” she warned.", "url": "https://www.huffpost.com/entry/un-chief-extremists-using-covid-19-to-recruit-online-youths_n_5ea7faddc5b6a30004e8207d"}