{"authors": ["Jordan Valinsky", "Cnn Business"], "date_download": "2020-05-04 16:16:53", "date_modify": "2020-05-04 16:16:53", "date_publish": "2020-04-03 13:46:37", "description": "Production of Corona beer is being temporarily suspended in Mexico because of the coronavirus pandemic.", "filename": "2020_04_03_business_corona-beer-production_index_1588609013.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403085447-corona-beer-bottles-file-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_business_corona-beer-production_index_1588609013.html", "title": "Corona beer stops production", "title_page": "Corona beer stops production - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Production of Corona beer is being temporarily suspended in Mexico because of the coronavirus pandemic.\nGrupo Modelo, the company that makes the beer, posted the announcement on Twitter, stating that it's halting production and marketing of its beer because the Mexican government has shuttered non-essential businesses. The Anheuser-Busch Inbev-owned company also makes Modelo and Pacifico beers.\nThis week, the Mexican government announced the suspension of non-essential activities in the public and private sectors until April 30 in an effort to curb the spread of the virus. The country has more than 1,500 cases and 50 deaths, according to Johns Hopkins.\nGrupo Modelo is ready to enact a plan to \"guarantee the supply of beer\" if the Mexican government decides to include breweries as essential, according to a statement.\nConstellation Brands STZ handles the distribution and import of Grupo Modelo's beers in the United States. CEO Bill Newlands said in an earnings call the brand has \"ample supply to meet consumer demand\" and doesn't expect shortages in the near term.\nRead More", "url": "https://www.cnn.com/2020/04/03/business/corona-beer-production/index.html"}