{"authors": ["Hanna Ziady", "Cnn Business"], "date_download": "2020-05-04 16:53:31", "date_modify": "2020-05-04 16:53:31", "date_publish": "2020-04-08 09:11:48", "description": "Millions of restaurants have been shuttered as the novel coronavirus rips around the world, leaving their suppliers with a huge challenge: find new customers, or close up shop.", "filename": "2020_04_08_business_restaurant-industry-home-deliveries_index_1588611211.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406161505-natoora-fresh-produce-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_business_restaurant-industry-home-deliveries_index_1588611211.html", "title": "They used to sell food to top chefs. Now you're their best customer", "title_page": "Restaurant industry: They used to sell food to Per Se and Le Gavroche, now you're their best customer - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) Millions of restaurants have been shuttered as the novel coronavirus rips around the world, leaving their suppliers with a huge challenge: find new customers, or close up shop.\nFruit and vegetable wholesalers that sold fresh produce to top restaurants in London and New York City before the coronavirus outbreak are overhauling their business models and selling direct to the public.\nFortunately for them, demand for home-cooked meals has never been higher. Grocery sales in the United Kingdom jumped 20% in March to a record £10.8 billion ($13.3 billion), according to data provider Kantar, as consumers rushed to stock their pantries.\nWith some supermarket shelves empty and online grocery delivery services overwhelmed, restaurant suppliers are finding plenty of new buyers among the general public.\nDavid Visick, director of communications at the UK Federation of Wholesale Distributors, said that as many as 70 of its members have set up home delivery services. Many of their customers are buying groceries online for the first time, he said, adding that some businesses are even taking orders by telephone from older customers.\nReynolds, a family-owned greengrocer that supplies some of the United Kingdom's leading restaurant chains and pubs, said it launched a click and collect service from which consumers happily bought avocados and eggs in packs of 18 and 180, respectively.\nIt has since come up with smaller packages and launched home deliveries, but the wave of stockpiling enabled it to offload fresh produce in bulk that would ordinarily have gone to restaurants like Pizza Express and Pret A Manger, said project associate Nick Reynolds.\nSmith & Brock typically supplies luxury hotels such as London's Hotel Café Royal and The Lanesborough, as well as Michelin-starred restaurants like Le Gavroche. Now, the company has gone from taking a handful of orders from households over WhatsApp to delivering nearly 1,200 boxes of fresh fruit, vegetables and dairy products a day, enabling it to hire back workers that it had been forced to furlough.\nNatoora, a business that sells winter tomatoes from Sicily and radicchio from Veneto to upmarket restaurants in London, Paris, Milan and New York — Eleven Madison Park and Per Se among them — said it is on track to replace all the revenue it would otherwise have lost.\nBoxes of fresh fruit and vegetables are pictured inside the warehouse of Natoora.\nThe company signed up more than 30,000 customers for home deliveries in less than two weeks, founder Franco Fubini told CNN Business.\nDeliveries are booked up more than a week in advance in London and New York, where Natoora is signing up several hundred new customers a day. At a time of mass layoffs elsewhere, the company is recruiting just to keep up with demand.\nBritish fisherman are getting in on the action, too. \"We had 4,500 signups from two Instagram posts,\" said Ben King, founder of Pesky Fish, an online marketplace that typically connects UK fishermen directly with restaurants and fishmongers in London. Its daily sales to households in the city now outstrip what it was doing in a week pre-coronavirus, King said.\nThe hope is that these sales will keep fishermen in business until restaurants reopen. Export prices for fish caught in English waters slumped as much as 80% after lockdowns were imposed in Spain and Italy, leaving some boats unable to go to sea because they couldn't cover the cost of their fuel, King said.\nFor most wholesalers, home deliveries will not replace all their revenue or save them from having to temporarily layoff workers, but it will enable them to continue buying produce from the farms and other businesses that supply them. \"It's about getting some cash into the business,\" said Visick. \"They can't survive forever like this.\"\nWill home deliveries last?\nOnce consumers get used to having fresh produce delivered directly to their front door, their shopping and eating habits could change permanently.\n\"Over the next 12 to 24 months, the level of demand in the home for fresh food is going to be higher than it was six months ago irrespective of what happens to restaurants,\" said Natoora's Fubini. \"I think people are going to find more joy in cooking and eating at home, and are going to embed it as a habit in their lives.\"\nHello Fresh, the meal kit delivery company, said in a statement that it expects revenue for the first quarter to be more than 60% higher than the same period in 2019 due to increased customer demand.\nFubini said that Natoora plans to keep the new customers it's won even after the pandemic fades. \"We need to figure out how we do that effectively. We're obviously very committed to the restaurants,\" he added.\nIf the current crisis changes consumers' buying behavior and helps out fishermen in the long term, \"it will be an amazing silver lining on a dark cloud,\" said King.\n\"I'm sure when the ban is lifted people will want to get out and enjoy having a glass of wine and something nice to eat,\" said Smith & Brock co-founder Joe Fowler. But, he added, people might choose to buy more of their fresh produce from local suppliers. \"Provided the demand is there we will keep doing home deliveries,\" he said.\nCorrection: An earlier version of this story incorrectly stated that Pesky Fish was supplying to restaurants in Spain and Italy.", "url": "https://www.cnn.com/2020/04/08/business/restaurant-industry-home-deliveries/index.html"}