{"authors": ["Lisa Rathke"], "date_download": "2020-05-04 20:13:46", "date_modify": "2020-05-04 20:13:46", "date_publish": "2020-04-08 13:37:19", "description": "An inmate at the state prison in Swanton tested positive for the coronavirus, becoming Vermont's first inmate confirmed to have it, officials said Wednesday. Gov. Phil Scott plans to announce on...", "filename": "_f7b34172551514450b35ddd5c3bc4ec8_1588623226.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8a36a5d89def44038f0371fd0ea44f03/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f7b34172551514450b35ddd5c3bc4ec8_1588623226.html", "title": "Inmate tests positive; Scott plans longer stay-home order", "title_page": "Inmate tests positive; Scott plans longer stay-home order", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Vermont senators working remotely are displayed on a monitor, Wednesday, April 8, 2020, at the Statehouse in Montpelier, Vt. The Senate met with a quorum of 16 members wearing face masks and other face coverings in attendance, while the others attended the session electronically during the coronavirus pandemic. (Colin Flanders/Seven Days via AP, Pool)\nVermont senators working remotely are displayed on a monitor, Wednesday, April 8, 2020, at the Statehouse in Montpelier, Vt. The Senate met with a quorum of 16 members wearing face masks and other face coverings in attendance, while the others attended the session electronically during the coronavirus pandemic. (Colin Flanders/Seven Days via AP, Pool)\nAn inmate at the state prison in Swanton tested positive for the coronavirus, becoming Vermont’s first inmate confirmed to have it, officials said Wednesday. Gov. Phil Scott plans to announce on Friday that Vermonters must continue to stay at home.\nThe latest coronavirus developments in Vermont:\n___\nPRISONS\nAn inmate at the Northwest Correctional Facility in Swanton tested positive for the virus, and all inmates and staff at the prison will be tested, officials said Wednesday.\nThe inmate started showing symptoms early Monday morning and was tested and placed in a negative pressure cell, the Corrections Department said. Three staff members also have tested positive. One employee had no contact with inmates, another had possible contact within 48 hours of developing symptoms and the third had contact with inmates within that time frame, said Human Services Secretary Mike Smith.\nThe prison is under full lockdown, and staff members are required to wear masks, he said.\nAt all the state’s prisons, staff temperatures are checked at the start of each shift and inmates are monitored three times a day, Smith said. Staff will be required to wear masks at the other facilities starting on Thursday, he said.\n___\nSTAY HOME\nGov. Phil Scott said Wednesday he plans to lengthen his stay-at-home order for Vermonters, which has been in place for two weeks. The details are expected Friday.\n“Your sacrifices are having an impact,” he said Wednesday during a media briefing. “Staying home, washing your hands, avoiding contact, these steps are literally saving lives.”\n____\nEMERGENCY FUNDING\nPresident Donald Trump has approved Gov. Phil Scott’s request for federal disaster funds to help the state as it responds to the coronavirus outbreak, the governor’s office said Wednesday. The declaration allows the state and local governments and some nonprofits to get 75% reimbursement for emergency protective measures, Scott’s office said.\n____\nNUMBERS\nVermont had a total of 605 confirmed cases, and 23 people have died of COVID-19, Health Commissioner Dr. Mark Levine said Wednesday.\nThe state’s biggest outbreaks have been at two Burlington nursing homes. Burlington Health and Rehab and Birchwood Terrace Rehab and Healthcare have had a total of 120 cases in patients and staff, he said.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, or death.\n___\nLEGISLATURE\nThe Vermont Senate met Wednesday at the Statehouse and approved remote voting. Sixteen out of 30 members attended and wore marks and other face coverings during the session.\n___\nRAPID TESTING\nVermont this week received limited rapid testing capacity, Levine said. The state is expected to get 1,800 total rapid tests from the federal government, Levine said.", "url": "https://apnews.com/f7b34172551514450b35ddd5c3bc4ec8"}