{"authors": ["Sarah Jorgensen"], "date_download": "2020-05-04 17:03:16", "date_modify": "2020-05-04 17:03:16", "date_publish": "2020-04-10 21:46:57", "description": "A federal investigation has been opened into Holyoke Soldiers' Home in Massachusetts, where nearly 30 residents who tested positive for coronavirus have died.", "filename": "2020_04_10_us_holyoke-soldi_c59cb60a501bbfaef2b2bb1c7ba47ed0_index_1588611796.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331011226-veterans-home-coronavirus-deaths-massachusetts-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_holyoke-soldi_c59cb60a501bbfaef2b2bb1c7ba47ed0_index_1588611796.html", "title": "US attorney launches probe of Massachusetts veteran's nursing home, site of a deadly Covid-19 outbreak", "title_page": "US attorney launches probe of Massachusetts veteran's nursing home, site of a deadly Covid-19 outbreak - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A federal investigation has been opened into Holyoke Soldiers' Home in Massachusetts, where nearly 30 residents who tested positive for coronavirus have died.\nCNN has previously reported that, according to staff and union accounts, the home has been dogged by systemic issues for years that could have contributed to an outbreak at the home.\nThe US attorney's office in Massachusetts and the Department of Justice's Civil Rights Division will conduct the investigation. The US attorney's office said in a statement that it will investigate \"whether the Soldiers' Home violated the rights of residents by failing to provide them adequate medical care generally, and during, the coronavirus pandemic.\"\nAccording to the state's Executive Office of Health and Human Services (EOHHS), which runs the facility, as of April 9, 69 residents and 68 staff had tested positive for coronavirus. Since March, 32 residents of the home have died with 28 of those testing positive for Covid-19.\nStaff at Soldiers' Home told CNN they were not provided with proper personal protective equipment, struggled with chronic understaffing, and said that veterans who had tested positive for Covid-19 were housed in tight quarters with other veterans.\nRead More", "url": "https://www.cnn.com/2020/04/10/us/holyoke-soldiers-home-us-attorney-investigation/index.html"}