{"authors": ["Frida Ghitis"], "date_download": "2020-05-04 17:03:44", "date_modify": "2020-05-04 17:03:44", "date_publish": "2020-04-10 23:53:57", "description": "As individuals, as a society, and as humanity, we have been tested in unfamiliar, unexpected ways, writes Frida Ghitis. As it reshapes our existence, the coronavirus pandemic is also revealing the essence of our identity. Do we want to see it?", "filename": "2020_04_10_opinions_this-cr_474f7cec0ece160c370b6f2d62ba5fa1_index_1588611824.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410191705-covid-ghitis-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_opinions_this-cr_474f7cec0ece160c370b6f2d62ba5fa1_index_1588611824.html", "title": "This crisis will tell us who we are", "title_page": "This crisis will tell us who we are (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Frida Ghitis, a former CNN producer and correspondent, is a world affairs columnist. She is a frequent opinion contributor to CNN, a contributing columnist to the Washington Post and a columnist for World Politics Review. Follow her on Twitter @fridaghitis. The opinions expressed in this commentary are those of the author. Read more opinion on CNN.\n(CNN) Like a fog that penetrates every unsealed space, the coronavirus pandemic has invaded our lives, clouding the future and creating challenges we never imagined facing.\nAs individuals, as a society and as humanity, we have been tested in unfamiliar, unexpected ways. As it reshapes our existence, the pandemic is also revealing the essence of our identity. Are we heroes, doing our part for humankind? Or are we tribal, self-preserving individualists, erecting barriers, concerned only about our closest friends and relatives?\nAs the prospect of returning to something resembling our former lives slowly takes shape in our collective imaginations—and in the country's halls of power--we must consider: how will we balance our individual well-being against the larger risks of our response to society? That is, how will we weigh economic recovery against public health, if that is, in fact, the trade-off? The question rises before each of us, as people. It rises before our communities, our countries and the world. What is the pandemic telling us about who we are?\nIt seems as though we've never been more alone and more together. That stark paradox defines the moment. We have been instructed to stay away from one another. But the cliché \"we're all in this together\" has never seemed more accurate.\nEven in the Middle Ages, the plague didn't circumnavigate the planet in a matter of weeks, as this tenacious coronavirus has, forcing every nation to scramble to safety.\nHidden in our homes, we regard in awe t he health care workers. Most did not sign up to risk their lives, as soldiers do, yet many of them are dying. Others are not only falling ill, but possibly endangering their families to help save strangers, to ease the suffering of those gasping for air and dying alone. These workers could call in sick, but they show up for endless hours of grim duty.\nThen there are the people giving our lives a semblance of normality-- the delivery workers, the grocery store clerks, the postal workers, sanitation crews, all at their posts, keeping our struggling economy from expiring.\nAround the world, people applaud the caregivers. We find comfort in their heroism. It makes us feel better about our world; perhaps unconsciously, about ourselves. They are us, we think. But are they you?\nAre we heroes, too? We're doing our best. Maybe. We have proven resourceful, innovative, compassionate. Many, perhaps most of us, keep an eye on our friends and our family. We stay in touch, we call, we video chat on Zoom. We make sure our loved ones are staying safe, sane.\nAnd yet, much of this is self-protective, a defense of a concentric circle—our cushion of stability--only slightly larger than ourselves. That's natural-- normal--but hardly selfless. Do we reach beyond our circle, do we worry about people we don't know; do we urge our country to pitch in to prevent an even greater calamity in other parts of the world?\nLittle of that has happened. The pandemic struck during a time of nationalist introversion, of \"Me First,\" damn the rest. If ever we needed global leadership, it is now. There is none. Every country is looking out for itself. The role once filled by the United States is vacant, leaving humanitarians largely pleading into the abyss at a time when the magnitude of the expected need is so overwhelming, that only a massive multinational response can do the job.\nThe virus is only starting to make its push into the poorest countries, but the disaster is coming. If it can massacre thousands in Milan, Paris and New York, imagine what it can do in overcrowded places in Africa or India. For a glimpse, look at what just happened in Ecuador , ground zero for the coronavirus in South America.\nJonathan Sacks, the former Chief Rabbi of the UK, says, \"We're all eating the bread of affliction now,\" as Jews around the world celebrate a Passover like no other in thousands of years of Jewish history.\nStill, many of us -- the lucky ones -- have been able to keep a post-apocalyptic version of normal times in our upended lives. One can almost, almost, imagine life going on like this indefinitely if it had to. It's remarkable how much still functions under the circumstances.\nThere's much that we can take pride in; the resourcefulness, the creativity, are visible in our daily online connections, in the messages we receive, in the inventions, the ideas, and the quest for solutions to the unexpected problems of our shared condition.\nAre we discovering that we're adaptable, malleable beings, skilled at adjusting to unexpected circumstances, or are we discovering our inner hermit, capable of living with minimal actual—not virtual--human contact? How difficult will it be to re-enter a world full of people? And when will that happen? Can it happen now that the government has defaulted on its promise of widespread testing?\nFollow CNN Opinion Join us on Twitter and Facebook\nMillions face desperate situations. Hundreds of millions around the world could plunge into poverty. It is happening already for many. The global economy could fall into a depression. That means the suffering will be magnified even more.\nWho are we? The question is being answered day by day, person by person, country by country. As we puzzle over it, we would do well to remember what happened after the last time the planet faced an economic cataclysm. Indeed, it is not an idle philosophical question for people caught in pandemic stay-at-home orders, with too much time on their hands.\nThe Great Depression gave us the 1930s, bitterness, despair, demagogues, culminating in a calamity even greater than the initial economic collapse. It, too, showed us who we are.\nWe don't know how this will end, but we should consider who we are, who we want to be, and what happens if we give the wrong answer.", "url": "https://www.cnn.com/2020/04/10/opinions/this-crisis-will-tell-us-who-we-are-ghitis/index.html"}