{"authors": ["Christine Armario"], "date_download": "2020-05-04 20:07:57", "date_modify": "2020-05-04 20:07:57", "date_publish": "2020-04-08 17:06:24", "description": "BOGOTA, Colombia (AP) — Alfonso Cedeño died at a crowded hospital in the Ecuadorian city of Guayaquil, where the only bed doctors could offer was an ambulance stretcher. Two weeks later, his...", "filename": "_1f7da9336457bc5fc2e1a3ad2471b248_1588622877.html", "image_url": "https://storage.googleapis.com/afs-prod/media/056dcea559404e83b346eb4956311b9c/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1f7da9336457bc5fc2e1a3ad2471b248_1588622877.html", "title": "Ecuador struggles to bury coronavirus dead; some bodies lost", "title_page": "Ecuador struggles to bury coronavirus dead; some bodies lost", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A coffin with the body of a recently deceased person sits in the bed of a pickup truck before burial, outside Teodoro Maldonado Hospital in Guayaquil, Ecuador, Monday, April 6, 2020. Guayaquil, a normally bustling city that has become a hot spot in Latin America as the coronavirus pandemic spreads, also has untold numbers dying of unrelated diseases that can’t be treated because hospitals are overwhelmed. (AP Photo/Luis Perez)\nA coffin with the body of a recently deceased person sits in the bed of a pickup truck before burial, outside Teodoro Maldonado Hospital in Guayaquil, Ecuador, Monday, April 6, 2020. Guayaquil, a normally bustling city that has become a hot spot in Latin America as the coronavirus pandemic spreads, also has untold numbers dying of unrelated diseases that can’t be treated because hospitals are overwhelmed. (AP Photo/Luis Perez)\nBOGOTA, Colombia (AP) — Alfonso Cedeño died at a crowded hospital in the Ecuadorian city of Guayaquil, where the only bed doctors could offer was an ambulance stretcher. Two weeks later, his family doesn’t know where his body is.\n“My uncle is nowhere to be found,” Alfonso Mariscal said Tuesday.\nRelatives who have lost loved ones to the coronavirus in this sweltering metropolis of 2.6 million say burying their family members is as agonizing as trying to get them care here in one of Latin America’s most infected cities.\nHundreds died at home, left in family living rooms for days before overworked coroners could retrieve their bodies. Those who perished in hospitals were put in chilled shipping containers that serve as makeshift morgues.\nGovernment representatives say they are now quickly picking up and burying the dead, but family members describe the process as a wrenching, confusing odyssey. Some have had to search through body bags in teeming morgues to find loved ones. Others, like Mariscal, still don’t know where their relatives have been taken.\nThe lucky ones are placed in cardboard caskets because wooden coffins have become too expensive or scarce. Their relatives then wait for hours outside cemeteries in pickup trucks to bury their dead.\n“Families are crying out,” said Merwin Terán, who owns a Guayaquil funeral home. “But as much as they scream, there is nothing they can do.”\nMany fear Ecuador could be a frightening harbinger of what’s to come in the rest of Latin America, a region with far fewer confirmed infections than the U.S. or Europe, but with more severe shortages of doctors, hospital beds and ventilators.\nMost of the small South American nation’s 4,000 cases are in Guayas province, which includes the city of Guayaquil, where overstretched hospitals often must turn away those sick from COVID-19 and other illnesses.\nJorge Wated, who leads a government task force, said officials retrieved over 520 people who died at home over the last week. As of Tuesday, workers had buried 146 of the deceased and expected to inter 50 more that day, he told a local radio station. He said emergency services are now collecting the dead within 12 hours.\nAbout 2,000 cardboard coffins are being given to family members who cannot obtain a wooden casket, a practice Wated said Ecuador also used after a devastating 2016 earthquake that killed nearly 700 people.\n“We have to find the best option for this moment,” he said.\nAcross the globe, wrenching scenes are playing out in hospitals and funeral homes struggling to cope with the coronavirus dead. In devastated swaths of Italy, funerals are witnessed by just a few people and last five minutes, ending without embraces. In the U.S., some funeral homes are removing chairs to encourage social distancing or using technology to offer online guest books and livestreamed services.\nIn Ecuador, where about a quarter of the population earns less than $85 a month, those are luxuries many cannot afford.\nThe government itself is burying many of the dead, informing relatives through a new website which cemetery their family member was taken to. They will not be allowed to visit until the health emergency is declared over.\nMelanie Peralta said the crisis in Guayaquil has put class differences into stark relief. Her father, Guillermo Villao, died on March 31 after suffering from a fever, sore throat and difficulty breathing — all signs of coronavirus, though he was never tested. For six days, hospital staff could not say where her father’s body was.\nFinally, the family got an answer after paying a worker $100 to help find his remains.\n“There was nothing to identify him,” she said. “His body was already decomposed.”\nPeralta wonders what would have happened if she didn’t have cash on hand to enlist someone at the hospital to try to find her father.\n“Those who don’t have money don’t find their family members,” she said.\nA state worker was fired at a different hospital Tuesday after families complained they were being charged to get information on the remains of their loved ones.\nWated described such stories as “a shame,” but said it is the responsibility of hospitals to ensure the dead are properly identified. He said cemetery workers are taking pictures of the deceased before interring them. The government will also begin burying the remains of anyone not collected by relatives within 24 hours of death.\nCedeño, a 57-year-old union leader, was taken to a public hospital in Guayaquil in late March after having difficulty breathing. There were no beds, so doctors put him in a plastic chair and connected him to an intravenous line, said Ricardo Ramirez, a retired physician and friend who communicated with him by phone.\nFull Coverage: Virus Outbreak\nTwelve hours later, he was still in the chair and in desperate need of a ventilator, but the intensive care unit remained full. A hospital worker improvised by pulling a stretcher and an oxygen mask from an ambulance.\nBut it proved too little too late; Cedeño died that evening. His family believes the virus killed him, but he was never tested.\n“It’s not their fault,” Ramirez said of the doctors. “They are also impotent.”\nNonetheless, he said hospital officials failed to adopt a protocol that would ensure bodies were clearly identified and that morgues were not overwhelmed.\n“It’s an incredible thing, the drama, the horror people are living here,” he said.\nMarsical thought he had finally located his uncle Tuesday when he logged on to the website for the Gardens of Hope cemetery and found Alfonso Cedeño’s name, along with information stating that he had been buried Monday.\nBut when he went to the crypt, his relative wasn’t there.\n“I opened the vault,” he said. “It was empty.”\n___\nChristine Armario can be reached at carmario@ap.org or on Twitter at www.twitter.com/cearmario .", "url": "https://apnews.com/1f7da9336457bc5fc2e1a3ad2471b248"}