{"authors": [], "date_download": "2020-05-04 20:16:26", "date_modify": "2020-05-04 20:16:26", "date_publish": "2020-04-08 03:00:58", "description": "PORTLAND, Ore. (AP) — All public land is closed within the Columbia River Gorge National Scenic Area because of the coronavirus outbreak, but that hasn’t stopped some people from showing up and...", "filename": "_111e93ee9fb01ffc694464359c93b33b_1588623386.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_111e93ee9fb01ffc694464359c93b33b_1588623386.html", "title": "Gorge highway closure expanded after visitors trespass", "title_page": "Gorge highway closure expanded after visitors trespass", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Ore. (AP) — All public land is closed within the Columbia River Gorge National Scenic Area because of the coronavirus outbreak, but that hasn’t stopped some people from showing up and trespassing onto parks and trails.\nFollowing the influx, the Oregon Department of Transportation announced Tuesday that it will shut down seven additional miles of the Historic Columbia River Highway, which leads to many of the area’s most popular hikes and waterfalls, The Oregonian/OregonLive reported .\nThe highway will now be closed from Larch Mountain to Angels Rest from 8 a.m. to 8 p.m. daily. The department previously closed the scenic highway from Angels Rest to Ainsworth.\nExisting closures haven’t stopped some 200 cars an hour from showing up, according to transportation officials. Many visitors have also disregarded barricades and thrown signs off the road.\nOfficials working to maintain the widespread closure report contacting visitors about once every four minutes.\nFollowing an earlier decision by the Oregon Parks and Recreation Department, the U.S. Forest Service closed all public land in the Columbia Gorge on March 26, supporting Oregon Gov. Kate Brown’s executive order banning all nonessential travel, issued March 23.", "url": "https://apnews.com/111e93ee9fb01ffc694464359c93b33b"}