{"authors": ["Amy Forliti"], "date_download": "2020-05-04 21:07:15", "date_modify": "2020-05-04 21:07:15", "date_publish": "2020-04-05 15:14:20", "description": "ST. PAUL, Minn. (AP) — Lisa Neuburger was caring for a patient with the coronavirus when the person's ventilator tube became detached. As she worked to help the patient, she knew fluid from the...", "filename": "_8697a4883bf8799aa235c393ed505bfe_1588626435.html", "image_url": "https://storage.googleapis.com/afs-prod/media/d6adce3b41f04a3ba6479c09dd134c18/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8697a4883bf8799aa235c393ed505bfe_1588626435.html", "title": "Doctors, nurses leave homes to protect families from virus", "title_page": "Doctors, nurses leave homes to protect families from virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Wednesday, April 1, 2020 photo, Joy Engel holds her son at her home in Cape Elizabeth, Maine. Engel, who is pregnant, and her husband, Dr. Ben Hagopian, who works at a family practice and an urgent care clinic, decided to isolate themselves from each since the coronavirus outbreak. (AP Photo/Robert F. Bukaty)\nIn this Wednesday, April 1, 2020 photo, Joy Engel holds her son at her home in Cape Elizabeth, Maine. Engel, who is pregnant, and her husband, Dr. Ben Hagopian, who works at a family practice and an urgent care clinic, decided to isolate themselves from each since the coronavirus outbreak. (AP Photo/Robert F. Bukaty)\nST. PAUL, Minn. (AP) — Lisa Neuburger was caring for a patient with the coronavirus when the person’s ventilator tube became detached. As she worked to help the patient, she knew fluid from the person’s lungs could be spraying into the air, possibly exposing her to the virus, despite the protective gear she was wearing.\nThat’s when the 37-year-old nurse and mother got scared for her family.\n“I couldn’t sleep that night. I thought, ‘If I brought this home to my mom, she’s probably going to die, and it’s probably going to be my fault.’ So I had to find a different way,” Neuburger said.\nTo protect her family, Neuburger moved from her parents’ home, where she had been living with her son after a recent divorce, and into a camper. Even though she doesn’t know when she’ll be able to hug her 11-year-old boy again, she’s glad she chose to self-isolate — especially since she began feeling sick five days after that hospital scare.\nHoled up in the camper as she awaits the results of a COVID-19 test, Neuburger is among countless doctors and nurses around the world who are choosing to move to hotels, tents, garages and other temporary housing to protect their loved ones — even as they risk exposing themselves to a virus that has claimed tens of thousands of lives, including a number of medical workers.\nHotels, some business owners and people who run Airbnb rental homes are among those offering lodging, sometimes for free, to doctors and nurses needing to self-isolate. Social media is full of efforts to match medical professionals with temporary housing. One Facebook group, RVs 4 MDs, connects RV owners with medical workers. In Ireland, a real estate company has used Instagram to offer up empty flats.\nThe extra layer of isolation means those who are risking their own health to save the lives of others are now sacrificing even more as they resign themselves to virtual contact with their kids, parents, spouses and others they would normally fall back on for emotional support during this stressful time.\n“It’s upsetting — even though you know it’s the right decision to leave your family,” said Mica Sosa, a floor nurse at an oncology unit at a Phoenix hospital, who moved into a friend’s empty condominium a few weeks ago. “It’s so bizarre to turn around and walk away from the people you normally run to.”\nEvents Sosa knows she will miss: Easter with her 4-year-old son; her mom’s 71st birthday; and her own 7th wedding anniversary. Some colleagues thought she was moving too soon. But with her mother’s age and her own husband in his 60s, Sosa didn’t want to wait until Phoenix had a surge in cases to take precautions.\n“Why wait until you are New York to get that radical? You need to protect yourself now,” she said. “I think everyone needs to look at their own family situation and decide what’s best for them.”\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. But the virus can lead to more severe illness, including pneumonia, and death for some, especially older adults and people with existing health problems.\nOutside Portland, Maine, a pregnant Joy Engel is staying home with a toddler son while her husband, Dr. Ben Hagopian, lives in a friend’s empty in-law apartment.\n“We fought hard for this pregnancy and we weren’t willing to take the risk,” Engel said.\nFor Neuburger, the gravity of the coronavirus took hold in one shift in the intensive care unit at the Minnesota hospital where she works.\nShe felt her mask leaking as she cared for one patient, but she kept doing her job and switched to a protective respiratory device when she could.\nThen came the patient whose ventilator tube came apart.\nOn the way home from work, she called her dad. She told him to take her son, Xander Ponkin, upstairs, while she went directly to the basement where she had been staying. She kept away from the rest of her family until she could move into a camper two days later.\n“My dad made me give him a hug even though I didn’t want to. He said, ‘What happens if you get sick and die? I won’t see you again,’” she said.\nShe used Facebook to find the camper, and plans to pay its owner $200 a month. It’s now parked in the driveway of her former in-laws, who are caring for Xander, in the Twin Cities suburb of St. Paul Park.\nShe has been able to play with him in the yard — at a distance. They also use video chat to play games, and she watches from her window as he shoots baskets outside.\nThe hardest part, Neuburger said, is not being able to give him a hug.\n“I’m making the best of it. I’m trying to,” she said. “Sometimes I just sit here and cry. But then … I feel like I sleep better knowing I’m not possibly infecting my family.”\n___\nAssociated Press writer David Sharp in Portland, Maine, contributed to this report.", "url": "https://apnews.com/8697a4883bf8799aa235c393ed505bfe"}