{"authors": ["Cnn Staff"], "date_download": "2020-05-04 16:23:05", "date_modify": "2020-05-04 16:23:05", "date_publish": "2020-04-06 16:28:23", "description": "Up until last week, official guidance suggested that presumptively healthy people didn't need to be wearing masks. Now, that has changed. In this episode, CNN Chief Medical Correspondent Dr. Sanjay Gupta explains the new recommendations.", "filename": "2020_04_06_health_sanjay-gupta-podcast-april-6-wellness_index_1588609385.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402114757-gupta-coronavirus-podcast-top-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_health_sanjay-gupta-podcast-april-6-wellness_index_1588609385.html", "title": "New mask guidance: Dr. Gupta's coronavirus podcast 4/6", "title_page": "New mask guidance: Dr. Gupta's coronavirus podcast 4/6 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Up until last week, official guidance suggested that presumptively healthy people didn't need to be wearing masks. Now, that has changed. In this episode, CNN Chief Medical Correspondent Dr. Sanjay Gupta explains the new recommendations.\nDr. Sanjay Gupta: Our second episode ever — which, if you can believe it, aired just a month ago -- was all about masks. On March 3, we told you that, if you appear to be healthy, you probably don't need to be wearing a mask. At that time, that was the advice from the World Health Organization and the Centers for Disease Control and Prevention.\nThe CDC has now issued new guidance recommending that even people who are not displaying symptoms of Covid-19 should cover their faces in public when they cannot maintain social distancing, in places like grocery stores and pharmacies. The change was announced by President Trump at a briefing on Friday, and we want to make sure you know why and have the latest information about keeping yourself and others safe.\nI'm Dr. Sanjay Gupta, CNN's Chief Medical Correspondent. And this is \"Coronavirus: Fact vs. Fiction.\"\nPart of what inspired the CDC's new guidance on masks is a letter by a panel of prestigious scientists that warned Covid-19 may be spread through talking or even breathing -- not just coughing or sneezing.\nIn some ways, we've known this for a long time. It is the essence of asymptomatic spread: spreading without symptoms.\nDr. Harvey Fineberg, one of the scientists who sent the letter to the White House last week, said he would start wearing a mask when he goes to the grocery store. Here he is on CNN.\nDr. Fineberg: What we know about respiratory viruses is that they are spread by visible droplets and tiny invisible droplets and then even tinier aerosol that can be in the air. And there have been studies of all three modalities to show that they are produced by humans. Breathing: Some of us put out many more aerosols than others when we breathe. By talking, especially when we use something like a T or a P. And also, just by singing, coughing, sneezing. All the things that produce visible spray. All of these modalities can carry virus.\nDr. Gupta: Fineberg's letter pointed to the growing body of evidence about the role of asymptomatic people.\nIt's still not clear just how big a role asymptomatic transmission plays in the spread of the disease. But the CDC now recommends that everyone cover their face as a precaution. It is to keep you from spreading the disease, not necessarily to protect you from getting the disease.\nAs I've said before, we should all behave as if we have the virus.\nJust two days after Fineberg's letter was sent to the White House, the President announced the CDC's new guidelines.\nTrump: The CDC is recommending that Americans wear a basic cloth or fabric mask that can be either purchased online or simply made at home, probably material that you'd have at home. These face coverings can be easily washed or reused.\nDr. Gupta: Before Trump's announcement, local governments in cities like Los Angeles, Laredo, Texas, and New York City had already recommended that citizens wear some form of face covering.\nAgain, the purpose of a mask is not to protect yourself, so much as to protect others from you. Homemade masks like scarves or bandanas won't filter out all potentially harmful droplets, but they'll reduce the potentially harmful droplets that you're expelling.\nIn his announcement about new mask guidelines, Trump emphasized that the average person who isn't displaying symptoms of Covid-19 does not need a surgical or respirator mask. Those should be reserved for health care workers on the front lines.\nBecause of the shortage of medical-grade masks, President Trump announced separately last week that he had invoked the defense production act to bolster the supply chain and get more masks and ventilators to those in need.\nTrump: We anticipate issuing more orders under the Defense Production Act in the very near future. In addition to the one that I have just signed against 3M for face masks. We just signed an element of the act against 3M. And hopefully they'll be able to do what they are supposed to do.\nDr. Gupta: 3M is the world's largest manufacturer of respirator masks. The company 3M is the world's largest manufacturer of respirator masks. The company said in response that it is working to comply with President Trump's order to ramp up mask production.\nEquipment shortages have hindered the United States response to Covid-19, prompting health care workers across the country to publicly beg for protective gear.\nCNN Investigative Correspondent Drew Griffin: Many medical workers are fighting this battle without the thinnest level of protection ... that could mean the difference between treating the infected and becoming one of them.\nDr. Gupta: The lack of an adequate stockpile and global supply chain disruptions have contributed to this issue, but so have individual hoarders.\nJust last week, the Department of Health and Human Services redistributed almost 200,000 medical grade N95 masks and other medical supplies seized by the FBI from a man in Brooklyn.\nThere is no need to hoard anything. Not masks -- not toilet paper. But now, cover your face when you leave your house if you're going to be in a public setting where it's difficult to maintain social distance. To be fair, the general consensus is that it is not exactly clear how much this will help, but it certainly won't hurt.\nI asked White House Coronavirus Task Force member Dr. Anthony Fauci about the optics of masks last week, before the Trump administration had issued any new guidance.\nDr. Fauci: So if everybody wears a mask, does that look like we're all frightened of each other? But, you know, the people in Asia have been doing that long before coronavirus and it's become part of their culture. I mean, is it good? Is it bad? I think it's neither. It's neither good nor bad. They've just integrated that into their culture. And, you know, as I said, I cannot imagine it's doing harm and it might be doing some good.\nDr. Gupta: In fact, mask-wearing in countries like Taiwan, South Korea and China may have contributed to lower infection rates and rapid containment of outbreaks in those countries. A 2004 study of the transmission of SARS in Beijing found that consistently wearing a mask in public could reduce risk of contracting SARS by 70%.\nResults like that are what make the conflicting guidance on masks so confusing. At the briefing where the new guidance was announced, Surgeon General Jerome Adams acknowledged the back and forth over mask wearing.\nSurgeon General Adams: I want to unpack the evolution of our guidance on masks because it has been confusing.\nDr. Gupta: In February, Adams had tweeted a plea for people to stop buying masks so there would be enough for health care workers. Many people wondered at the time, if health care workers needed them, why didn't the rest of us? Here's Dr. Adams on Friday.\nDr. Adams: We now know from recent studies that a significant portion of individuals with coronavirus lack symptoms. ... CDC is always, always looking at the data ... and new recommendations will come as the evidence dictates.\nDr. Gupta: Dr. Adams also gave instructions for how best to use a face covering.\nDr. Adams: I want to say, if you do choose to wear a face mask, very important, wash your hands first because you don't want to put on a face covering with a dirty hand. Do not touch your face while you are wearing the face covering because again you could take materials from the surface, germs from the surface and bring it to your face. If you choose to wear a face covering, please, please leave the N95 mask, the medical supplies, for the medical professionals, health care workers, and front-line workers.\nDr. Gupta: The bottom line is this: Yes, the official recommendations have changed. This has been an evolution. We're all continuing to live and learn. But for now, cover your face when you go out in public. Stay home as much as you can. Maintain a social distance.\nAnd if you need inspiration for your face covering, or you want to make your own, you can take a page out of my daughter's book. She's been using her own sewing machine to make masks out of cloth. You can find instructions for how to do this at CNN.com\nWe'll be back tomorrow. Thanks for listening.\nYou can also head to cnn.com/coronavirus and sign up for our daily newsletter, which features the latest updates on this fast-moving story from CNN journalists around the globe.", "url": "https://www.cnn.com/2020/04/06/health/sanjay-gupta-podcast-april-6-wellness/index.html"}