{"authors": [], "date_download": "2020-05-04 20:17:39", "date_modify": "2020-05-04 20:17:39", "date_publish": "2020-04-04 20:17:43", "description": "LOUISVILLE, Ky. (AP) — Some Kentucky churches are still planning to hold in-person church services this Sunday, despite statewide orders that ban mass gatherings to prevent the spread of the...", "filename": "_e74fd32482925fbc8b575ac4709d3268_1588623459.html", "image_url": "https://storage.googleapis.com/afs-prod/media/2cbcd10f408e4ab1965ea2f2905d9a20/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e74fd32482925fbc8b575ac4709d3268_1588623459.html", "title": "Some Kentucky churches plan to gather, despite virus orders", "title_page": "Some Kentucky churches plan to gather, despite virus orders ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Kentucky Gov. Andy Beshear speaks during a media conference at the state Capitol in Frankfort, Ky., to provide an update on the novel coronavirus on Sunday, March 29, 2020. (Ryan C. Hermens/Lexington Herald-Leader via AP)\nKentucky Gov. Andy Beshear speaks during a media conference at the state Capitol in Frankfort, Ky., to provide an update on the novel coronavirus on Sunday, March 29, 2020. (Ryan C. Hermens/Lexington Herald-Leader via AP)\nLOUISVILLE, Ky. (AP) — Some Kentucky churches are still planning to hold in-person church services this Sunday, despite statewide orders that ban mass gatherings to prevent the spread of the coronavirus .\nLouisville preacher Jack Roberts told The Courier Journal that he would rather go to jail and court than pay a fine for violating the March 19 order of Kentucky’s health department.\nHe said the prohibition violates First Amendment and state constitutional rights. Roberts said he has encouraged social distancing at his Maryville Baptist Church and asked people at high risk of infection to stay home and watch live-streamed services.\n“I’m not interested in trying to defy the government,” Roberts told the newspaper. “I don’t want to battle with anybody. What I’d like to do is just preach the Gospel, and that’s become more difficult as time’s gone on. And it’s truthfully what I plan on doing.”\nLouisville’s Our Savior Lutheran is also continuing in-person services, with online registration required beforehand and seating restricted to every other pew.\nOur Savior Pastor Joshua Cook said in a YouTube video he felt he should keep the church open “because I believe and confess that this is a spiritual hospital and that there are times when spiritual emergencies require access to God’s house.”\nSome states, including Florida, have made exemptions to allow religious gatherings to proceed during the coronavirus. Kentucky does not have that exemption.\nBefore it became an order, Kentucky Gov. Andy Beshear first issued guidance that churches cancel in-person services on March 11 .\nBeshear said Friday that he’s aware of “very few” churches that are still holding normal in-person services. He suggested having a sheriff’s deputy or state police car in the parking lot to remind them they are “spreading the coronavirus beyond their church, beyond any meeting that they’re at.”\n“Is it worth losing 5% of your church, 10% of your church?” Beshear said. “When you show back up for Christmas, do you want to look around and see an entire part of the pews that used to be filled that aren’t? This isn’t a test of faith. This is our time to use the wisdom that God provides us to protect ourselves and one another and watch the virtual service.”\nAccording to state officials’ count Saturday, Kentucky cases since the pandemic began surpassed 910 and the death toll reached at least 40.\nAsked during his daily update Saturday, the governor said that he would wear a cloth mask in certain public settings in line with what federal health officials have begun recommending . But he also said he hasn’t been in a car in about 18 days and has only been in two places.\n“I’m trying to model what I’m asking everybody else to do,” Beshear said.\nMost people who contract COVID-19 have mild or moderate symptoms, which can include fever and cough but also milder cases of pneumonia, sometimes requiring hospitalization. The risk of death is greater for older adults and people with other health problems.\n___\nFollow AP news coverage of the coronavirus pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/e74fd32482925fbc8b575ac4709d3268"}