{"authors": ["Margarita Lázaro", "Huffpost Spain"], "date_download": "2020-05-04 20:21:46", "date_modify": "2020-05-04 20:21:46", "date_publish": "2020-04-29 18:56:08", "description": "Trainers share their advice so you can make the most of your fitness routine during the coronavirus lockdown.", "filename": "entry_exercise-mistakes-working-out-at-home_l_5ea9b6bcc5b6a11afc786b98_1588623706.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9cb7c220000640d827e04.jpeg?cache=amSvNbYhpC&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_exercise-mistakes-working-out-at-home_l_5ea9b6bcc5b6a11afc786b98_1588623706.html", "title": "17 Common Exercise Mistakes People Make When Working Out At Home", "title_page": "17 Common Exercise Mistakes People Make When Working Out At Home | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "A previous version of this article originally appeared in HuffPost Spain.\nThe coronavirus lockdown has many people focusing on moving their bodies. Faced with the prospect of not being able to go to a gym or a class, many have turned to YouTube and Instagram in search of workouts.\nWhile it’s good to exercise, of course, you also need to be careful of how it’s done. The margin of error for bad form and mistakes may increase exponentially at home.\nThe good news is that fixing these issues is as easy as making them in the first place. The first step is recognizing what you’re doing wrong, so that you can address it. Here are a handful of common mistakes people make:\n1. Trusting any person who posts a workout on Instagram\nNot all trainers are created equal, especially if you’re not used to doing exercise and don’t keep an eye on your form.\n“One of the most common mistakes today is following influencers who don’t have any training, but who do have lots of marketing behind them,” explains Beatriz Crespo, a specialist with doctoral degrees in both medicine and sports performance.\n“It’s like going to a professional who says they can cure you. They’re not a doctor but they do have a marketing package that positions them as a health guru,” she continued. ”You believe them and follow everything they recommend without questioning it and without thinking about it. You follow them because it’s easy, they’ve got bright colors and play the hottest tunes.”\n2. Wearing yourself out to get better and faster results\nAccording to Crespo, “lots of people really believe that if you don’t get tired, if you’re not stiff the next day, or if you don’t train at a high intensity and with 100% motivation every day, then you’re not making progress or doing anything to make up for being stuck inside, and that will be good for losing weight.”\nIn her opinion, “this is the greatest myth and lie of the sports industry,” insisting that ”’train hard’ and ’no pain, no gain’ are lies.”\n3. Thinking that sweating means you’ll lose weight\nNothing could be further from the truth. You sweat when you get dehydrated, and that’s why you shouldn’t exercise wearing lots of clothing or in a very warm setting.\n“When you get dehydrated, the same thing happens as when you overtrain. It’s counterproductive, and it’s also dangerous for your health,” Santiago Marchante, a member of the Spanish Federation of Personal Trainers and Fitness, previously told HuffPost Spain.\nRyanJLane via Getty Images\n4. Not staying properly hydrated\nWater must be by your side throughout the entire routine, said trainer Verónica Costa. Water is more than enough to keep you hydrated; you don’t need sugary sports drinks.\n“Unless the exercise is aerobic and lasts a long time (more than 70-75 minutes), it makes no sense to drink those drinks. Many are also hypertonic, meaning that they’re absorbed more slowly than water, and have a high sugar content, so they can cause gastrointestinal discomfort,” Pedro Ruiz, personal trainer and coordinator of tupersonaltrainer.com, previously told HuffPost Spain.\n5. Repeating the same exercise over and over again\nOur body isn’t going to be better just by endlessly repeating the same workout. In fact, it can be counterproductive.\n“Variety in stimuli is important to avoid strains,” Crespo said. “We spend a lot of time seated and we need sessions that make up for our sedentary daily routine by providing different stimuli based on four fundamental pillars: strength training, resistance, flexibility and speed.”\nFrancisco García-Muro, coordinator of physical therapy in physical activity and sports section of the Professional Association of Physical Therapists of Madrid, notes an additional problem: “Working very specific muscles can create an imbalance with respect to the rest of the body, and that ends up manifesting as a problematic condition.”\n6. Thinking you’re doing it better because you’re shaking\nDon’t push yourself too hard at first or you’ll risk getting an injury.\n“It’s not healthy for your muscles to shake during a plank exercise and for you to be encouraged to hold on,” Crespo said.\n“Always doing everything really fast or getting really tired and finishing with your legs like Jell-O isn’t healthy either,” she continued.\n7. Working above or below your abilities\nYou need to measure your strength to know where both your upper and lower limits are. If you want the exercise to be effective, physical therapist Pablo Olabe recommends getting a heart rate monitor. Then figure our your target heart rate for your age and health status and strive to work in that range.\n8. Pushing past your limits to do as many reps as the trainer\nThere’s no reason for you to do the same number of reps as the online trainer who’s guiding you. Listen to your own body.\n“The professional has to give you some guidelines so you can learn to monitor yourself on your own,” Crespo said. “In that sense, you need to measure the perception of fatigue that you get from the exercise or sequence of exercises suggested. From there, as a trainer, I can tell you a maximum of 20 reps and tell you the kinds of feelings I want you to get.”\nIt’s advisable to stop doing the exercise when you start to feel worn out, but you still have strength to keep going: “On a scale of 0 to 10, where 0 is not tired at all and 10 is really tired, that would mean being around 6 or 7. Stop when you get there, whether it’s 6 reps, 8 reps, or the maximum of 20,” Crespo said.\nvisualspace via Getty Images\n9. Not paying attention to whether you have the right form\n“No one is going to correct your form like they do in guided classes at the gym, so you have to be the one who takes to the time to fix it,” says Costa. “You can’t rely on what you see on the computer screen, “so I recommend doing the exercise in front of a mirror wherever possible.” Don’t worry if this means you miss a rep or two, because what it really means is that you’re preventing a possible injury.\n10. Not resting or listening to your body\n“Rest is part of training and it’s really necessary so your body can regenerate tissues and improve bone quality after exercising,” Crespo said.\nAccording to Olabe, it’s important to know how to listen to your body when you exercise, as well as when it should rest.\n“If we’re not able to listen to it and then the next day we don’t stop or we take it up a notch, the only thing we’ll end up doing is get injured,” he pointed out. He recommends three ways to exercise based on your baseline condition.\nNo regular activity: one light day of activity, one day of rest, one day of activity, one of rest. Repeat.\nIn good condition: two days of activity, one of rest, two days of activity. Repeat.\nRegularly exercise: three or four days of activity, one of rest, three or four days of activity, one of rest. Repeat.\n11. Starting without warming up and doing the exercises cold\nThe first thing to do before starting any round of exercise is to warm up, said Costa, who recommends spending 10 minutes on your warm-up.\n“It’s like getting everything ready to go,” García-Muro added. “The warm-up reduces the risk of injuries, and it’s also how you can get the most out of the work you do.”\nEven if you’ll only be working out for half an hour, you still need to warm up, either with a specific routine or by doing the first round more lightly.\n12. Overvaluing stretching\n“Stretching is healthy, but it’s not a cure-all,” Crespo said.\n“Our tissues are made to move. If you don’t move, you’re not going to make up for the firmness they lose with the lack of movement,” she continued.\nThat’s when your muscles, ligaments, and tendons become more flexible: “The tissues rub more freely against one another and you automatically feel fewer contractions or feelings of tension in different parts of the body, such as your neck, lumbar region, hips, shoulders, etc,” she said.\nThat’s why, to be flexible, first we need to move and then we need to stretch.\n13. Undervaluing stretching\nIt’s not a cure-all, as mentioned, but it is necessary. In fact, Olabe recommends dedicating one session per week just to stretching.\n“It’s a mistake to skip the stretching after a session, and it’s also a mistake not to dedicate entire sessions to doing a good set of stretches, myofascial release, and other techniques that are super healthy for the body,” added Crespo.\nRyanJLane via Getty Images\n14. Giving up because an exercise becomes too much for you\nYou should stop the exercise if it becomes painful, but you can and should continue with the next one.\n“Stop doing that exercise and move on to the next one because you might hurt yourself. It doesn’t matter if you skip one,” Crespo said. “If you can’t manage now, you will get there. The important thing is not to get discouraged or give up.”\n15. Turning on the TV or keeping an eye on your phone\nWhen you do exercise, the best thing to do is to leave your phone or any other distraction like the TV or a book switched off or out of reach.\n“I believe that if you’re concentrating on one thing, you can’t be concentrating on another. It will be much less effective,” explained Olalla Eiriz, a trainer from VIP Training.\n16. Doing an unsupervised class if you’re dealing with an injury\nYouTube or Instagram classes are good, but be cautious if you have any problems or injuries.\n“Anyone with an underlying problem, back pain, injuries, or who is pregnant should sign up for specific classes and do guided training,” Costa said.\n17. Focusing on the scale", "url": "https://www.huffpost.com/entry/exercise-mistakes-working-out-at-home_l_5ea9b6bcc5b6a11afc786b98"}