{"authors": [], "date_download": "2020-05-04 20:27:04", "date_modify": "2020-05-04 20:27:04", "date_publish": "2020-04-05 17:44:43", "description": "ATLANTA (AP) — One of the daughters of The Rev. Martin Luther King Jr. will help lead a new outreach committee in Georgia as the state copes with the coronavirus, Gov. Brian Kemp announced...", "filename": "_0fd4899179592a16fd89abc6a87dbd08_1588624024.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e00e3c0ab23e4f4aafd2c5b7591b12a1/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0fd4899179592a16fd89abc6a87dbd08_1588624024.html", "title": "Daughter of MLK named to Georgia coronavirus outreach group", "title_page": "Daughter of MLK named to Georgia coronavirus outreach group", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Bernice King, daughter of slain civil rights leader Rev. Martin Luther King Jr., speaks about a series of events to be held in and around The King Center, on Thursday, Jan. 9, 2020, in Atlanta. The events commemorating the birth of civil rights icon center around social justice, non-violence seminars and voter education. (AP Photo/ Ron Harris)\nBernice King, daughter of slain civil rights leader Rev. Martin Luther King Jr., speaks about a series of events to be held in and around The King Center, on Thursday, Jan. 9, 2020, in Atlanta. The events commemorating the birth of civil rights icon center around social justice, non-violence seminars and voter education. (AP Photo/ Ron Harris)\nATLANTA (AP) — One of the daughters of The Rev. Martin Luther King Jr. will help lead a new outreach committee in Georgia as the state copes with the coronavirus, Gov. Brian Kemp announced Sunday.\nBernice King, CEO of The King Center, will co-chair the committee with Engaged Futures Group LLC President Leo Smith, Kemp said. More than a dozen other members, including business and nonprofit leaders, make up the committee.\n“Comprised of talented individuals from the public and private sectors, I am confident this committee will ensure that our state remains prepared in the fight against COVID-19,” the Republican governor said in a statement Sunday.\nOfficials did not immediately release additional details about what the committee will do.\nGeorgia has seen more than 200 deaths in the state and more than 1,200 have been hospitalized. Total infections confirmed in the state exceed 6,600.\nFor most people, the new coronavirus causes mild or moderate symptoms. For some, especially older adults and people with existing health problems, it can cause severe illness, including pneumonia, and death.\n___\nFollow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/0fd4899179592a16fd89abc6a87dbd08"}