{"authors": ["Por Aritz Parra"], "date_download": "2020-05-04 20:18:13", "date_modify": "2020-05-04 20:18:13", "date_publish": "2020-04-16 10:42:40", "description": "MADRID (AP) — El escritor chileno Luis Sepúlveda, autor de “Un viejo que leía novelas de amor”, falleció tras una lucha de mes y medio contra el nuevo coronavirus, confirmó el jueves el gobierno...", "filename": "_557cec4a02684441b9e6b37eed1436dc_1588623493.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8d04a47302bd48028f36d67f8cd098e9/2048.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_557cec4a02684441b9e6b37eed1436dc_1588623493.html", "title": "Fallece el escritor chileno Luis Sepúlveda por coronavirus", "title_page": "Fallece el escritor chileno Luis Sepúlveda por coronavirus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\n1 of 2\n1 of 2\n1 of 2\n1 of 2\nMADRID (AP) — El escritor chileno Luis Sepúlveda, autor de “Un viejo que leía novelas de amor”, falleció tras una lucha de mes y medio contra el nuevo coronavirus, confirmó el jueves el gobierno de Asturias, la región del norte de España donde residía. Tenía 70 años.\nA finales de febrero, durante su participación en un festival literario en el norte de Portugal, Sepúlveda presentó los primeros síntomas de lo que entonces se interpretó como un fuerte resfriado.\nIdentificado como uno de los primeros casos en España de COVID-19, la enfermedad causada por el coronavirus, ingresó el 29 de febrero a un hospital de la capital asturiana de Oviedo, donde falleció en la mañana del jueves, dijeron a The Associated Press funcionarios del gobierno regional que no estaban autorizados a ser nombrados en reportes de prensa.\nVíctor Hugo de la Fuente, amigo de Sepúlveda y director de la edición chilena de Le Monde Diplomatique, contó que el escritor “estuvo en coma inducido desde el comienzo... nunca estuvo con conocimiento, siempre estuvo sedado”.\nDijo que se mantuvo comunicado permanentemente con la esposa de Sepúlveda, la poeta Carmen Yáñez, “con quien (el autor) se casó en Chile en los años setenta y se volvieron a casar 20 años después”.\nYáñez y uno de sus seis hijos, Carlos, pudieron despedirse de Sepúlveda el martes, luego que los doctores “los dejaron visitar a Luis por primera vez en su habitación. Fue como una despedida”.\nEl presidente del Principado de Asturias, Adrián Barbón, fue uno de los primeros en darles el pésame.\n“El personal sanitario lo ha dado todo por salvar su vida, pero no ha superado la enfermedad”, escribió Barbón en un tuit.\nLa ministra de Cultura chilena, Consuelo Valdés, dijo que “la vida de Luis Sepúlveda se apagó a causa del COVID-19 y su partida nos deja en silencio, tratando de asimilar la magnitud de esta pandemia y la enorme pérdida para las letras en Chile e Iberoamérica”.\nDe la Fuente recordó que el escritor “siempre estuvo en todas las luchas que se fueron dando y él siempre estaba con los más pobres, con los más débiles”.\nNacido en Ovalle, Chile, en 1949, Sepúlveda se vio obligado a abandonar su país natal en 1977 huyendo de la dictadura del general Augusto Pinochet y, tras residir en Alemania, a finales de los 90 recaló en la ciudad asturiana de Gijón, donde tanto él como Yáñez eran habituales en círculos culturales y literarios.\nEn 1988 publicó “Un viejo que leía novelas de amor”, una novela escrita a la manera de los libros de aventuras que tuvo un gran éxito tanto en español como en la veintena de idiomas a los que se tradujo. A esta obra le siguieron decenas de novelas y relatos, incluida “La sombra de lo que fuimos” en 2009.\nOtras de sus obras son “Historia de una gaviota y del gato que le enseñó a volar”, “La sombra de lo que fuimos”, “Patagonia Express” y “El fin de la Guerra Fría y el Nuevo Orden Mundial”.\nEn la mayoría de los pacientes, el coronavirus causa síntomas leves o moderados, como fiebre y tos. En otros, en particular adultos mayores y personas con problemas de salud previos, puede provocar enfermedades más graves, como neumonía, y la muerte.\nCon más de 180.000 casos confirmados y más de 19.000 decesos, España es el tercer país, detrás de Estados Unidos e Italia, con más fallecidos a causa del virus. La cifra podría aumentar cuando se cuenten a aquellos que murieron con síntomas pero que no se les realizaron pruebas.\n___\nLa periodista de AP Eva Vergara contribuyó a este despacho desde Santiago, Chile.", "url": "https://apnews.com/557cec4a02684441b9e6b37eed1436dc"}