{"authors": ["Daniel Dale", "Marshall Cohen", "Tara Subramaniam"], "date_download": "2020-05-04 16:05:42", "date_modify": "2020-05-04 16:05:42", "date_publish": "2020-04-02 02:42:53", "description": "President Donald Trump made another series of false, misleading or dubious claims at a Wednesday coronavirus briefing that began with an off-topic discussion of his administration's efforts to fight drug trafficking.", "filename": "2020_04_01_politics_fact-ch_32b0d51f1c3ae3710f7586febc466dda_index_1588608342.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401175112-01-coronavirus-press-briefing-reporters-0331-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_fact-ch_32b0d51f1c3ae3710f7586febc466dda_index_1588608342.html", "title": "Fact check: Trump again misleads on ventilator shortages and coronavirus timeline at off-topic briefing", "title_page": "Fact check: Trump again misleads on ventilator shortages and coronavirus timeline at off-topic briefing - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) President Donald Trump made another series of false, misleading or dubious claims at a Wednesday coronavirus briefing that began with an off-topic discussion of his administration's efforts to fight drug traffickin g.\nTrump again said that \"nobody\" could have foreseen a pandemic crisis leading to a shortage of ventilators, for which there were numerous warnings. He predicted that the virus would no longer be a concern after about a month, a timeline at odds with assessments of experts. And he implied some states are basically fine when it comes to the coronavirus.\nHere's a fact check of some of those claims:\nTimeline for the virus\nFacts First: Trump's suggestion that the virus will \"pass\" in about a month is at odds with numerous expert assessments and his own recent statements.\nDr. Deborah Birx, the White House coronavirus response coordinator, has pointed in the last week to a model designed by the University of Washington's Institute for Health Metrics and Evaluation. The model projects that the number of US deaths from the coronavirus will peak in mid- to late April. But it also projects that there will be more than 1,000 deaths per day every day from May 1 (a month from today) through May 10, then more than 200 deaths per day every day from May 11 through June 1.\nThe model projects the number of deaths dropping to zero in mid-July, three and a half months from today. (The model offers a range of estimates for each date.)\nDr. Nancy Messonnier, director of the National Center for Immunization and Respiratory Diseases at the Centers for Disease Control and Prevention, said March 19 that she can't say \"for sure\" how long the crisis would last but some places would likely be impacted into \"the summer.\"\nAnd experts say there might well be a second wave of the virus to worry about even after the current crisis ends. Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said Monday that he would expect a second wave in the fall, \"because of the degree of transmissibility.\"\nHe added that the US would be more prepared to test for and contain the virus at that time, but he did not say Americans would no longer have to worry about the virus after a month or so.\nTrump himself acknowledged two weeks ago that people were warning that the virus could persist until \"July, August, something like that.\" And though projections can change quickly, the President offered a timeline longer than \"a month or so\" this week. On Sunday, he said, \"We can expect that, by June 1st, we will be well on our way to recovery.\"\n(He then called the June 1 date \"aspirational,\" then said it was \"modified aspirational, because I think we're going to hit it. And maybe we'll even beat it.\")\nVentilator shortages\nTrump on Wednesday repeated the debunked claim that \"nobody\" predicted the shortages of ventilators that have become a major part of the coronavirus crisis in the US.\nHe made the comment while touting the efforts by US companies like Ford and General Motors to produce ventilators on an emergency basis.\n\"We're building thousands of ventilators right now,\" Trump said at a White House press briefing. \"It takes a period of time to build them, and again nobody could have known a thing like this could happen.\"\nFacts First: Trump is wrong. Medical experts and public health officials have said for years that the US would face a shortage of ventilators if there were ever a pandemic like Covid-19. Even during Trump's presidency, there had been warnings that hospitals would run out of lifesaving equipment and resources would be strained because the US wasn't prepared for a pandemic.\nTrump has repeatedly made claims like these in recent weeks, as the ventilator shortage became a full-blown crisis in places like New York City, where the outbreak is especially severe. Trump once even falsely claimed that \"nobody in their wildest dreams\" had predicted a ventilator shortage.\nCNN previously reported that this warning was in at least 10 government reports between 2003 and 2015, raising the alarm that there wouldn't be breathing machines and other lifesaving equipment if the US were hit by a serious pandemic. The studies came from the National Institutes of Health, the Centers for Disease Control and Prevention, the Department of Health and Human Services, the Government Accountability Office, the Obama White House and more.\nFor example: A study released in April 2015 by the NIH and CDC estimated that the US would likely need as many as 60,000 additional ventilators to deal with a severe flu pandemic scenario. Those additional machines could save 35,000 to 306,000 American lives, depending on the percentage of people who get sick, the report said.\nThe President's comments about the ventilator shortages fit into his pattern of trying to avoid responsibility by falsely claiming that nobody ever predicted a pandemic like Covid-19. He has repeated that claim many times in the past two months, even though it has been repeatedly debunked.\nThe number of coronavirus cases in each state\nAsked why he didn't issue a universal stay-at-home order for the entirety of the country, Trump implied that some states are basically fine when it comes to the coronavirus.\n\"There are some states that don't have much of a problem,\" he said. \"There are some, well, they don't have the problem. They don't have thousands of people that are positive or thousands of people that even think they might have it, or hundreds of people in some cases.\"", "url": "https://www.cnn.com/2020/04/01/politics/fact-check-trump-coronavirus-briefing-april-1/index.html"}