{"authors": ["Parija Kavilanz", "Cnn Business"], "date_download": "2020-05-04 16:01:27", "date_modify": "2020-05-04 16:01:27", "date_publish": "2020-04-01 16:51:32", "description": "The urgent and overwhelming demand for N95 masks has created fertile ground for scammers to start leaking counterfeits into the supply chain and to make fake deals for product that doesn't exist.", "filename": "2020_04_01_business_n95-masks-counterfeits-supply-chain_index_1588608087.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200326145532-01-n95-mask-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_business_n95-masks-counterfeits-supply-chain_index_1588608087.html", "title": "N95 masks are in short supply -- and scammers know it", "title_page": "Counterfeit N95 masks are leaking into the supply chain - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) The urgent and overwhelming demand for N95 masks has created fertile ground for scammers to start leaking counterfeits into the supply chain and to make fake deals for product that doesn't exist.\nTwo leading N95 mask manufacturers have issued fraud warnings amid the coronavirus pandemic, saying they've received complaints about fraudsters trying to sell nonexistent product. And in one case, counterfeit masks have already made it to the front lines in the US.\nHoly Name Medical Center in Teaneck, New Jersey, received a batch of 1,000 N95 masks a few weeks ago from a trusted longtime vendor, and determined they were fake.\n\"We have a policy of having our clinicians test a small sample of medical equipment like masks before we give it to our staff,\" said Jessica Griffin, the hospital's director of public relations. \"These masks did not fit the face area properly,\" nor were they marked with a specific Centers for Disease Control and Prevention approval label as N95 masks are required to have.\nIt was a shock for Holy Name, which is currently treating 144 patients for Covid-19 and has tested 1,440 people in total.\n\"We're the epicenter of the coronavirus outbreak in New Jersey,\" Griffin said. Maintaining a consistent supply of PPE (personal protective equipment) like gowns and N95 masks for its doctors and nurses is crucial as the hospital continues to see a steady stream of patients.\nHoly Name Medical Center, in Teaneck, New Jersey.\nBut across the world, N95 masks are in short supply, as they're considered the gold standard of respirator masks. They're able to filter out at least 95% of very small (0.3 micron) particles from the air, including bacteria and viruses -- making them a crucial piece of equipment for doctors and nurses as they race to treat tens of thousands of coronavirus-infected patients in the United States.\nThat degree of protection is guaranteed, however, only with federally tested and certified masks that fit snugly around the nose and mouth -- creating a seal to minimize the number of particles that bypass the filter through gaps between the user's skin and the respirator, according to the CDC.\nCounterfeit respirators \"can compromise the safety of anyone who uses them, including healthcare providers,\" the CDC told CNN Business.\nFortunately for the providers at Holy Name, the hospital's testing procedures caught the counterfeit N95 masks, and they returned the batch to the vendor -- who ultimately replaced them with 1,000 legitimate masks. Holy Name doesn't fault the vendor.\nBut major N95 manufacturers and procurement companies are also sounding the alarm.\nLeading manufacturers flag scams\n3M, the world's leading manufacturer of N95 masks, has received reports from healthcare customers of people selling counterfeit 3M products and falsely claiming associations with the company, the firm said in a letter last week to Attorney General William Barr.\nIt warned about products with \"missing straps, strange odors, blocked valves, misspelled words, etc.,\" saying they are likely not authentic 3M respirators.\" In the letter, 3M CEO Mike Roman also said the company is working with large online sellers and the authorities to identify and remove counterfeiters.\n3M told CNN Business that while it hasn't seen a large influx of counterfeit respirators onto the market, it is tracking a bigger issue of fraudsters trying to collect money in exchange for masks they don't actually have.\nThe N95 respirator mask can filter 95% of very small particles from the air.\nPrestige Ameritech, another top maker of N95 masks, has placed a \"Fraud Alert warning\" on its website saying its brand is also being used in \"mask selling scams.\" The company said it, too, is working with authorities on the matter. Prestige Ameritech did not respond to calls for further comment.\nSuspect solicitations\nIt's not only manufacturers but also product sourcing firms who are dealing with potential N95 mask scams.\nPremier Inc. -- a North Carolina-based company that helps procure PPE for 4,000 hospitals and 175,000 non-acute providers like surgical centers -- recently received a strange call.\nA person posing as a \"broker\" offered Premier 500 million masks, saying they had access to the sizable inventory, said Chaun Powell, group vice president with Premier. The company promptly called 3M, who told Premier it would be impossible for anyone to have that many masks immediately available.\nMeanwhile, scores of calls are pouring in. \"Last week we received 10 to 20 solicitations from agents for millions of N95 masks. This week it's 70 calls,\" Powell said.\nA bulk of the production of N95 masks takes plave in Asia, predominantly in China.\nEven as 3M and other makers ramp up production, Powell said immediate shortages have created opportunity for \"questionable\" mask products to seep into the supply chain.\n\"We have already seen masks enter the supply chain that fail to meet basic testing parameters,\" he said. He said Premier was aware of counterfeit N95 masks that showed the 3M logo incorrectly positioned on the packaging, for example.\n\"We have no interest in creating fear and doubt in the market, but we are focused on protecting the integrity of the supplies that our nation's dedicated caregivers and patients depend on,\" said Powell.\nSupply chain experts say they aren't surprised about fake masks popping up -- and they expect the problem to accelerate.\n\"There's a high possibility of that because there's quite a lot of money to be made on these masks,\" said Rosemary Coates, executive director of the Reshoring Institute, a nonprofit manufacturing research and consultancy group that advocates for bringing overseas jobs back to America. Coates has 30 years of expertise in supply chain management and counterfeit products.\nWhen a product becomes very popular in a short time period -- as the N95 mask has -- individuals emerge is who identify themselves as \"agents\" or \"brokers\" trying to score lucrative deals by selling counterfeits at a premium, Coates said.\nThese middlemen might not even have any inventory initially, she added. \"They try to make a deal first with businesses that are trying to procure legitimate product, like the N95 mask. After they get a deal they then try to source the counterfeit version of the product.\"\n\"Anytime there is money to be made by selling products at a premium,\" she said, \"counterfeiters will jump into the market.\"", "url": "https://www.cnn.com/2020/04/01/business/n95-masks-counterfeits-supply-chain/index.html"}