{"authors": ["Ryan Young", "Jake Carpenter", "Eric Levenson"], "date_download": "2020-05-04 16:26:19", "date_modify": "2020-05-04 16:26:19", "date_publish": "2020-04-07 14:02:27", "description": "About 2,200 health care workers at Michigan's largest health care systems are staying home with coronavirus symptoms, a total that further hampers efforts to fight the virus and shows the dangers facing frontline workers.", "filename": "2020_04_07_us_michigan-coronavirus_index_1588609579.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327095540-01-coronavirus-michigan-0325-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_us_michigan-coronavirus_index_1588609579.html", "title": "Michigan's two largest health care providers have about 2,200 staff members affected by Covid-19", "title_page": "Michigan's two largest health care providers have about 2,200 staff members affected by Covid-19 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) About 2,200 workers in Michigan's two largest health care systems have coronavirus symptoms or have tested positive for the virus, a total that further hampers efforts to fight the pandemic and shows the dangers facing frontline workers.\nBeaumont Health, Michigan's largest health care system with 38,000 employees, has about 1,500 staff members staying home because they have symptoms consistent with Covid-19.\n\"We are following CDC guidelines and asking staff to stay home when they are sick and/or have Covid-19 symptoms,\" Beaumont Health media relations director Mark Geary told CNN.\n\"These employees will stay home for a minimum of seven days and until they no longer have symptoms. They also must be free of fever and other symptoms for at least three days. During this period of time, we are not requiring employees to use their paid time off,\" Geary said.\nIn addition, Henry Ford Health System, a Detroit-based health care system with more than 30,000 employees, said about 600 to 700 staff members had tested positive for Covid-19.\nRead More", "url": "https://www.cnn.com/2020/04/07/us/michigan-coronavirus/index.html"}