{"authors": ["Jonathan Mattise", "Kimberlee Kruesi"], "date_download": "2020-05-04 20:11:00", "date_modify": "2020-05-04 20:11:00", "date_publish": "2020-04-07 15:36:07", "description": "NASHVILLE, Tenn. (AP) — Ten people have now died in a coronavirus outbreak at a Tennessee nursing home where more than 100 people tested positive, a hospital spokesman said Tuesday. Sumner...", "filename": "_be7ec1154fb0782507adce43b62efd46_1588623060.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_be7ec1154fb0782507adce43b62efd46_1588623060.html", "title": "Death toll up to 10 from outbreak at Tennessee nursing home", "title_page": "Death toll up to 10 from outbreak at Tennessee nursing home", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Death toll up to 10 from outbreak at Tennessee nursing home\nNASHVILLE, Tenn. (AP) — Ten people have now died in a coronavirus outbreak at a Tennessee nursing home where more than 100 people tested positive, a hospital spokesman said Tuesday.\nSumner Regional Medical Center spokesman Kyle Brogdon on Tuesday afternoon confirmed the 10th death from the Gallatin Center for Rehabilitation and Healing.\nState health officials have said more than 70 residents and more than 30 staffers tested positive at the facility, which was temporarily evacuated but has since allowed some residents to return.\nThe state contracted out a deep cleaning and disinfecting of the facility on March 29 and state Health Department nurses surveyed it starting April 1 to ensure it was safe for residents to reenter, Tennessee Department of Health spokeswoman Shelley Walker has said.\nResidents who tested negative or tested positive and recovered have since been allowed to reenter the facility, while residents who tested positive and are recovering remain at hospitals, Walker said.\n“We had multiple folks in their facility late (Sunday) night and we continue to find no deficient practices and find their response to be perfectly adequate,” state Health Commissioner Lisa Piercey said during a Monday afternoon virtual news conference.\nOn Tuesday, malpractice attorney Clint Kelly said he has sent a required notice to the facility of his intent to sue in 60 days. Kelly said he represents 20 people, including family members of residents and staff.\n“People on the record have told me that at least one employee showed up sick and wanted to go home and was told — I’m paraphrasing here — ‘If you go home, don’t bother coming back,’” Kelly said.\nA spokeswoman for the nursing home vehemently denied that.\n“Every single employee was screened twice per shift” beginning March 5, Ashley Romano said. Anyone who was sick was not allowed to work. Romano pointed to state Health Department’s inspections, which have found no deficiencies at the facility.\nTennessee’s confirmed cases have grown to more than 4,100, with at least 72 confirmed deaths.\nAlong with county breakdown information, Health Department Commissioner Lisa Piercey announced Tuesday that the state will soon release more detailed information on race and ethnicity regarding COVID-19 cases starting as early as Wednesday.\n“Race and ethnicity data is important to make sure that we are maintaining access across all ethnicities and to eliminate or mitigate any disparities that we might identify,” Piercey told reporters.\nAlso Tuesday, Cookeville Regional Medical Center announced that it would furlough nearly 400 of its 2,400 employees because of a reduction in patient volume caused by the virus pandemic. The medical center is in Putnam County, where a tornado killed 19 and destroyed hundreds of buildings last month.\nAdditionally, “several hundred employees” will see a temporary reduction in hours, according to a news release. Furloughed employees will continue to receive health care benefits and the medical center will pay “100% of premiums for medical insurance.”\nLast month, Gov. Bill Lee issued an executive order banning elective surgeries in health care facilities across Tennessee as part of the state’s effort to reduce the spread of the virus. As a result, however, several health care facilities have announced temporary layoffs and staff reductions.\n“We must preserve our financial resources now in order to direct more of them to fighting the COVID-19 pandemic,” Cookeville Regional Medical Center CEO Paul Korth said. “We have seen a significant reduction in revenues while we are not doing elective surgeries and procedures, and we must be good financial stewards for the hospital’s long-term success.”\nMeanwhile, in Henry County a man was arrested Friday after he was “purposely coughing on people in Walmart and yelling that he had coronavirus,” according to a Facebook post from District Attorney Matthew Stowe.\n“The man has been charged with violation of the terrorism hoax act, reckless endangerment and disorderly conduct,” according to the post.\nFor the vast majority of people who have the coronavirus, symptoms clear up in several weeks without requiring hospitalization, but the consequences can be life-threatening for older people and those with existing health problems.\n___\nAssociated Press writer Travis Loller in Nashville, Tennessee, contributed to this report.\n___\nFollow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/be7ec1154fb0782507adce43b62efd46"}