{"authors": ["Liza Featherstone", "Mike Davis", "Peter Frase", "Seth Ackerman", "Brian Bennett", "Helena Duncan", "Tiana Caldwell", "Peter Gowan", "Samuel Stein"], "date_download": "2020-05-04 19:49:13", "date_modify": "2020-05-04 19:49:13", "date_publish": "2020-05-01 00:00:00", "description": null, "filename": "2020_05_rent-strike-may-coronavirus-new-york-city-nyc-tenants-housing_1588621753.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/05/01083610/GettyImages-1221648294.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_05_rent-strike-may-coronavirus-new-york-city-nyc-tenants-housing_1588621753.html", "title": "On Strike - No Rent", "title_page": "On Strike — No Rent", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Today is May Day. It’s also the day that rent is due. Thousands of New Yorkers, facing economic devastation from the coronavirus — on top of the everyday struggle to pay for housing in an unaffordable city — will be going on rent strike to demand relief from Governor Andrew Cuomo.\nStriking tenants, from those in Woodside, Queens, organized by the Bangladeshi Tenant Union, to those in Central Brooklyn, organized by the Crown Heights Tenant Union, are all part of a “Can’t Pay May” campaign, the latest example of how housing justice activists are organizing on matters of material survival, through community organizing and building electoral power.\nNew York housing politics has already demonstrated the critical importance of both political tactics. Activists won significant protections last year — the first real advances in renters’ rights in decades — a victory due to years of issue campaigning and a 2018 influx of progressive legislators independent of the real estate industry.\nHuge numbers of New York tenants — though reliable data is hard to come by — didn’t pay rent in April, and it’s no surprise, given almost unprecedented levels of unemployment and small business failure.\nWith this rent strike, the Housing Justice for All coalition, of which New York City Democratic Socialists of America (NYC-DSA) is an active part, along with Metropolitan Council on Housing, Northwest Bronx Community and Clergy Coalition, and many other groups, is demanding that Cuomo cancel rent for four months or the duration of the public health crisis, whichever is longer. The coalition is also demanding a rent freeze during this period, and immediate permanent housing for the homeless.\nSome tenants are organizing with others in their buildings to pressure their own landlords, while more than eleven thousand have signed on to a pledge to withhold rent. Though tenants would like their individual landlords to show lenience, the primary target of the campaign is Governor Cuomo, the only person with the political power to issue an executive order to meet the coalition’s demands.\nMeanwhile, also this week, socialist state senator Julia Salazar, who represents North Brooklyn and part of Queens, has introduced a “Relief for All” legislation, called the Emergency Coronavirus Affordable Housing Preservation Act, offering immediate relief to tenants (residents and small businesses) and small property owners. Salazar also introduced another bill that would freeze rents for tenants in rent-stabilized apartment buildings for a year. (Full disclosure: this writer has canvassed and raised money for Salazar’s election.)\nQueens congresswoman Alexandria Ocasio-Cortez, another socialist elected in 2018, whose constituents are some of the worst hit by the coronavirus in the nation, has been drawing national attention to the impossibility of making rent, calling on the federal government to take action. Across the country, at least a third of tenants couldn’t pay rent in April, and that number seems destined to get much bigger. Rent strikes are also planned in other cities, including Washington, DC.\nWhat exactly is the leverage in a rent strike, in this context? The recent political turn against the real estate industry, and the new tendency to harshly punish politicians too firmly lodged in its pockets, makes it a potentially effective tactic. The real estate industry is now pressuring Cuomo, asking for bailouts. Big landlords know tenants aren’t going to be able to pay and are already trying to prepare.\nThe rent strike, by politicizing the drop in rent payments, may alarm landlords, bringing more urgency to their plea for handouts, while also forcing Cuomo to reckon publicly with tenants’ demands. In the past, politicians would have simply bailed out the landlords and left the tenants to die in the streets. But thanks to the Left’s recent successes in changing political culture, that might be harder for even a neoliberal like Cuomo to do. He was, after all, forced to disappoint his real estate donors and support last year’s expansion of renters’ rights.\nCuomo already called a moratorium on evictions, which he claims takes care of tenants who can’t pay rent. But this merely postpones the problem. Without canceling rent during this period, Cuomo is setting up the housing court system for total overload at the end of the moratorium period. As well, tenants will face crushing indebtedness. Many will become homeless. Homelessness has already been a huge factor in the spread of the virus, and if more people are forced to live on the street, the pandemic is likely to hit the city even harder when it comes back.\nOf course, it will probably be impossible to know for sure how many people are consciously participating in the rent strike tomorrow, given that so many more people haven’t heard about these political efforts but simply can’t pay rent. The organized strikers are acting not only on their own behalf, but also on behalf of the latter group, inviting everyone who can’t pay into a political act.\nWe have reached a situation in which rent is an impossible demand on the part of the landlord class. The working class is responding with far more reasonable demands of its own.", "url": "https://jacobinmag.com/2020/05/rent-strike-may-coronavirus-new-york-city-nyc-tenants-housing"}