{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:08:54", "date_modify": "2020-05-04 16:08:54", "date_publish": "2020-04-02 18:37:56", "description": "With the country -- and the world -- focused full-time on the fight against the coronavirus pandemic, you may have missed this: The fight for the Senate continues to move slowly but surely in Democrats' direction.", "filename": "2020_04_02_politics_senate-2020-democrats-republicans_index_1588608534.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/181217183806-20181217-2020-election-map-senate-card-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_senate-2020-democrats-republicans_index_1588608534.html", "title": "How the fight for the Senate is slowly moving toward Democrats", "title_page": "How the fight for the Senate is slowly moving toward Democrats - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) With the country -- and the world -- focused full-time on the fight against the coronavirus pandemic, you may have missed this: The fight for the Senate continues to move slowly but surely in Democrats' direction.\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!\nOn Thursday, the Crystal Ball moved the ratings of the a) Arizona Senate race from \"toss up\" to \"leans Democratic\" and b) Maine's Senate race from \"leans Republican\" to \"toss up.\" (They also changed the rating of the Georgia Senate race from \"leans Republican\" to \"likely Republican.\")\n\"The battle for the Senate is getting more competitive, with Democrats pushing the overall map more into 'toss-up' territory,\" writes Crystal Ball managing editor Kyle Kondik of the ratings changes\nThose changes come soon after the Cook Report's Senate editor Jessica Taylor wrote this about the fight for the Senate majority\n\"The chances of Democrats taking back the Senate are rising, and is now close to 50-50 odds.\"\n\"The full political implications of this ongoing [coronavirus] crisis aren't fully realized yet, and no one truly knows how the pandemic will play out in any form, or even how long it will last or how big a hit the economy will take, and whether it can rebound by November. But conversations with nearly a dozen Republican strategists and pollsters this week revealed alarm about how Trump — who is in many ways so uniquely unsuited to manage such a wide response from the government actors he distrusts — is not only risking his own reelection prospects but those of many Republican senators.\"\nTo that end, the Cook Report made ratings changes in Iowa and Texas suggesting both GOP incumbents are more imperiled than in past months. (Cook also moved the Mississippi Senate seat, held by Cindy Hyde-Smith, out of the danger zone.)\nLet's take a step back and look at the overall math -- and map.\nTo win the majority in November, Democrats need to make a net three-seat gain if their party wins the White House and four if President Donald Trump is reelected.\nThe Cook Report currently rates eight GOP held seats as endangered -- either as \"toss ups\" (Arizona, Colorado, Maine and North Carolina) or \"lean Republican\" (Georgia's Kelly Loeffler, Iowa, Kansas and Montana.) Only two Democratic seats are seen as vulnerable : Alabama's Doug Jones (\"lean Republican\") and Michigan's Gary Peters (\"lean Democratic\").\nThe Crystal Ball ratings are a bit more bullish for Democrats with two seats currently held by Republicans (Arizona and Colorado) ranked as \"leans Democratic,\" Maine and North Carolina seen a pure \"toss-ups\" and Montana, Iowa and Loeffler's Georgia seat rated as \"leans Republicans.\" Jones' Alabama seat is seen as \"leans Republicans\" while Peters' in Michigan is rated as \"leans Democratic.\"\nThe key here isn't any specific seat as much as it is about the broader landscape. For Democrats to have a realistic chance of winning the three (or four) seats they need to retake the Senate majority in November, they need to expand the map of competitive Republican races while simultaneously limiting any unseen vulnerabilities in their own seats.\nThat's what's happened in recent weeks. Montana Gov. Steve Bullock's stunning, last-minute reversal on his long-stated opposition to running for the Senate turned that contest from no race into, potentially, the race of the 2020 Senate cycle. And Democrats now look to be very well-positioned in both Colorado and Arizona, with Maine and North Carolina following close behind.\nOn the other hand, aside from Jones in Alabama, which, candidly, looks like a near-certain loss, there are very few Democratic seats in any sort of danger.\nNow, keep this all in perspective: Assuming Jones loses, Senate Democrats need to net either four seats (if Joe Biden wins the White House) or five (if Trump is reelected). Which is no sure thing -- given that the number of truly vulnerable Republican seats is somewhere between seven and eight.\nBut there's also no question that Democrats' chances of winning the Senate are higher today than they were six months ago, and much higher than at the start of 2019.", "url": "https://www.cnn.com/2020/04/02/politics/senate-2020-democrats-republicans/index.html"}