{"authors": ["Steven Jiang"], "date_download": "2020-05-04 16:17:36", "date_modify": "2020-05-04 16:17:36", "date_publish": "2020-04-03 08:32:56", "description": "Like many Americans across the country, Wenqiong Xue has been fanatically making face masks for two weeks, using ripped bedsheets and a sewing machine that she dusted off from a closet in her Boston area house.", "filename": "2020_04_03_americas_coronav_f896ed120fdb982d32830433ba8c45c7_index_1588609056.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403150435-01-chinese-american-diy-mask-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_americas_coronav_f896ed120fdb982d32830433ba8c45c7_index_1588609056.html", "title": "Chinese Americans on the forefront of advocating wearing masks in public", "title_page": "DIY masks: Chinese Americans on the forefront of advocating wearing masks in public - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Like many Americans across the country, Wenqiong Xue has been fanatically making face masks for two weeks, using ripped bedsheets and a sewing machine that she dusted off from a closet in her Boston area house.\nA Beijing native who has lived in the US since 1985, Xue said many Chinese Americans like her realized early on the importance of wearing masks in stopping the spread of the deadly virus, thanks to a steady stream of news reports and expert opinions from China, the original epicenter of the global pandemic.\nChinese Americans in Boston are using bed sheets and sewing machines to make homemade face masks.\n\"We all read so much about what was happening in Wuhan on WeChat,\" she said, referring to the popular social media platform that has become a major information source for the Chinese diaspora. \"We knew how serious the outbreak was and started being careful much earlier than other Americans.\"\nXue and other members of a local WeChat group sewed more than 1,300 masks within a week, delivering them to several local hospitals. But even when the medical institutions advised them not to send in any more handmade masks, Xue didn't stop -- shifting her focus to the general public.\nOn the left, a nurse at a Boston Area Hospital wears a homemade face mask. On the right are examples of the masks on offer.\nRead More", "url": "https://www.cnn.com/2020/04/03/americas/coronavirus-diy-mask-chinese-american-dp-hnk-intl/index.html"}