{"authors": ["Annalyn Kurtz", "Cnn Business"], "date_download": "2020-05-04 17:03:04", "date_modify": "2020-05-04 17:03:04", "date_publish": "2020-04-10 15:08:09", "description": "If it weren't for Frances Perkins, born 140 years ago today, millions of Americans might not be receiving unemployment benefits during the coronavirus pandemic.", "filename": "2020_04_10_business_unemployment-benefits-frances-perkins_index_1588611784.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401113453-frances-perkins-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_business_unemployment-benefits-frances-perkins_index_1588611784.html", "title": "She came to the rescue during the Great Depression. Now her work is still aiding jobless Americans", "title_page": "Frances Perkins: She came to the rescue during the Great Depression. Now her work is still aiding jobless Americans - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Such was the case for one Great Depression heroine, born 140 years ago today, whose life's work is still benefiting millions of jobless Americans during the coronavirus pandemic.\nMeet Frances Perkins: the first female member of a presidential cabinet, and the chief architect behind many New Deal programs that live on 85 years later.\nA trained social worker, master negotiator and advocate of workers' rights, she witnessed hardships faced by workers both before and during the Great Depression — and as Secretary of Labor, she crafted policies hoping to alleviate societal ills like unemployment and poverty.\nFrances Perkins, who served as US Secretary of Labor during the Great Depression, was the chief architect behind Social Security, unemployment insurance, the 40-hour work week and the minimum wage. (Frances Perkins Center)\nPerkins' legacy includes Social Security to support workers with disabilities and in old age, the 40-hour work week, the minimum wage and the end of child labor. And if that wasn't enough, she also built the nation's unemployment benefits system.\nThat system is currently pumping billions of dollars into workers' pockets , so they can continue to pay their bills and feed their families during the coronavirus pandemic.\n\"She was a moving force. Without her, Social Security doesn't exist, and without her, the nationwide unemployment insurance program doesn't exist,\" said Kirstin Downey, who spent a decade studying Perkins' life and documented it in the book \" The Woman Behind the New Deal .\" \"There's a whole lot of people whose financial salvation is going to come because Frances Perkins existed.\"\nIn the last three weeks, 16.8 million Americans have filed for unemployment benefits , as businesses have closed in an attempt to slow the spread of coronavirus. Economists estimate job losses will continue over the next couple months, possibly leading to levels of unemployment not seen since the 1930s.\nThe quickest financial aid , however, will come in the form of unemployment benefits, which Congress has expanded to include an extra $600 a week for up to four months, in addition to their state benefits.\nPerkins created the national unemployment insurance system in 1935 as part of the Social Security Act. The unemployment rate, at that point, was estimated to have remained above 20% for four years in a row, and few workers had other means for recouping their lost wages. At that point, the workforce was predominantly male, and when breadwinning men lost their jobs, entire families often went hungry.\nPerkins was the right person, in the right place and time, to come to the rescue.\nThe right woman at the right time\nBefore she became Labor Secretary in her early fifties, Perkins had already spent decades advocating for worker's rights. Early in her life she had studied economics and sociology at Mount Holyoke College and Columbia University. She had visited factories and documented horrible working conditions there, and volunteered at social service agencies and settlement houses.\nIn her early thirties, Perkins witnessed the Triangle Shirtwaist Factory fire, which killed 146 garment workers — mostly women and girls. It was a moment that galvanized her dedication to helping workers. She later became secretary for New York City's Committee on Safety, and in that role helped develop laws that mandated fire drills, sprinkler systems in tall buildings and fire escapes. Later, she worked as industrial commissioner for New York State and became an expert on labor statistics, too.\nBy the time President Franklin D. Roosevelt nominated Perkins to serve as Secretary of Labor, her credentials for that role were impeccable, but critics still doubted if she could do the job because of her gender. As Downey documents in her book, some Labor Department staffers even threatened to resign rather than report to a woman.\nBut Perkins had learned to press on in spite of sexism. Even as a much younger woman, she had adopted a matronly wardrobe and wore tricorn hats, thinking that if she reminded men of their mothers, they would take her more seriously.\nFrances Perkins stands behind President Franklin D. Roosevelt as he signs the Social Security Act into law in August 1935. (FPG/Archive Photos/Getty Images)\nPerkins told FDR she would take the job only if he would commit to pursuing seven key policies: a 40-hour work week, a minimum wage, unemployment compensation, worker's compensation, abolition of child labor, direct federal aid to the states for unemployment relief, Social Security, a revitalized federal employment service and universal health insurance.\nPerkins became the longest-serving labor secretary in history, holding the role from 1933 to 1945. During that time, she accomplished all but one of her original goals: universal health care.\nSpeaking in a radio address in 1935, Perkins explained, \"It has taken the rapid industrialization of the last few decades, with its mass-production methods, to teach us that a man might become a victim of circumstances far beyond his control.\"\n\"Finally it took a depression to dramatize for us the appalling insecurity of the great mass of the population, and to stimulate interest in social insurance in the United States,\" she added.\nWritten out of the history books\nPerkins died in 1965, and now few Americans know her name even as they rely on her programs.\n\"She was hugely well known in her lifetime and when FDR was alive,\" Downey said. \"But very quickly after her death, male historians started to write her out of the story. It's really extraordinary.\"\nSuzi Levine is trying to channel Frances Perkins lately. As head of Washington State's Employment Security Department, she and her staff are grappling with skyrocketing claims for unemployment benefits during the coronavirus pandemic. They're hiring hundreds more employees to help process claims, push out technology updates and keep the department running — all while also working under crisis conditions, many from home.\n\"It's going to take a collective effort the likes of which we have not seen before, and I feel humbled to be a part of the team that will get us there,\" Levine said. \"When you roll back the clock a hundred years, I suspect Frances Perkins and her colleagues felt similarly as they looked at the devastation, the Depression and the oncoming World War II. I think there's a lot that we can learn from then and apply now, but with a modern context and with our modern tools.\"\nWhat words would Perkins have for Americans grappling with the economic crisis today? Sarah Peskin, board chair at the Frances Perkins Center, points to one poignant quote that feels just as relevant now as it was 85 years ago.\n\"The process of recovery is not a simple one,\" Perkins said in a 1935 radio address. \"We cannot be satisfied merely with makeshift arrangements which will tide us over the present emergencies. We must devise plans that will not merely alleviate the ills of today, but will prevent, as far as it is humanly possible to do so, their recurrence in the future.\"", "url": "https://www.cnn.com/2020/04/10/business/unemployment-benefits-frances-perkins/index.html"}