{"authors": [], "date_download": "2020-05-04 20:04:34", "date_modify": "2020-05-04 20:04:34", "date_publish": "2020-04-07 17:43:30", "description": "IOWA CITY, Iowa (AP) — The Iowa Department of Public Health has released the identities of two nursing homes where outbreaks of the coronavirus have infected residents and contributed to a large...", "filename": "_ec5060a564abc36e00d710f549b8e23a_1588622674.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ec5060a564abc36e00d710f549b8e23a_1588622674.html", "title": "Iowa identifies 2 nursing homes hit with COVID-19 outbreaks", "title_page": "Iowa identifies 2 nursing homes hit with COVID-19 outbreaks", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "IOWA CITY, Iowa (AP) — The Iowa Department of Public Health has released the identities of two nursing homes where outbreaks of the coronavirus have infected residents and contributed to a large share of the state’s known cases.\nThe facilities were identified Tuesday as the McCreedy Home in Washington County and Premier Estates of Toledo in Tama County. Health officials had previously withheld that information from the public.\nThose homes and Heritage Specialty Care in Cedar Rapids are the sites of the three outbreaks at long-term care facilities confirmed in Iowa. Under the state’s definition, that means three or more residents have tested positive.\nOfficials say the outbreaks account for 11 percent of Iowa’s known coronavirus cases and 46 percent of deaths. That includes 76 cases tied to Heritage alone.\nWashington County Hospitals and Clinics, which operates the McCreedy Home, said in a statement that all infected residents have received medical treatment and are in isolation. Its statement didn’t say how many were infected.\nThe home’s management is in contact with the families of residents and “doing everything possible to provide them support,” the statement said.\nPremier Estates of Toledo is owned by Trillium Healthcare Consulting of Bradenton, Florida. The home administrator and a Trillium spokesman didn’t immediately return messages.", "url": "https://apnews.com/ec5060a564abc36e00d710f549b8e23a"}