{"authors": ["Zachary Cohen", "Ryan Browne"], "date_download": "2020-05-04 16:17:29", "date_modify": "2020-05-04 16:17:29", "date_publish": "2020-04-03 15:47:20", "description": "Sailors aboard the USS Theodore Roosevelt aircraft carrier cheered for Capt. Brett Crozier as he disembarked the ship for the last time, an overwhelming show of support for their leader who was relieved of his command after issuing a stark warning about a coronavirus outbreak onboard.", "filename": "2020_04_03_politics_uss-the_228d185a39a400906ad69bca4c1ad821_index_1588609049.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401090526-02-uss-theodore-roosevelt-guam-grab-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_uss-the_228d185a39a400906ad69bca4c1ad821_index_1588609049.html", "title": "Sailors cheer for aircraft carrier commander who was removed after issuing coronavirus warning", "title_page": "USS Theodore Roosevelt: Sailors cheer for aircraft carrier commander who was removed after issuing coronavirus warning  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Sailors aboard the USS Theodore Roosevelt aircraft carrier cheered for Capt. Brett Crozier as he disembarked the ship for the last time, an overwhelming show of support for their leader who was relieved of his command after issuing a stark warning about a coronavirus outbreak onboard.\nNew video obtained by CNN shows a large crowd gathered to give Crozier a warm and loud send off, clapping and chanting his name as he left the ship. It was a clear expression of appreciation for their former commander who was removed for what the acting Navy Secretary called \"poor judgment.\"\n\"Today at my direction the commanding officer of the USS Theodore Roosevelt, Captain Brett Crozier, was relieved of command by carrier strike group commander Rear Admiral Stewart Baker,\" acting Secretary of the Navy Thomas Modly announced on Thursday,\nThe decision came days after Crozier wrote a memo warning Navy leadership that decisive action was needed to save the lives of the ship's crew. \"We are not at war. Sailors do not need to die. If we do not act now, we are failing to properly take care of our most trusted asset — our Sailors,\" it read, three US defense officials confirmed to CNN.\nNews of Crozier's removal comes after a US defense official told CNN Friday morning that 137 sailors from the Roosevelt have tested positive for the virus, representing more than 10% of all cases across the US military.\nThe US Navy said Friday that 41% of the USS Theodore Roosevelt crew has been tested for Covid-19.\n\"This evening, 400 more Sailors that tested negative will move into Guam hotels for quarantine, bringing the total to 576. As testing continues, the ship will keep enough Sailors on board to sustain essential services and sanitize the ship in port. There have been zero hospitalizations,\" a Navy spokesperson told CNN.\nEscalating outbreak\nThe outbreak on the ship is escalating rapidly. Last week the Pentagon confirmed three sailors on the Roosevelt had tested positive, and that number had risen to 25 two days later. It rose to at least 70 on Tuesday and more than 100 on Thursday. On Monday, a US defense official told CNN that a second US aircraft carrier, the USS Ronald Reagan, is facing a \"handful\" of positive cases.\nIn his memo, Crozier implored Navy leaders to take immediate steps to address the situation.\n\"Decisive action is required. Removing the majority of personnel from a deployed US nuclear aircraft carrier and isolating them for two weeks may seem like an extraordinary measure,\" his memo said.\n\"This is a necessary risk. It will enable the carrier and air wing to get back underway as quickly as possible while ensuring the health and safety of our Sailors. Keeping over 4,000 young men and women on board the TR is an unnecessary risk and breaks faith with those Sailors entrusted to our care,\" Crozier added.\nBut despite saying Thursday that Crozier was right to raise his concerns, Modly told reporters that the captain was removed for showing \"extremely poor judgment\" and creating a \"firestorm\" by too widely disseminating the memo detailing his concerns, copying some 20 to 30 people.\nHe said Crozier was not removed because of any evidence suggesting he leaked the memo to the press, but rather for allowing \"the complexity of his challenge with the Covid breakout on the ship to overwhelm his ability to act professionally when acting professionally was what was needed the most at the time.\"\n\"I have no information nor am I trying to suggest that he leaked the information. It was published in the San Francisco Chronicle. It all came as a big surprise to all of us that it was in the paper, and that's the first time I had seen it,\" he added.\nThose who know Crozier, like retired Cmdr. Guy Snodgrass, who commanded a squadron of F-18s deployed to the USS Ronald Reagan when Crozier served as that ship's executive officer, say the now dismissed captain would not have written the letter were he not alarmed for the health and welfare of those under his command and their families.\n\"He cares about the health and welfare of his Sailors first and foremost, Snodgrass said. \"A commanding officer would easily conclude that if his or her actions resulted in an accelerated response to what was judged to be a rapidly deteriorating situation, then the relief from command was easily worth it.\"\nModly on Thursday also acknowledged Crozier's popularity among the aircraft carrier's crew.\n\"I am entirely convinced that your Commanding Officer loves you, and that he had you at the center of his heart and mind in every decision that he has made. I also know that you have great affection, and love, for him as well,\" he said.\nThe initial results of a preliminary inquiry by the Navy into Crozier's actions are due Monday, according to a statement from the Navy.\n\"The preliminary inquiry will consider command climate and circumstances surrounding the response, including communication throughout the administrative and operational chains of command,\" the statement said.\nThe inquiry is designed to give the Navy secretary and chief of naval operations an initial indication of whether further action is warranted against Crozier and whether a broader investigation is required, according to three Navy officials.\nMeanwhile, a group of Democratic senators wrote to acting Inspector General for the Department of Defense Glenn Fine on Friday requesting he \"conduct a formal investigation into the Navy's response to reports of the outbreak of COVID-19 aboard the USS Theodore Roosevelt and the decision to relieve CAPT Brett Crozier of his command.\"\n\"It is essential that your office conduct a comprehensive investigation to avoid any potential conflicts of interest within the Navy chain of command, and we encourage you to evaluate all relevant matters associated with the dismissal and the outbreak on the ship,\" the letter states.\n\"Given the concerns for the health and safety of the sailors on the USS Theodore Roosevelt, in addition to the potential for future COVID-19 outbreaks on other ships and submarines, we urge you to investigate the Navy's response to this outbreak to evaluate whether the Navy is implementing all appropriate precautionary measures and best-practices to protect the safety of our fleet,\" it adds.\nThis story has been updated to add details on a preliminary naval inquiry into Crozier's actions.", "url": "https://www.cnn.com/2020/04/03/politics/uss-theodore-roosevelt-aircraft-carrier-captain-send-off/index.html"}