{"authors": ["Alicia Lee"], "date_download": "2020-05-04 16:21:31", "date_modify": "2020-05-04 16:21:31", "date_publish": "2020-04-05 23:40:59", "description": "Nearly four weeks after revealing her coronavirus diagnosis, Rita Wilson made a beautiful comeback by performing the national anthem for NASCAR's iRacing event Sunday.", "filename": "2020_04_05_entertainment_co_ca32e3880d77f66585022c6122bda124_index_1588609291.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405185535-rita-wilson-national-anthem-0405-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_entertainment_co_ca32e3880d77f66585022c6122bda124_index_1588609291.html", "title": "Rita Wilson performs for first time after coronavirus diagnosis at virtual NASCAR event", "title_page": "Rita Wilson performs for first time after coronavirus diagnosis at virtual NASCAR event  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Nearly four weeks after revealing her coronavirus diagnosis, Rita Wilson made a beautiful comeback by performing the national anthem for NASCAR's iRacing event Sunday.\nWith a simple guitar track accompanying her, the actress sang in an earnest tone, a contrast to her playful rap performance of \"Hip Hop Hooray\" she blessed us with last month on Instagram.\nWilson was filmed singing \"The Star-Spangled Banner\" by her 24-year-old son Truman Hanks from their Los Angeles home, according to announcers Mike Joy and Jeff Gordon who led Sunday's broadcast of NASCAR's third virtual race.\nEver since the coronavirus suspended NASCAR's races last month, drivers have been competing against each other virtually using race simulators, which are similar to what you'd see in an arcade racing game. The races have been broadcast on Fox Sports, bringing in more than 1 million viewers, according to Nielsen.\nThe fact that Wilson was the one to sing the national anthem appeared to offer some hope to NASCAR fans during these difficult times.\nRead More", "url": "https://www.cnn.com/2020/04/05/entertainment/coronavirus-rita-wilson-sing-nascar-trnd/index.html"}