{"authors": [], "date_download": "2020-05-04 20:18:21", "date_modify": "2020-05-04 20:18:21", "date_publish": "2020-04-04 14:42:00", "description": "INDIANAPOLIS (AP) — Fourteen more Hoosiers have died from COVID-19, raising Indiana's death toll from the disease caused by the coronavirus pandemic to 116, state health officials said...", "filename": "_ddd49f0fe112ccf81e98ab36f29ddcc6_1588623501.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ddd49f0fe112ccf81e98ab36f29ddcc6_1588623501.html", "title": "14 more deaths raise Indiana coronavirus toll to 116", "title_page": "14 more deaths raise Indiana coronavirus toll to 116", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "INDIANAPOLIS (AP) — Fourteen more Hoosiers have died from COVID-19, raising Indiana’s death toll from the disease caused by the coronavirus pandemic to 116, state health officials said Saturday.\nThe Indiana State Department of Health announced 523 additional Hoosiers have been diagnosed with COVID-19, bringing to 3,953 the total number of Indiana residents known to have the disease, following corrections to the previous day’s total.\nMarion County, where Indianapolis is located, had the most new cases at 155, the department said. Lake County had 70, Hamilton County had 41, Hendricks County had 23, and Bartholomew had 22. No other county had more than 17 new cases.\nThe complete list of counties with cases is included in the department’s COVID-19 dashboard at www.coronavirus.in.gov . Cases are listed by county of residence.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. Older adults and people with existing health problems are among those particularly susceptible to more severe illness, including pneumonia. The vast majority of people recover.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/ddd49f0fe112ccf81e98ab36f29ddcc6"}