{"authors": ["Will Ripley"], "date_download": "2020-05-04 16:18:06", "date_modify": "2020-05-04 16:18:06", "date_publish": "2020-04-04 00:03:35", "description": "Each day seems to bring more bad news for Tokyo. The daily coronavirus infection count has more than doubled in the Japanese capital in one week.", "filename": "2020_04_03_asia_tokyo-coronavirus-japan-hnk-intl_index_1588609086.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403103127-tokyo-japan-coronavirus-covid-19-pandemic-hotbed-shinzo-abe-ripley-pkg-intl-ldn-vpx-00005624-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_asia_tokyo-coronavirus-japan-hnk-intl_index_1588609086.html", "title": "There are fears a coronavirus crisis looms in Tokyo. Is it too late to change course?", "title_page": "There are fears a coronavirus crisis looms in Tokyo. Is it too late to change course? - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Tokyo (CNN) Each day seems to bring more bad news for Tokyo.\nThe daily count of new coronavirus cases has doubled in the past week, from about 40 in the final days of March to 97 on Thursday and 89 on Friday, according to the Tokyo Metropolitan Government.\nIf the current trend continues, the outlook is bleak, said Kentaro Iwata, an infection control specialist from Kobe University, who has repeatedly warned that Japan isn't doing enough to halt the spread of the virus.\n\"Japan needs to have the courage to change, when we are aware we are on the wrong path,\" Iwata said. \"We might see the next New York City in Tokyo.\"\nNew York is considered the epicenter of America's coronavirus outbreak. There, the number of known cases is doubling every five days, according to a CNN count . More than 2,900 people have died.\nAs of Friday, Japan had 3,329 confirmed cases and 74 deaths.\n\"The beginning of the burst of the infections in Spain, France, Italy, New York City -- was really like Tokyo right now,\" said Iwata.\nHe says there needs to be more testing.\nAs of Friday, Tokyo had tested fewer than 4,000 people in a city of 13.5 million. And just 39,466 people had been tested in this nation of 125 million, according to the Ministry of Health, Labour, and Welfare.\nThat's a tiny fraction compared to countries in the region and around the world. As of Friday, South Korea -- which has a much smaller population than Japan -- had tested more than 440,000 people.\nThe Japanese government says its testing regime is adequate and suitably targeted to high risk cases.\n\"Testing people with a low probability of novel coronavirus would be a waste of resources,\" Japan's Health Ministry told CNN in a statement. \"We ask people with some symptoms to stay home for a period of time.\"\nTurned down for a test\nCoronavirus patient Issei Watanabe spoke to CNN from his Tokyo hospital room. He struggled to breathe in between coughing fits. Doctors consider his a \"mild case\" and expect he'll be discharged on Tuesday.\nWatanabe is 40, a non-smoker, in good health. His symptoms came on quickly. Body aches, chills, no sense of taste or smell.\n#breaking Japan Health Ministry confirms 235 more infections and 3 deaths from coronavirus on Thursday.\nTokyo sees new record daily increase: 97\nTotal infections in Japan: 3,329 people (2,617 on land/712 Diamond Princess)\nDeath toll: 74 people (63 on land/11 Diamond Princess) pic.twitter.com/7wUQGFPVMW — Will Ripley (@willripleyCNN) April 3, 2020\nWhen he asked for a coronavirus test, he says he was turned down -- and had to endure five days with a fever above 40 degrees Celsius -- 104 degrees Fahrenheit -- before he was finally allowed to take a test, which came back positive.\nWatanabe says he infected at least two people during that time.\n\"People don't know what to do. There's a real lack of good information,\" Watanabe said. \"Your life is in your hands. Stay home. Please stay home. Don't go out.\"\nWatanabe worries about the tens of millions of Japanese who are older than 65. He knows he'll recover, but many in Japan's aging society won't.\nInfectious disease experts warn of a steep price in human life -- if coronavirus spreads rapidly, in this rapidly aging society.\n\"Coronavirus is very dangerous to old people,\" said Masahiro Kami, executive director of Japan's nonprofit Medical Governance Research Institute. He said most coronavirus patients in Japan are likely showing few, if any, symptoms.\n\"When they are asymptomatic, they can transmit the coronavirus to others,\" Kami warned.\nNo lockdown\nJapanese Prime Minister Shinzo Abe has repeatedly stated the situation inside Japan does not warrant declaring a state of emergency or imposing a lockdown in Tokyo.\nHe said such drastic measures would further damage an economy already grappling with the severe economic fallout of the coronavirus and the postponement of the Tokyo 2020 summer Olympics.\nJUST WATCHED Japan's tourism industry braces for economic 'bloodbath' Replay More Videos ... MUST WATCH Japan's tourism industry braces for economic 'bloodbath' 02:37\nJapanese lawmakers are mulling a massive economic stimulus package that could include cash handouts to Japanese households. The government has been widely mocked for a plan to distribute two cloth face masks per household.\nJapan has imposed tough new travel restrictions -- banning foreigners from more than 70 countries, including the US, the UK, and most of Europe. Japan has also beefed up health screenings at airports and is requesting all incoming travelers quarantine for 14 days, although compliance is not actively monitored.\nYet there is growing concern -- inside and outside of the country -- that the government's increasingly dire warnings about the danger of spreading the virus may have reached many people too late.\nThe US Embassy in Japan posted a travel alert Friday, imploring US citizens to make preparations to go home in the wake of strengthened border control.\n\"The Japanese government's decision to not test broadly makes it difficult to accurately assess the Covid-19 prevalence rate,\" the alert said.\n\"While we have confidence in Japan's health care system today, we believe a significant increase in Covid-19 cases makes it difficult to predict how the system will be functioning in the coming weeks. In the event of a spike in cases, US citizens with pre-existing medical conditions may not be able to receive the medical care they have grown accustomed to in Japan prior to the Covid-19 pandemic.\"\nCarrying on\nLast week, huge crowds gathered for hanami, the viewing of the cherry blossoms. Some people were seen wearing masks, but many did not.\nThe startling images -- shared widely on social media and on domestic and international media -- prompted the unprecedented closures of some Tokyo parks over the weekend.\nTokyo Governor Yuriko Koike and Abe are pleading with the public to stay home, avoid travel, and practice social distancing. Some are listening, but many are not.\nThe government's policy so far has been to try to contain clusters by contract tracing positive cases and instructing suspected cases to quarantine.\nProponents of the Japanese coronavirus approach have argued the society's cultural practices -- such as bowing instead of shaking hands, widespread use of surgical face masks, and more frequent washing of the hands and mouth -- could spare Japan from the kind of rapid spread of coronavirus seen in other nations.\nWhen asked if Japan is protected because it is not a \"hug and handshake\" culture, Iwata said \"it is possibly one of the reasons for having less infections when compared to Europe and America.\"\nHe calls the theory \"valid,\" but \"unproven.\" He does not believe Japan should base its strategy on the hope that hygienic cultural practices will be enough to spare Tokyo the worst.\nWhile Koike and Abe have urged the city's population of 13.5 million people to work from home -- advice heeded by major Japanese corporations like Honda, Toyota and Nissan -- telework is not possible for about 80% of Japanese companies, according to 2019 government data.\nScores of people are still commuting into the capital, as evidenced by packed subway trains during rush hour. And despite the temporary closure of some major Japanese department stores and around 500 Starbucks locations, many bars and restaurants remain open and full of customers.\nGovernor Koike announced Friday that 628 of the 750 beds Tokyo has secured for coronavirus patients are occupied, mostly by people with mild symptoms.\nHealth authorities are in negotiations to move patients who are asymptomatic or reasonably well to separate lodgings such as hotels, she said.\nOnce again, Koike warned of an impending crisis and urged people to stay at home.\nThe curve does not appear to be flattening in Tokyo. If anything, the situation seems to be getting worse.", "url": "https://www.cnn.com/2020/04/03/asia/tokyo-coronavirus-japan-hnk-intl/index.html"}