{"authors": ["Scott Bauer"], "date_download": "2020-05-04 20:04:12", "date_modify": "2020-05-04 20:04:12", "date_publish": "2020-04-08 20:27:33", "description": "MADISON, Wis. (AP) — Anyone needing proof of the power and significance of the Wisconsin Supreme Court can look no further than the lines of mask-wearing voters that stretched for hours in...", "filename": "_89282bc532accc87c8de23bcbf2e4838_1588622652.html", "image_url": "https://storage.googleapis.com/afs-prod/media/2d8c5887131a44a9834864f41c6dddec/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_89282bc532accc87c8de23bcbf2e4838_1588622652.html", "title": "Wisconsin's pandemic election puts focus on state's court", "title_page": "Wisconsin's pandemic election puts focus on state's court", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Isaac Repinski, of Milwaukee, juggles after voting at Riverside High School in Milwaukee on Tuesday, April 7, 2020. The Wisconsin primary is moving forward in the wake of the coronavirus epidemic after Gov. Tony Evers sought to shut down Tuesday's election in a historic move Monday that was swiftly rejected by the conservative majority of the Wisconsin Supreme Court by the end of the day. (Mike De Sisti/ Milwaukee Journal Sentinel via AP)\nIsaac Repinski, of Milwaukee, juggles after voting at Riverside High School in Milwaukee on Tuesday, April 7, 2020. The Wisconsin primary is moving forward in the wake of the coronavirus epidemic after Gov. Tony Evers sought to shut down Tuesday's election in a historic move Monday that was swiftly rejected by the conservative majority of the Wisconsin Supreme Court by the end of the day. (Mike De Sisti/ Milwaukee Journal Sentinel via AP)\nMADISON, Wis. (AP) — Anyone needing proof of the power and significance of the Wisconsin Supreme Court can look no further than the lines of mask-wearing voters that stretched for hours in Milwaukee during an election held despite a stay-at-home order because of the coronavirus pandemic.\nAn election-eve decision by the court overturning the governor’s order to postpone the vote made the state an outlier in pushing ahead with voting, ignoring pleadings from health experts and local officials about the danger of spreading the virus.\nThe fact that Wisconsin went forward when other states delayed their elections, and that many voters were willing to endure long waits to cast ballots, reflects the hotly disputed role the court has taken in a state with outsize importance in national politics.\nRepublicans and Democrats both see Wisconsin as crucial to winning national elections and gaining control of Congress. Historically, elections in the state are decided by close margins and power has flipped between the parties.\nSince conservatives have held a majority on the state Supreme Court, the Republican-dominated Legislature has been able to enact laws that enhanced the GOP’s position, including voter ID laws and limits on labor unions, despite legal challenges from Democrats. The court would play a pivotal role in reviewing the drawing of new district lines for legislative and congressional offices following the 2020 census, which has a major impact on the balance of political power.\nOn the ballot Tuesday for a 10-year term was one of the justices in the court’s 5-2 conservative majority, Dan Kelly.\nDemocrats charged that holding the election when many voters might stay home would unduly benefit Republicans, who generally fare better in low-turnout ballots. Wisconsin’s Supreme Court elections are nonpartisan in name only.\nNo turnout information was available from Tuesday’s vote. The results can’t be posted until April 13, allowing time for counting absentee ballots.\nThe court’s ruling to proceed with the election broke squarely along ideological lines. Four conservative justices voted to block the Democratic governor’s bid to delay the vote, while two liberals voted for it.\nSuch a split has become common in some of the court’s highest profile rulings in recent years, particularly on hyper-partisan issues.\n“There’s a widely held perception that the court is biased,” said Lester Pines, an attorney who has been practicing law in Wisconsin since 1975 and frequently represents Democrats, including Gov. Tony Evers.\nConservative attorney Rick Esenberg argued that the decision came on the legal merits, not politics.\n“When people start calling them partisan hacks, I get concerned because I think it undermines confidence in the judiciary, it doesn’t reflect what’s going on,” said Esenberg, president of the Wisconsin Institute for Law & Liberty.\nRepublican lawmakers noted that Evers himself had said in recent days he didn’t have the legal authority to move the election without legislative approval. Evers reversed course after the GOP-controlled Legislature refused to move to a mail-in only election and extend the period for absentee voting.\n“This is not something that should surprise anybody that a governor cannot unilaterally postpone an election,” Esenberg said of the court’s ruling.\nThe court in recent years has found on the side of conservatives in many high-profile cases. Democrats said the court’s favorable ruling for the voter ID requirement made it harder for their voters to cast ballots. More recently, court rulings upheld the Legislature’s ability to meet in a lame duck session to undercut Evers’ powers as governor after he defeated incumbent Republican Scott Walker in 2018.\nKeeping the court’s conservative majority is crucial for Republicans ahead of redistricting next year. With Republicans in control of the Legislature and a Democratic governor, there’s little chance of agreement on new maps for legislative and congressional boundaries.\nRedistricting isn’t the only major case on the horizon. Litigation stemming from Tuesday’s election is expected.\nThe court’s conservative tilt began in 2008 when a conservative defeated a justice who had been appointed by then-Gov. Jim Doyle, a Democrat.\nThe state’s supreme court races have drawn huge campaign expenditures from outside groups on both the right and left. The Brennan Center for Justice, which tracks judicial election spending, put this race’s total at roughly $4.8 million, which is estimated to be the most expensive court race in the country.\n_____\nAssociated Press writer Andrew DeMillo in Little Rock, Arkansas, contributed to this report.", "url": "https://apnews.com/89282bc532accc87c8de23bcbf2e4838"}