{"authors": ["Danielle Wiener-Bronner", "Cnn Business"], "date_download": "2020-05-04 16:59:12", "date_modify": "2020-05-04 16:59:12", "date_publish": "2020-04-08 15:47:01", "description": "American consumers have been stocking up on staples as the coronavirus pandemic spreads, giving one struggling beverage a much-needed boost: orange juice.", "filename": "2020_04_08_business_orange-juice-sales-coronavirus_index_1588611552.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409145246-natalies-orchid-island-juice-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_business_orange-juice-sales-coronavirus_index_1588611552.html", "title": "Orange juice sales are soaring during the pandemic", "title_page": "Orange juice sales are soaring during the pandemic  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) American consumers have been stocking up on staples as the coronavirus pandemic spreads, giving one struggling beverage a much-needed boost: orange juice.\nUS retail sales of orange juice jumped about 38% in the four weeks ending on March 28 compared to the same period last year, according to Nielsen.\nThe Florida Department of Citrus reported a spike in demand for 100% orange juice in particular. Shannon Shepp, executive director of the department, called the jump \"unforeseen and significant,\" in an emailed statement to CNN Business. \"Current projections suggest there will be a considerable increase in the short-run demand for orange juice,\" she added.\nNatalie's Orchid Island Juice reported a spike in demand for orange juice in retail.\nNatalie's Orchid Island Juice Company saw a 25% increase in demand in retail in mid-March, said Natalie Sexton, vice president of marketing for the company. That increase was driven primarily by citrus juices including orange and grapefruit juice.\nRead More", "url": "https://www.cnn.com/2020/04/08/business/orange-juice-sales-coronavirus/index.html"}