{"authors": ["Opinion Vitali Shkliarov"], "date_download": "2020-05-04 15:57:25", "date_modify": "2020-05-04 15:57:25", "date_publish": "2020-04-12 12:43:27", "description": "When Europe's last dictator claims vodka and saunas cure Covid-19, he stirs echoes of the nuclear disaster that fell on Belarusian soil more than 30 years ago -- and the USSR's deafening silence about it -- writes Vitali Shkliarov.", "filename": "2020_04_12_opinions_vitali-_090e9f2ef0581f648de86280386f00af_index_1588607845.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330123614-lukashenko-tease-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_12_opinions_vitali-_090e9f2ef0581f648de86280386f00af_index_1588607845.html", "title": "In Belarus, Covid-19 is a modern-day Chernobyl", "title_page": "In Belarus, Covid-19 is a modern-day Chernobyl - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Vitali Shkliarov is a visiting scholar with Harvard University's Davis Center for Russian and Eurasian Studies. The opinions in this commentary are his own. View more opinion at CNN.\n(CNN) Reading the recent spate of articles about the incredulous response of the President of Belarus to the threat of Covid-19, advising his citizens simply to wash their hands more often and eat meals at the regular time, took me back to another crisis I lived through -- the nuclear catastrophe at Chernobyl -- and the similar advice doled out to Belarusian citizens at that time.\nI was born and raised in Gomel, Belarus, about 120 miles from the town of Pripyat in modern-day Ukraine, part of the former Soviet Union, where the ill-fated Reactor 4 at the Chernobyl nuclear power plant exploded on April 26, 1986. Of the estimated 50 to 120 million curies -- the unit of measurement for radioactive debris -- released into the air over 10 days , about 70% fell on Belarusian territory\nI was just shy of 10 years old on that date. My parents and other adult relatives recalled in later years how, when told about the explosion some days later, the only advice they remember receiving from the government was to wash themselves more often.\nThen, as now, there was fear of the unknown -- people knew something had happened, but without much information, they didn't know what else to do. So they carried on. Like we buy masks today, they bought dosimeters, handheld devices used to measure radiation. Many women, my mother included, bought her own dosimeter and took it to the grocery store to measure the radioactivity of the food she was buying for her family.\nBut other than that, life carried on as usual. Businesses were open, schools were open . While I remember vividly getting an iodine pill (which can help block radioactive iodine, a product of uranium reactors like those at Chernobyl, from damaging one's thyroid glands) at school every morning, the fact that I went to school at all is surprising in retrospect.\nIt wasn't until over a month after the explosion that the country started taking the threat somewhat more seriously. Mikhail Gorbachev finally appeared on state television to address the catastrophe on May 14, 1986 , but only after weeks of downplaying it.\nOutside pressure had already mounted, as foreign scientists and media outlets spread word of the disaster. I was sent to Germany to live with a host family during the summer of 1986. But it's still hard to reconcile the fact that Belarusians didn't even know about the explosion until several days later.\nI can't recall the exact day we were told, but I remember my parents going out to march in the traditional May 1 workers' parade without any hesitation, so it certainly wasn't until after that date.\nBut this is old news. We've learned from the benefit of historical hindsight, from esteemed journalists like Svetlana Alexievich and Adam Higginbotham, who have written intensely researched, award-winning books on the subject, and even from popular culture, most recently in the eponymous HBO series, not just the details of the Chernobyl tragedy, but how they were covered up and kept from the Soviet people.\nOfficially, just 31 deaths were attributed directly to the explosion of Chernobyl's reactor 4, though it is likely that thousands of others will eventually have died of cancers caused by radiation exposure. More than that, though, some experts believe the psychological and social damage was extensive, as seen in mental health difficulties among those exposed to the disaster.\nA question about Chernobyl today isn't what happened there, but what we learned from this tragedy, if anything, and how we might apply those lessons in our response to the frighteningly similar terror of coronavirus.\nSo how is Belarus handling the crisis? There are many similarities between the literal fallout of Chernobyl and the figurative fallout of the Covid-19 virus. The radiation from Chernobyl was terrifying in its invisibility. And in coronavirus we are again fighting what many have dubbed an \"invisible enemy.\"\nIt would seem like Belarus would be a country uniquely suited to take the lessons of Chernobyl and apply them today. So why is the advice Belarusians are getting the same as before? Have the nation's leaders learned anything from the lessons of Chernobyl?\nIt would seem not. Unlike almost every other country on earth, Belarus is laughing off the threat of coronavirus; in fact, the President, Alexander Lukashenko, has gone so far as to say that the virus, or at least concern over it, is a \"psychosis\" that can be easily cured with vodka and a trip to the sauna.\nIt seems that Belarus has not yet -- and maybe never will -- reckon with the events of Chernobyl, and this is echoing in its present. When you ask the older generation in Belarus what they think about the Soviet government's reaction to the tragedy at Chernobyl, they don't register shock or anger. Most of them say it's better to leave the past in the past; after all, what can be done about events that happened decades ago?\nAnd when asked about their current president's response to Covid-19, they say that in times of crisis it's not helpful to speak bad about your country.\nHaving left my native country many years ago, I have seen how other countries deal with the dark times in their history. The United States still wrestles with the scourge of slavery; Germany and Japan's political and social structures are designed to prevent a repeat of the horrors wrought by their leaders during World War II. Yet Belarus hasn't done much to confront its past.\nYes, the HBO series on Chernobyl was widely watched and praised by critics around the world, even in Russia and Belarus. But it is important to note it was an American-British coproduction broadcast on an American network, with a Swedish director, filmed in Lithuania\nAnd, yes, we've even seen Belarusians tackle the tragedy head on, most notably in the work of the Nobel-prize winner Alexievich, but we should also note that Alexievich has spent much of her career outside of Belarus; she left the country \"in part to protest the authoritarian politics of Lukashenko, in part to save her energies for writing,\" as The New Yorker's Masha Gessen detailed . Not to mention the fact that until recently her works were not even published in Belarus.\nWhat is the real invisible enemy? Is it a microscopic virus or unseen radiation particles in the air? Or is it an unwillingness to wrestle with events now invisible in contemporary life because they have never seen the light of day?\nAlexievich recently praised the Chernobyl series for unveiling the events of the tragedy to a new generation of Belarusians, noting that it \"struck a chord\" with young people there. I asked my mom today if she had seen the show. She told me she wasn't interested. She already knew what happened, so what was the point of reliving it?\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nBut I find some hope in the show's resonance with Belarusian youth. They watched the series, and they're watching how their leadership is responding to this most recent crisis. In contrast to the Soviet generation, young Belarusians are skeptical of being told to drink vodka every day and go to the sauna to kill Covid-19. Friends my age and younger are far more likely to stay home and practice social distancing than my parents.\nWhile it is true that washing your hands will help protect you from the coronavirus, it's not enough.\nIt's time for a reckoning with reality, not just with the events of today, but with those of the past -- for the sake of the future.", "url": "https://www.cnn.com/2020/04/12/opinions/vitali-shkliarov-belarus-covid-19-chernobyl/index.html"}