{"authors": [], "date_download": "2020-05-04 20:15:07", "date_modify": "2020-05-04 20:15:07", "date_publish": "2020-04-29 09:45:19", "description": "The English rocker on the new Bush album, social distancing and co-parenting with Gwen Stefani.", "filename": "entry_gavin-rossdale-bush-album-the-kingdom_n_5ea07440c5b6b2e5b83bd2a6_1588623307.html", "image_url": "https://img.huffingtonpost.com/asset/5ea6f561250000bb0feb0681.jpeg?cache=jwvoabvydt&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_gavin-rossdale-bush-album-the-kingdom_n_5ea07440c5b6b2e5b83bd2a6_1588623307.html", "title": "Gavin Rossdale And The Turbulence And Loneliness That Drive Him", "title_page": "Gavin Rossdale And The Turbulence And Loneliness That Drive Him | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Gavin Rossdale has been oscillating between keeping busy and feeling a bit isolated since coronavirus stay-at-home orders came down last month. He’s also been thinking a lot about health care and other essential workers and those infected with COVID-19.\n“I feel like it’s a real dichotomy between staying at home being creative, or finding the best part of yourself and trying to improve, whatever your chosen system is to get through this, and then you see the front lines of the disasters and the deaths and the horror,” Rossdale told HuffPost.\nThe Bush frontman spent the first couple of weeks of the global pandemic with Kingston, Zuma and Apollo, the sons he shares with ex-wife, singer Gwen Stefani.\n“We did all the homeschooling and stuff, which was hilarious,” the British singer said. “Actually it wasn’t so bad at all, but it was a lot. Bouncing between the rooms, like a schoolteacher, just checking up on them and then being told off about my English metric system.”\nThings got particularly tricky when one of his sons asked for math help.\n“How I do long division is not how he does his. He said, ‘I don’t know how they do it in London or in England, but it’s not the same.’ I was like, ‘Well I got my answers with the calculator, that’s all I know.’”\nThe boys are now back in the United States, staying with Stefani and her boyfriend, country singer Blake Shelton, at their home in Oklahoma.\n“They’re isolated on a huge ranch in the middle of America, and I support that because it keeps them safe,” Rossdale said. “They were doing unbelievably well here in the house, two weeks locked up and it wasn’t so bad at all. We would go out when you were still allowed to go to the parks just to get some air, but now I can’t compete with that kind of space they [Stefani and Shelton] have, and I feel safer about that.”\nNow in an empty house, Rossdale is turning his attention to music. It’s lonely, he says, but it’s a feeling he’s gotten used to over the years. Life’s uncertainty has at least been good for one thing: Rossdale’s songwriting.\n“I can’t believe I’m a single father of three kids. When I travel, it gets lonely or you might meet someone, you think that’s all happening and then doesn’t quite work out,” he said. “And on paper, I should have been completely sorted and settled, but I feel really unsettled, and I think that, while it’s horrific for my personal life in quarantine, by the way, it’s really good for my work. It’s not like you have to be a starving artist in pain, but there’s so much to be said for turbulence.”\nThose turbulent feelings make up some of the songs on “The Kingdom,” Rossdale’s new album with Bush due out July 17. The 12-track set features lead single “Flowers on a Grave,” as well as “Bullet Holes,” which appeared in the movie, “John Wick 3: Parabellum.”\n“Flowers on a Grave” was the last song written for the album. Bush had turned in all the tracks for “The Kingdom,” but record label executives asked for a couple more to round out the album. Without access to a studio, Rossdale sat in his bedroom with the same drum machine he used for Bush’s 1994 debut album, “Sixteen Stone,” to write what would become the first single on “The Kingdom.”\nBMG \"The Kingdom\" follows Bush's 2017 album, \"Black and White Rainbows.\"\nTapping into the world around him fueled not only the sound but the lyrics, which right now feel “really vital” to Rossdale.\n“It’s poignant, and I was honest and confessional and as open as I can be,” he said. “The last record was kind of a bruised response to where my life was at and the turbulence in that time and being divorced, which was terrible.”\nThis time, armed with a “a big drawer of issues,” Rossdale wrote about the ups and downs of living and loving to “holding on to things for too long.”\n“I had a girlfriend for two years up until a year ago and that was the best,” he said. “First time I’d ever had anyone to travel with me, obviously because Gwen was working. So that was the first time that I ever had anyone travel with me and do that stuff.”\nAnother theme on “The Kingdom” involves loneliness. It’s a topic Rossdale has written about before and it feels even more poignant now in the midst of coronavirus social distancing measures.\n“Loneliness comes from not finding the right match or being insecure or not quite confident enough to express yourself and to show exactly who you are and what you need ... And then there’s the physical, there’s the loneliness of actually not being with someone. I mean, I’m fully aware of that. I really do love the feeling of finding someone, that special person, somebody not only special, but that person you want to text.”\nStill, there’s some messages of hope throughout the new Bush album, even showcased in the title, “The Kingdom,” a place Rossdale imagines to be free of judgment and self-righteous people; a place where people can be free to express themselves.\n“That’s what ‘The Kingdom’ wants to be, just like a utopian place,” Rossdale said.\nGDP Photos/ MediaPunch / Getty Images\nRossdale looks forward to performing these new songs live with Bush as soon as it’s safe to hold big concerts. These days, he spaces out his tours so he can spend more time with the kids.\n“I feel so guilty. And then you’re like, why am I doing this [touring]? You feel like the worst person in the world and then you play the show and you go, this is why I do it, I love it,” he said about performing live.\nFor the English rocker, it’s all about striking a balance with playing shows and seeing his kids.\n“I love being with them and I love looking after them. I’m really connected with them and it’s such a beautiful thing to be around them and watch them grow and be funny and even now, mimic me and make jokes about me,” he said. “I’m like, ‘Wow.’ It’s like getting beaten up by three versions of myself. It’s brilliant. It’s the best thing ever.”", "url": "https://www.huffpost.com/entry/gavin-rossdale-bush-album-the-kingdom_n_5ea07440c5b6b2e5b83bd2a6"}