{"authors": ["Errol Louis"], "date_download": "2020-05-04 16:08:55", "date_modify": "2020-05-04 16:08:55", "date_publish": "2020-04-02 14:13:18", "description": "The Florida governor was late and lackadaisical in issuing a stay-at-home order to protect his state -- and a number of governors recklessly still resist taking such an action -- as the invisible enemy of coronavirus continues to gather strength and wreak havoc in our homeland.", "filename": "2020_04_02_opinions_desanti_0dd4a5ef7f917756b41daae6ac4c14fe_index_1588608535.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401144357-ron-desantis-sot-florida-stay-at-home-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_opinions_desanti_0dd4a5ef7f917756b41daae6ac4c14fe_index_1588608535.html", "title": "DeSantis risked the lives of Floridians", "title_page": "DeSantis risked the lives of Floridians (opinions) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Errol Louis is the host of \"Inside City Hall,\" a nightly political show on NY1, a New York all-news channel. The opinions expressed in this commentary are his own. View more opinion articles on CNN.\nErrol Louis\nFlorida Gov. Ron DeSantis, by contrast, has been late and lackadaisical, in ways that will undoubtedly cost many Floridians their health -- and, perhaps, their lives.\nDespite surging numbers of fatalities in New York and Washington and a rising tide of Florida editorial boards demanding action, DeSantis did not issue a statewide stay-at-home order until April 1. That made Florida the last state with more than 5,000 coronavirus cases to implement a statewide shutdown.\n\"Unlike some other governors, DeSantis ignored the obvious for too long, and Floridians likely are sicker for it,\" the Miami Herald said in a scathing editorial. \"His statewide essential-services-only order, though welcome, is indeed, too late.\"\nOn March 22, the same editorial board has issued another action under the pointed headline: \"Coronavirus is killing us in Florida, Gov. DeSantis. Act like you give a damn.\"", "url": "https://www.cnn.com/2020/04/02/opinions/desantis-risked-the-lives-of-floridians-louis/index.html"}