{"authors": ["Kerry Flynn", "Cnn Business"], "date_download": "2020-05-04 16:54:48", "date_modify": "2020-05-04 16:54:48", "date_publish": "2020-04-08 17:19:32", "description": "In 2017, The Washington Post health reporter Lena Sun wrote, \"The Trump administration is ill-prepared for a global pandemic.\" In 2018, The Atlantic science reporter Ed Yong wrote, \"The Next Plague Is Coming. Is America Ready?\"", "filename": "2020_04_08_media_reporters-coronavirus_index_1588611288.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407192347-max-filby-dispatch-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_media_reporters-coronavirus_index_1588611288.html", "title": "How reporters are covering the biggest story of their careers", "title_page": "How reporters are covering the biggest story of their careers - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) In 2017, The Washington Post health reporter Lena Sun wrote , \"The Trump administration is ill-prepared for a global pandemic.\" In 2018, The Atlantic science reporter Ed Yong wrote , \"The Next Plague Is Coming. Is America Ready?\"\nNow, here we are in 2020, and Sun, Yong and a phalanx of health reporters in newsrooms across the globe are covering the still-unfolding coronavirus pandemic. Even entertainment and sports reporters, whose coverage areas have all but disappeared, are on the story.\n\"The pandemic truly is one of the biggest stories -- if not the biggest story -- of our time, and I think it demands our full attention right now,\" Yong said. \"Science, health and technology reporters are at the core of that. We are here to do our own stories and support our colleagues with expertise or knowledge when needed.\"\nHealth reporters said they have, for the most part, dropped their other assignments. BuzzFeed News science reporter Stephanie Lee had been deep in an investigation of Juul in recent months. Now she is writing few stories on the electronic cigarette company so she can focus on coronavirus.\nCoronavirus \"became the all-consuming thing,\" Lee said. \"It's weird to be in competition with like every news reporter in the world. It's also really amazing to see what work they're generating.\"\nRichard Bilton, a BBC journalist who works on the investigative documentary series Panorama, said he and his team have shifted their focus solely to the coronavirus.\n\"Any other investigation right now doesn't matter,\" Bilton said.\nStaying safe\nMax Filby, health reporter for the Gannett-owned newspaper The Columbus Dispatch, said he spent his first two weeks covering coronavirus from the Ohio Statehouse, where he began seeing officials' changing views on the seriousness of the problem.\n\"The first press conference was in a really cramped room with 30 to 40 people. I couldn't easily socially distance in that room,\" Filby said. \"Over time we moved to a bigger room. Then we were in multiple rooms and the governor's in a different room and we have to ask him questions by camera.\"\nWhen he's not covering press conferences, he works from home. \"My phone is basically the front line,\" he continued.\nColumbus Dispatch reporter Max Filby asks a question via video feed to Ohio Gov. Mike DeWine at a coronavirus news conference on March 17, 2020 at the Ohio Statehouse. (Photo by Doral Chenoweth/Columbus Dispatch)\nIndeed, the bulk of reporting throughout the industry takes place from journalists' homes. Health reporter Emily Woodruff of The Advocate in New Orleans said it has been difficult not being able to talk in person about sensitive topics.\n\"I'm talking to someone who had to FaceTime their parent and that was the last time they talked with them,\" Woodruff said. \"Normally, I would try to go to that person's house and meet with them, and now it's just a phone call.\"\nSimon Shuster, an investigative reporter for TIME, recently visited an apartment across from Wyckoff Heights Medical Center in Brooklyn for a story . He and photojournalist Benjamin Norman wore masks, which provided a layer of protection, but it also introduced a barrier to conversation.\n\"You can't communicate, as easily, empathy just because your face is covered,\" Shuster said. \"There's this extra tension in the room.\"\nLos Angeles Times health reporter Soumya Karlamangla said she has noticed that sources are eager to talk to her about the pandemic, which is a welcome change from when she previously reported on mass shootings and wildfires, when people seemed to have a harder time opening up.\n\"Literally everyone wants to talk to us all the time because they want to prevent something bad from happening,\" Karlamangla said. \"I'm writing about the fact that the nurses don't have enough masks. That's definitely helping people and a unique position as a journalist that I've never been in before.\"\n\"So much bigger than a health care story\"\nAnne Saker, health reporter at Gannett-owned newspaper The Cincinnati Enquirer who worked on the Pulitzer Prize-winning investigation into heroin addiction, said she started covering coronavirus extensively after two students at Ohio's Miami University got tested for Covid-19 after returning to campus from a visit to China during winter break . That story published on January 28, but she said wished she had started covering the coronavirus sooner.\n\"I look back on the end of February thinking, 'Oh my god I wasn't screaming loud enough, I wasn't yelling loud enough,'\" Saker said. \"This was the tidal wave, avalanche, earthquake in our society, and it's happening on this beat.\"\nis now among The Atlantic's top-three most read stories of all time. Yong was on leave to write for a book about animal senses when his editor asked him to return in March to work remotely with The Atlantic newsroom. His editorial mandate was to \"swing big and take your time.\" His story , \"How the Pandemic Will End,\" which laid out in excruciating detail how the coronavirus pandemic will play out in coming months,is now among The Atlantic's top-three most read stories of all time.\nOther health reporters have been steadily covering the developments of coronavirus since reports emerged in early January. Sun, a Pulitzer Prize-winning reporter who is based in DC and was once the paper's Beijing bureau chief, said the Post's bureau there initially took the lead. But as the number of cases swelled, she turned her full attention to the story.\n\"As the virus spread around the world, more people were getting involved,\" Sun said. \"We focused on being more thematic, what are we learning about the fatality, infectiousness, preparedness.\"\n\"There are a lot of stories that are competitive and just so many things we could be covering,\" Kliff said. \"There's been a lot of value in teaming up with other reporters just to turn stories around.\"\nDrew Armstrong, US health team leader at Bloomberg News, said every week his newsroom's leadership is reevaluating how they are organized.\n\"We tear up the playbook,\" Armstrong said. \"We have to be flexible so we stay ahead of this, because it's so much bigger than a health care story at this point.\"", "url": "https://www.cnn.com/2020/04/08/media/reporters-coronavirus/index.html"}