{"authors": ["Paul Leblanc"], "date_download": "2020-05-04 17:03:11", "date_modify": "2020-05-04 17:03:11", "date_publish": "2020-04-09 23:29:56", "description": "Utah Gov. Gary Herbert issued an executive order Thursday requiring adults entering the state to disclose their travel plans in the latest state-led crackdown on domestic travel amid the novel coronavirus pandemic.", "filename": "2020_04_09_politics_utah-coronavirus-travel-restriction_index_1588611791.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191127011159-governor-of-utah-gary-herbert-0125-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_utah-coronavirus-travel-restriction_index_1588611791.html", "title": "Utah governor orders all adults entering the state to disclose their travel plans", "title_page": "Utah governor orders all adults entering the state to disclose their travel plans - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Utah Gov. Gary Herbert issued an executive order Thursday requiring adults entering the state to disclose their travel plans in the latest state-led crackdown on domestic travel amid the novel coronavirus pandemic.\nThe order, which goes into effect Friday morning, applies to all adults regardless of how they enter the state. The governor's office said Thursday visitors will get instructions on how to register their travel plans via an automatic text message when they arrive in the state.\n\"I am impressed with the extraordinary things that Utahns are doing each day to help one another stay safe and stay home. In recent days, however, we have seen an uptick in travel on our roads,\" Herbert said in a statement.\n\"We need to limit our travel to essential purposes only. Our goal is to trace potential cases of Covid-19 in inbound travelers.\"\nRead More", "url": "https://www.cnn.com/2020/04/09/politics/utah-coronavirus-travel-restriction/index.html"}