{"authors": ["Larry Lage"], "date_download": "2020-05-04 20:15:44", "date_modify": "2020-05-04 20:15:44", "date_publish": "2020-04-09 21:28:14", "description": "Emoni Bates does not appear to be interested in reclassifying to make next season his last at Ypsilanti Lincoln High School, a move that would put him on the path to play college basketball early...", "filename": "_79faa2b87ae61da3076977edeb42eeba_1588623344.html", "image_url": "https://storage.googleapis.com/afs-prod/media/6148bf2dfc1f4d2996b89e08b075ca48/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_79faa2b87ae61da3076977edeb42eeba_1588623344.html", "title": "Michigan AP D1 POY Bates is not in rush to finish HS early", "title_page": "Michigan AP D1 POY Bates is not in rush to finish HS early", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Dec. 9, 2019, file photo, Ypsilanti Lincoln's Emoni Bates shoots against River Rouge during the Tip Off Classic high school basketball game in Ypsilanti, Mich. Michigan Associated Press Division I Player of the Year Emoni Bates does not appear interested in reclassifying to graduate from Ypsilanti Lincoln High School next year. The 6-foot-9 sophomore has been projected to potentially be taken No. 1 overall in the 2022 NBA Draft. (Nicole Hester/Ann Arbor News via AP, File)\nFILE - In this Dec. 9, 2019, file photo, Ypsilanti Lincoln's Emoni Bates shoots against River Rouge during the Tip Off Classic high school basketball game in Ypsilanti, Mich. Michigan Associated Press Division I Player of the Year Emoni Bates does not appear interested in reclassifying to graduate from Ypsilanti Lincoln High School next year. The 6-foot-9 sophomore has been projected to potentially be taken No. 1 overall in the 2022 NBA Draft. (Nicole Hester/Ann Arbor News via AP, File)\nEmoni Bates does not appear to be interested in reclassifying to make next season his last at Ypsilanti Lincoln High School, a move that would put him on the path to play college basketball early and guarantee his eligibility for the 2022 NBA Draft.\nBates and his parents are keeping all options open, but they’re not in a rush to speed up the process of the sophomore’s development as a person and a player.\nAnd so far, what they’ve done seems to be working out well.\nThe hoops phenom was named The Michigan Associated Press Division 1 Player of the Year for the second straight season on Thursday in a vote of sports writers from across the state.\n“It just shows me that the hard work paid off,” Bates said in a telephone interview.\nBates leads the All-State team, which also includes Menalito McGee of Wyoming; Saginaw’s Sir’Real Smith; Muskegon’s Jarvis Walker; Tyson Acuff of Detroit Cass Tech; River Rouge’s Legend Geeter; Lorne Bowman of Orchard Lake St. Mary’s; Clarkston’s Matt Nicholson; Isaiah Jackson of Waterford Mott, Farmington’s Jaden Akins and Mount Pleasant coach Dan Schell.\nThree years ago, New York Knicks guard RJ Barrett became one of the elite high school basketball players to reclassify and graduate from high school a year early in order to start college and NBA careers sooner than scheduled.\nThe 6-foot-9, 185-pound Bates is not eager to to follow the trend, and his parents aren’t pushing him into making the life- and career-altering decision right now.\n“There’s really no focus on reclassing up,” his father, E.J. Bates, told the AP.\nE.J. Bates said his son may graduate high school earlier than the spring of 2022 to get his game and body stronger for the next phase. The NBA and its players have been talking about going back to allowing prospects to enter into the league right out of high school in 2022.\n“We want him to be prepared whether if it’s college for a year or if he’s allowed to go to the league right after high school,”said Bates, who coaches his son on the AAU circuit. “It’s all about what he wants to do.”\nBates averaged 32 points this year and his shot to help Ypsilanti Lincoln repeat as state champions was cut short during the playoffs due to the coronavirus pandemic that suspended play.\n“I was upset about it because I feel like we could’ve won another state championship,” he said. “But everybody has to stay safe, so I understood.”\nBates has been keeping up with school from home and has been trying to keep his game sharp on a hoop on a concrete slab in the backyard, but he dunked on it once too much earlier this week.\n“I broke the rim,” he said softly.\nBates, regarded as one of the top high school players in any class, is one of three finalists for the Gatorade’s national player of the year award along with seniors Evan Mobley of California and Cade Cunningham of Texas.\n___\nFollow Larry Lage at https://twitter.com/larrylage", "url": "https://apnews.com/79faa2b87ae61da3076977edeb42eeba"}