{"authors": ["Steve Karnowski"], "date_download": "2020-05-04 20:14:16", "date_modify": "2020-05-04 20:14:16", "date_publish": "2020-04-16 14:25:38", "description": "MINNEAPOLIS (AP) — Restaurants and bars that have been subsisting on takeout orders during the shutdown for COVID-19 could start offering beer and wine to go as early as this weekend under bill...", "filename": "_846afbfaffc7027bcf61c175c3e1e77b_1588623256.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_846afbfaffc7027bcf61c175c3e1e77b_1588623256.html", "title": "Minnesota Senate backs beer and wine to go amid pandemic", "title_page": "Minnesota Senate backs beer and wine to go amid pandemic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MINNEAPOLIS (AP) — Restaurants and bars that have been subsisting on takeout orders during the shutdown for COVID-19 could start offering beer and wine to go as early as this weekend under bill the Minnesota Senate passed Thursday to provide a little relief to one of the hardest-hit sectors of the state’s economy.\nThe Senate approved the bill 65-2 and sent it to the House, which is expected to approve it Friday and send it to Gov. Tim Walz, who has said he will sign it.\nThe Minnesota Department of Health on Thursday reported seven more deaths from COVID-19, raising the state’s toll to 94, while 103 new confirmed cases raised the state’s total to 1,912. As of Thursday, 213 patients were hospitalized, an increase of 16 from Wednesday, while 103 of them were in intensive care, an increase of 10. But 1,020 patients have recovered and no longer need isolation.\nThe liquor bill by Republican Sen. Karin Housley, of St. Mary’s Point, would allow licensed restaurants and bars to sell up to 72 ounces of beer, hard seltzer or cider, and up to 750 milliliters of wine with a takeout food order. That works out to a six-pack of beer or a standard bottle of wine. The person picking up the order must be 21 or older. Food deliveries still can’t include alcohol. Communities can opt out of allowing beer and wine to go.\n“This is something we can do right now. These businesses are hurting. They need to get cash in the door to be able to feed their families,” Housley said during a discussion that turned into a broader debate, splitting along party lines, over whether the state should relax the Democratic governor’s stay-at-home order and begin to restart the economy.\n“It’s a sliver of hope,” Republican Senate Majority Leader Paul Gazelka, of East Gull Lake, said of the bill. “It’s something that we can do. We could do so much more.”\nWalz ordered bars and restaurants to shut down as of March 17 to enforce social distancing as the coronavirus pandemic started to take hold in Minnesota. They’re allowed to offer takeout and delivery service, which has allowed many to keep operating on a shoestring. They’ve been seeking permission since then to offer beer and wine during the shutdown to make up for the sudden loss of food and liquor sales.\nSince Walz gave that order, and his subsequent stay-at-home order, more than 470,000 Minnesotans have applied for unemployment insurance,. Hospitality workers are one of the largest groups of the newly jobless, according to the Department of Employment and Economic Development.\nAlso Thursday, the University of Minnesota said it will ask the Legislature for $20 million to allow it to dramatically expand statewide testing for both the COVID-19 virus and whether people have developed antibodies to it. The university said in a statement that it’s preparing to conduct around 10,000 antibody and 10,000 virus tests per day to identify Minnesotans who currently have the disease, those who have recovered and may now be immune to it, and those who remain at risk. Mayo Clinic officials have said they’re ready to launch a similar testing ramp-up.\nTesting on that scale would allow the state to meet the governor’s goal of conducting 40,000 tests per week, which he has said is a necessary condition for restarting the state’s economy.", "url": "https://apnews.com/846afbfaffc7027bcf61c175c3e1e77b"}