{"authors": ["Jessica Gresko", "Colleen Long"], "date_download": "2020-05-04 20:12:16", "date_modify": "2020-05-04 20:12:16", "date_publish": "2020-04-07 17:58:50", "description": "WASHINGTON (AP) — An appeals court sided with the Trump administration Tuesday in its effort to resume executions of federal death row prisoners but sent a legal challenge by inmates back to a...", "filename": "_0325168e7addc66bcb0cc8ce89f61cc2_1588623136.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9c77b3322a2c4ecbaa5fc724f58ec0a0/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0325168e7addc66bcb0cc8ce89f61cc2_1588623136.html", "title": "Trump gets win in executions case, but more litigation ahead", "title_page": "Trump gets win in executions case, but more litigation ahead", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Donald Trump speaks about the coronavirus in the James Brady Press Briefing Room of the White House, Monday, April 6, 2020, in Washington. (AP Photo/Alex Brandon)\nPresident Donald Trump speaks about the coronavirus in the James Brady Press Briefing Room of the White House, Monday, April 6, 2020, in Washington. (AP Photo/Alex Brandon)\nWASHINGTON (AP) — An appeals court sided with the Trump administration Tuesday in its effort to resume executions of federal death row prisoners but sent a legal challenge by inmates back to a lower court for further review. The decision leaves unresolved for now whether, and if so when, executions might resume.\nThe Justice Department announced over the summer it would restart federal executions after a 16-year break and scheduled five executions. Inmates challenged their executions and a trial court judge temporarily halted them, ruling that the federal government’s execution procedure likely violates the Federal Death Penalty Act. A three-judge panel of a federal appeals court disagreed in a 2-1 ruling Tuesday , with two judges appointed by President Donald Trump siding with the administration. The judges vacated the lower court judge’s order temporarily halting the executions but sent the case back for a review of additional claims made by the inmates.\nThe Justice Department declined to comment Tuesday on the case or whether it would schedule new execution dates while litigation is ongoing.\nCate Stetson, an attorney for the inmates, said in an emailed statement that the Trump administration had “rushed the process in order to carry out executions without meaningful judicial review of the legality and constitutionality of the new execution procedures.” Lawyers for the inmates are considering their options following the ruling, including asking the full appeals court to review the case.\nRobert Dunham, the executive director of the Death Penalty Information Center, said the judges’ decision “raises more questions than it answers” and “doesn’t give much guidance going forward.”\n“The one thing that all the judges agree on is there are other significant factual and legal issues that the district court still needs to resolve,” he said.\nGenerally speaking, he said, the coronavirus pandemic has meant the postponement of trials, hearings and other proceedings in death penalty cases as well as the delay of scheduled executions in Texas.\nExecutions on the federal level have been rare. The government has put to death only three defendants since restoring the federal death penalty in 1988, most recently in 2003, when Louis Jones was executed for the 1995 kidnapping, rape and murder of a young female soldier.\nIn 2014, following a botched state execution in Oklahoma, President Barack Obama directed the Justice Department to conduct a broad review of capital punishment procedures. Attorney General William Barr said in July that the Obama-era review had been completed and that executions would resume using a new single-drug procedure. The procedure is similar to the procedure used in several states but not all.\nIn their challenge, the prisoners said the Federal Death Penalty Act requires that federal executions employ procedures used by the states in which they are carried out. The judges who heard the appeal of the case at the U.S. Court of Appeals for the D.C. Circuit disagreed. The judges who sided with the federal government were Gretory Katsas, appointed by Trump in 2017, and Neomi Rao, who was appointed by Trump in 2019. Judge David Tatel, a Bill Clinton appointee, dissented.\n___\nGresko reported from Arlington, Virginia. Associated Press reporter Michael Balsamo contributed to this report.", "url": "https://apnews.com/0325168e7addc66bcb0cc8ce89f61cc2"}