{"authors": [], "date_download": "2020-05-04 20:14:09", "date_modify": "2020-05-04 20:14:09", "date_publish": "2020-04-29 02:33:09", "description": "The Democrat easily defeated Republican Kimberly Klacik, retaking a Maryland congressional seat he held for five terms.", "filename": "entry_naacp-leader-kweisi-mfume-wins-election-replace-elijah-cummings_n_5ea8e3c6c5b6123a1764183f_1588623249.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8e62e2500009010eb086c.jpeg?cache=z1tvnczh9n&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_naacp-leader-kweisi-mfume-wins-election-replace-elijah-cummings_n_5ea8e3c6c5b6123a1764183f_1588623249.html", "title": "Ex-NAACP Leader Kweisi Mfume Wins Special Election To Replace Elijah Cummings", "title_page": "Ex-NAACP Leader Kweisi Mfume Wins Special Election To Replace Elijah Cummings | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "BALTIMORE (AP) — Democrat Kweisi Mfume easily won a special election Tuesday to finish the term of the late Elijah Cummings, retaking a Maryland congressional seat Mfume held for five terms before leaving to lead the NAACP.\nMfume defeated Republican Kimberly Klacik in the heavily Democratic 7th Congressional district.\nMaryland opened just three polling stations Tuesday and sent ballots weeks in advance to encourage mail voting because of the coronavirus pandemic. Earlier this month, thousands of Wisconsin primary voters waited hours outside overcrowded polling stations, and Maryland’s contest could be a test for future races in a key election year.\nDemocrats outnumber Republicans by more than 4-1 in the majority-black district, which includes a significant portion of the city of Baltimore and parts of Baltimore and Howard counties. The diverse district includes areas of Baltimore that struggle with poverty and violent crime, as well as more affluent areas and landmarks such as Johns Hopkins Hospital.\nMfume captured an overwhelming number of votes in the city and strong majorities in both Howard and Baltimore counties.\nMfume was scheduled to speak to supporters in Baltimore later in the evening after capturing an overwhelming number of votes in the city and strong majorities in the two neighboring counties.. Maryland’s senior Sen. Ben Cardin, a fellow Democrat, welcomed Mfume back to the state’s congressional delegation.\n“As both the predecessor and now successor to our friend and colleague Elijah Cummings, I know Congressman Mfume will serve the people of the 7th Congressional district in a way that honors Elijah’s deep legacy,” Cardin’s statement said.\nFor her part, Klacik tweeted: “That one time when hard work didn’t pay off. Perhaps one day District 7 will want a change. Proud of my team & the work we put in. We will continue to wait for the final results.”\nMfume supports stronger gun-control measures, including reauthorizing a federal assault weapons ban that expired in 2005. Baltimore had 348 homicides last year — the fifth straight year topping 300 — making it the city’s most violent year ever per capita.\nMfume also is focusing on the root causes of crime, including the inability of young adults to find jobs, and supports apprenticeships to develop employable skills for young people.\nMfume is to serve the rest of Cummings’ term until January. Vicotry also means Mfume, 71, will run as an incumbent in Maryland’s June primary to be the nominee for a full term in November.\nMfume held for five terms from 1987 to 1996 and chaired the NAACP from 1996 until 2004. The NAACP is based in Baltimore.\nThe 7th district attracted national attention last year when President Donald Trump referred to it on Twitter as a “disgusting, rat and rodent infested mess” where “no human being would want to live.” At the time, Cummings was the powerful House Oversight Committee chairman, leading multiple investigations of the president.\nTrump’s tweets also followed an appearance by Klacik on the Fox News network’s program “Fox & Friends,” which invited her on air to discuss her social media posts showing trash in Baltimore. Klacik, a Baltimore County Republican Central Committee member, had campaigned on economic development and helping struggling parts of Baltimore via a federal “opportunity zones” program.\nThe district includes an area in Baltimore that had the state’s highest number of reported coronavirus cases for weeks. Democratic lawmakers sounded the alarm over the virus killing African Americans at a higher rate.\nMfume, who spent years at the National Institutes of Health Council for Minority Health Disparities, called it frustrating the black community can’t fight back as it wants: “It’s almost like being attacked by the virus and having someone tie your arm behind your back.”\nIn the June 2 primary, Mfume will face many of the same opponents he defeated in February. The primary was originally scheduled for April but was postponed by Gov. Larry Hogan due to the virus.\n___\nWitte reported from Annapolis, Maryland. Associated Press writer Regina Garcia Cano in Washington and Christina A. Cassidy in Atlanta contributed to this report.", "url": "https://www.huffpost.com/entry/naacp-leader-kweisi-mfume-wins-election-replace-elijah-cummings_n_5ea8e3c6c5b6123a1764183f"}