{"authors": ["Paul P. Murphy", "Ryan Young", "Jake Carpenter"], "date_download": "2020-05-04 16:51:58", "date_modify": "2020-05-04 16:51:58", "date_publish": "2020-04-08 01:43:47", "description": "Emergency room nursing staff at a Detroit hospital were told to leave Sunday night after they refused to work and demanded more nurses be brought into their overrun emergency room, health care workers there told CNN.", "filename": "2020_04_07_us_detroit-nurses-sinai-grace-coronavirus_index_1588611118.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407175534-detroit-sinai-grace-hospital-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_us_detroit-nurses-sinai-grace-coronavirus_index_1588611118.html", "title": "Detroit hospital nurses refuse to work without more help, ordered to leave", "title_page": "Detroit hospital nurses refuse to work without more help, ordered to leave - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Are you a health care worker fighting Covid-19? Send CNN a message on WhatsApp about the challenges you're facing, +1 347-322-0415.\n(CNN) Emergency room nursing staff at a Detroit hospital were told to leave Sunday night after they refused to work and demanded more nurses be brought into their overrun emergency room, health care workers there told CNN.\nThe night shift ER nurses at Sinai-Grace Hospital refused to leave the break room until hospital administrators brought in more nurses to help out, a physician at the hospital told CNN.\nHospital administrators decided, after four hours of deliberation, they would not be bringing in any more nurses to help and that the nurses could get to work or leave the hospital, the doctor said.\nSome did then leave, said the physician, who spoke to CNN on the condition of anonymity out of concern for their job.\nThe details provided by the physician were corroborated by ER nurse Sal Hadwan, who discussed what happened in a video livestreamed on Facebook.\nRead More", "url": "https://www.cnn.com/2020/04/07/us/detroit-nurses-sinai-grace-coronavirus/index.html"}