{"authors": ["Money", "Home", "Living Reporter"], "date_download": "2020-05-04 20:22:33", "date_modify": "2020-05-04 20:22:33", "date_publish": "2020-04-28 19:02:40", "description": "One proposal suggests sending every qualifying adult a relief payment of $2,000 per month for up to a year.", "filename": "entry_second-coronavirus-stimulus-check_l_5ea759dfc5b608582577a02f_1588623753.html", "image_url": "https://img.huffingtonpost.com/asset/5ea75a9d2400005a008e9d0f.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_second-coronavirus-stimulus-check_l_5ea759dfc5b608582577a02f_1588623753.html", "title": "Will There Be A Second Coronavirus Stimulus Check?", "title_page": "Will There Be A Second Coronavirus Stimulus Check? | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "It might seem unusual to complain about $1,200 showing up in your bank account. But the unfortunate truth is that the recent round of stimulus payments don’t go very far for people who lost their jobs and are now struggling to get by. Plus, some people are still waiting on their payments, while others learned that they don’t qualify for any money based on their income.\nThe disappointment leaves many wondering whether there will be a second round of government stimulus checks. According to a recent survey by financial technology company SimplyWise, 63% of Americans will need another stimulus check within the next three months. So, what’s the likelihood of that happening?\nIt’s Not A Done Deal, Although ...\nWith economic fallout from the coronavirus pandemic growing exponentially, several phases of stimulus funds were required. In fact, there have already been three different stimulus packages enacted, though only one included a round of payments sent directly to individuals. The $1,200 payment that qualifying adults received as a direct deposit (about 70 million people are still waiting for paper checks in the mail) was part of the larger CARES Act, an unprecedented stimulus package totaling $2 trillion.\nAs for whether there could be a “phase four” economic stimulus that includes a second round of payments, it’s possible, but not certain. Democratic leaders in the House of Representatives have signaled openness not only to another round of checks, but to a system of recurring monthly payments, and there is definitely some support for the idea within their caucus.\nThe goal is for Congress to complete another stimulus package ― dubbed “CARES 2” ― by May 4. In addition to direct payments, it would include additional aid for state and local governments and free health care coverage for coronavirus patients.\nSixty-two members of Congress also recently signed a letter arguing in favor of recurring monthly payments as “the most efficient mechanism for delivering economic relief to those most at-risk in this crisis.” Among the signers were Sen. Bernie Sanders (I-Vt.), Rep. Alexandria Ocasio-Cortez (D-N.Y.) and Sen. Kamala Harris (D-Calif.).\nPresident Donald Trump has not ruled it out. “We could very well do a second round of direct (payments),” he said during a news conference on April 6. “It is absolutely under serious consideration.”\n... More Coronavirus Stimulus Plans Are In The Works\nSo, what could a potential second stimulus check program look like?\nEarlier this month, Reps. Ro Khanna (D-Calif.) and Tim Ryan (D-Ohio) proposed the Emergency Money for the People Act, or EMPA, a bill that would provide a new round of stimulus payments of $2,000 per month to U.S. citizens and residents over the age of 16 who earn $130,000 or less. After the first six months, the program could be renewed for an additional six months unless the employment-to-population ratio reaches a pre-COVID19 level of 60%.\nThat $2,000 per month figure would be adjusted for different types of tax filers (married filers who earn $260,000 or less annually would get $4,000 per month, for example ― the rate for two individuals). Payments would phase out by 5% for each $1,000 over the threshold amount. Adults would receive an additional $500 per month for every child dependent, up to a maximum of $1,500.\nSimilar to the CARES Act, payment eligibility under the EMPA would be determined by adjusted gross income from 2018 or 2019 tax returns. However, those who might not have submitted tax returns for those years because of no earnings or unemployment could submit their current income information under a special application process through the Treasury to verify eligibility.\n“Importantly, the bill proposes greater inclusion and would include students and other groups currently claimed as dependents by others,” said Michael Sury, a lecturer in finance at the University of Texas at Austin and managing director for the Center for Analytics. “Moreover, the payments would not count as income, so other income-based benefits would be unaffected.”\nGiven the issues that the government has had with distributing funds under the CARES Act, this bill would allow funds to be distributed across a variety of channels, including by check, direct deposit and other payment platforms such as Venmo and PayPal. Sury noted that this could help thwart debt collection agencies that have garnished stimulus payments once they hit bank accounts.\nThere are other stimulus proposals on the table as well, though they don’t actually involve direct payments to individuals.\nFor example, Sen. Josh Hawley (R-Mo.) proposes that the federal government cover 80% of wages for U.S. workers, up to the national median wage (that’s about $33,000 annually as of 2018) through payroll tax credits to businesses. Bonuses would also be paid out to businesses for rehiring laid-off workers. This program would stay in effect until the pandemic is over.\nSenate Democrats have also proposed a “heroes fund,” which would provide a $25,000 pay increase to essential workers through the rest of the year, as well as a $15,000 essential worker recruitment incentive.\nCan A Second Stimulus Check Get Approved?\nWhile EMPA has yet to gain much traction in Congress, there is a growing recognition that payments in addition to those provided under the CARES Act are going to be necessary, Sury said.\n“Still, it is likely to face headwinds in the Senate ― while there is an appetite to provide additional support, there are growing concerns about the price tag,” he said.\nAn additional stimulus package in some form is likely to be supported by both sides of the aisle, but it’s a bit too early to say what it will look like exactly.", "url": "https://www.huffpost.com/entry/second-coronavirus-stimulus-check_l_5ea759dfc5b608582577a02f"}