{"authors": ["Curt Anderson"], "date_download": "2020-05-04 20:08:15", "date_modify": "2020-05-04 20:08:15", "date_publish": "2020-04-09 18:19:06", "description": "ST. PETERSBURG, Fla. (AP) — At the holiest time of year for Christians, churches are wrestling with how to hold services amid the coronavirus outbreak, and in some cases, that has set up showdowns...", "filename": "_e919561dd11c2b7043fea7e87962bd96_1588622895.html", "image_url": "https://storage.googleapis.com/afs-prod/media/29be6a16e26a421598ddedfc2e40cc43/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e919561dd11c2b7043fea7e87962bd96_1588622895.html", "title": "Some churches confront virus restrictions on Easter services", "title_page": "Some churches confront virus restrictions on Easter services", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Parishioners pray from their car as Fr. Steve Buno, Pastor of St. Rita of Cascia Catholic Church in Harahan, La., performs drive-thru Benediction of the Blessed Sacrament, as a form of social distancing due to the new coronavirus, during Holy Week, Tuesday, April 7, 2020. (AP Photo/Gerald Herbert)\nParishioners pray from their car as Fr. Steve Buno, Pastor of St. Rita of Cascia Catholic Church in Harahan, La., performs drive-thru Benediction of the Blessed Sacrament, as a form of social distancing due to the new coronavirus, during Holy Week, Tuesday, April 7, 2020. (AP Photo/Gerald Herbert)\nST. PETERSBURG, Fla. (AP) — At the holiest time of year for Christians, churches are wrestling with how to hold services amid the coronavirus outbreak, and in some cases, that has set up showdowns with local governments over restrictions that forbid large gatherings.\nMany churches are offering parishioners livestreaming options so they can observe Good Friday and Easter on TVs, smart phones and computers. Others are sending worshipers to drive-in movie theaters for services.\nGovernors in several states have deemed church an “essential service,” allowing Easter worship to proceed even as public health officials warn that large gatherings could be a major setback amid a pandemic that has killed more than 14,000 people in the U.S.\nThe restrictions have created conflicts with state and local authorities. Kansas lawmakers on Wednesday threw out an order by the governor that limited church gatherings to 10 people. A Georgia church where more than 30 people congregated inside a small building on Palm Sunday, prompting a visit from state troopers, plans to move forward with normal Easter worship.\nThe Rev. John Greiner said the Glorious Way Church in Houston initially moved services online after the county limited large gatherings, but his congregation will hold in-person services on Easter.\n“We can’t do what God called us to do on livestream,” Greiner said.\nThe church has installed hand-washing stations and rearranged the 1,000-person sanctuary to hold about 100 people with six or more feet between them, Greiner said. They plan to hold two abbreviated Easter services to accommodate everyone who wants to attend.\nChurches such as The Center Arena in Orlando held in-person services on Palm Sunday and plan to do the same for Easter, Pastor Envor Moodley said. Florida Gov. Ron DeSantis, a Republican and close ally of President Donald Trump, exempted religious services from a stay-at-home order issued this month, although he said they must observe social distancing guidelines.\nThe fallout from the pandemic has upended other rituals. Easter egg hunts have been canceled in favor of virtual events where children go on the internet to find eggs. Families are reconsidering whether to invite grandparents and other relatives to dinner.\nGerman Chancellor Angela Merkel emphasized that “even short trips inside Germany, to the seaside or the mountains or relatives, can’t happen over Easter this year.” New Zealand police warned people not to drive to vacation homes and risk arrest, and Lithuania moved to lock down major cities in the heavily Catholic nation.\nPope Francis will celebrate Easter Mass in a nearly empty St. Peter’s Basilica, instead of the huge square outside, and in Britain, Archbishop of Canterbury Justin Welby will deliver his traditional Easter sermon by video.\nIn the U.S., major denominations are adhering to the restrictions and keeping parishioners at home to stop the spread of the virus.\nFull Coverage: Religion\nIn the Miami Archdiocese, no in-person services are being held. But church leaders have recorded Mass in English and Spanish for broadcast on local TV at 11 a.m. on Sunday instead, said spokeswoman Mary Ross Agosto.\n“We taped the Easter Sunday Mass in all its glory,” she said. “The Catholic Church is not closed. People are looking for something uplifting.”\nThe Rev. Michael Waters said members of his 500-person Methodist congregation are among those who’ve gotten sick, and many have jobs that don’t allow the “luxury of social distancing.”\nHe said religious gatherings around the world have been breeding grounds for the virus and condemned holding in-person services as reckless.\n“At the core of our faith, of the Christian faith, is the commandment to love God with all our heart, soul and mind, and our neighbor as ourself,” Waters said. “Anything that puts the lives of our neighbors at jeopardy should not be promoted or endorsed through the church.”\nBut some smaller churches plan to defy the orders, and law enforcement will be watching in some locations.\nIn New Mexico, the Archdiocese of Santa Fe said it was closing the grounds of El Santuario de Chimayó, one of the most popular pilgrimage sites in the nation’s most Hispanic state.\nPolice will be at a various locations to tell pilgrims to turn around, officials said.\nIn Kansas, Senate President Susan Wagle, a Wichita Republican, said her phone had been “ringing off the wall” since the Democratic governor restricted the size of religions gatherings.\n“It appears to be out of line and extreme and clearly in violation, a blatant violation, of our fundamental rights,” she said. Religious leaders and faithful have made similar arguments elsewhere.\nAfter receiving a complaint Sunday, troopers showed up at Church of God the Bibleway in Statesboro, Georgia, and found more than 30 people inside the small building. The congregation wasn’t following social distancing practices, and many people were seen hugging and shaking hands with the pastor, an incident report said. Troopers gave the pastor a warning and urged him to hold services in the parking lot.\nThey returned in the evening to find the pastor holding another indoor service with people again standing close together. That’s when the pastor, Eli Porter, was cited on a misdemeanor charge of reckless conduct, as were four other men.\nClayton Cowart, president of the Statesboro church’s parent corporation, told The Associated Press the church plans to move forward with a normal, indoor service for Easter.\n“We’re going to do as much as we can to respect the law. But when it comes down to telling us how our religious services should go, we’re not going to do that,” he said.\nRiverTown Church in Columbus, Georgia, which has about 200 members, plans to hold drive-in services for the third straight weekend on Easter.\nPastor David Rathel estimates they drew about 55 cars last week. The church marked off every other parking place and asked parishioners to stay in their cars.\n“Our message even this Easter Sunday is the resurrection has not been canceled.”\nThe motto on the church’s website reads:: “Come as you are, worship in your car.”\n—-\nAssociated Press writers Jake Bleiberg in Dallas, Russell Contrares in Rio Rancho, New Mexico, and Kate Brumback in Atlanta contributed.", "url": "https://apnews.com/e919561dd11c2b7043fea7e87962bd96"}