{"authors": [], "date_download": "2020-05-04 20:05:55", "date_modify": "2020-05-04 20:05:55", "date_publish": "2020-04-09 12:40:44", "description": "A look at developments related to the coronavirus outbreak around Vermont: ___ UNIVERSITY OF VERMONT NURSES", "filename": "_c77e7ce66fc2e10eb09119b7d56ce627_1588622755.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8a36a5d89def44038f0371fd0ea44f03/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c77e7ce66fc2e10eb09119b7d56ce627_1588622755.html", "title": "Brand-new nurses coming to rescue; jobless claims up to 71K", "title_page": "Brand-new nurses coming to rescue; jobless claims up to 71K", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Vermont senators working remotely are displayed on a monitor, Wednesday, April 8, 2020, at the Statehouse in Montpelier, Vt. The Senate met with a quorum of 16 members wearing face masks and other face coverings in attendance, while the others attended the session electronically during the coronavirus pandemic. (Colin Flanders/Seven Days via AP, Pool)\nVermont senators working remotely are displayed on a monitor, Wednesday, April 8, 2020, at the Statehouse in Montpelier, Vt. The Senate met with a quorum of 16 members wearing face masks and other face coverings in attendance, while the others attended the session electronically during the coronavirus pandemic. (Colin Flanders/Seven Days via AP, Pool)\nA look at developments related to the coronavirus outbreak around Vermont:\n___\nUNIVERSITY OF VERMONT NURSES\nAll 95 senior nursing students at the University of Vermont are going to be graduating early this year so they can support health care workers during the COVID-19 pandemic, school officials said Thursday.\nVermont’s State Board of Nursing will offer the students temporary permits so they can begin staffing hospitals and other health facilities immediately after they graduate May 1, the university said.\nThe nurses had been scheduled to graduate in late May. Normally, new graduates begin work in early August, after they’ve taken a licensure exam and become registered nurses.\n“Healthcare workers need support as soon as we can provide it,” Rosemary Dale, chair of the Department of Nursing in UVM’s College of Nursing and Health Sciences, said in a written statement. “Our students will be able to make a real difference.”\nSenior nursing student Kathryn Calisti, of Yarmouth, Massachusetts, will begin work in early May on a general surgery floor at the UVM Medical Center, where she worked as a student intern and has been offered a job.\nCalisti said she called her parents to talk it through. But in the end, she decided that going to work right away was the correct decision.\n“If you can get into the hospital a little earlier, and help out, that’s what you want to do,” Calisti said. She plans to study for the licensure exam while she is working.\n___\nUNEMPLOYMENT CLAIMS\nVermont processed 16,474 initial unemployment insurance claims last week, compared to 519 at the same time last year, the Vermont Department of Labor said Thursday.\nThe state received a total of 22,754 initial unemployment insurance claims last week for a total of 71,667 since March 15.\n___\nINMATES TEST POSITIVE\nThe Department of Corrections said Thursday 28 inmates and five staff at the Northwest State Correctional Facility have tested positive for the coronavirus.\nOfficials said all inmates and staff members were tested after an inmate started showing symptoms early Monday morning and was tested and placed in a negative pressure cell.\nThe 28 inmates, who are asymptomatic, will be moved to the St. Johnsbury facility to isolate while they recover. Staff members will be quarantined and not report to work, department officials said.\nNorthwest State Correctional Facility is under full lockdown, and staff members are required to wear masks, officials said.\n___\nMORE CASES\nCOVID-19 has now been reported in all 14 counties, the Vermont Health Department said.\nThe last county to report a case is Essex, in the remote northeastern corner of Vermont.\nStatistics compiled by the Health Department show that the most cases, over 320, were reported in Chittenden County, which includes Burlington. Vermont now has a total of almost 630 cases, along with 23 deaths.\nMeanwhile, Gov. Phil Scott said he plans to lengthen his stay-at-home order for Vermonters, which has been in place for two weeks. Details are expected Friday.\n___\nFORMER LAWMAKER DIES\nThe Vermont flag is going to be flown at half staff on Monday to remember former state Rep. Bernie Juskiewicz, who died Wednesday of complications of COVID-19.\nJuskiewicz, 77, a Republican from Cambridge, served in the Vermont House from 2013 through 2018. He also served as a member of the University of Vermont Board of Trustees.\n“Bernie served the people of Cambridge and Waterville with distinction in the House of Representatives, always placing their interests first,” Scott said in a statement distributed by his office Thursday. “I had the privilege of working with him during his time in the legislature and saw firsthand just how committed he was to his community.”", "url": "https://apnews.com/c77e7ce66fc2e10eb09119b7d56ce627"}