{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:29:05", "date_modify": "2020-05-04 20:29:05", "date_publish": "2020-04-20 09:27:21", "description": "The Latest on the effects of the coronavirus outbreak on sports around the world: ___ Kentucky coach John Calipari’s foundation helping charities provide COVID-19 pandemic relief has...", "filename": "_7cc42cfec3a3d402676ad2b00b7dc392_1588624145.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b0890119ef014ec0ac58c14ebb66586d/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7cc42cfec3a3d402676ad2b00b7dc392_1588624145.html", "title": "The Latest: Calipari foundation receives $1 million donation", "title_page": "The Latest: Calipari foundation receives $1 million donation", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A locked gate is seen by the Etihad Stadium where Manchester City was due to play Burnley in an English Premier League soccer match Saturday March 14, 2020, after all English soccer games were cancelled due to the spread of the COVID-19 Coronavirus. For most people, the new COVID-19 coronavirus causes only mild or moderate symptoms, but for some it can cause more severe illness.(AP Photo/Jon Super)\nA locked gate is seen by the Etihad Stadium where Manchester City was due to play Burnley in an English Premier League soccer match Saturday March 14, 2020, after all English soccer games were cancelled due to the spread of the COVID-19 Coronavirus. For most people, the new COVID-19 coronavirus causes only mild or moderate symptoms, but for some it can cause more severe illness.(AP Photo/Jon Super)\nThe Latest on the effects of the coronavirus outbreak on sports around the world:\n___\nKentucky coach John Calipari’s foundation helping charities provide COVID-19 pandemic relief has received a $1 million donation.\nThe Hall of Fame coach recently began his “Coffee With Cal” video series on Facebook to help The Calipari Foundation support No Kid Hungry, Feeding America and several charities providing relief. CustMbite, which makes dental products easier and affordable and is a Delta Dental of Kentucky subsidiary, made the large donation. The company added in a release that it’s “glad to have the opportunity to partner with Coach Cal and his foundation to help ensure kids are receiving the nutrition they need.”\nCalipari has already hosted former President Bill Clinton and NBA Dallas Mavericks owner Mark Cuban on the 20-week series.\n___\nBaseball Commissioner Rob Manfred suspended uniform employee contracts as of May 1, giving teams the ability to lay off or cut the pay of major and minor league managers, coaches, trainers and full-time scouts.\nAbout 9,000 people are covered by uniform employee contracts, including general managers and baseball operations staff on some teams. Manfred cited the inability to play games due to the national emergency caused by the new coronavirus pandemic.\n“Our clubs rely heavily on revenue from tickets/concessions, broadcasting/media, licensing and sponsorships to pay salaries,” Manfred wrote in an email Monday, a copy of which was obtained by The Associated Press. “In the absence of games, these revenue streams will be lost or substantially reduced, and clubs will not have sufficient funds to meet their financial obligations.”\n___\nThe Big Ten has announced the membership of its task force for emerging infectious diseases.\nChairing the group is Chris Kratochvil, the University of Nebraska medical center’s associate vice chancellor for clinical research and professor of psychiatry and pediatrics.\nThe task force was initially formed March 7 at the request of Big Ten commissioner Kevin Warren. The group includes one representative from each of the Big Ten’s 14 member schools.\nThe task force is designed to provide counsel and medical advice to ensure the safety of the Big Ten’s students, coaches administrators and fans.\nAmong other members of the group are: Edith Parker, dean at Iowa’s college of public health; Boris Lushniak, dean of Maryland’s school of public health; Preeti Malani, Michigan chief health officer; and Susan Koletar, director of Ohio State’s division of infectious diseases.\n___\nUniversity of Michigan athletic director Warde Manuel has volunteered to reduce his salary by 5%.\nSchool president Mark S. Schlissel announced the cost-saving move as part of the institution’s plan to cut costs due to the financial impact of the coronavirus pandemic. Schlissel says the school may have to endure losses as much as $1 billion through 2020.\nManuel, who was hired four years ago, had a $990,000 salary in 2019.\nSchlissel says he decided to cut his salary as school president by 10% for the rest of the year, starting on May 1.\n___\nThe Memphis Grizzlies are buying lunch each day this week for workers at a COVID-19 testing site.\nThe Grizzlies are feeding approximately 50 workers each day through Saturday at the Tiger Lane testing facility outside the Liberty Bowl Memorial Stadium at the Memphis Fairgrounds.\nCoach Taylor Jenkins is providing lunch Thursday, and coaches for the Grizzlies and the G League Memphis Hustle have Tuesday. Forward Jaren Jackson Jr. has covered two days, while the Grizzlies are picking up the other two.\n___\nThe Green Bay Packers have distributed the first round of Milwaukee grants to 16 nonprofit organizations as part of the Packers Give Back COVID-19 Community Relief Fund.\nPackers officials say $500,000 in grant money has been established for organizations supporting Milwaukee County residents dealing with the effects of the pandemic. Future grants through the fund will be announced later.\nThe grants given so far are designed to address hunger concerns, human services, health and wellness plus assistance to domestic violence victims and help for the elderly and the homeless.\nThe Packers relief fund is providing $1.5 million overall, and $1 million is being directed to Brown County organizations through the Greater Green Bay Community Foundation. A portion of those funds already has been distributed to 10 Brown County nonprofit groups for food and hygiene concerns, housing assistance, transportation, medication and other basic needs.\n___\nBengals quarterback Andy Dalton and his wife, J.J., have donated $150,000 to a local fund providing personal protective equipment for health care workers along with lab supplies to expand testing amid the coronavirus pandemic.\nDalton, who has one year left on his contract with Cincinnati, told medical professionals in a video that “it’s a true honor for us to help support you all in this fight” by contributing to the University of Cincinnati Health Crisis Response Fund.\nDr. Richard P. Lofgren, the president and CEO of UC Health, said the Daltons’ support “lets these health care heroes know that the community is behind them.”\n-- Joe Kay reporting in Cincinnati\n___\nThe company that makes Louisville Slugger wood baseball bats has closed its factory, furloughed 90 percent of its employees and shut its popular museum.\nHillerich & Bradsby Co. says it has continued to cover all health care benefits for its 171 furloughed workers. The remaining 10% of employees have taken 25 percent pay cuts.\nThe wood bat factory closed on March 19, three days after the Louisville Slugger Museum shut. The 120-foot bat outside its headquarters now a banner across the barrel reading “Flatten the Curve.”\nThe 165-year-old company produces about 2 million wood Louisville Slugger bats a year at its downtown Louisville plant, with around 50,000 going to Major League Baseball.\nH&B CEO John Hillerich IV told The Louisville Courier Journal that if the company doesn’t soon crank up its Pennsylvania mill — and MLB has no timetable to start its season — then some of the set to become bats might spoil.\n___\nPurdue says the father of freshman men’s basketball player Brandon Newman has died of complications from the coronavirus.\nChicago police say 59-year-old Officer Ronald Newman died early Friday. He was a decorated officer, with 137 awards in his 19 years on the force. Newman spent the bulk of his career in the department’s 4th District on the city’s South Side.\nIn a statement, Purdue said athletic department officials were “deeply saddened” by the death and have reached out to the Newman family.\n___\nArsenal manager Mikel Arteta, his coaches and players have agreed to a 12.5% pay cut for the next year to help the club deal with the financial impact of the coronavirus.\nNo games have been played in the Premier League for six weeks and the competition is not likely to resume until at least June due to the national lockdown and social distancing.\nArsenal says the reduction in annual earnings by the players and coaches will take effect next month.\nThe club says in a statement that “if we meet specific targets in the seasons ahead, primarily linked to success on the pitch, the club will repay agreed amounts. We will be able to make those repayments as hitting these targets, which the players can directly influence, will mean our financial position will be stronger.”\nArsenal has 10 games remaining and is eight points from fourth place with a game in hand on Chelsea as it chases Champions League qualification.\n___\nThe NFL and the Players Coalition are donating more than $3 million to seven areas significantly affected by the new coronavirus.\nAs part of the league’s Inspire Change program, a donation of $3.05 million will be sent to health systems, individual hospitals, and nonprofit organizations in Atlanta, Baltimore, Chicago, Detroit, Washington, and impacted regions of Florida and Louisiana.\n“We know that during this difficult time, our minority and low-income communities are struggling disproportionately with the impact of COVID-19,” said Players Coalition co-founder and former NFL star Anquan Boldin. “Communities in Detroit, Chicago, Baltimore and more are getting hit hard right now, and we want to do our part in ensuring these areas have even the basic needs. We are glad we can partner with the NFL to support the organizations who are on the ground providing for these families.”\n___\nSyracuse men’s basketball coach Jim Boeheim and football coach Dino Babers are taking voluntary pay cuts to help the university cope with the drain of financial resources due to the new coronavirus pandemic.\nAlso taking the voluntary 10% pay cuts are women’s basketball coach Quentin Hillsman, men’s lacrosse coach John Desko, and women’s lacrosse coach Gary Gait.\nSyracuse Chancellor Kent Syverud announced the austerity moves in a letter Monday morning to students and faculty. He said the university has been hit with more than $35 million in unplanned expenses and unrealized revenue.\nAll new capital projects also have been placed on hold, except for the renovation of the Carrier Dome. The $118 million project includes a new permanent roof for the home of the school’s football, basketball, and lacrosse teams.\n___\nRegional government officials in Germany have discussed sports and the coronavirus pandemic on a conference call and say soccer could resume in mid-May.\nA summary published by the city of Bremen says “continuing play in the soccer Bundesliga ... is considered justifiable from the middle or end of May as per the current state of discussions.”\nBremen senator Anja Stahmann chaired the call. She says resumption would require “the strictest hygienic and medical conditions.”\nThe last top-level soccer game in Germany was played on March 11 but clubs have been pushing to resume the season in empty stadiums.\nClubs are facing financial shortfalls without revenue from broadcast deals and sponsors.\n___\nNew York City Mayor Bill de Blasio says there is a chance for large public gatherings later in the summer, which could lead to games at Yankee Stadium and the Mets’ Citi Field.\nDe Blasio announced Monday that parades and city-permitted events had been canceled through June because of the novel coronavirus but said progress in fighting the pandemic will determine what is allowed after that.\n“For all of us sports fans, we’re asking this question, can our leagues come back in 2020, at all? I think this is an area where we don’t know yet,” he said during a news conference. “I’m taking what I think is a cautious, steady approach to how we reopen New York City. And we have to always plan on the worst-case scenarios. We have to protect ourselves. But there’s also better-case scenarios that could come along and could get proven that might open up possibilities for later on, late in the summer, going into the fall. There may be opportunities.”\n___\nThe family that owns the Minnesota Vikings has increased its donations to COVID-19-related causes to more than $5 million.\nNew York and New Jersey residents Zygi, Mark and Lenny Wilf announced Monday that the bulk of the money has been earmarked to support health care workers, the elderly, food banks, social service organizations and Jewish philanthropic causes in New York, New Jersey, Minnesota and Israel.\nAmong the organizations receiving help are United Way Worldwide, the New Jersey Pandemic Relief Fund, RWJBarnabas Health, Jewish Federations of North America, New York-Presbyterian Hospital, Albert Einstein College of Medicine, University of Minnesota Masonic Children’s Hospital, Second Harvest Heartland, Minnesota Disaster Recovery Fund for Coronavirus and Vikings.1rmg.com.\n“We are focused on trying to provide as many resources as possible to meet their needs and assist some of the most vulnerable populations during this unprecedented time,” Vikings owner/chairman Zygi Wilf said.\nThe family made an initial donation of $500,000 last month.\nUnited Way Worldwide is one of six national charitable organizations recommended by the NFL as part of its Draft-A-Thon fundraising campaign tied to this week’s NFL draft.\n___\nThe Professional Fighters League has canceled its upcoming season because of the coronavirus pandemic and plans to resume in spring 2021.\nThe mixed martial arts promotion was expected to begin competition in May. The competition format includes a regular season, a postseason and a championship event, making it unique in MMA. Last year, the promotion staged six regular-season events, three playoff events and a championship event on New Year’s Eve.\nCEO Peter Murray says the PFL will pay its fighters a monthly cash stipend to help support them and their families throughout 2020.\nThe 2021 season will be distributed on ESPN platforms in the U.S. and to 160 countries by the league’s international media partners. The PFL said it will produce new programming across ESPN and PFL platforms for the rest of this year.\n___\nThe Spanish government says it has reached a deal with the country’s soccer league and federation for teams to return to practice.\nThe government has not provided a timetable or given any other detail about when practice would resume. It says it will depend on the evolution of the coronavirus pandemic and on decisions by health authorities.\nThe government says strict protocols will have to be followed when teams begin training again. The Spanish league and the federation have created health protocols for the return to training.\nThe league says the competition is not expected to resume until the end of May at the earliest and games will be in empty stadiums at first.\nGovernment officials and the presidents of the league and the federation met for nearly eight hours this weekend.\nThe government says the league and the federation have agreed to use part of the money from soccer television rights to help other sports in Spain. It says they will also create a contingency fund of 10 million euros ($10.8 million) to aid more vulnerable athletes.\n___\nContingency planning for the men’s Twenty20 World Cup will be among the topics for discussion when the heads of the top cricketing nations hold a specially convened meeting this week about the impact of the coronavirus pandemic on the sport.\nThe chief executives of the International Cricket Council’s 12 full members and three associate representatives also will discuss the rescheduling of series, the program of future tours and the key factors behind the resumption of international cricket on Thursday’s conference call.\nThe T20 World Cup is scheduled for Oct. 18-Nov. 15 in Australia. It is cricket’s biggest global tournament this year and hasn’t yet been called off.\nICC chief executive Manu Sawhney says the organization is continuing to “take advice from experts and authorities” about the T20 tournament.\nSawhney says there is a need to “share knowledge and … build a deep understanding of what it will take to resume international cricket.”\n___\nThe president of the German soccer federation says resuming league play will not mean taking resources away from healthcare workers amid the coronavirus pandemic.\nFritz Keller writes in Kicker magazine “we guarantee that resuming play ... will not cause a burden for the healthcare system.”\nHe adds that “there will be no use by sportspeople of testing capacity which would be missed elsewhere.”\nNo top league games have been played since March 11.\nThe German league has been more bullish than other major European competitions about the chances of resuming in May or June with widespread coronavirus tests for players. That push is partly driven by fears that several clubs face financial collapse without TV and sponsorship money.\nGerman state and local officials could potentially veto games in their areas. Keller says unified rules for soccer around the country would help clubs “quickly and without bureaucracy.”\n___\nManchester City striker Sergio Aguero has been using some of his spare time in lockdown to teach British kids how to speak Spanish.\nThe Argentina international has been signed up by the BBC as part of its home-schooling initiative while educational establishments are closed during the coronavirus pandemic.\nAguero is teaching kids how to count in Spanish. His lessons became available on a day kids in Britain would have usually returned to school after the Easter holidays.\nAguero says “it’s a tough time for children at the moment, and also for parents trying to keep them focused on their education from home.”\nAguero hasn’t played a competitive match since March 8 because soccer is shut down in England and across most of the world during the outbreak.\n___\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports", "url": "https://apnews.com/7cc42cfec3a3d402676ad2b00b7dc392"}