{"authors": ["Kara Scannell"], "date_download": "2020-05-04 16:18:47", "date_modify": "2020-05-04 16:18:47", "date_publish": "2020-04-04 13:05:57", "description": "John Mele is one of roughly 700 inmates who were released from county jails in New Jersey to address the growing novel coronavirus pandemic. But when he was handed two bus tickets and freed, he said he was frightened, not relieved.", "filename": "2020_04_04_politics_freed-inmates-challenges-coronavirus_index_1588609127.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403160748-maricopa-county-estrella-jail-0321-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_politics_freed-inmates-challenges-coronavirus_index_1588609127.html", "title": "Some inmates freed because of coronavirus are 'scared to leave'", "title_page": "Some inmates freed because of coronavirus are 'scared to leave' - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN) John Mele is one of roughly 700 inmates who were released from county jails in New Jersey to address the growing novel coronavirus pandemic . But when he was handed two bus tickets and freed, he said he was frightened, not relieved.\n\"I was scared to leave,\" Mele told CNN. \"There ain't too much sh** that I'm scared of. I'm scared of heights and I'm scared of going to something I don't know about.\"\nHe said he was given five minutes notice last Thursday after he was told he was leaving the jail three months earlier than his sentence for breaking into a fishing store. He had no place to go and no assurances that he was healthy.\n\"No temperature check. Nothing. They gave me two bus tickets,\" Mele said. He was steered toward a homeless shelter, but said he refused, concerned the virus would be spreading inside the cramped housing complex.\n\"I'm telling you the honest truth, if I had to go to a homeless shelter, I'm going back to jail. I'll do something petty\" to get locked up again, he said. Through a re-entry program he obtained a room in a motel near Newark airport. Mele is hoping to be granted an extension and eventually find an apartment.\nJails are proving to be a breeding ground for the spread of coronavirus. As of Friday, 239 inmates in NYC jails have tested positive for coronavirus out of a population of about 4,350. The top doctor for the Rikers Island jails called it a \"public health disaster.\" The Legal Aid Society, which represents poor New Yorkers, said there is an infection rate of 5.4% in Rikers Island, compared with 0.53% in New York state, which has the most cases in the US.\nIn New York, where the state system has about 43,000 people incarcerated, 36 have confirmed coronavirus cases and two prisoners have died. In the federal prison in Danbury, Connecticut, 15 inmates have tested positive for the coronavirus, according to the Bureau of Prisons. The prison facilities house a total of 1,075 inmates, according to the BOP.\nThe prospect of outbreaks has states, cities and counties across the country working on ways to reduce the prison population to lessen the spread of coronavirus. In St. Louis, Michigan, California, New York, and New Jersey officials are releasing certain categories of prisoners, including those who are older, have medical problems, have only a few months left on their sentence, or are held for parole violations.\nThe criteria for release varies by state and county by county. Many are prohibiting the release of inmates with histories of sex offense, domestic violence, and murders, but in some cases those inmates have been released.\nThere is no estimate for how many inmates who may qualify. The federal Bureau of Prisons houses 174,837 inmates nationwide , but that's only a fraction of the millions held in local, county and state facilities around the country.\nThe mass releases, according to government officials, lawyers and social service workers, have tested government safety nets and access to housing for many of these inmates. In normal times, there are hurdles to place inmates back into the community, but now, social service workers and government officials say, there are added factors complicating their re-entry, ranging from overcrowded housing shelters to families and landlords who won't accept prisoners because of concerns about contagion. The rising unemployment rate is also expected to strain their access to shelter and jobs.\nIn Michigan, the Department of Corrections is working case by case to see which inmates qualify for release from state prisons and when the prisoner doesn't have a place to go they have run into roadblocks.\n\"What we're finding is the hardest part right now is finding commercial placements for individuals without family or friends,\" said Chris Gautz, spokesman for the Michigan Department of Corrections. \"We're finding a lot of those are closing their doors to prisoners right now. Sometimes it's a county health department putting up a red flag: We don't have cases. We don't want you to parole this person back to the community. We're worried we might get it,\" he said.\nThe state houses 38,000 prisoners, 5,000 of which are eligible for parole, but only a fraction of them is likely to be released because of Michigan law and the qualifications.\nAdvocates for releasing inmates say governments need to make sure they don't create a public health problem.\n\"Compassionate release is something that we want to do, we want to release as many people in those protected groups as we can, but I think we also have to be sure that the protections are there that those people don't end up in worse circumstances and causing increased and enhanced infections. A lot of those people had no place to go,\" said Barbara Banaszynski, the senior vice president for Program Operations at Volunteers of America, a social services organization that has helped inmates released in the southern part of New Jersey.\n\"I'm very worried about, not only from a disease perspective, but from perspective of increasing homelessness and disease spread. They may not have Covid-19 when they come out of the facility, but if they're on the street and vulnerable... they're likely to contract and add to the problem,\" she said.\n'When they come out of prison, it's a ghost town.'\nWith some newly released inmates adjusting to a world turned upside down from coronavirus is a shock to their system.\n\"It's been challenging, probably the most challenging in the history of our corporation,\" said Dwayne Watterman, the facility director for Hudson County at the New Jersey Reentry Corporation, a nonprofit that helps inmates find housing, employment and health care.\nNormally he says he tries to build a connection with a new client first but now his primary role is to assure everyone they won't be placed in danger.\n\"Everybody's fearful, worried, high anxiety, alert, all the time,\" Watterman said. \"When they come out of prison, it's a ghost town. That's a little shocking to people,\" he added. His re-entry group has helped about 157 released under the judicial order in New Jersey, including Mele.\nOne of the largest releases has been in New York City, where officials have freed at least 900 inmates from the Riker's Island jail in the past few weeks. Many of them have homes they can return to, but some don't have a place to go. Re-entry programs have helped some obtain housing vouchers or shelter, but they acknowledge it hasn't worked perfectly.\nOn Monday, the top prosecutors for the five boroughs in New York City sent a warning to NYC's Department of Corrections and Mayor Bill de Blasio's office about the need for housing and support for those re-entering society.\n\"We are concerned that the evaluation of eligibility for release appears to give little consideration to the housing, supervision and support-service needs of the individuals who are being returned to their communities: needs that, if not addressed, will only compound the possible health, safety and other risks, both to the communities and to the individuals at issue,\" they wrote in a joint letter.\nB. Colby Hamilton, spokesman for the Mayor's Office of Criminal Justice, said, \"For those in our custody who, upon release, advise they have nowhere to go, we are working with the Office of Emergency Management and the Department of Homeless Services to help find them immediate safe housing. All others are discharged back to the communities and homes from which they came.\"\nIn New York City, housing shelters are overcrowded and potentially dangerous. The city reported five deaths from coronavirus in homeless shelters as of Thursday.\nNew York Gov. Andrew Cuomo ordered the release last week of up to 1,100 parole violators. \"This significant action is being taken in response to a growing number of Covid-19 cases in local jails over the past few days and weeks. Our top priority remains the public health and safety of New Yorkers during this global public health emergency and this measure will further protect a vulnerable population from contracting and transmitting this infectious disease,\" the Department of Corrections and Community Supervision said in a statement.\nIn Monroe County, New York, 51 prisoners were released from the county jail last weekend at the direction of the New York State Division of Parole. Eight of those inmates classified as sex offenders and 12 of them classified as \"transient population\" and were provided rooms at nearby hotels, according to the county's sheriff's office.\nNot everyone is on board\nThe release didn't go smoothly. Bill Reilich, town supervisor of Greece, New York, called it the wrong decision and pressed for the removal of the released sex offenders housed in his town. He won . The former inmates were relocated.\nThe five districts attorneys in New York told the mayor's office they learned that some prisoners on the lists of who could be released had histories of domestic violence and sex offenses, something they were assured would not happen.\nSimilar concerns spilled out into the open in St. Louis after the state attorney general accused the circuit prosecutor with releasing people charged with violent felonies, according to local news outlet KSDK . The circuit prosecutor said the attorney general mischaracterized her actions.\nIn New Jersey, last week more than 700 people were released after the chief judge of the State Supreme Court in New Jersey brokered a unique agreement with the state attorney general, county prosecutors association, public defender's office and American Civil Liberties Union's local chapter. The agreement would cover inmates in the county jails who are sentenced to less than a year for charges ranging from drunk driving, drug offenses, shop lifting, or low level assault charges.\nBefore inmates could be released, according to the judge's order, they needed to work with the parties to develop a housing plan.\nAlexander Shalom, senior supervising attorney and director of Supreme Court Advocacy, for the ACLU NJ, who co-brokered the deal, said even though they have a process \"that doesn't mean is working perfectly. We don't want people going to traditional shelters but there are short term housing and hotels. There are options out there, I don't know if there are enough options out there.\"\nStill he said cities and states still need to address the health risk in prisons and jails. \"It is not hyperbolic to say that prisons, jails and detention centers will be incubators for this virus and people will die if we can't thin out the populations.\"\nFor John Mele, he was placed in a Howard Johnson hotel not far from Newark airport for six nights. He walks a mile to catch a bus to head downtown where he can find food. He's hoping to be granted an extension to stay at the hotel a little while longer until he can get back on his feet and locate an apartment for him and his girlfriend.\nBut even that has its challenges.\n\"A lot of people that I've called,\" said Mele, \"are not letting people look at apartments no more.\"", "url": "https://www.cnn.com/2020/04/04/politics/freed-inmates-challenges-coronavirus/index.html"}