{"authors": ["Sandee Lamotte"], "date_download": "2020-05-04 16:04:15", "date_modify": "2020-05-04 16:04:15", "date_publish": "2020-03-25 08:52:27", "description": "The coughs, the fever, the shortness of breath: You've called your health provider and think you might have symptoms of coronavirus and need to go into quarantine. Now what do you do?", "filename": "2020_03_25_health_how-to-pr_d022c819f305bab4b5ed5ff01cdaa3ab_index_1588608255.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200320110619-coronavirus-animation-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_25_health_how-to-pr_d022c819f305bab4b5ed5ff01cdaa3ab_index_1588608255.html", "title": "Coronavirus: What to do if you or a loved one has symptoms", "title_page": "What to do if you or a loved one have coronavirus symptoms  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) It's a scenario all too many of us are facing -- or will soon face.\nYou or a loved one has a mild fever, body aches, the start of a nagging, dry cough. Food doesn't taste good nor smell as it once did. Maybe you have shortness of breath or struggle to breath deeply.\nYou've called your doctor, and you are suddenly face-to-face with the scary reality of Covid-19.\nWhat happens next depends on your specific circumstances. If you are having trouble breathing or are elderly and fragile, you may be hospitalized and tested for the virus.\nIf you're not in immediate danger but potentially higher risk -- you have underlying health conditions, such as diabetes, hypertension or lung issues; you're over 60; or you are immune-compromised -- you may be told to closely monitor your symptoms but shelter at home.\nThe rest of us with symptoms but no additional known risk factors will also certainly be told to stay home, rest and drink plenty of fluids, all while keeping a close eye on how we feel.\n\"People who are mildly ill with Covid-19 are able to recover at home,\" the US Centers for Disease Control and Prevention says. \"Do not leave, except to get medical care.\"\nBe sure to get care if you feel worse or you think it is an emergency, the CDC adds, but call first. And don't use public transportation, ride-sharing or taxis to get there.\nNow what? Are you prepared to take care of yourself if you're alone? What can you do to protect other family members who have been exposed and will have to stay home with you?\nPrepare in advance\nPreparation is the key to a good plan.\nthe emergency numbers handy. It should include your health care provider, local public health department, local hospital and ambulance service. Before anyone in your family or community gets sick,the CDC suggests checking in with loved ones, relatives, neighbors and friends to exchange phone numbers and emails and to find out if anyone will have special needs if they get sick. Have a list of your ownemergency numbers handy. It should include your health care provider, local public health department, local hospital and ambulance service.\nHopefully, you've been following standard hygiene practices. These are behaviors we should be doing daily, automatically, to protect ourselves from germs, colds and flu:\nAvoid touching your eyes, nose and mouth with unwashed hands; cough and sneeze into elbows or tissues that you immediately throw away, and regularly wash, wash, wash those hands with warm water and lots of soapy bubbles.\nThe CDC says you should also be cleaning frequently touched surfaces daily with a regular household cleaner followed by a disinfectant. In addition to bathroom surfaces, tables and countertops, don't forget light switches, faucets and sinks, cabinet handles, doorknobs, phones and keyboards.\nSocial distancing is critical to containing the virus; stay and work from home if that's possible, and limit contact with others -- no cookouts, no play-dates, no face-to-face dates.\nexercise, stay at least 6 feet away from others. (Make sure you can eyeball how long When you do leave for life's necessities, such as food and outdoorexercise, stay at least 6 feet away from others. (Make sure you can eyeball how long six feet actually is .)\nParents and guardians should plan well in advance by setting up a structure in which all kids and potential caregivers know their roles and expectations, said pediatrician Dr. Tanya Altmann, Editor-in-Chief of the American Academy of Pediatrics' book \"Caring for Your Baby and Young Child: Birth to Age 5 and The Wonder Years.\"\n\"Many parents are going to get sick,\" Altmann said. \"So what's the game plan? How are we going to isolate them and who's going to be the backup parent? You need to know what to do so you're not panicked and struggling if one parent gets a fever in the middle of the night.\"\nIf possible, have a designated bedroom and private bathroom ready to use. Stock the room with all relevant forms of entertainment: TV, computer, iPad, books, even games that you could play via FaceTime or Skype.\nSpeaking of planning, here's a list of some basic supplies to have on hand:\nA working thermometer to monitor fever, which is considered to be 100 degrees Fahrenheit (37.7 degrees Celsius), and a method to clean it, such as Isopropyl alcohol.\nFever reducing medications, such as acetaminophen.\nA box of rubber or latex disposable gloves and face masks. Face masks are for the sick and caregivers only -- they are in short supply and should not be used by those who are not sick, the CDC says.\nA 60- or 90-day supply of necessary prescription medicines.\nRegular soap and 70% alcohol-based hand sanitizer (antibacterial soap isn't necessary if you wash properly, and that way you won't will contribute to the world's growing antibiotic-resistant superbugs) .\ncontribute to the world's growing antibiotic-resistant superbugs) Tissues to cover sneezes and coughs. But there's really no need to hoard toilet paper -- this is a respiratory disease.\nRegular cleaning supplies, kitchen cleaning gloves and trash can liners.\nDisinfectant cleaning supplies -- the CDC suggests picking from a list that meets the virus-fighting standards of the US Environmental Protection Agency, but says you can also make your own version by using 1/3 cup unexpired bleach per gallon of water or 4 teaspoons bleach per quart of water. Never mix bleach with ammonia or any other cleanser -- it produces toxic gases.\nIsolate yourself or loved one\nOnce your healthcare provider tells you Covid-19 is suspected or confirmed, the CDC says you or your loved one should stay in a separate room (preferably with a private bathroom) away from other people in the household.\nIf you live alone, that's not difficult. Your challenge is to monitor your symptoms and care for yourself when you're not feeling well. Be sure to have a plan in place to deliver food and medications, and find someone who can be responsible for virtually checking in on you on a regular basis.\nIf you are part of a family, staying isolated can be challenging, especially if it's a small space or there are children in the home.\n\"If you have somebody at home who's older or immunocompromised, you may want to isolate them to one side of the house so the kids and everybody else aren't around them on a regular basis,\" Altmann said.\n\"If it's a child that you have to care for, then you may have to make the decision to isolate one adult with the child,\" she added. \"That adult would be caring for the child, and the other adult would be responsible for the rest of family.\"\nAnd of course all of this will be extremely difficult for a single parent \"who might be the only one,\" said pediatrician Dr. Jenny Radesky, a spokesperson for the American Academy of Pediatrics.\n\"Know who your neighbors are, even what your neighborhood social network might be,\" said Radesky, an assistant professor of pediatrics at the University of Michigan. \"You may not be that close interpersonally, but someone may be willing to do a grocery store drop-off, or pick-up medications because we're all in this together.\"\nThe rest of the family should practice isolation as well, Radesky added.\n\"Unfortunately you need to keep the whole household under isolation,\" she said. \"The patterns of Covid-19 spread suggest that clusters of people who live close together are at highest risk of getting it from one another. If children are part of that household, they may show minimal symptoms but still be contagious.\"\nCover up and disinfect\nIf you're sick, the CDC says to use a face mask around other people, such as when going to the doctor or hospital.\n\"If you are not able to wear a face mask (for example, because it causes trouble breathing), then you should do your best to cover your coughs and sneezes, and people who are caring for you should wear a face mask if they enter your room,\" the CDC says.\nIf you are running short on face masks, or don't have any because of hoarding, try to protect the caregiver as best you can, the CDC says.\nAltmann stresses maximizing isolation and protective actions.\n\"You can have a healthy person leave the sick one food and drinks at the door, and then go wash their hands,\" Altmann explained. \"Wear gloves to pick up the empty plates, take them back to the kitchen and wash them in hot water with soap, or preferably with a dishwasher, and wash your hands again.\"\nDo not share drinking glasses, cups, forks or other eating utensils or dishes, the CDC says. Don't share towels or bedding with other people in your home. When doing laundry, don't shake the sick person's dirty clothes to \"minimize the possibility of dispersing virus through the air.\"\nAnd caregivers should wear disposable gloves when handling that dirty laundry, the CDC says, throwing them away after each use.\n\"If using reusable gloves, those gloves should be dedicated for cleaning and disinfection of surfaces for Covid-19 and should not be used for other household purposes. Clean hands immediately after gloves are removed,\" the CDC advises.\nDedicate a lined trash can for any tissues or other paper or disposable products used by a sick person, the CDC says, adding that caregivers should \"use gloves when removing garbage bags, handling and disposing of trash. Wash hands after handling or disposing of trash.\"\nOne last, very important thing: Call 911 immediately if you or your loved ones have any of these symptoms: increased or sudden difficulty breathing or shortness of breath; a persistent pain or pressure in the chest; and any sign of oxygen deprivation, such as new confusion, bluish lips or face, or you can't arouse the sick person.\nWhile these are key danger signs, this is not an exhaustive list, says American Medical Association president Dr. Patrice Harris, so call if anything concerns you.\n\"If the symptoms don't get better or they worsen you should call your health care provider, the urgent care or the emergency department,\" Harris said. \"And if the shortness of breath is severe, immediately call 911.\"\nKeeping everyone else from getting sick\nTo be clear: Everyone in the house needs to isolate themselves from the outside world as much as possible.\n\"I would recommend that families find friends who can drop off essential groceries or medications, not go to work, and not play with other children -- even outside,\" Radesky said.\n\"If you don't have friends who can drop off groceries or essential items, see if the local stores can deliver the items for you -- I'm sure they would appreciate not having a potential Covid-19 exposure in their store,\" she added.\nIf a family member without symptoms believes it is absolutely essential to go outside to the grocery store, pharmacy or to check on a family member, be aware that you may well be contagious and anything you touch could transfer the virus -- even without symptoms,\n\"I would urge people not to do this,\" Radesky said. \"The way we will beat this virus is by reducing the number of times that each infected person transmits the virus to another person. So the more you can do to stop the virus in its tracks -- in other words, your family doesn't give it to anyone else, and you don't bring it to your workplace or a local store -- the sooner we will be done with this!\"\nTo reduce virus transfer inside your home, try to keep an air flow in the rest of the home with opened windows or doors with screens, or with air conditioning. Have everyone wash their hands at every opportunity. Clean and disinfect all those commonly shared surfaces -- don't forget the refrigerator and microwave handles!\nKeep everyone as stress free as possible -- a hard task for sure -- and focus on healthy eating, regular exercise and quality sleep.\nEven though there is no indication that pets can give or get Covid-19, the CDC suggests keeping pets away from sick people.\n\"Since animals can spread other diseases to people, it's always a good idea to practice healthy habits around pets and other animals,\" the CDC says. \"If you must care for your pet or be around animals while you are sick, wash your hands before and after you interact with pets.\"\nWhen is your quarantine over?\nA recent study that analyzed data coming from China found the incubation period for the virus can range from 1 to 14 days, with 95% of the patients experiencing symptoms within 12.5 days of contact.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nThat falls in line with current US recommendations that require a two-week quarantine for anyone exposed to the virus. Keep this in mind when estimating an isolation period for family members who may have become sick after a loved one.\nAs for the person with the coronavirus symptoms, the CDC says you may be well when you \"no longer have a fever (without the use medicine that reduces fevers), and other symptoms have improved (for example, when your cough or shortness of breath have improved), and you received two negative tests in a row, 24 hours apart.\" Check with your health care provider for full instructions.\nThese are scary times, but hopefully these tips will help ease your anxiety and prepare you and your family for the worst, while hoping and striving for the best.", "url": "https://www.cnn.com/2020/03/25/health/how-to-prepare-for-coronavirus-quarantine-wellness/index.html"}