{"authors": ["Mary Clare Jalonick"], "date_download": "2020-05-04 20:20:18", "date_modify": "2020-05-04 20:20:18", "date_publish": "2020-04-08 21:05:27", "description": "WASHINGTON (AP) — Republican Sen. Kelly Loeffler of Georgia said Wednesday that she will liquidate her stock portfolio and move the money to investment funds after coming under scrutiny for...", "filename": "_546bae3a28f1710613d931d73d30f23c_1588623618.html", "image_url": "https://storage.googleapis.com/afs-prod/media/0e327561f0774f4a81b201ff32a16573/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_546bae3a28f1710613d931d73d30f23c_1588623618.html", "title": "Sen. Loeffler to sell stock holdings after trading scrutiny", "title_page": "Sen. Loeffler to sell stock holdings after trading scrutiny", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WASHINGTON (AP) —\nRepublican Sen. Kelly Loeffler of Georgia said Wednesday that she will liquidate her stock portfolio and move the money to investment funds after coming under scrutiny for transactions she and her husband made just before the coronavirus sent markets reeling.\nLoeffler and her husband dumped substantial portions of their portfolio and purchased new stocks, including as much as $415,000 in DuPont de Nemours, a chemical company that manufactures protective equipment in exceedingly high demand because of the coronavirus pandemic. Loeffler’s husband, Jeffrey Sprecher, is chairman of the New York Stock Exchange.\nThe sales and purchases came as Congress was receiving briefings on the seriousness of the then-burgeoning epidemic. Loeffler has said that she had no involvement in the trades and that they were managed by third-party advisers.\nOn Wednesday, Loeffler said she would sell her holdings in individual stocks and move the investments into mutual and exchange-traded funds to avoid the political distraction. She said she has “not profited or attempted to profit” in her few months in the Senate.\nLoeffler was appointed to the Senate in January by Georgia’s GOP governor after the retirement of Republican Sen. Johnny Isakson.\n“Amid this health crisis, the temptation to circulate lies and misinformation is too great for the media and my political opponents,” Loeffler said. “That is why I’m taking steps to remove this temptation so that we can turn our focus back to where it belongs: on combating COVID-19 and restoring our country to health and economic recovery.”\nThe Georgia senator is up for her first election this year and faces a competitive primary challenge from Republican Rep. Doug Collins. He accused her of profiting while “people are losing their jobs, their businesses, their retirements.”\nLoeffler is not the only senator to come under fire for stock transactions made just before the market started to drop. Senate Intelligence Committee Chairman Richard Burr, R-N.C., whose sales of as much as $1.7 million in stocks have come under the most scrutiny, requested an ethics review of himself after it was revealed that his wife sold between roughly $600,000 and $1.7 million in more than 30 transactions in late January and mid-February. Burr, who has denied trading on inside information, has been contacted by the FBI.\nLoeffler and her husband offloaded anywhere between about $1.1 million and $2.8 million in stock before the economy started to falter. They also invested between $315,000 and $650,000 into real estate investment firm Blackstone, tech company Oracle and Citrix Systems — a company that develops workplace and telecommuting software that could be in high demand as people have sheltered at home during the virus.\nThe senator’s office says her investments are managed by third-party advisers at Morgan Stanley, Goldman Sachs, Sepio Capital and Wells Fargo, an arrangement she put in place “to insulate ourselves and our colleagues from these sorts of unfounded accusations.” The advisers buy, sell, and option stocks on her family’s behalf, her office said.\n“Let me be clear: I do not have to do this,” Loeffler said. “I’m doing this because this transparency is being abused for political gain, and the steps I’ve taken to distance myself from these accounts are being ignored.”", "url": "https://apnews.com/546bae3a28f1710613d931d73d30f23c"}