{"authors": ["Zachary Cohen"], "date_download": "2020-05-04 16:28:02", "date_modify": "2020-05-04 16:28:02", "date_publish": "2020-04-07 16:58:35", "description": "President Donald Trump has removed the acting inspector general for the Defense Department, Glenn Fine, from his post -- a decision that means Fine will no longer chair the Pandemic Response Accountability Committee tasked with overseeing $2 trillion in emergency coronavirus funding.", "filename": "2020_04_07_politics_trump-s_fb19cf3438d09035e4cdde5463eb5ff6_index_1588609682.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407115927-trump-signs-stimulus-package-0327-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_trump-s_fb19cf3438d09035e4cdde5463eb5ff6_index_1588609682.html", "title": "Trump removes independent watchdog tasked with overseeing coronavirus emergency funds", "title_page": "Trump removes independent watchdog tasked with overseeing coronavirus emergency funds  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump has removed the acting inspector general for the Defense Department, Glenn Fine, from his post -- a decision that means Fine will no longer chair the Pandemic Response Accountability Committee tasked with overseeing $2 trillion in emergency coronavirus funding.\nLate last month, a group of independent federal watchdogs tapped Fine, a career official, to lead the group tasked with preventing \"waste, fraud, and abuse\" in the use of coronavirus relief money.\nIt's the most recent effort by Trump to undermine federal oversight.\nLate Friday night, the President fired the intelligence inspector general who reported a whistleblower's complaint to Congress, thus touching off the impeachment investigation. On Monday, Trump repeatedly questioned the motives behind an in-depth investigation by the Health and Human Services inspector general into supply shortages affecting the coronavirus response.\nA Defense Department spokeswoman did not explain why Fine was removed from the acting inspector general position, but she did explain that it meant he was no longer eligible to stay on the accountability committee, which is limited to inspector generals and acting inspector generals.\n\"The DoD OIG is still part of the Pandemic Response Accountability Committee,\" spokesperson Dwrena K. Allen told CNN, using the acronym for the defense department and the inspector general position. \"Mr. Fine is no longer serving as the Chair because he is no longer serving in an acting IG capacity.\"\n\"Glenn Fine reverts to his position as the Principal Deputy Inspector General. He remains focused and committed to the important mission of the DoD OIG,\" Allen added.\nPolitical appointees\nIn an interview with CNN on Tuesday, House Speaker Nancy Pelosi slammed Trump's decision to remove Fine as chairman of the Pandemic Response Accountability Committee.\n\"This is really a problem,\" Pelosi told CNN's Anderson Cooper, adding that Trump believes he can exercise his own oversight over the implementation of the stimulus package and is \"sending in some of his loyalists.\"\nTrump has designated Sean W. O'Donnell, who is the Environmental Protection Agency Inspector General, to serve as the Defense Department's acting inspector general in addition to his current duties at the EPA, according to Allen. On Monday, Trump also nominated Jason Abend to be the Pentagon's Inspector General, she said.\nLast week, Trump announced his nominees for multiple Inspector General positions, including his nominee to be the Special Inspector General for Pandemic Recovery within the Department of Treasury. That role was established as a part of the Coronavirus Aid, Relief, and Economic Security Act or CARES Act, which was signed into law last month and mandated the accountability committee.\nIf confirmed by the Senate, Trump's three appointees will become part of the nine-member Pandemic Response Accountability Committee and play a role in overseeing stimulus funding.\nOther inspectors general on the committee will come from agencies including the departments of Education, Labor, Homeland Security, Justice, Health and Human Services and the Small Business Administration.\nThe panel of independent watchdogs will choose the accountability committee's new chair. The group of inspectors general did not immediately respond to CNN's request for comment and it's unclear whether a new chair has been chosen.\nDemocrats outraged\nThe Democratic chairwoman of the House Oversight Committee, Rep. Carolyn Maloney of New York, called Fine's removal \"a direct insult to the American taxpayers -- of all political stripes -- who want to make sure their tax dollars are not squandered on wasteful boondoggles, incompetence, or political favors.\"\n\"President Trump has been engaged in an assault against independent Inspectors General since last Friday in order to undermine oversight of his chaotic and deficient response to the coronavirus crisis,\" she said.\nMaloney noted that Fine \"was fully supported by Congress and the Inspector General Community. President Trump's actions are a blatant attempt to degrade the independence of Inspectors General who serve as checks against waste, fraud, and abuse.\"\nSenate Minority Leader Sen. Chuck Schumer also slammed the decision in a statement Tuesday.\n\"President Trump is abusing the coronavirus pandemic to eliminate honest and independent public servants because they are willing to speak truth to power and because he is so clearly afraid of strong oversight,\" he said.\n\"President Trump's corrupt action to sideline Acting Inspector General Glenn Fine, who was newly appointed as chair of the Pandemic Response Accountability Committee, only strengthens Democrats' resolve to hold the administration accountable and enforce the multiple strict oversight provisions of the CARES Act,\" the New York Democrat added.\nLatest attack\nFine's removal marks Trump's latest attack on the world of independent federal oversight.\nThe former intelligence community inspector general, Michael Atkinson, said in a statement that be believed Trump ousted him for doing his job.\n\"It is hard not to think that the President's loss of confidence in me derives from my having faithfully discharged my legal obligations as an independent and impartial Inspector General, and from my commitment to continue to do so,\" Atkinson wrote.\nAtkinson said he was \"disappointed and saddened\" by Trump's decision to oust him, while the President said that Atkinson did not have his \"fullest confidence.\"\nTrump defended his decision on Saturday, charging that Atkinson \"did a terrible job, absolutely terrible\" and \"took a fake report and gave it to Congress.\"\nThe President struck a similar tone about the Health and Human Services watchdog during Monday's coronavirus task force briefing at the White House.\nTrump repeatedly suggested, without evidence, that the HHS watchdog report detailing hospital shortages was politically motivated when pressed on its findings that the nation's hospitals are dealing with \"severe\" and \"widespread\" shortages of needed medical supplies, hampering the ability to test and respond to the coronavirus pandemic adequately and protect medical staff.\nHe continued to lash out against the HHS inspector general via Twitter on Tuesday.\n\"Why didn't the I.G., who spent 8 years with the Obama Administration (Did she Report on the failed H1N1 Swine Flu debacle where 17,000 people died?), want to talk to the Admirals, Generals, V.P. & others in charge, before doing her report. Another Fake Dossier!\" Trump tweeted.\nHHS did not immediately respond to CNN's request for comment.\nDemocratic lawmakers have also raised concerns about what they view as a lack of oversight conducted by the Trump-appointed IG for the Department of Homeland Security amid the outbreak.\nLate last month, the chairs of the House Homeland Security and Oversight and Reform committees each sent letters to Joseph Cuffari, the Inspector General of the Department of Homeland Security.\nThe letters request information and documents regarding numerous shortcomings in the review by the DHS IG of the deaths of two children in the custody of Customs and Border Protection, as well as issues with Cuffari's leadership as Inspector General -- including his refusal to testify personally before Congress and concerns that he has distanced himself from and delayed critical reports.\nThe Oversight Committee highlighted Cuffari's slow pace in issuing reports, including several forthcoming reports -- with no timeline for release -- on the department's processing of asylum seekers, conditions in immigration detention facilities, and secret Border Patrol Facebook groups with offensive posts.\nCuffari, who formerly served as a military and veterans affairs adviser to Arizona Gov. Doug Ducey, was appointed by Trump to the role as DHS IG last year, at a time when the administration's immigration policies and practices at the southern border had come under intense scrutiny.\nThis story has been updated with additional developments Tuesday.", "url": "https://www.cnn.com/2020/04/07/politics/trump-sidelines-pentagon-watchdog-coronavirus-funds/index.html"}