{"authors": ["Scott Sonner"], "date_download": "2020-05-04 20:19:38", "date_modify": "2020-05-04 20:19:38", "date_publish": "2020-04-08 21:23:28", "description": "RENO, Nev. (AP) — The state Board of Regents has abandoned plans to appoint an acting president at the University of Nevada, Reno while it searches for a permanent replacement for outgoing...", "filename": "_4a21242d65624eaef72e2b64cecb3d7e_1588623578.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4a21242d65624eaef72e2b64cecb3d7e_1588623578.html", "title": "UNR President Johnson postpones departure until Dec. 31", "title_page": "UNR President Johnson postpones departure until Dec. 31", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "RENO, Nev. (AP) — The state Board of Regents has abandoned plans to appoint an acting president at the University of Nevada, Reno while it searches for a permanent replacement for outgoing President Marc Johnson after Johnson agreed to postpone his resignation until Dec. 31.\nJohnson announced late last year he planned to step down at the end of June and transition to the university’s faculty.\nThe regents said in a statement April 1 — the day same day ex-Gov. Brian Sandoval announced his candidacy for the job — that the board planned to appoint an acting president to serve at least until September because Johnson couldn’t continue through the summer.\nBut the regents said Tuesday the board was changing course and plans to consider extending Johnson’s contract through Dec. 31 at an emergency meeting on Friday.\nUNR staff, faculty and employees were informed in a letter Monday that Johnson’s change of heart stemmed from Gov. Steve Sisolak’s announcement he’ll be seeking recommendations from leaders of state agencies and state institutions like the one Johnson leads as Sisolak considers budget cuts in response to the coronavirus pandemic.\nThe extension would “provide the university with leadership continuity and stability until a permanent president is chosen,” according to Johnson’s Chief of Staff Patricia Richard and Faculty Senate Chairman Brian Frost.\nThe Regents plan to select Johnson’s successor Sept. 17 following three days of interviews with finalists.\nA 1986 graduate of UNR, Sandoval became a favorite for the presidency the day he announced he was leaving his job at MGM Resorts to pursue the position. The moderate Republican left the governor’s office in January 2019 after serving the maximum two terms.\nThe board also voted Tuesday to extend the existing contract of outgoing University of Nevada, Las Vegas President Marta Meana through December. It plans to pick her successor Sept. 3, following three days of finalist interviews.\n“The searches were delayed to ensure an open and transparent process with full involvement of the campus and community constituencies and in consideration for the health and well-being of all those involved,” Regents Chairman Jason Geddes said Tuesday.", "url": "https://apnews.com/4a21242d65624eaef72e2b64cecb3d7e"}