{"authors": ["Haley Byrd", "Manu Raju"], "date_download": "2020-05-04 16:55:11", "date_modify": "2020-05-04 16:55:11", "date_publish": "2020-04-08 21:24:11", "description": "Rep. Thomas Massie indicated Wednesday that he will oppose any attempt to pass new funding for small business loans through the House by unanimous consent or voice vote, a threat that follows his previous objection to quick passage of a $2 trillion Covid-19 stimulus deal.", "filename": "2020_04_08_politics_massie-unanimous-consent_index_1588611311.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327150117-thomas-massie-coronavirus-bill-house-floor-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_massie-unanimous-consent_index_1588611311.html", "title": "Kentucky Republican again threatens to block quick passage of", "title_page": "Kentucky Republican again threatens to block quick passage of  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Rep. Thomas Massie indicated Wednesday that he will oppose any attempt to pass new funding for small business loans through the House by unanimous consent or voice vote, a threat that follows his previous objection to quick passage of a $2 trillion Covid-19 stimulus deal.\nThe Kentucky Republican's comments complicate the path forward for the next coronavirus aid package under consideration by Congress, which has already been bogged down by disagreements between top Democrats and Republicans.\nThe White House has requested an additional $251 billion for a small business loan program that was included in the $2.2 trillion stimulus bill last month, which would boost the program to a whopping $600 billion. Senate Republicans are pushing to quickly approve the funding, while Democrats are calling for more funding for state and local governments, hospitals, and food stamp programs.\nHouse Speaker Nancy Pelosi told members on a conference call Wednesday afternoon that congressional leaders were aiming to pass any deal struck with Republicans by unanimous consent or voice vote, two sources familiar with the call told CNN. Unanimous consent and voice votes are commonly used in the House for expedited passage of uncontroversial measures. Any one member can object to a unanimous consent or voice vote request.\n\"Once again they're recommending that just let Nancy Pelosi pass it on her own, that we can all stay home,\" Massie said of a potential measure to boost funding for the small business loan program during an interview on Fox Business Wednesday afternoon. \"And I'm saying that's not going to fly. It doesn't fly with the Constitution, it doesn't fly with accountability to the taxpayers.\"\nRead More", "url": "https://www.cnn.com/2020/04/08/politics/massie-unanimous-consent/index.html"}