{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:26:26", "date_modify": "2020-05-04 20:26:26", "date_publish": "2020-04-08 18:20:47", "description": "The Louisiana pastor who preached courage from his deathbed. The nun who always insisted that her order “get down to brass tacks,” and help people. The rabbi who made sure his students did not...", "filename": "_38cf1d543a51c062d51632620df6ee86_1588623986.html", "image_url": "https://storage.googleapis.com/afs-prod/media/6150cef51e5946f8a69951785ae50664/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_38cf1d543a51c062d51632620df6ee86_1588623986.html", "title": "Dreaded uptick worldwide of dead spiritual leaders", "title_page": "Dreaded uptick worldwide of dead spiritual leaders", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This undated photo provided by Sister Maria Mabel Spagnuolo shows her, left, with Sister Maria Ortensia Turati. On March 16, 2020, Turati, who was the former mother general of the Little Missionary Sisters of Charity in Tortona, Italy, died at age 88 as a result of the COVID-19 coronavirus. (Courtesy Sister Maria Mabel Spagnuolo via AP)\nThis undated photo provided by Sister Maria Mabel Spagnuolo shows her, left, with Sister Maria Ortensia Turati. On March 16, 2020, Turati, who was the former mother general of the Little Missionary Sisters of Charity in Tortona, Italy, died at age 88 as a result of the COVID-19 coronavirus. (Courtesy Sister Maria Mabel Spagnuolo via AP)\nThe Louisiana pastor who preached courage from his deathbed. The nun who always insisted that her order “get down to brass tacks,” and help people. The rabbi who made sure his students did not lack clothes or books.\nEven as parishioners, followers and the faithful seek solace and strength from religious leaders in a time of pandemic, the list of those who have died includes more and more clergymen and women.\nAs of April 6, Avvenire, the newspaper of the Italian bishops’ conference listed 96 priests among the dead. The dreaded daily uptick is reflected worldwide as spiritual leaders in the Middle East, Europe and the U.S. are among the casualties.\nHere are a few of the religious leaders who have died, leaving gaping holes in the fabric of faith.\n___\nDays before COVID-19 killed him, a 64-year-old Louisiana minister sent a livestreamed Sunday message from his bed in a hospital isolation ward: Do not be afraid, be faithful and praise God.\n“I believe that all is well and that it is well with my soul,” said the Rev. Dr. Ron Hampton, pastor at New Vision Community Church, a Free Methodist Church in Shreveport, Louisiana. “I keep a praise handy in my heart. I keep a word and I just continue to try to do the Lord’s will even from a hospital bed.”\nTwo days later, he learned that he had the disease caused by the new coronavirus. The following night, he was dead.\n“I don’t think he let it shake him,” said his wife, Elsie Hampton. “I didn’t get to see him. But I saw his video.”\n—By Janet McConnaughey\n___\nThe newly ordained Rev. Franco Minardi arrived in Ozzano Taro, a farming town of 1,200 people a dozen miles from his birthplace in Italy’s most fertile plain, in 1950.\nMinardi fought to enkindle the Catholic faith in youth -- and he never gave up for the 70 years he was Ozzano’s parish priest, until coronavirus killed him at 94.\nHe built the tennis court, a games room, and what is still the local gathering spot, the theater where he projected the town’s first movies in the mid-1950s to an audience sitting on bins from the grape harvest.\n“Don Franco wanted to keep people close to the church, in order to bring them to Mass,” said the retired postmistress and town chronicler, Giuliana Savi, by phone from Ozzano, still in lockdown. “Sometimes it didn’t work, but he tried.”\nMinardi brought the same energy to his church, restoring it and re-installing bells.\n“Mass wasn’t a 35-minute affair, it was celebrated solemnly, with singing. He reprimanded us if we sped through the readings,” Savi recalled.\n—By Giovanna Dell’Orto\n___\nIn mid-March, Sister Maria Mabel Spagnuolo took to YouTube to share the bad news with the 600 nuns in her order: Sister Maria Ortensia Turatir had died, one of one of six nuns killed by coronavirus in a convent in the northern Italian town of Tortona.\n“It’s as if a person disappeared in an instant,” Spagnoulo later told AP by phone, a particularly bitter parting from the cheerful 88-year-old nun who had carried out her vocation to serve society’s most marginalized by getting effortlessly close to them.\nFull Coverage: Religion\nOriginally from Lombardy, Turati trained as a social worker, served as mother general of the Little Missionary Sisters of Charity from 1993-2005, and traveled the world founding missions in the Philippines and Ivory Coast. She led her order with its many schools in Chile and helped reform the nuns’ formation practices.\nFrom Rome to Madagascar to Peru, the sisters are stitching masks, serving in hospitals and providing food and water to those without access to either -- as if still heeding Turati’s trademark advice: “I don’t want pious exhortations. Let’s get down to brass tacks.”\n—By Giovanna Dell’Orto\n___\nMore than five decades into his career, the Rev. Marc. Frasez expressed the desire to keep working past the retirement age of 75, or at least to delay retirement and continue serving his parish.\nHe died of COVID-19 at 74, leaving behind memories of a priest committed to his work, with a sensitive soul and a passion for painting.\nOrdained as priest 49 years ago, Frasez was an enduring figure in the Catholic community in the Versailles region in the suburbs of Paris.\nSince 2007, he had served the community as parish priest of Saint-Germain de Paris in Fontenay-le-Fleury in and beyond the small stone church with trademark enthusiasm and warmth.\nMarc, as he was known to his colleagues and friends, had a real artistic flair, devoting most of his free time to painting,” said his colleague Monseigneur Bruno Valentin, Auxiliary Bishop of Versailles.\nHe was, said Valentin, an “original and sensitive man.”\n—By Thomas Adamson\n___\nAyatollah Hashem Bathaei Golpayegani was a Shiite cleric, moderate by Iranian standards. He was known chiefly as one of the representatives for Tehran in the Assembly of Experts, an all-cleric body that will choose the successor of the Supreme Leader Ayatollah Ali Khamenei.\nHe was a learned man. He earned two PhDs, studied in Qom (Iran’s Vatican City and a home to major Shiite seminaries. The late Ayatollah Ruhollah Khomeini, founder of Islamic Republic, was one of his teachers. He taught law at a university level.\nIn an undated video, he accused the United States of creating the coronavirus to fight China. It appeared he was sick but he believed he would heal.\nOn March 16th, he died.\n—By Amir Vahdat\n___\nRabbi Yisroel Friedman was known as a scholar of the Talmud, the ancient text that forms the foundation of Jewish law. But his students say his biggest passion was more down-to-earth.\nFriedman helped students apply one of Judaism’s most sacred documents to everyday existence, said Rabbi Mendel Rubin, who studied under Friedman at Talmudic Seminary Oholei Torah in Brooklyn.\nWhen he died on April 1 at age 84, Friedman had spent more than 50 years as the top academic at the the seminary in Brooklyn’s Crown Heights, a center of Hasidic Jewish life in New York City.\nBorn in the former Soviet Union, Friedman came to the United States in 1956. Renowned for his keen intellect, Friedman was an expert hand at analyzing the writings of Rashi, a medieval rabbinical specialist in the Talmud. But, Rubin recalled, the scholar also would make sure to help struggling students,\nRabbi Elyahu Silverberg, who also studied under Friedman in the early 1990s, recalled the late rabbi calling him over one day and asking about his study partner’s worn-out clothes.\nDid the young man need help buying a new suit? The rabbi offered to make that happen.\n—By Elana Schor", "url": "https://apnews.com/38cf1d543a51c062d51632620df6ee86"}