{"authors": ["Analysis Stephen Collinson"], "date_download": "2020-05-04 16:52:39", "date_modify": "2020-05-04 16:52:39", "date_publish": "2020-04-08 04:08:36", "description": "The chaos and confusion rocking President Donald Trump's administration on the most tragic day yet of the coronavirus pandemic was exceptional even by his own standards.", "filename": "2020_04_08_politics_donald-trump-coronavirus_index_1588611159.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407193623-04-coronavirus-briefing-0407-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_donald-trump-coronavirus_index_1588611159.html", "title": "Chaos rocks Trump White House on virus' most tragic day", "title_page": " Trump's White House in chaos on coronavirus' most tragic day - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The chaos and confusion rocking President Donald Trump's administration on the most tragic day yet of the coronavirus pandemic was exceptional even by his own standards.\nTrump set out Tuesday to cement his image of a wartime leader facing down an \"invisible enemy\" at a dark moment as the country waits for the virus to peak and with the economy languishing in suspended animation.\n\"What we have is a plague, and we're seeing light at the end of the tunnel,\" the President said, on a day when a record number of Americans succumbed to the wicked respiratory disease.\nBut instead of putting minds at rest, Trump's wild performance instead put on a display many of the personal and political habits that have defined his tumultuous presidency. It was a troubling spectacle coming at such a wrenching chapter of national life, the kind of moment when Presidents are called to provide consistent, level leadership.\nTo begin with, Trump sparked concern that he will prevent oversight of the disbursement of economic rescue funds by removing a watchdog official responsible for overseeing the $2 trillion package. The move, coming after Trump ousted an intelligence community inspector general last week, was yet another sign that an already impeached President is using the cover of the worst domestic crisis since World War II to further erode constraints on his power.\nTrump's acting Navy secretary quit after an episode in which he called an aircraft carrier captain dismissed for raising the alarm about virus infections among his crew \"stupid.\"\nThen Trump insisted he hadn't seen January memos by a top White House official warning about the pandemic at the same time the President was dismissing it as a threat.\nHe also announced he was placing a \"very powerful hold\" on funding for the World Health Organization , even though it correctly identified the scale of the virus and he didn't. Then moments later, he insisted he did no such thing.\nAdding to the sense of farce, White House Press Secretary Stephanie Grisham was moved out, without ever having given a briefing, on yet another day of staff turmoil. CNN's KFile reported Tuesday that her replacement, Kayleigh McEnany , recently said that thanks to the President, \"we will not see diseases like the coronavirus come here.\"\nTrump's top economic adviser Larry Kudlow admitted that a small business rescue program was off to \"a bad start\" after recipients struggled to register funds, only for the President to celebrate the program's roaring success -- and to credit his daughter Ivanka with personally creating 15 million jobs.\nTo top off a disorientating day in the West Wing, the President presided over an unchained news conference in which among other topics, he lashed out at mail-in voting, making claims about fraud that don't square with the facts, even though he recently cast such a ballot himself. The comment followed extraordinary scenes in Wisconsin, after Republicans blocked the Badger State's Democratic governor from delaying the state's primary over concern that voters could infect one another with the novel coronavirus.\nTrump's daily jousts with the media recreate the adversarial dynamic of his 2016 campaign and much of his earlier presidency and invite his supporters to adopt his narrative of events rather than fact-based critiques of his conduct. This has been a successful device in the past to cement the anti-establishment President with his followers.\nBut a new CNN/SSRS poll Wednesday finds increasing overall concern about Trump's handling of the coronavirus crisis following an initial spike in his ratings in recent weeks.\nA majority of Americans -- 55% -- now say the federal government has done a poor job preventing the spread of the disease in the United States, up eight points in about a week. And 52% say they disapprove of the way Trump is handling the outbreak. As usual, assessments of Trump break on partisan lines. Some 80% of Republicans say the federal government has done a good job, and Trump's approval rating is steady at 44%.\nAlso Wednesday morning, a prominent model that tracks the coronavirus pandemic in the United States has updated its projections to predict that the nation will reach its peak number of daily Covid-19 deaths in four days and its peak use of resources -- such as hospital beds and ventilators -- in three days.\nThe model also predicts that far fewer people -- 60,415 -- than have been previously projected will die due to Covid-19 by August.\nThat model, from the Institute for Health Metrics and Evaluation at the University of Washington in Seattle, previously projected on Tuesday that about 82,000 people would die by August and that the country wouldn't reach peak resource use until next week.\nA dark day in the fight against Covid-19\nIn many ways, it was just another inexplicable day of the Trump presidency.\nTrump did mention Americans grieving the loss of loved ones in his scripted remarks, but the intensity of Trump's clashes with reporters and litany of outrageous claims seemed incongruous with a backdrop of such human tragedy with more than 1,800 deaths reported in a single day.\nThere are, after all, more confirmed cases in the United States than anywhere else in the world -- even if there are some hopeful and preliminary signs that the wave of infections may be beginning to slow in the New York epicenter.\nThe chaos and contradictions coming from the administration do not just raise questions about the White House's current management of the pandemic. They will cause concern because the second stage of the national effort -- reopening the economy and keeping a second wave of infections at bay -- will require focused and subtle leadership that can win the confidence of the nation.\nNo White House has ever faced the task of ensuring such an expansive economic package is properly implemented and does not fall prey to corruption. There is little in the history of the Trump administration that suggests this will go smoothly.\nThe President sparked fresh fears about his capacity to properly oversee previous rescue packages and those to come when it emerged he had removed Defense Department Inspector General Glenn Fine from a post monitoring the stimulus funds.\nThe move prompted Democrats to warn that Trump is seeking to oversee the package himself. Trump had already warned he will ignore a provision in the bill requiring the special inspector general to report to Congress on the handling of the funds.\nHis dismissal of Fine was the latest swipe against the structures of government meant to hold him accountable -- that peaked with his defiance of the impeachment inquiry.\nOn Monday, Trump personally attacked a Health and Human Services inspector general who uncovered massive shortages of vital protective equipment at hospitals battling Covid-19.\nOn Friday night, the President fired the intelligence community inspector general who alerted lawmakers to a report about his pressure on Ukraine to dig up dirt on his Democratic foe Joe Biden.\nTrump dismisses Navarro memos\nWith the pandemic taking a tighter grip on the United States, Trump has taken vigorous steps to cover up for his multiple statements earlier this year downplaying the virus.\nThe question of his responsibility for a lack of preparation for the crisis intensified on Tuesday when The New York Times revealed that a top economic official, Peter Navarro , had written a memo to the President in January warning coronavirus could become a \"full blown pandemic\" causing trillions of dollars in economic damage and risking the health of millions of Americans.\nThe revelation undercut the President's repeated declarations that nobody could have foreseen the consequences of the virus. It also left him in a tricky spot. Either he had to admit that he had seen the warning, or if he said it didn't reach him, he would paint a picture of dysfunction at the White House.\nHe did neither, seeking to foster misinformation and confusion around the document designed to disguise his own culpability.\nThe President maintained that he did not see the memo or memos until several days ago.\n\"I didn't see them. I didn't look for them either,\" the President said, then argued falsely he had reached the same conclusion as Navarro, citing his decision to stop flights from China. In fact, Trump was downplaying the impact of the virus as recently as early last month.\nWhen asked why he did not level with Americans about the potential impact of the crisis if his unexpressed thoughts aligned with Navarro, Trump said: \"I'm not going to go out and start screaming, this could happen.\"\n\"I'm a cheerleader for this country. I don't want to create havoc and shock.\"\nTrump nominates a new foil -- the WHO\nUnlike the President, the World Health Organization has warned for weeks about the gravity of coronavirus.\nThe WHO declared a Public Health Emergency of International concern on January 30 after sending a team to Wuhan and to meet Chinese leaders in Beijing.\nOn the same day, at a rally in Michigan, the President said of the virus, \"We think we have it very well under control.\"\nBut on Tuesday, the President lashed out at the global health body, claiming it had underplayed the threat of the virus and that he had got it right.\n\"We're going to put a hold on money spent to the WHO. We're going to put a very powerful hold on it,\" the President said in his briefing.\n\"They called it wrong. They missed the call. They could have called it months earlier,\" Trump said.\n\"It's a great thing if it works but when they call every shot wrong that's no good,\" he said, accusing the WHO of being biased towards China, which Republicans have accused of trying to cover up the virus.\nGiven the President's long timeline of false statements and predictions, that must go down as one of the most audacious comments of his presidency. It was also reflective of his own tendency to nominate an enemy and accuse it of the very transgression that he is accused of perpetrating.\nHe added to the confusion by denying that he had said that he would halt funding to the WHO -- a move that would be counterproductive in a pandemic and would undermine already compromised perceptions of US leadership on the crisis.\n\"I'm not saying I'm going to do it, but we are going to look at it,\" the President said.\nThe President was also unable to provide much clarity on the chaos afflicting the Navy, following the resignation of Thomas Modly. The acting Navy secretary quit a day after leaked audio revealed he called the ousted commander of the USS Theodore Roosevelt \"stupid\" in an address to the ship's crew.\nThis came a little more than a week after Capt. Brett Crozier sent a memo warning of coronavirus spreading among the sailors. The memo leaked and Modly subsequently removed Crozier from command.\n\"I had no role in it. I don't know him but I've heard he was a very good man,\" the commander in chief said.\nBut Trump also rebuked Crozier.\n\"He didn't have to be Ernest Hemingway. He made a mistake but he had a bad day. And I hate seeing bad things happen.\"", "url": "https://www.cnn.com/2020/04/08/politics/donald-trump-coronavirus/index.html"}