{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:09:56", "date_modify": "2020-05-04 16:09:56", "date_publish": "2020-04-02 14:04:55", "description": "On Wednesday, Georgia Gov. Brian Kemp issued a shelter-in-place order for his state.", "filename": "2020_04_02_politics_brian-k_266fade85c541a3bfdc26142fcab4a44_index_1588608596.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402100238-kemp-desantis-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_brian-k_266fade85c541a3bfdc26142fcab4a44_index_1588608596.html", "title": "How 2 Trump-loving governors are struggling amid the coronavirus crisis", "title_page": "How 2 Trump-loving governors are struggling amid the coronavirus crisis - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) On Wednesday, Georgia Gov. Brian Kemp issued a shelter-in-place order for his state.\nAsked why he had made the decision, Kemp said this (bolding mine):\n\"Finding out that this virus is now transmitting before people see signs, so what we've been telling people from directives from the CDC for weeks now that if you start feeling bad, stay home... those individuals could've been infecting people before they ever felt bad. But we didn't know that until the last 24 hours.\"\nWhich is, well, crazy. Because asymptomatic transmission of coronavirus -- people without symptoms able to pass the virus to others -- is something that people following this closely have known for, at least, weeks. ( There are questions about how many people get the virus via asymptomatic transmission versus how many people get it from people showing symptoms.)\nKemp's decision to shut down the state -- and his unsettlingly late realization of a known fact about the virus -- came on the same day that his neighbor to the south -- Florida Gov. Ron DeSantis -- also issued a shelter-in-place directive for his state.", "url": "https://www.cnn.com/2020/04/02/politics/brian-kemp-ron-desantis-donald-trump-coronavirus/index.html"}