{"authors": ["Opinion Jen Psaki"], "date_download": "2020-05-04 15:57:48", "date_modify": "2020-05-04 15:57:48", "date_publish": "2020-04-07 23:15:08", "description": "Jen Psaki writes the conservative justices on the US Supreme Court are making decisions now that could influence the outcome of the November election. And the ongoing public health crisis consuming the lives of most Americans is just the cover they need.", "filename": "2020_04_07_opinions_supreme_cab9c63c27293dd332c8b5cbec07ef73_index_1588607868.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191106182555-trump-wierson-oped-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_opinions_supreme_cab9c63c27293dd332c8b5cbec07ef73_index_1588607868.html", "title": "The Supreme Court is tipping the scales toward Trump's reelection", "title_page": "The Supreme Court is tipping the scales toward Trump's reelection (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Jen Psaki, a CNN political commentator, was the White House communications director and State Department spokeswoman during the Obama administration. She is vice president of communications and strategy at the Carnegie Endowment for International Peace . Psaki is an outside adviser to Demand Justice, a progressive group pushing for court reform. Follow her at @jrpsaki . The opinions expressed in this commentary are solely those of the author. Read more opinion articles at CNN.\n(CNN) Make no mistake -- the conservative justices on the US Supreme Court are making decisions now that could influence the outcome of the November election. And the ongoing public health crisis consuming the lives of most Americans is just the cover they need.\nBut why would Republicans even care about people voting in a Democratic primary? It's unlikely it has much to do with former Vice President Joe Biden or Vermont Sen. Bernie Sanders.\nThere is, however, a Wisconsin Supreme Court race on the ballot -- one that President Donald Trump cared enough about to take a moment during a global pandemic to tweet in to support of candidate Daniel Kelly earlier this week.\nJust a few days later, conservative US Supreme Court justices sided with Republicans in Wisconsin who wanted to protect a state Supreme Court seat by essentially guaranteeing that there would be a depressed voter turnout on the Democratic side.\nAnd if you have any doubt of potential for depressed turnout, consider the fact that Trump was encouraging his loyal supporters in Wisconsin, largely Republican, to venture and vote, while the governor, himself a Democrat, was encouraging his citizens to stay at home.\nThough many other states, including New York and Pennsylvania, have delayed their elections until June, the Wisconsin primary was only moving forward at all because the state Supreme Court had already overruled the governor's attempt to delay the primary until June.\nSo, what was the US Supreme Court's explanation for its decision? First, the majority wrote , \"This court has repeatedly emphasized that lower federal courts should ordinarily not alter the election rules on the eve of an election.\" And, the majority added, \"Even in an ordinary election,\" voters requesting absentee ballots by the deadline would generally receive their ballots on or before Election Day.\nJUST WATCHED Wisconsin voters line blocks waiting to vote in primary Replay More Videos ... MUST WATCH Wisconsin voters line blocks waiting to vote in primary 02:48\nGive me a break. We are hardly living through an \"ordinary election.\" Justice Ruth Bader Ginsburg summed it up clearly in her dissent , \"Either voters will have to brave the polls, endangering their own and others' safety. Or they will lose their right to vote, through no fault of their own.\"\nSo, here is the scary part. This goes far beyond the primary election in April. The ability of Americans to safely vote from home may be a determining factor in the outcome of the presidential election in November.\nIt is at the discretion of the states to make laws regarding absentee and vote by mail ballot options. And, in this particular case, Wisconsin Gov. Tony Evers even called the legislature into an unsuccessful special session to attempt to delay the primary election.\nMaking voting easier often means that more people vote. According to one study conducted by Nonprofit Vote and the US Elections Project, in the six states with the highest turnout in the 2016 presidential election, all offered same-day voter registration . In addition, voting by mail has been shown to dramatically increase turnout in states from California to Nebraska.\nWithout a national mandate that Americans, during a time of a health crisis, should have the right to vote by mail, the possibilities for suppression are also endless.\nAs crazy as it may sound, President Donald Trump could use fear around public gatherings as a justification for working with Republican governors to shut down polling locations. We've seen Republicans shutter poll locations before -- most recently in Texas , where over 700 polling locations, many in minority neighborhoods, were closed after the 2013 Supreme Court decision, ending the requirement of several states (mostly in the South) to seek federal approval before changing their election laws.\nOn Super Tuesday this year, many in Texas stood in long lines -- and not just because of their enthusiasm for the candidates, but because they had limited options for locations to vote.\nTrump could also work with states to narrow the hours voters can go to the polls, thus limiting options for early voting. And he could use the health and safety argument to give him cover.\nAnd there should be little doubt Trump could turn a blind eye to deceptive voter information going out on social media platforms and via robocalls about canceled election days -- and false reports of new requirements at the polls, given how he has handled his role as a public communicator around the coronavirus.\nRather than presenting a clear and honest daily assessment of the facts, Trump has trumpeted half-baked science -- including the efficacy of certain drug for treatment -- instead of following the lead of his scientists.\nBut it's not just about how and when people can vote. Conservative members of the Supreme Court are also influencing the information people have access to in advance of the election.\nIn March, the Supreme Court took the unprecedented step of delaying oral arguments, scheduled for March 31 -- including several cases involving efforts to obtain Trump's financial records. At the time, part of the explanation cited the precedent of delays prompted by the 1918 Spanish flu epidemic.\nNever mind that, since 1918, the telephone, the internet and video conferencing have all been invented -- allowing for a range of means of communicating while still observing proper social distancing measures.\nWhile there are certainly delays across the country, many lower and state courts have also found a way to adapt. For the federal circuit, lawyers are presenting arguments by telephone -- without significant delays to scheduled timelines. In the Southern District of New York, for example, judges are \"encouraged to conduct proceedings by telephone or video conferencing where practicable.\"\nEven in Washington state, where Gov. Jay Inslee put in place stringent stay at home orders, the court is proceeding with video and telephone conference as appropriate\nWhat does the Supreme Court's decision to delay arguments mean?\nFor one, the planned oral arguments that would ideally lead to a June decision on whether Trump's tax records should be turned over to the House and local prosecutors in New York may not happen before the election. And this matters because Trump's tax returns could show a range of potential conflicts of interest by revealing who invests in his businesses, perhaps explaining why he appears so sympathetic to authoritarian leaders in Russia and Saudi Arabia, and how much Trump properties have made off of taxpayers since he was elected to office. (Trump denies any wrongdoing.)\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nIn short, the highest court in the land has not found a way to hear oral arguments, including on topics that could be consequential to voters this election cycle, like the tax records of the President of the United States, but it has made an exception to put the people of Wisconsin at risk by refusing to extend the deadline for absentee ballots.\nTo quote Ginsburg in her dissent on the Wisconsin decision, \"It's mind-boggling.\"\nThe decision by the conservative-majority Supreme Court to make it harder for people in Wisconsin to vote should be a warning sign that Trump and the conservative court he and Senator Majority Leader Mitch McConnell helped shape will stop at nothing to get him reelected.\nAnd we need to be ready.", "url": "https://www.cnn.com/2020/04/07/opinions/supreme-court-tipping-scales-trump-reelection-psaki/index.html"}