{"authors": ["Tami Luhby"], "date_download": "2020-05-04 16:07:17", "date_modify": "2020-05-04 16:07:17", "date_publish": "2020-04-02 11:02:38", "description": "Unemployment benefits are becoming a financial lifeline for millions of Americans after their employers shut their doors to help stem the spread of the coronavirus.", "filename": "2020_04_02_politics_unemplo_4a08f7c14c292cc89d4d3e30e638291f_index_1588608437.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331152640-unemployment-office-closed-0321-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_unemplo_4a08f7c14c292cc89d4d3e30e638291f_index_1588608437.html", "title": "Filing for unemployment benefits? Read this first", "title_page": "Unemployment benefits: Here's what you need to know  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Unemployment benefits are becoming a financial lifeline for millions of Americans after their employers shut their doors to help stem the spread of the coronavirus.\nThe growing tsunami of layoffs has overwhelmed state unemployment systems as a record number of workers try to apply for benefits. The situation isn't likely to improve anytime soon.\nThe bottleneck comes as Congress passed a historic expansion of jobless benefits -- but applicants have to be able to file their first claims before the checks can start coming.\nThe situation is so bad that governors have begun apologizing to frustrated people who can't file claims and have to wait longer for their money.\n\"Unemployment benefits are extremely essential to support workers who are trying to make ends meet and stay connected to the labor market,\" said Kali Grant, senior policy analyst at the Georgetown Center on Poverty & Inequality.\nHere's how unemployment benefits work:\na minimum level of prior earnings from recent employment, be ready to take new positions immediately and be actively seeking work. States can now waive the latter two requirements since hundreds of millions of Americans are staying at home, and many states have closed The rules vary by state, but typically employees have to have lost their jobs through no fault of their own, havea minimum level of prior earnings from recent employment, be ready to take new positions immediately and be actively seeking work. States can now waive the latter two requirements since hundreds of millions of Americans are staying at home, and many states have closed nonessential businesses\nJust who is eligible for unemployment benefits also varies by state. Not all part-time workers qualify. And independent contractors and the self-employed typically don't either, though Congress has created a pandemic unemployment assistance program that temporarily covers them.\nHow much you'll receive depends on your recent earnings and state in which you live, said Chad Stone, chief economist at the Center on Budget and Policy Priorities. Benefits range from about $200 to $550 a week, on average, depending on the state, and typically replace about 40% of one's wages. But Congress just gave those weekly checks a big boost. (See more below.)\nIt will likely take longer to file your initial claim and have it approved because of the crush of applications , but once that's done, your first payment typically arrives in your bank account in two or three weeks via direct deposit. You'll no longer have to wait a week for benefits to start, thanks to Congress.\nIf you are found ineligible, you can appeal, though that process likely will also take longer these days.\nHere's what Congress just changed:\nIn its recent stimulus package, Congress made several unprecedented changes to the unemployment insurance program.\nJobless workers will soon get an extra $600 a week on top of their state benefits, for up to four months. That will significantly boost people's payments.\nLawmakers also added up to 13 weeks of extended benefits, on top of state programs, which vary between up to 12 and 28 weeks.\nPlus, the new pandemic unemployment assistance program expands eligibility to those who are unemployed, partially unemployed or unable to work because of the virus and don't qualify for traditional benefits. This also includes independent contractors, the self-employed and gig economy workers. The pandemic program benefits mirror what's available in one's state.\nCongress also allowed states to relax some of the rules to make it easier to approve applications.\nThe extended benefits and pandemic program end by December 31.\nHere's what's happening when filers try to apply:\nBeing able to actually file a claim, however, is another matter. It's not pretty out there -- Americans have taken to social media to lambast their state unemployment agencies for crashing websites, error messages, endless hold times and busy signals.\nNils Warren has been trying to file an initial claim on Florida's Department of Economic Opportunity site for the past two days, but can't make it past the first few steps. The online system won't allow the audio engineer to reset his PIN, and he can't reach anyone on the hotline. He was told by the automated phone system Wednesday that he'd receive a call back within two hours. After more than six hours, the phone rang -- but then quickly disconnected.\nNils Warren, an audio engineer, has spent the last two days trying to file for unemployment benefits in Florida.\n\"It just goes around and around,\" he said of the agency's site. \"Or it kicks you off or you get an error message. It's like Groundhog Day but worse.\"\nThe department, which has taken the system down for maintenance several times recently, apologized on Twitter Wednesday for the difficulty Floridians have had in submitting their claims.\nWarren, who saw all his jobs for convention centers, meetings and sporting events disappear by mid-March, is hoping the unemployment payments will help cover his utilities, groceries and mortgage bills so he doesn't have to drain his savings. He's not expecting to be booked again until the summer.\nMeanwhile, Texas' online system is so overloaded that the state Workforce Commission recommends people file in the middle of the night or very early in the morning. The agency's website notes that usage is lower between 10 p.m. and 8 a.m.\nIn New York, Gov. Andrew Cuomo acknowledged Tuesday the state system was not keeping up with the demand.\n\"I apologize for the pain. It must be infuriating to deal with,\" he said at a press conference.\nLast week, the state's Labor Department received more than 8.2 million calls, compared to 50,000 in a typical week. Its online filing system had 3.4 million visits, compared to 350,000 normally.\nThe agency has dedicated 700 people to the unemployment insurance hotline and is training hundreds more. It has extended call center hours, added 20 additional servers to boost its website capacity and is processing applications on Sunday.\nThe state is also asking people to file on certain days, based on the first letter of their last name.\nStill, even late at night, the agency's page warns it can take more than an hour to apply.\n\"The site is so deluged that it keeps crashing because you literally have hundreds of thousands of people at any time trying to get on the site,\" Cuomo said.\n\"It's compounding people's stress,\" he said. \"You're unemployed, you're trying to get on some darn website. You can't get through the website.\"", "url": "https://www.cnn.com/2020/04/02/politics/unemployment-benefits-federal-stimulus-us-economy/index.html"}