{"authors": ["Darlene Superville"], "date_download": "2020-05-04 20:14:16", "date_modify": "2020-05-04 20:14:16", "date_publish": "2020-04-16 19:43:59", "description": "WASHINGTON (AP) — President Donald Trump faced international resistance Thursday as he defended his plan to cut U.S. payments to the World Health Organization over its handling of the coronavirus...", "filename": "_9ceee082301f990568afb7050e711eb2_1588623256.html", "image_url": "https://storage.googleapis.com/afs-prod/media/23d5bf0bc87847f9a3c30e77cb4fcfa5/2653.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9ceee082301f990568afb7050e711eb2_1588623256.html", "title": "Trump faces global resistance to US plan to cut WHO funding", "title_page": "Trump faces global resistance to US plan to cut WHO funding", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Donald Trump departs after speaking about the coronavirus in the James Brady Press Briefing Room of the White House, Thursday, April 16, 2020, in Washington. (AP Photo/Alex Brandon)\nPresident Donald Trump departs after speaking about the coronavirus in the James Brady Press Briefing Room of the White House, Thursday, April 16, 2020, in Washington. (AP Photo/Alex Brandon)\nWASHINGTON (AP) — President Donald Trump faced international resistance Thursday as he defended his plan to cut U.S. payments to the World Health Organization over its handling of the coronavirus pandemic.\nTrump said he reiterated his frustration with the WHO during a call with Group of Seven leaders, and he again accused the WHO of mishandling its response and showing too much deference to China, where the new coronavirus first emerged.\nTrump’s conversation with the leaders of Britain, Canada, France, Germany, Italy and Japan “centered on the lack of transparency and chronic mismanagement of the pandemic by the WHO” and the G-7 leaders called for a “thorough review and reform process,” according to the White House.\n“I was angry because it should have been told to us,” Trump said. “It should have been told to us early, it should have been told to us a lot sooner. People knew it was happening, and people didn’t want to talk about it.”\nCanadian Prime Minister Justin Trudeau said everyone on the call recognized the importance of continuing to coordinate and collaborate on the science around the pandemic, to work on public health measures and to share information about vaccine development and possible treatments.\n“There is a need for international coordination and the WHO is an important part of that collaboration and coordination,” Trudeau said outside his residence in Ottawa. “We recognize that there have been questions asked but at the same time it is really important that we stay coordinated as we move through this. That’s certainly what Canada is going to do.”\nGerman Chancellor Angela Merkel expressed her “full support” for the WHO and similar international groups, and stressed that it will take “a strong and coordinated international response” to defeat the pandemic, said her spokesman, Steffen Seibert.\nFrench President Emmanuel Macron expressed his support for the WHO and said the organization must play a “central role” as part of an “ambitious and coordinated international response” to the virus crisis.\nMacron stressed the need to bring “massive aid” to the most vulnerable countries, especially in Africa.\nBritish Foreign Secretary Dominic Raab, who is standing in for Prime Minister Boris Johnson as he recovers from the coronavirus, said the leaders agreed that rapid development and production of treatments and a vaccine are crucial.\nRaab also stressed the need for an “internationally coordinated” response.\nThe Italian foreign ministry said it was committed to consolidating a global governance of health care “in which the WHO plays a crucial leadership role.”\nA statement issued after a separate teleconference of French, German and Italian foreign ministry officials said Italy is considering new contributions to the WHO for research and distribution of a vaccine “for which a global, inclusive effort will be necessary.”\nSeparately, Germany’s foreign minister warned Thursday that cutting funding for the WHO was like “throwing the pilot out the plane.”\nHeiko Maas told reporters the United Nations and its health agency are the “backbone” of the current fight against the outbreak “and that’s why it makes no sense at all to question the functioning and significance of the WHO now.”\nMaas said it was important to strengthen the agency, including with further funding, and said “weakening it would be nothing other than throwing the pilot out of the plane in mid-flight.”\nTrump announced this week that he will end U.S. contributions to the WHO, claiming the outbreak could have been contained at its source and lives could have been saved had the U.N. health agency done a better job investigating the early reports coming out of China.\nCritics argued that cutting the WHO’s funding in the middle of a pandemic made no sense and said there will be plenty of time after the virus is vanquished to review its actions.\nThe WHO has said its work will continue regardless of any action taken by the United States.\n___\nAssociated Press writers in Group of Seven nations contributed to this report.", "url": "https://apnews.com/9ceee082301f990568afb7050e711eb2"}