{"authors": ["Clare Duffy", "Cnn Business"], "date_download": "2020-05-04 16:24:20", "date_modify": "2020-05-04 16:24:20", "date_publish": "2020-04-05 22:21:42", "description": "Boeing is temporarily suspending production operations at its manufacturing facility in South Carolina, where it builds the 787 airplane, because of the coronavirus pandemic, the company said Monday. The closure will begin at the end of the second shift on Wednesday, and will run \"until further notice.\"", "filename": "2020_04_05_business_boeing-_686e829400c082344fcb113ff0ecba76_index_1588609460.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406184850-boeing-south-carolina-plant-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_business_boeing-_686e829400c082344fcb113ff0ecba76_index_1588609460.html", "title": "Boeing is temporarily halting all commercial airplane production in the US because of coronavirus", "title_page": "Boeing is temporarily halting all commercial airplane production in the US because of coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Boeing is temporarily suspending production operations at its manufacturing facility in South Carolina, where it builds the 787 airplane, because of the coronavirus pandemic, the company said Monday. The closure will begin at the end of the second shift on Wednesday, and will run \"until further notice.\"\nThe announcement comes afteron Sunday extended the temporary suspension of production operations at its Puget Sound and Moses Lake facilities in Washington state as coronavirus continues to pose a risk to workers. The company first announced the closure of the Washington facilities on March 23, and had planned to close them for two weeks. But on Sunday, Boeing said operations will continue to be put on hold \"until further notice.\"\nThe closures are yet another example of the huge hit the travel industry has taken amid the coronavirus outbreak. Monday's news marks the temporary closure of all of Boeing's major commercial airplane production facilities.\n\"These actions are being taken in light of the company's continuing focus on the health and safety of employees, current assessment of the spread of Covid-19 in Washington state, the reliability of the supply chain and additional recommendations from government health authorities,\" the company said in a release Sunday.\nBoeing had previously asked all employees who could work from home to do so, but that was not possible for people who work on assembly lines. The suspension of work at plants in Washington occurred after the coronavirus-related death of an employee in Everett, Washington.\nWorkers affected by the shut downs who cannot work from home will receive 10 days of pay following the initial closure of their facility. Beyond those initial two work weeks-worth of pay, workers will have to use PTO days to account for any continued closure, according to a Boeing spokesperson. If their available PTO days run out, they will have to use \"absent without pay\" days, at which point they will be eligible for unemployment benefits.\nThe spokesperson said affected workers will continue to receive medical benefits throughout the shut down.\n\"Pay practice details have been made available to all teammates,\" the company said in its Monday statement.\nDuring the extended closure at its Washington facility, Boeing said Sunday it is implementing safety measures including visual cues to encourage physical distancing, more frequent cleaning of work and common areas and staggering shift times. Those measures will aid essential workers who must continue coming to work during the closure, and will be in place when operations can get up and running again.\nBoeing on Friday also announced a halt in production operations at one of its helicopter plants outside of Philadelphia.\nOn Wednesday the United Auto Workers union, which represents the Boeing hourly employees in Philadelphia, told members there have been two confirmed coronavirus cases among employees there. While one was working remotely, one had been continuing to work at the factory. No further information on their condition was revealed.\n- CNN's Chris Isidore contributed to this report", "url": "https://www.cnn.com/2020/04/05/business/boeing-washington-factories-closure-coronavirus/index.html"}