{"authors": ["Opinion Ban Ki-Moon", "Patrick Verkooijen"], "date_download": "2020-05-04 16:59:36", "date_modify": "2020-05-04 16:59:36", "date_publish": "2020-04-09 23:10:00", "description": "Former UN Secretary-General Ban Ki-moon and Center for Global Adaptation CEO Patrick Verkooijen write that the Covid-19 pandemic is a reminder that the world needs to work together to address its other pressing crisis: global warming", "filename": "2020_04_09_opinions_climate_9a52c4b76ad7da2659f559540b8bed0a_index_1588611576.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200319082514-climate-crisis-01-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_opinions_climate_9a52c4b76ad7da2659f559540b8bed0a_index_1588611576.html", "title": "Will we learn lessons for tackling climate change from our current crisis?", "title_page": "Will we learn lessons for tackling climate change from our current crisis? - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Ban Ki-moon served as the eighth secretary-general of the United Nations and Patrick Verkooijen is CEO of the Global Center on Adaptation, a group that seeks to facilitate climate adaptation by working with the public and private sectors. The opinions in this commentary are their own. View more opinion at CNN.\n(CNN) Crises tend to bring out some of the best and the worst in us. We have watched in awe and admiration as health care professionals have responded with superhuman dedication to the Covid-19 pandemic. We have heard neighbors serenading each other across balconies. Car manufacturers are retooling to produce respirators and face masks that are so desperately needed by hospitals right now. Around the world, 1.7 billion people are staying at home to slow down the spread of the virus, according to The Guardian . Never, it seems, have there been so many visible acts of collective solidarity, and of such magnitude.\nBut there have also been acts of craven selfishness. Cyberattacks on Spanish hospitals , where thousands are in intensive care. Profiteering and hoarding of life-saving medical supplies. World leaders who put their citizens in danger by denying the gravity of the situation.\nWhat this shows is that as individuals and as communities, we have a choice in how to respond to global threats. For the greater good we can accept restrictions on how we live, even at a cost to incomes and livelihoods -- as 20% of the global population is doing right now, as The Guardian wrote -- or we can respond selfishly, seeking only what is right for us, rather than the collective good of humanity.\nThese choices will continue to be important once Covid-19 is tamed. Because what should be clear is that other threats, most notably our ongoing climate emergency, have not gone away during the pandemic.\nMany experts see a link between the two. Inger Andersen, head of the United Nations Environment Programme, says Covid-19 is a \"clear warning shot\" given that 75% of all infectious diseases come from wildlife, and climate change and the destruction of natural habitats are putting humans into ever-closer proximity to animals.\n\"Nature is sending us a message,\" she says, as The Guardian reported . Gernot Wagner, a climate economist at New York University, tweeted that the virus is \"climate change on warp speed.\"\nPope Francis, meanwhile, praying in a deserted St. Peter's Square on March 28, said : \"nor did we listen to the cry of the poor or of our ailing planet. We carried on regardless, thinking we would stay healthy in a world that was sick.\"\nIf nature is sending us a message, what is it saying?\nIt is telling us that we need to heal the planet if we want to heal ourselves. That we must be respectful of the boundaries between humans and other species; that we need to adapt and alter our behavior. And while we make these changes, we need to build our societies' resilience to emergencies of all kinds, because our current planning and preparation for viruses, for rising seas and other effects of climate change, are not enough.\nWhether you are dealing with a deadly virus or extreme weather, prevention is always better than cure. It makes economic sense to build greater resilience against climate change now, in the same way that we must strengthen our health care systems before the next pathogen strikes.\nThe Global Commission on Adaptation estimates that investing just $1.8 trillion in building resilience against climate change over the next decade could generate $7.1 trillion in total net benefits. Investment in green technology and resilient infrastructure could help put our coronavirus-shattered world back together again. Renewable energy instead of coal; natural drainage systems instead of more concrete to soak up water and avert floods; reforestation instead of land clearances.\nAround the world, governments are launching gigantic stimulus packages to prop up their economies. But these are being targeted exclusively within national borders; more attention must be paid to helping those around the world who need it most.\nIt is also clear to us that to avert disaster, countries will need to help each other. World governments urgently need to mobilize a global fund to help the world's poorest countries cope with Covid-19. The precedent is there: In the aftermath of the Ebola epidemic, the United Nations established a trust fund and led the international community to support recovery priorities. We believe the whole UN system, the World Bank, the International Monetary Fund and all regional development banks should come together again to address the aftershocks of the pandemic, including the global economic fallout.\nIf the virus is a shared global challenge, so too should be the need to build resilience against future shocks. Emerging and developing countries are the least prepared for the arrival of Covid-19, just as they are most vulnerable to the effects of climate change.\nTo avoid a protracted global recession, Organization for Economic Cooperation and Development Secretary-General Angel Gurría has called for a response \"akin to the last century's Marshall Plan and New Deal -- combined.\" If it does come about, we hope it will not forget those in the developing world. For how these vast sums are invested will determine our future.\nGovernments could opt for business as usual, perpetuating our old way of life, or they could heed nature's Covid-19 warning and kick-start the transition to a low-carbon future. This means investing in life-supporting systems such as a stable climate, fresh air and clean water, and the preservation of natural habitats.\nThe lifesaving benefits of building climate resilience are already evident in countries that have invested in early-warning systems against cyclones and hurricanes. Tropical cyclones killed hundreds of thousands of people in Bangladesh, a low-lying delta country, throughout the 20th century, but thanks to investment in warning systems, evacuation drills and strong shelters, millions of people can now shelter in safety before cyclones strike.\nThis pandemic is far from over, but it has already brought certain truths (which should have been evident) into stark relief: that viruses do not respect borders; that without solidarity, we will not defeat this pandemic, because we are only as safe as our most vulnerable people; that scientific knowledge and advice matter; and that delay is deadly. The same lessons hold true for our climate emergency.\nIf we are wise, we will start acting on these lessons now.", "url": "https://www.cnn.com/2020/04/09/opinions/climate-change-lessons-from-covid-19-ban-verkooijen/index.html"}