{"authors": ["Faith Karimi", "Dianne Gallagher"], "date_download": "2020-05-04 16:13:43", "date_modify": "2020-05-04 16:13:43", "date_publish": "2020-04-03 12:09:54", "description": "What was supposed to be an adventure of a lifetime started with a coronavirus outbreak at sea and ended with hundreds of passengers on a flight to Atlanta despite risks of infection.", "filename": "2020_04_03_us_costa-luminosa-passengers-ordeal_index_1588608823.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330131533-tom-sheehan-coronavirus-victim-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_us_costa-luminosa-passengers-ordeal_index_1588608823.html", "title": "A Florida man dies days after hundreds exposed to coronavirus walked around world's busiest airport", "title_page": "A Florida man dies days after hundreds exposed to coronavirus walked around world's busiest airport - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Kevin and Ryan Sheehan will never know whether their father heard them say goodbye on speaker phone.\nTom Sheehan, 68, was fighting for his life in Sarasota, Florida, with what he thought was bronchitis, but turned out to be Covid-19. He was hospitalized on March 21, a day after he returned from a cruise on the Costa Luminosa.\nWhat was supposed to be an adventure of a lifetime started with a coronavirus outbreak at sea and ended with him and hundreds of others on a chartered flight to Hartsfield-Jackson Atlanta International Airport. After hours of prolonged exposure with infected people , health officials cleared hundreds of passengers, leaving potential patients moving freely in the world's busiest airport.\nSome of the passengers who got on flights all over North America said they feared they'd exposed others to infection.\nAmerican and Canadian cruise ship passengers from the Costa Luminosa arrive at Atlanta's Hartsfield-Jackson International Airport on March 20.\nTragedy strikes days after the flight\nChaos and confusion reigned during the trip, raising questions about how officials are working together to combat a spiraling health crisis\nAnd for the Sheehan brothers, tragedy struck days later.\nTheir father tested positive for coronavirus and was hospitalized after he arrived home in Bradenton, Florida. A week after the flight, his organs started shutting down, and a nurse called his family on speaker phone to tell him goodbye. His children thanked him for being a great father and grandfather, and Kevin Sheehan's wife thanked him for raising a good man. They told him they loved him, he'd fought hard and that it was OK to let go now.\nAt 8:51 p.m. on Saturday, Tom Sheehan took his last breath.\nThe grandfather of 11 was a prankster who loved science fiction, big hugs and family gatherings. He spent his final moments alone.\n\"It's terrible. Nobody should ever have to go through this,\" Kevin Sheehan said.\"I hope with all my heart he got to hear our voices.\"\nCosta Luminosa passengers are seen as the ship is moored in the harbor in Marseille, France.\nA harrowing trip from the start\nSheehan and his wife had set sail from South Florida on March 5. But their cruise to Puerto Rico, Antigua, Spain and France appeared doomed from the start.\nThree days into it, on March 8, a husband and wife who had coronavirus symptoms disembarked in Puerto Rico.\nOn March 12, the government of the Cayman Islands said a man who'd left the cruise ship on an earlier voyage in late February with flu-like symptoms tested positive for coronavirus. He was the Cayman Islands' first confirmed case, and died days later.\nThen on March 13, the cruise ship said it got confirmation that the woman who had disembarked in Puerto Rico tested positive and officials notified those aboard, multiple passengers told CNN. A week later, she died.\nThe ship sailed on, toward Europe.\nTwo days after the woman's positive confirmation, the ship's crew dropped off several sick passengers at Tenerife in the Canary Islands, off the coast of Western Africa. Then the ship began to quarantine passengers in their rooms, they told CNN, as it roamed the waters searching for a place to dock. Spain and Antigua had already rejected it.\nThe Canary Islands allowed the ship to unload several travelers with breathing problems on condition that no one else left the ship during that stop.\n\"As a precaution, all guests were fitted with medical masks and gloves by onboard medical staff before receiving approval from French authorities to disembark and proceed to Marseille Provence Airport for departure to the US,\" Carnival Corp., which owns Costa Cruises, said in a statement.\nFrance granted it permission to dock in Marseille on March 19. The cruise line notified Americans and Canadians that it had planned a charter airplane to take them to Atlanta.\nCosta coordinated the flight along with the French government and health authorities, Carnival said. The State Department, which has worked to repatriate Americans, also told CNN that the cruise line arranged for the flight.\nSheehan and more than 350 Americans and Canadians were loaded on buses, where they waited for hours before boarding the chartered overnight flight to Atlanta.\nJUST WATCHED Why the peak is coming after weeks of social distancing Replay More Videos ... MUST WATCH Why the peak is coming after weeks of social distancing 02:13\nUS finds out about positive test while flight's midair\nTheir nightmare was far from over.\nWhile the flight was in midair, the results of some American passengers who'd been tested in Marseille came back. Three had tested positive for coronavirus and 13 others had symptoms, the Centers for Disease Control and Prevention told CNN.\nFrench health authorities conducted the tests before the flight, and notified the State Department about the positive tests while the flight was midair, Carnival said.\nIt's unclear why the flight did not wait for the test results before it took off from Marseille. CNN has contacted the French Foreign Ministry for comment.\nOver 350 people who'd been in the confined space of a cruise ship continued with their journey in the even more confined space of a transatlantic flight.\nDuring the nearly 10-hour flight to Atlanta, passengers coughed constantly. Some elderly people passed out while others appeared feverish, said Jenny Harrell Catron, 51, a former medic and a passenger on the flight.\nAt that point, Sheehan had not been tested.\n\"I set up a triage on the plane separating those with fevers from the rest of the passengers,\" Harrell Catron said. \"Passengers passed the time by making sure that their seatmates were conscious and breathing.\"\nJUST WATCHED Hear from passengers on the Grand Princess cruise ship Replay More Videos ... MUST WATCH Hear from passengers on the Grand Princess cruise ship 02:52\n'We were covered with virus from head to toe'\nThe flight landed in Atlanta in the wee hours of March 20 to a different world than the one the passengers had left when they first set sail. Since then, the fast-spreading coronavirus had overwhelmed health care systems, cleared public spaces, shuttered workplaces and nixed social events, disrupting life in unprecedented ways.\nPassenger Martha Turner Bradbury said she'd read about cruise ship passengers undergoing rigorous health checks and two weeks quarantine at military bases nationwide. She was prepared for it.\nAfter all, that's what happened in February, when about 400 American passengers returned from their cruise in Japan aboard the Diamond Princess. When their two-week quarantine ended in Tokyo Bay, they were flown to two US air bases in California and Texas for two more weeks of quarantine in bio-containment facilities.\nIn a highly choreographed federal and military effort to save lives and contain the virus, 14 Diamond Princess passengers who had tested positive were flown in a specialized containment area.\nInstead, Bradbury said, the Costa Luminosa passengers landed in Atlanta to a chaotic scene with no clear guidance and preparation.\nA lack of protocol leaves passengers confused\nAt the cargo area where the plane landed, passengers were met by health officials in hazmat suits, Bradbury said. They got a temperature check and a visual assessment, along with paperwork asking whether someone had a cough, a sore throat or other ailments associated with coronavirus, she said.\nThose with signs of possible illness were taken into a separate room while those with no symptoms headed to customs, and were later put in buses that dropped them off near a terminal, Bradbury said. From there, they were all told to go in and get their bags.\n\"We're thinking someone is going to be meeting us ... nope. You just walk in and you're in the terminal with everybody else. We were shocked,\" Bradbury said.\nSeveral passengers told CNN they were allowed to wander around inside the airport, including at least one person who was symptomatic.\n\"We were covered with virus from head to toe. We should not have been in the airport,\" said Harrell Catron.\nHartsfield-Jackson Atlanta International Airport referred CNN to the CDC.\nWith no plan for quarantines after arrival and no other options, Bradbury said, they joined other travelers. They considered themselves potential coronavirus patients and moved away if anyone got too close. Some went to their respective gates for their commercial flights home, others headed to restaurants to eat and others went to restrooms. Others even took rideshares to other parts of Atlanta.\n\"It was great that they got us there. But to not have any plan or protocol in place is crazy,\" Bradbury said.\nFrom Atlanta, Bradbury hopped on a flight to Minneapolis, then another one to Winnipeg, Canada, where she's in self-isolation as she awaits test results.\nHarrell Catron instead chose to self-quarantine at her own expense at an Atlanta hotel for 14 days before leaving for her home in Fredericksburg, Virginia.\nPhoenix-area residents Kelea Nevis and her husband, Jim Nevis, were briefly held after his fever registered over 100 degrees, she said. Officials gave her husband a Chick-fil-A sandwich, and retook his temperature after a wait, she told CNN. It had dropped to around 99 degrees, so they were cleared to take a commercial flight home. \"His temperature was 102.5 when we landed,\" Kelea Nevis said.\nFive days after they got home, he was rushed to the hospital by ambulance. He tested positive for coronavirus, and was hospitalized. He was released this week.\nJUST WATCHED Big efforts to keep travelers safe from coronavirus Replay More Videos ... MUST WATCH Big efforts to keep travelers safe from coronavirus 03:33\nAction on potential cases changes as pandemic evolves\nThe incident highlights the different ways federal officials are handling potentially contagious people as the pandemic evolves.\nIn the case of Grand Princess, another cruise ship in which at least 21 tested positive, the evacuated American passengers were quarantined on military bases nationwide after the ship docked in California on March 9.\nOver 500 of those passengers were flown to Dobbins Air Reserve Base, where they were cared for at two military facilities north of Atlanta. That was nine days before the Costa Luminosa passengers arrived in Atlanta.\nIt's unclear whether it's standard protocol now to free passengers to self-quarantine at home. More than a dozen cruise ships remain stranded at sea -- some without passengers -- as ports deny entry and those aboard panic about returning home.\nThe Centers for Disease Control and Prevention defended its decision to let the Costa Luminosa passengers fly home, noting that with the skyrocketing coronavirus community spread in the US and worldwide, it \"now considers returning cruise ship passengers to be at the same level of exposure risk as Americans coming back from any\" hard-hit country.\n\"We recommend that travelers without symptoms continue home quickly via commercial carriers and then quarantine,\" it said in a statement. \"This travel protocol reflects the hard reality of this unprecedented epidemic.\"\nThe federal health agency said it became aware that a charter flight was arriving only shortly before it landed at the airport.\n\"CDC, along with federal, state and local partners, quickly responded by screening and triaging passengers in a remote part of the airport. Three passengers who were reported to be positive for Covid-19 were separated, and CDC and other partners worked together to determine a plan to isolate and care for those individuals,\" the CDC said.\nIt's unclear exactly how health authorities isolated the three passengers or what care was provided.\nIn addition, the CDC said, it gave passengers information on social distancing, told them to stay home for 14 days and notify their health care provider if they developed symptoms.\nGeorgia Gov. Brian Kemp's office and the CDC have not responded to additional requests for comment on why the passengers were not quarantined at bases.\nJUST WATCHED Zaandam ship nears Florida with coronavirus onboard Replay More Videos ... MUST WATCH Zaandam ship nears Florida with coronavirus onboard 02:33\nOther passengers and crew test positive\nSince then, 11 passengers and nine crew members have tested positive for coronavirus, the cruise line said, adding that 40 other crew members tested positive but were asymptomatic.\nIt's unclear whether that number includes all passengers from different nations. The cruise company said once the guests are off the ship, health officials in specific countries issue the updates on confirmed cases.\nAs a way to stay in touch and get updates, passengers from all over the world who took that cruise created a Facebook group to mourn those who died and share details about those who are sick.\n\"Seat 16K, fever was 101.1, headache, nausea. Throat like something thick stuck,\" one post reads.\n\"16F. fever, chills, sore throat, nausea, diarrhea, eyes hurt,\" another one says.\nMore than three dozen passengers on the charter flight to Atlanta are now self-reporting positive Covid-19 tests in the Facebook group.\nWith news of more confirmed cases and no word from the cruise line, Kevin Sheehan said, the page has provided his family a glimpse into their father's final days. But the more the brothers learn from the passengers posting information on the group, the angrier they get at the cruise line for what they say was lack of communication about the confirmed positive cases.\nThe brothers are still trying to wrap their mind around losing their father. Their father's wife -- their stepmother -- did not get a chance to tell him goodbye.\nShe is mourning her husband while isolated at home, alone.", "url": "https://www.cnn.com/2020/04/03/us/costa-luminosa-passengers-ordeal/index.html"}