{"authors": ["Navendu Mishra", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Bue Rübner Hansen", "Sarah Lazare", "Adam Johnson", "Ben Burgis", "Dawn Foster"], "date_download": "2020-05-04 19:49:36", "date_modify": "2020-05-04 19:49:36", "date_publish": "2020-03-23 00:00:00", "description": null, "filename": "2020_03_coronavirus-navendu-mishra-labour-party_1588621776.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/23153652/GettyImages-1213320160.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_coronavirus-navendu-mishra-labour-party_1588621776.html", "title": "The Crisis Is Only Going to Get Worse for Workers", "title_page": "The Crisis Is Only Going to Get Worse for Workers", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "There’s no hospital in my own constituency, but the four constituencies in the Stockport Metropolitan Borough are served by Stepping Hill hospital. Three weeks ago, Stockport Unison health branch members told me that over the last ten years there’s been a lot of cuts — they claim they’re being underfunded by £170 million a year. As well as hospitals, local schools have had an £8 million shortfall and the council £100 million — that’s a lot of money. So, many argue that the state is so diminished by austerity that the response to coronavirus isn’t as good as it could have been.\nThere’s a major issue of staff shortages in hospitals, with tens of thousands of unfilled vacancies. In the Stockport Express I wrote about the health care assistants’ campaign. They’re having to do jobs that nurses should be doing — but they’re paid a lot less and they’re campaigning for fair pay. Sadly, the Accident and Emergency (A&E) here is one of the worst performing in England in terms of waiting times, which is a real concern. That’s not the fault of the staff, whether doctors and nurses, admin personnel or cleaners. But long-term cuts have had a lasting impact on A&E as well as other parts of the hospital.\nThere are really good local organizations, from before this crisis, like the Wellspring center, which supports the homeless, to Smart Works, a national charity with an office in Stockport which helps unemployed women. In the last two weeks lots of organizations have popped up on social media, or via WhatsApp groups, to support people who can’t go shopping for themselves — including health workers on the front line. My office put together a Google form to signpost people to these organizations and we’ve also written to food banks and schools offering support.\nThis is, indeed a quite mixed constituency with some more affluent areas like Heatons South and others like Brinnington where life expectancy is up to ten years lower. The underlying issue is poverty and the worse services in poorer areas. That’s not at all about criticizing people in more middle-class areas but insisting the services for less affluent parts need levelling up.", "url": "https://jacobinmag.com/2020/03/coronavirus-navendu-mishra-labour-party"}