{"authors": ["Ariane De Vogue", "Cnn Supreme Court Reporter"], "date_download": "2020-05-04 16:26:13", "date_modify": "2020-05-04 16:26:13", "date_publish": "2020-04-07 01:58:24", "description": "Instead of a quiet compromise in the age of coronavirus, the court split 5-4 along ideological lines regarding Wisconsin's presidential primary scheduled for Tuesday", "filename": "2020_04_06_politics_supreme_741fcbb47f6eeaf4c31729519e84be01_index_1588609573.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/181130125420-02-scotus-class-picture-2018-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_supreme_741fcbb47f6eeaf4c31729519e84be01_index_1588609573.html", "title": "Supreme Court decision to allow Wisconsin vote during pandemic 'boggles the mind,' Ginsburg says", "title_page": "Supreme Court decision to allow Wisconsin vote during pandemic 'boggles the mind,' Ginsburg says - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Until Monday night, the Supreme Court had been moving gingerly, sitting on a tinderbox of blockbuster cases and carefully navigating the new Covid-19 world.\nAll that changed when the court issued its first order related to the pandemic after a long day of ricocheting legal briefs concerning Wisconsin's pending primary. Instead of a quiet compromise in the age of coronavirus, the court split 5-4 along ideological lines, in a stinging loss for Democrats and a signal that between now and November the Supreme Court's path may not be smooth as the pandemic continues to cripple sectors of the country and voting disputes multiply.\nThe majority opinion was unsigned , but Justice Ruth Bader Ginsburg penned a fiery dissent for the liberals, saying at one point the reasoning of her conservative colleagues \"boggles\" the mind.\nAt issue Monday was a request to the justices to review a lower court ruling that extended Wisconsin's absentee voting deadlines in part because requests for absentee ballots were exploding and voters expressed fears of contamination and spreading the virus if they had to vote in person.\nRepublicans asked the justices to put that ruling on hold, while Democrats said they feared a ruling against them would disenfranchise voters and risk public health.\nRead More", "url": "https://www.cnn.com/2020/04/06/politics/supreme-court-coronavirus-ginsburg-wisconsin/index.html"}