{"authors": ["Kylie Atwood"], "date_download": "2020-05-04 16:17:44", "date_modify": "2020-05-04 16:17:44", "date_publish": "2020-04-04 01:24:26", "description": "Secretary of State Mike Pompeo sent a cable to all diplomatic and consular posts Friday to clarify where American diplomats overseas should direct incoming requests for Covid-19 medical supplies from foreign governments, authorities and international organizations.", "filename": "2020_04_03_politics_state-department-cable-pandemic-requests_index_1588609064.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200128102220-mike-pompeo-1118-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_state-department-cable-pandemic-requests_index_1588609064.html", "title": "State Department sends cable trying to streamline incoming requests for pandemic aid", "title_page": "Pandemic: State Department sends cable trying to streamline incoming requests for aid - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Secretary of State Mike Pompeo sent a cable to all diplomatic and consular posts Friday to clarify where American diplomats overseas should direct incoming requests for Covid-19 medical supplies from foreign governments, authorities and international organizations.\nThe cable demonstrates an effort to streamline the overwhelming number of requests the Trump administration is getting from entities and countries seeking America's help to combat the coronavirus pandemic . There has been mounting confusion within the Trump administration over the last few weeks on this topic, multiple officials told CNN.\n\"The Department of State's Coronavirus Global Response Coordination Unit (CGRCU) maintains an interagency tracker of requests for assistance from foreign governments and authorities and international organizations and is closely coordinating with interagency counterparts on these requests,\" Secretary of State Mike Pompeo wrote in the cable. \"This centrally-managed coordination is critical to de-conflicting overlapping requests that emerge both overseas and within the United States Government.\"\nWhile the complete strategy for handling the requests has not been developed, the cable promised that more clarity would be coming.\nBut it is unclear when, or if, the Trump administration will start sending personal protective equipment to allies overseas, given that the coronavirus task force -- led by Vice President Mike Pence -- halted overseas shipments of medical equipment late last week in an effort to be sure that materials were distributed within the US, where there are significant shortages.\nAsked about reports of the freeze on Wednesday, President Donald Trump said there was \"no truth whatsoever\" to them. Minutes later, he noted that \"whatever we have, whatever we've committed to, we commit,\" but added that \"we also need a lot for ourselves.\"\nOn Friday, Trump invoked the Defense Production Act to ensure that personal protective equipment is \"kept in our country and gets to where it is needed to defeat the virus,\" according to a White House statement.\n\"To ensure that these scarce or threatened PPE materials remain in the United States for use in responding to the spread of COVID-19, it is the policy of the United States to prevent domestic brokers, distributors, and other intermediaries from diverting such material overseas,\" the statement said.\nThe cable comes as a global scramble for protective protective equipment is underway. Some French officials have even alleged that their consignments from China have been hijacked by Americans\nThe presidents of two regions in France have claimed that American customers -- without specifying who -- have tried to pay Chinese suppliers three or four times the agreed price to get critical supplies diverted.\nBeyond personal protective equipment there are other kinds of assistance that foreign governments could ask the US for, such as technical assistance with epidemiological investigation and contact tracing.\nFor now the State Department is asking the diplomats at posts worldwide to send specific requests to specific agencies. State also wants the diplomats to keep a list of the requests and to maintain open dialogue between posts.\n\"Lists of all requests from host governments and authorities and international organizations ... could provide insight into changing needs during various stages of the epidemic and, if shared between Posts, may help agencies prepare for support that will be needed in other countries,\" the cable said.\nThe State Department is also asking diplomats to \"proactively coordinate and de-conflict\" the assistance to countries and jurisdictions locally.\nA separate process is being developed for entities and governments that are offering assistance to the US, which will be run out of the State Department through its operations center crisis management and strategy office, the cable says.\nThe State Department has not replied to a request for comment on this new initiative or provided clarity as to how the parallel efforts at the department tracking the incoming requests for assistance and the incoming offers of assistance will be coordinated.\nThis story has been updated with President Donald Trump invoking the Defense Production Act for domestic personal protective equipment.", "url": "https://www.cnn.com/2020/04/03/politics/state-department-cable-pandemic-requests/index.html"}