{"authors": ["Associated Press"], "date_download": "2020-05-04 21:06:29", "date_modify": "2020-05-04 21:06:29", "date_publish": "2020-04-04 23:40:33", "description": "SAN FRANCISCO (AP) — Golden Gate Park turns 150 years old on Saturday, and the huge party to celebrate San Francisco's beloved treasure will, for the time being, take place online....", "filename": "_8448c83df72c481f071bfb4b66402243_1588626389.html", "image_url": "https://storage.googleapis.com/afs-prod/media/77bce2f64b3448129a7fc8822de06af0/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8448c83df72c481f071bfb4b66402243_1588626389.html", "title": "San Francisco park's 150th birthday celebration goes online", "title_page": "San Francisco park's 150th birthday celebration goes online", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this June 21, 1967, file photo, people keep a large ball, painted to represent a world globe, in the air during a gathering at Golden Gate Park in San Francisco, to celebrate the summer solstice, Day 1 of the \"Summer of Love.\" Golden Gate Park turned 150 years old on Saturday, April 4, 2020, and the huge party to celebrate San Francisco's beloved treasure will, for the time being, take place online. (AP Photo/File)\nFILE - In this June 21, 1967, file photo, people keep a large ball, painted to represent a world globe, in the air during a gathering at Golden Gate Park in San Francisco, to celebrate the summer solstice, Day 1 of the \"Summer of Love.\" Golden Gate Park turned 150 years old on Saturday, April 4, 2020, and the huge party to celebrate San Francisco's beloved treasure will, for the time being, take place online. (AP Photo/File)\nSAN FRANCISCO (AP) — Golden Gate Park turns 150 years old on Saturday, and the huge party to celebrate San Francisco’s beloved treasure will, for the time being, take place online.\nOriginally, city officials planned a yearlong celebration that included free museum admission, concerts and the participation of more than 150 cultural institutions and community groups. A giant Ferris wheel that lifts passengers 150 feet into the sky was brought in for the occasion.\nBut the spread of the coronavirus forced them to postpone the event.\nInstead, they launched an online concert series featuring musical sets performed in the park over the years. They include an appearance by Boz Scaggs at the Hardly Strictly Bluegrass festival in 2016 and Metallica’s headlining performance at the Outside Lands festival in 2017.\n“Golden Gate Park has served as a place of inspiration, hope and refuge for San Franciscans for 150 years,” Mayor London Breed said in a statement.\n“We hope these virtual experiences will bring some joy and entertainment during this challenging times.”\nApril 4 marks the day the park was chartered by order of California State Legislature 150 years ago. Skeptics doubted the city’s sand dunes could be converted into park land, but field engineer William Hammond Hall and master gardener John McLaren figured out a way to blanket more than 1,000 acres on the city’s west side with trees.", "url": "https://apnews.com/8448c83df72c481f071bfb4b66402243"}