{"authors": ["Reporter"], "date_download": "2020-05-04 20:14:24", "date_modify": "2020-05-04 20:14:24", "date_publish": "2020-04-29 05:35:13", "description": "Rep. Joyce Beatty defeated Morgan Harper, a consumer rights attorney backed by the activist left.", "filename": "entry_joyce-beatty-defeats-morgan-harper-columbus-ohio_n_5ea8a23fc5b61f8313362c8c_1588623264.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8a4942200007b0c827d25.jpeg?cache=qbtmoiqejo&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_joyce-beatty-defeats-morgan-harper-columbus-ohio_n_5ea8a23fc5b61f8313362c8c_1588623264.html", "title": "Veteran Ohio Democrat Survives Progressive Primary Challenge", "title_page": "Veteran Ohio Democrat Survives Progressive Primary Challenge | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Alex Wong/Getty Images Rep. Joyce Beatty (D-Ohio) speaks at the 2016 Democratic National Convention. She has a relatively liberal record, but does not challenge the party establishment.\nRep. Joyce Beatty won the Democratic House primary in Columbus, Ohio, on Tuesday, staving off a challenge from progressive consumer rights attorney Morgan Harper.\nHarper’s bid to unseat Beatty, who has represented the city in Congress since 2013, reflects the activist left’s difficulty dislodging incumbent Democrats in primary contests.\nHarper was backed by Justice Democrats, the left-wing group that propelled Rep. Alexandria Ocasio-Cortez (D) to victory in New York in 2018.\nBut Beatty’s connection to her district and her progressive voting record made her a tougher target for a challenger. Beatty is, for instance, a longtime co-sponsor of House legislation that would create a single-payer “Medicare for All” health care system. And as chair of the Financial Services Committee’s subcommittee on diversity and inclusion, she delivered a well-received interrogation of Facebook CEO Mark Zuckerberg in October.\nShe is now almost certain to return to Congress for another term. Republicans are not competitive in the gerrymandered district.\nHarper “did connect with a small faction within the Democratic Party, but Beatty has been an institution within the community,” said Herb Asher, a political science professor at the Ohio State University.\nIn fact, Beatty claimed to have deeper roots in the community than Harper, who only recently moved back to the district from New York.\n“It is insulting and offensive that you would have someone that would come here with as much need as we have and ask people to vote for you when you never voted for them,” Beatty told Politico.\nDespite higher name recognition and a major cash advantage, Beatty, 70, also campaigned ardently against Harper, 36. As vice chair of the Congressional Black Caucus, Beatty mobilized support from her fellow Black lawmakers. The caucus held a fundraiser for Beatty at a Washington lobbying firm in late February. (Harper is also Black.)\n“She did not take her opponent for granted,” Asher said of Beatty.\nShe did not take her opponent for granted. Herb Asher, The Ohio State University\nHarper, who was a former senior adviser at the Consumer Financial Protection Bureau, criticized Beatty for relying on donations from wealthy donors and corporate political action committees. Harper, by contrast, refused to accept contributions from corporate PACs.\nShe also focused on the role that she argued Beatty and her husband, influential attorney Otto Beatty, played in making Columbus less hospitable to poor and working-class families. Although he recused himself from the vote, Otto served on a zoning board that signed off on a rule enabling him to sell some downtown property to a developer for $800,000 in 2013.\nBeatty, Harper said in a television advertisement, is “profiting off of gentrification and taking money from corporations.”\nHarper would have been not only more progressive than Beatty on individual policy questions, but likely also a more independent and anti-establishment kind of lawmaker. She would be a de facto addition to the radical quartet of freshman women known as the “Squad,” which is part of a small contingent of left-wing lawmakers willing to publicly break with Democratic House leadership to advance their priorities.\nMorgan Harper Ohio congressional candidate Morgan Harper at a rally.\nThe onset of the COVID-19 pandemic prompted Ohio Gov. Mike DeWine (R) to cancel the state’s primary elections on March 17. The legislature ultimately postponed them until April 28, requiring all votes to be cast by absentee ballot, which voters can cast by mail or drop off by hand.\nThe later election deadline bought Harper additional time, but it saddled her with other disadvantages. The new date deprived her of the chance to be on the ballot while Sen. Bernie Sanders (I-Vt.) was still running, or at a time when left-leaning students at Ohio State were still on campus.\nIn an interview with HuffPost earlier this month, Harper declined to criticize Beatty as she had in the past. She instead emphasized how the pandemic had made clear the need for more dramatic changes in American society ― changes like the adoption of Medicare for All and a universal paid family and sick leave policy.\n“It’s not that we do what it takes to address the emergency immediately at hand or think about the most systemic solutions, it’s both,” she said.\nAnd though Harper’s army of volunteers could no longer muster the same canvassing might that often boosts insurgent candidates, she mobilized her team to deliver an estimated 4,000 absentee ballot request forms. (The Ohio government did not deliver absentee ballots or the request forms to voters by mail.)\nOur campaign hand-delivered close to...wait for it 4️⃣0️⃣0️⃣0️⃣‼️absentee ballot applications across OH-3 in under 30 days. I am so proud of our team and volunteers who came through for our community. Now we need voters to come through for our community! 💪🏽 #MORGANIZE pic.twitter.com/YOpxJa979t — Morgan Harper (@mh4oh) April 25, 2020\nIn the end, though, Harper either lacked a critical mass of hardcore progressive voters clamoring for an independent-minded newcomer, or the good fortune to run for office at a time when she could campaign more heavily in person.\n“There’s obviously been a group as it relates to Columbus city politics that are trying to make the case that the city Democrats are too establishment and work too closely with the business community and the developers,” Asher said. “That did not carry over into the congressional race.”\nThus far, Justice Democrats, a group that exclusively targets members in safe Democratic seats, has had limited success in unseating incumbent members of Congress. With a big boost from mainstream pro-choice groups like EMILY’s List, Justice Democrats helped nonprofit executive Marie Newman defeat Rep. Dan Lipinski, a conservative Illinois Democrat, on March 17. (Newman’s success followed a narrow loss to Lipinski in 2018.)\nIn South Texas, Justice Democrats-backed immigration attorney Jessica Cisneros fell just short in her bid to unseat Rep. Henry Cuellar, another conservative Democrat. Cuellar won the March 3 race by less than 4 percentage points.\nBlack members of Congress, who make up a disproportionate share of Democrats in safe seats, have proven to be especially adept at beating back primary challenges.\nNotably, Ocasio-Cortez and Sanders endorsed Newman and Cisneros, but did not throw their weight behind Harper.", "url": "https://www.huffpost.com/entry/joyce-beatty-defeats-morgan-harper-columbus-ohio_n_5ea8a23fc5b61f8313362c8c"}