{"authors": ["John O'Connor"], "date_download": "2020-05-04 20:24:15", "date_modify": "2020-05-04 20:24:15", "date_publish": "2020-04-16 18:01:59", "description": "SPRINGFIELD, Ill. (AP) — Gov. J.B. Pritzker has spent countless hours plotting and planning strategy in the state's race against the COVID-19 pandemic. Those who live in central and southern...", "filename": "_8eb901094eeabe1fdc88fb7fe584bc8d_1588623855.html", "image_url": "https://storage.googleapis.com/afs-prod/media/78e05ad2534b46bdb5c7880117a09319/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8eb901094eeabe1fdc88fb7fe584bc8d_1588623855.html", "title": "Pritzker fights COVID-19 from Chicago, and downstate notices", "title_page": "Pritzker fights COVID-19 from Chicago, and downstate notices", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this April 13, 2020, file photo, Illinois Gov. J.B. Pritzker, gives a daily update on the coronavirus outbreak in Illinois, in Chicago. In the fight against COVID-19, one of the more visible faces nationally, and definitely the top presence in Illinois, is Pritzker. His daily briefing Wednesday, April 15, 2020, on the spread of the potentially deadly virus and the state's response marked his 39th straight. (Tyler LaRiviere/Chicago Sun-Times via AP, File)\nFILE - In this April 13, 2020, file photo, Illinois Gov. J.B. Pritzker, gives a daily update on the coronavirus outbreak in Illinois, in Chicago. In the fight against COVID-19, one of the more visible faces nationally, and definitely the top presence in Illinois, is Pritzker. His daily briefing Wednesday, April 15, 2020, on the spread of the potentially deadly virus and the state's response marked his 39th straight. (Tyler LaRiviere/Chicago Sun-Times via AP, File)\nSPRINGFIELD, Ill. (AP) — Gov. J.B. Pritzker has spent countless hours plotting and planning strategy in the state’s race against the COVID-19 pandemic. Those who live in central and southern Illinois have noticed he’s done it almost exclusively from Chicago.\nChicago and Cook County account for 70% of the state’s 25,733 infections. But some people — mostly Republicans — complain that he’s neglected the rest of Illinois, even as it shares in the economic pain and social disruption from measures to curb the spread of the coronavirus. Thursday marked Pritzker’s 40th daily televised update, and the 29th in a row from his office in downtown Chicago.\n“They’re small things that people downstate take umbrage to and it’s understandable,” said Rep. Michael Marron, a Republican from Fithian in east-central Illinois.\n“I largely support the governor and the actions that he’s taken to keep us safe,” Marron said. “But he can listen to us a little bit better and he could have a better presence down here.”\nA one-time Carbondale mayor, Brad Cole, executive director of the Illinois Municipal League, understands needing to see the leader during a crisis. But a highly contagious virus is new territory. In this instance, Cole said travel has practical, as well as health, considerations: The politician’s small-town coffee-shop hangout is shuttered.\n“The rule book is being written as we go,” Cole said. “We know how to react to tornadoes and floods and fires. No one knew how to react to a pandemic disease.”\nSince daily briefings began March 9, Pritzker has made trips in mid-March to Springfield and the Murphysboro area. He closed nonessential businesses and on March 20 issued a stay-at-home order. He has not appeared publicly outside Chicago since.\nThat makes sense to Rep. Carol Ammons, an Urbana Democrat. He’s sought a halt to unnecessary travel “and he’s doing it as well,” she said. Republican Rep. Avery Bourne of Morrisonville countered that Pritzker can travel because “he said that government is essential work.”\n“There’s more to this state than Chicago and there’s more to this crisis and the response than Chicago,” Bourne said. If Pritzker’s stuck in the Loop, Lt. Gov. Juliana Stratton, who leads the Governor’s Rural Affairs Council, could be proxy, Bourne said.\nThe Associated Press asked Pritzker on March 29 when he would head south again, presuming he and his staff could avoid illness. He said he’s “not reticent” and promised a trip soon.\n“I always love to be in downstate Illinois,” Pritzker said. But with the virus’ brutal attack on the Chicago area, he said, “I’ve tried to make sure that I’ve been on hand to make decisions here.”\nPritzker’s briefings are available statewide and while it’s not his preference, the governor is following his own recommendation by “staying home as much as possible to limit exposure,” spokeswoman Jordan Abudayyeh said.\nThat touches another downstate nerve that has stung for decades: Chicago-based governors who spend too little time in the capital and its Governor’s Mansion. He could be just as effective in Springfield, according to GOP Rep. Terri Bryant of Murphysboro.\n“I don’t want him to do a tour around the entire state with an entourage, but I’d like to see him conducting the business of the state at the seat of government,” Bryant said. “It would give everyone in the state access to him instead of just Chicago.”\nMichigan’s Democratic Gov. Gretchen Whitmer, staring down a Detroit-area coronavirus hot spot, has worked mostly from the capital, Lansing.\nPritzker has been praised for his responsiveness. Ammons said he quickly stepped up testing in low-income communities requested by the Legislative Black Caucus. While the Illinois Municipal League asked Pritzker for weekly conference calls with the state’s mayors, Cole said they typically happen twice a week with up to 1,000 often fired-up local officials on the line.\n“He may be working out of Chicago right now because it is the Illinois epicenter,” Mark Eckert, Belleville’s mayor for 15 years, said. “I would have a problem with that if we weren’t getting answers, weren’t included, never heard his voice.”\n___\nFollow Political Writer John O’Connor at https://twitter.com/apoconnor", "url": "https://apnews.com/8eb901094eeabe1fdc88fb7fe584bc8d"}