{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:23:38", "date_modify": "2020-05-04 20:23:38", "date_publish": "2020-04-20 16:54:18", "description": "A homeless man evicted from a squatters’ camp waited on a bus in New Delhi, India. Another man slept atop a manhole cover in the middle of an empty street in Barcelona, Spain. The...", "filename": "_fec8c4bf20d88fc91b96f5d9f1dd6b54_1588623818.html", "image_url": "https://storage.googleapis.com/afs-prod/media/6044eeb82bc14d5d9022ee9809bb558c/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fec8c4bf20d88fc91b96f5d9f1dd6b54_1588623818.html", "title": "A week of images from the coronavirus pandemic", "title_page": "AP PHOTOS: A week of images from the coronavirus pandemic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "AP PHOTOS: A week of images from the coronavirus pandemic\nA homeless man evicted from a squatters’ camp waited on a bus in New Delhi, India. Another man slept atop a manhole cover in the middle of an empty street in Barcelona, Spain.\nThe coronavirus pandemic has upended countless lives that were precarious even in normal times. India’s homeless population, for instance, was affected when Indian Prime Minister Narendra Modi sought to make up for lost time by extending the world’s largest lockdown to head off the disease’s peak.\nElsewhere, daily life and religious observances carried on, albeit with many people wearing protective gear. A worker dressed head to toe in blue plastic cleaned windows at a hospital in Lima, Peru. A similarly dressed volunteer carried a cross during a service for Orthodox Good Friday in Bucharest, Romania.\nA body laying on a stretcher in Spain illustrated the strict virus precautions that extend beyond death. Since a state of emergency was declared in mid-March, Spanish funeral homes must follow measures to avoid further contagion. Infected corpses cannot be removed from sealed body bags and are placed straight into coffins.\nIn the United States, protesters agitated for a lifting of the restrictions that have brought much of daily life to a standstill. Demonstrators gathered in Salt Lake City to call for the Utah economy to be reopened. Gov. Gary Herbert says the state aims to reopen restaurants and gyms and resume elective surgeries in early May.", "url": "https://apnews.com/fec8c4bf20d88fc91b96f5d9f1dd6b54"}