{"authors": ["Opinion Kate Malt"], "date_download": "2020-05-04 16:51:15", "date_modify": "2020-05-04 16:51:15", "date_publish": "2020-04-08 10:29:25", "description": "Kate Maltby explains how humankind has fought previous plagues on and off the page and examines Shakespeare's work -- \"Romeo and Juliet\" in particular -- as a foundational example of the literature of pandemic.", "filename": "2020_04_08_opinions_covid-19-and-plague-literature-maltby_index_1588611075.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/160425183815-shakespeare-death-david-tennant-intv-quest-qmb-00000000-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_opinions_covid-19-and-plague-literature-maltby_index_1588611075.html", "title": "What Shakespeare can -- and can't -- teach us about Covid-19", "title_page": "What Shakespeare can -- and can't -- teach us about Covid-19 (opinion)  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Kate Maltby is a broadcaster and columnist in the United Kingdom on issues of culture and politics, and a theater critic for The Guardian newspaper. She is also completing a doctorate in Renaissance literature. The views expressed in this commentary are her own. View more opinion articles on CNN.\n(CNN) The wisdom of Twitter tells us that now is a time for writing masterpieces. Confined to our barracks of self-isolation, as if newfound responsibilities to home-schooling, elder care, and 24-hour self-sanitizing weren't enough, last week a widely shared tweet l ectured us : \"when Shakespeare was quarantined because of the plague, he wrote King Lear.\"\nIs it true? Like most viral Tweets, yes and no. As Professor James Shapiro told us in his recent bestseller 1606: William Shakespeare and The Year of Lear, no one can quite be sure when \"King Lear\" was written, though it may have been penned in the plague-affected summer of 1606, because its first attested performance occurred the following Christmas.\nBut Shakespeare's writing had been profoundly impacted by plague over 10 years earlier. The most serious outbreak of plague to occur in 30 years hit London between 1592 and 1594, during the entirety of which outbreak, as today, London's theaters were closed.\nDuring this period, the young Shakespeare did write significant works: the narrative poems \"Venus and Adonis\" and \"The Rape of Lucrece,\" and probably \"Romeo and Juliet.\" All three are riddled with the imagery associated with early modern plague. The very plot of \"Romeo and Juliet\" turns on an outbreak of this plague: returning from his failed mission to tell Romeo of Juliet's survival, Friar John laments that\nGoing to find a bare-foot brother out\nOne of our order, to associate me,\nHere in this city visiting the sick\nAnd finding him, the searchers of the town,\nSuspecting that we both were in a house\nWhere the infectious pestilence did reign,\nSeal'd up the doors and would not let us forth,\nSo that my speed to Mantua there was stay'd.\nAs many readers will know, Friar John can't deliver a letter to exiled Romeo in Mantua; Romeo believes Juliet dead and kills himself, and Juliet follows his example when she finds out.\nThe literature of pandemic\nRomeo and Juliet's story hangs on many such twists of chance and accident. Romeo doesn't just kill himself because of a missed letter; he falls for Juliet because he happens to go to the wrong party. ('Take thou some new infection to the eye', says Romeo's friend Benvolio in Act 1, encouraging him to go out on the town and find a girl to replace his previous crush, Rosalind.) He kills Juliet's cousin -- sparking the next fatal cycle of events -- because of a few ill-chosen words between young men who've run into each other on a street.\nThis is typical of literature written in times of infectious epidemic: AIDS literature, too, dwells heavily on the role of luck in infection and survival, and on the nature of survivor's guilt. Covid-19 literature will likely be the same. Covid-19 may be obviously fatal to the weak or elderly, but a fit young person's risk of death can still hinge on an unlikely chance encounter, or a randomly severe incidence. Now, in the developed world of 2020, going to the wrong party can again potentially kill people.\nIf we take Shakespeare as a model, what might we expect to see of the literature created in the lockdown of 2020? A renewed interest in coincidence and luck.\nBut before we think more about Shakespeare's literary lessons about plague, we should ask whether it is meaningful at all to compare coronavirus quarantine to the early modern experience of 'plague'. It's true that we are now experiencing something of what historic quarantines have been like: pre-modern plagues, like coronavirus, emptied our cities and left people bricked into their houses with bickering families, unable even to gather for funerals. Watching satellite images of mass graves being dug in Iran, I was reminded painfully of sixteenth century plague pits.\nFighting plague on the page -- and what's different about this disease\nWhat's different about this infectious disease from a literary perspective is that it hits us at a time when Western society, Europe in particular, is heavily secularized. Shakespeare's contemporaries had a range of differing supernatural explanations for the epidemics that hit Europe between 1347-1660 and -- crucially why some fit and healthy people survived while others didn't.\nAstrology was one potential explanation. A 1575 bestseller called \"Volumen Paramirum,\" by the alchemist Paracelsus, asserted that the stars were one of five key elements which determined a man's health. The idea became essential to early modern medicine and in Shakespeare's own Sonnet 14, he compares himself to plague-predicting astrologers:\nNot from the stars do I my judgement pluck:\nand yet me thinks I have astronomy,\nBut not to tell of good or evil luck,\nOf plagues, of dearths, or season's quality.\nEven at this point in history, it didn't escape notice that people could pick up the plague by contact with another, and some medical writers had theories of infectious contagion that don't look far wrong by today's standards. (It is an almost universal feature of plague literature that writers are struck by how a city's crowds, once a place of political excitement and liberating anonymity, become sites of extreme danger, banned and shunned.) Followers of the physician Galen wrote about \"miasma\" and \"corrupt air\" which supposedly spread droplets of plague, not unlike the aerosols that we are now told spread Covid-19.\nBut almost everyone accepted that God's disfavor had a role to play, whether it was a society or an individual that had offended. The root of the word \"plague\" is normally glossed as plaga, meaning \"blows\" or \"shots\"; in the foundational work of Western literature, \"The Iliad,\" the Greek archer god Apollo rains down a plague on the Greek army in the form of his infectious arrows. European Christendom was equally willing to blame epidemics on the blows of their own wrathful God.\nNot everyone living through Covid-19 will think spiritually about a viral pandemic as the believers of Shakespeare's era did. In some ways, that makes it harder for our societies to impose a rationale on the extreme unpredictability with which Covid-19 affects people. When it comes to victims of Covid-19 who are young and healthy, some barely experience any symptoms; others have been left fighting for life.\nAnother difference between Covid-19 and European plagues is it doesn't seem to leave marks on the body. Bubonic plague is famous for the 'buboes', dark red marks a bit like bruises, which mark the bodies of its victims. Throughout his early works, Shakespeare plays with the image of white and dark red patterns on a human body: in \" Venus and Adonis ,\" the two lovers infect each other with the breath of love until their faces become red and white and Adonis dies -- albeit in a hunting accident -- leaving behind a purple and white flower.\nWhat Shakespeare can -- and can't -- teach us about Covid-19\nMuch traditional plague literature plays off the way these markings on the body become a form of medical language, speaking the bodies experience even when the victim's tongue has been silenced by death. (A text which can also 'communicate' the disease by contagion.) As Ernest B. Gilman, one of the leading writers on early modern plague in literature, tells us : \"if we seek a 'plague discourse,' we will find it... fundamentally in the belief in Reformation culture that plague is itself a form of (divine) utterance, and a form of writing that inscribes itself in the natural world, in the body politic, and in the 'tokens; to be read on the bodies of the afflicted.\" Coronavirus does not write this form of text across the pages of our bodies.\nWhat else do we learn when looking at Shakespeare's plague poems and plays today? First: we don't all have the luxury to write like Shakespeare. While many of us are juggling the stress of working our day jobs from home or worrying about how to make ends meet on furlough, there is good evidence that Shakespeare spent 1593 and 1594 at Titchfield, the country home of his patron the Earl of Southampton. (Southampton is one of the likely suspects for the model of 'the Fair Young Man' in Shakespeare's sonnets, and was possibly Shakespeare's lover.) The playwright had left his wife in Stratford upon Avon to raise their three children. Plague quarantines are always easier for some than others.\nPhotos: Titus Andronicus (Poland) – Teatr Rekwizytornia, 2006. Designer: Tomasz Boguslawski Hide Caption 1 of 11 Photos: Antony and Cleopatra (Germany) – Imagine Theatre, 2013. Designer: Lex Drewinski Hide Caption 2 of 11 Photos: Romeo and Juliet (United States) – Curio Theatre, 2013. Art director, designer and photographer: Kyle Cassidy Hide Caption 3 of 11 Photos: Othello (Croatia) – Gradsko dramsko kazaliste Gavella, 2015. Art director and designer: Vanja Cuculic Hide Caption 4 of 11 Photos: Macbeth (United Kingdom) – Royal Shakespeare Company, Royal Shakespeare Theatre, Barbican Theatre, 1982. Designer: CS&S Design Partnership; Illustrator: Ralph Steadman Hide Caption 5 of 11 Photos: Romeo and Juliet (Germany) – Strassentheater, 2007. Art director and designer: Lex Drewinski Hide Caption 6 of 11 Photos: Julius Caesar (Israel) – Habima National Theatre, 1961. Designer: Dan Reisinger Hide Caption 7 of 11 Photos: The Comedy of Errors (Japan) – Tokyo Ryogoku Theater X, 2011. Art director and designer: Ayako Nagai Hide Caption 8 of 11 Photos: King Lear (Poland) – Krawkowski Teatr Scena Stu, 2013. Designer and photographer: Katarzyna Zapart Hide Caption 9 of 11 Photos: The Winter's Tale (Japan) – Sakura Hall of Shibuya Cultural Center Owada, 2011. Art director: Kiyoaki Ichikawa; Designer: Kaori Sato; Illustrator: 100% Orange Hide Caption 10 of 11 Photos: Presenting Shakespeare – Presenting Shakespeare by Mirko Ilic and Steven Heller (Princeton Architectural Press) is out now. Hide Caption 11 of 11\nThe second lesson is that, yes, profoundly moving literature can come from a time of quarantine. \"Romeo and Juliet\" moves audiences to tears around the world each day. (Or did, when live performance spaces were still part of our lives.) But what's striking about Shakespeare's plague literature is that most of its references to London's experience of plague are obscure, or heavily coded. It surfaces instead in a series of metaphors -- references to 'bad air', confinement, astrology (Romeo and Juliet are indeed 'star-crossed') and to tell-tale 'red and white' skin (often a reference to those fatal buboes).\nWhen Romeo feels like he's going mad with love, he feels like he is \"bound more than a mad-man is, shut up in prison\"; he insists to Juliet that \"stony limits cannot hold love out,\" while she in turn frets that her lover's initial appearance may be deceptive, like \"vile flesh... fairly bound in a gorgeous palace.\" Eventually Juliet finds herself buried alive in a stone mausoleum, \"poor living corpse, closed in a dead man's tomb.\" These should feel like familiar anxieties to anyone immured indoors during quarantine; Juliet never sees natural light again after she drinks the Friar's potion. We know that plague is present in Verona, where Juliet lives, because Friar John is quarantined \"here in this city,\" before he leaves for Mantua.\nBut what really shows us that Romeo and Juliet is taking place in a society shaped by the plague is the moment when Romeo spots Tybalt's body in the Capulet mausoleum, not buried in a tomb but exposed in his \"bloody sheet.\" As Vanessa Harding, an expert on early modern death, has pointed out, during plague outbreaks in early modern Europe the dead began to be buried only in winding sheets or shrouds, as the price of coffined burial had rapidly risen. Plague isn't just the reason Romeo's letter doesn't arrive in time; it's the reason Juliet and her cousins are no longer being buried in stone tombs. https://archives.history.ac.uk/cmh/epiharding.html\nWhy we turn to literature to survive\nWhen Shakespeare was writing \"Romeo and Juliet\", he was writing after surviving a profound civic trauma. In 1995, the critic Geoffrey Hartman defined \"trauma literature\" as a genre of literature which expresses unconsciously experiences too traumatic, and too far from human utterance, for conscious expression. Plague literature almost always falls into this category not least because it deals with societal traumas forcibly confined to individual households, so that normal communication about the trauma is closed precisely because of its communicability. To write explicitly about one's quarantine experience is to expose the domestic secrets of your family.\nWe are all superstitious about naming the illness we view as plagues -- in London, the \"the big C\" has already come to mean Covid-19 instead of cancer; for much of the AIDS pandemic, people were scared to say the words \"AIDS\"or \"HIV.\" Susan Sontag f amously said of cancer and tuberculosis that \"the very names of such diseases are felt to have a magic power.\" Thus when Ben Johnson wrote a lament for the death of his seven year old son in 1616, he left the disease unnamed. It was, of course, the plague.\nWriters adopt a similarly euphemistic approach in literary fiction. Whether 1592 or 2020, when writers are locked up at home with plague wardens patrolling the street, they are likely to write about confinement, about loneliness and isolation, or about symptoms and smell, but with a few exceptions, they rarely confront head-on the illness stalking their psyches. Those who have created fictional narratives explicitly about epidemics -- Albert Camus' \"La Peste\" (The Plague) being the obvious example --- rarely write from personal experience.\nThe struggle for power, on and off the page\nMeanwhile, political authorities around the world have used outbreaks of contagious illness to strengthen their own power or justify existing ideologies. The Romans knew it: back in the first century AD, the political exploitation of seemingly 'supernatural' disasters is a central theme of Lucretius' Latin poem, \"De Rerum Natura.\" In Hungary recently, the authoritarian Viktor Orbán pushed \"emergency coronavirus\" legislation through his supine Parliament to allow him to rule by decree and to jail journalists for up to five years for disseminating \"fake news\". (Orbán has been attempting to limit journalistic freedom in Hungary for years.)\nEarly modern authorities were quite capable of similar hypocrisy: the puritan-dominated City of London, engaged in a long running battle against the city's theaters, twice complained to the Privy Council that \"to play in plague time is to increase the plague by infection: to play out of plague time is to draw the plague by offendings of God upon such plays.\" If you want to read about the ways quarantine was used to segregate society and impose political control during London's plague crises, the work of the academic Margaret Healy is an excellent place to start.\nPerhaps the most famous line in \"Romeo and Juliet\" is the dying curse of Mercutio: killed in the quarrel between two families to which he doesn't belong, he spits out: \"a plague o'er both your houses.\" Although often quoted as \"a plague on both your houses,\" \"o'er\" actually means \"over\". (Some editions have a'.) In this reading, he's not so much calling for a plague to hit both houses, as for both Montague and Capulet households to be marked, as the doors of quarantined households were in plague, with a visible symbol that warned others of infectious danger.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\n\"Romeo and Juliet\" is a story of civil unrest and the attempts of civic authorities, like the Prince of Verona, to control the uncontrollable. During epidemics, our leaders attempt to banish sources of infection, to visibly mark and isolate dangerous households, or to sacrifice some lives to save others. \"Romeo and Juliet\" ends, of course, with the death of the protagonists. Theorists like Rene Girard and Derrida read this as a necessary sacrifice to restore civic order, as if Romeo and Juliet can both function as scapegoats for whatever caused this outbreak of violence.\nWe should hope that such sacrifices aren't required in the pandemic of 2020. We should hope too that we can rise above the urge to scapegoat people for the tensions that will follow. Let's not pretend, either, that any creative flowering inspired in quarantine makes up for this public tragedy unfolding. \"Romeo and Juliet\" is a masterpiece, but there's no cultural response to today's pandemic that can be worth a single death.", "url": "https://www.cnn.com/2020/04/08/opinions/covid-19-and-plague-literature-maltby/index.html"}