{"authors": ["Analysis Brian Lowry"], "date_download": "2020-05-04 16:28:19", "date_modify": "2020-05-04 16:28:19", "date_publish": "2020-04-07 16:38:55", "description": "\"Modern Family\" says goodbye Wednesday night, with the Emmy-winning sitcom's series finale offering a potential welcome distraction from unsettling current events. Just as another family comedy, \"The Cosby Show,\" did almost 30 years ago.", "filename": "2020_04_07_entertainment_modern-family-finale-column_index_1588609699.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406144326-modern-family-mitch-and-cam-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_entertainment_modern-family-finale-column_index_1588609699.html", "title": "'Modern Family' signs off amid a crisis, like 'The Cosby Show' did in 1992", "title_page": "'Modern Family' signs off amid a crisis, like 'The Cosby Show' did in 1992 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) \"Modern Family\" says goodbye Wednesday night, with the Emmy-winning sitcom's series finale offering a potential welcome distraction from unsettling current events.\nJust as another family comedy, \"The Cosby Show,\" did almost 30 years ago.\n\"Modern Family,\" the ABC series, will air a final one-hour episode -- following a retrospective of the program's 11-year, 250-episode run -- with viewers staying indoors due to the novel coronavirus.\n\"Cosby\" -- one of the highest-rated programs of all time -- aired its finale amid a more localized event, the outbreak of the Los Angeles riots in the wake of acquittal of police officers charged with the beating of motorist Rodney King. For Los Angelenos, the scenario of temporarily escaping bad news by watching a long-running comedy has clear parallels.\nOn April 30, 1992, \"The Cosby Show\" aired its 201st episode. But the program also included a special message recorded by its star, Bill Cosby, which played on KNBC-TV in Los Angeles, telling viewers, \"Let us all pray that everyone from the top of the government down to the people in the streets . . . would all have good sense. And let us pray for a better tomorrow, which starts today.\"\nRead More", "url": "https://www.cnn.com/2020/04/07/entertainment/modern-family-finale-column/index.html"}