{"authors": ["Eric Bradner", "Dan Merica"], "date_download": "2020-05-04 16:54:51", "date_modify": "2020-05-04 16:54:51", "date_publish": "2020-04-08 21:44:21", "description": "The coronavirus pandemic has ignited a new fight over voting access, with some states looking to expand vote-by-mail options and President Donald Trump digging in against those efforts.", "filename": "2020_04_08_politics_vote-by-mail-fight-by-state_index_1588611291.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407122945-06-wisconsin-voting-lines-0407-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_vote-by-mail-fight-by-state_index_1588611291.html", "title": "Here's why there's a battle brewing over expanding voting by mail", "title_page": "Trump leads opposition as more states expand voting by mail ahead of November election - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The coronavirus pandemic has ignited a new fight over voting access, with some states looking to expand vote-by-mail options and President Donald Trump digging in against those efforts .\nInterest in conducting elections by mail has mounted in both parties in recent weeks: Democrats in Congress and in statehouses are pushing for more funding for states' efforts to expand vote-by-mail access. And the Republican top elections officials in Georgia and Ohio are sending every voter in their states absentee ballot request forms ahead of their primaries.\nBut in Wisconsin , voting access became a partisan battle, as the Republican-controlled state legislature and state Supreme Court blocked Democratic Gov. Tony Evers' efforts to delay the primary and mail absentee ballots to every voter.\nTrump -- who has long embraced conspiracy theories about voter fraud -- is leading the charge against increased voting by mail. He lied about mail-in ballots at a White House press briefing Tuesday, claiming that \"people cheat\" and that \"the mail ballots are corrupt, in my opinion.\"\nVote-by-mail advocates point out that a handful of states, including the GOP-dominated state of Utah, already conduct their elections entirely by mail, and that a number of studies have found no evidence of widespread voter fraud in the United States.\n\"If you look at the pictures that America saw last night coming out of Wisconsin, I believe we've got to say this is no longer a partisan issue. This is a decency issue,\" said Oregon Sen. Ron Wyden, a Democrat who has pushed vote-by-mail legislation since 2002 and pointed out that in his state, it was Republicans who initially led the push for mail-in balloting. \"This is a fundamental judgment about the decency we've always had as Americans where we say, of course we're going to protect the well-being of our people.\"\nHere's a look at the vote-by-mail laws across America:\nAll-mail elections\nFive states conduct their elections entirely by mail: Colorado, Hawaii, Oregon, Utah and Washington.\nThe rules vary slightly by state, but generally: Every voter is mailed a ballot at the address where they are registered. Those who need ballots sent elsewhere -- such as military members who are stationed overseas -- can submit absentee ballot requests to have theirs redirected.\nIn three other states -- California, Nebraska and North Dakota -- counties have the option of conducting their elections entirely by mail.\nSome of California's largest counties -- including Orange County, the site of a handful of competitive congressional districts -- now mail every voter a ballot -- though voters can also go to regional \"vote centers\" to cast their ballots if they prefer.\nThere are potential problems with absentee voting that don't exist with in-person voting: Ballots can be thrown out if they aren't postmarked or returned in time; if voters forget to sign them; or if the signature on the ballot doesn't match the one on the voter's registration.\nAs states have increasingly looked to voting by mail amid the coronavirus crisis, some Republicans have said they oppose such a move -- particularly in Georgia.\n\"This will be extremely devastating to Republicans and conservatives in Georgia,\" state House Speaker David Ralston, a Republican, told FetchYourNews, an outlet in North Georgia. He later said that his concerns were expressly about fraud.\nStacey Abrams, the Democrat who ran and lost against Georgia Gov. Brian Kemp in 2018, created the voting rights group Fair Fight after her loss and has pushed the use of vote by mail, not only in the Georgia primary, but in the general election in November.\n\"We know that the best solution is access to vote by mail,\" Abrams said on a recent video conference with donors. \"We know it works.\"\nNo-excuse absentee voting\nMost states allow voters to request and submit absentee ballots without explaining their reasoning.\nPennsylvania last year and Virginia this year became the latest to scrap their mandates that voters have an excuse to request absentee ballots.\nThey joined Alaska, Arizona, California, Florida, Georgia, Idaho, Illinois, Iowa, Kansas, Maine, Maryland, Michigan, Minnesota, Montana, Nebraska, Nevada, New Jersey, New Mexico, North Carolina, North Dakota, Ohio, Oklahoma, South Dakota, Vermont, Wisconsin and Wyoming, as well as Washington, DC.\nDelaware lawmakers are currently considering a measure that would implement vote-by-mail options for the entire state in time for November's election.\nLast fall, New Hampshire Republican Gov. Chris Sununu vetoed a bill that would have added his state to the ranks of those allowing all voters to cast their ballots by mail.\nSome states are considering temporarily joining the ranks of those with no-excuse absentee voting as they deal with the coronavirus crisis.\nNew York Democratic Gov. Andrew Cuomo said the state would allow no-excuse absentee voting for its upcoming primary, and Connecticut Democratic Gov. Ned Lamont this week said he was working toward the same goal. Indiana's elections commission said all voters could vote by mail in this year's primary.\nMore limited absentee voting\nEighteen states, mostly in the South and the Northeast, require excuses -- such as disability, religious observance, being required to work during polling hours or being out of town -- of those who request absentee ballots.\nIn the South, Alabama, Arkansas, Kentucky, Louisiana, Mississippi, South Carolina, Tennessee and Texas require excuses to cast absentee ballots.\nIn the Northeast, Connecticut, Delaware, Massachusetts, New Hampshire and New York require excuses.\nIndiana, Missouri and West Virginia also require voters requesting absentee ballots to have qualifying reasons to do so.\nA major question facing states that require excuses to request absentee ballots is now whether the coronavirus pandemic qualifies as a valid reason.\nThe Texas Democratic Party this week sued, with party chairman Gilberto Hinojosa complaining that the state's Republican governor and secretary of state have failed to issue \"concrete guidance to county election officials on whether voters can cast a mail-in ballot during the coronavirus pandemic.\"", "url": "https://www.cnn.com/2020/04/08/politics/vote-by-mail-fight-by-state/index.html"}