{"authors": ["David Biller"], "date_download": "2020-05-04 20:08:25", "date_modify": "2020-05-04 20:08:25", "date_publish": "2020-04-06 17:49:46", "description": "RIO DE JANEIRO (AP) — China’s embassy in Brazil responded with outrage Monday to a social media post by Brazil’s Education Minister Abraham Weintraub that appeared to mock Chinese accents while...", "filename": "_ef51f83037c312fa3cde9c1874ed13e2_1588622905.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8ae2af4f6c564e99aafa53f27cf24881/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ef51f83037c312fa3cde9c1874ed13e2_1588622905.html", "title": "Brazil stumbles into new China diplomatic row over virus", "title_page": "Brazil stumbles into new China diplomatic row over virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Brazil's President Jair Bolsonaro greets supporters and journalists as he arrives to give a news conference on the new coronavirus at Planalto presidential palace in Brasilia, Brazil, Friday, March 27, 2020. Even as coronavirus cases mount in Latin America’s largest nation, Bolsonaro is calling the pandemic a momentary, minor problem and saying strong measures to contain it are unnecessary. (AP Photo/Andre Borges)\nBrazil's President Jair Bolsonaro greets supporters and journalists as he arrives to give a news conference on the new coronavirus at Planalto presidential palace in Brasilia, Brazil, Friday, March 27, 2020. Even as coronavirus cases mount in Latin America’s largest nation, Bolsonaro is calling the pandemic a momentary, minor problem and saying strong measures to contain it are unnecessary. (AP Photo/Andre Borges)\nRIO DE JANEIRO (AP) — China’s embassy in Brazil responded with outrage Monday to a social media post by Brazil’s Education Minister Abraham Weintraub that appeared to mock Chinese accents while insinuating the Asian giant stood to benefit from the coronavirus pandemic — apparently reigniting a smoldering diplomatic row between Brazil and its largest trading partner.\nThe embassy described the post as “defamatory,” “stigmatizing,” “completely absurd and despicable,” and “having a strongly racist manner.”\nWeintraub posted a cartoon depicting China with a message -- with r’s swapped for l’s, apparently to ridicule the Chinese accent -- that insinuated the Asian giant could gain geopolitical advantages from the ongoing pandemic. The dispute comes just weeks after President Jair Bolsonaro sought to pacify a similar dispute sparked by his son.\n“We demand that some Brazilian individuals immediately correct the errors they have committed and stop with unfounded accusations against China,” said the embassy statement published just after midnight. China’s ambassador Yang Wanming followed up hours later, saying he still awaits an official declaration from Brazil’s government.\nThe blowup comes at an inconvienient time for policymakers from Latin America’s largest economy, who are scrambling for measures to minimize the looming recession spawned by the virus. China gobbles up Brazil’s soy, iron and crude oil, and its $14 billion in exports to China in the first quarter of 2020 were equal to 29% of its global total.\nDuring Bolsonaro’s 2018 presidential campaign, he issued a series of attacks against China, calling its people “heartless” and saying he wouldn’t let it buy up Brazil. Since taking office in January 2019, however, he has reined in his vitriol, struck a more conciliatory tone and traveled to Beijing where he met China’s President Xi Jinping and courted foreign investment to help the economic recovery.\nBolsonaro’s son Eduardo, a lawmaker who chairs the lower house’s foreign relations committee, said on social media on March 18 that, similar to the Soviet Union’s response to the Chernobyl nuclear accident, the Chinese government had covered up the new coronavirus and was to blame for lives lost. China responded with open criticism, including from its ambassador.\nPresident Bolsonaro worked to patch things up on a March 24 phone call to Preident Xi, with several ministers sitting beside him. Vice-President Hamilton Mourão explained away the incident publicly, saying the younger Bolsonaro doesn’t form part of his father’s administration and his statement didn’t reflect policymakers’ opinions. That excuse wouldn’t apply to Cabinet member Weintraub.\nThe press office of the presidency declined to comment on why Weintraub made the post or removed it. The press office of the Education Ministry didn’t respond to a request for comment.\n“It is becoming quite serious now, because it is escalating,” said Maurício Santoro, an international relations professor at Rio de Janeiro’s state university, with a focus on China. “It was bad enough with the president’s son saying these things. Now it’s a minister, someone who is part of the government. It’s much more complicated. Even if I don’t believe this is part of a big plan, something organized, it is hard for the Chinese government to believe that.”\nThere is some basis for criticism of Chinese government’s outbreak response, Santoro said by phone, particularly in the crucial first weeks, during which it silenced some who were sounding the alarm. And that’s providing ammunition to some in Bolsonaro’s administration with an anti-globalist bent, and who frequently turn to social media to mobilize their support base, he said.\nOn Monday, one of the top trending topics on Brazilian Twitter was #ChineseTradeBlockadeNow. Another was “Weintraub,” the minister who had made the controversial post over the weekend.", "url": "https://apnews.com/ef51f83037c312fa3cde9c1874ed13e2"}