{"authors": ["Madeline Holcombe", "Jacqueline Howard", "Gisela Crespo"], "date_download": "2020-05-04 17:00:03", "date_modify": "2020-05-04 17:00:03", "date_publish": "2020-04-09 08:33:29", "description": "Two separate research projects suggest that the novel coronavirus may have been circulating in New York City earlier than thought and the earliest cases likely originated with travelers coming from Europe and other parts of the United States, not Asia.", "filename": "2020_04_09_health_new-york-_eff9fb2a04930fdd64e858536310acbe_index_1588611603.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409092842-new-york-jfk-coronavirus-travel-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_health_new-york-_eff9fb2a04930fdd64e858536310acbe_index_1588611603.html", "title": "Study shows New York's outbreak came from Europe and other parts of the United States", "title_page": "Study shows New York's outbreak came from Europe and other parts of the United States - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Two separate research projects suggest that the novel coronavirus may have been circulating in New York City earlier than thought and the earliest cases likely originated with travelers coming from Europe and other parts of the United States, not Asia.\nThe new data come from the Icahn School of Medicine at Mount Sinai and the NYU Grossman School of Medicine.\nWith more than 80,000 cases and 4,260 coronavirus deaths, according to the city's website , New York is one of the major epicenters for the coronavirus outbreak in the United States.\nOn March 1, New York Mayor Bill de Blasio reported the city's first novel coronavirus case had been confirmed. \"The patient contracted the virus during recent travel and is isolated in her home under close monitoring,\" de Blasio wrote in a Twitter post that night.\nSoon after, the city that never sleeps cautioned against public gatherings, and New Rochelle, New York, closed schools as the virus spread quickly there.\n'It's all hands on deck now'\nNow new data from NYU Langone Health suggests that the novel coronavirus has been spreading in New York for a couple of months now -- long before testing started -- and a genetic analysis of viral samples in the city indicate that they originated in Europe, according to an announcement from the academic medical center on Thursday.\nJUST WATCHED Virus hunters look for a culprit Replay More Videos ... MUST WATCH Virus hunters look for a culprit 05:32\nThe announcement notes that this early data was based on examining the genetic material of the novel coronavirus taken from 75 patients in New York City. Nasal swab samples were collected from the patients at Tisch Hospital, NYU Winthrop Hospital and NYU Langone Hospital Brooklyn.\n\"As viruses evolve during transmission from person to person, their sequences can help researchers to zero in on the provenance, or place of origin, of that specific infection,\" Dr. Matija Snuderl, leader of the clinical testing team and director of molecular pathology and diagnostics at NYU Grossman School of Medicine, said in the announcement.\nJUST WATCHED New York City reports more than 800 Covid-19 deaths in 1 day Replay More Videos ... MUST WATCH New York City reports more than 800 Covid-19 deaths in 1 day 02:52\nThe new data has not been published yet in a report, pre-print paper, study or peer-reviewed journal.\n\"We're just starting this project, but will soon be sequencing 192 viral samples per week with the goal of offering thousands of sequences for analysis in the near future,\" Adriana Heguy, leader of the research team and director of the Genome Technology Center at NYU Langone Health, said in the announcement.\nHeguy added in an email on Thursday that \"we want the whole community to have access as soon as we have the data. It's all hands on deck now.\"\nThe 'dynamics of the pandemic'\nSeparately, a pre-print study from Mount Sinai , published online Thursday at medRxiv and not yet peer-reviewed, involved sequencing and analyzing 90 complete coronavirus genomes from 84 Covid-19 patients who sought care in the Mount Sinai Health System between February 29 and March 18.\nThe cases came from two towns in Westchester county and 21 New York City neighborhoods across Manhattan, Bronx, Queens and Brooklyn. Those cases were analyzed along with 2,363 publicly available coronavirus genomes from around the world.\nThe Mount Sinai study traced the cases in the city and found there is \"limited evidence\" supporting that the virus was directly introduced there from China, where the coronavirus originated. China was under the United States' early travel restrictions in February\n\"With increased testing, we observed the emergence of community acquired infections with the majority of the community cases caused by viral isolates from clades that are of European origin,\" the researchers wrote in the Mount Sinai study.\n\"Taken together, we provide a first analysis of the SARS-CoV-2 viral genotypes collected from patients seeking medical care,\" the researchers wrote. \"We find that New York City, as an international hub, provides not only a snapshot of the diversity of disease-causing SARS-CoV-2 at the global level but also informs on the dynamics of the pandemic at the local level.\"\nFauci: 'It's just not surprising'\nThe findings in these emerging data -- that the novel coronavirus may have been circulating in New York earlier than thought, with most cases from Europe -- are \"probably correct,\" the nation's top infectious disease expert, Dr. Anthony Fauci, said during an appearance on \"Good Morning America\" on Thursday.\nJUST WATCHED Italy's coronavirus patients are dying alone Replay More Videos ... MUST WATCH Italy's coronavirus patients are dying alone 02:01\n\"Europe became the epicenter pretty quickly after China really exploded with their cases,\" Fauci told ABC's George Stephanopoulos.\n\"We cut off the travel from China relatively early and we were seeded with a relatively few number of cases from China but very quickly the epicenter switched to Europe, particularly northern Italy,\" said Fauci, the director of the National Institute of Allergy and Infectious Diseases\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\n\"Given the travel and the air traffic from anywhere in Italy, but also particularly northern Italy, it's just not surprising that unfortunately and inadvertently New York was seeded before they really knew what was going on,\" Fauci said. \"And that's why they're in the difficult situation that they're in right now -- a very unfortunate situation.\"", "url": "https://www.cnn.com/2020/04/09/health/new-york-coronavirus-outbreak-europe-origin/index.html"}