{"authors": ["Kyung Lah"], "date_download": "2020-05-04 15:59:27", "date_modify": "2020-05-04 15:59:27", "date_publish": "2020-04-01 10:50:40", "description": "As of 2019, there were an estimated 30.7 million small businesses in the US, employing 59.9 million people, or almost half of the private sector workforce. Small businesses drive the American economy, but as the coronavirus pandemic has proven, they do so from a cliff. Many are about to fall off.", "filename": "2020_04_01_business_one-block-small-businesses-los-angeles_index_1588607967.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330164859-02-one-block-small-business-neighborhood-colorado-boulevard-la-super-tease.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_business_one-block-small-businesses-los-angeles_index_1588607967.html", "title": "One block in America. Six businesses on the brink of disaster", "title_page": "One block in America. Six businesses on the brink of disaster - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Los Angeles (CNN Business) As of 2019, there were an estimated 30.7 million small businesses in the US , employing 59.9 million people, or almost half of the private sector workforce. Small businesses drive the American economy, but as the coronavirus pandemic has proven, they do so from a cliff. Many are about to fall off.\nBehind those numbers are the actual people who own and work at the small businesses. It's impossible to tell all of their stories, but we can tell some. So last week we talked to the owners of six small businesses on a block of Colorado Boulevard in Los Angeles about their hopes and fears right now.\nThe block and its businesses are very much unique, made up of a group of independently-owned stores in the heart of a gentrifying community in eastern Los Angeles. But you could transplant them anywhere in the country -- any town, any large city -- and the stories would be much the same.\nMost of the business owners on the block are women, and many are minorities, reflecting a growing trend in the US. They went into what they do with a leap of faith — and a lot of financial risk. Now they're on the brink of ruin. Money may be coming from Washington in the next few weeks; they may not make it that long.\nBelow are their stories, as they told them. Quotes have been edited for length and clarity.\nValerie Brown, owner, Eagle Rock Community Acupuncture. Open since 2009.\n\"I wanted to find a place where I could foresee there being foot traffic, Colorado Boulevard is great. I signed the lease in 2008. Both these financial times were and are gloomy, that's for sure. I didn't have as much at stake back then. I was moving into a situation where I thought, 'Oh, things are going to be getting better.' Now I'm in a situation where things were fine and now they're getting worse.\nI'm very attached to my community. When I go into Trader Joe's I know people. This business has been around for so long, we remember each other. I miss the connection. I feel for all of us shopkeepers.\nIf I know that we're going to be back in business up and running by May, I think I have enough to get by. If it takes until June, I still think I could do it, but I'd be awfully nervous. If it doesn't look like we can go back by June, I think I'm going to have to cease this business model because it's just not going to be viable. I sure hope that that's not the situation. I hope that at some point this year, we'll all be back to eating in restaurants, going to movies, getting community acupuncture. It would be heartbreaking because of all the connections I've made. And, you know, the patients mean a lot to me, and the community means a lot to me.\nI do hope that California will find a way to be lenient with the small businesses and perhaps give us back some of the money that we've pre-paid in order to be in business in the year 2020. We'd need abatement on the rent. To have to pay rent, when we can't work, we'd be drowning in a lot of debt.\nSo far from what I've heard, [the stimulus packages are] probably going to benefit big industries most. Probably hotels, airlines, things like that. Something funny I heard recently was, [what if] if the small business owners received the stimulus and Wall Street had to set up a GoFundMe account instead of it being always in reverse. I'm just not optimistic that something that would help small businesses and not give big handouts to the people who don't need it.\"\nSamara Caughey, owner, Purple Twig, a children's art studio. Open since 2009.\n\"It's always a financial risk, always a leap of faith to own your own small business. I started very small. I rented a storefront, did the minimum to get the space ready, and opened up. I hoped parents would drop their kids off to make art, and they did! Then it grew from there.\nWhen I moved there, it was me and Peek-a-boo, a children's indoor play place. In the last 10 years, Colorado Boulevard has grown into a place that the community desires. A lot of the businesses are owned by women. The community has been welcoming. They all have an identity — each storefront. All have a passion, all believe in what they're doing.\nThis situation is very overwhelming, that's the best word I can use to describe it. We're all going through it. I don't feel like, 'oh poor me.' I'm trying to focus on creative thinking! I'm offering subscriptions for children age 5 to adults. Seems more important than ever to express yourself.\nI am also fortunate that much of my income comes from summer camp. As long as they register, I have income. If this goes on through summer, I will have to close. That would be such a shame. We are so important to this community in making it vital. If we have to shut down, so many would be affected.\nI can hold on until the end of May. Hopefully we get a handle on this situation by then.\nA loan will not do anything for me or most of the shops on this street. Unless we can get grant funding, that's what we need. Leave the large businesses to get the loans. It becomes more and more apparent we're on a welfare system for the rich where we give millions to the large businesses. They can afford the loans. We can't.\"\nJen Yates and Alex Hartunian, owners, Studio Metamorphosis, a fitness center. Open in this location since 2017.\nAlex: Any small business can owner can relate. It is not easy.\nJen: We just put everything together and ... I mean scrounged every single dollar, every penny to open, and we did it. Alex did all of the construction there. He literally poured in blood, sweat and tears, with his own hands.\nAlex: It was really abrupt. We saw the world changing around us. And I was terrified. It was scary and Jen was equally scared. And we were just like, 'How are we going to survive... we're gonna wake up the next morning and have zero income. Like, how does that work?'\nJen: When you put everything into watching something grow, and then it stops suddenly, it's so painful. I was sitting on the floor, just sobbing. Seeing it empty on a day where it should have been full was just heartbreaking to me. This has been my dream, opening up a studio. It was everything, our whole lives, and it's just gut wrenching.\nAlex: Yeah, we're scared.\nJen: Yeah, I mean, I think each day, we look at each other and [think], 'How are we going to make this work, how are we going to stay afloat?' But yeah, we're scared like everybody else in the world, because the uncertainty is the scariest part of it.\nAlex: If we have like hundreds of thousands of dollars of debt in three, four months, what's the point? How will we open? Will people be ready to jump right back into business? Will people still be scared? And the more time goes on, the more the financial equation becomes looming in terms of like, a huge, huge problem. ...\n[Debt] forgiveness is going to be probably the number one thing that's going to put people at ease and make them comply with the stay at home order. People are scared so they're doing side work. People are getting out there and maybe perpetuating this virus. People want to know that if they hang tight [that] the government [will] tell us, 'Nothing's going to happen to your credit, you're not going to lose your home, you're not going to lose your place of business, and everybody just needs to be in this together.' That's the message out there, but we need to hear that from our government.\nJen: We have to take care of our staff. I mean, we're not producing income, and they're not getting paid. And it's heartbreaking because they're starting their families and some of them are getting married now and they're beginning to start a whole new chapter in their lives, and they're so scared about what all this means for them. ... Alex and I will continue to fight and do whatever we can to generate some income to stay afloat. When challenges are presented I don't back away, and I'm going to keep moving forward and fight for it.\nLaura Porter, owner, Bloom School of Music and Dance. Open since 2008.\n\"My husband and I started Bloom back in 2008. At first, it was just the two of us, teaching everything that we could teach, while holding down other jobs. Both of us have been musicians and educators for decades, and we were being sent all the kids who wanted to quit. We decided we wanted to teach music education differently. I want to build a school with teachers who have like minds, who treat every student completely individually. Let's feel and express the beat in different ways, hear the rhythmic echoes and play games and feel that joy before we tell them to sit still and listen to the adults.\nIt's really brought all of us together and sharing. Sharing ideas, trying to figure out a better way to do something, and really feeling like we're in it together. It's not showing up between three and eight to do your thing and then you're going home. You know, everybody in the whole school is thinking about this 24-7. We're kind of approaching our business in a lot of ways like educators — How can we do this better? How can we make it more engaging? How can we bring more joy?\nLike most of the schools across the country, everyone's on Zoom, [somehow,] doing live streaming, to keep things going. So far, we're holding strong. It's not April 1st yet so that's when payments are due. But right now we're holding strong.\nIt's so frightening because it's a day-by-day thing. You know, I can't even look at September because there's no history in our lifetime for this, right? For anyone, it's not just the businesses, it's all the people that have supported those businesses over the years.\n[Elected officials] have to listen to the average American out of work. They always talk about how important it is for everybody to spend. If they're out of work, they can't spend. They have to put themselves in other people's shoes and small businesses are a big part of that. [If] they help small businesses, it can help the people that work for them.\"\nMichelle Helseth, owner, Native Boutique, a clothing store. Open in this location since 2014.\n\"I bought my house here when my daughter was three, so 19 years ago. I always wanted to open up a shop in our neighborhood.\nI think this block, this is the heart of the neighborhood. You could do everything from buying wine to cheese to having breakfast and lunch. Going shopping, buying a gift, to having your kids get educated with arts and music and dance or just going to having a children's birthday party next door. We just have everything on this block, all independently owned, all individual owners, majority women-owned.\nThe whole world is trying to process this new reality. It's so fictional. This is something we would see in a movie theater but it's happening.\nAs far as business, it's just come to a screeching halt.\nAnd then workman comp's insurance tried to draw from my account. I have no staff, what's the point? So I have to call my workman's comp and say, 'You know I have no staff right now so there's no reason for you to deduct my account.' I just invested in all this inventory. And so I'm extended, expecting for sales pick up in March and April, to get us back where we needed to be. I wish I was able to have reserves. We just don't. We're a small business where I'm a single mom. It's not like I have a husband bringing another income or, or a partner, I don't. This is my everything here.\nI'm concerned about going deeper into a hole, more debt. We need financial support to help us get through this from our government. We need grants, not just loans. You know, if they're going to give us loans, [it should be] zero interest loans.\nOur businesses are the frontline of keeping our neighborhood safe. If we're not here, creating a pleasant, happy, beautiful environment for community for shoppers, for families, for residents ... How safe will the community be when you're having blight on your main shopping boulevard?\"\nMichelle Wilton, chef/owner of Four Café. Open since 2010.\n\"I definitely cycle through every emotion. I get angry, I get sad. I think what makes me the saddest is just our employees. I have this overarching sense of responsibility for their lives as well and to provide for them. So, that has been really hard for me trying to just navigate. I need to pay them, they have children.\nWe just haven't generated enough sales to even cover the labor on some nights so myself and our other business partner ... have been working. He's been working in the front of the house and I've been doing all the cooking. We're just really waiting to see what the stimulus is, because if the stimulus comes out and says that they're going to help pay for our staff, then we want to get everybody scheduled immediately just to give them hours, of course. But right now the reality of it is if we don't make the sales we can't pay for the labor.\nWe just added a whole grocery section of online ordering where people can buy toilet paper, they can buy a dozen organic eggs, organic milk, any of our cookie dough, or organic bread... they can pull up curbside and pop their trunk and we put it in and it's a complete, no-contact way of shopping.\nI put sourdough bread kits on our site, we started pizza kits, hopefully it will generate more business so that we can employ more staff. I had to reinvent the whole thing. Anything I can to help generate business and help employ our staff, that's my number one thing, we have staff that have kids and I just get so worried about them.\nI have two small children, a four-year-old and an eight-year-old, and it has been tricky trying to succeed at all things. Because now I'm a homeschooling mom, so I do that in the morning and then I go to work ... and I'll go and bake or prepare. My husband will take over with the kids behind me, but we haven't taken them out. My son has asthma so it is a little scary.\"\n-- CNN's Kimberly Berryman contributed reporting.", "url": "https://www.cnn.com/2020/04/01/business/one-block-small-businesses-los-angeles/index.html"}