{"authors": [], "date_download": "2020-05-04 20:19:31", "date_modify": "2020-05-04 20:19:31", "date_publish": "2020-04-28 14:00:58", "description": "For the hard-hit meat industry, farmers say they have no choice but to cull livestock as they run short on space to house their animals or money to feed ...", "filename": "entry_meat-farmers-resort-to-euthanizing-piglets-under-pandemic-pressure_n_5ea82ca9c5b699bb9d9ef77b_1588623571.html", "image_url": "https://img.huffingtonpost.com/asset/5ea82d5130000027111550ae.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_meat-farmers-resort-to-euthanizing-piglets-under-pandemic-pressure_n_5ea82ca9c5b699bb9d9ef77b_1588623571.html", "title": "Farmers Resort To Euthanizing And Aborting Piglets Under Pandemic Pressure", "title_page": "Farmers Resort To Euthanizing And Aborting Piglets Under Pandemic Pressure | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "The latest economic disaster to befall the farm sector comes after years of extreme weather, sagging commodity prices and the Trump administration’s trade war with China and other key export markets. But it’s more than lost income. The pandemic barreling through farm towns has mired rural communities in despair, a potent mix of shame and grief.\nFarmers take pride in the fact that their crops and animals are meant to feed people, especially in a crisis that has idled millions of workers and forced many to rely on food banks. Now, they’re destroying crops and killing animals for no purpose.\nFarmers flinch when talking about killing off animals early or plowing crops into the ground, for fear of public wrath. Two Wisconsin dairy farmers, forced to dump milk by their buyers, told Reuters they recently received anonymous death threats.\n“They say, ‘How dare you throw away food when so many people are hungry?’,” said one farmer, speaking on condition of anonymity. “They don’t know how farming works. This makes me sick, too.”\nEven as livestock and crop prices plummet, prices for meat and eggs at grocery stores are up. The average retail price of eggs was up nearly 40% for the week ended April 18, compared to a year earlier, according to Nielsen data. Average retail fresh chicken prices were up 5.4%, while beef was up 5.8% and pork up 6.6%.\nOn Van Beek’s farm in Rock Valley, Iowa, one hog broke a leg because it grew too heavy while waiting to be slaughtered. He has delivered pigs to facilities that are still operating, but they are too full to take all of his animals.\nVan Beek paid $2,000 to truck pigs about seven hours to a Smithfield plant in Illinois, more than quadruple the usual cost to haul them to a Sioux Falls, South Dakota, slaughterhouse that the company has closed indefinitely. He said Smithfield is supposed to pay the extra transportation costs under his contract. But the company is refusing to do so, claiming “force majeure” – that an extraordinary and unforeseeable event prevents it from fulfilling its agreement.\nSmithfield, the world’s largest pork processor, declined to comment on whether it has refused to make contracted payments. It said the company is working with suppliers “to navigate these challenging and unprecedented times.”\nHog farmers nationwide will lose an estimated $5 billion, or $37 per head, for the rest of the year due to pandemic disruptions, according to the industry group National Pork Producers Council.\nA recently announced $19 billion U.S. government coronavirus aid package for farmers will not pay for livestock that are culled, according to the American Farm Bureau Federation, the nation’s largest farmer trade group. The USDA said in a statement the payment program is still being developed and the agency has received more requests for assistance than it has money to handle.\nMinnesota farmer Mike Patterson started feeding his pigs more soybean hulls – which fill animals’ stomachs but offer negligible nutritional value – to keep them from getting too large for their barns. He’s considering euthanizing them because he cannot find enough buyers after Smithfield indefinitely shut its massive Sioux Falls plant.\n“They have to be housed humanely,” Patterson said. “If there’s not enough room, we have to have less hogs somehow. One way or another, we’ve got to have less hogs.”", "url": "https://www.huffpost.com/entry/meat-farmers-resort-to-euthanizing-piglets-under-pandemic-pressure_n_5ea82ca9c5b699bb9d9ef77b"}