{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:53:56", "date_modify": "2020-05-04 16:53:56", "date_publish": "2020-04-08 15:59:25", "description": "Even as his administration -- and the country -- continue to battle the coronavirus, President Donald Trump keeps finding time to call into Fox News' host Sean Hannity's show.", "filename": "2020_04_08_politics_donald-trump-sean-hannity-coronavirus_index_1588611236.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190328140149-01-hannity-trump-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_donald-trump-sean-hannity-coronavirus_index_1588611236.html", "title": "The 24 most wildly irresponsible lines from Donald Trump's latest interview with Sean Hannity", "title_page": "The 24 most wildly irresponsible lines from Donald Trump's latest interview with Sean Hannity - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Even as his administration -- and the country -- continue to battle the coronavirus , President Donald Trump keeps finding time to call into Fox News' host Sean Hannity's show.\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!\nTrump and Hannity talked March 5 and then again on March 27 . And the two were back at it on Tuesday night. Below, the lines you need to see from that conversation.\n1. \"So, you know, things are happening. It's a -- it's -- I haven't seen bad. I've not seen bad.\"\nThis is Trump talking about his push for hospitals to use hydroxychloroquine on patients struggling to combat coronavirus. Worth noting here that: a) Trump is not a doctor and b) most doctors are wary of recommending the anti-malarial drug's use broadly until more testing is done. And away we go!\n2. \"And I was -- I was excoriated by the fake news and by the press, by these people that are bad people. They're just bad people. They don't -- they cannot love our country, I can tell you.\"\nIn which the President openly claims that the media are \"bad people\" who \"cannot love our country.\" His evidence? An inaccurate allegation that he was \"excoriated\" by the press for closing down travel from China when the coronavirus outbreak began.\n3. \"Once you get it -- I mean, if you're in the wrong group, if you're -- if you have a medical condition, if you're older -- it seems that older is certainly prime time for this -- this plague, this horrible virus.\"\nAn unedited \"sentence\" uttered by the President of the United States.\n4. \"I mean, you look at what's going on with the hospitals in New York and New Jersey. I was -- I was watching a little while ago, and it's -- it's terrible, a terrible thing.\"\nA good reminder here that the lens through which Trump sees -- and perceives -- the world is cable television. Forever and always.\n5. \"We have to get our country open again. This wasn't designed to have this. You crack it -- you crack it in half. It's no good.\"\nTrump is talking about the economy here, I think. All I know for sure is if you crack it in half, it's no good.\n6. \"The good thing is that the number of beds needed, I think we were right about that. I was right. My group was right.\"\n\"I was right.\" And, according to this analysis by MIT's Technology Review , Trump wasn't right; 21 states are expected to have hospital bed shortages in the coming weeks.\n7. \"I just saw on your show and a couple of other people just reported back to me that everyone is in great shape from the standpoint of ventilators, which are very hard, because they're expensive and they're big and like -- it's, you know -- it's -- and they're very high-tech.\"\n\"'Scotch tape and baling wire': How some hospitals and companies are responding to meet America's ventilator shortage\" -- USA Today, April 8, 2020 . Also, Donald Trump on ventilators: \"they're big and like -- it's, you know -- it's -- and they're very high-tech.\"\n8. \"And by the way, the hydroxychloroquine, we have millions of doses that I bought. I bought millions of doses, you know, for the country, the country bought.\"\n\"I bought.\"\n9. \"We have more than 29 million doses, and that's a lot.\"\n[does a series of mathematical calculations] Yes, that is a lot.\n10. \"A lot of people are looking at it and saying -- you know, there's just -- I don't hear bad stories. I hear good stories.\"\nSo, the President hears \"good stories\" about the efficacy of hydroxychloroquine and \"a lot of people are looking at it.\" Does that replace the clinical trials that the medical community wants before fully embracing the drug's use? No?\n11. \"And I don't hear anything where it's causing death. So it's not like something unsafe.\"\nObjection! Anecdotal, your honor. (My mom always wanted me to be a lawyer.)\n12. \"It's been incredible how -- how so far -- I mean, I hate to say flawlessly, it's three days, but it's away ahead of schedule.\"\n13. \"Well, I'd love to open with a big bang, one beautiful country, and just open.\"\nUh huh. Tell me more...\n14. \"We're way under any polls or any of the models, as they call them -- they have models, and we're way under, and we hope to keep it that way, in terms of death.\"\nIt might be relevant to note here that Donald Trump is not, by training, a statistician.\n15. \" You know, we had the greatest economy in the history of our country, and then all of a sudden, they come in and say: 'Sir, you're going to have to close it.'\"\nNot true . No matter how many times he says it.\n16. \"It wiped out -- I mean, it just was unbelievable. That was your all-time bad.\"\nDonald Trump on the Spanish Flu of 1918-1919.\n17. \"So you have to be careful because you look at that, and close to 100 people get killed, you have to think that, you know, nobody would have thought it could have happened, but then you have to think, when you see this coming in and you see what was happening in China, you have to say, well, maybe this can happen here, so we have to be careful.\"\n18. \"And I did what I wanted to do, and it was a good move.\"\nThis is Trump on his decision to shut down travel from China. But really this is Trump on everything.\n19. \"Well, I'm a diplomat, too.\"\n[nods head very slowly]\n20. \"He has a hard time getting the words out, 'thank you, you did a great job.'\"\nTrump is referring here to an alleged lack of gratitude by New York Gov. Andrew Cuomo for what the federal government has done for him on coronavirus. Remember that Trump always wants to be thanked and congratulated -- for doing his job\n21. \"When they bring you to the hospital with this one, this is not having your appendix taken out. It's a bad -- that's a bad thing.\"\nDr. Trump doing his daily rounds...\n22. \"I actually have four companies that are high-tech. I mean, these are brilliant, brilliant people. You look at Ebola, you look at AIDS, you look at some of the things that they've done, these are the companies that have really did it.\"\n\"I actually have four companies that are high-tech.\"\n23. \"So, I'm just -- all I am is a matchmaker. I -- you know, I see results, I see great technicians, great people, come in with -- with really, you know, potential cures, OK?\"\n24. \"The media has been -- the lamestream media has been extremely dishonest and it's a shame, it's very sad.\"\nThis feels like a good place to end.", "url": "https://www.cnn.com/2020/04/08/politics/donald-trump-sean-hannity-coronavirus/index.html"}