{"authors": ["Razmig Keucheyan", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Sam Gindin", "Nicole Aschoff", "Leigh Phillips", "Michal Rozworski"], "date_download": "2020-05-04 19:56:13", "date_modify": "2020-05-04 19:56:13", "date_publish": "2020-04-23 00:00:00", "description": null, "filename": "2020_04_economic-planning-market-human-needs-crisis_1588622173.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/04/23120840/GettyImages-1217363064.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_04_economic-planning-market-human-needs-crisis_1588622173.html", "title": "Economic Planning Meets Needs Which the Market Ignores", "title_page": "Economic Planning Meets Needs Which the Market Ignores", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nDuring World War I, coal — like bread, meat, and wood — was running low. So when shortages really started being felt in Paris in September 1916, the city council turned to drastic measures. It took direct control of supplies, distributing coal to households based on the size of their apartment and the number of people living there. Families filled out a questionnaire specifying their needs, which were written on ration cards; when they needed coal, they would head to the mairie d’arrondissement (town hall), where distribution took place. Price control is a common feature of war economies. But faced with the coal shortage in Paris during World War I, things went a step further. The “price signal” on which markets rely was suspended, in favor of accounting in kind — in terms of quantities of coal, not its price. The amount of coal distributed to households was not based on their solvency, i.e., the money they had, but on what they needed. This form of distribution also made clear that the question of supply was political. With production subordinated to need, private economic agents were no longer free to produce and sell what they wanted. What instead took hold was a principle of equality. Crises demand great sacrifices from the people — and this heightens their sensitivity to injustices. This explains why during crises, the figure of the “profiteer” or “speculator” often emerges in popular discourse. Governments understand that in order to bring about the social cohesion necessary for mobilization, the distribution of goods should be egalitarian. Hence, paradoxically, during World War I, working-class households sometimes enjoyed higher coal supplies than they had done before: rationing did not just impose limits, but improved their condition. The coronavirus pandemic, obviously, is not a crisis of the same magnitude as World War I. It hasn’t suspended the logic of the market; it has exposed the absurdities of neoliberalism but hasn’t destroyed them. Yet in this crisis, too, we can see some evidence of an alternative economic logic. Masks and ventilators are sorely needed to deal with the emergency. No one these days dares to mention their cost. Rather, the issue is quantity: how many of them are needed and how fast can they be produced (even if shortages sometimes trigger competition between different states to get hold of them first). Equally, the financial aid provided by states to the economy — mostly to financial markets and big corporations — dwarfs the levels of 2008. Faced with the crisis, money suddenly seems to be less of an issue, and governments have taken more or less radical measures subordinating the economic to the political. Telling is the case of Ireland, a country renowned for its neoliberal economic model, which has now nationalized its private hospitals. A “moral economy” at odds with the logic of the market has also emerged. We now all depend for our survival on the self-sacrifice of nurses, cleaning workers, and supermarket cashiers. In normal times, their jobs often have a low symbolic standing. But today, they are taking all the risks to save lives and make sure people have access to basic goods. In France, it has been proposed that on this year’s national day, July 14, it is they who should march down Paris’s grand avenues, rather than the military.\nFrom Rationing to Economic Planning Rationing is economic planning in times of acute crisis. Economic planning can be defined quite simply as a system where production is subordinated to the satisfaction of human needs. It has taken various forms in modern history, most of them failures for lack of economic efficiency and democracy. The coronavirus crisis can help us imagine what a system based on the satisfaction of needs could be. Capitalism has a perverse relation to human needs. On the one hand, commodity production has to meet needs to some extent. However, since solvency is its main criterion, when the person in need has no money, capitalism doesn’t satisfy that need. Rather, that person has to rely on the noncapitalist institutions that exist in capitalist societies: the family or the welfare system, which function on the basis of other criteria. Or, they can try and cope with their needs being unsatisfied. Through advertisement and the financialization of daily life, capitalism also constantly generates “artificial” needs. Competition between private capitals leads to “productivism” — the production of always new stuff, put on the market at ever greater speed, is a condition for the survival of competing firms. This new stuff has to be sold to consumers, so as to make room for the next round of new stuff — and this goes on endlessly. The planned obsolescence of mobile phones, whose average lifespan is two years, is an extreme form of this phenomenon, but it concerns many other types of commodities: light bulbs, nylon stockings, or printers are among classic examples. This creation of artificial needs also has to do with the importance of the sales effort in capitalism. Advertisement today no longer primarily informs the consumer on the qualities of a commodity. It tells him what kind of person he will become if he buys it. This marketing trend started with the famous “Marlboro man” ad in the 1950s, in which the cowboy is more important than the cigarette itself. As Karl Marx puts it in Capital, “Production thus creates the consumer.” Artificial needs are alienating. For instance, they lead to “compulsive buying” disorders, a growing pandemic at the global level. They are also damaging to the environment. The production of new commodities at growing speed implies the overexploitation of natural resources and energy, and it also generates various forms of pollution. This “productivism” is the fundamental reason why capitalism can never be ecologically sustainable.\nDefining “Real” Needs Economic planning, on the other hand, aims at satisfying all “real” needs. The basic principle it relies on is that any “real” need should be satisfied — but alienating and ecologically unsustainable needs should not be. Obviously, it’s easier to define what we really need in times of crisis, for instance ventilators today. But if much about our future depends on us being able to distinguish between “real” and “artificial” needs, then we need to define what a “real” need is. Some real needs are “vital” ones: breathing, eating, or sleeping. If they are not satisfied, the result is death. Capitalist development has led to their satisfaction for lots of people — but certainly not all. According to a 2019 UN Report, 820 million people suffer from hunger in the world. Moreover, vital needs whose satisfaction was once taken for granted are now increasingly difficult to satisfy, like breathing non-polluted air. According to the World Health Organization, the global annual death toll from exposure to outdoor air pollution is 4.2 million. But of course, human life is not only about vital needs — and even non-vital needs can be “essential.” But the crucial thing to recognize is that apart from vital needs, which are defined by human biology itself, all other needs are historically specific. They emerge in the course of history, and they are culturally variable. In this sense, they are also political — defined in an individual and, at the same time, collective way. Take the case of travel. Traveling is great, because it allows you to encounter new societies, and thus to get a sense of human diversity. Some people would consider travelling an “essential” need of theirs. Until the middle of the twentieth century, travelling (for leisure) was mostly restricted to the elite. Since then, it has been democratized, to some extent. However, with its growth — and the rise of air travel especially — it has become increasingly harmful for the environment. Air travel is a huge greenhouse gas emissions contributor, which is why Greta Thunberg and her movement advocate no longer flying. Of course, it would be absurd to prohibit travel. Yet something has to be done to limit the damage to the environment. The solution might be to apply to air travel the logic of rationing which Paris and other cities implemented for coal distribution during World War I. Each citizen would be authorized to fly a limited number of miles per year or decade. This would allow societies to cap the global volume of traveled miles, so as to decrease it to environmentally sustainable levels. But it would also decouple traveling from income — unlike the strong correlation that exists today, where the richer you are, the more able you are to travel, especially by plane. Just like in the case of coal, rationing would thus allow for the lower classes to travel more, not less. No trading of air miles (on the model of carbon trading) would be permitted, since this would reinforce inequalities — the richer being able to purchase miles from the poor. Rationing only works if it is based on a principle of equality — it is not compatible with a cap-and-trade mechanism. The social and environmental benefits of such an approach could be strengthened by public investment in collective means of travel, for instance cheap, good-quality trains and hotels.", "url": "https://www.jacobinmag.com/2020/04/economic-planning-market-human-needs-crisis"}