{"authors": ["Tom Hays"], "date_download": "2020-05-04 20:03:48", "date_modify": "2020-05-04 20:03:48", "date_publish": "2020-04-07 16:38:37", "description": "NEW YORK (AP) — Convicted former drug company CEO Martin Shkreli, known as “Pharma Bro,” wants to get out of prison so he can help research a treatment for the coronavirus, his lawyer said...", "filename": "_d7209508da9d2edaa0bad6932611b4b0_1588622628.html", "image_url": "https://storage.googleapis.com/afs-prod/media/dc94165f294d4afdb45c33fb2bc9465e/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d7209508da9d2edaa0bad6932611b4b0_1588622628.html", "title": "'Pharma Bro' wants out of prison to research coronavirus", "title_page": "'Pharma Bro' wants out of prison to research coronavirus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE- In this Aug. 4, 2017 file photo, former pharmaceutical company CEO, Martin Shkreli, arrives at federal court in New York. The convicted former drug company wants out of prison so he can help research a treatment for the coronavirus. Shkreli's attorney said Tuesday, April 7, 2020, that he will be filing court papers asking federal authorities to release Shkreli for three months so he can do laboratory work “under strict supervision.” (AP Photo/Seth Wenig, File)\nFILE- In this Aug. 4, 2017 file photo, former pharmaceutical company CEO, Martin Shkreli, arrives at federal court in New York. The convicted former drug company wants out of prison so he can help research a treatment for the coronavirus. Shkreli's attorney said Tuesday, April 7, 2020, that he will be filing court papers asking federal authorities to release Shkreli for three months so he can do laboratory work “under strict supervision.” (AP Photo/Seth Wenig, File)\nNEW YORK (AP) — Convicted former drug company CEO Martin Shkreli, known as “Pharma Bro,” wants to get out of prison so he can help research a treatment for the coronavirus, his lawyer said Tuesday.\nDefense attorney Ben Brafman said that he will file court papers asking federal authorities to release Shkreli for three months so he can do laboratory work “under strict supervision.”\nHis client — best known before his arrest for drug price-gouging and his snarky online persona — is housed at a low-security prison in Allenwood, Pennsylvania.\n“I have always said that if focused and left in a lab, Martin could help cure cancer,” Brafman said in a statement. “Maybe he can help the scientific community better understand this terrible virus.”\nIn a research proposal posted online, Shkreli called the pharmaceutical industry’s response to the pandemic “inadequate” and said researchers at every drug company “should be put to work until COVID-19 is no more.”\nShkreli wrote that his background “as a successful two-time biopharma entrepreneur, having purchased multiple companies, invented multiple new drug candidates” would make him a valuable asset.\n“I am one of the few executives experienced in ALL aspects of drug development,” he said, adding, “I do not expect to profit in any way, shape or form from coronavirus-related treatments.”\nShkreli, 37, was sentenced to seven years in prison 2018 for crimes that included lying to investors about the performance of two hedge funds he ran, withdrawing more money from those funds than he was entitled to get, and defrauding investors in a drug company, Retrophin, by hiding his ownership of some of its stock.\nA judge ordered Shkreli to forfeit $7.3 million.\nShkreli first gained notoriety by buying the rights to a lifesaving drug at another company in 2014 and raising the price from $13.50 to $750 per pill.\nHe is also known for attacking critics on social media and offering a bounty to anyone who could give him one of Hillary Clinton’s hairs.", "url": "https://apnews.com/d7209508da9d2edaa0bad6932611b4b0"}