{"authors": [], "date_download": "2020-05-04 20:19:26", "date_modify": "2020-05-04 20:19:26", "date_publish": "2020-04-28 13:55:52", "description": "Mass testing is a particular strength, but the key may lie in genetics. Having an overwhelmingly homogeneous population that's been studied in depth is a...", "filename": "entry_can-icelands-experience-help-solve-the-coronavirus-mystery_n_5ea835a0c5b6ab20b1533038_1588623566.html", "image_url": "https://img.huffingtonpost.com/asset/5ea6b8eb250000af2d6b8993.jpeg?cache=uywuoberuw&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_can-icelands-experience-help-solve-the-coronavirus-mystery_n_5ea835a0c5b6ab20b1533038_1588623566.html", "title": "Can Iceland's Experience Help Solve The Coronavirus Mystery?", "title_page": "Can Iceland's Experience Help Solve The Coronavirus Mystery? | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "With a population slightly smaller than that of New Orleans, Iceland has now become a coronavirus research lab. But the country’s small population (around 360,000 inhabitants) isn’t the main factor to consider.\nAs of April 17, there had been 1,739 cases of coronavirus and eight deaths in Iceland – figures that are very low in contrast to (and due to) the high number of tests being carried out. It is calculated that around 10% of the population has been tested, a figure that is five times the rate of testing carried out not only in Spain, but also in Germany, one of the European countries that has managed this crisis most effectively.\nAgain, the population factor is important here, but there’s more to the story. Iceland is home to biopharmaceutical company deCODE Genetics. Leading the field of population genetics studies for over two decades, the company is now offering all Icelanders free and voluntary coronavirus screening, even for those who don’t have any symptoms.\nTo Kári Stefánsson, the company’s founder, there’s no mystery about Iceland’s coronavirus strategy. “We have screened more than anyone else, we have had aggressive tracking of the contacts of those infected, and we have been very aggressive in putting people in quarantines,” explained Stefánsson in an interview with TRT World. In addition to tackling the root of the epidemic in the country, these preliminary screenings have made it possible to ascertain that around 50% of people who tested positive were asymptomatic, at least at the time of taking the test. But this is just the most superficial data.\nThey know where every infection in the country comes from\nThe Icelandic company has been able to trace the source of every infection on the island and has identified 40 different strains of the virus. This is what’s called “a genotyped study of the coronavirus,” clarifies Spanish geneticist Juan José Tellería, a professor at the University of Valladolid who is very familiar with the Nordic project.\nAs Tellería explains, “Ever since it appeared in Wuhan, there have been little mutations in the virus that create different families.” deCODE is “first studying the variants of those viruses in Iceland, seeing which strain they belong to, and thus identifying which area of the world that virus comes from.” This is one side of it.\nWhat role do genes play in COVID-19?\nOn the other hand, “the intention is to cross-reference data on strains with data on patients and their evolution, to see whether differences in the development of the illness between patients has a genetic origin, either due to the genetics of the patient, of the coronavirus, or a relationship between both,” he adds. In other words, the project aims to find out which mechanisms the virus uses to act, and whether genes play a specific role in the fact that COVID-19 is extremely lethal in some patients, while it’s barely apparent in others.\nWhat makes this initiative so promising are the baseline conditions found in Iceland – a small, very genetically stable population – and the company deCODE, which has studied the genome of nearly one-third of the inhabitants. “As far as I know, it’s a case that’s completely one of a kind worldwide; there’s no similar experience,” notes Tellería.\n“Genetically speaking, it’s a very homogeneous population, because nearly everyone is a child, grandchild, or great-grandchild of people who had already been living on the island for hundreds of years, so family networks can be established among almost all of the country’s citizens,” he points out. Moreover, he adds, “it’s a practically closed population, because there’s been very little immigration.”\nGenetic studies to combat diseases\nAccording to Tellería, what deCODE has done over the years is take advantage of this “low genetic variability” to “identify risk factors in common diseases such as high cholesterol, heart disease, asthma, and allergies.” However, just because the population is so homogeneous doesn’t mean there’s not a lot of work still to be done, although it does make things easier. “Bear in mind that if we compare the genomes of any two individuals, there are three million differences, so it’s really difficult to determine which genes are responsible for certain traits,” says Tellería.\nThis genetic advantage, as well as good funding, has allowed deCODE “to study and monitor a huge amount of information” from genetic studies for which thousands of Icelandic citizens have put themselves forward, citizens whose medical records are also held by the company. Consequently, “they can cross-reference millions of data sets that enable them to identify genetic variants related to common pathologies,” explains Tellería.\nIf there’s something that characterizes the Mediterranean population, it’s genetic heterogeneity\nWhile Tellería doesn’t hide his fascination with the Icelandic research – “the deCODE case is studied at the university” – he also acknowledges that a similar experiment would be impossible in Spain. “The Mediterranean population is hugely heterogeneous, because the Mediterranean was the highway of classical times,” he points out. “If there’s something that characterizes us, it’s genetic heterogeneity.”\nFurthermore, very few genome studies have been done in Spain. “They’re only done for clinical use,” says Tellería; in other words, only with patients where a specific mutation is being sought for medical purposes.\nIn any case, if the Icelandic initiative gets results in the future, the population of the Mediterranean (and the rest of the world) will also benefit. “Definitely,” agrees Tellería. “Cross-referencing genome data from the virus and patients means being able to find out how the virus and host interact, and that is universal.”", "url": "https://www.huffpost.com/entry/can-icelands-experience-help-solve-the-coronavirus-mystery_n_5ea835a0c5b6ab20b1533038"}