{"authors": [], "date_download": "2020-05-04 20:07:37", "date_modify": "2020-05-04 20:07:37", "date_publish": "2020-04-09 17:04:25", "description": "WILMINGTON, N.C. (AP) — A North Carolina police department has warned residents not to attend drive-in church services during Easter, citing the executive order from Gov. Roy Cooper. The...", "filename": "_56c5f5f6c1e72028ee0285ed39e5d54e_1588622857.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_56c5f5f6c1e72028ee0285ed39e5d54e_1588622857.html", "title": "Police department warns against drive-in Easter services", "title_page": "Police department warns against drive-in Easter services", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WILMINGTON, N.C. (AP) — A North Carolina police department has warned residents not to attend drive-in church services during Easter, citing the executive order from Gov. Roy Cooper.\nThe Wilmington Police Department issued a statement in which City Attorney Daniel Thurston urged all churches and places of worship to continue with virtual services.\nPolice said the statement was in response to local pastors who were asking whether drive-in services are permitted under Cooper’s executive order. The statement pointed out that the order prohibits any event or gathering that brings more than 10 people together, either indoors or outdoors.\nOfficials said in trying to flatten the curve and slow the spread of the virus, bringing people together, even if people stay inside their cars, “is unnecessarily risky at this time.”\n“It’s still too risky to gather in groups for the holiday, or any other reason for that matter,” Cooper said during his briefing on Thursday. “This year’s holidays will look a little different for all of us, but now is the time to hold fast to our beliefs and find new and meaningful ways to celebrate these holidays while staying at home.”", "url": "https://apnews.com/56c5f5f6c1e72028ee0285ed39e5d54e"}