{"authors": ["Nell Lewis", "Cnn Business"], "date_download": "2020-05-04 16:34:39", "date_modify": "2020-05-04 16:34:39", "date_publish": "2020-04-08 08:16:39", "description": "Indian children are using more education apps, as schools close in its nationwide lockdown.", "filename": "2020_04_08_tech_online-education-india-coronavirus-spc_index_1588610079.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327123501-byjus-student-app-1-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_tech_online-education-india-coronavirus-spc_index_1588610079.html", "title": "Coronavirus lockdown could give online education a lasting boost in India", "title_page": "India: As coronavirus lockdown shuts schools online education gets a boost - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) Schools around the world have closed their doors because of the coronavirus pandemic , leaving more than 1.5 billion children stuck at home. While it's a great inconvenience for many, it has created a spike in demand for online learning.\nEducational institutions are introducing online courses and some education technology startups are temporarily offering free classes to help offset the impact of school closures.\nTake Byju's, an India-based education startup named after its founder, Byju Raveendran. In early March, it announced it would give children free access to its learning app, which it says had more than 40 million users at the end of last year. Around 3 million of those paid between $150 and $200 for an annual subscription.\nSince the announcement, the company says it has experienced a 60% surge in students using its products, which range from interactive video lessons and live classes, to quizzes and exam preparation.\n\"The outbreak is clearly increasing the appreciation of online education,\" Raveendran tells CNN Business. \"This could be a turning point for the industry, ushering in an increased usage of this format and changing habits in terms of how kids learn and how teachers teach,\" he adds.\nOther Indian platforms, including Unacademy Vedantu and Toppr are also offering free classes and content to students.\nChanging the learning habit\nGoogle GOOGL and KPMG estimated in a 2017 report that India's online education market would be worth around $2 billion in 2021, up from $250 million in 2016, with the number of paying users rising to 9.6 million.\nThose numbers may need significant revision. Raveendran thinks that the current school closures will not only boost online learning but will help to reset India's education system, with less emphasis on preparing for exams.\n\"Students just memorize, replicate and then forget when the exam is over,\" he says. Online learning would enable personalized lesson formats as well as a more engaging, interactive learning process.\nAnantha Duraiappah is director of UNESCO's Mahatma Gandhi Institute of Education for Peace and Sustainable Development, which has a vision of \"transforming education for humanity.\"\n\"It [online learning] allows the potential of individualized learning and offers the prospect of radically changing a system that frankly has not changed or evolved over the past 300-odd years,\" he tells CNN Business.\nIn 2017, the online learning market in India was projected to be worth around $2 billion by 2021.\nA tool to democratize education?\nThat means education apps are no longer restricted to major urban centers or the wealthier members of society. Byju's says that more than 60% of its students are from outside the 10 largest cities in India.\nThe app is currently only available in Hindi and English, but Raveendran says Byju's is in the process of adding more regional languages.\nStill, millions of children are unable to access online learning through a laptop or cell phone.\nRaveendran accepts there is a long way to go. \"If you look at the total number of school students in India, our penetration is still a very small percentage,\" he says.\nByju's originally offered the free service until the end of April, but is likely to extend it, says Raveendran. He also hopes to create a free model for disadvantaged students in India for when schools reopen.\nAlthough the free service will mean a short-term hit to revenue, Raveendran expects that in the long run it will be beneficial to the business.\n\"Once [pupils] start experiencing the advantages of learning online, we expect a lot of them to continue learning that way,\" he says.", "url": "https://www.cnn.com/2020/04/08/tech/online-education-india-coronavirus-spc/index.html"}