{"authors": [], "date_download": "2020-05-04 20:05:11", "date_modify": "2020-05-04 20:05:11", "date_publish": "2020-04-07 14:47:16", "description": "NEW ORLEANS (AP) — An alleged gang leader who faced racketeering charges was fatally shot in New Orleans just days after being released amid concerns that the coronavirus will spread in...", "filename": "_4501f0cca9942d9fe26d1b3317baa99b_1588622711.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4501f0cca9942d9fe26d1b3317baa99b_1588622711.html", "title": "Jail inmate released over coronavirus concerns fatally shot", "title_page": "Jail inmate released over coronavirus concerns fatally shot", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NEW ORLEANS (AP) — An alleged gang leader who faced racketeering charges was fatally shot in New Orleans just days after being released amid concerns that the coronavirus will spread in jail.\nGlynn McCormick was killed Sunday afternoon in the same area where authorities previously accused him of dealing drugs, news outlets reported.\nNo suspects have been identified. The shooter pulled up in an SUV, fired shots and then drove away, police said.\nMcCormick, 33, had spent nearly two years behind bars awaiting trial. He was released Thursday after his attorney petitioned to Orleans Parish Criminal District Court Judge Darryl Derbigny.\n“We don’t second guess the decision to advocate for his release,” said John Fuller, McCormick’s attorney.\nDistrict courts were advised last week by Louisiana Supreme Court Chief Justice Bernette J. Johnson that they could safely release jail inmates where possible because of COVID-19, WDSU-TV reported. Most people The new coronavirus causes mild or moderate symptoms for , but for some can cause more severe illness or death.\nOrleans Parish District Attorney Leon Cannizzaro criticized McCormick’s release in a statement .\n“This man’s violent death was completely avoidable,” Cannizzaro stated.", "url": "https://apnews.com/4501f0cca9942d9fe26d1b3317baa99b"}