{"authors": ["Opinion Ira Bedzow", "Lila Kagedan"], "date_download": "2020-05-04 16:01:03", "date_modify": "2020-05-04 16:01:03", "date_publish": "2020-04-01 14:53:57", "description": "While some ethicists try to explain that favoring younger people for care in a situation of scarce resources is not about considering intrinsic worth or social utility, it is very hard not to see this as a way of saying \"Well, older people, you have had a good run. Let's let the younger people have a chance to get old now as well,\" write Ira Bedzow and Lila Kagedan.", "filename": "2020_04_01_opinions_ethical_5f6673d0abef5aff48c6fa265868e742_index_1588608063.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401113023-elderly-oped-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_opinions_ethical_5f6673d0abef5aff48c6fa265868e742_index_1588608063.html", "title": "The ethical minefield of prioritizing health care for some with Covid-19", "title_page": "The ethical minefield of prioritizing health care for some with Covid-19 (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Ira Bedzow, Ph.D., is an associate professor of medicine in the School of Medicine, the director of the Biomedical Ethics and Humanities Program, and head of the UNESCO Chair in Bioethics at New York Medical College. Lila Kagedan is a clinical ethicist and the assistant director of the Biomedical Ethics and Humanities Program at New York Medical College. The views expressed in this commentary are their own. View more opinion articles on CNN.\n(CNN) \"We are at war with a virus that threatens to tear us apart,\" the World Health Organization Director-General, Tedros Adhanom Ghebreyesus, told world leaders in a virtual summit on the coronavirus pandemic Thursday.\nSuch dramatic phrasing as \" the war against Covid-19 \" and \"physicians are on the front lines of battle\" is heard everywhere today -- in the media, and from politicians and health care workers around the globe.\nAs US hospitals grapple with the influx of infected patients, this war analogy is creating a morally problematic way of thinking about how to allocate resources to the critically ill. In a war, we want to treat and return the strongest and fiercest soldiers to the battlefield to kill the enemy. In a pandemic that is straining medical resources and health care systems, we want something different: to save civilians' lives in a way that maintains our own humanity.\nEthicists use the term \"triage\" to explain how on-the-ground decisions about health care are decided in a medical emergency. While \"triage\" has become an accepted medical term, its roots in wartime practice has the potential to influence who should get treatment for Covid-19 based on factors that are not strictly clinical.\nThis influence does not apply when there are resources -- even if limited -- to be had, but rather when critical capacity is overwhelmed and decisions must be made about how to treat too many people with too few resources.\nJUST WATCHED Acts of kindness amid coronavirus pandemic Replay More Videos ... MUST WATCH Acts of kindness amid coronavirus pandemic 01:58\nWe do not fight a disease in the same way that we fight an enemy during wartime. We should therefore be making decisions based on concerns that are clinically relevant to survival. And we should not be making utilitarian decisions that make assumptions about who would remain, and compose the best society, after the pandemic is over.\nHowever, many of these example policies rely on two dubious assumptions.\nFirst, they make a distinction between public health ethics and clinical ethics and frame these decisions in terms of public health. This distinction is meant to focus on the welfare of the general population rather than those individual patients toward whom physicians have a fiduciary responsibility . This then justifies making decisions based on \"the greatest good for the greatest number\" even if certain individuals may suffer from it.\nThe mistake of this type of thinking is that it frames these triage decisions incorrectly: as matters of public health. Medical professionals in the hospital serve a clinical role and should be making clinical decisions. Public health policies are about prevention of disease and utilize overarching community strategies such as \"shelter at home.\" They are not meant to deal with individual treatment decisions -- even if there are many -- that need to be made in the moment.\nMoreover, even if one were to apply public health ethics here, the fundamental values of clinical ethics would still apply -- just on a larger scale. As such, we cannot simply throw out values, such as equity and social justice, because they are harder to maintain in a triage environment.\nSecond, not only are these ethicists' example policies for resource allocation utilitarian in the sense of saving the most lives, they would also create policies that prioritize saving the most \"life-years.\" Saving the most \"life-years\" does not mean that those with the highest chance of survival from Covid-19 would get treated first.\nIt means that, between two people with somewhat equal chances of survival, those perceived to have the most years left to live would get greater consideration. The moral justification for this prioritization is that it gives younger people the opportunity to live through life stages that they have yet to reach.\nWhile some ethicists try to explain that this choice does not consider intrinsic worth or social utility, it is very hard not to see this as a way of saying \"Well, older people, you have had a good run. Let's let the younger people have a chance to get old now as well.\"\nThere are other ways to respond to the challenge of choosing between cases of equal mortality, such as \"first come, first served\" or lottery selection. Of course, in the case of Covid-19, age is often clinically relevant, since with age comes other physiological factors or conditions that will affect chances for survival. But we should be fully aware of when we are considering a clinical factor and when we are submitting a patient to social bias.\nWe understand the motivation to be utilitarian and to want to maximize \"life-years\" -- it makes the rules clear and it is easy to feel that \"life is good, so more life is better.\" But clarity alone does not make for good morality.\nPrioritizing \"life-years\" solely for the sake of giving the youth a chance to get old is as much a non-clinical social decision as any other that we should try to avoid.\nPotential quantity should not be deemed actual. We may assume a younger person will live longer, but one can never be sure that this will be so.\nWe should not be utilitarian based on assumptions that are outside the clinically relevant. Ethics committees and medical professionals have no moral authority to presume the value of \"life-years\" or who will give a greater contribution to society when the pandemic is over.\nGuidelines for ethical allocation of resources should stick to considerations of chances for overall survival from Covid-19. Indirect factors, such as age, disability, and comorbidity (existing physiological conditions that make a patient more vulnerable), should only be considered as they relate to prognosis and survivability.\nFollow CNN Opinion Join us on Twitter and Facebook\nIt will seldom if ever be the case that all considerations for resource allocation for two Covid-19 patients will be exactly equal. And if there is a case where it is close, we shouldn't simply defer to general guidelines that turn decision makers into soldiers on the front lines.", "url": "https://www.cnn.com/2020/04/01/opinions/ethical-minefield-of-prioritizing-health-care-for-covid-19/index.html"}