{"authors": ["Rishi Iyengar", "Cnn Business"], "date_download": "2020-05-04 16:34:02", "date_modify": "2020-05-04 16:34:02", "date_publish": "2020-04-07 22:14:11", "description": "Twitter co-founder and CEO Jack Dorsey says he's dedicating more than a quarter of his wealth to a new fund for charitable causes, with the immediate focus on coronavirus relief efforts.", "filename": "2020_04_07_tech_jack-dorsey-coronavirus-donation_index_1588610042.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407162942-jack-dorsey-0402-file-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_tech_jack-dorsey-coronavirus-donation_index_1588610042.html", "title": "Jack Dorsey sets aside $1 billion for charity. His initial focus: coronavirus relief efforts", "title_page": "Jack Dorsey sets aside $1 billion for charity. His initial focus: coronavirus relief efforts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "San Francisco (CNN Business) Twitter co-founder and CEO Jack Dorsey says he's dedicating more than a quarter of his wealth to a new fund for charitable causes, with the immediate focus on coronavirus relief efforts.\nSquare SQ Dorsey will transfer $1 billion of his equity in— the digital payments company he also co-founded — to a limited liability company called Start Small, he said in a series of tweets on Tuesday. Dorsey said that amount accounts for around 28% of his wealth.\nThe first of those grants from Start Small, for $100,000, will go to America's Food Fund to provide meals to those impacted by the coronavirus, according to a Google Doc he shared for tracking all the grants.\nDorsey did not specify how much of the $1 billion commitment will be directed toward coronavirus relief as opposed to other charitable efforts after the pandemic ends.\n\"After we disarm this pandemic, the focus will shift to girl's health and education, and UBI,\" he said, referring to the concept of universal basic income. \"I believe they represent the best long-term solutions to the existential problems facing the world.\"\nRead More", "url": "https://www.cnn.com/2020/04/07/tech/jack-dorsey-coronavirus-donation/index.html"}