{"authors": [], "date_download": "2020-05-04 20:25:21", "date_modify": "2020-05-04 20:25:21", "date_publish": "2020-04-20 12:41:02", "description": "The outbreak of the coronavirus has dealt a shock to the global economy with unprecedented speed. Following are developments Monday related to the global economy, the work place and the spread of...", "filename": "_b4f95263781b3c55e51129566032d595_1588623921.html", "image_url": "https://storage.googleapis.com/afs-prod/media/335498b140084dfaa17d984fa1260ea8/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b4f95263781b3c55e51129566032d595_1588623921.html", "title": "US-Mexico-Canada border restrictions extended; United grim", "title_page": "US-Mexico-Canada border restrictions extended; United grim", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A saleswoman waits for customers in a shop as many smaller stores are allowed to open in Essen, Germany, Monday, April 20, 2020. Europe's biggest economy, starts reopening some of its stores and factories after weeks of lockdown due to the new coronavirus outbreak. (AP Photo/Martin Meissner)\nA saleswoman waits for customers in a shop as many smaller stores are allowed to open in Essen, Germany, Monday, April 20, 2020. Europe's biggest economy, starts reopening some of its stores and factories after weeks of lockdown due to the new coronavirus outbreak. (AP Photo/Martin Meissner)\nThe outbreak of the coronavirus has dealt a shock to the global economy with unprecedented speed. Following are developments Monday related to the global economy, the work place and the spread of the virus.\n________________________\nRESTRICTIONS VARY: North American border-crossing limits are being extended to combat the spread of the virus, while some parts of Asia and Europe are seeing a gradual lifting of restrictions. All this while head of the World Health Organization warns that the worst is yet ahead .\n— The Department of Homeland Security said Monday that Canada and Mexico have each agreed to extend restrictions on non-essential travel across their shared borders with the U.S. for an additional 30 days. The restrictions originally began on March 21. The government says non-essential travel includes travel that is considered tourism or recreational in nature.\n— New Zealand will remain in a strict lockdown for another week before easing the rules a little to allow some parts of the economy to reopen. Starting next week, workers at some businesses such as construction and manufacturing will be able to resume their jobs.\n— Denmark took another step toward reopening society when hair salons, dentists, physiotherapists, tattoo parlors and driving schools, among others, were allowed to reopen Monday.\n— Some shops are reopening in much of Germany as Europe’s biggest economy takes its first step toward restarting public life after a four-week shutdown.\nShops with a surface area of up to 800 square meters (8,600 square feet) are being allowed to reopen Monday, along with auto showrooms, bike shops and bookshops of any size, under an agreement reached last week between the federal and state governments.\nVENTILATOR DEMAND: Dutch health care equipment maker Philips is among the companies making ventilators, the breathing machines used to help patients hard hit by COVID-19. But surging demand for the machines was offset by slumping demand in other parts of its business.\nPhilips says orders at its unit that makes machines such as ventilators and patient monitors jumped 23% in the first quarter. However, the company’s net profit was hit hard as demand for other items, like personal health care products, slumped.\nSOME MANUFACTURING BACK: Boeing and some other U.S. manufacturers are looking to restart some of their operations in the coming days amid pressure from President Donald Trump to reopen the U.S. economy. When they will be able to sell what they build is an open question.\n— Sales of new automobiles in the U.S. could fall to levels not seen since the financial crisis in 2009, according to ALG, which tracks auto sales and resale values.\nALG’s worst-case scenario has total light vehicle sales falling to 11.3 million this year, a level not seen since automakers sold only 10.4 million new vehicles in 2009. The worst-case or “cautious” scenario from ALG is nearly 6 million vehicles below sales in 2019.\nEven ALG’s optimistic outlook pegs sales at 13.1 million, with its “mixed” forecast at 12.6 million. U.S. auto sales tumbled almost 40% in March, even though many state stay-home orders didn’t take place until late in the month.\n— Volvo Cars is restarting production at its suburban Goteborg plant in Sweden on Monday after talks with trade unions.\nThe Swedish car maker had in recent weeks reviewed every single working station in the Torslanda plant, near Goteborg, “from a health and safety perspective,” adding that when “social distancing is not possible, other protective measures have been put in place.”\nVolvo Cars also plans to reopen a plant in Ghent, Belgium, on Monday but “at reduced production output.” Its South Carolina plant is anticipated to open May 11.\nNO SURPRISE: Airlines have taken a big hit as travel ground to a halt with the outbreak of the pandemic. So eye-popping losses come as no surprise from an industry splitting $25 billion in government payroll aid.\n— United Airlines recorded a $2.1 billion loss in pretax income during the first quarter as revenue tumbled in March during the pandemic. Excluding items such as write-downs connected to a loan and investment in Brazilian carrier Azul, the pretax loss was just over $1 billion. Revenue fell 17% to $8 billion, with daily revenue dropping $100 million a day in the second half of March. United cut its schedule 80% in April and 90% in May. It got $5 billion in cash and loans from the government and on Friday applied for up to $4.5 billion in additional federal loans — both under last month’s $2.2 trillion virus-relief measure.\n— The Treasury Department said Monday that it made its first payments in its airline payroll support program, disbursing a total of $2.9 billion to applicants including two major airlines and 54 smaller carriers. It said it will make additional payments on a rolling basis.\nThe department said it has payroll support agreements with airlines representing 95 percent of U.S. capacity, including Allegiant Air, American Airlines, Delta Air Lines, Southwest Airlines, Spirit Airlines, United Airlines, Alaska Airlines, Frontier Airlines, Hawaiian Airlines, JetBlue Airways, and SkyWest Airlines.\n— Four Danish and Swedish subsidiaries with low-cost carrier Norwegian Air Shuttle filed for bankruptcy Monday. The carrier said the move doesn’t affect the company in Norway, nor about 700 pilots and 1,300 cabin crew based France and Italy.\nMARKETS:\n— Stocks fell on Wall Street as oil futures dropped below zero.", "url": "https://apnews.com/b4f95263781b3c55e51129566032d595"}