{"authors": ["Sandee Lamotte"], "date_download": "2020-05-04 16:14:45", "date_modify": "2020-05-04 16:14:45", "date_publish": "2020-04-03 09:15:30", "description": "New research is showing a connection between a loss of smell and taste and the coronavirus. Ease your mind with this simple sniff test you can do at home.", "filename": "2020_04_03_health_smell-taste-test-coronavirus-wellness_index_1588608885.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403103602-nose-smell-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_health_smell-taste-test-coronavirus-wellness_index_1588608885.html", "title": "Loss of smell from coronavirus: How to test your sense", "title_page": "Loss of smell from coronavirus: How to test your sense - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) In mild to moderate cases of coronavirus, a loss of smell, and therefore taste, is emerging as one of the most unusual early signs of the disease called Covid-19.\n\"What's called anosmia, which basically means loss of smell, seems to be a symptom that a number of patients developed,\" CNN Chief Medical Correspondent Dr. Sanjay Gupta told CNN anchor Alisyn Camerota on New Day.\n\"It may be linked to loss of taste, linked to loss of appetite, we're not sure -- but it's clearly something to look out for,\" Gupta said. \"Sometimes these early symptoms aren't the classic ones.\"\nWhile fever, cough and shortness of breath are the key classic signs of contracting Covid-19, a recent analysis of milder cases in South Korea found the major presenting symptom in 30% of patients was a loss of smell. In Germany, more than two in three confirmed cases had anosmia.\nIn response, the American Academy of Otolaryngology-Head and Neck Surgery and ENT UK, a professional organization representing ear, nose and throat surgeons in the United Kingdom, are calling for the loss of smell or taste to be added to the screening tools for possible Covid-19 infection.\nBut those with worrisome signs -- which may or may not be coronavirus -- are being told to stay home and monitor their symptoms so as not to stress already overburdened hospitals, clinics and heath care workers struggling to save lives.\nSo is there anything you can do at home to test to see if you're suffering a loss of smell?\nThe answer is yes, by using the \"jellybean test.\"\n'Jellybean test'\n\"You take a jellybean in one hand, and with the other hand you hold your nose tightly so you're not getting any air flow,\" said Steven Munger, director of the Center for Smell and Taste at the University of Florida.\n\"You put the jellybean in your mouth and chew it. Let's say it's a fruit flavor jellybean: if you get the savory plus the sweetness of the jellybean you'll know you have functional taste,\" Munger said.\n\"Then, while still chewing, suddenly release your nose. If you have a sense of smell you'll suddenly get all the odors and you'll say 'Oh! that's a lemon jellybean,' or 'Oh! that's cherry.' It's really a very dramatic, quick, 'Wow' type of response,\" he explained.\n\"So if you can go from sweet and sour to the full flavor and know what the flavor is,\" Munger said, \"then your sense of smell is probably in pretty good shape.\"\nThe scientific name for this process is retro nasal olfaction, where the odors flow from the back of your mouth up through your nasal pharynx and into your nasal cavity.\nBut what if you don't have a jellybean? You can use other foods too, said ear, nose and throat specialist Dr. Erich Voigt, director of the division of sleep otolaryngology at NYU Langone Health.\n\"The pure smell sense would be if you can smell a particular substance that's not stimulating other nerves,\" Voigt said. \"So some examples of that would be if you can smell ground coffee or coffee brewing, or if you can smell someone peeling an orange. That's the smell sense.\"\nBut you have to be careful, because it's easy to think you're using your sense of smell when you're not, Voigt said.\n\"So for example, ammonia or cleaning solutions, those stimulate the trigeminal nerve, which is an irritant nerve,\" he said. \"And so people will think, 'Oh, I can smell Clorox, I can smell ammonia, which means I can smell.' But no, that's not correct. They're not actually smelling, they're using the trigeminal nerve.\"\nStill aren't sure if you're getting it right? Check the internet for medically-based scratch and sniff tests.\nSmell loss is common\nOf course, not everyone who flunks a smell test is going to have coronavirus. Any respiratory virus, such as cold or flu, will temporarily impact smell and taste, sometimes even permanently.\n\"The amount of swelling that can occur in the nose from the viral effect can prevent the smell particles from getting all the way up to the top of the nose where the olfactory nerve is,\" Voigt said. \"When that swelling goes down, the sense of smell can return.\"\nBut there are also neurotoxic viruses, some of which are in the common cold category, Voigt said.\n\"If they're neurotoxic, that means that they harm the olfactory nerve and it becomes essentially nonfunctional,\" he added. \"Many of those cases can recover smell with time, but sometimes it's a permanent loss.\"\nA partial or complete chronic loss of smell is incredibly common, Munger said, affecting millions of Americans long before the novel coronavirus burst upon the scene.\n\"About 13% of the population has a significant smell or taste impairment,\" he said.\nBesides cold and flu, other causes of smell loss include nasal polyps, tumors, neurodegenerative diseases like Alzheimer's or Parkinson's, and traumatic brain injury or head trauma, including whiplash.\n\"If someone has been in an auto accident or had a whiplash injury or head injury, that could also impact the little nerves as they go from the brain down to the nose,\" Voigt said. \"So a whiplash injury could also cause a permanent loss of sense of smell.\"\nA loss of taste is commonly associated with the loss of smell, because we rely on smell to identify flavors. But there can also be medical reasons: Some medications can affect taste; chemotherapy and radiation therapy can certainly disrupt taste; and then there is physical damage, such as nerves severed during dental surgeries.\nA coronavirus connection\nIf you believe you've lost your sense of smell (and do not have a medical reason to explain the loss), experts say to take the symptom seriously.\n\"At this point I would be fairly confident to put it in the same category as, say, fever,\" said Munger. \"Obviously a variety of things can cause a fever. But if you lose your sense of smell quickly you want to self-isolate and contact your physician to talk about what actionable steps you might want to take.\"\nVoigt agrees: \"My recommendation is you should self-isolate and quarantine for about 14 days and don't spread that virus to other people,\" he said. \"If you have to go out, wear a mask so that you're not sharing the virus with others.\"\nIf you do experience a loss of smell, take care because there are dangers such as not being able to smell a gas leak, or perceive rotten milk or rancid food.\nAnd be aware that the loss of smell can occur further into the illness, along with other, more common symptoms.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\n\"It can precede the viral symptoms,\" Voigt said. \"There were people with very mild illness symptoms, but they did lose their sense of smell. And there are other patients where the loss of smell kicked in after they were having fever and chills.\n\"So the timeline is not predictive,\" he stressed. \"And it's also not a predictive sign of the severity of the disease -- it does not predict that you're going to get the bad pulmonary complications at this point. We don't have any data saying that.\"", "url": "https://www.cnn.com/2020/04/03/health/smell-taste-test-coronavirus-wellness/index.html"}