{"authors": ["Aj Willingham"], "date_download": "2020-05-04 16:56:33", "date_modify": "2020-05-04 16:56:33", "date_publish": "2020-04-09 10:19:41", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "filename": "2020_04_09_us_five-things-april-9-trnd_index_1588611393.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408112551-110-bernie-sanders-lead-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_us_five-things-april-9-trnd_index_1588611393.html", "title": "5 things to know for April 9: Election 2020, coronavirus, WHO, Syria", "title_page": "5 things to know for April 9: Election 2020, coronavirus, WHO, Syria - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "If your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' newsletter.\n(CNN) With Passover underway and Easter around the corner, the Department of Homeland Security has warned faith communities that they could see an uptick in online hate speech. Here's what you need to know to Get Up to Speed and On with Your Day .\n(You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily. Sign up here .)\n1. Election 2020\nBernie Sanders has bowed out of the 2020 presidential race , clearing the path for Joe Biden to become the Democratic nominee and face off with Donald Trump in November. Sanders told his staff it was a matter of numbers: After some early primary wins, the Vermont senator fell behind a surging Biden and never quite regained traction. Now that Biden is the last candidate standing, some have urged his party to call off this summer's Democratic convention in light of coronavirus dangers. Now, national focus will shift to how Biden and Trump square up with each other. Easier said than done, in this mercurial coronavirus age, but one thing's certain: Trump is in danger of entering the election home stretch without the roaring economy that has been a cornerstone of his presidential promise.\n2. Coronavirus\nWith coronavirus cases ebbing and flowing around the globe, countries are preparing for the future when it comes to social distancing and preventative measures. Spain says they have reached the peak of their outbreak, and UK leaders have met to talk about a possible exit strategy from lockdown restrictions even as Prime Minister Boris Johnson remains in intensive care with Covid-19. White House aides are discussing plans to reopen the US economy as early May , but that plan could run afoul of advice from medical experts. Wednesday marked a new deadliest day for the US, with 1,922 coronavirus-related deaths. Meanwhile, Russia and Germany are seeing their coronavirus numbers rise. In India, the government has completely sealed more than 100 \"containment zones\" until mid-April. In Bangladesh, the world's largest refugee camp has been locked down to keep the virus from spreading among the camp's 1 million Rohingya refugees. Follow here for the latest\nJUST WATCHED US reports highest coronavirus death toll in a single day Replay More Videos ... MUST WATCH US reports highest coronavirus death toll in a single day 03:47\n3. World Health Organization\nThe WHO is defending itself after President Trump repeatedly criticized the organization for its response to the coronavirus crisis and threatened to pull federal funding. WHO Director-General Tedros Adhanom Ghebreyesus asked Trump to not politicize the virus and instead promote unity in fighting its spread. French President Emmanuel Macron also defended the organization after a call with Ghebreyesus, saying the organization is critical to the global coronavirus response. The WHO has been criticized for their early response to the virus, when it was just beginning to spread in China. However, by the end of January, the organization had designated the virus a \"public health emergency of international concern.\"\nJUST WATCHED WHO fires back after Trump threatened to pull US funding Replay More Videos ... MUST WATCH WHO fires back after Trump threatened to pull US funding 02:35\n4. Cruise ships\nJUST WATCHED Big efforts to keep travelers safe from coronavirus Replay More Videos ... MUST WATCH Big efforts to keep travelers safe from coronavirus 03:33\n5. Syria\nA chemical weapons watchdog group has concluded that Syrian government forces were responsible for a series of chemical attacks in the country that shocked the world in March of 2017. The Organization for the Prohibition of Chemical Weapons' Investigation and Identification Team said the sarin gas bombings could have only been authorized by members of the Syrian Arab Republic military command. Human rights organizations and US officials agreed the report irrefutably shows the Syrian regime and the country's president Bashar al-Assad used chemical weapons against civilians, an act that US Secretary of State Mike Pompeo said rises to the \"level of war crimes.\" Chemical warfare is prohibited under the Geneva Protocol.\nJUST WATCHED Syria: 'We can't go back and we can't go forward' Replay More Videos ... MUST WATCH Syria: 'We can't go back and we can't go forward' 03:47\nBREAKFAST BROWSE\nLinda Tripp, a pivotal player in Bill Clinton's impeachment scandal, has died\nBaking can reduce stress and give comfort during these times\nWaffle House started selling its signature waffle mix. It sold out in four hours.\nNew Jersey is looking for people who know a decades-old programming language to help process unemployment claims\nWisconsin voter hits a chord with sign in voting line: \"This is ridiculous\"\nTODAY'S NUMBER\n34 million\nTODAY'S QUOTE\n\"I do my best to close their eyes and say a little prayer.\"\nA hospital worker at Detroit's Sinai-Grace Hospital, who says Covid-19 patients are dying so quickly they sometimes need to carefully stack bodies in temporary refrigerated storage. CNN spoke with at Detroit's Sinai-Grace Hospital, who says Covid-19 patients are dying so quickly they sometimes need to carefully stack bodies in temporary refrigerated storage. CNN spoke with several employees at the hospital who described the harrowing conditions caused by the outbreak.\nTODAY'S WEATHER\nJUST WATCHED Severe weather shifts towards the South Replay More Videos ... MUST WATCH Severe weather shifts towards the South 02:12\nAND FINALLY\nMicrowaving taquitos has never been this exciting", "url": "https://www.cnn.com/2020/04/09/us/five-things-april-9-trnd/index.html"}