{"authors": ["Ralph Ellis"], "date_download": "2020-05-04 16:27:20", "date_modify": "2020-05-04 16:27:20", "date_publish": "2020-04-07 17:21:05", "description": "Jersey City Councilman Michael Yun, a longtime civic and business leader in the community, has died from complications of the coronavirus, according to his chief of staff, Vernon Richardson.", "filename": "2020_04_07_us_jersey-city-councilman-michael-yun-coronavirus_index_1588609640.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407143610-jersey-city-councilman-michael-yun-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_us_jersey-city-councilman-michael-yun-coronavirus_index_1588609640.html", "title": "Jersey City councilman dies from coronavirus", "title_page": "Michael Yun: Jersey City councilman dies from coronavirus complications - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Jersey City Councilman Michael Yun, a longtime civic and business leader in the community, has died from complications of the coronavirus, according to his chief of staff, Vernon Richardson.\nCity Mayor Steven Fulop tweeted the news of Yun's death on Monday, saying, \"It's w/a heavy heart that we share that Councilman Yun has passed away. He was a great co worker and a tireless advocate for the people of #JerseyCity -- More than that he was a great father, husband and grandfather. I can speak for the entire JC community that we are devastated.\"\nIt's w/a heavy heart that we share that Councilman Yun has passed away. He was a great co worker and a tireless advocate for the people of #JerseyCity - More than that he was a great father, husband, and grandfather. I can speak for the entire JC community that we are devastated\nYun is one of the most prominent people to die of coronavirus in the Garden State, where more than 41,000 cases and over 1,000 deaths have been reported as of Tuesday, according to a tally from Johns Hopkins University.\nYun came to the United States from South Korea to study in 1979 and had lived in Jersey City Heights since 1981, according to the city's website\n41 years ago, Yoo-Tad Michael Yun moved from Korea to the US, settled in Jersey City where he and wife, Jennifer, opened Garden State News store. Michael served as Ward D. Councilman 2013 until now. His slogan was, \"Serve the people.\" He will be missed. pic.twitter.com/sDcRr474vF\nKnown for his trademark bow ties, Yun was elected to the city council in 2013 but was involved in the city's civic and economic life for decades, serving on the Jersey City Development Agency and helping to form and lead the city's first special improvement district -- the Central Avenue SID -- which worked to revitalize that business district.\nHe and his wife owned and operated Garden State News, the website said. He served as president of the Jersey City Merchant's Council for 20 years and was a leader in establishing the first commuter bus line from Central Avenue in Jersey City to New York City, the website said.\n\"He was a respected leader and a good man. A terrific husband, father, and grandfather. We stand with Jersey City in mourning his loss, and we send our thoughts to his family.\"", "url": "https://www.cnn.com/2020/04/07/us/jersey-city-councilman-michael-yun-coronavirus/index.html"}