{"authors": ["Opinion Michael P. Branch"], "date_download": "2020-05-04 16:57:33", "date_modify": "2020-05-04 16:57:33", "date_publish": "2020-04-09 10:05:38", "description": "Writer Michael P. Branch pays tribute to John Prine's music, which brought Branch's family closer together, and Prine's kindness -- along with that of his wife, Fiona -- which gave Branch's young daughter a moment she'll always remember.", "filename": "2020_04_09_opinions_john-prine-music-and-kindness-branch_index_1588611453.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200329225342-02-john-prine-lead-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_opinions_john-prine-music-and-kindness-branch_index_1588611453.html", "title": "John Prine's kindness, like his music, will live on (opinion)", "title_page": "John Prine's kindness, like his music, will live on (opinion)  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Michael P. Branch is a writer and teacher who lives in the western Great Basin Desert of Nevada. The views expressed here are his. Read more opinion on CNN.\n(CNN) I want to tell you all about a great kindness John Prine and his wife Fiona did for my family. Prine, deemed the \"Mark Twain of American songwriting\" by Rolling Stone magazine, died Tuesday in Nashville due to complications of Covid-19.\nMichael P. Branch\nOur daughters grew up listening to me play John Prine songs around the house, and they often sang those songs along with me. Although I have command of only a handful of chords on the guitar, that still left most of the voluminous Prine songbook open to me. The simplicity and accessibility of Prine's songs made them welcoming, while their insight, compassion, and humor made them irresistible. For many years now it has been one of our family Christmas traditions to sing Prine's wonderful \"Christmas in Prison\" together.\nLike many Prine songs, this one offers the small story of an unnamed person whose life we're invited to take a moment to consider and to empathize with. I can think of few songwriters whose work is animated by such a keen sensitivity to how other people feel, and that offers a more moving reminder of why it is important that we never stop caring about that.\nIn late 2016 our daughter, Caroline, then 10 years old, doubled down on her love of John Prine. She described him as her favorite musician, she memorized his songs by the dozen, and she routinely walked around the house singing those songs -- often out of tune, which I always thought Prine would have appreciated. The fact that Prine and Caroline were 60 years apart in age was immaterial. He was her guy, and she was his number one fan.\nIn the fall of 2017, it was announced that John Prine would be coming to our hometown of Reno to play a show. I had seen Prine quite a few times over the past 25 years, but this would be special, because he would be playing Reno just a few days before Caroline's eleventh birthday. We bought tickets but didn't tell her about it, and so the plans were made for her surprise.\nRead More", "url": "https://www.cnn.com/2020/04/09/opinions/john-prine-music-and-kindness-branch/index.html"}