{"authors": ["On Assignment For Huffpost"], "date_download": "2020-05-04 20:28:07", "date_modify": "2020-05-04 20:28:07", "date_publish": "2020-04-30 09:45:03", "description": "More anxiety, social media and alone time during the coronavirus pandemic can take a toll on your body image.", "filename": "entry_body-dysmorphia-why-how-to-deal_l_5ea82399c5b6085825795027_1588624087.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8261b240000ae008e9dc5.jpeg?cache=rOOT53PSch&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_body-dysmorphia-why-how-to-deal_l_5ea82399c5b6085825795027_1588624087.html", "title": "Experiencing Body Dysmorphia Right Now? Here's Why And How To Deal.", "title_page": "Experiencing Body Dysmorphia Right Now? Here's Why And How To Deal. | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "If you’ve ever struggled with body image or wished you could change specific things about your appearance, you’ve probably heard someone say, “It’s only a big deal to you, no one else notices!”\nOften, that’s true, but just as often it’s unhelpful ― we care what other people think, sure, but these issues are rooted in the way we view ourselves. That’s why the issue is also playing out during COVID-19 quarantine: We’re all staying home and out of sight of other people, and yet for many, body dysmorphia and body dissatisfaction are more intense than ever.\nHowever, there’s no need to let these feelings swirl around in your head unchecked. Here’s why you may be experiencing this issue, plus some expert advice on how to manage feelings of body dysmorphia amid everything happening right now:\nFirst, know that body dysmorphia exists on a spectrum, and low levels of it are common.\nIf you’ve never heard the term “body dysmorphia,” here’s a quick explainer: “Body dysmorphia is essentially the intense preoccupation with some perceived flaw in physical appearance that’s either small or not even observable to others,” said Jenny Weinar, a Philadelphia-based psychotherapist and director of Home Body Therapy.\nThe “flaw” might be a small one you believe is much more noticeable than it is, or something that isn’t actually there at all. “It could be a fixation on the skin, asymmetry in the face or body, obsession with proportions or musculature, or something like that. Or, it could be weight- or size-related,” Weinar said.\nIdeally, none of us would have these negative feelings about our bodies, but low-level body dysmorphia is common.\n“Many folks may feel dissatisfied with some aspects of their body, but the amount of distress or preoccupation related to those thoughts varies considerably from person to person,” said Becca Eckstein, a licensed psychotherapist and the executive director of Veritas Collaborative’s Adult Hospital in Durham, North Carolina.\n“There’s a lot of fear-mongering right now around weight gain and bodily changes in quarantine. I think people are just thinking about their appearance more in general, and have more time and space to fixate on it.” - Jenny Weinar, Philadelphia-based psychotherapist\nPeople who have eating disorders often experience extreme body dysmorphia, typically related to size and weight. And body dysmorphic disorder (BDD) is a separate diagnosis that exists on the OCD spectrum, characterized by body dysmorphia so intense that it causes severe distress and interferes with daily life without eating disorder behaviors.\nAnyone who suspects they have an eating disorder or BDD ― or if their issues with their body are intensely interrupting their daily life ― should seek help from a licensed therapist who specializes in treating the relevant disorder.\nA crisis can trigger body dysmorphia, even if you don’t have BDD or an eating disorder.\n“Just like there are traits of subclinical anxiety or depression, people can experience body dysmorphia, body distress, that doesn’t meet the diagnostic criteria,” Eckstein said.\n“Right now, that body distress could be exacerbated because anxiety in general is so high for folks, and there are certainly additional stressors at play,” like fear and uncertainty over what’s happening in the world, adjusting to a new routine, and not having a clear delineation between work and home, Eckstein continued.\n“We’re sitting dead center in the middle of a crisis and traumatic event,” added Ebony Butler, an Austin, Texas-based licensed psychologist and food relationship strategist.\nWhat’s happening is completely out of our control, so we naturally turn our anxieties about it around on ourselves. “If there was already some pre-existing issue with appearance, weight or body, then that might be the thing that consumes you,” Butler said. “It’s something you think you have most control over ― even if you don’t ― so you rush towards it.”\n10'000 Hours via Getty Images “We’re sitting dead center in the middle of a crisis and traumatic event,” one psychologist says.\nEstablish a routine or distract yourself to keep your mind from fixating on your body.\n“Right now, we don’t have the simple distractions of going to work, going to the mall, going to dinner to hang out with friends. We’re stuck with ourselves,” Butler said.\nNegative body thoughts that would typically get interrupted in everyday life might now be going unchecked. Any kind of routine, mundane as it may seem, provides some distraction.\n“Creating some kind of structure would be useful: meals and snacks at a similar time each day, waking up at a similar time each day,” Eckstein added. “Creating that kind of internal compass is helpful in not letting your mind wander too much.”\nIt almost sounds too easy, but simply giving your brain something else to focus on can also help silence body dysmorphia. And, while lots of things are off-limits right now, there’s plenty you can do at home to distract yourself for a little while.\n“If your mind is going places that feel unhelpful, cook a new recipe, buy a craft kit off Etsy, FaceTime a friend, or watch a favorite movie,” Eckstein said.\nYou don’t need to be doing all the things, all the time (another pressure that many of us are feeling in quarantine), but having some go-to activities can help keep your mind from wandering to places that don’t feel good.\nBe present when you’re on Zoom or FaceTime. That is, try not to focus on your own face.\nThe way we connect to others has shifted dramatically. Now when we’re in a meeting or at “happy hour,” we’re not just looking at the people we’re with—we’re also looking at our own faces.\n“I’ve been hearing that from a lot of clients in particular, how hard it is to be looking at themselves all the time, and comparing their faces to other people’s faces, noticing expressions,” Weinar said.\nIf you find yourself focusing mostly on your own face when you’re in a virtual meeting, the first step is to bring awareness to that. Then, handle it in the way that feels best to you.\n“For some people, it might actually help to keep seeing yourself, to try and desensitize yourself to your appearance that way,” Weinar said.\nShe says it can be helpful to offer neutral observations of your own appearance (although probably not while you’re in the middle of a work meeting): My hair is brown, my eyes are green, I have a mole on my left cheek, etc.\nFor other people, so much exposure to their own appearance might be too much.\n“It might be helpful to actually cover your face on the Zoom call with a post-it note or something, to practice being fully present with the other people in the call, and to build that muscle before you reintroduce seeing yourself so often,” Weinar said.\ngradyreese via Getty Images Unfollow anyone who makes your feel bad about yourself, or just mute them if they’re a real-life friend.\nLimit your time on social media.\nSurprise, surprise: Social media is another huge trigger for body dysmorphia. Many people are spending more time than ever scrolling through photos on Instagram or Facebook, both as a way to feel connected and a response to boredom.\n“What we’re seeing are a lot of ‘perfect’ bodies, a lot of ‘perfect’ pictures,” Butler said, noting that there’s really no such thing. “It makes us over-focus on those things more than we normally would.”\nThink about it. Before we were all stuck at home, we were exposed to hundreds of real-life bodies every day; now, the only exposure to other bodies (outside our household) we have is through carefully selected images. We’re also inundated with at-home workout ideas and tips for “avoiding quarantine weight gain” (eyeroll), which can trigger body image distress.\nLimit your exposure, and call social media out for what it is. “Social media is about aesthetics,” Butler said. Plenty of the “perfect” pictures are posted by people who are also struggling, and who may not actually look like that in real life. Of course, we all know this, but “we’re so consumed with our own flaws, so triggered by these images of other bodies, that we can’t rationally break things down.”\nUnfollow anyone who makes your feel bad about yourself, or just mute them if they’re a real-life friend. And, set a daily time limit on your social media use.\nMove in ways that feel good.\nActually moving your body can be another way to shift your thoughts away from your appearance. Eckstein warned that anyone with or in recovery from an eating disorder should talk to their treatment team before engaging in any new kind of movement, as even gentle activities might be dangerous.\nFor anyone who is otherwise healthy, mindful movement like yoga and stretching can help you feel more in tune with how your body moves and feels, and take some focus off of how it looks.\nMore strenuous forms of exercise can do this, as well, if you’re doing them for the right reasons. Exercising to change or punish your body will only exacerbate feelings of body dysmorphia. But using movement as a way to blow off steam, experience some normalcy, or get in touch with your body can be helpful.\nMost importantly, be kind to yourself.\nWe’re all especially anxious right now, and it’s not surprising that some of that anxiety might manifest as body dysmorphia.\n“There’s a lot of fear-mongering right now around weight gain and bodily changes in quarantine,” Weinar said. “I think people are just thinking about their appearance more in general, and have more time and space to fixate on it.”\nOver time, you can work toward tuning out those negative body messages. In the meantime, the advice above can help you shut down distressing body thoughts whenever they pop up.", "url": "https://www.huffpost.com/entry/body-dysmorphia-why-how-to-deal_l_5ea82399c5b6085825795027"}