{"authors": ["Danica Kirka"], "date_download": "2020-05-04 21:07:16", "date_modify": "2020-05-04 21:07:16", "date_publish": "2020-04-05 13:02:05", "description": "Britain needed a message of hope Sunday. The queen delivered it. Queen Elizabeth II offered support to a country locked down in the coronavirus pandemic, promising the nation that it would...", "filename": "_faa93f9fde3483bb13a605fa0d400b0c_1588626436.html", "image_url": "https://storage.googleapis.com/afs-prod/media/bff633e8183449f0998537c2868678e6/1897.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_faa93f9fde3483bb13a605fa0d400b0c_1588626436.html", "title": "Queen delivers message of hope to UK amid virus outbreak", "title_page": "Queen delivers message of hope to UK amid virus outbreak", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this image taken from video and made available by Buckingham Palace, Britain's Queen Elizabeth II addresses the nation and the Commonwealth from Windsor Castle, Windsor, England, Sunday April 5, 2020. Queen Elizabeth II made a rare address, calling on Britons to rise to the challenge of the coronavirus pandemic, to exercise self-discipline in “an increasingly challenging time”. (Buckingham Palace via AP)\nIn this image taken from video and made available by Buckingham Palace, Britain's Queen Elizabeth II addresses the nation and the Commonwealth from Windsor Castle, Windsor, England, Sunday April 5, 2020. Queen Elizabeth II made a rare address, calling on Britons to rise to the challenge of the coronavirus pandemic, to exercise self-discipline in “an increasingly challenging time”. (Buckingham Palace via AP)\nBritain needed a message of hope Sunday. The queen delivered it.\nQueen Elizabeth II offered support to a country locked down in the coronavirus pandemic, promising the nation that it would rise to the challenge and overcome the outbreak.\nIn a rare address to the nation, the 93-year-old monarch acknowledged the suffering that many families have experienced because of the COVID-19 crisis, which has infected more than 47,806 people in the U.K. and killed at least 4,934 of them. She drew upon wisdom from her decades as Britain’s head of state to urge resolve in a time of crisis.\n“While we have faced challenges before, this one is different,” she said. “This time we join with all nations across the globe in a common endeavour, using the great advances of science and our instinctive compassion to heal.\n“We will succeed — and that success will belong to every one of us.”\nHer remarks were broadcast only moments before Prime Minister Boris Johnson’s Downing Street office announced he had been admitted to the hospital for “precautionary tests.″ The news will add to unease in Britain, which has been in lockdown for nearly two weeks.\nThe queen gives yearly Christmas messages but has given an address like this on only three previous occasions. She delivered speeches after the Queen Mother’s death in 2002, before the funeral of Diana, Princess of Wales in 1997, and at the time of the first Gulf War in 1991.\nBut times are unprecedented. She lauded Britain’s beloved National Health Service in a broadcast that featured pictures of medical teams suiting up to go battle the virus. She praised other essential services, as images of soldiers loading medical equipment on trucks rolled on the screen. She also praised everyday citizens who are adhering to the terms of the lockdown and staying at home and helping to prevent the spread of the virus.\n“I am sure the nation will join me in assuring you that what you do is appreciated and every hour of your hard work brings us closer to a return to more normal times,” the queen said. “I also want to thank those of you who are staying at home, thereby helping to protect the vulnerable and sparing many families the pain already felt by those who have lost loved ones.\n“Together we are tackling this disease, and I want to reassure you that if we remain united and resolute, then we will overcome it.”\nThe leader who spends much of her time cutting ribbons and visiting charitable organizations, also made the point of mentioning the general public, such as the 750,000 people who volunteered to help the vulnerable.\n“I hope in the years to come everyone will be able to take pride in how they responded to this challenge,” she said. “Those who come after us will say that the Britons of this generation were as strong as any.”\n“That the attributes of self-discipline, of quiet, good-humored resolve, and of fellow feeling still characterize this country.”\nThe crisis has hit close to home for the queen. Her son and the heir to the throne, 71-year-old Prince Charles, had a mild case of the disease. She herself left London, the epicenter of Britain’s outbreak, and took up residence at her home in Windsor with her husband, the Duke of Edinburgh.\nBoth the monarch and her 98-year-old husband are among those over 70 whom the British government have advised to stay home for 12 weeks.\nThe virus causes mild to moderate symptoms in most people, but for some, especially older adults and the infirm, it can cause pneumonia and lead to death.\nMany in the U.K. have compared the pandemic to World War II, suggesting the effort needed to overcome COVID-19 would be similar. The queen herself suggested a parallel, and reminded the nation that other crises have served to strain family ties.\n“It reminds me of the very first broadcast I made, in 1940, helped by my sister. We, as children, spoke from here at Windsor to children who had been evacuated from their homes and sent away for their own safety,” she said. “Today, once again, many will feel a painful sense of separation from their loved ones. But now, as then, we know, deep down, that it is the right thing to do.”\nThe address was recorded in the White Drawing Room at Windsor Castle. The location was chosen specifically because it allowed enough space between the monarch and the camera person, who wore personal protective equipment.\nLeadership expert James O’Rourke from the University of Notre Dame said that the monarch’s remarks couldn’t have come a moment too soon. With Johnson ill with the virus himself, the queen offers a message of continuity to a country in lockdown.\n“Britons have not faced such grim circumstances since the darkest days of World War II, with the Blitz and the mass evacuation at Dunkirk in 1940,” he said. “Now, more than ever, the people of the U.K. must have someone to rely upon, someone whose word they can trust.”\nThe queen invoked the words of a World War II-era song “We’ll Meet Again” by Vera Lynn that offered hope to many a soldier sent to fight, promising that loved ones would be reunited in the end. The parallel was unmistakable: It can’t last forever.\n“We should take comfort that while we may have more still to endure, better days will return,” she said. “We will be with our friends again; we will be with our families again; we will meet again.”\n___\nFollow AP news coverage of the coronavirus pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/faa93f9fde3483bb13a605fa0d400b0c"}