{"authors": ["On Assignment For Huffpost"], "date_download": "2020-05-04 20:17:02", "date_modify": "2020-05-04 20:17:02", "date_publish": "2020-04-28 09:45:09", "description": "COVID-19 immunity for the entire population is the goal, but experts say there's a lot that we need to understand before that happens.", "filename": "entry_herd-immunity-fight-coronavirus_l_5ea6f25fc5b6dd3f908844c1_1588623422.html", "image_url": "https://img.huffingtonpost.com/asset/5ea703f9250000450feb069a.jpeg?cache=9Y8k2KBuHf&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_herd-immunity-fight-coronavirus_l_5ea6f25fc5b6dd3f908844c1_1588623422.html", "title": "What Is Herd Immunity, And Can It Really Help Us Fight Coronavirus?", "title_page": "What Is Herd Immunity, And Can It Really Help Us Fight Coronavirus? | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "There’s a lot of talk about how achieving herd immunity for COVID-19 is the key to reopening the economy during the current pandemic.\nPut simply, this is when enough of a population becomes immune to a disease ― either because they’ve been vaccinated or because they’ve had the disease and recovered and developed immunity. As a result, the disease can no longer spread efficiently, and even those who are not immune to the disease are still protected from becoming ill. We’ve seen this with illnesses like polio and chickenpox that are now much rarer than they used to be.\nA vaccine would make herd immunity possible, but we won’t have a COVID-19 vaccine for quite some time. So some people have floated the idea of purposefully allowing the population to get infected with the coronavirus as a way to build up herd immunity.\nThat, to put it mildly, can have some dangerous consequences.\nAchieving herd immunity would mean that most people could go out in public without risking infection. But at this stage in our fight against COVID-19, a number of risks and barriers are in the way. Here are a few of them:\nWe’re not sure if recovering from COVID-19 makes people immune to the virus.\nThere are a lot of gaps in our knowledge about the novel coronavirus right now, and many of them relate to immunity. At this point, we don’t know if people develop protective immunity to COVID-19 after recovering from the illness, or if they can be reinfected. Experts have been looking at other, similar respiratory viruses for an idea, but there’s no guarantee they work the same way.\n“For the 2003 SARS virus, it appears there was protective immunity and this lasted up to two years, so that gives some good hope that lasting immunity is possible,” said Jeremy Rossman, honorary senior lecturer in virology at the University of Kent.\nBut even if recovering from COVID-19 does grant someone protective immunity, we don’t know how long this immunity lasts.\nSince SARS-CoV-2 (the name for the specific coronavirus that causes COVID-19) is so new, “the crux of the challenge right now is that the science is just not far enough along for us to know what it takes to actually be immune,” said Anna Bershteyn, an assistant professor in the department of population health at NYU Langone Health.\nShe explained that for coronavirus strains that cause the common cold, people can be immune for a few months before their immunity wanes and they become susceptible again. For other illnesses ― such as some of the 2003 SARS strain ― immunity sometimes lasts longer.\nMeanwhile, in some situations, immunity is not helpful. In some cases of dengue fever, Bershteyn pointed out, a low level of immunity can actually be harmful and make the infection worse the second time around.\n“But we don’t know where this particular virus lies on that spectrum,” she said.\nrclassenlayouts via Getty Images For COVID-19, “the crux of the challenge right now is that the science is just not far enough along for us to know what it takes to actually be immune,” said Anna Bershteyn, an assistant professor at NYU Langone Health.\nWe don’t know how many people need to be immune to achieve herd immunity.\nWe can expect that COVID-19 will continue to spread either until we have a vaccine or until enough people get sick and become immune. But we don’t know what percentage of the population needs to be immune to achieve herd immunity. Typically, though, this number falls somewhere between 70% and 90%.\nDetermining this percentage primarily depends on how contagious the virus is, Bershteyn explained. Public health professionals use a mathematical term called R0 (pronounced R naught) to measure how contagious an infectious disease is. Essentially, R0 indicates how many people in a population will become infected with an illness from one case.\nGenerally, the higher the R0, the harder it is to control the spread of infection. So far, R0 estimates for COVID-19 are varied, but most estimates place it between 2 and 3.5, Rossman said. “At these numbers, you would need between 60-70% of the population to be immune in order to achieve herd immunity.”\nBut any of these numbers could easily change once we have more accurate testing data on the number of cases of COVID-19 and the number of people with antibodies to the virus.\n“As we start doing these surveys across entire communities to see how many people have antibodies and how many people have infection, it might turn our whole concept of what the R0 is on its head because we’re realizing that there might be actually quite a lot of infection from the first surge that went undetected,” Bershteyn said.\nWe don’t have a vaccine yet.\n“With containing many infectious diseases, vaccines are absolutely critical,” Bershteyn explained. “In public health they’re one of the most powerful tools that we have to stop the spread of infectious diseases.”\nScientists are working on several vaccines right now, and experts say there’s a good chance we will eventually develop one that can be used to immunize enough of the population to stop transmission of the coronavirus.\nThat said, creating a vaccine that’s both effective and safe is a time consuming and complex task. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, has said a vaccine could be ready within 12 to 18 months, but the process typically takes multiple years.\nEven once researchers are able to identify a safe and effective vaccine, it will need to be manufactured and distributed, further lengthening the timeline for it to become publicly available.\n“Not all vaccines are equally easy to scale up to billions of doses, which is what we’re going to need if we’re going to get the whole world vaccinated,” Bershteyn said.\nupixa via Getty Images Dr. Anthony Fauci has said a coronavirus vaccine could be ready within 12 to 18 months, but the process typically takes multiple years.\nTo achieve herd immunity without a vaccine, many people could become seriously sick.\nIf the United States were to achieve herd immunity without a vaccine, this would mean we would have millions of cases of COVID-19, and likely many deaths.\n“To achieve herd immunity in the U.S., that would be close to 200 million cases and even with a low fatality rate of 0.5% ― which is probably the best estimate at present ― that would be 1 million fatalities in the U.S.,” Rossman said. “This is obviously not an acceptable risk and would definitely overwhelm the health system unless it was spread out over many years.”\nIn addition to strained health systems, important medical supplies could run low, as we’ve already seen happen in New York and other COVID-19 hot spots.\n“Even if the true death rate from this disease is less than 1%, when you have that many cases it means an enormous number of deaths, not to mention other serious illness and complications like kidney failure or nerve problems,” said Kate Eisenberg, a family physician at University of Rochester Medical Center and an epidemiologist.\nOvercoming COVID-19 is going to take time.\nThe next few months will be critical in developing much-needed scientific knowledge about the coronavirus and finding answers to key questions that will help us learn how to respond to the threat of the virus, Bershteyn said. This includes understanding how long immunity lasts, whether immunity is protective, and more.\n“We’ll understand what to do next much better once we have answers to those questions,” Bershteyn said.\nAs we wait for a vaccine to become available, determining how our society can start to reopen without sparking new outbreaks will be challenging, Eisenberg said.\n“Most experts think this will require an enormous amount of testing and contact tracing,” Eisenberg said. “The more widely we reopen prior to achieving herd immunity, the more we’re accepting that some outbreaks will occur, particularly if we reopen without associated aggressive public health measures.”", "url": "https://www.huffpost.com/entry/herd-immunity-fight-coronavirus_l_5ea6f25fc5b6dd3f908844c1"}