{"authors": ["Gary D. Robertson"], "date_download": "2020-05-04 20:04:53", "date_modify": "2020-05-04 20:04:53", "date_publish": "2020-04-07 18:01:47", "description": "RALEIGH, N.C. (AP) — North Carolina's elected officials on Tuesday pledged cooperation and prepared for expanded social distancing restrictions as COVID-19- related deaths jumped by a third...", "filename": "_a41dd991a594ebeb2d3aea66efc0f047_1588622693.html", "image_url": "https://storage.googleapis.com/afs-prod/media/6e3d13835bea4145918eb6f1c7127ed8/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a41dd991a594ebeb2d3aea66efc0f047_1588622693.html", "title": "North Carolina leaders talk cooperation as deaths grow", "title_page": "North Carolina leaders talk cooperation as deaths grow", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "North Carolina Gov. Roy Cooper gives an update on the state's response to COVID-19 and the coronavirus at the State of North Carolina's Emergency Operations Center in Raleigh, N.C., Tuesday, March 31, 2020. (Ethan Hyman/The News & Observer via AP)\nNorth Carolina Gov. Roy Cooper gives an update on the state's response to COVID-19 and the coronavirus at the State of North Carolina's Emergency Operations Center in Raleigh, N.C., Tuesday, March 31, 2020. (Ethan Hyman/The News & Observer via AP)\nRALEIGH, N.C. (AP) — North Carolina’s elected officials on Tuesday pledged cooperation and prepared for expanded social distancing restrictions as COVID-19- related deaths jumped by a third statewide. Worries also deepened about the growing number of infections behind prison and jail bars.\n“We will get through this, particularly we will get through this if everyone does his or her part,” Gov. Roy Cooper said during the regular monthly meeting of the Council of State, composed of the 10 statewide executive branch leaders.\nState Treasurer Dale Folwell, who said he tested positive about two weeks ago, participated in the Council conference call days after being released from the hospital. Still sounding weak, Folwell called the experience “very, very intense” and thanked council members for their prayers.\nThe Department of Health and Human Services reported 46 deaths related to COVID-19 as of Tuesday morning, compared to 33 on Monday. More than 3,200 cases have now been reported statewide and over 350 of them were now hospitalized.\nCooper already has issued a statewide stay-at-home order, barred gatherings of more than 10 people. directed restaurants to offer only take-out or delivery. He told reporters later Tuesday he expected another order later this week to make mandatory limits designed to avoid crowds within grocery stores and other retailers that remain open. Cooper said the restrictions would place “more guardrails on social distancing” so that citizens feel safer, he said.\nHis administration already has raised the possibility of extending the stay-at-home directive beyond late April. Cooper is citing findings by local health researchers that extending social distancing mandates will make it more likely the state won’t run out of hospital beds.\n“I know many of you are wondering if this North Carolina model means that our stay-at-home order will continue into May. The answer is we just don’t know yet,” the governor said. Other models and the advice of public health and business leaders would be considered in the decision, he said.\nAs in other states, North Carolina officials are worried about the virus invading nursing homes, long-term care facilities and prisons. Both an assisted living center in Henderson County and adult care home in Northampton have reported over 20 positive cases among residents.\nForty inmates and a worker at a federal medium security prison in Butner, north of Raleigh, have tested positive, according to the U.S. Bureau of Prisons, making it among the largest current clusters in the system. Fifteen inmates also have tested positive at a low-security federal prison nearby, the bureau said.\nFor most people, the coronavirus causes mild or moderate symptoms, and the vast majority survive. But for others, especially older adults and people with existing health problems, it can cause pneumonia or death.\nState prisons on Tuesday began a two-week moratorium on accepting offenders from county jails and dramatic reductions in transfer between prisons. Cases have turned up at three state prisons so far.\nDisability Rights North Carolina urged on Tuesday county sheriffs and local district attorneys to reduce inmate populations in jails, saying too many are already overcrowded. The group said many of those jailed simply can’t pay their bonds or are serving time for non-violent misdemeanors.\n“As the virus spreads and staff levels drop due to disease or quarantine, the perilous conditions that overcrowding causes will only get worse,” group CEO Virginia Knowlton Marcus said in a news release.\nSheriffs are barring jail visitation, placing inmates with symptoms in quarantine and requiring arrestees to get medical clearance before being allowed into the inmate population, the North Carolina Sheriffs’ Association said, based on a sampling of facilities.\n“For every sheriff that I have spoken with, the population in their jail is at an unprecedented low,” said Eddie Caldwell, the association’s executive vice president. Sheriffs, he said, are working with judges and prosecutors to lower inmate levels without jeopardizing public safety.\n___\nFollow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.", "url": "https://apnews.com/a41dd991a594ebeb2d3aea66efc0f047"}