{"authors": ["Amanda Jackson"], "date_download": "2020-05-04 16:21:14", "date_modify": "2020-05-04 16:21:14", "date_publish": "2020-04-05 21:20:13", "description": "Wrestlemania 36, which underwent changes due to the coronavirus pandemic, comes to an end Sunday night. Here's how to watch.", "filename": "2020_04_05_us_wrestlemania-_9b86b73d4c0756c0d6e7e97096dd02c8_index_1588609274.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403133603-wrestlemania-36-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_us_wrestlemania-_9b86b73d4c0756c0d6e7e97096dd02c8_index_1588609274.html", "title": "WWE's first audience-free WrestleMania wraps up tonight", "title_page": "WWE's first audience-free WrestleMania wraps up tonight - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Wrestlemania 36, which underwent changes due to the coronavirus pandemic, comes to an end Sunday night.\nThe event -- which is World Wrestling Entertainment's biggest show of the year -- had a lot of firsts this year. Officials had deemed it too big for just one night, so for the first time ever, they broke it up into two parts. Also, due to unforeseen circumstances amid the coronavirus outbreak, WWE moved the show to its Orlando training center and made it spectator-free..\nTens of thousands of passionate wrestling fans were expected to fill the Raymond James Stadium in Tampa, Florida. Now, the event is held with only essential personnel present, and viewers tuning in virtually.\n\"Each WrestleMania has its own personality and has been different then the rest,\" Stephanie McMahon , chief brand officer of WWE, said Saturday, to kick off the event. \"Tonight and tomorrow's WrestleMania will be the most different of all.\"\nThanks for the positivity, @StephMcMahon.\nWe are here to entertain YOU. Welcome to #WrestleMania! pic.twitter.com/JcPGlrAB3I — WWE (@WWE) April 4, 2020\n\"Nonetheless, it is our commitment to you to somehow, someway provide you with a diversion during these hard times,\" McMahon said. \"Deliver a sense of hope, determination and perseverance and most of all to entertain you and your family.\"", "url": "https://www.cnn.com/2020/04/05/us/wrestlemania-36-results-highlights-night-one-trnd/index.html"}