{"authors": ["Associate Editor", "Huffpost Canada"], "date_download": "2020-05-04 20:21:47", "date_modify": "2020-05-04 20:21:47", "date_publish": "2020-04-29 18:43:55", "description": "Provinces are starting to reveal their reopening plans. Here's what that looks like.", "filename": "entry_in-our-new-covid-19-world-what-will-the-new-normal-be_n_5ea9ca87c5b63115cec2c50d_1588623707.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8a3d2240000de008e9e60.jpeg?cache=7wklddaamh&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_in-our-new-covid-19-world-what-will-the-new-normal-be_n_5ea9ca87c5b63115cec2c50d_1588623707.html", "title": "In Our New COVID-19 World, What Will The New Normal Be?", "title_page": "In Our New COVID-19 World, What Will The New Normal Be? | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Jonathan Hayward/THE CANADIAN PRESS A man wearing a protective face mask walks past a mural of heath care workers painted on a boarded up restaurant in downtown Vancouver on April 27, 2020.\nWhen will the quarantine end in Canada?\nIt’s a question on a lot of peoples’ minds as we tread through the second month of rigorous social distancing due to the COVID-19 pandemic.\nWhile measures across Canada aren’t technically a quarantine — that’s a technical term — it certainly feels like it to many Canadians. We’re stuck at home without many services and activities we’re used to. Grocery stores have become sites of mask-wearing and anxiety. And parks and playgrounds are roped off just as the summer months approach.\nOn Monday, Canada’s chief public health officer Dr. Theresa Tam echoed the sentiment.\n“These past weeks have made the words of millions of kids ring true as they shout from the back seat, ‘Are we there yet?’” Tam said. “I think I speak for all of us when I say we have never felt more like that kid ... we can’t let go of the wheel yet.”\nStill, many provinces have experienced enough of a “flattening of the curve” to start thinking forward.\n“We’re now making plans to ease restrictions with understanding of what might come and what we might face,” B.C. chief medical officer Dr. Bonnie Henry said Monday.\nLast week, Saskatchewan Premier Scott Moe rolled out the province’s five-step plan to “reopen” and B.C. officials have been teasing lifting restrictions for weeks. New Brunswick even suggested golf courses could reopen and on Monday, Quebec announced that elementary schools would start to reopen there on May 11.\nHow fast our society can return to a semblance of normal depends on a few things, including the ultimate goal: a vaccine. Different provinces are also setting out different parameters that show we can reopen things in a relatively safe way before a vaccine is developed.\nWATCH: Saskatchewan unveils plan to reopen economy. Story continues below.\nOn April 17, B.C. released new modelling data suggesting that COVID-19 hospitalizations there could remain relatively stable if B.C. went to between 40 and 60 per cent of “normal” life when it comes to interpersonal contacts. Anything above that 60 per cent “normal” could spur a new outbreak.\n“We must find a healthy way forward for the next 12 to 18 months … a healthy new normal that sustains us and keeps us safe,” B.C. Health Minister Adrian Dix said.\n“We need to find a way forward that allows us to socialize. Whatever actions we take, we know there’s a significant human cost if we get it wrong. The situation is complex, and it is without precedent in our lifetimes.”\nBut some things may never go back to the way they were before.\nAdrian Wyld/THE CANADIAN PRESS Chief Public Health Officer Theresa Tam responds to a question during a news conference on the COVID-19 virus in Ottawa, March 23, 2020.\nDuring an interview Monday with CBC, Tam said we won’t return to a society exactly the same.\n“The new normal, when we get there, is not the one that is the same as before,” Tam said. “It is one that might see our society function in different ways.”\nHere are some things that will change back to normal in the coming months — and some that will never be the same.\nServices and work\nHow quickly various businesses and services come back will depend on what was closed in the first place, and which are deemed most essential. Public health officials across Canada have said restrictions will be lifted as the daily increase in COVID-19 cases continues to stabilize or even go down.\n“We need to be at that point where our numbers are coming down,” Henry said of B.C. “We’re getting to that place.”\nThe new normal, when we get there, is not the one that is the same as before. Dr. Theresa Tam\nIn Saskatchewan, which has seen few or no new cases of COVID-19 for the past few weeks, Premier Scott Moe has proposed a five-step plan. In the first stage, in the coming weeks, non-essential medical services such as dentists and chiropractors will be allowed to reopen. Then, non-essential businesses will begin staggered reopenings May 19.\n“Over the next several weeks, restrictions will be gradually lifted by adding more types of businesses to the allowable businesses list, meaning that they can re-open if they so choose,” Moe said.\nBut it’s different for each province, because they approached closing businesses differently. In B.C., Henry pointed out that the province did not order the closure of many non-essential businesses, so they’re already a step ahead in certain regards.\nDarryl Dyck/THE CANADIAN PRESS British Columbia provincial health officer Dr. Bonnie Henry speaks during a news conference regarding the novel coronavirus COVID-19, in Vancouver on March 14, 2020.\nHealth officials are also stressing there needs to be a framework for keeping not only customers safe, but employees, too, before a business can reopen.\n“To ease restrictions, we need to know businesses are looking after your teams as well,” Henry said Monday. “Simply put, protecting your employees protects your business and protects all of us.”\nThat includes allowing for social distancing in businesses, and ensuring employees are not penalized for staying home when they’re sick.\nSo expect reopening restaurants to have tables more spaced out, or limited reservations. Hair and nail salons could be subject to extended health and safety guidelines. And many of the same limitations we see in businesses that are still open — such as plexiglass dividers for cashiers or denoted lines to maintain social distancing — will likely come into play in reopening businesses.\nTo ease restrictions, we need to know businesses are looking after your teams as well. B.C. chief medical officer Dr. Bonnie Henry.\nAnd, ideally, expect businesses to implement for structured sick leave policies and protocols should an employee contract COVID-19. Officials have suggested contact tracing — where you trace and test the contacts of someone who’s tested positive for the virus — will become the new normal in the coming months and years.\nPotentially, a business may reopen but then be shut down and subject to rigorous contact tracing if a staff member tests positive. The business would have to pass certain protocols and timelines in order to reopen after that point.\nSome of these changes could be permanent, or at least in place until a sustainable vaccine or treatment for COVID-19 is developed.\nThe office workplace could see similar shifts and keep a lot of operations remote in the coming months and years.\nWATCH: Welcome to the age of coronavirus haircuts. Story continues below.\n“Workplaces who have gone remote during this time and have had to turn to technology for online learning, meetings, work etc. may also find working from home is a priority to foster both worker productivity and for lowering costs of maintaining large office spaces,” McGill university professor Mindy Carter told HuffPost Canada.\nThe pandemic has revealed which businesses can function remotely, and many might opt to save rent and limit physical spaces in the coming months.\nSchools\nBut as these businesses reopen, schools and daycares reopening will have to coincide so workers’ kids have somewhere to go. That’s why you’ll likely see elementary schools open up first, followed by high schools and universities.\nWhen schools do reopen, some provinces are considering phased or partial reopenings.\nIn Quebec, elementary schools and daycares outside of the Montreal area will reopen May 11. But vulnerable kids and immunocompromised kids won’t have to return right away.\n“The probable timeline of this illness will change the way we do things in the education network for some time to come,” Quebec English School Boards Association president Dan Lamoureux said in a statement Monday. “We may not be able, even in the medium term, to return to full class sizes in crowded, bustling schools.”\nMayur Kakade via Getty Images Despite some schools reopening, distance learning will still be the reality for many students in the coming months.\nOther provinces have not released detailed plans on schools reopening. New Brunswick will maintain home learning, opting to close schools for the rest of the school year and Ontario announced that schools will remain closed there until at least May 31.\nB.C. has not released concrete plans for schools, though last week Henry hinted if schools return this year, it could be in half-days or partial classes with remote learning in order to avoid as much physical contact as possible between kids.\nMass gatherings\nBut don’t expect everything to come back soon. Large events with lots of people are still off the table for now, simply because of how quickly the virus can spread and a new outbreak can occur.\nSo don’t hope to pack into a crowded movie theatre for the latest blockbuster premiere this summer or go partying at a busy nightclub.\n“We’re not going to go back to having lots of people together in enclosed spaces,” Henry said.\nJeff McIntosh/THE CANADIAN PRESS Crowds flock to the midway at the Calgary Stampede in Calgary on July 7, 2019. The Calgary Stampede has been cancelled this year because of COVID-19.\nWhile specific numbers on how big a group can be vary across Canada — some provinces say 10, some say 15, others say 20 — we’ve already seen that reality reflected in the cancellation of events across Canada like Toronto Pride and the Calgary Stampede. Big events all the way into the fall are starting to get cancelled in anticipation of continued restrictions.\nMany officials have suggested that big conventions and gatherings may not be possible until a vaccine or credible treatment is developed.\n“I know the curve shown in our modelling work may have left the impression that the virus will go away over the summer. That is not the case,” Alberta chief medical officer of health Dr. Deena Hinshaw said last week. “The virus that causes COVID-19 will be with us for many months to come. And the relatively low case numbers we are seeing in most of the province are the results of our collective efforts and sacrifices. COVID-19 is still with us and it spreads rapidly through social interactions.”\nI know the curve shown in our modelling work may have left the impression that the virus will go away over the summer. That is not the case. Alberta chief medical officer of health Dr. Deena Hinshaw\nBut still, provinces are starting to ease restrictions on small gatherings and outdoor spaces. Golf courses, parks, and camping grounds are scheduled to reopen in Saskatchewan between May 15 and June 1, and Henry said similar plans are coming for B.C. soon.\nIf professional sports return, they’ll return without crowds. The NHL has floated the idea of having specific cities act as “hub” cities to host multiple teams and games that will be televised without an audience — and Edmonton’s leading the list for Canada. Even if that’s the case, it will be dependent on provincial and federal regulation and borders.\nOur cities\nUniversity of British Columbia professor Patrick Condon says the pandemic has already shifted how we interact with the space around us in our cities — and that may be permanent.\n“Suddenly the sidewalk seems very much too small,” he told HuffPost. “And every one that we meet might be lethal to us. Things that seemed normal, like a narrow sidewalk in the past, now seem ridiculous.”\nHe said the pandemic is forcing society to contend with where and how essential workers live.\nVancouver Park Board Cyclists take advantage of a closed road in Vancouver's Stanley Park.\n“This pandemic really reveals the structural problems with the way our major cities are organized,” Condon said. “We’ve basically boxed ourselves into a situation where the people with [essential] jobs [like grocery clerks, nurses, garbage collectors] usually are not able to live close to their jobs because they can’t afford to.”\nHe said the pandemic will likely influence how people decide where to live and what is important in their neighbourhood. He said a long commute on a packed train car is something that could seem dangerous.\n“The obvious immediate effect will be people won’t be taking transit in the numbers that they have them for quite a while,” he said. “But also, it’s going to shift the way people make decisions about where they’re going to live in the region.”\nCondon says he hopes some changes are permanent — like the move to open up streets to pedestrians and close them off to cars.\n“I would like to see a city like Vancouver dedicate a certain number of streets in every neighbourhood as walkable green streets not only for ecological purposes, but to provide the breathing space for walking, biking, and in some cases transit vehicles,” he said.\nTravel\nOn Monday, Prime Minister Justin Trudeau indicated there weren’t any immediate plans to close provincial borders as some provinces reopen and others stay partially locked down.\nBut many travel restrictions will still be in place. Don’t expect the Canada-U.S. border to reopen right away, and when it does there will likely be strict screening in both directions.\nd3sign via Getty Images Non-essential international air travel likely won't return in full force for a while.\nIt will take airlines some time to restart international flight schedules and recover from the economic blow of the pandemic and other countries start to reopen their borders. And even when you do fly, it’ll likely be a very different experience.\nEarlier this month, Transport Canada announced requirements that all air passengers wear a mask or face covering while flying. Don’t expect that restriction to go away any time soon.\nIn fact, some think it could be permanent. Security restrictions following the Sept. 11, 2001 attacks, like removing shoes or not carrying liquids, were thought to be temporary, but have now become an everyday part of travel.\nFace masks could very well follow the same path, especially in the months waiting for a vaccine.\nAlso on HuffPost:", "url": "https://www.huffpost.com/entry/in-our-new-covid-19-world-what-will-the-new-normal-be_n_5ea9ca87c5b63115cec2c50d"}