{"authors": [], "date_download": "2020-05-04 17:02:04", "date_modify": "2020-05-04 17:02:04", "date_publish": "2020-04-10 15:54:15", "description": "From games where you must work together as a team to complete a mission, to ones that challenge your language and communication skills, these 13 games for couples will help pass the time.", "filename": "2020_04_10_cnn-underscored_fun-games-for-couples_index_1588611724.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407162252-couples-games-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_cnn-underscored_fun-games-for-couples_index_1588611724.html", "title": "13 games perfect for couples stuck inside", "title_page": "Fun games for couples: 13 games for two to play indoors  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored has interviewed experts to find the best options to help you cope during this uncertain time. Find all our coronavirus-related coverage here, and let us know your thoughts here.\nOn day — oh, I don't know, maybe 15? — of quarantine, my boyfriend and I looked at one another across our kitchen table and sighed. Really, how many more days of this? How are we going to pass the time? Shake up the monotonous, Groundhog Day-like routine?\nA few hours of internet searching (and TikTok watching) later, we started to round up every two-person game we could play. Though our old \"normal\" was full of weekend getaways and dinners out with friends, we knew we needed something different to keep us sane during this unprecedented time.\nWhat we found was impressive: many games are suited for duos — and can have the side effect of a strengthened, happier relationship. While shipping times these days are delayed, once we got our hands on some of these, we were hooked.\nFrom games where you must work together as a team to complete a mission, to ones that challenge your language and communication skills, here are 13 games perfect for pairs, and a look at how they can bring you together.\nIt's a fun way to bond\nYes, tuning into a seven-part series about tigers and their captors is a way to bond. But when you play a game together — device-free — it can take your connection to a new level, according to love and relationship psychologist Dr. Sarah Schewitz.\n\"Two important factors in maintaining a healthy relationship are having fun together and trying new things together,\" she says. \"If you're playing a new game and having fun while doing it, you're doing a lot of good for your relationship.\"\nTry this: Sushi Go Card Game ($8.99; target.com)\nSushi Go Card Game\nFor a laid-back game that is fun, entertaining and a tad bit competitive, consider this bestseller. Not only does it go superfast, but it's easy to learn and will help pass the hours quickly. The goal is simple: You want to collect as many cards, of varying points, as you can to create your \"sushi meal.\" The player with the most points wins. Might we suggest supporting your local sushi joint and ordering takeout to enjoy before?\n_______________________________________________________________________________\nIt can improve your communication skills\nWorking your way through anything — planning a wedding, buying a house, going through a pandemic — challenges two people with varying viewpoints to find common ground. The way to get there is focusing on your communication skills. As psychotherapist and author Jenny Maenpaa explains, whether you're on the same team or opposite ones, games can teach us how to best use our words to arrive at the same goal.\n\"No one wants the game to end in flipping the board and storming off in a huff, especially when you are stuck in quarantine together,\" she notes.\nTry this: MindWare Invisible Think ($24.95, originally $26.95; amazon.com or $33.99; bedbathandbeyond.com)\nMindWare Invisible Think\nThough you can play this highly rated game with many players, it's also appropriate for a small party of two. You are attempting to get your partner to say a specific word, but there's a bank of other words you can't say. Plus: There are supermagic glasses included that reveal secrets!\n_______________________________________________________________________________\nIt's a nice way to learn more about one another\nIn those first few days, weeks and months of dating, you lingered on every last word your one-and-only said. But as time goes on, the responsibilities pile up, and you're left with little time to get to know one another better. That's another reason Schewitz says games can be beneficial: They can shine a new light on our person.\n\"Some games bring out qualities such as intelligence, strategy and competitiveness in you and your partner that you may utilize at work but not at home,\" she continues. \"It can be exciting to see sides of your partner you don't normally have access to and you may find yourself feeling even more respect for and attraction to them as a result.\"\nTry this: Bananagrams Party Edition ($14.49; amazon.com)\nBananagrams Party Edition\nThis is one of the most popular games out there, and it's no surprise that racing against the clock to show off your vocabulary is fun for all. In this game, you're given 24 single-letter tiles, and your goal is to make a crossword with the tiles you're given. And then, take from the \"unused\" pile before your partner. When your partner somehow pulls out a complicated, amazing slew of words — you may do a double-take.\n_______________________________________________________________________________\nIt's a more connected way to pass the time\nThere are plenty of app games that you can play on your phones. But, well, that requires looking at your iPhone or tablet for hours. It's easy to lose concentration and be tempted by social media when going this route, which is why Los Angeles-based psychologist Yvonne Thomas says old-fashioned board games can be a better choice.\n\"By playing together, you can focus on the experience you are sharing rather than on outside stimuli, which can be distracting and disconnecting,\" she continues. \"In essence, couples playing games together is a more personal, direct way to connect and stay focused on each other.\"\nTry this: Jax Sequence Board Game ($14.59; target.com)\nJax Sequence Board Game\nReady to add some competition into your relationship for game night? Or, ya know, any day this week after you've finished your work? This versatile — and uber popular — game is based on strategy. To get started, you simply lay the cards you were dealt and then place a chip on the corresponding space on the game board. Your goal is to get five of these chips on the board, which isn't easy when your partner is trying to outsmart you.\n_______________________________________________________________________________\nIt can make you better team players\nYou know how the saying goes: Teamwork makes the dream work. And if your dream is to remain married or coupled up, cooperative games can be beneficial to your dynamic. Schewitz says focusing on how you function as a team to take the game home will bring you closer and decrease your arguments. When you aren't opponents, you can become a unified force that endures long after game night.\nTry this: Czech Games Codenames ($15.39, originally $19.95; amazon.com)\nCzech Games Codenames\nThough there is a two-player version of this game, called Codenames Duet, it's a hot item right now that's not readily available. The good news is that the traditional game can work too, just by switching the rules around a bit.\nAfter laying down 25 cards, you and your partner are assigned different ones. You must give each other clues — in the form of a single word and a number — to help one another guess. The object is to only go nine tries and check them all off, together. Just make sure you don't encounter an \"assassin\" card, or the game is over.\n_______________________________________________________________________________\nIt can make you feel the love\nBelieve it or not, recreation activities can release oxytocin in our brain, which Maenpaa says is sometimes called \"the love hormone.\"\n\"It causes our brains to feel attachment and protective feelings towards the person,\" she continues. \"Together, you are building memories that you can reflect back on later in life with warm feelings.\"\nTry this: Adult Loaded Questions Game ($15.99, originally $17.99; kohls.com)\nAdult Loaded Questions Game\nWith a few bottles of vino — or a pitcher of margs, if that's your speed — you will laugh and divulge with this 308-question game. There isn't really a \"winner,\" but it's a lighthearted — and sometimes racy — way to learn more about one another.\n_______________________________________________________________________________\nIt creates a shared experience\nBy going through a pandemic, you are already having a shared experience. But here's the deal: It isn't exactly a positive one, and it can up the anxiety in your home. Games work to bring those fears back down to reality in an effective way.\nAs Schewitz says, no matter what you play, you're creating a memory and you're actively engaging with one another, rather than the angst you're feeling. This is not only individually healthy, but a solid way to strengthen your bond.\nTry this: Renegade Game Studios The Fox In The Forest ($13.79, originally $15; amazon.com)\nRenegade Game Studios The Fox In The Forest\nIf you're more of a duo that likes strategy games, this is a smart choice for you. In addition to being fun, it's also a beautiful board game with impressive artwork. In the most basic form, the goal is to score more points by winning more tricks. But of course, it's based on a fox, so hey, there are lots of sly twists and turns.\n_______________________________________________________________________________\nIt challenges your patience\nReally, everything right about now challenges our patience. But in a more fun way, games can help us slow down, explain processes and breathe a little. Maenpaa says when couples are forced to put something into words, it can teach valuable skills. Not only do you need to be calm and collected, but you learn to see your partner's side of the equation, too.\nTry this: Nexci Scrimish Strategy Card Game ($9.99, originally $12.99; amazon.com)\nNexci Scrimish Strategy Card Game\nAnother beloved card game, Scrimish is classic and fun. Each deck has 25 red and 25 blue cards, and you're working as quickly as you can to reveal your partner's crown card. If you can keep up and do it first, you win! These superfast rounds are light and enjoyable and will make you bite your tongue in envy if you can't seem to win.\n_______________________________________________________________________________\nIt can help you accept your differences\nOf all of the hurdles of being in a relationship, one of the hardest is accepting that the other person won't always agree with you. Maenpaa says when you play a game, you have an opportunity to gain perspective and understanding into your partner's thought processes in a creative, new way.\n\"In trading information back and forth, you learn problem-solving skills together, and may realize you've been approaching household duties or habits differently from one another and potentially causing unnecessary conflict,\" she says.\nTry this: Ravensburger Disney Villainous the Worst Takes It All Game ($34.99; target.com)\nRavensburger Disney Villainous the Worst Takes It All Game\nDisney fans rejoice! This two-player game is full of strategy and a little bit of meanness. Though reviews of this top-seller say it's difficult to learn, once you do, it's addicting. The goal is to give your villain a happy ending — whatever that means for the character — but there are many roadblocks that make it challenging.\n_______________________________________________________________________________\nIt brings out your lighter side\nYou don't always get to see all the happy parts of your partner's life when you're running from one to-do to another. With this downtime, Thomas says, couples have the opportunity to, well, play again.\n\"In the seriousness and often fast-paced tempo of adult life, expressions of playfulness, healthy competitiveness, having fun, enjoying each other's company, and laughing together may not occur as frequently as needed to help solidify your bond with each other,\" she says. \"Now, it can.\"\nTry this: Off Topic Adult Party Game ($29.99; amazon.com)\nOff Topic Adult Party Game\nIf you have a short attention span, this one's for you. To begin, you draw a card and set the topic of the round. Then, you roll the die and it picks the letter. Now, you and your partner must race against one another to come up with as many words as you can that begin with the letter.\n_______________________________________________________________________________\nIt's a release\nStaying tuned in to the 24/7 news cycle won't do much for your psyche and viewpoint. That's why games are beneficial for anyone, but especially couples who find themselves talking nonstop about the latest headlines.\n\"[Games] take your mind off the problems of the world for a brief period of time, which can lessen the feelings of fear and panic when you go back to thinking about the things you're concerned about,\" Maenpaa explains. \"When you do check back in with the world outside your doors, you often realize that the feelings of dread have lessened because you reminded your brain that there are other things worth focusing on, too.\"\nTry this: Jenga Game ($10.39; target.com)\nJenga Game\nSince you can't go to your favorite bar with the oversized Jenga blocks and the locally brewed beer, take the fun inside. Though it's a smaller version, this is still just as fun. For added laughter, consider writing \"dares\" on the blocks to extend the party.\n_______________________________________________________________________________\nIt can reinforce your friendship\nAt the heart of any healthy relationship is a friendship. And during times of crisis, having a unique bond that solidifies what you have is essential.\n\"Instead of relating on a more surface level by predominantly relying on social media, texts and so on, playing games together provides a longer amount of time spent with each other as well as an activity which is shared in real time,\" Thomas says. \"As a result, camaraderie can increase and be reinforced.\"\nTry this: Azul Board Game ($28.99; target.com)\nAzul Board Game\nThis gorgeous game is equal parts fun and pretty, with players trying to decorate the walls of the Royal Palace of Evora. To make that task complicated, all sorts of things are in play — supplies and attention to detail — to keep it interesting and engaging.\n_______________________________________________________________________________\nIt can make you admire one another\nWell, you picked this person to share your life with — so shouldn't you be impressed with him or her? In your heart, you know you are. But how often do you pause and say \"Wow\"? By playing games, Thomas says, you may start to admire one another in a newfound way. You may even be impressed with your partner's creativity, strategy and luck.\nTry this: Monopoly Board Game ($19.99; target.com)\nMonopoly Board Game\nIt's been a household favorite forever — and for good reason. It involves all the luck of game-playing but also requires strategy and intellect. Though you may be there for a solid hour or two, with a bottle of wine and your favorite person, the time will pass swiftly.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/10/cnn-underscored/fun-games-for-couples/index.html"}