{"authors": ["Christopher Weber"], "date_download": "2020-05-04 20:20:01", "date_modify": "2020-05-04 20:20:01", "date_publish": "2020-04-15 05:01:26", "description": "LOS ANGELES (AP) — California regulators on Wednesday voted to allow temporary limits on freshwater fishing in some rural communities where local officials are concerned out-of-towners could...", "filename": "_85f698dc41a4a34b7947ce36fd4f1ec3_1588623601.html", "image_url": "https://storage.googleapis.com/afs-prod/media/4a16ef331079442f86270cc1826e5f21/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_85f698dc41a4a34b7947ce36fd4f1ec3_1588623601.html", "title": "California allows some freshwater fishing bans over virus", "title_page": "California allows some freshwater fishing bans over virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this March 24, 2020, file photo, people fish in the Sacramento-San Joaquin River Delta's Elk Slough near Courtland, Calif. California regulators will try again to convene an online public meeting to discuss a potential limited ban on freshwater sport fishing amid the coronavirus pandemic after last week's teleconference was canceled when it became overwhelmed by hundreds of callers. The state Fish and Game Commission on Wednesday, April 15, will consider emergency closures of some California rivers, streams and lakes at the request of local officials concerned that visiting anglers might spread the virus. (AP Photo/Rich Pedroncelli, File)\nFILE - In this March 24, 2020, file photo, people fish in the Sacramento-San Joaquin River Delta's Elk Slough near Courtland, Calif. California regulators will try again to convene an online public meeting to discuss a potential limited ban on freshwater sport fishing amid the coronavirus pandemic after last week's teleconference was canceled when it became overwhelmed by hundreds of callers. The state Fish and Game Commission on Wednesday, April 15, will consider emergency closures of some California rivers, streams and lakes at the request of local officials concerned that visiting anglers might spread the virus. (AP Photo/Rich Pedroncelli, File)\nLOS ANGELES (AP) — California regulators on Wednesday voted to allow temporary limits on freshwater fishing in some rural communities where local officials are concerned out-of-towners could spread the coronavirus to residents.\nThe unanimous vote by the Fish and Game Commission grants emergency authority to the director of the state Department of Fish and Wildlife to postpone the spring trout season at the request of a few counties.\nOpening day is celebrated among anglers as “fishmas” and draws thousands of people to the eastern Sierra. This year it’s set for April 25.\nBut fears over COVID-19 led the counties of Alpine, Inyo and Mono to urge fisheries regulators to postpone the unofficial holiday for their rivers, streams and lakes.\nThe online public meeting was rescheduled from an April 9 teleconference that was canceled when it became overwhelmed by hundreds of callers, some of whom branded officials as “fascists” and shouted obscenities. Rumors had circulated on social media that the commission was considering shutting down all freshwater fishing in California.\nCommission President Eric Sklar and Fish and Wildlife director Charlton Bonham kicked off Wednesday’s meeting by reiterating that officials were not contemplating total bans.\n“Neither the Department of Fish and Wildlife nor the Fish and Game Commission has proposed a statewide closure of statewide fishing. Neither intends to do so,” Bonham said.\nAfter he was granted the emergency authority, Bonham said any limits he imposes would be in response “to local needs in this public health emergency” and would expire May 31.\nSklar called it a “narrow, surgical and tailored” approach.\nThe meeting was briefly delayed by technical problems before proceeding as planned with comments from residents, health officials, tribal representatives and law enforcement members from the eastern Sierra and across the state.\nSome opponents of the limited bans questioned why more regulations were needed when the whole state was under a stay-at-home order. Others said the bans are unnecessary because social distancing rules are easily followed while fishing.\nMono County Sheriff Ingrid Braun pleaded with visitors to “give us time to get through this crisis.” She said there’s no place for guests to stay because many hotels are closed and short-term rental properties are being used by essential workers.\nA sign outside the Kern River Fly Shop in Kernville urged out-of-towners to go home: “Please, out of respect for the locals and everyone’s health!”\nOwner Guy Jeans said any other year he’d welcome a crush of eager anglers.\n“But now I’m saying, ’guys, you can’t be here right now. We’re trying to keep this town safe,” Jeans said.\nAbout 1 million licensed anglers regularly fish California’s waterways through the year, making it one of the most active U.S. fishing states.\n___\nThis story has been corrected to show the fish and wildlife department director’s first name is Charlton, not Charles.", "url": "https://apnews.com/85f698dc41a4a34b7947ce36fd4f1ec3"}