{"authors": ["Entertainment Reporter"], "date_download": "2020-05-04 20:28:08", "date_modify": "2020-05-04 20:28:08", "date_publish": "2020-04-30 09:45:03", "description": "The 77-year-old actor's career is brighter than ever, including a role in Ryan Murphy's 1940s revisionist-history series \"Hollywood.\"", "filename": "entry_holland-taylor-hollywood-ryan-murphy-interview_n_5ea33d49c5b6f9639814a5fd_1588624088.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9da28250000fb10eb0941.jpeg?cache=fffzhl5gxk&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_holland-taylor-hollywood-ryan-murphy-interview_n_5ea33d49c5b6f9639814a5fd_1588624088.html", "title": "Better With Age: The Holland Taylor Story", "title_page": "Better With Age: The Holland Taylor Story | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Holland Taylor is known for her imperious composure. Over her five-decade career, she has been cast almost exclusively in roles that demand significant degrees of sass and brass, which she somehow delivers without showboating. Any tally of Taylor’s highlights would feel incomplete, but here goes: “Bosom Buddies,” “Romancing the Stone,” “To Die For,” “The Practice,” “Legally Blonde,” “The L Word,” “Two and a Half Men” and a number of acclaimed stage parts, including a play she wrote about former Texas Gov. Ann Richards.\nIt was only a matter of time before Taylor landed in a Ryan Murphy show, considering that most female characters in Murphy’s oeuvre ooze sass and brass. Plus, she’s in a relationship with the “American Horror Story” maestro’s longtime muse Sarah Paulson.\nThat’s where “Hollywood” comes in. Murphy’s seven-episode Netflix series, which premieres May 1, is set during the 1940s when the titular industry was still largely segregated. Queer people had to conceal their sexuality, and people of color were considered unbankable. Fusing fact and rosy fiction, “Hollywood” charts the development of a movie based on British actor Peg Entwistle, who in 1932 took her own life by jumping off the Hollywood sign.\nTaylor plays Ellen Kincaid, an articulate, open-minded talent manager in a town run by obstinate blowhards. Ellen champions the Entwistle film even though it’s written by — gasp! — a Black man (Jeremy Pope). She also witnesses the early days of Rock Hudson’s career as agents mold the young upstart (Jake Picking) into the era’s notion of an archetypal leading lad (toned, white, heterosexual). Taylor’s other co-stars include Darren Criss, Jim Parsons, Laura Harrier, Dylan McDermott and a scene-stealing Patti LuPone.\nWhen I got on the phone with Taylor earlier this month, she couldn’t have been more enthusiastic about the series. Her career, unlike those of many other women in Hollywood, has aged exceptionally well. She won her first Emmy at 56 and has since received six more nominations. Now 77, Taylor works steadily, no longer hustling for gigs the way she did three decades ago (see: “Saved by the Bell: The College Years” and “Cop and a Half”). But she’s also concerned about the coronavirus and its implications for her ability to work in the near future. In the meantime, she’s quarantining with a new puppy and trying to figure out how to operate her vacuum cleaner.\nDuring a lively conversation, Taylor and I discussed “Hollywood,” pandemic fears, meeting Hudson, LuPone’s on-set musical performances, the arc of her own career, and the time she was forbidden from saying “blow job” on TV.\nNetflix Holland Taylor in an episode of \"Hollywood.\"\nWhat have you been doing to compensate during the quarantine? Have you been watching or reading anything that’s provided a decent distraction?\nWell, I’ve not been watching so many things. It’s funny how much busyness is created around this. I mean, I’m down to a system now, but the first weeks were just figuring out how to get food properly since I’m not supposed to go into stores because of my age, and also how to take care of my garden and my house. It’s an education. And I literally did not know how to work my vacuum cleaner, which literally almost ran me over and dragged me out of the house. My housekeeper who comes for three hours a week, she’s a tiny little woman. I don’t know how she runs this thing and I’m terrified of it. Then Sarah got a puppy.\nYes. That’s between bouts of being really depressed and wondering how long this will go on. Also, we can’t work. When the go-back-to-work notice comes, it’s not going to be for actors at all. In a movie, you’re cheek by jowl with about a hundred people all the time. How are they going to do that? So it might really be a long time before we’re back at work, and that makes me really terribly, terribly sad. I wasn’t planning on spending this time in my life not being able to work.\nHas the dog been a fun diversion at least?\nOh, she’s wonderful. Sarah really picked a winner. She’s 6 months old. She weighs about 6 or 7 pounds. She’s part papillon, we think, and part, I don’t know, she has this spaniel face. I must say, Sarah is much better at it than I am. The last dog I had was a rescue who had really been hurt in her little life. She was very afraid, and nobody could walk her but me and nobody could take care of her but me. This is a very healthy, well-rounded, aggressive little dog. It’s a wonderful contrast to the really dark mystery that we’re living in. In the midst of all this sunshine, we’re actually living in a cloud of fear and disinformation and insane chaos coming from the top.\nABC Photo Archives via Getty Images Tom Hanks, Holland Taylor and Peter Scolari in the \"Bosom Buddies\" pilot.\nJust think: You have this tiny creature who has no idea what’s going on. He doesn’t know who the president is.\nNo. A state devoutly to be missed. People talk about, “Well, this is the perfect time to pick up some big project, Holland.” And maybe I will turn my hand to something, but I have not been able to turn away from it as much as I would like to.\nSarah and I do watch some things, and we had “Hollywood” to watch, actually, which was great fun. And now her show just started, “Mrs. America,” and I want to watch that because I remember when she was making it. She does not want to watch herself, but she seems to have a wonderful role in it. All those actresses had the most wonderful time together. They all were friends and they were shooting these big scenes together and they were all hanging out and having big dinner parties. It was really enviable because the fact is actors really do have a good time together.\nSarah is a longtime company player within the Ryan Murphy universe. Did she give you any advice on working with him? He’s known for running fairly kinetic sets.\nShe gave me advice I didn’t need. She said, “Take that job!” I said, “I’m way ahead of you, lady.” I just always think of Sarah being in all of Ryan’s shows, so it never occurred to me that I would do a Ryan Murphy show. I wouldn’t want to be in a show that Sarah was in. That wouldn’t be right. That wouldn’t feel comfortable to me. Then this came up and he said, “No, this is a one-off thing that we’re doing. We’re creating the part for you. It’s going to be wonderful.” He’s a great storyteller, but more than that, he just has a feel for people and what they can do that maybe they don’t even know. And he wasn’t lying. It’s a wonderful role. It’s actually one of my most favorite roles.\nAs the rare female power player in the ’40s, how did you want Ellen to look and sound?\nI had a very specific image for her, a very specific kind of voice for her and a very specific body for her. Not that anyone would ever notice these things, but I had a definite feeling when I was playing her of who she was. I really liked her. She’s somebody I would love to know and somebody really congenial and smart and wise, and a person with real character and substance. You don’t often play parts like that. There was one point where we talked about making 10 episodes, and [Netflix] said seven. And I wish to God we had three more to make. We all were so sad when it was over.\nNBC via Getty Images Holland Taylor, Dustin Diamond, Mark-Paul Gosselaar and Anne Tremko in an episode of \"Saved by the Bell: The College Years.\"\nThe show takes place before your time in Hollywood, but have you often interacted with the same sort of cutthroat, self-aggrandizing producers and executives depicted?\nOh, absolutely. I’ve worked a gamut.\nNorman Lear, I’ve known him for many, many years, and you couldn’t find a bigger mogul than that — and he is a kind and civilized gentleman who has the most impeccable manners and graciousness. I’m sure he’s had to do plenty of tough things, and I’m sure he’s had to fire some people. But he is not a person who is capable of demeaning someone or attacking someone or vilifying them in some personal way.\nAnd yet I’ve worked with the absolute other side of the coin. I’ve worked for people who were absolutely monstrously cruel and also tremendously talented. Believe me, both types are everywhere.\nThis is a show about image-making. At the time, actors’ personas were created in boardrooms. It’s a different era now, but have you ever been asked to alter your voice or appearance in a way that made you feel uncomfortable or manipulated?\nI have not been, but then I was brought up in such a way so that my particular style would have been the desirable one to emulate. Do you know what I mean? I don’t know what it would have been like had I been told my manner would not fly. I think it would have been very hard.\nOn the other hand, it’s like finishing school. There’s nothing wrong with that in the sense that you want to be polished. In the ’30s and ’40s, Hollywood learned from Europe the finer ways to behave and good manners in the deepest sense. The real motive of fine manners is not to demean people or make people feel of a different class, but quite the opposite: to make people feel comfortable in thoughtful surroundings. And we’re still a young country. We certainly learned a lot in the ’40s and ’50s from Hollywood.\nKatie Mulligan for HuffPost From left: Holland Taylor in \"Ann,\" \"The Practice\" and \"Bosom Buddies.\"\nHave you ever wished you could hear what casting directors or producers say about you after you leave an audition?\nI wouldn’t because it can be very rough. When a casting director would say, “She just doesn’t have a feel for this role, she really can’t play this kind of part,” that doesn’t mean she isn’t a great actress. But you don’t need to actually hear those assessments, because actors are using their own bodies, their voices, their sensibilities, their manner. Finding an actor lacking is something they don’t need to know the details of. It’s too hard. Actors are necessarily pretty sensitive. Why wouldn’t they be?\nDid you ever cross paths with Rock Hudson before he died of AIDS in 1985?\nYes, I did. I met Rock Hudson a couple of times. He was a very nice guy and, of course, met a pretty tragic end. In his heyday, he was such a glorious creature. And you can really understand why he had such an enormous appeal. In the Doris Day movies, he has a lot of charm. I don’t think acting was something that was a deep experience for him, but it’s something he got the feel for. There was a case of somebody who was really created by [Hollywood agent] Henry Willson.\nScott Nelson via Getty Images \"The Practice\" co-stars Michael Badalucco and Holland Taylor at the Emmys on Sept. 12, 1999.\nDo you think the same type of carefully calculated star-making that’s seen on the show still happens today in Hollywood?\nI certainly know a lot of managers are really hands-on. I’m thinking of an actress I know who’s very, very smart intellectually who was very guided by a manager who said, “You have to dress a certain way in public. You don’t wear jeans. You don’t hang out. You dress up. You are always on.” And other managers wouldn’t even dream of messing at that level.\nBut I think that, back in those days, when there was really no way that the public would really know anything about an actor, it was very different. They really could have created a whole illusion of a persona — not to deceive the public, but rather to just make a great star image. And you can’t create an illusion anymore.\nWe are far savvier and more information-driven when it comes to public figures.\nYeah. There’s just too much access.\nSurely you had met Patti LuPone before this series?\nOh, I’ve met her many times and I’ve been backstage a number of times to congratulate her. It was really wild to work with her. I remember our first day of work, I said, “I just can’t believe this.” She breaks into song constantly. She is a musical person and she comments on things in song, just in jest. She’s humming something as she’s walking down the corridor or when she’s in the makeup chair. My head was constantly whipping around saying, “What’s Patti LuPone singing over there?” When she’s in the trailer next to mine and I hear her warming up and I’m speaking on the phone with somebody, I’ll say, “Patti LuPone is warming up next door. Sorry, I got distracted.”\nCBS Photo Archive via Getty Images Holland Taylor and Charlie Sheen in an episode of \"Two and a Half Men.\"\nGive me an example of something Patti sang.\nShe’ll do a whole number from “Evita” if she gets in a certain mood, and you just sit there with your jaw going slack. She does “Don’t Cry for Me Argentina” full out. The whole deal. All of it. And what’s more, she did it in a very jazzy, scatty kind of way once when we were all in a van. Of course everybody whipped their phone out and recorded her. Also, she has tremendous performance energy. She loves to be on. She’s really fabulous and also a consummate professional. She would always know her lines before anybody and always very, very on point. She’s like a Marine commander.\nIt seems like you’ve had the opposite experience from a lot of women in Hollywood. You spent quite some time taking whatever came your way, but your roles have grown richer and more plentiful as the years go by. Was there a specific point when you realized that you no longer had to hustle the way you maybe once did?\nI hustled when I was very young because I did not go to Yale or Juilliard, so I had no society when I came to New York. I knew no one. I just came blind and I had no idea what to do or how to make my way. And I was lucky. I had small roles in a number of off-Broadway shows and a number of Broadway shows. I worked fairly steadily, but it is true that I’ve gotten some really fantastic roles later in my career.\nI did a number of character roles in movies like “Romancing the Stone.” I would’ve thought they would’ve led to something, but then I went through a period where I didn’t get any roles in New York. Certainly, when David Kelley put me in “The Practice” in that very, very, very, very striking role, that was really groundbreaking for its time. I mean, it’s nothing now, the kinds of things that character did, but in the day it was really stunning.\nIn terms of her sexual liberation?\nSexual liberation, and also the combination of her being a really good, smart judge and a difficult judge who could really singe your hair in a courtroom. That was fun to play. To put that in combination with a woman who was also having a dalliance with her clerk, who then had the nerve to sue her for firing him and tried to say the affair was at her instigation when it was not. He was the one who was hooked on her. I mean, it was a great reverse story, and it really gave the woman so much more credit and power and agency.\nWhen I got that part, I had done a couple of smaller scenes in “The Practice,” and when I got the one that had the extraordinary scene that was so attention-getting, I lived in a house up on Hollyridge [in Los Angeles]. The scripts would be delivered, sort of thrown over the gate. I got home very late one night, and the script had come at 2 in the morning. Well, who could resist? I immediately opened it to read what would be next for that character, and I read these shearing scenes that were so stunning. I wanted to call up somebody because it was a scene in which I actually said, I think the word was “blow job,” but they had to change it to “fellatio.” “I gave the greatest blow job known to mankind” was the original line. My mind was so blown. I thought, “I’ve got to call up somebody.” Of course everybody was asleep, so I called an actress friend in London. It was early morning for her. I said, “Listen to what I’m going to do on national television!”\nWalter McBride via Getty Images Holland Taylor during the opening-night curtain call for \"Ann\" at the Vivian Beaumont Theater in New York.\nAnd you won an Emmy for the role. That had to be a turning point in your career.\nThat was a big thing. And of course I wrote my play, “Ann,” which did have much success in New York. PBS is going to be broadcasting that nationally in June, which is very, very exciting. And then to play the Great Leader in the new “Bill & Ted” movie that’s coming out sometime this summer. It’s like horseshit at the rodeo. I’m really going great guns here. At my age, it’s really a treat. I was getting ready to do “Ann” again at the Pasadena Playhouse, and by God, I will do “Ann” again because I want to do it one last time. But we can’t do that until it’s safe to do it.\nTalk about range right there: “Ann” and “Bill & Ted.”\nYes, well, if you don’t have range when you’re my age, you better quit.\nThat is good advice, actually. I’m at the age where the first time I remember seeing you onscreen was “Saved by the Bell.” Now, looking back on it, I don’t think there’s a less Holland Taylor role than “Saved by the Bell.”\nOh my god, I couldn’t agree with you more. I had to work. I just simply had to have a job.\nIt was a paycheck.\nI’ve always supported myself since I arrived in New York right out of school, and never had any source of income other than what I made from acting. So I took the job.\nI think that was possibly right after I did a show for Norman Lear, which was one of the things I’m proudest of, called “The Powers That Be.” It was a satire about government and Washington, and it had an incredible cast. John Forsythe was the senator, and I was his wife. It was not a success, as satires so often aren’t. It wasn’t promoted well and the network actually really didn’t know what they had and they canceled it. The people who saw it were rabidly crazy about it, and working for Norman was certainly one of the highlights of my career. It really should run on the Comedy Channel. It’s in some basement at NBC. And I’ve often said to Norman, “Norman, get it out!” Very few shows disappear like that, and I don’t know why it did.\nEvan Agostini/Invision/AP Sarah Paulson and Holland Taylor at the Vanity Fair Oscar party on Feb. 9, 2020.\nGoing back to the David E. Kelley connection, he is married to Michelle Pfeiffer, whose mom you played in “One Fine Day.” But you and Michelle are only 15 years apart. Did the two of you talk about that at the time?\nNo. In fact, I never even thought of that because I think it’s so often been true. Even when I was young, I never played young people. And now that I’m old, I play roles that are absurd at my age to play. Even Ellen Kincaid, in actuality, was written as though she were 50 or 55 or so, although I’m sure I don’t look it. But no, I didn’t think about that.\nBut that is why I got that role in “The Practice.” I remember David telling me that there was a moment where I was making clear that I found George [Clooney, Pfeiffer’s romantic interest in “One Fine Day”] very attractive. David said, “You could give Michelle a run for her money going after George.” He was very flattering, and that’s really why he thought of me when he thought of this judge who would be legitimate as a judge but also kind of a racy woman behind the scenes.\nPlaying Michelle Pfeiffer’s mother is nice work if you can get it. And now I’ve played Julianne Moore’s mother [in “Gloria Bell”]. I’ve played Nicole Kidman’s mother [in “To Die For”]. I’ve played a number of fabulous people’s mothers.\nIn “Hollywood,” your character teaches a group of aspiring actresses how to speak with the mid-Atlantic affectation that was popular at the time. When people talk about your own speaking voice, they tend to see it as a sort of modern mid-Atlantic intonation. Are you conscious of that?\nI wasn’t ever instructed in it formally, and in fact, I spoke to a dialect person on Ryan’s recommendation who gave me some defining lines for it because I don’t have a perfect mid-Atlantic accent. But my parents were very well-spoken and very well-educated. I received a very good education on the East Coast and I was, as a young person, a very big reader of fine literature. I think I just come by it by exposure. In fact, I have to try to get rid of some of it for certain roles. I’ve even had a director say, “You’re too formal.” And I do have a formal way of speaking. It’s probably my generation. I’ve been around a long time, and I was brought up when people behaved a certain way and spoke a certain way. And, as I say, my parents were very well-spoken.\nThis interview has been edited and condensed.", "url": "https://www.huffpost.com/entry/holland-taylor-hollywood-ryan-murphy-interview_n_5ea33d49c5b6f9639814a5fd"}