{"authors": ["Wilson Ring"], "date_download": "2020-05-04 20:28:20", "date_modify": "2020-05-04 20:28:20", "date_publish": "2020-04-17 15:44:13", "description": "A Vermont man is facing a federal charge that he was involved in a human smuggling operation along the U.S. border with Quebec between Richford and Berkshire. A document filed in federal...", "filename": "_9cc839c67b24d29a52330d0b5a10efa2_1588624100.html", "image_url": "https://storage.googleapis.com/afs-prod/media/94669209a97943179a33ee4b8e6ce2c9/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9cc839c67b24d29a52330d0b5a10efa2_1588624100.html", "title": "Vermont man charged in human smuggling case on Canada border", "title_page": "Vermont man charged in human smuggling case on Canada border", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Aug. 10, 2011, file photo, a marker indicates the official border between the United States and Canada in Richford, Vt. A document filed on Wednesday, April 15, 2020, in federal court in Burlington, Vt., said taxi businessman Alaa Abdulsalam Arif, a naturalized U.S. citizen from Essex Junction, Vt., has been charged with human smuggling along the border between Richford and Berkshire, Vt. (AP Photo/Toby Talbot, File)\nFILE - In this Aug. 10, 2011, file photo, a marker indicates the official border between the United States and Canada in Richford, Vt. A document filed on Wednesday, April 15, 2020, in federal court in Burlington, Vt., said taxi businessman Alaa Abdulsalam Arif, a naturalized U.S. citizen from Essex Junction, Vt., has been charged with human smuggling along the border between Richford and Berkshire, Vt. (AP Photo/Toby Talbot, File)\nA Vermont man is facing a federal charge that he was involved in a human smuggling operation along the U.S. border with Quebec between Richford and Berkshire.\nA document filed in federal court in Burlington on Wednesday says that a Border Patrol agent had installed court-authorized GPS on a vehicle belonging to Alaa Abdulsalam Arif, an Essex Junction taxi driver, the day before he was apprehended March 21 in Enosburg Falls.\nWhen Arif’s vehicle was stopped, it was carrying six passengers — four Mexican citizens, a citizen of Gambia and another from Niger. All the passengers admitted they had crossed illegally into the United States from Canada, the document says.\nAgents believe one of the passengers was serving as the guide whose behavior was “consistent with individuals serving as foot guides, leading other aliens into the United States from Canada through fields and wooded areas as part of an alien-smuggling event.”\nU.S. Attorney Spokesman Kraig LaPorte wouldn’t comment on specifics but said that the office filed a complaint and the court issued a summons for Arif, but that he has not yet appeared.\nNo court date has been scheduled.\nReached at a phone number listed in court documents on Friday, Arif declined to comment. A website associated with Arif’s taxi business said he regularly takes clients to the Jay Peak ski resort, not far from where the alleged smuggling event took place.\nThe alleged guide has not been charged with a crime.\nThe passengers, including the guide, were all immediately returned to Canada because of policies in effect during the COVID-19 pandemic. Arif, a U.S. citizen, was released, and agents did not attempt to interview him, also because of COVID-19 policies.\nOn Feb. 15, a surveillance camera spotted a dark van in the same area that was involved in an apparently successful human smuggling event. On March 12, surveillance cameras saw what appeared to be the same vehicle, later determined to belong to Arif, drop off a man whose footprints led into Canada, the affidavit says.\nArif’s vehicle was stopped by Border Patrol agents, but he was allowed to continue.\nOn March 20, surveillance allegedly spotted Arif’s car drop off a man whose tracks led into Canada. That evening an agent placed the GPS tracker on Arif’s car.\nThey were apprehended the next day.\nOn April 10, the alleged guide was found by game wardens in Maine when the car he was riding in became stuck on an unplowed road near Millinocket.\nAt that time the guide told Border Patrol in Maine he had reentered the United States illegally in Richford on March 28, but he denied having smuggled people. The agent who wrote the affidavit said the guide’s presence in Maine was “consistent with participation in an alien smuggling operation.”", "url": "https://apnews.com/9cc839c67b24d29a52330d0b5a10efa2"}