{"authors": ["John Hanna", "Heather Hollingsworth"], "date_download": "2020-05-04 20:12:54", "date_modify": "2020-05-04 20:12:54", "date_publish": "2020-04-16 15:37:28", "description": "TOPEKA, Kan. (AP) — Seven more people at a nursing and rehabilitation home in Kansas City, Kansas, have died from COVID-19, taking the facility's toll to 19 in an outbreak that is believed to have...", "filename": "_7c367ab69c32d393755bdf1509e8e429_1588623174.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f3b2910475e449a7a8a59f16527e74ea/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7c367ab69c32d393755bdf1509e8e429_1588623174.html", "title": "Kansas rehab worker showed up sick; 19 die at facility", "title_page": "Kansas rehab worker showed up sick; 19 die at facility", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this April 15, 2020, photo, Kansas Health and Environment Secretary Lee Norman discuss the coronavirus pandemic in the state, during a news conference at the Statehouse in Topeka, Kan. The Department of Health and Environment is bringing on 400 volunteers to help trace the contacts of people with the novel coronavirus. (AP Photo/John Hanna)\nIn this April 15, 2020, photo, Kansas Health and Environment Secretary Lee Norman discuss the coronavirus pandemic in the state, during a news conference at the Statehouse in Topeka, Kan. The Department of Health and Environment is bringing on 400 volunteers to help trace the contacts of people with the novel coronavirus. (AP Photo/John Hanna)\nTOPEKA, Kan. (AP) — Seven more people at a nursing and rehabilitation home in Kansas City, Kansas, have died from COVID-19, taking the facility’s toll to 19 in an outbreak that is believed to have started with an infected worker.\nRIVERBEND OUTBREAK\nThe Wyandotte County-Kansas City health department announced an increase of four deaths Thursday on top of three Wednesday at Riverbend Post Acute Rehabilitation. A total of 116 residents and staff have tested positive at the facility, making it the state’s largest cluster.\nA new health department report shows a staff member at the facility started displaying symptoms of the coronavirus around March 24, and went to work on March 27 and 28 with a cough and fever. The report said the employee was allowed to work without appropriate personal protective equipment.\nThe worker then went to the emergency room on March 29, and the COVID-19 test came back positive the next day. But health officials didn’t confirm until April 3 that the employee worked at Riverbend. By then, residents were getting sick.\nJanell Friesen, a spokeswoman for the joint city-county health department, said that it appears a number of people may have been exposed when the employee went to work with symptoms. But she noted that the department is still investigating to see if there may have been an earlier instance of exposure.\n“Unfortunately, any setting where many people are grouped together increases the risk of spread, and the risk for serious illness is especially high for older adults and people with underlying health conditions, like many of the residents in a facility like this,” she said in a written statement.\nA statement posted on the facility’s website said coronavirus-infected patients on one floor have been “fully stabilized,” while they are hopeful the others will be stabilized soon. They said plans are being made to return hospitalized patients to the home.\nCONTACT TRACING AND TESTING\nThe state health department is bringing on 400 volunteers to help assist local departments tracing the contacts of people with the coronavirus. The Wyandotte County health department also has 20 University of Kansas medical student volunteers and five staffers doing contact tracing.\nStatewide, the number of confirmed cases increased Thursday to 1,588, a jump of 94 cases from Wednesday. The number of deaths increased by four to 80.\nRELIGIOUS GROUPS\nA Lawrence area church has found what it believes is a way to continue meeting despite Gov. Laura Kelly’s executive order banning religious gathering with more than 10 worshipers.\nOn Wednesday, Heritage Baptist Church held a service under a tent, with between 75 and 100 people in attendance. A single protester held a sign that read, “Don’t be selfish — Go home — God will be there too,” the Lawrence Journal-World reports.\nThe Rev. Scott Hanks, the congregation’s leader, said the church had determined that Kelly’s order, which limits the number of worshipers meeting in “the same building or confined or enclosed space,” would still allow for outdoor services.\nSheriff’s office spokeswoman Jenn Hethcoat said it reached a similar conclusion, as long as social-distancing requirements are observed. The church also held an Easter service in which about 40 vehicles were spotted parked outside. But it wasn’t cited because of a technical issue; Kelly’s order hadn’t yet been published in the state’s legal newspaper.\n___\nHollingsworth contributed from Mission, Kansas.", "url": "https://apnews.com/7c367ab69c32d393755bdf1509e8e429"}