{"authors": ["Harmeet Kaur"], "date_download": "2020-05-04 16:59:04", "date_modify": "2020-05-04 16:59:04", "date_publish": "2020-04-08 00:43:05", "description": "For some abortion rights opponents around the country, orders by cities and counties to stay at home during the coronavirus pandemic have become a point of contention.", "filename": "2020_04_07_us_abortion-opponents-stay-at-home-citations-trnd_index_1588611544.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406202442-planned-parenthood-san-francisco-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_us_abortion-opponents-stay-at-home-citations-trnd_index_1588611544.html", "title": "Abortion rights opponents in several cities have been cited for violating stay-at-home orders", "title_page": "Abortion rights opponents in several cities have been cited for violating stay-at-home orders - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) For some abortion rights opponents around the country, orders by cities and counties to stay at home during the coronavirus pandemic have become a point of contention.\nIn recent weeks, police in several cities have arrested people who continued to engage in anti-abortion rights demonstrations or other advocacy efforts outside reproductive health clinics, despite stay-at-home orders and similar restrictions.\nThe arrests and citations come as the fight over abortion access continues to play out during the pandemic.\nRecently, federal judges in Alabama, Ohio, Oklahoma and Texas blocked state officials from including abortions among nonessential procedures that should be postponed or canceled while health care facilities focus efforts on the coronavirus.\nAbortion providers and abortion rights proponents had filed complaints arguing that officials were exploiting a public health crisis to advance a political agenda.\nGiven that abortion services are largely continuing during the crisis, abortion rights opponents and groups defending those arrested contend that the actions being taken by anti-abortion activists should be considered essential -- and therefore exempt from stay-at-home orders.\nHere are some of the cities where abortion opponents have been arrested or cited for allegedly failing to comply with stay-at-home orders.\nCharlotte, North Carolina\nEight people protesting outside an abortion clinic in Charlotte were arrested on Saturday for allegedly violating the state's stay-at-home order, police said, according to CNN affiliate WSOC\nAbout 50 people were protesting outside A Preferred Women's Health Center when officers arrived, the station reported. Because the state's order prohibits gatherings of more than 10 people, officers asked everyone to leave. Twelve people who refused were issued citations, and eight people who resisted further requests were eventually arrested, according to the station.\nCharlotte-Mecklenburg Police did not respond to CNN's phone calls and email requesting comment.\nConservative activist David Benham, who is affiliated with the anti-abortion group Cities4Life and was one of the people arrested , told CNN affiliate WBTV that three people were there from his organization, though others were there individually. He argued that Cities4Life should be considered an essential business under North Carolina's order.\nIn a video posted to his Twitter account , Benham claimed that he was socially distancing and \"not violating state ordinances in regards to gathering in groups of 10 or more.\"\nCalla Hales, executive director of A Preferred Women's Health Center, told the Charlotte Observer before the arrests that protesters had been gathering in front of the clinic despite state orders, and that they had not been following social distancing guidelines or wearing protective gear as they approached patients.\n\"Despite the ongoing hardships of the COVID-19 pandemic and continued harassment from anti-choice protesters, A Preferred Women's Health Center remains committed to providing accessible abortion care to those who seek it, as abortion care is truly essential healthcare,\" Hales said in a written statement to CNN.\nSan Francisco\nLast week, police in San Francisco cited an 86-year-old man outside a Planned Parenthood clinic, the department told CNN.\nRonald Konopaski, a longtime anti-abortion opponent who has led \"40 Days for Life\" campaigns outside Planned Parenthood clinics for more than a decade, was cited on April 2 for violating the city's shelter-in place-order , police spokesperson Michael Andraychak said in an email.\nThe Planned Parenthood clinic in San Francisco where police cited an 86-year-old demonstrator.\nSan Francisco's order requires that people stay at home except for \"essential needs\" and directs businesses and other organizations to suspend \"nonessential operations.\"\nKonopaski was at the clinic the previous day and had been warned about complying with the order, Andraychak said. He has had a small booth outside of the clinic since February, according to CNN affiliate KPIX\nKonopaski confirmed the incident to CNN, although he called the citation \"kind of a bogus thing\" and argued that he was within his rights while stationed outside the clinic.\n\"Our position is if it's essential to kill babies in their mother's womb, it's essential for someone to give them another option,\" Konopaski said.\nCNN reached out to the local Planned Parenthood for comment.\nGreensboro, North Carolina\nGreensboro police arrested three people outside a reproductive health services clinic on March 28 for violating the county's stay-at-home order and refusing to leave voluntarily after officers asked them to, according to a police statement\nRon Glenn, a spokesperson for the Greensboro Police Department, told CNN that police initially encountered five people outside A Woman's Choice of Greensboro who had traveled there from outside Guilford County. Guilford County's stay-at-home order prohibits all nonessential travel.\nFour of them did not comply with officer requests to leave the clinic and were cited for nonessential travel, Glenn said. He said that after the citations were issued, three still refused to leave and were arrested and charged with resisting, delaying and obstructing a public officer -- a Class 2 misdemeanor under state law.\nThe three arrested were part of a group called Love Life, Glenn said. He said that the group, whose mission includes ending abortion, had been warned by police before its arrival on March 28 that members could be cited, arrested or charged if they traveled to Greensboro.\nOn March 30, seven people, including three people who were cited on March 28, came to the reproductive health clinic, police said. They were all cited for violating the stay at home order and arrested for resisting, delaying and obstructing a public officer after they refused to leave, Glenn said.\nGlenn said that the department hoped people would comply with the order voluntarily.\n\"The goal of the stay-at-home order is to help reduce the spread of this virus in our community and this is one of the means by which we're going about doing that,\" he said. \"We hope that people take that seriously just for the safety of the community and their neighbors and friends and family.\"\nJim Quick, a volunteer with Love Life, spoke about the incidents in a phone call with CNN. He said that the people outside the clinic were there as part of the weekly prayer walks that the organization holds in Greensboro and three other cities, and that some of them had traveled there from Charlotte.\nIn a March 28 statement on Facebook , Love Life disputed the notion that it violated stay at home directives, arguing that it provided \" charitable and social services \" and was therefore among the essential businesses exempt from the order.\nThe statement said that Love Life's lawyer called police on the way to Greensboro to discuss this, but that law enforcement \"refused to have any type of discussion about the provisions of the Guilford County proclamation.\"\nSince the two incidents, Love Life said it would no longer be gathering for prayer walks in groups and has asked people to avoid demonstrating in Greensboro for the time being, Quick said.", "url": "https://www.cnn.com/2020/04/07/us/abortion-opponents-stay-at-home-citations-trnd/index.html"}