{"authors": ["Nicole Chavez", "Jason Hanna", "Christina Maxouris"], "date_download": "2020-05-04 16:11:34", "date_modify": "2020-05-04 16:11:34", "date_publish": "2020-04-02 07:40:47", "description": "The novel coronavirus has a strong grip in the United States and the nation's top infectious disease expert says the whole country should already be under orders to stay at home.", "filename": "2020_04_02_health_us-coronavirus-thursday_index_1588608694.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402031714-shelter-in-place-illinois-0323-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_health_us-coronavirus-thursday_index_1588608694.html", "title": "Nearly all Americans are under stay at home orders but Fauci says the US needs more coronavirus restrictions", "title_page": "US coronavirus: Nearly all Americans are under stay at home orders but Fauci says the US needs more restrictions - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The novel coronavirus has a strong grip in the United States and the nation's top infectious disease expert says the whole country should already be under orders to stay at home.\n\"I don't understand why that's not happening,\" Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said Thursday on CNN's Global Town Hall, \"Coronavirus: Facts and Fears.\"\n\"If you look at what's going on in this country, I just don't understand why we're not doing that,\" Fauci added. \"We really should be.\"\nMore than 90% of the US population will be under a local or state order this week but Fauci and other officials have said stricter measures are needed to slow down the spread of the virus.\nPresident Donald Trump said Thursday his administration will soon release nationwide recommendations on wearing face masks . Some cities are already asking people to wear face coverings if they need to go out.\nNew York Mayor Bill de Blasio issued the new guidance Thursday, urging people to cover themselves to reduce the risk of transmission.\n\"It could be a scarf. It could be something you create at home, like a bandana,\" de Blasio said.\nLos Angeles Mayor Eric Garcetti made a similar recommendation Wednesday, though he asked people not to wear medical or surgical masks.\nIn Laredo, Texas, residents will receive fines of up to $1,000 if they don't cover their noses and mouths with \"some form of covering\" when entering a building open to the public, using public transportation or pumping gas.\nA city order that went into effect Thursday says all residents older than 5 should wear face coverings, including homemade masks, scarfs and bandanas.\nBut a top White House health adviser has strongly cautioned that masks should not lull Americans into a false sense of security.\n\"It is not a substitute for the presidential guidelines (on social distancing) that have already gone out,\" Dr. Deborah Birx, coordinator of the White House coronavirus task force, told reporters. \"Don't get a false sense of security that that mask is protecting you exclusively from getting infected.\"\nThe number of cases surpassed 1 million worldwide Thursday and more than 52,000 people have died from the virus, according to Johns Hopkins University statistics . The total includes confirmed cases from 180 countries and regions.\nIn the United States -- now the country hardest-hit by the pandemic -- the virus has already infected more than 242,000 people from coast to coast.\n'It's within our power to modify those numbers'\nDr. Anthony Fauci, the top US infectious disease expert, said Thursday the country can still defy alarming projections of coronavirus deaths with aggressive measures -- even as scientists warn the White House that simply exhaling may be enough to spread the virus.\nModels had showed that the US death toll could be at least 100,000 with aggressive social distancing , White House experts said earlier, and as high as 2.2 million without them.\nBut, \"it's within our power to modify those numbers,\" Fauci, director of the National Institute of Allergy and Infectious Diseases, told \"CBS This Morning\" on Thursday.\n\"If you really push hard on mitigation ... you can modify the model,\" Fauci said. \"We need to push and push with the mitigation to try and get that number lower than the projected number.\"\nAs of Thursday evening, at least 242,095 people in the United States have been infected and at least 5,831 have died, according to Johns Hopkins University statistics . More than 920 of those deaths were reported Wednesday -- the highest number reported in the country since the beginning of the outbreak.\nFauci's comments come after a prestigious scientific panel told the White House on Wednesday night that coronavirus can be spread not just by sneezes and coughs, but also by talking or maybe even just breathing.\n\"While the current (coronavirus) specific research is limited, the results of available studies are consistent with aerosolization of virus from normal breathing,\" according to a letter written by Dr. Harvey Fineberg, chairman of a committee with the National Academy of Sciences.\nRecent developments\n• About 6.6 million US workers filed for their first week of unemployment benefits last week, data released Thursday shows. That's double the record set a week earlier: 3.3 million.\n• Louisiana's coronavirus cases jumped by more than 2,700 in 24 hours, bringing its total to more than 9,000, the state health department said Thursday.\n• More than 2,000 ventilators in the federal stockpile are unavailable for deployment because they weren't maintained while in storage, according to The New York Times.\n• More than 110 sailors from USS Theodore Roosevelt, now at port in Guam, have tested positive for coronavirus, according to a US defense official. Some of the sailors from the Roosevelt will be quarantined in hotel rooms in Guam.\nNew York doctor says she feels like 'a sheep going to slaughter'\nDoctors and nurses across the country have spoken out about the difficulty of helping an increasing number of Covid-19 patients with dwindling amounts of protective equipment, ventilators and beds.\nIn hard-hit New York, nurses and other medical personnel at the Bronx's Montefiore Medical Center Moses Division told reporters they desperately needed N95 masks and other protective equipment.\nA third-year resident there said she goes to work feeling \"like a sheep going to slaughter.\"\n\"My colleagues and I are writing our last will and testament. I'm 28 years old,\" Dr. Laura Ucik said.\n\"We fear that we may not survive this pandemic and yet we show up every day,\" she said. \"We're running out of (personal protective equipment), we're running out of pain medicine, we're running out of sedatives, we're running out of oxygen masks.\"\nThursday, New York Gov. Andrew Cuomo estimated that his state had \"about six days\" before its stockpile of ventilators, which he is sending to hospitals in need, runs out.\nA day earlier, he cited a model that showed as many as 16,000 New Yorkers could die from the virus.\nNew York, now the epicenter of the outbreak, has reported more than 92,000 cases and 2,317 deaths. More than 51,000 of those infections have been in New York City, Cuomo said Thursday.\nAbout 21,000 out-of-state medical professionals have volunteered to come into New York, Cuomo said Thursday.\n\"I thank them, I thank their patriotism, I thank their dedication and passion to their mission of public health,\" he said.\nEmergency medical services received a record number of emergencies each day, with a 50% increase over normal daily call volume, the New York City Fire Department said in a news release.\nOn Tuesday alone, FDNY EMS responded to 6,010 medical calls, Jim Long, a spokesperson for the department, told CNN.\n'What are you waiting for?' California governor says to states without stay-at-home orders\nNearly 92% of the US population lives in jurisdictions with general \"stay-at-home\" or \"shelter-in-place\" orders . Most governors issued them statewide, and many counties and cities have issued orders where statewide orders aren't in place.\nCalifornia Gov. Gavin Newsom, who in March became the first governor to issue a statewide order, argued that every state needed one.\n\"What are you waiting for? What more evidence do you need?\" he said Wednesday \"If you think it's not going to happen to you, there are proof points all over the United States, all over the world.\"\nPresident Donald Trump said Wednesday he would not issue a national stay-at-home order because different states have different infection rates.\n\"You have to look -- you have to give a little flexibility. If you have a state in the Midwest, or if Alaska for example doesn't have a problem, it's awfully tough to say close it down. We have to have a little bit of flexibility,\" he said.\nEarly data: Malaria drug could shorten recovery time\nSome new data from researchers in Wuhan, China, suggests the malaria drug hydroxychloroquine could significantly shorten the time it takes for Covid-19 patients to recover from illness.\nIn this early research, posted to the online health sciences server medRxiv on Tuesday, the researchers wrote that \"the body temperature recovery time and the cough remission time were significantly shortened\" among patients treated with hydroxychloroquine compared with a control group not treated with the drug.\nThe research has limitations, including that it was conducted in a very small group of patients with mild illness and has not been published yet in a peer-reviewed journal.\nThe FDA has yet to approve a treatment for Covid-19. However, this week it granted emergency authorization for doctors to use hydroxychloroquine and chloroquine to treat hospitalized patients for a limited set of cases, and clinical trials are pending.\nThe Chinese study is promising, Dr. Rochelle Walensky, the chief of the infectious disease department at Massachusetts General Hospital, told CNN Thursday.\nBut, she cautioned, \"we're not sure this can be generalized to all patients,\" she said.\n\"They gave it to people who didn't have (other chronic conditions), like cardiovascular comorbidity and liver disease and renal disease,\" Walensky said.\nThe research at Wuhan's Renmin Hospital focused on 62 patients -- 31 who received hydroxychloroquine for five days, and 31 in a control group who received standard care. More than 80% of the patient receiving hydroxychloroquine had improved pneumonia, compared to 54.8% of the control group.\nCORRECTION: This story has been updated to give the correct estimate for how many Americans live in states where they've been ordered to stay at home.", "url": "https://www.cnn.com/2020/04/02/health/us-coronavirus-thursday/index.html"}