{"authors": ["Caroline Kelly", "Lauren Fox"], "date_download": "2020-05-04 16:04:51", "date_modify": "2020-05-04 16:04:51", "date_publish": "2020-04-02 01:36:28", "description": "Top Senate Democrat Chuck Schumer on Wednesday dismissed the President's proposal of a $2 trillion infrastructure plan to counteract the coronavirus' economic effects, characterizing the effort as premature compared to the health care crisis triggered by the virus.", "filename": "2020_04_01_politics_schumer-coronavirus-infrastructure-plan_index_1588608291.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200325083907-sen-chuck-schumer-stimulus-package-outline-sot-newday-vpx-00021227-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_schumer-coronavirus-infrastructure-plan_index_1588608291.html", "title": "Schumer wants to deal with coronavirus crisis before talking infrastructure recovery plan", "title_page": "Chuck Schumer wants to deal with coronavirus crisis before talking infrastructure recovery plan - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Top Senate Democrat Chuck Schumer on Wednesday dismissed the President's proposal of a $2 trillion infrastructure plan to counteract the coronavirus' economic effects, characterizing the effort as premature compared to the health care crisis triggered by the virus.\nWhen asked by CNN's Erin Burnett whether he gave President Donald Trump credit for his willingness to make such a hefty investment, Schumer replied, \"I'd have to say seeing is believing.\"\n\"We once asked him for that amount, Speaker (Nancy) Pelosi and I in the White House, and he sort of got up and walked out. So let's wait and see. Our immediate problem is dealing with the health care crisis,\" the New York Democrat added.\n\"Infrastructure is good -- I'm all for it, that's when we try to heal the economy,\" Schumer said. \"But until we get this crisis in order, the economy will get worse and worse and worse because people won't be at their jobs, people will be stuck in their homes.\"\nSchumer called \"a dramatic shortage of all the needed supplies\" for those fighting the virus \"one of the greatest problems we face,\" lamenting that \"we have no one really in charge -- we have this awful spectacle of governors bidding against one another.\"\nRead More", "url": "https://www.cnn.com/2020/04/01/politics/schumer-coronavirus-infrastructure-plan/index.html"}