{"authors": ["Ashley Strickland"], "date_download": "2020-05-04 17:02:52", "date_modify": "2020-05-04 17:02:52", "date_publish": "2020-04-06 07:44:50", "description": "Dealing with a pandemic can also help us prepare for landing on another planet, NASA experts say. It requires a level of care and caution we haven't had to exercise in our daily lives -- until now.", "filename": "2020_04_06_world_mars-mission-prep-pandemic-scn_index_1588611772.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190529123117-after-the-moon-mars-1-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_world_mars-mission-prep-pandemic-scn_index_1588611772.html", "title": "How a pandemic prepares us for exploring and living on Mars", "title_page": "How a pandemic prepares us for exploring and living on Mars - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As people around the world rethink many aspects of their lives to combat the coronavirus pandemic, NASA experts say that knowledge and understanding of how to stay safe and healthy will help us prepare for landing on another planet.\nAfter all, NASA's robotic explorers are already on Mars paving the way for future astronaut-led missions to the Red Planet -- and those expeditions will require a level of safety planning that would put a germophobe to shame.\nAstronauts don't want to carry Earth bacteria to the surface of Mars because it could contaminate the environment, or even show up as a false positive of life on the planet. And they also have to be careful to quarantine any samples returned.\nIt requires a level of care and caution we haven't had to exercise in our daily lives -- until now.\nDuring the Apollo program, astronauts were quarantined before and after moon landings for weeks in case they encountered pathogens on the lunar surface. Samples returned from the moon were treated with the same level of care as biohazards.\nNow we know that the astronauts didn't pick up any diseases during their moon walks, and there's no life that we know of on the moon. The surface is hit by micrometeorites and radiation, with no atmosphere to protect it.\nBut it was a smart move because humans were exploring the unknown and they wanted to protect the astronauts.\nIt's also part of the reason why COSPAR, the global Committee on Space Research, exists. It was formed in 1958 to further research, exploration and the peaceful use of outer space through international cooperation, according to the COSPAR mission statement.\nCOSPAR has a planetary protection policy (PDF) ensuring that the world's space agencies protect the safety of our planet as well as any that we explore.\n\"The Planetary Protection Requirements are an international NATO treaty, ratified by COSPAR,\" Moogega Stricker, Planetary Protection Lead Engineer for NASA's Perseverance rover mission, told CNN in June. \"It's an international policy that we have to abide by. Agencies around the world have to make sure their hardware and their spacecraft is clean enough.\"\nThis governs the level of sterilization that spacecraft and robotic explorers endure before launch. The rovers and landers were assembled in NASA's \"cleanrooms,\" where the only people allowed to enter are covered head-to-toe in white coveralls called \"bunny suits,\" complete with face shields.\nAnd even more precautions will be taken when humans are sent to explore Mars.\nHere's how NASA prepares for safe exploration.\nReturning samples from Mars\nNASA's next generation of Martian rover, named Perseverance, will land on Mars in Jezero Crater next year. The site is where a lake once existed 3.5 billion years ago. Perseverance will collect samples and seal them up to preserve them until they can be returned to Earth, hopefully sometime in the 2020s.\nStricker's job is to \"make sure that we don't contaminate Mars with Earth germs when we go and explore that planet.\"\nIn her lab, the team take samples that they collect from the spacecraft and grow them in Petri dishes to see how clean the spacecraft really is before launch. They look for evidence of spores that can attach to the spacecraft.\n\"We look for these seeds that certain microbes can produce, and those are the things that would survive the journey in deep space, the harsh environments -- that's why we look for those on our Petri dishes every single day when we swab the spacecraft,\" Stricker said.\nThey also look for viable organisms, like E. coli, that can live on skin. Although something like this can't survive without a host, if it was found on the Martian surface it could be confused with fossilized life, Stricker said.\nThe room where the rover is constructed is \"cleaner than an operating room, cleaner than a lot of the things we interact with,\" she said.\nParts of the spacecraft that will actually touch the Martian surface are sterilized, fired at 662 degrees Fahrenheit. \"It's just the cleanest thing you're ever going to see,\" Stricker said. This includes collection tubes for samples on Mars.\nPerseverance will collect rock, mineral and soil samples -- and those soil samples could even include microfossils from ancient organisms that may have once lived in the lake. The data it collects may be able to help scientists know if they've found a biosignature on Mars.\n\"On the science side, we're really thinking about new discoveries we can make on the surface and how [that] will inform what we learn when we get the samples back,\" said Katie Stack Morgan, deputy project scientist for the rover at NASA's Jet Propulsion Laboratory in Pasadena, California, also speaking to CNN in June. \"Our job is to find the best samples, collect and store them, and place them on the surface.\"\nThe rover will pick up the samples, put them inside its body and seal them in tight metal tubes that were designed to withstand the Martian environment -- at least, that's the hope of NASA engineers. The samples will be dropped at specific collection sites so they can be retrieved later.\n\"Combining an understanding of the composition of the rocks, but also the very fine detail that we see in the rocks and the textures, can make a powerful case for ancient signs of life,\" Stack Morgan said.\n\"We know that ancient Mars was habitable. But we haven't yet been able to show that we have signs, real signs, of ancient life yet. And with our instrument suite, we think we can make real advances towards that on the surface.\"\nReturning the samples is a challenge down the road, and NASA is already planning for it. The earliest mission that could go back to Mars to retrieve the samples is set for the 2026-2027 timeframe, Stack Morgan said.\n\"This is a huge endeavor for the human species, and it'll take cooperation from more than just our own space program,\" Stack Morgan said. \"Once the resources are there, we can develop the technology. It's getting the buy-in from international partners and from our own space administration and government to really make this happen.\"\nThe new rover will also be on a mission to lay the groundwork for future human exploration.\n\"We're very much thinking about how Mars could be inhabited, how humans could come to Mars and make use of the resources that we have there in the Martian environment today,\" said Stack Morgan. \"We send our robotic scouts first to learn about these other places, hopefully for us to prepare the way for us to go ourselves.\"\nReturning samples could also inform how, when and where we land humans on Mars.\nWhen Martian samples are returned to Earth and searched for evidence of life, they will be sent to biosafety level 4 laboratories, which are used to research pathogens that cause fatal diseases like coronavirus, said Jim Green, NASA's Chief Scientist.\nIf life, ancient or existing, is found on Mars through studying these samples, the discovery will cause COSPAR members to change the COSPAR guidelines so we can \"come up with a way to explore Mars,\" Green said.\nAnd frankly, it would change everything.\n\"It would mean that the possibilities now are endless for other potential civilizations or even microbial populations out there,\" Stricker said. \"It doesn't have to be intelligent and complex. Microbes are actually quite intelligent and complex and should be admired. So if we found signs of life, it will shift our idea of being alone, or where we stand, in this universe.\"\nHumans on Mars\nIn a conversation this week hosted by non-profit organization Explore Mars, Inc. , Green and Penelope Boston, Director of NASA's Astrobiology Institute, considered how humans can safely explore Mars.\nGreen's idea of a Mars mission includes landing in one spot and separately living in another and setting up an \"exploration zone.\" It allows the astronauts to work in a confined area on Mars and perform scientific experiments. He suggests that future missions land and live in the same spots created by that first mission.\n\"It gives us a wonderful opportunity over several decades of going there, building and developing things at that site,\" said Green. \"We can gain a deep understanding of what Mars is all about.\"\nSo far, robotic exploration has revealed that the similarities between soil on Earth and Mars is strong. But human exploration and experiments could reveal even more.\nIf life is found on Mars, Boston's research has led her to believe that it will be deep beneath the surface. Recent studies have shown that life can exist in rock cracks below Earth's ocean floor , and it could be the same in the Martian subsurface.\nBut care will need to be taken that any potential subsurface groundwater sources on Mars aren't contaminated by human exploration.\n\"I'd love to see boots on Mars, but I'm very aware of the deep ecology aspects of another biosphere,\" Boston said. \"How do we study and cohabit with it without doing damage? Luckily the surface environment is harsh. It's not entirely self-sterilizing, but it will do a lot to reduce contaminants.\"\nStricker's job will evolve if humans land on Mars, as she'll need to develop stringent safety rules -- not unlike the ones we're implementing today.\n\"We have to make sure if there are people living there, for example, that their crops stay intact,\" she said. \"A lot of the things they bring along need to not be contaminated by weird bugs.\"\nShe compared it to flying from one country to another with certain restricted food items.\n\"We have to make sure there aren't any weird fruits, bacteria, fungus -- something that may contaminate the livelihood, the life supply that they have on Mars,\" she said. \"We want to make sure we do the best job at preserving whatever is native.\"\nThe original version of this story failed to note that two quotes from NASA scientists were given during a June interview with CNN's Amanda Sealy. The story also used the wrong last name and gender for Dr. Stricker. The article has been corrected.", "url": "https://www.cnn.com/2020/04/06/world/mars-mission-prep-pandemic-scn/index.html"}