{"authors": [], "date_download": "2020-05-04 20:28:01", "date_modify": "2020-05-04 20:28:01", "date_publish": "2020-04-08 13:39:07", "description": "TRENTON, N.J. (AP) — New Jersey's June 2 primary is moving to July 7 because of the coronavirus outbreak under an executive order Gov. Phil Murphy signed Wednesday. Murphy said the extra...", "filename": "_d8927c81678700d16ad91e6d6824e44d_1588624081.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d8927c81678700d16ad91e6d6824e44d_1588624081.html", "title": "NJ pushes primary to July 7 from June 2 because of COVID-19", "title_page": "NJ pushes primary to July 7 from June 2 because of COVID-19", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NJ pushes primary to July 7 from June 2 because of COVID-19\nTRENTON, N.J. (AP) — New Jersey’s June 2 primary is moving to July 7 because of the coronavirus outbreak under an executive order Gov. Phil Murphy signed Wednesday.\nMurphy said the extra time will give officials a chance to evaluate whether the state needs to go to an all-mail election, which he noted has never been done before. He said the possibility of a mail-in only election for the primary was on the table.\n“Our democracy cannot be a casualty of COVID-19. We want to ensure that every voter can vote without endangering their health or their safety,” said Murphy, a Democrat.\nMurphy specifically pointed to the election in Wisconsin that was held Tuesday despite the governor’s efforts to delay it. The state’s Supreme Court disagreed with delaying the election.\nNew Jersey shouldn’t become Wisconsin “where folks had to pick between exercising their right to vote on the one hand and protecting their personal health,” Murphy said.\nNew Jersey reported 275 more deaths from the virus, bringing the total to 1,504. More than 47,000 people have tested positive, Murphy and Health Commissioner Judy Persichilli said.\nA look at other coronavirus developments in New Jersey:\n___\nMASKS AND LIMITS AT STORES\nEssential stores like groceries and supermarkets must indefinitely limit the number of customers allowed in their stores to no more than half of their capacity under an order Murphy signed Wednesday.\nCustomers and employees must cover their faces, and stores must also offer special shopping hours for high-risk people, along with putting up physical barriers between cashiers and customers “where practicable” under the order.\nMurphy said the order about limiting capacity to 50% at stores stemmed from social distancing guidelines and not a supply issue at supermarkets.\n___\nSOME CONSTRUCTION HALTED\nNonessential construction in the state must shut down, the governor said. Murphy said he would sign an order halting some construction projects. Some raised concerns that construction workers were risking exposure to the virus for nonessential projects, like bathroom makeovers.\n___\nTRUCK WEIGHT LIMITS\nSemi trucks carrying health care equipment may transport up to 46 tons under an order the governor said he would sign on Wednesday. That’s up from a 40 ton limit on highways previously.\n___\nNEW FIELD HOSPITAL\nMurphy and other state and military officials toured the state’s second and biggest field hospital on Wednesday.\nThe 500-bed facility in Edison at the New Jersey Convention and Exposition Center is double the size of another field hospital opened recently in Secaucus and has 250 beds.\nThe field hospitals are expected to serve only non-coronavirus patients, taking pressure off other facilities so they can address those with COVID-19, according to the governor.\nAnother facility is expected to open in Atlantic City.\n___\nNJ TRANSIT DEATH\nNew Jersey Transit has reported its first death from COVID-19.\nConductor Joe Hansen was 62 and had worked for the agency for more than 20 years, most recently on the Raritan Valley Line.\nEighty-seven NJ Transit employees had tested positive for the coronavirus, including 57 who work operating trains or buses or cleaning stations, the agency said Tuesday.\nMore than 500 employees were quarantining as they awaited test results, President and CEO Kevin Corbett said. NJ Transit has approximately 12,000 employees.\n___\nNURSING HOME DEATHS\nAt least a dozen deaths at an Elizabeth nursing home were attributed to the virus, Mayor Chris Bollwage told NJ.com .\nThe facility has been closed to new admissions.\nCoronavirus is hitting New Jersey’s nursing homes hard. Half of the state’s 375 facilities have at least one positive case of the virus, Health Commissioner Judy Persichilli has said.\n___\nSANDY HOOK CLOSING\nThe federally run shoreline at Sandy Hook is shuttering.\nGateway National Recreation Area, which is run by the National Park Service, said in a Facebook post that it was closing Sandy Hook indefinitely.\nThe closure follows Murphy’s executive order on Tuesday closing all state and county parks because not enough people were following social distancing guidelines.\n___\nOCEAN CITY OUTSIDERS\nThe mayor of a New Jersey Shore town says residents have been begging him to close the bridges into town to keep outsiders away during the virus outbreak.\nJay Gillian wrote in a message to residents Tuesday night that he does not have that authority.\nBut even if he did, the mayor wrote, that would set a bad precedent. “Now is not the time to point fingers and to blame others,” he wrote. “It’s a time to work together. If we spend our energy scorning our neighbors, we will leave scars that will last much longer than coronavirus.”\n___\nABOUT THE VIRUS\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, or death.", "url": "https://apnews.com/d8927c81678700d16ad91e6d6824e44d"}