{"authors": ["Alisha Ebrahimji"], "date_download": "2020-05-04 16:25:23", "date_modify": "2020-05-04 16:25:23", "date_publish": "2020-04-03 17:19:36", "description": "After a weekend spent on call in a New York City hospital, one doctor posted a message for her kids with a raw and honest view of what it's like to be a healthcare worker on the frontlines of the coronavirus outbreak.", "filename": "2020_04_03_us_mom-ppe-photo-trnd_index_1588609523.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403112620-dr-cornelia-griggs-new-day-screengrab-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_us_mom-ppe-photo-trnd_index_1588609523.html", "title": "Doctor's message to her kids 'if they lose me to COVID I want them to know Mommy tried really hard'", "title_page": "Doctor's message to her kids 'if they lose me to COVID I want them to know Mommy tried really hard' - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) After a weekend spent on call in a New York City hospital, one doctor posted a message for her kids with a raw and honest view of what it's like to be a healthcare worker on the frontlines of the coronavirus outbreak.\n\"My babies are too young to read this now,\" Dr. Cornelia Griggs tweeted . \"And they'd barely recognize me in my gear. But if they lose me to COVID I want them to know Mommy tried really hard to do her job. #GetMePPE #NYC.\"\nMy babies are too young to read this now. And they'd barely recognize me in my gear. But if they lose me to COVID I want them to know Mommy tried really hard to do her job. #GetMePPE #NYC pic.twitter.com/OMew5G7mjK\nDr. Griggs, a pediatric surgery fellow at Columbia University Medical Center, told CNN's John Berman that it was a long, exhausting weekend for her and her colleagues.\n'Walking into the fire'\nThe tweet caught the attention of many, including hip-hop artist, Missy Elliot.\n\"We are going to speak it out of mouths that your babies will read this & you will be around to tell them about your bravery & others! Thank you for your hard work to help save lives,\" Elliot tweeted\nGriggs said she thinks her photo to her two kids struck a nerve with people because her message \"reflected what a lot of healthcare workers, especially in New York, are feeling right now.\"\nBut despite the messages of support, Griggs said she doesn't feel brave.\n\"Waking up and walking into the hospital can feel like walking into the fire,\" she said. \"I feel scared every day but I'm still very determined to go to work every day and do the job that needs to be done because I still love my job.\"\nGriggs said hospitals around the city are still in dire need of personal protective equipment (PPE) for healthcare workers and she'd like to see a continued effort to secure more.\n\"But it's not just gonna be PPE that we run out of,\" she said. \"We need to focus on a lot of other supply chains, including critical medications, more ventilators and more machines that can give patients dialysis.\"\nOne thing remains constant for Griggs during this time. She said the comradery throughout the hospital among the staff is inspiring.\n'Staying home is saving a life'\nGriggs and her husband, who is also a healthcare worker, recently wrote their wills.\n\"It wasn't a move that we made out of panic, we just wanted to be prepared,\" she said. \"I think it felt like the responsible thing to do as parents at this moment in time because both of us have friends that have contracted Covid-19. Some have recovered and some are still very sick and some of our colleagues are patients at the hospital.\"\nGriggs said even though it may not seem like there's not much the average person can do to help, that couldn't be farther from the truth.\n\"Part of that role is staying at home, sheltering in place, flattening the curve, buying us time, holding the line,\" she said. \"I have so many friends at home who feel frustrated and claustrophobic but what everyone is doing by staying home is saving a life.\"", "url": "https://www.cnn.com/2020/04/03/us/mom-ppe-photo-trnd/index.html"}