{"authors": ["Kristen Holmes", "Carma Hassan", "David Williams"], "date_download": "2020-05-04 16:13:03", "date_modify": "2020-05-04 16:13:03", "date_publish": "2020-04-02 14:29:17", "description": "A New England Patriots team plane loaded with 1.2 million N95 protective masks has landed back in Boston after picking up the vital supplies in China.", "filename": "2020_04_02_us_coronavirus-patriots-plane-masks-spt-trnd_index_1588608783.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402095833-01-patriots-plane-coronavirus-trnd-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_us_coronavirus-patriots-plane-masks-spt-trnd_index_1588608783.html", "title": "New England Patriots team plane with 1.2 million N95 masks arrives from China to help ease shortages", "title_page": "New England Patriots team plane with 1.2 million N95 masks arrives from China to help ease shortages - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A New England Patriots team plane loaded with 1.2 million N95 protective masks has landed back in Boston after picking up the vital supplies in China.\nMassachusetts Gov. Charlie Baker tweeted a photo of the plane being loaded with the personal protective equipment that he said would go to the state's health care workers on the front lines of the coronavirus crisis.\n\"Tonight's arrival of a major shipment of N95 masks on the Patriots' plane was a significant step in our work to get front-line workers the equipment they need,\" the governor later said on Twitter. \"And it's an example of how collaboration and partnership can lead to real solutions during these challenging times.\"\nAccording to a source, Baker is extremely frustrated that the federal government outbid him on supplies that were en route to Massachusetts. He worked with New England Patriots ' owner Robert Kraft and the Patriots to get these supplies brought over from China.\n\"No days off. Thanks to some serious teamwork, Massachusetts is set to receive over 1 million N95 masks for our front-line workers. Huge thanks to the Krafts and several dedicated partners for making this happen,\" Baker said in a tweet.\nNo days off. Thanks to some serious teamwork, Massachusetts is set to receive over 1 million N95 masks for our front-line workers. Huge thanks to the Krafts and several dedicated partners for making this happen. pic.twitter.com/ieV6XMC5Ow — Charlie Baker (@MassGovernor) April 2, 2020\nRobert Kraft and Patriots president Jonathan Kraft partnered with the state to purchase 1.4 million N95 masks for Massachusetts, according to the team. Kraft also purchased another 300,000 protective masks for New York state.\nThose will be in New York Friday morning, Kraft said.\nBringing the equipment to the US on the team's airplane was \"probably the most challenging operation our organization and team ever had to do,\" he told CNN Thursday night.\n\"It was -- there was a lot of red tape, but a lot of people cooperated\" he said. \"We had three governors. We had a counsel from China, our crew who flew probably more hours than they should have, but they knew how important it was. And, you know, it's just -- it's like doing your job and never taking time off when something's really important.\n\"And the team effort -- and I'll just tell you the response we've gotten from America when our plane came back, people are looking for good things,\" he said. \"We are -- this is the greatest country in the world. It's time for us to rally together and solve these kinds of issues.\"\nThe plane landed at Boston's Logan International Airport at 5:55 p.m. ET carrying 1.2 million masks. A second shipment of another half-million N95 masks is scheduled to arrive as early as next week.\nAfter landing, the masks were lowered off the plane and placed on luggage trolleys, according to video from CNN affiliate WBZ.\nPatriots plane unloaded at Logan. Masks galore. pic.twitter.com/iTLQ222oL4 — Ken MacLeod (@KenMacWBZ) April 2, 2020\nFrom there, the masks were hauled into the airport's Delta hangar where they were received by the National Guard.\nN95 masks are hauled into the Delta hangar at Logan — where the national guard is waiting to truck them away. pic.twitter.com/KmmCTvdcHX — Ken MacLeod (@KenMacWBZ) April 2, 2020\n\"The Krafts, our partners Ambassador Huang Ping, Dr. Jason Li, Gene Hartigan and our Covid-19 Command Center personnel teamed up to get this job done and we eagerly await the plane landing at Logan Airport soon,\" Baker said in a statement provided to CNN. \"Our administration will keep pursuing the PPE necessary to support our brave front-line workers who are working tirelessly to save lives during this pandemic.\"\nAs of Thursday morning, Massachusetts has 7,738 reported cases of coronavirus and 122 people have died, according to figures from Johns Hopkins University", "url": "https://www.cnn.com/2020/04/02/us/coronavirus-patriots-plane-masks-spt-trnd/index.html"}