{"authors": ["Analysis Zachary B. Wolf"], "date_download": "2020-05-04 15:58:17", "date_modify": "2020-05-04 15:58:17", "date_publish": "2020-03-31 22:47:23", "description": "Two unprecedented crises at once. Twin forces are colliding in American households with vicious results.", "filename": "2020_03_31_politics_what-matters-march-31_index_1588607897.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331174008-01-coronvirus-presser-0331-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_politics_what-matters-march-31_index_1588607897.html", "title": "Coronavirus is just getting started. And your bills are due", "title_page": "What Matters: Coronavirus is just getting started. And your bills are due. - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story appeared in CNN's What Matters newsletter. To get it in your inbox, sign up for free here.\nFirst, the Covid-19 outbreak is not going anywhere. Monday saw a new record number of reported deaths (more than 500) . New projections suggest that more than 84,000 Americans will die in the coming months.\nSecond, the hard reality that we are still nowhere near the peak of the health crisis will do nothing to heal the growing economic crisis , which has no projected curve because the government has never before hit the \"kill switch\" on so much activity.\nIf you don't know someone who has it, you soon will. CNN anchor Chris Cuomo , brother of New York Gov. Andrew Cuomo, has tested positive for coronavirus, but is able to continue taping his show from home.\nYou likely already know someone who has lost their job. For many millions of Americans newly unemployed (or headed that way) the rent or mortgage or credit card bill is coming due. Tomorrow.\nThese are the countervailing crises gripping the country: An unthinkable death toll and the self-inflicted hardship needed to keep the pandemic from spiraling even further out of control.\nThe death toll won't peak until May -- or later\nEvery state has a curve -- The projected death tolls being cited by the federal government are almost impossible to comprehend.\nA model designed by the University of Washington's Institute for Health Metrics and Evaluation relies on information from state and national governments, hospital groups and the World Health Organization. It projects almost 84,000 deaths in the United States by August. Nearly 16,000 of those will be in New York alone. See the data here\nWeeks away from a peak -- The model is consistently updated. On Tuesday, it suggested the US will not hit its Covid-19 infection peak for two weeks. That means that as bad as things are now, they will get worse. That means bed shortages, ventilator shortages, medical personnel shortages. -- The model is consistently updated. On Tuesday, it suggested the US will not hit its Covid-19 infection peak for two weeks. That means that as bad as things are now, they will get worse. That means bed shortages, ventilator shortages, medical personnel shortages. There is now a field hospital in Central Park . Where else will we see them?\nMonths away from the end -- But the vast majority of deaths -- perhaps thousands per day for more than a month -- will come after the projected infection peak in April. California may not hit its peak death toll until well into May. Some states might see very few deaths at all.\nPeople are out of work\nHarsh new reality -- -- Employment hit a post-2008 record in January . That's over. An estimated 4 million Americans could file for unemployment this week, breaking the staggering record of more than 3 million Americans who filed first time jobless claims last week. California Gov. Gavin Newsom said Tuesday that more than 150,000 people in his state filed for unemployment on Monday alone.\nThe whiplash is real -- Goldman Sachs is now predicting -- Goldman Sachs is now predicting 15% unemployment . That's up from an earlier 9% prediction.\nAnd that 15% unemployment prediction sounds bad, but it's actually better than some predictions, such as one from the Federal Reserve of St. Louis, that suggested the US could hit more than 30% unemployment in 2020 .) These predictions are all over map in part because it's not at all clear when the economy can even begin to bounce back, much less if it will be able to.\nCan't keep up -- CNN's Tami Luhby and Kelly Mena have written about how the onslaught of joblessness is -- CNN's Tami Luhby and Kelly Mena have written about how the onslaught of joblessness is overwhelming the benefits infrastructure in states . That will only get worse.\nNo solutions -- House Democrats are already looking to a -- House Democrats are already looking to a fourth round of aid even before the mammoth $2.2 trillion package passed last week makes it out to the country. That's because the massive and unprecedented bill is going to end up being more of a life preserver than a solution , writes CNN's Christine Romans.\nWorldwide -- In Asia, the outbreak could -- In Asia, the outbreak could push more than 11 million people into poverty , according to the World Bank.\nThe rent is still due\nFirst, who owns your home? -- If you've lost your job and the mortgage is due and you haven't started to get beefed-up unemployment benefits yet -- or even if you have -- you should call your landlord or mortgage company about a special dispensation. -- If you've lost your job and the mortgage is due and you haven't started to get beefed-up unemployment benefits yet -- or even if you have -- you should call your landlord or mortgage company about a special dispensation. More on that here\nAsk for an extension -- Bank of America has already -- Bank of America has already said it will defer fees and allow delayed payments for mortgage, small business and auto loans. They aren't alone . The reality is your bank would rather get paid later than not at all.\nFind out if you're protected -- Multiple states -- California and New York -- have already enacted -- Multiple states -- California and New York -- have already enacted short-term eviction moratoria . And all federally backed loans now have an eviction and foreclosure moratorium.\nSo far, there's no loan payment holiday in the US -- The financial industry beat back an effort to give everyone a -- The financial industry beat back an effort to give everyone a temporary holiday from credit reporting , although some institutions have said they will do that on their own.\nRed states, blue cities, one disease\nAcross a wide array of states with Republican governors, many of the largest cities and counties -- most of them led by Democrats -- are moving aggressively to limit economic and social activity. State officials, meanwhile, are refusing to impose the strictest statewide standards to fight the virus.\nA growing chorus of big-city officials in red states like Florida, Georgia, Mississippi, Texas and Missouri are now urging their governors to establish uniform statewide rules, arguing that refusing to do so undercuts their local initiatives by increasing the risk the disease will cluster in neighboring areas -- from which it can easily reinfect their populations.", "url": "https://www.cnn.com/2020/03/31/politics/what-matters-march-31/index.html"}