{"authors": ["Tara Subramaniam", "Veronica Stracqualursi"], "date_download": "2020-05-04 16:12:21", "date_modify": "2020-05-04 16:12:21", "date_publish": "2020-04-02 18:06:36", "description": "Georgia Gov. Brian Kemp said on Wednesday that new information on the spread of coronavirus influenced his decision to issue a stay-at-home order. In particular, Kemp pointed to what he said was the recent discovery that the virus can be spread by people who are not exhibiting symptoms.", "filename": "2020_04_02_politics_fact-ch_aff7f61ac78e01c2721566b02f95f355_index_1588608741.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190506103219-brian-kemp-file-12132018-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_fact-ch_aff7f61ac78e01c2721566b02f95f355_index_1588608741.html", "title": "Fact check: Georgia governor says we only just learned people without symptoms could spread coronavirus. Experts have been saying that for months", "title_page": "Fact check: Georgia governor says we only just learned people without symptoms could spread coronavirus. Experts have been saying that for months - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Atlanta (CNN) Georgia Gov. Brian Kemp said on Wednesday that new information on the spread of coronavirus influenced his decision to issue a stay-at-home order . In particular, Kemp pointed to what he said was the recent discovery that the virus can be spread by people who are not exhibiting symptoms.\n\"What we've been telling people from directives from the CDC for weeks now that if you start feeling bad stay home, those individuals could have been infecting people before they ever felt bad. But we didn't know that until the last 24 hours,\" said Kemp, a Republican.\nFacts First: It's not true that people didn't know \"until the last 24 hours\" that individuals without symptoms could be infecting people with coronavirus. Dr. Robert Redfield, director of the Centers for Disease Control and Prevention in Atlanta, said in mid-February that asymptomatic transmission of coronavirus was possible. Furthermore, studies from as early as January showed cases of coronavirus spreading amongst people with no symptoms.\nKemp's press secretary said the governor was referring to an update that the CDC made to its guidance on March 30 that indicated there's a higher risk of people without symptoms passing on the virus. The updated guidance changed the period of exposure risk for individuals from \"onset of symptoms\" to \"48 hours before symptom onset.\"\nAs more has been learned about the virus, several experts told CNN last month that it's become clear that transmission by people who are asymptomatic or mildly symptomatic is responsible for more transmission than previously thought.\nThough it wasn't the first time he acknowledged it, Redfield confirmed that suspicion in a March 30 interview with NPR affiliate WABE, in which he said \"as many as 25%\" of individuals who are infected with coronavirus may remain asymptomatic. \"One of the [pieces of] information that we have pretty much confirmed now is that a significant number of individuals that are infected actually remain asymptomatic,\" Redfield said.\nIn a February 13 interview with CNN Chief Medical Correspondent Dr. Sanjay Gupta, Redfield said asymptomatic transmission of coronavirus was possible and concerning, based on information from the Chinese Center for Disease Control and Prevention.\n\"There's been good communication with our colleagues to confirm asymptomatic infection, to confirm asymptomatic transmission, to be able to get a better handle on the clinical spectrum of illness in China,\" Redfield said. \"What we don't know though is how much of the asymptomatic cases are driving transmission.\"\nAs of January 30, the CDC noted in its guidance for managing patients with coronavirus that \"Clinical presentation among reported cases of 2019-nCoV infection varies in severity from asymptomatic infection or mild illness to severe or fatal illness.\"\nThe potential for asymptomatic transmission is something that Dr. Anthony Fauci, the country's top infectious disease expert, first raised two months ago.\nIn late January, Fauci, director of the National Institute of Allergy and Infectious Diseases, and a member of President Donald Trump's coronavirus task force, told CNN , \"There's no doubt after reading this paper that asymptomatic transmission is occurring.\" The paper Fauci referenced is a study published on January 30 in the New England Journal of Medicine.\nPublic health experts have since said the January study was flawed , because a patient who was said to be asymptomatic actually had mild symptoms. Yet the latest update to the CDC site also cites several studies from February and March documenting coronavirus in asymptomatic patients. The CDC guidance clarifies that \"although transmission of SARS-CoV-2 from asymptomatic or pre-symptomatic persons has been reported, risk of transmission is thought to be greatest when patients are symptomatic.\"\nDr. Deborah Birx, the White House coronavirus response coordinator, echoed the CDC's caution in a March 14 briefing with other members of the coronavirus taskforce where she acknowledged that asymptomatic patients could be spreading the disease.\n\"Until you really understand how many people are asymptomatic and asymptomatically passing the virus on, we think it's better for the entire American public to know that the risk of serious illness may be low,\" Birx said, \"but they could be potentially spreading the virus to others.\"", "url": "https://www.cnn.com/2020/04/02/politics/fact-check-georgia-gov-brian-kemp-coronavirus-no-symptoms-stay-at-home/index.html"}