{"authors": [], "date_download": "2020-05-04 20:07:58", "date_modify": "2020-05-04 20:07:58", "date_publish": "2020-04-07 15:58:51", "description": "TRENTON, N.J. (AP) — New Jersey is closing its state and county parks after too many people failed to observe social-distancing guidelines, Gov. Phil Murphy said Tuesday. “We need 100%...", "filename": "_94e695cb35379c7ea23af48adc0b4f90_1588622878.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8bea847136fc4ee1b19b7e13d7d8c422/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_94e695cb35379c7ea23af48adc0b4f90_1588622878.html", "title": "New Jersey closes state, county parks because of COVID-19", "title_page": "New Jersey closes state, county parks because of COVID-19", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this March 26, 2020 photo provided by Maureen Morin and Federico's Pizza, staff members of the Hackensack Meridian Jersey Shore University Medical Center give a thumbs-up in Neptune City, N.J., as they eat a donated meal from the Belmar, New Jersey pizzeria. With restaurants closed for all but takeout orders during the coronavirus outbreak, the owners of the pizzeria could have shut down and laid off their 20 employees. Instead, the business's owners took out a $50,000 line of credit and guaranteed their workers they'll stay on the payroll for at least two months. (Courtesy of Maureen Morin via AP)\nIn this March 26, 2020 photo provided by Maureen Morin and Federico's Pizza, staff members of the Hackensack Meridian Jersey Shore University Medical Center give a thumbs-up in Neptune City, N.J., as they eat a donated meal from the Belmar, New Jersey pizzeria. With restaurants closed for all but takeout orders during the coronavirus outbreak, the owners of the pizzeria could have shut down and laid off their 20 employees. Instead, the business's owners took out a $50,000 line of credit and guaranteed their workers they'll stay on the payroll for at least two months. (Courtesy of Maureen Morin via AP)\nTRENTON, N.J. (AP) — New Jersey is closing its state and county parks after too many people failed to observe social-distancing guidelines, Gov. Phil Murphy said Tuesday.\n“We need 100% compliance,” Murphy said. “We understand that staying at home is hard — you need to get fresh air, but you need to stay at home.”\nMurphy also said he signed executive orders to keep the state’s schools closed indefinitely during the coronavirus outbreak and to waive standardized testing requirements for students this year.\nThe death toll from the virus climbed 23% overnight, from about 1,000 people to 1,232, Murphy said. More than 44,000 positive cases have been identified in New Jersey, up about 3,000 over the last 24 hours.\nHalf of the state’s 375 nursing homes also have at least one case of the virus, the health commissioner said.\nA look at developments:\n__\nPARKS NOW CLOSED\nAfter earlier encouraging people to enjoy state and county parks while keeping their distance, Murphy said on Tuesday that too many people were not maintaining a minimum distance and that he would sign an executive order closing them.\n___\nSCHOOLS\nThe order waiving assessment requirements applies to eighth and 12th-graders who ordinarily would need the exams to qualify for graduation.\nThe governor made no announcement about when or whether schools would resume in-person instruction, but suggested graduation parties and other end-of-year festivities would be canceled.\n“I wouldn’t put any nonrefundable checks down on your celebrations,” he said.\n___\nNURSING HOMES\nHalf of the state’s nursing homes — 188 — have reported at least one positive COVID-19 cases, Health Commissioner Judy Persichilli said.\nShe attributed the high rate to the communal living arrangements at the homes and said the state is working on a statewide plan to address staffing and resource deficiencies at facilities.\nShe said the plan would likely require healthy residents at facilities being moved around.\n___\nPRIMARY DATE CHANGE?\nSenate President Steve Sweeney said Murphy is considering moving the state’s June 2 primary to July 7. Murphy earlier said he’d be stunned if the primary date remained the same, but has said he didn’t yet decide to move it.\n___\nBENEVOLENT PIZZERIA CLOSES\nA New Jersey pizzeria that drew acclaim for borrowing heavily to keep its workers on the payroll during the virus outbreak has temporarily closed its doors.\nFederico’s in Belmar touched off a wave of pay-it-forward donations for those fighting the outbreak, including hospital workers, police, firefighters and emergency medical workers.\nIts two owners took out a $50,000 line of credit to keep their 20 employees on the payroll for at least two months.\nBut in a Facebook post Monday, Federico’s operators said, “We will be temporarily closing our doors in order to keep our employees, families and customers safe.”\nLast month , the owners said the borrowed funds would be used to pay workers in the event of a temporary shutdown. They confirmed Tuesday they will keep their workers on the payroll as promised.\nA look at other developments:\n___\nMORE BEACHES CLOSE\nFour more New Jersey shore towns announced this week that they will close their beaches.\nOfficials in the Cape May County towns of Avalon, Wildwood, North Wildwood and Wildwood Crest said they’re closing their beaches in an effort to stem the spread of COVID-19.\nThey’re just the latest towns to shutter their beaches. Others include Bay Head and Mantoloking.\nThe virus has led to more than 1,000 deaths in New Jersey, health officials said. While the outbreak has been concentrated most heavily in northern New Jersey, every county has at least one case.\n___\nATLANTIC CITY RENTALS\nAtlantic City’s mayor issued an order Monday night prohibiting all hotels and motels in the city from accepting new guests.\nMayor Marty Small said those currently in rooms at those facilities can remain until the end of their most recently booked stay, and will not be allowed to renew.\nIt was not immediately clear how, or whether, the order would apply to guests placed in hotels or motels by social service agencies. The city’s nine casinos have been shut for three weeks.\n___\nNURSING HOMES\nFifteen residents and 12 staff members of a southern New Jersey nursing home have tested positive for the coronavirus.\nThe Cape May County Health Department confirmed the cases at the Victoria Manor facility in North Cape May. Tuesday night, they said one of those patients, an 86-year-old man with “significant underlying health conditions,” had died.\nThe virus has spread throughout the state’s nursing homes, health officials have said. At least a quarter of the 375 facilities in the state have one case or more of COVID-19.\n___\nABOUT THE VIRUS\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, or death.", "url": "https://apnews.com/94e695cb35379c7ea23af48adc0b4f90"}