{"authors": ["Reporter"], "date_download": "2020-05-04 20:27:50", "date_modify": "2020-05-04 20:27:50", "date_publish": "2020-04-30 08:54:51", "description": "Ronald Klain also ripped the president's \"bad decisions, bad leadership, bad coordination” in response to the coronavirus crisis.", "filename": "entry_ronald-klain-donald-trump-deadly-combination-coronavirus_n_5eaa8884c5b62eaf043f3be1_1588624070.html", "image_url": "https://img.huffingtonpost.com/asset/5e5a20e92300007d0c39c79f.png?cache=sezfhehjsy&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_ronald-klain-donald-trump-deadly-combination-coronavirus_n_5eaa8884c5b62eaf043f3be1_1588624070.html", "title": "Obama ‘Ebola Czar’ Names Donald Trump Traits That Are Deadly Combination Amid Pandemic", "title_page": "Obama ‘Ebola Czar’ Names Donald Trump Traits That Are Deadly Combination Amid Pandemic | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Three of President Donald Trump’s worst character traits are proving to be catastrophic for the U.S. amid the coronavirus pandemic, Ronald Klain argued on Wednesday.\nKlain, who former President Barack Obama charged with leading the U.S. response to the Ebola crisis, told MSNBC’s Nicolle Wallace that Trump’s “narcissism, incompetence and ideology” were “sadly, a very deadly combination for our country” right now.\nHe also ripped the “bad decisions, bad leadership, bad coordination” from the Trump White House “that have plagued this problem.”\n\"If people are waiting for Trump to change, they're gonna way a long time. He hasn't changed in 3 years, he hasn't changed over the course of this response. He tried to happy talk the thing away in January... in February... in March... in April\" - @RonaldKlain w/ @NicolleDWallace pic.twitter.com/bTlbV6n8HY — Deadline White House (@DeadlineWH) April 29, 2020\n“I think the president doesn’t want to use the full powers of the office to command the private sector to produce these tests because how he thinks that’s socialism or something crazy like this,” he said.\nKlain also rejected the suggestion that Trump’s attitude toward the public health crisis may be about to change.\n“If people are waiting for Donald Trump to change, they’re gonna wait a long time,” he said. “He hasn’t changed in three years, and he hasn’t changed over the course of this response.” He noted Trump has “tried to happy talk the thing away” repeatedly over the last four months.", "url": "https://www.huffpost.com/entry/ronald-klain-donald-trump-deadly-combination-coronavirus_n_5eaa8884c5b62eaf043f3be1"}