{"authors": ["Theresa Waldrop"], "date_download": "2020-05-04 16:03:45", "date_modify": "2020-05-04 16:03:45", "date_publish": "2020-04-01 20:38:46", "description": "Serving and trying to protect against a threat we can't see, law enforcement officials around the country are grappling with policing during the coronavirus pandemic.", "filename": "2020_04_01_us_police-coronavirus_index_1588608225.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330095131-05-new-york-medical-supplies-0324-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_us_police-coronavirus_index_1588608225.html", "title": "Coronavirus has police scrambling to respond to a perpetrator they can't see", "title_page": "Coronavirus has police scrambling to respond to a perpetrator they can't see - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Serving and trying to protect against a threat we can't see, law enforcement officials around the country are grappling with policing during the coronavirus pandemic .\nBig departments such as in New York or Detroit are shifting resources and people around to ensure essential work gets done as their workforces are reduced by the virus. Sheriffs' offices around the country are trying to reduce their jail populations to protect their employees and inmates, the Police Executive Research Forum (PERF) reported.\nIn New York, where there are more than 47,000 cases of Covid-19, the country's largest police force had 17% of its force -- more than 6,000 people -- out sick as of Wednesday, and 1,400 of its force has tested positive for the virus. The mayor of Detroit said about 20% of its police force was under quarantine.\nAlthough police officers are \"trained and diligent in dealing with the unknown,\" the pandemic is unlike anything he's seen in his 43 years of policing, Detroit Police Chief James Craig told CNN.\n\"I've been through civil unrest, I've been through earthquakes in Los Angeles,\" said Craig, who has the virus himself. \"There is nothing that can compare to this.\"\nAs in many other police departments across the United States, those in the NYPD who can are working from home, but many are still out on the streets, delivering groceries to the elderly and even, as was the case recently in the Bronx, delivering babies, New York Police Department Commissioner Dermot Shea said.\n\"I can tell you we''re in good shape despite so many people going down with this sickness,\" Shea said in a Q&A session online Tuesday. \"We're in good shape because everyone is pitching in.\"\nSome precincts are minimally staffed, Shea said, and if it goes below the minimum, \"We have people ready to backfill there,\" Shea said.\n\"We're not close to 12-hour tours yet, but if we have to, we'll do it,\" the commissioner said.\nGov. Andrew Cuomo said Wednesday the city's police department is so large that even with the number of positive coronavirus cases confirmed within the force, New Yorkers will be protected. And if needed, state police will step in as backfill.\nThe state would also consider deputizing police officers from upstate communities to serve in New York City \"if we get to that point,\" Cuomo said.\nAgencies have told PERF that losing their communications systems is one of their biggest fears in this crisis. In Detroit, the department's communication system \"had an impact,\" but they were able to use a backup, Craig told CNN Tuesday.\nFaced with a reduced force, Detroit has \"collapsed some of our nonessential units,\" moving them to \"our hardest-hit stations so that they could continue to do the most important work\" of answering emergency calls.\n\"We've done that very well,\" Craig said,\nPolice departments and sheriff's offices are reporting a decrease in crime overall as people across the nation are hunkered down at home.\n\"Crime has dropped off -- off the face of the map, really,\" Shea said.\nAnd while 911 calls are skyrocketing in places such as New York, the number actually funneled to the NYPD are down, Shea said.\n\"Those two factors are really kind of pulling us along through this crisis,\" Shea said.\nSome agencies are reporting an increase in domestic disputes and assaults, driving under the influence and disorderly conduct.\nIn St. Mary's County, Maryland, \"calls for service in general are down significantly,\" but disorderly conduct calls are up 300%, Sheriff Tim Cameron told PERF.\n\"The disorderly conduct calls are things like grocery stores that have a limit on how many rolls of toilet paper you can buy, and it becomes a situation,\" Cameron told PERF.\nPolice departments and sheriff's offices say they're working to protect their forces by reducing in-person responses to calls, limiting them to emergency and high-priority situations.\nThey're also trying to keep their jail population sizes down by not making arrests for low-level crimes, and working with district attorneys and judges to determine whether a person really needs to be jailed right now.\nIn Hennepin County, Minnesota, the sheriff's office is even willing to pay a state-required bail if necessary to keep a person out of its custody.\n\"If it's a matter of a state-required $78 bail, we'll pay the $78 to get them out of there and have them come back at some later time,\" Rob Allen, the sheriff's office chief of staff, told PERF.\nAs the crisis wears on, law enforcement leaders say some in their ranks who tested positive are now back at work. As of Tuesday, 17 had returned to work at the NYPD since Friday, Shea said.\n\"They're back, they're better, and they're jumping in to fill the place where others go down,\" Shea said.", "url": "https://www.cnn.com/2020/04/01/us/police-coronavirus/index.html"}