{"authors": ["Lauren Fox"], "date_download": "2020-05-04 16:26:56", "date_modify": "2020-05-04 16:26:56", "date_publish": "2020-04-07 12:39:01", "description": "Not two weeks after lawmakers approved their massive $2.2 trillion spending package, committee aides, administration officials and industry lobbyists are beginning to encounter unintended -- and to some extent unanticipated -- consequences.", "filename": "2020_04_07_politics_congress-stimulus-money-rollout-latest_index_1588609616.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407115927-trump-signs-stimulus-package-0327-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_congress-stimulus-money-rollout-latest_index_1588609616.html", "title": "Rollout of $2 trillion stimulus package marred by glitches and breakdowns", "title_page": "Rollout of $2 trillion stimulus package marred by glitches and breakdowns - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Not two weeks after lawmakers approved their massive $2.2 trillion spending package , committee aides, administration officials and industry lobbyists are beginning to encounter unintended -- and to some extent unanticipated -- consequences.\nAs one industry official put it to CNN yesterday, \"we are building the space shuttle as it is rocketing toward Mars.\"\nThe glitches, breakdowns, frustrations and angst building right now on every piece of this third stimulus package were all together predictable, and yet it doesn't make it any less painful for the individuals who are waiting for their personal stimulus checks to buy groceries or for the small business owner who is waiting to be approved for a loan so they know they can keep paying their employees.\nThese programs are unwieldy. They were largely agreed to over late-night negotiations as a global pandemic was gripping the nation, and the turbulence is real.\nThere is some hope however: Many of the most egregious issues can be -- and likely will be -- addressed in another stimulus package passed by Congress, though the particular parameters of what will and will not be included in such a package are still being determined.\nThe spotlight on the SBA\nNowhere is that clearer than in the Small Business Administration's new loan program.\nFor a significant chunk of time Monday, multiple sources texted and emailed to say the system lenders used to input loan application info was down. In simpler terms that means that for a chunk of Monday, nobody was able to apply for the nearly $350 billion in assistance that Congress created to keep small businesses afloat.\nTechnical issues aren't the only frustrations playing out. Many lenders are still waiting for further guidance on what criteria needs to be met before they cut checks, some groups like venture capital need more guidance on if they qualify and everyone fears they'll be left out of the line.\nTime isn't something that business owners have a lot of right now as they are staring down payroll deadlines and trying to make decisions about how much longer they can stay afloat.\n\"The pragmatic part of me knows that cannot happen overnight,\" an industry source told me Monday, adding that it was still \"gut wrenching\" to talk to small business owners clamoring to find a bank that was willing to give them a loan.\nThe issues with this program aren't disputed. Republicans, Democrats, the SBA and Treasury -- everyone acknowledges there are kinks to work out. There is some hope that the announcement Monday by the Fed that they will open a new facility to purchase loans made by banks through the Paycheck Protection Program will help alleviate stress on already cash-strapped financial institutions. That's the silver lining here: everyone is working toward the same goal. But it is still going to take time, and there's no disputing that people's livelihoods are on the line.\nStimulus problems ahead\nPretending that the SBA is the only area of this stimulus package that is hitting a snag is to miss a far bigger story that is playing out right now.\nFor example, the expectation from Capitol Hill this week is that that they will get further guidance on how the administration plans to dole out nearly $500 billion to large businesses (those with more than 500 employees). The legislation gave Treasury pretty broad discretion on how they can use that money and that was intentional given there was no knowing who all was going to be affected by the virus, but the politics of who gets what is sure to play out in the next days and weeks.\nThere are also questions about whether distressed companies could be kept from getting the funds given the investment-grade standards that typically apply. Some companies that looked healthier six weeks ago have been downgraded in recent weeks. Some of those may be the most in need of the money (like cruise lines or restaurant chains for example).\nHospital funding: The stimulus bill also appropriated $100 billion to hospitals, but the need for health facilities is massive right now, and lawmakers don't know if it will be enough. Further complicating this is that the rules surrounding who gets the funding are still largely at the discretion of the Trump administration. Aides in Minnesota Sen. Tina Smith's office told CNN on Monday that the Department of Health and Human Services is already directly involved in helping steer the money. But aside from going to help cover the cost of providing care to uninsured patients and funding surges in rural areas, it's not clear what the direct allocation formula will be for this. It's an area that -- depending on which states and jurisdictions may get help -- could be ripe for congressional oversight.\nUnemployment insurance: CNN reports that the House Ways and Means Committee is still waiting for all 50 states to get money from the second stimulus bill in order to cover the administrative costs that are CNN reports that the House Ways and Means Committee is still waiting for all 50 states to get money from the second stimulus bill in order to cover the administrative costs that are coming from implementing a rapid rise in unemployment claims . One aide on the committee told CNN on Monday that the committee was depending on individual members to report to Ways and Means once their state had received the money, but that they only had direct evidence of a handful of states having received their share. That's before you even get to the additional money individuals are supposed to start getting through the third stimulus bill.\nPersonal checks: The direct checks from the government, as CNN has reported, could be delayed for those who don't have direct deposit information filed with the government. The timeline House Ways and Means has circulated is that checks will start going out April 13, but if the government doesn't have direct deposit information, and they have to mail a check, it could be four months or longer. Other frustrations include the fact that administrative guidance excluded college students and those over 17 from getting a check, but parents also can't get the $500 they'd receive for younger dependents.\nFixes in Phase 4\nIn recent days, Democrats including House Speaker Nancy Pelosi have backed away from the idea of a \"phase 4\" stimulus that includes a massive infrastructure component.\nInstead, the emphasis in \"phase 4\" is likely going to include plussing up a lot of the accounts that lawmakers and industry sources are confident won't cover the economic pain this country is in for over the next few months. That's everything from more money for the SBA loan programs to the hospitals.\nBut, expect lawmakers to also fight to clarify certain sections of the legislation where industries in their district or individuals have been locked out of getting some of the money. One Democratic aide cited the small loans as one area where Democrats want to explicit write in guidance to ensure that banks aren't only lending to existing customers. The idea according to the aide is to \"do fixes and more funding together.\"\nThe issue with that as one Republican aide noted is that making too many detailed fixes could inhibit Congress from actually passing a \"phase 4.\" Details, after all, are where things get stuck.\nOverall, aides say no one thinks that things are running perfectly right now, but \"at the end of the day, it is the government giving people money. It' s going to get figured out.\"\nThis story has been updated.", "url": "https://www.cnn.com/2020/04/07/politics/congress-stimulus-money-rollout-latest/index.html"}