{"authors": [], "date_download": "2020-05-04 16:16:51", "date_modify": "2020-05-04 16:16:51", "date_publish": "2020-04-03 20:50:40", "description": null, "filename": "2020_04_03_cnn-underscored__4b02c86540d0f48d96c6d555a45482af_index_1588609011.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327132004-1-underscored-casetify-uv--super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored__4b02c86540d0f48d96c6d555a45482af_index_1588609011.html", "title": "There's a new phone sanitizer in town: Meet Casetify", "title_page": "There's a new phone sanitizer in town: Meet Casetify - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "PhoneSoap may be all the rage these days, but there's a new UV sanitizer in town: Casetify. It's up for order now at $120, and orders are supposed to ship by the fourth week of April.\nNot only does it give you another option for a UV sanitizer, but 100% of proceeds from sales of the device are being donated to GlobalGiving's Coronavirus Relief Fund. The money raised will be used to get supplies to first responders and hospitals, along with communities in need. So your purchase helps in the fight to control the new coronavirus.\nLike other sanitizers on the market, Casetify uses UV light. Rather than long bulbs like we've seen in the PhoneSoap, this uses six small, square LEDs. Two lights sit on the inside of the lid, along with two along each side. These are UV-C LEDs, which means there's no mercury, unlike traditional bulbs. When in use, these produce a glowing blue UV light that hits the sides and front of your phone. To clean the back, you'll need to flip the phone over.\nYour phone doesn't need to just sit there losing juice while it's being cleaned, either. There's a Qi-wireless charger built into the rubber bed inside the sanitizing case. This not only holds your device snugly, but it will charge it wirelessly with up to 5 watts. Unlike PhoneSoap, though, which has extra USB Type-A and USB Type-C ports on its products, Casetify does not. There's just a USB Type-C port on the left side, and that's for powering the UV sanitizer itself.\nWhen closed, the top lid has a tiny blue LED indicator for wireless charging, a circular button with a ring of LEDs around it for monitoring sanitization, and a Casetify logo. To start wireless charging, you'll click in the circle button once. (You can turn it off with a double click.) Drop your phone in and you'll see it start to charge wirelessly. Close the lid, and you'll notice the blue ring around the button will start slowly pulsing.\nIt automatically starts the cleaning process, which lasts for about three minutes. Once done, you won't really see the results, and you may still see fingerprints on the device. You might notice a slight odor coming from it — not burning, but you can tell that the lights had an effect.\nThere are studies to back up the effect that UV light can have on killing germs. UV-C light effectively destroys bacteria by destroying their DNA, rendering them unable to reproduce. And while this wavelength of light can be harmful to people, the sources are safely contained inside the Casetify UV sanitizer.\nYou can clean more than your phone as well. We tried AirPods (both in and out of the case), Powerbeats, Powerbeats Pro, Galaxy Buds+ and even car keys. When inserting items that aren't supposed to take a charge, just remember to turn off the wireless charger with a double-tap of the circle button on the front.\nCasetify clearly notes on its site that \"this product is not proven to kill coronavirus. The UV Sanitizer kills 99.9% of germs, but we do not currently have a way to test its effectiveness against COVID-19 yet.\" It's an important point to make and in line with our reporting, as well as CNN Business.\nAt $120, Casetify's UV sanitizer is more expensive than a wipe or most cleaning solutions, but it's in line with other UV sanitizers. At the end of the day, it may provide some peace of mind.\nAs part of the Casetify Protect initiative, your purchase of the UV Sanitizer includes 10 alcohol wipes. It's a really nice touch and gives you an easy way to clean your Casetify cases as well as the rest of your tech.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/casetify-uv-sanitizer-review-phone-cleaning-outbrain-2/index.html"}