{"authors": ["Senior Politics Reporter"], "date_download": "2020-05-04 20:26:37", "date_modify": "2020-05-04 20:26:37", "date_publish": "2020-04-28 20:44:13", "description": "\"It’s always about him,” said Rep. Jackie Speier, chair of the House Armed Services Subcommittee on Military Personnel.", "filename": "entry_jackie-speier-trump-west-point-cadets-coronavirus_n_5ea87249c5b62271082f95ed_1588623997.html", "image_url": "https://img.huffingtonpost.com/asset/5ea872d7300000271115510b.jpeg?cache=8dqwbkvaag&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_jackie-speier-trump-west-point-cadets-coronavirus_n_5ea87249c5b62271082f95ed_1588623997.html", "title": "Congresswoman Rips Trump For Making West Point Cadets Return To Campus For His Speech", "title_page": "Congresswoman Rips Trump For Making West Point Cadets Return To Campus For His Speech | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "ASSOCIATED PRESS Rep. Jackie Speier (D-Calif.) said President Donald Trump's decision to bring West Point cadets back to campus for his speech puts his interests ahead of their safety.\nWASHINGTON ― A key member of the House Armed Services Committee on Tuesday criticized President Donald Trump for his abrupt decision to speak at West Point Military Academy, which requires bringing nearly 1,000 cadets back to campus, testing them for the coronavirus and then isolating them for 14 days in rooms with masks.\nRep. Jackie Speier (D-Calif.), chair of the subcommittee on military personnel, which has jurisdiction over the service academies, said the president’s decision puts cadets’ lives at risk for no reason other than to draw attention to himself.\n“He’s forcing the creation of crowds in hopes of generating applause and adulation. It’s always about him,” Speier told HuffPost. “That’s why we have almost 1 million infected and over 50,000 Americans dead.”\nA White House spokesman did not respond to a request for comment.\nTrump’s announcement earlier this month took even West Point officials by surprise, according to The New York Times, as they were still figuring out how to proceed with graduation. It had initially been postponed because of the coronavirus, and one option was a mid-June presidential commencement speech, though nothing had been confirmed, per the Times. Cadets were sent home in March, and officials weren’t sure if or when it was safe to hold a ceremony held at all.\nTo accommodate the president’s plan, cadets scattered around the country must return for a June 13 ceremony in New York, the state at the center of the coronavirus outbreak with more than 157,000 confirmed cases and nearly 12,000 deaths. The school hasn’t yet decided whether it is safe for family members or visitors to attend.\nHuffPost reached out to the chairs and ranking members of the House and Senate Armed Services committees for comment on Trump’s decision to bring West Point cadets back to campus to hear him speak. None of them responded.\nWest Point will have to contend with New York Gov. Andrew Cuomo’s statewide ban on large gatherings. The current ban remains in effect through May 15, but it’s not yet clear if or where it may be extended in the state beyond that. Given the trajectory of the coronavirus, it certainly appears unlikely that large gatherings will be allowed anywhere in New York anytime soon.\nA request for comment from the governor’s office was not returned.", "url": "https://www.huffpost.com/entry/jackie-speier-trump-west-point-cadets-coronavirus_n_5ea87249c5b62271082f95ed"}