{"authors": ["Christina A. Cassidy", "Gretchen Ehlke"], "date_download": "2020-05-04 20:05:34", "date_modify": "2020-05-04 20:05:34", "date_publish": "2020-04-08 04:24:57", "description": "MILWAUKEE, Wis. (AP) — After going to sleep angry and afraid to vote, Xavier Thomas woke up on election day in Wisconsin thinking about how hard black people had to fight for the right to cast a...", "filename": "_be402510fea98fd7c37067ca05fd8e1a_1588622734.html", "image_url": "https://storage.googleapis.com/afs-prod/media/a9916e8c59ee48b48b398c27625e6de8/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_be402510fea98fd7c37067ca05fd8e1a_1588622734.html", "title": "Black voters weighed history, health in Wisconsin election", "title_page": "Black voters weighed history, health in Wisconsin election", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Voters masked against coronavirus line up at Riverside High School for Wisconsin's primary election Tuesday April 7, 2020, in Milwaukee. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Morry Gash)\nVoters masked against coronavirus line up at Riverside High School for Wisconsin's primary election Tuesday April 7, 2020, in Milwaukee. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Morry Gash)\nMILWAUKEE, Wis. (AP) — After going to sleep angry and afraid to vote, Xavier Thomas woke up on election day in Wisconsin thinking about how hard black people had to fight for the right to cast a ballot.\nHe didn’t want to be deterred despite the coronavirus pandemic and the government’s failure to get him an absentee ballot in time.\n“We had to be willing to die to get our vote, and the same thing is happening right now,” said Thomas, a 33-year-old director of youth ministry at a Milwaukee church.\nAcross Wisconsin on Tuesday, voters had an impossible decision to make: whether to risk their health and possibly their lives to cast a ballot, or stay away and miss exercising a fundamental right of democracy. The conservative-controlled state Supreme Court declined to delay the election, despite a statewide order from the Democratic governor telling people to stay home and avoid crowds to contain the spread of the highly infectious disease.\nGoing forward with the election was especially problematic in the state’s largest city, Milwaukee, where roughly 4 in 10 residents are black. The city of 590,000 has suffered roughly half the state’s coronavirus deaths, many of them minorities. Officials closed all but five of the city’s 180 polling places, forcing thousands of voters to congregate at only a handful of voting sites.\nVanessa Wroten-Gassama waited for two hours to cast her ballot at Washington High School in the Sherman Park neighborhood, a predominantly black community where rioting broke out in 2016 over a fatal shooting by police.\nThe wait was particularly difficult for her because she has a variety of health problems, including the need for dialysis.\n“A lot of people aren’t going to go vote, especially the elderly,” said the 59-year-old, who wore a mask and gloves. “A lot of people aren’t going to go because they are desperately scared, especially in my community.”\nAnother problem: Many voters said they requested absentee ballots but had not received them by election day.\nCalena Roberts was trying to figure out how she would tell her 89-year-old mother-in-law, who now lives in a Milwaukee nursing home, that she would not be able to vote because her absentee ballot hadn’t shown up.\n“What do I say to her? Other than, ‘Mother, I am so sorry you won’t be able to cast your ballot in 2020, after all the years and all the struggles for African Americans to get the right to vote,’” said Roberts, 67.\nShe said she could not “in good conscience” take her mother out of the nursing home and bring her to a crowded polling place. More than half of the city’s known infections are within the black community.\n“People should not have to make a choice about being able to cast their ballot or taking a chance on becoming deathly ill or dying,” Roberts said. “There was no reason, no excuse for any human being to think this is OK.”\nTuesday’s election was remarkable in that it happened at all. All other states scheduled to hold primaries in recent weeks have delayed voting by days, weeks or months so election officials can adjust to the coronavirus restrictions and prepare for a dramatic increase in absentee ballot requests. Democratic Gov. Tony Evers tried to postpone the primary but was stopped by the conservative-controlled state Supreme Court, which ordered the election to proceed, saying Evers didn’t have the authority to change it.\nTraditional voter-outreach efforts to push people to the polls were largely abandoned. Concerns over public safety prompted the presidential campaign of Vermont Sen. Bernie Sanders to cancel its planned get-out-the-vote activities. The campaign of former Vice President Joe Biden said it began weeks ago shifting all of its voter turnout efforts toward vote-by-mail.\nMichael Claus, 66, was among voters who lined up Tuesday morning outside one of Milwaukee’s five polling places.\nClaus, who is black, wore a protective mask and a Tuskegee Airmen cap. He said he tried to vote absentee and requested a ballot in March, but it never showed up and his only option was to vote in person. He blamed the Republican-controlled Legislature, saying the election “is more about politics for them than our safety.”\n“They could have delayed the election with no problem,” Claus said. “They decided if they can suppress the vote in Milwaukee and Madison, where you have a large minority presence, you can get people elected you want elected. And that’s sad.”\nDemocrats had accused Republicans of holding to the Tuesday election date in part to benefit from reduced turnout in the state’s most populous cities, which are Democratic strongholds. Reduced turnout there would benefit a conservative Wisconsin Supreme Court justice who is on the ballot.\nRepublicans had defended moving ahead with the election, saying it can be done safely and that elections have not been delayed during other times of national crisis. They also argue it’s important to fill thousands of local offices where terms expire later this month.\nIt was too early to say how much of an effect fears over coronavirus along with all the last-minute confusion about whether the election would happen would reduce turnout. But any decline could have long-term consequences.\n“If black voices are not represented in the vote and in decisions that are made by folks that are elected, their communities suffer,” said Ryeshia Farmer with the ACLU of Wisconsin. “They don’t receive the same amount of resources, the same amount of funding in their communities. Long term, this will have a ripple effect.”\nKeisha Robinson, 43, of Milwaukee, works to mobilize voters with BLOC -- Black Leaders Organizing Communities. Robinson herself requested an absentee ballot from the city on Thursday, a day before the deadline.\nShe had her fingers crossed that it would arrive in Tuesday’s mail. When it didn’t, Robinson had to decide whether to go vote in person. With an immune system she said “is not so strong,” and feeling scared, she decided against it.\n“Not being able to vote when that’s exactly what I urge and inform my community to do feels like hypocrisy almost,” she said. “It feels like i didn’t complete my end of an important deal or something.”\n___ Cassidy reported from Atlanta.\n___\nAssociated Press writers Doug Glass in Minneapolis, Will Weissert in Washington, D.C., and Bill Barrow in Atlanta contributed to this report.", "url": "https://apnews.com/be402510fea98fd7c37067ca05fd8e1a"}