{"authors": ["Martin Crutsinger"], "date_download": "2020-05-04 20:17:19", "date_modify": "2020-05-04 20:17:19", "date_publish": "2020-04-08 19:31:32", "description": "WASHINGTON (AP) — Federal Reserve officials pledged at two emergency meetings last month to use their full arsenal to bolster the U.S. economy being brought to its knees by the coronavirus...", "filename": "_8fa97d87fc2b6d821c58e20efa50edff_1588623439.html", "image_url": "https://storage.googleapis.com/afs-prod/media/dafc9fb54fd24a9195db581bf8ff630c/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8fa97d87fc2b6d821c58e20efa50edff_1588623439.html", "title": "At emergency March meetings Fed pledged to use full arsenal", "title_page": "At emergency March meetings Fed pledged to use full arsenal ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - This July 31, 2019 file photo shows the Federal Reserve Building in Washington. Federal Reserve officials pledged at two emergency meetings last month to use their full arsenal to bolster the U.S. economy being brought to its knees by the coronavirus outbreak. Minutes of the two meetings released Wednesday, April 8, 2020 show that Fed officials were alarmed at the impact the virus was already having on U.S. economic activity. (AP Photo/Patrick Semansky, File)\nFILE - This July 31, 2019 file photo shows the Federal Reserve Building in Washington. Federal Reserve officials pledged at two emergency meetings last month to use their full arsenal to bolster the U.S. economy being brought to its knees by the coronavirus outbreak. Minutes of the two meetings released Wednesday, April 8, 2020 show that Fed officials were alarmed at the impact the virus was already having on U.S. economic activity. (AP Photo/Patrick Semansky, File)\nWASHINGTON (AP) — Federal Reserve officials pledged at two emergency meetings last month to use their full arsenal to bolster the U.S. economy being brought to its knees by the coronavirus outbreak.\nMinutes of the two meetings released Wednesday show that Fed officials were alarmed at the impact the virus was already having on U.S. economic activity. They also noted the potential for further harm to businesses and households resulting from the stringent guidelines being put in place across the country to try to limit the virus’ spread.\nThe minutes covered two emergency Fed meetings: The first held by teleconference on March 3 when it cut its benchmark policy rate by one-half percentage point, and a rare Sunday session on March 15 when it cut the rate again by a full percentage point.\nThe last rate cut returned the rate, which influences a range of consumer and business loans, to a record low of zero to 0.25%, where it had been for seven years in the wake of the 2008 financial crisis.\nThe Fed also brought back a number lending programs it had last used to keep money flowing in the financial system following the 2008 crisis. Those programs are designed to provide support for a variety of financial markets, from money market funds to corporate debt.\n“Members emphasized that the Federal Reserve was prepared to use its full range of tools to support the flow of credit to households and businesses,” the minutes said.\nThe urgency of the crisis was emphasized by the fact that the Fed did not wait until its regular meeting scheduled for March 17-18. It instead moved twice between meetings to cut rates and launch the other lending programs.\nPrivate economists noted that even in the first two weeks of March, Fed officials appeared aware that the economy was about to be hit by a severe shock.\n“Policymakers were trying to adapt to a rapid deterioration in financial market conditions, stresses in credit markets and an apparent deep contraction in economic activity,” Gus Faucher, chief economist at PNC, said in a research note.\nThe half-point cut was approved unanimously, while the full percentage-point cut on March 15 was approved with one dissent. Loretta Mester, president of the Cleveland Fed, objected to the last cut, arguing that a smaller half-point cut would reserve space for further cuts if needed rather than pushing the policy rate all the way to near zero.\nThe Fed’s next meeting is scheduled for April 28-29. Federal Reserve Chairman Jerome Powell is scheduled to deliver a speech by webcast on Thursday. Economists are hoping those remarks will provide clues to what the Fed’s next moves may be.", "url": "https://apnews.com/8fa97d87fc2b6d821c58e20efa50edff"}