{"authors": ["Zaina Adamu"], "date_download": "2020-05-04 16:52:30", "date_modify": "2020-05-04 16:52:30", "date_publish": "2020-04-08 10:40:55", "description": "Funerals are a big deal in Ghana and it is not uncommon for a ceremony to draw thousands of crowds and last up to seven days. But a centuries-old tradition has come to a halt.", "filename": "2020_04_08_world_africa_ghana-burial-traditions-intl_index_1588611150.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/180911155230-02-kofi-annan-ghana-burial-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_world_africa_ghana-burial-traditions-intl_index_1588611150.html", "title": "Coronavirus in Africa: One of Ghana's most valued traditions has gone online", "title_page": "Coronavirus in Africa: One of Ghana's most valued traditions has gone online - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Accra, Ghana (CNN) Funerals are a big deal in Ghana and it is not uncommon, in some parts, for a ceremony to last up to seven days, drawing thousands of crowds adorned in flowing red and black robes and gold jewelry.\nSome families even hire professional mourners to cry at the funeral of their loved one because \"it serves as a reward to the person who has died,\" says Adwoa Yeboah Agyei, who owns The Funeral Shop and Services, a franchise with locations across Accra.\nGhanaian funerals are heavily symbolic and rituals involved include giving offerings to the spirits of the ancestors and loud traditional dancing and drumming to accompany the dead on their journey.\nAnguished families\nBut a centuries-old tradition has come to a halt.\nSince Ghana's President Nana Akufo-Addo suspended all public gatherings in mid-March in the wake of the coronavirus pandemic, burials have been limited to no more than 25 people in the West African nation.\nObed Ampadu-Asiamah's 73-year-old father, Daniel, passed away soon after the announcement following complications from a stroke.\nObed has been scrambling to make painful phone calls send notices informing attendees he could only invite 25 family members and friends. They originally expected 2,000 people and an official funeral has been postponed to a later date.\n\"We had to cut all the in-laws and the grandchildren. None were able to attend,\" he told CNN, his voice shaking.\n\"We could only provide six slots for members on my father's side of the family and three for members of his church.\"\nThe large funeral home they rented to hold the ceremony was moved into a small, private chapel within the same venue.\nFace masks concealed the anguish on the faces of mourners dressed in red and black, as they stood several feet apart with heads bowed in remembrance of a highly respected man, who established churches in parts of West Africa.\nLivestreaming burials\nAt Transitions, Ghana's largest private funeral home, a once heavy flow of ceremonies now trickles at a slow pace.\nGenevieve Carnelius, the general manager, stated that finances and operations have been badly affected, but says her priority now is to work with clients like Obed to remotely reschedule their loved ones' funerals to uncertain future dates.\nThe home currently offers online live streaming from their chapel, where Ampadu-Asiamah's burial service took place, and where mourners across the globe can view the ceremonies of their loved ones.\nPhotos: Journey to the other side in style Photos: Journey to the other side in style Get the party started – Funerals are often uplifting occasions in Ghana, where it is widely believed that death is the beginning of an afterlife, and the deceased should receive a rapturous send off.\nA tradition has emerged within this culture of \"proverb coffins\" (abebuu adekai), which pay tribute to the occupant with a personalized and often spectacular design. Hide Caption 1 of 18 Photos: Journey to the other side in style The roots – According to legend, the first abebuu adekai was created in the 1950s when a \"palanquin\" carriage was made for a tribal leader in the shape of a cocoa pod. But the leader died suddenly, and quick-thinking subjects buried him in the pod.\nThis inspired young carpenter Seth Kane Kwei to establish his own novelty coffin studio in the town of Teshie, and the The Kane Kwei Carpentry Workshop (above) remains popular to this day. Hide Caption 2 of 18 Photos: Journey to the other side in style Maiden flight – One of the first creations of the workshop was this coffin for Kane Kwei's grandmother, who had never traveled in a plane but was fascinated by the new mode of transport.\nShortly after, a boat design was requested for a fisherman, and the practice was up and running. Hide Caption 3 of 18 Photos: Journey to the other side in style Chips off the block – The abebuu adekai spread rapidly through the Greater Accra Region, with many of the leading figures emerging from the Kane Kwei stable.\nLegendary carpenter Paa Joe, seen with a piano design, was Kwei's nephew and apprentice, and he went on to establish his own popular studio. Hide Caption 4 of 18 Photos: Journey to the other side in style Spreading the wood – Daniel \"Hello\" Mensah, was an apprentice for Paa Joe, before launching his own practice the \"Hello Design Coffin Works.\" Hide Caption 5 of 18 Photos: Journey to the other side in style Artistic license – The coffins have become increasingly creative as the industry is established. This one is a crayfish at the \"Hello\" studio. Hide Caption 6 of 18 Photos: Journey to the other side in style Smile, please – This may have been ordered for a photographer. Hide Caption 7 of 18 Photos: Journey to the other side in style Departing in style – One customer will be well dressed at their funeral. Hide Caption 8 of 18 Photos: Journey to the other side in style Art and craft – Creating the coffins is intensive labor, and can take several weeks to produce.\nThe artisans typically use light, white wood from the indigenous Wawa tree, although mahogany is sometimes used for exports. Hide Caption 9 of 18 Photos: Journey to the other side in style Going global – Most of the coffins for local sales cost under $1,000, although pieces sold abroad can be more expensive.\nThe record price for abebuu adekai is a Paa Joe design that fetched $7930 through a London auction house. Hide Caption 10 of 18 Photos: Journey to the other side in style Fine art – Many works from Kane Kwei alumni have been featured at leading art galleries around the world, such as this piece from Paa Joe at the Jack Bell gallery in London. Hide Caption 11 of 18 Photos: Journey to the other side in style Red hot – This spicy design was on display in Osnabrueck, northern Germany, also from Paa Joe. Hide Caption 12 of 18 Photos: Journey to the other side in style Reptile house – This coffin carved in the shape of a frilled lizard was made by the Paa Joe workshop for Festival Melbourne 2006. Hide Caption 13 of 18 Photos: Journey to the other side in style Working overtime – The original Kane Kwei workshop is still thriving under the leadership of his son Cedi Anang and grandson Eric Adjetey Anang.\nThe shop reportedly produces up to 20 coffins each month, and sends around 100 abroad each year. Hide Caption 14 of 18 Photos: Journey to the other side in style Business booming – There are now at least a dozen workshops in the Accra region and a growing market for abebuu adekai. Hide Caption 15 of 18 Photos: Journey to the other side in style Pushing the boundaries – Few designs are off-limits, as this machine gun coffin indicates. Hide Caption 16 of 18 Photos: Journey to the other side in style Wildlife in death – Animals remain popular choice, such as this red rooster. Hide Caption 17 of 18 Photos: Journey to the other side in style First and last – The airplane design that was first created for Kane Kwei's grandmother remains a firm favorite. Hide Caption 18 of 18\nOnce a lucrative sector, businesses catering to funerals are reeling.\nMaryam Abdullah is a fashion designer who sews traditional garments primarily for weddings and funerals.\nIn an empty shop once bustling with customers, she sighed as she explained how Covid-19 has affected her business.\n\"No one is coming. Even the people who have already brought cloths for me to sew have not returned to pick them up, said Maryam. She understands why, though. \"If this is what it takes to stop the spread of this coronavirus, I am okay.\"\nFor now, she prefers her clients to stay at home because she feels more protected from contracting the virus herself, but it will only be a matter of time before funds run dry, she added.\nA stray from traditional customs\nShaking hands with the family of the deceased is a deep-rooted tradition in many Ghanaian tribes that has taken place for hundreds of years and has become a mandatory part of ceremonies to show respect for the dead, says Queen Naa Tsotsoo Soyoo I, a Ghanaian Queen mother, who forms part of a powerful group of traditional women leaders.\nShe explained how significant the ban on mass funeral gatherings has affected the customs of such ceremonies.\n\"A significant part of funerals is bringing families together to embrace through handshakes, hugs and to mourn in close proximity of one another,\" said Queen Naa.\n\"The immediate implication of what is now taking place is that families will be unable to connect. This is something that has never happened in generations and it is definitely going to have a social impact.\"\nCoffin made and painted to resemble a mermaid for Ga tribal priestess of sea god carried by funeral guests.\nDespite all the sudden changes to traditional practices at funerals, she acknowledged that certain inherent rites will never go away. For example, in Islam, the second largest religion practiced in Ghana, senior Muslim members of the community must recite Quranic verses over the deceased immediately after designated family members perform a ritual cleansing of the body.\nThe person must be buried within 24 hours of death.\n\"With all that is going on, the testament of a funeral will always be a view of how a person lived life and the core of every funeral is that the individual is sent off with respect and dignity,\" she added.\nNo one can predict how long the effects of Covid-19 will alter lives as we once knew it. But Queen Naa is certain of one thing thing. \"There will be many celebrations of life when this is all over.\"", "url": "https://www.cnn.com/2020/04/08/world/africa/ghana-burial-traditions-intl/index.html"}