{"authors": ["Paul Heideman", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Luke Savage", "Sarah Lazare", "Adam Johnson", "Julian Guerrero", "Barry Eidlin"], "date_download": "2020-05-04 19:57:48", "date_modify": "2020-05-04 19:57:48", "date_publish": "2020-03-19 00:00:00", "description": null, "filename": "2020_03_walter-reuther-labor-world-war-coronavirus-uaw_1588622268.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/19150425/B99571165Z.1_20170902234052_000_G661KLMS3.1-0-scaled.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_walter-reuther-labor-world-war-coronavirus-uaw_1588622268.html", "title": "We Can Retool the Economy to Fight Coronavirus - With Labor Playing a Key Role", "title_page": "We Can Retool the Economy to Fight Coronavirus — With Labor Playing a Key Role", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe coronavirus pandemic has exposed the rot behind the facade of American society like no other event in modern history. The richest nation in history has demonstrated an utterly incompetent response to the crisis. Some aspects of the response, like the idiot nationalism behind refusing to use the high-quality World Health Organization test for the virus, are surface level. Others, like a health-care system built around protecting profits by denying care, are structural. In this way, the pandemic is making Bernie Sanders’s case for a political revolution even more vivid. Already, almost half of US adults are already saying that the virus is making them more likely to support Medicare for All. Given that the United States is still at least a week behind the disaster stage of the outbreak, it is likely that this number will only grow. The pandemic’s full impact, both medical and economic, will expose the need for a policy response on a scale unlike anything in recent history. Already, analogies are being drawn to the economic mobilization during World War II. This politicization of the economy presents a critical opportunity for the Left. Most of the time, capitalist democracies are ruled by the illusion that the economy is apolitical, even natural. Moments of crisis demystify this and demonstrate that political choices determine questions of production and distribution. Eighty years ago, the American left confronted a similar moment of crisis in the early years of World War II. In that moment, United Auto Workers leader Walter Reuther seized the initiative to present a plan for reorienting the economy toward wartime production that elevated labor to a central role. Ultimately, that plan was defeated, and business prerogatives won out. But the plan’s strategic audacity in positioning labor as the force to set the course for a national emergency is precisely the kind of ambition the Left should have in responding to the pandemic today.\nThe Man With a Plan By 1941, it was clear that American involvement in World War II would be massive. Franklin Delano Roosevelt had campaigned in the 1940 election on the United States being the “arsenal of democracy” by providing arms and machinery to the UK in its war against Nazi Germany. The economy, however, was not set up to provide this level of production. Though unemployment had been falling since 1938, in 1940, it was still about 15 percent of the labor force. Most firms were still running far below full capacity. Moreover, many firms actively resisted the attempt to ramp up wartime production. Though $11 billion in federal contracts were awarded in the second half of 1940, these financial incentives were not enough to convince capitalists that a more interventionist state was worth tolerating. Arch-isolationist Henry Ford even rejected a massive airplane engine contract from the government. For most capitalists, the key issue with retooling for defense production was that it threatened to cut into their ability to take advantage of the growing economic recovery. American consumption had been bottled up for a decade by the Depression, and now that recovery was finally here, there was no doubt that Americans would be making their long-delayed purchases of new cars, ovens, and other consumer durables. No firm wanted to lose market share to a competitor because it had reorganized for defense contracts that probably wouldn’t last more than four or five years. Firms thus attempted to meet defense orders by building new capacity, keeping their existing manufacturing capability idle but ready to respond to new consumer markets. If building warplanes to send to the UK required building new factories, it would take well over a year before production targets could be met. Walter Reuther saw an opportunity for the labor movement in this moment. A brilliant union organizer who had done everything from battling strike breakers in the streets of Flint, Michigan, to working in a factory in the USSR, Reuther had become a leading figure in the United Auto Workers (UAW) over the past few years. With capitalists responding only sluggishly to the need for wartime production, Reuther boldly laid out a plan to turn idle manufacturing capacity into an assembly line of defense production. He called his plan “500 Planes a Day.” At its heart was the creation of a tripartite board administering airplane production on which the government, employers, and unions would have equal representation. This board would be responsible for assessing productive capacity, planning airplane construction targets, and allocating production of parts among plants without regard to ownership. This last point was crucial, and a key infringement on capitalist rights. Essentially, the plan was to treat all of Detroit as one big firm, with a Ford plant manufacturing engines that would then be installed in a General Motors plant on fuselages made by Chrysler. Productive capacity would, in this way, be maximized by assigning part production and assembly to the plants most suited to it, regardless of who owned the plant. Reuther’s plan would have advanced labor’s interest in multiple ways. First, it would have avoided the problems of seasonal work that plagued even skilled works in the auto industry by ensuring that any excess capacity would quickly be taken up elsewhere. Second, it would have prevented the massive expansion of production in airplane manufacturing from taking place in states with lower unionization, and redirected it into labor’s heartland. Most important, in its corporatist structure that placed labor on the planning board, it would give unions a voice in allocating investment. At a time when defense investment was becoming an ever larger share of the economy, a role in planning would give labor hitherto unimagined power in determining the direction of the American economy. Reuther’s audacity won him plaudits from unlikely sources, as even conservative newspapers and Republican politicians admired the plan’s scope and seriousness. However, manufacturing executives viewed it as an unacceptable intrusion on the privileges of management. They launched a counterattack quibbling with the plan’s technical details, while their allies in the state, like J. Edgar Hoover, smeared Reuther as a Russian agent. At the same time, however, the plan plainly placed them on the defensive, and they were unable to effectively criticize its basic strategy of central planning. Reuther’s plan was ultimately defeated not by industry resistance, however, but by the sheer force of events. After Pearl Harbor, the government simply suspended civilian auto production, solving the gridlock problem without requiring the kinds of far-reaching institutional changes for which Reuther had fought. The auto industry was converted to defense production, but firms themselves retained control over decisions like subcontracting, part design, and investment. Reuther’s plan failed because the labor movement wasn’t strong enough to force it on capital. Unlike European countries, where the labor movements had been strong enough to establish their own parties, in the United States, the movement remained very much the junior partner in a coalition with multinational capital inside the Democratic Party. Roosevelt himself, a product of the American aristocracy, had little enthusiasm for expanding the power of labor over the economy if it wasn’t an absolute necessity. A plan without power wasn’t enough.", "url": "https://www.jacobinmag.com/2020/03/walter-reuther-labor-world-war-coronavirus-uaw"}