{"authors": ["Jason Hoffman", "Caroline Kelly"], "date_download": "2020-05-04 16:11:28", "date_modify": "2020-05-04 16:11:28", "date_publish": "2020-04-03 00:10:19", "description": "Dr. Deborah Birx said that the White House coronavirus task force is missing 50% of the data for coronavirus tests that have been conducted.", "filename": "2020_04_02_politics_birx-task-force-coronavirus-testing_index_1588608688.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402160556-01-dr-birx-trump-chart-0331-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_birx-task-force-coronavirus-testing_index_1588608688.html", "title": "Top doctor says White House coronavirus task force still missing 50% of testing data", "title_page": "Top doctor says White House coronavirus task force still missing 50% of testing data - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Dr. Deborah Birx said that the White House coronavirus task force is missing 50% of the data for coronavirus tests that have been conducted.\nBirx, one of the top officials on the White House's coronavirus task force, said Thursday that part of the $2 trillion economic stimulus measure that was signed into law by President Donald Trump requires that all tests conducted get reported to the Centers for Disease Control and Prevention. But Birx says she has not received that data yet.\n\"Well, I'm telling you, I'm still missing 50% of the data from reporting,\" she said. \"I have 660 (thousand) tests reported in. We've done 1.3 million. ... So, we do need to see -- the bill said you need to report. We are still not receiving 100% of the tests.\"\nWhen pressed about the possibility that 1 in 3 tests had produced false negatives, Birx said, \"I haven't seen that kind of anomaly.\"\nBirx added that \"the number of positive tests is tracking very closely with a number of cases diagnosed.\"\nRead More", "url": "https://www.cnn.com/2020/04/02/politics/birx-task-force-coronavirus-testing/index.html"}