{"authors": ["Mike Schneider", "Kelli Kennedy"], "date_download": "2020-05-04 20:17:00", "date_modify": "2020-05-04 20:17:00", "date_publish": "2020-04-16 12:22:08", "description": "ORLANDO, Fla. (AP) — More than 180,000 workers in Florida filed claims with the state's overwhelmed and struggling unemployment system last week, raising the state’s total seeking jobless benefits...", "filename": "_04f762fc1d016fb7969901eb0cce0edd_1588623420.html", "image_url": "https://storage.googleapis.com/afs-prod/media/1ae8c3a646924d13bc0dac93a5dcddc2/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_04f762fc1d016fb7969901eb0cce0edd_1588623420.html", "title": "Florida unemployment jumps 180k as system still overwhelmed", "title_page": "Florida unemployment jumps 180k as system still overwhelmed", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Florida Gov. Ron DeSantis speaks to reporters at the state emergency operations center in Tallahassee, Fla., Saturday, March 14, 2020. The governor on Saturday banned most visits to nursing homes statewide as he acknowledged the coronavirus has likely spread into the general population. Meanwhile, officials closed world-famous South Beach to prevent college spring breakers from congregating. (AP Photo/Bobby Caina Calvan)\nFlorida Gov. Ron DeSantis speaks to reporters at the state emergency operations center in Tallahassee, Fla., Saturday, March 14, 2020. The governor on Saturday banned most visits to nursing homes statewide as he acknowledged the coronavirus has likely spread into the general population. Meanwhile, officials closed world-famous South Beach to prevent college spring breakers from congregating. (AP Photo/Bobby Caina Calvan)\nORLANDO, Fla. (AP) — More than 180,000 workers in Florida filed claims with the state’s overwhelmed and struggling unemployment system last week, raising the state’s total seeking jobless benefits to over a half million people since many parts of the Sunshine State went under lockdown last month.\nThe U.S. Department of Labor said Thursday almost 181,300 Floridians filed for jobless claims, raising the total number of Floridians seeking unemployment benefits over the past three weeks to more than 520,000 workers. The state later said the number of claims has reached 800,000.\nAnd that only counts the out-of-work employees who were able to file for claims with Florida’s beleaguered unemployment system. Many of the state’s hundreds of thousands of newly jobless have reported problems with filing applications or getting help from hotlines. They’ve had their online applications disappear in front of their eyes when the computer refreshes or they’ve gotten bumped out of the system while filling out the forms, forcing them to start over.\nGov. Ron DeSantis on Thursday issued an executive order waiving a requirement that unemployment recipients must certify every two weeks they remain out of work, saying those reapplications were helping to clog the overworked computer system.\nDeSantis said 121,000 unemployment payments have been issued, but that is less than one payment for every seven applicants. He said the state has also issued the first 23,000 weekly federal unemployment supplement checks of $600. Florida’s maximum state payment is $275 a week.\nThe governor has been saying for weeks the system was turning the corner only to find most progress to be a mirage.\n“We need to get people paid,” DeSantis said Thursday.\nManagement Services Secretary Jonathan Satter, who was named Wednesday to oversee the unemployment payment system, said Thursday the computer system is being upgraded and thousands of state employees borrowed from other departments are helping process applications in hopes of decreasing the backlog. He said the banking system is also being upgraded, so it can issue 100,000 checks per day instead of 25,000.\nHe compared the system to a 7-year-old car that never got used much but now is being used by 10 people — it can’t cope without repairs.\nColleen Corbett, a 30-year-old Tampa bartender who applied shortly after she lost two jobs in mid-March, hasn’t received a check. She doesn’t understand how so few claims have been processed.\n“I can’t believe DeSantis expects Floridians to live for over a month with zero income and still pay their rent and feed their families,” said Corbett, who is trying to supplement her income making T-shirts that she sells on Etsy. “Every day I see DeSantis on the news bragging about how much better the website is running and it’s an absolute lie.”\nDanielle Priebe’s husband was laid off from his job as a restaurant manager after eight years on March 15 and her hours managing a beauty supply store were cut from 40 a week to 16. The Priebes applied for unemployment right away, but their applications still haven’t been approved.\nThey’ve called more than a hundred times, but can’t get anyone on the phone and despite lengthy waits are eventually disconnected.\n“The governor keeps saying that, ‘We’re doing this, we’re doing that,’ but we’re not seeing it on our end. We’re getting nowhere. It’s like we’re spinning in circles,” said the 50-year-old Melbourne mother of three.\nThe state has had more than 23,300 confirmed coronavirus cases, at least 668 deaths and 3,400 are hospitalized.\nAmong the sick are 30 patients and staff members at a Tampa Bay area nursing home — some of the patients have been hospitalized.\nOther residents at the Freedom Square Seminole Nursing Pavilion will be tested and the facility is being cleaned, Pinellas County Assistant Administrator Lourdes Benedict told the Tampa Bay Times on Wednesday.\nStatewide, there are 1,332 cases in Florida long-term care facilities, according to the latest state data released Wednesday. Earlier this week, DeSantis said nearly 100 of the state’s 4,000 nursing homes have had coronavirus cases — but his administration has refused media requests for a complete list of the homes.\nThe state’s nursing home associations have asked DeSantis to give the industry a waiver from lawsuits stemming from the coronavirus outbreak.\nAccording to the Miami Herald, J. Emmett Reed , executive director of the Florida Health Care Association, would allow the nursing home industry to provide care “without fear of reprisal ... during this difficult time.”\nDeSantis said this week he is considering it, but hasn’t made any decisions.\n__\nKennedy reported from Fort Lauderdale. Associated Press writers Freida Frisaro and Terry Spencer in Fort Lauderdale and Brendan Farrington in Tallahassee contributed to this report.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.\n__\nThis version corrects the spelling of Colleen Corbett’s name.", "url": "https://apnews.com/04f762fc1d016fb7969901eb0cce0edd"}