{"authors": ["Reporter"], "date_download": "2020-05-04 20:18:23", "date_modify": "2020-05-04 20:18:23", "date_publish": "2020-04-29 12:16:10", "description": "\"He voted for you,\" Holly Marie Combs tweeted at the president. \"He believed every lie you muttered and sputtered.\"", "filename": "entry_holly-marie-combs-donald-trump-coronavirus_n_5ea95ff0c5b6123a17651739_1588623503.html", "image_url": "https://img.huffingtonpost.com/asset/5ea96a6224000037018e9ef1.jpeg?cache=xibb5xov96&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_holly-marie-combs-donald-trump-coronavirus_n_5ea95ff0c5b6123a17651739_1588623503.html", "title": "'Charmed' Star Rips 'Disgrace' Donald Trump Over Grandfather's Death From Coronavirus", "title_page": "'Charmed' Star Rips 'Disgrace' Donald Trump Over Grandfather's Death From Coronavirus | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Actor Holly Marie Combs pointed the finger firmly at President Donald Trump following the death of her grandfather on Monday from the coronavirus.\nThe “Charmed” and “Pretty Little Liars” star revealed her grandfather died from COVID-19, the disease caused by the virus, just one day after his 66th wedding anniversary.\n“He voted for you,” Combs tweeted at Trump.\n“He believed you when you said this virus was no worse than the flu,” she continued. “He believed every lie you muttered and sputtered.”\nCombs also called Trump “a disgrace to the human race.”\nMy grandfather died today. He voted for you. He believed you when you said this virus was no worse than the flu. He believed every lie you muttered and sputtered. He died today from Covid-19 one day after his 66th wedding anniversary. You’re a disgrace to the human race. — Holly Marie Combs (@H_Combs) April 27, 2020\nCombs’ representative did not immediately respond to HuffPost’s request for additional information.\nThe actor’s post prompted a host of sympathetic comments. It also sparked backlash from supporters of the president, who rebuked her for linking him to her grandfather’s death.\nCombs pulled no punches with her response:\nZero tolerance for Trumpers. Zero. Take it to someone else’s timeline. Not today Satan. — Holly Marie Combs (@H_Combs) April 28, 2020\nTrump for weeks downplayed the health risk posed by the coronavirus, repeatedly comparing it to seasonal flu. He has been criticized for his administration’s sloppy response to the crisis that has now killed almost 60,000 people nationwide, and for encouraging reopening of the economy against the advice of public health officials.", "url": "https://www.huffpost.com/entry/holly-marie-combs-donald-trump-coronavirus_n_5ea95ff0c5b6123a17651739"}