{"authors": ["Angela Dewan"], "date_download": "2020-05-04 16:05:25", "date_modify": "2020-05-04 16:05:25", "date_publish": "2020-04-02 07:07:54", "description": "People around the world have been breaking government advice to stay at home and practice social distancing. Here's why we humans find it so hard to stay away from one another, and this is what we can do about it.", "filename": "2020_04_02_health_coronavirus-human-contact-wellness-intl_index_1588608325.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330120936-bondi-beach-0320-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_health_coronavirus-human-contact-wellness-intl_index_1588608325.html", "title": "Humans are terrible at social distancing. Here's what to do about it", "title_page": "Humans are terrible at social distancing. Here's what to do about it - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) In Tokyo, crowds have been congregating in parks each day to see the cherry blossoms at peak bloom. Some 6,000 miles away in Washington DC, people were doing the exact same thing.\nLike so many people in so many countries, they are willfully ignoring government advice to stay at home and to keep well away from others, as the coronavirus spreads rapidly, killing thousands and already changing daily life as we know it.\nBut is it really just the cherry blossoms, or the beaches in Australia and California, or parks in central London that have inspired throngs of people to leave their homes during a pandemic? It's plausible. There's little else to do as cities around the world have all but shut down.\nThere is, however, something else highly appealing about going to these places, and it's the very thing that threatens to worsen the pandemic -- other people.\nIt seems that we humans just can't stay away from one another.\nEven in Italy, the country with the most coronavirus cases and deaths in the world, 125,000 people have been fined for breaking rules on restriction of movement. Many of these violations were made by people trying to sneak away and meet with other people , Italian media reports.\nThe desire to be physically near others is human nature. We humans -- or our ancestor species, more precisely -- have been social creatures since the Stone Age. Many studies have shown that hunter-gatherers formed \"bands\" as they found it more efficient to find enough food for survival through joint efforts. They also found strength in numbers, fending off threats, whether animal or human, more effectively as a group.\nA woman walks through a lightly trafficked Times Square in New York on March 16.\nOver a long evolutionary process, humans have developed highly sophisticated societies in which we cooperate to survive and better our lives, studies show.\nToday, having consensual physical contact with other people and enjoying the company of others in in the flesh releases all sorts of chemicals in the brain and body -- endorphins, serotonin and oxytocin, for example -- that essentially give us feelings of happiness and even love.\nThis is why, when we go to a concert or a football match, it's not just the athletes or the musicians that give us that sense of euphoria. Being with a lot of other people adds to the kick.\n\"Not everybody likes these situations, some people hate crowds. But for those that do, being with a lot of other people creates a physiological pleasure, endorphins, et cetera, go off,\" said Michael Muthukrishna, an assistant professor of Economic Psychology with the London School of Economics and Political Science.\nAfter events like this, people say they feel more bonded to one another and that they feel part of something whole, he told CNN.\n\"It's a wonderful feeling to be part of a bigger thing. Cheering on your own isn't as good as cheering with a friend, and that's not as good as cheering in a large crowd chanting war cries. It physiologically creates a sense of the individual dissolving into the whole.\"\nIn these sophisticated societies we have developed, we rely heavily on one another to get by.\nIn hunter-gatherer days, one person or family may have been responsible for finding food, cooking it, building a home and making clothes. Now we rely on other people from all over the world, with their own sets of knowledge and skills, to carry out different functions essential to surviving, Muthukrishna explains.\n\"Our society is such that we have a division of labor, and a more complex whole world than even the smartest among us could possibly understand. Each of us understands a small sliver of the world, and the rest is socially acquired,\" he said.\n\"It's what we call the illusion of explanatory depths -- we assume we understand how the world works, but really we have a very poor understanding of most things. We're happy to trust in the people who do. For example, you believe in germs. You might have seen them under microscope, but really you believe in it because you trust people that know that germs exist, even though you don't actually have access to that information.\"\nWe also really like touching\nThe coronavirus and need to physically distance ourselves has put much of our lives online. We have work meetings by video conference, we Skype with friends and family we can't meet, and we watch Netflix instead of going out for dinner.\nBut anyone who has had a long-distance relationship or has friends and family in far-flung places knows that Skype just isn't the same.\nPartly, it's because we really like to touch each other.\nGiving someone a hug, handshake or a kiss releases those same chemicals in the brain and body that make us happy. This natural process develops right from the start of life -- touch is the first sense a baby develops in the womb.\nNewborns are able see very little and their hearing is murky for some time after birth, so skin-to-skin contact is highly recommended between parents and babies to build bonds.\nPeople flocked to Bondi Beach in Sydney, Australia on March 20 during the coronavirus outbreak. Auhtorities later closed the beach off to the public.\nThere are all sorts of health benefits too. Skin-to-skin contact between mothers and babies regulates the baby's heart rate and breathing, stimulates digestion, helps fend off infection, stimulates the release of hormones to support breastfeeding and reduces cortisol, a stress hormone that suppresses the immune system, numerous studies show\nThe health benefits of human touch carry on through childhood, adolescence and adulthood, according to Tiffany Field, founder and director of the University of Miami's Touch Research Institute. Touch helps strengthens the immune system in fighting infections and plays a role in reducing mental health problems, Field has found in her research.\nPeople in the United States, as in many other countries, are becoming less and less tactile with each other, she said.\nField is concerned that human health is suffering as we increasingly isolate ourselves physically and become engrossed in communicating via technology.\nThis \"touch starvation\" is evident in a growing industry of professional cuddlers , who offer safe spaces for people who need hugs and other forms of platonic touching.\nField has carried out several studies that show that touch-deprived children and teenagers show higher levels of aggression. In one, she compared teenagers hanging out at a McDonald's in Paris with some at a McDonald's in Miami.\n\"The kids in Paris, who were getting more touch and were touching each other more, were less physically and verbally aggressive toward each other,\" she told CNN.\nField is working on a new study observing people at airport gates, where she says there is a concerning lack of human contact.\n\"We're seeing that people are not touching each other. They're on their cell phones, which is a real problem. People are now used to not touching each other -- there's very little handshaking and hugging, there's very little touch going on,\" she said.\nPeople walking through Primrose Hill on March 25 in London as UK Prime Minister Boris Johnson urged people to stay at home.\nThere are very few studies on humans for touch deprivation for ethical reasons, but the concept of human contact as a basic need developed in the 1950s and 1960s, when researcher Harry Harlow experimented with monkeys.\nIn a landmark study, he removed baby monkeys from their mothers and created wire-framed \"mother\" dummies. He consistently found that the monkeys deprived of touch showed serious behavioral problems. When given the choice, even when very hungry, the monkeys would choose a \"mother\" dummy covered in soft fabric to cuddle with over the plain wire-framed dummy offering milk.\nPrisoners who have been kept in solitary confinement have often described a lack of physical human contact as torture. Chelsea Manning, for example, in 2016 wrote of what she called \"no-touch torture\" when kept in a cell alone for long periods of time.\nStay connected\nIt seems particularly perverse that human contact is so beneficial to health and fighting disease, yet during this pandemic, human contact is literally our biggest threat. But experts agree the benefits of social distancing far outweigh the risk of socializing.\nSo what can be done about it? Field is hoping that staying at home will actually mean more touching. Give your loved ones a back rub, Field suggests, and if you're living alone during this period, then touch yourself.\n\"We know that moving the skin is critical for health reasons. Moving the skin puts the body into a more relaxed state. The vagal activity in the brain increases, and that slows the heart rate and lowers stress hormones, and that can even in the long run kill bacterial, viral and cancer cells,\" she said.\n\"And someone giving a back rub will get just as much out of it as the recipient.\"\nIf you're living alone, do \"self massage,\" Field says.\n\"Get a daily dose of it. You can reach most parts of your own body.\"\nAnd on the social side, it's important to stay connected in non-physical ways, says Bianca Suanet, a sociologist from the Vrije Universiteit Amsterdam.\nShe said she was concerned about the impact of social distancing in the elderly, who may be more vulnerable to feelings of loneliness.\n\"This period of social distancing is likely most difficult for older adults that lack a partner and a social support network that looks after them,\" said Suanet.\n\"People that have a solid social support network might also miss face to face social contact, but if people have someone that gives them a call once in a while and can bring them groceries and other necessities if necessary, that solves already some of the problems,\" she said.\n\"Helping others is one of the best ways to feel connected to other people.\"", "url": "https://www.cnn.com/2020/04/02/health/coronavirus-human-contact-wellness-intl/index.html"}