{"authors": ["Reporter"], "date_download": "2020-05-04 21:09:22", "date_modify": "2020-05-04 21:09:22", "date_publish": "2020-05-01 01:33:08", "description": "Flight attendants unions say the coronavirus requirement should be federally mandated, not left up to individual airlines.", "filename": "entry_airlines-require-masks-flights-coronavirus_n_5eab63f2c5b6995f13fe65cb_1588626562.html", "image_url": "https://img.huffingtonpost.com/asset/5eab759d2400005f028ea0e2.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_airlines-require-masks-flights-coronavirus_n_5eab63f2c5b6995f13fe65cb_1588626562.html", "title": "More Major Airlines To Require Passengers To Wear Masks On Flights", "title_page": "More Major Airlines To Require Passengers To Wear Masks On Flights | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Delta Air Lines, American Airlines and United Airlines are the latest companies to mandate that passengers must wear protective face masks while flying to prevent the spread of COVID-19.\nDelta and United’s mandates are slated to begin May 4, while American’s will go into effect on May 11. The airlines said there will be a slight delay in enacting the new policy to make sure they can secure enough masks for people without them.\n“Things have changed rapidly in just two or three weeks,” American Airlines President Robert Isom said in a call with journalists on Thursday while discussing efforts to mitigate the coronavirus’ spread. “As we take a look forward with sanitizer, we see ample supplies. With masks, it is a logistical issue of getting inventories to the right place, but we have sufficient quantities for our team.”\nJAIME REINA via Getty Images Delta and United’s mandates are slated to begin May 4, while American’s will go into effect May 11.\nThe three airlines join Jet Blue and Frontier Airlines with the mandatory mask policy. Alaska Airlines and Southwest Airlines are the main holdouts.\nFlight attendants unions have been pushing federal officials to make passenger masks a federal requirement. The Association of Flight Attendants-CWA, which represents 50,000 flight attendants at 20 airlines, sent a letter to Transportation Secretary Elaine Chao and Health and Human Service Secretary Alex Azar last week calling for the mandate.\nThe union’s president, Sara Nelson, posted a photo of a crowded flight on Sunday. The image, which has since been widely shared, shows several passengers traveling without masks. “This is not okay,” she wrote.\nENOUGH! This was TODAY on a four hour flight. This is not okay. Masks must be mandated by DOT/HHS in airports and on airplanes. Essential travel only, with proper PPE. #COVID19 #StopTheSpread pic.twitter.com/TzwJyVRBoD — Sara Nelson (@FlyingWithSara) April 27, 2020\nSens. Edward J. Markey (D-Mass.) and Richard Blumenthal (D-Conn.), members of the Commerce, Science, and Transportation Committee, have echoed the union’s demands. They, too, sent a letter to Chao and Azar calling for the passenger mask mandate.\n“We believe that a nationwide rule is required because air travel is an inherently interstate issue; public health decisions for this sector cannot be left to individual states,” they wrote in their letter. “Moreover, in the absence of federal action, different airlines and airports have adopted conflicting policies that will undermine overall public health if they are not unified around a single, strong standard.”\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/airlines-require-masks-flights-coronavirus_n_5eab63f2c5b6995f13fe65cb"}