{"authors": ["Peter Valdes-Dapena", "Cnn Business"], "date_download": "2020-05-04 16:09:20", "date_modify": "2020-05-04 16:09:20", "date_publish": "2020-04-02 19:33:38", "description": "The CEO of Italian tire maker Pirelli has a message for America's business leaders: Prepare for the worst and your company may come through this crisis stronger than it was before.", "filename": "2020_04_02_cars_pirelli-ceo-interview-coronavirus_index_1588608560.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330104237-marco-tronchetti-provera-0219-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_cars_pirelli-ceo-interview-coronavirus_index_1588608560.html", "title": "CEO of Italian tire maker Pirelli: US business leaders should prepare now for the worst", "title_page": "CEO of Italian tire maker Pirelli: US business leaders should prepare now for the worst - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The CEO of Italian tire maker Pirelli has a message for America's business leaders: Prepare for the worst and your company may come through this crisis stronger than it was before.\n\"Considering that we are facing a very tough situation for many months. If we move in advance, we can cope with it and we can come out of it even stronger,\" said Marco Tronchetti Provera, who has led Pirelli since 1992. \"We have to work better with our customers and suppliers. We have to get closer one to another, to blend together to protect the weakest.\"\nTronchetti Provera has been running the Milan-based company from one of his homes since the coronavirus crisis first took hold in Italy over a month ago. Both of Pirelli's Italian factories and its corporate headquarters have been shut down so many of the company's office employees are working from home as well. The rest of Pirelli's roughly 3,000 employees in Italy, most of them factory workers, remain on the company payroll during the lockdown, a spokeswoman said,\nSo far, Italy has suffered more deaths from the virus than any other country in the world and the nation remains on lockdown. As the United States struggles to contain its own outbreak, Tronchetti Provera spoke with CNN Business by phone about how the crisis is already changing his company.\n\"We are a traditional company, we are not an Internet company, and [for employees] to see the CEO with no tie, with a dog beside him working in a teleconference is something that brings people closer to you,\" he said. \"So I think it's more human. It sounds the opposite of what it should be because technology is cold and makes us far away one from another.\"\nRead More", "url": "https://www.cnn.com/2020/04/02/cars/pirelli-ceo-interview-coronavirus/index.html"}