{"authors": [], "date_download": "2020-05-04 20:08:50", "date_modify": "2020-05-04 20:08:50", "date_publish": "2020-04-08 22:28:10", "description": "NEW ORLEANS (AP) — A Louisiana man had his double murder conviction overturned three weeks ago but defense lawyers and prosecutors continue to argue over whether he should be released until his...", "filename": "_028c8d99e5dd094c3eee82b713d45bf6_1588622930.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_028c8d99e5dd094c3eee82b713d45bf6_1588622930.html", "title": "Conviction tossed but man still in prison amid virus spread", "title_page": "Conviction tossed but man still in prison amid virus spread", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NEW ORLEANS (AP) — A Louisiana man had his double murder conviction overturned three weeks ago but defense lawyers and prosecutors continue to argue over whether he should be released until his next trial date as prisons fight the spread of the new coronavirus .\nDarill Henry’s attorneys said he should be freed from prison before he contracts COVID-19, which inmates have tested positive for in the Louisiana State Penitentiary at Angola and other correctional facilities, The Times-Picayune/ The New Orleans Advocate reported .\nProsecutors insist Henry remain locked up.\nHenry was convicted of double murder in the death of 89-year-old Durelli Watts and her daughter, Ina Gex. On June 15, 2004, Watts was stabbed and her house was set on fire. Gex was fatally shot on the front porch. Jurors convicted Henry using eyewitness evidence, and he was sentenced to life in prison.\nPrior to his conviction, DNA samples were taken from Watts’ fingernails, but not enough to do a proper analysis before the 2011 trial, the paper reported.\nA more recent analysis showed the samples weren’t a match to Henry. The defense argued the DNA must have come from the person who attacked Watts. Orleans Parish Criminal District Court Judge Dennis Waldron sided with the defense, overturned Henry’s conviction and ordered a new trial. On Thursday, Waldron granted Henry bond but prosecutors filed an appeal halting the process.\nAs of Tuesday, the state Supreme Court was deciding whether to let Waldron’s ruling stand or take another look.\nThe District Attorney’s Office has declined to comment on the case while it’s pending.\nIn a motion to the high court, Henry’s lawyers described him as an innocent man who could lose the chance to gain his freedom “because he is imprisoned within an epicenter for this deadly and highly contagious virus.”\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/028c8d99e5dd094c3eee82b713d45bf6"}