{"authors": ["Grant Schulte"], "date_download": "2020-05-04 20:27:36", "date_modify": "2020-05-04 20:27:36", "date_publish": "2020-04-17 14:44:01", "description": "LINCOLN, Neb. (AP) — Gov. Pete Ricketts said Friday he may take a regional approach to lifting social distancing restrictions in Nebraska, similar to the way he tightened the rules to fight the...", "filename": "_054ba7b02ff781a8b56f38a06246d08f_1588624056.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_054ba7b02ff781a8b56f38a06246d08f_1588624056.html", "title": "Ricketts may take regional approach to lifting restrictions", "title_page": "Ricketts may take regional approach to lifting restrictions", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LINCOLN, Neb. (AP) — Gov. Pete Ricketts said Friday he may take a regional approach to lifting social distancing restrictions in Nebraska, similar to the way he tightened the rules to fight the coronavirus.\nRicketts said he’ll follow a phased-in, “one step at a time” approach to avoid another flare-up of the virus. Nebraska’s statewide social distancing mandates are in place until at least April 30.\n“We’re going to put together a plan that is right for Nebraska,” Ricketts said at his weekday coronavirus news conference. “That may involve doing something instead of on a statewide basis, doing it regionally.”\nHis comments came after a meeting Thursday between U.S. governors and the White House, and the Trump administration’s rollout of recommendations to reopen the country. Trump has largely punted to the states to manage the process after previously asserting that the decision was his.\nMeanwhile, Omaha Mayor Jean Stothert warned that officials are bracing for a huge blow to the city’s budget due to a loss of tax revenue. Stothert said city officials made the right call with social distancing restrictions and she’d do it again “in a New York minute,” but the city will impose a hiring freeze and reduce purchases to try to absorb the shock.\n“It’s going to be a real challenge to work with each other to make sure we have the funding available to keep our city up and running,” the mayor said.\nThe number of confirmed coronavirus cases in Nebraska topped 1,000 on Thursday and had risen to 1,066 as of Friday morning. Twenty-four people have died, and more than 12,000 have tested negative.\nTwo of the deaths were reported in Gage County in southeastern Nebraska, the state Department of Health and Human Services reported Thursday. Both were residents of an assisted living facility, including a woman in her 80s and a man in his 70s with multiple underlying health conditions. The third death out of Douglas County was a man in his 70s with several underlying health conditions.\nFor most people, the new coronavirus causes mild or moderate symptoms, but, for some, especially the elderly or infirm, it can cause severe illness and lead to death.\nNews of the latest Nebraska deaths came as officials warned that the Grand Island area in south-central Nebraska’s Hall County appears to be the state’s latest hot spot for spread of the virus. Hall County said Thursday it had 278 residents with COVID-19, surpassing the 263 known cases in Douglas County, which includes Omaha and has a population nearly nine times the size.\n___\nFollow Grant Schulte on Twitter: https://twitter.com/GrantSchulte", "url": "https://apnews.com/054ba7b02ff781a8b56f38a06246d08f"}