{"authors": ["David Blank"], "date_download": "2020-05-04 16:28:27", "date_modify": "2020-05-04 16:28:27", "date_publish": "2020-04-07 17:02:11", "description": "World Health Day is always observed on April 7. This year, the day is dedicated to honoring nurses and midwives, but it's possible nobody will notice. The nurses are just too busy.", "filename": "2020_04_07_health_world-health-day-2020-trnd_index_1588609707.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406201627-01-world-health-day-nurses-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_health_world-health-day-2020-trnd_index_1588609707.html", "title": "World Health Day 2020: Meet the heroes battling the coronavirus pandemic", "title_page": "World Health Day 2020: Meet the heroes battling the coronavirus pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) World Health Day is always observed on April 7. This year, the day is dedicated to honoring nurses and midwives, but it's possible nobody will notice. The nurses are just too busy.\nFor hospital nurses, life under the coronavirus is a slog of precautions, fear and duty.\nNorthside Hospital sits in suburban Atlanta, Georgia. It is not among the hardest-hit facilities in the country. There are n o refrigerated trucks ominously idling in its parking lot like you'd see in New York. There is no dire lack of protective equipment for hospital workers there -- at least not yet.\nInteractive: A guide to helping and getting help during the coronavirus crisis\nBut there is an army of dedicated nurses caught up in the fight against coronavirus. A few of them had a moment to describe their life calling, their mission now and the personal tolls the pandemic is taking.\nHere are the stories of two Northside nurses and one public health nurse in a rural county.\n'Not everyone can do this job'\nSara Wazlavek (far right) works with doctors to intubate a patient.\n\"After fifteen years working in the emergency room of a hospital, I've never seen anything like this before,\" Sara Wazlavek says.\nThe nature of her job can shift by the hour.\n\"Rules, policies and procedures are rapidly changing based on the new data that comes out daily,\" she tells CNN.\nOne thing doesn't change: her fear of bringing the virus home. Nursing is Wazlavek's calling, but her identity is mother and wife.\n\"No one wants to put their family's lives on the line. I come home with the knowledge that I might be bringing Covid into my home, that it could kill me, my husband or my kids. I didn't think becoming a nurse would mean possibly losing my family, or that I would be the cause.\"\nBut Wazlavek reports for her shifts because there's a pandemic to fight, and she's a nurse.\n\"Not everyone can do this job. It takes training. If everyone who was afraid quit, who would be left. What makes me so special that I can stay home when others are putting their lives at risk? I want to help my coworkers. I can't abandon them. I want to help the people in our community who need us. I can't abandon them either.\"\nWazlavek says that for now, her hospital has enough gloves, masks and gowns to keep her relatively safe.\n\"For how long though?\" she wonders out loud. \"What happens if they don't? Do I go to work, put my life, my family's lives, at risk even more than I already am? Or do I leave the hospital and patients to fend for themselves?\"\nWazlavek does not consider herself a hero. But for people who want to honor her sacrifice and grit, she has one suggestion: stay home.\nBringing babies into the world during a global health crisis\nChandler Scott says the pandemic has made the birthing process a lot colder.\nChandler Scott is a neonatal intensive care nurse at Northside , which claims to deliver more babies each year than any other community hospital in the country.\nShe says the pandemic has made the birthing process a lot colder for everyone involved, especially suspected coronavirus carriers.\n\"Babies get separated immediately from parents and placed in quarantine until deemed safe to return to the mother,\" she says.\nNeonatal intensive care unit (NICU) nurses attend the deliveries. They wear N95 respirator masks with plastic eye shields, isolation gowns and gloves as they whisk the baby away.\nThese rooms are dedicated to babies from mother's infected with coronavirus.\n\"We now have strict visitation. Parents are no longer allowed in the NICU to visit their newborn child,\" she tells CNN.\nScott says parents get a 30-minute orientation visit when their infant is first admitted and cannot return until the days leading up to discharge.\nIn the meantime, nurses in surgical masks tend to the babies and set up FaceTime and Skype meetings so new parents and newborns can gaze at each other. Social distancing starts young in these strange times.\nReady to answer the call\nJessica Baker is a public health nurse in North Georgia.\nAbout an hour's drive away from Northside Hospital, Jessica Baker is preparing to administer Covid-19 tests in Georgia's Lumpkin county.\nThe Georgia public health nurse is literally taking the community's temperature when it comes to the pandemic. She's also informing the uninsured and people with low incomes about available services.\n\"No matter where I end up for the day, I always hit the ground running and don't stop until it's time to go home,\" she says. \"These are uncharted waters and I want to make sure that I am able to provide the community with the most up to date information as we receive it.\"\nIn addition to the uncertainty involving the virus and human nature, she also finds herself at the mercy of weather. She must wait until rain passes before donning her protective gear. Temperatures are rising in the Georgia spring; masks, gloves and gowns gets uncomfortable fast.\nBaker is comfortable with her job. The pandemic is a big deal, but like so many nurses rising to the occasion, a disaster like this one has lurked at the back of her mind for a long time.\n\"Despite all of the advances in medicine and technology, I always knew there was a chance that I would be called to the front line if there was a crisis and I have been ready to answer that call.\"", "url": "https://www.cnn.com/2020/04/07/health/world-health-day-2020-trnd/index.html"}