{"authors": ["Eliza Mackintosh"], "date_download": "2020-05-04 16:56:45", "date_modify": "2020-05-04 16:56:45", "date_publish": "2020-04-09 11:54:33", "description": "The World Health Organization has hit back at criticism from President Donald Trump as global cases reach 1.5 million.", "filename": "2020_04_09_world_coronavirus-newsletter-04-09-20-intl_index_1588611405.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_world_coronavirus-newsletter-04-09-20-intl_index_1588611405.html", "title": "What you need to know about coronavirus on Thursday, April 9", "title_page": "What you need to know about coronavirus on Thursday, April 9 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story appeared in the April 9 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every weekday\n(CNN) The World Health Organization has defended its response to the pandemic and warned that politicizing the crisis will result in \"many more body bags,\" countering criticisms leveled at it by President Donald Trump.\nGlobal cases have now reached 1.5 million, and the United States had its deadliest day yet — but the White House coronavirus taskforce say there are signs social distancing is in fact working. Even as fatalities continue to increase, the nation's top expert, Dr. Anthony Fauci , says there are \"some glimmers of hope.\"\nStill, a return to normal life could be a long way off. A new study modeled on Chinese data suggests that lockdowns can't be fully relaxed until a vaccine is available — and warns that loosening restrictions could result in a second wave of infections in mid-summer. And worrying new research from the Korean CDC indicates that the virus may \"reactivate\" in people previously cured of the illness, Bloomberg reports\nA day after restrictions were lifted in Wuhan — ground zero of the virus — fears of a second wave are growing: China's President Xi Jinping has warned of \"new difficulties and challenges\" in the fight to prevent a resurgence.\nYOU ASKED. WE ANSWERED", "url": "https://www.cnn.com/2020/04/09/world/coronavirus-newsletter-04-09-20-intl/index.html"}