{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:09:18", "date_modify": "2020-05-04 16:09:18", "date_publish": "2020-04-02 16:37:09", "description": "On March 25, Wisconsin Democratic Gov. Tony Evers issued a stay-at-home directive to the state's residents, telling them to avoid \"unnecessary trips\" and limit travel \"to essential needs like going to the doctor, grabbing groceries or getting medication.\"", "filename": "2020_04_02_politics_wisconsin-primary-april-7-coronavirus_index_1588608558.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200302101233-voting-booth-the-point-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_wisconsin-primary-april-7-coronavirus_index_1588608558.html", "title": "Why in the world is Wisconsin still holding a primary on Tuesday?", "title_page": "Why in the world is Wisconsin still holding a primary on Tuesday? - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) On March 25, Wisconsin Democratic Gov. Tony Evers issued a stay-at-home directive to the state's residents, telling them to avoid \"unnecessary trips\" and limit travel \"to essential needs like going to the doctor, grabbing groceries or getting medication.\"\nYou'll notice that Evers didn't mention in that list of \"essential needs\" going to a polling place to cast a ballot in the state's primary set for Tuesday. And yet, as of right now, Wisconsin is the only state in the country planning to hold an in-person primary vote this month -- even as the state and the country remains on lockdown to limit the spread of coronavirus.\nAnd reporting by the Milwaukee Journal Sentinel suggests that there are already major shortages of poll workers. Wrote the Sentinel's Molly Beck\n\"More than 100 communities in Wisconsin don't have any poll workers for the spring election in six days and a record number of voters are overwhelming clerks with absentee ballots -- leading to warnings that thousands of votes may not be counted.\"\nSo, how the heck did this happen?", "url": "https://www.cnn.com/2020/04/02/politics/wisconsin-primary-april-7-coronavirus/index.html"}