{"authors": [], "date_download": "2020-05-04 20:24:13", "date_modify": "2020-05-04 20:24:13", "date_publish": "2020-04-16 14:06:24", "description": "TRENTON, N.J. (AP) — New Jersey's schools will be closed because of the COVID-19 outbreak at least until May 15, Gov. Phil Murphy said Thursday. Murphy ordered the state's more than 600...", "filename": "_77d918197e54122f03fca5e2f9cc9f2f_1588623853.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_77d918197e54122f03fca5e2f9cc9f2f_1588623853.html", "title": "NJ schools closed until at least May 15, Murphy says", "title_page": "NJ schools closed until at least May 15, Murphy says", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NJ schools closed until at least May 15, Murphy says\nTRENTON, N.J. (AP) — New Jersey’s schools will be closed because of the COVID-19 outbreak at least until May 15, Gov. Phil Murphy said Thursday.\nMurphy ordered the state’s more than 600 school districts to close last month as part of an effort to halt the spread of the virus.\nNeighboring Pennsylvania has closed schools through the rest of the year.\nThe first-term Democratic governor also reported that the number of deaths due to the virus climbed by 362 to 3,518. There are more than 75,000 residents with the virus, he said.\nDespite the growing number of positive tests and a surging death toll, Murphy said social distancing efforts “are working.” As evidence, he said that the rate the number of cases doubles has been going up across the state from about every three days to seven days.\nA look at other developments:\n___\nFEWER JOBLESS CLAIMS , BUT STILL A LOT\nUnemployment claims in New Jersey fell by 34% last week, the state Labor Department said Thursday, but they were still much higher than before the governor’s stay-at-home order went into effect on March 21.\nThe economic fallout stems from the coronavirus outbreak that has led officials to shutter schools and businesses.\nMore than 140,000 people sought jobless benefits last week, the department said. That’s down from about 215,000 the week before, compared with roughly 8,000 applications in the first week of March.\nThe jobless claims filed during the outbreak have shattered previous high water marks set after Superstorm Sandy, when single-week claims reached 46,000.\nOver six weeks beginning in early March, the state has paid about $425 million unemployment benefits, according to the Labor Department. The state’s unemployment trust fund had about $3 billion, according to the department’s report to the Legislature last year.\n___\nREOPENING COUNCIL\nFormer Obama administration Homeland Security Secretary Jeh Johnson and Dr. Richard Besser will serve on the multi-state council to reopen the region’s economies, Murphy said.\nJohnson headed Homeland Security from 2013 to 2017 under Barack Obama.\nBesser is a medical doctor and the president and CEO of the Robert Wood Johnson Foundation.\nMurphy and other governors on the East Coast have said they’ll work together to restart their economies after the outbreak, but they haven’t given a timeline.\n___\n100 VENTILATORS FROM NEW YORK\nNew York has donated 100 ventilators to New Jersey, according to the governor.\nNew Jersey’s northern neighbor is at the center of the outbreak in the United States.\nNew Jersey is currently using about 1,600 ventilators, or 56% of its statewide capacity.\n___\nABOUT THE VIRUS\nFor most people, the virus causes mild or moderate symptoms that clear up in a couple of weeks. Older adults and people with existing health problems are at higher risk of more severe illness, including pneumonia, or death.", "url": "https://apnews.com/77d918197e54122f03fca5e2f9cc9f2f"}