{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:28:16", "date_modify": "2020-05-04 20:28:16", "date_publish": "2020-04-20 20:16:54", "description": "Delaying the Tour de France is good for four-time champion Chris Froome, his team manager Dave Brailsford said on Monday. When the French extended their ban on large gatherings into July,...", "filename": "_7df5d2a181497a49803045d7d639e4c8_1588624096.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7df5d2a181497a49803045d7d639e4c8_1588624096.html", "title": "Focused on Le Tour, Froome not wasting time in lockdown", "title_page": "Focused on Le Tour, Froome not wasting time in lockdown", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Delaying the Tour de France is good for four-time champion Chris Froome, his team manager Dave Brailsford said on Monday.\nWhen the French extended their ban on large gatherings into July, the Tour’s start was shifted from late June to late August. Doubt remains about whether it will start even then because of the coronavirus pandemic, but the new dates injected positive news through the sport.\nProfessional cycling has been shut down for more than a month, but Brailsford said Froome hasn’t wasted time while in lockdown.\n“He is an amazing guy. If anybody has got the right mentality to be in this situation, it is Chris. He is very, very strong mentally,” Brailsford said.\n“He is up in the mornings like a machine. In the gym, he is on his bike, he is training.\n“He is working so hard and, to work through this period, I don’t think there is any doubt that he is going to benefit from this (lockdown) as much as anybody -- in terms of being able to put the work together and consistently build a very, very good strong fitness base.”\nTo Brailsford, delaying the Tour has given the Team Ineos rider extra time to ensure he will be competitive in his comeback from the career-threatening crash last June.\nFroome broke his hip, femur, elbow and ribs at the Criterium du Dauphine. He recovered from barely being able to walk to lining up eight months later at the UAE Tour in late February.\nThe race was canceled with two stages to go because of the virus, but Froome was grateful to feel like a cyclist again. Soon after, cycling was put on ice.\nHe welcomed the news last week that the Tour was delayed for two months, calling it light at the end of the tunnel.\n“He is optimistic and he is coming back from injury,” Brailsford said. “And so it gives him a little bit longer to come back. So I think, if we do get to race (the Tour) in August and September, then I am sure he would be very, very competitive.”\n___\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports", "url": "https://apnews.com/7df5d2a181497a49803045d7d639e4c8"}