{"authors": ["Rob Harris"], "date_download": "2020-05-04 20:17:23", "date_modify": "2020-05-04 20:17:23", "date_publish": "2020-04-06 19:25:03", "description": "Apologizing to its own fans, Liverpool on Monday reversed a decision to apply its furloughed non-playing staff for the British government's job retention scheme during the coronavirus...", "filename": "_43b317a9745b9db3a130f27cff98eab6_1588623443.html", "image_url": "https://storage.googleapis.com/afs-prod/media/15f5173e0c9d4fb78bfaf79f4c52ce29/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_43b317a9745b9db3a130f27cff98eab6_1588623443.html", "title": "Liverpool reverses plan to furlough staff after backlash", "title_page": "Liverpool reverses plan to furlough staff after backlash", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Liverpool's goalkeeper Adrian, center bottom, fails to save the ball as Atletico Madrid's Marcos Llorente scores his side's second goal during a second leg, round of 16, Champions League soccer match between Liverpool and Atletico Madrid at Anfield stadium in Liverpool, England, Wednesday, March 11, 2020. (AP Photo/Jon Super)\nLiverpool's goalkeeper Adrian, center bottom, fails to save the ball as Atletico Madrid's Marcos Llorente scores his side's second goal during a second leg, round of 16, Champions League soccer match between Liverpool and Atletico Madrid at Anfield stadium in Liverpool, England, Wednesday, March 11, 2020. (AP Photo/Jon Super)\nApologizing to its own fans, Liverpool on Monday reversed a decision to apply its furloughed non-playing staff for the British government’s job retention scheme during the coronavirus pandemic.\nUnder the scheme implemented to help businesses survive the national lockdown, staff can be put on furlough and receive 80% of their salaries from the government, up to a maximum of 2,500 pounds ($3,000) a month.\nLiverpool’s about-turn came after two days of fans and former players of the European champion expressing unhappiness with its furloughing plans.\n“We believe we came to the wrong conclusion last week to announce that we intended to apply to the coronavirus retention scheme and furlough staff due to the suspension of the Premier League football calendar,” Liverpool chief executive Peter Moore said in a message to fans, “and are truly sorry for that.”\nPlayers remain on full pay at the club, which is 25 points clear with nine games to go in a Premier League on hold as sporting events are banned in a bid to contain the spread of COVID-19.\nTottenham, which lost to Liverpool in last season’s Champions League final, has disregarded a backlash from its supporters and politicians by pressing ahead with plans revealed a week ago to furlough staff.\nManchester rivals United and City have said they would not use public funds to make savings on the wage bill despite much of the clubs’ operations being paused.\nLiverpool is one of the wealthiest clubs in world football, making a pre-tax profit of 42 million pounds ($52 million) on a turnover of 533 million pounds last year. The northwest English club has been owned for a decade by John Henry’s Fenway Sports Group, which also features the Boston Red Sox.\n“Our intentions were, and still are, to ensure the entire workforce is given as much protection as possible from redundancy and/or loss of earnings during this unprecedented period,” Moore said.\n“We are therefore committed to finding alternative ways to operate while there are no football matches being played that ensures we are not applying for the government relief scheme.”\nFellow Premier League clubs Newcastle, Norwich and Bournemouth are still furloughing some non-playing staff.\nManchester United on Monday told its full-time staff of around 900 that they would continue to be paid in full. Anyone unable to work from home or those with reduced workloads have been urged to volunteer for the National Health Service or in their local communities.\nIf the season cannot be completed, the Premier League could owe broadcasters a reported 762 million pounds. Burnley, which has nine of its 38 games remaining, estimates a cash shortfall of 50 million pounds.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/43b317a9745b9db3a130f27cff98eab6"}