{"authors": ["Opinion Simona Siri"], "date_download": "2020-05-04 16:15:35", "date_modify": "2020-05-04 16:15:35", "date_publish": "2020-04-03 15:22:47", "description": "When an Italian journalist saw her American husband fall ill at their home in New York, it was the culmination of frustrating weeks of trying to get him and friends in the US to take Covid-19 more seriously", "filename": "2020_04_03_opinions_simona-_32b9da2b40741c93cc41c9084b0aa477_index_1588608935.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200321145819-01-coronavirus-0321-italy-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_opinions_simona-_32b9da2b40741c93cc41c9084b0aa477_index_1588608935.html", "title": "I watched as the US paid too little attention to Italy's suffering", "title_page": "I watched as the US paid too little attention to Italy's suffering - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Simona Siri is an Italian journalist and writer based in New York City. She writes regularly for Vanity Fair Italy and the Italian newspaper La Stampa. Follow her on Twitter @simonasiri . The views expressed in this commentary are her own. View more opinion at CNN.\n(CNN) When on March 13 my husband, Dan, came down with Covid-19 symptoms — high fever, dry cough, chills — my first reaction was rage, and then panic. Rage because I had spent the previous two weeks telling him to wash his hands and stay home, close the office, don't take the subway. Panic because I am Italian. I have been in New York only for seven years. My family and friends are in Milan, the center of the outbreak in Italy. I knew what was coming. It was going to be horrible. I tried to warn him. Why did he not listen to me?\nLike Cassandra, the mythological Greek figure cursed with the ability to correctly predict the future without ever being believed, I felt I was reliving that same tragedy. Italy confirmed its first two coronavirus cases on January 30 halting flights to and from China and declaring a state of emergency the following day. On February 23, celebrations for the Venice carnival were ended early , and soccer matches were canceled.\nAs this was unfolding, I relayed the events to my husband. He was concerned but still didn't seem to grasp the magnitude of the situation. In the meantime, I was listening to stories about Italian life in lockdown — put in place nationwide on March 9 — and reading in Italian newspapers about the toll on health care workers hit by the virus while they were caring for infected patients. \"It is like being at war\" is the description that almost every doctor gave to the press. \"You have no idea,\" a friend told me over Skype. \"The silence in Milano is unreal, shattered only by the never-ending sound of the ambulances. It's like living in a horror movie.\"\nMy husband was far from being the only skeptical one. On March 8, I had a heated text exchange with a highly educated and informed friend. She was planning to go to a play that night because she was \"counting on the sick people to stay home.\" I tried to convince her that the only thing to do was to stay in. She didn't. As the number of deaths in Italy was rising toward 200 a day on March 12, I told her, my husband, my American friends, anyone who would listen about the morgues in Italy so crowded that in Bergamo, a small town near Milan, army tanks had to come to take the coffins away.\nI felt isolated and alone. My American friends and I were not only speaking two different languages but living on different planets. I disconnected from everyone around me. No one seemed to get it. At least when I was speaking with my friends back home, they knew. We could share the same pain. For the first time I even considered moving back. At least I would have felt understood.\nAt present, the US has at least 245,658 coronavirus cases with 6,069 deaths. New York, now the US epicenter of the outbreak, has at least 92,743 confirmed cases, nearly 49,707 in New York City alone . The statewide death toll is nearing 2,500. I read about the passing of a Mount Sinai nurse, the shortage of protective gear for health care workers. I see the picture of the three nurses using black garbage bags as gowns.\nAll I feel is a strange déjà vu. I saw the same pictures three weeks ago in Italian newspapers. I read similar stories of health care workers forced to work shifts of 16 hours. Singalongs from the balcony, people clapping to salute and thank the health care workers — even these forms of stress release and spirit uplifting, I already saw them.\nListening to President Trump saying that \"nobody expected\" this pandemic is especially infuriating for me. Ask my Italian friends, Mr. President. I can provide names and numbers. Ask people who couldn't even say goodbye to their loved ones because in Italy there are no more funerals, no more burials, no holding hands at the very last breath.\nAfter two weeks of uninterrupted fever which never, thank God, developed into respiratory problems, my husband is out of the woods. It has been the most difficult time in our marriage. We often clash due to different cultural backgrounds, but this time was different. I put on his shoulders all the flaws in the way the American government was handling the coronavirus emergency. \"Why don't you get it?\" I yelled at him one night. \"Why don't you learn from my country?\" I screamed at him, but I wanted to scream at America.\nAfter we both calmed down, I explained to my husband really for the first time why this was so especially painful for me. As I did so, I learned something about myself: I have grown to love my adopted country as much as my native one. Watching one fail to learn from the mistakes of the other has been heartbreaking. Experiencing this crisis as it begins to overtake my adopted country, I feel something common to so many immigrants: a heart continuously split in two.\nThis piece has been updated to reflect the latest figures on Covid-19 cases and deaths in the US at the time of publication.", "url": "https://www.cnn.com/2020/04/03/opinions/simona-siri-us-attention-italy-coronavirus/index.html"}