{"authors": ["Jeanne Sahadi", "Cnn Business"], "date_download": "2020-05-04 16:16:46", "date_modify": "2020-05-04 16:16:46", "date_publish": "2020-04-01 21:23:59", "description": null, "filename": "2020_04_01_success_small-business-sba-loans_index_1588609006.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401154044-small-business-closed-restaurant-ri-0325-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_success_small-business-sba-loans_index_1588609006.html", "title": "What small businesses need to know about the government's new forgivable loan program", "title_page": "What small businesses need to know about the government's new forgivable loan program - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Small business owners have been told today is the day they can apply for a new, forgivable loan to help keep their businesses afloat during the coronavirus crisis .\nNearly $350 billion has been allocated for that purpose in the new economic aid package signed into law last week.\nBut most lenders may not be able to start processing loans today because it was just Thursday evening that the Treasury and Small Business Administration put out some of the critical guidance lenders need.\n\"[W]e would ask for everyone to be patient as banks move heaven and earth to get a system in place and running to help America's small businesses,\" said Richard Hunt, president and CEO of the Consumer Bankers Association.\nThe American Bankers Association also urged patience, noting it \"will take some time before [the program] is fully functioning.\"\nDespite a bumpy start , lenders expect to see huge demand for the loans. Chris Hurn, CEO of Fountainhead, a non-bank direct Small Business Administration lender, estimates his company alone already has loan applications lined up for more than $1 billion.\nThe Consumer Bankers Association expects the majority of its members to be operational by next week. And there are some lenders that are at least starting to accept applications.\nHere's what small business owners need to know about the new loan program.\nWho is eligible to apply?\nGenerally, any small business with 500 or fewer employees is eligible.\nThat includes sole proprietorships and independent contractors. It also includes nonprofits, veterans organizations and tribal businesses.\nIn certain circumstances , businesses with more than 500 employees also may qualify.\nApplications will be accepted up to June 30. But the program is on a first come, first serve basis.\nWhat is the money for?\nThe goal of the loan program is to help small businesses continue to pay their employees and their overhead costs in order to stay afloat for the next couple of months.\nSo long as you use the borrowed funds to make payroll and to pay expenses, such as utilities and your rent or your mortgage interest, you won't have to repay the loan and you will not owe income tax on the forgiven amount.\nIn order for your loan to be fully forgiven you must maintain your headcount and not reduce employees' pay.\nBut I had to let my employees go already. Does that mean I can't get a loan?\nYou still can, so long as you can show you had employees as of Feb. 15, 2020. Once approved for a loan, you can use the money to rehire your staff.\nThe loan forgiveness provisions will apply so long as employees are rehired by June 30, according to senior Treasury and Small Business Administration officials.\nWhat do I need when I apply?\nLenders will ask you to fill out a two-page application, which can be found here\nYou must show lenders proof that your company was in operation on Feb. 15, 2020 and that you had employees for whom you paid salaries and payroll taxes.\nIn addition, you'll need to show proof of your average monthly payroll costs in 2019 (or for the first two months this year if your business is new).\nIndependent contractors and the self-employed, who must wait until April 10 to apply, need to show proof of \"payroll and other certain expenses\" according to Treasury.\nYou will not have to provide a personal guarantee or collateral to secure a loan, as you normally would for an SBA loan. But if you use the money for fraudulent purposes you will be subject to criminal charges.\nYou will not be charged loan fees.\nHow much money can I get?\nLoans will be made in an amount equal to 2.5 months of your average monthly payroll costs in 2019 (or the average of the first two months of this year if your business is new).\nMore details on just what goes into calculating your payroll costs can be found here starting on page 8.\nOnly one loan is permitted per business.\nDoes the money need to be paid back?\nYou will not have to pay back the loan so long as you use at least 75% of the money you get on payroll costs (including wages, benefits, payroll taxes plus state and local wage taxes). and the rest of the funds are spent on your business' rent payments or mortgage interest, utilities and other overhead expenses. The money must be spent in the first eight weeks after you receive the loan.\nIn other words, if you spend the borrowed money for authorized purposes over the first two months of the loan, that obligation will be forgiven. And the amount forgiven will not be treated as taxable income to you.\nAt the end of eight weeks, you'll have to show your lender proof of your expenses during that period.\nPayroll costs eligible for forgiveness may not exceed $100,000 per employee.\nWhen would I have to pay the loan back if it's not forgiven?\nIf any part of the borrowed money is used for unauthorized purposes, that amount will not be forgiven. And you will have to repay it over two years at a 1% interest rate. (Initially the Treasury had capped it at 0.5%m but many lenders noted that was below their cost of funds or breakeven point.)\nThere's an automatic six-month deferral on payments for all borrowers. So you would need to start paying it back, with interest, after six months.\nWhere can I get the loan?\nAll SBA-approved lenders as well as federally insured depository institutions, federally insured credit unions and Farm Credit System institutions will be able to make these loans if they choose. Senior Treasury officials said they are also looking into allowing some fintech companies to make loans as well.\nThe SBA will be posting a tool for you to key in your zip code to find lenders near you participating in the program.\nIf you've never taken out an SBA loan before, you might go to your primary bank first because lenders will be operating under so-called Know Your Customer regulations and that process will be streamlined if you've previously worked with the lender.\nDo I have to go to a bank to apply?\nNo. The expectation is that you should be able to apply online.\nIs it true that I can get the money the same day I apply?\nPossibly, at some lenders. But it's more reasonable to assume it could take two to three days after you submit an application, Hurn said. It's up to every bank to decide when it disburses the money after an application is approved.\nThis loan will only support two months of my costs. Then what?\nGood question. If the coronavirus crisis goes on for a long time, the Treasury and Congress will need to come up with more ways to provide capital to keep small businesses afloat.\nWhere can I go for more information?\nFor more detailed information on the loans, guidance put out so far by the Treasury and the SBA can be found here and here\nCorrection: An earlier version of this story incorrectly stated that mortgage payments would be forgivable under the SBA loans. Only the interest portion of the mortgage payments will be covered.", "url": "https://www.cnn.com/2020/04/01/success/small-business-sba-loans/index.html"}