{"authors": ["Jordan Valinsky", "Cnn Business"], "date_download": "2020-05-04 16:51:43", "date_modify": "2020-05-04 16:51:43", "date_publish": "2020-04-08 07:48:01", "description": "The retail industry has been decimated by the coronavirus pandemic, and much of the destruction has landed on luxury and fashion companies.", "filename": "2020_04_08_business_fashion-luxury-industry-coronavirus_index_1588611103.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407134521-j-crew-closed-store-0318-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_business_fashion-luxury-industry-coronavirus_index_1588611103.html", "title": "Millions of jobs are at risk as fashion and luxury sales fall off a cliff", "title_page": "Millions of jobs are at risk as fashion and luxury sales fall off a cliff - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) The retail industry has been decimated by the coronavirus pandemic, and much of the destruction has landed on luxury and fashion companies.\nPeople have stopped shopping at stores, and many online shoppers are holding back on discretionary purchases. That has left luxury and fashion companies \"exposed or rudderless,\" and business will sink by as much as 30% this year, according to a new report released Wednesday from trade publication Business of Fashion and consulting firm McKinsey & Company.\nAccording to the report, which surveyed 1,400 fashion professionals, luxury good makers and retailers will be hit the hardest: Sales are expected to decrease as much as 40%.\nThe report warned 80% of the companies surveyed expect to encounter financial hardship this year, and it forecast a significant number of bankruptcies within 18 months if stores remain closed. Retailers across the globe have temporarily closed because local governments shuttered non-essential businesses to stop the spread of Covid-19.\nRead More", "url": "https://www.cnn.com/2020/04/08/business/fashion-luxury-industry-coronavirus/index.html"}