{"authors": [], "date_download": "2020-05-04 20:16:00", "date_modify": "2020-05-04 20:16:00", "date_publish": "2020-04-16 16:03:59", "description": "ALBUQUERQUE, N.M. (AP) — An Albuquerque retirement community where dozens of residents and employees have become infected with the coronavirus was accused Thursday by the state's top prosecutor of...", "filename": "_1c473f523f2fa49e42945d5db150635a_1588623360.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1c473f523f2fa49e42945d5db150635a_1588623360.html", "title": "Retirement community didn't follow orders", "title_page": "Attorney general: Retirement community didn't follow orders", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ALBUQUERQUE, N.M. (AP) — An Albuquerque retirement community where dozens of residents and employees have become infected with the coronavirus was accused Thursday by the state’s top prosecutor of failing to follow public health orders and keep residents informed about the outbreak.\nAttorney General Hector Balderas in a letter sent to La Vida Llena officials also noted that preliminary findings of an investigation indicate the company had discouraged personnel from wearing personal protective equipment and did not warn medical providers in advance that patients from the retirement community had either tested positive or had been exposed to the virus.\nTen La Vida Llena residents who tested positive have now died. In all, New Mexico has had about 1,600 cases and nearly four dozen deaths due to the virus.\n“The state of New Mexico is focused on saving lives, and we will continue to partner with healthcare providers and families to ensure the health and safety of vulnerable New Mexicans,” Balderas said in a statement, noting that the investigation was ongoing.\nThe attorney general said in his letter that he was notifying La Vida Llena of the deficiencies that were uncovered in the hope that changes would be made so residents and staff can “remain as safe as possible during this unprecedented pandemic.”\nLa Vida Llena officials issued a statement Thursday questioning why the attorney general would make public incomplete findings from an investigation that’s still ongoing. They also said no members of the leadership team have been interviewed by Balderas’ investigators.\n“When they do contact us, we will be fully cooperative, including detailing the comprehensive set of actions we’ve taken over the past month to follow the directives and orders issued by state and federal agencies,” they said. “In fact, at present we are working in partnership and under the supervision of the New Mexico Department of Health, who have personnel on site at La Vida Llena helping us care for our residents.”\nAccording to the attorney general’s office, the Health Department had previously conducted a formal review of La Vida Llena’s infection control protocols in anticipation of the COVID-19 threat and found that the community failed to adhere to public health orders issued by the state.\nFor example, state officials said La Vida Llena allowed communal dining and health facilities to remain open after the state of emergency was declared in New Mexico.\nAt the end of March, La Vida Llena executive director Linda Givens announced that a resident had tested positive. She went on to say there was no exposure to other residents and attending staff had been using the appropriate protective gear and that the community was “following every recommended protocol.”\nHowever, the attorney general’s office pointed to a “very concerning disregard” for the protective measures called for in the public health orders.\nAmong the additional eight deaths reported Thursday by state health officials was a woman in her 80s who was a La Vida Llena resident.\nThe Health Department has identified cases at seven other congregate living facilities around New Mexico.", "url": "https://apnews.com/1c473f523f2fa49e42945d5db150635a"}