{"authors": ["Scottie Andrew", "Cnn Illustrations", "Leah Abucayan", "Cnn Animation", "Kelly Flynn"], "date_download": "2020-05-04 16:52:11", "date_modify": "2020-05-04 16:52:11", "date_publish": "2020-04-04 08:53:21", "description": "Here are simple, step-by-step instructions from the Centers for Disease Control and Prevention on how to do just that, whether or not you know how to sew.", "filename": "2020_04_04_health_how-to-make-your-own-mask-wellness-trnd_index_1588611131.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406154235-coronavirus-how-to-make-a-mask-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_health_how-to-make-your-own-mask-wellness-trnd_index_1588611131.html", "title": "How to make your own face mask (whether or not you know how to sew)", "title_page": "How to make your own face mask (whether or not you know how to sew) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "You should also note:\nStill, if you want to make a mask, here are simple, step-by-step instructions from the Centers for Disease Control and Prevention on how to do just that, whether or not you know how to sew.\nNot sure how to wear or clean the masks? We answer those questions under the mask-making instructions.\nMaterials you'll need\nBandana, T-shirt or square cotton cloth, about 20\" x 20\"\nCoffee filter\nRubber bands or hair ties\nMake your mask\n1. Cut the bottom off a folded coffee filter. Keep the top part -- you'll need it for the filter in your mask.\n2. Lay a bandana or 20\" x 20\" T-shirt flat in a rectangle. Fold the bandana or shirt in half lengthwise.\n3. Fold the cut filter in the center of the folded bandana or shirt. Then, fold the top of the bandana or shirt down over the filter. Fold the bottom up.\n4. Place rubber bands or hair ties around the folded bandana or shirt, about 6 inches apart.\n5. Fold the side of the bandana or shirt in toward the middle and tuck.\n6. Place the rubber bands or hair ties around your ears, and voila -- you've made a face mask, no sewing required.\nIf you know how to sew\nMaterials you'll need\nTightly woven cotton fabric\nElastic (or rubber bands, string, cloth strips, hair ties)\nNeedle & thread (or bobby pin or sewing machine)\nScissors\nMake your mask\n1. Cut your fabric into two 10\" by 6\" rectangles. Place them on top of each other.\n2. Fold over the long sides -- 1/4 inch -- and hem.\n3. Then, fold the double layer of fabric over 1/2 inch along the short sides. Stitch down.\n4. Thread a 6-inch-long, 1/8-inch-wide piece of elastic through the wider hem on each side of the mask and knot it -- this is one of your two ear loops. If you don't have elastic, you can do the same with hair ties or rubber bands. If you only have string or fabric, you can make the ties longer and tie the mask behind your head.\n5. Pull on the ear loops so the knots are tucked inside the hem.\nGather the sides of the mask on the elastic and adjust so the mask fits your face.\n6. Then, stitch the elastic (or fabric) in place on the corner of the mask to keep it from slipping -- and voila! You've sewn a mask in six steps.\nMask FAQs\nHow do I wear it?\nMasks are only effective if you wear them properly. The World Health Organization has the how-to:\nWash your hands for 20 seconds with soap and water before touching or putting on the mask.\nMake sure your entire nose and mouth are covered when you put it on.\nAvoid touching the mask while you're out -- this can contaminate it.\nDo not take the mask off while you're in public.\nTo take it off once you return, untie it from the back -- don't touch the front of it.\nYou should immediately wash the mask after returning so it doesn't contaminate your belongings.\nWash your hands immediately after you've taken it off, and again after you've washed the mask.\nAre masks even effective?\nHomemade mask studies have shown that they're significantly less effective than surgical masks -- and they're certainly no replacement for the essential N95 respirators health care workers must wear to treat patients.\n\"Homemade masks are partially effective,\" said Dr. Koushik Kasanagottu, an internal medicine resident at Johns Hopkins Bayview Medical Center in Maryland.\nThey offer a physical barrier from viral particles, he said, but they don't have the filters that N95 respirators do.\nBut they're better than nothing, especially for people who only go out in public to make a quick trip to the grocery store or pharmacy, said Anna Davies and Raina MacIntyre, public health researchers and authors of two separate studies on the effectiveness of cloth mask.\nIt's important to note, though, that masks cannot replace social distancing measures. Maintaining at least six feet of distance from others and staying home as much as possible is still the best way to prevent the spread of the virus.\nHow do you clean them?\nYou should launder the masks before and after each use to clean off any germs you might have picked up in public. Hand wash the masks or put them in a mesh wash bag in the washing machine so they don't fall apart, and use a high heat setting.\nWhat if I can't make my own?\nCrafters on Etsy aren't sold out of face masks yet. It's difficult to discern how effective these masks are since you didn't craft them yourself, but you can compare them to our mask tutorial before you buy -- does it cover your nose and mouth? Are there pleats? Will it tightly seal around your face?\nYou likely don't need to buy more than a few masks -- physicians recommend that only one member of each household runs errands in public\nIt may take longer than usual to ship the masks, so be aware of this when you buy.\nAnd be sure to wash the masks before you wear them.\nIf you can't access masks at all, then keep washing your hands , maintaining distance from others and following other social distancing measures. Staying home is the best defense against coronavirus, after all.", "url": "https://www.cnn.com/2020/04/04/health/how-to-make-your-own-mask-wellness-trnd/index.html"}