{"authors": ["Samantha Bresnahan"], "date_download": "2020-05-04 16:18:10", "date_modify": "2020-05-04 16:18:10", "date_publish": "2020-04-04 07:56:58", "description": "From the beginning of the coronavirus outbreak, CNN journalists have covered the story from all corners of the globe. This is the story of the pandemic, from those who have reported on it firsthand.", "filename": "2020_04_04_world_witness-coronavirus-correspondents-spc-intl_index_1588609090.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200122161039-david-culver-wuhan-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_world_witness-coronavirus-correspondents-spc-intl_index_1588609090.html", "title": "Covering the coronavirus pandemic: CNN correspondents on how we got here", "title_page": "Covering the coronavirus pandemic: CNN correspondents on how we got here - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Atlanta (CNN) As the entire world grapples with the effects of the coronavirus outbreak , it is easy to lose sight of how we got here. There are not many news events in recent memory that have come close to the far-reaching implications in terms of our public health, social interactions, and the global economy; life as we know it has been altered.\nFrom the beginning, CNN journalists have covered this unprecedented story from all corners of the globe. Three months since we heard the first whispers of a strange respiratory illness emerging in China, this is the story of a story -- from those who have witnessed and reported on it firsthand.\nWuhan: Ground zero\nOn the final day of 2019, the World Health Organization receives word of a pneumonia-like disease in the central Chinese city of Wuhan. According to Wuhan Municipal Health, the cases occur between December 12 and December 29. The new decade begins with Chinese authorities closing the Huanan Seafood Wholesale Market on January 1; health officials suspect wild animals sold at the market could be the source of the virus.\nDavid Culver, CNN International Correspondent, based in Beijing: Initially it was last year that...we got first word of something going on within Wuhan. I think my first reaction was, \"Well, where's Wuhan?\"\nDr. Sanjay Gupta, CNN Chief Medical Correspondent: I was getting messages from colleagues at the National Academy of Medicine [in the US], basically saying, \"Red flag. Be on the lookout.\" And having covered a lot of these types of pandemics around the world, my antenna immediately went up. That was right at the beginning of all this. No one knew exactly where this was headed at that point, but that's when we really started paying attention.\nNectar Gan, CNN Digital Reporter, based in Hong Kong: People were very nervous, watching this mysterious pneumonia developing across the border in China. I remember back in early January, the hospital authority in Hong Kong had already started recording all the suspected cases -- basically, people who travel to Wuhan and return to Hong Kong with either fever or cough or other respiratory symptoms, and it was playing in the news every day.\nCulver: It was a slow evolution as to what exactly was happening and how serious it was. And the initial reporting was surrounding this market, this seafood market, really, that was apparently selling wildlife illegally and that that was the real concern. And so, after that was shut down on January first, we thought, \"Well, perhaps that was the end of it.\" Clearly, it wasn't.\n'A new virus'\nOn January 5, China confirms the respiratory cases are neither SARS nor MERS; two days later, authorities in the country declare it to be a novel coronavirus. The WHO initially names it 2019-nCov.\nGan: It was basically a new virus that nobody has seen or known of before, so that's when we decided, okay, it's time that : It was basically a new virus that nobody has seen or known of before, so that's when we decided, okay, it's time that we put out a story to let the world know about this mysterious virus that's getting China and certainly Hong Kong very nervous.\nKristie Lu Stout, CNN International Anchor and Correspondent, based in Hong Kong: Hong Kong is home to some world class infectious disease experts and they were puzzled. They didn't know what this was. But even back then, there were a lot of concerns here in Hong Kong because of course, the population here acutely remember just the scars from the Hong Kong is home to some world class infectious disease experts and they were puzzled. They didn't know what this was. But even back then, there were a lot of concerns here in Hong Kong because of course, the population here acutely remember just the scars from the SARS outbreak of almost two decades ago , and what the SARS outbreak did to the community here.\nJUST WATCHED This may explain the spread of China's new virus Replay More Videos ... MUST WATCH This may explain the spread of China's new virus 03:38\n'We need to get you out of there'\nThe first reported death is a 61-year-old man in Wuhan, announced on January 11. A second person dies within a week. Meanwhile, two travel-related cases are reported in Thailand and Japan. By mid-January, a CNN crew prepares to visit the epicenter in Wuhan. On January 21, the day before the team arrives, the first case on US soil is announced in Washington state.\nCulver: When we decided to go down to Wuhan, we really planned to be there for a few days. We checked in on [January 22] and we were focused on gathering as much as possible the first day that we were there. We went to the outskirts of the market. We went to the infectious disease hospital, mindful and careful not to get too close to expose ourselves.\nFor me, the moment that hit was a 3:30 am phone call from our senior producer in Beijing. And it was an urgency in his voice, \"Wuhan's going on lockdown. We need to get you out of there.\" And we had only a few hours to act.\nJUST WATCHED Officials in China work to limit spread of Wuhan coronavirus Replay More Videos ... MUST WATCH Officials in China work to limit spread of Wuhan coronavirus 02:53\nWuhan on lockdown\nOn January 22, following reports that the death toll has risen to 17, Wuhan announces a \"temporary\" closure of railway stations and the airport to prevent people from departing. A city of 11 million is suddenly on lockdown.\nCulver: The team mobilized very quickly. We were able to get to a train station within Wuhan, and we looked around and realized this seemed to be the same concern and urgency that hundreds of other people were experiencing. At that time, it was 4:00 in the morning. I looked around and I said to myself, \"This is far more serious than I think we initially thought.\"\nJulia Chatterley, CNN Business Anchor, based in New York: I was in Davos, Switzerland (for the World Economic Forum annual meeting), and the conversation evolved in the space of one to two days from talking about business and climate to coronavirus and what...we were hearing from China. There'd been a few deaths, I think, at that point. And people were talking about whether this could be SARS round two, the same we saw in 2002. Even at that stage, we had no clue what we were about to see.\nJUST WATCHED CNN goes to ground zero of Wuhan coronavirus outbreak in China Replay More Videos ... MUST WATCH CNN goes to ground zero of Wuhan coronavirus outbreak in China 02:45\nSara Sidner, CNN Correspondent, based in Los Angeles: What really struck me, when I knew that this was a dangerous and deadly virus, is when you saw the streets of Wuhan completely empty. Then when we heard the news that the doctor who had exposed the fact that this was happening What really struck me, when I knew that this was a dangerous and deadly virus, is when you saw the streets of Wuhan completely empty. Then when we heard the news that the doctor who had exposed the fact that this was happening there died . I thought, okay, this is really a different sort of thing. We're not talking about the flu, we're not talking about even H1N1 or SARS.\n'Outpouring of anger'\nThe doctor is Li Wenliang, an ophthalmologist in a Wuhan hospital. As early as December, before Wuhan health authorities even announced the outbreak, he had been trying to warn colleagues and friends on social media.\nCulver: I reflect on Dr. Li Wenliang's story a lot...I think the reason he became such a national figure here and a hero in some cases is because he didn't want to be a hero. This was a guy who simply wanted to let his friends and their relatives know, \"Hey, something's going around. This might be like SARS. I'm not sure, but just be careful.\" And it was shared and it went public really quickly and it got him in a lot of trouble. : I reflect on Dr. Li Wenliang's story a lot...I think the reason he became such a national figure here and a hero in some cases is because he didn't want to be a hero. This was a guy who simply wanted to let his friends and their relatives know, \"Hey, something's going around. This might be like SARS. I'm not sure, but just be careful.\" And it was shared and it went public really quickly and it got him in a lot of trouble. Police reprimanded him . They brought him in, essentially said, \"You're not to be spreading these rumors.\" And he went back to work...he was exposed to this virus and he got it, and it took him down quite quickly.\nGan: We spoke to Dr. Li Wenliang back in late January when he was actually lying on his ICU bed trying to fight the coronavirus inside him, but then we really did not expect the fact that he would die in about a week's time. He told us he was recovering. I remember watching the Chinese social media and the outpouring of anger, of grief was something I've not seen in recent years. It was just unprecedented.\nJUST WATCHED Wuhan coronavirus kills doctor who warned of outbreak Replay More Videos ... MUST WATCH Wuhan coronavirus kills doctor who warned of outbreak 03:12\nCulver: I think what's so alarming about his situation was, here's a guy who's 34 years old. He's a young guy, really didn't want this attention. Simply wanted to help his friends and keep them on the lookout for what could be a dangerous virus -- and even the Supreme Court here in China acknowledged had his warning not been reprimanded, but rather publicized and perhaps supported, things could have been a lot different.\nThe virus spreads\nAs January turns to February, more and more cases begin to appear outside mainland China. On February 4, the Japanese Health Ministry reports 10 positive cases aboard a cruise ship in Yokohama Bay.\nWill Ripley, CNN International Correspondent, based in Hong Kong: When I arrived here in Japan in early February, the big story was the Diamond Princess Cruise Ship. There were 3,700 people on board, and once they started testing for coronavirus, the number of cases jumped from the dozens to the hundreds. And for a time it was the largest cluster of coronavirus cases outside of mainland China.\nI think at that point I realized just how infectious this virus is, how contagious it is, and how dangerous it is, especially when people from the cruise ship started to die. We watched in real time how a government attempt to contain this virus failed.\nJUST WATCHED US coronavirus patient on quarantined ship speaks to CNN Replay More Videos ... MUST WATCH US coronavirus patient on quarantined ship speaks to CNN 02:36\nCulver: Going onto social media and seeing that folks back in Europe or in the States were very calm about the whole situation and going to gyms and going to restaurants and crowded spaces -- for me it was a bit jarring to see that knowing what could potentially be heading their way.\nItaly the epicenter\nNot only is it heading their way, it is already there. It soon becomes clear Italy is the epicenter in Europe. On February 25, in an attempt to contain the spread, the Lombardy region of the country issues a complete lockdown of some 100,000 people. In Spain, cities like Madrid are not far behind.\nBen Wedeman, CNN Senior International Correspondent, based in Beirut: We were outside a café [in northern Italy] and there were some young students who were obviously out of school. These were university students sitting around having the last drinks before the bar closed. And they were completely relaxed about it. They said, \"we're young, we have nothing to worry about.\"\nStout: It breaks my heart to see the situation in Wuhan being repeated elsewhere in communities in Italy, in Spain, even in the United States right now. We have reported on the horrors that medical staff have been going through in Wuhan with not enough beds, not enough respirators, not enough protective equipment. The warnings were out there.\nWedeman: The numbers [in Italy] really started to skyrocket, and the area of lockdown became the entire country of more than 60 million people. And I think that's when it became clear that this was not a local problem of just a few towns and villages. This was a problem throughout the entire country, throughout Europe, and now throughout the world.\nJUST WATCHED Life around Italy's coronavirus 'red zone' Replay More Videos ... MUST WATCH Life around Italy's coronavirus 'red zone' 02:31\nUS records its first death\nOn February 29, the United States records its first death due to the virus. The patient is in Washington state; the outbreak appears to be a cluster in a nursing home in Kirkland, near Seattle.\nSidner: I came to Kirkland about a week after it was discovered that someone had died from coronavirus, and not just one person, but that there were several people dealing with some kind of terrible respiratory problem inside of a nursing home at the Life Care Center. Everything went wrong within hours, in one case, one of the nurses told us. The way she described it was that it was like a battlefield. And in this battlefield, you didn't have much equipment, you didn't have hardly any help, and you didn't have any time.\nJUST WATCHED Nursing home visits restricted under national emergency Replay More Videos ... MUST WATCH Nursing home visits restricted under national emergency 03:49\nWedeman: A year ago, I was I Syria covering the final battle against ISIS, and you could see the enemy is over there. The danger is there, the bullets and the bombs are flying in this direction that direction. With this story, it's invisible. You cannot see the germs spreading. It's a whole different level of danger, of risk involved.\nGupta: I think it's really hard to compare what is happening now to just about any story that I've covered over the last 20 years. When you cover conflicts, and you cover natural disasters, even as we're reporting on them, there's always this sense that people back home that may be not directly affected by this, they may not pay as much attention. With this, you know that everyone has been affected. Everyone is paying attention. And everyone is living a fundamentally different life now than they did a few months ago.\nChatterley: There is nothing that you can compare this experience to. At the core of the health crisis is the ripple effect that's created. It's a global story. It's created an economic crisis in the nations that are trying to handle this, : There is nothing that you can compare this experience to. At the core of the health crisis is the ripple effect that's created. It's a global story. It's created an economic crisis in the nations that are trying to handle this, a deliberate economic crisis trying to suppress and restrict those that are suffering from the coronavirus, and of course the deaths that we see mounting all over the world.\nJUST WATCHED Goldman Sachs now expects unemployment to hit staggering 15% Replay More Videos ... MUST WATCH Goldman Sachs now expects unemployment to hit staggering 15% 03:16\nPandemic declared\nThe World Health Organization declares the novel coronavirus outbreak to be a pandemic on March 11. In the United States, cases spread beyond Washington, especially in New York. The stock market sees historic lows. Medical professionals continue sounding the alarm, citing a dangerous lack of available ventilators, protective equipment, and tests -- the same messages that had come from Wuhan at the end of January.\nGupta: With the benefit of hindsight, there are always things that we notice that were missed. What we should have done, in terms of making hospital beds available, in terms of making ICU beds available, in terms of making ventilators available, in terms of making personal protective equipment more available.\nIt's going to be a big question why we didn't do those things. We knew it was coming. We didn't do enough of basic public health strategies to start to distance people and start to reduce the transmission of this virus. All of that was magnified by the fact that we didn't have good testing in [the United States] early on. The reality is, by the time we started doing testing in any kind of earnest, it had already been several weeks -- up to six weeks that the virus had really been spreading unchecked.\nJUST WATCHED Gupta examines the lack of coronavirus testing in the US Replay More Videos ... MUST WATCH Gupta examines the lack of coronavirus testing in the US 02:31\nA glimmer of hope\nEven as the crisis is ongoing, lessons emerge from countries around the world, like South Korea , where rapid, continued testing has produced a vastly different outlook than places like the United States. Meanwhile, a glimmer of hope begins to shine in Wuhan, China, the place where it all began, as the city announces it plans to lift its lockdown on April 8, more than two months after it first shut down.\nGan: Wuhan will never be the same, after going through what it has gone through. For its 11 million residents, their lives are just forever changed. So, we keep sort of saying that things are gradually returning to normal in China. I think maybe in some cases, that's true, but I think at the heart of the crisis in Wuhan, there's no normality to go back to anymore.\nRipley: Never before in my 20 years of journalism have I covered a story with this level of global impact. Pretty much everyone around the world is going through the same thing, and this kind of a situation has the potential to divide us, but it also has the potential to bring us together. And I hope that the latter is what happens.\nI hope that we can all come away from this having experienced something together and can gain some common ground and some understanding of each other and hopefully respect for each other.\nChatterley: We'll get through it. Whatever it takes, however long, we will get through it. Human spirit is the most powerful thing.", "url": "https://www.cnn.com/2020/04/04/world/witness-coronavirus-correspondents-spc-intl/index.html"}