{"authors": [], "date_download": "2020-05-04 20:24:11", "date_modify": "2020-05-04 20:24:11", "date_publish": "2020-04-17 07:50:13", "description": "LOUISVILLE, Ky. (AP) — Three hunger-relief charities will benefit from a $500,000 donation by the Kentucky Farm Bureau Mutual Insurance Co. and Kentucky Farm Bureau Insurance Foundation in...", "filename": "_ada010f44c1ae78285048e15ba2974c9_1588623851.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ada010f44c1ae78285048e15ba2974c9_1588623851.html", "title": "3 hunger relief charities to benefit from $500,000 donation", "title_page": "3 hunger relief charities to benefit from $500,000 donation", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOUISVILLE, Ky. (AP) — Three hunger-relief charities will benefit from a $500,000 donation by the Kentucky Farm Bureau Mutual Insurance Co. and Kentucky Farm Bureau Insurance Foundation in response to the effects of the coronavirus pandemic.\nThe donation is the largest single private donation made as part of Agriculture Commissioner Ryan Quarles’ Kentucky Hunger Initiative launched in 2016, the Kentucky Agriculture Department said in a news release.\n“The coronavirus pandemic is impacting people of every socioeconomic status, but we know those who were already living in food-insecure conditions are at an even greater risk right now,” Farm Bureau President Mark Haney said in the release.\nThe foundation raised $125,000 for the Clays for a Cause fundraiser, and the organization tripled that amount with resources from Kentucky Farm Bureau Insurance for a total donation of $500,000. The funds will go to Feeding Kentucky, Glean Kentucky and Kentucky Hunters for the Hungry, the release said.\n“This donation, in this time, demonstrates how Kentucky agriculture is not only committed to growing food and fiber during a pandemic, but also to marshalling funds to feed vulnerable Kentuckians affected by it,” Quarles said.\nThe company’s annual Clays for a Cause fundraiser was originally scheduled for next Wednesday and Thursday. Last year’s sporting clays event drew 191 participants at Elk Creek Hunt Club in Owenton. The 2020 event will be rescheduled.", "url": "https://apnews.com/ada010f44c1ae78285048e15ba2974c9"}