{"authors": ["Devan Cole"], "date_download": "2020-05-04 16:27:25", "date_modify": "2020-05-04 16:27:25", "date_publish": "2020-04-07 17:40:06", "description": "Republican Sen. Rand Paul of Kentucky announced Tuesday that he has successfully recovered from his bout with the novel coronavirus and is now volunteering at a hospital to help patients stricken with Covid-19.", "filename": "2020_04_07_politics_rand-paul-coronavirus-recovery_index_1588609645.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200322135035-01-rand-paul-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_rand-paul-coronavirus-recovery_index_1588609645.html", "title": "Rand Paul says he has successfully recovered from coronavirus", "title_page": "Rand Paul says he has successfully recovered from coronavirus   - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Republican Sen. Rand Paul of Kentucky announced Tuesday that he has successfully recovered from his bout with the novel coronavirus and is now volunteering at a hospital to help patients stricken with Covid-19.\n\"I appreciate all the best wishes I have received. I have been retested and I am negative. I have started volunteering at a local hospital to assist those in my community who are in need of medical help, including Coronavirus patients. Together we will overcome this!\" Paul, who is also a doctor, wrote in a tweet.\nThe tweet included a photo of the senator, half-smiling and wearing a white lab coat.\nThe announcement comes a little over two weeks after Paul announced he had been diagnosed with coronavirus, making him the first known US senator to have been infected with it.\nPaul, who, at the time, said he was asymptomatic, had faced criticism from Republicans and Democrats alike following his diagnosis because he had hadn't self-quarantined while he awaited his results. GOP senators told CNN last month that Paul was in the gym with colleagues the morning of the day he announced his positive results, and several pointed out how close he had sat to others during Senate lunches at the time.", "url": "https://www.cnn.com/2020/04/07/politics/rand-paul-coronavirus-recovery/index.html"}