{"authors": ["Charles Riley", "Cnn Business"], "date_download": "2020-05-04 16:56:43", "date_modify": "2020-05-04 16:56:43", "date_publish": "2020-04-09 11:15:10", "description": "US President Donald Trump, a self-proclaimed \"Tariff Man,\" is brandishing his favorite trade weapon ahead of a crucial meeting of major oil producers later on Thursday that's aimed at hammering out a deal to limit production.", "filename": "2020_04_09_investing_premarket-stocks_index_1588611403.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200107112703-saudi-arabia-oil-tanker-1211-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_investing_premarket-stocks_index_1588611403.html", "title": "What happens if OPEC and Russia don't agree to cut production?", "title_page": "Premarket stocks: What happens if OPEC and Russia don't agree to cut production? - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here\nLondon (CNN Business) US President Donald Trump, a self-proclaimed \"Tariff Man,\" is brandishing his favorite trade weapon ahead of a crucial meeting of major oil producers later on Thursday that's aimed at hammering out a deal to limit production .\nRussia and Saudi Arabia, the de-facto leader of OPEC, are engaged in an epic price war that, along with an historic collapse in demand from the coronavirus pandemic, has helped send crude prices crashing to 18-year lows. As a result, dozens of US oil companies are facing bankruptcy.\nTrump wants a deal, and is using the threat of tariffs on imported oil to push OPEC and other major producers towards an agreement. \"We want to save a great industry,\" the president said during a press briefing Sunday.\n\"I would do tariffs, very substantial tariffs,\" Trump said.\nWould tariffs work? Analysts are deeply skeptical that US tariffs against Russia and Saudi Arabia would significantly alter market dynamics, my colleague Matt Egan reports.\n\"I'm confident that among all the different things the administration can do to help the industry, tariffs are at the bottom of the list,\" said Joe McMonigle, senior energy policy analyst at Hedgeye Risk Management and a former Energy Department official.\nThe United States imported just 401,000 barrels of oil per day from Saudi Arabia in January, according to the US Energy Information Administration. That's down 44% from a year ago and among the lowest monthly total since the mid-1980s. Russia sent 95,000 barrels to the United States in January.\nCrude prices spiked by a record 32% last week on hopes of Moscow and Riyadh will declare a truce and massively cut their production.\nTrump has done his part to raise expectations, saying last week that Saudi Arabia and Russia could slash production by an astronomical 15 million barrels per day.\nThe big picture: Even if OPEC and Russia agree to cut production, and even if they are joined by other major producers, prices may not increase much in the near term. That's because of what's happening on the other side of the market equation - demand.\nDemand for crude oil is collapsing at an unprecedented rate because of the coronavirus, and there's not much Trump, Russian President Vladimir Putin, or Saudi Crown Prince Mohammed bin Salman can do about it.\nBut with expectations so high ahead of today's meeting, failure to clinch a deal could send prices the other direction.\n\"If OPEC and friends can't stick the landing,\" said Michael Tran, director of global energy strategy at RBC Capital Markets, \"it could be a very rough ride potentially back into the low-20s or even teens.\"\nDeficits, everywhere\nNeed more evidence that the coronavirus pandemic is turning the world upside down? Look no further than the UK government announcement on Thursday that the Bank of England will directly finance state spending on a temporary basis if funds can't be raised in debt markets.\nLike other major economies around the world, the United Kingdom has launched a massive rescue plan designed to help companies and workers through the pandemic. After years of austerity, the government is now spending at a prodigious rate and needs to finance those outlays.\nBritain intends to auction £45 billion ($56 billion) in government debt in April alone. That's the highest monthly total on record, according to the Institute for Fiscal Studies. What the government said Thursday is that the central bank will step in and buy those bonds if they can't be absorbed by debt markets.\nNow, this will only be done on a temporary basis. But monetary financing had been publicly opposed by the central bank in recent weeks, suggesting some real doubts had emerged over whether the United Kingdom was going to find buyers for all that debt.\nWhy does it matter? Central banks have been buying bonds in the secondary market for years via quantitative easing programs. But that's been done without such an explicit link between government spending plans and a commitment from the central bank to buy the resulting debt.\n\"In a world of fiat money, trust is key and so far investor faith in the institutional integrity of the system remains intact,\" said Andrew Mulliner, global bonds portfolio manager at Janus Henderson Investors.\n\"As bonds investors, any move to a more permanent form of direct financing of the government would be a greater concern. This move from the Bank of England is not that,\" he added.\nSome good news for Disney\nHere's some good news from a company that's been hit hard by the coronavirus: Disney said Wednesday that its new streaming service now has more than 50 million paid subscribers around the world.\nIf that sounds like a lot, it is. My colleague Frank Pallotta reports the company had projected that Disney+ would have have 60 million to 90 million global subscribers by 2024. But just five months after launch, the streaming service is already approaching the lower end of that target range.\nIn the past few weeks, the service launched in European countries including the United Kingdom, France and Germany. It also went live in India. Roughly 20 million paying subscribers have been added since February.\nThe success of the streaming service offers some relief to a company that's been forced to shutter its theme parks and delay many of its biggest films because of the pandemic. Disney-owned ESPN has had to scramble to figure out what to air after sports leagues suspended games and canceled events.\nDisney said last week that it would furlough employees \"whose jobs aren't necessary at this time\" starting on April 19.\nUp next\nThe United States will publish its latest report on initial jobless claims at 8:30 a.m. ET. The number of Americans seeking unemployment benefits is expected to remain near record highs.\nAlso today:\nUniversity of Michigan consumer sentiment report for April\nEurogroup finance ministers resume talks on potential stimulus\nComing tomorrow: US stock markets are closed for Good Friday.", "url": "https://www.cnn.com/2020/04/09/investing/premarket-stocks/index.html"}