{"authors": ["Tom Odula", "Mogomotsi Magome"], "date_download": "2020-05-04 20:06:11", "date_modify": "2020-05-04 20:06:11", "date_publish": "2020-04-06 15:52:31", "description": "NAIROBI, Kenya (AP) — Kenya increased its restrictions to combat the coronavirus on Monday, announcing travel bans into and out of the capital city, Nairobi, the port of Mombasa and two...", "filename": "_55663688a72f35284470fee4c3305ec2_1588622771.html", "image_url": "https://storage.googleapis.com/afs-prod/media/6db368e78a2e43bc9ee19c0d2d18bcbe/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_55663688a72f35284470fee4c3305ec2_1588622771.html", "title": "Kenya bans travel in and out of Nairobi to fight coronavirus", "title_page": "Kenya bans travel in and out of Nairobi to fight coronavirus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Kenya bans travel in and out of Nairobi to fight coronavirus\nPhoeswa, a South African traditional medicine pharmacist, waits for customers in the densely populated Alexandra township of Johannesburg, Monday April 6, 2020. More than half of Africa’s 54 countries have imposed lockdowns, curfews, travel bans or other restrictions to try to contain the spread of COVID-19. he new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Jerome Delay)\nPhoeswa, a South African traditional medicine pharmacist, waits for customers in the densely populated Alexandra township of Johannesburg, Monday April 6, 2020. More than half of Africa’s 54 countries have imposed lockdowns, curfews, travel bans or other restrictions to try to contain the spread of COVID-19. he new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Jerome Delay)\nNAIROBI, Kenya (AP) — Kenya increased its restrictions to combat the coronavirus on Monday, announcing travel bans into and out of the capital city, Nairobi, the port of Mombasa and two counties.\nForty-three of Africa’s 54 countries have closed their borders, according to the Africa Centers for Disease Control and Prevention. More than half of Africa’s 54 countries have imposed lockdowns, curfews, travel bans or other restrictions to try to contain the spread of COVID-19. Fifty-one of the continent’s countries report cases of the disease.\nIn Kenya, President Uhuru Kenyatta said all movement by rail, road and air in and out of the Nairobi metropolitan area will halt starting Monday at 7 p.m.\nMovement will also be halted in and out of Mombasa, Kenya’s second largest city, as well as Kilifi and Kwale counties on Kenya’s Indian Ocean coast starting Wednesday. The restrictions will last for an initial 21 days. Movement of food supplies and cargo will continue as normal, Kenyatta said.\nKenya already has a dusk-to-dawn curfew to contain the virus that has infected 158 people in the country, according to government statistics. Four people have died in Kenya from the disease.\nKenyatta said 82% of the confirmed cases came from Nairobi and 14% were reported from Kilifi, Kwale and Mombasa counties.\nThe East African nation of 50 million people has 578 intensive care beds.\nSouth Africa leads other African countries with 1,655 confirmed cases of COVID-19 and 11 deaths, and was among the first to impose travel restrictions as confirmed cases increased in the country and across Africa.\nThe country is in a strict three-week nationwide lockdown that started on March 27 and is set to last until April 17.\nA couple was arrested at their wedding over the weekend in Richards Bay in Kwazulu-Natal province for breaking the lockdown restrictions which ban gatherings including church services. Forty wedding guests and a pastor were also arrested for attending the ceremony, according to the police.\nA video of the couple being arrested and led into a police vehicle circulated on social media.\nIn the Western Cape province, which includes the city of Cape Town, police arrested a 33-year-old man who was allegedly part of a group that looted a liquor store in the city. Liquor sales are not allowed under South Africa’s lockdown, which also prohibits cigarette sales.\nSouth African President Cyril Ramaphosa, currently the chairman of the African Union, has rallied African leaders to unite in the fight against the spread of the coronavirus.\nRamaphosa on Monday lauded the recently announced African Union response fund, which has raised $12.5 million to help African countries fight the virus.\nThe fund is to help lessen critical shortages of personal protective equipment for medical staff that have been reported in several African countries in Africa as global demand for these increases and flight restrictions hamper delivery of aid and other necessary supplies.\nThe continental body would also channel an additional $4.5 million towards the Africa Centers for Disease Control, which is leading the fight against the virus on the continent.\nThe African Union fund is similar to the national fund Ramaphosa has established in South Africa.\nThe South Africa fund has already raised at least $150 million, which will be used to get medical and protective supplies, and support struggling small business and employees in distress due to the COVID-19 pandemic.\n“In uniting behind this global health emergency, as African countries we have shown once again our ability of transcend political and other differences in pursuit of a common objective,” Ramaphosa said in a statement. “We should seize this moment to deepen collaboration across other areas, such as development and trade.”\nIn Ivory Coast Monday, protesters in the commercial center Abidjan hampered the government’s effort to build an emergency coronavirus medical reception facility in the crowded Yopougon area. The rioters ransacked the site and destroyed equipment to be used to construct the center.\nPolice used tear gas to disperse the protesters, whose attacks began Sunday evening. Protesters said they are worried that a triage center would expose their community to COVID-19.\n“They should build their centers outside the town,” said Patrice Djedje, a Yopougon resident. “The whole world is fighting against the virus, and yet it’s here, in the middle of the city that they come and install their center.”\nAbidjan is Ivory Coast’s biggest city, with a population of about 4.5 million.\nLocal officials came to the site Monday to engage with the locals who are opposed to the center.\n“The president made the decision to protect the population, it’s for you,” said Abidjan prefect Vincent Toh Bi Irié. “Would a government install a center to infects its own people? It’s not possible.”\nIvory Coast registered its first case of COVID-19 on March 11. As of Sunday, the country had 261 cases, including 3 deaths and 37 recoveries, according to health officials. Abidjan has been cut off from the rest of the country, with a curfew imposed.\n___\nAP journalist Hilaire Zon in Abidjan, Ivory Coast contributed to this story.", "url": "https://apnews.com/55663688a72f35284470fee4c3305ec2"}