{"authors": ["Jacqueline Howard"], "date_download": "2020-05-04 16:24:37", "date_modify": "2020-05-04 16:24:37", "date_publish": "2020-04-06 22:51:14", "description": "Health experts are warning that the national count of Covid-19 deaths in the United States could be underestimated as the coronavirus pandemic continues to spread.", "filename": "2020_04_06_health_us-coronavirus-death-count-cdc-explainer_index_1588609477.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404195507-03-coronavirus-deaths-new-york-0404-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_health_us-coronavirus-death-count-cdc-explainer_index_1588609477.html", "title": "US coronavirus death count likely an underestimate. Here's why", "title_page": "Covid-19 death count in the United States is likely an underestimate. Here's why. - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Health experts are warning the national count of Covid-19 deaths in the United States could be underestimated as the coronavirus pandemic continues to spread.\nThis could be especially true because the reporting data can lag by an average of one to two weeks, according to the latest guidance from the US Centers for Disease Control and Prevention's\nAlso, deaths due to Covid-19 \"may be misclassified as pneumonia deaths in the absence of positive test results, and pneumonia may appear on death certificates as a comorbid condition,\" the CDC noted, adding that \"analyses to better understand and quantify reporting delays\" for Covid-19 deaths and \"related causes\" are underway. In March, the CDC introduced a new code to accurately capture mortality due to Covid-19 on death certificates.\nWith that code, the CDC noted that Covid-19 \"should be reported on the death certificate for all decedents where the disease caused or is assumed to have caused or contributed to death.\"\n'What we are seeing is a tip of an iceberg'\nWhen it comes to an accurate count of Covid-19 deaths in the US, \"we really are just seeing the tip of the iceberg and a lot of it has to do with the tests we have available,\" Dr. Panagis Galiatsatos, a pulmonary and critical care physician on the front lines at Johns Hopkins Medicine in Baltimore, said Monday morning.\nJUST WATCHED Why the US is behind in Covid-19 testing Replay More Videos ... MUST WATCH Why the US is behind in Covid-19 testing 03:48\nThe most commonly used Covid-19 test requires a nasal swab, which has led to some false negatives, Galiatsatos said, explaining that he believes a blood test is a more accurate means of detecting the coronavirus. He also said that such blood tests are already performed to diagnose other viral infections such as HIV, cytomegalovirus and hepatitis C.\n\"A better test would be a blood test to measure any protein particles of the virus in your bloodstream, as well as an antibody response,\" Galiatsatos said. \"I do think what we are seeing is a tip of an iceberg, and the numerator and denominator are truly disconnected.\"\nThe CDC said Monday it is preparing to use a blood test to survey whether people in the United States have antibodies from the novel coronavirus, according to a statement from CDC spokesperson Kristen Nordlund.\nThe tests have already been used to monitor immune responses in several coronavirus contact investigations, and they'll be deployed in coming weeks \"to further identify individuals who, due to mild infection, may have not known they were infected with SARS-CoV-2 and to monitor immunity in recovered individuals,\" Nordlund said.\nLast week, The US Food and Drug Administration issued its first emergency use authorization for a coronavirus test that looks for antibodies in the blood. Unlike most coronavirus tests, which generally require a swab and look for signs of the virus itself, antibody tests look instead for the body's response to a virus.\nThat type of test, called a serology test, would be able to identify past coronavirus infections, although it may be less effective at identifying recent ones.\nThe authorized test, from a manufacturer called Cellex Inc., requires blood to be collected through a vein, and the test itself can only be performed in a certified lab.\nBecause antibodies can take time to develop, the FDA has previously warned against using antibody tests to definitively diagnose coronavirus.\nBut in issuing what is known as an Emergency Use Authorization for the new test, the FDA signaled that the benefits of using the new blood test outweighed the risks.\n'There will be a lot of death'\nInternational leaders have long suspected Covid-19 cases and deaths have been undercounted because so many possible cases remain untested.\nJUST WATCHED Here's how the novel coronavirus outbreak unfolded Replay More Videos ... MUST WATCH Here's how the novel coronavirus outbreak unfolded 02:39\nGlobally, \"in countries with poor testing there may be a huge margin between confirmed cases and cases unidentified or not tested. It may be greater by several factors,\" Dr. Bharat Pankhania, a senior clinical lecturer at the University of Exeter Medical School in the United Kingdom, said in a statement distributed by the UK-based Science Media Centre on Friday.\n\"The new virus is doing what has been expected of it to do,\" Pankhania said in the statement. \"It is highly transmissible, infectious and disease-causing, thus we can expect continued major global disruption lasting for a very long time and it is better to say so now, rather than to say, it will all be over in a few months. There are no indicators which direct us to believe this pandemic is going to be over in a few months.\"\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nIn the US, President Donald Trump warned over the weekend that \"there will be a lot of deaths\" in the coming weeks.\n\"This will be probably the toughest week between this week and next week,\" the President said at a White House briefing Saturday. \"And there will be a lot of death, unfortunately. But a lot less death than if this wasn't done,\" he said, referring to certain mitigation tactics, such as social distancing and stay-at-home orders.", "url": "https://www.cnn.com/2020/04/06/health/us-coronavirus-death-count-cdc-explainer/index.html"}