{"authors": ["Gary D. Robertson"], "date_download": "2020-05-04 20:26:27", "date_modify": "2020-05-04 20:26:27", "date_publish": "2020-04-15 16:47:19", "description": "RALEIGH, N.C. (AP) — The threat of hand-to-hand contamination from the new coronavirus while voting entered arguments in a lawsuit seeking to stop the use of touch-screen ballot-marking machines...", "filename": "_44c6c833a9d44cc33a0f12f23af538c9_1588623987.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_44c6c833a9d44cc33a0f12f23af538c9_1588623987.html", "title": "N. Carolina lawsuit cites virus to stop touch-screen voting", "title_page": "N. Carolina lawsuit cites virus to stop touch-screen voting", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "RALEIGH, N.C. (AP) — The threat of hand-to-hand contamination from the new coronavirus while voting entered arguments in a lawsuit seeking to stop the use of touch-screen ballot-marking machines in North Carolina.\nLawyers for four North Carolina voters and the state NAACP largely cited constitutional concerns in the lawsuit announced Wednesday in asking that the equipment from the nation’s largest voting machine manufacturer be barred from future elections. About 20 of North Carolina’s 100 counties have the machines, used first in one way of another during last month’s primary elections.\nBut the plaintiffs also said using touch-screen machines are inherently hazardous to use during the COVID-19 crisis, because voters and poll workers are smudging screens with fingers and hands that could transmit the virus to unsuspecting people.\nCleaning the ExpressVote machines — created by Election Systems & Software and targeted in the lawsuit — after every vote, would create long lines at voting sites, the lawsuit said. An ES&S memo last month recommended poll workers should use lint-free cloths with isopropyl alcohol or prepared alcohol wipes to clean screens for at least 30 seconds to disinfect them.\n“COVID-19 can survive on plastic screens,” said John Powers, an attorney for the Lawyers’ Committee for Civil Rights Under Law, which is helping represent the plaintiffs. “There’s risk if this (cleaning) doesn’t happen right each time. Both poll workers and voters can get infected.”\nThe litigation, which Powers said was being mailed Wednesday to court, rather than filed in person, because of health concerns, also comes as states figure how to conduct high-stakes elections this fall should the new coronavirus persist. A hint of the challenges came last week with Wisconsin’s primary, marked by long lines at precincts and a massive of influx of mail-in ballots.\nConcerns over the use of touch-screen machines have intensified since hackers tried to access U.S. election systems in 2016. A study released in 2018 by the combined National Academies of Science, Engineering and Medicine urged that elections use human-readable paper ballots that people can inspect and recount.\nThe safety argument provides critics of these ES&S machines, who focus largely on security and hacking concerns, another line of attack.\n“Voters are essentially going to be forced to choose between their lives and their health and voting,” said Courtney Hostetler with the group Free Speech for People and another plaintiffs’ lawyer.\nOtherwise, the plaintiffs say the public can’t be confident that the names of the voters’ preferred candidates that the machine prints on the ballot will correspond with bar code data that’s also printed and tallied by a separate counting machine.\n“The ExpressVote is an insecure, unreliable, and unverifiable machine that threatens the integrity of North Carolina’s elections,” the lawsuit reads.\nFew if any problems related to actual machine operations were reported last month. In seven counties, including the one surrounding Charlotte, ExpressVote equipment is now the primary voting machine in election day precincts. Other counties use them for early in-person voting or for people with disabilities.\nVoters in other counties that use hand-marked paper ballots can feel confident that their choices will count, the lawsuit says in declaring the machines’ use violate equal protection and fair-election provisions in the North Carolina Constitution. The plaintiffs want a judge to permanently block state elections from being held with them and require paper ballots. The machines could be next used in a western North Carolina Republican congressional primary runoff in late June.\nAttorney General Josh Stein’s office, which represents the State Board of Elections — a defendant along with county election boards in the lawsuit — said it was reviewing the filing. Katina Granger, a spokeswoman for Nebraska-based ES&S, which is not a defendant, said the lawsuit includes false claims about company products that have been used succesfully across the country. “ES&S stands by the ExpressVote 100%,” she wrote.\nDavid Becker, head of the Center for Election Innovation & Research, said Wednesday that the lawsuit was “very disappointing” because it challenges machines that improve voter participation and can provide more accessibility than paper ballots.\nBecker, a former U.S. Justice Department voting rights attorney, said that although North Carolina will need to ramp up mail-in balloting this year, transactions at the polls with paper ballots as preferred in the lawsuit also carry risks for infection.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/44c6c833a9d44cc33a0f12f23af538c9"}