{"authors": ["Maegan Vazquez"], "date_download": "2020-05-04 17:03:00", "date_modify": "2020-05-04 17:03:00", "date_publish": "2020-04-10 20:03:56", "description": "President Donald Trump on Friday advised faith leaders to wait for the country to \"get healed\" from the coronavirus pandemic before holding services in person.", "filename": "2020_04_10_politics_donald-trump-easter-healing-coronavirus_index_1588611780.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410152722-03-wh-briefing-0410-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_donald-trump-easter-healing-coronavirus_index_1588611780.html", "title": "Trump tells faith leaders to let the country 'get healed' before holding in-person services", "title_page": "Trump tells faith leaders to let the country 'get healed' before holding in-person services - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump on Friday advised faith leaders to wait for the country to \"get healed\" from the coronavirus pandemic before holding services in person.\nTrump was asked by a reporter during the White House press briefing what his message was to pastors refusing to follow federal social distancing guidelines by holding services in person. In some cases, these services are expected to take place despite outright bans of such congregations.\n\"I know there are some pastors and ministers and others that want to get together. And I have great respect for them. Two of them I know. But I would say first, heal -- I'm a Christian -- heal our country,\" Trump said. \"Let's get healed before we do this and there's time to do that. We'll do it for, hopefully, the rest of our lives.\"\nThe President also said he would be watching Pastor Robert Jeffress' service online this Easter Sunday.\nBefore implementing an additional 30-day guidance to social distance, the President had said that he was hoping for churches to be packed by Easter Sunday . He later said that date was aspirational.\nRead More", "url": "https://www.cnn.com/2020/04/10/politics/donald-trump-easter-healing-coronavirus/index.html"}