{"authors": [], "date_download": "2020-05-04 20:29:05", "date_modify": "2020-05-04 20:29:05", "date_publish": "2020-04-20 22:01:39", "description": "CORPUS CHRISTI, Texas (AP) — A South Texas emergency room physician has chosen a novel place to self-isolate as he's treating patients with the novel coronavirus. Dr. Jason Barnes made a...", "filename": "_bfd671f13fecbc74c4081c387c26bada_1588624145.html", "image_url": "https://storage.googleapis.com/afs-prod/media/a834c53d5b1944b4b0ca4223443b3015/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bfd671f13fecbc74c4081c387c26bada_1588624145.html", "title": "South Texas ER doctor self-isolates in his kids' treehouse", "title_page": "South Texas ER doctor self-isolates in his kids' treehouse", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dr. Jason Barnes, top right, sits in his kids' treehouse while his family plays in their backyard Saturday, April 18, 2020, in Corpus Christi, Texas. Jenna Barnes, second from left, teaches their children the importance of social distancing and why their dad must self-quarantine in the backyard. (Annie Rice/Corpus Christi Caller-Times via AP)\nDr. Jason Barnes, top right, sits in his kids' treehouse while his family plays in their backyard Saturday, April 18, 2020, in Corpus Christi, Texas. Jenna Barnes, second from left, teaches their children the importance of social distancing and why their dad must self-quarantine in the backyard. (Annie Rice/Corpus Christi Caller-Times via AP)\nCORPUS CHRISTI, Texas (AP) — A South Texas emergency room physician has chosen a novel place to self-isolate as he’s treating patients with the novel coronavirus.\nDr. Jason Barnes made a temporary home of his children’s treehouse in the backyard of the family’s Corpus Christi home. He is among many health care workers who are leaving their homes or or taking other precautions to protect their families after being exposed to the virus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death.\nBarnes, a 39-year-old physician at Christus Spohn Hospital Beeville and Christus Spohn Hospital South in Corpus Christi, told the Corpus Christi Caller-Times that he has spent nearly three weeks in the cabin treehouse and often shouts down to his kids if he needs something — or sometimes walks up to the back picture window door of their home to make his request.\n“They’re within yelling distance,” Barnes said. “But I can call or go up to the glass. They know not to open the door and risk catching something.”\nOf course, this self-isolation means his two sons, ages 6 and 9, lose their playhouse.\n“They love that thing, but they understand, so they’re not missing the treehouse, per se,” Barnes said. “They tell me they miss me once a day.”", "url": "https://apnews.com/bfd671f13fecbc74c4081c387c26bada"}