{"authors": ["Trends Reporter"], "date_download": "2020-05-04 21:09:01", "date_modify": "2020-05-04 21:09:01", "date_publish": "2020-05-01 00:25:19", "description": "In the absence of humans, Dot the African penguin was able to pop over to the primate exhibit.", "filename": "entry_penguin-orangutan-san-diego-zoo_n_5eaa7624c5b62eaf043f1454_1588626541.html", "image_url": "https://img.huffingtonpost.com/asset/5eab5f2f30000030121553a3.png?cache=rdy2ojdoym&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_penguin-orangutan-san-diego-zoo_n_5eaa7624c5b62eaf043f1454_1588626541.html", "title": "Penguin Meets Up With Orangutan During Excursion In Empty San Diego Zoo", "title_page": "Penguin Meets Up With Orangutan During Excursion In Empty San Diego Zoo | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "When the people are away, the penguins will play.\nOr, in this case, make new friends. While visitors are absent from the San Diego Zoo because of coronavirus stay-at-home measures, zoo staff let penguins get out and about to explore. In footage published on Facebook over the weekend, viewers got to see Dot the African penguin waddle over for a meetup with a new orangutan pal at the primate exhibit.\nWith crowds suddenly gone, some animals ― like orangutans, who sit and people watch at the window; and penguins, who sometimes swim along with passersby ― have lost a source of enrichment, San Diego Zoo Global ambassador Rick Schwartz told People.\n“The penguin team decided to offer an additional training session with the orangutans to celebrate World Penguin Day and raise awareness for these warm-weather birds,” he said.\nHe noted that African penguins like Dot are facing major population declines ― a drop of more than 60% in the last 28 years ― making them one of the most endangered types of penguins.\nAnimals at other zoos have also had the opportunity to get out and explore amid the pandemic. Last month, rockhopper penguins at Chicago’s Shedd Aquarium made headlines with their adorable adventure around the facility.", "url": "https://www.huffpost.com/entry/penguin-orangutan-san-diego-zoo_n_5eaa7624c5b62eaf043f1454"}