{"authors": [], "date_download": "2020-05-04 16:16:40", "date_modify": "2020-05-04 16:16:40", "date_publish": "2020-04-03 20:09:56", "description": null, "filename": "2020_04_03_cnn-underscored_best-lounge-pants-outbrain-2_index_1588609000.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200317123400-comfypantslead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored_best-lounge-pants-outbrain-2_index_1588609000.html", "title": "The comfiest pants for lounging around the house", "title_page": "The comfiest pants for lounging around the house - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Whether you've been told to work from home for the next few weeks or you're choosing to self-quarantine to help reduce the spread of coronavirus, chances are high that you're about to spend a majority of your time at home. And at a time like this, comfort is key.\nWith the anxiety and distress you may be feeling, wearing clothes that are in any way uncomfortable is simply not an option. And what that means is that it's time to make sure you have a go-to pair (or pairs) of comfy pants for working and lounging around your home. To help you on this quest, we've rounded up some of our favorite super-comfy pants you can actually look forward to putting on every day. All of these picks are equipped to last from sitting at your desk waiting for a Zoom call, to your daily anxiety baking session, to lounging on your couch watching \"Jeopardy\" after work hours. Goodbye for now, constricting jeans and chinos.\nBaleaf Women's Active Yoga Sweatpants with Pockets (starting at $17.99; amazon.com)\nBaleaf Women's Active Yoga Sweatpants with Pockets\nThese pants can take you from at-home yoga to all-day WFH.\n_______________________________________________________________________________\nCRZ Yoga Women's Naked Feeling High Waist Tight Yoga Pants (starting at $24; amazon.com)\nCRZ Yoga Women's Naked Feeling High Waist Tight Yoga Pants\nA dupe of Lululemon's cult-favorite leggings that are so comfortable you feel like you're wearing nothing at all, these leggings are available in lots of different iterations, including one with pockets, a capri pant and even shorts.\n_______________________________________________________________________________\nPolo Ralph Lauren Waffle Knit Lounge Pants (starting at $24.80; amazon.com)\nPolo Ralph Lauren Waffle Knit Lounge Pants\nA boxier, more traditional sweatpant cut never goes out of style.\n_______________________________________________________________________________\nEberjey Heather Slouchy Lounge Pants ($55.20, originally $69; neimanmarcus.com)\nEberjey Heather Slouchy Lounge Pants\nThis slouchy pair is perfect for comfort cooking, eating and waist-up professional Zoom calls.\n_______________________________________________________________________________\nHanes Men's Solid Knit Sleep Pant (starting at $10.99; amazon.com)\nHanes Men's Solid Knit Sleep Pant\nYou can't discount the importance of a quality sweatpant that's less than $15.\n_______________________________________________________________________________\nDistance Jogger ($98; athleta.com)\nDistance Jogger\nA sleek, streamlined option that emanates tech CEO WFH energy.\n_______________________________________________________________________________\nHanes Women's EcoSmart Sweatpant (starting at $7.50; amazon.com)\nHanes Women's EcoSmart Sweatpant\nWith more than 6,000 reviews on Amazon, these sweats are beloved for their comfy waistband and wider legs that can take you from home to the grocery store to pick up the essentials.\n_______________________________________________________________________________\nUrban Moto Sweatpant ($98; aloyoga.com)\nUrban Moto Sweatpant\nThese are described as \"city-inspired,\" which means they're fit for wearing around the house, as well as a long walk through the neighborhood.\n_______________________________________________________________________________\nChampion Men's Closed Bottom Lightweight Jersey Sweatpant (starting at $13.50; amazon.com)\nChampion Men's Closed Bottom Lightweight Jersey Sweatpant\nFeaturing an elastic waist, these pants are made from lightweight jersey and boast some handy pockets.\n_______________________________________________________________________________\nFree People Movement Sunny Skinny Sweatpants ($48; nordstrom.com)\nFree People Movement Sunny Skinny Sweatpants\nA slimmer fit good for running, yoga or any active activity, really.\n_______________________________________________________________________________\nFeejays Adult Sweatpants ($39.98; amazon.com)\nFeejays Adult Sweatpants\nAn Underscored favorite, these ultra-plush, fleece-lined pants come with attached slippers that can go right over your feet or fold up and go unnoticed.\n_______________________________________________________________________________\nPJ Salvage Peachy Ribbed Lounge Pants ($32.40, originally $54; nordstrom.com)\nPJ Salvage Peachy Ribbed Lounge Pants\nAlmost like old-fashioned long underwear, these pants are all about comfort.\n_______________________________________________________________________________\nSweatyRocks Women's Drawstring Waist Active Pant with Pocket (starting at $14.99; amazon.com)\nSweatyRocks Women's Drawstring Waist Active Pant with Pocket\nFor some sweatpants with a bit of pizzazz, these come in a wide array of designs, from camouflage to velvet stripe to neon.\n_______________________________________________________________________________\nPolo Ralph Lauren Sleep Shorts ($24, originally $32; nordstrom.com)\nPolo Ralph Lauren Sleep Shorts\nIf you're in a warmer climate or tend to get hot inside, these shorts are perfect for hanging around or working on your laptop from the couch. They're also a Nordstrom favorite.\n_______________________________________________________________________________\nHanes Women's Jersey Shorts (starting at $6.90; amazon.com)\nHanes Women's Jersey Shorts\nThe same idea but for women, these shorts are made of a cooler jersey material and feature a drawstring waist.\n_______________________________________________________________________________\nStars Above Women's Beautifully Soft Fleece Jogger Pants ($19.99; target.com)\nStars Above Women's Beautifully Soft Fleece Jogger Pants\nBecause gray and black get a little tired after a while.\n_______________________________________________________________________________\nHoneydew Intimates Lazy Daze Jogger Pants ($54; lordandtaylor.com)\nHoneydew Intimates Lazy Daze Jogger Pants\nThe soft pink is sort of comforting, isn't it?\n_______________________________________________________________________________\nLeggings Depot Women's Jogger Track Cuff Sweatpants (starting at $8.99; amazon.com)\nLeggings Depot Women's Jogger Track Cuff Sweatpants\nSuper stretchy and buttery soft, these sweatpants have garnered more than 5,500 Amazon reviews and are available in every color of the rainbow, and then some.\n_______________________________________________________________________________\nPJ Salvage Speckled Peachy Jogger Pants ($36, originally $60; neimanmarcus.com)\nPJ Salvage Speckled Peachy Jogger Pants\nMade of soft jersey material and featuring deep pockets, these may be the joggers you own forever.\n_______________________________________________________________________________\nWomen's Sonoma Goods For Life Essential Sleep Pants ($16.99, originally $30; kohls.com)\nWomen's Sonoma Goods For Life Essential Sleep Pants\nSuch a bargain, you can get a couple of pairs for the long haul.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/best-lounge-pants-outbrain-2/index.html"}