{"authors": ["Senior Wellness Editor"], "date_download": "2020-05-04 20:20:22", "date_modify": "2020-05-04 20:20:22", "date_publish": "2020-04-28 16:23:32", "description": "Headaches, chills, loss of taste or smell have joined the list after being repeatedly observed in coronavirus patients.", "filename": "entry_cdc-adds-new-symptoms-to-covid-19-list_l_5ea8302dc5b6ab20b1532031_1588623622.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8473b2500002a10eb07d2.jpeg?cache=F0MaRYng1C&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_cdc-adds-new-symptoms-to-covid-19-list_l_5ea8302dc5b6ab20b1532031_1588623622.html", "title": "CDC Adds 6 New Health Issues To Official List Of COVID-19 Symptoms", "title_page": "CDC Adds 6 New Health Issues To Official List Of COVID-19 Symptoms | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "The Centers for Disease Control and Prevention added six health issues to its official list of COVID-19 symptoms after seeing them repeatedly show up in patients during the pandemic.\nThe symptoms, which can appear two to 14 days after exposure to someone with the novel coronavirus, are loss of taste or smell, chills, shaking with chills, muscle pains or aches, sore throat and headache. They join the list of three other major symptoms, according to the CDC: shortness of breath, cough and fever.\nThe CDC noted that not all of the symptoms need to be present to be infected with COVID-19, the disease caused by the coronavirus. A person could have the virus if they display a combination of them.\nA recent small study from China on COVID-19 patients also found neurological symptoms, like headaches and nerve pain, were prevalent in many individuals infected with the virus.\nResearchers are still learning about the novel coronavirus and how it affects our bodies, both immediately and long-term. As time passes, more symptoms could be added to the official list and other complications from COVID-19 will likely be discovered.\nMaryviolet via Getty Images\nWhat to do if you’re experiencing coronavirus symptoms\nIf you feel like you have coronavirus but feel well enough to stay home, it’s best to do so. Isolate yourself from others in your household and call your doctor.\nMost health care professionals will do telemedicine appointments or, at the least, chat with you over the phone. It’s important to let them know what’s going on so they can help you monitor your symptoms and advise you on the best course of care. Your physician may recommend that you take Tylenol for any fever, or some other over-the-counter medications tailored to your symptoms.\nYou should seek immediate medical attention if you have trouble breathing, persistent pressure or pain in your chest, new confusion, an inability to arouse or move, or bluish lips or face. If you call 911 with a medical emergency, the CDC advised that you should notify the operator that you think you might have COVID-19 and to put on a face covering before help arrives, if you can.\nBottom line, it’s better to communicate than to ride out the disease in silence. If any of your symptoms are bothering or concerning you ― even if you believe them to be mild ― it’s worth consulting a doctor.\nPrecautions you should take even if you don’t have COVID-19 symptoms\nAt this point, you should behave as if you’ve already been exposed to or have coronavirus, even if you aren’t experiencing any of the symptoms outlined by the CDC. Reports suggest that as many as two-thirds of COVID-19 cases can occur through stealth transmission ― an asymptomatic individual passing the disease along to someone else.\nYou should practice strict social distancing, maintaining at least six feet of space from others and limiting the amount of time you spend in stores or other places with people. The major mode of COVID-19 transmission is through respiratory droplets, so keeping space between yourself and others is the best way to decrease the potential for contact.\nThe CDC also recommends wearing a face mask when you leave the house if you live in hard-hit areas. Everyone should also continue to exercise good hygiene. Disinfect all high-touch surfaces in your house, cover your nose and mouth if you sneeze or cough, wash your hands frequently with warm soap and water and avoid touching your face.\nCorrection: A previous version of this story stated Chris Cuomo lost his sense of taste and smell instead of his wife, Christina Cuomo.\nExperts are still learning about the novel coronavirus. The information in this story is what was known or available as of press time, but its guidance around COVID-19 could change as scientists discover more about the virus. Please check the Centers for Disease Control and Prevention for the most updated recommendations.", "url": "https://www.huffpost.com/entry/cdc-adds-new-symptoms-to-covid-19-list_l_5ea8302dc5b6ab20b1532031"}