{"authors": ["Reporter"], "date_download": "2020-05-04 20:17:53", "date_modify": "2020-05-04 20:17:53", "date_publish": "2020-04-29 09:55:11", "description": "The House speaker has another way of sending a message to the president.", "filename": "entry_nancy-pelosi-donald-trump-coronavirus-phone-call_n_5ea935d6c5b6106b8ecfa440_1588623473.html", "image_url": "https://img.huffingtonpost.com/asset/5ea937742200006f0c827d74.jpeg?cache=tl56y8xgcg&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_nancy-pelosi-donald-trump-coronavirus-phone-call_n_5ea935d6c5b6106b8ecfa440_1588623473.html", "title": "Nancy Pelosi Reveals Why It's Not Worth Phoning Trump During Coronavirus Pandemic", "title_page": "Nancy Pelosi Reveals Why It's Not Worth Phoning Trump During Coronavirus Pandemic | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "House Speaker Nancy Pelosi (D-Calif.) said she doesn’t plan on picking up the telephone to call President Donald Trump about the coronavirus pandemic anytime soon.\nPelosi on Tuesday told MSNBC’s Nicolle Wallace that her time is better spent talking about the public health crisis that’s killed almost 60,000 people nationwide “in a public forum” because “that’s something he pays attention to.”\nWallace asked Pelosi if she thought it was “worth being the one who picks up the phone” to call Trump to talk about ways to move forward amid the pandemic. The relationship between the pair has been increasingly strained ever since the Democratic-controlled House’s impeachment of the president over the Ukraine scandal. Trump was later acquitted by the GOP-controlled Senate.\n“Well, let me say ‘worth.’ What is the word ‘worth’? Would it change his behavior?” Pelosi responded.\n“Has he ever said anything in our meetings that we’ve had about Dreamers, that he was going to get the job done and then he changed his mind, what he said about infrastructure and then he changed his mind, what he said about guns and then he changed his mind?” Pelosi said.\nShe added that “time is the most finite quantity that we all have.”\nCheck out the clip here:\nDoes @SpeakerPelosi think it's worth picking up the phone to call the president? She tells @NicolleDWallace it's not.\n\"Would it change his behavior?... Time is the most finite quantity that we all have. My time is better spent speaking to this president in a public forum.\" pic.twitter.com/W3pbu20IWq — Deadline White House (@DeadlineWH) April 28, 2020", "url": "https://www.huffpost.com/entry/nancy-pelosi-donald-trump-coronavirus-phone-call_n_5ea935d6c5b6106b8ecfa440"}