{"authors": ["Analysis Brandon Tensley"], "date_download": "2020-05-04 16:23:57", "date_modify": "2020-05-04 16:23:57", "date_publish": "2020-04-06 18:51:08", "description": "In March, Madonna posted (and then deleted) a video of herself in a milk bath dusted with rose petals calling the global coronavirus pandemic the \"great equalizer.\"", "filename": "2020_04_06_politics_coronavirus-equalizer-myth-race-income_index_1588609437.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331121549-01-coronavirus-vacation-town-lockdowns-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_coronavirus-equalizer-myth-race-income_index_1588609437.html", "title": "How coronavirus is deepening American inequality", "title_page": "How coronavirus is deepening American inequality - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) In March, Madonna posted (and then deleted) a video of herself in a milk bath dusted with rose petals calling the global coronavirus pandemic the \"great equalizer.\"\nFast-forward just a couple weeks, and that already disturbing way of thinking -- shared by a number of the rich and famous self-isolating while surrounded by opulence -- registers as downright unintelligible: It's abundantly clear that the virus is only deepening inequality in America.\nA scan of the unemployment numbers -- in the week ending on March 28, first-time unemployment claims skyrocketed to a record 6.6 million , as businesses continued to shutter in an effort to curb the virus' spread -- shows that people of color are disproportionately affected by the waves of job loss because more hold service-industry or otherwise \"expendable\" jobs.\nCrucially, for many of these Americans, unemployment means more than the loss of a job -- it means the loss of employer-provided health insurance, too. This situation leaves them in vulnerable positions should they need to seek out testing or treatment for Covid-19, the disease caused by the virus.\nA group of Democratic lawmakers -- including Massachusetts Rep. Ayanna Pressley and Massachusetts Sen. Elizabeth Warren -- recently sent a letter to Health and Human Services Secretary Alex Azar calling for race-inclusive data in testing.\n\"Any attempt to contain Covid-19 in the United States will have to address its potential spread in low-income communities of color, first and foremost to protect the lives of people in those communities, but also to slow the spread of the virus in the country as a whole,\" they wrote.\nIt makes sense that racial gaps in equality are being emphasized. After all, thanks to years of discriminatory policy, people of color tend to suffer from poverty negative underlying health conditions , and poor housing environments at higher rates than their white counterparts. These interacting variables can make the virus' impact particularly acute, and fuel its transmission. (And this is to say nothing of the phenomenon of the well-off fleeing cities for the comforts of hideaways elsewhere.)\n\"Decades of structural racism have prevented so many black and brown families from accessing quality health care, affordable housing and financial security, and the coronavirus crisis is blowing these disparities wide open,\" Warren said in a statement\nThese inauspicious comments track with recent numbers.\nIt's early days yet; society is still muddling through all the uncertainties of the evolving crisis. But it isn't too soon to say that the pandemic isn't the \"great equalizer\" but rather the precise opposite -- the sort of cataclysmic event that's bolstering hierarchies anew.", "url": "https://www.cnn.com/2020/04/06/politics/coronavirus-equalizer-myth-race-income/index.html"}