{"authors": ["Tami Luhby"], "date_download": "2020-05-04 16:17:15", "date_modify": "2020-05-04 16:17:15", "date_publish": "2020-03-31 12:12:19", "description": "More people in need. Less food being donated. And volunteers staying home.", "filename": "2020_03_31_politics_food-ba_15b61f35395859bb118aaa4d07933f1d_index_1588609035.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330121951-04-food-banks-groceries-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_politics_food-ba_15b61f35395859bb118aaa4d07933f1d_index_1588609035.html", "title": "Food banks struggle as demand explodes thanks to coronavirus layoffs", "title_page": "Food banks struggle as demand explodes thanks to coronavirus layoffs - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) More people in need. Less food being donated. And volunteers staying home.\nFood banks across the nation are facing a perfect storm as they try to help the growing number of hungry Americans amid the coronavirus pandemic\nMillions of people newly unemployed mean food banks, food pantries and soup kitchens are seeing a flood of new clients appearing at their doors, just as supplies are dwindling because of growing demand from consumers stuck at home.\nFood banks are reporting a 40% increase in demand, on average, said Katie Fitzgerald, chief operating office at Feeding America, a network of 200 food banks and 60,000 food pantries and meal programs nationwide. Some say they are seeing double to quadruple the number of people asking for help.\n\"It's the speed that this is hitting us that is making it so difficult to contend with,\" Fitzgerald said. \"The current inventories that we have in place were not designed to serve the numbers of people who need help now.\"\nSecond Harvest Food Bank of Central Florida is seeing a spike in demand and drop in donations.\nFeeding America depends on getting 1.4 billion meals a year in donations from retailers, such as Walmart and supermarkets . That channel has seen a \"significant and fast plummet\" in deliveries recently because of consumer demand in stores and supply chain constraints , Fitzgerald said. Its donations from food manufacturers, which total about 580 million meals, also have dropped by about half this month.\nThat's forcing Feeding America to purchase supplies from food manufacturers and distributors, but those deliveries can take up to four weeks to arrive at the food banks in its network.\n\"Food banks could very well get so low on their inventories that they would not have enough food to distribute,\" she said.\nOn top of all that, food banks rely on about 2 million volunteers -- many of them senior citizens who are particularly vulnerable to coronavirus -- to help pack and distribute the food. Many of these folks are staying home, which makes it even tougher for food banks to handle the crush of new clients, Fitzgerald said.\nThe number of volunteers working at Los Angeles Regional Food Bank initially dropped dramatically, in part because the non-profit is following social distancing guidelines for volunteers to stay six feet apart, and in part because many normal volunteers are staying home, said CEO Michael Flood. But so far, it has had enough volunteers to keep operations going, even if the pace is slower.\n\"Usually volunteers come in and it's like a little beehive of activity -- assembly line and all that. So we've like completely changed that to follow these health guidelines,\" Flood said. \"That slows down efficiency. That slows down production. It's kind of really changed things pretty significantly.\"\nSecond Harvest Food Bank of Central Florida distributed 700 boxes of food Saturday but had to turn away more than 100 cars.\nSome food pantries are even having to close their doors because they don't have enough volunteers or they can't get enough cleaning supplies to keep everyone safe amid the pandemic.\nAbout 55 of the 550 feeding programs that Second Harvest Food Bank of Central Florida serves have temporarily shut down in part because of a shortage of volunteers, said Dave Krepcho, the food bank's CEO. He expects more to do the same.\nThis comes at a time when the number of Floridians searching for food assistance has skyrocketed. Second Harvest's interactive map showing food locations now gets 1,200 clicks a day, up from 35 prior to the pandemic.\nThe number of meals that the Orlando-based food bank is distributing has doubled to 280,000 a day. But donations from local retailers have fallen to almost zero, forcing Second Harvest to purchase $350,000 of groceries instead of a more typical $85,000 for a three-week supply, Krepcho said.\nHe is awaiting an infusion of supplies from The Emergency Food Assistance Program, a federal program that just received $850 million in additional funding in the last two congressional rescue packages. It can't come quickly enough, he said.\n\"My concern is that we will see food and funding dwindle,\" said Krepcho, adding that some pantries already have to turn away Floridians in need. \"The level of service would diminish considerably. That means tens of thousands of people in our community will literally not have food to eat.\"\nTo safely accommodate the increased demand in the era of social distancing, food banks have been setting up drive-through locations, where staff and volunteers can just drop a box of groceries in someone's trunk or back seat.\nCars lined up to receive groceries from the Greater Pittsburgh Community Food Bank on Monday.\nThe Greater Pittsburgh Community Food Bank provided food to about 4,000 vehicles at three recent events, but had to turn hundreds away. Traffic was backed up for miles, said Lisa Scales, the agency's CEO.\nOn Monday, 40 cars had already lined up by 9 am ET, even though distribution didn't start until noon. More than 800 vehicles ended up receiving boxes of groceries.\nThe food bank is hoping to hold two or three of these events a week, in addition to serving its 500 pantries, soup kitchens and other meal programs in southwest Pennsylvania.\n\"There's a lot of fear in the community,\" Scales said. \"They are concerned about being able to make ends meet. They don't know how long they will be without work.\"", "url": "https://www.cnn.com/2020/03/31/politics/food-banks-supplies-groceries-coronavirus/index.html"}