{"authors": ["Alex Chaet"], "date_download": "2020-05-04 16:14:18", "date_modify": "2020-05-04 16:14:18", "date_publish": "2020-04-03 13:39:38", "description": "A popular penguin returns to the news, a celebrity shows off his quarantine dance moves, and a recipe for a new drink lands just in time. These are the must-watch videos of the week.", "filename": "2020_04_03_app-news-section_8cf7179d018918b803d3a3d403b33bb6_index_1588608858.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401165532-ina-garten-cocktail-cosmo-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_app-news-section_8cf7179d018918b803d3a3d403b33bb6_index_1588608858.html", "title": "Must-watch videos of the week", "title_page": "Must-watch videos of the week - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A popular penguin returns to the news, a celebrity shows off his quarantine dance moves, and a recipe for a new drink lands just in time. These are the must-watch videos of the week.\nMarch of the penguin\nJUST WATCHED Watch penguin visit beluga whales in aquarium Replay More Videos ... MUST WATCH Watch penguin visit beluga whales in aquarium 01:07\nIf you're an animal lover, you may recall Wellington, the penguin, who captured the internet's heart after roaming around Chicago's Shedd Aquarium. Watch him in the charming video above as he visits the beluga whales on his new journey. The aquarium has been closed to visitors due to the coronavirus outbreak.\nA giant cocktail, for one\nJUST WATCHED Ina Garten makes a giant cocktail for one Replay More Videos ... MUST WATCH Ina Garten makes a giant cocktail for one 00:49\nLooking for a new drink idea to try while you're at home? Barefoot Contessa's Ina Garten has your back. The author and television personality demonstrates the best way to make a giant cosmopolitan for yourself.\nRead More", "url": "https://www.cnn.com/2020/04/03/app-news-section/videos-of-the-week-mobile-april-3/index.html"}