{"authors": ["Martha Bellisle"], "date_download": "2020-05-04 20:05:28", "date_modify": "2020-05-04 20:05:28", "date_publish": "2020-04-09 14:52:45", "description": "SEATTLE (AP) — Inmates at a Washington state prison staged a large protest following new coronavirus diagnoses at the facility and health officials say they continue to see high numbers of cases...", "filename": "_ca6fc44619b6259ab620ce6b65702132_1588622728.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9325a5d3061d42779674cd8df6fa4a65/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ca6fc44619b6259ab620ce6b65702132_1588622728.html", "title": "Virus sparks prison riot, hits more WA long-term care homes", "title_page": "Virus sparks prison riot, hits more WA long-term care homes", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Customers wear a variety of protective masks as they wait some six-feet apart to enter a Trader Joe's store, where the number of customers allowed inside at any one time was limited because of the coronavirus outbreak, Wednesday, April 8, 2020, in Seattle. (AP Photo/Elaine Thompson)\nCustomers wear a variety of protective masks as they wait some six-feet apart to enter a Trader Joe's store, where the number of customers allowed inside at any one time was limited because of the coronavirus outbreak, Wednesday, April 8, 2020, in Seattle. (AP Photo/Elaine Thompson)\nSEATTLE (AP) — Inmates at a Washington state prison staged a large protest following new coronavirus diagnoses at the facility and health officials say they continue to see high numbers of cases in the state’s long-term care facilities.\nMore than 9,600 people have tested positive for COVID-19 and at least 446 have died, according to the Department of Health.\nState Health Officer Dr. Kathy Lofy said there are signs that the state has begun to “flatten the curve” but said people should continue to stay home and keep their distance from others.\n“We are no where near being out of the woods here,” said Secretary of Health John Wiesman. “This virus can easily spring back.”\nLofy said as of April 5 authorities had identified the virus in 126 of long-term care facilities. Washington’s first large coronavirus outbreak was at the Life Care Center in Kirkland, Washington, which has been linked to dozens of deaths.\nInmates at the Monroe Correctional Complex held a demonstration on Wednesday night after six inmates tested positive at the prison, according to the Washington State Department of Corrections. The latest two cases at the facility that can house up to 2,500 inmates were men aged 68 and 28.\nCorrections officers used verbal orders, pepper spray and rubber pellets to get the demonstrators under control, but the inmates ignored those efforts, officials said. Both housing units were evacuated and the situation was under control soon afterward. No one was injured.\nThe six men who tested positive were transferred to an isolation unit, where the health care team provided monitoring and support. Corrections officials are conducting an internal investigation.\nFive correctional staff members have also tested positive.\nGov. Jay Inslee said Thursday that he recognizes the concerns inmates and their families have about the virus inside correctional facilities, and is trying to balance inmate needs with public safety.\n“DOC has been working closely with the Department of Health to implement strategies around testing, social distancing, quarantine, isolation and other practices to prevent the spread of this virus,” he said.\nA handful of inmates at the Monroe facility are asking the state Supreme Court for help. They previously filed a petition asking the court to order Inslee and corrections Secretary Steve Sinclair to immediately release inmates over the age 50, those with underlying medical conditions and inmates who are within 18 months of their release date.\nOn Thursday, they filed an emergency motion, asking the court to immediately act on their requests and test everyone who’s being held at the prison.\n“It appears that DOC may be using a show of force rather than take other more appropriate public health measures to resolve the legitimate concerns of people trapped in MCC-MSU,” their motion said. “People living in MCC-MSU are scared and not being appropriately protected.”\nThe Washington Supreme Court responded to the emergency motion Thursday with a letter saying the state must respond to the motion by 9 a.m. Friday.\nInslee and Sinclair held a press conference Thursday afternoon to discuss the way the state is handing the prison system as the COVID-19 continues to grow.\nCorrections officials are screening all people in the prison system for symptoms and they stopped visitations weeks ago, Sinclair said. They’re also working to release some non-violent offenders who are within 60 days of their release, he said.\nInslee said that group of offenders would include people who are over 60 and have underlying health conditions that make them more vulnerable to a negative outcome should they contract the disease.\nSinclair said they were following the health department’s guidelines on testing for COVID-19, and are only testing people who have symptoms. He later said that they have had six inmates test positive and they are awaiting results on 54 other cases.\nTwo residents at the Spokane Veterans Home tested positive for the disease and one of those residents died on Wednesday, officials said. The residents were roommates and were isolated when their symptoms appeared.\nThe resident had been on end of life care for some time and had underlying medical conditions, officials said. The other resident who tested positive remained at the facility and symptoms have lessened, officials said.\n“I want to say how incredibly grateful I am to the staff at the Spokane Veterans Home, who are coming to work each day to serve our veterans and their families,” said Patrick McNabb, administrator of the Spokane Veterans Home.\nState health officials continue to distribute personal protective equipment to front-line workers across the state, Wiesman said. As of March 16, they had shipped 2.2 million items to health care providers, including N95 masks, surgical masks, gloves, gowns and face shields.\nThey have 3.8 million items that are being processed for shipment, he said. Hospitals, EMS workers and long-term care facilities that are handling positive cases are getting top priority for these supplies, he said.\nMost people with the virus experience mild or moderate fever and coughing for two to three weeks. Some, especially older adults and people with existing health problems, can face severe illness including pneumonia and death.", "url": "https://apnews.com/ca6fc44619b6259ab620ce6b65702132"}