{"authors": ["Stephen Groves"], "date_download": "2020-05-04 20:09:55", "date_modify": "2020-05-04 20:09:55", "date_publish": "2020-04-07 21:26:13", "description": "SIOUX FALLS, S.D. (AP) — South Dakota Gov. Kristi Noem on Tuesday said the stronger executive orders she issued this week are necessary to delay a surge in hospitalizations from the coronavirus,...", "filename": "_ec07b76b95d4ea76652533f8a91a5626_1588622995.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ec07b76b95d4ea76652533f8a91a5626_1588622995.html", "title": "Noem: Stronger orders necessary to delay hospital surge", "title_page": "Noem: Stronger orders necessary to delay hospital surge", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SIOUX FALLS, S.D. (AP) — South Dakota Gov. Kristi Noem on Tuesday said the stronger executive orders she issued this week are necessary to delay a surge in hospitalizations from the coronavirus, but that a lock down on daily life is still not needed.\nThe governor has resisted issuing a statewide order to stay home or close non-essential businesses, despite calls from mayors and groups representing health care workers that she take more action.\nIn a daily briefing, the Republican governor said she would continue to intensify restrictions when it is “appropriate,” but for now urged people to follow the executive orders she issued Monday. One order tells businesses to limit group sizes, while the other directs people in the hardest-hit area of the state to stay home if they are over 65 or have chronic health problems.\nHer stay-at-home order only applies to people in Minnehaha and Lincoln counties, which account for over half of the confirmed cases in the state.\nHealth officials reported two new deaths from the coronavirus on Tuesday, along with 32 new confirmed cases. The total number of people who have tested positive rose to 320, and six people have died.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. Older adults and people with existing health problems are among those particularly susceptible to more severe illness, including pneumonia.\nNoem has projected coronavirus infections will peak in the state in June, operating under the assumption that up to 70% of people could become infected while the disease runs its course. She believes hospitals will need to care for 5,000 COVID-19 patients by the peak.\nThe governor said hospitals are looking at alternative sites where they could care for COVID-19 patients.\nNoem also proclaimed Wednesday a day of prayer, noting this week’s significance for Christian and Jewish faiths.\n“Another weapon that we have, that many of us during this week of Holy Week rely on, is the power of prayer,” she said.\nNoem is a devout Christian and issued similar proclamations during her first year as governor — in response to flooding last spring, on the National Day of Prayer and in protest to abortion.", "url": "https://apnews.com/ec07b76b95d4ea76652533f8a91a5626"}