{"authors": ["Analysis Stephen Collinson"], "date_download": "2020-05-04 17:01:25", "date_modify": "2020-05-04 17:01:25", "date_publish": "2020-04-10 04:12:44", "description": "President Donald Trump says America does not need and will never have mass coronavirus testing, despite warnings by experts that a comprehensive program is vital to getting life back to normal.", "filename": "2020_04_10_politics_donald-trump-testing-economy-coronavirus_index_1588611685.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409183935-02-coronavirus-briefing-0409-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_donald-trump-testing-economy-coronavirus_index_1588611685.html", "title": "Lack of coronavirus testing may blunt Trump's planned economic revival", "title_page": "Trump's planned economic revival may be blunted by lack of coronavirus testing  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump says America does not need and will never have mass coronavirus testing , despite warnings by experts that a comprehensive program is vital to getting life back to normal.\nThe inadequacy of testing for the virus has been a constant deficiency of the government's handling of the pandemic from the start. Fixing this deficiency, as well as creating antibody testing that can identify if someone has already had the disease and may be less apt to get it again, may be the key to effectively reopening the economy while preventing a second wave of infections. It could also help identify which workers can return to work, and those who still present a risk of infection.\nDr. Anthony Fauci told CNN on Friday that those antibody tests are coming \"within a period of a week or so\" and would be especially important \"for health care workers, for first-line fighters.\"\nBut the continued lack of a robust testing program, despite weeks of claims by Trump that the problem is fixed, is raising stark new questions about the White House's management of the situation. After being slow to recognize the extent of the pandemic, the testing shortfall means the administration is yet to prove it is capable of charting an effective path out of the crisis.\nThe new testing controversy came at the end of a grim week in which thousands of Americans have died from coronavirus. More than 462,000 Americans have now been infected and more than 16,000 have died. The human tragedy inherent in such figures is taking the edge of optimistic talk in the administration that the virus may have peaked in some US hotspots. A model often cited by the White House also this week reduced the total of Americans it believes could die from the disease to 60,000.\nMedical professionals and state and local leaders still say testing is not sufficiently widespread nor fast to trace the full penetration of the novel coronavirus in the community.\nFauci said Friday that while the novel coronavirus antibody tests being developed and validated could be available \"within a period of a week or so,\" to work to identify someone who had the virus recently, the current test used to diagnose coronavirus cases still would be needed to identify current coronavirus infection.\nMany people who get sick aren't tested unless they go to hospitals. Some Americans have died before it is even confirmed that they had the disease. Other countries -- such as South Korea and Germany that have succeeded in limiting the spread of the virus -- have conducted heavy testing. The President, whose leadership during these somber days is crucial to his reelection hopes , habitually shrugs off such questions.\nOn Thursday, he celebrated the two-millionth coronavirus test on US soil, after White House officials administered coronavirus tests to reporters who attended his briefing.\nAsked by CNN's Jim Acosta how the administration could contemplate reopening the economy without sufficient testing in place, Trump insisted the US system was \"the best in the world.\"\n\"There are certain sections in the country that are in phenomenal shape already, other sections are coming online, other sections are going down, and we, in addition to that, are giving out millions of tests every day,\" the President said.\n\"We're doing it exponentially, we're picking up, and what we'll be doing in the very near future is going to certain areas of our country and do massive testing. It's not necessary but it would be a good thing to have,\" he said.\nBut seconds later, the President however appeared to contradict his own comment that the administration would put in place \"massive testing\" in some areas of the country.\n\"We want to have it and we're going to see if we have it. Do you need it? No. Is it a nice thing to do? Yes,\" Trump said. \"We're talking about 325 million people and that's not going to happen, as you can imagine, and it would never happen with anyone else, either. Other countries do it but they do it in a limited form. We'll probably be the leader of the pack.\"\nThe comment was typical of the imprecision with which Trump, who takes the lead in daily coronavirus briefings, has handled complex medical questions and created mixed messages that sow confusion about the true state of the coronavirus mitigation effort.\nStill behind on testing\nWhile the United States has conducted more tests than any other country after a slow start, it still lags well behind several global counterparts in terms of per capita tests. And Trump's daily boasts about the gross volume of testing have long conflicted with the apparent reality in front line health care.\nFauci , the top US infectious disease specialist who serves on Trump's coronavirus task force, said on Wednesday that the US must ensure that it is not caught napping again on testing when the economy eventually opens up.\n\"The keys are to make sure that we have in place the things that were not in place in January,\" Fauci said on an American Medical Association webcast. He said the government would need the capacity to use robust testing for \"identification, isolation, contact tracing.\"\n\"There will be cases, we've got to be able to act on them in a very deliberate way that doesn't allow us to get into the situation we find ourselves right now,\" he added.\nNew CNN reporting on Thursday found multiple errors in the government testing system that squandered a critical month during which aggressive testing may have reduced the speed and scale of the pandemic as it took root on US soil. The administration failed to make early use of private labs, released a flawed test it took weeks to correct, and barred private labs from making their own tests.\nEric Feigl-Ding, an epidemiologist and health economist at Harvard Chan School of Public Health, told CNN that the disease was not first identified when it arrived in the country from Europe.\n\"It has been sitting under our nose undetected because we have no ability to sniff it out with no testing,\" he said.\nA month ago, the President said that \"anyone who wants a test can get a test.\" But that pledge is still nowhere near being fulfilled.\nAnd despite Trump's boasts of the world's best testing system, there remain serious problems in getting sufficient people tested for coronavirus, even those who have symptoms.\nTesting a 'huge problem'\nPhiladelphia Public Health Commissioner Thomas Farley said Thursday that a lack of testing kits meant the disease was still advancing unseen through US communities.\n\"Testing has been a huge problem with us from the beginning, it's still a problem for us,\" Farley said. \"It's a problem for us to have the data to know where this virus is moving. If we had more testing earlier on, we could have had an earlier warning sign and perhaps put in place smarter social distancing.\"\nDr. Dara Kass, an emergency physician in New York who has recovered from Covid-19, said she couldn't get a test to confirm that she is no longer infectious.\n\"The lack of widespread testing is probably the single biggest issue regarding us getting back to any sort of normalcy,\" Kass told CNN's Wolf Blitzer. \"We don't actually know who is infected. We don't know anything about our asymptotic carriers. And we don't know who is not infections anymore.\"\n\"We were told we would have unlimited capacity to test in America, but we don't,\" Kass said.\nVice President Mike Pence, who leads the coronavirus task force, declined to say in Thursday's briefing whether there are current sufficient tests available to begin opening the country.\nThe issue is becoming increasingly crucial given disastrous unemployment numbers on Thursday that show that more than 16 million people have been laid off in the economic shutdown imposed in a bid to check the spread of the virus.\n\"We are moving every day toward meeting that moment,\" Pence said.\nThe vice president also appeared to force a more comprehensive testing program eventually than suggested in the President's comments.\nHe said that the administration was aiming to put in place not just diagnostic testing, but surveillance testing \"so we can identify people that may have had it and may be immune versus people that we just need to know whether or not they were ever exposed or were not exposed.\"\nThis story has been updated to include Dr. Anthony Fauci's comments on Friday.", "url": "https://www.cnn.com/2020/04/10/politics/donald-trump-testing-economy-coronavirus/index.html"}