{"authors": ["Jeremy Herb", "Zachary Cohen", "Jason Hoffman"], "date_download": "2020-05-04 16:19:30", "date_modify": "2020-05-04 16:19:30", "date_publish": "2020-04-04 21:37:08", "description": "President Donald Trump on Saturday defended his firing of Michael Atkinson, the intelligence community inspector general who told Congress about the whistleblower complaint that led to his eventual impeachment, charging that Atkinson \"did a terrible job, absolutely terrible.\"", "filename": "2020_04_04_politics_trump-m_d86f8a3ab4c9093141ffc0d80d5c8eb1_index_1588609170.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191004101303-01-michael-atkinson-1004-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_politics_trump-m_d86f8a3ab4c9093141ffc0d80d5c8eb1_index_1588609170.html", "title": "Trump defends firing intelligence community watchdog", "title_page": "Trump defends firing Inspector General Michael Atkinson - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump on Saturday defended his firing of Michael Atkinson , the intelligence community inspector general who told Congress about the whistleblower complaint that led to his eventual impeachment, charging that Atkinson \"did a terrible job, absolutely terrible.\"\nTrump claimed that Atkinson \"took a fake report and gave it to Congress.\"\nAtkinson's firing is the latest case of the Trump administration removing officials who took part in the President's impeachment. Atkinson's dismissal comes in the midst of Trump's grappling with the coronavirus pandemic following his impeachment trial that ended in February.\nAtkinson came under fire from Trump and his allies because he notified Congress of the anonymous whistleblower complaint that alleged Trump sought dirt on former Vice President Joe Biden and withheld US security aid from Ukraine. Atkinson took the step under the inspector general statute when he determined that the complaint was credible.\nAtkinson's removal will take effect in 30 days, but he was placed on administrative leave Friday evening effective immediately. In the wake of his firing, he was praised by both Democrats and Republicans as a career, non-partisan intelligence official. Democrats slammed the President for enacting political retribution in the middle of a public health crisis. Several Republicans, such as Sens. Chuck Grassley of Iowa and Susan Collins of Maine, said the dismissal required more of an explanation from the White House.\n\"Congress has been crystal clear that written reasons must be given when IGs are removed for a lack of confidence. More details are needed from the administration,\" Grassley said in a statement.\nEarlier this year, Trump also removed Lt. Col. Alexander Vindman , a then-National Security Council official who had testified in the House's proceedings, along with Vindman's twin brother, both of whom were reassigned out of the NSC, and fired then-US Ambassador to the European Union Gordon Sondland.\nOn Saturday, Trump claimed that Atkinson took the whistleblower complaint to Congress without ever requesting to see the President.\n\"Why was he allowed to be, you call it fraudulent or incorrect, transcript, so we offered this IG -- I don't know him, I don't think I ever met him. I don't think I -- he never even came in to see me. How can you do that without seeing the person?\" Trump said. \"Never came in to see me, never requested to see me. He took this terrible, inaccurate whistleblower report, right, and he brought it to Congress.\"\nThe President went on to repeat his claim that he had a \"perfect conversation\" with the Ukrainian President.\nThere's no reason that Atkinson would have been required to speak to the President before notifying Congress of the whistleblower complaint. Then-acting Director of National Intelligence Joseph Maguire initially blocked the complaint from being sent to Congress, but the Trump administration ultimately relented amid the firestorm that erupted from House Democrats, who launched an impeachment inquiry that ultimately led to the President's impeachment on two articles. He was acquitted by the Senate on both charges.\nLast month, Atkinson wrote to Senate Democratic Leader Chuck Schumer warning about backlash to whistleblowers, according to a copy of the letter obtained by CNN.\n\"As you know, the past six months have been a searing time for whistleblowers and for those who work to protect them from reprisal or threat of reprisal for reporting alleged wrongdoing,\" Atkinson wrote, responding to a February letter Schumer sent to more than 70 inspectors general after Vindman was reassigned from the NSC.\n\"Those repeated assurances of support for whistleblowers in ordinary matters are rendered meaningless if whistleblowers actually come forward in good faith with information concerning an extraordinary matter and are allowed to be vilified, threatened, publicly ridiculed, or -- perhaps even worse -- utterly abandoned by fair weather whistleblower champions,\" Atkinson added.\nHouse Intelligence Chairman Adam Schiff responded to Trump's comments Saturday, saying Atkinson \"abided by the law and the complaint was spot on.\"\n\"Someone who follows the law and their conscience is no disgrace,\" Schiff tweeted. \"A president that fires him, he's the disgrace.\"\nTrump said that he did not run his decision to fire Atkinson by Congress, claiming he had the absolute right to do it.\n\"That's my decision. I have the absolute right,\" Trump said.\nTrump concluded by saying someone should sue Atkinson.\nThe President's allies defended his move. Rep. Jim Jordan, an Ohio Republican who played a key role defending the President during the impeachment inquiry, charged on Twitter Saturday that Atkinson ignored the fact that the whistleblower met with a member of Schiff's staff before filing the complaint and didn't disclose the whistleblower's contacts in the Obama administration.", "url": "https://www.cnn.com/2020/04/04/politics/trump-michael-atkinson-inspector-general-fired/index.html"}