{"authors": ["Frank Pallotta", "Cnn Business"], "date_download": "2020-05-04 16:06:14", "date_modify": "2020-05-04 16:06:14", "date_publish": "2020-04-02 12:13:37", "description": "Last year was a good year for the film industry. The global box office brought in over $40 billion worldwide, even though the domestic box office was down. Disney notched seven films that made more than $1 billion globally. And one of those films, \"Avengers: Endgame,\" broke \"Avatar's\" record as the highest-grossing blockbuster of all time.", "filename": "2020_04_02_media_movie-box-office-coronavirus_index_1588608374.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191208182453-03-wonder-woman-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_media_movie-box-office-coronavirus_index_1588608374.html", "title": "The coronavirus won't end moviegoing, but it could change it", "title_page": "The coronavirus won't end moviegoing, but it could change it - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Last year was a good year for the film industry. The global box office brought in over $40 billion worldwide, even though the domestic box office was down. Disney notched seven films that made more than $1 billion globally. And one of those films, \"Avengers: Endgame,\" broke \"Avatar's\" record as the highest-grossing blockbuster of all time.\nNow, just three months into 2020, the film industry's year may be over.\nThe coronavirus pandemic has brought Hollywood to a complete halt. Movie theaters, big and small, have shuttered around the world , productions have stopped and the release of some of the year's biggest films have been delayed.\nThe future of moviegoing is in serious doubt, since nobody knows how long the virus will keep things closed or how audiences will react once life does return to normal. Jeff Bock, a senior analyst at entertainment research firm Exhibitor Relations, believes that theaters will ultimately rebound from the coronavirus outbreak, but it won't come without \"great losses.\"\n\"The industry is morphing before our very eyes and the old Hollywood adage, 'nobody knows anything,' is more relevant today than ever before,\" Bock told CNN Business. \"My guess is that blockbuster movies will have their day in the sun again. But the build-up to their dominance in the marketplace will take time; certainly a year, at minimum, to return to the form we recognize.\"", "url": "https://www.cnn.com/2020/04/02/media/movie-box-office-coronavirus/index.html"}