{"authors": ["Reporter"], "date_download": "2020-05-04 21:06:58", "date_modify": "2020-05-04 21:06:58", "date_publish": "2020-04-30 20:27:41", "description": "Gov. Larry Hogan said that the state's National Guard is watching thousands of COVID-19 kits his state bought from South Korea.", "filename": "entry_larry-hogan-hiding-coronavirus-tests_n_5eab2338c5b635cbe76d180e_1588626418.html", "image_url": "https://img.huffingtonpost.com/asset/5e73147c2300002b1ade4ada.png?cache=1qeupckgq5&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_larry-hogan-hiding-coronavirus-tests_n_5eab2338c5b635cbe76d180e_1588626418.html", "title": "Maryland's GOP Governor Hid COVID-19 Test Kits So Feds Can't Take Them", "title_page": "Maryland's GOP Governor Hid COVID-19 Test Kits So Feds Can't Take Them | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Maryland Gov. Larry Hogan said he’s been forced to resort to drastic measures to protect nearly 500,000 COVID-19 test kits from the federal government.\nThe state bought the test kits from South Korea earlier this month, and the state’s National Guard is guarding them in a secret location to prevent them from being commandeered by the Trump administration.\nOn Thursday, Hogan, a Republican, told The Washington Post about the careful steps he’s taking to ensure the tests remain in Maryland.\nFor instance, he had the plane from South Korea land at Baltimore/Washington International Thurgood Marshall Airport instead of Washington’s Dulles International Airport to reduce the chance that the feds would seize the COVID-19 cargo.\nIn addition, the plane was greeted by what Hogan described as “a large contingent of Maryland National Guard and Maryland State Police.”\nHogan explained the reasoning for the intense security measures. “This was an extraordinarily valuable payload. It was like Fort Knox to us, because it’s gonna save the lives of thousands of our citizens,” Hogan told the Post.\nThe federal government has left states largely on their own when it comes to testing their citizens and securing critical equipment during the pandemic. But when it comes to those supplies, Hogan’s concern appears to have been warranted: There have been numerous reports of the Federal Emergency Management Agency ﻿hijacking desperately needed protective gear for first responders and health care workers.\n“We wanted to make sure that that plane took off from Korea safely, landed here in America safely,” Hogan said. “And that we guarded that cargo from whoever might interfere with us getting that to the folks who need it.”\nYou can see Hogan explain the secret plan below.\nMaryland @GovLarryHogan on whether he was concerned that the federal government would seize the tests the state procured from South Korea. He says the tests are being guarded by the National Guard at an undisclosed location. https://t.co/uGcUi6U5rL pic.twitter.com/15BhHmLzql — Washington Post Live (@postlive) April 30, 2020\nThe White House did not immediately respond to a request for comment.", "url": "https://www.huffpost.com/entry/larry-hogan-hiding-coronavirus-tests_n_5eab2338c5b635cbe76d180e"}