{"authors": ["Brett Martel"], "date_download": "2020-05-04 20:31:23", "date_modify": "2020-05-04 20:31:23", "date_publish": "2020-04-05 14:21:11", "description": "NEW ORLEANS (AP) — Tom Dempsey, the kicker born without toes on his kicking foot who made a then-record 63-yard field goal, died late Saturday while struggling with complications from the new...", "filename": "_e2f40632dfa505b98d2de086592df289_1588624283.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ebfa2e4e73234e20b6474b5cace76ed2/1972.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e2f40632dfa505b98d2de086592df289_1588624283.html", "title": "Ex-NFL kicker, Saints hero Tom Dempsey dies at 73", "title_page": "Ex-NFL kicker, Saints hero Tom Dempsey dies at 73", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Nov. 8, 1970, file photo, New Orleans Saints' Tom Dempsey (19) moves up to kick a 63-yard field goal as teammate Joe Scarpati holds the ball and Detroit Lions' Alex Karras (71) rushes in while Saints' Bill Cody (66) blocks, in New Orleans. Dempsey, who played in the NFL despite being born without toes on his kicking foot and made a record 63-yard field goal, died late Saturday, April 4, 2020, in New Orleans while struggling with complications from the new coronavirus, his daughter said. He was 73 years old. (AP Photo/File)\nFILE - In this Nov. 8, 1970, file photo, New Orleans Saints' Tom Dempsey (19) moves up to kick a 63-yard field goal as teammate Joe Scarpati holds the ball and Detroit Lions' Alex Karras (71) rushes in while Saints' Bill Cody (66) blocks, in New Orleans. Dempsey, who played in the NFL despite being born without toes on his kicking foot and made a record 63-yard field goal, died late Saturday, April 4, 2020, in New Orleans while struggling with complications from the new coronavirus, his daughter said. He was 73 years old. (AP Photo/File)\nNEW ORLEANS (AP) — Tom Dempsey, the kicker born without toes on his kicking foot who made a then-record 63-yard field goal, died late Saturday while struggling with complications from the new coronavirus. He was 73.\nThe Times-Picayune/The New Orleans Advocate first reported Dempsey’s death. Ashley Dempsey said Sunday that her father, who has resided in an assisted living home for several years after being diagnosed with dementia, tested positive for the coronavirus a little more than a week ago.\nThe Orleans Parish coroner has yet to release an official cause of death.\nDempsey’s game-winning field goal against Detroit on Nov. 8, 1970, stood as an NFL record for 43 years until the Broncos’ Matt Prater broke it with a 64-yarder in Denver in 2013.\nDempsey spent 11 seasons in the NFL: His first two seasons were with New Orleans (1969-70), the next four with Philadelphia, then two with the Los Angeles Rams, one with the Houston Oilers and the final two with Buffalo. He retired after the 1979 season.\n“Tom’s life spoke directly to the power of the human spirit and exemplified his resolute determination to not allow setbacks to impede following his dreams and aspirations,” Saints owner Gayle Benson said in a statement. “He exemplified the same fight and fortitude in recent years as he battled valiantly against illnesses but never wavered and kept his trademark sense of humor.”\nDempsey was born in Milwaukee without four fingers on his right hand and without toes on his right foot. He kicked straight on with a flat-front shoe that drew protests from some who saw the specially made kicking shoe as an unfair advantage. Former Dallas Cowboys President Tex Schramm compared the shoe to “the head of a golf club.”\nBut Dempsey would counter by saying he was merely doing the best he could to use the foot with which he was born, and for the most part, NFL officials, including then-Commissioner Pete Rozelle, agreed. Still, in 1977, the NFL passed what is widely known as the “The Dempsey Rule,” mandating that shoes worn by players with “an artificial limb on his kicking leg must have a kicking surface that conforms to that of a normal kicking shoe.”\nDempsey returned to New Orleans after retiring from the league. About seven years ago, he was diagnosed with dementia and later moved to an assisted living home, where he contracted the coronavirus in March during the pandemic that has hit the city — and nursing home — particularly hard. He is survived by wife Carlene, three children, a sister and grandchildren.\nHis kick has remained part of Saints lore and for a long time stood as one of the greatest moments in the history of a franchise that didn’t make the playoffs until its 21st season in 1987, and didn’t win a playoff game until the 2000 season.\nDempsey shared some recollections with The Associated Press in February 2010 about the enduring adulation he received for that one moment and about how he sensed it came to define his 11-year career.\n“It used to bother me a bit. I wanted to be known as a good kicker, more than for one kick,” he said. “But I found out that if you’re going to set a record, there’s only one place to set it in — New Orleans!”\nAt the time of the kick, the Superdome had yet to be build and the Saints played home games in the old Tulane Stadium, which was demolished in 1979.\nThe Lions led 17-16 after a short field goal with 11 seconds left.\nWith no timeouts, the Saints managed to move the ball to their own 45 with 2 seconds left after Billy Kilmer completed a pass to Al Dodd along the sideline.\nAccording to a media reports, special teams coach Don Heinrich was heard barking, “Tell Stumpy to get ready to go in and kick a long one.”\nAt that time, goalposts were on the goal line, not behind the end zone. The spot of the kick was the Saints 37.\n“I was more concerned about kicking it straight because I felt I could handle the distance,” Dempsey told the Times-Picayune. “I knew I was going to get a perfect snap from Jackie Burkett and a perfect hold from Joe Scarpati. It was all up to me. I hit it sweet.”\nKilmer told the Times-Picayune he remembers standing on the sideline seeing Lions players across the field laughing as Dempsey lined up for the momentous kick.\n“They thought Tom had no chance,” Kilmer said.\nBut Dempsey ended up carried off the field on the shoulders of teammates and recalled spending all night at a Bourbon Street bar, celebrating.\n“We were there, with all the guys, until the wee hours,” he said. “From what I can recall, I had a great time.”\nBoth the shoe with which Dempsey kicked the 63-yarder and the ball are in the Saints Hall of Fame in New Orleans, into which Dempsey was inducted in 1989. The Pro Football Hall of Fame in Canton, Ohio, has another of Dempsey’s specially made kicking shoes, but Dempsey wanted the mementos of the record-breaking kick to remain in New Orleans.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/e2f40632dfa505b98d2de086592df289"}