{"authors": ["Matt Egan", "Cnn Business"], "date_download": "2020-05-04 16:09:27", "date_modify": "2020-05-04 16:09:27", "date_publish": "2020-04-02 17:21:09", "description": "Hopes are building for a truce in the brutal oil price war between Saudi Arabia and Russia, setting off a record spike in the oil market Thursday.", "filename": "2020_04_02_business_oil-prices-trump-russia-saudi-arabia_index_1588608567.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402110912-us-gas-station-0401-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_business_oil-prices-trump-russia-saudi-arabia_index_1588608567.html", "title": "Oil prices spike by a record 25% as Trump talks up huge production cuts and Saudi Arabia calls for OPEC meeting", "title_page": "Oil prices spike by a record 25% as Trump talks up huge production cuts and Saudi Arabia calls for OPEC meeting  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Hopes are building for a truce in the brutal oil price war between Saudi Arabia and Russia, setting off a record spike in the oil market Thursday.\nPresident Donald Trump suggested massive production cuts could be on the way and Saudi Arabia called for an \"urgent\" meeting between OPEC, Russia and other unnamed nations to restore \"balance\" to the oil market.\nEven though no date has been set for such a meeting — and no deal on cutting production has yet been announced — the oil market celebrated wildly.\nTrump's tweet followed a call with Saudi Crown Prince Mohammed bin Salman.\n\"If it happens, will be GREAT for the oil & gas industry!\" the US president tweeted.\nSaudi Arabia and Russia have been locked in an epic price war since early March, flooding the oil market with cheap crude just as demand is cratering because of the coronavirus pandemic. Crude has crashed to 18-year lows , crushing American oil companies and energy stocks.\n'Burden sharing'\nAlthough Trump suggested the deep cuts would be coming solely from Saudi Arabia and Russia, there are signs that OPEC is looking for other countries, including perhaps the United States, to join in.\n\"We need to see burden sharing,\" a source within the OPEC+ alliance told CNN Business' John Defterios. \"Not fair for two or three producers within OPEC+ to carry most of the responsibility.\nPrevious cuts by OPEC and its allies have given US shale producers room to capture market share. The United States recently surpassed Russia and Saudi Arabia as the world's largest oil producer.\n\"The Saudis are absolutely crystal clear that they are not doing this alone. It's not just a Saudi-Russia cut,\" said Helima Croft, RBC Capital's global head of commodity strategy. \"They're done with the situation where they cut and the US grows.\"\nSome US oil producers have urged officials in Texas to impose caps on the state's oil production -- a step that would run counter to the industry's free-market ethos. The Railroad Commission of Texas, which regulates the state's energy industry, hasn't exercised that power in more than 40 years.\nRyan Sitton, a commissioner on that regulatory body, said Thursday he had a \"great conversation\" with Russian Energy Minister Alexander Novak in which they discussed the need to remove 10 million barrels per day from global oil supply.\n\"While we normally compete,\" Sitton said in a tweet , \"we agreed that #COVID19 requires unprecedented levels of int'l cooperation.\" He added that he will speak to Saudi Arabia's energy minister soon.\nTrump also tweeted that bin Salman had spoken with Russian President Vladimir Putin. However, the Kremlin denied such a phone call had taken place, news that took some of the heat out of the huge spike in oil prices.\nA truce between Saudi Arabia and Russia would aid an oil market that analysts estimate is oversupplied by around 25 million barrels per day. Demand for transport fuels in particular has been decimated by travel restrictions aimed at containing the pandemic.\n'Completely unrealistic'\nThe official Saudi Press Agency said in a tweet Thursday that the kingdom is seeking a meeting for members of the OPEC+ alliance, which includes Russia, \"and another group of countries\" in an attempt to try to reach a \"fair solution to restore the desired balance of the oil markets.\"\nIt's not clear who would be part of that additional group of countries.\nThe tweet said the invitation is part of Saudi Arabia's efforts to support the global economy \"and in appreciation of the US President's request and the US friends' request.\"\nAnalysts expressed skepticism that Saudi Arabia and Russia would suddenly reverse course and slash production by nearly as much as Trump suggested.\n\"This is a completely unrealistic expectation,\" said Matt Smith, director of commodity research at ClipperData.\nSmith pointed out that even the low end of Trump's touted production cuts, 10 million barrels, amounts to virtually all of Saudi Arabia's output.\n\"From a logic standpoint, from a political standpoint, it doesn't make any sense,\" he said.\nBig cuts by Russia would undermine its goal of drowning high-cost US shale producers in a sea of cheap oil.\nThe recent crash in oil prices to $20 a barrel will likely set off a wave of bankruptcies and job cuts in the US oil industry, including in many Republican-leaning states.\nDemand, not supply, is the No. 1 problem\nProduction cuts by Russia and Saudi Arabia would ease a great deal of pressure in the oil market.\nHowever, the primary cause of the oil crash is weak demand, not excess supply. The extreme restrictions imposed to fight the coronavirus pandemic have caused an unprecedented collapse in oil demand. Highways are empty. Passenger jets have been parked. And factories are not operating.\nUS gasoline demand, the No. 1 swing factor for global oil demand, is plunging because most Americans have been forced to work from home.\nIHS Markit estimates that US gasoline demand could collapse by more than 50% during the coronavirus response period. That would easily surpass the demand lost during the Great Recession.\nAll of this means that even if there is a truce between Saudi Arabia and Russia, prices may remain under pressure.\n— John Defterios contributed to this article.", "url": "https://www.cnn.com/2020/04/02/business/oil-prices-trump-russia-saudi-arabia/index.html"}