{"authors": ["Raja Razek", "Ralph Ellis"], "date_download": "2020-05-04 16:20:06", "date_modify": "2020-05-04 16:20:06", "date_publish": "2020-04-04 22:23:05", "description": "Tybee Island, one of Georgia's most popular vacation destinations, depends on beachgoers to keep the town's economy alive.", "filename": "2020_04_04_us_tybee-island-georgia-beaches-open_index_1588609206.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/180205142601-15-where-to-go-march-tybee-island-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_us_tybee-island-georgia-beaches-open_index_1588609206.html", "title": "Tybee Island will fight Georgia governor's 'reckless mandate' to reopen state's beaches", "title_page": "Tybee Island will fight Georgia governor's 'reckless mandate' to reopen state's beaches - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Tybee Island, one of Georgia's most popular vacation destinations, depends on beachgoers to keep the town's economy alive.\nBut in an effort to curb the coronavirus, the city council voted to close the beaches March 20. The town went so far as to put up barricades and signs to keep beachgoers away.\nThe town's good intentions were upended on Thursday when Gov. Brian P. Kemp issued a statewide shelter-in-place executive order which supersedes all local orders relating to coronavirus -- and also opened up the state's beaches.\nThe governor put Tybee Island back in the beach business -- whether the town liked it or not.\nTybee Island Mayor Shirley Sessions fired back on Saturday, issuing a statement saying she and the town council don't want the beaches reopened now.\n\"As the Pentagon ordered 100,000 body bags to store the corpses of Americans killed by the Coronavirus, Governor Brian Kemp dictated that Georgia beaches must reopen, and declared any decision-makers who refused to follow these orders would face prison and/or fines,\" Sessions' statement read.\n\"Tybee City Council and I are devastated by the sudden directives and do not support his decisions. The health of our residents, staff and visitors are being put at risk and we will pursue legal avenues to overturn his reckless mandate.\"\nThe Tybee Island Light House.\nKemp tweets photos of the beaches\nKemp's office did not immediately respond to a request from CNN asking for comment on Sessions' statement.\nPhotos from Tybee Island - ⁦@GaDNRLE⁩ and ⁦@ga_dps⁩ report no issues as they patrol the beach and surrounding areas. Beachgoers are mostly locals and complying with social distancing orders. We will continue to monitor conditions. pic.twitter.com/aS9OCGUTUC — Governor Brian P. Kemp (@GovKemp) April 4, 2020\nHowever, Kemp posted photographs of Georgia beaches and lakes on his official Twitter account today saying, \"Photos from Tybee Island - ⁦@GaDNRLE and ⁦@ga_dps report no issues as they patrol the beach and surrounding areas. Beachgoers are mostly locals and complying with social distancing orders. We will continue to monitor conditions.\"\nAfter Kemp issued his shelter-in-place order, the state Department of Natural Resources put limits on beachgoers, saying they must practice social distancing and can't bring chairs, umbrellas or tents to the beach, at least through April 13.\n'We're at a very precarious situation'\nShe said Kemp's decision caught Tybee off guard and the town hasn't had time to take down the beach barricades or open up the parking lots.\nThe town doesn't have the personnel to enforce social distancing on the beach, she said, encouraging residents to shoot videos if they see people standing too close together on the beach.\n\"We're at a very precarious situation,\" she said in the video.\nTybee Island is located near Savannah and has a resident population of about 3,000 people.\nKemp has already already been criticized for issuing his executive order so late in the game.", "url": "https://www.cnn.com/2020/04/04/us/tybee-island-georgia-beaches-open/index.html"}