{"authors": ["Arman Azad"], "date_download": "2020-05-04 16:08:12", "date_modify": "2020-05-04 16:08:12", "date_publish": "2020-04-02 13:59:13", "description": "The US Food and Drug Administration has issued its first emergency use authorization for a coronavirus test that looks for antibodies in the blood.", "filename": "2020_04_02_health_fda-coron_40d713121c3ea146935399dd18d308a9_index_1588608492.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200213175736-02-coronavirus-0213-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_health_fda-coron_40d713121c3ea146935399dd18d308a9_index_1588608492.html", "title": "FDA authorizes first coronavirus antibody test", "title_page": "FDA authorizes first coronavirus antibody test - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The US Food and Drug Administration has issued its first emergency use authorization for a coronavirus test that looks for antibodies in the blood.\nThat type of test, called a serology test, would be able to identify past coronavirus infections, although it may be less effective at identifying recent ones.\nThe authorized test, from a manufacturer called Cellex Inc., requires blood to be collected through a vein, and the test itself can only be performed in a certified lab.\nBecause antibodies can take time to develop, the FDA has previously warned against using antibody tests to definitively diagnose coronavirus.\nBut in issuing what is known as an Emergency Use Authorization for the new test, the FDA signaled that the benefits of using the new blood test outweighed the risks.\n\"Based on the totality of scientific evidence available to FDA, it is reasonable to believe that your product may be effective in diagnosing COVID-19,\" said the agency, adding that \"the known and potential benefits of your product when used for diagnosing COVID-19, outweigh the known and potential risks of your product.\"\nUnlike most coronavirus tests, which generally require a swab and look for signs of the virus itself, antibody tests look instead for our body's response to a virus.\nThe FDA said in its letter that initial antibodies against coronavirus are \"generally detectable in blood several days after initial infection,\" but the agency cautioned that \"levels over the course of infection are not well characterized.\"\nThe US Centers for Disease Control and Prevention says it is also working to develop a serology test -- or blood test -- that could look for antibodies, which would develop even in people with mild or no symptoms.\nSuch tests can allow officials to better understand how prevalent coronavirus infections truly are, because they can identify people who had been previously infected but showed little or no symptoms.\nOn Tuesday, a company called Bodysphere falsely claimed that an FDA Emergency Use Authorization was issued for an antibody test that could detect coronavirus in two minutes from a pinprick of blood.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nMultiple news outlets reported on the announcement, but later retracted their articles after the FDA confirmed that no such test had been authorized at the time. On Wednesday, the company acknowledged that the test had not in fact received the authorization.\nFDA guidance issued last month allows antibody tests to be manufactured and distributed without such authorizations. But any explicit authorization from the FDA -- such as the one issued to Cellex -- is a sign that regulators have confidence in a test's validation data and believe its benefits outweigh its risks.", "url": "https://www.cnn.com/2020/04/02/health/fda-coronavirus-antibody-test-authorization/index.html"}