{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:21:47", "date_modify": "2020-05-04 20:21:47", "date_publish": "2020-04-29 18:58:17", "description": "One thousand graduating cadets must return to New York state so the president can \"stroke his own ego,\" the war veteran said.", "filename": "entry_tammy-duckworth-trump-west-point-cadets_n_5ea9b5e5c5b6acde47fe73af_1588623707.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9bd6e2500008c10eb092b.jpeg?cache=bvficwsxte&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_tammy-duckworth-trump-west-point-cadets_n_5ea9b5e5c5b6acde47fe73af_1588623707.html", "title": "Sen. Tammy Duckworth Says Trump Values TV Ratings Over Health Of West Point Cadets", "title_page": "Sen. Tammy Duckworth Says Trump Values TV Ratings Over Health Of West Point Cadets | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Sen. Tammy Duckworth (D-Ill.) blasted President Donald Trump’s decision to bring 1,000 West Point cadets back to campus during the coronavirus pandemic so that he can give a speech to the graduating class.\n“Trump’s reckless decision to gather 1,000 Cadets at West Point for a speech puts our future military leaders at increased risk — all to stroke his own ego,” Duckworth, an Iraq War veteran and Purple Heart recipient, said in a statement Wednesday. “Our troops need stable, consistent leadership during volatile times like these, not a Commander-in-Chief who values his own photo ops and TV ratings over their health and safety. I urge President Trump to evaluate the potential consequences of this vanity speech and reconsider holding the event.”\nIn mid-April, Trump suddenly announced that he would be giving the commencement speech on June 13 at the U.S. Military Academy ― which sits not far north of New York City, a COVID-19 hot spot.\n“He’s the commander in chief, that’s his call,” Sue Fulton, a West Point graduate and former chairwoman of the academy’s board of visitors, told The New York Times last week.\nPreviously, cadets had been told to stay home after spring break as COVID-19 spread around the country. But on Wednesday, the Army and West Point both confirmed that the academy will be holding an in-person graduation ceremony. Cadets will be returning from their homes all across the U.S. to the state hardest hit by the virus.\nWest Point said in its statement that this year’s procession “will look different from recent graduation ceremonies due to current force health protection requirements.”\nRep. Jackie Speier (D-Calif.) also tore into Trump’s latest of many reckless decisions regarding the virus.\n“He’s forcing the creation of crowds in hopes of generating applause and adulation. It’s always about him,” Speier told HuffPost on Tuesday. “That’s why we have almost 1 million infected and over 50,000 Americans dead.”", "url": "https://www.huffpost.com/entry/tammy-duckworth-trump-west-point-cadets_n_5ea9b5e5c5b6acde47fe73af"}