{"authors": [], "date_download": "2020-05-04 20:28:02", "date_modify": "2020-05-04 20:28:02", "date_publish": "2020-04-08 17:40:26", "description": "TRENTON, N.J. (AP) — New Jersey pushed back its primary to July 7 from June 2 because of the coronavrus outbreak under an executive order Gov. Phil Murphy signed on Wednesday. Preparing for...", "filename": "_b085ed43953775d8bbf931ff7a358301_1588624082.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b085ed43953775d8bbf931ff7a358301_1588624082.html", "title": "New Jersey delays primary to July because of virus outbreak", "title_page": "New Jersey delays primary to July because of virus outbreak", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "New Jersey delays primary to July because of virus outbreak\nTRENTON, N.J. (AP) — New Jersey pushed back its primary to July 7 from June 2 because of the coronavrus outbreak under an executive order Gov. Phil Murphy signed on Wednesday.\nPreparing for a June primary at the potential head of the COVID-19 emergency could hurt election officials’ ability to prepare, the order states.\nMurphy said he’s not taking a mail-in ballot only election off the table but hasn’t decided. He specifically cited Wisconsin, where a primary went forward despite the health threat.\nNew Jersey residents should not have to choose between their right to vote and their personal health, Murphy said.\nNew Jersey is among the worst-hit states in the country by the coronavirus. More than 1,500 people have died as a result, and the state has been essentially on lockdown for weeks.\nThe Democrat mentioned specifically that he doesn’t want to repeat what Wisconsin had with people having to choose between their right to vote and keeping healthy.\nThe state is expected to approach the peak of the virus’s curve sometime this month or next, the Democratic governor said earlier this week.\nNew Jersey has both mail-in and in-person voting.", "url": "https://apnews.com/b085ed43953775d8bbf931ff7a358301"}