{"authors": ["Andrew Taylor", "Lisa Mascaro"], "date_download": "2020-05-04 20:25:22", "date_modify": "2020-05-04 20:25:22", "date_publish": "2020-04-20 04:14:14", "description": "WASHINGTON (AP) — Late-stage negotiations in Washington on a new $450 billion coronavirus aid package dragged past Monday's hoped-for deadline, but the Trump administration and key lawmakers...", "filename": "_d4706859faf64bf3abd73419933c8ea2_1588623922.html", "image_url": "https://storage.googleapis.com/afs-prod/media/4359a31333a54c1dbe20a11b4a5ab872/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d4706859faf64bf3abd73419933c8ea2_1588623922.html", "title": "Talks drag on $450B virus aid for small business, hospitals", "title_page": "Talks drag on $450B virus aid for small business, hospitals", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this April 13, 2020, file photo President Donald Trump listens as Treasury Secretary Steven Mnuchin speaks about the coronavirus in the James Brady Press Briefing Room at the White House in Washington. The Trump administration and Congress are nearing an agreement as early as Sunday, April 19, on a $400-plus billion aid package to boost a small-business loan program that has run out of money and add funds for hospitals and COVID-19 testing. (AP Photo/Alex Brandon, File)\nFILE - In this April 13, 2020, file photo President Donald Trump listens as Treasury Secretary Steven Mnuchin speaks about the coronavirus in the James Brady Press Briefing Room at the White House in Washington. The Trump administration and Congress are nearing an agreement as early as Sunday, April 19, on a $400-plus billion aid package to boost a small-business loan program that has run out of money and add funds for hospitals and COVID-19 testing. (AP Photo/Alex Brandon, File)\nWASHINGTON (AP) — Late-stage negotiations in Washington on a new $450 billion coronavirus aid package dragged past Monday’s hoped-for deadline, but the Trump administration and key lawmakers insisted a final pact is within reach.\nPresident Donald Trump said he expects a Senate vote “hopefully” on Tuesday.\nAs talks continued, the contours of the deal appear largely set. Most of the funding, some $300 billion, would go to boost a small-business payroll loan program that’s out of money. Additional help would be given to hospitals, and billions more would be spent to boost testing for the virus, a key step in building the confidence required to reopen state economies.\nThe emerging draft measure — originally designed by Republicans as a $250 billion stopgap to replenish the payroll subsidies for smaller businesses — has grown into the second largest of the four coronavirus response bills so far. Democratic demands have caused the measure to balloon, though they likely will be denied the money they want to help struggling state and local governments.\nThe Senate met for a brief pro forma session Monday afternoon that could have provided a window to act on the upcoming measure under fast-track procedures requiring unanimous consent to advance legislation, but it wasn’t ready in time.\nMajority Leader Mitch McConnell, R-Ky., set up another Senate session for Tuesday in the hope that an agreement will be finished by then.\n“It’s now been four days since the Paycheck Protection Program ran out of money. Republicans have been trying to secure more funding for this critical program for a week and a half now,” McConnell said. “Our Democratic colleagues are still prolonging their discussions with the administration, so the Senate regretfully will not be able to pass more funding for Americans’ paychecks today.”\nThe House has announced it could meet as soon as Wednesday for a vote on the pending package, according to a schedule update from Majority Leader Steny Hoyer, D-Md. The chamber is likely to have to call lawmakers back to Washington for a vote, which will present logistical challenges.\nWith small-business owners reeling during a coronavirus outbreak that has shuttered much economic activity, Treasury Secretary Steven Mnuchin — the administration’s point man in the talks with Democrats — said he was hopeful of a deal that could pass Congress quickly and get the Small Business Administration program back up by midweek. But optimism regarding an immediate deal was tempered.\n“I heard today from our legislative affairs team that they are hopeful we can get a deal this week,” top White House adviser Kellyanne Conway said Monday on Fox News. “The secretary feels very confident. He said that yesterday that a deal is happening. Much better position than we were, say, a week ago.”\nThe emerging accord links the administration’s effort to replenish the small-business fund with Democrats’ demands for more money for hospitals and virus testing. It would provide more than $300 billion for the small-business payroll program, with $60 billion or so set aside for community lenders that seek to focus on underbanked neighborhoods and rural areas.\nAnother $60 billion would be available for a small-business loans and grants program that has previously been aimed at helping businesses harmed by natural disasters like hurricanes. Additionally, it would bring $75 billion for hospitals and $25 billion for testing, according to those involved in the talks.\nOn a conference call Sunday afternoon that included Trump, Mnuchin and Republican senators, McConnell indicated the only remaining item for discussion involved the money for testing, according to a Senate GOP leadership aide who spoke on condition of anonymity to discuss a private call. But as in the most recent $2 trillion measure, talks instead fell into a familiar holding pattern on Monday, with new sticking points arising over hospital funding and other topics.\nDemocrats have been pushing to boost funding to cash-strapped states and local governments whose revenues have cratered. They had proposed $150 billion for the effort, but GOP leaders stood hard in opposition, at least regarding the current package of COVID-19 aid.\n“The president is willing to consider that in the next bill, but wants to get this over the finish line with a focus on small businesses, hospitals and testing,” Mnuchin said Sunday on CNN.\nThe government’s Paycheck Protection Program has been swamped by companies applying for loans and reached its appropriations limit last Thursday after approving nearly 1.7 million loans. That left thousands of small businesses in limbo as they sought help. The National Federation of Independent Business, a GOP-friendly organization that advocates for small businesses in Washington, said it had surveyed their members and reported that only 1 in 5 applicants had received money so far.\nAbout $75 billion would go to U.S. hospitals — those straining under a ballooning coronavirus caseload as well as those struggling to stay financially afloat after suspending elective surgeries during the pandemic. About $25 billion would be added for COVID-19 testing, something states have said was urgently needed.\nThe SBA loans, based on a company’s payroll costs, offer owners forgiveness if they retain workers or rehire those who have been laid off. The law provides for forgiveness for companies in any industry — even businesses like hedge funds and law firms. There’s a limit of $100,000 on the amount of employees’ compensation that can be considered when loan forgiveness is calculated.", "url": "https://apnews.com/d4706859faf64bf3abd73419933c8ea2"}