{"authors": [], "date_download": "2020-05-04 16:16:49", "date_modify": "2020-05-04 16:16:49", "date_publish": "2020-04-03 20:33:46", "description": null, "filename": "2020_04_03_cnn-underscored__c057e09a69384a201a558e58cb57b0f1_index_1588609009.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200316111541-mealkitlead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored__c057e09a69384a201a558e58cb57b0f1_index_1588609009.html", "title": "Staying home? These meal kit delivery services will keep you eating well", "title_page": "Staying home? These meal kit delivery services will keep you eating well - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "We've interviewed experts and found the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nAs more and more Americans are opting to work from home amid the coronavirus pandemic, they've also been buying toilet paper and sanitizing wipes in bulk — not to mention clearing grocery stores of bread, pasta, frozen pizzas and other staples. One easy way to avoid encountering empty aisles and practice social distancing? Meal kit delivery services that package up everything you need and send it straight to your doorstep.\nWe've rounded up six of our favorite meal kit delivery services, perfect for a variety of needs. Whether you're feeding hungry kids, watching your carb count, going vegan or working on your chef skills, there's a service for you. Let those shoppers eat their frozen pizzas — you may be staying in, but you'll still be dining in style.\nGreen Chef\nWho it's for: The healthiest eater you know.\nThe basics: Approachable, delicious and certified organic, Green Fresh offers home cooks sustainably sourced, premium ingredients and recipes curated by chefs.\nWhat makes it unique: Practicing healthy eating or on a special diet? Choose from plan options including Keto, Paleo, Balanced Living, Plant-Powered and Family to tailor your meals to your needs. Keto lovers will approve of roasted garlic-butter trout, served with roasted broccoli with Parmesan cheese, and a kale and grape tomato salad. On the Balanced Living plan? Expect recipes for dishes like a Moroccan chicken quinoa bowl with kale, carrots, tomatoes, currants and green goddess dressing. And with premeasured and premade sauces, marinades and spice blends, you'll spend less time in the kitchen and have more time to devote to your wellness routine.\nPlan options: Choose from a two-person plan (each box contains three dinners for two people or six servings total) or the family plan (each box contains two dinners for a family of four, served family-style, or eight servings total). Sign up for weekly subscriptions and pause or cancel orders for no charge.\nPricing: The two-person box ranges from $9.99 to $12.99 per meal, depending on the plan, while the family plan starts at $10.99 per meal. Check site for discounts.\n_______________________________________________________________________________\nFarm Fresh To You\nWho it's for: The all-things-organic lover.\nThe basics: Not farmers market season? No problem! Capay Organic, a second-generation family farm in California, works with local farms and artisans to deliver certified organic produce and handcrafted farm products to your doorstep. What's inside? A small Mixed Fruit and Veggie box might contain two Valencia oranges, one Hass avocado, two Fuji apples, a head of red leaf lettuce and one bunch each of spring onions, lacinato kale, Nantes carrots and red beets.\nWhat makes it unique: Farm Fresh allows you to customize each order — add or remove produce or change your box type, size and delivery frequency. Hate beets? Just put them on your \"never send\" list. You can also choose to add grocery and artisan basics like eggs and dairy, honey and jam, or fresh flowers and hand lotion to your box. Need recipes? You'll find them here.\nPlan options: Select your style (Mixed Fruit and Veggie, No Cooking, Fruit Only, Traditional CSA, Veggie Only or Snack Pack), size (small, regular, more or monster) and frequency of delivery (weekly, every other week, every three weeks or every four weeks). Before each delivery, add any extra items if you choose to customize your order. Skip or cancel at any time.\nPricing: Small boxes start at $27.50.\n_______________________________________________________________________________\nHelloFresh\nWho it's for: Families and picky eaters.\nThe basics: Simple, quick and yummy recipes make HelloFresh a fave of busy parents. Helping to ease that dinnertime stress, the step-by-step instructions and premeasured ingredients allow you to whip up dishes that the whole family will love in just 30 minutes — all with little cleanup and waste.\nWhat makes it unique: Customize your meal plan by selecting protein settings (e.g., no beef, no pork, just seafood or just veggie), and meal choices are clearly labeled to help make choosing them a breeze. Now, about those picky eaters? With 20 recipes available each week, you'll be feeding them creamy Parmesan chicken spaghetti, griddled onion cheeseburgers or pork carnitas tacos.\nPlan options: Opt for Meat & Veggies, Veggie, Family Friendly or Low Calorie, and choose your plan size (two or four servings per meal) and delivery frequency (two, three or four meals per week). Skip a week or cancel at any time.\nPricing: Current sale: $3.99 per serving, and free shipping.\n_______________________________________________________________________________\nEveryPlate\nWho it's for: The beginner on a budget.\nThe basics: EveryPlate is all about super simple recipes that promise to be six steps or less, making this an easy pick for someone who's just beginning to cook every day for themselves. Rather than focus on specialty diets, the company focuses on keeping prices low.\nWhat makes it unique: Especially good for extremely busy people and families. The recipes range from chicken dishes to burgers and tacos.\nPlan options: Choose two to four dinner servings per meal, and delivery frequency can be anywhere from three to five times a week. You can cancel at any time.\nPricing: $4.99 per meal, plus $8.99 for shipping.\n_______________________________________________________________________________\nHome Chef\nWho it's for: The wannabe gourmet chef.\nThe basics: With a rotating weekly menu, you have 17 menu items to choose from, including five-minute lunches, and the option to customize — whether you choose an upgrade, swap or want to double your protein on certain recipes.\nWhat makes it unique: Home Chef really listens to what its customers are saying: The company combs through the 100,000-plus reviews and 50,000-plus comments it receives each month to inform its upcoming menu planning. Want to create a meal that would cause even Gordon Ramsay to break into applause? Order from the Premium meal options. It'll cost you more — $19.95 per serving — but when you're dining on a bistro filet and truffle frites in the comfort of your own home, we don't think you'll mind.\nPlan options: Choose two, four or six servings per meal; delivery frequency starts at two meals a week. Skip or cancel at any time.\nPricing: Most dinner meals are $9.95 per serving; five-minute lunches are $7.99 per serving; and smoothies and the fruit basket are $4.95 per serving.\n_______________________________________________________________________________\nPurple Carrot\nWho it's for: The vegan or plant-based eater.\nThe basics: Whether you're looking to test out a plant-based diet or have been eating vegan for years, this convenient meal kit delivery service sends you all the ingredients you'll need to make delicious meat-free dishes at home. Sweet and sour seitan with charred cherry tomatoes and udon, anyone?\nWhat makes it unique: Yes, there are plenty of dinner options, but for those who want more, there's the option to add two-serving breakfast (how about vanilla chia puddings with dried blueberries and cashews?) and lunch meals (dibs on the stuffed avocados with tofu salad and crispy onions), as well as snacks (like protein bites or dark chocolate \"seed'nola\"), to your order.\nPlan options: Choose from High-Protein, Gluten-Free, Quick & Easy or Chef's Choice, or customize your plan every week. Choose from a two-serving plan (includes three dinners per week, each serving two people) or a four-serving plan (includes two or three dinners per week, each serving four people).\nPricing: The two-serving plan starts at $71.94 per week (each serving is $11.99); the four-serving plan starts at $79.92 per week (each serving is $9.99). Add breakfast for $4.49 per serving (comes in four-serving portions) or lunch for $8.99 per serving (comes in two-serving portions). Snacks start at $3.99 apiece.\n_______________________________________________________________________________\nKitchen Basics\nYou've got the food. Now, do you have the proper tools? Here are a few items to add to your Amazon cart to make cooking at home a snap.\nCuisinart 3 Piece Mixing Bowl Set ($28.99; wayfair.com)\nCuisinart 3 Piece Mixing Bowl Set\nThis three-piece set, in blue, green and yellow, includes 1.5-quart, 3-quart and 5-quart bowls that are perfect for all your meal kit recipes. When you're done mixing, throw them in the dishwasher and then nest them for easy storage.\n_______________________________________________________________________________\nKitchenAid Euro Peeler ($12.77; wayfair.com)\nKitchenAid Euro Peeler\nPeel potatoes, carrots, apples and other fruits and veggies with this peeler that features a swivel-head blade and comes in a pretty aqua hue.\n_______________________________________________________________________________\nOxo Good Grips Soft-Handled Garlic Press ($16.99; bedbathandbeyond.com)\nOxo Good Grips Soft-Handled Garlic Press\nIf \"too much garlic\" is a phrase that has never passed your lips, you'll definitely want a good garlic press on hand. This model has plenty of room for large cloves and a built-in cleaner that pushes out the garlic peels.\n_______________________________________________________________________________\nHamilton Beach Personal Blender ($24.99; bedbathandbeyond.com)\nHamilton Beach Personal Blender\nTo help make things like sauces and dressings, having a small blender on hand isn't a bad idea.\n_______________________________________________________________________________\nCuisinart Fine Mesh Stainless Steel Strainers ($12.99; bedbathandbeyond.com)\nCuisinart Fine Mesh Stainless Steel Strainers\nPerfect for straining pasta but also great for sifting dry ingredients, this set of three stainless steel mesh strainers will get tons of use in your kitchen.\n_______________________________________________________________________________\nM Kitchen World Spatula Set ($11.99; amazon.com)\nM Kitchen World Spatula Set\nWhen you're baking, icing, mixing, stirring, flipping or folding? You need a good spatula. This four-piece set includes a nice variety of styles in flexible, nonstick and heat-resistant silicone.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/best-meal-delivery-service-outbrain-2/index.html"}