{"authors": ["Analysis Nic Robertson"], "date_download": "2020-05-04 16:54:18", "date_modify": "2020-05-04 16:54:18", "date_publish": "2020-04-08 19:06:57", "description": "\"Maximum pressure\" or \"medical terrorism\"? Iranian leaders are accusing the United States of crippling its medical system amid a coronavirus pandemic -- and the spat has crystallized global scrutiny of America's conduct under crisis.", "filename": "2020_04_08_middleeast_coronavirus-iran-us-donald-trump-intl_index_1588611258.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200112040735-trump-rouhani-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_middleeast_coronavirus-iran-us-donald-trump-intl_index_1588611258.html", "title": "'Maximum pressure' on Iran amid coronavirus could backfire for Trump", "title_page": "Coronavirus: 'Maximum pressure' on Iran amid pandemic could backfire for Trump - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) \"Maximum pressure\" or \"medical terrorism\"? Iranian leaders are accusing the United States of crippling its medical system amid a coronavirus pandemic -- and the spat has crystallized global scrutiny of America's conduct under crisis.\n\"History will remember that the White House, so far, has been an economic terrorist, and in medical care has been a terrorist as well,\" said Iranian President Hassan Rouhani in a televised address Wednesday, as he slammed US sanctions on Iran and urged the International Monetary Fund to grant a $5 billion loan to help in the country's fight against coronavirus.\nHe has every reason to shout fire. For weeks now, Iran has been the Middle East's hot zone for COVID-19. Though the WHO has seen a \"flattening off\" of new coronavirus cases in the country, more than 3,800 Iranians have already died and -- by some accounts -- the contagion is beyond the government's control.\nBut is Rouhani justified in blaming the US?\nThere is nothing new in autocracies like Iran blaming others for their woes. Iran's ayatollahs have blamed America for their country's ills since taking power 40 years ago. In the 1990s, Bosnia's Serbs gave an unwarranted shaming of Madeleine Albright following their civil war. When she visited the country as Secretary of State, angry crowds denounced her and waved posters depicting her with fangs dripping blood. Nonetheless, her diplomatic standing has only grown since.\nBut what the United States faces today is entirely different. The novel coronavirus pandemic has raised the stakes, and outrage is raining on Trump's policies. It's not just Iran. Leaders in Venezuela and Cuba are also demanding that he lift crushing US sanctions, which impede their access to global financial systems. Damagingly for the US, these accusations could erode global trust in Washington, and have lasting repercussions for future presidents.\nExperts say sanctions do 'amplify' the health crisis\nThough the sanctions technically exempt food and medical supplies, human rights reports from Iran have repeatedly emphasized the impact of sectoral sanctions on gaining access to essential medicines and medical equipment, including respirators and protective equipment for health-care workers. And experts say US sanctions on Iran are indeed hurting its response to the pandemic.\n\"Iran is hampered by sanctions that prevent it from accessing foreign reserves, foreign currency abroad to purchase the necessary medical equipment -- masks, anything that it might need to take care of its population,\" adds Sanam Vakil, an Iran expert with Chatham House, a UK-based foreign policy institute.\nDr. Aniseh Bassiri Tabrizi works for the Royal United Services Institute, RUSI, which also advises the UK government. Tabrizi believes that despite humanitarian exemptions, US sanctions have already hollowed out Iran's health care system, leaving it vulnerable to coronavirus. \"What COVID did was just further amplify the situation in terms of amplifying the crises,\" she says, pointing out that the country's medical system and supplies had already been crippled before the pandemic broke out. CNN's own reporting in Iran two years ago supports the idea that Iran's health care system was struggling.\n\"Sanctions are the first problem in our country and in our system. We can't transfer the money and make the preparations for surgery. It's a big problem for us,\" Dr. Mohammad Hassan Bani Asad, managing director of Tehran's Gandhi Hotel Hospital, told CNN's Senior International Correspondent Fred Pleitgen last year. \"We have the procedures, but we don't have the instruments. It is very difficult for patients and maybe leads to death of some patients.\"\nThe political fallout of 'maximum pressure' in an age of coronavirus\nIn late March, US Secretary of State Mike Pompeo accused Iran's leaders of covering up the extent of the coronavirus outbreak and causing more suffering.\n\"The regime continues to lie to the Iranian people and the world about the number of cases and deaths,\" he said. Rather than hurt Iran, Pompeo argued the United States was offering help, including \"over $100 million in medical assistance to foreign countries, including to the Iranian people.\"\nBut according to Vakil, America's message of help no longer resonates, and its sanctions are inflicting a psychological shock upon the Iranian people. \"I think an Iranian who has long maybe thought that the United States was a benign power that took take care of other countries in moments of crises instead is seeing this nationalistic America first response,\" she says.\n\"I think that this is sort of adding to the challenge of ordinary Iranians. They're realizing that they're really alone.\"\nThis may not be Trump or Pompeo's intent, but staying tough on Iran -- at the apparent expense of its people -- plays to the politics of Iran's hardliners, who seek to deepen the wedge between the US and Iran, Tabrizi adds.\n\"What we have seen over the past few months has been from the Iranian side spreading a lack of trust -- even towards those within the institution of Iran who have normally been advocating for engagement with the US,\" she says.\nA recent example of how the hardliners are gaining the upper hand came a few weeks ago. President Hassan Rouhani, who is generally perceived as moderate, used EU government contacts to invite Doctors Without Borders (MSF) into Iran. The medical aid organization came with a field hospital and equipment to help stem the pandemic COVIDS killing, but Iranian hardliners forced them to leave before they could unpack.\nThe consequence of continued pressure, Vakil says, could be a more hardline Iran. \"(The coronavirus) is just sort of the icing on the cake of their opportunism,\" she says, warning that they may capitalize on crises to put themselves forward.\n\"By next June, when there are presidential elections, Iran will be dominated by conservative politicians and reformists will be sitting on the sidelines,\" she predicts.\nThe world is watching the United States\nWhat makes this particularly troubling for the United States in this highly sensitive time of coronavirus is that the world is not only watching America but it is waiting for it too.\nPast American presidents have taken the global lead. Barack Obama teamed up with UK Prime Minister Gordon Brown to brainstorm a path out of the 2008 economic crisis. But faced with the test of a pandemic, Trump has fallen short of international expectations for his office.\nSome of America's strongest European allies not only disagree with Trump's Iran policy, but accuse the US of diverting medical supplies they've ordered . Meanwhile, Germany sends ventilators to Spain, and treats French and Italian COVID patients in its much-needed ICU beds, and China and Russia land plaudits for sending supplies around the world -- all indications of the international standing that Trump has squandered.\nSince his inauguration in January 2017, the majority of Trump's global partners have been deeply suspicious of his actions. Now the coronavirus pandemic has levelled the international playing field, revealing him -- and consequently his United States -- in a less than flattering light.", "url": "https://www.cnn.com/2020/04/08/middleeast/coronavirus-iran-us-donald-trump-intl/index.html"}