{"authors": ["Tami Luhby"], "date_download": "2020-05-04 17:01:27", "date_modify": "2020-05-04 17:01:27", "date_publish": "2020-04-07 11:29:38", "description": "Some jobless Americans will start seeing heftier unemployment checks as soon as this week, depending on where they live.", "filename": "2020_04_07_politics_unemplo_357b1742201fbb2c3e7ce3bf85cf8073_index_1588611687.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406170255-01-closed-sign-michigan-0302-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_unemplo_357b1742201fbb2c3e7ce3bf85cf8073_index_1588611687.html", "title": "Unemployment benefits: Extra $600 will start flowing as early as this week", "title_page": "Unemployment benefits: Extra $600 will start flowing as early as this week - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Some jobless Americans will start seeing heftier unemployment checks as soon as this week, depending on where they live.\nStates are beginning to implement the historic enhancement of unemployment benefits that Congress included in its $2.2 trillion relief package to address the coronavirus pandemic savaging the economy. It includes a $600 weekly increase for up to four months, on top of state benefits.\nAmong the earliest beneficiaries are unemployed people in New York, which has emerged as the epicenter of the US outbreak -- but laid-off workers in most states will eventually get the full amount due, retroactive to as early as March 29.\nStates had to wait until the federal Department of Labor issued guidance on the extra funds, which will be fully covered by the federal government. That guidance came out this past weekend, a week after the bill was signed.\nHowever, many states still don't have a timetable for implementing the new pandemic unemployment assistance program -- which covers those who lost their jobs or had to stop working because of the coronavirus -- because it requires a more extensive change to their applications and systems.\nThe pandemic program extends jobless benefits to independent contractors, gig economy workers and the self-employed, who typically don't qualify in many states -- which are now scrambling to figure out who exactly qualifies and what documentation these workers will need.\nNew York to send enhanced benefit this week\nJobless New Yorkers who are already getting an unemployment check can expect to see the additional $600 this week, a state Department of Labor spokeswoman told CNN on Monday. Those filing new claims should start receiving both their state and enhanced federal payments in two to three weeks.\n\"The federal government says they will reimburse us for it, but people need money now in their pocket,\" Democratic Gov. Andrew Cuomo said Wednesday. \"New York will be doing that immediately.\"\nCalifornia Gov. Gavin Newsom announced Thursday that Golden State residents would also begin seeing larger checks on Sunday.\n\"Many Californians are feeling the effects of this pandemic, and this added benefit is very important to our workers so they have the needed resources during this difficult time,\" said Newsom, a Democrat, noting that last week the Employment Development Department processed more than 925,000 claims -- a 2,418% increase over the same week past year.\nIn Missouri, eligible unemployed residents should begin receiving the federal benefits as early as the week of April 12, after the state Division of Employment Security updates its technology and implements various procedures, the agency said Monday.\nMeanwhile, Indiana expects to start sending out the larger checks the week of April 20th, Fred Payne, commissioner of the state Department of Workforce Development, said Monday.\nFor Michelle Parks, the additional funds can't come soon enough.\nIndiana resident Michelle Parks should start receiving enhanced unemployment benefits by April 20.\nThe Pittsboro, Indiana, mother of two sons was furloughed from her job at a retailer at the end of March. State officials initially said the extra $600 might not show up in checks until May, which made her \"extremely nervous\" since her state benefit will only be $390 a week. She still has to pay more than $600 a month in health insurance premiums to maintain the family's coverage.\n\"I looked at my husband and said, 'What are we going to do? How are we going to make it on this?' \" said Parks, who wrote to her federal lawmakers asking about the delay. \"There has to be some sort of urgency here. This is needed at this moment.\"\nParks, who said she was able to file her initial claim online fairly easily at the end of March, was happy to hear Monday that she'll receive the federal benefits in about two weeks.\n\"April 20th feels like a win in this book,\" she said. \"It's better than May.\"\nOther states, including Ohio, Oregon and Texas, are still working on the process to send out the extra federal money, agency officials said. Some states will provide a single larger weekly check, while others may opt to send the state and federal benefits separately.\nPayments will be retroactive\nThe rollout comes at a time when states are overwhelmed by an unprecedented crush of people filing for first-time benefits as companies large and small lay off and furlough workers amid the pandemic.\nNearly 10 million Americans submitted initial claims in the last two weeks of March. But countless more were unable to get through to their state unemployment agencies and complete their applications.\nBut those who haven't been able to file their initial claims yet shouldn't lose out. The federal enhancement will be paid retroactively to claims filed starting March 29 in most, if not all, states. The additional payments end by July 31 at the latest, under the current legislation.\nIndependent contractors and the self-employed will have to wait longer\nStates are working on creating online applications and updating back-end systems to begin enrolling their jobless residents in the pandemic program. Though it's modeled on the existing disaster unemployment assistance program, it's still a big lift for many states since they typically do not provide jobless benefits to independent contractors and the self-employed, who are now covered by the federal relief.\n\"There's a huge difference between modifying our current unemployment system or process to include the $600 federal benefit for those already eligible and creating an entirely new system for a totally new class of covered workers,\" Payne said.\nSome of the newly eligible have written to CNN and complained on social media that they are being rejected. Many states are encouraging these residents to wait until the new applications are posted online to file their claims.\nThe Labor Department guidance did not provide many details on what documents independent contractors and the self-employed could file to show their income over the past five quarters, which is the typical period upon which benefits are based, said Michele Evermore, senior policy analyst at the National Employment Law Project.\nBut she suggests they consider using 1099 tax documents, bank records showing checks or deposits from employers or earnings information from gig economy apps. Some workers, especially those who rely on tips, may just have to attest to what they made.\nAlso, some of these freelancers and contractors who saw their jobs or income affected by the coronavirus may have to attest as to why they had to stop working.\nSome advocates are worried that the Labor Department's guidance is not clear and may end up excluding some of these workers.\nFor instance, the guidance provides an example of a ride-sharing driver who is unable to continue working because a state or municipality is restricting movement through an emergency order. Also, the document lists someone who has had a positive coronavirus test as an example of who might qualify. The fear among advocates is that those who don't meet these specific criteria may wind up excluded in some states.\n\"I'm concerned that some states are going to interpret this narrowly,\" said Evermore, who hopes additional information is issued.\nAlso, some feel the guidance requires too much documentation during a national emergency.\n\"Most importantly, the guidance forces workers to wade through significant red tape to prove their eligibility, which will inevitably prevent workers from receiving assistance they desperately need and should qualify for,\" said Sen. Ron Wyden, an Oregon Democrat.\nThe Department of Labor did not return requests for comment.", "url": "https://www.cnn.com/2020/04/07/politics/unemployment-benefits-cares-act-covid-pandemic/index.html"}