{"authors": ["Jill Martin"], "date_download": "2020-05-04 16:18:15", "date_modify": "2020-05-04 16:18:15", "date_publish": "2020-04-03 23:57:42", "description": "The United States Tennis Association (USTA) released a statement Friday advising not to play tennis during the coronavirus pandemic.", "filename": "2020_04_03_us_usta-advises-_a6fd85c327b243b29a4028f83fead2b2_index_1588609095.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403191722-usta-coronavirus-tennis-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_us_usta-advises-_a6fd85c327b243b29a4028f83fead2b2_index_1588609095.html", "title": "USTA says we should not be playing tennis right now", "title_page": "USTA says we should not be playing tennis right now - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The United States Tennis Association (USTA) released a statement Friday advising not to play tennis during the coronavirus pandemic.\n\"Based on the recommendations of the USTA COVID-19 Advisory Group, the USTA believes that it is in the best interest of society to take a collective pause from playing the sport we love,\" the statement says.\n\"Although there are no specific studies on tennis and Covid-19, medical advisors believe there is the possibility that the virus responsible for Covid-19 could be transmitted through common sharing and handling of tennis balls, gate handles, benches, net posts and even court surfaces.\n\"As a result of this, the USTA asks that as tennis players we need to be patient in our return to the courts and consider how our decisions will not only affect ourselves, but how our decisions can impact our broader communities. In the meantime, we encourage everyone to stay active and healthy with at-home exercise and creative 'tennis-at-home' variations.\"\nUSTA Statement on Safety of Playing Tennis during the COVID-19 Virus Pandemic\nRead more: https://t.co/osmvJaI8GT pic.twitter.com/MIWWrkjDne — USTA (@usta) April 3, 2020\nThe USTA says it will provide updates as new information becomes available.", "url": "https://www.cnn.com/2020/04/03/us/usta-advises-not-playing-tennis-during-coronavirus-pandemic/index.html"}