{"authors": ["Madeline Holcombe", "Stephanie Gallman"], "date_download": "2020-05-04 16:06:05", "date_modify": "2020-05-04 16:06:05", "date_publish": "2020-04-02 10:49:44", "description": "Officials from the health care and federal and state governments have promoted social distancing as a powerful tool in the fight against coronavirus.", "filename": "2020_04_02_us_stay-at-home-_dcd579b6091dff038469c4da5ed99233_index_1588608365.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402092025-01-us-coronavirus-religious-gatherings-0315-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_us_stay-at-home-_dcd579b6091dff038469c4da5ed99233_index_1588608365.html", "title": "Religious gatherings: Here's a look at what states exempt them from stay at home orders", "title_page": "Religious gatherings: Here's a look at what states exempt them from stay at home orders  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Officials from the health care and federal and state governments have promoted social distancing as a powerful tool in the fight against coronavirus.\nBut of the 39 states that have implemented stay at home orders, 12 make exceptions for religious gatherings.\nA revival held at a church resulted in an outbreak of the virus in Hopkins County, Kentucky, and the governor reminded the public Wednesday that those exercising the exemptions still hold a responsibility to take precautions to the virus.\n\"The ramifications when we don't follow this, end up being widespread and they hurt people that didn't make that choice,\" said Gov. Andy Beshear. \"Let's make sure that we're responsible in the choices we make to protect those around us.\"\nHere's a list of states that still allow some form of religious gatherings during the stay at home orders:\nRead More", "url": "https://www.cnn.com/2020/04/02/us/stay-at-home-order-religious-exemptions-states-coronavirus/index.html"}