{"authors": ["Chris Isidore", "Cnn Business"], "date_download": "2020-05-04 16:02:13", "date_modify": "2020-05-04 16:02:13", "date_publish": "2020-04-01 17:20:17", "description": "US car sales fell sharply in March, the latest blow to the nation's economy from the coronavirus outbreak.", "filename": "2020_04_01_business_car-sales-coronavirus_index_1588608133.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401105159-unsold-ram-pickup-trucks-dealership-0315-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_business_car-sales-coronavirus_index_1588608133.html", "title": "Car sales are plunging in the US because of coronavirus", "title_page": "Car sales are plunging in the US because of coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) US car sales fell sharply in March, the latest blow to the nation's economy from the coronavirus outbreak.\nannounced Wednesday that its first-quarter sales in the United States fell by 10% even though sales were up the first two months of the quarter.\n\"Strong momentum in January and February was more than offset by the negative economic impact of the coronavirus in March,\" said the company.\nreported a 7% drop in sales for the quarter, which it attributed to the sharp decline in March sales because of the virus outbreak.\nNeither company would release the month-by-month sales figures. Butreported results for both March and the quarter. Its daily sales pace plunged 32% in March, while its overall sales in the month fell 37%, hurt in addition by one fewer sales day in the month. Overall, its first-quarter sales fell 9%, similar to the declines reported at Ford and GM. So it's possible that Ford and GM suffered a similar decline in March to what Toyota reported.\nMany other automakers are due to report March or first-quarter sales Wednesday or Thursday. But none are likely to report good sales said Michelle Krebs, senior analyst for Cox Automotive.\n\"What did save them is that March started out pretty well, but then it fell off a cliff,\" said Krebs.\nNumerous factors are working against car sales. Top among those factors is that more than three-quarters of Americans live in states or cities where they are being told to stay at home except for essentials such as shopping for food, drugs or seeking medical care.\nIn addition, many potential buyers are suffering economic setbacks because of the businesses they work for or own being closed. More than 3 million people recently filed for unemployment benefits , a record for one week. And that has frozen a lot of potential buyers out of the credit market because of their job or economic situation, Krebs said.\n\"The three things that most determine car sales are credit, employment and consumer confidence,\" she said. \"All are working against car sales. April is going to be even worse.\"\nFiat Chrysler responded with the most aggressive sales incentives yet on the market. The offer, rolled out Wednesday, allows eligible buyers to get a seven-year interest-free loan with payments deferred for 90 days. But buyers still need to qualify for the loan.\nThe company said it is now offering a new online purchase option that allows buyers to purchase a vehicle off a dealer lot, conduct a vehicle trade-in process, apply for credit, receive price and payment estimates and review service protection plan options.\nMost dealerships remain open, according to Fiat-Chrysler, but there are some states where dealerships have been ordered to close, Krebs said. About 37% people surveyed by Cox Automotive say they will wait going to a dealership, even for servicing on their car, because of health concerns.\nSo the drop in car sales will probably continue, no matter the incentives that are offered, said Krebs. In addition to the economic headwinds, millions of additional workers who are still on the job are working from home, reducing their need for a car to commute to work or get children to school or other activities that have also been canceled.\nAnother factor working against car sales is the recent stock market turmoil that hurt many people's savings, which can also reduce the willingness of people to purchase a big-ticket item like a new car.\nBut if sales have ground to a near halt, so has the supply of vehicles for dealerships.", "url": "https://www.cnn.com/2020/04/01/business/car-sales-coronavirus/index.html"}