{"authors": [], "date_download": "2020-05-04 20:05:30", "date_modify": "2020-05-04 20:05:30", "date_publish": "2020-04-10 00:23:30", "description": "SEATTLE (AP) — City of Seattle officials are closing over a dozen parks this weekend amid concerns that more people will gather in the warmer weather and spread the coronavirus. City...", "filename": "_fbce80dd6da953527c648ed8cd488531_1588622730.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fbce80dd6da953527c648ed8cd488531_1588622730.html", "title": "Seattle closing 15 parks, beaches this weekend due to virus", "title_page": "Seattle closing 15 parks, beaches this weekend due to virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SEATTLE (AP) — City of Seattle officials are closing over a dozen parks this weekend amid concerns that more people will gather in the warmer weather and spread the coronavirus.\nCity leaders including Mayor Jenny Durkan said the city will close 15 parks at 11 p.m. Friday and keep them closed until Monday morning. Parks closing include: Alki, Arboretum, Cal Anderson, Carkeek, Discovery, Gas Works, Green Lake, Golden Gardens, Kubota Garden, Lincoln, Magnuson, Seward, Volunteer, West Seattle Stadium and Woodland.\nParks with gates will be locked, and Seattle Parks and Recreation employees will be there to remind people of the closure. They may also call the police if people don’t move along, The Seattle Times reported . The Seattle Police Department will have officers prepared to respond, according to Chief Carmen Best. Officers will start by asking people to voluntarily comply with the closures, she said.\nDurkan said too many people are continuing to gather in parks.\n“While Seattle is expecting near perfect weather, friends and families should not have family or friend outings, picnics or gatherings in parks,” she said. “If you need to take a walk in your neighborhood, be smart and don’t help create a crowded place.”\nOther cities including Austin and Los Angeles are also shutting down major parks for the weekend, Seattle officials said.\n“Easing up on social distancing too early will put more people at risk, could overwhelm our health care system, and could delay the reopening of businesses,” Durkan said.\nThe city closed parking lots at eight major parks about two weeks ago and has prohibited the use of play areas. Under Gov. Jay Inslee’s statewide stay-at-home order, those at parks are supposed to stay six feet away from each other.", "url": "https://apnews.com/fbce80dd6da953527c648ed8cd488531"}