{"authors": ["Vedika Sud"], "date_download": "2020-05-04 16:22:06", "date_modify": "2020-05-04 16:22:06", "date_publish": "2020-04-05 23:01:11", "description": "People across India turned off the lights in their homes and stood on their balconies, at their open entryways and outside their homes with candles and lamps lit, or flashlight and mobile phone lights turned on, to observe a candlelight vigil on Sunday night.", "filename": "2020_04_05_world_india-coronavirus-candlelight-vigil_index_1588609326.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405183435-01-india-candlelight-vigil-0405-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_world_india-coronavirus-candlelight-vigil_index_1588609326.html", "title": "India observes nationwide candlelight vigil in a show of solidarity in the fight against coronavirus", "title_page": "India observes nationwide candlelight vigil in a show of solidarity in the fight against coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) People across India turned off the lights in their homes and stood on their balconies, at their open entryways and outside their homes with candles and lamps lit, or flashlight and mobile phone lights turned on, to observe a candlelight vigil on Sunday night.\nEarlier this week, Prime Minister Narendra Modi appealed to the people of India to hold a nationwide candlelight vigil on Sunday at 9 p.m. local time, for nine minutes, in a show of solidarity for the country's fight against the coronavirus pandemic.\nModi said it is important for every Indian to realize that he or she isn't alone in this fight.\nIndians light candles in a show of solidarity with health workers on the frontlines.\n\"We must together invoke the spirit of Bharat Mata (Mother India) and ensure that the dark clouds of the virus make way for the light hope,\" Modi said while addressing the nation on Friday.\nSocial media has lit up with images of the vigil. Photos posted online show President Ram Nath Kovind and the country's first lady with candles at the Presidential Palace. Prime Minister Modi was seen lighting a lamp at his residence.\nRead More", "url": "https://www.cnn.com/2020/04/05/world/india-coronavirus-candlelight-vigil/index.html"}