{"authors": ["Eric Bradner"], "date_download": "2020-05-04 16:11:26", "date_modify": "2020-05-04 16:11:26", "date_publish": "2020-04-02 21:48:32", "description": "Wisconsin's primary remains on schedule for Tuesday after a federal judge declined to postpone the contest.", "filename": "2020_04_02_politics_wisconsin-primary-tuesday_index_1588608686.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331140405-02-gov-tony-evers-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_wisconsin-primary-tuesday_index_1588608686.html", "title": "Federal judge declines to postpone Wisconsin's April 7 primary but extends absentee voting", "title_page": "Wisconsin primary: Federal judge declines to postpone April 7 election but extends absentee voting  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Wisconsin's primary remains on schedule for Tuesday after a federal judge declined to postpone the contest.\nUnlike several other states and territories with April primaries , Wisconsin's Democratic Gov. Tony Evers and the Republican-led state legislature have not moved or made major changes to the state's election date amid the coronavirus pandemic.\nIn a ruling Thursday, US District Judge William Conley did extend the deadline for absentee ballots to be returned from Election Day on April 7 to April 13. He also pushed back the state's deadline to request absentee ballots from Thursday to Friday, and said the state must also count ballots from those who submit \"a written affirmation or other statement\" that they weren't able to get a witness to sign their ballots.\nBut he did not move the primary despite pleas from mayors and concerns from state and local elections officials about a critical shortage of poll workers that has led Evers to say he'll deploy the National Guard to staff polling stations.\nThe state and national Republican Party, the intervening defendants in the case on behalf of Wisconsin's GOP-led legislature, filed a notice Thursday night that they would appeal Conley's ruling to the US Seventh Circuit Court of Appeals.\nRead More", "url": "https://www.cnn.com/2020/04/02/politics/wisconsin-primary-tuesday/index.html"}