{"authors": ["Jim Gomez"], "date_download": "2020-05-04 20:10:41", "date_modify": "2020-05-04 20:10:41", "date_publish": "2020-04-08 10:51:07", "description": "MANILA, Philippines (AP) — The Philippines on Wednesday expressed solidarity with Vietnam after Hanoi protested what it said was the ramming and sinking of a Vietnamese fishing boat by a Chinese...", "filename": "_98e24d71793c69c954b4922067c99013_1588623041.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b3caa180ccf2400db9f9dd5c6efbe6d9/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_98e24d71793c69c954b4922067c99013_1588623041.html", "title": "Philippines backs Vietnam after China sinks fishing boat", "title_page": "Philippines backs Vietnam after China sinks fishing boat", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this April 12, 2018, file photo released by China's Xinhua News Agency, the Liaoning aircraft carrier is accompanied by navy frigates and submarines conducting an exercises in the South China Sea. Despite the coronavirus outbreak, China is keeping up with military exercises around Taiwan at the northern edge of the South China Sea. (Li Gang/Xinhua via AP, File)\nFILE - In this April 12, 2018, file photo released by China's Xinhua News Agency, the Liaoning aircraft carrier is accompanied by navy frigates and submarines conducting an exercises in the South China Sea. Despite the coronavirus outbreak, China is keeping up with military exercises around Taiwan at the northern edge of the South China Sea. (Li Gang/Xinhua via AP, File)\nMANILA, Philippines (AP) — The Philippines on Wednesday expressed solidarity with Vietnam after Hanoi protested what it said was the ramming and sinking of a Vietnamese fishing boat by a Chinese coast guard ship in the disputed South China Sea.\nThe Department of Foreign Affairs in Manila expressed deep concern over the reported April 3 sinking of the boat carrying eight fishermen off the Paracel Islands. The incident happened at a time when a common approach was crucial in confronting the coronavirus pandemic, it said.\n“COVID-19 is a very real threat that demands unity and mutual trust,” the department said. “In the face of it, neither fish nor fictional historical claims are worth the fuse that’s lit by such incidents.”\nChina claims virtually the entire South China Sea and has built several islands equipped with military installations in the area, one of world’s busiest shipping lanes. Vietnam has been the most vocal opponent of Beijing’s territorial assertiveness.\nThe Philippines’ Department of Foreign Affairs recalled that 22 Filipino fishermen were left floating in the high seas after a Chinese vessel sank their boat at Reed Bank on June 9 last year. They were rescued by a Vietnamese fishing vessel.\n“Our own similar experience revealed how much trust in a friendship is lost by it and how much trust was created by Vietnam’s humanitarian act of directly saving the lives of our Filipino fishermen,” the department said.\nThe United States has also expressed serious concern over the reported sinking of the Vietnamese vessel and called on China to remain focused on supporting efforts to combat the pandemic and “stop exploiting the distraction or vulnerability of other states to expand its unlawful claims in the South China Sea.”\nAmid the pandemic, China “has announced new `research stations’ on military bases it built on Fiery Cross Reef and Subi Reef and landed special military aircraft on Fiery Cross Reef,” U.S. State Department spokeswoman Morgan Ortagus said in a statement, referring to two of seven islands China built on disputed shoals in the South China Sea.\nChina has also “continued to deploy maritime militia around the Spratly Islands,” she said, referring to a hotly contested group of islands and citing a 2016 decision by an international tribunal that invalidated China’s sprawling claims in the South China Sea.\nChina has said it has the right to build in waters where it exercises sovereignty and has ignored and continued to defy the the arbitration ruling.\nThe Philippines warned that incidents like the sinking of the Vietnamese boat undermine the potential for a trusting relationship between the 10-member Association of Southeast Asian Nations and China. It cited “positive momentum” in talks between ASEAN and China on a proposed “code of conduct” — a pact to prevent major clashes in the South China Sea, which many fear could be Asia’s next flashpoint.\nChina responded to Vietnam’s diplomatic protest and demands for an investigation with its own statement accusing the Vietnamese boat of illegally entering Chinese waters. It said it collided with the Chinese ship Haijing 4301 after conducting “dangerous actions.”\nAll eight Vietnamese sailors were rescued by the Chinese and admitted to wrongdoing, China Maritime Police spokesman Zhang Jun was quoted as saying in a statement.\nChina seized the islands from Vietnam in 1974 and frequent confrontations have occurred there.", "url": "https://apnews.com/98e24d71793c69c954b4922067c99013"}