{"authors": ["Caroline Kelly", "Jason Hoffman"], "date_download": "2020-05-04 16:13:53", "date_modify": "2020-05-04 16:13:53", "date_publish": "2020-04-03 02:42:39", "description": "The White House released a letter from President Donald Trump attacking Senate Minority Leader Chuck Schumer in starkly personal terms on Thursday -- just moments after the President said that \"this is not the time for politics.\"", "filename": "2020_04_02_politics_trump-schumer-letter-politics_index_1588608833.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/161117120417-01-trump-schumer-split-1116-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_trump-schumer-letter-politics_index_1588608833.html", "title": "Trump letter attacking Schumer is sent as President says 'this is not the time for politics'", "title_page": "Trump letter attacking Schumer is sent as President says 'this is not the time for politics' - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The White House released a letter from President Donald Trump attacking Senate Minority Leader Chuck Schumer in starkly personal terms on Thursday -- just moments after the President said that \"this is not the time for politics.\"\nTrump was speaking at the White House daily coronavirus briefing at the same time his staff released the letter to Schumer, in which he blasted the New York Democrat's request for more streamlined leadership in mandating production to support the coronavirus response.\n\"I've known you for many years but I never knew how bad a Senator you are for the state of New York, until I became President,\" Trump wrote to Schumer, disparaging his request as \"Democrat public relations letter and incorrect soundbites, which are wrong in every way.\"\nThe exchange highlights Trump's negotiating strategy once again defaulting to a political clash with a top Democrat as the coronavirus outbreak worsens, forcing the administration to work with key Democrats such as Schumer, a long-standing critic, to establish a federal response.\nHowever, Trump had attempted to keep the letter from being sent out after speaking with Schumer on the phone Thursday afternoon.\nRead More", "url": "https://www.cnn.com/2020/04/02/politics/trump-schumer-letter-politics/index.html"}