{"authors": ["Alison Kosik"], "date_download": "2020-05-04 16:22:00", "date_modify": "2020-05-04 16:22:00", "date_publish": "2020-04-06 06:22:35", "description": "A crew member aboard the Celebrity Infinity, part of the Miami-based Royal Caribbean, has raised concerns over whether fellow crew members were unnecessarily put at risk of being exposed to Covid-19.", "filename": "2020_04_06_us_crew-member-c_233c6da5daa6402ae02346bea8b1d144_index_1588609320.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327143156-royal-caribbean-celebrity-infinity-cruise-ship-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_us_crew-member-c_233c6da5daa6402ae02346bea8b1d144_index_1588609320.html", "title": "Crew member aboard Celebrity Infinity raises concerns over whether cruise ship unnecessarily put crew at risk", "title_page": "Crew member aboard Celebrity Infinity raises concerns over whether cruise ship unnecessarily put crew at risk - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A crew member aboard the Celebrity Infinity, part of the Miami-based Royal Caribbean, has raised concerns over whether fellow crew members were unnecessarily put at risk of being exposed to Covid-19.\nJulia Melim, who works as a TV host for the Port and Shopping Channel on the in-house ship TV network, told CNN that management onboard, as well as some of her colleagues, neglected social distancing guidelines and were dismissive of her concerns regarding crew members' health.\n\"They made me feel I was crazy to even bring it up,\" she said, referring to her colleagues' reaction after she brought up the need for social distancing onboard. \"Anytime anyone raised a question, it was the general response: the ship is the safest place to be.\"\nOn March 23, ship management sent out a memo, reviewed by CNN, to crew members who were on the Celebrity Infinity from March 9 through 14 to let them know a crew member who sailed on the ship during that time tested positive for Covid-19, and therefore they could have been exposed.\nThe memo then outlined steps for how to monitor their symptoms -- including by doing temperature checks twice a day -- and encouraged them to avoid contact with others and social events.\nHowever, even after that memo, Melim contends, crew members were still eating together in dining rooms. And it wasn't until March 27, she said, that they were told about Covid-19 symptoms among some onboard the ship.\nMelim's allegations come amid scrutiny toward how cruise lines are handling coronavirus cases onboard their ships. On March 13, the Cruise Lines International Association decided to suspend operations for all cruise ships from U.S. ports of call for 30 days. But thousands of passengers and crew remain aboard at least 15 ships around the world.\nA CLIA spokesperson says \"flight restrictions and port closures have led to some challenges bringing ships in.\" More than a dozen cruise ships remain in limbo, anchored at sea, as ports deny entry. The Celebrity Infinity is one of those ships, as it now awaits clearance to dock so the crew can be let off the boat\nRoyal Caribbean spokesman Jonathon Fishman said that the company \"took immediate action\" when they heard that someone on the Celebrity Infinity had tested positive for coronavirus.\n\"When we were first notified on March 23 of a positive test result, we took immediate action to implement enhanced, precautionary health measures, medical monitoring, and ship sanitization protocols for the protection of our crew's health in accordance with guidance by public health officials,\" he told CNN.\nA public address announcement on board the ship that day said crew members should stay in their rooms unless they had been cleared to work. It said crew members' temperatures would be taken in their rooms.\nThe senior doctor onboard the Celebrity Infinity, Dr. Tamyan Joseph sent a memo to crew and management on March 25, saying five crew members were in isolation at that time and urging everyone to take extra health precautions as coronavirus concerns continue to increase across the globe.\n\"As we have seen how quickly this virus has spread around the world, I think we need to increase our public health measures around the ship,\" Joseph wrote in the memo, obtained and reviewed by CNN. She noted that crew members were still gathering in big groups and said, \"This needs to STOP.\"\n\"We need to start increasing our social distancing from each other before it is too late. \"\nBut Melim said she feels these warnings came too late -- and could have been avoided, had ship management acted sooner.\nCelebrity Infinity management didn't mandate a quarantine for non-working crew until March 28, after the ship had already been at sea for 14 days, Melim said. She said that Celebrity Infinity crew members, herself included, were encouraged to participate in social events, from March 14, when the ship dropped off its last passengers at the Port of Miami, until March 23.\n\"We had like crew parties, we had live music, we had concerts, movie nights, theater performances,\" Melim said.\nAt one point, she said hundreds of people congregated at the ship's auditorium. And even after March 23, Melim said the ship still required the crew to get buffet-style meals in a dining area full of people, and had them walk through the ship to do daily temperature checks.\nWhen she tried to raise concerns at meetings with her colleagues regarding the need to social distance, Melim said she was shut down.\nWhen asked directly about Melim's allegations, including how it wasn't until March 28 that crew members were confined to their cabins, Fishman said, \"the well-being of our crew is our foremost concern.\"\n\"We are in continuous contact with government and public health authorities and appreciate their guidance in protecting the health of our crewmembers,\" he told CNN. \"The well-being of our crew is our foremost concern, and we are communicating with them directly as we continue to implement rigorous health protocols, provide medical resources and support, and follow enhanced cleaning and sanitization procedures onboard our ships.\"\nMelim says she was scheduled to disembark at the Port of Miami on March 27, after passing a health screening. But she said she ultimately wasn't allowed to leave the ship, as two crew members who tested positive for Covid-19 were taken off the vessel in the previous days.\nA memo from the Celebrity Infinity on March 27, reviewed by CNN, informed the crew that US Customs and Border Protection did not disclose a reason for not allowing the crew to disembark on that day.\n\"In my opinion, everything was too little too late,\" Melim said. \"And the delayed reaction really had an effect on board in the number of cases escalating and the consequences that followed now seeing the whole timeline.\"\nMelim, who is a third party contractor on the ship, said she is afraid of losing her job for speaking out. However, she said she believes the safety of herself and other crew members, many who are not US citizens, comes first.\n\"It hasn't been getting better,\" Melim said. \"(It) is just like every time it gets worse and worse. You're in the middle of the ocean, you have nowhere to go. You don't know if you're safe or not because everything is shared, (the) ventilation system is shared.\"\nShe is hoping the Port of Miami gives the Celebrity Infinity clearance for the crew to get off the ship by Easter weekend. But, Melim said,\"there's no guarantee.\"\nCNN has reached out to Royal Caribbean to ask when crew members aboard the Celebrity Infinity will be able to dock.", "url": "https://www.cnn.com/2020/04/06/us/crew-member-celebrity-infinity-concerns-coronavirus/index.html"}