{"authors": ["Bob Ortega", "Scott Bronstein", "Curt Devine", "Drew Griffin"], "date_download": "2020-05-04 16:59:55", "date_modify": "2020-05-04 16:59:55", "date_publish": "2020-04-09 21:26:36", "description": "A weeks-long testing delay that effectively blinded public health officials to the spread of the coronavirus in the US might have been avoided had federal agencies fully enacted their own plan to ramp up testing during a national health crisis.", "filename": "2020_04_09_politics_coronav_568fffdd393ea559d1e5e4cb894771ed_index_1588611595.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403143615-doctor-drive-thru-testing-coronavirus-face-shield-0328-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_coronav_568fffdd393ea559d1e5e4cb894771ed_index_1588611595.html", "title": "How the government delayed coronavirus testing", "title_page": "How the government delayed coronavirus testing - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A weeks-long testing delay that effectively blinded public health officials to the spread of the coronavirus in the US might have been avoided had federal agencies fully enacted their own plan to ramp up testing during a national health crisis.\nThe plan, which is spelled out in an April 2018 agreement between the Centers for Disease Control and three of the biggest associations involved in lab testing, called for boosting the capacity of public health labs, bringing big commercial labs into the testing process early, and making sure labs would have whatever they needed to mount a rapid, large-scale response.\nBut over January and February, agencies within the Department of Health and Human Services not only failed to make early use of the hundreds of labs across the United States, they enforced regulatory roadblocks that prevented non-government labs from assisting, according to documents obtained by CNN, and interviews with 14 scientists and physicians at individual laboratories and national laboratory associations.\nWhen the CDC stumbled out of the blocks in early February, releasing a flawed test that took it weeks to correct, labs across the country had been effectively sidelined. Many public health labs were waiting for the revised CDC tests, while commercial and clinical labs were barred from conducting their own tests unless they went through a complex, slow process of applying for their own \"emergency use authorization\" from the US Food and Drug Administration.\nAs a result, the government squandered a critical month during which aggressive and widespread testing might greatly have reduced the speed and scale of the pandemic.\n\"We really were... basically on a pause for a few weeks within the public health system,\" said Scott Becker, executive director of the Association of Public Health Laboratories. \"And meanwhile, the academic laboratories who had developed their own tests also were not able to test because the regulations didn't allow it at that time.\"\nIn a written response to CNN's inquiries about why the 2018 agreement wasn't fully implemented, the CDC confirmed that it didn't seek to bring commercial labs quickly into the testing mix. Rather, the agency said it decided to \"prioritize the nation's public health laboratories\" but keep the commercial labs \"well informed.\" Critics charge that the CDC and other federal agencies weren't quick enough to recognize the need for emergency action.\nBureaucratic inertia and disinterest\nPublic health labs are run by local, county or state governments and typically focus on detecting and providing surveillance of significant diseases, among other work.\nThe federal government \"made it very difficult for private labs, for university labs to make their own test based on certain regulatory hurdles,\" said Amesh Adalja, a physician and infectious disease expert at the Johns Hopkins University Center for Health Security.\nIt shouldn't have been that way, Adalja and other scientists said.\nJUST WATCHED CNN reporter on early coronavirus testing: We blew it Replay More Videos ... MUST WATCH CNN reporter on early coronavirus testing: We blew it 02:03\nThe CDC's 2018 plan, created following the Zika outbreak two years earlier, was meant to prevent the very testing shortfalls and obstacles that have been unfolding since Covid-19 arrived in the US.\nThe agreement, obtained by CNN, calls for extensive coordination, planning, exercises and constant communication between the CDC, the public labs and the commercial sector. It was designed to leverage the full weight of the nation's wide-ranging scientific community, and rapidly boost \"national laboratory testing and strengthen future responses to public-health emergencies.\"\nBut, smothered by bureaucratic inertia and disinterest at the highest levels of the Trump Administration in pandemic preparation, that agreement, known as a memorandum of understanding, today remains far from being fully realized, scientists say.\n\"What we needed was extremely aggressive leadership at the CDC level and at the national level to say, okay, these are all our plans... I don't think there was really a realization of the magnitude of the problem,\" said Glenn Morris, director of the Emerging Pathogens Institute at the University of Florida.\nAs late as January 28, in an email obtained by CNN, CDC Director Robert Redfield told state public health directors that \"the virus is not spreading in the U.S. at this time and CDC believes the immediate health risk from 2019-nCoV to the general American public is low.\"\nBut lab directors and epidemiologists said the likely magnitude of the problem was crystal clear to them much earlier.\n\"We certainly said on many conference calls with the CDC during those times that we really needed to expand lab testing,\" in January and early February, said Dr. Jeffrey Engel, a senior adviser on Covid-19 for the Council of State and Territorial Epidemiologists \"Our members were telling the CDC that we needed testing capacity for a public health surveillance because we felt that the virus might be circulating in the US as early as January and we should be testing for that now.\"\nA week before Redfield's email, on January 21, officials in Washington state confirmed that the first case on US soil had been detected there two days earlier.\nBecker said the intent behind the 2018 coordination plan was \"a good thing\" that did improve communication between the government and commercial labs, but that there was a failure to get those outside the government launched on the testing effort early in process.\n\"You can add this,\" he said, \"...to the list of things that could have been better in this response.\"\nReports of an \"unknown pneumonia\"\nOn January 8, Jana Broadhurst was in Kansas City, having a glass of wine and celebrating her second wedding anniversary with her husband, when she got a message from a colleague back in Omaha, Nebraska, about \"news coming out of China.\"\nChinese scientists had identified \"unknown pneumonia\" in Wuhan as a novel coronavirus. Within days, Chinese authorities announced the first death in Wuhan from the disease. That weekend, they released the full sequence of the coronavirus genome.\nFor Broadhurst, the director of a clinical laboratory at the University of Nebraska Medical Center, the message might as well have been an emergency flare. Soon she was on the phone with her colleagues, talking logistics about travel screening and virus detection from her hotel room. Within days, her laboratory would dive into developing its own coronavirus test.\nHer lab gained special permission February 4 to use that test on quarantined passengers from the Diamond Princess cruise ship. It would take until February 29, though, for the FDA to give her lab permission to offer tests to residents of Omaha and the surrounding area.\nHers was not the only lab in that situation.\n\"We had a feeling something was coming, based on what was happening in China,\" said Karen Kaul, chair of pathology at the NorthShore University HealthSystem in Illinois. \"We started looking at developing our own in-house laboratory test in January... We contacted the CDC because CDC had the assay,\" or test.\nKaul was so anxious to get the test she looked for a way to get her hospital lab certified as a public-health lab, since they would be the first to get the CDC test. But, she said, CDC officials told her \"I could not, because there was no pathway for that to happen\" in the regulations.\nThen, in early February, a friend forwarded to her a memo from the Centers for Medicare & Medicaid Services, or CMS, which oversees clinical laboratories.\nJUST WATCHED 160K backlogged tests: The struggle to keep up with the pandemic Replay More Videos ... MUST WATCH 160K backlogged tests: The struggle to keep up with the pandemic 03:45\nAlphabet soup of overlapping authority\nThree federal agencies -- CMS, the CDC and the FDA -- have overlapping authority over laboratories and lab testing. Before the CDC could distribute its own test to public health labs, for example, it had to get FDA approval for an \"emergency use authorization,\" or EUA, which the FDA issued to the CDC on February 4.\nThe same regulations prevented clinical laboratories from immediately developing and conducting their own tests, said Dr. Jordan Laser, a pathologist for Northwell Health in New York and a member of the Clinical Laboratory Improvement Advisory Committee, a committee managed by the CDC that advises on clinical laboratory standards.\nOn February 6, CMS sent out a memo to state health officials who survey labs, asking them to notify the agency if they found out about any labs working to conduct a coronavirus test without an emergency use authorization.\nWhen a friend passed the memo along to her, \"that definitely gave us pause,\" Kaul said. \"No one wants to spend the time and money and manpower developing a test they wouldn't allow you to use... and this shutting down of that avenue severely hampered our ability to test patients.\"\nCMS told CNN that the memo was meant to confirm that \"laboratories are following protocols to ensure accurate testing and patient safety.\"\nFor some labs, developing the coronavirus test was the easy part. What was not easy was getting approval from the FDA and the CDC.\n\"Within several weeks of the [DNA] sequence being published, we had what we felt was a reasonably good test for detection of the virus,\" said Morris, at the University of Florida.\n\"The problem was that CDC was insisting on being the sole source for the assay [or test] to be used here in the United States... CDC basically said everything has to come through us.\"\nIn a statement to CNN, the FDA said there was nothing wrong in its process.\nInstead, it blamed individual lab delays \"where labs did not understand the FDA process and mistakenly believed there was more work involved, or just did not even realize that they could develop a test in the first place.\"\n'Seemed like the right thing to do'\nIn Seattle, researchers for the University of Washington-sponsored Seattle Flu Study had taken thousands of swabs from people with flu symptoms across the region. But, during February, federal and state officials repeatedly rejected their requests to let them retest those swabs for coronavirus, as first reported by The New York Times . The CDC said the project's test would need FDA approval; the FDA said the lab would need to be certified first under CMS regulations, which would take months; and the project wasn't certified to share results with state public health officials or anyone else outside the study.\nAt the end of February, scientists at the study decided not to wait. They began testing swabs and quickly found another coronavirus case. When they shared that fact with the FDA and the CDC, those agencies initially ordered them to stop testing the swabs.\nThe scientists hurriedly conferred with Karen Moe, the director of the university's institutional research board office, which ensures research meets regulatory and ethical standards. On March 2, she said they had to share the information, regardless.\n\"Every once in a while, the ethics and the regulations don't match up,\" Moe told CNN. \"Ethically, it sure seemed like the right thing to do.\"\nOn February 29, the FDA loosened its regulations, allowing clinical labs to test for coronavirus using tests they developed and validated, so long as they notified the FDA and submitted EUA requests within 15 days.\nJulie Khani, the president of the American Clinical Laboratory Association, a partner in the plan, said that it was the FDA's updated guidance at the end of February that was the \"federal call to action for commercial laboratories.\"\nThe FDA made further changes March 16, to \"reflect FDA's constant assessment of benefits and risks over the course of the evolving emergency.\"\nThose actions came after weeks of pressure from labs across the country.\nBroader testing, Morris said, \"Should have been an absolute top priority and should have been aggressively pursued by CDC using all avenues possible.\"\nJUST WATCHED How you can still celebrate Easter this week Replay More Videos ... MUST WATCH How you can still celebrate Easter this week 02:33\nSouth Korea's success story\nThe actions taken in South Korea offers a useful comparison, Morris said.\nBoth countries reported their first coronavirus case within a day of one another. Officials in South Korea gave permission just a week later for their commercial labs to develop coronavirus tests. Within two weeks, South Korea was shipping thousands of test kits daily. By mid-March, South Korea was testing at a per-capita rate 40 times higher than the US.\nOn March 13, when the total number of US coronavirus tests finally cracked 10,000, South Korea was doing that many tests daily. The results: South Korea was able to \"flatten the curve\" of coronavirus cases by late March, without having to resort to a nationwide shutdown.\nMorris also said the opportunity of having the combined power of many U.S. labs working together was essentially squandered. \"To tackle something like this, you need the big huge commercial machines that are operated by large medical centers, by commercial labs like LabCorp and Quest. You need to get those guys on board.\"\nAnd that, he said, happened way too late.", "url": "https://www.cnn.com/2020/04/09/politics/coronavirus-testing-cdc-fda-red-tape-invs/index.html"}