{"authors": [], "date_download": "2020-05-04 20:14:39", "date_modify": "2020-05-04 20:14:39", "date_publish": "2020-04-09 21:18:08", "description": "ATLANTA (AP) — Georgia Tech athletic director Todd Stansbury says the school met the requirements of its men's basketball postseason ban as part of punishments from the NCAA even though most of...", "filename": "_8f4ca4924d928b421a6380668f252ec4_1588623279.html", "image_url": "https://storage.googleapis.com/afs-prod/media/94dc157bef054beca87d6e7b5e57e63d/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8f4ca4924d928b421a6380668f252ec4_1588623279.html", "title": "NCAA confirms Georgia Tech eligible for 2021 postseason", "title_page": "NCAA confirms Georgia Tech eligible for 2021 postseason", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Georgia Tech head coach Josh Pastner yells to his players in the first half of an NCAA college basketball game against Duke Wednesday, Jan. 8, 2020, in Atlanta. (AP Photo/John Bazemore)\nGeorgia Tech head coach Josh Pastner yells to his players in the first half of an NCAA college basketball game against Duke Wednesday, Jan. 8, 2020, in Atlanta. (AP Photo/John Bazemore)\nATLANTA (AP) — Georgia Tech athletic director Todd Stansbury says the school met the requirements of its men’s basketball postseason ban as part of punishments from the NCAA even though most of the postseason was canceled due to the coronavirus pandemic.\nIn a letter to fans Thursday made available to the public, Stansbury said he was recently informed Georgia Tech completed its mandated ban by removing itself from the Atlantic Coast Conference Tournament on March 2. Georgia Tech made that decision when it withdrew its appeal of the NCAA postseason ban.\nIn the letter, Stansbury wrote the school “recently received official confirmation from the NCAA Committee on Infractions that we met the conditions of the penalty by not participating in this year’s ACC Tournament.”\nBy accepting the ban this year, Georgia Tech will be eligible for all postseason tournaments in the 2020-2021 season.\n“I am very happy for our student-athletes that we no longer have that cloud hanging over us and I am very excited for the future of our men’s basketball program,” Stansbury wrote.\nGeorgia Tech continues its appeal of limits on official visits connected with home games for two seasons and the reduction of one scholarship each of the next four years.\nThe NCAA ruled in September that major recruiting violations were committed by one of coach Josh Pastner’s former assistants, Darryl LaBarrie, as well as one-time friend, Ron Bell. Pastner was not directly named in the NCAA’s findings and was largely cleared in the school’s investigation.\n___\nMore AP college basketball: https://apnews.com/Collegebasketball and https://twitter.com/AP_Top25", "url": "https://apnews.com/8f4ca4924d928b421a6380668f252ec4"}