{"authors": ["Pat Graham"], "date_download": "2020-05-04 20:23:00", "date_modify": "2020-05-04 20:23:00", "date_publish": "2020-04-17 06:02:52", "description": "Sandi Morris set the bar high with her latest do-it-yourself project. Soon, she will be clearing it, too. The Olympic pole vault silver medalist didn’t have a place to practice and...", "filename": "_08d67b09866c36d4eaea6f77fbb2e7ad_1588623780.html", "image_url": "https://storage.googleapis.com/afs-prod/media/a9ccdb007f3241e0ba8c5beaffc55c16/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_08d67b09866c36d4eaea6f77fbb2e7ad_1588623780.html", "title": "Project runway: Olympian Morris builds own pole vault setup", "title_page": "Project runway: Olympian Morris builds own pole vault setup", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Olympic pole vaulting silver medalist Sandi Morris runs on the vaulting pit she is building with her father in Greenville, S.C., Tuesday, April 14, 2020. Morris didn’t have a place to practice and plenty of down time due to the coronavirus pandemic. So she and her father are constructing their own pole vault setup. (AP Photo/John Bazemore)\nOlympic pole vaulting silver medalist Sandi Morris runs on the vaulting pit she is building with her father in Greenville, S.C., Tuesday, April 14, 2020. Morris didn’t have a place to practice and plenty of down time due to the coronavirus pandemic. So she and her father are constructing their own pole vault setup. (AP Photo/John Bazemore)\nSandi Morris set the bar high with her latest do-it-yourself project.\nSoon, she will be clearing it, too.\nThe Olympic pole vault silver medalist didn’t have a place to practice and plenty of down time due to the coronavirus pandemic. So she and her father constructed their own pole-vault setup near Greenville, South Carolina.\nBuilt out of plywood, the 120-foot (36.6-meter) runway is situated between a soccer field and a tennis court on neighborhood land two blocks from her parents’ place. Their pole vault project could be operational as soon as this weekend (they just need the landing mat to arrive).\nViewing is definitely encouraged — from windows for now (social distancing and all).\n“There are tons of houses that can see the field from their windows,” said the 27-year-old Morris, who usually trains in Fayetteville, Arkansas, but traveled home to start the project with the Tokyo Games postponed to next summer and no foreseeable competitions. “So I’m being literal when I say they’re going to watch me from their windows. It will be fun.”\nThis project has been in the back of their mind for ages. Morris would always venture home and wouldn’t be able to stay long because she had to return to practice.\nNow, her coach can simply send along a workout.\n“This virus kind of pushed us to do something that we’ve always wanted to do,” said Morris, who finished second to Katerina Stefanidi of Greece at the 2016 Rio Olympics.\nThe entire endeavor took about three weeks and cost around $4,000 (not counting the landing mat, which usually runs around $30,000 but was loaned to her). There’s a rubber surface covering the runway for better traction, too. No concrete was used so it can be moved (although, not easily).\nEach day, the routine went something like this: Sandi would train in the morning while her father, Harry, worked from home as a geologist. When their day jobs were complete, they headed to the field — about two blocks out their front door — to finish the pole-vault project (friends volunteered their time, too, on property the owner gave a green light to use). The father and daughter would be down there until nearly dark. Most times, she would head home first with her dad saying he would be along shortly.\n“An hour later, he then comes home. My mom’s like, ‘Where were you?’ And he’s like, and this is always the answer, ‘Oh, I was just tinkering,’” explained Morris , who’s earned the silver medal at the last two world outdoor championships . “This project brings him a lot of joy — and that brings me a lot of joy.”\nThe blueprint was provided by Scott Kendricks, the father of two-time world pole vaulting champion Sam Kendricks. The Kendricks family built a similar setup years ago in Mississippi (they’ve since switched to a fabricated runway).\nIt’s no easy task.\n“Almost like building a skate-park — you can really mess it up if you don’t know what you’re doing,” Sam Kendricks said. “But I saw her running on it and I was like, ‘Wow, that’s a fine runway you guys have built.’”\nHe’s eager to try it out — once shelter-at-home restrictions are eased and it’s safer to travel again, of course.\n“Heck yeah. I’d definitely drive through Atlanta to visit Sandi and try that,” Kendricks said.\nMaybe even a competition on it one day? The runway is mobile enough and could be moved to, say, the streets of downtown Greenville for an event like the Liberty Bridge Jump Off .\n“If you build it, they will come,” Kendricks joked. “Or they’ll ask to.”\nTo stay sharp, Morris is working out with recently purchased weight room equipment . She’s also enjoying some down time at home. She recently purchased a bunny for her niece (“scored some cool points,” she laughed).\nIt was one highlight after another last fall for Morris, who grabbed second at the world championships in Doha, Qatar. Soon after, she married Bermuda long jumper Tyrone Smith. They’re currently in different locations, though, as he balances training for the Olympics with business school at the University of Texas.\nMaybe down the road, a long-jump project.\n“There’s not really a great place for him to jump here,” she explained. “There are high school tracks that have long-jump pits, but most of them don’t have a long enough runway.”\nAs for the Olympics being pushed back until next summer, she’s trying to look at the positive — no matter how hard it may be. Diamond League meets are postponed until at least June.\n“Building this has been such an incredible distraction,” Morris said. “The pole vaulting here will allow me to just go out and have fun.”\n___\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports", "url": "https://apnews.com/08d67b09866c36d4eaea6f77fbb2e7ad"}