{"authors": ["The Associated Press"], "date_download": "2020-05-04 21:07:19", "date_modify": "2020-05-04 21:07:19", "date_publish": "2020-04-05 07:41:00", "description": "The Latest on the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people. For some, especially older adults and people with existing health problems, it can...", "filename": "_7ce3c37524d9c5e965eda6c5dbdae35a_1588626439.html", "image_url": "https://storage.googleapis.com/afs-prod/media/28b477e3f9634ab0ab4253d4088a0ead/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7ce3c37524d9c5e965eda6c5dbdae35a_1588626439.html", "title": "The Latest: South Korea health minister urges vigilance", "title_page": "The Latest: South Korea health minister urges vigilance", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CORRECTS THE MONTH - Coral Princess cruise crew members looks from their balcony at PortMiami as the coronavirus pandemic continues on Sunday, April 5, 2020 in Miami. (David Santiago/Miami Herald via AP)\nCORRECTS THE MONTH - Coral Princess cruise crew members looks from their balcony at PortMiami as the coronavirus pandemic continues on Sunday, April 5, 2020 in Miami. (David Santiago/Miami Herald via AP)\nThe Latest on the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people. For some, especially older adults and people with existing health problems, it can cause more severe illness or death.\nTOP OF THE HOUR:\n— 13 hospitalized, 1 dead from cruise ship with coronavirus victims in Miami\n— Washington will return over 400 ventilators to be given to harder-hit states\n— South Korea reports 47 new cases of coronavirus\n— UN Secretary-General says domestic violence reports on rise during pandemic\n— China reports 38 new coronavirus cases, all but one imported\n— British Prime Minister Johnson admitted to a hospital with the coronavirus.\n— Bronx Zoo tiger tests positive for the coronavirus.\n— Fauci: Very good chance coronavirus “will assume a seasonal nature.”\n___\nSEOUL, South Korea — South Korea’s vice health minister has urged vigilance to maintain hard-won gains against the new coronavirus.\nKim Gang-lip expressed concerns over loosened attitudes toward social distancing that he says puts the country at potential risk of an infection “explosion” similar to Europe and the United States.\nHis warning on Monday came after the country reported 47 new cases of the coronavirus, the smallest daily jump since Feb. 20. Infections have continued to wane in the worst-hit city of Daegu, where 6,781 of the country’s 10,284 cases have been reported.\nHowever, there’s alarm over a steady rise in infections linked to international arrivals as students and other South Korean nationals flock back from the West amid broadening outbreaks and suspended school years. This has inflated the caseload in the densely populated Seoul metropolitan area, where about half of South Korea’s 51 million people live, prompting Gyeonggi province governor Lee Jae-myung to warn last week that an “explosion in infections is almost certain.”\n“There’s still danger that an explosion in local transmissions which we have been seeing in Europe and the United States can happen in our society at any time, which would collapse our hospital system and spike death rates,” Kim said.\nKim pleaded for people to stay at home, citing smartphone data that showed increased crowds in Seoul’s public parks and leisure districts over the past two weeks. While South Korea’s government has shut schools and issued social-distancing guidelines for the public, it has not enforced lockdowns or ordered unessential businesses to close.\n___\nMIAMI — Authorities say 14 people have been taken to hospitals from a cruise ship that docked in Florida with coronavirus victims aboard and one of them has died.\nTwo fatalities were reported earlier aboard the Coral Princess, which docked Saturday in Miami. The ship had more than 1,000 passengers and nearly 900 crew members.\nAuthorities did not immediately disclose whether the 14 people removed for immediate medical attention had a confirmed coronavirus link.\nThe Princess Cruises line ship began disembarking fit passengers cleared for charter flights Sunday. The cruise line said it was delayed by a U.S. Centers for Disease Control and Prevention policy preventing passengers from being placed on commercial flights.\nAnyone with symptoms of the disease or recovering from it were being kept on ship until medically cleared.\n___\nOLYMPIA, Wash. -- Washington Gov. Jay Inslee said the state will return more than 400 ventilators of the 500 it has received from the federal government so they can go to New York and other states hit harder by the coronavirus.\nThe Democratic governor said Sunday that his statewide stay-at-home order and weeks of social distancing have led to slower rates of infections and deaths in Washington.\nWashington state has 7,666 confirmed cases of the virus and 322 deaths, according to a Johns Hopkins University tally on Sunday afternoon. New York has more than 122,000 confirmed cases and more than 4,000 deaths.\nWashington received 500 ventilators last month from the Strategic National Stockpile.\n“I’ve said many times over the last few weeks: We are in this together,” Inslee said. “This should guide all of our actions at an individual and state level in the coming days and weeks.”\n___\nSEOUL, South Korea — South Korea has reported 47 new cases of the coronavirus and three more fatalities, bringing its totals to 10,284 infections and 186 deaths.\nSouth Korea’s Centers for Disease Control and Prevention on Monday said at least 769 of the infections were linked to passengers arriving from overseas, with most of the cases detected in the past three weeks in the densely populated Seoul metropolitan area.\nThe country’s caseload has slowed from early March, when it was reporting around 500 new cases a day, but officials have raised concern over a steady rise in infections imported from overseas or occurring in hospitals, nursing homes and other live-in facilities.\nDuring the weekend, officials extended a government guideline urging people to social distance to slow the spread of the virus by two weeks, guarding against increasing infections in the Seoul metropolitan area and broadening outbreaks in Europe and the United States.\n___\nUNITED NATIONS — United Nations Secretary-General Antonio Guterres says there has been “a horrifying global surge in domestic violence” in recent weeks as fear of the coronavirus pandemic has grown along with its social and economic consequences.\nThe U.N. chief, who appealed on March 23 for an immediate cease-fire in conflicts around the world to tackle COVID-19, said in a statement Sunday night it is now time to appeal for an end to all violence, “everywhere, now.”\nGuterres said that “for many women and girls, the threat looms largest where they should be safest — in their own homes.”\n“And, so, I make a new appeal today for peace at home — and in homes — around the world,” he said.\nThe secretary-general said in some countries, which he didn’t name, “the number of women calling support services has doubled.”\nAt the same time, he said, health care providers and police are overwhelmed and understaffed, local support groups are paralyzed or short of funds, and some domestic violence shelters are closed while others are full.\n“I urge all governments to make the prevention and redress of violence against women a key part of their national response plans for COVID-19,” Guterres said.\n___\nBEIJING -- China on Monday reported 39 new cases of coronavirus infection — 38 of them imported — one additional death, 10 suspected cases and 1,047 asymptomatic cases under observation.\nThere were no new confirmed or suspected cases in the epicenter city of Wuhan, where a 14-week lockdown is due to be lifted on Wednesday.\nChina has now recorded a total of 81,708 cases and 3,331 deaths since the COVID-19 illness was first detected there in late December.\n___\nLONDON — British Prime Minister Boris Johnson has been admitted to a hospital with the new coronavirus.\nJohnson’s office says he is being admitted for tests because he still has symptoms, 10 days after testing positive for the virus.\nDowning St. says the hospitalization is a “precautionary step” and he remains in charge of the government.\nJohnson, 55, has been quarantined in his Downing St. residence since being diagnosed with COVID-19 on March 26.\n___\nNEW YORK — A tiger at the Bronx Zoo has tested positive for the new coronavirus, in what is believed to be the first known infection in an animal in the U.S. or a tiger anywhere, federal officials and the zoo said Sunday.\nThe 4-year-old Malayan tiger, and six other tigers and lions that have also fallen ill, are believed to have been infected by a zoo employee, the U.S. Department of Agriculture said. The first animal started showing symptoms March 27, and all are expected to recover, said the zoo, which has been closed to the public since March 16.\nThe finding raises new questions about transmission of the virus in animals. The USDA says there are no known cases of the virus in U.S. pets or livestock.\nThe coronavirus outbreaks around the world are driven by person-to-person transmission, experts say.\nThere have been reports of a small number of pets outside the United States becoming infected after close contact with contagious people, including a Hong Kong dog that tested positive for a low level of the pathogen in February and early March. Hong Kong agriculture authorities concluded that pet dogs and cats couldn’t pass the virus to human beings but could test positive if exposed by their owners.\n___\nBoeing said it will continue its shutdown of production indefinitely at its Seattle-area facilities because of the spread of the coronavirus.\nThe company in an email to Washington employees said it is extending the planned two-week shutdown rather than reopening Wednesday. The decision affects about 30,000 of Boeing’s 70,000 employees in the state.\nThe company said the decision is based on the health and safety of its employees, assessment of the coronavirus spread, supply chain concerns and recommendations from government health officials.\n___\nRepublican U.S. Rep. Mario Diaz-Balart of Florida, who was the first congressman to test positive for coronavirus, announced on Twitter that he is now virus free.\n“Today, after being deemed #COVID19 free by my doctor, I was able to reunite with my family in Miami. Though still a bit weak, I feel well, & I applied to participate in the @RedCross plasma donation to help those with serious or immediately life-threatening COVID-19 infections.”\n___\nNEW ORLEANS — The city’s Catholic population struggled to celebrate Palm Sunday at a time when the city’s churches have stopped holding services under the state’s stay-at-home mandate.\nThat has meant finding creative ways for pastors to meet the spiritual needs of their parishioners. Rev. Emmanuel Mulenga is the pastor at Saint Augustine Catholic Church, a nearly 200-year-old church in the city’s historically African American Treme neighborhood.\nOn Palm Sunday, the church would normally have a special ceremony to commemorate Jesus’s entry into Jerusalem. This Sunday, he still gave out palm fronds to parishioners who wanted them while still adhering to social distancing guidelines. He blessed the fronds and put them on a table near the back of the church where people could easily spot them when they came in the back door.\nAbout 50 to 60 parishioners turned out, Mulenga said.\n“Despite the social distancing ... the spiritual aspects of our lives, faith, still continues, and I personally believe that under the present circumstances we need those personal connections and prayer even more,” he said.\n___\nThe company 3M said it is working with German authorities to determine whether an incorrect report of one of its mask shipments being diverted to the United States was due to fraud.\nBerlin authorities had said last week that a shipment of 200,000 masks intended for Berlin police had been seized in Thailand en route from China.\nIn a statement Sunday, 3M said it had no record of an order for Berlin police and has offered to help governments verify the authenticity of any offers to sell protective masks, which are used to prevent the spread of coronavirus to health workers and others.\n___\nLouisiana health officials reported 68 coronavirus-related deaths on Sunday, marking the state’s biggest jump in reported deaths since the outbreak began.\nThe Louisiana Department of Health reported the figures on its website Sunday. The number of infections reported to the state also increased by more than 500 cases from 12,496 to 13,010.\nBefore Sunday, the largest number of deaths reported in a single day was 60. The numbers represent when the tests were reported to the state, not necessarily when the infections or deaths occurred.\nLouisiana and the New Orleans area have been an epicenter for the virus, and Gov. John Bel Edwards has repeatedly warned of looming shortages for ventilators and intensive care units.\n___\nWASHINGTON — The District of Columbia has announced 96 more positive infections from the COVID-19 coronavirus, bringing the total up to 998, with 22 deaths.\nMayor Muriel Bowser has issued a stay-home order for Washington’s approximately 700,000 residents. Neighboring Maryland and Virginia have done the same. Bowser has declared a state of emergency, shuttered all schools and ordered all non-essential businesses to close. White House and Capitol tours have been cancelled and the National Zoo, Smithsonian museum network and Kennedy Center have closed.\n___\nANNAPOLIS, Md. — Gov. Larry Hogan announced new mandates for Maryland’s nursing homes in order to dull the spread of COVID-19, which has invaded dozens of facilities in the state.\nUnder the threat of criminal penalties, Hogan’s order and directive from his health secretary demand that nursing home employees in close contact with residents wear facemasks, gloves, gowns and other personal protective gear when providing care.\nNursing homes must have expedited testing for the new coronavirus and designated areas where residents with known or suspected COVID-19 are treated, according to the new rules.\nViolating the rules is a misdemeanor punishable by fines and prison.\nHogan said more than 80 nursing homes and long-term care facilities have positive cases or clusters of cases. The most intense cluster is at the Pleasant View Nursing Home in Mount Airy, where four more residents diagnosed with COVID-19 have now died, bringing the total to nine, health officials announced this weekend. More than 100 residents or staff have tested positive there.\nThe Maryland health department issued guidance nearly four weeks ago to restrict resident visitations and control infections.\n___\nATLANTA — One of the daughters of the Rev. Martin Luther King Jr. will help lead a new outreach committee in Georgia as the state copes with the coronavirus, Gov. Brian Kemp announced.\nBernice King, CEO of The King Center, will co-chair the committee with Engaged Futures Group LLC President Leo Smith, Kemp said. More than a dozen other members, including business and nonprofit leaders, make up the committee.\nOfficials did not immediately release additional details about what the committee will do.\nGeorgia has seen more than 200 deaths in the state and more than 1,200 have been hospitalized. Total infections confirmed in the state exceed 6,600.\n___\nSIOUX FALLS, S.D. — The number of confirmed cases of COVID-19 in South Dakota rose to 240 Sunday as President Donald Trump declared a major disaster for the state.\nTrump’s order directs federal assistance to supplement state, tribal and local recovery efforts in areas hit by the coronavirus pandemic.\nThe South Dakota Department of Health reported 28 new confirmed cases of the coronavirus Sunday. That number does not include tests pending in private labs or those who are not being tested.\nMinnehaha County reports 23 new positive tests, bringing the total number of cases in South Dakota’s most populous county to 104. Eighteen of those patients in Minnehaha County have recovered.\n___\nSAN JUAN, Puerto Rico — The ACLU says it is seeking an injunction to block part of Puerto Rico’s strict curfew against the new coronavirus and argues that some of its restrictions are unconstitutional.\nThe curfew imposed March 15 has shuttered non-essential businesses in the U.S. territory and ordered people to stay home from 7 p.m. to 5 a.m. and remain there even outside those hours unless they have to buy food or medicine, go to the bank or have an emergency or health-related situation.\nViolators face a $5,000 fine or a six-month jail term, and police have cited hundreds of people. A spokesman for the U.S. territory’s Justice Department said Sunday there was no immediate comment.\nIt is the first time the ACLU has decided to file a lawsuit in a U.S. jurisdiction related to a coronavirus curfew.\n___\nDefense Secretary Mark Esper has issued new requirements for those visiting or working on Department of Defense installations regarding the use of cloth face coverings.\nEsper says that “to the extent practical,” all individuals on DOD property “will wear” the face coverings when they cannot maintain 6 feet of social distance from others.\nThe guidance is effective immediately. It follows a recommendation from the Centers for Disease Control and Prevention that encourages people, especially in areas hit hard by the spread of the coronavirus, to use rudimentary coverings such as T-shirts, bandannas and non-medical masks to cover their faces while outdoors.\nEsper outlined the new requirements in a memorandum to senior military leaders Sunday.\nEsper said the requirement doesn’t apply to a service member’s personal residence on a military installation. But it does apply to work centers and other public areas.\nHe says exceptions may be approved by local commanders or supervisors and then submitted up the chain of command for awareness.\n___\nPARIS — France reported 357 deaths in hospitals from the virus in a single day Sunday but showed signs that its spread is slowing after 20 days of national confinement.\nThe country remains among the hardest hit in the world, with 8,078 confirmed deaths since the virus arrived in January. More than a quarter of those who died were in nursing homes, according to figures from the national health service Sunday night.\nFrance’s intensive care units continue to fill up fast, with 390 new arrivals since Saturday for a total of 6,978 people in critical care beds. But the daily growth has been slowing, and 250 people left intensive care in the same one-day period. Most of those in intensive care are older, but 106 are under 30 years old.\nWhile still high, the number of new deaths in hospitals dropped Sunday for the second day straight and was the lowest since March 29.\nFrance continued Sunday to transport critically ill patients out of saturated regions to those with more hospital space and has brought in hundreds of medical personnel to help in the overwhelmed Paris region.\n___\nWASHINGTON — Dr. Anthony Fauci says there a very good chance the new coronavirus “will assume a seasonal nature” because it is unlikely to be under control globally.\nFauci is director of the National Institute of Allergy and Infectious Diseases. He says the virus is unlikely to be completely eradicated from the planet this year. That means the U.S. could see the “beginning of a resurgence” during the next flu season.\nFauci says the prospect of a resurgence is the reason the U.S. is working so hard to get its preparedness “better than it was.” He says that includes working to develop a vaccine and conducting clinical trials on therapeutic interventions.\nFauci also says states that don’t have stay-at-home orders are not putting the rest of the country at risk as much as they are putting themselves at risk.\nFauci spoke on CBS’s “Face the Nation.”\n___\nLOUISVILLE, Ky. — Some Kentucky churches held Palm Sunday services in defiance of Gov. Andy Beshear’s warning against in-person worship.\nDozens of people were at Maryville Baptist Church in Louisville on Sunday, news outlets reported. A video showed a pianist playing and choir members singing during the late morning service.\nLouisville’s Our Savior Lutheran Church streamed its in-person service live on YouTube. The church had required online registration beforehand and restricted seating to every other pew. The video stream did not show the audience.\nBeshear warned during his daily briefing on Saturday that mass gatherings “are spreading the coronavirus.\n“We care about each other in this state, and our faith guides us and gives us the wisdom to do the right thing to protect each other.”\nSome states, including Florida, have made exemptions to allow religious gatherings to proceed during the coronavirus. Kentucky does not have that exemption.\n___\nFollow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/7ce3c37524d9c5e965eda6c5dbdae35a"}