{"authors": ["Analysis Brian Lowry"], "date_download": "2020-05-04 17:01:40", "date_modify": "2020-05-04 17:01:40", "date_publish": "2020-04-10 14:12:39", "description": "\"Trolls World Tour\" isn't good -- far from it -- but watching it at home nevertheless made me wistful for what it would have been like to see it in a theater.", "filename": "2020_04_10_entertainment_trolls-world-tour-column_index_1588611700.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200317131507-trolls-world-tour-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_entertainment_trolls-world-tour-column_index_1588611700.html", "title": "'Trolls World Tour' review", "title_page": "'Trolls World Tour' review - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) \"Trolls World Tour\" isn't good -- far from it -- but watching it at home nevertheless made me wistful for what it would have been like to see it in a theater.\nDue to coronavirus, Universal Pictures shifted the movie's planned theatrical release to make it available on demand -- one of the first major films to bypass theaters entirely amid shelter-at-home orders. In theory, it would be an escape for kids, and potentially allow the studio to recoup at least some of its investment.\nCreatively speaking, this DreamWorks Animation-produced sequel to the 2016 movie \"Trolls\" is completely forgettable -- psychedelic and colorful, with a message that celebrates our differences in the most obvious way. The plot, such as it is, involves a villain named Barb (voiced by \"Crazy Ex-Girlfriend's\" Rachel Bloom) who sings hard rock and wants to eradicate all other forms of music in the Trolls' land.\nIt falls to Poppy (Anna Kendrick), the Troll pop princess, and her pal Branch (Justin Timberlake) to try thwarting her, via a tour of all the different music in the extended kingdom, including hip hop, country and classical.\nWhere the best animated movies work for both adults and kids, \"Trolls\" doesn't really have much to offer either. It's too aimless and loud for grownups who might appreciate some of the references and vocal cameos, and while there's a lot to look at and hear in a jukebox musical manner, it's hard to imagine many kids understanding jokes at the expense of smooth jazz and yodeling.\nRead More", "url": "https://www.cnn.com/2020/04/10/entertainment/trolls-world-tour-column/index.html"}