{"authors": ["Katie Lobosco"], "date_download": "2020-05-04 15:56:21", "date_modify": "2020-05-04 15:56:21", "date_publish": "2020-04-14 21:50:53", "description": "The Internal Revenue Service started sending out stimulus payments this week -- but while 80 million people can expect the money to hit their bank accounts by Wednesday, others will be waiting longer before the cash is in their hands.", "filename": "2020_04_14_politics_get-my-payment-stimulus-checks-irs_index_1588607781.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200411192442-irs-exterior-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_14_politics_get-my-payment-stimulus-checks-irs_index_1588607781.html", "title": "Get my payment: Here's how to check your stimulus money", "title_page": "Get my payment: Here's how to check your stimulus money - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Internal Revenue Service started sending out stimulus payments this week -- but while 80 million people can expect the money to hit their bank accounts by Wednesday, others will be waiting longer before the cash is in their hands.\nThe first payments will go to those who've already filed their 2018 or 2019 tax returns and authorized the Internal Revenue Service to make a direct deposit if they were due a refund. Within that group, the agency is starting with people with the lowest incomes. Social Security recipients will also automatically receive their payments, even if they haven't filed a return.\nThere are tens of millions of people who don't fall into those categories. Taxpayers who haven't authorized a direct deposit could be waiting weeks for a check in the mail -- though they can update their bank information using Treasury's new web portal, which went live Wednesday.\nWhat you need to know about the stimulus bill\nThose who haven't been required to file a return during the past two years may have to submit some information online before receiving the payment.\nStill, the Treasury Department has said that \"a large majority of eligible Americans\" will receive the payments, which were authorized under the $2.2 trillion congressional coronavirus relief plan in March , by April 24.\nHow do I check on the status of my payment?\nThe IRS created an online tool, called Get My Payment , that can be used to check on the status of your money. It launched Wednesday and is available on the IRS website.\nYou'll need to enter your Social Security number, date of birth and mailing address in order to track your payment, the Treasury Department said.\nSome people who used the tool on Wednesday received a message that their payment status was not available. The Treasury Department suggested checking again because it only updates the tool once daily, usually overnight.\nAm I eligible?\nEligibility is largely based on income, and it excludes individuals earning more than $99,000, head of household filers with one child who earn more than $146,500, and married couples without children earning more than $198,000.\nFamilies earning a little more may still be eligible if they have children. The phase-out limit depends on how many children they have. For a typical family of four, the amount is completely phased out for those with incomes exceeding $218,000.\nThose who can be claimed as a dependent for tax purposes, like many college students, are also ineligible for the payments, as well as undocumented immigrants who don't have Social Security numbers.\nBut everyone else should receive some money. It won't be taxed as income and won't be offset by any back taxes owed. It also won't affect refund payments for 2019.\nHow much will I get?\nIndividuals and heads of households are due up to $1,200 and married couples will receive up to $2,400 -- plus $500 per child.\nBut payments start phasing out for individuals with adjusted gross incomes of more than $75,000, heads of households earning more than $112,500, and married couples who earn more than $150,000. The amount will then be reduced by $5 for every additional $100 of adjusted gross income.\nSee how much you're eligible for here\nHow can I get my money faster?\nThe IRS is first sending money to those for whom it has bank account information on file. That might not be you if you haven't received a tax refund over the past two years -- or if you received a refund by a check in the mail, rather than by a direct deposit.\nBut the Get My Payment tool, which launched Wednesday, will also allow taxpayers to input their bank account information so that they can receive the money electronically rather than by a paper check -- which could take weeks, or even months.\nTo do so, a taxpayer will need to submit their adjusted gross income from their most recent tax return, the refund or amount owed that year, as well as the account and routing numbers for their bank account.\nHowever, taxpayers won't be able to update their bank information once the payment is already scheduled for delivery, and it won't allow you to update bank information already on file, the Treasury Department said.\nWhat if I haven't filed a tax return?\nThere are millions of low-income people who are not normally required to file tax returns that will have to take some action before receiving their stimulus money.\nGenerally, these are individuals who did not earn more than $12,200 last year or married couples who did not earn more than $24,400.\nBut they won't have to file a whole new form, as earlier guidance from the IRS suggested. Instead, it created an online tool that asks for basic information including names, date of births, and Social Security numbers for the person filing and his or her dependents. They won't have to provide any income information.\nThe new tool is \"very straightforward, and likely much faster, than requiring non-filers to fill out and submit a tax form,\" said Erica York, an economist at the Tax Foundation.\nThe challenge will be making sure those people are aware of the tool and helping those who don't have access to the Internet at home, she said.\nThis story has been updated to reflect that the Get My Payment website is now live.", "url": "https://www.cnn.com/2020/04/14/politics/get-my-payment-stimulus-checks-irs/index.html"}