{"authors": ["Jim Acosta", "Maegan Vazquez"], "date_download": "2020-05-04 16:16:38", "date_modify": "2020-05-04 16:16:38", "date_publish": "2020-04-03 18:59:00", "description": "The White House will give rapid Covid-19 tests to anyone who will come in close proximity with either President Donald Trump and Vice President Mike Pence, CNN has confirmed.", "filename": "2020_04_03_politics_trump-pence-coronavirus-tests_index_1588608998.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327132605-president-trump-vice-president-pence-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_trump-pence-coronavirus-tests_index_1588608998.html", "title": "White House says anyone 'in close proximity' to Trump or Pence will get rapid virus test", "title_page": "White House says anyone 'in close proximity' to Trump or Pence will get rapid virus test - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The White House will give rapid Covid-19 tests to anyone who will come in close proximity with either President Donald Trump and Vice President Mike Pence, CNN has confirmed.\n\"As the physician to the President and White House Operations continue to protect the health and safety of the President and vice president, starting today anyone who is expected to be in close proximity to either of them will be administered a Covid-19 test to evaluate for pre-symptomatic or asymptomatic carriers status to limit inadvertent transmission,\" said deputy White House press secretary Judd Deere in a statement.\nWhite House officials are declining to specify what counts as \"close proximity\" but one official said members of the White House press corps who participate in the daily briefings will not have to take the tests.\nAs the administration has worked on its response to the pandemic, Trump has continued to meet with outside industry representatives, brief the press with his White House coronavirus task force and interact with his staff and advisers in person. Sometimes, both the President and those around him have not been practicing social distancing guidelines suggesting six feet between each person.\nBoth Trump and Pence have also continued to travel. Last week, Trump saw the USNS Comfort hospital ship set sail for New York. And this week, Pence visited a Walmart distribution facility, where he was not practicing social distancing with the facility's employees.\nRead More", "url": "https://www.cnn.com/2020/04/03/politics/trump-pence-coronavirus-tests/index.html"}