{"authors": ["Chandelis Duster", "Sarah Mucha"], "date_download": "2020-05-04 16:06:46", "date_modify": "2020-05-04 16:06:46", "date_publish": "2020-04-02 12:56:10", "description": "Joe Biden said he believes the Democratic National Convention scheduled to take place in July will be pushed back a month later because of the coronavirus pandemic.", "filename": "2020_04_02_politics_joe-biden-democratic-convention_index_1588608406.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/151016114726-03-joe-biden-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_joe-biden-democratic-convention_index_1588608406.html", "title": "Biden says he thinks the Democratic convention will 'have to move into August'", "title_page": "Joe Biden says he thinks the Democratic convention will 'have to move into August' - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Joe Biden said he believes the Democratic National Convention scheduled to take place in July will be pushed back a month later because of the coronavirus pandemic.\n\"I doubt whether the Democratic Convention is going to be able to be held in mid-July or early July. I think it's gonna have to move into August,\" the former vice president told Jimmy Fallon on \"The Tonight Show\" Wednesday night. \"We just have to be prepared for the alternative and the alternative, we don't know what it's going to be unless we have a better sense of whether this curve is going to move down or up.\"\nAs the number of confirmed coronavirus cases continues to rise across the United States, there have been unexpected changes to the election process, including postponed primaries and a virtual halt of all in-person campaigning. During an interview on MSNBC Tuesday, Biden said it was \"hard to envision\" Democrats gathering in an arena and the convention taking place as planned.\nCNN previously reported that Democrats are considering a range of contingency plans for the convention, including shortening the in-person portion or going entirely digital.\nBiden also criticized President Donald Trump's response to coronavirus and the lack of testing kits. He said the President just started to \"grasp the reality\" of the potential death toll the pandemic will take on the country.\nRead More", "url": "https://www.cnn.com/2020/04/02/politics/joe-biden-democratic-convention/index.html"}