{"authors": ["Alicia Lee"], "date_download": "2020-05-04 16:56:22", "date_modify": "2020-05-04 16:56:22", "date_publish": "2020-04-08 21:48:34", "description": "One of Ellen DeGeneres' jokes backfired this week after some people called her out for comparing self-quarantining during the coronavirus pandemic to \"being in jail.\"", "filename": "2020_04_08_entertainment_el_9f17d8f74e70d58c6771c5afaf4020f4_index_1588611382.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408143455-ellen-degeneres-0126-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_entertainment_el_9f17d8f74e70d58c6771c5afaf4020f4_index_1588611382.html", "title": "Ellen DeGeneres sparks backlash after joking that self-quarantine is like 'being in jail'", "title_page": "Ellen DeGeneres sparks backlash after joking that self-quarantine is like 'being in jail' - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) One of Ellen DeGeneres' jokes backfired this week after some people called her out for comparing self-quarantining during the coronavirus pandemic to \"being in jail.\"\nThe popular host, who like many TV hosts has made her show virtual amid stay-at-home orders, said the comment while broadcasting to viewers from her home on Monday.\n\"One thing that I've learned from being in quarantine is that people -- this is like being in jail, is what it is,\" she said. \"It's mostly because I've been wearing the same clothes for 10 days and everyone in here is gay.\"\nThe video, which as of Wednesday afternoon was listed as \"unavailable\" on YouTube, was deemed \"tone deaf\" by some viewers, who responded to the episode in the comments section of the platform.\n\"I feel bad for the kids at home, all the college students, all the parents,\" DeGeneres went on to say. \"I feel bad for a lot of people. But I think that a lot of people out there need words of encouragement, and that's what I want to do.\"", "url": "https://www.cnn.com/2020/04/08/entertainment/ellen-degeneres-quarantine-jail-trnd/index.html"}