{"authors": ["Alicia Lee"], "date_download": "2020-05-04 16:23:17", "date_modify": "2020-05-04 16:23:17", "date_publish": "2020-04-06 16:22:52", "description": "Kids, you can rest easy. The coronavirus will not prevent the Tooth Fairy and Easter Bunny from visiting you with presents.", "filename": "2020_04_06_world_jacinda-ar_e9f4ad0b755473ba1ab9e47f61b70af4_index_1588609397.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406115239-jacinda-ardern-0406-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_world_jacinda-ar_e9f4ad0b755473ba1ab9e47f61b70af4_index_1588609397.html", "title": "New Zealand PM adds Tooth Fairy and Easter Bunny to list of 'essential workers'", "title_page": "New Zealand PM adds Tooth Fairy and Easter Bunny to list of 'essential workers' - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Kids, you can rest easy. The coronavirus will not prevent the Tooth Fairy and Easter Bunny from visiting you with presents.\nYou can thank New Zealand Prime Minister Jacinda Ardern, who added the two mythical definitely real characters to the list of essential workers.\n\"You'll be pleased to know that we consider both the Tooth Fairy and the Easter Bunny to be essential workers,\" Ardern said at a news conference Monday. \"But as you can imagine, at this time, of course, they're going to be potentially quite busy at home with their family as well and their own bunnies.\"\n\"So I say to the children of New Zealand, if the Easter Bunny doesn't make it to your household, we have to understand that it's a bit difficult at the moment perhaps for the bunny to get everywhere,\" Ardern added.\nThe Prime Minister went on to suggest that families could create Easter egg hunts for their neighborhood while respecting social distancing by drawing colored eggs and taping them to the front windows of their homes.\nRead More", "url": "https://www.cnn.com/2020/04/06/world/jacinda-ardern-easter-bunny-essential-workers-trnd/index.html"}