{"authors": ["Opinion John Feinblatt"], "date_download": "2020-05-04 16:26:08", "date_modify": "2020-05-04 16:26:08", "date_publish": "2020-04-07 13:04:21", "description": "John Feinblatt writes that it is both shameful and nonsensical for the federal government to deem gun stores essential -- a special privilege that millions of other shuttered small businesses can only dream about -- during the Covid-19 pandemic.", "filename": "2020_04_07_opinions_gun-sto_9cb5d2c4ca2b08f2754331ae56a7b520_index_1588609568.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402004756-gun-sales-0315-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_opinions_gun-sto_9cb5d2c4ca2b08f2754331ae56a7b520_index_1588609568.html", "title": "Deeming gun stores essential is unfair", "title_page": "Deeming gun stores essential is unfair — and unsafe (Opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "John Feinblatt is president of Everytown for Gun Safety, an organization working to end gun violence and build safer communities. The opinions expressed in this commentary belong to the author; view more opinion articles on CNN.\n(CNN) Much is still unknown about Covid-19, but one thing is certain: Owning a gun does not make you any safer from it. But that didn't stop the Trump administration from caving to the firearm industry by treating gun store workers just like the real frontline responders-- police, doctors, nurses-- in new advisory guidelines issued to state and local officials that designate who should be allowed to keep working during the pandemic.\nJohn Feinblatt\nIt is both shameful and nonsensical for the federal government to deem gun stores essential, a special privilege that millions of other shuttered small businesses can only dream about. The argument for keeping grocery stores and pharmacies open during a pandemic is self-evident. People need to be able to access food and medication in order to preserve public health, so it's worth the risk of allowing people to congregate -- while observing social distancing.\nThis calculus clearly doesn't apply to firearm sales. In fact, when you examine the evidence, it's clear that allowing gun stores to stay open in a time of self-quarantine and heightened stress will likely send more people to the hospital just when our medical system is already under unprecedented strain.\nWe only need to look back to the 2008 financial crisis for indications that the economic conditions created by coronavirus could be deadly. Researchers estimate that 4,750 more Americans died by suicide during the Great Recession than would have been expected otherwise, and they attribute some of this increase to rising unemployment. Given that this week's unemployment numbers already dwarf what we saw then, there is good reason to believe that the risk of suicide will rise, and that's even more true for people with easy access to a gun -- about half of all suicide deaths are with a firearm, according to CDC data analyzed by the Pew Research Center. All told, an average of 22,926 people die by gun suicide every year.\nBut firearm suicide is not the only form of gun violence that needs to be considered when factoring in whether to keep gun stores open. At least 4.6 million American children live in homes with unsecured guns, and many of those children are now confined to those homes, with lots of free time on their hands -- and lots of new worries. Recently, a 13-year-old in New Mexico was killed when his cousin allegedly shot him with a gun that the cousin said he brought home to \"protect\" himself during the pandemic. In addition, parents -- especially parents who own guns -- should be aware that research has shown a link between social isolation and suicide in young people.", "url": "https://www.cnn.com/2020/04/07/opinions/gun-stores-open-covid-19-unsafe-feinblatt/index.html"}