{"authors": ["Lisa Mascaro"], "date_download": "2020-05-04 20:12:02", "date_modify": "2020-05-04 20:12:02", "date_publish": "2020-04-07 16:11:07", "description": "WASHINGTON (AP) — As Congress races to craft the next coronavirus rescue package, President Donald Trump's sudden request Tuesday to pump $250 billion more into a just-launched small businesses...", "filename": "_c0d3f5f69f8141848929b0b4d182c7bf_1588623122.html", "image_url": "https://storage.googleapis.com/afs-prod/media/4a644c2d25dc40d691fe8b0ed21142bd/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c0d3f5f69f8141848929b0b4d182c7bf_1588623122.html", "title": "Trump seeks $250 billion for payrolls in virus aid showdown", "title_page": "Trump seeks $250 billion for payrolls in virus aid showdown", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this March 25, 2020, file photo, Senate Majority Leader Mitch McConnell, R-Ky. gives a thumbs up as he leaves the Senate chamber on Capitol Hill in Washington, where a deal has been reached on a coronavirus bill. Democrat Amy McGrath's campaign released a TV ad Friday, April 3, 2020, lambasting the Kentucky Republican for “taking a victory lap against the coronavirus.\" (AP Photo/Andrew Harnik)\nFILE - In this March 25, 2020, file photo, Senate Majority Leader Mitch McConnell, R-Ky. gives a thumbs up as he leaves the Senate chamber on Capitol Hill in Washington, where a deal has been reached on a coronavirus bill. Democrat Amy McGrath's campaign released a TV ad Friday, April 3, 2020, lambasting the Kentucky Republican for “taking a victory lap against the coronavirus.\" (AP Photo/Andrew Harnik)\nWASHINGTON (AP) — As Congress races to craft the next coronavirus rescue package, President Donald Trump’s sudden request Tuesday to pump $250 billion more into a just-launched small businesses payroll program sets up a new showdown over aid.\nTreasury Secretary Steven Mnuchin said more money is needed for the popular new $350 billion Paycheck Protection Program , which took off last Friday but was quickly overrun as companies jumped at the chance to tap up to $10 million in forgivable loans to keep paychecks flowing amid the stay-home shutdown.\nMnuchin requested the funds in private calls to House Speaker Nancy Pelosi and Senate Majority Leader Mitch McConnell. Democrats largely support it as a component of a broader new aid package, but McConnell wants to swiftly jam it through Congress this week, even though the House and Senate are all but shuttered.\n“The way it’s going, we’re going to need that, because the people are loving it,” Trump said in a conference call with banking executives open to the press.\nThe push for the hefty sum, now heading for a vote with just 48 hours notice, threatens to upset the fragile agreement between the political leaders that more needs to be done amid the pandemic and its stark economic shutdown.\nThe House was already preparing to boost the small business program as part of a broader $1 trillion package Pelosi wants as a follow-up to the sweeping $2.2 trillion rescue that became law in late March.\nWith jobless rates soaring to record highs, Pelosi called the small business program “very important” Tuesday.\nBut Pelosi also said she wants assurances the money flying out the door is going to those who need it. “We do have to have oversight to make sure everybody who qualifies has access,” she said on CNN.\nBy jumping ahead, McConnell, the Republican leader, could upend the bipartisan dynamic usually needed to secure support for a broader package. Democrats said they were not consulted. The action is set for Thursday.\n“Jobs are literally being saved as we speak,” McConnell said in a statement announcing his move.\n“Congress will need to provide more funding or this crucial program may run dry. That cannot happen,” he said.\nUnderscoring the tension, the push comes after Trump sidelined the acting inspector general tasked with leading oversight of the $2.2 trillion rescue package, the biggest of its kind in history.\nThe paycheck program is one of the main pillars in Washington’s effort to salvage the economy and shore up suddenly out-of-work Americans as the coronavirus crisis rips through communities nationwide. The boost would push it to $600 billion.\nThrough it, a small business can use 75% of the loan to keep paying its employees and the other 25% to meet overhead such as rent and utilities. The payroll protection is for eight weeks and if the business keeps its employees on the payroll or rehires workers who have been laid off, the loan will be forgiven.\nThe program just began operating last Friday but the rollout has been plagued by a host of problems. Small business owners have complained that they are unable to get through to the Small Business Administration or the banks to apply for loans or they are being rejected by banks who say they are only accepting applications from businesses that are already customers of the bank.\n“We were so successful that we were concerned we were going to run out of money,” Mnuchin said during an event at the White House.\nThe Federal Reserve intervened Monday, saying it would buy the loans that banks make, a way to nudge hesitant lenders.\nBy creating a backstop on the loans, the Fed is giving the banks an incentive and freeing up more of their cash for lending.\nThe decision by McConnell to march ahead faces an uncertain outcome. It’s unclear if his gambit for a stand-alone vote on the paycheck program will send it through the the Republican-controlled Senate and the Democratic-run House.\nWith Congress adjourned except for perfunctory pro forma sessions, such a vote would require either the unanimous consent of all lawmakers or a simple voice vote without a formal roll call. There could be objections.\nThe House minority leader, Rep. Kevin McCarthy, R-Calif., backed McConnell’s effort for a smaller, discrete infusion for the small business program. “The House should move swiftly to do the same,” he said in a statement.\nBut the overture sets up a showdown with Democrats led by Sen. Chuck Schumer of New York, who on Tuesday called for up to $25,000 “heroes” pay for frontline health care and service industry workers.\nSchumer declared the pay hike for nurses, truck drivers, grocery store clerks and others the “highest priority.”\nBigger corporations would be expected to foot the bill for the pay hike, he said, while the federal government would provide funding for smaller firms.\nThe House bill is expected to include the small business boost alongside another round of $1,200 direct payments, unemployment benefits and food stamp assistance. Some Democrats are also seeking as much as $250 billion for smaller municipalities that face mounting costs to care for sick Americans and shore up their own economies.\nThe shifting dynamics among the political leaders are stark amid what officials warn could be one of the toughest weeks for the country, as the number of confirmed cases and deaths climbs.\nThe House gaveled in for a perfunctory session with Rep. Brad Sherman, D-Calif., presiding — wearing a face mask sewn by his young daughter.\nThis would be the fourth package from Congress since the start of the virus outbreak. Two initial efforts were followed by the third last month, which was by far the largest, most ambitious of its kind in U.S. history.\n___\nAssociated Press writers Kevin Freking, Zeke Miller, Martin Crutsinger and Laurie Kellman contributed to this report.", "url": "https://apnews.com/c0d3f5f69f8141848929b0b4d182c7bf"}