{"authors": ["Jordan Valinsky", "Cnn Business"], "date_download": "2020-05-04 16:23:49", "date_modify": "2020-05-04 16:23:49", "date_publish": "2020-04-06 18:40:15", "description": "Peloton is suspending its live video classes for the rest of April after an employee tested positive for the novel coronavirus.", "filename": "2020_04_06_business_peloton_ec610b881f8b9037b987c443e8315933_index_1588609429.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200316142149-peloton-bike-file-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_business_peloton_ec610b881f8b9037b987c443e8315933_index_1588609429.html", "title": "Peloton cancels live video classes for April after employee contracts coronavirus", "title_page": "Peloton cancels live video classes for April after employee contracts coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Peloton is suspending its live video classes for the rest of April after an employee tested positive for the novel coronavirus.\nThe fitness company announced the changes Monday in a blog post . Peloton broadcasts a variety of classes from its New York and London studios, including cycling, treadmill and strength classes. Customers pay a monthly subscription fee for the live classes. They will continue to have access to archived classes.\nPeloton PTON told members in its official Facebook group that a New York studio employee contracted Covid-19 late last week. It ceased airing live classes from that location over the weekend and was planning to air new classes beginning Tuesday.\nThat decision sparked backlash among some in the Peloton group on Facebook. Members suggested that the company completely cancel live classes so their favorite instructors remain safe.\nPeloton didn't immediately return a request for comment about why it changed its mind to completely suspend live classes for the month of April.\nRead More", "url": "https://www.cnn.com/2020/04/06/business/peloton-live-classes-suspended-coronavirus/index.html"}