{"authors": ["Opinion Julian Zelizer", "Cnn Political Analyst"], "date_download": "2020-05-04 16:08:44", "date_modify": "2020-05-04 16:08:44", "date_publish": "2020-04-02 17:38:21", "description": "Julian Zelizer writes that one glimmer of hope in this global nightmare is that the coronavirus pandemic may inspire a generation of Americans to consider pursuing careers in the medical and scientific fields, just as other crises have inspired past generations in particular ways.", "filename": "2020_04_02_opinions_covid-1_cd86720e09f4c412695d6b31c8eb203f_index_1588608524.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200329093259-new-york-drive-thru-testing-0328-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_opinions_covid-1_cd86720e09f4c412695d6b31c8eb203f_index_1588608524.html", "title": "Covid-19 may inspire a new generation of doctors and scientists", "title_page": "Covid-19 may inspire a new generation of doctors and scientists (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University and author of the forthcoming book, \"Burning Down the House: Newt Gingrich, the Fall of a Speaker, and the Rise of the New Republican Party.\" Follow him on Twitter: @julianzelizer . The views expressed in this commentary are his own. View more opinion at CNN.\n(CNN) The devastating coronavirus has already claimed the lives of over 50,000 people across the world -- and shows little sign of letting up anytime soon. But if there is one glimmer of hope in this global nightmare, it's that it may inspire a generation of Americans to consider pursuing careers in the medical and scientific fields, just as other crises have inspired past generations in particular ways.\nIn the current battle to stop the spread of Covid-19 and move us toward some sort of recovery, the men and women working in health care and medical research are our troops. They are the modern-day version of the greatest generation from World War II -- the tens of thousands of people who sacrificed their lives to combat fascism in the 1940s.\nThis time around, the heroes operate in laboratories and hospital rooms. And they are doing everything possible to treat those who have the virus, develop a vaccine to combat future outbreaks and employ the best statistical techniques to track how the pandemic is unfolding. And, regardless of the national politics, these health care workers keep their heads down and do the work that is so badly needed.\nWe have gone through other periods when crises of this magnitude have motivated younger generations of Americans to pursue professions that meet the needs of those moments. After the Great Depression, young men and women entered into public service at the federal or state level, seeing government as a force for good in American life. Wilbur Cohen, for example, started his career as a staffer on Franklin D. Roosevelt's Committee on Economic Security, which helped design Social Security -- and spent much of the remainder of his career working in the Social Security apparatus.\nAnd a young Texan named Lyndon Johnson came to work for a congressman in 1931, then led the Texas National Youth Administration in 1935. Johnson was responsible for administering money for jobs, education and more to young Texans. These experiences strengthened his resolve to run for a House seat in 1937 and to spend several decades in Congress before becoming president, during which he would seek to go beyond FDR's New Deal with the Great Society.\nPeople like Cohen and Johnson understood that public policy -- and federal legislation -- helped save the nation from the ravages of economic hardship during the Great Depression. More specifically, programs like Social Security, the Public Works Administration, the Civil Works Administration and others offered economic security -- and even jobs -- when unemployment soared . As a result of these programs, between 1950 and 1975, one out of every four jobs in the non-farm economy was in government.\nFollowing the Vietnam War and Watergate in the 1970s, when investigative journalists helped to uncover political falsehoods that had justified a terrible war and exposed the corruption of power that had taken place in Richard Nixon's White House, more Americans decided to devote their lives to the newsroom, determined to never miss those kinds of stories ever again. \"Applications to journalism school are at an all-time high,\" Time magazine noted in a cover story during the summer of 1974, \"and many of the youngsters say that they want to be investigative reporters.\"\nTim O'Brien, a Pulitzer Prize winning reporter who worked for Bloomberg and the New York Times, was 12 when he learned about the Watergate hearings in summer camp. After seeing \"All the President's Men\" in 1976, where Robert Redford and Dustin Hoffman glorified the work that Bob Woodward and Carl Bernstein had done for the Washington Post, he was inspired to pursue a career as a journalist -- remarking : \"'Wow, these are the guys that set everything in motion.'\"\nNow, following the death toll from the coronavirus, we see why medicine, science and public health are so critical to functioning of our society -- a reality that will continue to be true as the threat of future pandemics remains.\nWhen this the coronavirus has been beaten -- and it will be one day -- we will need the government to provide financial support for individuals who want to enter these fields, as we saw after World War II when politicians in both parties poured millions of dollars into the coffers of universities and research institutions that were engaged in work relevant to the Cold War through the National Defense Education Act.\nWe will need high schools to develop new STEM programs to maximize interest in these fields, and we will need universities to dedicate even greater resources toward nurturing those who seek to pursue careers in the sciences. There will have to be discussions about whether there are needs to streamline the graduate training process and to make any necessary changes to the curriculum. It will also be essential to provide better solutions to crushing student debt.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nLastly, we will need parents to tell their children the stories that they witnessed and experienced, as our nation sheltered in place for weeks on end.\nNational crises are horrendous to live through. They scar generations and wreak havoc on our lives. But they also expose elements of society that we have all but ignored -- and shine a spotlight on professionals who perhaps were not receiving the credit they deserved.\nWe will never forget the sacrifices that our health care workers and scientists are making right now. And hopefully, as a result, their ranks will be strengthened, so that we are better prepared to deal with this sort of threat if and when it emerges again.", "url": "https://www.cnn.com/2020/04/02/opinions/covid-19-new-generation-health-care-workers-zelizer/index.html"}