{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:26:22", "date_modify": "2020-05-04 16:26:22", "date_publish": "2020-04-07 14:23:43", "description": "On Monday at the daily coronavirus task force press conference, President Donald Trump took great umbrage at a question asked him by a Fox News reporter.", "filename": "2020_04_07_politics_donald-trump-press-media-coronavirus_index_1588609582.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406181617-trump-hands-up-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_donald-trump-press-media-coronavirus_index_1588609582.html", "title": "Here's the biggest thing Donald Trump doesn't get about the media", "title_page": "Here's the biggest thing Donald Trump doesn't get about the media - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) On Monday at the daily coronavirus task force press conference, President Donald Trump took great umbrage at a question asked him by a Fox News reporter.\n\"You should say congratulations, great job, instead of being so horrid in the way you ask a question,\" Trump scolded Fox's Kristin Fisher.\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!\nThe \"horrid\" question that Fisher had the gall to ask? \"When can hospitals expect to receive a quick turnaround on these [Covid-19] test results?\"\nWhich, unless you have spent the last month or so on another planet, is a very relevant question. Testing for coronavirus was very slow to get started and there remains, in many hospitals, a delay in getting back results from the tests.\nHere's how The New York Times described the situation in a piece headlined \" Delays and Shortages Exacerbate Coronavirus Testing Gaps in the U.S. \" on Monday:\n\"More and more rapid tests are coming onto the market and private companies like Quest and LabCorp are now running thousands of tests a day. But as the virus has spread from state to state infecting hundreds of thousands of Americans, demand for testing has overwhelmed many labs and testing sites. Doctors and officials around the country say that lengthy delays in getting results have persisted and that continued uneven access to tests has prolonged rationing and hampered patient care. In addition, swabs and chemicals needed to run the tests are in short supply in many of the nation's hot zones.\"\nThere's no question, then, that Fisher was well within her rights to ask Trump about the continued testing delays. So, why did he react the way he did?\nSimple; Trump has absolutely no real idea of (or care for) how a free and independent media actually works.\nHe's demonstrated this repeatedly -- on some of the biggest stages in the world.\nIn 2018, Trump said of Chinese President Xi Jinping : \"He speaks, and his people sit up at attention. I want my people to do the same.\" (He later said he was joking.)\nAt the G20 meetings in Japan in July 2019, Trump and Russian President Vladimir Putin did a photo-op prior to their closed-door meeting. As the press asked questions and photographers snapped pictures, Trump said to Putin : \"Get rid of them. Fake news is a great term, isn't it? You don't have this problem in Russia but we do.\" To which Putin responded: \"We also have. It's the same.\"\nRussia is, of course, an authoritarian regime with a long record of cracking down -- often incredibly harshly -- on journalists.\nIn a joint press conference in November 2019 with Turkish President Recep Tayyip Erdogan, Trump said he was looking for a question from \"a friendly reporter from Turkey, please,\" adding: \"Only friendly reporters we like to see. There aren't too many of them around.\"\nTwo months prior to Trump's comments about Turkey, the group Reporters Without Borders published a piece making clear that press freedom in the country was in \"crisis.\"\nSo, yeah. Trump doesn't seem to grasp -- or, more worryingly, doesn't care -- about the difference between how the press should function in the US and how it is allowed to function in an authoritarian state. He likes how authoritarian rulers are \"covered\" by their media because it is so favorable. He seems to not connect the dots that the reason it is favorable is because a) reporters' work in these countries is heavily censored and b) there are real-life repercussions for journalists who are seen as insufficiently loyal to the political leadership of the country.\nThe job of journalists in a free and open society is to ask questions -- even uncomfortable ones. And to keep asking them until they get answered. Because in this country reporters never have to -- or should never have to -- worry that asking a hard question of the president might lead to negative consequences.\nThe corrosive notion at the heart of Trump's deep misunderstanding of the media is that when a \"hard\" question is asked of him, it is somehow evidence of media bias or, even worse, a lack of patriotism. (\"I really think they don't like our country,\" Trump said of the media at a campaign rally in August 2017 .)\nThe media's job is not to ask \"nice\" or \"good\" questions, and it's certainly not to say \"congratulations.\" The media's job is to ask questions that elicit critical information about issues affecting the American public. Like, say, when will the rapid-result tests for coronavirus be available to hospitals battling the virus around the country?\nThat the President of the United States doesn't grasp that basic fact about one of the institutions at the center of a healthy democracy speaks volumes.", "url": "https://www.cnn.com/2020/04/07/politics/donald-trump-press-media-coronavirus/index.html"}