{"authors": ["Larry Neumeister"], "date_download": "2020-05-04 20:23:17", "date_modify": "2020-05-04 20:23:17", "date_publish": "2020-04-15 22:18:44", "description": "NEW YORK (AP) — Former New York state Senate leader Dean Skelos was expected to be released soon from prison to home confinement after testing positive for the coronavirus, prosecutors told a...", "filename": "_b5df3851f6a2075b46e56bb460282ca1_1588623797.html", "image_url": "https://storage.googleapis.com/afs-prod/media/82760779f35e4816908ced0fb82d0f85/2309.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b5df3851f6a2075b46e56bb460282ca1_1588623797.html", "title": "Ex-NY Senate leader to leave prison after getting COVID-19", "title_page": "Ex-NY Senate leader to leave prison after getting COVID-19", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Thursday, May 12, 2016, file photo, former Senate majority leader Dean Skelos, center, leaves court in New York. Federal prosecutors say Skelos will be released from prison to home confinement after testing positive for the coronavirus. According to prosecutors, the U.S. Bureau of Prisons will approve Skelos for furlough and home confinement once his proposed residence has been approved by U.S. Probation Department authorities. (AP Photo/Seth Wenig, File)\nFILE - In this Thursday, May 12, 2016, file photo, former Senate majority leader Dean Skelos, center, leaves court in New York. Federal prosecutors say Skelos will be released from prison to home confinement after testing positive for the coronavirus. According to prosecutors, the U.S. Bureau of Prisons will approve Skelos for furlough and home confinement once his proposed residence has been approved by U.S. Probation Department authorities. (AP Photo/Seth Wenig, File)\nNEW YORK (AP) — Former New York state Senate leader Dean Skelos was expected to be released soon from prison to home confinement after testing positive for the coronavirus, prosecutors told a judge Wednesday.\nThe government notified a Manhattan federal judge Wednesday that it was informed earlier in the day that Dean Skelos, 72, was in quarantine after testing positive at the federal prison at Otisville, New York. It said he has been symptom-free since April 8.\nProsecutors say the U.S. Bureau of Prisons said Skelos will be approved for furlough and home confinement once his proposed residence has been approved by U.S. Probation Department authorities. Medical authorities at the prison have already cleared his release.\nJudge Kimba Wood said in an order Tuesday that Skelos was scheduled for release on June 4, 2021, but that he might be eligible for release to a halfway house as early as June 4.\nHis lawyers had requested compassionate release for Skelos. In a March 27 letter recently made public, they told the judge that guards had just told Skelos and other inmates that another inmate had tested positive for the coronavirus.\nThe lawyers cited his age and his medical condition, saying he needs “the chance to quarantine at home and escape the glaring risk this virus presents.”\nSkelos has been serving a four-year and three-month prison term after he was convicted of extortion, wire fraud and bribery.\nEvidence at a trial of Skelos and his son in 2018 convinced a jury that he pressured wealthy businessmen to give his son roughly $300,000 for no-show jobs. His son Adam is serving a four-year prison sentence.\nProsecutors said the payments from the businessmen were bribes designed to win support from the powerful Republican for legislation favored by the businesses.", "url": "https://apnews.com/b5df3851f6a2075b46e56bb460282ca1"}