{"authors": ["Michelle L. Price"], "date_download": "2020-05-04 20:16:08", "date_modify": "2020-05-04 20:16:08", "date_publish": "2020-04-08 16:05:32", "description": "LAS VEGAS (AP) — Nevada’s governor on Wednesday ordered a closure of golf courses, real estate open houses, religious gatherings of 10 people or more and additional restrictions to try to stop the...", "filename": "_a32620d1b0a9c3f6896ab8815efda39c_1588623368.html", "image_url": "https://storage.googleapis.com/afs-prod/media/0dc71a536c3d47b5bfd42efc7eadd48a/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a32620d1b0a9c3f6896ab8815efda39c_1588623368.html", "title": "Sisolak closes golf courses, limits religious gatherings", "title_page": "Sisolak closes golf courses, limits religious gatherings", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A man wears a mask on his face while visiting the artwork titled Seven Magic Mountains by artist Ugo Rondinone amidst the coronavirus outbreak, Tuesday, April 7, 2020, near Jean, Nev., south of Las Vegas. (AP Photo/John Locher)\nA man wears a mask on his face while visiting the artwork titled Seven Magic Mountains by artist Ugo Rondinone amidst the coronavirus outbreak, Tuesday, April 7, 2020, near Jean, Nev., south of Las Vegas. (AP Photo/John Locher)\nLAS VEGAS (AP) — Nevada’s governor on Wednesday ordered a closure of golf courses, real estate open houses, religious gatherings of 10 people or more and additional restrictions to try to stop the spread of the coronavirus.\nGov. Steve Sisolak said he was expanding rules related to social distancing because some people have tried to circumvent rules he already put in place. Other new restrictions are designed to cut down on the amount of time people spend next to others, he said.\nThe governor last month ordered a closure of non-essential businesses, including gambling and casinos, and issued a directive telling Nevadans to stay at home, though exceptions were granted for people going outside to exercise.\nSisolak said at a news conference Wednesday evening that he was ordering the closure of sports and recreational facilities where people congregate, such as golf courses, tennis courts, basketball courts and pools. He said that despite his decision last month to leave golf courses open, he had seen pictures of people riding together in golf carts and standing together on the greens.\nThe governor said a new directive he signed Wednesday also bars grocery stores from offering any self-service food such as salad bars or unpackaged bulk food because customers could touch the same scoops and servers. It also restricts barbers and hair stylists from offering in-home services to anyone outside their immediate household.\n“I haven’t had a haircut in six weeks. I’ve adjusted. The first lady is sticking by my side. We can do this,” the governor joked.\nSisolak said while people can still buy and sell houses and arrange a private viewing of a home, real estate agents will no longer be able to hold open houses where customers can wander in without an appointment. He said he’s also ordering car dealer showrooms and appliance showrooms to close, allowing those products to only be sold if the products are delivered to people’s homes.\nThe Democrat said he prayed over a decision to limit in-person religious gatherings and consulted religious leaders. He said it wasn’t an easy call, especially with Passover starting Wednesday and Easter on Sunday. But Sisiolak said he had seen reports of spikes in COVID-19 cases after in-person religious gatherings in other states and didn’t want to see a similar jump in Nevada.\nSisolak said he learned of one additional death just before starting his evening news conference, bringing the total number of Nevadans to die from the virus so far to 81. More than 2,300 people have tested positive for the virus.\nMost people with the virus experience mild or moderate fever and coughing for two to three weeks. Some, especially older adults and people with existing health problems, can face severe illness including pneumonia and death.\nIn other developments:\n— A 35-year-old Reno man accused of stealing 200 surgical masks from the Veterans Administration hospital where he works could face up to a year in federal prison. Prosecutors say Peter Lucas initially told investigators he stole the masks for a friend who works in health care, then claimed he intended to hand them out to the homeless. His federal public defender didn’t immediately respond to a request for comment.\n— A woman has been arrested at a Lake Tahoe grocery store after police say she licked products and put them in her shopping cart with items she couldn’t pay for. Jennifer Walker, 53, is accused of licking several pieces of jewelry for sale at the Safeway, putting them on her hands as she filled her cart with $1,800 worth of merchandise, South Lake Tahoe Police said Wednesday. A Safeway employee told officers the items no longer could be sold because of potential cross contamination from the coronavirus. Walker was booked into the El Dorado County Jail on suspicion of felony vandalism. It’s not clear if she has a lawyer or will be appointed one.\n____\nAssociated Press writers Ken Ritter in Las Vegas and Scott Sonner in Reno contributed to this report.\n___\nThis story has been corrected to show Walker was putting grocery store items in her shopping cart, not car.", "url": "https://apnews.com/a32620d1b0a9c3f6896ab8815efda39c"}