{"authors": ["Jim Acosta", "Elizabeth Cohen"], "date_download": "2020-05-04 16:34:20", "date_modify": "2020-05-04 16:34:20", "date_publish": "2020-04-07 21:01:21", "description": "A week after unveiling a stunning projection for the number of people who would die from coronavirus in the US -- 100,000 to 240,000 -- White House officials have yet to fully explain how they arrived at those numbers.", "filename": "2020_04_07_politics_white-h_fc18cd4dfafa5f57bbdaef6242300219_index_1588610060.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331193005-deborah-birx-white-house-virus-briefing-3-31-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_white-h_fc18cd4dfafa5f57bbdaef6242300219_index_1588610060.html", "title": "Top public health official says number of dead could be lower as Americans practice social distancing", "title_page": "Covid-19: Top public health official says number of dead could be lower as Americans practice social distancing - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A week after unveiling a stunning projection for the number of people who would die from coronavirus in the US -- 100,000 to 240,000 -- White House officials have yet to fully explain how they arrived at those numbers.\nSome administration officials are now saying the number could be lower than they originally warned -- but it comes as there are continued questions about how the administration got to the high number.\nThe final number could end up being higher or lower than the dramatic estimates released one week ago in a briefing by the White House Coronavirus Task Force, according to federal health officials and researchers who are creating models to forecast the outbreak.\nA source close to the task force said it's possible the eventual death toll will be \"way under\" the 100,000-to-240,000 figure.\nA key factor driving the large estimate was a crucial assumption, discussed internally by task force officials, that only 50% of Americans would observe the government's stringent social distancing guidelines, the source said. That calculation was not shared widely. In reality, a much larger number -- 90% -- is observing the government's guidelines, US Surgeon General Dr. Jerome Adams said in several interviews this week.\nDr. Robert Redfield, director of the US Centers for Disease Control and Prevention, discussed the 50% social distancing participation estimate in an interview with Tucson radio station KVOI on Monday.\n\"Those models that were done, they assumed that only about 50% of the American public would pay attention to the recommendations. In fact, it would seem, a large majority of the American public are taking the social distancing recommendations to heart -- and I think that's the direct consequence of why you're seeing the numbers are going to be much, much, much, much lower than would've been predicted by the models,\" Redfield said.\nThe source close to the task force confirmed Redfield was citing the 50% figure discussed within the coronavirus task force.\nIn the meantime, Katie Miller, a spokeswoman for the task force, said Redfield was referring to a revision from the Institute for Health Metrics and Evaluation. Miller added that the presentation that produced the 100,000-240,000 figure from Dr. Deborah Birx was based on a \"combination of models.\"\nHealth officials on the coronavirus task force, led by Birx, based their estimates of 100,000-240,000 deaths on a number of models from a variety of well-respected public health units at top US universities, as well as the US Centers for Disease Control and Prevention.\nThe White House has not released the modeling estimates they've received or how they analyzed them.\nBirx has often focused on the model by the University of Washington's Institute for Health Metrics and Evaluation, whose projected death toll has never been above 100,000 in recent weeks. That model assumes full adherence to social distancing measures.\nInstitute for Health Metrics and Evaluation director Christopher Murray said he hasn't seen how the task force derived its range of 100,000-200,000 deaths, but that the figure overlaps with the range his group provided the task force projecting 40,000 to 150,000 deaths.\nCNN has learned that another of the models, from Imperial College London, predicted a worst-case scenario of up to 2.2 million deaths.\nAt a White House press briefing on March 31, Birx said that with social distancing, good hand hygiene, and other steps, the death toll could go \"down to 100,000 to 200,000 deaths, which is still way too much.\"\nPublic health experts caution nobody has a crystal ball with the ability to pinpoint the precise number of people who will die in a pandemic. And they warn that despite the varying numbers, this is no time to relax social distancing measures.\nHarvard scientists, who are modeling the pandemic, also advised the White House on what the expected death toll might be, said their estimates were similar to what Birx announced at the press briefing.\n\"Our numbers were within that range,\" Mark Lipsitch, a professor of epidemiology at Harvard, said. \"Ours were a little higher than the high end of their range because we used a higher R0,\" referring to a measure of how contagious the virus is.\nThe White House also sought advice from Alessandr Vespignani, a professor at Northeastern University. He said his estimates were also \"in the ballpark\" with the numbers Birx mentioned at the briefing.\nIn response to the White House email request for the model, Lipsitch said: \"We supplied what we were asked for as best we could, but I think any responsible modeler will tell you that our assumptions are wrong because we just don't know the effectiveness of social distancing. It's quite speculative.\"\nHe added that none of the models lead to an optimistic conclusion of what this will all look like in the end.\n\"There are no good end games right now,\" Lipsitch said.\nJeffrey Shaman, a professor at Columbia University Mailman School of Public Health, also provided a model to the task force. He said Birx's estimate of 100,000 to 200,000 deaths is \"not unreasonable.\"\nEver since President Donald Trump and top health officials announced the estimates, some members of the task force have cautioned that the models would have to change with incoming data, driven by the latest number of Covid-19 cases and deaths. For example, some initial optimism in New York state that the deadly outbreak in the New York City area may be plateauing is also fueling optimism that the number of dead may not reach 100,000 people.\n\"Data will always trump models,\" task force member Dr. Anthony Fauci said during a CNN town hall on April 2.\nEven before the task force released its official estimates, Fauci said the models could be overestimating the number of Americans who may die from the virus, during an interview on CNN's State of the Union on March 29.\n\"The model is only as good and as accurate as your assumptions,\" Fauci said. \"And whenever the modelers come in, they give a worst-case scenario and a best-case scenario. Generally, the reality is somewhere in the middle. I've never seen a model of the diseases that I've dealt with where the worst-case scenario actually came out. They always overshoot.\"\nA source familiar with internal discussions about the modeling and estimates said the 100,000-240,000 figure was not selected in order to frighten the public.\n\"The number wasn't picked for a political or public relations purpose,\" the source said.", "url": "https://www.cnn.com/2020/04/07/politics/white-house-coronavirus-death-projections/index.html"}