{"authors": ["Priscilla Alvarez", "Geneva Sands"], "date_download": "2020-05-04 17:02:28", "date_modify": "2020-05-04 17:02:28", "date_publish": "2020-04-09 18:33:28", "description": "More than 6,000 migrants have been turned away at the US-Mexico border since new coronavirus border restrictions took effect, according to the latest US Customs and Border Protection data.", "filename": "2020_04_09_politics_southern-border-coronavirus_index_1588611748.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200106161520-02-us-border-patrol-agent-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_southern-border-coronavirus_index_1588611748.html", "title": "US expels more than 6,000 migrants using new pandemic rules", "title_page": "US expels more than 6,000 migrants using new pandemic rules - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) More than 6,000 migrants have been turned away at the US-Mexico border since new coronavirus border restrictions took effect, according to the latest US Customs and Border Protection data.\nActing CBP Commissioner Mark Morgan insisted Thursday that the new restrictions, which went into effect March 21, are \"not about immigration.\"\n\"It's purely about infectious disease and public health,\" said Morgan, who repeatedly stated: \"This is not about immigration, period. This is about public health and safety.\"\nPresident Donald Trump has previously floated closing down the US-Mexico border. Late last month, the administration invoked Centers for Disease Control and Protection authorities that allowed the US to immediately expel migrants encountered at the border.\nCBP is expelling 80% of everyone encountered in less than two hours. As a result, the number of people in its custody has drastically dropped. Morgan said Thursday there are currently fewer than 100 people in custody. That's down from around 20,000 last May at the height of the southern border crisis.\nRead More", "url": "https://www.cnn.com/2020/04/09/politics/southern-border-coronavirus/index.html"}