{"authors": ["Paul S. Adler", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Razmig Keucheyan", "Nicole Aschoff", "Leigh Phillips", "Michal Rozworski", "Sam Gindin"], "date_download": "2020-05-04 19:55:49", "date_modify": "2020-05-04 19:55:49", "date_publish": "2020-05-04 00:00:00", "description": null, "filename": "2020_05_planned-economy-public-ownership-corporate-management_1588622149.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/05/04152123/31708006260_1b91b00fba_b.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_05_planned-economy-public-ownership-corporate-management_1588622149.html", "title": "What Socialists Can Take From Corporate Strategic Management", "title_page": "What Socialists Can Take From Corporate Strategic Management", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nSocialists have long argued that the failures of capitalism can only be overcome by a shift from private to public ownership and from market competition to economy-wide coordination. A growing number of our compatriots are open to our ideas; under the pandemic, even some Republicans are calling for more socialist measures like handing out cash payments to unemployed workers. The emergency conditions created by the COVID-19 pandemic open space for our advocacy. We still face the challenge of convincing people that a socialist transformation of our entire economy — where public ownership and control would be economy-wide and not limited to health care and emergencies — could be both democratic and effective. One obstacle is that we simply don’t have any example we can point to. However, as I argue in my recent book The 99 Percent Economy , we have at hand an impressive working model of socialism, albeit in a surprising place — in some of our biggest businesses.\nThe Argument for Socialism Perhaps the easiest way to make the argument for a socialist transformation of the economy is through the climate emergency — an emergency that will soon dwarf the scale of the COVID-19 pandemic. According to the 2018 National Climate Assessment, if we stay on our current course the United States will see increasingly frequent and destructive wildfires, hurricanes, ice storms, and heat waves over the coming decades. Lower water tables and rainfall levels will cause massive crop failures. Rising sea levels will force millions to flee coastal areas. Climate scientists tell us that the world must get to net-zero carbon emissions by 2050 to have a reasonable chance of avoiding a chaotic breakdown. Moreover, wealthier countries such as the United States will need to fully decarbonize much faster than that — by 2030 at the latest — to accommodate the poorer countries’ slower decarbonization trajectory. And in order for us to meet this 2030 goal, industry will be forced to abandon or rebuild trillions of dollars worth of assets. That means not only rapidly shutting down the fossil fuel companies such as Chevron and ExxonMobil and Peabody Energy, but also radically transforming the working assets of companies whose products run on oil — companies such as General Motors, Boeing, United Airlines, and FedEx. Further afield, there are vast swaths of our economy whose products and processes contribute to climate change, and which therefore must be radically and rapidly transformed — agriculture, cement, mining, forest products, water systems, chemicals, plastics, and many consumer products. Moreover, beyond the transformation of these industries, climate change will necessitate massive investment in new infrastructure — a new power grid, sea walls to protect against rising sea levels, new water systems, rebuilding roads, bridges, sewage, and rail systems. Capitalist companies can’t be expected to voluntarily make these kinds of changes, ones that would saddle their shareholders with huge losses. Moreover, even if we elect a government determined to drive this transition, we cannot meet this goal without bankrupting a huge number of firms. Given those hurdles, it is very difficult to see how that transition can happen without socializing the ownership of most of our industries and using that control to drive a comprehensive overhaul of our infrastructure and systems of production.\nInternal Dynamics Beyond the climate crisis, it is the internal dynamics of capitalist development themselves that drive us to a socialist transformation. As capitalism advances, profit-driven businesses must reduce costs and increase sales, and this stimulates capitalism’s characteristically rapid technological change. Transportation and communications technologies are revolutionized, and the corresponding costs fall dramatically. Businesses grow and progressively monopolize whole industries. Hungry for lower-cost inputs and new markets, they globally expand their networks of suppliers and customers. Economic activity thus becomes ever more interdependent, both within ever-larger firms and across ever-larger networks. Productive activity becomes, in Marx’s terms, progressively more “socialized.” At the same time, as a consequence of this socialization trend, the production and investment decisions made by individual firms have ever-wider and ever more damaging “externality” effects. More powerful technologies wreak more damage on the environment. Bigger companies make business decisions that periodically throw millions out of work and out of their homes, undermining the economic viability of whole regions. Financial and economic crises originating in one location rapidly spread across the globe. In our private enterprise system, firms make decisions that maximize their individual profits, and when they do that in an increasingly interdependent world, they impose ever more damage on communities and on the natural environment. The growing interdependence of productive activity represents a profoundly progressive legacy of capitalist development, but it is increasingly in tension with the system of profit-driven decisions about production and investment made by independent individual businesses. The socialization of production is increasingly out of sync with the capitalist system of private property of the means of that production. And this mismatch results in ever-deeper and wider crises on every front. The only path forward is to socialize the ownership and control of our economic resources to match the degree of socialization of economic activity itself. But given the antipathy to socialism that, even in the wake of the Bernie Sanders campaign, still dominates in the United States, the argument for socialization can be difficult to impress. It is for this reason that socialists like Richard Wolff have argued that we should redirect our attention away from the structure of the wider economy and to define socialism as a matter of workplace relations. Wolff tells us that socialism is “less a matter of state versus private workplaces, or state planning versus private markets, and more a matter of democratic versus autocratic workplace organization. A new economy based on worker co-ops will find its own democratic way of structuring relationships among co-ops and society as a whole.” Today, however, in the face of the climate emergency, we cannot afford to defer the question any longer. We need to push for democratic control over investment and production across the entire economy. This control should, of course, be as decentralized as possible, but some degree of centralization will be necessary to ensure wise and equitable use of our resources. This idea rings alarm bells for many people. It’s hard to see how such a system could be effective or democratic, let alone both. History provides us no examples.\nA Working Model, Right Under Our Noses My research suggests that we have something like a working model of such a system right under our noses, in many of our largest corporations. Indeed, many of our CEOs behave like closet socialists. Most large firms are divided into more or less self-sufficient “strategic business units” charged with developing new products and assuring their production, sale, and profitability. In public, their CEOs defend the superiority of markets and competition over coordination and planning, but inside their own corporations, where they could leave these business units to compete with each other, they rely instead on comprehensive strategic management. Such strategic management aims to ensure that the various business units that make up the corporation coordinate their production, investment, and other plans to achieve the best outcomes for the corporation as a whole. Yes, there are some corporations that try to emulate the market in their internal operations, but that approach is relatively rare. In most firms, the activity of business units is coordinated by a strategic vision and plan — much like the activity of enterprises across the country would be coordinated under democratic socialism. Moreover, in this internal strategic management process, corporations confront in miniature — in the microcosm of the firm — the same challenges as those that bedeviled economic planning on the wider scale in the USSR. The four biggest of these challenges are how to assure democracy, innovation, efficiency, and motivation. The USSR was notoriously weak on all four. Many committed socialists dismiss the magnitude of these challenges, confident that they could easily be overcome. But if we are going to bring others to our side, we need to offer them more than our confidence — we need to offer them some plausible image of socialism in which they can see how these challenges could be resolved in practice. Perhaps counterintuitively, corporate strategic management gives us just such an image, because corporations have developed rather effective techniques to deal with these four challenges — techniques that could be deployed on a wider scale and to even greater advantage in a socialist economy. Let’s review each in turn.\nDemocracy Centralized planning in the USSR promised to overcome the irrationality of the capitalist system based on market competition. Negative externalities such as unemployment (and today we would say CO2 emissions) could be minimized; positive externalities could be harvested as synergies across enterprises; economies of scale could be assured. But this promise was seriously compromised by the undemocratic character of the planning process. The Soviet top-down process meant that plans did not adequately reflect the opportunities and challenges experienced by workers, citizens, enterprises, and regions. And as a result, those at lower, local levels of the system had little reason to put much effort toward the goals decreed at the higher, central level. While these limitations did not stop a remarkably rapid initial industrialization, they came to hobble the country’s subsequent growth. A similar dynamic can be seen in many business firms. Their CEOs see the potential benefits of strategic coordination, but the top-down character of their planning process means that the plans do not reflect the opportunities and challenges experienced in the business units. And these units have little reason to embrace the goals that top executives decree. To overcome this challenge, some firms have become smarter about which decisions need to be centralized and which are better handled by the business units. More surprisingly, where decisions need to be centralized so as to assure consistency across the units, some firms have developed techniques for engaging the participation of lower-level managers and, in some cases, even of frontline staff (see samples of the research here, here, here, and here). This typically happens in three cycles (goal-setting, planning, and budgeting) wherein each cycle, top executives formulate proposals, elicit feedback from below, and revise their proposals in light of that feedback. Of course, strategic management in these big corporations is not anywhere nearly as democratic as socialists would want to see — most obviously because top executives are appointed by investor representatives, rather than by our elected representatives — and their planning is terribly constrained by the overriding importance of profitability; but we sometimes find surprising levels of participation. It is not hard to see how this strategic management process could be made more democratic, and how such dialogues could be broadened and scaled up in the socialist planning process. Imagine that our nationally elected leaders, examining the problems and opportunities the country faces, propose a set of goals for the next Five-Year Plan covering our economic, social, and environmental needs. A wide process of democratic consultation — in face-to-face meetings in workplaces and neighborhoods, in regional governing bodies, via digital polls — allows us to feed back up to the national leadership proposals for revising those goals. The refined goals are then sent back out to democratically elected industrial and regional councils, asking them to propose plans for how they can contribute to achieving the plan’s objectives. These plans are then collated centrally, and any inconsistencies or gaps prompt a round of revision. And finally, in a third cycle, budgets are allocated by the national investment bank in accordance with the goals and plans we have agreed to, and local participatory budgeting forums determine precisely how those budgets are used.\nInnovation Centralized planning enabled the USSR to invest massively in the development of leading-edge science and engineering. Research organizations at the national and industry level generated impressive breakthroughs. But their innovation efforts were often poorly targeted, not addressing the real needs of industry. Even when innovations were useful in principle, there was little incentive for enterprises to adopt them in practice. The gap was too difficult to bridge between, on the one side, centralized organizations that specialized in research, and on the other, dispersed enterprises that specialized in production. Many American businesses recognize the potential benefits of coordination and planning over reliance on market competition for assuring their innovative capacity. Following a socialist logic, they fund centralized R&D units through taxes on the business units. This avoids duplication of innovation efforts across their internal business units. It also ensures that research can look further out into the future than the business units would be willing to do in their local R&D. But just as in the USSR, specialization often leaves this centralized R&D unit out of touch with the needs of the business units: it develops concepts the units don’t need or can’t use or have little incentive to use. Better-managed corporations have found ways to avoid this problem. They draw local business unit leaders into the governance of central R&D. They ensure that central R&D teams work collaboratively with staff from the units on innovation projects. And they invest in developing the skill base of staff in the operating units so they can participate effectively in these projects. A socialist planning system could dramatically accelerate innovation by following just such a model. Imagine the acceleration that would result from a policy of funding democratically governed, industry-level, and regional R&D centers, chartering them to collaborate with the relevant enterprises in their innovation efforts, and investing in the development of the innovative capacity of the entire workforce so everyone can participate. Innovation would also be accelerated under socialism by expanded opportunities for entrepreneurship. If they proposed new ways of achieving our plan goals, entrepreneurial ventures, established as worker cooperatives, could get access to financing from public investment banks or from existing enterprises. This would greatly lower the impediments to innovation created by our current venture (“vulture”) capitalist system.\nEfficiency Socialism promises a great increase in efficiency over capitalist competition. Instead of letting each enterprise work according to its own processes and rely on its own component and module designs, Soviet planners standardized best practices and optimal designs for use across the entire economy. Workers, however, often experienced this standardization of procedures as alienating, and the standardization of components often led to products that were cheap but mediocre. Many capitalist firms also recognize the potential benefits of standardization for efficiency. Following the same logic, they create central staff units that standardize best practices and optimal designs across their business units. But as in the USSR, workers often resist the regimentation of their work, while business units resist the adoption of standardized components. The smartest businesses have overcome this challenge by involving frontline staff in these standardization efforts. When standards are not decreed from on high, but are developed jointly by staff experts and frontline personnel, these standards can be designed to support, rather than limit, creativity and judgment, and as a result they are experienced as enabling rather than coercive. In a socialist system of strategic management of the entire economy, massive improvements in efficiency could flow from similarly participative efforts to standardize components and best practices across entire industries and regions (for surprising examples, see here and here). We would use this increase in efficiency to dramatically reduce working hours, freeing up workers’ time for self-cultivation and to participate in the democratic processes governing the economy.\nMotivation It is commonly observed that socialist central planning in the USSR failed to motivate either workers or entrepreneurs. Collectivist values only go so far: without adequate encouragement for individual effort and creativity, both efficiency and innovation falter. Our big businesses face a similar dilemma. They need employees to be collectivist enough to willingly comply with policies and procedures, but they simultaneously need employees to be individualistic enough to fuel divergent thinking and creativity. The common solution to this dilemma is to specialize roles, with most people being relegated to routine tasks where compliance is more important, while the privileged few work on innovation tasks where creativity matters more. The cost of ignoring the creative capacities of so many, however, is enormous. (See, for example, Gallup’s research on the costs of employee disengagement.) The smartest businesses therefore create cultures and reward systems that support a synthesis of individualism and collectivism that I call “interdependent individualism.” (For one example, see here.) People can be honored and rewarded for their individual contribution to the organization’s goals, and for their ability to collaborate with others in that effort. Modest financial rewards for individuals are paired with modest financial rewards for teams and with generous symbolic rewards for these efforts. The organization invests in training and incentives to stimulate the innovative capacity of all its personnel. While as socialists we are reluctant to attribute too much importance to differentiated financial incentives, nothing stands in the way of a socialist economy following a similar policy. Our democratically elected councils at the national level can set general policy regarding the pay of different categories of workers, and enterprise-level councils would rely on that policy guidance to set pay for individual workers. The culture of twenty-first-century socialism must transcend the opposition of individualism and collectivism, and the experience of some of these capitalist firms shows us that this is possible and how we might do it.", "url": "https://www.jacobinmag.com/2020/05/planned-economy-public-ownership-corporate-management"}