{"authors": ["Reporter"], "date_download": "2020-05-04 20:20:06", "date_modify": "2020-05-04 20:20:06", "date_publish": "2020-04-28 15:25:50", "description": "The 64-year-old shared a snapshot of the actors in a convertible and said she'd \"go as fast\" as she could if they came by to pick her up while in lockdown.", "filename": "entry_maria-shriver-katherine-schwarzenegger_n_5ea83f31c5b6e55df8d8679c_1588623606.html", "image_url": "https://img.huffingtonpost.com/asset/5ea84a98220000960c827cbb.jpeg?cache=iy0nbetip0&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_maria-shriver-katherine-schwarzenegger_n_5ea83f31c5b6e55df8d8679c_1588623606.html", "title": "Maria Shriver's Thirsty Instagram Post On Brad And Leo Had Her Daughter Saying 'OMG'", "title_page": "Maria Shriver's Thirsty Instagram Post On Brad And Leo Had Her Daughter Saying 'OMG' | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Sometimes you’re horny on main and, other times, your parents are.\nMaria Shriver is the latest celebrity to express some sexual energy on social media, sharing a snapshot on Instagram of actors Leonardo DiCaprio and Brad Pitt sitting in a convertible.\nThe image of the men featured the caption, “They came to pick me up, but I was strong and I told them I’m staying home,” likely referencing widespread efforts to practice social distancing to stop the spread of the coronavirus.\nShriver captioned the image by saying that her friend had sent this to her and asked what she would do.\n“I mean, c’mon, do you have to ask?!” the 64-year-old wrote. “I’d go as fast as I could! You? #StayHomeStaySafe.”\nWe certainly can’t blame her. Have you seen Pitt’s arm muscle?\nShriver’s daughter Katherine Schwarzenegger was clearly a bit shocked by her mom’s thirstiness and commented, “Omg mom.”\nInstagram\nUnder the 30-year-old’s comment, many Instagram users shared their thoughts on the hilarious mother-daughter moment.\nOne user wrote: “I often tell my kids it’s a parent’s job to embarrass their kids LOL!” and Shriver responded saying “bingo.”\nShriver also wrote back to her daughter, explaining that now she knows what to get her mom for Mother’s Day.\nInstagram\nMoms on social media are just the best, aren’t they?", "url": "https://www.huffpost.com/entry/maria-shriver-katherine-schwarzenegger_n_5ea83f31c5b6e55df8d8679c"}