{"authors": ["Opinion Jay Parini"], "date_download": "2020-05-04 16:58:49", "date_modify": "2020-05-04 16:58:49", "date_publish": "2020-04-09 18:23:20", "description": "Jay Parini writes that the famed poet imparted two pieces of advice to him in a visit they shared years ago on the Oxford campus. These have taken decades to absorb, he writes, but hold wisdom suddenly relevant and comforting in this time of plague and apprehension.", "filename": "2020_04_09_opinions_easter-coronavirus-wh-auden-parini_index_1588611529.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409125318-w-h-auden-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_opinions_easter-coronavirus-wh-auden-parini_index_1588611529.html", "title": "What W.H. Auden taught me about Easter, God and surviving a season of Covid-19", "title_page": "What W.H. Auden taught me about Easter, God and surviving a season of Covid-19 (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) We are in the penitential season leading up to Easter, which for Christians is a celebration of the resurrection of Jesus, that miraculous transformation of suffering and death into something glorious. All Christian thinking tends toward rebirth and transformation, which seems more relevant than ever in this time of Covid-19, a pestilence worthy of any biblical plague.\nJay Parini\nThis is a time of recollection and hope for Jews as well, with Passover. In biblical times, those who were able to make the journey traveled from far-flung parts to Jerusalem to celebrate the liberation of Israelites from captivity in Egypt. This captivity was, then as now, as much emotional or spiritual as physical. Jesus and his followers were among those Jews who made their way to Jerusalem.\nAs Easter approaches in a time of global anxiety and, often, despair, I find myself trying to remember things I've been told that have mattered. As a Christian, I pray, meditate, and read the scriptures -- the Bible, of course, and my favorite poets as well. I'm 72, with \"underlying conditions.\" A lot of water has passed over this particular dam. But one memory in particular comes rushing into my head.\nAbout 50 years ago, I was in a bleak mood. A graduate student at the time, I was doing some research at Oxford, and had gone up to London to a library for the day. Walking back to the train station in late afternoon, on a crowded street, I felt overwhelmed. My hands grew sweaty, and I couldn't breathe. For respite, I found a quiet passageway where I sat in a doorway for an hour, quite certain I would die.\nI slowly made my way back to Oxford by train. Heading into the college gate, I ran into the old poet W. H. Auden, whom I had known a little. He was living at Christ Church in a cottage in a garden behind the Senior Common Room. Auden saw I looked glum and said, \"Whatever is the matter, dear boy?\"\nRead More", "url": "https://www.cnn.com/2020/04/09/opinions/easter-coronavirus-wh-auden-parini/index.html"}