{"authors": ["Sara Ashley O'Brien", "Cnn Business"], "date_download": "2020-05-04 17:01:31", "date_modify": "2020-05-04 17:01:31", "date_publish": "2020-04-10 13:00:32", "description": "Uber is addressing some mistakes it made when originally setting up its financial assistance program for its drivers and delivery workers impacted by coronavirus.", "filename": "2020_04_10_tech_uber-coronavirus-financial-assistance_index_1588611691.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200317115607-uber-car-usa-0109-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_tech_uber-coronavirus-financial-assistance_index_1588611691.html", "title": "Uber is updating its month-old coronavirus pay policy to include some drivers with preexisting conditions", "title_page": "Uber is updating its month-old coronavirus pay policy to include some drivers with preexisting conditions - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN Business) Uber is addressing some mistakes it made when originally setting up its financial assistance program for its drivers and delivery workers impacted by coronavirus.\nWith gig workers on the frontlines of the outbreak as people stay home and avoid public transportation, Uber was the first of the on-demand gig companies to announce it would compensate those diagnosed with coronavirus or placed in mandatory quarantine. It would provide assistance to qualifying drivers for up to 14 days.\nBut it has received some criticism for not doing more for its workers, including helping the most vulnerable. Some drivers, for example, initially thought they could apply for the pay if they had a doctor's note indicating they have underlying health conditions but they didn't qualify.\nIn a revised policy, outlined in a blog post Friday, Uber broadens who is eligible for assistance. It now includes those instructed to quarantine because they have preexisting health conditions that make them at risk for serious complications if they contract coronavirus.\n\"Part of what we're trying to do now is adjust with changing circumstances and respond to the very legitimate issues drivers and delivery people raised,\" Uber spokesperson Matt Wing told CNN Business. He said the previous policy and implementation \"didn't go smoothly because we moved really fast, which meant we made mistakes. We're not alone in that problem.\"\nWhile the policy now appears more inclusive, there is a big potential downside for some of its most active drivers, which Uber acknowledged in its blog post. The company is putting more limitations on the amount of financial assistance it is doling out. With the update, it has set maximum payouts per person, which vary depending on the location. In Los Angeles, for example, the maximum amount is $459, but in Columbus, Ohio, it's $244 and Rio Grande Valley, Texas, just $136. The minimum payout is $50. The company will now look at the past three months of a driver's history to determine payout instead of the past six months.\nTo apply, a worker must have completed one trip, or one delivery, in the 30 days prior to reaching out to Uber for assistance, the company said.\nLyft, by contrast, has said it is basing its financial assistance on a driver's past month of activity on the platform. The company told CNN Business this week that drivers who average five hours a week over the previous four weeks qualify for $250, while drivers who've worked an average of 37.5 hours or more over the same period would qualify for $1,000. The current policy, which does not cover those with preexisting conditions, is in place until April 10, at which point Lyft said it will re-evaluate the program.\nUber, whose earlier policy was set to expire April 6, said it has paid out more than $3 million in financial support to workers in the United States as part of the effort, but declined to say how many people had applied.\nFor those with pre-existing conditions who tried to apply previously but were denied assistance, the company told CNN Business that it is re-reviewing claims submitted between March 15 and April 10, before the updated policy rolled out. The company said those individuals will not be held to the new maximum payment caps.\nSome workers have previously complained about wait times for processing claims. Uber said it aims to process requests within seven business days and drivers will be suspended while claims are being reviewed regardless of the outcome. The company said, \"given that circumstances are changing rapidly, we also may modify this approach, including the amount of assistance given and the criteria, as conditions change.\"", "url": "https://www.cnn.com/2020/04/10/tech/uber-coronavirus-financial-assistance/index.html"}