{"authors": ["Por Howard Fendrich Y Eric Núñez"], "date_download": "2020-05-04 20:24:42", "date_modify": "2020-05-04 20:24:42", "date_publish": "2020-04-20 17:34:49", "description": "El tenista chileno Nicolás Jarry tendrá que purgar una suspensión de 11 meses por dopaje dictaminada por la Federación Internacional de Tenis tras dar positivo en un control durante la fase final...", "filename": "_6e7f138734534297897609f3ed034e99_1588623882.html", "image_url": "https://storage.googleapis.com/afs-prod/media/2f110fc3bdac42108dd37a3144d5547c/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6e7f138734534297897609f3ed034e99_1588623882.html", "title": "Chileno Jarry es suspendido 11 meses por dopaje", "title_page": "Chileno Jarry es suspendido 11 meses por dopaje", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nEl tenista chileno Nicolás Jarry tendrá que purgar una suspensión de 11 meses por dopaje dictaminada por la Federación Internacional de Tenis tras dar positivo en un control durante la fase final de la Copa Davis en noviembre pasado.\nJarry, quien en julio de 2019 alcanzó su posición más encumbrada en el ranking como 38 del mundo, aceptó un acuerdo con la ITF (las siglas en inglés de la federación) y estará sin jugar hasta el 15 de noviembre.\nEn una carta publicada en sus redes sociales, Jarry señaló que “lamentablemente y con mucha humildad, he decidido aceptar el acuerdo ofrecido por la ITF”.\nLa federación, por su parte, “aceptó” la explicación del jugador de 24 años de que las dos sustancias prohibidas encontradas en una muestra de orina tuvieron como origen suplementos vitamínicos fabricados en Brasil.\nJarry cumplirá la suspensión durante una paralización absoluta del tenis — como casi toda disciplina deportiva en el mundo — debido a la pandemia del coronavirus. Todos los torneos en ambas giras profesionales han sido pospuestos o cancelados hasta por lo menos mediados de julio.\n“Extender estos procesos legales, sólo sumarían más estrés e incertidumbre a mi futuro profesional”, dijo Jarry, actualmente en el puesto número 89 del ranking de la ATP.\nLa ITF falló que Jarry “no carga culpa significativa o fue negligente en su infracción” al reglamento antidopaje. Pero recordó que los tenistas son responsables de toda sustancia que consumen.\nLa Agencia Mundial Antidopaje encontró metabolitos de ligandrol y estanozolol en la muestra de Jarry. El estanozolol es un esteroide. El ligandrol es un producto con una función similar de un esteroide al permitir aumentar la masa muscular.\nSegún la federación, es evidente que los tenistas sudamericanos con las sustancias que adquieren en la región.\n“Resulta aparente que el consumo de suplementos, en particular los elaborados en farmacias de compuestos en América del Sur, lleva consigo un nivel de riesgo importante para los hombres y mujeres que están sujetos a las normas antidopaje”, dijo la ITF. “Y los castigos cada vez más fuertes que se han impuestos a los tenistas por tales infracciones no han servido para disuadir a otros jugadores de no tomar esos riesgos”.\nSegún Jarry, el consumo no fue intencional.\n“Fuimos capaces de demostrar en la investigación realizada por la ITF, la procedencia de las sustancias prohibidas detectadas y que éstas, aparecieron producto de la contaminación cruzada que se generó en el laboratorio brasileño en el cual se producían vitaminas”.\nJarry explicó que intentó asegurarse que el laboratorio brasileño cumpliera con todas las condiciones, “llegando al extremo de evaluar mi decisión con tres doctores”, e incluso pidió que uno visitará al laboratorio para “certificar personalmente que estaba todo bien para producir mis vitaminas”.\n“Lamentablemente esto no fue suficiente y puse en riesgo mi salud y mi carrera profesional. Me quedo con una lección muy importante en mi vida, de que sé que es mi responsabilidad profesional asegurarme que todo lo que consuma no puede contener ni la más mínima contaminación”, añadió.\nJarry cuenta con un título ATP en su carrera, el que conquistó el año pasado en el Abierto de Bastad, un torneo en superficie de arcilla que se disputa en Suecia. También ha ganado un par de títulos de dobles y acumula 2 millones de dólares en premios como profesional. Alcanzó los cuartos de final en el Abierto de Francia y el US Open en 2018.\n“Estoy intentando aprender lo más que puedo de esta situación, y sé que a fin de cuentas será una lección de esas que te deja la vida, de la que sin duda pretendo salir mucho más fuerte”, sostuvo Jarry.", "url": "https://apnews.com/6e7f138734534297897609f3ed034e99"}