{"authors": ["Hanna Ziady", "Cnn Business"], "date_download": "2020-05-04 16:52:43", "date_modify": "2020-05-04 16:52:43", "date_publish": "2020-04-08 15:29:53", "description": "Food and supplies are flying off the shelves of UK supermarkets, but that doesn't mean their profits are booming.", "filename": "2020_04_08_business_tesco-coronavirus-sales_index_1588611163.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408081513-tesco-london-uk-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_business_tesco-coronavirus-sales_index_1588611163.html", "title": "Tesco unlikely to profit from Covid-19 lockdown sales boom", "title_page": "Tesco unlikely to profit from Covid-19 lockdown sales boom - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) Food and supplies are flying off the shelves of UK supermarkets, but that doesn't mean their profits are booming.\n, the biggest grocery chain in Britain, said Wednesday that additional costs associated with \" feeding the nation \" could amount to as much as £925 million ($1.1 billion) this year if restrictions on work and social-distancing measures introduced to counter the coronavirus pandemic last 20 weeks.\nEven in the company's best-case scenario, where lockdowns last for 12 weeks, costs are expected to rise by £650 million ($804 million), driven by an increase in payroll, distribution and cleaning and maintenance expenses, said CEO Dave Lewis.\nProperty tax breaks offered by the government will only partially offset these costs, freeing up £585 million ($724 million).\nEven waves of panic buying in recent weeks will not meaningfully boost profit at, which, like many of its peers, had to ration supplies to keep shelves stocked.\nGrocery sales in the United Kingdom jumped 20% last month to a record £10.8 billion ($13.3 billion), according to data provider Kantar. Tesco sales shot up 30% during the first three weeks of March, as the company sold 76% more toilet paper, 101% more pasta and 363% more hand wash, according to an investor presentation published Wednesday.\nSales have since stabilized and are at more \"normal\" levels, with an uplift from the increased numbers of people eating at home rather than at restaurants, Lewis said.\nBut the nature of the coronavirus pandemic means that even grocery retailers, which are among the few businesses still physically open in many parts of the world, have had to change their operations at considerable cost.\nWhy costs have gone up\nTesco expects its payroll expense to balloon by up to £405 million ($500.9 million), depending on how long lockdown measures are in place. The company is paying employees who are sick with coronavirus or in isolation, and has placed all workers who are over 70, vulnerable or pregnant, on 12 weeks of paid leave.\nTo cover for 50,000 workers who are absent, Tesco has recruited 45,000 new employees in the past two weeks.\nOnline sales have been growing three times faster than in-store sales, but that growth is less profitable, given the costs associated with assembling and delivering orders.\nOn a call with analysts, Lewis said that Tesco has added an additional 145,000 weekly home delivery slots, enabling it to make 805,000 deliveries each week, or 20% more than before. The average number of items per online order has settled at around 62, having jumped from an average of 45 to 130 during the weeks of panic buying, he said.\nThe full financial impact of the coronavirus \"is impossible to predict with a high degree of certainty,\" Lewis said, adding that Tesco has a team trying to model the impact the crisis could have on future supply and demand.\n\"If customer behavior were to return to normal by August, it is likely that the additional cost headwinds incurred in our retail operations would be largely offset by the benefits of food volume increases, twelve months' business rates relief in the UK and prudent operations management,\" the company said in a statement.\nOther UK retailers may also find that the boost from additional sales is offset by lower profitability in the existing business, said Bruno Monteyne, a senior analyst at AllianceBernstein. This will be particularly true in the United Kingdom, which has more generous labor policies and sick pay than the United States, added Monteyne, a former Tesco Asia supply chain director.\nTesco will pay a dividend\nWhile a number of banks and insurance companies have scrapped dividend payments to shore up their balance sheets in the face of a sharp economic downturn, Tesco, which reported earnings on Wednesday, said it will pay a full-year dividend of 9.15 pence (11 cents) per share, at a cost of £635 million ($785.5 million).\nThe company said profit for the year to February declined nearly 19% to £1.3 billion ($1.6 billion).", "url": "https://www.cnn.com/2020/04/08/business/tesco-coronavirus-sales/index.html"}