{"authors": ["Opinion Charles Mcnair"], "date_download": "2020-05-04 16:58:41", "date_modify": "2020-05-04 16:58:41", "date_publish": "2020-04-09 17:57:59", "description": "Back when he was a boy in the 50's, writes Charles McNair, there was a similarly terrifying disease afoot in the US: polio. It came \"with a thunderclap of fear,\" it's other name infantile paralysis, led to lockdowns -- as with coronavirus -- and left people with disabilities, sometimes sending them into iron lungs to breathe. And worse. Then ... a vaccine.", "filename": "2020_04_09_opinions_seeking_3393504fde313eb0f53eb86af84b0330_index_1588611521.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408210655-03-polio-cure-opinion-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_opinions_seeking_3393504fde313eb0f53eb86af84b0330_index_1588611521.html", "title": "The other time America desperately sought a miracle cure for a devastating disease", "title_page": "The other time America desperately sought miracle cure for a devastating disease (opinion)  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Charles McNair is a writer and narrative consultant based in Bogotá, Colombia. His third novel, The Epicureans , published by Tune & Fairweather of Dublin, Ireland, will appear in fall 2020. The views expressed in this commentary belong to the author. View more opinions at CNN.\nRight now, it appears that even if coronavirus doesn't give us fever and fear, it will give us a year, maybe two, of suffering and sacrifice. Our trials could last even longer, depending on the shambles left of our economy once the pandemic fades.\nWe all hope for a miracle. And miracles do happen.\nOne afternoon in the 1960s, four unhappy McNair children stood in a long line in the blazing Alabama sun. Mama and Daddy turned out the whole family on a special afternoon at the Houston County Farm Center. It looked possible that every other person in Dothan and all the little peanut-economy towns around it had showed up too.\nThe line took hours. At its end, though, inside the blessed shade of the agricultural exhibition building, a row of tables held a sight I'd never seen.\nSugar cubes. White sweet cubes stacked on a table like a cityscape.\nUntil that moment, sugar cubes only existed in movies that showed tea-drinkers in England. In rural Alabama, sugar came in a bag.\nBehind the trove worked sweating men and women, injecting a pink liquid into individual cubes. Those officials offered a pink cube on a paper napkin to every person in line.\nOne. Just one, son.\nA little girl eats a sugar cube laced with the oral vaccine against polio in 1962.\nNothing ever tasted so sweet. The pink liquid? No taste at all.\nOn the way back to the car, mama told us what it all meant.\n\"Now,\" she said, her nose and cheeks a little sunburned. \"Y'all are never gonna get polio.\"\nThe illness got Aunt Rose Nell\nAs I grew up in my part of the world, the word polio came with a thunderclap of fear. Poliomyelitis, the scientific name, had another name that summed up its awfulness -- infantile paralysis.\nNo childhood disease was more terrifying.\nThe poliovirus infected adults too. It got my Aunt Rose Nell.\nShe'd been a pretty young woman, maybe a little vain, if family stories are to be believed. Rose Nell married a good-natured GI who returned from navigating bomber missions over Europe in World War II. He sold insurance, Rose Nell got pregnant. The baby was stillborn, one of those moments every family remembers, the story passed down. Today there's still a little headstone in the city cemetery.\nNot long after that loss, the family's tragedy compounded. Rose Nell, still in her twenties, complained of a severe headache, and then pain in her back and legs. The doctors diagnosed her polio just in time -- the poliovirus attacked the muscles of her diaphragm, and she lost the ability to breathe on her own.\nA boy suffering from polio is treated with an \"iron lung\" at a hospital in 1955, while a nurse controls the flow of air pressure.\nAn ambulance rushed her to Montgomery, 100 miles north, where a hospital had a chance to save her with a device called, ominously, an iron lung. That metal unit encased Rose Nell, all but her head, creating a negative pressure environment inside that mechanically forced her lungs to inhale and exhale. It kept her alive for three months, until the viral attack waned, and she luckily regained the ability to breathe on her own.\nThe McNair children came along a few years later. We only ever knew a disabled Rose Nell, an aunt who often complained about pain as she arrived in her wheelchair or, on very good days, as she hobbled up between the crutches that helped her walk. She regularly went to Warm Springs, Georgia, to bathe and exercise in the healing waters. Bravely, she and her husband adopted a wonderful child and did their best to live The American Dream -- though theirs had a cruel twist.\nIn the McNair household, the words \"polio\" and \"Aunt Rose Nell\" and \"iron lung\" and \"crippled\" clustered together in conversations. Infantile paralysis grew even more fearsome. When TV announcers would tell viewers that a case of polio had stricken some local kid, our world would go into lockdown.\nIt's hard to describe the gut punch of shock in those years when our car would pass the swimming pool at the recreation center. One day, it would swarm with children splashing, running, diving.\nThe next day ... lifeless. Water drained. The bare cement like a burial vault.\nPolio.\nThe thunderclap.\nAnd then ... victory\nMedicine began to win the battle against poliovirus in the early 1950s. The virologist Jonas Salk developed a vaccine, and he became a household name. The United States Food and Drug Administration fully approved large-scale polio vaccinations on April 12, 1955.\nJonas Salk holds up two decanters containing the anti-polio vaccine that he developed.\nAnother researcher, Albert Sabin , developed an oral version of the vaccine -- something like that pink liquid dropped onto those sugar cubes in Dothan. For their achievements, both got their pictures on postage stamps in 2006.\nThe vaccine officially arrived for many kids in my part of the world on March 31, 1965, with this headline in our hometown newspaper, The Dothan Eagle: \"Timetable Given For Polio Program\"\nVaccines would be administered on a schedule to hundreds of thousands of first and second grade Alabama children (9 million nationally) in a broad effort to eradicate the disease.\nFor the skeptical, the article addressed vaccine safety.\nDr. W. J. Donald of the State Health Office declared, \"It has already been proved safe. Not a single child had any adverse effects in any field trial.\"\nThe announcement added a fascinating bit of context -- that for the previous year more than 30,000 monkeys in India were used in the polio research program funded by the March of Dimes.\nThe article stated:\nThe polio virus, grown in the kidneys of monkeys, is treated with a solution of formaldehyde to make the virus harmless ... the vaccine induces the human body into setting up a defense against such invasion by producing antibodies.\nThe miracle end of polio came too late for Franklin Delano Roosevelt, stricken at age 39 and paralyzed from the waist down for the rest of his life.\nPolio killed many others -- in 1952, the US saw 57,879 cases, the most ever, with 3,145 deaths -- but it could also prove milder. Prominent victims, with various degrees of disability, include celebrated violinist Itzhak Perlman, athlete Wilma Rudolph, singers Neil Young and Judy Collins, golfer Jack Nicklaus, moviemaker Francis Ford Coppola, artist Frida Kahlo, swimmer and film Tarzan Johnny Weissmuller, and Emmett Till.\nThe list gets shorter over time. In 2016, only 42 cases of polio were diagnosed, these in Afghanistan, Nigeria, and Pakistan.\nThe vaccine has worked its miracle for billions of people.\nWaiting for another miracle\nAs we've endured the coronavirus pandemic, we've begun to see a headline nearly every day -- usually discreet, speculative -- that mentions some potential vaccine or remedy for the virus. We pay attention. But ultimately, so far, we're forced to dismiss these reports as false hope or wishful thinking or ... worse ... fake science.\nMarlene Olsen, 4, who was named March of Dimes poster girl for 1957, pins a polio drive badge on her stuffed dog, at her home in Burlington, Massachusetts, in 1956.\nStill, within living memory doctors Salk and Sabin conjured a miracle.\nSo miracles happen.\nWe saw something like one in 2018. Researchers with the Public Health Agency of Canada and then Merck introduced a vaccine to control the Ebola virus. Ebola is so virulent that in some outbreaks it killed 90% of those who contract it. That vaccine helped end a deadly, fast-spreading epidemic in Africa.\n'Unseen Enemy: Pandemic' CNN Films' documentary explores how diseases like Zika, Ebola and influenza spread. Watch now on CNNgo.\nIn 1963, researchers found a vaccine that dramatically reduced the spread of measles. Before it arrived, that disease each year killed 2.6 million people worldwide, many of them children. Also, the human papillomavirus, linked to cervical cancer, met its match with Gardasil, a 2006 vaccine.\nThe list of effective vaccines for once-feared diseases -- pertussis, tetanus, diphtheria, hepatitis B, smallpox, and more -- goes on.\nWill a miracle stop coronavirus?\nWe can always hope. And what's wrong with hope? Hope springs eternal. Hope is a thing with feathers.\nHope is sweet, pink on top.\nWe all long for the moment a mother turns to her loved ones with reassuring words like those my mother spoke in Alabama more than half a century ago.\nSomething like these:\nNow ... y'all are never gonna get coronavirus ...", "url": "https://www.cnn.com/2020/04/09/opinions/seeking-vaccine-for-coronavirus-as-with-polio-epidemic-mcnair/index.html"}