{"authors": ["Senior Culture Reporter"], "date_download": "2020-05-04 20:20:33", "date_modify": "2020-05-04 20:20:33", "date_publish": "2020-04-29 14:46:58", "description": "The \"Buffy\" actor revealed her new \"quarancolor\" Tuesday. She's one of many stars making creative use of coronavirus isolation.", "filename": "entry_sarah-michelle-gellar-quarantine-pink-hair_n_5ea9788fc5b6106b8ed05662_1588623633.html", "image_url": "https://img.huffingtonpost.com/asset/5ea988242500008d10eb08f4.jpeg?cache=j8uyetfr2u&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_sarah-michelle-gellar-quarantine-pink-hair_n_5ea9788fc5b6106b8ed05662_1588623633.html", "title": "Sarah Michelle Gellar Dyed Her Hair Pink To 'Embarrass Her Kids'", "title_page": "Sarah Michelle Gellar Dyed Her Hair Pink To 'Embarrass Her Kids' | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Sarah Michelle Gellar is one of many stars using her coronavirus self-isolation time to give herself a makeover ― but hers is the result of a particularly cheeky impulse.\nThe actor-turned-lifestyle guru revealed in an Instagram video Tuesday that she’d dyed her hair pastel pink.\n“Well, because we’re still in quarantine, I had to think of a new and creative way to embarrass my children,” Gellar said in the clip. “Quarancolor!”\nWhether or not Gellar’s bubblegum-hued locks left daughter Charlotte, 10, and son Rocky, 7, red-faced is anybody’s guess. The look, however, got heaps of praise from fans, some of whom vowed to follow suit by freshening up their own self-isolation style.\n“I could not be happier that Buffy has punk hair! It’s like a dream come true,” one wrote.\nAdded another, “If it’s good enough for Buffy, it’s good enough for you.”\nGellar, who turned 43 on April 14, is one of many celebrities to experiment with striking new looks while at home during the coronavirus pandemic.\nLast month, Gellar playfully winked at her iconic “Buffy the Vampire Slayer” character on Instagram after stumbling upon a stake during a self-isolation walk.\n“If the apocalypse comes, beep me,” Gellar wrote, referencing one of her most iconic lines from the hit series.", "url": "https://www.huffpost.com/entry/sarah-michelle-gellar-quarantine-pink-hair_n_5ea9788fc5b6106b8ed05662"}