{"authors": [], "date_download": "2020-05-04 20:05:56", "date_modify": "2020-05-04 20:05:56", "date_publish": "2020-04-08 21:45:30", "description": "SPRINGFIELD, Ill. (AP) — A campaign to raise money for Illinois nonprofits blindsided by the spread of the coronavirus announced its first distribution of $5.5 million Wednesday. The...", "filename": "_f38c5d390ab0868200ce6831da04d2a2_1588622756.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f38c5d390ab0868200ce6831da04d2a2_1588622756.html", "title": "COVID-19 relief fund makes 1st distribution of $5.5M", "title_page": "COVID-19 relief fund makes 1st distribution of $5.5M", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SPRINGFIELD, Ill. (AP) — A campaign to raise money for Illinois nonprofits blindsided by the spread of the coronavirus announced its first distribution of $5.5 million Wednesday.\nThe Illinois COVID-19 Response Fund , organized by Gov. J.B. Pritzker three weeks ago, has collected just under $29 million and will make another disbursement in the coming days, said its chairwoman, Penny Pritzker. Her brother, the governor, asked her to lead the effort.\nSupported by the United Way of Illinois and the Alliance of Illinois Community Foundations, the fund handed out $5.5 million to more than 30 nonprofit agencies across the state fulfilling fundamental needs.\n“It’s food, it’s shelter, it’s diapers, very basic needs,” said Penny Pritzker, Commerce secretary under former President Barack Obama. “And it’s very vulnerable people — the disabled, the elderly, those with health care needs, and layer on top of it the people losing jobs. The pain is real.”\nTo stop the spread of the virus, J.B. Pritzker issued a stay-at-home order and closed schools through April 30. Like in many other states, he also shuttered “non-essential” businesses, which has put people out of work and pummeled the economy.\n___\nDonations: https://ilcovidresponsefund.org/", "url": "https://apnews.com/f38c5d390ab0868200ce6831da04d2a2"}