{"authors": ["Fredreka Schouten"], "date_download": "2020-05-04 16:26:11", "date_modify": "2020-05-04 16:26:11", "date_publish": "2020-04-07 11:28:57", "description": "With the coronavirus derailing on-campus voter-registration efforts, the gun-safety group Students Demand Action is launching a $1.5 million online-only effort to register Gen Z voters and engage young people trapped at home.", "filename": "2020_04_07_politics_bloomberg-group-online-youth-voter-drive_index_1588609571.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200304101157-01-michael-bloomberg-0302-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_bloomberg-group-online-youth-voter-drive_index_1588609571.html", "title": "A Bloomberg-backed gun-control group launches online effort to register 100,000 young voters", "title_page": "A Bloomberg-backed gun-control group launches online effort to register 100,000 young voters - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A gun-safety group aligned with former New York Mayor Michael Bloomberg is spending $1.5 million on a new virtual organizing program that aims to register 100,000 young voters.\nThe push from Students Demand Action, shared first with CNN, replaces the group's planned in-person voter-registration efforts, which were derailed by the coronavirus outbreak and the widespread shutdowns it has triggered around the nation. The new program focuses on 13 battleground states and marks the group's first large-scale effort to use online-only tools to encourage young people to head to the polls.\nAcross the country, voter registration efforts have been upended by the pandemic, raising concerns that many first-time voters will be left on the sidelines in the 2020 election. Young people in Generation Z, born in the late 1990s and early 2000s, are projected to make up about 10% of this year's eligible voters, according to the Pew Research Center\n\"Presidential election years are the moment when we see the greatest numbers of people moving onto the registration rolls,\" said Kristen Clarke, the president and executive director of the Lawyers' Committee for Civil Rights Under Law. In addition to registration at motor vehicle and social service agencies, \"churches work to activate congregants, grassroots advocates knock on doors, campuses mobilize students,\" she said. \"And all of that activity has come to a grinding halt.\"\nStudents Demand Action, which has about 400 chapters and about 200,000 members, was gearing up for a big voter-registration effort on campuses in the spring, said Sarah Green, who oversees student organizing.\nRead More", "url": "https://www.cnn.com/2020/04/07/politics/bloomberg-group-online-youth-voter-drive/index.html"}