{"authors": ["Lisa Respers France"], "date_download": "2020-05-04 16:07:45", "date_modify": "2020-05-04 16:07:45", "date_publish": "2020-04-02 15:01:13", "description": "Dillon Passage says he's staying loyal to his husband.", "filename": "2020_04_02_entertainment_joe-exotic-husband-dillon_index_1588608465.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331133129-dillon-passage-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_entertainment_joe-exotic-husband-dillon_index_1588608465.html", "title": "Joe Exotic's husband Dillon Passage supports him", "title_page": "Joe Exotic's husband Dillon Passage supports him - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Passage, 24, is married to 57-year-old Joseph Allen Maldonado-Passage, aka Joe Exotic, aka Tiger King, who is the subject of the hit Netflix docuseries \"Tiger King: Murder, Mayhem and Madness.\"\nMaldonado-Passage is currently serving 22 years in prison after he was sentenced in January on multiple charges , including an alleged murder-for-hire plot against his nemesis, Carole Baskin.\nDuring a call-in appearance Wednesday on Andy Cohen's SiriusXM's show \"Andy Cohen Live,\" Dillon Passage said his incarcerated husband \"doesn't want me to be alone, but he also doesn't want me to move on.\"\n\"He doesn't want me to leave, that's his thing,\" Passage said. \"But I have no intention on leaving and I've reassured him of that for the past year and a half.\"\n\"I felt it was only right to stand by him and not judge him for the circumstance because I understood his relationship with Carole,\" Passage said. \"It was a very negative kind of thing and he was in a dark place when all of this stuff occurred. He just needed support so I was just going to stand next to him.\"\nA big part of the drama in \"Tiger King\" centers on Maldonado-Passage's rivalry with Baskin, an animal activist and owner of a big cat sanctuary who threatens to put his zoo out of business.\nPassage told \"Variety Live\" that Maldonado-Passage is currently in the medical facility of a federal prison in Texas where he had been transferred to from Oklahoma's Grady County Jail and was being held in a 14-day quarantine because of Covid-19. Passage said he doesn't think his husband has the coronavirus, though.\nPassage told Cohen he was 22 when he met his husband, who he said supported him during an addiction to prescription medication.\nThe couple decided to get married a little over two weeks later, Passage said. This was Joe Exotic's fourth marriage.\n\"He was just super sweet to me,\" Passage said. \"He just came off as very genuine and a real down-to-earth guy. Very charismatic.\"\nPassage is an animal lover and said the zoo factored into his attraction to Maldonado-Passage.\n\"Being around the animals kind of like gave me a purpose,\" Passage said. \"I felt like I was actually doing something with my life and it brought me out of my depression. It was like my own little rehab.\"\nThe 20-something said he loves his husband and refuses to abandon him.\nHe also had some words of praise for the docuseries, saying the producers \"put the story together very, very well.\"\n\"They stayed true to the entire storyline,\" Passage said. \"I even learned a lot of things I didn't know.\"\n\"Tiger King\" has become a cultural phenomena and Passage told \"Variety Live\" his showman husband is enjoying all the hoopla surrounding it.\n\"Joe's the type of person,he loves the attention obviously,\" Passage said. \"Any kind of fame or spotlight that he has, it was greatly appreciated.\"", "url": "https://www.cnn.com/2020/04/02/entertainment/joe-exotic-husband-dillon/index.html"}