{"authors": ["Ivana Kottasová"], "date_download": "2020-05-04 16:56:07", "date_modify": "2020-05-04 16:56:07", "date_publish": "2020-04-08 18:28:25", "description": "British scientists have pushed back against an influential new coronavirus model that predicts the UK will be the worst-hit European country, with a death toll from Covid-19 possibly much higher than previously thought.", "filename": "2020_04_08_health_uk-death-_1e6458341dde747ce017b6363aee4141_index_1588611367.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408113506-coronavirus-uk-0406-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_health_uk-death-_1e6458341dde747ce017b6363aee4141_index_1588611367.html", "title": "New US model predicts much higher Covid-19 death toll in UK. But British scientists are skeptical", "title_page": "UK death toll predicted to be much higher according to new US model. But British scientists are skeptical - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN) British scientists have pushed back against an influential new coronavirus model that predicts the UK will be the worst-hit European country, with a death toll from Covid-19 possibly much higher than previously thought.\nThe grim forecast came from the Institute for Health Metrics and Evaluation (IHME) at the University of Washington's School of Medicine in Seattle on Tuesday. It predicted 66,314 people would die of Covid-19 in the UK by early August.\nThe British government's plan for tackling the epidemic has been largely informed by a study from the Imperial College London , which said that a lockdown and social distancing measures would -- hopefully -- limit the number of deaths to between 20,000 and 30,000.\nBut several high-profile scientists in the UK have already voiced their concerns over the IHME model.\nProfessor Sylvia Richardson, of Cambridge University and the co-chair of the Royal Statistical Society Task Force on Covid-19, told the Science Media Centre the projections are based on \"very strong assumptions about the way the epidemic will progress.\"\nShe said the model was \"based mostly on using the experience in other countries to fit a smooth curve to the counts of deaths reported so far in the UK, rather than any modeling of the epidemic itself.\"\n\"Methods like this are well known for being extremely sensitive, and are likely to change dramatically as new information comes in,\" Richardson added.\nRacing against the clock\nLike most other countries, the UK has been racing to increase its healthcare capacity ahead of the predicted peak of the epidemic. A new field hospital in east London with a capacity of up to 5,000 beds, the NHS Nightingale , accepted its first patients on Wednesday.\nHowever, the IHME model suggests this might not be enough. It said the shortage of intensive care (ICU) beds would peak at 23,745 on April 17.\nThe IHME said the peak demand in the UK is expected to total 102,794 hospital beds, which compares to the 17,765 currently available. It added that 24,544 ICU beds will be needed, compared to the 799 beds it estimates will be available.\nProfessor David Spiegelhalter, who chairs the Winton Centre for Risk and Evidence Communication at University of Cambridge, told the Science Media Centre he was \"very skeptical\" of the projections.\n\"[They] are based on assuming a rather simple mathematical model for the whole course of the epidemic,\" he said. \"I suspect they will change a lot as new data arrives -- we shall see.\"\nEpidemiological modeling is a tricky discipline, because it relies in part on assumptions. The models often need updating as more data comes in.\n\"The outputs of any model should not really be treated as a prediction of what is going to happen,\" said Dr. Simon Gubbins, head of the Transmission Biology Group at The Pirbright Institute in England. \"Rather they represent plausible scenarios, based on knowledge at the time they were generated and assumptions made in the model ... that can be used to help inform decisions of policy makers,\" he told the Science Media Centre.\nThe authors of the IHME forecast admit their model is highly uncertain, giving the range of possible deaths in the UK as between 55,022 and 79,995.\nThis was the first time the IHME team published models for several European countries, including the UK. On Wednesday, the institute updated its US forecast, predicting 60,415 deaths in the country, significantly fewer than the 82,000 it predicted on Tuesday.\nThe researchers based their findings on models of the peak in death rates and hospital usage in Wuhan, the Chinese city which was the original epicenter of the outbreak, as well as data from seven European locations that have peaked, including the Spanish capital of Madrid and the Lombardy region in Italy.\nThey also factored in data from local and national governments, the World Health Organization and information on each country's social distancing policies.", "url": "https://www.cnn.com/2020/04/08/health/uk-death-toll-coronavirus-estimate-gbr-intl/index.html"}