{"authors": ["Annalyn Kurtz", "Cnn Business"], "date_download": "2020-05-04 16:05:49", "date_modify": "2020-05-04 16:05:49", "date_publish": "2020-04-02 10:23:51", "description": "Three weeks ago, the big question about the economy was: Will we have a recession? How quaint that seems now.", "filename": "2020_04_02_economy_recession-how-long-will-it-be_index_1588608349.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200326082705-us-capitol-0324-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_economy_recession-how-long-will-it-be_index_1588608349.html", "title": "How quickly can the US economy bounce back? That depends on the virus", "title_page": "How quickly can the US economy bounce back? That depends on the virus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) A month ago, the big question about the economy was: Will we have a recession?\nHow quaint that seems now.\nSo the question is no longer — will we have a recession — but how deep will it be? And how quickly will the economy recover?\nYou'll hear economists throw around phrases like V-shape, L-shape and U-shape to describe the range of possibilities.\nV-shape: The hope is that, given The hope is that, given trillions of dollars in government aid , the economy will be able to flip a switch just as quickly as it shut down. Once the spread of the virus slows businesses will be able to open their doors, people will return to work and the economy will make a speedy recovery. That's what economists call a V-shaped recession, and some think it's possible, now that the Federal Reserve and Congress have committed trillions of dollars to rescuing the economy.\nBut that scenario largely depends on the virus.\nMorgan Stanley economists are predicting a sharp economic decline followed by a quick bounce back. They forecast US gross domestic product will contract at an annual pace of 30% in the second quarter, far deeper than any other quarterly decline on record. But after that, they think GDP will grow at a 29% annualized pace from July through September.\nAs severe as that sounds, that's actually an optimistic forecast, because no one knows how long it will take the United States to contain the coronavirus pandemic and relax social distancing measures. Morgan Stanley's prediction assumes the outbreak peaks in April or early May, and businesses reopen shortly afterward.\nL-shape: The worst-case scenario is that the virus is not contained, social distancing measures remain in place into the summer, and businesses and consumers will take years to get back up to speed. In that case, the economic recovery could be L-shaped.\nThat's what happened after the Great Recession. Economic activity took four years to return to its pre-recession peak. Even then, a majority of Americans still didn't feel they had recovered.\nThe Great Depression, which began in 1929, was even more severe and was followed by a painfully slow recovery lasting through World War II. Those L-shape recoveries look more like a hockey stick with a long tail. No one wants an L-shape recovery, and so far, most economists are not predicting this outcome.\nU-shape: There's also an in-between scenario: It's the U-shaped recession, and it might be the most likely one today.\nA U-shaped recession is like a bathtub, Simon Johnson, former chief economist for the International Monetary Fund, once explained.\n\"You go in. You stay in. The sides are slippery. You know, maybe there's some bumpy stuff in the bottom, but you don't come out of the bathtub for a long time,\" he told PBS in 2009. In other words, the economy contracts, remains subdued for a while, and then climbs back.\nThis is a plausible outcome following the coronavirus pandemic for a few reasons.\nBusinesses, even with government aid, will be grappling with heightened uncertainty about the future. For business owners and managers, the pandemic has made a previously unthinkable situation real. Now that they've lived through a scenario where businesses are suddenly shut down en masse throughout the country, that shock could damage their investments and change behavior in the future, making some spend more conservatively.\nAlthough businesses may eventually came back to life after social distancing measures lift, it won't happen all at once.\nAs for consumer spending, the largest contributor to US economic activity, that too is unlikely to bounce back immediately. Part of that is due to a decline in incomes, especially for workers who have been furloughed or laid off.\nBut there's a psychological impact, too, said Elena Duggar, chair of Moody's Macroeconomic Board. The coronavirus pandemic has already disrupted human behavior in dramatic ways, ranging from social distancing to panic-buying toilet paper. Consumers will probably be wary of making big purchases even when the economy begins to come back to life. They're unlikely to suddenly return to their pre-coronavirus levels of spending, Duggar said.\nFinally, spending that would have taken place in the second quarter isn't necessarily going to be made up later in the year. Travelers whose spring break trips were canceled are probably not going to take two summer vacations. Consumers are not going to eat double the meals at restaurants, or go to twice as many movies later in the year, simply because they missed out on those things in the spring.\n\"There's going to be a significant part of economic activity that will be lost permanently,\" Duggar said.\nNevertheless, businesses and consumers will eventually recover — and could do so more quickly than they did after the Great Recession, Duggar said. Hence her U-shape forecast.\nUncertainty and unknowns\nAll of this, though — the shape of the recession and its duration — is highly uncertain. And it depends on one big unknown: the course of the virus.\nIn a recent report , McKinsey consultants and economists from Oxford Economics laid out nine different economic scenarios. In one of the rosier outcomes, in which the virus is successfully controlled and economic restrictions are lifted after two to three months, economic activity falls 8% in the first half of the year, but then rebounds to its pre-pandemic level by the end of 2020.\nHowever, if the virus is not contained within the second quarter, and social distancing measures continue into the summer, McKinsey expects GDP could take more than two years to climb back up to to its pre-coronavirus level.\n\"If we're in a situation where we have a third of the workforce not able to go to the work through the summer, you're going to see a lot of bankruptcies. You're going to see a lot of corporate debt defaults. The longer this goes on, the more permanent the damage to businesses and individuals,\" said Susan Lund, a McKinsey partner and one of the co-authors of the report.\n\"What it depends on, first of all, is how quickly we can control the virus.\"", "url": "https://www.cnn.com/2020/04/02/economy/recession-how-long-will-it-be/index.html"}