{"authors": ["Barbara Starr", "Ryan Browne"], "date_download": "2020-05-04 16:05:54", "date_modify": "2020-05-04 16:05:54", "date_publish": "2020-04-01 16:39:34", "description": "Some of the sailors from the USS Theodore Roosevelt will be quarantined in hotel rooms in Guam as the number of coronavirus cases aboard the aircraft carrier approaches 100, a deteriorating situation that led the ship's commanding officer to issue a stark warning to top Navy leadership about the need to get sailors off the ship.", "filename": "2020_04_01_politics_roosevelt-quarantine-guam_index_1588608354.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401094931-03-uss-theodore-roosevelt-guam-0327-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_roosevelt-quarantine-guam_index_1588608354.html", "title": "Sailors from aircraft carrier hit by coronavirus outbreak to quarantine in Guam hotels", "title_page": "USS Theodore Roosevelt: Sailors from aircraft carrier hit by coronavirus outbreak to quarantine in Guam hotels - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Some of the sailors from the USS Theodore Roosevelt will be quarantined in hotel rooms in Guam as the number of coronavirus cases aboard the aircraft carrier approaches 100, a deteriorating situation that led the ship's commanding officer to issue a stark warning to top Navy leadership about the need to get sailors off the ship.\nActing Secretary of the Navy Thomas Modly said Wednesday that 93 sailors from the ship have tested positive for the virus to date, representing more than 10% of all cases across the entire US military.\nA senior defense official told CNN that the Navy expected the number of cases to rise as more test results come in.\nModly said 1,273 of the ship's roughly 4,800 crew members have been tested for the virus so far and the Navy was still awaiting the results of some of those tests.\nHe said about 1,000 sailors have been evacuated form the ship and moved ashore to Guam where the ship is currently in port.\n\"We already have nearly 1,000 personnel off the ship right now. And in the next couple of days we expect to have 2,700 of them off the ship,\" Modly told reporters at the Pentagon.\nSome sailors will have to remain on the ship\nThe Chief of Naval Operations, Adm. Mike Gilday, said that the ship could not be evacuated in its entirety due to the need to continue to perform essential tasks such as the operation of the aircraft carrier's nuclear reactor.\nHe said that about 1,000 sailors would have to remain on the ship to perform, about 500 more than was proposed by the ship's commanding officer Capt. Brett Crozier in a recent memo.\n\"This ship has weapons on it, it has munitions on it, it has expensive aircraft, it has a nuclear power plant. It requires a certain amount of people on that ship to maintain the safety and security of the ship,\" Modly said.\nThe outbreak on the ship is escalating rapidly. Last week the Pentagon confirmed three sailors on the Roosevelt had tested positive and that number had risen to 25 two days later. That number rose to at least 70 on Tuesday and nearly 100 on Wednesday. On Monday, a US defense official told CNN that a second US aircraft carrier, the USS Ronald Reagan, is also facing a \"handful\" of positive cases.\nAs of Wednesday morning, 814 US service members in total had tested positive for the virus, according to the Pentagon.\nSenior Navy officials have said that the absence of housing capacity in Guam was one of the reasons that getting sailors off the ship was taking longer than Crozier would have liked.\n\"I know that our command organization has been aware of this for about 24 hours and we have been working actually the last seven days to move those sailors off the ship and get them into accommodations in Guam. The problem is that Guam doesn't have enough beds right now and were having to talk to the government there to see if we can get some hotel space, create tent-type facilities,\" Modly told CNN's John King Tuesday.\nGuam's Governor Lou Leon Guerrero said at a press conference Wednesday she will allow sailors from the ship to stay in vacant hotel rooms in Guam if they test negative for the virus and undergo a 14-day quarantine.\nShe added that those sailors will continue to be required to have daily medical checks.\nNavy officials have stressed that even if there was the capacity to evacuate all of the sailors that would not be possible due to the fact some sailors would be needed to stay aboard to operate the ship's nuclear reactor and perform other essential tasks.\nSailor tells CNN 'more will get infected'\nA sailor assigned to the ship told CNN that more sailors are likely to be infected given how they are currently being housed.\nThe sailor, who had been moved off the ship to a makeshift dormitory in a gym in Guam, did not want to be identified speaking publicly without permission.\nHe has been in the converted gym since Saturday, along with more than 150 other sailors.\nSome of the people in his facility who were coughing and had fevers, but said they felt fine, later tested positive, he said. Other sailors who didn't show any symptoms later tested positive as well.\nThere is no space in the gym to practice proper social distancing and they do not have proper cleaning supplies to decontaminate areas, he said.\n\"More will get infected based on the current conditions -- not a matter of if, but when,\" he said.\nCNN reported Tuesday that Crozier had warned Navy leadership that decisive action is required to save the lives of the ship's crew.\n\"We are not at war. Sailors do not need to die. If we do not act now, we are failing to properly take care of our most trusted asset — our Sailors,\" Crozier wrote in a memo to the Navy's Pacific Fleet, three US defense officials have confirmed to CNN.\nThe commander of US Pacific Fleet declined to say how many sailors aboard the nuclear-powered aircraft carrier had tested positive for the virus but said that no one had been hospitalized.\n\"What I will tell you is I have no sailors hospitalized, I have no sailors on ventilators, I have no sailors in critical condition, no sailors in an ICU status on the Theodore Roosevelt,\" Adm. John Aquilino told reporters Tuesday.\nThis story has been updated with comments from a sailor who's been removed from the carrier.", "url": "https://www.cnn.com/2020/04/01/politics/roosevelt-quarantine-guam/index.html"}