{"authors": ["Opinion Laken Brooks"], "date_download": "2020-05-04 16:08:42", "date_modify": "2020-05-04 16:08:42", "date_publish": "2020-04-02 15:03:43", "description": "Laken Brooks writes that for the deaf and hard of hearing, face masks are posing new risks by concealing mouths -- necessary for reading lips. Without the ability to communicate, the deaf and hard of hearing face further isolation and potentially dangerous situations.", "filename": "2020_04_02_opinions_deaf-hard-of-hearing-face-masks-brooks_index_1588608522.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330132824-01-coronavirus-masks-0330-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_opinions_deaf-hard-of-hearing-face-masks-brooks_index_1588608522.html", "title": "For the deaf or hard of hearing, face masks pose new challenge", "title_page": "For the deaf or hard of hearing, face masks pose new challenge - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Laken Brooks is a current graduate student at the University of Florida where she studies disability, digital humanities, public history, and literature. She has written for the National Trust for Historic Preservation, the Digital Literature Review, and the National Park Service. Follow her on Twitter at @lakenbrooks222 . The opinions expressed in this commentary are solely her own. View more opinion articles on CNN.\n(CNN) I'd been social distancing for a week and a half when I ventured into the nearest grocery store. As I surveyed the shelves, an employee caught my attention. \"He's asking me a question,\" I thought. But I couldn't understand him.\nHe, like many of the employers and the shoppers in the store, wore a face mask. And this worker is not alone. Dr. Anthony Fauci and other federal health officials are seriously considering the possibility that, should resources allow, most Americans should wear face masks to slow the spread of Covid-19. But when people wear masks, I feel like I'm wearing earmuffs. I was finally around people again in the grocery store, even if it was from a safe distance. But in a world without voices, I felt more isolated than ever before.\nSome people, like me, read lips. I have tinnitus: ringing in my ears. While I can hear clearly most of the time, this sound distortion comes and goes, and it's unpredictable. I feel a reverberating pain in my ears when I hear a sound that is too low or too high of a pitch. Reading lips has helped me cope with this auditory disorder for five years.\nCovid-19 changed everything. Face masks have become the must-have health item for 2020. Two images have become iconic on our screens during this pandemic: empty streets and people covering their noses and mouths . For many deaf people or people like me with less severe hearing problems, the two images convey the same loneliness.\nWhile masks are a vital health care tool for many people, they also present a new set of challenges for the deaf community. When people wear masks, including trending DIY masks, they muffle their voices and prevent people from reading their lips. For people who are hard of hearing, that's a problem.\nI took to social media to see how Covid-19 is impacting people in the real world. Non-deaf medical professionals and deaf people alike have experienced unexpected communication issues during Covid-19. These problems range from my inconveniences when shopping to potentially life-threatening medical misunderstandings.\nJUST WATCHED College student makes masks for deaf and hard of hearing Replay More Videos ... MUST WATCH College student makes masks for deaf and hard of hearing 01:57\nLauren Sugrue was born hard of hearing. Sugrue says, \"Lip reading has been more difficult because you don't want people to take off their masks or other face coverings for protection. But when you can't see their lips, it's extremely difficult to know what they're saying. I've had to find new ways to communicate even before Covid-19, but the pandemic has thrown new hurdles in our way.\" Sugrue effectively used a whiteboard to communicate with doctors before coronavirus began to spread; however, many people in the deaf community now cannot pass a piece of paper or a whiteboard back and forth to a person who is standing six feet away.\nDeva Darnell, a non-deaf nurse in an emergency room, says \"I have a hard time communicating with my patients. People who could normally read my lips now can't understand me.\" Darnell can't take off her mask when she works. Even if she could, her patients with vision impairments can't read her lips if she stands far away. \"I feel guilty, like I can't serve some of my patients as well or as quickly as I need to.\"\nWe are three people. But our stories represent thousands, if not millions, of people around the globe who are struggling to connect with others during Covid-19. The Deaf/Hard of Hearing Technology Rehabilitation Engineering Research Center published strategies for deaf people to use when they navigate public or medical spaces, such as by downloading speech-to-text apps or preparing a written script before leaving their home. The organization states, \"You need to be prepared. Before the pandemic, hospitals had good services to help you communicate clearly. There are new rules now. Many hospitals will not allow in-person interpreters to go in with you.\" But this burden shouldn't fall solely on the shoulders of the deaf community. In these unprecedented times, we will have to work together to find unprecedented ways to communicate.\nFor me and others like me, there is no easy solution to this problem, so we should consider many different tools to make communicating as easy as possible. Sign language is perhaps the most obvious method to make spaces more accessible to the deaf community. Sugrue recommends that essential businesses hire at least one sign language interpreter and provide whiteboards that \"can be sprayed down with disinfectant.\" Other deaf individuals may benefit from video chats in which they can read a person's lips on the screen while maintaining a safe distance.\nA whopping 15% of American adults report hearing loss, but many people never learn to sign because they lose their hearing gradually. Some of these people -- like my grandmother and perhaps yours, too -- rely on lip-reading. To help these individuals who are not fluent in ASL, but still have some hearing, essential workers may carry portable microphones that clip onto a headset or a belt.\nNurses and doctors may want to experiment with phone apps that turn a smartphone into a microphone when you pair your phone with any Bluetooth speaker. These simple adjustments will boost their volume and bridge the communication gap.\nThis see-through prototype has not been medically tested, and people who wear such a mask will need to be careful that the heat and moisture from their breath do not fog up the clear panel. However, this design is a step forward in the right direction as citizens all over the country experiment with new options to make communicating easier for all of us. Another possible solution are face masks with a plastic panel over the mouth, like this one This see-through prototype has not been medically tested, and people who wear such a mask will need to be careful that the heat and moisture from their breath do not fog up the clear panel. However, this design is a step forward in the right direction as citizens all over the country experiment with new options to make communicating easier for all of us.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nMuch is uncertain about Covid-19 at this time, including how deaf and non-deaf people will continue speaking with one another during the months to come. What I know for sure is that we can choose to emerge from this pandemic with a greater understanding of each other and new ways to stay connected, even when we can't hear every word.", "url": "https://www.cnn.com/2020/04/02/opinions/deaf-hard-of-hearing-face-masks-brooks/index.html"}