{"authors": ["Opinion Robyn Curnow"], "date_download": "2020-05-04 16:09:16", "date_modify": "2020-05-04 16:09:16", "date_publish": "2020-04-02 19:29:18", "description": "Robyn Curnow writes that President Donald Trump should learn from the tragic lessons of President Thabo Mbeki's mistakes in handling of the HIV/AIDS epidemic in South Africa.", "filename": "2020_04_02_opinions_epidemi_efc3fc3333b4268305c5924e3e5b0294_index_1588608556.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/160608113730-hiv-antiretroviral-drugs-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_opinions_epidemi_efc3fc3333b4268305c5924e3e5b0294_index_1588608556.html", "title": "What happened when a president ignored the science on an epidemic", "title_page": "What happened when a president ignored the science on an epidemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Robyn Curnow is a CNN anchor and host of CNN International's \"CNN Newsroom with Robyn Curnow.\" The opinions expressed here are her own. Read more opinion at CNN.\n(CNN) The sickness is hidden at first; nobody knows if they have it, if they are a carrier. There is confusion too. Many questions about how the infection spreads. People don't curb risky behavior. Scientists warn about exponential growth in the number of cases. People start to get sick. They cough, gasp for breath, become too weak to get out of bed. Often alone. So much death. Families, clinics, hospitals, entire communities are overwhelmed. It is a virus; new and not understood, contagious and indiscriminate.\nFor a time, the President does not listen to the virologists, or the doctors who are treating the growing numbers of the afflicted. He does not track epidemiologists' warnings or pay attention to their mapped-out projections. Neither does he implement his own government's plan of action. He refuses to acknowledge there is a problem. He waits, obfuscates, delays. He politicizes a national health crisis. He confuses his own people with half-baked ideas and random conspiracy theories. He blames others for bringing the virus to his people.\nWhen the situation deteriorates to the point that he is forced eventually to do something, his messages are still mixed and his response is piecemeal. The damage is done. The virus penetrates deep into the heartland, spread by inaction, misinformation and a dire lack of leadership at crucial moments when the infection could have been slowed.\nI'm not talking about America today. All of this happened over two decades ago, in my home country of South Africa, where for years President Thabo Mbeki refused to deal with the HIV/AIDS epidemic rampaging across the nation. By the time he did, South Africans had paid a terrible price. And while the differences between HIV/AIDS and Covid-19 are myriad, some stark lessons from the past have crystallized for me.\nOver the past few weeks, I have watched and listened as President Donald Trump got off to a stumbling start with echoes of Mbeki's mistakes. For those of us who have witnessed both Mbeki's long denial of the AIDS epidemic and Trump's response to the coronavirus emergency, there are alarming similarities between these men's behavior at the early stages of a public health crisis. The most simple and heartbreaking connection between both is that their delayed response impacted the lives of those they swore an oath to protect. In South Africa, a doctoral thesis by a student at the Harvard School of Public Health estimated more than 330,000 South Africans unnecessarily died between 2000-2005 because of the Mbeki government's obstruction of treatment.\nTrump may finally be getting to grips with the gravity of the situation, thus dropping his talk of filling churches for Easter, extending federal social distancing measures to April 30 and acknowledging that more than 100,000 Americans could die from Covid-19 -- perhaps more than 2 million if \"we did nothing.\" But disconnects remain, with Trump saying that if there are fewer than 100 000 deaths -- almost twice as many as American soldiers killed in Vietnam -- \"we all together have done a very good job.\" In addition, the President has pitted state governors against each other, equated the virus with the common flu, denied there are shortages in critical protective equipment and refused to take early warning models seriously -- leaving states, hospitals and medical staff unprotected and unprepared. Since this novel coronavirus has the ability to quickly spread largely undetected in the absence of robust testing in the United States, each day of indecision and misdirection has cost the country dearly in terms of preparation and allocation of badly needed resources.\nBoth Mbeki and Trump put off taking quick, bold decisions because they were distracted by false information. The US President likes to take his cue from Fox News which, for weeks, downplayed the threat and suggested that the clamoring calls for more action and preparation was just liberal hysteria targeting 'his' economy and chances of reelection.\nIn South Africa, Mbeki -- who took office as the widely respected successor to Nelson Mandela -- spent hours on the internet, often late into the night, finding articles and connecting with those who dismissed the links between HIV and AIDS. He downplayed the virus -- like Trump in the early stages of the coronavirus pandemic -- saying it was not a potent medical threat.\nMbeki suggested that the science behind HIV/AIDS and antiretroviral drugs was a conspiracy by large pharmaceutical companies and Western (white) countries to perpetuate insulting stereotypes about African sexuality and masculinity. His own political party could not, or would not, disagree with him. His doubts became the foundation of a compromised health system. Even after anti-retrovirals became available his administration actively opposed and delayed the deployment of the drugs. The government actually went as far as refusing to roll out medication known to prevent mother-to-child transmission of HIV. It took a Constitutional Court ruling to force the government to give a single dose of nevirapine to mothers in labor and their infants within 72 hours of birth. An estimated 35,000 babies were born with HIV as a direct consequence of the Mbeki government's failure to manage and distribute available medical resources.\nTrump too has suggested others (the Chinese) are to blame for the virus.\nIn South Africa, Mbeki and his ill-prepared health minister advocated a regime of eating vegetables such as beetroot and African wild potatoes to protect against infection. The underlying premise was correct -- a good diet with plenty of vitamins could boost immune systems. However, the mixed messages soon were misinterpreted and confused South Africans who thought some local vegetables could protect against AIDS.\nCertainly Trump isn't refusing to allow Americans the benefit of new treatments in the way that Mbeki did 20 years ago. But he seems to have ignored expert warnings about the threat of a global pandemic when he took office in 2017. And his over the top optimism about a yet unproven drug generated some confusion when he used anecdotal evidence to declare that variants of the anti-malarial drug chloroquine might be a treatment for coronavirus. After he mentioned it at a briefing, a Phoenix couple tried to self-medicate with a non- pharmaceutical version of it -- an additive used to clean fish tanks. The man died and the woman had to be admitted to critical care. In Nigeria, health officials said three people had overdosed on the drug after Trump's comments. (The FDA has since granted emergency authorization to use the drug. This drug may yet prove effective but in the meantime public health officials are left to clean up this confusion urging people not to hoard the drug so that those who need it for treatment of things like lupus can get their regular prescription filled.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nMbeki's administration eventually corrected course, but not before hundreds of thousands of lives were lost. Even today, the more than 7 million South Africans living with HIV must still confront the stigma born in those early few years of the epidemic.\nCoronavirus and HIV/AIDS are, of course, different diseases. But Mbeki demonstrated to the world the tragic cost if leaders fumble their initial responses to a pandemic. Leadership is about taking tough decisions, gaming out strategies and putting lives above politics. History has shown there is a hideous price to be paid for ignoring medical science.", "url": "https://www.cnn.com/2020/04/02/opinions/epidemic-science-trump-aids-robyn-curnow-opinion/index.html"}