{"authors": ["Joe Lockhart"], "date_download": "2020-05-04 17:02:41", "date_modify": "2020-05-04 17:02:41", "date_publish": "2020-04-10 18:52:03", "description": "We are in a national crisis and we only have one President. It's hard to make the case that his words are not relevant. What needs to change is the briefings themselves, writes Joe Lockhart.", "filename": "2020_04_10_opinions_trump-h_d167f5bc1d08001bd9ce860373c4062e_index_1588611761.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407174525-01-coronavirus-briefing-0407-trump-screengrab-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_opinions_trump-h_d167f5bc1d08001bd9ce860373c4062e_index_1588611761.html", "title": "How to fix the White House press briefings", "title_page": "How to fix the White House press briefings - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Joe Lockhart is a CNN political analyst. He was the White House press secretary from 1998-2000 in President Bill Clinton's administration. He co-hosts the podcast \"Words Matter.\" The opinions expressed in this commentary are his own. View more opinion at CNN.\n(CNN) There has been much debate about whether television and cable networks should air the entirety of the president's press briefings live. A president updating the American people during a global crisis is certainly newsworthy. But many argue that giving President Donald Trump an unchecked platform to spout false information is irresponsible.\nJoe Lockhart\nThis debate, in my opinion, presents the wrong question. Instead of asking whether the briefings should be aired, we should be asking how they can be improved. We are in a national crisis and we only have one president. It's hard to make the case that his words are not relevant amid wall-to-wall coverage of the Covid-19 pandemic. What needs to change is the briefings themselves.\nFirst, get them out of the briefing room. Some 20 years ago, I approached President Bill Clinton with the idea of renaming the room after former White House press secretary James Brady, who was shot in the head and permanently disabled in the 1981 assassination attempt on President Ronald Reagan.\nJim \"the Bear\" Brady represented the best in America, and that room has special meaning, not only to the Brady family and reporters, but to all Americans who received some of the most significant news in their lives from that room. The so-called \"briefings\" make a mockery of Jim Brady's contribution to his country and the importance of a free and fair press in our society.\nAnd it's not just the symbolic affront to the Brady's legacy. While Trump has failed to adhere to CDC guidelines to stay six feet apart from others, he has benefited from the new White House Correspondents Association rules that restrict the number of journalists who can attend the briefings on any given day. The briefings are now covered by a rotating pool of reporters, instead of the entire White House press corps as a precaution against the virus.\nRead More", "url": "https://www.cnn.com/2020/04/10/opinions/trump-how-to-improve-coronavirus-press-briefings-lockhart/index.html"}