{"authors": ["Bukola Adebayo"], "date_download": "2020-05-04 17:02:17", "date_modify": "2020-05-04 17:02:17", "date_publish": "2020-04-10 13:17:12", "description": "Africa's ailing presidents and powerful elites have been known to jet out to seek treatment abroad, instead of investing in healthcare in their own countries but critics say the pandemic is a 'wake up call' for them.", "filename": "2020_04_10_africa_african-l_386b22654c09f047cdb51fc599d62bd2_index_1588611737.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410134824-africa-hospitals-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_africa_african-l_386b22654c09f047cdb51fc599d62bd2_index_1588611737.html", "title": "Africa's leaders forced to confront healthcare systems they neglected for years", "title_page": "Africa's leaders forced to confront healthcare systems they neglected for years - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Africa's ailing presidents and powerful elites have been known to jet out to seek treatment abroad, instead of investing in healthcare in their own countries.\nNigeria's President Muhammadu Buhari was out of the country for several months in 2017 for treatment in London for an undisclosed illness and has frequent checks abroad. Since he took office in 2015, he has embarked on at least four medical trips to the UK.\nBut with flights grounded and countries across the world on lockdown in the wake of the coronavirus pandemic, these leaders are getting a wake-up call that they must fix their healthcare systems.\n3. @StephanieBusari Cartoonists have caught on the joke. Nigerian politicians forced to use health facilities they refused to develop pic.twitter.com/lwjFpECu85\nThe President of the Commonwealth Medical Association , Osahon Enabulele, says while citizens have endured their leaders' frequent recourse to overseas medical treatment in the past, they may not remain so tolerantif the coronavirus wreaks havoc as it has elsewhere in the world.\n\"There is no place for any leader to hide anymore,\" Enabulele said. \"This whole situation of public office holders in Africa, most times using taxpayers' money to go on foreign medical trips at the slightest discomfort is one thing that will be reversed when this pandemic is over,\" Enabulele told CNN.\nA terrifying prospect\nacross the continent, while significantly lower than other parts of the world, are rising exponentially. The Infection numbersacross the continent, while significantly lower than other parts of the world, are rising exponentially. The World Health Organization recently reported that the number of cases in Africa was now more than 11,000, with 600 deaths.\nThe pandemic has overwhelmed advanced health facilities, and experts predict it could devastate the continent's fragile health systems, already plagued by inadequate funding and labor disputes.\nLifesaving machines like ventilators -- critical to the management of Covid-19 cases -- remain a luxury in some African countries.\nThe Central African Republic (CAR) has only three ventilators to five million people, the Norwegian Refugee Council (NRC) said, warning that an outbreak could bring the tiny African nation to its knees.\n\"When rich nations are in panic mode stating that thousands of ventilators will not be enough, it just brings to light how poorer nations like CAR don't stand a chance in the fight against Covid-19,\" NRC Country Director in the CAR, David Manan said.\nThe situation is equally dire in Zimbabwe, where health workers in the nation's hospitals say they lack basics such as bandages and gloves to take care of their patients.\nNurses and doctors abstained from work to protest a shortage of coronavirus protective gear after the country recorded its first fatality last month.\nUgandan popstar-turned-politician Bobi Wine told CNN the healthcare system in many African countries cannot handle a mass outbreak of Covid-19.\n\"I need to remind people that the coronavirus is more serious than they are already taking it. It is killing people in big numbers in Italy where there is a super health care system. So it scares me to even imagine what it can do in Africa if it comes in full effect,\" Wine said.\nWine said health care funding has not been at the forefront of government spending in many African countries because their leaders often seek treatment in hospitals abroad.\n\"It's clear that healthcare is not a priority for many African governments, and they put very little money into that sector. Anytime they are sick, or their children are having health conditions, they opt to go outside their countries,\" Wine said.\n\"Now the coronavirus pandemic has set a different ground for many African leaders. It has shown that they should have invested in the healthcare system of their countries which would have benefited them and the people in this crisis.\"\nThe lawmaker says monies spent on medical trips abroad could have been used to equip local hospitals with modern medical equipment such as ventilators, which have proved critical in treating some patients who have developed respiratory illnesses because of Covid-19.\nWine said some public hospitals in Uganda had become \"death traps\" due to years of neglect, and some citizens, including himself, have had to pay prohibitive costs for overseas treatment that could have been cheaper in Uganda.\nBetween 2019 and 2020, Uganda spent 8.9 percent of its national budget on health down from 9.2 percent from the previous fiscal year, according to UNICEF.\n\"I have had to spend my funds to seek advance treatment abroad because the procedure could not be provided in this country. But a majority of leaders in Uganda travel abroad for minor care using taxpayers money,\" Wine said.\nBut Uganda's health minister Jane Aceng told CNN Wine's assessment of the country's health system was not accurate.\n\"Uganda is doing well and that shows with our response to the coronavirus situation. We're doing well,\" she said.\nAceng added that she had all the resources needed to do her job.\nThe East African nation was one of the first African countries to impose travel and strict quarantine policies to prevent the spread of coronavirus even before it reported a case. It has so far reported 53 cases\nA failed pledge\nAfrican leaders have consistently neglected their country's health sector despite several pledges to do improve it, analysts say.\nIn 2001, the heads of state of 52 African countries met in Nigeria's capital, Abuja and committed to spending 15 percent of their yearly domestic budget on health.\nJust a handful of countries have met this target on the continent. They include Tanzania , Rwanda, Botswana and Zambia, according to the WHO.\nRwanda doubled it's health care spending over a period of 10 years, the WHO said in the 2017 report. The Central African nation has also received praised for its national health insurance coverage which is the highest on the continent\nBut a majority have fallen through the cracks in fulfilling this commitment.\nSince it signed the declaration, Nigeria has allocated less than six percent of its budget to health, and most of the funds are spent on salaries, according to Nigeria-based budget monitoring organization Budgit\nIn a paper published by the Brookings Institute , researchers said although Africa bore 23 percent of the world's disease burden in 2015, it accounted for only one percent of the global health spending for the same year.\n\"In per capita terms, the rest of the world spends 10 times more on health care than Africa,\" the researchers said.\nThe researchers predict it may be difficult for the countries on the continent to achieve the Sustainable Development Goals with a 2030 deadline with the \"current spending environment.\"\nWake-up call\nNigerian-British historian Ed Keazor agrees that the fallout from the outbreak is a \"wake-up call\" for governments to prioritize affordable health care.\nKeazor, a cancer survivor said he made the difficult decision to move back to London where he has access to affordable care under the National Health Service even though he works in Nigeria.\nThe filmmaker said he came to Lagos for a research and film festival in March but got caught in the city after the Nigerian government banned all international flights to contain the spread of the outbreak.\nKeazor says he's missed an appointment with his doctor in the UK due to the travel restriction, and that would not have been a problem if he could get the same quality of care locally.\n\"If I could get the same quality of care here (Nigeria) as in the UK where I'm a taxpayer and getting good medical services, I would rather stay back here because this is where my work and my larger family is but unfortunately, its not there,\" Keazor told CNN.\nFor now, he hopes the health crisis will change the Nigerian government's focus to where he says it should be.\n\"I hope the enormity of this problem has brought home the urgency of investment in health care infrastructure to the government and whatever the country looks like after this crisis is over, our priorities will be focused on heath care and education,\" he said.", "url": "https://www.cnn.com/2020/04/10/africa/african-leaders-healthcare-coronavirus-intl/index.html"}