{"authors": ["Jonathan J. Cooper"], "date_download": "2020-05-04 20:25:36", "date_modify": "2020-05-04 20:25:36", "date_publish": "2020-04-11 00:21:16", "description": "PHOENIX (AP) — With the campaign for one of the nation’s top Senate races in something of a holding pattern as Arizona responds to the coronavirus outbreak, differences are emerging in the...", "filename": "_72ddadd8f72c4b804bdb1ffddb41e84f_1588623936.html", "image_url": "https://storage.googleapis.com/afs-prod/media/291f16f73ffe438e858b5d2480bba3a0/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_72ddadd8f72c4b804bdb1ffddb41e84f_1588623936.html", "title": "McSally, Kelly offer divergent takes on coronavirus response", "title_page": "McSally, Kelly offer divergent takes on coronavirus response", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "U.S. Sen. Martha McSally, R-Ariz., packs food boxes at St. Mary's Food Bank Friday, April 10, 2020, in Phoenix. Arizona. McSally is pinning the blame for the coronavirus outbreak on China and the World Health organization, while her likely Democratic rival, Mark Kelly, is pushing President Donald Trump to more aggressively force U.S. companies to produce medical supplies. (AP Photo/Matt York)\nU.S. Sen. Martha McSally, R-Ariz., packs food boxes at St. Mary's Food Bank Friday, April 10, 2020, in Phoenix. Arizona. McSally is pinning the blame for the coronavirus outbreak on China and the World Health organization, while her likely Democratic rival, Mark Kelly, is pushing President Donald Trump to more aggressively force U.S. companies to produce medical supplies. (AP Photo/Matt York)\nPHOENIX (AP) — With the campaign for one of the nation’s top Senate races in something of a holding pattern as Arizona responds to the coronavirus outbreak, differences are emerging in the approaches of Republican Sen. Martha McSally and her Democratic rival, Mark Kelly.\nMcSally has pinned the blame for the outbreak on China and the World Health Organization, while talking up the $2.2 trillion federal rescue package that propped up struggling businesses and sent checks to most taxpayers.\nKelly has pushed the federal government to more aggressively force U.S. companies to build medical supplies under a Korean War-era law called the Defense Production Act.\nThe outbreak has shaken up the race and is likely to play a prominent role once the campaign heats up, particularly if the efforts to stop the spread of the virus continue disrupting American life and the economy. McSally has found a culprit beyond U.S. shores.\n“We do know that China covered it up, that they tried to silence their doctors. They refused to allow our scientists and doctors in,” McSally said in a brief interview Friday. It’s a message she’s repeated on Fox News and in telephone town halls she’s conducted weekly since the virus began disrupting American life.\n“They’ve been lying to their own people and they’ve been lying to the world about this pandemic that started, allegedly, with their disgusting and inhumane and deadly practices in these wet markets, where they have live and dead animals gutted and it’s just disgusting, their practices,” she said.\nShe resisted pointing blame inside the United States with the federal or state response, saying scientists were still scrambling to learn about the virus when it was first detected in the United States. She said she started getting briefings from federal health authorities in January, and began to realize how enormously it would disrupt life in the first half of March.\n“Nobody’s perfect,” McSally said. “No process is perfect, no government is perfect. But everybody is trying to do the best they can in order to save lives.”\nKelly said the pandemic is a global problem that won’t be solved by blaming foreign powers.\n“I think it’s important for all us to realize this is a worldwide crisis and a pandemic, and the best thing we can do right now is marshal all the resources we have and fight this thing as a team,” Kelly said in a recent interview.\nPresident Donald Trump has not used the Defense Production Act as effectively as he could, Kelly said. The federal government, he said, should not only instruct companies to build ventilators and personal protective equipment, but also sign contracts promising to purchase the equipment that’s built.\nThe government response got started too late, he said.\n“I just feel we haven’t done enough to try and stay ahead of this — to think, ‘What’s it going to be like two weeks, three weeks from now?’ And prepare for that today. We’re just not seeing that.”\nArizona had requested 5,000 ventilators from the federal government, nearly doubling the number available in the state. But with a national shortage, along with new, less-dire projections, state officials dialed back their request to just 500 ventilators.", "url": "https://apnews.com/72ddadd8f72c4b804bdb1ffddb41e84f"}