{"authors": ["Summer Ballentine", "Jim Salter", "David A. Lieb"], "date_download": "2020-05-04 20:05:06", "date_modify": "2020-05-04 20:05:06", "date_publish": "2020-04-08 14:29:09", "description": "JEFFERSON CITY, Mo. (AP) — Missouri's health chief said Wednesday that he is directing medical professionals to provide racial data about patients who become ill or die from the coronavirus as...", "filename": "_03a14c83e1490fd64e8558a048cf417b_1588622706.html", "image_url": "https://storage.googleapis.com/afs-prod/media/d729927a35374521a448e5e31b986254/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_03a14c83e1490fd64e8558a048cf417b_1588622706.html", "title": "Missouri health chief seeks racial data on COVID-19 cases", "title_page": "Missouri health chief seeks racial data on COVID-19 cases", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Workers are silhouetted against the rising sun as they toil on a new apartment building in Kansas City, Mo. Wednesday, April 8, 2020. Construction workers are among the people exempt from the city's stay-at-home order which remains in effect in an effort to slow the spread of the new coronavirus. (AP Photo/Charlie Riedel)\nWorkers are silhouetted against the rising sun as they toil on a new apartment building in Kansas City, Mo. Wednesday, April 8, 2020. Construction workers are among the people exempt from the city's stay-at-home order which remains in effect in an effort to slow the spread of the new coronavirus. (AP Photo/Charlie Riedel)\nJEFFERSON CITY, Mo. (AP) — Missouri’s health chief said Wednesday that he is directing medical professionals to provide racial data about patients who become ill or die from the coronavirus as some black lawmakers raised concerns about the lack of such information.\nMissouri so far has not released data about the race of people who test positive for the virus that causes COVID-19 or who die from its complications. Health director Randall Williams said that’s because about 40% of medical providers have not been reporting that information, although they have been reporting patients’ ages.\n“We sent out a directive today to reinforce that we do want that demographic, because we think it’s really important,” Williams said in response to a question from The Associated Press.\nSome other jurisdictions already have been reporting racial data. Of the victims whose demographic information was publicly shared by officials -- nearly 3,300 of the nation’s 13,000 deaths thus far — about 42% were black, according to an AP analysis. African Americans account for roughly 21% of the total population in the areas covered the analysis.\nDuring legislative debate Wednesday on a multibillion-dollar budget bill, some black Missouri lawmakers criticized the lack of data on how COVID-19 has impacted black residents.\nSt. Louis Democratic Rep. Tommie Pierson Jr. said it would be “disturbing” if the state has data on race and is not sharing it.\n“If the data is supposed to be being collected, then we need to ensure that it is and that it is shared with those making decisions,” Pierson said.\nMissouri’s information about coronavirus-related deaths also has lagged in other regards.\nWhereas data collected by Johns Hopkins University showed 86 Missouri deaths as of Wednesday afternoon, the state’s figures showed just 58. Williams said the state must take time to vet each reported death, because it is the source of official data supplied to the federal government.\nSt. Louis County and city have accounted for just over half of the statewide total of 3,327 COVID-19 cases reported by the Missouri health department as of Wednesday.\nThe new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. The vast majority of people recover.\nMissouri National Guard Adjutant General Levon Cumpton said Wednesday that the Guard is converting a hotel in the St. Louis County suburb of Florissant into a medical center that will have over 100 beds.\nLeaders of the St. Louis Metropolitan Pandemic Task Force, made up of the region’s largest hospitals, said that the peak of the pandemic in the St. Louis area is expected to occur in two to three weeks.\nDemocratic St. Louis County Executive Sam Page sent a letter to Parson requesting that the Guard help transport patients and equipment, provide additional security at hospitals and fill in for staff at testing sites, among other things.\nIn neighboring St. Charles County, a new outbreak was reported at a psychiatric hospital. St. Charles County officials say 20 staff members and three patients at CenterPointe Hospital have tested positive since March 28.\nAnother alarming rise in confirmed cases was reported at a nursing home. Franklin County Presiding Commissioner Tim Brinker cited 34 confirmed cases and three deaths at Grandview Healthcare in Washington, Missouri, about 50 miles southwest of St. Louis.\n___\nBallentine reported from Columbia. Salter reported from O’Fallon.", "url": "https://apnews.com/03a14c83e1490fd64e8558a048cf417b"}