{"authors": ["Joe Mcdonald"], "date_download": "2020-05-04 20:13:57", "date_modify": "2020-05-04 20:13:57", "date_publish": "2020-04-16 01:42:19", "description": "BEIJING (AP) — China, where the coronavirus pandemic started in December, is cautiously trying to get back to business, but it’s not easy when many millions of workers are wary of spending much or...", "filename": "_a981361007aed7aa427a85af42623e23_1588623237.html", "image_url": "https://storage.googleapis.com/afs-prod/media/96eeafdd890b4b4ca3d8ece16953380d/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a981361007aed7aa427a85af42623e23_1588623237.html", "title": "China tries to revive economy but consumer engine sputters", "title_page": "China tries to revive economy but consumer engine sputters", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this April 13, 2020, photo, a couple walk through the capital city's popular shopping mall in Beijing. Chinese leaders have reopened factories and shops in an effort to revive the economy, but the consumers whose spending propels most of China's growth have been slow to return to shopping malls and auto dealerships. (AP Photo/Andy Wong)\nIn this April 13, 2020, photo, a couple walk through the capital city's popular shopping mall in Beijing. Chinese leaders have reopened factories and shops in an effort to revive the economy, but the consumers whose spending propels most of China's growth have been slow to return to shopping malls and auto dealerships. (AP Photo/Andy Wong)\nBEIJING (AP) — China, where the coronavirus pandemic started in December, is cautiously trying to get back to business, but it’s not easy when many millions of workers are wary of spending much or even going out.\nFactories and shops nationwide shut down starting in late January. Millions of families were told to stay home under unprecedented controls that have been copied by the United States, Europe and India.\nThe ruling Communist Party says the outbreak, which had killed more than 3,340 people among more than 82,341 confirmed cases as of Thursday, is under control. But the damage to Chinese lives and the economy is lingering.\nTruck salesman Zhang Hu is living the dilemma holding back the recovery. The 27-year-old from the central city of Zhengzhou has gone back to work, but with few people looking to buy 20-ton trucks, his income has fallen by half. Like many millions of others, he is pinching pennies.\n“I put off plans to change cars and spend almost nothing on eating out or entertainment,” he said. “I have no idea when the situation will turn better.”\nFactories reopened in March after President Xi Jinping visited Wuhan, the city at the center of the outbreak, in a sign of confidence the virus was under control. But the consumers whose spending propels China’s economic growth are still afraid of losing their jobs or catching the virus. They are holding onto their money despite official efforts to lure them back to shopping malls and auto showrooms.\nData due out Friday is expected to show the economy contracted by up to 9% in January-March, its worst performance since the late 1970s.\nThat is a blow to automakers and other global companies that hope China, after leading the way into a global shutdown, might power a recovery from the most painful slump since the Great Depression of the 1930s.\n“What is not fully back, or is completely missing, is the demand,” said Louis Kuijs of Oxford Economics.\nIn Europe, the first tentative steps at winding back economically crippling restrictions were also running into resistance, as shoppers stayed away from the few stores that were reopening and some workers feared the newly restored freedoms could put their health at risk. The streets of Rome were largely deserted despite an easing of restrictions this week that allowed some businesses to reopen.\nIn China, e-commerce got a boost when families stuck at home bought groceries and other items online. But forecasters expect little to no growth in this year’s total spending on clothing, food and other consumer goods.\nSome cities have resorted to handing out shopping vouchers and trying to reassure consumers by showing officials on state media eating in restaurants. Consumption is a smaller share of China’s economy than in the United States and other high-income countries but accounted for 80% of last year’s growth.\nEconomists earlier forecast China would bounce back as early as this month. They cut growth forecasts and pushed back recovery timelines after January-February activity was even worse than expected.\nWith factories closed and some 800 million people told to stay home, consumer spending shrank 23.7% from a year earlier and manufacturing fell 13.5%. Auto sales plunged 82% in February. Projections of full-year Chinese growth, previously close to 6%, are now as low as zero.\nThat is dragging down global growth forecasts. The International Monetary Fund says the world economy might contract by up to 3%, a far bigger hit than 2009’s 0.1% loss during the global financial crisis.\nOther Asian economies, which are more exposed to global trade, are unlikely to see quick recoveries and will likely follow the West into a downturn, according to Morgan Stanley.\nIn China, manufacturing is back to 80% of usual levels, but urban traffic, power use and other indicators of daily life are at half to 65% of normal.\nAt the same time, public anxiety has been fed by reports of new outbreaks that have led to more controls.\nA furniture manufacturer in northeastern Shenyang reopened on March 15 but is getting few visitors in its showroom, said an employee, who would give only his surname, Jin.\n“No one wants to decorate a house and buy furniture because of the epidemic and loss of jobs,” said Jin, 33. He said he and his wife canceled plans to buy a car and travel.\nTrying to lure back shoppers, cities from Jinan in the northeast to Ningbo, south of Shanghai, are handing out vouchers. The eastern city of Nanjing gave out electronic vouchers totaling 318 million yuan ($45 million) via smartphones to spend at restaurants, bookstores and other merchants.\nAreas including Jiangxi province in the south have extended weekends to 2 1/2 days and cut admission prices for local scenic spots.\nThe ruling party has told companies to keep paying wages and avoid layoffs. Private companies were promised tax breaks, low-cost loans and other help, though state media say bureaucracy is slowing the flow of aid.\nChinese exporters of consumer electronics, clothes and other goods are unlikely to get much help from abroad as the United States and Europe suffer waves of job losses and tell consumers to stay at home.\nChina’s leaders are spending more on roads, other public works and on next-generation telecoms networks but are reluctant to pump too much money into the economy for fear of fueling inflation and adding to a mountain of debt.\n“It doesn’t make sense to stimulate too much at this stage,” said Larry Hu of Macquarie Capital in a report. “It will lead to more inflation instead of more output.”\n___\nAP researcher Yu Bing contributed to this report.\n___\nThis story’s 17th graf beginning “Other Asian ...” has been updated to correct that Morgan Stanley refers to exposure to global trade, not Chinese tourism.", "url": "https://apnews.com/a981361007aed7aa427a85af42623e23"}