{"authors": ["Kathleen Foody"], "date_download": "2020-05-04 20:10:36", "date_modify": "2020-05-04 20:10:36", "date_publish": "2020-04-16 14:54:37", "description": "CHICAGO (AP) — Illinois officials on Thursday reported the deadliest 24 hours in the state since the start of the coronavirus pandemic and said new supplies would allow for more testing, which is...", "filename": "_15efc246fee987bfe28053ae5ef097dc_1588623036.html", "image_url": "https://storage.googleapis.com/afs-prod/media/24bb07b744b046f584aa8be5046281d0/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_15efc246fee987bfe28053ae5ef097dc_1588623036.html", "title": "Tests prioritized as virus deaths in Illinois pass 1,000", "title_page": "Tests prioritized as virus deaths in Illinois pass 1,000", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This Wednesday, April 15, 2020 photo shows a man sitting outside the main doors of Symphony Nursing home in Joliet, Ill. A spokeswoman for the nursing home in the northern Illinois community says several residents and a staff member at the facility have died of the coronavirus. (Abel Uribe/Chicago Tribune via AP)\nThis Wednesday, April 15, 2020 photo shows a man sitting outside the main doors of Symphony Nursing home in Joliet, Ill. A spokeswoman for the nursing home in the northern Illinois community says several residents and a staff member at the facility have died of the coronavirus. (Abel Uribe/Chicago Tribune via AP)\nCHICAGO (AP) — Illinois officials on Thursday reported the deadliest 24 hours in the state since the start of the coronavirus pandemic and said new supplies would allow for more testing, which is essential for stopping the spread of the virus.\nGov. J.B. Pritzker reported that 125 people had died in Illinois since Wednesday afternoon, bringing the statewide death toll from the virus to 1,072. Reported cases also continued to climb, with 1,140 new results bringing the statewide total to 25,733.\nPritzker said dozens of health clinics that focus on under-served communities have signed up to act as testing sites for patients. The University of Chicago Medicine also announced Thursday that it expects to test 1,000 people per day at hospitals and community sites.\nIllinois also expanded the criteria at state-run sites to allow anyone with symptoms of COVID-19, the disease caused by the virus, to get tested, and recommended health care providers running their own sites should use the same criteria.\nPritzker thanked several state universities for working to secure swabs and other supplies essential to gather and complete lab testing for the virus.\nPritzker has often cited a goal of testing 10,000 people per day in Illinois but the state hasn’t come close to that yet. Adding testing sites and guaranteeing the flow of supplies will improve Illinois’ ability to meet that goal, he said.\n“This progress on testing isn’t all the progress that we need to begin on our path back to normal,” he said. “But this is truly an important step to help us get there.”\nThe state plans to announce two additional drive-thru testing sites this week that will be capable of collecting hundreds of individual samples per day, the governor said.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness and death.\nThe governor’s update followed reports that 22 residents and one staff member at Symphony of Joliet, a nursing home in the northern Illinois community of Joliet, have died of the coronavirus.\nSince a widely reported outbreak at a suburban Seattle nursing home claimed at least 43 lives, The Associated Press has found that more than 3,600 deaths across the country linked to coronavirus outbreaks in nursing homes and long-term care facilities.\nSymphony spokeswoman Lauryn Allison said Wednesday that staffing was adequate and that employees have been following government guidelines to minimize the spread of the virus. She said they began moving healthy residents from the facility to other locations in its network earlier this month.\n“It’s a global pandemic, there’s nothing they could have done to prevent it,” she said.\nBut a brother and sister of a 65-year-old woman who was one of the 23 to die said care at the facility was inadequate.\n“She was complaining that she was in constant pain,” Michael Brooks told the Chicago Tribune after his sister, Diane Brooks, died. “Sometimes she would defecate herself without them changing her. We’d come visit her, and who knows how long she was like that.”\nBrooks and his other sister, Dorisell, said their sister, who needed around-the-clock care after suffering an aneurysm and stroke, also had bed sores. They said no one at Symphony ever told them their sister had contracted the virus.\nA call to Symphony of Joliet by The Associated Press on Thursday morning went unanswered.", "url": "https://apnews.com/15efc246fee987bfe28053ae5ef097dc"}