{"authors": ["David Biller"], "date_download": "2020-05-04 20:31:42", "date_modify": "2020-05-04 20:31:42", "date_publish": "2020-04-14 15:41:11", "description": "RIO DE JANEIRO (AP) — The International Monetary Fund on Tuesday forecast the economy of Latin America and the Caribbean will contract 5.2% in 2020 as activity grinds to a halt due to the spread...", "filename": "_d546fbf64d50e6a5d87433021bbc72ed_1588624302.html", "image_url": "https://storage.googleapis.com/afs-prod/media/aef8adbf88e44e21a8e7afb1c8381070/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d546fbf64d50e6a5d87433021bbc72ed_1588624302.html", "title": "IMF sees Latin America suffering worst contraction on record", "title_page": "IMF sees Latin America suffering worst contraction on record", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A fruit vendor, wearing a protective face mask, makes her way through a popular market in Managua, Nicaragua, Tuesday, April 7, 2020. Restaurants are empty, there's little traffic in the streets and beach tourists are sparse headed into Holy Week despite the government's encouragement for Nicaraguans to go about their normal lives. (AP Photo/Alfredo Zuniga)\nA fruit vendor, wearing a protective face mask, makes her way through a popular market in Managua, Nicaragua, Tuesday, April 7, 2020. Restaurants are empty, there's little traffic in the streets and beach tourists are sparse headed into Holy Week despite the government's encouragement for Nicaraguans to go about their normal lives. (AP Photo/Alfredo Zuniga)\nRIO DE JANEIRO (AP) — The International Monetary Fund on Tuesday forecast the economy of Latin America and the Caribbean will contract 5.2% in 2020 as activity grinds to a halt due to the spread of the new coronavirus.\nA recession of that magnitude would be the worst since at least 1980, the first year in the IMF’s World Economic Outlook database.\nFor comparison, the global financial crisis caused a regional recession in 2009 that was less than half as deep as the one the IMF predicts for this year.\nThe IMF report follows estimates by the World Bank of a 4.6% contraction for the region this year. The U.N.’s Economic Commission for Latin America and the Caribbean projected economic activity would fall by 1.8% to 4%.\nThe IMF’s forecast includes a 5.3% plunge in Brazil. That would be the deepest single-year tumble since at least 1901, when national accounts data from the government’s economics institute begin. Brazil contracted 2% in 1918, the year of the Spanish flu pandemic, according to the institute.\nThe IMF’s 6.6% contraction forecast for Mexico is the worst among major countries in the region except Venezuela, which was already in the throes of a multi-year depression before onset of the pandemic. That would be an even poorer result for Mexico than 1995, the year of the peso crisis that followed sudden currency devaluation.\nIn its report, the IMF concedes there is “extreme uncertainty” around its outlook for global growth, which could be the biggest contraction since the Great Depression of the 1930′s, and says exact fallout depends on difficult-to-predict factors including the path of the pandemic’s spread, efficacy of containment efforts, extent of supply disruptions, tightening in global financial conditions and shifts in consumers’ behavior.\nEcuador will also be particularly hard hit, with a decline of 6.3%, the multilateral lender said in its report.\n___\nAP writer Christopher Sherman contributed reporting from Mexico City", "url": "https://apnews.com/d546fbf64d50e6a5d87433021bbc72ed"}