{"authors": [], "date_download": "2020-05-04 20:21:37", "date_modify": "2020-05-04 20:21:37", "date_publish": "2020-04-17 14:21:16", "description": "PROVIDENCE, R.I. (AP) — Rhode Island is taking extra steps to protect residents of the state's nursing homes and assisted living facilities who are particularly susceptible to the coronavirus,...", "filename": "_2ca2b4666780e74523a11ce0005518fc_1588623697.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2ca2b4666780e74523a11ce0005518fc_1588623697.html", "title": "Rhode Island takes steps to protect elderly during pandemic", "title_page": "Rhode Island takes steps to protect elderly during pandemic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PROVIDENCE, R.I. (AP) — Rhode Island is taking extra steps to protect residents of the state’s nursing homes and assisted living facilities who are particularly susceptible to the coronavirus, state Department of Health Director Nicole Alexander-Scott said Friday.\nThe state reported an additional 13 COVID-19-related fatalities on Friday, bringing its total to 118 deaths. Of the 13 new deaths, 10 lived in what Alexander-Scott called congregate-care facilities. One of the new deaths was a person over the age of 100, she said.\nMore than 90 of the people who have died in Rhode Island lived in such facilities.\n“We are doing everything we can to keep them safe,” she said.\nMeasures either already in place or set for launch soon include isolation at the first sign of symptoms; aggressive and more frequent testing of residents and their caregivers every seven to 10 days; and the creation of “strike teams” that can be deployed to nursing homes that are experiencing outbreaks to aid the staff.\nThe state will also provide support for families taking care of elderly relatives at home, she said.\nIn addition to the 13 new deaths, the state Department of Health announced 366 new cases of the virus Friday, bringing the state total to almost 4,200.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and those with existing health problems, it can cause more severe illness or death.\n___\nWORKERS’ COMPENSATION\nBeacon Mutual Insurance Co., Rhode Island’s dominant workers’ compensation insurer, will work under the presumption that front-line health care workers with COVID-19 got the disease in the line of duty, and are therefore eligible for benefits, Gov. Gina Raimondo said Friday.\nThe company will also expedite the claims of health care workers, the Democrat said.\n___\nPREPARED FOR SURGE\nRhode Island’s hospitals are prepared for an expected surge in coronavirus patients, the governor said.\nThe state’s hospitals have increased bed capacity by about 250%, and the state has also set up two temporary field hospitals with 1,200 additional beds if hospitals are overwhelmed, she said.\nEven though the state has procured 1.2 million masks, 1.5 million gloves and 10,000 face shields for health care workers in the past week, it is still short of its goal of having a one-month supply of personal protective gear in reserve, she said.\n___\nLEGISLATIVE ACTIVITIES CANCELED\nThe state legislature has canceled all House and Senate sessions and all committee hearings that had been scheduled for next week because of the coronavirus pandemic, according to a statement from the General Assembly on Friday.\n___\nOCEAN STATE JOB LOT\nRhode Island-based discount retailer Ocean State Job Lot’s charitable foundation has distributed more than 150,000 surgical masks to hospitals, law enforcement agencies and fire departments across New England, it announced Friday.\nWhile most of the masks went to hospitals in Rhode Island and Massachusetts, the North Kingstown company donated 2,000 masks each to state police in Maine, Massachusetts, New Hampshire, Rhode Island and Vermont; and 200 to each police chief and fire chief in the 140 communities where Ocean State Job Lot stores are located.\n___\nVENTILATOR PROJECT\nThe University of Rhode Island’s project to refurbish unused sleep apnea machines for use by COVID-19 patients launched on Friday, a university spokeswoman said.\nThe project is a partnership involving the university, the Rhode Island Commerce Corp., the state Department of Health, fire departments and other partners.\nThe project has been collecting donations of CPAP and BiPAP machines not currently being used. They are being refurbished by a volunteer group of engineers, designers, technicians and doctors.\nThey will be distributed as needed and can be used as supplementary respiratory equipment, giving doctors the flexibility to free up time on hospital ventilators.\n___\nSTATE OFFICE CLOSED\nRhode Island Department of Human Services has temporarily closed its Pawtucket office after dozens of employees came into contact with a colleague who tested positive for the coronavirus, officials said.\nThe office has been closed to the public since March 17, but staff continued to work handling applications for public assistance.\nAbout two-thirds of the roughly 100 workers assigned to the office are affected and are in quarantine, agency spokeswoman Alisha Pina said in a statement.", "url": "https://apnews.com/2ca2b4666780e74523a11ce0005518fc"}