{"authors": ["Elizabeth Cohen", "John Bonifield", "Minali Nigam"], "date_download": "2020-05-04 16:20:55", "date_modify": "2020-05-04 16:20:55", "date_publish": "2020-04-05 16:41:26", "description": "In a haunting letter to his friends and colleagues, a Columbia University surgeon describes how coronavirus has forced doctors to ration care for very sick patients who don't have the virus, but still need medical procedures.", "filename": "2020_04_05_health_rationing_5a902cd813c7aff709cb3b2e85b7e325_index_1588609255.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403084351-hospitals-canceling-surgeries-cornavirus-pandemic-cohen-dnt-newday-vpx-00003429-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_health_rationing_5a902cd813c7aff709cb3b2e85b7e325_index_1588609255.html", "title": "New York surgeon writes haunting letter about rationing care for patients who don't have the coronavirus", "title_page": "New York coronavirus: Surgeon writes haunting letter about rationing care for patients who don't have the virus  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) In a haunting letter to his friends and colleagues, a Columbia University surgeon describes how coronavirus has forced doctors to ration care for very sick patients who don't have the virus, but still need medical procedures.\n\"We have had to make decisions that I personally have never had to contemplate before,\" wrote Dr. Emile Bacha, director of the pediatric and congenital cardiac surgery at Columbia University Irving Medical Center. \"We have had to ration care and make decisions about who is considered an urgent or emergent case.\"\nBacha explains that nurses have been deployed to care for coronavirus patients, and that safety gear is scarce.\n\"The lack of Personal Protective Equipment is galling. Who would have thought that a simple plain surgical mask, something we use and discard multiple times a day during normal times, would become a rationed product in one of the richest cities in the world?\" he wrote.\nHe said his pediatric heart surgery program was down to one operating team, \"barely.\"\nRead More", "url": "https://www.cnn.com/2020/04/05/health/rationing-care-patients-without-coronavirus/index.html"}