{"authors": ["Danielle Wiener-Bronner", "Cnn Business"], "date_download": "2020-05-04 16:54:24", "date_modify": "2020-05-04 16:54:24", "date_publish": "2020-04-08 19:48:13", "description": "Across the country, major meat processors are starting to shut down plants as employees are getting infected by coronavirus.", "filename": "2020_04_08_business_meat-plant-closures-coronavirus_index_1588611264.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408144006-tyson-foods-products-file-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_business_meat-plant-closures-coronavirus_index_1588611264.html", "title": "Meat plants are shutting down as workers get sick", "title_page": "Meat plants are shutting down as workers get sick  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Across the country, major meat processors are starting to shut down plants as employees are getting infected by coronavirus.\nTyson TSN , one of the world's largest meat processors, suspended operations at its Columbus Junction, Iowa, pork plant this week after more than two dozen workers contracted Covid-19 there. Tyson said it would divert livestock that was headed to Columbus Junction to other pork plants in the region to minimize the impact on its production.\nJBS USA, another major meat processor, has stopped operations at its beef plant in Souderton, Pennsylvania with plans to reopen April 16, after two weeks. The company decided to close the facility after several members of the plant's management team stopped going to work because they were experiencing flu-like symptoms, a company representative explained, adding that all other JBS USA's plants are still open. Cargill has also paused operations at its protein plant in Hazleton, Pennsylvania, where 900 people typically work.\nMajor meat processors are temporarily shutting down plants because of the novel coronavirus.\n\"This will allow us to minimize the impact of COVID-19 and continue [to] follow health department guidelines,\" said Jon Nash, North America lead for Cargill Protein, in a statement to CNN Business.\nConsumers are unlikely to see any shortages because of production disturbances. But the closures are devastating for some meat producers, which have remained open during the pandemic. Food suppliers are essential businesses.\nRead More", "url": "https://www.cnn.com/2020/04/08/business/meat-plant-closures-coronavirus/index.html"}