{"authors": ["Chandelis Duster"], "date_download": "2020-05-04 16:23:13", "date_modify": "2020-05-04 16:23:13", "date_publish": "2020-04-06 12:48:21", "description": "White House trade adviser Peter Navarro on Monday said he was qualified to engage and disagree with Dr. Anthony Fauci on the use of an anti-malarial drug as a coronavirus treatment -- which is not yet proven as effective -- saying, \"I'm a social scientist.\"", "filename": "2020_04_06_politics_peter-navarro-social-scientist-cnntv_index_1588609393.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191016130840-01-peter-navarro-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_peter-navarro-social-scientist-cnntv_index_1588609393.html", "title": "Peter Navarro on his qualifications to disagree with Dr. Anthony Fauci on coronavirus treatments: 'I'm a social scientist'", "title_page": "Peter Navarro on his qualifications to disagree with Dr. Anthony Fauci on coronavirus treatments: 'I'm a social scientist' - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) White House trade adviser Peter Navarro on Monday said he was qualified to engage and disagree with Dr. Anthony Fauci on the use of an anti-malarial drug as a coronavirus treatment -- which is not yet proven as effective -- saying, \"I'm a social scientist.\"\n\"Doctors disagree about things all the time. My qualifications in terms of looking at the science is that I'm a social scientist,\" he told CNN's John Berman on \"New Day.\" \"I have a Ph.D. And I understand how to read statistical studies, whether it's in medicine, the law, economics or whatever.\"\nNavarro's remarks follow reports that he clashed with officials in the Situation Room over the weekend about the unproven efficacy of hydroxychloroquine in treating coronavirus. While the task force was discussing the latest on the anti-malaria drug, an exasperated Navarro lashed out at Fauci, the nation's top infectious disease expert, who has urged caution around the drug, a person familiar with the meeting told CNN.\nNavarro had brought a stack of paperwork about the drug with him into the room, arguing it was proof that it could work to treat coronavirus, which Fauci disagreed with because it was not data.\nAxios first reported on the disagreement inside the White House about the drug.\nRead More", "url": "https://www.cnn.com/2020/04/06/politics/peter-navarro-social-scientist-cnntv/index.html"}