{"authors": ["Tami Luhby"], "date_download": "2020-05-04 15:59:50", "date_modify": "2020-05-04 15:59:50", "date_publish": "2020-04-01 12:08:16", "description": "For millions of Americans, a job doesn't only mean a paycheck -- it also provides their health insurance.", "filename": "2020_04_01_politics_health-insurance-job-us-unemployment_index_1588607990.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331152614-store-closed-coronavirus-0326-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_health-insurance-job-us-unemployment_index_1588607990.html", "title": "Where to get health insurance if you just lost your job", "title_page": "Unemployment: Where to get health insurance if you just lost your job - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) For millions of Americans, a job doesn't only mean a paycheck -- it also provides their health insurance.\nAs unemployment surges amid the coronavirus pandemic , many laid-off workers will have to find new coverage -- a critical protection as more than 180,000 Americans test positive and many are hospitalized.\nA small piece of good news: There are more options for those who have to buy health insurance on their own these days, thanks to the Affordable Care Act\nHere's where to look:\nObamacare exchanges\nThose who've recently lost their job-based coverage can check out the policies available on the Affordable Care Act exchanges by going to www.healthcare.gov\nJust know that there's only a 60-day window to take advantage of this special enrollment period once their employer coverage ends, said Sabrina Corlette, co-director of the Center on Health Insurance Reforms at Georgetown University.\nWhile Obamacare plans can be pricey, the federal government provides premium subsidies for lower- and moderate-income folks -- a category many newly unemployed may fall into. Individuals with incomes up to roughly $50,000 a year or families of four making up to than $103,000 generally qualify for help.\nAlso, those with more meager earnings are eligible for plans with lower deductibles and out-of-pocket costs. They are open to individuals with annual incomes up to roughly $31,250 or families of four making up to about $64,400.\nHowever, those with very low incomes don't qualify for Obamacare subsidies, though they may be eligible for Medicaid in many states.\nSeparately, Americans who were uninsured before the pandemic hit and are now seeking coverage can sign up for Affordable Care Act plans in the 11 states and the District of Columbia that all run their own exchanges. They have launched special enrollment periods that are available for a limited period of time.\nThe Trump administration has decided not to reopen enrollment for the uninsured in the 38 states that use the federal exchange, a senior administration official said Tuesday evening.\nAnd, now would also be a good time for current Obamacare enrollees who've lost their jobs or are making less money to return to the exchange and see if they qualify for larger subsidies to lower their monthly premiums.\nMedicaid\nThe newly jobless who've suffered major drops in income may qualify for Medicaid, particularly in the 36 states plus the District of Columbia that have expanded eligibility to low-income adults under the Affordable Care Act.\nTypically, in these states, individuals who make around $17,500 or less this year and families of four who earn up to about $31,150 are able to sign up.\nBut states look at one's income at the current point in time when determining eligibility, said Allison Orris, counsel at Manatt Health, a professional services firm. The monthly limits are roughly $1,470 for an individual and $3,000 for a family of four. Participants, however, are required to report changes in earnings in the future.\nPeople can generally apply online or over the phone through their state Medicaid agencies at any time, and most states can determine eligibility within 24 hours, according to the Kaiser Family Foundation. Medicaid provides comprehensive coverage with no or very low premiums and out-of-pocket costs, though it typically has a more limited network of doctors who accept it.\nIt's harder to qualify in states that didn't expand, particularly for those without dependent children. But kids could still be eligible for the Children's Health Insurance Program (CHIP), depending on the state and their family income.\nWhile unemployment benefits typically count as part of one's income for determining eligibility for Medicaid or CHIP, the new $600 enhancement approved by Congress last week does not.\nCOBRA\nThose who want to keep their job-based coverage usually can continue it for up to 18 months under the Consolidated Omnibus Budget Reconciliation Act of 1985, known as COBRA.\nBut this can be a very expensive option because one has to pick up the employer's share of the monthly premium too.\nTotal annual family premiums cost about $20,600 last year, on average, according to Kaiser . Employers paid about $14,600 of the tab.\nSingle coverage costs about $7,200 annually, on average, with companies covering nearly $6,000 of the premiums.", "url": "https://www.cnn.com/2020/04/01/politics/health-insurance-job-us-unemployment/index.html"}