{"authors": ["Ashley Strickland"], "date_download": "2020-05-04 16:03:08", "date_modify": "2020-05-04 16:03:08", "date_publish": "2020-04-01 17:09:54", "description": "The James Webb Space Telescope, launching in 2021, will have the largest mirror NASA has ever built. A successful test of the 21-foot mirror is the next milestone on the path to launch.", "filename": "2020_04_01_world_james-webb_cca9932cc020bd68373e39e1e3f6efba_index_1588608188.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/180328151654-james-webb34537748622-521525e6bd-o-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_world_james-webb_cca9932cc020bd68373e39e1e3f6efba_index_1588608188.html", "title": "James Webb Space Telescope tests its giant mirror ahead of 2021 launch", "title_page": "James Webb Space Telescope tests its giant mirror ahead of 2021 launch - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) When it launches in 2021, the James Webb Space Telescope will be the premier observatory of the next decade, according to NASA.\nAnd in March, despite the threat of shutdowns due to the novel coronavirus pandemic, the infrared telescope passed another milestone test on the path to launch.\nThe telescope comes equipped with a mirror that can extend 21 feet and 4 inches -- a massive length that will allow the mirror to collect more light from the objects it observes once the telescope is in space. The more light the mirror can collect, the more details the telescope can observe.\nIt's the largest mirror NASA has ever built, the agency said, but its size created a unique problem. The mirror was so large that it couldn't fit inside a rocket. So they designed the telescope as a series of moving parts that can fold origami-style and fit inside a 16-foot space for launch.\nDuring the recent mirror deployment test, the mission team was able to see the large mirror completely unfurled -- the same way it will be in space. The test took place in the cleanroom at Northrop Grumman Space Systems in California. The company has a contract with NASA for multiple missions.", "url": "https://www.cnn.com/2020/04/01/world/james-webb-space-telescope-mirror-nasa-scn-trnd/index.html"}