{"authors": [], "date_download": "2020-05-04 20:19:54", "date_modify": "2020-05-04 20:19:54", "date_publish": "2020-04-16 23:27:29", "description": "BOULDER, Colo. (AP) — A Colorado man sentenced to life in prison for first-degree murder in the shooting deaths of three people at an illegal marijuana grow operation will get a new trial after a...", "filename": "_4058c9332ace7234666db2fdc93c8480_1588623594.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4058c9332ace7234666db2fdc93c8480_1588623594.html", "title": "Judge orders new trial for man convicted of triple slaying", "title_page": "Judge orders new trial for man convicted of triple slaying", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BOULDER, Colo. (AP) — A Colorado man sentenced to life in prison for first-degree murder in the shooting deaths of three people at an illegal marijuana grow operation will get a new trial after a judge overturned the verdict because of juror misconduct.\nThe Boulder Daily Camera reports 27-year-old Garrett Coughlin’s attorneys appealed the 2019 verdict, saying two jurors lied on their questionnaires when asked if they, a family member or a close friend had ever been charged with or convicted of a crime other than a minor traffic offense.\nBoth jurors — a man and a woman — answered “no.” Judge Judith LaBuda concluded the man’s dishonesty didn’t indicate he was not an impartial juror, but the woman’s backstory and reasons for lying could have affected her ability to be unbiased.\nCoughlin had been serving his prison sentence at the Crowley County Correctional Facility. It’s unclear if or when he will be transferred to the Boulder County Jail to await a new trial. The jail is not currently accepting inmate transfers due to the coronavirus outbreak.\nProsecutors said Coughlin killed Wallace White, Kelly Sloat-White and Emory Fraker, near Boulder on April 13, 2017, because he wanted to steal money and marijuana to feed his drug addiction.", "url": "https://apnews.com/4058c9332ace7234666db2fdc93c8480"}