{"authors": ["Sophia Tareen"], "date_download": "2020-05-04 20:15:32", "date_modify": "2020-05-04 20:15:32", "date_publish": "2020-04-07 21:27:38", "description": "CHICAGO (AP) — The Green and Libertarian parties in Illinois have filed a federal lawsuit claiming Gov. J.B. Pritzker's stay-at-home order has impeded the petition process necessary to get on the...", "filename": "_29d0824819a31ff03716d1e1aef689eb_1588623332.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_29d0824819a31ff03716d1e1aef689eb_1588623332.html", "title": "Gov's stay-at-home order hurts 3rd party candidates", "title_page": "Lawsuit: Gov's stay-at-home order hurts 3rd party candidates", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHICAGO (AP) — The Green and Libertarian parties in Illinois have filed a federal lawsuit claiming Gov. J.B. Pritzker’s stay-at-home order has impeded the petition process necessary to get on the November ballot.\nThe lawsuit, filed last week in Chicago, alleged the order intended to curb the spread of coronavirus and social distancing recommendations have made it “practically impossible” to collect signatures safely in person.\nUnder Illinois’ election rules, candidates not from established parties have to collect signatures from March 24 until June 22 for the general election. They also need more required signatures.\nState and federal officials have recommended social distancing for weeks. Pritzker issued an order March 20, requiring most residents to stay home with few exceptions.\nThe parties argued that even if the order was lifted in May, little time would remain to get signatures.\n“Requiring in-person contact to satisfy Illinois’ petitioning requirements is not presently possible and will be problematic for weeks to come after emergency measures are lifted,” according to the lawsuit.\nThe lawsuit seeks to have the signature requirements waived or suspended for this election.\nThe lawsuit named Pritzker and the Illinois State Board of Elections. Pritzker’s spokeswoman didn’t return a request for comment Tuesday. An elections board spokesman said the board doesn’t have legal authority to change state law.\n__\nFollow Sophia Tareen on Twitter: https://twitter.com/sophiatareen.", "url": "https://apnews.com/29d0824819a31ff03716d1e1aef689eb"}