{"authors": ["Reporter"], "date_download": "2020-05-04 21:09:30", "date_modify": "2020-05-04 21:09:30", "date_publish": "2020-05-01 02:00:19", "description": "The vice president wore a protective face mask and glasses on his tour of the GM facility in Indiana after facing criticism for not wearing a mask at the...", "filename": "entry_mike-pence-wears-mask-gm-coronavirus_n_5eab6de7c5b6995f13fe70ab_1588626570.html", "image_url": "https://img.huffingtonpost.com/asset/5eab7b5b220000ef0d827f7c.jpeg?cache=dfewjflzyt&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_mike-pence-wears-mask-gm-coronavirus_n_5eab6de7c5b6995f13fe70ab_1588626570.html", "title": "Mike Pence Dons Mask For GM Tour After Mayo Clinic Backlash", "title_page": "Mike Pence Dons Mask For GM Tour After Mayo Clinic Backlash | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Vice President Mike Pence wore a face mask as he toured a General Motors plant in Indiana on Thursday, days after he was criticized for not wearing the protective gear during a tour of the Mayo Clinic.\nPence went to the GM facility in Kokomo, which is now making medical ventilators, with Transportation Secretary Elaine Chao and Indiana Gov. Eric Holcomb to see the ventilator production and testing lines.\nGM has partnered with Ventec Life Systems to produce the medical equipment to help with the shortfall of ventilators across the U.S. amid the coronavirus pandemic.\nIn videos and photos of Thursday’s visit, Pence can be seen talking to GM executives and staff while wearing the face mask and protective glasses.\nPence, Chao and other officials who toured the facility removed their protective gear during a roundtable discussion.\nToday, Vice President @Mike_Pence, @SecElaineChao and @GovHolcomb visited our Kokomo, IN, facility to meet the team who made it possible for us to deliver more than 600 @MyVOCSN critical care ventilators in only a few short weeks. Read more: https://t.co/km9By4Ugna pic.twitter.com/6wX1dh8Id2 — General Motors (@GM) April 30, 2020\nAt the Mayo Clinic in Rochester, Minnesota, on Tuesday, Pence did not wear a mask while meeting with staff members and patients, who were all wearing masks. The clinic’s policy calls for protective gear.\nThe Mayo Clinic initially said in a tweet that it had informed Pence of their mask policy before he arrived. The tweet was later deleted, but the clinic confirmed to HuffPost that it had indeed notified the vice president of the policy.\nPeople were concerned that Pence may have posed a risk to staff and patients after photos of his visit circulated on social media. News reports, including one by HuffPost, also highlighted Pence’s decision to forgo the mask.\nPENCE flouts Mayo Clinic policy that everyone on campus wear a mask, even as he meets with staff and a patient. pic.twitter.com/kfo64KQDhU — Dan Diamond (@ddiamond) April 28, 2020\nPence defended his lack of a mask at the clinic, saying that he and the people around him are regularly tested for COVID-19.\n“As vice president of the United States, I’m tested for the coronavirus on a regular basis, and everyone who is around me is tested for the coronavirus,” Pence said.\n“And since I don’t have the coronavirus, I thought it’d be a good opportunity for me to be here, to be able to speak to these researchers, these incredible health care personnel, and look them in the eye and say thank you.”", "url": "https://www.huffpost.com/entry/mike-pence-wears-mask-gm-coronavirus_n_5eab6de7c5b6995f13fe70ab"}