{"authors": ["Christopher Weber"], "date_download": "2020-05-04 20:14:27", "date_modify": "2020-05-04 20:14:27", "date_publish": "2020-04-08 05:06:14", "description": "LOS ANGELES (AP) — To curb the coronavirus spread, Los Angeles has embarked on a massive effort to bring thousands of homeless people off the streets and into hotels to protect them and others...", "filename": "_460ec428bc33ea479ec030a898664c19_1588623267.html", "image_url": "https://storage.googleapis.com/afs-prod/media/78322546cc8544e0a9656a1d0ba2422d/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_460ec428bc33ea479ec030a898664c19_1588623267.html", "title": "Massive effort to get Los Angeles homeless into hotels", "title_page": "Massive effort to get Los Angeles homeless into hotels", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A homeless person sits on a wheelchair under rainy weather on Sunset Blvd., in the Echo Park neighborhood of Los Angeles Monday, April 6, 2020. One population is particularly vulnerable to contracting and spreading the coronavirus: the homeless. Officials have vowed repeatedly to get them indoors, but testing shortages and bureaucratic wrangling are making it difficult. Relatively few of California's 150,000 homeless population have been moved into individual quarters. It's unclear how many even have the highly contagious virus. It's a problem playing out nationwide and it's unclear how many may even have coronavirus. (AP Photo/Damian Dovarganes)\nA homeless person sits on a wheelchair under rainy weather on Sunset Blvd., in the Echo Park neighborhood of Los Angeles Monday, April 6, 2020. One population is particularly vulnerable to contracting and spreading the coronavirus: the homeless. Officials have vowed repeatedly to get them indoors, but testing shortages and bureaucratic wrangling are making it difficult. Relatively few of California's 150,000 homeless population have been moved into individual quarters. It's unclear how many even have the highly contagious virus. It's a problem playing out nationwide and it's unclear how many may even have coronavirus. (AP Photo/Damian Dovarganes)\nLOS ANGELES (AP) — To curb the coronavirus spread, Los Angeles has embarked on a massive effort to bring thousands of homeless people off the streets and into hotels to protect them and others from infection.\nCalifornia Gov. Gavin Newsom announced last week that money from the federal government would help pay for at least 15,000 hotel rooms during the pandemic. But Los Angeles County, with the state’s largest concentration of homeless people at about 60,000, has set its own goal of 15,000 rooms.\n“We’re going big in LA,” said Heidi Marston, interim director of the Los Angeles Homeless Services Authority. “We based our goal on what the need is here.”\nMarston outlined the effort on Wednesday during the daily coronavirus briefing by county health officials.\nCoronavirus is spread by coughs and sneezes. Most infected people have mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and other respiratory problems that can be fatal.\nThe homeless population is particularly at risk. Many transients already have health problems such as heart disease or diabetes, and they live in conditions that do not permit frequent hand washing and social distancing.\nThe hotel rooms set aside under the state’s Project Roomkey are reserved for the most vulnerable of the county’s homeless population, Marston said. These include people over 65 and those with underlying health conditions who don’t have symptoms but are at high risk for hospitalization if they contract the virus.\nThe first hotel opened April 3 in Los Angeles. As of Wednesday, officials had secured 405 rooms at 5 sites across the county, according to Marston, who added that all were likely to be filled by the end of the day.\nA total of 1,340 beds at 15 sites are expected to be ready by the end of this week. Thousands more have been identified as potential locations.\nLos Angeles Mayor Eric Garcetti said Tuesday that the number of rooms needs to increase rapidly and encouraged hotel operators to allow the government to lease their rooms.\nHe also warned “if it requires a more aggressive stance” he has emergency powers to commandeer rooms. “We need to get people into those thousands of rooms today,” Garcetti said.\nThey’ll be filled first by people from existing shelters that are eager to ease crowding. Meanwhile, teams are going into encampments to find people who meet the criteria.\n“People are really scared and they’re trying to do whatever they can to protect themselves,” Marston said. “We see people who are excited to have a safe place to go.”\nOutreach workers assist with every step of the process: checking for symptoms, gathering belongings, transporting people and checking them into hotel rooms.\nNurses are onsite to provide twice-a-day health checks. The temporary residents will have round-the-clock security, three meals daily and access to laundry facilities, officials said.\nCounty officials are not disclosing names of hotels being opened to discourage uninvited people. They’ll be spread out across Los Angeles and in the Antelope Valley, northeast of downtown.\nProject Roomkey is aiding a three-pronged Los Angeles County effort to get people indoors and safely distanced from one another. The county is also setting up medical sheltering sites with quarantine and isolation rooms for people who have tested positive for COVID-19, show symptoms while awaiting test results, or who have been exposed to the virus.\nIn addition, temporary shelters have been set up at city and county parks and recreation centers, with beds placed at the recommended distance of at least 6 feet (1.83 meters) apart.\nThe estimated cost to secure 15,000 hotel rooms and staff the facilities for three months is about $195 million, said Phil Ansell, director of the county’s Homeless Initiative. Of that, $118.5 million will pay for the leases and the balance will cover operations, he said Tuesday.\nThe cost of each room will average out to about $85, Ansell estimated.\nUnder the agreement announced by Newsom, the Federal Emergency Management Agency will pay for 75% of the leasing cost. The state is providing $800 million in emergency funds to counties.\nNewsom said as of Tuesday, more than 7,640 rooms had been secured across the state and local officials were working to bring people in “on a daily basis, on an hourly basis.”\nThe governor called the effort unprecedented.\nFull Coverage: Virus Outbreak\n“There’s not a state in America that’s even put a plan together to get 15,000 rooms. There’s not a state that’s gotten the support of FEMA to reimburse 75% of that. And I’m very proud of those efforts,” Newsom said.\nSan Diego County, with about 8,000 homeless, has secured 2,000 rooms and is prepared to get more if needed, officials said.\nSan Francisco, with a similar number of homeless people, has leased 945 rooms in eight hotels to house the homeless and those unable to safely self-quarantine at home.\nCalifornia on Tuesday had more than 17,000 coronavirus cases and at least 452 deaths, according to data compiled by Johns Hopkins University.\nSo far the confirmed cases among the homeless population is low — Los Angeles County has only about a dozen — but there has been little testing of that population.", "url": "https://apnews.com/460ec428bc33ea479ec030a898664c19"}