{"authors": ["Mike Schneider"], "date_download": "2020-05-04 20:21:17", "date_modify": "2020-05-04 20:21:17", "date_publish": "2020-04-15 23:59:37", "description": "ORLANDO, Fla. (AP) — Even though 90% of its staff at its dozen theme parks have been furloughed, SeaWorld Entertainment made a deal this week to give its top executives about $6.8 million in...", "filename": "_d55a0f8b8305f53b84a58a3f9783ceed_1588623677.html", "image_url": "https://storage.googleapis.com/afs-prod/media/6c2e1ba1d1f141d888f2c902665f3def/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d55a0f8b8305f53b84a58a3f9783ceed_1588623677.html", "title": "Stock awards for SeaWorld execs, despite furloughed staff", "title_page": "Stock awards for SeaWorld execs, despite furloughed staff", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - This March 13, 2020 file photo shows the entrance to SeaWorld Orlando in Orlando, Fla. SeaWorld Entertainment's Chief Executive Sergio Rivera has resigned only five months into his job, becoming the third leader of the theme park company to depart in just over two years, according to a company filing released Monday, April 6. (Joe Burbank/Orlando Sentinel via AP, File)\nFILE - This March 13, 2020 file photo shows the entrance to SeaWorld Orlando in Orlando, Fla. SeaWorld Entertainment's Chief Executive Sergio Rivera has resigned only five months into his job, becoming the third leader of the theme park company to depart in just over two years, according to a company filing released Monday, April 6. (Joe Burbank/Orlando Sentinel via AP, File)\nORLANDO, Fla. (AP) — Even though 90% of its staff at its dozen theme parks have been furloughed, SeaWorld Entertainment made a deal this week to give its top executives about $6.8 million in restricted stock awards.\nNewly appointed CEO Marc Swason is entitled to $1.5 million in restricted stock awards and newly-appointed chief operating officer Walter Bogumil is getting about $1.3 million in restricted stock awards, provided they stay with SeaWorld for two years, the company said Tuesday in a filing with the U.S. Securities and Exchange Commission.\nBoth executives assumed their positions last week after the resignation of then-CEO Sergio Rivera , who was the third leader of the theme park company to depart in just over two years.\nChief Legal Officer Tony Taylor is set to get more than $1.1 million in restricted stock awards and three other executives will be getting more than $900,000 each in restricted stock awards.\nThe awards are designed “to recognize employees for their extraordinary contributions and continued expected contributions to the Company and its long term goals during the global COVID-19 pandemic,” the SEC filing said.\nUnder the terms, the executives get half of the stock awards on the first anniversary of the deal and the rest on the second anniversary.\nThe company closed the gates to its 12 theme parks last month because of the coronavirus pandemic and furloughed 90% of its workers.\nSeaWorld employs about 4,700 full-time employees and approximately 12,000 part-time employees. During peak season in 2018, the company hired more than 4,000 additional seasonal workers, many of whom are high school and college students. None of the company’s employees are covered by a collective bargaining agreement.\nEarlier this month, the company’s executive officers agreed to a 20% reduction of their annual base salary until the company resumes normal operations.\n___\nFollow Mike Schneider on Twitter at https://twitter.com/MikeSchneiderAP", "url": "https://apnews.com/d55a0f8b8305f53b84a58a3f9783ceed"}