{"authors": ["Reporter"], "date_download": "2020-05-04 20:12:50", "date_modify": "2020-05-04 20:12:50", "date_publish": "2020-05-01 19:08:59", "description": "A historic coalition of workers demanded that major corporations consider their health and safety during the coronavirus pandemic.", "filename": "entry_amazon-retail-hazard-pay-strike_n_5eac49b7c5b6995f14005a42_1588623170.html", "image_url": "https://img.huffingtonpost.com/asset/5eac77c0300000a11215547e.jpeg?cache=3i0lpfga3f&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_amazon-retail-hazard-pay-strike_n_5eac49b7c5b6995f14005a42_1588623170.html", "title": "Amazon And Major Retail Workers Strike For Hazard Pay And Better Safety", "title_page": "Amazon And Major Retail Workers Strike For Hazard Pay And Better Safety | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Essential workers who stock grocery store shelves, fill online orders and deliver packages to American homes staged a general strike on Friday.\nThe unprecedented coalition of workers for Amazon, Instacart, Whole Foods, Walmart, Target, Shipt and FedEx demanded hazard pay, better access to personal protective equipment on the job and an expanded ability to stay home with pay if they feel sick.\nIn the current crisis, people who work in delivery and fulfillment centers have become essential employees for millions of Americans working and learning at home. These are low-wage jobs in a country where wage growth has been stagnant for years.\nAlthough companies have initiated some new safety policies, many workers believe they could be doing more, particularly as online orders are surging. Amazon founder Jeff Bezos’ personal fortune has grown by $24 billion during the pandemic so far, bringing it to a mind-numbing $138 billion. He has been the world’s richest person since 2017. (Amazon also owns Whole Foods.)\nStephanie Keith via Getty Images People protest working conditions outside of an Amazon warehouse fulfillment center on May 1, 2020, in the Staten Island borough of New York City.\nMeanwhile, people who work at Amazon, Whole Foods, Target and other companies are demanding hazard pay of around $5 per order for putting their lives on the line, according to a press release about the strikes. Those unable to work from home are at a greater risk of contracting the virus, which could potentially land them in the hospital for weeks and stick them with burdensome medical bills.\nAs HuffPost’s Dave Jamison reported earlier this week, the hazard pay that workers are currently receiving is so marginal that it barely factors into their decision to err on the cautious side or continue working through the pandemic.\n“How can you expect people to show up and keep it together when you’re basically just giving them chicken feed?” said one Amazon worker, who asked not to be identified out of fear of retaliation. “I’ve seen otherwise cheerful people absolutely miserable.”\nStephanie Keith via Getty Images Protesters concerned about Amazon's handling of the coronavirus are demanding more safety precautions for workers during the pandemic.\nWorkers also need a continuous supply of masks and gloves to stay safe; an unknown number of stores and fulfillment centers have been hit by the virus already.\nAmazon, Whole Foods and Instacart employees say they need paid sick leave and back pay for days they have already been out sick. Workers for Amazon and Whole Foods would also like to halt shipments of nonessential items and stop corporate retaliation against those who speak out about workplace safety.\nLucas Jackson / Reuters Former Amazon employee, Christian Smalls, stands with fellow demonstrators during a protest outside of an Amazon warehouse as the outbreak of the coronavirus disease (COVID-19) continues in the Staten Island borough of New York on May 1, 2020.\nAmazon has been particularly opaque about COVID-19′s effects on its workforce, going so far as to fire an employee in March for staging a walkout to protest lax safety policies. It remains unclear precisely how many of the company’s workers have contracted or died of the disease, but a group of Amazon employees in Indiana estimates that the number of cases is at least 600 across more than 155 buildings nationwide.\n“Now we were able to form this alliance that is speaking truth to power,” Christian Smalls, the Amazon worker fired in March, said on WNYC’s “Brian Lehrer Show” on Friday morning.\n“It’s disgraceful, but at the same time, we all know the truth now. It’s never going to be Amazon versus Chris Smalls, it’s going to be Amazon versus the people.”\nWorkers at Amazon warehouses, Whole Foods stores, along with Instacart and Shipt deliverers, have been staging walkouts to voice concerns about their risky workplace conditions since the number of cases began to explode in March.", "url": "https://www.huffpost.com/entry/amazon-retail-hazard-pay-strike_n_5eac49b7c5b6995f14005a42"}