{"authors": [], "date_download": "2020-05-04 20:13:53", "date_modify": "2020-05-04 20:13:53", "date_publish": "2020-04-29 02:01:56", "description": "Criminal justice reform advocates have increasingly called for some non-violent inmates to be released amid the ongoing pandemic.", "filename": "entry_female-inmate-dies_n_5ea8dd94c5b6123a17640cf2_1588623233.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8df7f240000eb008e9e88.jpeg?cache=bp0ekrj1we&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_female-inmate-dies_n_5ea8dd94c5b6123a17640cf2_1588623233.html", "title": "Female Inmate Dies Of Coronavirus After Giving Birth On Ventilator", "title_page": "Female Inmate Dies Of Coronavirus After Giving Birth On Ventilator | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Since then, the families of inmates have complained as the rules shifted several times over who could qualify to be released home. In some cases, inmates were moved into a 14-day quarantine required prior to release, only to discover later they were no longer eligible and transferred back to their cells.\nAt least 30 federal inmates have died since March of COVID-19, the disease caused by the novel coronavirus, and 1,313 inmates have tested positive, according to the BOP.\nCircle Bear was transported from a jail in South Dakota on March 20 to Federal Medical Center Carswell in Fort Worth, Texas, and quarantined on arrival. She was taken to a hospital on March 28 amid concerns about her pregnancy, and released back to prison the same day. By March 31, she had developed a fever and a cough and returned to the hospital for treatment.\nShe was placed on a ventilator, and gave birth to her son the next day by cesarean section. She tested positive for COVID-19 on April 4 and died on Tuesday.\nA BOP spokesman had no immediate comment on whether she qualified for home confinement or how many other inmates are pregnant.", "url": "https://www.huffpost.com/entry/female-inmate-dies_n_5ea8dd94c5b6123a17640cf2"}