{"authors": ["Reporter"], "date_download": "2020-05-04 21:10:18", "date_modify": "2020-05-04 21:10:18", "date_publish": "2020-04-30 22:18:52", "description": "Some counties, including Los Angeles, have kept beaches closed, but Orange County's were open and people flocked to them last weekend.", "filename": "entry_california-newsom-close-orange-county-beaches_n_5eab26e7c5b62aaf4365fbcf_1588626618.html", "image_url": "https://img.huffingtonpost.com/asset/5eab3710300000a112155391.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_california-newsom-close-orange-county-beaches_n_5eab26e7c5b62aaf4365fbcf_1588626618.html", "title": "California Gov. Newsom Singles Out Orange County With Beach Closures", "title_page": "California Gov. Newsom Singles Out Orange County With Beach Closures | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "California Gov. Gavin Newsom (D) made an unexpected announcement about beach closures in his state Thursday: Among those that have been open, his shutdown edict targets only Orange County, where he said large beach crowds “raised alarm bells” about people’s willingness to comply with social distancing guidelines and sheltering in place.\nNewsom’s announcement comes after his office reportedly sent a memo to police chiefs around the state saying he was closing all of California’s beaches and state parks to combat crowds as the coronavirus pandemic rages on.\nBut Newsom said at his Thursday press briefing he never saw the memo and that he’d be doing a “hard close” in Orange County, home to some of the five beaches officials observed with big crowds after patrolling around 100 this past weekend.\n“Specific issues on some of those beaches have raised alarm bells,” Newsom said. “People that are congregating there that weren’t practicing physical distancing that may go back to their community outside of Orange County and may not even know that they contracted the disease. And now they put other people at risk, put our hospital system at risk and the like.”\nLos Angeles County and other jurisdictions in the state have kept their beaches closed as part of the response to the pandemic, but Orange County was among the places that did have the restriction.\nAllen J. Schaben via Getty Images It looked much like any other day at Newport Beach in California on Tuesday despite shelter-in-place orders.\nNewsom’s move may ruffle some feathers. Though Orange County ― once a Republican bastion ― has become much more politically competitive over the last two decades, it remains home to one of the blue state’s largest, most powerful conservative areas.\nState Sen. John M. W. Moorlach (R), who represents Costa Mesa in the county, quickly issued a statement blasting Newsom’s decision to single out his region.\nThe governor “just doesn’t seem to get it,” he said. “We need to trust people. If our citizens exercise proper social distancing, then we should allow access to the beaches. If you’re part of a vulnerable group, shame on you for going to the beach.”\nBut Orange County, Newsom said Thursday, has “one of the highest rates” of positive cases of coronavirus relative to “size and scope,” he said, and a “very limited number of people been tested” in the jurisdiction.\nHuntington Beach and Newport Beach, two affluent cities with some of Orange Country’s highest numbers of confirmed cases, have been the stage for large protests against the shelter-in-place orders.\nNewsom urged Californians to look elsewhere for examples of how dangerous loosening the various restrictions could be.\n“Look what happened in Japan. Look what happened in Singapore. Look what happened in China,” he said of countries that have seen an uptick in cases of COVID-19, the disease caused by the new coronavirus, when social distancing policies were relaxed. “When you pull back too quickly, you literally put people’s lives at risk. People are literally dying because of decisions that are done without a real frame of focus on public health first.”", "url": "https://www.huffpost.com/entry/california-newsom-close-orange-county-beaches_n_5eab26e7c5b62aaf4365fbcf"}