{"authors": ["Pierina Ferretti", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Meagan Day", "Víctor Orellana", "Daniel Jadue", "Camila Vergara", "Translation By"], "date_download": "2020-05-04 19:49:17", "date_modify": "2020-05-04 19:49:17", "date_publish": "2020-05-01 00:00:00", "description": null, "filename": "2020_05_chile-feminism-international-womens-day-october-uprising-coronavirus-covid_1588621757.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/05/01113607/GettyImages-1206109353.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_05_chile-feminism-international-womens-day-october-uprising-coronavirus-covid_1588621757.html", "title": "Chile’s Six Months of Struggle", "title_page": "Chile’s Six Months of Struggle", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe last six months in Chile have been momentous. In October of last year, the country experienced the largest popular uprisings in its recent history; now the threat of the COVID-19 pandemic is, as elsewhere, causing economic havoc and widespread fear. In addition to these two landmarks, and taking place in between them, March 8 in Chile saw huge demonstrations to mark International Women’s Day. In Santiago alone, 2 million women and their allies took to the streets, just days before the pandemic suddenly came to dominate the political agenda. Despite the recommendations of health professionals — which are, for the most part, supported by the public — and the example of neighboring countries, Sebastián Piñera’s right-wing government is refusing to order a general lockdown to prevent the spread of the virus. The billionaire businessman has rejected all social protection measures, among them rent moratoria, the freezing of debt and mortgage payments, price controls, and the temporary nationalization of private hospitals. The government has not even made free testing available. In Chile, as in the United States, health care is a very lucrative business, and all the more so in an emergency. The government has not missed the opportunity to take advantage of the situation, instituting a curfew that is advertised as preventing the spread of infections, but in reality only lends itself to further police powers. This is in a country that, since the uprising last October, has seen more than thirty deaths by law enforcement, over four hundred eye injuries, hundreds of complaints of torture and sexual abuse, and thousands of political prisoners that, to this day, in a full-blown health emergency, are still in jail. As days go by without meaningful action, tension, uncertainty, and unease continue to mount. It’s unclear what the near future holds for Chile, though many are conscious that a similar social discontent triggered the revolts last October. Where until just a few months ago, Chile was upheld as the exemplary model of neoliberalism in Latin America, its legitimacy has now been radically undermined.\nThe People in Revolt, the Left in Quarantine The growing exhaustion with Chile’s neoliberalism has generated some social conflict over the course of the last two decades. Mapuche resistance against the dispossession of their territories, student struggles for the right to free education, the fight for pensions, and the rise of the current feminist movement have all emerged from the ongoing struggle against neoliberalism. The uprising last year, however, marked a turning point in this cycle, not only due to its magnitude, but also because it announced the emergence of a new social actor: a people, suffering under more than forty years of rapacious neoliberalism, joining together to say “basta” [enough]. In October, the people took to the streets spontaneously, largely bypassing the social and political organizations that historically represented the interests of the subordinate classes: trade unions and the traditional parties of the Left, like the Communist Party and the Socialist Party. The revolt has left its mark on the present, and in the current health emergency, many Chileans are refusing to be submissive in the face of government inaction. Workers have been banging pans inside shopping malls, demanding the closure of shops to the cry of “Nuestras vidas valen más que sus ganancias” (“Our lives are worth more than your profits”); neighbors have erected barricades on access roads to coastal towns, so as to prevent the arrival of wealthy vacationers; domestic workers have confronted their employers; and health workers have denounced their precarious and unsafe conditions. Mayors — even those on the Right — have disobeyed central government and implemented their own protection measures, while the scientific community — including the Chilean Medical College — has been challenging the Ministry of Health. In this context, women have added their voices loudly, warning of the increased gender violence resulting from confinement and building support network to combat the crisis. These are signs of a restless people no longer willing to submit to abuse. Despite these acts of resistance, the business community has had little trouble imposing its interests. In the midst of neoliberalism’s legitimacy crisis — with a social majority taking to the streets and government approval at a historic low — the interests of capital still prevail. The old social and political instruments that once channeled the struggles of the subordinate classes are obviously no longer functioning. The old systems have been weakened by decades of abuse: the Chilean dictatorship physically destroyed a generation of dissidents and severely decimated their organizations, and the neoliberal transformation has further undermined the mass organization of workers, even disfiguring some social-democratic projects to make them indistinguishable from neoliberalism. Here, the numbers speak for themselves: barely 20 percent of the workforce in Chile is unionized; 63 percent of the population declares having no political position; and only 14 percent identify with the Left. Not even the formation of the Frente Amplio (Broad Front), a new Left force uniting figures from student struggles with a promise of renewing national politics, has managed to reverse this picture. With weak unionism and a disjointed Left, the slogan “Que la crisis la paguen los ricos” (“Let the rich pay for the crisis”) is not much more than that: a slogan circulated among activist networks lacking the ability to force their point. The fundamental problem in Chile today is the ongoing political vacuum. As Chilean sociologist Carlos Ruiz likes to say, there is a Left without a people and a people without a Left. The question is which group will step into that vacuum.\nFeminist Uprising Before the coronavirus grabbed headlines, all eyes in Chile were on the scheduled demonstrations for March 8 (8M), International Women’s Day. Scheduled to take place just six weeks before the (now delayed) April 26 constitutional plebiscite — the first concrete possibility to put an end to the constitutional legacy of the Pinochet dictatorship — 8M was to contribute to a growing rejection of the dictatorial charter, endorsed by the government and the country’s various right-wing forces. Moreover, in the wake of the October protests, as well as the global success of the feminist performance piece Un violador en tu camino (“A Rapist in Your Path”) by the group Las Tesis, there was much anticipation about the size and power of this year’s demonstration — which, in Santiago alone, reached 2 million. Over the last four years, the feminist movement in Chile, as in other countries, has been growing enormously. Since the Ni Una Menos (“Not one [woman] less”) demonstration in October 2016, when a hundred thousand people marched to end violence against women and femicide, feminism has become the most important mass movement in the country, and a hugely politicizing force. The range of participants at the 8M demonstrations is illustrative of this. It is not only anti-capitalist militants and those from social or political organizations who attend, but huge numbers of unaffiliated women, often marching for the first time. They are motivated by ideas of equality — equality of opportunity, of wages, the distribution of reproductive work — and reproductive rights; the green scarf representing the fight for abortion has become omnipresent. Above all, they are demanding an end to sexist violence and femicides. This heterogeneity makes it difficult to classify the movement in terms of traditional social categories. Polarities like left and right, for example, fail to account for the composition of the movement. Crucially, today’s feminism has managed to mobilize social groups outside the usual activist contingents. Why have Chilean women risen up in such numbers over the last four years? The phenomenon can be explained by the soaring inequalities brought on by Chile’s neoliberal modernization, which has disproportionately affected women. Chile is a world leader in inequality: it is the most unequal country in the OECD, and one of thirty countries with the worst income distribution globally. Wages and pensions are insufficient to the cost of living, health and education are heavy economic burdens, and the majority of the population is mired in debt. Women bear the brunt of inequality, suffering substantially lower salaries and pensions than men, while shouldering the greater burden of unpaid domestic work. Traditional gender roles are further perpetuated in education and labor markets, among many other forms of subordination in all spheres of life. Seizing on this discontent, the feminist movement has sparked a collective revolt that has awakened not only women, but society at large. The uprising in October is the most salient example of this society-wide shift. The new movement puts at the center of the struggle the need to recover life from capital, in a country that has carried the commodification of social reproduction to an extreme. Because feminism has generated such an enormous capacity for mobilization in Chile, it has also been able to spearhead other struggles against neoliberalism. The fragmented and weakened Chilean left will have a better chance of rebuilding itself if it remains open to and works closely with this mass feminist movement.", "url": "https://jacobinmag.com/2020/05/chile-feminism-international-womens-day-october-uprising-coronavirus-covid"}