{"authors": ["Bob Christie"], "date_download": "2020-05-04 20:25:35", "date_modify": "2020-05-04 20:25:35", "date_publish": "2020-04-10 04:03:40", "description": "GLENDALE, Ariz. (AP) — Arizona Gov. Doug Ducey on Friday announced that the state would receive 100 ventilators from the federal stockpile, a fraction of the 5,000 first approved and far below the...", "filename": "_dd387d580ac04b0e5345fff82d86a154_1588623935.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dd387d580ac04b0e5345fff82d86a154_1588623935.html", "title": "Arizona getting 100 ventilators from feds, more needed", "title_page": "Arizona getting 100 ventilators from feds, more needed", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GLENDALE, Ariz. (AP) — Arizona Gov. Doug Ducey on Friday announced that the state would receive 100 ventilators from the federal stockpile, a fraction of the 5,000 first approved and far below the 500 Arizona’s top health official said is needed immediately.\nDucey praised President Donald Trump for his “urgent action and real leadership” in sending the machines that force oxygen into the lungs of patients critically ill with COVID-19. The Republican governor also thanked GOP Sen. Martha McSally for “advocating for these ventilators and helping to make this happen.”\nBut the shipment falls far short of the number originally approved by federal officials for Arizona and is just one-fifth what the state’s top public health official said is needed quickly.\nHealth Services Department Director Dr. Cara Christ told The Associated Press last week that the state needs 500 ventilators to be ready for a surge in cases expected later this month. At least 340 ventilators would equip a Phoenix hospital that is being reopened to care for critically ill patients.\nDucey on Thursday had touted the planned reopening of St. Luke’s Medical Center in Phoenix, which will be used to treat seriously ill virus patients. But without ventilators, that plan can’t be fulfilled.\nMore ventilators also are needed to treat patients from the Navajo Nation, where a major outbreak is underway.\nChrist had originally asked federal officials for 5,000 ventilators based on projected need and the request was approved by federal officials. She revised that request to 500 after it became clear there was no way Arizona would get that many from a shrinking federal stockpile. New York state alone had requested 30,000 and got only 4,000, Christ noted.\n“When we heard what New York got in comparison to their request ... we became highly aware that we weren’t going to get those 5,000 ventilators,” she said last week.\nA revised estimate shows the state will need about 1,500 ICU beds with ventilators to treat virus patients, Christ said. The state has 1,500 beds with ventilators already, about a third in use, so it needs to add about 500 more to meet expected demand.\nAcross Arizona, 3,112 coronavirus cases resulting in 97 deaths were reported as of Friday. A cluster of cases on the Navajo Nation has led tribal officials to order a weekend long lockdown for all residents and visitors.\nThe state has about 16,900 licensed hospital beds and expects to need 7,000 to 13,000 more to treat virus cases. More than half those added beds will be in existing hospitals that greatly boost capacity. The Army Corps of Engineers has surveyed many other sites for temporary hospitals.\nChrist said Flagstaff is the next city that will get a new treatment facility, designed to take patients who no longer need care in an acute hospital.\nCoconino County and neighboring Navajo County have each reported hundreds of coronavirus cases. Flagstaff Medical Center’s website said Friday that it had 45 patients who had tested positive for coronavirus and an additional 27 whose results were pending.\nThe virus has swept with ferocity through the Navajo Nation, which spans parts of Arizona, New Mexico and Utah. The tribe has recorded more than 550 cases and 22 deaths among Navajos who live on the 27,000-square-mile (70,000-square-kilometer) reservation.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death. The vast majority of people recover.\nMeanwhile, a fourth case of the coronavirus has been reported among Arizona’s 42,000 prison inmates.\nCorrections officials say two inmates at the state prison in Florence have tested positive for COVID-19. Earlier this week, an inmate in Tucson and another in Marana also tested positive.\nThe Arizona Department of Corrections, Rehabilitation and Reentry has repeatedly declined to say whether any prison employees have tested positive for COVID-19.\nJails, detention centers and prisons are believed to be vulnerable to a coronavirus outbreak because inmates with compromised health live in close quarters and jail employees cycle in and out of those facilities each day.\n___\nAssociated Press reporters Paul Davenport and Jacques Billeaud in Phoenix and Susan Montoya Bryan in Albuquerque, New Mexico, contributed.", "url": "https://apnews.com/dd387d580ac04b0e5345fff82d86a154"}