{"authors": [], "date_download": "2020-05-04 16:16:23", "date_modify": "2020-05-04 16:16:23", "date_publish": "2020-04-03 19:03:48", "description": null, "filename": "2020_04_03_cnn-underscored__5bc89ac0d3e754bc39f14e3c15b407d7_index_1588608983.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200319105035-boredlead2-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored__5bc89ac0d3e754bc39f14e3c15b407d7_index_1588608983.html", "title": "Bored at home? Now's the perfect time to pick up a new hobby", "title_page": "Bored at home? Now's the perfect time to pick up a new hobby  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "We've interviewed experts and found the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nIf you're stuck at home due to the spread of coronavirus, the time will inevitably come where you'll be bored senseless. After you optimize your work from home station and get in a killer at-home workout, there's only a limited number of shows and movies you can watch until your brain feels fried.\nIf you're looking for a healthier, more productive way to spend your time while locked in self-quarantine, why not take the new downtime to try some classic arts and crafts or pick up a new hobby? Whether it's knitting, soap-making or even teaching yourself a new language, there are plenty of skills to explore. Lessons from MasterClass are right at your fingertips and building cities out of Lego bricks never gets old. To help you shake your boredom, we've compiled a list of our favorite hobbies to help keep you busy.\nRobotime DIY Mini Greenhouse ($29.74, originally $34.99; amazon.com)\nRobotime DIY Mini Greenhouse\nThis miniature greenhouse is the perfect distraction from the outside world. You'll need complete focus as you paint and place tiny plants, furniture and lighting fixtures into this beautiful model. At about a 1:24 scale, this DIY project is sure to keep you occupied for days to come.\n_______________________________________________________________________________\nDIY Lip Balm Kit ($40; uncommongoods.com)\nDIY Lip Balm Kit\nThis DIY kit teaches you how to craft your own luscious lip balm to fight off chapped lips. The set is packed with everything you need, including fair trade cocoa butter and organic spearmint essential oil. Plus, every purchase helps provide job skills for women in the Washington, DC, area.\n_______________________________________________________________________________\nGeode Puzzle ($65; uncommongoods.com)\nGeode Puzzle\nPuzzles are a classic way to kill some time, but this one takes it to the next level. Made out of birch plywood, the pieces fit together to form a blue, pink or multicolored geode. Due to the odd shape of its pieces, this puzzle is frustratingly difficult, so prepare for the long haul.\n_______________________________________________________________________________\nNew York Times Custom Front Page Puzzle ($49.95; uncommongoods.com)\nNew York Times Custom Front Page Puzzle\nThis customizable puzzle can turn the front page of any New York Times newspaper into a 500-piece puzzle. Commemorate a day in history, your birthday or any other day you hold dear with this interactive memento.\n_______________________________________________________________________________\nRobotime 3D Wooden Treasure Box Puzzle Kit ($29.99; amazon.com)\nRobotime 3D Wooden Treasure Box Puzzle Kit\nThis wooden treasure box is a puzzle to open, but an even harder puzzle to build. Made from plywood pieces that are cut out by a laser, this intricate box will require delicate construction. If you can figure it out, you'll get a functioning, locking treasure box where you can hide your valuables.\n_______________________________________________________________________________\nBoye Round Knitting Loom Set ($14.98; amazon.com)\nBoye Round Knitting Loom Set\nKnitting is the ultimate time-consuming hobby. It can take months to meticulously knit your way to a blanket, but with this kit, you can learn to knit and weave better than your grandma (don't tell her we said that). Included in this kit are four circular loom configurations and all the tools you need to make a hat, so all that's left for you to find is some yarn.\n_______________________________________________________________________________\nHand Embroidery Kit (starting at $30.10; etsy.com)\nHand Embroidery Kit\nA perfect way to pass the time while you're stuck inside, embroidery is a beautiful hobby to get into. This kit, with gorgeous premade designs and everything you need to get started, can turn you into an embroidery expert.\n_______________________________________________________________________________\nCricut Explore Air 2 ($206.99, originally $249; amazon.com)\nCricut Explore Air 2\nThe ultimate DIY tool, the Cricut allows you to cut over 100 different materials with unrivaled precision. That means you can make homemade stickers, home decor, cards, clothes and much more. Plus, you can upload or design your own images, so you can make every cut for any project you can dream up.\n_______________________________________________________________________________\nMasterClass ($180; masterclass.com)\nMasterclass\nMasterClass teaches you all sorts of skills, straight from famous experts. Learn cooking from Gordon Ramsay, scientific thinking from Neil deGrasse Tyson, magic from Penn & Teller, and much more. This one-year subscription gives you access to the entire MasterClass library, so you can learn whatever you want during your self-quarantine.\n_______________________________________________________________________________\nCustom Paint By Numbers Photo (starting at $26.99, originally $29.99; etsy.com)\nCustom Paint By Numbers Photo\nIf painting is your thing, here's a cute twist on a classic pastime. Just send in your best pet portrait, and you'll get an easy paint-by-numbers canvas back in the mail, so you can bring your furry friends to life with your own artistic skills. The kit comes with all the paint and brushes you'll need.\n_______________________________________________________________________________\nRosetta Stone (starting at $35.97; rosettastone.com)\nRosetta Stone\nSpeaking multiple languages is an invaluable skill, and Rosetta Stone makes it easier than ever to pick up a new language (or a few). You can grab a three-month subscription for one language, or go all out and get a lifetime subscription for access to Rosetta Stone's entire library.\n_______________________________________________________________________________\nBook of the Month 3-Month Membership ($49.99; bookofthemonth.com)\nBook of the Month 3-Month Membership\nThere's nothing quite like escaping into a good book, but with all this newfound downtime, you may be flying through your book list. Book of the Month is a subscription plan that delivers a new book right to your doorstep every month, so you never run out of reading material.\n_______________________________________________________________________________\nAeroGarden Black Harvest ($99.99, originally $149.95; amazon.com)\nAeroGarden Black Harvest\nIf you're bored and hungry, you can solve both problems with this device that allows you to wield your green thumb without having to go outside. This has everything you need to grow Genovese basil, curly parsley, dill, thyme, Thai basil and mint.\n_______________________________________________________________________________\nLego Bricks Bricks Bricks ($59.99; lego.com)\nLego Bricks Bricks Bricks\nLet your creative juices flow with this Lego set, which contains 1,500 pieces. Let out your inner child and build cities, cars, rockets and anything else you want with this simple Bricks Bricks Bricks box.\n_______________________________________________________________________________\nLego Fiat 500 ($89.99; lego.com)\nLego Fiat 500\nIf you need a little more structure to your Lego building, try this intricate and difficult Lego Fiat. Featuring lifelike details like an engine, a sunroof and even a miniature painting, this Lego set can make you feel like an automotive expert by the time you've built this iconic car.\n_______________________________________________________________________________\nMindfulness Coloring Book ($9.49; walmart.com)\nMindfulness Coloring Book\nAdult coloring books are a calming, colorful way to spend your time when you have nothing else to do. This book in particular can help you de-stress a little during these anxiety-ridden times with its intricate, meditative drawings.\n_______________________________________________________________________________\nCrayola Sketch & Detail Dual-Tip Markers ($19.85; amazon.com)\nCrayola Sketch & Detail Dual-Tip Markers\nIf you're going to color, you'll need a wide variety of drawing materials. This set of Crayola markers is our go-to because it has all the colors you need in a nice, organized tin.\n_______________________________________________________________________________\nDIY Cross Stitch Wood Coaster Kit ($39; etsy.com)\nDIY Cross Stitch Wood Coaster Kit\nA craft that's just as simple as it is useful, this kit includes everything you need to cross stitch your own four custom coasters.\n_______________________________________________________________________________\nPaint This Book! Watercolor for the Artistically Undiscovered ($17.78, originally $24.95; amazon.com)\nPaint This Book! Watercolor for the Artistically Undiscovered\nThis cute book has everything you need to discover the watercolor artist inside you. With brushes, paint and instructional pages, this book will walk you through the basics and all sorts of techniques so you can learn to paint like a pro.\n_______________________________________________________________________________\nSoap Making 101 Kit ($21; michaels.com)\nSoap Making 101 Kit\nYou panic-cleaned your house, but if you're still looking for stuff to do, try your hand at soap-making. This kit includes enough ingredients to make 10 bars of soap, plus it comes with a cucumber melon fragrance and a variety of dyes to add some color to your new body bars.\n_______________________________________________________________________________\nKlutz Make Your Own Soap Craft & Science Kit ($19.81, originally $21.99; amazon.com)\nKlutz Make Your Own Soap Craft & Science Kit\nIf you want to get your kids in on the soap-making fun, this kit can make 10 bars of soap, customized with soap stickers and skin-safe glitter. And while the soap is hardening, the kids can try out some soap-based experiments for a bonus science lesson.\n_______________________________________________________________________________\nBarkBox subscription (starting at $22; barkbox.com)\nBarkBox subscription\nAn easy way to prevent your dog from distracting you while you're working from home is treating Rover to a BarkBox. These are delivered right to your door and are full of exciting toys and snacks to keep your pooch occupied while you try out one of your new hobbies. Plus, if you sign up before April 2, you can double your first box for free.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/things-to-do-when-bored-outbrain-2/index.html"}