{"authors": [], "date_download": "2020-05-04 16:09:43", "date_modify": "2020-05-04 16:09:43", "date_publish": "2020-03-27 14:10:21", "description": "Hair salons across the country are closing their doors in an effort to slow the spread of coronavirus. So we rounded up all the products you need to color your hair at home.", "filename": "2020_03_27_cnn-underscored_best-at-home-hair-color_index_1588608583.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200324144800-hairdyelead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_27_cnn-underscored_best-at-home-hair-color_index_1588608583.html", "title": "Best at home hair color: Pro tips and products from pros", "title_page": "Best at home hair color: Pro tips and products from pros - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored has interviewed experts to find the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nMany of us are now on week two of practicing social distancing to slow the spread of coronavirus. It's difficult not to be able to see friends, go to work or leave the house to run normal errands, so one way to keep a feeling of routine is to continue the beauty rituals you know and hold dear.\nFor a lot of us, that means keeping up our hair color. Unfortunately, covering grays, giving natural color a little bit of a boost or going all-out with a fun fashion color is challenging when many salons and stylists have closed up shop.\nFortunately, with the advice of some master colorists, you can keep up your color while staying at home and flex your major look on your next Zoom happy hour.\nIf this is your first time coloring your own hair, Megan Graham, owner and master colorist at Megan Graham Beauty in Boston, has a few quick tips. \"Be reasonable,\" she says. \"Staying within two shades of your natural color is achievable at home. A major color change is left to the pros.\"\nAnd those who have good relationships with their colorists should reach out and ask for some direction. They may be able to help you match your color, based on their knowledge of your custom blend, and give you advice about managing the process.\nPermanent color\nColoring your own hair and covering your roots is easier than you think, even if you've never done this at home. Miguel Angarita, master colorist at Oscar Blandi Salon in New York City, shared some advice. \"Applying the color only on the visible areas, minimizes mistakes and prevents you from getting overwhelmed,\" he says. \"So apply only the part and the hairline. Do not run any permanent dye on ends of hair. This can darken or make ends flat.\"\nAnother key tip? Follow the directions to the letter. \"Any brand can be safe, but it's crucial to follow the manufacturer's directions, as well as to perform a patch test to rule out any color allergies,\" says Graham.\nL'Oréal Paris Feria Multi-Faceted Shimmering Permanent Hair Color ($17.98; amazon.com)\nL'Oréal Paris Feria Multi-Faceted Shimmering Permanent Hair Color\nIf you're looking to match a salon color, the L'Oréal Paris Feria line offers a rich color with great definition. The line has a large selection of red tones, and is worth looking to if you're having difficulty matching your salon red. More colors may also be available at Target for $8.99.\n_______________________________________________________________________________\nL'Oréal Paris Superior Preference Glam Lights Highlights ($23.94; amazon.com)\nL'Oréal Paris Superior Preference Glam Lights Highlights\nTouching up highlights at home is not something we'd normally recommend, but these are desperate times. Be sure to follow the directions closely.\n_______________________________________________________________________________\nGarnier Nutrisse Nourishing Color Creme ($6.99; target.com)\nGarnier Nutrisse Nourishing Color Creme\nMade with a blend of avocado, shea and coconut oils, this line has 45 colors and is priced for every budget.\nSemipermanent\nA semipermanent color can last around six weeks, with proper application and maintenance. \"Buy more hair color than you think you need,\" says Graham. \"The amount of color in a store-bought kit is usually very small.\"\nAlso, give yourself time. \"Plan plenty of time, and be patient,\" she says. \"Leave the color on for long enough, since proper processing ensures beautiful results. Do not wash your hair the day that you intend to color it. Your scalp will thank you!\"\nClairol Natural Instincts ($6.99; target.com)\nClairol Natural Instincts\nThis box color has been a favorite for years, and it's no surprise, as the ammonia-free formula leaves hair shiny and healthy, without the look of over-deposited color. The line has a wide array of shades, so matching your shade shouldn't be difficult.\n_______________________________________________________________________________\nIf you're just bored of your look and want a drastic, colorful change, but not one that's going to stick around forever, Angarita says, \"then a gloss, semigloss or semipermanent is recommended.\"\nGood Dye Young Semi-Permanent Hair Color ($18; sephora.com)\nGood Dye Young Semi-Permanent Hair Color\nIf you're touching up a fashion color, this line has a solid selection including pink, purple, green and bright red. These semipermanent colors have a rich pigment level that will upgrade your shade.\n_______________________________________________________________________________\nDpHue Gloss+ Semi-Permanent Hair Color and Deep Conditioner ($35; sephora.com, dermstore.com)\nDpHue Gloss+ Semi-Permanent Hair Color and Deep Conditioner\nThis collection of glosses is meant to enhance your natural color, or perk up an existing color, and add dimension and shine to your look. It's packed with conditioner, so your hair will be left soft and shiny.\n_______________________________________________________________________________\nManic Panic Semi-Permanent Hair Color Cream ($13.99; amazon.com)\nManic Panic Semi-Permanent Hair Color Cream\nThis classic line has been offering fashion colors since the '90s, and is a great bargain at just around 10 bucks. If it's your first time using it, be sure to have an old towel handy, as the color can get everywhere.\n_______________________________________________________________________________\nLime Crime Unicorn Hair Tint Semi-Permanent Hair Color ($16; nordstrom.com)\nLime Crime Unicorn Hair Tint Semi-Permanent Hair Color\nIn colors like sky blue and lilac, this adorably packaged hair dye leaves a light wash of color on your hair.\nRoot coverage\nRita Hazan Root Concealer Touch-Up Spray ($25; sephora.com, dermstore.com)\nRita Hazan Root Concealer Touch-Up Spray\nThis celeb-loved line created by colorist Rita Hazan is the best spray root concealer on the market. If you're nervous about coloring your own roots, this spray is a great option. Just know it will wash out, so daily application is necessary.\n_______________________________________________________________________________\nOribe Airbrush Root Touch-Up Spray ($32-$32.99; dermstore.com, overstock.com)\nOribe Airbrush Root Touch-Up Spray\nBeloved by the beauty community for years now, this touch-up product sprays microfine pigments to match black, blond, dark brown or light brown hair.\n_______________________________________________________________________________\nClairol Root Touch-Up Permanent Hair Color Kit ($7.99; target.com)\nClairol Root Touch-Up Permanent Hair Color Kit\nFor permanent root color, this mainstay from Clairol includes a brush for super-easy application and has a wide array of colors to choose from, to make sure you can find your match.\n_______________________________________________________________________________\nL'Oréal Paris Magic Root Cover Up Gray Concealer Spray ($9.99; target.com)\nL'Oréal Paris Magic Root Cover Up Gray Concealer Spray\nAnother drugstore spray, this fan-favorite is available in eight shades.\nPro tools\nNew AF Bowls and Brushes ($7.99; arcticfoxhaircolor.com)\nNew AF Bowls and Brushes\nA bowl for your hair dye and a brush (which is great for roots) to help delicately swipe it on, all in a cute lime green color.\n_______________________________________________________________________________\nSalon Care Highlighting Kit with Tipping Cap ($4.29; sallybeauty.com)\nSalon Care Highlighting Kit with Tipping Cap\nIf it's highlights you're after, then this kit has everything you need, including a tipping cap which you can pull your selected soon-to-be highlighted hairs through, a mixing spatula, disposable cape and one pair of disposable gloves.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/03/27/cnn-underscored/best-at-home-hair-color/index.html"}