{"authors": ["Cnn Staff"], "date_download": "2020-05-04 16:08:31", "date_modify": "2020-05-04 16:08:31", "date_publish": "2020-04-02 16:08:30", "description": "How do you stay at home if you are homeless? CNN Chief Medical Correspondent Dr. Sanjay Gupta looks at how cities across the US are handling the homeless crisis during coronavirus and why everyone's health matters.", "filename": "2020_04_02_health_sanjay-gu_10cac6505f1e12c42c94cbbc28c73700_index_1588608511.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402114757-gupta-coronavirus-podcast-top-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_health_sanjay-gu_10cac6505f1e12c42c94cbbc28c73700_index_1588608511.html", "title": "Homless during the pandemic: Dr. Gupta podcast 4/2", "title_page": "Homless during the pandemic: Dr. Gupta podcast 4/2 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) How do you stay at home if you are homeless? CNN Chief Medical Correspondent Dr. Sanjay Gupta looks at how cities across the US are handling the homeless crisis during coronavirus and why everyone's health matters.\nAngela Hernandez: I don't ever eat in the shelter. I usually go outside to the soup kitchens. But since a lot of the soup kitchens have closed down, there's very limited places that anybody can go to get a meal.\nDr. Sanjay Gupta: That's Angela Hernandez. She's one of 150 women living at a woman's shelter in New York City. Angela has been homeless on and off since 2005.\nAngela Hernandez: The soup kitchens, they're very low on their distribution. All they give now are just one sandwich and a piece of fruit.\nDr. Gupta: As most of America is asked to stay at home during this outbreak, there is a group of people who cannot: the homeless. And they are some of the most vulnerable in our population.\nIn today's episode, we'll hear from advocates across the country about how their cities are scrambling to address the homeless crisis during coronavirus.\nThis is a problem that impacts all of us and never before has it been more evident than in the midst of a pandemic.\nI'm Dr. Sanjay Gupta, CNN's Chief Medical Correspondent, and this is \"Coronavirus: Fact vs. Fiction.\"\nHernandez: Here in this shelter, there's no supplies for anything like toilet paper, soap, hand sanitizer ... those kind of things.\nDr. Gupta: Angela has been living at her shelter for more than two years now. We asked her to walk us through what life is like there.\nHernandez: You know, there is nothing sanitized. They don't clean every day, so we only get cleaning services maybe once a week. The rooms consist of maybe two or three or four or five in each room. And there's no way to distance yourself from anyone. You know, the beds are like 3 feet apart.\nDr. Gupta: Angela says she has a friend in another shelter who got the virus from his roommates. He was hospitalized but has now recovered.\nHernandez: This really scary feeling when you don't know who may be sick and you're under such close proximity to each other.\nDr. Gupta: New York City has the largest homeless population in the country.\nSome, like Angela, live in a shelter, while others are forced to live on the streets or subways.\nGiselle Routhier, Coalition for the Homeless: Right now, obviously, New York City is probably the epicenter of the crisis. But we also have record numbers of people who are homeless in New York City, and that is a problem that predates this epidemic. Even before all of this started, we have over 60,000 people sleeping in shelters every single night.\nDr. Gupta: That's Giselle Routhier, policy director at Coalition for the Homeless, a nonprofit based in New York City.\nRouthier: Guidance coming directly from health professionals is saying quarantine at home, stay at home, stay away from other people. And that's literally impossible to do if you're someone who is experiencing homelessness. You don't have your own place to go.\nDr. Gupta: Many places, like gyms and public libraries, where people on the streets used to access bathrooms and showers, have now closed.\nOn top of housing and sanitation, access to proper food is also a challenge.\nThe coalition for the homeless runs a mobile soup kitchen every night. But because many other services have shut down, there's even more of a demand.\nRouthier: We have vans going now to folks on the streets handing out hot meals. But because we are still operating and one of the few people that are, the number of people that are coming to us is has vastly increased. And so we're seeing the dire need on the streets every single night. And so this is extraordinarily urgent.\nDr. Gupta: Already, more than a hundred people who are homeless in New York City have tested positive for the coronavirus. Five have died.\nIt's not just exposure. People who are homeless also tend to have more health problems, putting them at greater risk if they do become infected with the virus.\nRandall Kuhn, an associate professor of public health at the University of California Los Angeles, recently co-authored a report about how the novel coronavirus would affect the homeless population in the United States.\nRandall Kuhn, UCLA: The aging curve for a homeless person is accelerated by 15, possibly 20 years. So in other words, we see all these graphs about how people over age 80 are at extreme risk of mortality due to Covid-19. That would be the same risk curve for a 65-year-old homeless person.\nDr. Gupta: While many of the people who are homeless in New York live in shelters, in Los Angeles, the situation is the opposite.\nKuhn: Roughly 75% of the homeless population is unsheltered on any given night, meaning they're living on the street, the sidewalk or in an encampment or in a vehicle.\nDr. Gupta: A source with knowledge of the situation says that one homeless shelter exposed to the virus could overwhelm two or three hospitals.\nAnd as the fight for personal protective equipment, or PPE, throughout the country continues, homeless shelters are often at the bottom of the list -- after emergency rooms and first responders.\nHere's Giselle Routhier again.\nRouthier: I mean, when it comes to people who are homeless, we are nowhere near where we need to be in terms of the response. We don't have enough isolation beds. Staff and isolation facilities don't have access to PPE. And there's just a lot of chaos and not enough real solutions that are coming on quickly enough.\nDr. Gupta: Just last week in Las Vegas, a shelter housing 500 homeless people was forced to close after one man tested positive for coronavirus.\nCity and county officials created a makeshift homeless shelter ... in a parking lot. They marked out boxes on the ground so people could sleep 6 feet apart. I saw a picture of the situation, and it's very unsettling.\nAs the government and community organizations scramble to navigate the outbreak, advocates say finding shelter for people on the streets is a top priority.\nRouthier: I mean, first and foremost, we need to get people into safe spaces where they can isolate to either prevent themselves from becoming infected or to recover if they are already exposed and infected.\nDr. Gupta: In the meantime, we're seeing organizations and individuals who are stepping in with creative solutions to help.\nIn Atlanta, a nonprofit called Love Beyond Walls has been installing portable sinks for those on the streets to wash their hands.\nTerence Lester, Love Beyond Walls: We kept hearing, \"Man, I'm scared I'm going to catch this virus because I don't have anywhere to wash my hands.\" They don't have the privilege to self-preserve or even to walk over to a sink. And I don't know, my heart just goes out.\nDr. Gupta: In Pittsburgh, Dr. Jim Withers and his team have been going out into the streets to check in on people.\nDr. Jim Withers, Street Medicine Institute: So, I'm out here with a team today, and we're actually doing screens for the Covid virus, as well as assessing people's needs. It's very important, I think, to not forget members of our community that may not be able to make it to standard testing areas.\nDr. Gupta: In Seattle, the county purchased a former motel to isolate victims who didn't need hospitalization, including the homeless.\nAnd since many hotels are now vacant, advocates in New York City and Los Angeles are calling on government officials to use them.\nRouthier: There's about 100,000 hotel rooms that are vacant in New York City that we need to be using right away to help house the homeless population.\nKuhn: And then the next big question is then once you've got a lot of people in hotels, we can't just suddenly decide one day to kick them out because the economy is working well. We want to think about a way to have this be a path to durable shelter solutions.\nDr. Gupta: As part of the recent $2 trillion stimulus package, the government is allocating $4 billion to state and local governments for homeless assistance.\nHomeless advocates say, though, this is just a short-term solution. And what they really need is sustainable housing options.\nRouthier: Crisis has really highlighted the fact that housing is health care and connected these two issues in ways that perhaps people did not previously understand. And so what we can best hope for moving forward is that people now understand how not only how traumatic it is to be homeless but how actually dangerous it is to be homeless and that we can work towards permanent solutions.\nDr. Gupta: I've said it again and again over the past several weeks, but it still rings true. Never before have we been so dependent on one another for our health.\nWe'll be back tomorrow. Thanks for listening.", "url": "https://www.cnn.com/2020/04/02/health/sanjay-gupta-coronavirus-podcast-april-2-wellness/index.html"}