{"authors": ["Katie Lobosco"], "date_download": "2020-05-04 16:10:11", "date_modify": "2020-05-04 16:10:11", "date_publish": "2020-04-01 11:38:28", "description": "The US government is preparing to send out direct payments to help individuals amid the coronavirus pandemic, but those who need the money most may be waiting the longest to see it.", "filename": "2020_04_01_politics_stimulus-money-distribution-individuals_index_1588608611.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200320105653-us-money-printing-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_stimulus-money-distribution-individuals_index_1588608611.html", "title": "When will you get your stimulus cash, and how?", "title_page": "When will you get your stimulus check, and how? - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The US government is preparing to send out direct payments to help individuals amid the coronavirus pandemic, but those who need the money most may be waiting the longest to see it.\nThe first payments are expected go out within three weeks to those for whom the Internal Revenue Service already has direct deposit information on file. Mnuchin said at a White House coronavirus briefing that payments would go out within two weeks to people whose direct deposit details are on file with the government, echoing comments he made after passage of the $2.2 trillion stimulus bill that payments would not go out until mid-April.\nHe added that a web portal would be established for people to supply their details and that checks would be sent to anyone else, but did not specify a timeline.\n\"I am assuring the American public, they need the money now,\" he said.\nIt's unclear how long it will take to get the money to everyone else -- but it could take weeks or even months to send out checks. Trump administration officials told lawmakers it could take up to 20 weeks for all of the stimulus payments to be distributed, according to a House Democratic memo obtained by CNN.\nThe IRS will use your 2019 tax return, if you've already filed it, or your 2018 return to calculate the amount of your payment. The payments would not be subject to tax, and those who owe back taxes will still get the payouts.\nIndividuals are due up to $1,200 and couples will receive up to $2,400 -- plus $500 per child. But payments start phasing out for individuals with adjusted gross incomes of more than $75,000. The amount will then be reduced by $5 for every additional $100 of adjusted gross income, and those making more than $99,000 will not receive anything. The income thresholds would be doubled for couples.\nHere's what we know so far about how it will work:\nDirect deposits will go out automatically\nThe IRS says that payments will go out automatically to those who authorized a direct deposit for their refunds on either their 2019 or 2018 tax return. The money will be deposited directly into the same banking account and the taxpayer doesn't have to take any action to receive it.\nThat should cover a lot of people. Last year, about 92 million people received refunds via direct deposit. That represents about 82% of people who received refunds and nearly 60% of all tax filers.\n\"I think it's reasonable to think those payments can be made in three weeks,\" said Nicole Kaeding, an economist with the National Taxpayers Union Foundation.\nWho will have to take action?\nFor those who haven't filed a return for either 2019 or 2018, the IRS urges them to do so quickly.\nEven those who don't normally need to file a tax return may have to in order to receive their payment. That includes individuals who earned less than $12,200 in 2019 and couples who earned less than $24,400.\nLanguage on tax forms can be unclear, especially for someone who hasn't filed a return in a while. Usually, the IRS has in-person taxpayer assistance centers located across the country -- but they have all been shut down due to the pandemic.\n\"An area of big concern is how much administrative burden we're putting on individuals to get these payments. We should be limiting it as much as possible,\" said Kyle Pomerleau, a resident fellow at the American Enterprise Institute, where he studies federal tax policy.\nSocial Security recipients will automatically receive stimulus pay\nThe Treasury Department, clearing up confusion, said Wednesday that Social Security recipients will not have to file a tax return in order to receive the economic stimulus payments the government is preparing to send out.\nIt was unclear in earlier guidance whether Social Security recipients who don't normally need to file taxes would have to in order to receive the money. But, those beneficiaries will automatically receive the money, and the IRS will use the information that the Social Security Administration has on file.\nThose who normally receive their Social Security benefits directly in their bank accounts will receive the stimulus money in the same way. Others will receive a check in the mail -- though it will likely take longer to receive the payment than those who use direct deposit.\nWill others get checks in the mail?\nHow things will work gets a little cloudy for those who have not authorized a direct deposit from the IRS either on their 2018 or 2019 return.\nThe IRS expects to start issuing paper checks the week of May 4, according to the House Democratic memo.\nThe paper checks will be issued at a rate of about 5 million per week, the memo says. Individuals with the lowest income, based on adjusted gross income, will receive their checks first.\nIn the past, it has taken longer to send checks than make direct deposits. In 2008, when the government distributed similar stimulus money, deposits were made over a three-week period, while paper checks were sent through the mail over a 10-week period.\nAccording to the legislation, the IRS has until the end of 2020 to transfer the payments.\nAn online fix?\nNow, the Treasury is planning to develop \" in the coming weeks \" a web-based portal that will allow people to provide their banking information to the IRS online so that they can receive their payments immediately.\nBut the government has said little about how this would work.\n\"I think it will be difficult to create that portal in such a time frame but we will see if Treasury can pull it off,\" Kaeding said.\nIt could be helpful for those tax filers who don't have up-to-date direct deposit or address information on record with the IRS.\nLow-income earners could still miss out\nAn online portal won't help the millions of people who don't have access to the internet at home.\nIt's likely that the portal will involve an authentication process and that could be a roadblock for some people.\nFor example, just 30% of people who try to register for an existing online account with the IRS are successful, said former IRS Taxpayer Advocate Nina Olson. The rest fail the authentication test, which requires an account number of a mortgage, loan or credit card, as well as a mobile phone that has the same address on the bill as your return. Not everyone can check all those boxes.\nLowering the authentication standards could invite identity theft, Olson said.\nThis story has been updated with the Treasury Department's guidance for Social Security recipients and details of a House Democratic memo on IRS distribution timelines.", "url": "https://www.cnn.com/2020/04/01/politics/stimulus-money-distribution-individuals/index.html"}