{"authors": ["Frank Pallotta", "Cnn Business"], "date_download": "2020-05-04 16:55:16", "date_modify": "2020-05-04 16:55:16", "date_publish": "2020-04-08 23:30:23", "description": "Disney+ now has 50 million paid subscribers globally, putting it within striking range of its initial subscriber projections just five months after it launched.", "filename": "2020_04_08_media_disney-subscribers_index_1588611316.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191029093554-02-the-mandalorian-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_media_disney-subscribers_index_1588611316.html", "title": "Disney+ is almost near its subscribers goal four years ahead of schedule", "title_page": "Disney+ is almost near its subscribers goal four years ahead of schedule - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Disney+ now has 50 million paid subscribers globally, putting it within striking range of its initial subscriber projections just five months after it launched.\nThe company told investors last year that it projected Disney+ would have 60 million to 90 million global subscribers by 2024. Now, after five months, the service is almost there, the company announced on Wednesday.\nDisney reported that it had nearly 30 million paid subscribers in February and since then the service's global footprint has grown.\nIn the last few weeks, the service launched in the United Kingdom, France and Germany, among other European countries. The service also became available in India last week where it was offered in conjunction with the country's existing streaming service, Hotstar.\nsaid that India accounts for eight million of the total, but it did not break down the subscriber totals of the other countries.\n\"We're truly humbled that Disney+ is resonating with millions around the globe,\" Kevin Mayer, the chairman of Disney's direct-to-consumer unit, said in a statement on Wednesday. \"Great storytelling inspires and uplifts, and we are in the fortunate position of being able to deliver a vast array of great entertainment rooted in joy and optimism on Disney+.\"\nThe company did not say if Disney+ received a bump from millions of people being forced to stay at home because of the coronavirus outbreak.\nThe pandemic has hit the company particularly hard. Disney's theme parks around the world have closed down, many of its biggest films of the year have been postponed and the Disney-owned ESPN has had to scramble to figure out what to air after sports leagues suspended games and canceled events.", "url": "https://www.cnn.com/2020/04/08/media/disney-subscribers/index.html"}