{"authors": [], "date_download": "2020-05-04 20:08:12", "date_modify": "2020-05-04 20:08:12", "date_publish": "2020-04-17 00:16:54", "description": "FORT WORTH, Texas (AP) — More than 100 Texas mayors are urging the state’s Congressional delegation to give all cities the same access to federal coronavirus relief funds, regardless of...", "filename": "_8fdda0fd41787d8b17df3a7622783ac4_1588622892.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8fdda0fd41787d8b17df3a7622783ac4_1588622892.html", "title": "Texas mayors want equal access to coronavirus federal aid", "title_page": "Texas mayors want equal access to coronavirus federal aid ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FORT WORTH, Texas (AP) — More than 100 Texas mayors are urging the state’s Congressional delegation to give all cities the same access to federal coronavirus relief funds, regardless of size.\nPresident Donald Trump signed a coronavirus aid bill into law last month that allocates $150 billion to states and local governments as part of a $2.2 trillion package. The funds are intended to support families, businesses and health care providers during the public health crisis.\nBut the package limits how cities with populations fewer than 500,000 people receive their funds. While larger cities are eligible to apply for money directly from the federal government, the smaller ones must request money from the governor.\n“This language leaves out hundreds of Texas cities with millions of residents. We simply do not understand the population cutoff in the CARES Act,” the mayors said in a letter sent Wednesday. “Simply put, there is no magic force that will protect local governments under 500,000 population from revenue losses during this crisis.”\nRepublican U.S. Rep. Ron Wright, of Arlington, told the Fort Worth Star-Telegram in a phone interview that “it’s pretty ridiculous” for a city the size of Arlington to be “left out.”\nArlington is the seventh-largest city in Texas with a population of roughly 398,000, according to 2018 census estimate data. The city isn’t expected to meet the qualification for direct funding.\n“This is what happens when you move something that large that quickly,” Wright said of the bill. “It’s arbitrary, it’s unfair, it’s unreasonable.”\nArlington faces a $20 million budget shortage because the city had to shut down businesses that had generated a lot of revenue, Mayor Jeff Williams said.\nWithout help from the federal government, Williams warned that his city would be forced to make cuts in the police and fire departments and other city workers.\nThe letter was signed by 111 Texas mayors, including Williams, Houston Mayor Sylvester Turner, Austin Mayor Steve Adler, San Antonio Mayor Ron Nirenberg, Dallas Mayor Eric Johnson and Fort Worth Mayor Betsy Price.\nWright noted that there’s support for the change because Congress members across the aisle have smaller cities in their districts.\n“There’s a number of us in Congress who are very unhappy about it and are trying to get it changed,” Wright said.\nWright said he and six other Republican congressmen wrote to Gov. Greg Abbott this month asking him to distribute federal funds to large and small cities alike. Abbott’s spokesman did not respond to a request for comment.", "url": "https://apnews.com/8fdda0fd41787d8b17df3a7622783ac4"}