{"authors": ["Bart Van Ark", "Erik Lundh For Cnn Business Perspectives", "Erik Lundh For"], "date_download": "2020-05-04 16:16:03", "date_modify": "2020-05-04 16:16:03", "date_publish": "2020-04-03 17:21:22", "description": "If American businesses prepare for this long, grueling haul, they can emerge from the crisis stronger, write Bart van Ark and Erik Lundh, economists at The Conference Board.", "filename": "2020_04_03_perspectives_us-economy-predictions-coronavirus_index_1588608963.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403120024-nyc-shuttered-business-0402-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_perspectives_us-economy-predictions-coronavirus_index_1588608963.html", "title": "Economists: Be skeptical of any claim the US economy will recover quickly", "title_page": "Economists: Be skeptical of any claim the US economy will recover quickly (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Bart van Ark is executive vice president and global chief economist of The Conference Board. Erik Lundh is a senior economist at The Conference Board. The opinions expressed in this commentary are their own.\nAs the coronavirus wreaks havoc on the US economy, Americans should brace for a prolonged period of pain, not a swift recovery. The real damage of this crisis has just begun to emerge.\nIn just the last two weeks of March alone, nearly 10 million Americans filed for unemployment insurance . So in that time, about 6% of the US labor force lost their job. And consumers — the lifeblood of the economy — recently saw their confidence plunge to a 32-month low. Large parts of the economy have suddenly shut off, and turning them back on will not be a simple reversal of the switch.\nGiven the substantial uncertainty about the depth and duration of this downturn and the path to recovery, The Conference Board has mapped out three scenarios for the US economy . They range from a reboot in the coming months to a deep, long-lasting contraction.\nWe believe America should prepare for a long road to recovery. The likeliest scenario — specifically, for a situation where unemployment mushrooms to 15%, a record in modern American history — is the economy starts growing again by no earlier than September, and US GDP for the year contracts by 6%. For context, in 2019 — when the economy was humming — GDP grew by 2.3% . If American businesses prepare for this long, grueling haul, they can emerge from the crisis stronger. Expecting a rapid recovery that doesn't pan out would only cause more pain.\n1. In this scenario, we assume the pandemic will at least partially be controlled by social distancing efforts, which will flatten the curve of new cases throughout the next two to three months. While this would reduce the virus's burden on the health care sector, it also means the economic damage would hurt a broader swath of sectors than in the other scenarios. Industries most sensitive to social distancing — especially the entertainment, hospitality, restaurant and airline industries — could shrink by 65% by the end of the second quarter. Wholesale, retail trade and manufacturing could decline by 20% to 25% over the course of three months. And even finance and business services could see a fall or strong slowdown in output.\nWhile growth may eventually return during the fall and create a positive fourth quarter, we estimate that unemployment would remain high and could still be 15% by year's end. The economy would shrink by 6% in 2020, which would mark the largest decline since 1946 , when the economy dropped by almost 12% due to the demobilization from World War II and the sharp pullback in military production. Even then, our economy eventually transitioned back to a period of peace and prosperity. We, too, can come out of this stronger.\n2. Our second scenario assumes a higher number of people will be infected by the virus, and the peak may not be reached until May. This situation could emerge if the precautionary measures to stem the rise in new cases are relaxed too soon before the curve really starts to flatten. Prematurely loosening the policies could backfire, resulting in many Americans having to enter full lock-down mode to avoid an escalation of new cases. Even if such restrictions eased during the summer, many people wouldn't be able to resume their pre-crisis daily routines until June or even July.\nIn this situation, the severity of the economic contraction intensifies during the second quarter. And along with the sectors most sensitive to social distancing, it also hurts retail, wholesale trade and manufacturing much more than in the first scenario. While we could see a strong rebound — in other words, a V-shaped recovery — during the third quarter, the damage already done will cause GDP to fall sharply by 5.5% for the year. Unemployment could balloon to 15% or even more, although it might begin dropping off later in the year.\nThis V-shaped scenario comes with a big caveat: It has by far the most uncertain outcome. After all, if the outbreak runs out of control, the outcome could be much worse than we predict. Another risk of this scenario is that the chances of a resurgence of coronavirus cases during the fall increases, adding to the uncertainty. It's the nightmare scenario for business planners.\n3. Of course, we still hope for a more optimistic scenario that assumes new virus cases peak by mid-April across most of the United States, making a quicker reboot of the economy possible. But time is running out, and epidemiological data suggest it's increasingly unlikely. And in the remote case that this scenario pans out, unemployment would probably peak at 10% by the end of the second quarter. Given recent data, we believe that the US unemployment rate is already at 10%.\nWe should resist the urge to go back to normal too quickly. If we persevere and plan for the future, we'll come out better.", "url": "https://www.cnn.com/2020/04/03/perspectives/us-economy-predictions-coronavirus/index.html"}