{"authors": ["Trends Reporter"], "date_download": "2020-05-04 20:25:09", "date_modify": "2020-05-04 20:25:09", "date_publish": "2020-04-29 21:49:52", "description": "The legendary producer revealed on \"The View\" that he plans to host another music session that centers on the soundtrack for the 1995 film \"Waiting to Ex...", "filename": "entry_babyface-the-view-coronavirus-instagram-live-battle_n_5ea9c046c5b61453df783b84_1588623909.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9c283240000a1018e9f54.jpeg?cache=49xjkk3u8v&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_babyface-the-view-coronavirus-instagram-live-battle_n_5ea9c046c5b61453df783b84_1588623909.html", "title": "Babyface Details His Coronavirus Symptoms, Reflects On Instagram Live Music Battle", "title_page": "Babyface Details His Coronavirus Symptoms, Reflects On Instagram Live Music Battle | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Kenneth “Babyface” Edmonds, who revealed earlier this month that he had tested positive for the coronavirus, recently detailed some of the symptoms he experienced while fighting the virus during an appearance on “The View.”\nThe legendary music producer joined co-hosts Whoopi Goldberg, Sunny Hostin and Joy Behar for Tuesday’s episode of the daytime talk show, which is being filmed in isolation due to the coronavirus crisis.\nEdmonds said that he couldn’t pinpoint when he could’ve contracted the virus but that he remembered having a “scratchy throat” after he returned home to Los Angeles after performing in Las Vegas.\nHe then visited an ear, nose and throat doctor, who told him that his symptoms could be viral.\n“I immediately went to my studio and just kind of shut the studio down and I hunkered down there, just in case,” he said.\nEdmonds noted that he then began experiencing body aches, chills, night sweats and a fever, which lasted for about six days.\nThe producer later said that his wife, Nicole Pantenburg, also began exhibiting symptoms and that they both eventually tested positive for COVID-19, the disease caused by the virus.\nEdmonds revealed in an Instagram post on April 10 that he and his family were “on our way back to full health” after fighting the virus.\nLater on in his interview on “The View,” Edmonds discussed his epic Instagram Live music battle with fellow producer Teddy Riley last week. The two played a series of hit songs from their respective catalogs for the large number of fans who tuned in.\nEdmonds noted that he was initially hesitant to participate in the battle, saying the idea of “battling with music isn’t necessarily my kind of thing.”\nBut he said he decided to participate after he talked to other leaders in the music industry, and when he realized it would be a “celebration of Black music and the excellence of it all.”\n“We all needed an escape and this was a good thing to do,” he later added. “It turned out to be an amazing thing to do and we had a lot of fun. It was a lot of fun to do it with Teddy ... Teddy is an amazing producer and a writer.”\nEdmonds later revealed that he has plans to release new music and a host an Instagram Live event on Mother’s Day, May 10, in which he will tell stories and play music from the soundtrack he produced for the 1995 film “Waiting to Exhale.”", "url": "https://www.huffpost.com/entry/babyface-the-view-coronavirus-instagram-live-battle_n_5ea9c046c5b61453df783b84"}