{"authors": ["Labor Reporter"], "date_download": "2020-05-04 20:19:43", "date_modify": "2020-05-04 20:19:43", "date_publish": "2020-04-28 14:18:01", "description": "Fifty-seven members of Congress say hazard pay and personal protective equipment need to be guaranteed in the next bill.", "filename": "entry_progressive-democrats-call-for-essential-worker-protections-in-next-stimulus_n_5ea82bbcc5b699bb9d9ef447_1588623583.html", "image_url": "https://img.huffingtonpost.com/asset/5ea82e7a2500002a10eb07b4.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_progressive-democrats-call-for-essential-worker-protections-in-next-stimulus_n_5ea82bbcc5b699bb9d9ef447_1588623583.html", "title": "Progressive Democrats Call For Essential Worker Protections In Next Stimulus", "title_page": "Progressive Democrats Call For Essential Worker Protections In Next Stimulus | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Democrats are making a push for hazard pay and new safety protections for workers in the next coronavirus stimulus package to be taken up by Congress.\nLawmakers sent a letter to Democratic and Republican leaders in the House and Senate on Monday night asking that the elements of an “essential workers bill of rights” be included in the next stimulus phase. The measures include premium pay for front-line workers, funding for child care and additional protections for workplace safety whistleblowers, among other asks.\n“The next coronavirus relief package to pass Congress must include an Essential Workers Bill of Rights containing a comprehensive set of policies to protect frontline workers during this public health emergency,” the lawmakers wrote.\nThe wish list from Democrats was put together by Sen. Elizabeth Warren (Mass.) and Rep. Ro Khanna (Calif.), and co-signed by eight other senators and 47 other members of the House, most of them members of the Congressional Progressive Caucus.\nCongress has so far passed three relief packages, along with a fourth interim deal aimed at replenishing a program run by the Small Business Administration. The total funds amount to nearly $2.8 trillion, with more to come as lawmakers debate additional spending to address a historic economic downturn.\nDemocrats say the essential worker proposal would protect essential employees working through the pandemic, like nurses, grocery clerks, bus drivers, postal workers and warehouse workers, as they face the hazards posed by COVID-19. The plan would guarantee additional pay and force employers to provide workers with the personal protective equipment many have been lacking.\nThe plan would also require the Occupational Safety and Health Administration to issue enforceable safety standards for the pandemic ― a move the Trump administration has resisted ― and attach more strings to stimulus funds. For instance, companies accepting federal money would have to remain neutral in union organizing drives.\nMost of the Democratic demands would face an almost certain death in the GOP-controlled Senate, particularly those that would create permanent mandates for sick and family leave. Some elements could find their way into the next stimulus deal, but it depends on where Democrats, and especially House Speaker Nancy Pelosi (Calif.), choose to put their leverage.\nAMANDA SABGA via Getty Images Sen. Elizabeth Warren (Mass.), Rep. Ro Khanna (Calif.) and other Democrats have been calling for more worker provisions in the stimulus legislation.\nMany of them have called for federally funded hazard pay, with one plan to give essential workers an additional $13 per hour, to be capped at $25,000 for the year for most. But Democrats are also desperate to win funding for cities and states that face steep budget shortfalls thanks to a drop in tax revenue since the pandemic began.\nSenate Majority Leader Mitch McConnell (R-Ky.) has rediscovered his concern about the national debt, suggesting that cash-strapped states should instead be allowed to seek bankruptcy protection. His office says federal relief would amount to a “blue state bailout” ― even though red states also stand to be in rough fiscal shape ― setting up another clash over the aid in the next bill.\nWarren took part in a call with essential workers from around the country on Saturday where she made her case for the protections. Many of the workers ― including a McDonald’s employee, a social worker and a delivery driver ― said they were paid too little and had too few safeguards for the work they were asked to do during the pandemic.\n“Anyone who still has to go to work every day and doesn’t have the ability to telework knows the fear of being at increased risk for the coronavirus,” Warren told them. “Our nation has a duty to take care of you while you are taking care of all of us.”", "url": "https://www.huffpost.com/entry/progressive-democrats-call-for-essential-worker-protections-in-next-stimulus_n_5ea82bbcc5b699bb9d9ef447"}