{"authors": [], "date_download": "2020-05-04 20:23:43", "date_modify": "2020-05-04 20:23:43", "date_publish": "2020-04-17 20:15:25", "description": "TUCSON, Ariz. (AP) — The University of Arizona is implementing furloughs and pay cuts for most of its employees as a result of economic strains brought on by the coronavirus outbreak. The...", "filename": "_5ea16b734d89013c0c601cd0e235d833_1588623823.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5ea16b734d89013c0c601cd0e235d833_1588623823.html", "title": "University of Arizona workers face furloughs amid pandemic", "title_page": "University of Arizona workers face furloughs amid pandemic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "TUCSON, Ariz. (AP) — The University of Arizona is implementing furloughs and pay cuts for most of its employees as a result of economic strains brought on by the coronavirus outbreak.\nThe university posted details about the furloughs on its website, saying the changes will begin May 11 and will remain in effect until June 30, 2021.\nThe amount of furlough days will be based on an employee’s annual salary. For example, those who make less than $44,450 a year can expect 13 furlough days while those who make more will have to take off without pay between 26 and 39 days.\nEmployees who make more than $150,000 will see pay cuts ranging from 17% to 20%.\nThe university projects it could lose $250 million as a result of the pandemic. University President Robert C. Robbins told the Arizona Daily Star on Friday the cuts will be reviewed each month to determine if the university is reaching its target savings.\nThe furloughs are expected to save between $90 million and $95 million, Robbins said. More savings will come from a hiring freeze, the halting of building projects, delayed plans for merit increases, and a 20% reduction in executive leadership pay that went into effect in March.\nThe university is one of southern Arizona’s largest employers.\nArizona State University officials said Friday they don’t have plans for furloughs, pay cuts or layoffs and were still working through all the financial implications for the university.\nAt Northern Arizona University in Flagstaff, a working group will be convened over the summer to continue monitoring the fiscal effects of the pandemic. The school is the largest employer in northern Arizona.\nSchool officials said Friday that NAU could be financially stretched heading into the next academic year. Current estimates of potential financial impact range from $30 million to $100 million and will depend on many factors, from enrollment numbers to the availability of state and federal stimulus funds.\nArizona has more than 4,500 cases of the virus and has seen 169 deaths . Cases are expected to peak in the state within two weeks.\nFor most people, COVID-19 causes mild or moderate symptoms, such as fever and cough. For some, especially older adults and people with existing health problems, it can cause more severe illness, like pneumonia, and death. The vast majority of people recover.", "url": "https://apnews.com/5ea16b734d89013c0c601cd0e235d833"}