{"authors": ["Steve Peoples"], "date_download": "2020-05-04 20:28:13", "date_modify": "2020-05-04 20:28:13", "date_publish": "2020-04-20 09:19:33", "description": "MONTCLAIR, N.J. (AP) — Presidential politics move fast. What we’re watching heading into a new week on the 2020 campaign: ___ Days to general election: 197", "filename": "_17b4da451cb2e067c8de6bc3c4ad4b1a_1588624093.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8b11be9ea4aa4231babb8d0e837bd983/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_17b4da451cb2e067c8de6bc3c4ad4b1a_1588624093.html", "title": "2020 Watch: Why is Trump going to war with governors?", "title_page": "2020 Watch: Why is Trump going to war with governors?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "2020 Watch: Why is Trump going to war with governors?\nFILE - In this combination of file photos, former Vice President Joe Biden speaks in Wilmington, Del., on March 12, 2020, left, and President Donald Trump speaks at the White House in Washington on April 5, 2020. The level of inconsistency and chaos surrounding Trump’s coronavirus response is reaching new heights, as Democrats show new signs of unifying behind presumptive presidential nominee Biden. (AP Photo, File)\nFILE - In this combination of file photos, former Vice President Joe Biden speaks in Wilmington, Del., on March 12, 2020, left, and President Donald Trump speaks at the White House in Washington on April 5, 2020. The level of inconsistency and chaos surrounding Trump’s coronavirus response is reaching new heights, as Democrats show new signs of unifying behind presumptive presidential nominee Biden. (AP Photo, File)\nMONTCLAIR, N.J. (AP) — Presidential politics move fast. What we’re watching heading into a new week on the 2020 campaign:\n___\nDays to general election: 197\n___\nTHE NARRATIVE\nThe inconsistencies in President Donald Trump’s coronavirus response are evident as Democrats show new signs of unifying behind presumptive presidential nominee Joe Biden .\nHeading into the weekend, the Republican president actively encouraged people to protest stay-at-home orders in a handful of battleground states led by Democratic governors. It could well exacerbate a political divide across America in the coming days.\nDemocrats, meanwhile, are showing new signs of unifying behind Biden following the sudden endorsements of Bernie Sanders , Elizabeth Warren and former President Barack Obama . Biden still has glaring political liabilities, but as the coronavirus continues to define the political landscape, Democrats and Republicans seem to be moving in opposite directions.\n___\nTHE BIG QUESTIONS\nWhy is Trump going to war with governors in the midst of a pandemic?\nThe president is a well-known counter-puncher. On Thursday, he issued guidelines for reopening the government, but on Friday he issued tweets that seemed to undermine those very guidelines, encouraging protesters in Minnesota, Michigan and Virginia.\nTrump issued separate tweets calling to “LIBERATE MINNESOTA,” “LIBERATE MICHIGAN” and “LIBERATE VIRGINIA,” warning that Virginia was literally “under siege” for unrelated Second Amendment issues.\nThere is already evidence that his supporters are ramping up protests against strict social distancing guidelines . What will be the political consequences?\nIs the Democratic Party already unified behind Biden?\nThis may be the best of times politically for Biden, who won three critical endorsements over the last week, none bigger than that of former rival Sanders. The Vermont senator sent a sharp message to his supporters, telling The Associated Press in an interview that it would be “irresponsible” to not support Biden.\nAt the same time, Obama stepped off the sidelines to publicly endorse Biden, and the former president and his wife are expected to do much, much more to help unify the party in the coming months.\nWhile all that was certainly good news for Biden, a significant segment of the progressive base remains unhappy with his emergence as the presumptive nominee — including some of Sanders’ own staff. And it’s far from guaranteed they’ll show up for him come November. This week, Biden should offer some new clues about how seriously he’s taking the urgent need to unify his party.\nWill another massive stimulus bill save the economy?\nThe Trump administration and Senate Democrats agreed on Sunday that they are close to finalizing another massive coronavirus spending bill.\nLess than a month after Trump signed a $2 trillion rescue package , Congress is expected this week to approve legislation that could exceed another half a trillion dollars. Most of it is intended for small businesses, which complained the initial infusion was insufficient, although Democrats appear to have won tens of billions of dollars more for hospitals and expanded testing.\nNothing will matter more to Trump’s reelection than the state of the economy this fall. With record surges in unemployment in recent weeks, the president needs to find a way to stop the bleeding. He’s hoping this new package is another big step in that direction.\nHow do Democrats handle sexual assault allegation against Biden?\nTrump’s team promised again in recent days that it would continue to highlight allegations of a decades-old sexual assault against Biden.\nWhile Biden’s campaign has denied any wrongdoing, the president’s daughter-in-law and senior campaign adviser Lara Trump told us it was “fair game.” Most Democrats seem to be trying to ignore it, but New York Rep. Alexandria Ocasio-Cortez said last week it is “legitimate to talk about.”\nTrump, of course, has faced more than a dozen allegations of sexual assault.\n___\nTHE FINAL THOUGHT\nTrump hyper-charged the political debate over social distancing by openly calling on his supporters to defy elected officials in at least three states. In doing so, he smashed the hopes of anyone who believed he might emerge as a compassionate consoler-in-chief willing to rise above petty politics to lead a frightened nation.\nTrump’s poll numbers are already slipping, but this is bigger than politics. Health experts are warning of deadly consequences should people begin moving away from social distancing recommendations too soon.\n___\nCatch up on the 2020 election campaign with AP experts on our weekly politics podcast, “Ground Game.”", "url": "https://apnews.com/17b4da451cb2e067c8de6bc3c4ad4b1a"}