{"authors": ["Bruce Schreiner"], "date_download": "2020-05-04 20:24:05", "date_modify": "2020-05-04 20:24:05", "date_publish": "2020-04-20 21:55:50", "description": "FRANKFORT, Ky. (AP) — Kentucky's schools should remain closed for the rest of the academic year and in-person graduations called off to help contain the coronavirus, Gov. Andy Beshear said...", "filename": "_9d6e45e72c5954719ea6a5ebc8f88cee_1588623845.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9d6e45e72c5954719ea6a5ebc8f88cee_1588623845.html", "title": "Beshear: Schools to stay closed for rest of academic year", "title_page": "Beshear: Schools to stay closed for rest of academic year", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FRANKFORT, Ky. (AP) — Kentucky’s schools should remain closed for the rest of the academic year and in-person graduations called off to help contain the coronavirus, Gov. Andy Beshear said Monday.\nThe governor had extended classroom closures a couple of times since the pandemic hit, but he took it a step further by recommending to local superintendents that schools remain shuttered for the remainder of the term. Schools have been closed statewide since mid-March.\n“Every health care professional had advised us that this is the right course of action to take,” Beshear said during his daily briefing. “Now I know for many this is hard. We had seniors that were looking forward to an in-person graduation and a prom.”\nThe governor urged school districts to come up with alternatives to in-person graduations.\nSchools also should continue their distance learning plans for students at home, he said.\nEarlier Monday, the governor had a teleconference call with public school superintendents, urging them to keep schools closed to in-person classes through the current academic year.\nOther governors across the country have taken the same action to combat the virus.\nMeanwhile, Beshear reported 102 more coronavirus cases statewide Monday, bringing the total to 3,050. He added that the Bluegrass State had six more virus-related deaths, raising the death toll to 154 fatalities.\nMore than 1,130 Kentucky residents have recovered from the virus, the governor said.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in a few weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including life-threatening pneumonia.\nBeshear acknowledged the sacrifices being made by students having school ceremonies canceled, especially for seniors unable to culminate their high school years with traditional graduation ceremonies. But he stressed that in-person graduations would threaten public health.\n“This shouldn’t have to be asked of you, but it is,” the governor said. “This is a time that we are all called to do more than maybe we ever thought we could, but knowing what the stakes are.”\nBeshear urged districts to look at other options, including virtual or even drive-in graduations.\n“Let’s find creative ways, digitally and otherwise, to try to celebrate your accomplishments,” the governor said.\nState education officials, meanwhile, will work with school districts to finish distance learning by the end of May, although many districts may finish earlier.\n“Our schools have been closed to in-person classes, but our schools have not been closed. This does provide you some certainty, though,” Interim Education Commissioner Kevin C. Brown said in a statement.”\n___\nFollow AP coverage of the pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.", "url": "https://apnews.com/9d6e45e72c5954719ea6a5ebc8f88cee"}