{"authors": ["Opinion Vance Vanier"], "date_download": "2020-05-04 16:03:52", "date_modify": "2020-05-04 16:03:52", "date_publish": "2020-04-01 18:16:03", "description": "Vance Vanier writes that large numbers of outpatient clinics are shutting down nationwide as they struggle to interpret contradictory, vaguely-worded government directives about making a distinction between \"essential\" and \"elective\" healthcare.", "filename": "2020_04_01_opinions_confusi_faa09c6edcb7bb8cf3fb74740ca59860_index_1588608232.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/170716224856-x-ray-doctor-radiographer-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_opinions_confusi_faa09c6edcb7bb8cf3fb74740ca59860_index_1588608232.html", "title": "The problem with shutting down outpatient care", "title_page": "The problem with shutting down outpatient care (Opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Dr. Vance Vanier is an emergency medicine physician and clinical assistant professor at Stanford University Medical Center. He is a physician advocate and a founding partner of Chicago Pacific Founders, a strategic firm that invests exclusively in health care services, including outpatient clinics. He is a Henry Crown Fellow and has been recognized as one of San Francisco's Top 40 Under 40, as well as Genetic and Biotechnology News' GEN Ten Young Guns of Biopharma. Follow him on LinkedIn. The opinions expressed in this commentary are his own; view more opinion articles on CNN.\n(CNN) My mother still needs her mammogram. My colleague with a family history of melanoma needs that suspicious mole examined. My elderly friend who struggles with glaucoma and cataracts still needs to see her ophthalmologist. All of these conditions require outpatient care -- a suddenly scarce resource in the setting of Covid-19.\nThe ongoing medical needs of hundreds of millions of American do not magically stop in this pandemic. Lawmakers urgently need to address the damaging impact that our current response to Covid-19 is having on our outpatient care infrastructure. Despite the $130 billion earmarked for hospital support in the $2 trillion coronavirus rescue package, large numbers of outpatient clinics are shutting down nationwide as they struggle to interpret contradictory, vaguely-worded government directives.\nOn one hand, health care facilities are deemed \"essential\" businesses that should remain open in state lockdowns. On the other hand, directives such as Surgeon General Jerome Adams' on March 14 request that providers \"please consider stopping elective procedures until we can #FlattentheCurve.\"\nA growing tide of outpatient clinics find it difficult to remain in business because of these conflicting guidelines. Is outpatient health care essential in this crisis, or is it elective?\nIn a March 18 briefing, Centers for Medicare and Medicaid Services administrator Seema Verma said government guidelines canceling elective medicine \"will help surgeons, patients and hospitals prioritize what is essential, while leaving the ultimate decision in the hands of state and local health officials and those clinicians who have direct responsibility to their patients.\" In essence, outpatient doctors should treat patients only for emergency procedures.\nHowever, there are numerous diseases where each day of delay can lead to an ever mounting public health crisis that will remain long after Covid-19 has been contained. Should mammograms, colonoscopies, diabetic wound checks, skin cancer exams and cataract surgeries really be put on indefinite hold when we consider the enormous societal burden of cancer, diabetes, heart conditions and ophthalmic disease in the elderly?\nOutpatient care facilities provide invaluable support within our health care system, which is why an extraordinary group of partners and I co-founded Chicago Pacific Founders , a strategic firm that invests exclusively in healthcare services, including outpatient clinics.\nAt the end of 2019, the Bureau of Labor Statistics estimated there were more than 621,000 ambulatory care centers actively providing care in the United States. However, because true emergencies account for a tiny percentage of a clinic's daily business, outpatient facilities have seen a sharp decline in patient traffic in recent weeks. In Texas, the chief executive for Premier Family Physicians, a network of 42 Austin-based primary care providers, reported that patient visits had dropped by about 30% because of the coronavirus, even when accounting for an increase in virtual visits.\nThese clinics cannot afford to stay open for potential emergencies. As Premier's CEO shared with The Texas Tribune, \"To take away 30, 40% of your volume, the margins in your primary care business will run out in a matter of weeks or months.\" These economics explain why large numbers of outpatient facilities are in the process of shutting down.\nEveryday health problems don't disappear in a pandemic. Within a short time, outpatient closures will lead to the further overcrowding of emergency departments with non-Covid-19 patients. This will make treating pandemic-affected patients more challenging and worsen the very capacity problem the government was attempting to solve by delaying elective procedures.\nAdministrators for the University of Pittsburgh Medical Center (UPMC) pressed this point when they decided to continue routine visits and some elective surgeries. In an internal policy document, obtained by Yahoo News, system administrators wrote that they would need to take an approach to elective care that could co-exist with Covid-19 priorities.\n\"Balancing the ongoing clinical needs of our patients with avoidance of unnecessary exposure requires a nuanced approach,\" they wrote, \"not an across-the-board cancelling of clinics and procedures.\"\nYet, facilities like UPMC seem to be in the minority. Fear has swept the outpatient world, spurred on by inadvisably broad policies that call for mass cancellations of elective medicine. Physicians fear being held liable for not conforming to government guidelines, and nervous patients are unfairly called upon to make medical judgments about the urgency of their care.\nThe anxiety created by these policies prompts patients and providers alike to cancel appointments, often without a conversation about what falls within the vague definition of elective medicine.\nThis pervasive fear exists despite the fact that outpatient clinics that have proactive policies of social distancing -- such as asking patients to wait in their cars, rather than in the waiting room -- can make them far safer for people than grocery stores and capable of providing care in a safe, effective manner. Furthermore, well-intentioned ideas to repurpose outpatient health care providers to inpatient Covid-19 care or save supplies for hospitals do not address the ongoing fundamental needs of tens of millions of Americans with chronic diseases.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nWe need to move toward a new solution, and quickly. As an emergency medicine physician, I fully recognize and have experienced the severity of the Covid-19 crisis. But the government must take a more nuanced stance on its policies for elective medicine.\nRather than effectively shutting down non-hospital clinics, our leaders should trust in doctors' medical judgment and precautionary measures so that clinics can remain open, and all patients can get the care that they deserve during this crisis. Stricter guidelines that outline or mandate outpatient clinic social distancing protocols, such as those in waiting rooms, would be a more effective way to address concerns around physician and patient safety.\nLet's get our outpatient doctors and nurses back to work and caring for the patients who need them now more than ever.", "url": "https://www.cnn.com/2020/04/01/opinions/confusing-outpatient-covid-19-guidelines-vanier/index.html"}