{"authors": ["Clare Duffy", "Cnn Business"], "date_download": "2020-05-04 17:00:00", "date_modify": "2020-05-04 17:00:00", "date_publish": "2020-04-09 23:40:52", "description": "Spring is usually prime home shopping season. But this year, sellers are reluctant to put their homes on the market.", "filename": "2020_04_09_business_home-listings-zillow-coronavirus_index_1588611600.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409191551-homes-for-sale-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_business_home-listings-zillow-coronavirus_index_1588611600.html", "title": "New listings for homes are down 27% from a year ago, Zillow data finds", "title_page": "Zillow: New listings for homes are down 27% from a year ago, amid the coronavirus pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Spring is usually prime home shopping season. But this year, sellers are reluctant to put their homes on the market.\nNew listings for homeshave fallen significantly, according to new data released by Zillow Thursday.\nThe number of newly listed homes during the first week of April was down 27% compared to the same time a year ago,analysis found. The drop is especially pronounced in cities that have been hard hit by coronavirus: new listings as of April 5 were down nearly 57% year-over-year in New York City, the epicenter of the US outbreak\n\"It is clear that many would-be home sellers are adopting a wait-and-see approach as uncertainty continues to rule,\" Skylar Olsen, senior principal economist at Zillow, said in a statement.\nThe digital real estate company analyzed listings of single-family, condominium and cooperative homes to create the report. Zillow's site compiles for-sale by agent listings from a variety of sources, as well as for-sale by owner and new construction listings, onto its platform.\nIn February, before the coronavirus outbreak had really taken hold in the United States, home values were up almost 4% annually, and the rate of growth was up from the prior month for the first time in nearly two years, Zillow found . Other economic indicators were strong, too — at the time, the US unemployment rate was still at its historic low of 3.5%. All of that meant the housing market looked poised for a solid busy season.\nIn 2018 and 2019, the number of new listings coming onto the market grew 50% from March 1 to April 5. This year, the number of new listings during that period fell by 19%.\nThe effects were more dramatic in certain areas. Detroit, Pittsburgh, New York and Philadelphia experienced the greatest year-over-year declines in new listings as of April 5.\nNew home listings were higher in just two of the metropolitan areas that Zillow examined: Austin, where listings grew almost 14% from the prior year, and Atlanta, where listings were up 10%.\n\"Our understanding of US economic conditions is changing weekly, if not daily, and early unemployment figures are striking, so it's understandable that some are hesitant to put their home on the market,\" Olsen said.\nBuyers may be hesitant, too.\nfor sale grew 2.5% from March 1 to April 5, which the company said \"indicates homes have been sitting on the market for longer while buyers have pulled back.\" In Seattle, the because homes aren't selling. Zillow found that the total inventory of homesfor sale grew 2.5% from March 1 to April 5, which the company said \"indicates homes have been sitting on the market for longer while buyers have pulled back.\" In Seattle, the first US city to experience a major coronavirus outbreak , total inventory is up almost 38% over the monthbecause homes aren't selling.\nFewer people looking to buy new homes could be an issue for Zillow, which has made a big bet on purchasing and selling homes itself over the past two years.\nBut Olsen said she expects the downturn will ease as the coronavirus crisis does.\n\"It is possible that this year's busy home shopping season is pushed into winter as some opt to hang back but activity continues from those who need to buy or sell for a job move or another major life event,\" Olsen said. \"What's not likely is that the bulk of potential home sellers and buyers simply throw up their hands and pull back from the market entirely.\"", "url": "https://www.cnn.com/2020/04/09/business/home-listings-zillow-coronavirus/index.html"}