{"authors": ["Holly Yan"], "date_download": "2020-05-04 17:01:38", "date_modify": "2020-05-04 17:01:38", "date_publish": "2020-04-09 16:34:11", "description": "In the United States, the largest known concentration of coronavirus cases outside of hospitals isn't on a cruise ship or in a nursing home. It's at a jail in Chicago.", "filename": "2020_04_09_us_coronavirus-jails-prisons_index_1588611698.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403160025-cook-county-jail-prayer-0323-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_us_coronavirus-jails-prisons_index_1588611698.html", "title": "Prisons and coronavirus: US jails and prisons are turning into 'petri dishes.' Deputies are falling ill, too", "title_page": "Prisons and coronavirus: US jails and prisons are turning into 'petri dishes.' Deputies are falling ill, too - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) In the United States, the largest known concentration of coronavirus cases outside of hospitals isn't on a cruise ship or in a nursing home. It's at a jail in Chicago.\nAt least 276 detainees and 172 staff members -- mostly correctional deputies -- at Cook County Jail have tested positive for coronavirus, the county sheriff's office said Wednesday. Two detainees who tested positive for the virus have died as of Thursday, and more than 20 detainees are hospitalized.\nAcross the country, prisons and jails have become hotbeds for coronavirus. Close confinement is likely fueling the spread.\n\"Jails in this country are petri dishes,\" said Toni Preckwinkle, Cook County Board president. \"It's very difficult in a jail to maintain social distancing.\"\nBut this isn't just a major health problem. It's also a growing safety concern.\nMelee breaks out in a Washington prison\nIn Washington state, violence erupted Wednesday after six inmates at Monroe Correctional Complex tested positive for coronavirus.\nIt started with a demonstration in the recreation yard involving more than 100 inmates, the Washington Department of Corrections said.\n\"All measures to bring individuals into compliance were ignored including verbal directives, pepper (OC) spray and sting balls, which release light, noise, and rubber pellets,\" the department said.\n\"Fire extinguishers were set off within two housing units within the Minimum Security Unit, providing an appearance of smoke from the exterior.\"\nAuthorities used more sting balls in those housing units. \"The individuals then stopped the destruction of the two housing units and came into compliance,\" the department said. No inmates nor staff were injured.\n\"It is believed at this time that the incident was caused by recent positive test results of COVID-19 among six men within the Minimum Security Unit,\" the Department of Corrections said.\n\"Those six men were transferred from the Minimum Security Unit on Sunday to the facility's isolation unit. The facility health care team is providing clinical monitoring and supportive care for the individuals in the isolation unit.\" One of the inmates with coronavirus is 68 years old\nAuthorities hope the frustration and violence don't escalate. But some inmates at the Monroe prison have threatened to set fires and \"take prison guards,\" Washington State Patrol Trooper Heather Axtman said.\nThe Department of Corrections said it's trying to protect medically vulnerable inmates. And all inmates in the housing unit where the coronaviarus patients were previously housed \"continue to have no symptoms of illness or disease (asymptomatic) and are wearing surgical masks for further protection.\"\n\"The Department of Corrections takes the safety and security of its correctional facilities, staff, and incarcerated individuals very seriously,\" the agency said. \"An internal investigation will be completed.\"\nVandalism in Kansas prison\nInmates at a prison with 26 positive coronavirus cases in Kansas vandalized their cell block for hours, an official said Thursday night. The incident happened in cell block C of Lansing Correctional Facility in Lansing, Kansas.\nLansing is about 30 miles northwest of Kansas City, Missouri.\nRandall Bowman of the Kansas Department of Corrections told CNN that the inmates are throwing around laundry and papers, setting off fire extinguishers and moving around furniture and cabinets in the cell.\nThe reason for the vandalism is unclear, he said, adding an investigation is underway.\n'There's a potential of us dying, too'\nIn the California prison system, the number of inmates infected grew by more than 700% in just over a week. And the number of staff infections nearly tripled, the California Department of Corrections and Rehabilitation said.\nAs of Wednesday, 29 inmates and more than 60 staff members have tested positive for the virus, the California department of corrections said.\n\"You have people in Italy dying, people in Spain dying, people in America dying, people are panic buying, people are concerned and people are scared,\" Samuel Brown, an inmate at California State Prison, Los Angeles County, told CNN.\n\"And the truth of the matter is, prisoners are people. So we're also afraid. And there's a potential of us dying, too.\"\nA 59-year-old detainee from Chicago's Cook County Jail died after testing positive for coronavirus , sheriff's officials said. His official cause of death has not been released, pending an autopsy.\nWhat prisons and jails are doing\nAt the jail, officials have created a quarantine \"boot camp\" to keep infected detainees separated from the rest of the population.\nJUST WATCHED Coronavirus in prisons won't stay behind bars Replay More Videos ... MUST WATCH Coronavirus in prisons won't stay behind bars 05:35\nThe jail houses about 4,500 detainees. On Thursday, a federal judge rejected a request by two detainees to order the immediate release or transfer of those who are medically vulnerable.\nBut Judge Matthew Kennelly did order Cook County Sheriff Thomas Dart to enact additional sanitation and quarantine guidelines. Any detainees showing coronavirus symptoms must be tested by Saturday, and any detainee who is quarantined must be given a face mask by Sunday.\nIn California, about 3,500 non-violent inmates who have less than 60 days left in their sentences could be released by next Monday, the California Department of Corrections and Rehabilitation said.\nThose who could be released will be screened for medical and health problems to ensure they can be placed in a community, CNN affiliate KCRA reported.\nThe inmate release is part of an effort to curb the spread of coronavirus while also making more room for those who need to be quarantined or isolated, the department said. At least 1,300 non-violent California inmates have already been released.\nIn addition, inmates across California will receive their meals in their cells or individual housing units to maximize social distancing, the corrections department said.\nYard time will still be allowed, but fewer inmates will be released at a time to allow for more space between them.\nShowers and telephones will be wiped down after each use. And all visitors and staff must undergo temperature screenings before entering any California correctional facility.", "url": "https://www.cnn.com/2020/04/09/us/coronavirus-jails-prisons/index.html"}