{"authors": ["Scott Bauer"], "date_download": "2020-05-04 20:12:33", "date_modify": "2020-05-04 20:12:33", "date_publish": "2020-04-09 14:18:59", "description": "MADISON, Wis. (AP) — Gov. Tony Evers on Thursday ordered the closure of 40 Wisconsin's state parks, forests and recreational areas primarily in southern and southeastern Wisconsin to help reduce...", "filename": "_d25cc2b99b997f9785f677bc02852591_1588623153.html", "image_url": "https://storage.googleapis.com/afs-prod/media/0c042b765dc3453aa9d82ec42fd2495f/2447.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d25cc2b99b997f9785f677bc02852591_1588623153.html", "title": "Evers closes 40 Wisconsin state parks, recreational areas", "title_page": "Evers closes 40 Wisconsin state parks, recreational areas", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Nov. 13, 2014 file photo, a man trians in a park in Fond du Lac, Wis. Gov. Tony Evers has ordered the closure 40 Wisconsin's state parks, forests and recreational areas primarily in south and southeast Wisconsin due to overcrowding, litter, vandalism and to help reduce the spread of the coronavirus. And he warned Thursday, April 9, 2020 that more closures may be coming if the public does not follow social distancing guidelines and vandalism continues. (John Hart/Wisconsin State Journal via AP File)\nFILE - In this Nov. 13, 2014 file photo, a man trians in a park in Fond du Lac, Wis. Gov. Tony Evers has ordered the closure 40 Wisconsin's state parks, forests and recreational areas primarily in south and southeast Wisconsin due to overcrowding, litter, vandalism and to help reduce the spread of the coronavirus. And he warned Thursday, April 9, 2020 that more closures may be coming if the public does not follow social distancing guidelines and vandalism continues. (John Hart/Wisconsin State Journal via AP File)\nMADISON, Wis. (AP) — Gov. Tony Evers on Thursday ordered the closure of 40 Wisconsin’s state parks, forests and recreational areas primarily in southern and southeastern Wisconsin to help reduce overcrowding and vandalism and to slow the spread of the coronavirus.\nEvers’ warned that the order could be followed by more closures if the public doesn’t follow social distancing guidelines and vandalism continues. The sites that will close indefinitely starting Thursday night include some of the state’s most popular hiking and camping destinations, which had been a place for cooped up families to spend time outdoors during the stay-at-home order.\nRecreational areas and state parks had been exempt from the stay-at-home order Evers issued last month, which runs through April 24. Entrance fees had been waived and state park offices and visitor centers were closed to help slow the spread of COVID-19.\n“Unfortunately, growing difficulty with ensuring social distancing compliance, dwindling cleaning supplies and mounting trash are some of the challenges faced by our state parks staff,” Evers said in announcing the closures. “We have to address the growing public health and safety concern and protect Wisconsinites.”\nHe said the situation had reached the point where public safety in the parks and surrounding communities took precedence over keeping the locations open.\nThe closures include Devil’s Lake State Park, the Kettle Moraine State Forest, Blue Mound State Park, Governor Dodge State Park, New Glarus Woods State Park and Dells of The Wisconsin River State Natural Area. The only closed park that isn’t in southern Wisconsin was High Cliff State Park on Lake Winnebago in Calumet County.\nAlso on Thursday, Evers reiterated that it was OK for churches to offer drive-up services on Good Friday and Easter after the conservative law firm Wisconsin Institute for Law and Liberty and religious groups asked for clarity.\n“Our intention was always to ensure that people could still practice their faith while also following the public health and safety measures necessary to flatten the curve and keep folks safe,” said Evers’ spokeswoman, Melissa Baldauff.\nEvers last week denied a request from Republican lawmakers asking him to roll back his stay-at-home order that doesn’t allow more than 10 people to gather for a church service.\nMany churches have moved to broadcasting services online.\nAs of Thursday, there had been 111 deaths and nearly 2,900 confirmed cases of COVID-19 in Wisconsin. Under previous Evers orders, all schools and nonessential businesses have also been ordered closed. Evers tried to stop in-person voting in Tuesday’s election as another way to slow the virus, but the Legislature refused and the state Supreme Court blocked the governor’s order.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/d25cc2b99b997f9785f677bc02852591"}