{"authors": ["Elaine Kurtenbach"], "date_download": "2020-05-04 20:27:43", "date_modify": "2020-05-04 20:27:43", "date_publish": "2020-04-06 03:57:42", "description": "BANGKOK (AP) — Asian shares and U.S. futures rebounded on Monday as investors grasped at threads of hope that the battle against the coronavirus pandemic may be making some progress in some...", "filename": "_ca59417f51cbbfe1610e9f5167b14888_1588624063.html", "image_url": "https://storage.googleapis.com/afs-prod/media/103af9643c974ccc81a60fc369ce4572/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ca59417f51cbbfe1610e9f5167b14888_1588624063.html", "title": "Shares rebound on glimmers of progress in battling virus", "title_page": "Shares rebound on glimmers of progress in battling virus ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A woman wearing face mask walks past a bank electronic board showing the Hong Kong share index in Hong Kong Monday, April 6, 2020. Asian shares and U.S. futures have rebounded as investors grasped at threads of hope that the battle against the coronavirus pandemic may be making some progress in some hard-hit areas.(AP Photo/Vincent Yu)\nA woman wearing face mask walks past a bank electronic board showing the Hong Kong share index in Hong Kong Monday, April 6, 2020. Asian shares and U.S. futures have rebounded as investors grasped at threads of hope that the battle against the coronavirus pandemic may be making some progress in some hard-hit areas.(AP Photo/Vincent Yu)\nBANGKOK (AP) — Asian shares and U.S. futures rebounded on Monday as investors grasped at threads of hope that the battle against the coronavirus pandemic may be making some progress in some hard-hit areas.\nMarkets in Tokyo, Seoul and Sydney gained more than 2% in early trading and Hong Kong was up nearly 1%. New York futures were about 3% higher.\nThe gains followed another Friday session of losses after the U.S. said employers cut 701,000 more jobs than they added last month, the first drop in nearly a decade. Investors fled the market ahead of the weekend. Oil prices were higher.\nReports showed the number of people dying appeared to be slowing in New York City, Spain and Italy. The news was cautiously welcomed by leaders, who also noted that any gains could easily be reversed if people did not continue to adhere to strict lockdowns.\n“Hundreds of people are passing away each day from the pandemic, but less so than previous days, giving markets hope that the lockdown measures are finally starting to prove effective,” Jeffrey Halley of Oanda said in a commentary.\n“Like the rest of the world, financial markets are searching for any slivers of hope,” he said.\nThe situation has deteriorated in other areas as rates of infections have surged.\nJapan’s prime minister, Shinzo Abe, was expected to announce a state of emergency on Tuesday to further curb public activity and contain the outbreak. Thailand’s government was reported to be considering expanding its 10 p.m. to 6 a.m. curfew.\nThe Nikkei 225 in Tokyo gained 2.4% to 18,249.57 while Hong Kong’s Hang Seng rose 0.9% to 23,439.92. South Korea’s Kospi added 2.2% to 1,763.93 while the S&P/ASX 200 in Sydney advanced 2.9% to 5,213.60. Shares also rose in Taiwan and Southeast Asia.\nShanghai’s market was closed for a public holiday.\nNew York’s first reaction to Friday’s appalling U.S. jobs report was to take it in stride. But Wall Street slid throughout the day as investors braced for more bad news.\nThe losses accelerated after New York’s governor announced the biggest daily jump yet for deaths caused by the coronavirus in the country’s hardest-hit state.\nThe S&P 500 fell 1.5% to 2,488.65. The Dow Jones Industrial Average lost 1.7% to 21,052.53, and the Nasdaq shed 1.5%, to 7,373.08. Small-company stocks fell far more than the rest of the market. The Russell 2000 index gave up 3.1%, to 1,052.05.\nThe S&P 500 is down 26.5% since its record set in February, reflecting the growing assumption that the economy is sliding into a sudden, extremely sharp recession.\nTraders are bracing for further potential doses of bad news: Potentially scary events on the calendar include Thursday’s weekly report on applications for unemployment benefits, which has been the closest thing to a real-time measure of how ferociously layoffs have swept the country. Companies will also soon begin reporting their profits for the first three months of the year, with reporting season beginning in earnest in two weeks.\nFriday’s jobs report likely didn’t fully capture the extent of the recent job losses, which have been accelerating by the day, because it collected data from before stay-at-home orders were widespread.\nThe panic selling that dominated the first few weeks of the sell-off has eased a bit since Washington unleashed massive amounts of aid to help markets and the economy. The Federal Reserve has promised to buy as many Treasury securities as it takes to keep lending markets running smoothly, and Congress approved a $2.2 trillion rescue plan for the economy.\nBut only a peak in the number of new coronavirus cases could lend some clarity on how deep and protracted the economic downturn will be.\nThe United States has more than 377,000 confirmed cases of the virus, leading the worldwide tally of more than 1.25 million compiled by Johns Hopkins University.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough. But for others, especially older adults and people with health problems, it can cause more severe illness, including pneumonia, and death.\nMore than 69,000 people have died, but over 260,000 have recovered.\nEnergy markets have recovered somewhat on expectations that Saudi Arabia and Russia might tone down their price war. However, benchmark U.S. crude was lower on Monday, falling $1.52 to $26.82 per barrel in electronic trading on the New York Mercantile Exchange. On Friday, it climbed 11.9% to $28.34 per barrel, adding on to its nearly 25% surge the day before.\nBrent crude, the international standard, gave up $1.06 to $33.05 per barrel. It rose $4.17 on Friday to $34.11 a barrel.\nThe world is awash in oil as demand for energy collapses, and President Donald Trump said Thursday that the rivals may be close to cutting back on production to prop up oil’s price.\nIn currency trading, the dollar rose to 108.87 Japanese yen from 108.48 yen on Friday. The euro edged higher, to $1.0814 from $1.0812.", "url": "https://apnews.com/ca59417f51cbbfe1610e9f5167b14888"}