{"authors": [], "date_download": "2020-05-04 21:07:04", "date_modify": "2020-05-04 21:07:04", "date_publish": "2020-04-30 21:16:37", "description": "Remote learning is the pits, and it's not ending anytime soon. Here's how to push through.", "filename": "entry_how-to-act-like-teacher-remote-learning-parents-kids_l_5eab09c6c5b633a854470bfb_1588626424.html", "image_url": "https://img.huffingtonpost.com/asset/5eab0c7c220000c20d827f35.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_how-to-act-like-teacher-remote-learning-parents-kids_l_5eab09c6c5b633a854470bfb_1588626424.html", "title": "How To Act Like A Teacher - So Your Kid Actually Listens To You", "title_page": "How To Act Like A Teacher — So Your Kid Actually Listens To You | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "MoMo Productions via Getty Images Remote learning is difficult, but experts have some tips on channeling your inner teacher.\nWhatever enthusiasm my 5-year-old had for “remote learning” when his school was first canceled eight weeks ago is gone. He hates video chatting with classmates. He’s not impressed by my mastery of phonetics. Oh and no, he does not want to work on another art project with me. The only discernible skill he has picked up is the art of crushing his parents’ souls negotiation. He vigorously resists structured activities, we cave and then we do the whole dance again the next day.\nI didn’t head into COVID-19 lockdown with any delusions about my ability to be a good teacher. But I also didn’t really consider how long this would go on — and now that it’s clear my kid won’t be going back to school until at least the fall, it feels like I should step up my game a bit. So I spoke with some experts, who shared six simple ways to channel your inner teacher.\n1. Role-play\nKids (understandably) don’t get how hard it is for parents who are totally new at this remote education thing to suddenly master teaching while trying to get their own work done. One way to foster a bit of understanding — and to work through tense moments — is to momentarily flip roles, said Annie Snyder, a senior learning scientist at McGraw-Hill.\n“Role-play is used very often in early childhood, primary and elementary settings to help learners work out their own feelings, understand the perspectives of others and solve problems or conflicts,” said Snyder, who holds a doctorate in educational psychology. “It can be a very effective tool for those moments when everybody is tearing out their hair and cabin fever gets to be a little too much.”\nSet a timer for 10 minutes or so, tell your kid that they’re the teacher and you’re the student, then reenact whatever scenario you were just struggling through. Hopefully, they’ll get a taste of how challenging it can be to teach and you might get a sense of the challenges they’re working through. When the timer is up, you can continue role-playing or they might decide they’re ready to get back to the task at hand, Snyder said.\n2. Tell them: “Repeat after me”\nEducators will often prompt kids to repeat instructions or “retell their understanding of a learning task,” Snyder said, which is an effective way to get on the same page.\n“It can help kids build up their listening skills,” she added. “It can also help parents understand where there may be misunderstandings.”\nI tried it today, and it was a total lightbulb moment for me. I thought my son was resisting a school science activity because he’s an obstinate sass bucket. It turned out, he just did not get it. I only realized that, however, when I asked him to walk me through what he thought his teacher’s instructions were, and he was just totally ... off.\n3. Keep your academic blocks really, really short\nEven if you’ve got older kids, it’s important to remember that people — adults included! — can only focus on tasks in relatively short bursts. There is no clear consensus on exactly what that means, but high school and college classes tend to last about 50 to 60 minutes max.\n“Twenty to 25 minutes is a stretch goal for many kids. Some kids can do two minutes.”\nFor younger kids (say, 12 and under), activities should be closer to the 20-minute range, Snyder said. Even that might be a reach, though, and that’s OK.\n“Twenty to 25 minutes is a stretch goal for many kids. Some kids can do two minutes,” she said. “Parents can stretch it out a bit at a time. I did 30-second increases for my kids to get to the point of 20 to 25 minutes.”\n4. Don’t forsake the idea of a daily schedule\nWhen schools were first canceled, social media was filled with aspirational daily schedules, and lots of parents were totally onboard. (Me included.) Now, not so much. But experts said mapping out the day is a good discipline to borrow from teachers, and they suggested sticking with it as much as possible — even if that just means mapping out a rough sequence of events rather than slotting in specific times. I repeat: It does not need to be a color-coded Insta-worthy masterpiece.\n“Now more than ever, we want that predictability in our lives, but ourselves and our children,” said Ellen Birnbaum, director of early childhood programs for the community center 92Y. “Go through what the day is going to be like.”\nKids like a bit of warning about what’s coming next, she added.\n5. Be honest with yourself about who your kid is\nGood teachers are adept at meeting individual children where they are, noting their particular interests, strengths and weaknesses without expecting them to be like someone else. That is a more challenging skill to cultivate when you’re suddenly a weird hybrid teacher/parent, but acceptance can go a looooong way in making this less painful for everyone.\n“You have to know who your child is and what they can handle,” said Sally Tannen, director of the 92Y’s Parenting Center.\nTake Snyder’s child, for example. The education expert admitted her child isn’t particularly into school in the first place and seems even less interested now that he’s at home. Rather than fighting him every step of the way, Snyder said she is trying to help him get through the work he does need to complete by giving him plenty of opportunities to use his physical energy up throughout the day, literally designating a space for him to run laps.\n6. Cut yourself — and your kid — some serious slack\nThis whole remote learning arrangement isn’t just difficult for parents and kids. It’s difficult for teachers, too.\n“This is a really hard task, because learning is all about connection and learning in place with someone,” Birnbaum said. If you’ve managed to just get through the day, “pat yourself on the back,” she and Tannen both urged.\nDon’t beat yourself up about rough patches or fret that if your kid is less than enthused with your efforts, they’re somehow “bad” or falling behind.\n“Remind yourself that this feels hard because it is hard. Even professional teachers and caregivers who are now overseeing their own kids' daily education are struggling.”\n“Resistance is normal and to be expected,” Snyder said.\nIt can certainly help to do a bit more digging. Is your kid resisting because the task is super boring? Are they hungry? Do they need to run around? (All three experts I spoke with emphasized repeatedly that kids need to be physically active throughout the day, especially when they’re stuck at home.)\nThen, channel your inner teacher and be as unflappable as possible, even if it requires some hardcore acting. Try not to yell. Take deep breaths. Remind yourself that this feels hard because it is hard. Even professional teachers and caregivers who are now overseeing their own kids’ daily education are struggling.\n“There are no good solutions for any of this,” Snyder said. “The real good solution would be for all of this to be over.”\nExperts are still learning about the novel coronavirus. The information in this story is what was known or available as of press time, but it’s possible guidance around COVID-19 could change as scientists discover more about the virus. Please check the Centers for Disease Control and Prevention for the most updated recommendations.", "url": "https://www.huffpost.com/entry/how-to-act-like-teacher-remote-learning-parents-kids_l_5eab09c6c5b633a854470bfb"}