{"authors": ["Entertainment Editor"], "date_download": "2020-05-04 20:29:18", "date_modify": "2020-05-04 20:29:18", "date_publish": "2020-04-30 14:01:55", "description": "Would we miss this? Knope.", "filename": "entry_leslie-knope-ron-swanson-return-parks-and-recreation_n_5eaacc41c5b633a854462ae2_1588624158.html", "image_url": "https://img.huffingtonpost.com/asset/5eaaccab220000640d827ebf.png?cache=bbtawienpm&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_leslie-knope-ron-swanson-return-parks-and-recreation_n_5eaacc41c5b633a854462ae2_1588624158.html", "title": "See Leslie Knope And Ron Swanson Return To 'Parks And Recreation' In New Teaser", "title_page": "See Leslie Knope And Ron Swanson Return To 'Parks And Recreation' In New Teaser | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "If anyone was prepared for quarantining during the coronavirus pandemic, you can bet it was Ron Give-Me-All-The-Bacon-And-Eggs-You-Have Swanson.\nIn a teaser for the upcoming “Parks and Recreation” special, Nick Offerman’s character confirms as much to Amy Poehler’s Leslie Knope, saying he’s been social distancing since he was 4.\nSee the two reunite below:\nParks and Recreation Reunion Special - Official Teaser#ParksAndRec pic.twitter.com/bow0gHDRMy — Tv/Movie Images and Trailers (@images_tv) May 1, 2020\nThe episode, set to kick off Thursday at 8:30 p.m. ET, is a one-time special to benefit the nonprofit organization Feeding America. According to a synopsis, the story is pulled directly from current events, with Leslie Knope trying to stay in touch with her buds from Pawnee while also social distancing.\nIn addition to Poehler and Offerman, all of the original cast members are set to appear, along with several surprise guests.\n“Like a lot of other people, we were looking for ways to help and felt that bringing these characters back for a night could raise some money,” executive producer Michael Schur said in a press release. “I sent a hopeful email to the cast and they all got back to me within 45 minutes. Our old ‘Parks and Rec’ team has put together one more 30-minute slice of (quarantined) Pawnee life and we hope everyone enjoys it. And donates!”\nWould we miss this? Knope.", "url": "https://www.huffpost.com/entry/leslie-knope-ron-swanson-return-parks-and-recreation_n_5eaacc41c5b633a854462ae2"}