{"authors": ["Lauren Fox", "Jeremy Herb"], "date_download": "2020-05-04 16:09:24", "date_modify": "2020-05-04 16:09:24", "date_publish": "2020-04-02 19:39:02", "description": "Despite states' continued calls for more federal involvement, the Federal Emergency Management Agency is still pushing back against playing a more active role in leading the supply chain, according to House Democrats.", "filename": "2020_04_02_politics_fema-leading-role-supply-chains_index_1588608564.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200326170029-trump-fema-0319-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_fema-leading-role-supply-chains_index_1588608564.html", "title": "FEMA still pushing back on a leading role in coronavirus supply chain", "title_page": "FEMA still pushing back on a leading role in coronavirus supply chain - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Officials from FEMA and the Department of Health and Human Services briefed members of the House Oversight Committee this week on the coronavirus response. In the briefing, the Democrats said, FEMA acknowledged that private businesses producing personal protective equipment for medical workers was \"not moving fast enough for any of us,\" and that trying to get enough masks to match the need of states and hospitals from private businesses was like \"chasing rabbits in an open field.\"\nBut the federal officials resisted the idea that FEMA should have a greater role in the supply chain, as many states are urging, saying that the agency \"attempting to replace private-sector supply chains does not work.\"\nFederal officials also told House lawmakers that there's a lag in obtaining new ventilators from the private sector, and acknowledged they knew \"as early as mid-January\" that the US wouldn't have enough N95 respirator masks if a coronavirus outbreak were to occur, according to Democrats on the oversight panel.\nThe committee has begun probing the Trump administration's response to the novel coronavirus, with new documents showing that FEMA has provided states with only a fraction of the supplies they've requested.\nThe Democrats said the federal government was \"not able to provide specific timelines about when additional equipment and supplies would be procured by the federal government and made available to states.\"\nThe committee said that FEMA officials acknowledged the demand for ventilators \"outstrips the capacity\" of the Strategic National Stockpile and the Pentagon, with about 9,500 ventilators remaining in the stockpile.\n\"By the week of April 13, the Supply Chain Task Force will have acquired only about 3,200 more,\" the committee said. \"FEMA reported that most of the 100,000 ventilators promised by President Trump will not be available until late June at the earliest.\"\nThe new information from the oversight panel comes as House Speaker Nancy Pelosi announced Thursday she would create a select committee to investigate the administration's response to the coronavirus outbreak. The committee -- led by Democratic Whip James Clyburn of South Carolina -- will focus on how the administration spends trillions in stimulus funds.\n\"The committee will be empowered to examine all aspects of the federal response to the coronavirus to ensure that taxpayer dollars are being wisely and efficiently spent to save lives, deliver relief and benefit our economy,\" Pelosi said in a letter to her colleagues Thursday.\nIt's not clear how the new committee will interact with the Oversight Committee, which has broad jurisdiction to investigate across the federal government.\nHouse Minority Leader Kevin McCarthy questioned the need for a new panel, saying it would be \"redundant\" when other committees can already conduct oversight and criticizing the selection of Clyburn to lead it.\n\"Congressman Clyburn is the one who thought that this crisis is an opportune time to restructure government. That's not what we should be doing,\" the California Republican said.\nMcCarthy also cautioned that getting the select committee up and running would require a House vote, which isn't likely to happen anytime soon, with the House not expected to have any votes before April 20.\nThe Oversight Committee, led by Democratic Rep. Carolyn Maloney of New York, collected data from FEMA on Monday on what states have received from the federal government's Strategic National Stockpile, a federal collection of medical supplies for an emergency that wasn't intended to fill all of the needs the states now have.\nThe committee obtained data from five states and Washington, DC, showing just how little of the states' requests for critical medical supplies are being filled through the stockpile. The panel's information tracks with what states across the country have been saying for several weeks, as most are seeing just a fraction of their requests being filled by the stockpile, which was not intended to supply the entire country.\nWashington, DC, and the five states -- Maryland, Virginia, Delaware, Pennsylvania and West Virginia — collectively reported receiving less than 10% of the N95 respirators, surgical masks, surgical gowns and gloves they sought.\nThe region received a little more than 25% of the face shields it requested and more than 40% of requested face and surgical masks, according to data provided on Monday.\nTrump confirmed on Wednesday that the stockpile is mostly depleted as supplies have gone out to the states. He said they weren't planning on refilling it so they could instead directly send the supplies the federal government receives to states and hospitals.\nBut states have said they are still competing with the federal government to obtain supplies like N95 respirator masks, expressing frustration at the supply chain issues with the federal government.\n\"We're sending it directly to hospitals,\" Trump said. \"We don't want it to come to the stockpile because then we have to take it after it arrives and bring it to various states and hospitals.\"\nOn March 3, HHS told a Senate committee that the Food and Drug Administration was working to stay ahead of medical supply shortages. But when GOP Sen. Mitt Romney of Utah asked Robert Kadlec, HHS assistant secretary for preparedness and response, what would be necessary in a \"full-blown pandemic\" -- at that point, coronavirus had not become one -- Kadlec noted a major shortfall was looming.\n\"If it were to be a severe event, we'd need 3.5 billion in N95 respirators,\" Kadlec said. \"We have about 35 million.\"", "url": "https://www.cnn.com/2020/04/02/politics/fema-leading-role-supply-chains/index.html"}