{"authors": [], "date_download": "2020-05-04 20:24:11", "date_modify": "2020-05-04 20:24:11", "date_publish": "2020-04-17 06:53:21", "description": "MORGANTOWN, W.Va. (AP) — Tests conducted after a resident of a West Virginia University dormitory complex contracted the new coronavirus show a second resident also has COVID-19, a health...", "filename": "_67e88ba27f42a72505a074ff3aeae230_1588623851.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_67e88ba27f42a72505a074ff3aeae230_1588623851.html", "title": "Second resident of West Virginia U. dorm complex has virus", "title_page": "Second resident of West Virginia U. dorm complex has virus ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MORGANTOWN, W.Va. (AP) — Tests conducted after a resident of a West Virginia University dormitory complex contracted the new coronavirus show a second resident also has COVID-19, a health department said.\nThe Monongalia County Health Department said in a news release that 108 students and workers were tested after the university was informed Sunday that a resident of the Evansdale Residential Complex was confirmed to have the virus. The second individual who tested positive is in self-isolation.\nOther residents of the complex, known as the Towers, have been released from self-quarantine now that the tests are complete.\nWVU, closed since March 20, prohibited students from returning to campus from spring break and shifted almost all instruction online through the summer. Most buildings are shuttered.\nWVU spokesman John Bolt has said students who weren’t leaving for spring break or were unable to remain away from campus were allowed to apply to stay in university housing. Fewer than 100 students are living in the housing.\nEarlier this month the university said at least 14 students who had lived in private, off-campus housing tested positive for the virus.", "url": "https://apnews.com/67e88ba27f42a72505a074ff3aeae230"}