{"authors": ["Greg Beacham"], "date_download": "2020-05-04 20:20:02", "date_modify": "2020-05-04 20:20:02", "date_publish": "2020-04-15 22:50:08", "description": "LOS ANGELES (AP) — Jared Goff knows his job got a whole lot tougher when Todd Gurley and Brandin Cooks left the Los Angeles Rams. His disappointment also stretches beyond the...", "filename": "_91d6d7bb7d7ace7a49fc9a3df38fa04c_1588623602.html", "image_url": "https://storage.googleapis.com/afs-prod/media/cfde8b0436bc45c3903a41b01200a64a/2526.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_91d6d7bb7d7ace7a49fc9a3df38fa04c_1588623602.html", "title": "QB Goff says Rams dropping Gurley, Cooks was 'super tough'", "title_page": "QB Goff says Rams dropping Gurley, Cooks was 'super tough'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Dec. 29, 2019, file photo, Los Angeles Rams quarterback Jared Goff passes against the Arizona Cardinals during first half of an NFL football game in Los Angeles. Goff was disappointed to end his partnership with two good friends when the Los Angeles Rams released Todd Gurley and traded Brandin Cooks. (AP Photo/Marcio Jose Sanchez, File)\nFILE - In this Dec. 29, 2019, file photo, Los Angeles Rams quarterback Jared Goff passes against the Arizona Cardinals during first half of an NFL football game in Los Angeles. Goff was disappointed to end his partnership with two good friends when the Los Angeles Rams released Todd Gurley and traded Brandin Cooks. (AP Photo/Marcio Jose Sanchez, File)\nLOS ANGELES (AP) — Jared Goff knows his job got a whole lot tougher when Todd Gurley and Brandin Cooks left the Los Angeles Rams.\nHis disappointment also stretches beyond the field.\n“It’s always super tough to lose friends or teammates,” Goff said Wednesday. “That’s part of the business. I’m in Year Five now, and I’m kind of getting numb to it a little bit. At the same time, me and Brandin and Todd are extremely close, and always will be.”\nDespite the obvious setback to the Rams’ short-term success, the quarterback is processing their personnel changes with his usual confidence and calm. He’s also focusing on the potential upside of change when the Rams and the NFL finally get back to work.\n“We’ll be just fine,” Goff said. “Nothing to worry about. I mean, we’ve got a lot of work to do, (but) it’s only April right now, and we’re going to work through this offseason and let’s see what comes of it due to the coronavirus, but it’s how the game goes. Teams make changes all the time, and we’re going to find other contributors.”\nGurley was released on March 19 before Cooks was traded last Friday, leaving the Rams without their franchise running back and their top deep threat. Goff has been handing off to Gurley for the quarterback’s entire four-year career, while Cooks was an integral part of LA’s passing game for the last two seasons.\nLos Angeles also didn’t sign any offensive contributors during free agency, instead only re-signing offensive line starters Andrew Whitworth and Austin Blythe. Yet Goff is quick to point out that everybody else who played significant snaps for the Rams last season — including the entire offensive line — is returning to an offense in its fourth season under coach Sean McVay.\nGoff sees that continuity as an advantage in a season that could be played under unprecedented circumstances, including the offseason workouts that won’t be happening.\n“It’ll be somewhat seamless for us to not be on the field during this time,” Goff said. “I could imagine it’s harder for teams that are installing a new offense, whereas for us, we’re going into Year Four with Sean, and really everyone knows what we’re doing at this point.”\nSince they didn’t sign anyone new, Goff believes the Rams’ plan is to promote backups to bigger roles, particularly receiver Josh Reynolds and running backs Darrell Henderson and Malcolm Brown. Los Angeles also is likely to look at skill-position players in the draft next week, although general manager Les Snead doesn’t have a first-round pick for the fourth consecutive year.\nGurley is the NFL leader in touches over the last half-decade, and his departure could increase the spotlight on Goff, who has battled consistency issues while racking up three straight winning seasons. The way Goff sees it, nothing has changed in that regard.\n“It’s always been on me,” he said. “It’s always been on the quarterback, and that’s never changed. Since I’ve come into the league, it’s always been up to me to make things happen.”\nGoff fills his isolation days by working out, watching old Tiger Woods performances on television with his roommates and even getting a haircut from his girlfriend’s friend. He grew and shaved off a beard, leaving only a mustache that probably won’t stick around much longer.\nGoff’s job got tougher, but he will be well compensated. He agreed last year to a $134 million contract extension that includes a then-record $110 million in guaranteed money.\nThe extension doesn’t even kick in until 2021, but Goff realizes the salary cap-strapped Rams already could be looking to renegotiate the structure of the deal to create some breathing room under the cap. His contract contains language that allows the Rams to restructure it without his consent, but that isn’t a problem to Goff.\n“If so, I’m all for it,” Goff said. “I don’t see why not. It doesn’t change anything for me, and it helps the team out.”\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/91d6d7bb7d7ace7a49fc9a3df38fa04c"}