{"authors": ["Sonia Moghe", "Scottie Andrew"], "date_download": "2020-05-04 16:01:45", "date_modify": "2020-05-04 16:01:45", "date_publish": "2020-04-01 17:14:32", "description": "A woman who gave birth in a New York hospital started showing symptoms of coronavirus. Hosptal staff later learned that her partner, who was with her during the delivery, may have been exposed to the virus.", "filename": "2020_04_01_us_woman-give-birth-symptomatic-coronavirus-trnd_index_1588608105.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401101452-strong-memorial-hospital-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_us_woman-give-birth-symptomatic-coronavirus-trnd_index_1588608105.html", "title": "A man was showing symptoms of coronavirus, but came to the hospital to see his partner give birth", "title_page": "A man was showing symptoms of coronavirus, but came to the hospital to see his partner give birth - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A woman who gave birth in a New York hospital was discharged after she started showing symptoms of coronavirus .\nStaff at Rochester's Strong Memorial Hospital later learned that her partner, who was present for her delivery, may have been exposed to the virus\nThe couple and their baby were discharged from the hospital and asked to quarantine themselves, University of Rochester Medical Center spokesperson Barbara Ficarra told CNN.\nFicarra wouldn't confirm to CNN whether the woman's partner had known about his possible exposure before visiting her.\nBut another University of Rochester Medicine spokesperson told local paper the Democrat & Chronicle that he did, and that he told hospital staff he was healthy before visiting.\n\"The mother became symptomatic shortly after delivering,\" spokesman Chip Partner told the paper. \"That's when the significant other admitted his potential exposure and that he was feeling symptomatic.\"\nNeither Ficarra nor Partner confirmed whether the couple or their child had tested positive for coronavirus.\nNone of the obstetric staff involved in the unnamed woman's delivery have tested positive for coronavirus, Ficarra said. One staff member who showed symptoms quarantined themselves and later tested negative.\nWhile their results were pending, though, hospital staff who came into contact with the couple and weren't symptomatic were required to continue to work while wearing masks and to submit to temperature checks twice a day, she said.\nThe couple spent their hospital stint in a private maternity ward, isolated from other patients, she said, so it's unlikely other patients were potentially exposed.\nThe hospital enacted a strict visitor policy\nIt's critical everywhere to curb coronavirus from spreading within hospitals, but it's especially dire in New York : The state is reporting the bulk of coronavirus cases in the US at over 80,000, according to CNN's tally.\nAs a result, University of Rochester Medicine Hospitals have restricted all visitors with few exceptions. One \"support person\" is permitted to be in the room for patients in labor, though they must be screened for symptoms twice daily. And once that support person is in the patient's room, they cannot leave.\nTheirs isn't the most restrictive visitor policy tried in the state. The NewYork-Presbyterian healthcare system initially banned all visitors , including the partners of patients giving birth. Hospital officials said the extreme measure was enacted after patients who were asymptomatic later tested positive.\nBut New York Gov. Andrew Cuomo later issued an executive order to allow obstetric patients to have one visitor.\n\"In no hospital in New York will a woman be forced to be alone when she gives birth,\" Cuomo tweeted. \"Not now, not ever.\"\nStates get strict on stay-at-home orders\nUnknowingly spreading coronavirus is not a crime. But several states are toughening up on social distancing , and now, violating stay-at-home orders is an arrestable offense.\nIn Hawaii , all visitors or residents who travel between islands must quarantine themselves for 14 days. Anyone who violates that order could face a fine of up to $5,000 or a one-year prison sentence, if convicted.\nIn Florida, a megachurch pastor was arrested and charged with unlawful assembly and a violation of health emergency rules for holding services for hundreds of churchgoers. A Louisiana pastor who held services and said the virus was a political ploy was hit with similar charges.", "url": "https://www.cnn.com/2020/04/01/us/woman-give-birth-symptomatic-coronavirus-trnd/index.html"}