{"authors": ["Chris Isidore", "Cnn Business"], "date_download": "2020-05-04 16:25:11", "date_modify": "2020-05-04 16:25:11", "date_publish": "2020-04-06 20:19:20", "description": "Two insurers -- Allstate and American Family Insurance -- announced Monday they will give back about $800 million to their auto insurance customers because people are driving far less during the coronavirus crisis.", "filename": "2020_04_06_business_allstate-payments-coronavirus_index_1588609511.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406134052-empty-interstate-sf-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_business_allstate-payments-coronavirus_index_1588609511.html", "title": "Auto insurance companies return $800 million in premiums because no one is driving", "title_page": "Allstate and American Family Insurance return $800 million in premiums because no one is driving - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Two insurers -- Allstate and American Family Insurance -- announced Monday they will give back about $800 million to their auto insurance customers because people are driving far less during the coronavirus crisis.\nsaid it will refund about 15% of premiums paid by its customers in April and May, which comes to a total of about $600 million.\n\"Given an unprecedented decline in driving, customers will receive a Shelter-in-Place Payback,\" said Allstate CEO Tom Wilson \"This is fair because less driving means fewer accidents.\"\nAllstate's payments will go to all US and Canadian customers with personal auto insurance, whether or not their state has any kind of stay-at-home order. American Family, which only serves customers in 19 states, also said its payments would go to all of its customers.\nAmerican Family Insurance said it will give back about $50 per car that a household has insured with the company via a one-time payment. It said that will total about $200 million.\nAllstate and American Family also said their customers who are having financial problems because of a loss of income can delay payments on insurance premiums without penalty if they contact the companies.\nBoth are also expanding insurance coverage for customers who use their personal vehicles to deliver food, medicine and other goods. Standard personal auto insurance policies typically exclude coverage that is used for a customer's car.\nAnd Allstate says it is also offering anyone in the United States, whether or not they are an Allstate customer, free identity protection for the rest of the year \"since our lives have become more digital.\"\nIs it enough?\nBut Allstate is probably giving back only a fraction of the money it is likely to save from reduced insurance claims during the crisis said Dan Karr, the CEO of ValChoice , a data analytics company that acts as a watchdog on the insurance industry.\nFigures reported by Allstate to state insurance regulators show it pays out a little more than $1 billion a month in auto insurance claims, he said. Karr's modeling suggests that those claims are likely falling by about 85% due to the reduced number of accidents.\n\"I think it's great what Allstate did. But where's the rest of savings?\" Karr told CNN Business. He said American Family Insurance's refund will probably equal even less of the average premium than Allstate's target of a 15% reduction.\nIt's too soon to know exactly how far claims will decline because of the drop in driving, said Allstate spokesman Justin Herndon. He said the company may give additional payments to customers as it gets more data on claims.\n\"We decided to act quickly to put our customers first. This is something we'll keep looking at,\" he said.\nAmerican Family said it has seen between a 20% to 40% in claims on a weekly basis between the pandemic declaration on March 11 through last Friday.\nOther consumer groups praised the moves by the insurers.\n\"Is it enough? Probably not,\" said J. Robert Hunter, director of insurance for the Consumer Federation of America. \"[But] Allstate and American Family deserve praise for their industry leadership on this vital first step. While it's too early to tell if the amounts promised are enough to reflect the big drop in auto accidents, the actions by American Family and Allstate are the right thing to do to help policyholders beleaguered by Covid-19 restrictions and job loss. We urge other insurers to take similar actions quickly.\"\nWill others follow suit?\nKarr said he wouldn't be surprised to see other insurers follow Allstate's lead.\nProgressive PGR Berkshire Hathaway BRKA Industry leader State Farm, which is a mutual insurance company owned by customers, is \"closely monitoring our automobile insurance losses and are considering how best to take this into account and return value to our auto insurance policyholders,\" according to a statement from the company. It said it expects a decision by the end of the week.said it is \"exploring how to best return some premium to customers to reflect the decreased exposure that comes with less frequent driving during the pandemic and expect to have those plans in place soon.\" Spokespeople with Geico, owned by, did not immediately respond to a request for comment on their plans.\nAn 85% drop in the number of accidents is a conservative estimate, Karr said. He said that data confirms that is the percentage of accidents that happens during periods of heavy traffic, which are almost completely absent in areas with stay-at-home orders.\nAuto insurance companies will probably continue to benefit from reduced driving even after stay-at-home orders are lifted in some states, he said, noting a large number of people will continue to work from home either full or part-time. Others will continue to be out of work because their employer went out of business during the crisis. Workers driving or riding in cars to and from work makes up for about 28% of miles driven by vehicles in a normal time, according to the Federal Highway Administration\n\"Data shows accident rates go up exponentially as traffic increases, and even a 5% reduction in traffic will make a difference,\" he said. \"Even people who are still driving because they are essential workers, the accidents rates will be way down.\"\nFor those whose insurers are not offering money back, Karr said those customers should call their insurer and change the coverage on the vehicle from use for work to personal use, assuming they are staying home. That will produce savings as well. But they should be sure to change it back to commuting use once they are using the car to get to and from work once again.", "url": "https://www.cnn.com/2020/04/06/business/allstate-payments-coronavirus/index.html"}