{"authors": [], "date_download": "2020-05-04 21:10:45", "date_modify": "2020-05-04 21:10:45", "date_publish": "2020-04-30 22:57:43", "description": "The U.S. reported that 3.8 million laid-off workers applied for jobless benefits last week, raising the total to 30.3 million in the six weeks since the ...", "filename": "entry_economic-downturn-30-million-unemployment_n_5eab5565c5b6995f13fe4e67_1588626645.html", "image_url": "https://img.huffingtonpost.com/asset/5eab56a7240000c6018ea0d7.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_economic-downturn-30-million-unemployment_n_5eab5565c5b6995f13fe4e67_1588626645.html", "title": "U.S. Employment Numbers Rocket Past 30 Million", "title_page": "U.S. Employment Numbers Rocket Past 30 Million | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "NEW YORK (AP) — Bleak new figures Thursday underscored the worldwide economic pain inflicted by the coronavirus: The number of Americans filing for unemployment benefits has climbed past a staggering 30 million, while Europe’s economies have gone into an epic slide.\nAnd as bad as the numbers are, some are already outdated because of the lag in gathering data, and the true economic picture is almost certainly much worse.\nThe statistics are likely to stoke the debate over whether to ease the lockdowns that have closed factories and other businesses. While many states and countries have pressed ahead, health officials have warned of the danger of a second wave of infection, and some employers and employees have expressed fear of going back to work when large numbers of people are still dying.\nIn the U.S., the government reported that 3.8 million laid-off workers applied for jobless benefits last week, raising the total to 30.3 million in the six weeks since the outbreak took hold. The layoffs amount to 1 in 6 American workers and encompass more people than the entire population of Texas.\nSome economists say that when the U.S. unemployment rate for April comes out next week, it could be as high as 20% — a figure not seen since the Depression of the 1930s, when joblessness peaked at 25%.\nThe number of Americans thrown out of work could be much higher than the unemployment claims show, because some people have not applied and others couldn’t get through to their states’ overwhelmed systems. A poll by two economists found that the U.S. may have lost 34 million jobs.\nThere was grim new data across Europe, too, where more than 130,000 people with the virus have died. The economy in the 19 countries using the euro shrank 3.8% in the first quarter of the year, the biggest contraction since the eurozone countries began keeping joint statistics 25 years ago.\n“This is the saddest day for the global economy we have ever seen” in the 50 years that economists at High Frequency Economics have been following the data, they wrote in a report.\nEven then, the statistics do not capture the enormity of the crisis. The quarterly figures cover January through March, and many of the lockdowns in Europe and the U.S. were not imposed until March — the second half of March in a multitude of places in the United States.\nStocks fell on Wall Street as the discouraging news piled up, with the Dow Jones Industrial Average losing nearly 290 points, or more than 1 percent.\nThe virus has killed over 230,000 people worldwide, including more than 61,000 in the U.S., according to a tally by Johns Hopkins University. Confirmed infections globally topped 3.2 million, with 1 million of them in the U.S., but the true numbers are believed to be much higher because of limited testing, differences in counting the dead and concealment by some governments.\nIn other developments:\n— Dr. Anthony Fauci, the U.S. government’s top infectious-diseases expert, said he expects federal approval for the first drug to prove effective against the coronavirus to happen “really quickly.” Remdesivir, made by California’s Gilead Sciences, hastened the recovery of COVID-19 patients in a major government study, and it might also have reduced deaths, according to Fauci.\n— A 1,000-bed Navy hospital ship that arrived in New York City to great fanfare a month ago left town after treating just 182 patients. The surge of cases there has fallen well short of the doomsday predictions. The 24-hour number of deaths statewide was down to 306, the lowest in a month.\n— With signs that the outbreak has stabilized in places, President Donald Trump said he would not extend the White House’s social-distancing guidelines past their expiration Thursday. Those guidelines encouraged people to work from home and avoid restaurants, groups and nonessential travel.\n— A suburban Minneapolis nursing home, St. Therese of New Hope, said 47 residents have died as a result of COVID-19 in yet another severe outbreak at an institution for the frail or elderly. At least 70 people have died at a veterans home in Massachusetts in the deadliest known cluster of its kind.\n— California Gov. Gavin Newsom ordered beaches in Orange County closed until further notice after tens of thousands of people flocked to the sand last weekend.\n— Prime Minister Boris Johnson said Britain is “past the peak” and “on a downward slope” in its coronavirus outbreak.\n— Russian Prime Minister Mikhail Mishustin, 54, said he has tested positive for the virus and will go into isolation.\n— NASCAR announced it will resume the season on March 17 but without fans in the stands. But the Little League announced it would cancel its World Series for the first time ever.\nFrance’s economy shrank 5.8%, the biggest quarterly drop since 1949. In Spain, the contraction was 5.2%. Germany is projecting that its economy, the eurozone’s biggest, will shrink 6.3% this year.\nUnemployment in Europe has reached 7.4%, the statistics agency Eurostat reported. However, job-protection programs run by governments are temporarily keeping millions of Europeans on payrolls, sparing them from the monumental layoffs the U.S. is seeing.\nThis week, the U.S. estimated its economy shrank at a 4.8% annual rate in the first three months of the year, the sharpest quarterly drop since the 2008 financial crisis. The current quarter is expected to be much worse, with a staggering 40% drop projected.\nStill, analysts saw a glimmer of hope in the way new unemployment claims have fallen for four straight weeks. Andrew Stettner, a senior fellow at the Century Foundation, said the wave of layoffs at vulnerable businesses such as restaurants, hotels and stores may have largely run its course.\n“Thankfully, for now, the economic contagion seems to have plateaued,” Stettner said. “But we’re still at a level that is a mortal threat to the nation’s financial well-being.”\nAcross the U.S., many governors have taken steps to gradually reopen their economies, amid impatience among Americans who complain their livelihoods are being destroyed and their rights trampled.\nIn Michigan, hundreds of protesters returned to the Capitol to denounce Democratic Gov. Gretchen Whitmer’s stay-home order and business restrictions. The Republican-led Michigan House refused to extend the state’s coronavirus emergency declaration and voted to authorize a lawsuit challenging Whitmer’s authority and actions to combat the pandemic.\nBut even in states where businesses are being allowed to reopen, some workers are uneasy about returning.\nLacey Ward, an Omaha hairstylist, said she is worried that the Nebraska governor’s decision to let salons reopen on May 4 could put her and her family at risk. She would prefer to collect unemployment until the danger subsides.\n“I feel like we are literally the guinea pigs in this situation,” she said.\nTyler Price, furloughed in March from his job at Del Frisco’s Grille in a Nashville suburb, has been asked to come back but is wary, especially since he is susceptible to respiratory infections.\n“Even with every precaution taken, I’m highly at risk,” he said. “The fact that my job is just, ‘Come on up, make some money,’ it’s insane. It’s absolutely insane to ask that of people.”\nFinding enough workers willing to return is proving to be a challenge for Jennifer Holliday, manager at a restaurant in Oklahoma City that will reopen its dining room Friday. Many of her employees are not returning calls or messages.\n“There are some who want to just ride it out and take the unemployment,” she said.\n___\nRugaber reported from Washington, Leicester from Paris. AP reporters around the world contributed to this report.\n___\nFollow AP pandemic coverage at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://www.huffpost.com/entry/economic-downturn-30-million-unemployment_n_5eab5565c5b6995f13fe4e67"}