{"authors": ["Environment Reporter"], "date_download": "2020-05-04 20:21:29", "date_modify": "2020-05-04 20:21:29", "date_publish": "2020-04-29 18:31:45", "description": "The 12-member energy panel includes eight fossil fuel executives who have donated $4.2 million to Republican candidates and PACs since June 2016.", "filename": "entry_oil-executives-economic-task-force-gop-donors_n_5ea9a3e2c5b6fb98a2b65a6e_1588623689.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9a4ec240000ae008e9f38.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_oil-executives-economic-task-force-gop-donors_n_5ea9a3e2c5b6fb98a2b65a6e_1588623689.html", "title": "The Oil Execs On Trump’s 'Opening The Country' Council Are Major GOP Donors", "title_page": "The Oil Execs On Trump’s 'Opening The Country' Council Are Major GOP Donors | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Eight fossil fuel executives tapped for a White House task force advising President Donald Trump on how to reopen the U.S. economy amid the COVID-19 pandemic have donated millions to Trump and other Republican campaigns and political committees in recent years.\nEarlier this month, the White House named nearly 200 corporate executives and business leaders to its so-called “Great American Economic Revival Industry Groups” ― which Trump has called the “Opening the Country” council ― in 17 separate areas ranging from agriculture and banking to sports and “thought leaders.”\n“These bipartisan groups of American leaders will work together with the White House to chart the path forward toward a future of unparalleled American prosperity,” Trump said in a statement accompanying the April 14 announcement. “The health and wealth of America is the primary goal, and these groups will produce a more independent, self-sufficient, and resilient Nation.”\nThe 12-member energy panel includes eight oil and gas executives who have collectively made more than $4.2 million in political contributions since Trump launched his presidential bid in June 2015, according to an analysis from the watchdog group Documented. The vast majority of that total went to Republican candidates and political action committees.\nThe Trump Victory Committee, a joint fundraising entity of Trump and the Republican National Committee, took in $619,400 from the oil and gas representatives on the new council ― more than any other entity. America First Action, a pro-Trump super PAC, received $500,000, while the National Republican Senatorial Committee and the National Republican Congressional Committee raked in $410,900 and $407,400, respectively.\nThe remaining money ― approximately $29,000 of the more than $4.2 million ― went to a handful of Democratic candidates and committees.\nThe energy group includes no one from the renewable energy world. Instead, Trump turned to some familiar allies with deep pockets in an industry that he and his team have worked hard to lift up. The task force includes fracking mogul Harold Hamm, the billionaire executive chairman of Continental Resources whom Trump reportedly considered nominating as energy secretary, and John Hess, the CEO of New York City-based oil and gas producer Hess Corporation who donated $1 million to Trump’s inauguration.\nHamm has contributed more than $1.7 million to Republicans since June 2016, including a $500,000 contribution to America First Action in January 2018, Documented’s analysis found. Hess gave approximately $1.7 to Republicans, not including the inauguration contribution.\nContinental Resources and Hess Corporation did not respond to HuffPost’s request for comment Tuesday.\nPool via Getty Images President Donald Trump speaks during a roundtable meeting with oil industry CEOs at the White House on April 3.\nThe other oil and gas representatives on the White House economic council made the following political contributions since June 2016: ConocoPhillips CEO Ryan Lance ($264,580); Chevron Corporation CEO Mike Wirth ($171,307); ExxonMobil CEO Darren Woods ($123,556); Valero chairman and CEO Joe Gorder ($98,300); Occidental Petroleum Corporation President and CEO Vicki Hollub ($81,652); and Kinder Morgan, Inc. CEO Steven Kean ($50,550).\nThe other four members of the council’s energy panel are Tom Fanning, CEO of utility giant Southern Company; Mark Crosswhite, CEO of Alabama Power Company, one of four utilities operated by Southern Company; Rich Nolan, CEO of the National Mining Association, a mining industry trade group; and Ross Perot Jr., chairman of Texas-based real estate development and investment companies The Perot Group and Hillwood.\nThe son of the late billionaire business businessman and presidential candidate Ross Perot, Perot Jr. is also a major Republican donor.\n“President Trump’s policies built a booming economy, and we have been inundated with requests from prominent and successful individuals who share our enthusiasm to see this economy roar once more,” White House spokesman Judd Deere said via email. “The White House is appreciative of all those from many different backgrounds, regions, and skillsets who have offered their services for this monumental task.”\nDeere did not respond to HuffPost’s questions about how individuals were selected for the task force, the group’s operations or its accomplishments to date.\nThroughout his first term, the Trump administration has cozied up to the fossil fuel industry as it’s pursued “energy dominance,” an effort that’s included rolling back environmental regulations and opening huge swaths of the federal estate to new drilling. And Trump has vowed to do what he can to help the industry weather the ongoing pandemic, which has caused a steep decline in demand for fossil fuels that has hammered domestic producers and last week sent oil prices into negative territory for the first time in history.\n“You’ve done a great job, and we’ll work this out and we’ll get our energy business back,” Trump said during an April 3 meeting with oil executives at the White House. “I’m with you 1,000 percent.”\nFive industry executives present at that meeting ― Wirth, Hollub, Garland, Woods and Hamm ― now sit on the advisory council tasked with helping Trump’s economic recovery efforts.\nAmid layoffs, bankruptcies and a glut of crude that has rendered oil essentially worthless, Trump is facing growing calls to throw fossil fuel companies a lifeline. As part of a future industry bailout, the administration is considering government loans for U.S. drillers, purchasing stakes in U.S. companies and imposing tariffs on imported oil, according to Bloomberg News and other outlets.\nYet even as the industry reels from the coronavirus and looks to the federal government to stay afloat, the oil and gas companies represented on Trump’s economic task force continue to spend big money on politicians and federal lobbying.\nTogether, executives at seven of the eight companies have donated more than $400,000 to Republican committees since Jan. 20, when the first coronavirus case was confirmed in the U.S., Documented’s analysis found. And since the start of the new year, they’ve spent more than $9 million on lobbying.", "url": "https://www.huffpost.com/entry/oil-executives-economic-task-force-gop-donors_n_5ea9a3e2c5b6fb98a2b65a6e"}