{"authors": [], "date_download": "2020-05-04 20:07:11", "date_modify": "2020-05-04 20:07:11", "date_publish": "2020-04-09 15:53:28", "description": "DENVER (AP) — More than 46,000 people filed for initial unemployment benefits in Colorado last week as coronavirus-related job losses grew, bringing claims since the economic shutdown began to...", "filename": "_d42a2daba1e566f80eebb6e0d8256a6d_1588622831.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b1b4f35f19454535ae90b655629148a9/1891.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d42a2daba1e566f80eebb6e0d8256a6d_1588622831.html", "title": "More than 46,000 people file for unemployment in Colorado", "title_page": "More than 46,000 people file for unemployment in Colorado", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Oct. 2019 photo Guitar tech Jon \"LJ\" Vishnevsky, left, and audio engineer Mike Babcock talk while working at the Exit 111 Festival in Manchester, Tenn. This year, Vishnevsky was touring with the rock band Alter Bridge until March when suddenly the 32-year-old was out of a job as the band and countless others canceled spring shows because of the coronavirus pandemic. Vishnevsky, of Denver, said he applied for unemployment on March 20 and as of Wednesday, April 8, 2020, was still waiting to learn if it would be approved. (Ernest Falconer via AP)\nIn this Oct. 2019 photo Guitar tech Jon \"LJ\" Vishnevsky, left, and audio engineer Mike Babcock talk while working at the Exit 111 Festival in Manchester, Tenn. This year, Vishnevsky was touring with the rock band Alter Bridge until March when suddenly the 32-year-old was out of a job as the band and countless others canceled spring shows because of the coronavirus pandemic. Vishnevsky, of Denver, said he applied for unemployment on March 20 and as of Wednesday, April 8, 2020, was still waiting to learn if it would be approved. (Ernest Falconer via AP)\nDENVER (AP) — More than 46,000 people filed for initial unemployment benefits in Colorado last week as coronavirus-related job losses grew, bringing claims since the economic shutdown began to 127,393, the state labor department said Thursday.\nLast week, Colorado paid $29.8 million in unemployment benefits, more than the average of $19 million paid out weekly during the height of the Great Recession.\nThe most recently available industry-specific statistics show that hotels and restaurant workers have been hit hard. During the week of March 21, those workers accounted for over a quarter of applications for benefits.\nThe other four top fields were health care and social services — including dentist and chiropractor offices and daycare centers; personal services like nail and hair salons and barbers; arts, entertainment; and recreation and retail trade.\nWhile many people were not able to file their applications initially because the state’s website was overwhelmed, those who have been able to file them still have to wait several weeks for their claims to be verified and to start receiving payments.\nJon “LJ” Vishnevsky, 32, was touring with the rock band Alter Bridge as a staff guitar tech until March, when he lost his job. Vishnevsky, of Denver, said he applied for unemployment on March 20 and as of Thursday was still waiting to learn if it would be approved. With his lease up, he had been staying with friends and has since gone to stay with his parents in Mesa, Arizona.\n“I got lucky my lease was up, we got a tour in and I have some savings,” he said.\nWhile gig and self-employed workers are eligible to collect unemployment payments under the federal $2.2 trillion economic rescue package, Colorado is still working to change its system to be able to evaluate and process those claims, which will be retroactive, after getting guidance from the federal government.\nThe Colorado Department of Labor and Employment hopes to be able to start accepting those claims next week, spokeswoman Cher Haavind said. Nationally, more than one in 10 workers have lost their jobs in just the past three weeks.\nIn other developments:\n— Authorities believe at least three reports of police impersonators stopping drivers recently are not true, The Denver Post reported. One woman allegedly admitted to making up a story about being stopped in Aurora to try to get her employer to give her documents showing she was an essential worker.\n____\nThis story has been corrected to say that the statistics for jobless claims by industry are from the week ending March 21, not last week.", "url": "https://apnews.com/d42a2daba1e566f80eebb6e0d8256a6d"}