{"authors": ["Hanna Ziady", "Cnn Business"], "date_download": "2020-05-04 16:34:35", "date_modify": "2020-05-04 16:34:35", "date_publish": "2020-04-07 18:04:53", "description": "Lufthansa, one of Europe's biggest airline groups, is permanently reducing the size of its fleet and shuttering one of its low-cost carriers, as it warns that the aviation sector will take years to recover from the coronavirus pandemic.", "filename": "2020_04_07_business_lufthan_fa2b607b7ffb7a0a435beb211a6596aa_index_1588610075.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407125248-lufthansa-parked-planes-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_business_lufthan_fa2b607b7ffb7a0a435beb211a6596aa_index_1588610075.html", "title": "Lufthansa shuts Germanwings and says aviation won't recover for years", "title_page": "Lufthansa shuts Germanwings and says aviation won't recover for years - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) Lufthansa, one of Europe's biggest airline groups, is permanently reducing the size of its fleet and shuttering one of its low-cost carriers, as it warns that the aviation sector will take years to recover from the coronavirus pandemic.\nThe airline group , which owns national carriers in Germany , Switzerland, Austria and Belgium, said in a statement Tuesday that it will permanently decommission at least 43 aircraft, about 6% of its fleet, and ground its budget airline Germanwings.\nLufthansa' DLAKY s assessment is that \"it will take months until the global travel restrictions are completely lifted and years until the worldwide demand for air travel returns to pre-crisis levels.\" Based on this, it has decided on \"extensive measures to reduce the capacity of flight operations and administration long term,\" it said.\nFlight bans and nationwide lockdowns are threatening to bankrupt airlines around the world. Carriers have grounded thousands of planes, suspending short-term flight schedules and placing workers on unnpaid leave.\nAt Lufthansa, 13 Airbus aircraft and five Boeing 747-400s will be permanently decommissioned, with a further 11 Airbus A320s withdrawn from short-haul operations. These actions will reduce capacity at Lufthansa's hubs in Frankfurt and Munich, the company said.\nRead More", "url": "https://www.cnn.com/2020/04/07/business/lufthansa-shuts-germanwings-on-coronavirus/index.html"}