{"authors": ["Matthew Brown"], "date_download": "2020-05-04 20:09:55", "date_modify": "2020-05-04 20:09:55", "date_publish": "2020-04-07 15:21:16", "description": "BILLINGS, Mont. (AP) — A Canadian company said Monday that it's started construction on the long-stalled Keystone XL oil sands pipeline across the U.S.-Canada border, despite calls from tribal...", "filename": "_7f0cdac0895b7c4850a9c7d7056b6408_1588622995.html", "image_url": "https://storage.googleapis.com/afs-prod/media/508dd5e9b4234165a0960e5728c8e8d2/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7f0cdac0895b7c4850a9c7d7056b6408_1588622995.html", "title": "Work starts in Montana on disputed Canada-US oil pipeline", "title_page": "Work starts in Montana on disputed Canada-US oil pipeline", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This March 11, 2020 photo provided by the Bureau of Land Management shows the proposed route of the Keystone XL oil pipeline where it crosses into the U.S. from Canada in Phillips County, Mont. A Canadian company said Monday, April 6, 2020, that it's started construction on the long-stalled Keystone XL oil sands pipeline across the U.S.-Canada border, despite calls from tribal leaders and environmentalists to delay the $8 billion project amid the coronavirus pandemic. (Al Nash/Bureau of Land Management via AP)\nThis March 11, 2020 photo provided by the Bureau of Land Management shows the proposed route of the Keystone XL oil pipeline where it crosses into the U.S. from Canada in Phillips County, Mont. A Canadian company said Monday, April 6, 2020, that it's started construction on the long-stalled Keystone XL oil sands pipeline across the U.S.-Canada border, despite calls from tribal leaders and environmentalists to delay the $8 billion project amid the coronavirus pandemic. (Al Nash/Bureau of Land Management via AP)\nBILLINGS, Mont. (AP) — A Canadian company said Monday that it’s started construction on the long-stalled Keystone XL oil sands pipeline across the U.S.-Canada border, despite calls from tribal leaders and environmentalists to delay the $8 billion project amid the coronavirus pandemic.\nA spokesman for TC Energy said work began over the weekend at the border crossing in northern Montana, a remote area with sprawling cattle ranches and wheat fields. About 100 workers will be involved in the pipeline’s early stages, but that number is expected to swell into the thousands in coming months as work proceeds, according to the company.\nThe 1,200 mile (1,930 kilometer) pipeline was proposed in 2008 and would carry up to 830,000 barrels (35 million gallons) of crude daily for transfer to refineries and export terminals on the Gulf of Mexico.\nIt’s been tied up for years in legal battles and several court challenges are still pending, including one that’s due before a judge next week.\nTC Energy’s surprise March 31 announcement that it intended to start construction came after the provincial government in Alberta invested $1.1 billion to jump start work. Montana’s Department of Environmental Quality on Friday issued the final state permits the company needed, agency spokeswoman Rebecca Harbage said.\nLeaders of American Indian tribes and some residents of rural communities along the pipeline route worry that workers could spread the coronavirus. As many as 11 construction camps, some housing up to 1,000 people, were initially planned for the project, although TC Energy says those are under review because of the virus.\nTC Energy says it plans to check everyone entering work sites for fever and ensure workers practice social distancing.\nWork on the pipeline is allowed under an exemption to Gov. Steve Bullock’s March 26 “stay at home” directive, which is intended to prevent the spread of the virus by discouraging many daily activities, according to state officials. But the directive did not address worker camps.\nBullock is concerned about potential risks from the virus associated with the camps, spokeswoman Marissa Perry said Monday. The Democratic governor “would want those concerns addressed prior to TC Energy and their contractors finalizing their plans of operations for those segments of construction,” she said.\nOpponents in January had asked Morris to block any work while the legal challenges are pending. They said clearing and tree felling along the route would destroy bird and wildlife habitat. Native American tribes along the pipeline route have said the pipeline could break and spill oil into waterways like the Missouri River.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.\nA hearing on the request to block work is scheduled for April 16 before U.S. District Judge Brian Morris in Great Falls.\nKeystone XL was rejected twice under former President Barack Obama because of concerns it would make climate change worse. President Donald Trump revived the project and later pushed through approval after Morris issued an order to block construction in 2018.\nMorris in December denied an initial request to block construction because TC Energy said at the time no work was immediately planned.\nStephan Volker, an attorney for the environmental groups asking Morris to again intervene, said the company’s decision to “jump the gun” before next week’s hearing was an insult to the judge.\n“We are confident the court will not be bullied, and will overturn President Trump’s second approval, just as he overturned President Trump’s first approval, as unlawful,” Volker said.\n___\nFollow Matthew Brown at https://twitter.com/matthewbrownap", "url": "https://apnews.com/7f0cdac0895b7c4850a9c7d7056b6408"}