{"authors": ["Clare Duffy", "Cnn Business"], "date_download": "2020-05-04 16:54:35", "date_modify": "2020-05-04 16:54:35", "date_publish": "2020-04-08 18:59:36", "description": "Amazon is halting its third-party shipping service in the United States, which competed with FedEx and UPS, the company said Wednesday.", "filename": "2020_04_08_tech_amazon-third-party-shipping-suspended_index_1588611275.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408135003-amazon-truck-residential-street-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_tech_amazon-third-party-shipping-suspended_index_1588611275.html", "title": "Amazon halts its shipping service that competed with UPS and FedEx", "title_page": "Amazon halts its shipping service that competed with UPS and FedEx - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Amazon is halting its third-party shipping service in the United States, which competed with FedEx and UPS, the company said Wednesday.\nAmazon AMZN The service, called Amazon Shipping, was being piloted in a handful of US cities. Amazon would pick up and deliver shipments for third party companies that sell on its site but don't keep products atwarehouses.\nThe company said it paused the service after a regular review meant to ensure that the company is best serving its customers.\nThe pause comes amid a huge surge in business for Amazon, and online shopping more broadly, as people are urged to stay home and shops remain shuttered because of coronavirus . Last month, Amazon announced it would hire 100,000 new distribution workers to keep up with the demand. It also warned customers they could see longer-than-usual delivery times because of the large volume of orders.\nAmazon also said it would limit shipments of non-essential goods coming into its warehouses to make room for crucial household and medical products.\nRead More", "url": "https://www.cnn.com/2020/04/08/tech/amazon-third-party-shipping-suspended/index.html"}