{"authors": ["Holly Yan", "Steve Almasy", "Madeline Holcombe", "Omar Jimenez"], "date_download": "2020-05-04 16:55:50", "date_modify": "2020-05-04 16:55:50", "date_publish": "2020-04-08 07:59:00", "description": "Even though Wednesday was another day that brought a record number of deaths reported from coronavirus in the United States, there was a glimmer of hope as models now have less dire forecasts for the total number of fatalities the country will see by the time the pandemic subsides.", "filename": "2020_04_08_health_us-coronavirus-wednesday_index_1588611350.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408013302-us-coronavirus-wednesday-0407-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_health_us-coronavirus-wednesday_index_1588611350.html", "title": "US coronavirus deaths pass 14,000, but future projections are better than expected", "title_page": "US coronavirus deaths pass 14,000, but future projections are better than expected - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Even though Wednesday was another day that brought a record number of deaths reported from coronavirus in the United States, there was a glimmer of hope as models now have less dire forecasts for the total number of fatalities the country will see by the time the pandemic subsides.\nMore than 431,000 people in the US have been infected, and more than 14,700 have died\nA record 1,858 deaths were reported in just one day Tuesday, according to Johns Hopkins. On Wednesday there were 1,922 more.\nNew York Gov. Andrew Cuomo told reporters Wednesday that there were 779 coronavirus-related deaths across the state Tuesday. It was the highest number of deaths reported in one day by New York officials.\nResearchers say the peak has yet to come. The US will reach its highest daily number of deaths on or around Sunday, according to modeling by the Institute for Health Metrics and Evaluation at the University of Washington in Seattle.\nThe projections also suggest the US will reach its peak use of resources -- such as hospital beds and ventilators -- on or around Saturday.\nBut there's a bit of good news: The modeling shows fewer people will die from coronavirus than previously predicted.\nOn Tuesday, the IHME estimated about 82,000 people will die from coronavirus disease by August. On Wednesday, that estimate was lowered to 60,415.\nWhite House coronavirus response coordinator Dr. Deborah Birx said at a White House news conference that models are based on what Americans are doing\n\"What has been so remarkable, I think, to those of us that have been in the science field for so long,\" Birx said, \"is how important behavioral change is, and how amazing Americans are at adapting to and following through on these behavioral changes.\"\n\"That's what's changing the rate of new cases, and that's what will change the rate of mortality going forward,\" she said.\nCuomo said it was a bit of good news/bad news.\n\"Our actions have been better than the statisticians believed. So, we can flatten the curve. We are flattening the curve,\" he told CNN. \"We have to maintain it, but the human cost here, the human toll, the suffering, is just incredible. It's just incredible.\"\nThe five-day moving average of new cases in the US, which had trended down for one day, according to Johns Hopkins, went back up Wednesday.\nDeaths could be higher than reported, CDC says\nMany families are grieving for loved ones who often die alone in hospitals\nAnd the actual number of deaths could be higher than we know.\nSome deaths due to Covid-19 \" may be misclassified as pneumonia deaths in the absence of positive test results,\" the Centers for Disease Control and Prevention said.\nThe virus has claimed victims from virtually all demographics, including the young and healthy . But data shows black people are dying from Covid-19 at a disproportionately high rate.\nWhile there have been signs that the number of cases in New York and some other hotspots are leveling off, officials are concerned about other cities.\nOn a conference call with House Democrats, Birx said the Philadelphia and District of Columbia areas are expected to be the new hot spots, according to a source on the call. She said that they also are carefully watching the Houston area, one of the most populous regions in the country.\nLarge outbreak at jail in Chicago\nMore than 400 people linked to one detention facility in Chicago have tested positive for Covid-19, officials said, making the Cook County Jail the largest known source of coronavirus infections in the United States outside of health care facilities.\nThe Cook County Sheriff's office said 251 detainees and 150 staff members have tested positive. Of the detainees sickened in the outbreak, 22 are hospitalized for treatment and 31 others were moved to a recovery facility.\nOne detainee died of apparent complications of Covid-19, sheriff's officials said, but results of an autopsy are not back yet. The jail has created a quarantine area to keep detainees who are infected from the others at the jail.\nThe jail complex houses about 4,700 detainees, according to the sheriff's office. Jail officials have previously said they planned to release nonviolent pretrial defendants who do not have the virus.\nMillions of Americans are suddenly unemployed\nJUST WATCHED With massive layoffs, food banks are overwhelmed by demand Replay More Videos ... MUST WATCH With massive layoffs, food banks are overwhelmed by demand 03:02\nMore than 9.9 million US workers have filed for their first week of unemployment benefits as coronavirus cripples the economy.\nIn New York, the state with the most cases and deaths, officials estimate a loss of $10 billion to $15 billion in revenue. Cuomo announced those who have filed unemployment claims will receive an additional $600 a week to try to make ends meet.\nTennessee has seen a \"record spike\" in unemployment claims of more than 250,000 in the last three weeks, Gov. Bill Lee said. Louisiana had 277,000 applications between March 1 and April 4, according to Gov. John Bel Edwards.\nIn Oklahoma, about 135,000 residents filed for unemployment, the Oklahoma Employment Security Commission said.\nIn West Virginia, Gov. Jim Justice said an additional $600 would be distributed to those who lost their jobs.\nSouth Carolina Gov. Henry McMaster signed an executive order that allows furloughed employees to receive Covid-19 support payments from their employers to still qualify for unemployment benefits, his office said.\nThe next weekly report on unemployment claims nationwide will be revealed Thursday.\nBlood plasma treatment and vaccine trials move forward\nVaccines typically take years before they're publicly available, but officials are racing to develop one for Covid-19 as quickly as possible.\nDr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases, said it might be possible to have a coronavirus vaccine in 12 to 18 months, but some experts say that timeline is risky\nOne vaccine trial administered its first dose last month , and now another vaccine trial has started.\nBiotechnology company Inovio started a Phase 1 clinical trial this week and estimates that will be finished late this summer, a spokesperson for Inovio told CNN.\n\"We anticipate rapid enrollment of this initial study,\" said Dr. Pablo Tebas, an infectious disease specialist at the Hospital of the University of Pennsylvania and the study's principal investigator.\n\"There has been tremendous interest in this vaccine among people who want to do what they can do to help protect the greater public from this pandemic as soon as possible.\"\nA source who was on the call with House Democrats told CNN that officials committed to making all vaccines and tests for the disease available to everyone, including those who cannot afford it.\nIn the meantime, the US Food and Drug Administration expedited the use of blood plasma treatment for seriously ill patients last month.\nThis week, Jason Garcia -- a man who recovered from coronavirus -- was told his plasma donation has been distributed so the antibodies he developed can help another patient do the same.\nGarcia said doctors told him a patient had since improved.", "url": "https://www.cnn.com/2020/04/08/health/us-coronavirus-wednesday/index.html"}