{"authors": ["Chauncey Alcorn Cnn Business"], "date_download": "2020-05-04 16:16:40", "date_modify": "2020-05-04 16:16:40", "date_publish": "2020-04-02 20:20:53", "description": "The novel coronavirus has already dealt an unprecedented economic blow to a large portion of American workers, with a record 9.9 million people filing for unemployment over a two-week span from March 16 to March 29.", "filename": "2020_04_02_business_coronavirus-racial-gap_index_1588609000.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402131027-bushwick-new-york-0402-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_business_coronavirus-racial-gap_index_1588609000.html", "title": "Why the coronavirus crisis will expand America's racial wealth gap", "title_page": "Why the coronavirus crisis will expand America's racial wealth gap - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York City (CNN Business) The novel coronavirus has already dealt an unprecedented economic blow to a large portion of American workers, with a record 9.9 million people filing for unemployment over a two-week span from March 16 to March 29.\nThe full scope of the damage remains unclear, but researchers and labor force leaders say the financial pain caused by the crisis probably won't be evenly distributed along racial lines.\nThe economic fallout from business closings and job losses is expected to have a greater impact on black and Latino employees, who make up a disproportionate percentage of occupational sectors experiencing the income disruption amid the pandemic.\n\"When white America catches a cold, black America catches pneumonia,\" Steven Brown, a research associate at the Urban Institute domestic policy research organization, told CNN Business.\nRoyal Street in New Orleans' French Quarter is empty after Louisiana's Stay at Home mandate.\nGovernment data shows the outbreak is more concentrated in major US metropolitan areas like New York City, New Orleans and the nation's southeast where greater percentages of black and Latino Americans live. In New York City, the virus is disproportionatelyaffecting lower-income neighborhoods in Queens, Harlem and the Bronx, which have denser populations of immigrants of color, African Americans and Hispanics.\nBlacks, Latinos, and Native Americans also tend to have more underlying health conditions, like asthma, than whites, which USA Today says makes them more likely to suffer from serious health effects from the coronavirus.\nThose health effects could mean more hospital visits and more medical debt at a time when many are losing their jobs and health benefits.\nChuck Collins, director of the Institute for Policy Studies' \"Inequality and the Common Good\" program, says America's already enormous racial wealth disparity is likely to grow \"unless we pursue a very different set of interventions and stimulus,\" than those put in place in response to the Great Recession of 2008.\nThe average black household had a net worth of $140,000 in 2016, while the average white household's net worth that same year was $901,000, according to a Survey of Consumer Finances study cited by the Federal Reserve . Most of that white wealth was concentrated among the top 1% of American earners.\nA person wears a protective masks while walking past street art in the Bushwick neighborhood of Brooklyn on April 2, 2020 in New York City.\nEconomists from the Corporation for Enterprise Development and Institute for Policy Studies predicted that black families wouldn't earn the same wealth held by white families in 2016 until the year 2241, when white families would have even greater wealth.\nLatinos would match the earnings of whites in 2016 by 2097, researchers concluded.\nCollins said the $2 trillion authorized by Congress is a good start to getting Americans back on their feet, but much more needs to be done.\n\"Nobody's going to talk about [how we're] paying for this anytime soon. When and if they do, there's going to be a huge fight over who's going to carry the load here,\" he said. \"If we did income support right so people didn't have to go to work ... then people aren't going into debt. That could help close the racial wealth divide.\"\nBrown agrees that the current crisis is likely to widen America's racial wealth disparity. The 2008 financial crisis actually hurt white Americans more economically than blacks and Latinos, contrary to popular belief, and ironically narrowed the racial wealth gap, at least temporarily.\nIt's true that the unemployment rate for black Americans peaked at 16.8% in 2010, more than twice that of white Americans. But Brown points out that although African Americans owned a disproportionate number of the homes foreclosed on by banks nearly 12 years ago, white Americans owned a greater share of the retirement and business investments that were decimated when the stock market crashed.\n\"Black families also lost wealth, but they had less to lose,\" Brown told CNN Business.\nCollins agrees that white families lost more in the stock market in 2008, but says they were able to recover much of those losses in the following two years.\n\"White wealth rebounded very quickly,\" he said. \"It was more diversified and wasn't just in real estate.\"\nThe Great Recession did significant damage to Americans families' assets, but Brown said so far the coronavirus is having a greater affect on Americans' ability to pay their day-to-day bills.\n\"The thing to keep an eye on is debt,\" Brown said. \"Black and brown families are more likely to have no savings or net worth at all. ... If they lost their job, going check-to-check even two weeks can mean some credit card bills or utilities don't get paid.\n\"It's going to be a lot harder for people to dig out once things get stable again,\" he added.\nCorrection: An earlier version of this story misstated which group owned a disproportionate number of homes foreclosed on by banks during the Great Recession.", "url": "https://www.cnn.com/2020/04/02/business/coronavirus-racial-gap/index.html"}