{"authors": ["Ryan J. Foley"], "date_download": "2020-05-04 20:28:57", "date_modify": "2020-05-04 20:28:57", "date_publish": "2020-04-13 13:05:49", "description": "IOWA CITY, Iowa (AP) — A plan to create a model to forecast the coronavirus pandemic in Iowa could take weeks to complete and even then might not guide the state's decision-making, a top health...", "filename": "_0bdaf0488aac18ff2c5e667d0a182b94_1588624137.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c73135ab806e4f7e9b7b3cb1b619f49f/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0bdaf0488aac18ff2c5e667d0a182b94_1588624137.html", "title": "COVID-19 forecast for Iowa could still be weeks away", "title_page": "COVID-19 forecast for Iowa could still be weeks away", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Deputy Director of the Iowa Department of Public Health Sarah Reisetter speaks to the press during a daily coronavirus briefing, Wednesday, April 8, 2020, at the State Emergency Operations Center in Johnston, Iowa. (Kelsey Kremer/The Des Moines Register via AP, Pool)\nDeputy Director of the Iowa Department of Public Health Sarah Reisetter speaks to the press during a daily coronavirus briefing, Wednesday, April 8, 2020, at the State Emergency Operations Center in Johnston, Iowa. (Kelsey Kremer/The Des Moines Register via AP, Pool)\nIOWA CITY, Iowa (AP) — A plan to create a model to forecast the coronavirus pandemic in Iowa could take weeks to complete and even then might not guide the state’s decision-making, a top health official said Monday.\nIowa Department of Public Health deputy director Sarah Reisetter said her agency has yet to share its data on COVID-19 patients with the university hired to create a model but plans to do so soon.\nA contract first reported by The Associated Press calls for the University of Iowa College of Public Health to create a model within two weeks of receiving the state’s data, or on another mutually agreed upon schedule. The contract wasn’t finalized until April 7, a month after Iowa’s first coronavirus cases were confirmed.\nReisetter said her agency needed to provide a “sufficient baseline of data” for any model to be informative. She noted previously that making projections could be difficult given the limited amount of coronavirus testing in Iowa to date.\nReisetter said having forecasts may be helpful as the pandemic continues, but that the state intends to keep determining mitigation strategies “based on what’s actually happening here,” looking at existing infections, hospitalizations and deaths.\nThe contract calls for a model that will predict the number, severity and timing of future infections, hospitalizations and deaths. The model would be modified to predict how shifts in strategies, such as a stay-at-home order, might change public health outcomes.\nThe contract says the model is intended for use by the department “internally with other state agencies to respond to the COVID-19 pandemic.” It bars the university from publishing any findings before April 2021 unless approved by the state epidemiologist.\nGov. Kim Reynolds said any projections would eventually be released to the public, but noted that some national models have fluctuated wildly and that they are all based on assumptions that can be flawed.\nThe number of cases is expected to peak later this month, and it’s unclear whether any Iowa-specific model will be completed before then.\nInstead of basing decisions on estimates of how the virus might spread, Iowa officials have responded to the outbreak largely by tracking outcomes. They also track data on which hospitals have enough beds and ventilators to treat patients.\nThe governor has argued that the data supports her refusal to issue a stay-at-home order since she closed schools and some businesses nearly a month ago. Critics say Iowa’s metrics are arbitrary and backward-looking.\nOn Monday, Iowa reported 1,710 infections tied to the pandemic, with a majority of the 43 deaths coming from outbreaks at nursing homes.\nThe death toll at the state’s worst, at Heritage Specialty Care in Cedar Rapids, has risen to 17 and a second outbreak at a nursing home in Marion has killed two residents, Linn County announced.\nTwo meatpacking plants in rural coronavirus hot spots — Iowa Premium in Tama and Tyson Foods in Columbus Junction — said they would suspend production this week after several workers tested positive.\nReynolds dismissed any suggestion that the modeling work should have started earlier. She said the university has been a “great partner” during the pandemic and that talks began before the contract was signed.\nFirst, college experts were to examine existing models, such as a widely cited one from the University of Washington. An analysis of those models was due in recent days.\nThe University of Washington updated its forecast for Iowa on Monday, pushing back the state’s peak to May 5 but lowering the death toll to 618 residents by August. Iowa officials have criticized that model, which has changed drastically at times, for not fully crediting the mitigation strategies the governor ordered.\nUniversity of Iowa College of Public Health spokesman Daniel McMillan said in an email last week that the project was just getting underway and that scientists were busy “given the urgency of the work they’re doing.” The college won’t be paid under the contract but will get the department’s data for free.", "url": "https://apnews.com/0bdaf0488aac18ff2c5e667d0a182b94"}