{"authors": ["Kevin Mcgill", "Melinda Deslatte"], "date_download": "2020-05-04 20:24:41", "date_modify": "2020-05-04 20:24:41", "date_publish": "2020-04-20 16:22:39", "description": "NEW ORLEANS (AP) — Political debates on how soon to begin reopening businesses while fighting the spread of coronavirus are heating up in Louisiana, where the number of known cases and deaths grew...", "filename": "_8596a4fa02d8f855e64e195ae1d689a9_1588623881.html", "image_url": "https://storage.googleapis.com/afs-prod/media/4f614ff9e31b42b086f28b1c9644a404/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8596a4fa02d8f855e64e195ae1d689a9_1588623881.html", "title": "As COVID-19 hospitalizations taper, more procedures allowed", "title_page": "As COVID-19 hospitalizations taper, more procedures allowed ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Louisiana Gov. John Bel Edwards wears a face mask as he visits a production site on the LSU campus in Baton Rouge, La., where the school is manufacturing personal protection equipment for hospitals in response to the coronavirus pandemic Friday, April 17, 2020. (AP Photo/Gerald Herbert)\nLouisiana Gov. John Bel Edwards wears a face mask as he visits a production site on the LSU campus in Baton Rouge, La., where the school is manufacturing personal protection equipment for hospitals in response to the coronavirus pandemic Friday, April 17, 2020. (AP Photo/Gerald Herbert)\nNEW ORLEANS (AP) — Political debates on how soon to begin reopening businesses while fighting the spread of coronavirus are heating up in Louisiana, where the number of known cases and deaths grew Monday, even as hospitalizations remained well below an April 13 peak.\nAt least one restriction is being eased. Gov. John Bel Edwards said Monday that prohibitions on some “time-sensitive” elective surgery and other nonemergency procedures will be lifted effective April 27.\nDr. Jimmy Guidry, the state health officer, said the new guidelines are not all-encompassing.\n“Anything that can continue to be postponed without putting the patient at risk, should also be postponed,” Guidry said.\nBut Guidry and Edwards said they want to clear the way for procedures — such as thyroid surgery, biopsies or many dental procedures — that need to be done to keep conditions from getting worse. Clinics that resume the procedures will have to adhere to distancing guidelines and have a five-day supply of masks, gowns and other protective equipment.\nThe announcement came hours after the chairman of the state House’s Republican delegation released a letter to the Democratic governor, stressing the need to get the economy reopened.\n“I urge you to begin the process of reopening those businesses, on May 1st, under the phased guidelines provided by the White House,” Rep. Blake Miguez said in the letter.\nEdwards said at his afternoon news conference that the state doesn’t yet meet thresholds — under White House guidelines — to guarantee that phased reopening after his current emergency order expires April 30. The governor said the state needs to have a 14-day window within which there are downward trajectories in numbers of people with COVID-19 symptoms, the number of known cases and the number of hospitalizations.\nHe also said increased testing will be key. He and Dr. Alex Billioux, an assistant state health secretary, said they hope to be able to test 200,000 people a month by May. So far, in Louisiana, the state reports receiving the results of about 141,000 tests.\n“It is my expectation that, several days ahead of May 1, you are going to have me walk you all through what’s going to happen on May the 1st. I’m just not there yet,” Edwards said.\nIn New Orleans, where Mayor LaToya Cantrell has extended her own stay-at-home orders until May 16, a group of business people took out a full-page ad in The Times-Picayune/The New Orleans Advocate to urge a reopening.\n“There is no economy without public health,” Cantrell said at a news conference Monday.\nCantrell said she was creating a committee to weigh in on how to reopen the city’s economy.\nThe Sunday ad had already brought swift push-back from City Council President Helena Moreno, who said Cantrell was basing decisions on data that could save lives.\n“I support her putting life, health and safety of New Orleanians above all else,” Moreno said in a news release.\nIt also stoked an ongoing debate on social media, with some defending the business owners and others accusing them of valuing money over lives.\n“What are you smoking? Read and study! Stop putting $ over people!” state Sen. Karen Carter Peterson, a Democrat, said in a Saturday tweet .\nOn Monday morning, Julie Emerson, a Republican state representative, took to Twitter with her views : “It’s possible to be believe COVID-19 is real &take it very seriously...and also be very concerned about the economy &devastating effects on peoples’ livelihoods...and also feel uneasy about losing a little freedom. Frankly, I think it’s where most people are. Maybe I’m wrong.”\nMiguez urged a parish-by-parish approach to reopening — but Edwards dismissed that idea as unworkable.\nAlso Monday, state corrections officials announced the death of a prisoner at the Louisiana State Penitentiary at Angola and two officials at another state prison. Warden Sandy McCain and medical director Dr. Casey McVea both worked at the Raymond Laborde Correctional Center in Avoyelles Parish. The state says McVea died over the weekend and McCain died Monday. The inmate at Angola — the first state prisoner to die with the disease — was a 69-year-old man serving a life sentence. Officials said he had an underlying health condition and had been hospitalized since April 15 before dying Saturday.\nThe state had more than 24,000 known virus cases Monday, with 1,328 deaths. Hospitalizations, which peaked at 2,134 on April 13, numbered 1,4 Monday.\nFor most people, the new coronavirus causes mild or moderate symptoms that usually clear up within weeks. For some, it can cause severe illness and be life-threatening.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/8596a4fa02d8f855e64e195ae1d689a9"}