{"authors": ["Dave Collins", "Pat Eaton-Robb"], "date_download": "2020-05-04 20:25:29", "date_modify": "2020-05-04 20:25:29", "date_publish": "2020-04-14 13:38:53", "description": "BRIDGEPORT, Conn. (AP) — Connecticut Gov. Ned Lamont took issue Tuesday with President Donald Trump's plans to get the nation's economy restarted by May 1, saying most governors feel that date is...", "filename": "_3e4ccd064c6a89e0907700c5373b56fd_1588623929.html", "image_url": "https://storage.googleapis.com/afs-prod/media/594ec6160831499f8227c85426757d7f/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3e4ccd064c6a89e0907700c5373b56fd_1588623929.html", "title": "Lamont targets May 20 to make decisions about reopening", "title_page": "Lamont targets May 20 to make decisions about reopening ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sgt. Christian Rodriguez operates a drone at Hubbard Park in Meriden, Conn., Tuesday, April 14, 2020. The drone, which has a speaker attached, is being used to remind visitors to practice social distancing and limit their gatherings in public settings during the coronavirus outbreak. (Dave Zajac/Record-Journal via AP)\nSgt. Christian Rodriguez operates a drone at Hubbard Park in Meriden, Conn., Tuesday, April 14, 2020. The drone, which has a speaker attached, is being used to remind visitors to practice social distancing and limit their gatherings in public settings during the coronavirus outbreak. (Dave Zajac/Record-Journal via AP)\nBRIDGEPORT, Conn. (AP) — Connecticut Gov. Ned Lamont took issue Tuesday with President Donald Trump’s plans to get the nation’s economy restarted by May 1, saying most governors feel that date is very premature.\nLamont, a Democrat, said he’s hoping that by May 20 the state will have the testing capacity, protective equipment stockpile and other information needed to make better informed decisions about when people can return to work and school.\nLamont choked up while reporting another 23 deaths related to COVID-19, bringing the total in the state to 671.\n“These are friends and family here in Connecticut and I feel that every day,” he said.\nAnother 1,779 people are currently hospitalized in the state with the coronavirus, and just under 14,000 people have tested positive.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, or death.\nIn other developments related to the outbreak:\nBRIDGEPORT SPIKE\nBridgeport Mayor Joe Ganim said Tuesday that he expects coronavirus cases in the state’s largest city to begin plateauing next week, after nearly two weeks of steady increases.\nFrom Friday to Monday, the city of nearly 150,000 people saw COVID-19 cases increase about 40% to 786 and deaths more than double to 23. The city now has the second-highest number of coronavirus cases in the state after Stamford, which is approaching 1,500 cases. Bridgeport had fewer than 100 cases at the beginning of the month.\nGanim said the increase in cases was expected because of Bridgeport’s proximity to New York City, about 60 miles away.\n“We were inordinately low for a period of time, knowing that we were going to peak,” the Democratic mayor said Tuesday. “We’re still in an upward trajectory. I don’t think there’s anything unusual. ... Somebody commented the numbers have gone up dramatically in Bridgeport, and they have. But they’ve gone up dramatically in all the hard-hit communities.”\nGanim added he has tested negative.\n_____\nPAUSE ON NEW HOSPITAL BEDS\nThe state has hit the pause button on setting up new hospital beds to care for any overflow patients during the expected upcoming surge in COVID-19 patients.\nMore than 1,800 extra beds are in place at sites such as UConn Health, the Connecticut Convention Center and Western Connecticut and Southern Connecticut State universities.\nJosh Geballe, Gov. Ned Lamont’s chief operating officer, said Tuesday the state is cautiously optimistic it will need fewer than the 12,000 beds originally projected for coronavirus patients during the surge, which is expected to hit later this month.\n“We’re not forging ahead with additional surge capacity at this point,” he said. “Even in lower Fairfield County, which has been hardest hit so far, hospitals are managing within their existing capacity and the rate of new admissions has really slowed down in that part of the state.”\nAbout 56% of the state’s 1,500 or so critical care ventilators are currently in use, Geballe said, and an additional 300 are on the way.\nThe state’s surgical mask supply also is in good shape, especially because a new disinfecting machine should be in place by the weekend, he said. That machine can clean about 80,000 N95 masks each day, and those masks can go through the process up to 20 times, he said. The state has received some shipments of protective equipment in recent days and is waiting for more to arrive, Lamont said.\n_____\nCOURT TV\nThe state’s highest courts will begin hearing arguments via video conferencing later this month, as part of the Judicial Branch’s efforts to prevent the spread of the coronavirus.\nThe Supreme Court will begin hearing appeals on video on April 27 and is expected to hear 12 cases over two weeks. The Appellate Court is set to start hearing arguments via video on May 11.\nCourt officials say audio of the hearings will be made available to the public on the Judicial Branch’s website shortly afterward.\n_____\nREST STOP WORRIES\nUnionized workers at two McDonald’s restaurants at rest stops on Interstate 95 in Connecticut say working conditions there have put them at risk of contracting the virus.\nMembers of the Service Employees International Union accuse the fast-food chain of failing to properly clean the stores in Milford and Darien after workers tested positive for the coronavirus.\nRoger Facey and George Michell, who own and operate the two McDonald’s franchise in question, said both plaza restaurants underwent a thorough sanitization procedure and workers who had come into contact with the infected employees were immediately notified.\nState Department of Transportation spokesman Judd Everhart said officials understand the union’s concerns but are grateful to the operator of the service plazas and the tenants for making every effort to keep employees safe and healthy.\n_____\nSHIELD MAKING\nA manufacturer of medical components has set up an assembly line inside New Britain High School to make face shields for medical workers.\nOKAY Industries worked on the design with Hartford Healthcare.\nIt says volunteers are expected to make about 3,000 shields a day and will send the first 14,000 to Hartford HealthCare facilities, the Hospital for Special Care and first responders in New Britain.\n_____\nDRONES MONITORING PUBLIC\nMeriden police have begun using drones to monitor social distancing at city parks and hiking trails.\nOfficials said officers will not be taking enforcement actions, but rather encouraging people to follow the governor’s orders for social distancing, including a ban on social and recreational gatherings of more than five people.", "url": "https://apnews.com/3e4ccd064c6a89e0907700c5373b56fd"}