{"authors": ["Melinda Deslatte"], "date_download": "2020-05-04 20:16:43", "date_modify": "2020-05-04 20:16:43", "date_publish": "2020-04-15 15:16:44", "description": "BATON ROUGE, La. (AP) — Gov. John Bel Edwards on Wednesday signed an order keeping K-12 public schools shuttered through the remainder of the academic year because of the coronavirus, but few...", "filename": "_e09a5275e82767a3fc5a87808b57ba7b_1588623403.html", "image_url": "https://storage.googleapis.com/afs-prod/media/98f4749226b04a369a283809f61f6e00/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e09a5275e82767a3fc5a87808b57ba7b_1588623403.html", "title": "Louisiana K-12 school closures to continue because of virus", "title_page": "Louisiana K-12 school closures to continue because of virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Louisiana Gov. John Bel Edwards speaks at a briefing on the state's current situation dealing with the novel coronavirus COVID-19 public health threat, Tuesday, April 14, 2020 at the Governor's Office of Homeland Security & Emergency Management in Baton Rouge, La. (Travis Spradling/The Advocate via AP, Pool)\nLouisiana Gov. John Bel Edwards speaks at a briefing on the state's current situation dealing with the novel coronavirus COVID-19 public health threat, Tuesday, April 14, 2020 at the Governor's Office of Homeland Security & Emergency Management in Baton Rouge, La. (Travis Spradling/The Advocate via AP, Pool)\nBATON ROUGE, La. (AP) — Gov. John Bel Edwards on Wednesday signed an order keeping K-12 public schools shuttered through the remainder of the academic year because of the coronavirus , but few details have been provided about how districts should judge student performance with classrooms closed for two months of the school year.\nThough the Democratic governor said acting Louisiana Superintendent of Education Beth Scioneaux would provide more guidance Wednesday for school leaders, Scioneaux was short on specifics in her appearance with Edwards. She said local school districts would largely be left on their own to determine student readiness for the next grade and methods of distance learning.\nMeanwhile, in New Orleans, which has 26% of Louisiana’s COVID-19 cases and deaths, Mayor LaToya Cantrell extended her stay-at-home order more than two weeks, until 6 a.m. on May 16 . It had been scheduled to end on April 30.\nEdwards said gathering 700,000 public school students into packed classrooms isn’t safe because of the virus outbreak, with Louisiana among the hardest hit states. The state Board of Elementary and Secondary Education, school superintendents and school board leaders urged Edwards to keep schools closed.\n“This is not the end of learning for this academic year. It’s just the end of students physically going to school campuses,” Edwards said. “I fully expect that instruction and learning will continue.”\nNearly 22,000 people in Louisiana have confirmed infections of the COVID-19 disease , about 9% of whom are hospitalized, according to health department data. The state’s death toll from the virus reached at least 1,103 Wednesday, an increase of 90 deaths from a day earlier. Louisiana has seen encouraging signs in combating the virus, with slowing rates of new infections and new hospitalizations, and fewer patients on ventilators. Edwards credits people remaining physically distanced from others.\nFor most people, the highly contagious coronavirus causes symptoms such as high fever and a dry cough that resolve in several weeks. But some, especially older adults and people with existing health problems, can suffer severe symptoms that can be fatal.\nUnder the latest health department figures, 124 nursing homes in Louisiana have reported people infected with COVID-19, and 275 nursing home residents have died.\nLocal school districts have been using distance learning — and at least half are using some form of online teaching — to keep lessons going since schools closed in mid-March, according to the Board of Elementary and Secondary Education.\nIndividual districts have been left to decide how to teach classes. That’s raised questions about how schools should determine which students pass, fail, advance to the next grade and graduate. Standardized testing, school letter grades and other statewide accountability measures have been scrapped for this school year.\nScioneaux didn’t provide many answers Wednesday, saying her department will “continue to support schools,” reaching out to superintendents and providing districts with resources for creating plans.\n“It is a local decision as to how they go about helping their students,” she said.\nEdwards acknowledged that existing disparities involving rural access to broadband internet and individual household access to computers will impact student learning.\n“I’m worried about what’s happening across the board and just trying to make the very best of what is not an ideal situation, and that is harder to do in certain communities than others,” the governor said.\nThe nonpartisan Council for A Better Louisiana, which advocates on education issues, agreed with the continued school closures. But the organization known as CABL also worried about the implications of losing nine weeks of in-person instruction, particularly for the most at-risk students.\nThe organization wants Edwards to issue an order requiring districts to provide instructional opportunities through the end of the school year; urging state education leaders to offer more support for districts with a lack of online capabilities; and encouraging districts to offer additional instruction in summer months or through extended days next school year.\n“We worry that closing schools for the remainder of the school year could signal to some that it is OK to take their foot off the accelerator or worse decide that further instruction can wait until next year,” CABL wrote in a statement. “The failure to continue current instructional efforts, or boost them in districts that are already experiencing challenges, could have lifelong consequences.”\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/e09a5275e82767a3fc5a87808b57ba7b"}