{"authors": ["Cliff Brunt"], "date_download": "2020-05-04 20:17:51", "date_modify": "2020-05-04 20:17:51", "date_publish": "2020-04-08 00:47:51", "description": "Oklahoma State coach Mike Gundy said Tuesday he hopes to have his team return to its facilities on May 1, a proposed timetable that would defy federal social-distancing guidelines and was quickly...", "filename": "_b4b68c0f8efb1926fdc70fc34b20c61d_1588623471.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b7ca3c24ce604e329d640ccf57ef028a/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b4b68c0f8efb1926fdc70fc34b20c61d_1588623471.html", "title": "Oklahoma State's Gundy targets May 1 return to football", "title_page": "Oklahoma State's Gundy targets May 1 return to football", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Nov. 30, 2019 file photo Oklahoma State head coach Mike Gundy walks on the sidelines during an NCAA college football game against Oklahoma in Stillwater, Okla. Gundy said Tuesday, April 7, 2020 he hopes to have his team return to its facilities on May 1, a proposed timetable that would defy federal social-distancing guidelines and was quickly disputed by the university and its athletic director. (AP Photo/Sue Ogrocki)\nIn this Nov. 30, 2019 file photo Oklahoma State head coach Mike Gundy walks on the sidelines during an NCAA college football game against Oklahoma in Stillwater, Okla. Gundy said Tuesday, April 7, 2020 he hopes to have his team return to its facilities on May 1, a proposed timetable that would defy federal social-distancing guidelines and was quickly disputed by the university and its athletic director. (AP Photo/Sue Ogrocki)\nOklahoma State coach Mike Gundy said Tuesday he hopes to have his team return to its facilities on May 1, a proposed timetable that would defy federal social-distancing guidelines and was quickly disputed by the university and its athletic director.\nThe Centers for Disease Control and Prevention has recommended against gatherings of 50 or more people through May 11 to prevent the spread of the new coronavirus, which as of Tuesday had infected more than 380,000 people in the United States — more than any other country in the world — and killed 81,000 worldwide, including at least 11,000 in the U.S.\nGundy, who has been outspoken about his right-wing politics, also said in a conference call with reporters that the media has been too negative in its coverage of what he called the “Chinese virus.”\nMost Americans are living under stay-at-home orders, many of which extend past May 1, although Oklahoma Gov. Kevin Stitt, a Republican, has only urged people under 65 to stay home while banning gatherings of more than 10 people through April 30.\nGundy said he hopes there will be enough tests available in a few weeks that he could get his assistant coaches and support personnel tested for the virus, followed by the players, so his program can get back to business.\n“I can’t say right now, but that’s the plan,” Gundy said. “We have to have a plan, and the plan right now is for them to start on May 1.”\nLike many Division I football programs, Oklahoma State has more than 100 players on its roster along with a coaching staff of 35 people. The university has canceled in-person classes for the spring semester and moved its May graduation ceremonies to December.\nFollowing Gundy’s comments, OSU issued a statement saying, essentially, that the decision about when to bring the football team back together wouldn’t be up to the coach.\n“We will adhere to the advice of public health experts who are making informed decisions in the best interest of the citizens of our nation and state based on sound scientific data,” the university statement said. “We will also abide by the federal and state mandates as well as Big 12 guidelines. We will not compromise the health and well-being of our campus community. This virus is deadly and we will do our part at Oklahoma State to help blunt the spread.”\nAthletic director Mike Holder also declined to back Gundy’s timeline, saying in a statement: “May 1 seems a little ambitious.”\nGundy said he was interested in hearing more positive news about the COVID-19 pandemic, which has crippled economies and forced restrictions on the movement of people around the world in an effort to stop the virus from spreading further and overwhelming health care systems.\n“I’m seeing total number of cases, but what I’m not seeing is how many number of those cases that are now back to a normal life,” Gundy said, adding: “It’s really interesting to me to see with the mainstream media, sadly enough, just how negative everybody can be. Let’s just report the news. Let’s start putting some things in there that are positive, because I know there’s positive out there.”\nThe NCAA has canceled all spring sports, and there is no date in place for college teams to return to practice. Gundy said if his target date doesn’t work, he’d be willing to push things back — but not too far.\n“It might get backed up two weeks,” Gundy said. “I don’t know, I can’t make that call. But if it does, we’ll start with the employees of this company — the ones that come in this building. Then we’ll bring the players in, and slowly but surely. We test them all in. Is it 100 percent? No, it’s not 100 percent.”\nGundy said he isn’t trying to be insensitive to those who are sick, but he believes things need to get back to normal sooner rather than later. Oklahoma State is scheduled to begin its season on Sept. 3, hosting Oregon State.\n“The curve’s going to flatten so we can get our state back to work,” Gundy said. “So we just continue with our safety measures to give us the best chance to get back to work and get back to a normal daily operation as soon as possible.”\n___\nMore AP college football: https://apnews.com/Collegefootball and https://twitter.com/AP_Top25", "url": "https://apnews.com/b4b68c0f8efb1926fdc70fc34b20c61d"}