{"authors": [], "date_download": "2020-05-04 20:23:26", "date_modify": "2020-05-04 20:23:26", "date_publish": "2020-04-30 03:30:55", "description": "The president erupted at his top advisers when they showed him polling data indicating eroding support in key states due to his bungled coronavirus respo...", "filename": "entry_trump-erupt-campaign-team-poll-numbers_n_5eaa44eec5b633a8544528f4_1588623806.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa459d220000640d827e50.jpeg?cache=vrcmsqtg65&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_trump-erupt-campaign-team-poll-numbers_n_5eaa44eec5b633a8544528f4_1588623806.html", "title": "Trump Erupts At Campaign Team As His Poll Numbers Slide", "title_page": "Trump Erupts At Campaign Team As His Poll Numbers Slide | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "WASHINGTON (AP) — President Donald Trump erupted at his top political advisers last week when they presented him with worrisome polling data that showed his support eroding in a series of battleground states as his response to the coronavirus comes under criticism.\nAs the virus takes its deadly toll and much of the nation's economy remains shuttered, new surveys by the Republican National Committee and Trump's campaign pointed to a harrowing picture for the president as he faces reelection.\nWhile Trump saw some of the best approval ratings of his presidency during the early weeks of the crisis, aides highlighted the growing political cost of the crisis and the unforced errors by Trump in his freewheeling press briefings.\nTrump reacted with defiance, incredulous that he could be losing to someone he viewed as a weak candidate.\n“I am not f—-ing losing to Joe Biden,” he repeated in a series of heated conference calls with his top campaign officials, according to five people with knowledge of the conversations. They spoke on condition of anonymity because they were not authorized to speak publicly about private discussions.\nThe message to the president was sobering: Trump was trailing the former Democratic vice president in many key battleground states, he was told, and would have lost the Electoral College if the election had been held earlier this month.\nOn the line from the White House, Trump snapped at the state of his polling during a series of calls with campaign manager Brad Parscale, who called in from Florida; RNC chair Ronna McDaniel, on the line from her home in Michigan; senior adviser Jared Kushner; and other aides.\nEchoing a number of White House aides and outside advisers, the political team urged Trump to curtail his daily coronavirus briefings, arguing that the combative sessions were costing him in the polls, particularly among seniors. Trump initially pushed back, pointing to high television ratings. But, at least temporarily, he agreed to scale back the briefings after drawing sharp criticism for raising the idea that Americans might get virus protection by injecting disinfectants.\nTrump aides encouraged the president to stay out of medical issues and direct his focus toward more familiar and politically important ground: the economy.\nEven as Trump preaches optimism, the president has expressed frustration and even powerlessness as the dire economic statistics pile up. It's been a whiplash-inducing moment for the president, who just two months ago planned to run for reelection on the strength of an economy that was experiencing unprecedented employment levels. Now, as the records mount in the opposite direction, Trump is feeling the pressure.\n“We built the greatest economy in the world,” Trump has said publicly. “I’ll do it a second time.”\nTrump's political team warned that the president's path to reelection depends on how quickly he can bring about a recovery.\n“I think you’ll see by June a lot of the country should be back to normal, and the hope is that by July the country’s really rocking again,\" Kushner told “Fox & Friends” on Wednesday morning. But other aides, business leaders and economists predict a far longer road toward recovery.\nRepresentatives for the RNC and the Trump campaign did not comment on the polling or last week's phone calls.\nAccording to people familiar with the incident, Trump vented much of his frustration at Parscale, who served as the bearer of bad news.\nTrump has long distrusted negative poll numbers — telling aides for years that his gut was right about the 2016 race, when he insisted that he was ahead in the Midwest and Florida. At the same time, Parscale and other Trump aides are talking up the sophistication of their data and voter outreach capabilities this time.\nThe president and some aides have had simmering frustrations with Parscale for a while, believing the campaign manager — a close Kushner ally — has enriched himself from his association with Trump and sought personal publicity. Trump had previously been angered when Parscale was the subject of magazine profiles. This latest episode flared before the campaign manager was featured in a New York Times Magazine profile this week.\nAides have grown particularly worried about Michigan — which some advisers have all but written off -- as well as Florida, Wisconsin and Arizona.\nTrump announced Wednesday that he will visit Arizona next week — his first trip outside Washington in a month — as he looks to declare that much of the nation is ready to begin reopening after the virus.\nThe president has mocked Biden, his presumptive general election rival, for being \"stuck in his basement\" in his Delaware home during the pandemic.\nTrump said Wednesday that he hopes to soon visit Ohio, a battleground state that Trump carried handily in 2016 but that aides see as growing slightly competitive in recent weeks.\nAides acknowledged that the president's signature rallies would not be returning anytime soon. Some have privately offered doubts that he would be able to hold any in his familiar format of jam-packed arenas before Election Day, Nov. 3.\n___\nLemire reported from New York.", "url": "https://www.huffpost.com/entry/trump-erupt-campaign-team-poll-numbers_n_5eaa44eec5b633a8544528f4"}