{"authors": ["David Shortell"], "date_download": "2020-05-04 16:24:07", "date_modify": "2020-05-04 16:24:07", "date_publish": "2020-04-06 21:38:49", "description": "The ACLU sued the federal Bureau of Prisons on Monday, arguing that efforts to release inmates from a detention center in Oakdale, Louisiana, where five men have died from coronavirus, are moving too slowly.", "filename": "2020_04_06_politics_aclu-prison-deaths-louisiana_index_1588609447.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/150627133851-department-of-justice-logo-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_aclu-prison-deaths-louisiana_index_1588609447.html", "title": "ACLU suing for release of inmates at Louisiana facility where five prisoners have died", "title_page": "ACLU suing for release of inmates at Louisiana facility where five prisoners have died - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The ACLU sued the federal Bureau of Prisons on Monday, arguing that efforts to release inmates from a detention center in Oakdale, Louisiana, where five men have died from coronavirus, are moving too slowly.\nThe low-security prison located 100 miles outside of Baton Rouge has become the epicenter of the viral pandemic in the nation's federal prison system since the first inmate in US custody died there last month. As of Sunday, 22 current inmates had tested positive for the virus -- the most confirmed cases out of all 122 federal prisons.\nThe Bureau of Prisons has taken extreme measures to stem the spread of the virus behind bars, and Attorney General William Barr, who oversees the federal prison system, has singled out Oakdale as a facility where prison leadership should expedite early release programs to protect certain vulnerable inmates. But inmates and officials there say conditions remain unsafe.\nInmates named in the ACLU's class-action lawsuit described having no access to hot water and soap, and a row of six showers shared by 125 people.\nOne inmate, a 35-year-old with \"compromised lungs due to childhood asthma,\" said that he sleeps in a room that holds 72 prisoners in such close proximity that he can touch his neighbors while lying in his own bed.\nRead More", "url": "https://www.cnn.com/2020/04/06/politics/aclu-prison-deaths-louisiana/index.html"}