{"authors": [], "date_download": "2020-05-04 20:19:25", "date_modify": "2020-05-04 20:19:25", "date_publish": "2020-04-16 20:25:35", "description": "PORTLAND, Ore. (AP) — Portland police will partner with other law enforcement agencies to crack down on street racing and stunting after Sunday on the Fremont Bridge. About two dozen...", "filename": "_6ecd71f104e99dce4252eea0951e54de_1588623565.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6ecd71f104e99dce4252eea0951e54de_1588623565.html", "title": "Police partner with other agencies in street race crackdown", "title_page": "Police partner with other agencies in street race crackdown", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Ore. (AP) — Portland police will partner with other law enforcement agencies to crack down on street racing and stunting after Sunday on the Fremont Bridge.\nAbout two dozen officers from the Police Bureau, the Multnomah County Sheriff’s Office, the Oregon State Police and city park rangers will try to curtail illegal street racing this weekend, Capt. Tony Passadore said Thursday. They’ll be assisted by officers filming overhead and by prosecutors from the district attorney’s office, The Oregonian/OregonLive reported .\nStreet racers are taking advantage of both reduced traffic due to the stay-home order amid the coronavirus pandemic and warmer weather, Passadore said.\nOn Sunday, police were called to the Fremont Bridge on reports of dozens of street racers blocking traffic and spinning cars in donuts across the bridge span. By the time officers arrived, the cars had left.\nPolice are continuing to investigate.\nDrivers can face speed racing citations with a $435 fine. They also can face charges of reckless driving or recklessly endangering another.\nAnyone blocking streets or standing in the road and filming can face disorderly conduct charges, Passadore said.\nLast year, police stopped over 290 drivers, charged more than 25 people and towed nearly two dozen cars, according to police.\n“Our goal is to educate people and get them to stop on their own,” the captain said.", "url": "https://apnews.com/6ecd71f104e99dce4252eea0951e54de"}