{"authors": ["Katie Hunt"], "date_download": "2020-05-04 15:59:58", "date_modify": "2020-05-04 15:59:58", "date_publish": "2020-04-01 12:38:12", "description": "Women are more likely to wash their hands, use soap and scrub for a longer period of time than men after using the restroom -- although there is still a surprisingly large portion of both sexes who don't wash their hands at all.", "filename": "2020_04_01_health_handwashing-gender-gap-wellness_index_1588607998.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331173610-02-hand-washing-gender-gap-wellness-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_health_handwashing-gender-gap-wellness_index_1588607998.html", "title": "Men wash their hands much less often than women and that matters more than ever", "title_page": "Men wash their hands much less often than women and that matters more than ever - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Handwashing with soap and warm water for 20 seconds -- along with staying home and standing six feet apart from others -- is the best weapon we have against the novel coronavirus that has infected almost 800,000 people around the world.\nHowever, there's one big yet little discussed difference when it comes to this essential personal hygiene habit: Women are hands down better handwashers than men.\nYears of surveys, observations and research have found that women are more likely to wash their hands, use soap and scrub for a longer period of time than men after using the restroom. However, there's still a surprisingly large portion of both sexes who don't wash their hands at all.\nPeople lie about washing their hands\nResearchers have had to come up with clever ways to collect this data, since most people will tell you that they think handwashing after using the bathroom is important . That's even if they don't actually do it.\nCarl Borchgrevink, director of the School of Hospitality at Michigan State University in East Lansing, takes this kind of survey data with a pinch of salt.\n\"If you're at a restroom at an airport, for example, and when you come out someone [asks] you 'Did you wash your hands?' And what are you going to say? Yes, of course,\" said Borchgrevink.\nWhen researchers only ask about people's handwashing habits, \"we found that the data that people were reporting seemed to be too high,\" he said.\nBorchgrevink tasked 12 research assistants at Michigan State University with the job of surreptitiously hanging out in four different restrooms on and off campus to record what 3,749 men and women actually did. The To dig deeper into what people really do after using the bathroom,Borchgrevink tasked 12 research assistants at Michigan State University with the job of surreptitiously hanging out in four different restrooms on and off campus to record what 3,749 men and women actually did. The results of the 2013 study were shocking to the researchers.\nFew people wash their hands correctly\nSome 15% of men didn't wash their hands at all, compared with 7% of women. When they did wash their hands, only 50% of men used soap, compared with 78% of women.\nOverall, only 5% of people who used the bathroom washed their hands long enough to kill the germs that can cause infections.\nA bigger study published in 2009 that used more high tech methods at a busy highway rest stop in the UK was equally, if not more, damning.\nWith the use of wireless devices to record how many people entered the restroom and used the pumps of the soap dispensers, researchers were able to collect data on almost 200,000 restroom trips over a three-month period.\nThe found that only 31% of men and 65% of women washed their hands with soap.\nIt's a big gap -- clearly twice as many women as men were washing their hands,\" said Susan Michie, health psychology professor and director of the Centre for Behaviour Change at the Department of Clinical, Educational and Health Psychology at University College London.\n\"Another interesting result was that the more people were in the toilet area the more they were likely to wash their hands,\" said Michie, who was an author of the study. \"If there were no people around, people tended to zap out with no one noticing.\"\nThere's little to suggest that men in the UK and US are unsual in their handwashing (or lack thereof).\nhand-washing, mask-wearing and surface cleaning in the context of an epidemic, like flu. review published on the subject in 2016 looked at research from dozens of different countries, and found that women were 50% more likely than men to practice, or increase, protective behavior like properhand-washing, mask-wearing and surface cleaning in the context of an epidemic, like flu.\nWhy is there a gender gap?\nThere's been far less research done on why there is such a gap between the sexes when it comes to hand-washing. Michie said it was likely socially programmed behavior, not genetic.\n\"Women are more focused on care than men -- childcare, household care, personal care,\" she said.\nSimilarly, Borchgrevink said that while his study didn't look at why men didn't wash their hands as much as women, he suggested that it could be down to a sense that men were too macho to fear germs.\n\"We did talk to some of (the men) and ask, 'why didn't wash your hands?'\" Borchgrevink said. \"And they would look at us indignantly and say, 'I'm clean, I don't need to wash my hands.' They had a sense of invincibility.\"\nNancy Tomes, a history professor at Stony Brook University and the author of \"The Gospel of Germs: Men, Women and the Microbe in American Life,\" says the hand-washing gender gap has a long history dating back to when the germ theory of disease took hold in the public consciousness in the Victorian era -- that certain diseases were caused by microorganisms that invaded the body rather than bad air or miasma.\nAn unidentified Red Cross nurse teaches a class on home hygiene and care for the sick to a group of women of various ages, 1920.\n\"This changed the definition of cleanliness,\" she said, and women especially were told their family's health depended on the highest level of hygiene.\n\"Of course, there had been definitions of what was clean and unclean before the germ theory came along, but it injected a level of specificity and also upped the ante. If you made a mistake in your cleanliness, you could die, your family could die.\n\"And that message of, 'make a mistake and your kid will die' resonates like a megaphone in the lives of mothers (even today),\" Tomes said.\nMotivating men to wash their hands\nMichie's research at the highway rest stop in the UK looked at what kind of public health messaging would improve handwashing rates by using a sign that illuminated with different messages as people entered the restroom.\nWhile the findings weren't conclusive, the study suggested that men and women responded to different types of messaging around handwashing. Messages that triggered disgust (\"Soap it off or eat it later\") resonated with men, while women were more motivated to wash by messages that activated knowledge, such as \"Water doesn't kill germs, soap does.\"\nMichie said she wasn't aware of any public health campaigns that had focused their efforts on men in light of their handwashing lapses, but said this was the perfect moment to try.\n\"It's an excellent idea to target men. It could be really helpful. If women knew men weren't doing it, they'd get on to them.\"", "url": "https://www.cnn.com/2020/04/01/health/handwashing-gender-gap-wellness/index.html"}