{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:27:16", "date_modify": "2020-05-04 20:27:16", "date_publish": "2020-04-28 22:17:43", "description": "While the president continues to lie, Dr. Anthony Fauci has stressed that the virus won't just disappear.", "filename": "entry_trump-virus-go-away_n_5ea895f0c5b623c0a97fba63_1588624036.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8a463220000960c827d24.jpeg?cache=sdkoglada8&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_trump-virus-go-away_n_5ea895f0c5b623c0a97fba63_1588624036.html", "title": "Trump Keeps Saying Coronavirus Will Simply 'Go Away' As Death Toll Climbs", "title_page": "Trump Keeps Saying Coronavirus Will Simply 'Go Away' As Death Toll Climbs | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "“It’s going to disappear,” he said of the coronavirus at the time as infection numbers began to trickle in. “One day it’s like a miracle, it will disappear.”\nHe repeated the claim again in March, urging calm as he and his administration continued to downplay the threat.\n“And we’re prepared, and we’re doing a great job with it,” Trump said March 10 on Capitol Hill. “And it will go away. Just stay calm. It will go away.”\nBy that time, there were 1,300 confirmed cases, according to a CBS News timeline.\nAt an April 3 White House briefing, Trump claimed, “I said it was going away, and it is going away,” when there were more than 200,000 confirmed cases.\nThe president can’t simply wish the virus away, and he’d know that if he listened to his own medical professionals. Last month, Dr. Anthony Fauci, who is helping to lead the U.S. response to this crisis, told Congress to buckle up for a long fight.\n“I can say we will see more cases, and things will get worse than they are right now,” Fauci told the House Oversight Committee in March. “How much worse it will get will depend on our ability to do two things: to contain the influx of people who are infected coming from the outside, and the ability to contain and mitigate within our own country.”\nThe president’s own proposals for combating the coronavirus are, at best, deeply misinformed and, at worst, dangerous to the health of Americans. He has suggested ingesting disinfectant as a potential cure (it’s not; don’t try it) and put his faith in the sun to solve this problem.\n“Looks like in April, you know in theory when it gets a little warmer it miraculously goes away,” Trump falsely claimed at a campaign rally in February. The comments prompted the National Academy of Sciences to send the White House a letter telling Trump that statement was wrong.\nBut the letter didn’t seem to convince him. Trump later suggested using UV light to kill the virus.\n“Supposing we hit the body with a tremendous force, whether it’s ultraviolet or just very powerful light,” he said earlier this month.\nThe absurd claim led the World Health Organization to remind the public that sunlight won’t make people invulnerable to the virus.\n“You can catch COVID-19, no matter how sunny or hot the weather is,” WHO said. “Countries with hot weather have reported cases of COVID-19.”\nThe president isn’t alone in wishing the virus would just go away ― we all do ― but to defeat this virus, he’ll need to stop hoping that wishes alone are all it takes.", "url": "https://www.huffpost.com/entry/trump-virus-go-away_n_5ea895f0c5b623c0a97fba63"}