{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:18:58", "date_modify": "2020-05-04 20:18:58", "date_publish": "2020-04-16 10:24:05", "description": "Your daily look at late-breaking news and stories that are being talked about: 1. COURT HEARING ON DISPUTED KEYSTONE XL PIPELINE — Native American tribes and environmental groups pressured a...", "filename": "_68958764717375632ebe641408cc71d6_1588623538.html", "image_url": "https://storage.googleapis.com/afs-prod/media/a0113f9c44ee4dc18f8273c23ae92027/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_68958764717375632ebe641408cc71d6_1588623538.html", "title": "5 things to know today", "title_page": "5 things to know today - that aren't about the virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "5 things to know today - that aren’t about the virus\nFILE - In this March. 1, 2020 file photo, people walk next to election campaign billboards showing Israeli Prime Minister Benjamin Netanyahu, right, and Benny Gantz, left, in Bnei Brak, Israel. Israel’s president on Sunday, April 12, 2020, turned down a request from Blue and White party leader Benny Gantz for a two-week extension to form a new coalition government. The announcement means that Gantz and Netanyahu have a midnight deadline on Monday night to reach a power-sharing deal. If they fail, the country could be forced into a fourth consecutive election in just over a year. (AP Photo/Oded Balilty, File)\nFILE - In this March. 1, 2020 file photo, people walk next to election campaign billboards showing Israeli Prime Minister Benjamin Netanyahu, right, and Benny Gantz, left, in Bnei Brak, Israel. Israel’s president on Sunday, April 12, 2020, turned down a request from Blue and White party leader Benny Gantz for a two-week extension to form a new coalition government. The announcement means that Gantz and Netanyahu have a midnight deadline on Monday night to reach a power-sharing deal. If they fail, the country could be forced into a fourth consecutive election in just over a year. (AP Photo/Oded Balilty, File)\nYour daily look at late-breaking news and stories that are being talked about:\n1. COURT HEARING ON DISPUTED KEYSTONE XL PIPELINE — Native American tribes and environmental groups pressured a federal judge to shut down work on the Keystone XL pipeline from Canada to Nebraska.\n2. ISRAELI PRESIDENT ASKS PARLIAMENT TO CHOOSE PRIME MINISTER — Israel’s president asks the Knesset to choose a new prime minister, giving parliament three weeks to agree upon a leader or plunge the country into an unprecedented fourth consecutive election.\n3. ACTOR BRIAN DENNEHY DIES AT 81 – Brian Dennehy, who starred in films as a macho heavy and later in his career won plaudits for his stage work in plays by Shakespeare, Chekhov, O’Neill and Arthur Miller, has died at age 81.\n4. CACTUS EAGLES NEST - For the first time in decades, bald eagles have been found nesting in an Arizona saguaro cactus.\n5. JORDAN’S LAST SEASON - Michael Jordan describes his final NBA championship season with the Chicago Bulls as a “trying year.”", "url": "https://apnews.com/68958764717375632ebe641408cc71d6"}