{"authors": ["Eliza Mackintosh"], "date_download": "2020-05-04 15:59:33", "date_modify": "2020-05-04 15:59:33", "date_publish": "2020-04-01 11:15:34", "description": "President Donald Trump has warned of a \"very, very painful two weeks\" ahead, finally leveling with the American people about the desperate reality of the pandemic, and urging the country to prepare for loss of life at a magnitude unimaginable outside of wartime.", "filename": "2020_04_01_world_coronavirus-newsletter-04-01-20-intl_index_1588607973.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_world_coronavirus-newsletter-04-01-20-intl_index_1588607973.html", "title": "What you need to know about coronavirus on Wednesday, April 1", "title_page": "What you need to know about coronavirus on Wednesday, April 1 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story appeared in the April 1 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every weekday\n(CNN) President Donald Trump has warned of a \"very, very painful two weeks\" ahead, finally leveling with the American people about the desperate reality of the pandemic, and urging the country to prepare for loss of life at a magnitude unimaginable outside of wartime.\nThe President's grave warning was delivered against a backdrop of virus models that paint an alarming picture of between 100,000 and 240,000 potential deaths -- despite social distancing measures. Trump's marathon two-hour briefing mostly lacked the elements of self-congratulation and false hope that have characterized his heavily criticized leadership in the crisis, Stephen Collinson writes\nThe President largely ceded the stage to his chief experts, armed with slides showing the rocketing rise of cases in New York and New Jersey. In a sign of the magnitude of the crisis, one of the more hopeful moments was a reference to Italy's downward curve in infections after weeks of agony.\nYOU ASKED. WE ANSWERED\nQ: Should I be wearing a mask right now?", "url": "https://www.cnn.com/2020/04/01/world/coronavirus-newsletter-04-01-20-intl/index.html"}