{"authors": ["Kylie Atwood", "Zachary Cohen", "Nicole Gaouette", "Jennifer Hansler"], "date_download": "2020-05-04 16:07:28", "date_modify": "2020-05-04 16:07:28", "date_publish": "2020-04-02 02:19:54", "description": "The Trump administration will no longer ship personal protective equipment to allies overseas as the United States grapples with critical shortages of supplies and coronavirus cases continue to soar.", "filename": "2020_04_01_politics_pence-task-force-ppe-freeze_index_1588608448.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330095344-08-new-york-medical-supplies-0328-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_pence-task-force-ppe-freeze_index_1588608448.html", "title": "US freezes shipments of protective gear overseas", "title_page": "US freezes shipments of protective gear overseas - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Trump administration will no longer ship personal protective equipment to allies overseas as the United States grapples with critical shortages of supplies and coronavirus cases continue to soar.\nA congressional source told CNN on Wednesday that they were informed late last Friday night that the coronavirus task force -- led by Vice President Mike Pence -- was stopping overseas shipments of the medical equipment and instead asking that the supplies be distributed within the United States.\nAsked about reports of the freeze on Wednesday, President Donald Trump said there was \"no truth whatsoever\" to them. However, minutes later, he noted that \"whatever we have, whatever we've committed to, we commit,\" but added that \"we also need a lot for ourselves.\"\n\"Obviously, we're not going to be shipping too much,\" he said during a White House briefing.\nPolitico was the first to report on the freeze. CNN has reached out to the US Agency for International Development for comment.\nRead More", "url": "https://www.cnn.com/2020/04/01/politics/pence-task-force-ppe-freeze/index.html"}