{"authors": ["Huffpost Staff"], "date_download": "2020-05-04 20:20:35", "date_modify": "2020-05-04 20:20:35", "date_publish": "2020-04-29 14:17:14", "description": "Stay up to date as we cover the ongoing COVID-19 pandemic and its effects across the world.", "filename": "entry_covid-19-worldwide-news_n_5ea98230c5b6fb98a2b5ea75_1588623635.html", "image_url": "https://img.huffingtonpost.com/asset/5ea982f730000027111551f8.jpeg?cache=5kvs521lle&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_covid-19-worldwide-news_n_5ea98230c5b6fb98a2b5ea75_1588623635.html", "title": "Coronavirus Live Updates: Read The Latest About The COVID-19 Outbreak", "title_page": "Coronavirus Live Updates: Read The Latest About The COVID-19 Outbreak | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "He added, however, that New Yorkers should continue to wear masks in public places and follow social distancing guidelines.“How can you not wear a mask? To me it’s disrespectful ... to the frontline workers,” Cuomo said. “Just be responsible.”\n— Hayley Miller\nBirx Calls Anti-Lockdown Protest in Michigan ‘Devastatingly Worrisome’ — 5/3/20, 1:15 p.m. ET\nDr. Deborah Birx, a leading infectious disease expert on the White House’s coronavirus task force, described a recent protest of Michigan’s stay-at-home order as “devastatingly worrisome” after video of the event showed participants flouting social distancing guidelines.\nOn “Fox News Sunday,” host Chris Wallace asked Birx to weigh in on from a public health perspective the hundreds of protesters who did not wear masks as they crammed inside Michigan’s state capitol building on Thursday.\n“It’s devastatingly worrisome to me personally,” Birx said, “because if they go home and infect their grandmother or their grandfather who has a comorbid condition and they have a serious or an unfortunate outcome, they will feel guilty for the rest of our lives.”\n“We need to protect each other at the same time we’re voicing our discontent,” she added.\n— Hayley Miller\nWhite House Blocks Anthony Fauci From Testifying Next Week — 5/1/20, 7:30 p.m. ET\nThe White House is blocking Dr. Anthony Fauci from testifying before a House panel next week on the U.S. response to the coronavirus pandemic. Fauci, a leading infectious disease expert, is a prominent part of the White House’s coronavirus task force.\nA White House spokesman said in a statement that it would be “counterproductive” to have people who are involved in “safely opening up America again and expediting vaccine development” appear at congressional hearings. “We are committed to working with Congress to offer testimony at the appropriate time,” added White House spokesman Judd Deere.\nThe Trump administration has been criticized for its response to the COVID-19 pandemic. The U.S. leads the world in coronavirus cases, with more than 1 million confirmed cases as of Friday. Fauci, who is the director of the National Institute of Allergy and Infectious Diseases, has used the platform of the White House coronavirus briefings to repeatedly urge the American public to abide by social distancing guidelines, warning about a possible increase in cases if they don’t.\n— Sarah Ruiz-Grossman\nNorthern California County Reopens Businesses Against Governor’s Order — 5/1/20, 1:45 p.m. ET\nA small rural county in California near the Oregon border on Friday allowed businesses to reopen, including restaurants, despite the state’s existing stay-at-home order disallowing such reopenings during the pandemic.\nModoc County, which is home to about 9,000 residents, has had no confirmed COVID-19 cases so far, a local official told the Associated Press.\nCalifornia as a whole has reported more than 48,000 coronavirus cases and nearly 2,000 deaths as of Thursday.\nAs other states across the country, including Texas and Georgia, have begun to reopen some businesses despite warnings from public health experts that this could lead to a possible spike in cases, California’s governor has stood firm in calling for people to stay home.\nOn Thursday, Gov. Gavin Newsom (D) closed all beaches in Orange County after large crowds over the weekend “raised alarm bells” about people’s willingness to comply with social distancing guidelines, he said.\n— Sarah Ruiz-Grossman\nAmazon, Walmart, Target, Instacart Workers To Strike Friday Over Safety Concerns — 5/1/20, 9:00 a.m. ET\nA huge coalition of workers from several major U.S. companies are planning a general strike Friday to demand hazard pay and greater safety precautions as the deadly coronavirus continues to spread throughout the country.\nEmployees at Amazon, Instacart, Whole Foods, Walmart, Target, Shipt and FedEx are planning to participate. They will either call in sick or walk off the job during their lunch breaks, according to The Intercept.\nIn the current crisis, people who work in delivery and fulfillment centers have become essential employees for millions of Americans working and studying at home. Although the companies have initiated some new safety policies, many workers believe they could be doing more, particularly as profits appear to be surging. People who work these typically low-paid positions at Amazon, Whole Foods, Target and other companies are demanding hazard pay of an additional $5 per order, according to a press release about the strikes.\nWorkers are also demanding expanded access to personal protective equipment and the ability to stay home if they feel sick.\nAmazon has been particularly opaque about the impact of COVID-19 among its workforce, going so far as to fire an employee back in March for staging a walkout in protest of its lax safety policies. It remains unclear how many Amazon workers have contracted or died of the disease, but a group of employees in Indiana estimates that the number of cases is at least 500 across more than 135 buildings.\n— Sara Boboltz\n1 Million People Worldwide Have Recovered From Virus — 5/1/2020, 5:30 a.m. ET\nCountries around the world have reported 1,022,447 recoveries from COVID-19, Johns Hopkins data showed Friday. There have been more than 3.2 million total cases worldwide, with over 233,000 deaths. The U.S. has the highest number of recoveries — 153,947 — but also the highest number of deaths — 63,019.\nThe recovery milestone comes as some U.S. states and countries around the world take steps to reopen businesses and loosen lockdown measures, even though the pandemic is far from over.\n— Liza Hearon\nPoll Suggests Black And Latino New Yorkers More Likely To Know Someone Who Died Of COVID-19 — 4/30/20, 5:20 p.m. ET\nWe know that Black and Latino communities across the country have been hit particularly hard by the coronavirus crisis, but a new poll out of Siena College has helped quantify the impact in New York state.\nAsked whether they personally knew somebody who had died of the virus, 25% of white respondents said they did, compared to 48% of Black respondents and 52% of Latino respondents. The pollsters surveyed 803 registered voters across the state that’s been hit hardest by COVID-19, the disease caused by the coronavirus.The gap was not so wide, however, when respondents were asked whether they knew somebody who had merely tested positive for the virus; 49% of white respondents said they had, compared to 53% of Black respondents and 62% of Latino respondents. Overall, a slim majority — 51% of all respondents — said they personally knew somebody who has tested positive.\nThe reasons Black and Latino people are dying of COVID-19 at disproportional rates are complex, but center around the country’s legacy of social inequality.\n— Sara Boboltz\nChicago Announces Virtual Citywide High School Commencement — 4/30/20, 4:42 p.m. ET\nChicago is planning to host its first-ever virtual high school commencement ceremony for the entire city in June, as Chicago’s public schools remain closed for in-person classes through the end of the academic year.\nMayor Lori Lightfoot announced the event Thursday in a TikTok video, where she’s first dancing in a button-down shirt and jeans and then later dancing in a graduation cap and gown. The mayor said that Oprah Winfrey will host the celebration for all 12th graders at Chicago’s public, private and charter schools who are currently missing out on high school milestones like prom and graduation.\n“The times we are living in are historic and stunning, forcing us all to take a deep look at who we are as a people and our place in the world,” Lightfoot said in a statement obtained by the Chicago Sun-Times. “No one knows this better than Oprah, and I join all of Chicago in looking forward to hearing the wisdom she’ll be sharing with our incredible young people as they take this unforgettable next step on their life’s journey.”\nThe virtual celebration is expected to take place in mid-June, though specific details have not yet been released. The ceremony will include speeches, performances and feature student achievements, according to the Sun-Times.\nNew York City made a similar announcement on Tuesday, with Mayor Bill de Blasio saying the city’s high school seniors “have worked too hard to miss out on one of life’s defining moments.”\n— Sanjana Karanth\nSome States Begin Loosening Stay-At-Home Orders — 4/30/20, 3:55 p.m. ET\nSome states are starting to loosen their stay-at-home orders meant to slow the spread of coronavirus, despite health experts cautioning that it is likely still too soon to reopen the economy.\nGov. Brian Kemp (R) will lift Georgia’s stay-at-home order for the majority of the state’s more than 10 million residents starting Friday, though he encouraged people to stay home when it’s possible for them. The order requires elderly and immunocompromised residents to stay home until June 12, and mandates businesses to abide by a list of existing restrictions through May 13 in order to remain open.\nKemp also urged Georgia residents for the first time to wear a mask in public, though he and his top health adviser said people can be more lenient at parks, beaches and other locations where there’s more room to social distance.\n“It isn’t as if a switch has been flipped and everything has opened,” Georgia Public Health Commissioner Dr. Kathleen Toomey said, according to the Atlanta Journal-Constitution. “We’re moving into this phase carefully and cautiously and encouraging social distancing, wearing a mask in public.”\nWest Virginia also announced that the state will move from a stay-at-home order to what it called a “better-at-home” order starting Monday, a move that’s similar to the path Kemp is taking with Georgia.\nStates that are already beginning to loosen coronavirus restrictions have received fierce backlash from Democrats, health experts and even from President Donald Trump. Officials warn that lifting stay-at-home orders too soon could lead to a spike in cases.\n— Sanjana Karanth\nDeaf New Yorkers Sue Cuomo For Not Providing Sign Language Interpreter At Daily Briefings — 4/30/20, 12:57 p.m. ET\nNew York Gov. Andrew Cuomo (D) is excluding deaf New Yorkers from his daily coronavirus press conferences, a new lawsuit from disability rights advocates alleges, urging the governor to provide an American Sign Language interpreter.\nFiled Wednesday, the lawsuit claims that Cuomo is the only U.S. state governor not providing an ASL interpreter during his highly watched daily briefings, meaning that deaf New Yorkers are “unable to obtain vital life and death information at the time they need it most.”\nIn response, Cuomo’s office said an ASL version of each day’s briefing is available on Cuomo’s website. However, the lawsuit points out that this option is not available to people who don’t have internet access. Closed captioning, which is required by federal law, is also an insufficient alternative because it can be slow and inaccurate in real time, or if the person’s first language is not English.\nMore than 3.4 million Americans identify as deaf, and about 17 million report having “serious difficulty hearing,” according to a 2014 Census survey of Americans with disabilities. At least 200,000 residents of New York City, the epicenter of the global pandemic, are deaf or hard of hearing.\nRead more here.\n— Marina Fang\nWell Again, Boris Johnson Returns To Daily UK Press Briefing — 4/30/20, 12:15 p.m. ET\nU.K. Prime Minister Boris Johnson has made his first appearance at the country’s daily press briefing since recovering from the coronavirus.\nJohnson, whose fiancee Carrie Symonds gave birth to a son on Wednesday, said the United Kingdom is “past the peak” of the outbreak.\n“We are past the peak and on the downward slope,” the prime minister said, speaking in Downing Street. “And we have so many reasons to be hopeful for the long term.”\nJohnson also said he will reveal plans for lifting the lockdown next week.\nThe number of people who have died in the U.K. after contracting the coronavirus has risen by 674 in 24 hours, bringing the total number of deaths to 26,711.\nRead more here.\n— James Martin\nFauci Says Remdesivir ‘Very Important First Step’ In COVID-19 Treatment — 4/30/2020; 7:55 a.m. ET\nRemdesivir, an experimental drug that can speed up the recovery of COVID-19 patients, has passed the “gold standard” of testing to prove it’s both safe and at least modestly effective, Dr. Anthony Fauci said Thursday.\n“It’s a really important proof of concept because this is the first very highly powered [and] placebo-controlled, randomized trial,” Fauci told NBC’s “Today.” He called such trials the “gold standard of how you prove something is safe and either works or doesn’t work.”\n“It’s the first step in what we project will be better and better drugs coming along either alone or in combination, drugs of this type and drugs addressing other targets of the virus,” he added. “So it’s good news. ... This is not the total answer by any means but it’s a very important first step.”", "url": "https://www.huffpost.com/entry/covid-19-worldwide-news_n_5ea98230c5b6fb98a2b5ea75"}