{"authors": ["Andrew Demillo"], "date_download": "2020-05-04 20:05:03", "date_modify": "2020-05-04 20:05:03", "date_publish": "2020-04-07 16:08:46", "description": "LITTLE ROCK, Ark. (AP) — Arkansas' governor, who has resisted issuing a broad stay-at-home order for his state to combat the coronavirus, on Tuesday opposed even allowing such restrictions at the...", "filename": "_757c58999667cb5b996b800a1df60ece_1588622703.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_757c58999667cb5b996b800a1df60ece_1588622703.html", "title": "Arkansas governor says no stay-at-home orders for cities", "title_page": "Arkansas governor says no stay-at-home orders for cities", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LITTLE ROCK, Ark. (AP) — Arkansas’ governor, who has resisted issuing a broad stay-at-home order for his state to combat the coronavirus, on Tuesday opposed even allowing such restrictions at the local level.\nGov. Asa Hutchinson, who is among a handful of governors who haven’t issued stay-at-home orders, said those restrictions need to be dealt with on a statewide basis. Hutchinson said a number of mayors have talked with him about the issue.\n“I think it points up the need to have a statewide policy because if you have a business in one community, it impacts others,” Hutchinson said. “If you have essential services in one community, it serves the entire state if not more.”\nLittle Rock Mayor Frank Scott said he has asked the governor for a stay-at-home order for his city, which has already implemented a nighttime curfew.\n“We’re working within the confines by being creative and by respecting the current order,” Scott said, referring to the governor’s declaration of an emergency because of the outbreak. Hutchinson said his order has been amended to give cities more flexibility on curfews and closing city facilities.\nScott on Monday expanded the city’s restrictions to include a ban on vehicle caravans after large crowds gathered over the weekend at an intersection and nearby parking lots. Scott’s order defines caravans as five or more vehicles traveling together with the intention of exiting for recreational purposes.\n“This virus is not a game ... We have to take this serious to truly flatten the curve,” Scott said.\nLocal leaders in some of the states that haven’t issued stay-at-home orders have taken their own action. But city officials in Arkansas say Hutchinson’s emergency proclamation, which requires state approval for any “quarantine regulations of commerce or travel,” prevents them from enacting their own stay-at-home orders.\nHutchinson argues that a broader stay-at-home order would put many people out of work and that the state is keeping the number of infections below projections with targeted restrictions such as bans on large gatherings and closing certain types of businesses.\nThe Health Department on Tuesday said the number of cases in Arkansas had risen to at least 997 from 927 the night before. Two more people died from COVID-19, the illness caused by the coronavirus, bringing the state’s death toll to 18.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia.\nThe new cases include 14 more inmates at a federal prison in Forrest City, bringing the total number there to 24. Five employees at the facility have also tested positive. State Health Secretary Dr. Nathaniel Smith a team from the Centers for Disease Control and Prevention was expected to arrive at the facility Tuesday night.\n___\nCheck out more of the AP’s coronavirus coverage at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/757c58999667cb5b996b800a1df60ece"}