{"authors": ["Sarah Westwood"], "date_download": "2020-05-04 16:20:44", "date_modify": "2020-05-04 16:20:44", "date_publish": "2020-04-05 13:49:57", "description": "The US surgeon general said this week is going to be the \"hardest and the saddest\" for \"most Americans' lives,\" describing the upcoming grim period of the coronavirus pandemic in the United States as a \"Pearl Harbor moment\" and a \"9/11 moment.\"", "filename": "2020_04_05_politics_jerome-adams-coronavirus_index_1588609244.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200323182037-us-surgeon-general-jerome-adams-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_jerome-adams-coronavirus_index_1588609244.html", "title": "Surgeon General: This week will be like 'Pearl Harbor,' '9/11'", "title_page": "Surgeon General: This week will be like 'Pearl Harbor,' '9/11' - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The US surgeon general said this week is going to be the \"hardest and the saddest\" for \"most Americans' lives,\" describing the upcoming grim period of the coronavirus pandemic in the United States as a \"Pearl Harbor moment\" and a \"9/11 moment.\"\n\"This is going to be our Pearl Harbor moment, our 9/11 moment, only it's not going to be localized, it's going to be happening all over the country and I want America to understand that,\" Vice Admiral Jerome Adams said on \"Fox News Sunday.\"\nAdams continued: \"I want Americans to understand that as hard as this week is going to be, there is a light at the end of the tunnel.\"\nOfficials are warning the next two weeks will be crucial in the fight to stop the spread of the virus. Early Sunday, the nationwide death toll had gone up to at least 8,503 people, with at least 312,245 infected, according to data compiled by Johns Hopkins University\nWhile speaking at Saturday's coronavirus task force briefing at the White House, President Donald Trump said that this week and next will probably be the toughest in the fight against coronavirus and that \"there will be a lot of death.\"\nRead More", "url": "https://www.cnn.com/2020/04/05/politics/jerome-adams-coronavirus/index.html"}