{"authors": ["Vedika Sud", "Helen Regan", "Esha Mitra"], "date_download": "2020-05-04 16:18:01", "date_modify": "2020-05-04 16:18:01", "date_publish": "2020-04-04 00:45:50", "description": "One of Asia's biggest slums has reported its first coronavirus death as top Indian doctors warn that the country must prepare to face an \"onslaught\" of cases that could cripple the health system to levels far beyond what Europe and the United States are experiencing.", "filename": "2020_04_03_asia_india-doctors-coronavirus-intl-hnk_index_1588609081.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403073418-india-coronavirus-queue-rations-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_asia_india-doctors-coronavirus-intl-hnk_index_1588609081.html", "title": "Doctors say India must prepare for an 'onslaught' as Asia's biggest slum reports first coronavirus death", "title_page": "Doctors say India must prepare for an 'onslaught' as Asia's biggest slum reports first coronavirus death  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New Delhi (CNN) One of Asia's biggest slums has confirmed its first coronavirus death as top Indian doctors warn that the country must prepare to face an \"onslaught\" of cases that could cripple the health system to levels far beyond what Europe and the United States are experiencing .\nA 56-year-old man died due to Covid-19 -related illness in Dharavi slum, in the Indian financial capital of Mumbai on Wednesday.\nThe patient, who had no travel history, died hours just after testing positive for coronavirus while being transferred to a local hospital, Kiran Dighavkar, an official with Mumbai's Brihanmumbai Municipal Corporation (BMC) told CNN.\nSeveral of the man's family members have been tested and placed under home quarantine, and the block of 300 homes and 90 shops that make up his densely packed neighborhood have been sealed off to prevent further infections.\nOn Thursday, a 52-year-old sweeper who works for the BMC in Dharavi also tested positive for coronavirus.\nHome to around 1 million people, Dharavi slum has a population density almost 30 times greater than New York -- about 280,000 people per square kilometer.\nDoctors say the situation would be unmanageable if a sustained coronavirus outbreak spread rapidly through one of India's many slums, where there is little sanitation or running water and thousands of people live cheek by jowl -- making social distancing physically and economically impossible\nThis is the second coronavirus-related death reported in Mumbai's slums since the outbreak began, BMC officials confirmed with CNN. A 63-year-old man who tested positive for the virus on Tuesday was a resident of Malvani slum area and passed away later that evening.\nDr. Naresh Trehan, chairman and managing director of the Medanta-the Medicity hospital in Gurugram, near New Delhi, said it was vital that authorities know whether a slum has an outbreak.\n\"Once we know that one slum has got it, and we lock it down, and we feed everybody and we keep them isolated for the next two weeks, we keep them well fed, it will work its way out. We will know the critical ones, and the ones who are mild, they can be quarantined at home, and the population at large can be monitored,\" Trehan said.\nIt comes as cases in India nearly doubled in four days, with many of the new infections linked to a religious gathering in the capital New Delhi. India has identified 154 attendees from the Tableegi Jamat gathering who have tested positive cases across the country, said Luv Agarwal, senior official with the Ministry of Health and Family Welfare.\nIndia reported more than 230 new cases on Friday -- bringing the national total to 2,547 and 62 deaths.\nDoctors in the country told CNN that India needed to prepare for a large-scale community transmission and it was essential that the public abide by the 21-day national lockdown that was imposed by Prime Minister Narendra Modi last week.\n\"We are already seeing evidence of it (community transmission). How widespread it is, we don't know,\" said Trehan.\n\"My fear is, is that no matter how much preparation we do, if it peaks, we will not have even a fraction of what we need, by way of beds, by way of ventilators, by way of PPEs (personal protective gear), everything.\"\nPhotos: Mass exodus sparks coronavirus concerns in India Police officers stand by as migrant workers scramble inside a bus station in Ghaziabad, India, on Saturday, March 28. Hide Caption 1 of 14 Photos: Mass exodus sparks coronavirus concerns in India Migrant workers try to board a crowded bus in Ghaziabad on Sunday, March 29. The state governments of Uttar Pradesh, Bihar and Haryana arranged for hundreds of buses to ferry migrants home, causing chaotic scenes as thousands descended upon stations trying to claw their way onto buses. Hide Caption 2 of 14 Photos: Mass exodus sparks coronavirus concerns in India Migrant workers and their families board an overcrowded passenger train in Mumbai on March 21. Many workers had already left India's big cities before this weekend. Hide Caption 3 of 14 Photos: Mass exodus sparks coronavirus concerns in India A migrant worker carries a child as they walk along a road in New Delhi. Hide Caption 4 of 14 Photos: Mass exodus sparks coronavirus concerns in India Crowds of migrant workers wait to board buses outside New Delhi. Hide Caption 5 of 14 Photos: Mass exodus sparks coronavirus concerns in India People try to hail a bus in New Delhi. Hide Caption 6 of 14 Photos: Mass exodus sparks coronavirus concerns in India A migrant worker attempts to board an overcrowded train in Mumbai. Hide Caption 7 of 14 Photos: Mass exodus sparks coronavirus concerns in India A laborer rests on the outskirts of Prayagraj en route to his village. With India's rail network temporarily shut, many had no choice but to try walking hundreds of miles home. Hide Caption 8 of 14 Photos: Mass exodus sparks coronavirus concerns in India Migrant workers walk home from New Delhi. Hide Caption 9 of 14 Photos: Mass exodus sparks coronavirus concerns in India A migrant worker carries her belongings along a roadside in New Delhi. Hide Caption 10 of 14 Photos: Mass exodus sparks coronavirus concerns in India Workers collect food being handed out near the Anand Vihar Bus Terminus in New Delhi. Hide Caption 11 of 14 Photos: Mass exodus sparks coronavirus concerns in India People hang on to a door of a moving bus on the outskirts of New Delhi. Hide Caption 12 of 14 Photos: Mass exodus sparks coronavirus concerns in India The child of a migrant worker sleeps alongside a highway after the family failed to catch a bus. Hide Caption 13 of 14 Photos: Mass exodus sparks coronavirus concerns in India A laborer's family is silhouetted in New Delhi as they journey to their village by foot. Hide Caption 14 of 14\nLearning the lessons from Europe and US\nIndia's leading doctors have been watching closely as the virus has spread rapidly around the US and Europe, overwhelming robust health care systems, as medical staff struggle to treat thousands of patients with dwindling supplies and protective gear.\n\"This is a virus which has defied all possible predictions,\" said Dr. Arvind Kumar, chairman of the Center for Chest Surgery at the Sir Ganga Ram Hospital in New Delhi. \"Could you have imagined patients in their dozens dying in a single hospital in the US in a day?\"\nKumar said that the Indian government's unprecedented decision to restrict the movement and daily life of its 1.3 billion citizens for three weeks was the best chance the country had to identify potential virus hotspots and it offered precious time to order and manufacture sorely needed protective gear and ventilators.\n\"Two weeks down the line, our hospitals will have far more protective equipment than they had two weeks back, so it's a dynamic situation where ventilators, personal protective equipment, hazmat suits, all other ancillary facilities are being produced at mass scales and being supplied to various hospitals,\" he said.\nDoctors say they hope the lockdown will delay the peak of infections so hospitals have a fighting chance to treat incoming caseloads. \"God forbid if we were to reach a situation like Europe we just would not be able to handle it,\" Kumar said.\nWorkers prepare protective clothing and gear at a facility of personal protective equipments manufacturer Nikshe Multiproducts on the outskirts of Ahmedabad on April 2, 2020.\nDr. Om Shrivastav, director of Infectious Diseases at Kasturba Hospital in Mumbai, said his worst fear is that India only starts preparing for the crisis \"after it's on our hands.\"\nAccording to Shrivastav, there is still time, however, as India's peak number of cases is still likely to be weeks away.\n\"Every country that has been through their peak of this infection has had a different process, so we'll know in the coming four to eight weeks, that is the time period we should be prepared for,\" said Shrivastav.\nAlready taking on board those lessons is Trehan, who runs a hospital that cared for 14 Italian tourists who tested positive for coronavirus early last month. He said they have built a wealth of data on treatment methods and commonalities of symptoms that they will share with the medical community.\n\"We are studying the patterns in its entirety now, and we will be able to learn from what happened to these 14 because they were concentrated in one group,\" he said.\nOf the 14 they treated, all have now tested negative and most have left the facility, he said.\nIdentifying the hotspots\nWith the nation on lockdown, Trehan said it was now essential India ramped up testing.\n\"Thats what we need to do is get samples from all over to see how far has it spread,\" he said.\n\"If we don't know the hotspots, and we don't know where these pockets are, the whole county is so huge, and there are so many people, it will not be possible to take care of them.\"\nIndia has faced criticism for its low testing rates.\nThe country is working at 38% of its testing capacity, according to the Indian Council of Medical Research. As of Friday, a total of 66,000 tests had been carried out.\nIndians wait to receive rations during the nationwide lockdown on April 2, 2020 in New Delhi.\nPart of the problem, Trehan said, is there is a \"huge shortage\" of both testing kits and the protective gear needed by those taking the samples.\nThere are a total of 126 labs under the Indian Council of Medical Research and 51 private labs have received approval to conduct testing, according to the Health Ministry. But it's not fully clear whether they're all operating.\nKumar said there are five steps the country should follow to prevent widespread transmission: Isolate the public, conduct testing, ramp up medical facilities, pump money into the economy, \"and taking care of people so that they can sustain during this period,\" he said.\nKumar also called for the launch of a mass education campaign so the public \"know why, whatever is being done, why it's being done and increasing their compliance,\" he said.\nOn Thursday, Modi held a video conference with several state chief ministers to discuss their approach to tackling the pandemic. He said that the goal in the coming weeks was to \"ensure minimum loss of life\" and instructed states to focus on \"testing, tracing, isolation and quarantine.\"\nMigrant exodus a 'disaster'\nThreatening to derail those efforts is the tens of thousands of migrant workers who fled India's largest cities looking to return to their rural homes after the nationwide lockdown left them without jobs or pay.\nWith no food, shelter or savings, thousands of vulnerable people are making the long journey home on foot.\nOn Sunday, Modi urged all states to seal their borders to stop the virus being imported into rural areas.\nIndian doctors say the situation could turn into a humanitarian crisis if the migrants are not cared for.\n\"This is our darkest hour,\" said Dr. Rajesh Parikh, director of medical research and Hon. Neuropsychiatrist at Mumbai's Jaslok Hospital and Research Centre. \"They build our homes, our factories, our very nation with their bare hands, and now we have forsaken them.\"\nThere are fears that if the migrants traveled back to their villages and an outbreak occurred there, the limited medical facilities in rural areas would not be able to cope.\n\"This is very serious because it may negate a huge part of the benefits of the lockdown. We should not have let it happen,\" Trehan said. \"The sooner we can disperse this whole thing -- find the location for them to be transported and quarantined, that's the best we can do right now,\" he said.\nBut it may already to be too late to prevent an outbreak.\n\"You are stuck there away from your families, you don't know where your shelter is, you don't know where your food is, you've got children,\" Trehan said. \"Now they are all packed together like sardines and the infection, if it is there, will spread like wildfire and then it will be impossible to control.\"", "url": "https://www.cnn.com/2020/04/03/asia/india-doctors-coronavirus-intl-hnk/index.html"}