{"authors": ["Zukhra Kasimova", "Dawn Tefft", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Franco Palazzi", "Ben Kunkler", "Francis Eanes", "Eleni Schirmer"], "date_download": "2020-05-04 19:49:21", "date_modify": "2020-05-04 19:49:21", "date_publish": "2020-05-02 00:00:00", "description": null, "filename": "2020_05_coronavirus-university-of-illinois-chicago-grad-students-workers-union_1588621761.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/05/02020301/UIC-Stike-Photo-2-cropped.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_05_coronavirus-university-of-illinois-chicago-grad-students-workers-union_1588621761.html", "title": "Unions Can Fight for and Win COVID-19 Protections", "title_page": "Unions Can Fight for and Win COVID-19 Protections", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nWorkers at the University of Illinois at Chicago (UIC) have bargained what we believe are the first set of wins for a graduate union negotiating the effects of COVID-19. It was our winning strike last year that made our employer realize it should come to the table and give us what we demanded. When the crisis hit in March, graduate workers at UIC quickly realized that having health insurance would not prevent them from accruing huge medical bills. Nor did teaching assistants and graduate assistants, who perform much of the teaching and administrative duties at the university, have sufficient sick leave, as is typical for graduate workers in the United States on short-term contracts. To make matters worse, international student workers who traditionally receive only nine months a year of financial support from the university found themselves stranded in the United States after the worldwide suspension of travel. They were left to their own devices by the university’s office of international services. This office charges an international student fee each semester, but failed to provide immigration updates and guidance to international workers, who were left to interpret contradictory advisories issued by federal immigration authorities. Unable to work off campus because their visas prohibit them from doing so, most international student workers had no job for the summer and no family members in the United States to stay with in case of eviction.\nThe Plan Illinois declared a state of emergency on March 9. Within twenty-four hours, members of Graduate Employees Organization (GEO) Local 6297 had used a stewards meeting to draft bargaining demands and create an organizing plan. The list included two weeks’ paid sick leave, full coverage of COVID-19–related medical care, free housing, and a $400/month stipend over the summer for international students stuck in the United States without income. The administration agreed to meet but then rejected each of the union’s demands. In response, a steward wrote an article for Jacobin explaining how at the start of the pandemic, UIC’s trustees had voted to allocate $300 million to erect buildings and also voted to increase health care premiums for students. On March 21 GEO emailed the membership that article and instructions on how to email the administration. Later that day, management told union leaders they would be changing their position on some of the demands and the union could stop flooding their inboxes. Two days later the administration sent a revised proposal for a memorandum of understanding (MOU), agreeing to many of GEO’s demands. But we continued to negotiate to try to win the remaining ones. GEO’s contract specified 3.25 sick days per semester for the average twenty-hour per week job. The union fought for and won two weeks of paid sick leave, on top of regular sick leave, for anyone who contracted COVID-19 or was taking care of a family member with it. (These crucial wins were eventually replaced by more comprehensive COVID-19 sick leave policies in the federal government CARES Act.) Many members had written the union requesting teletherapy services for mental health. Knowing that studies show graduate workers have some of the highest stress levels in the nation, GEO fought for and won mental health counseling by telephone. The union also won coverage for members who use CampusCare, the university’s in-house health care provider. And though the university didn’t formally agree to this in an MOU, it did institute a policy covering all COVID-19–related out-of-network ER expenses at 100 percent and urgent care at 70 percent. The policy also met our demand of mass preauthorization of all COVID-19–related tests and treatments at ER and urgent care facilities. Previous policy required that doctors individually preauthorize all out-of-network treatment. These emergency care wins were critical, according to GEO secretary Jared O’Connor, because “the system establishes too many barriers to access treatment easily and equitably. I have been stymied by CampusCare during a medical emergency, and it only made the situation worse.” Though the administration never formally agreed to our demand to create long-term repayment plans for student debt owed to UIC, it did institute that for those who owe less than $1,500. And in response to demands from both graduates and undergraduates, it partially refunded fees, dorm costs, parking passes, and meal service plans.\nInternational Workers’ Relief The union had effectively reversed management’s position on all but one of our initial demands. But the university still refused economic relief for international graduate workers, who could neither return to their home countries for the summer nor work outside the university. So the union’s international caucus crafted a larger set of demands, including the initial one around financial relief, and emailed them on April 3 to administrators and the office of international services. The caucus asked for a response within a week, or they would email the bargaining unit with the expanded demands. The caucus felt the administration wouldn’t want them to agitate the international students who make up 40 percent of the bargaining unit and are often more exploited than domestic workers — and they were correct. A week and a day later, the administration announced a task force on summer funding issues. It also announced a virtual town hall, where international caucus members agitated. Afterward, a caucus member and a union officer were invited to be on the task force. The task force has so far created eighty new internships and assistantships over the summer, both for international workers and for US workers who have lost assistantships due to the shift to online classes. At least forty more are needed, for international students alone. “The amount of organizing that was done since last year’s strike paid off during the current crisis,” said international caucus member Siamack Hajimohammad. “The active presence of various committees and subgroups in GEO made the communication very effective across the board.”", "url": "https://jacobinmag.com/2020/05/coronavirus-university-of-illinois-chicago-grad-students-workers-union"}