{"authors": ["Bob Christie"], "date_download": "2020-05-04 20:05:43", "date_modify": "2020-05-04 20:05:43", "date_publish": "2020-04-09 21:55:23", "description": "GLENDALE, Ariz. (AP) — Arizona faces an estimated $1.1 billion budget shortfall in the coming year because of the massive economic hit caused by the coronavirus outbreak, the Legislature's top...", "filename": "_5c1ff47d4ae8949d2a764f1f27a5d1bb_1588622743.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5c1ff47d4ae8949d2a764f1f27a5d1bb_1588622743.html", "title": "Arizona faces estimated $1.1B budget shortfall due to virus", "title_page": "Arizona faces estimated $1.1B budget shortfall due to virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GLENDALE, Ariz. (AP) — Arizona faces an estimated $1.1 billion budget shortfall in the coming year because of the massive economic hit caused by the coronavirus outbreak, the Legislature’s top budget analyst said Thursday.\nBut there is so much uncertainly around state revenue that the damage could be $500 million higher or lower for the budget year that begins July 1, according to Richard Stavneak, who heads the Joint Legislative Budget Committee. A lot depends on how quickly the state and nation recovers from slowdowns caused by the response to the virus.\nThe estimated loss equals nearly 9% of the state’s total general fund spending in the current year of $11.8 billion.\nThe good news is that the state had anticipated a nearly $1 billion surplus for the coming budget year and has $1 billion in its rainy day fund. The bad news is that all that money could quickly evaporate and the economists in Stavneak’s group estimate it may take three years to fully recover.\nIt’s too early to tell the full impact to state revenues, he said, but there are signs it is massive.\n“Over the last three weeks the number of initial (unemployment insurance) claims have grown by 247,000,” Stavneak told lawmakers by phone at the quarterly Finance Advisory Committee meeting. “That is just a phenomenal number.”\nClaims had been averaging about 3,500 a week before restaurants, bars and many other businesses shuttered in the past month.\nStavneak ticked off other statistics that were just as staggering: The hotel occupancy rate in Phoenix has dropped by 70%, while restaurant sales in the last week of March also dropped by 70%. And the number of low-income people in the state’s Medicaid program has grown by 2.3% this month alone, or 42,000, and is expect to keep rising.\nPossible ways to fill the $1.1 billion gap include tapping the rainy day fund or using some cash from federal relief programs. The $2.2 trillion rescue package passed by Congress two weeks ago also boosts Medicaid spending, and that could save the state about $350 million, even with higher usage.\nMatt Gress, Gov. Doug Ducey’s budget director, told lawmakers that he agreed with the assessment by Stavneak’s team.\n“But there’s also, you know, a strong potential for an upside based on how well we are dealing with the public health crisis,” he said while noting the state’s strong financial position. “That being said, we are in a place right now that is bleak.”\nThe governor said during a briefing on the state’s virus response Thursday that the crisis is affecting state finances but there’s no rush to act.\n“There are no needed cuts in state government today. Our teachers are being paid, our school workers are being paid without disruption,” Ducey said. “Like I said, before we come with any unneeded cut, we have money in the bank, we have money in the general fund and of course we have our rainy day fund.”\nDucey has taken a number of steps to slow the spread of the virus and protect public health, including closing schools, bars, restaurants and movie theaters and last week issuing a stay at home order for all but essential activities.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.\nStavneak said it is too early to tell the extent of the damage to the state’s finances or to do anything to adjust. He expects some of the financial hit to come during the current budget year, with most effects put off to the year that starts July 1.", "url": "https://apnews.com/5c1ff47d4ae8949d2a764f1f27a5d1bb"}