{"authors": ["David Rising"], "date_download": "2020-05-04 20:18:50", "date_modify": "2020-05-04 20:18:50", "date_publish": "2020-04-06 14:58:06", "description": "BERLIN (AP) — Millions of dollars in additional funds are being made available to agencies around the world that provide aid to Holocaust survivors, whose advanced age and health issues makes them...", "filename": "_66e6ed4fbd84d8ec5db54e9d3b3b2e28_1588623530.html", "image_url": "https://storage.googleapis.com/afs-prod/media/5da5aeb1496a400fb78828afb6a13158/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_66e6ed4fbd84d8ec5db54e9d3b3b2e28_1588623530.html", "title": "Millions going to Holocaust survivors for coronavirus help", "title_page": "Millions going to Holocaust survivors for coronavirus help", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Dec. 23, 2019, file photo, French Shoah Museum president, Eric de Rothschild, right, holds the hand of a holocaust survivor during an event organized by the Conference on Jewish Material Claims Against Germany named 'Survivors Night' in Paris. The New York-based Conference on Jewish Material Claims Against Germany, an organization that handles claims on behalf of Jewish victims of the Nazis, said Monday, April 6, 2020, that the $4.3 million in initial funding was being distributed to reinforce an array of services provided by agencies around the world for some 120,000 survivors. (AP Photo/Kamil Zihnioglu, File)\nFILE - In this Dec. 23, 2019, file photo, French Shoah Museum president, Eric de Rothschild, right, holds the hand of a holocaust survivor during an event organized by the Conference on Jewish Material Claims Against Germany named 'Survivors Night' in Paris. The New York-based Conference on Jewish Material Claims Against Germany, an organization that handles claims on behalf of Jewish victims of the Nazis, said Monday, April 6, 2020, that the $4.3 million in initial funding was being distributed to reinforce an array of services provided by agencies around the world for some 120,000 survivors. (AP Photo/Kamil Zihnioglu, File)\nBERLIN (AP) — Millions of dollars in additional funds are being made available to agencies around the world that provide aid to Holocaust survivors, whose advanced age and health issues makes them particularly vulnerable to the new coronavirus, the organization that handles claims on behalf of Jewish victims of the Nazis announced Monday.\nThe New York-based Conference on Jewish Material Claims Against Germany said Monday the $4.3 million in initial funding would be made available to agencies around the world providing care for some 120,000 survivors.\nThe emergency funding includes 200,000 euros ($215,000) from the Alfred Landecker Foundation, established last year by one of Germany’s richest families, whose assets include Krispy Kreme Doughnuts, as a way to help atone for its use of forced laborers during the Nazi era and support of Adolf Hitler’s regime.\nAll survivors are elderly, with the end of World War II now 75 years in the past, and many suffered from illness, malnutrition and other deprivations either at the hands of the Nazis or as they hid from them, which continues to affect their health today.\nThere are no statistics yet as to how many Holocaust survivors have been infected by the new coronavirus, but Israel’s first reported COVID-19 fatality was 88-year-old survivor Aryeh Even, and about a third of the elderly population in Israel are survivors, according to the Claims Conference.\n“The coronavirus pandemic is a frightening time for Holocaust survivors as this is a population, like many elderly, that already tends to experience too much social isolation,” said Claims Conference President Julius Berman. “The social isolation caused by this health crisis can take a serious emotional toll which, if unchecked can lead to physical ailments.”\nThe additional funds will be used to “address critical gaps” in providing survivors help with home care, food, medicine and other assistance as it is needed.\nIt is in addition to approximately $350 million in direct compensation the Claims Conference is providing to more than 60,000 survivors in 83 countries this year, and some $610 million in grants to more than 300 social service agencies.\nThe Claims Conference is also providing advances of previously committed funds and taking other steps to help the agencies that support survivors.\n“Agencies are going to have a cash flow problem and fundraising is going to be difficult,” said Greg Schneider, executive vice president of the Claims Conference. “We want them to do what they do best and go save lives.”\nAs a result of negotiations with the Claims Conference since 1952, the German government has paid more than $80 billion in Holocaust reparations.", "url": "https://apnews.com/66e6ed4fbd84d8ec5db54e9d3b3b2e28"}