{"authors": ["Laurie Kellman"], "date_download": "2020-05-04 20:12:32", "date_modify": "2020-05-04 20:12:32", "date_publish": "2020-04-09 04:24:09", "description": "WASHINGTON (AP) — “Congress\" literally means to gather together. But the coronavirus pandemic and election year politics are forcing lawmakers to consider ways of governing from afar, some for the...", "filename": "_acdb8a391efe725478d512ba67d93029_1588623152.html", "image_url": "https://storage.googleapis.com/afs-prod/media/3044286b5fc44749a4f1a2a4a4387320/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_acdb8a391efe725478d512ba67d93029_1588623152.html", "title": "Point of order: Congress weighs how to govern from afar", "title_page": "Point of order: Congress weighs how to govern from afar", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this March 18, 2020, file photo, the Washington Monument and the U.S. Capitol are seen in Washington, at sunrise. Congress is considering ways to govern from afar during the coronavirus pandemic. Lawmakers are talking this week about whether it's possible to conduct virtual committee meetings, particularly to oversee how the $2.2 trillion stimulus money is being spent. And they're considering ways to pass virus-related legislation without requiring every lawmaker to be present. (AP Photo/Carolyn Kaster, File)\nFILE - In this March 18, 2020, file photo, the Washington Monument and the U.S. Capitol are seen in Washington, at sunrise. Congress is considering ways to govern from afar during the coronavirus pandemic. Lawmakers are talking this week about whether it's possible to conduct virtual committee meetings, particularly to oversee how the $2.2 trillion stimulus money is being spent. And they're considering ways to pass virus-related legislation without requiring every lawmaker to be present. (AP Photo/Carolyn Kaster, File)\nWASHINGTON (AP) — “Congress” literally means to gather together. But the coronavirus pandemic and election year politics are forcing lawmakers to consider ways of governing from afar, some for the first time in U.S. history.\nThe virus’ continuing spread is raising doubts among lawmakers and aides that Congress will reconvene in Washington as scheduled the week of April 20.\nDemocrats are increasingly annoyed that President Donald Trump gets a daily platform to rebut unflattering stories and update Americans on his administration’s response to the crisis. Like millions of people around the world, homebound members of Congress have time on their hands for suggestions, and they’re making them with rising urgency — from virtual congressional hearings to remote voting and the more likely buddy system by which votes are cast by proxy.\n“There are consistent recommendations and pressure on what remote voting would look like, and I think there are ongoing conversations looking at how you could, in a very secure manner, have remote hearings,” said Rep. Ami Bera, D-Calif. “That is one way that the public can see what Congress is doing while they are watching the daily press briefings from the administration.”\nPolitics aside, there are life-and-death matters to legislate. After passing the nation’s largest stimulus bill , Congress is now considering follow-up policy that would give more support for small businesses, medical personnel, unemployed Americans and efforts to slow the virus’ spread.\nBut before more dollars are dedicated, the tradition-bound Congress must untangle questions about its own operations, given that the average age of members is right around 60, and many of its leaders are more than a decade older. Several members of Congress have tested positive for the virus.\nHouse Speaker Nancy Pelosi told reporters Thursday that she’s concerned about the health of Congress’ lawmakers. But any changes to voting procedure, she cautioned, aren’t going to happen soon, at least in the House.\n“We aren’t there yet, and we’re not going to be there no matter how many letters somebody sends in,” Pelosi, 80, said by telephone from her home in San Francisco. “There are some technologies that you might think are workable but they might not be secure.”\nCommittees of Congress are rethinking how to move legislation forward without holding old-fashioned “paper hearings,” in person. The Senate Armed Services committee, for example, said Tuesday that key hearings on the annual National Defense Authorization Act are being postponed while consideration is given to unspecified “alternative hearing processes.”\nThe last time Congress met, the Senate slowed down its roll call to thin out the number of members sharing the chamber at any one time. The House on March 27 spread its members from the floor into the empty visitors gallery overhead, filling every other seat, to pass the $2.2 trillion bill .\nThe scene was poignant, but also awkward and risky. When it was over, members bolted the building, leaving red tags about cleaning dangling from office doorknobs.\nLawmakers aren’t eager to gather there again anytime soon. But they’re abuzz with proposals on how to govern — deliberate, oversee how the $2.2 trillion is spent and vote — without 535 representatives and senators meeting in person.\nBut discussions are still tentative, given concerns about hacking and the efficacy of dozens of garrulous politicians sharing a Zoom-like platform. Several House committees are looking to somehow hold hearings, for example, on the inspectors general Trump has effectively ousted.\n“At this point we’re trying to figure out logistics of doing hearings, and we’re looking into whether we can do virtual or Zoom hearings,” House Intelligence Committee Chairman Adam Schiff, D-Calif., told The Associated Press on Tuesday.\nAs for floor votes, House Democrats said in a report last month that it’s best to follow the current practice of unanimous consent or, in its absence, roll call votes. The House also could reset the minimum number of members who must be present under a rule changed in the wake of the Sept. 11, 2001, attacks.\nOther options would require changing the House rules, which Pelosi said would require a full House vote. For lawmakers, that means an unwanted trip to Washington, anyway.\nProxy voting, or the practice of an absent member giving a present member authority to cast both votes, has precedent in Congress. Proxy voting in House committees was permitted until 1995. And it’s still allowed in Senate committees.\nBut remote voting, wrote Rules Committee Democrats, presents a universe of security and other challenges. It has no precedent, which means parties could file legal challenges against any legislation they don’t like. And it’s vulnerable to hackers at a time when other countries have shown great interest in meddling in the U.S. political processes.\n“Creating a secure, reliable, and user-friendly system while in the midst of a crisis is not realistic,” the report found.\nYet remote voting has its fans. Dozens of Republicans and Democrats that make up the Problem Solvers Caucus on Tuesday urged Pelosi and Minority Leader Kevin McCarthy, R-Calif., to consider allowing voting by video or having voting machines moved to local offices.\nAnd Sens. Dick Durbin, D-Ill., and Rob Portman, R-Ohio, wrote last month in a column for The Washington Post that the country has debated governing from elsewhere in times of crisis for centuries, from the British burning of the Capitol in the 19th century to the Cold War in the 20th century and the wake of Sept. 11, 2001.\n“This time, it is not the Senate’s meeting space that is at risk,” they wrote, proposing remote voting for up to 30 days. “It is the senators themselves.”\nRep. Ro Khanna, D-Calif., on Wednesday dismissed concerns about the risk of hacking for remote voting, saying that if anyone’s vote is recorded incorrectly, “we’d know immediately.”\nAs for Congress’ cherished tradition of in-person voting, he noted:\n“Traditionally, Congress didn’t have any women. Traditionally, Congress didn’t recognize the right of Black Americans to vote,” Khanna tweeted. “Traditions change, and so should Congress.”\n___\nAssociated Press writer Mary Clare Jalonick contributed to this report.\n___\nFollow Kellman on Twitter at https://www.twitter.com/APLaurieKellman .", "url": "https://apnews.com/acdb8a391efe725478d512ba67d93029"}