{"authors": ["Kate Sullivan"], "date_download": "2020-05-04 16:11:41", "date_modify": "2020-05-04 16:11:41", "date_publish": "2020-04-02 19:54:59", "description": "Former Democratic presidential candidate Andrew Yang said Thursday it is a \"heartbreaking phenomenon\" that Asian Americans have been the target of a growing number of racist and xenophobic attacks related to the coronavirus.", "filename": "2020_04_02_politics_andrew-_892d70ae9e37882e2df4411587ef26cc_index_1588608701.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200131114119-101-andrew-yang-lead-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_andrew-_892d70ae9e37882e2df4411587ef26cc_index_1588608701.html", "title": "Andrew Yang: Asian Americans being attacked over coronavirus is 'a heartbreaking phenomenon'", "title_page": "Andrew Yang: Asian Americans being attacked over coronavirus is 'a heartbreaking phenomenon' - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Former Democratic presidential candidate Andrew Yang said Thursday it is a \"heartbreaking phenomenon\" that Asian Americans have been the target of a growing number of racist and xenophobic attacks related to the coronavirus.\nYang, a CNN political commentator, told CNN's Lisa Ling on a live episode of \"Go There,\" CNN's show on Facebook Watch, \"I've gotten the same messages you have, Lisa, about friends and Asian Americans who are being either spat on or attacked or assaulted around the country.\"\n\"And it's just a heartbreaking phenomenon where, just like you, I mean, we're reacting to this the same way any other American does, which is with anxiety about the future and concern about what's going to happen with our families, our neighbors,\" Yang continued. \"But then it's compounded by the fact that you know there's this massive increase in hostility and animosity towards Chinese Americans, Asian Americans, because so many Americans associate this virus with China.\"\nPresident Donald Trump said last week that the spread of the coronavirus in the US is not the fault of Asian Americans , and that it is important to protect the Asian American community in the US. Trump's tweet came less than a week after the President defended his use of the terms \"China virus\" and \"Chinese virus\" to describe the novel coronavirus, which originated in Wuhan, China.\nAfter consulting with medical experts and receiving guidance from the World Health Organization, CNN has determined that that name is both inaccurate and considered stigmatizing.\nRead More", "url": "https://www.cnn.com/2020/04/02/politics/andrew-yang-asian-americans-attacked-coronavirus/index.html"}