{"authors": ["John Blake"], "date_download": "2020-05-04 16:18:12", "date_modify": "2020-05-04 16:18:12", "date_publish": "2020-04-04 08:06:52", "description": "Humans facing a crisis can rally together -- or turn on one another. One 'Twilight Zone' episode offers a cautionary lesson about 'pandemic Darwinism.'", "filename": "2020_04_04_us_twilight-zone-coronavirus-maple-street-blake_index_1588609092.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331150058-02-twilight-zone-episode-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_us_twilight-zone-coronavirus-maple-street-blake_index_1588609092.html", "title": "A classic 'Twilight Zone' episode warns us how not to behave during a pandemic", "title_page": "A classic 'Twilight Zone' episode warns us how not to behave during a pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) An invisible enemy brings life to a halt. People become isolated and panic. Neighbors start seeing one another as threats.\nIf life during the Covid-19 pandemic makes it seem like you've entered \"The Twilight Zone,\" that seminal sci-fi series about dread and paranoia, than you're more right than you realize. On March 4, 1960, it aired a classic episode that's a cautionary tale about how social order can quickly break down when an unseen threat causes fear to go viral.\nThe episode, titled \" The Monsters are Due on Maple Street, \" examines what happens to a leafy suburban neighborhood when it's suddenly hit with an unseen menace. The power goes out and rumors spread of an alien invasion. The residents of Maple Street suddenly see sides of their neighbors that shock them.\nPart of the genius of Rod Serling, the \"Twilight Zone's\" creator, is that he depicts how people react to fear and paranoia in ways that remain timeless. But perhaps no episode of Serling's celebrated show captures so well what so many Americans are experiencing now -- and how grim life could quickly get if people aren't careful.\n\"One of the themes of the show was disorientation, the idea that the ground beneath our feet may not be as firm as we once thought,\" says Nicholas Parisi, author of \"Rod Serling: His Life, Work, and Imagination.\n\"People who have never seen the series -- you say to them, 'I feel like I'm in the Twilight Zone,' and they know what you're talking about.\"\nIt's been 60 years since that episode aired. But there are some eerie parallels between what happened on Maple Street and what's going on across America today. And they show us how not to act during this pandemic.\nMass fear can create scapegoats\nThe episode begins with a cheery Saturday in suburbia, with the sound of children's laughter and ice cream trucks. But then there's a roar and a flash of light, and everyone on Maple Street suddenly loses power. Cars won't start. People feel trapped in their neighborhood because they can't leave.\nA boy suggests there's been an invasion by aliens who have infiltrated Maple Street and are indistinguishable from humans. People scoff, but as night approaches and more inexplicable events occur, they focus their suspicions on an eccentric neighbor whose car suddenly starts.\nMaple Street seems idyllic at first, but under pressure a mob mentality soon takes hold.\nA mob forms and confronts the man.\n\"Wait a minute now. You keep your distance -- all of you,\" the neighbor says. \"So I've got a car that starts by itself -- well that's a freak thing, I admit it. But that doesn't make me so kind of criminal or something?\"\nHis pleas are ignored and fear becomes an accelerant. Soon, the neighbors panic, turn on each other and descend into violence.\nThis is also a popular theme in dystopian fiction like Stephen King's \"The Stand,\" or in shows like \"The Walking Dead\" or \"The Strain.\"\nPeople sometimes turn on each other when confronted by a common threat. We can already see signs of that happening now in America.\nPeople have attacked Asian-Americans in public, blaming them for the pandemic. A man in Maine said armed neighbors prevented him from leaving his home because they believe he's infected.\nPanicked buyers are emptying supermarket shelves and stocking up on guns and ammo. The pandemic is dividing blue cities from red states as Democratic mayors battle Republican governors over the proper response.\nThe coronavirus pandemic has brought a rise in cases of discrimination against Chinese people.\nAnd an engineer in California was arrested after prosecutors accused him of intentionally derailing a train near a hospital ship because he believed it was involved in a Covid-19 conspiracy.\nNo wonder a recent poll found that \"tens of millions\" of Americans say the coronavirus is harming their mental health.\n\"Some disasters, like hurricanes and earthquakes, can bring people together, but if history is any judge, pandemics generally drive them apart,\" columnist David Brooks recently wrote in The New York Times.\n\"These are crises in which social distancing is a virtue. Dread overwhelms the normal bonds of human affection.\"\nAn unseen threat is harder to fight\nThen there is the nature of the threat on Maple Street. It's like a virus -- invisible to the human eye. No Maple Street resident has ever seen a monster, or an alien. That lack of a tangible object to fear makes it more terrifying.\nThat type of fear can reveal \"how quickly we can turn on each other when faced with situations that should bind us together,\" Phil Pirrello, an editor and Los Angeles-based writer, wrote in a recent essay on the Maple Street episode.\n\"Turning against our better instincts to follow our lesser ones leads us down a path that deceptively feels like survival, but it's ultimately a dead end,\" says Pirrello, who adds it's easier to avoid self-destructive behavior when a group of people faces a visible threat, such as in war. He cites how the nation came together after Sept. 11, 2001.\n\"If it [Covid-19] came in a way that people could process more acutely, maybe we could be more galvanized in our response,\" Pirrello says.\nIn comments last month, Lt. Gov. Dan Patrick of Texas seemed to suggest older Americans should compromise their health for the sake of the nation's economy.\nUnseen threats can also cause people to be more callous to fellow human beings, says Ulrich Lehner, a Catholic theologian at the University of Notre Dame.\nLehner says he sees the onset of what he called \"pandemic Darwinism,\" the notion that in times of an epidemic the fittest should survive, and that we should accept the suffering of some people to keep the economy going.\nThat kind of thinking reminds him of a dark period in his native Germany, says Lehner, author of \"God is Not Nice: Rejecting Pop Culture Theology and Discovering the God Worth Living For.\"\n\"As a German who lose family members in the camps, I feel sickened by the attitude of assigning dollar sings to lives,\" he says. \"When we begin to accept that some people are more valuable than others and that some have to be sacrificed or are expendable, we are not much better than the Nazis.\"\nBut we can create 'pockets of humanity'\nSerling thought people could be much better than that, and he offered glimpses of that goodness in the \"Maple Street\" episode.\nSome people on Maple Street stand up to the mob. One, Steve, shouts, \"You're standing here all set to crucify -- all set to find a scapegoat -- all desperate to point some kind of a finger at a neighbor! Well now look, friends, the only thing that's gonna happen is that we'll eat each other up alive!\"\nMany people have been pooling scarce supplies -- such as toilet paper -- during the pandemic.\nSerling was a World War II veteran who fought in the South Pacific and lost many of his comrades. But he was an optimist at heart, says Parisi, author of the Serling biography and a member of the Rod Serling Memorial Foundation.\n\"He really did believe in our ability to rise above our baser instincts,\" Parisi says. \"His advice for today would be [that] we have to believe in one another ... we have to connect. We can't be on our own -- we have to help one another.\"\nIn recent weeks plenty of ordinary Americans have already been doing that.\nA Minnesota state trooper pulled a doctor over for speeding but gave her a N95 face mask instead of a ticket. In Rhode Island, a police officer bought groceries for an elderly shut-in who had no food at home.\nHomebound people are rallying online to buy groceries for elderly neighbors and raising money for food banks. Nurses and home-care aides are now being treated as national heroes -- not unlike the firefighters who went into the burning towers on Sept. 11.\nThe \"Tribute in Light\" memorial lights up lower Manhattan on September 11, 2018, in New York City.\nPirrello calls these events \"pockets of humanity.\" He describes it as good infection, a chain of altruism that prevents civic breakdown.\nThere are some situations so extreme. though, that no one can predict what they will do until they happen. We may be facing one now.\nWhat do you do when a neighbor who you think might be sick asks you to take them to the hospital? Will you go to the bedside of an ailing family member even if it means risking your health? Will you hoard food and supplies at the expense of others who may need them more?\nThose are the kind of choices Serling wrote about 60 years ago.\nSo can we build pockets of humanity in the months ahead? Or will we turn into the Monsters of Maple Street?", "url": "https://www.cnn.com/2020/04/04/us/twilight-zone-coronavirus-maple-street-blake/index.html"}