{"authors": ["Alisha Ebrahimji"], "date_download": "2020-05-04 17:03:40", "date_modify": "2020-05-04 17:03:40", "date_publish": "2020-04-10 23:30:04", "description": "A nursing home patient in Michigan spent her final days talking to her Amazon Echo Show about the pain she was experiencing as she battled coronavirus.", "filename": "2020_04_10_us_alexa-nursing-home-coronavirus-trnd_index_1588611820.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410123328-louann-dagen-covid-victim-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_alexa-nursing-home-coronavirus-trnd_index_1588611820.html", "title": "In her dying days, a woman with coronavirus repeatedly talked to Alexa about her pain", "title_page": "In her dying days, a woman with coronavirus repeatedly talked to Alexa about her pain - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A nursing home patient in Michigan spent her final days talking to her Amazon Echo Show about the pain she was experiencing as she battled coronavirus.\nLouAnn Dagen, 66, was one of 31 residents and five staff members to test positive for coronavirus at the Metron of Cedar Springs nursing home, in Cedar Springs, Michigan, according to CNN affiliate WOOD-TV\nPenny Dagen, LouAnn's sister, told CNN that LouAnn was diagnosed with coronavirus a couple of weeks ago.\nConnected through technology\nPenny said about a year ago, a family member bought the two sisters Amazon devices so that they could see and talk to each other almost every day.\n\"She could call her sister through the device and they communicated often,\" Paul Pruitt, director of operations at Metron of Cedar Springs, told CNN in a statement. \"It was a very positive part of her life, which we supported fully.\"\nPenny told WOOD-TV she last saw LouAnn on Saturday as she was getting transported to the emergency room because her oxygen level and blood pressure dropped. Not long after, she died.\n\"The hospital called me right away and said that they put her on a respirator,\" Penny told WOOD-TV. \"They asked me about giving her CPR if her heart stopped and I said, 'No, she didn't want that.' And then her heart stopped and that was it. A half hour after they called.\"\n'Alexa help me. I am in pain.'\nPenny said every now and then she would keep track of LouAnn's activities through the Amazon Alexa app on her iPad.\nA few days after LouAnn died, Penny opened the app. She said she found about 40 recordings of LouAnn talking to Alexa.\nThe sisters share an account that is linked to Penny's iPad. The recent recordings between LouAnn and her Alexa device were archived on Penny's iPad.\nWhen Penny saw the archived recordings she said she couldn't believe what she had found.\n\"It made me feel bad because there wasn't anything I could do to help her,\" she said.\nIn some of the recordings, Penny shared, LouAnn can be heard telling Alexa, \"I am in pain. I have to find a way to relieve it.\"\nOn another recording she asks, \"What can I do to stop the pain?\"\nPenny said she remembers her sister calling her one night to tell her about just how much pain she was in.\n\"She called me up at 4 in the morning and said, 'Penny, this pain is a 10, it's a 10, please help me.'\"An Amazon spokesperson told CNN on Friday: \"We were saddened to hear about this news, and our hearts go out to the family. Today, customers can ask Alexa to call family or friends, or set up skills like Ask My Buddy, which lets you alert someone in your Personal Alert Network that you need them to check on you. We continue to build more features to help our customers.\"\nIt's not known if Penny or LouAnn set any alerts on Alexa.\nNursing home official: 'LouAnn was getting excellent care'\nPruitt said due to patient privacy regulations he couldn't share any information about LouAnn's physical or mental health while she was in Metron of Cedar Springs' nursing home.\n\"We can share that LouAnn was getting excellent care and that our team was following both her advanced directives and clinical practice guidelines to manage her pain and symptoms,\" Pruitt said. \"Once those symptoms progressed rapidly, and at the advice of her medical team, she was immediately sent to the hospital.\"\nPenny told WOOD-TV the nursing home had given LouAnn a pain reliever to try to control the pain she was experiencing and that her sister was short of breath early last week. The nursing home told her that despite the coronavirus infection, LouAnn didn't have a high temperature.\n\"It wasn't until Thursday that they started the saline solution because she was getting dehydrated,\" Penny told WOOD-TV. \"She just kept saying, 'I'm thirsty.' She didn't drink anything, though.\"\nLouAnn had struggled with diabetes and suffered a stroke about 10 years ago, Penny told WOOD-TV. She had been living in the nursing home ever since.\nCNN pressed the nursing home about why LouAnn wasn't taken to the ER sooner, but the PR firm handling media for the nursing home declined to comment further on her death beyond the statement Pruitt released.\nWith the support of family and friends, Penny said she's doing her best to cope with the loss of her sister.\nPenny plans to have her sister cremated once stay-at-home orders are lifted with a memorial at Camp Lake Baptist Church, just as LouAnn wanted.", "url": "https://www.cnn.com/2020/04/10/us/alexa-nursing-home-coronavirus-trnd/index.html"}