{"authors": ["Bill Carter For Cnn Business Perspectives", "Bill Carter For"], "date_download": "2020-05-04 17:01:19", "date_modify": "2020-05-04 17:01:19", "date_publish": "2020-04-10 12:22:43", "description": "The TV is on. Or the computer is on, or some other screen is on. But something is on because everything non-screen-based is on pause.\nLife is on pause.", "filename": "2020_04_10_perspectives_television-media-coronavirus_index_1588611679.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409132300-watching-tv-0326-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_perspectives_television-media-coronavirus_index_1588611679.html", "title": "We can't stop watching TV during the pandemic - and that's ok", "title_page": "We can't stop watching TV during the pandemic — and that's ok (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Bill Carter, a media analyst for CNN, covered the television industry for The New York Times for 25 years, and has written four books on TV, including The Late Shift and The War for Late Night. The opinions expressed in this commentary are his own.\nIt's early April; flowering blossoms of pink and white are on the trees. The golden sun cascading through the kitchen window is glorious.\nBut I'm inside. And the TV is on.\nThat wouldn't be unusual for this particular weekend on the calendar because I would be skipping the nature show outside anyway to watch the Masters Golf tournament, as I have in mid-April just about every year since Arnold Palmer blew the lead on the final hole versus Gary Player in 1961.\nThe Masters is not on the air this weekend, of course, along with the entire vast array of other events that devoted sports fans have, every spring, planted themselves in front of TV sets to watch. The nerve-jangling withdrawal from the TV sports habit is growing more acute with each cancellation or postponement of familiar spring events — unless some folks are being placated by the prospect of an NBA \"H-O-R-S-E\" tournament, or maybe the replay of last year's world championships of cherry-pit spitting, which ESPN carried last month.\nThe NFL draft, coming in a couple of weeks, is likely going to be the most avidly eyeballed — and wagered on — series of moments of some guy walking to a microphone to read names off an index card in human history.\nStill, the TV is on. Or the computer is on, or some other screen is on. But something is on because everything non-screen-based is on pause.\nLife is on pause.\nHunkered down, facing a lot of bad news, what else are most people going to do but seek diversion? That's why television was invented. The medium has suffered merciless criticism for most of its existence for the crime of \"benumbing\" the people watching. Scientists have even detected a quieting of brain waves from people in the act of TV viewing.\nMore recently, so much superior entertainment has moved to television that those critiques have become much more muted. Now, the role of television as both diversion and, frequently, as a companion to those sheltering in place solo, has pretty much obliterated all that carping about TV's mind-numbing effects. Numbing is kind of the point at the moment.\nThat accounts for a measurable increase in overall TV usage.\nThere have also been some unusual shifts in viewing patterns. Because screens can now be watched at leisure any time of day, people are apparently finding late mornings to be when they are especially in need of diversion.\nAccording to a study by the analytics company Conviva, the hour between 11 a.m. and noon has seen a 43% rise in viewing, while primetime viewing is actually down 2%. This may indicate some level of fatigue sets in after consuming an all-you-can-view meal all day long.\nBeyond the news networks, some individual shows have especially benefited from the surge of viewing, notably Netflix's \"Tiger King\" — a show where tigers aren't the only wild creatures.\nThere are so many choices, the old lament of \"nothing's on\" just doesn't fly. Classic TV is everywhere, from \"Perry Mason\" to \"Cheers.\" You want to watch \"The Mothers-in-Law\" with Eve Arden from 1967 — for some unfathomable reason? Amazon has it. (Amazon also has \"The Sopranos.\") You want to binge British TV? It's all over streaming services, especially one called Acorn. A service called MhZ specializes in subtitled European crime drama, with shows from countries as disparate as Portugal, Norway, Sweden, France, Ireland (in Gaelic!) and even Andorra represented.\nHGTV seems to run episodes of \"Love It or List It\" around the clock. The Animal Planet network had a week in late March where it ran more than 90 straight hours of cute animals cuddling and running around.\nSomething you'll like is definitely on — somewhere.\nAt least for now. One issue going forward is going to be delivering new editions of shows with established followings. HBO's hits like \"Succession\" and \"Barry\" won't be on schedule because production had to shut down. That will also affect the next season of \"The Handmaid's Tale\" on Hulu and the ambitious new version of \"The Lord of the Rings\" on Amazon, and a whole host of other shows, especially if production in Hollywood is shut down well into summer.\nReality is also going to intrude on reality shows, like \"Survivor,\" \"Big Brother\" and \"The Bachelorette\" too.\nAnd then there's sports. The murmurings of resumption continue, as you might expect when leagues, like the NFL, have contracts for multibillions of dollars.\nBaseball, which is losing chunks off its business as it watches its season slip away, has floated a plan to play games in Arizona in empty stadiums that will be aired on TV, of course. Players would not sit in dugouts but would be widely separated in the empty stands. The home plate ump would be replaced by an electronic strike zone. But how would guys be tagged out? Would infielders wield six-foot long gloves?\nMany spring events are being pushed into late summer and fall. The Masters is now scheduled for mid-November. The US Open Golf championship will hopefully be played in September. Kentucky Derby ? September 5. Indy 500 ? August 23. The NBA is talking about playoffs in late summer with Finals around Labor Day.\nAnd all of those events — and who knows how many more — would run into both a potential college football and a projected NFL season. This means the sports fan, having endured a cold-turkey TV break from every sport (the committed gamblers have probably been betting on something, maybe what color scarf Dr. Deborah Birx will wear at every afternoon's virus update) will suddenly be dealing with a massive glut of televised, empty-stadium major events.\nNot to mention a presidential election.\nAnd viewers will probably be thrilled, just to have the waves of news reports and pre-shot video content over with. Let the games begin.\nWhen this is all over, there may also be a whole new slate of brilliant and inspiring creative works that were generated when day-to-day life was in total suspension.\nAfter all, Shakespeare may have written King Lear when he was in quarantine during the bubonic plague.\nBut he didn't have Netflix.", "url": "https://www.cnn.com/2020/04/10/perspectives/television-media-coronavirus/index.html"}