{"authors": ["Robert Burns"], "date_download": "2020-05-04 20:23:36", "date_modify": "2020-05-04 20:23:36", "date_publish": "2020-04-20 20:20:13", "description": "WASHINGTON (AP) — The Pentagon is extending military travel restrictions through June, indicating a concern that the coronavirus remains a threat to troops even as the Trump administration pushes...", "filename": "_726251b11f5b00b6ef0588b7737285d4_1588623816.html", "image_url": "https://storage.googleapis.com/afs-prod/media/fb16cf559a8f46bda6081586702e6215/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_726251b11f5b00b6ef0588b7737285d4_1588623816.html", "title": "Cautious Pentagon extends troop travel limits through June", "title_page": "Cautious Pentagon extends troop travel limits through June", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this April 1, 2020, file photo, Defense Secretary Mark Esper speaks about the coronavirus in the James Brady Press Briefing Room of the White House in Washington. The U.S. military is bracing for a months-long struggle against the coronavirus. It is looking for novel ways to maintain a defensive crouch that protects the health of troops without breaking their morale. (AP Photo/Alex Brandon, File)\nFILE - In this April 1, 2020, file photo, Defense Secretary Mark Esper speaks about the coronavirus in the James Brady Press Briefing Room of the White House in Washington. The U.S. military is bracing for a months-long struggle against the coronavirus. It is looking for novel ways to maintain a defensive crouch that protects the health of troops without breaking their morale. (AP Photo/Alex Brandon, File)\nWASHINGTON (AP) — The Pentagon is extending military travel restrictions through June, indicating a concern that the coronavirus remains a threat to troops even as the Trump administration pushes for some states to begin opening up in May.\nThe military travel limits, which Defense Secretary Mark Esper ordered in March, had been set to expire May 11.\n“While the Department acknowledges that this order will have great impact on our service members and their families who are looking to proceed with their lives, the rapidly changing environment has created significant risks to service members,” the Pentagon said in a statement announcing the details.\nIt said Esper directed that permanent change-of-station moves for military members with school-age dependents should be prioritized to minimize school-year disruption and education costs, or that these military members be considered for extension of their current assignment.\nThe restrictions apply to Defense Department civilians as well as military members for official domestic and international travel. The ban does not apply to travel related to recruiting and the movement of trainees.\nWhen he announced last week that he was going to extend the travel restrictions, without specifying for how long, Esper said he realized that this put a burden on military families. He noted that many hope to move to new assignments, in the United States and abroad, this summer before the start of a new school year.\n“The decision was made in order to protect U.S. personnel and preserve the operational readiness of our global force,” the Pentagon statement said. “The Department now has procedures in place to allow for additional waivers and the resumption of travel for several categories of travelers that were previously suspended, including deployments.”", "url": "https://apnews.com/726251b11f5b00b6ef0588b7737285d4"}