{"authors": [], "date_download": "2020-05-04 20:13:32", "date_modify": "2020-05-04 20:13:32", "date_publish": "2020-04-29 00:11:45", "description": "The group, A Future to Believe In, wants to ensure that voters energized by the Vermont senator's ideals stay that way with the presumptive Democratic no...", "filename": "entry_sanders-advisers-form-super-pac-aimed-pushing-biden-left_n_5ea8c3a9c5b6123a1763e145_1588623212.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8c5c42500008d10eb0852.jpeg?cache=35xqp0est2&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_sanders-advisers-form-super-pac-aimed-pushing-biden-left_n_5ea8c3a9c5b6123a1763e145_1588623212.html", "title": "Sanders Advisers Form Super PAC Aimed At Pushing Biden Left", "title_page": "Sanders Advisers Form Super PAC Aimed At Pushing Biden Left | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "WASHINGTON (AP) — Top advisers to Bernie Sanders' unsuccessful presidential campaign are forming an outside political group to support Joe Biden, hoping to push the former vice president to the left on key issues and boost his appeal with progressives, young voters and Latinos who may remain wary of him.\nThe political action committee, announced Tuesday, is called A Future to Believe In. It will be headed by Sanders’ longtime senior strategist Jeff Weaver and include the Vermont senator’s top aide on Latino outreach, Chuck Rocha. Also helping lead it is Tim Tagaris, a veteran of Sanders’ presidential campaigns in 2016 and 2020 who was instrumental in building his formidable fundraising operation by attracting armies of small but consistent donors nationwide.\nWeaver said Sanders brought ideas once dismissed as radical — such as universal health care coverage under “Medicare for All” and canceling student loan debt — into the political mainstream. He said the group wants to ensure that voters energized by those ideals stay that way.\n“Over the last five years, the progressive movement in this country has had tremendous success in changing the debate and changing the party,” Weaver said in a phone interview. He added that the organization now sees in Biden the chance to “elect a candidate who will help us institutionalize some of those changes.”\nA central theme of Sanders’ campaign was denouncing super PACs, which he decried as corporate power brokers' and political insiders' way to unduly influence elections. But Weaver said forming the group is necessary in a political environment where “the Republicans are going to bring every asset to bear” to promote President Donald Trump's reelection.\n“Bernie Sanders remains opposed to super PACs. Joe Biden is already supported by a number of super PACs,” he said.\nWeaver also said that the advisers spoke to Sanders before forming A Future to Believe In and that its fundraising will be separate from the senator’s, not relying on email or other digital lists of his supporters or receiving funds transferred from his campaign accounts.\nMike Casca, a Sanders campaign spokesman, said Tuesday that “Sen. Sanders has always opposed the creation of super PACs, and his position has not changed.”\n“This is an effort completely independent of him and his campaign,” Casca said in an email.\nStill, the announcement comes at a critical time for Biden as he works to consolidate the progressive movement behind him and bring together a Democratic Party he will likely need fully unified to win in November.\nSanders suspended his campaign three weeks ago and endorsed Biden days later, potentially defusing some tensions that divided the party in 2016, when he waited until shortly before the Democratic National Convention to endorse his former rival, Hillary Clinton. Some of the senator’s core supporters have been reluctant to embrace Biden, however, saying they'd like to see him champion more progressive values.\nBiden has since backed some of the proposals promoted by Sanders and fellow progressive Massachusetts Sen. Elizabeth Warren on expanding health insurance coverage under Medicare, canceling student loans for millions of Americans and overhauling the nation’s bankruptcy laws. But he has continued to reject Medicare for All, even as its popularity has risen with some Americans during the coronavirus outbreak.\nWeaver said Biden has adopted progressive positions on other issues like labor rights and higher education funding. He also noted that Biden's and Sanders' campaign advisers are preparing joint task forces to tackle top issues at the Democratic National Convention, now scheduled for August. But Weaver conceded that Biden likely won't undergo core philosophical changes, like endorsing Medicare for All.\n“I don’t think anybody should be under the illusion that Joe Biden is suddenly going to become exactly like Bernie Sanders,” he said.\nRon Klain, who was Biden’s chief of staff when he was vice president, said Sanders' advisers can bring deep knowledge of successful digital organizing and outreach to Biden's campaign.\n“Everything starts obviously with leaders saying, ’Hey, let’s come together and let’s unite.' But then there’s a lot of hard work that has to go on to take that vision and make that a reality,” said Klain, who has no paid role with Biden's presidential campaign but remains a close adviser. “I think what Jeff’s doing is part of taking that vision — that vision that Vice President Biden and Sen. Sanders and others have had — and saying, ‘Hey, now how can we go make this happen?’”", "url": "https://www.huffpost.com/entry/sanders-advisers-form-super-pac-aimed-pushing-biden-left_n_5ea8c3a9c5b6123a1763e145"}