{"authors": ["Harmeet Kaur"], "date_download": "2020-05-04 16:15:56", "date_modify": "2020-05-04 16:15:56", "date_publish": "2020-04-03 00:33:32", "description": "Around the world, seismologists are observing a lot less ambient seismic noise -- meaning, the vibrations generated by cars, trains, buses and people going about their daily lives. And in the absence of that noise, Earth's upper crust is moving just a little less.", "filename": "2020_04_02_world_coronavirus-earth-seismic-noise-scn-trnd_index_1588608956.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/150422120801-earth-from-space-super-169.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_world_coronavirus-earth-seismic-noise-scn-trnd_index_1588608956.html", "title": "The coronavirus pandemic is making Earth vibrate less", "title_page": "The coronavirus pandemic is making Earth vibrate less - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Once-crowded city streets are now empty. Highway traffic has slowed to a minimum. And fewer and fewer people can be found milling about outside.\nGlobal containment measures to combat the spread of the coronavirus have seemingly made the world much quieter. Scientists are noticing it, too.\nAround the world, seismologists are observing a lot less ambient seismic noise -- meaning, the vibrations generated by cars, trains, buses and people going about their daily lives. And in the absence of that noise, Earth's upper crust is moving just a little less.\nThomas Lecocq, a geologist and seismologist at the Royal Observatory in Belgium, first pointed out this phenomenon in Brussels.\nBrussels is seeing about a 30% to 50% reduction in ambient seismic noise since mid-March, around the time the country started implementing school and business closures and other social distancing measures, according to Lecocq. That noise level is on par with what seismologists would see on Christmas Day, he said.\nRead More", "url": "https://www.cnn.com/2020/04/02/world/coronavirus-earth-seismic-noise-scn-trnd/index.html"}