{"authors": [], "date_download": "2020-05-04 20:05:57", "date_modify": "2020-05-04 20:05:57", "date_publish": "2020-04-08 13:27:42", "description": "OVERLAND PARK, Kan. (AP) — Officials in one Kansas City suburb have postponed their popular farmer's market amid concerns about the coronavirus, while another in Wichita is set to open...", "filename": "_82c4ab21c0ea5ff93a68bd51f612d372_1588622757.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_82c4ab21c0ea5ff93a68bd51f612d372_1588622757.html", "title": "Coronavirus response varied among Kansas farmers markets", "title_page": "Coronavirus response varied among Kansas farmers markets", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "OVERLAND PARK, Kan. (AP) — Officials in one Kansas City suburb have postponed their popular farmer’s market amid concerns about the coronavirus, while another in Wichita is set to open Saturday.\nLike grocery stores, farmers markets have been described in stay-at-home orders as “essential businesses” that can continue to operate.\nBut city officials in Overland Park, Kansas announced the markets’ postponed opening on Tuesday under pressure from the public, the Kansas City Star reported . The city had been planning to open the market for the season on Saturday, even as other Johnson County cities decided to postpone their own markets.\nCity spokesman Sean Reilly said the farmers market will open after Kansas’ stay-at-home order is lifted.\nMeanwhile, in Wichita, the Kansas Grown Farmers Market Board decided to proceed. Tricia Holmes, the president of the market’s board, said April isn’t as busy for the market. Tomatoes and melons aren’t ready, and fewer vendors attend, meaning crowds are smaller, The Wichita Eagle reports .\nHolmes said extra steps are being taken to keep people safe, such as spacing booths at least 10 feet (3.05 meters) apart and barring the distribution of free samples. The first hour will be for elderly and immune compromised shoppers.", "url": "https://apnews.com/82c4ab21c0ea5ff93a68bd51f612d372"}