{"authors": ["Kevin Liptak"], "date_download": "2020-05-04 16:55:01", "date_modify": "2020-05-04 16:55:01", "date_publish": "2020-04-08 16:46:15", "description": "President Donald Trump's aides have begun intensive discussions on a plan to reopen the US economy as soon as the start of May, according to people familiar with the deliberations, setting up what some officials predict could be another showdown between the President's health and economic advisers.", "filename": "2020_04_08_politics_donald-_2039598b6eec56438f5e89c34b42c0ca_index_1588611301.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407162544-01-trump-small-business-relief-0407-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_donald-_2039598b6eec56438f5e89c34b42c0ca_index_1588611301.html", "title": "Aides hope to give Trump his economic 'big bang' starting in May", "title_page": "Aides hope to give Trump his economic 'big bang' starting in May - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump's aides have begun intensive discussions on a plan to reopen the US economy as soon as the start of May, according to people familiar with the deliberations, setting up what some officials predict could be another showdown between the President's health and economic advisers .\nTrump himself has begun aggressively touting a potential turnaround in the outbreak, even as health officials caution it's too early to declare victory in the wake of the coronavirus pandemic\n\"FLATTENING OF THE CURVE!\" he wrote on Twitter on Wednesday. Speaking to state and local leaders during a phone conversation from the Oval Office later Wednesday, Trump signaled he was working on reopening the economy as \"quickly as possible.\"\n\"We're making tremendous progress. You see that,\" Trump said, according to audio obtained by CNN. \"You see what's going on with the bump, the hill, whatever you want to call it, it's really -- we're looking very good.\"\nOfficials said the options being discussed on reopening the country vary widely in scope, from recommendations on benchmarks for when individual states can begin easing restrictions to a nationwide \"big bang\" that Trump previewed Tuesday evening on Fox News. The officials said the conversations were still preliminary and would likely evolve over the course of the next weeks.\nStill, some officials have even begun mulling the type of event Trump may want to mark the day when nationwide restrictions are lifted after he suggested a \"big celebration\" when the crisis is over.\nThe extent to which Trump can declare the country \"reopened\" remains limited. The federal government's guidelines on closing businesses and restricting gatherings were merely recommendations, and decisions on how and when to actually reopen the country will lie mostly with governors who enacted mandatory stay-at-home orders.\nAmericans themselves will also need to feel comfortable returning to crowded restaurants and workplaces before the economy can return to normal. A CNN poll released Wednesday showed 60% of Americans say they would feel uncomfortable returning to their regular routines if social distancing guidelines were lifted after April 30, the current expiration date for Trump's recommendations.\nYet as data begin to show the severity of the outbreak potentially reaching its peak soon, discussions have accelerated in task force meetings and separate huddles with the President about what a reopening may look like.\nTrump said Wednesday it will be safe to reopen the country when \"we can say we have to be on that down side of that slope.\"\n\"We can do it in phases, go to some areas where -- you know, some areas are much less affected than others,\" he said. \"But it would be nice to be able to open with a big bang and open up our country, or certainly most of our country.\"\nTrump said he believes the US is \"ahead of schedule\" in efforts to slow the spread of coronavirus: \"You hate to say it too loudly because all of a sudden things don't happen, but I think we will be sooner rather than later.\"\nMultiple officials said this week the discussions could lead to a clash between health and economic advisers, who have disagreed over the past month on the extent and length of distancing recommendations for Americans.\nOn Wednesday morning, one of the President's top media defenders, Fox News host Laura Ingraham, tweeted: \"At some point, the president is going to have to look at Drs. Fauci and Birx and say, we're opening on May 1. Give me your best guidance on protocols, but we cannot deny our people their basic freedoms any longer.\"\nOfficials also acknowledged that persistent problems in testing Americans and tracing outbreaks could also delay a time when the federal government can recommend states return to normal.\nIncreasingly optimistic\nInside the White House, Trump and his aides have grown increasingly optimistic at the prospect the nation could be turning a corner soon, though health experts warn it's far too early to declare mission accomplished.\n\"Once we OPEN UP OUR GREAT COUNTRY, and it will be sooner rather than later, the horror of the Invisible Enemy, except for those that sadly lost a family member or friend, must be quickly forgotten. Our Economy will BOOM, perhaps like never before!!!\" Trump tweeted on Wednesday morning.\nDr. Anthony Fauci , the top infectious disease expert, said discussions on the topic of reopening the country went late into the evening in the White House Roosevelt Room on Tuesday evening.\n\"You don't want to let up at a time that's premature, but right now we are clearly looking at if we, in fact, are as successful as we hope to be over the extended 30 day period that the President announced several days ago -- namely extending the period of restrictions and guidelines to the end of April -- that if, in fact, we are successful, it makes sense to at least plan what a reentry into normality would look like,\" Fauci said in an interview on Fox News.\n\"That doesn't mean we're going to do it right now,\" Fauci continued, \"but it means we need to be prepared to ease into that.\"\nThe White House coronavirus task force has been grappling with questions over what the \"reopening\" of the economy looks like. There are some who believe that it can be a nationwide event versus others -- including medical experts -- who say a staggered or \"uneven\" reopening by region or industry seems more prudent.\nPreliminary planning has focused on how to geographically distinguish places that could reopen sooner, with the expectation that hard-hit areas like New York won't open any time soon.\nWeighing benchmarks\nThe task force has weighed benchmarks that might indicate a state is ready to loosen restrictions on businesses and gatherings, including a sustained 14-day period reduction in the number of confirmed cases, normal operations returned to hospitals and widely available testing.\nAs an example of some of the questions being thrown around the task force meetings, according to a source: \"Do you reopen restaurants but force bars to close on Friday nights so that they're not packed with people?\"\nOfficials have also weighed recommending certain spacing of tables in restaurants or limits on the number of people allowed to be inside any particularly establishment at one time.\nSome of Trump's advisers believe rural or smaller towns are on track for reopening in a quicker time frame and want to focus on how to best identify those areas. But others on the team, and Trump himself, seem to be eyeing a more widespread announcement.\n\"We're looking at the concept where we open sections of the country and we're also looking at the concept where you open up everything,\" the President said, speaking to Fox News' Sean Hannity Tuesday night.\n\"I'd love to open with a big bang, one beautiful country, and just open,\" he said. \"It's very possible.\"\nA central hurdle for the administration remains the availability of widespread testing, which Trump's health experts acknowledge is still an issue. Many inside the White House fear the ongoing struggle to ramp up testing could impede any reopening efforts.\nWhile testing has increased rapidly since the fraught early days of the outbreak, many states have still only tested small percentages of their populations.\nThe White House has worked to develop a more robust testing strategy, including shipping new rapid tests developed by Abbott Laboratories to states. Dr. Deborah Birx , the White House coronavirus response coordinator, pleaded with state health officials during a briefing on Tuesday to get their Abbott testing devices online.\nThe White House has also worked to scale up serology testing, used to detect antibodies that would identify people who are likely immune to coronavirus and who could return to work or other aspects of normal life.\n\"This will be able to tell you, have you had it, are you likely immune to it, and are you really likely very safe to go back to work and not risk exposing other people,\" said Brett Giroir, the assistant secretary for health at the Department of Health and Human Services, in an interview on Fox Business. Giroir has been tasked with leading testing efforts. \"You're going to see these tests mix over the next month, but we're still going to be actively surveilling for people who may have the active virus.\"", "url": "https://www.cnn.com/2020/04/08/politics/donald-trump-economy-big-bang-coronavirus/index.html"}