{"authors": ["Clare Duffy", "Charles Riley", "Cnn Business"], "date_download": "2020-05-04 16:25:33", "date_modify": "2020-05-04 16:25:33", "date_publish": "2020-04-06 22:46:57", "description": "Global stocks and US futures advanced on Tuesday on hopes that the coronavirus crisis may be easing in some of the places that have been hit hardest.", "filename": "2020_04_06_investing_global-stocks_index_1588609533.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406221812-asia-financial-outlook-0407-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_investing_global-stocks_index_1588609533.html", "title": "Global stocks and US futures move higher on coronavirus optimism", "title_page": "Global stocks and US futures move higher on coronavirus optimism - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York/London (CNN Business) Global stocks and US futures advanced on Tuesday on hopes that the coronavirus crisis may be easing in some of the places that have been hit hardest.\nHang Seng HSI Shanghai Composite SHCOMP Japan's Nikkei advanced 2%, while Hong Kong'sadded 2.1%. China'sincreased 2% as investors returned from a holiday. In Europe, benchmark indexes in Paris, Frankfurt and London opened with gains of more than 3%.\nDow INDU S&P 500 SPX Nasdaq COMP futures were up 3.1%, or 690 points, suggesting the index could move higher again after closing with a 7.7% gain on Monday.futures added 2.7% andfutures increased 2.5%.\nThere are indications the pandemic may be easing in Italy and Spain, and New York Governor Andrew Cuomo said Monday that daily deaths caused by the coronavirus in his state have been \"effectively flat for two days.\" China recorded no new deaths from the virus on Monday for the first time since late January.\nVIX VIX The CNN Business Fear & Greed Index , which looks at thevolatility gauge and six other measures of market sentiment, is now registering Fear levels as opposed to Extreme Fear. The index is at 32. Anything at 25 or under is Extreme Fear.\nRead More", "url": "https://www.cnn.com/2020/04/06/investing/global-stocks/index.html"}