{"authors": [], "date_download": "2020-05-04 20:23:35", "date_modify": "2020-05-04 20:23:35", "date_publish": "2020-04-20 16:39:29", "description": "GENEVA (AP) — The World Health Organization chief warned Monday that “the worst is yet ahead of us” in the coronavirus outbreak, reviving the alarm just as many countries ease restrictive measures...", "filename": "_bbf94a368f638e09ff5a45d06b886250_1588623815.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bbf94a368f638e09ff5a45d06b886250_1588623815.html", "title": "WHO head warns worst of virus is still ahead", "title_page": "WHO head warns worst of virus is still ahead", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GENEVA (AP) — The World Health Organization chief warned Monday that “the worst is yet ahead of us” in the coronavirus outbreak, reviving the alarm just as many countries ease restrictive measures aimed at reducing its spread.\nWHO Director-General Tedros Adhanom Ghebreyesus didn’t specify why he believes the outbreak that has infected some 2.5 million people and killed over 166,000 could get worse. He and others, however, have previously pointed to the likely future spread of the illness through Africa, where health systems are far less developed.\n“Trust us. The worst is yet ahead of us,” Tedros told reporters from WHO headquarters in Geneva. “Let’s prevent this tragedy. It’s a virus that many people still don’t understand.”\nSome Asian and European governments have gradually eased or started relaxing “lockdown” measures like quarantines, school and business closures and restrictions on public gatherings, citing a decline in the growth of COVID-19 case counts and deaths.\nTedros and his agency have been on the defensive after President Donald Trump of the United States — the WHO’s biggest single donor — last week ordered a halt to U.S. funding for the agency, alleging that it botched the early response to the outbreak.\nAmong other things, Trump insisted WHO had failed to adequately share “in a timely and transparent” way information about the outbreak after it erupted in China late last year.\nTedros said: “There is no secret in WHO because keeping things confidential or secret is dangerous. It’s a health issue.”\n“This virus is dangerous. It exploits cracks between us when we have differences,” he said.\nTedros said U.S. Centers for Disease Control and Prevention staffers have been seconded to work with his agency, suggesting that was a sign of WHO’s transparency.\n“Having CDC staff (at WHO) means there is nothing hidden from the U.S. from Day One” Tedros said. “Our CDC colleagues also know that we give information immediately to anyone.”\nFull Coverage: Virus Outbreak\nIn one of his starkest comparisons yet, the U.N. health agency chief also alluded to the so-called Spanish flu more than a century ago, saying the coronavirus has a “very dangerous combination ... like the 1918 flu that killed up to 100 million people.”\nTedros called the illness “Public Enemy No. 1,” and said: “We have been warning from Day One: This is a devil that everybody should fight.”", "url": "https://apnews.com/bbf94a368f638e09ff5a45d06b886250"}