{"authors": ["Elliott Moore"], "date_download": "2020-05-04 20:20:43", "date_modify": "2020-05-04 20:20:43", "date_publish": "2020-04-16 01:01:36", "description": "The weekly fishing report as compiled for the Texas Parks and Wildlife Department for April 15 and also available on the internet at...", "filename": "_1453a359401f6d436f49124252990dd1_1588623643.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1453a359401f6d436f49124252990dd1_1588623643.html", "title": "Texas Fishing Report", "title_page": "Texas Fishing Report", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The weekly fishing report as compiled for the Texas Parks and Wildlife Department for April 15 and also available on the internet at https://tpwd.texas.gov/fishboat/fish/recreational/fishreport.phtml:\nCENTRAL\nAUSTIN: GOOD. Water clear; 72 degrees; 0.74’ low. Largemouth bass are excellent on crankbaits, chatter baits, and plastic worms in shallow coves. Sunfish are good on cutworms, and corn in the shallower structure of docks. Catfish are good on prepared baits and cut bait.\nBASTROP: FAIR. Water stained; 70 degrees. Largemouth bass are fair fishing creeks, and coves on Carolina rigged plastics, swimbaits, and crankbaits. Crappie are fair on minnows and jigs. Channel and blue catfish are good on cut bait and stinkbait.\nBELTON: GOOD Water lightly stained; 67 degrees; 0.90 high. Black bass are good in creek mouths and coves on bladed spinners with some post-spawn fish in 8-10’. White bass are good. Hybrid stripers are fair trolling jigs and diving crankbaits in the main lake. Crappie are fair on minnows and jigs in the creeks and brush piles. Catfish are good on prepared baits.\nBROWNWOOD: FAIR. Water clear; 66 degrees; 0.77’ low. Largemouth bass are fair with crankbaits and plastic worms in shallow water grass. White bass are fair on minnows and jigs. Catfish have been good on prepared bait in 12-18’.\nCANYON LAKE: EXCELLENT. Water clear; 70 degrees; 2.60’ low. Striper fishing is good on main lake humps vertically jigging striper jigs and topwater baits. White bass are good on main lake points and humps. Look for birds diving over feeding schools. Largemouth bass are excellent in creeks, and grassy shorelines with square billed crankbaits, jerk baits, plastic lizards and worms, and bladed spinners with some fish taken on topwater plugs. Catfish are good with live and cut bait throughout the lake in 6-15’.\nFAYETTE: GOOD. Water lightly stained; 72 degrees. Largemouth bass are excellent on plastic worms and shallow running crankbaits. Sunfish are very good on worms and crickets around bank ledges and structure. Catfish are excellent on cut bait.\nGRANBURY: GOOD. Water clear; 63 degrees; 0.07’ high. Largemouth bass are good on chatter baits and flipping bass jigs in creeks and shallow water. Crappie fishing is good around brush piles, boat docks with minnows, and blue/white jigs. Catfishing is good when using cut bait or live bait in 10-20’. White bass are excellent. Troll for stripers.\nGRANGER: GOOD. Water stained; 65-68 degrees; 0.63’ high. Black bass are good up creeks on crankbaits, bass jigs and soft plastic worms. Crappie are good on minnows and jigs. White bass are good on swimbaits and slabs. Catfish are good on cut shad.\nLBJ: GOOD. Water clear; 70 degrees; 0.64’ low. Black bass are good in secondary spawn phase in creeks and coves on topwater (early), Texas rigged plastic creatures, spinners, and shallow diving crankbaits. Crappie are good on jigs around brush, marinas and docks. White bass are excellent over main lain points and humps. Catfish are good on stinkbait and cut bait in 15’.\nNAVARRO MILLS: GOOD. Water lightly stained; 69 degrees; 3.69’ high. Crappie are good on minnows around the marina and in the creeks. Catfish are very good with punch bait. White bass are good on jigs in shallow inlets and creeks. Black bass are good with top waters, spinners and buzz baits in shallow coves and grass lines.\nPROCTOR: GOOD. Water clear; 69 degrees; 0.23’ high. Largemouth bass are excellent on Carolina rigged creatures and worms and with jigs in shallow water and coves. Hybrid stripers are good. Crappie are very good with jigs and minnows in shallow water. Catfish remain good on stinkbait and cut bait.\nSOMERVILLE: GOOD. Water clear; 68 degrees; 0.33’ high. White bass and hybrids are good fishing slabs and jigs in 25-40’. Crappie are good with minnows and jigs in 14-20’. Catfish are good throughout the lake with cut shad and stinkbait in 7-20’. Largemouth bass are good with plastic worms, crankbaits, spinners, and top waters near the creeks and coves.\nSTILLHOUSE HOLLOW: GOOD. Water clear; 70 degrees; 1.01’ low. Black bass are good on crankbaits, spinners, and Carolina rigged soft plastic worms working vegetation in creeks and coves. Crappie are good on minnows and jigs in creeks. White bass are good on small crankbaits and jigs in creeks and main lake points. Catfish are very good with live and cut bait.\nTRAVIS: EXCELLENT. Water clear; 75 degrees; 7.15’ low. Largemouth bass are excellent fishing creeks and coves. For the secondary wave of spawning fish, work plastic worms and creatures, topwater, and crankbaits. Post-spawn fish are caught in deeper water 8-12’. White bass are good in working jigs, crankbaits, and slabs working main lake points and humps. Crappie are good on minnows and jigs in 12-20’. Catfish are good on cut bait in 5-15’.\nWALTER E. LONG: GOOD. Water lightly stained; 67 degrees. Largemouth bass are good on plastic worms and lizards, short-billed crankbaits in creeks, grass lines, and shallow coves. Hybrid stripers are good with jigs and live bait. Crappie are good on minnows and jigs in shallow water. Catfish are good on live bait and stinkbait. Sunfish are good.\nWACO: GOOD. Water clear; 68 degrees; 0.13’ high. Largemouth bass are good on spinnerbaits, plastic frogs, and other topwater baits as well as chatter baits in the coves and creeks. Crappie are good on minnows and jigs. Sunfish are good on worms or crickets. Channel and blue catfish are excellent on cut shad or live bait.\nWHITNEY: GOOD. Water clear; 64 degrees; 0.30’ high. Black bass are good on crankbaits, topwater and plastic worms fishing spawning areas and coves 8-10’. White bass are excellent in creeks and main lake with jigs and slabs. Stripers are excellent jigging and with live bait fishing the main lake. Crappie are fair with minnows and jigs in shallow water. Catfish are good on cut shad and prepared baits.\nNORTHEAST\nARLINGTON: GOOD. Water lightly stained; 66 degrees; 0.55 low. Largemouth bass are good in creeks and coves on topwater plugs, lipless crankbaits, and drop shots. Some fish are being caught in 8-12’ during the post-spawn. Crappie are fair among structures such as boat docks and partially shaded vegetation on small minnows and jigs. Catfish are good on live bait and prepared baits in 12-20’ with some fish being caught in 3-6’.\nATHENS: EXCELLENT. Water clear; 67 degrees; 0.94’ high. Largemouth bass are excellent on Carolina rigged worms, chatter baits, and bladed spinnerbaits working the vegetation edges of shoreline and creeks. Crappie are excellent with minnows and jigs among natural and man-made structures and creeks. Catfish are good on cut bait. Sunfish are good on cutworms.\nBENBROOK: GOOD. Water stained; 66 degrees; 4.93’ high. Largemouth bass are good fishing spinners and crankbaits in creeks and coves. Crappie are fair on minnows and jigs in creeks. Hybrid striped bass are fair. White bass are good with small spoons and jigs in creeks and lake points. Catfish are good on trotlines with cut bait.\nBOB SANDLIN: EXCELLENT. Water lightly stained; 67-72 degrees; 0.77’ high. Black bass are excellent on square billed crankbaits, plastic lizards, and topwater baits in shallow (1-3’) and deeper (7-12’) water. Crappie are excellent on jigs and minnows in creeks fishing 1-2’ with fish caught in 12-20’ around brush piles and submerged structure. Catfish are excellent on cut bait in 6-18′.\nBRIDGEPORT: GOOD. Water lightly stained; 69 degrees; 0.08’ high. Black bass are good on shallow running crankbaits, top waters, and Texas rigged creature baits in 1-5’ and 8-15’. Crappie are good on minnows and jigs fishing bridges and brush piles. White bass are good on jigs and swimbaits on main lake points. Hybrid stripers are good on humps and points. Catfish are good on cut bait and live bait in 10-20’.\nCADDO: EXCELLENT. Water lightly stained; 67-71 degrees; 2.06 high. Largemouth bass are excellent in shallow water spawning in trees and cover in 1-4’ fishing plastic darker colored creatures, frogs, and crankbaits. Crappie are good on minnows and jigs in brush piles and submerged structure. White bass are good on jigs and small crankbaits in the main lake. Chain pickerel are fair. Catfish are excellent on prepared bait and live bait in 8-18’.\nCEDAR CREEK: GOOD. Water lightly stained; 66 degrees; 0.38’ high. Largemouth bass are in coves in 1-5′ plastic creatures, topwater and bladed spinnerbaits are producing quality fish. Bass are also biting in 8-14’ plastic worms and crankbaits. Hybrids and sand bass are being caught off main lake points with slabs, jigs, and live bait. Crappie are around brush pile and structure in 12-18’. Some docks are starting to hold fish as well. Jigs and minnows are both effective. Catfish are good on the shallow north end of the lake and also moving shallow all over the lake. There are still some deep fish as well, so don’t rule that out. Fresh cut shad is best.\nCOOPER: GOOD. Water clear; 70 degrees; 1.04’ high. Largemouth bass are good on Texas rigged worms and creatures, crankbaits, and frogs in 10’ or less. The white bass are good in deeper water with slabs, jigs and jigging spoons. Catfish are good on live and cut bait in 8-16’.\nEAGLE MOUNTAIN: GOOD. Water stained; 67 degrees; 0.09’ high. Black bass are good fishing coves with plastic frogs, jigs and plastic worms in 2-14’. White bass are good in the main lake. Crappie are good on minnows and jigs between 10-20’ working docks and structures. Catfish are good on fresh cut bait and punch bait.\nFORK: GOOD Water lightly stained; 63-66 degrees; 0.00’. Largemouth bass are excellent on plastic lizards, topwater, and chatter baits and frogs for spawning fish in shallow areas with some fish holding on post-spawn areas such as roadbeds, submerged structure, and points in 8-12’. White and yellow bass are good deeper water off main lake points and humps. Crappie are good on jigs and minnows in 12-25’. Catfish are good on cut bait and punch bait in 10-20’.\nGRAHAM: GOOD. Water clear; 64 degrees; 0.04’ high. Largemouth bass are good in shallow water on plastic worms, buzz baits, and crankbaits. Crappie are excellent on jigs and minnows. White bass are excellent on jigs. Hybrid stripers are good on slabs in deep water and humps. Catfish are good on cut shad and live bait.\nGRAPEVINE: FAIR. Water muddy; 65 degrees; 12.38’ high. Largemouth bass are fair on buzz baits, and square billed crankbaits. Fish creeks, flooded flats, and shallow structure. White bass are good in 25-35’. Look for birds diving over feeding schools. Crappie are good on minnows and jigs in marinas and submerged structure. Catfish are fair on cut bait.\nJACKSONVILLE: GOOD. Water lightly stained; 69 degrees; 0.42′ high. Largemouth bass are good with crankbaits, creatures and spinners, in shallow spawning areas and 8-12’ for post-spawn fish. Crappie are good on jigs and minnows in 10-20’ around submerged structure. Catfish are good on cut shad and prepared bait.\nJOE POOL: GOOD. Water stained; 64-69 degrees; 3.75’ high. Largemouth bass are good fishing Texas rigged lizards in Junebug and watermelon colors as well as shallow-running crankbaits along banks of coves in 6-12’. Crappie are good beneath bridges and with black/white and blue/white jigs and minnows. Catfish are good on fresh cut bait and stink baits.\nLAKE O’ THE PINES: GOOD. Water stained; 66 degrees; 6.03’ high. Largemouth bass are fair on crankbaits, topwater baits and Texas rigged creature baits in shallow coves for spawning fish and 8-14’ for post-spawn bass. Crappie are good on minnows and jigs in the timber areas 14-24’. Catfish are excellent on cut bait and blood bait in 10-16 feet of water.\nLAVON: GOOD. Water stained; 67-70 degrees:3.17 high. Crappie are excellent on minnows fishing 12-25. White bass are excellent in the 25-40’ with jigs and slabs. Look for birds diving over feeding schools. Black bass are good on crankbaits, top waters, lizards and jigs in 4-12’. Catfish are good on prepared baits and live bait.\nLEWISVILLE: GOOD. Water stained; 68 degrees; 3.83’ high. Black bass are good fishing the crankbaits, spinners, and Texas rigged plastic creatures. White bass are good on slabs and jigs in 20-35’. Look for birds feeding schools. Crappie are good on minnows and jigs around brush piles and bridges. Catfish are good on cut bait and prepared bait.\nMARTIN CREEK: GOOD. Water lightly stained; 68 degrees; 0.21′ high. Largemouth bass are good on crankbaits, and Texas rigged worms in shallow coves 4-12’. Crappie are good on jigs and minnows in 12-18’. Catfish are good on cut bait in 6-15’.\nPALESTINE: GOOD. Water clear; 64 degrees; 0.95’ high. Largemouth bass are good in shallow water working TEXAS rigged soft plastics and crankbaits. Crappie are good on jigs and minnows around bridges and marinas in 10-18’. Hybrid stripers are good on slabs and trolling. White bass are excellent on swimbaits and jigs in 25-45’. Look for birds diving over feeding schools. Catfish are good on cut shad, chicken livers and prepared baits.\nPALO PINTO: GOOD. Water lightly stained; 68 degrees; 0.11’ low. Largemouth bass are good in coves and creeks with Carolina rigged creature baits, plastic frogs, and topwater plugs from 3-12’. Crappie are good on minnows and jigs in brush piles in 12-20’. White bass are good on jigs on main lake points and humps. Striped bass are good on live shad and jigs. Catfish are good on prepared baits in 8-18’.\nRAY HUBBARD: GOOD. Water clear; 65-70 degrees; 0.20’ high. Largemouth bass are good on crankbaits, plastics, and top waters in water less than 5’. White bass are good caught on swimbaits and jigging spoons on main lake points, humps, and deep flats. Look for birds diving over feeding schools. Crappie are caught near bridges and marinas. Catfish are good on cut bait.\nRAY ROBERTS: GOOD Water stained; 64 degrees; 5.03’ high. Largemouth bass are good flipping plastic creatures and working crankbaits and spinners in 2-12’. White bass are excellent in 20-40’ on slabs. Crappie are good on jigs and minnows in the marina, bridges and brush piles. Catfish are good on live bait and cut bait.\nRICHLAND CHAMBERS: EXCELLENT. Water stained; 71 degrees; 0.60’ high. Largemouth bass are good on crankbaits, plastic lizards and frogs, and topwater baits fishing 3-12’ near submerged vegetation and creeks. White bass and hybrids are excellent on jigs and swimbaits under birds. Crappie are good on minnows and jigs near structure. Catfish are excellent on live bait and cut bait in shallow water.\nSQUAW CREEK: GOOD. Water lightly stained; 74 degrees; 0.47’ high. Catfishing is good working baited areas in 6-15’ using punch bait and cut bait. The largemouth bass fishing is good around shallow structures on soft plastic worms and crankbaits. Crappie are good on minnows and jigs.\nSULPHUR SPRINGS: FAIR. Water stained; 69 degrees; 1.17’ low. Largemouth bass are fair on topwater baits and plastics in creeks and shallow water. Crappie are good on minnows and jigs. Catfish are good on cut shad and live bait in 6-15’.\nTAWAKONI: EXCELLENT. Water lightly stained; 70 degrees; 0.62’ high. Catfish are excellent on live bait and cut bait 6-18’. Largemouth bass are good on spinnerbaits, plastic worms, and square billed crankbaits in coves and creeks. White bass and hybrid stripers are excellent on swimbaits and slabs working birds when active. Crappie are good on minnows and jigs around structure including docks and marinas.\nTEXOMA: GOOD. Water stained; 67 degrees; 0.68’ high. Striped bass and white bass are excellent on live bait. Largemouth bass are good fishing plastic creatures and crankbaits in shallow water spawning areas. Crappie are good on minnows and jigs by boathouses, marinas, creeks, and inlets. Catfish are good on cut bait, and minnows in 8-18’.\nTYLER: EXCELLENT. Water clear; 67 degrees; 0.97’ high. Black bass are excellent on Carolina rigged creature baits as well as spinners and jigs fishing dock structures and natural shorelines in creeks and coves. Crappie are excellent on jigs and minnows. Catfish are excellent on stinkbait and live baits. White bass are good in 25’.\nWEATHERFORD: GOOD. Water lightly stained; 64-68 degrees; 0.05’ high. Largemouth bass are good on spinnerbaits, top waters, and worms working shallow water coves. White bass are excellent in 15-35’. Crappie are excellent on minnows and jigs around docks and marinas and creeks. Catfish are good on crawfish and cut bait.\nWORTH: GOOD. Water stained; 66 degrees; 0.14’ high. Largemouth bass are good with spinners, lipless crankbaits and worms working coves and creeks. Crappie are good on minnows and jigs among vegetation beds and under docks. Catfish are good on live bait and cut bait.\nWRIGHT PATMAN: FAIR. Water stained; 64 degrees; 12.59’ high. Largemouth bass are slow on worms and jigs working creeks and coves. White bass are good on spoons and jigs. Crappie are fair on jigs in creeks. Catfish are good on cut bait, live bait and stinkbait.\nSOUTH\nAMISTAD: GOOD. Water lightly stained; 70-72 degrees; 41.55’ low. Continue fishing the Devil’s River portion of the lake for largemouth success. Seasonally, this is the best time of the year and isn’t disappointing. Continue working topwater, spinners, crankbait, and worms. White bass are fair with minnows mainly on shallow points. Catfish are fair on cut bait. Remember to stay on the Texas side of the lake unless you possess a Mexican fishing license.\nCALAVERAS: GOOD. Water stained; 71-73 degrees. Red drum remain great on crawfish and tilapia in mainly open water and some coves. Largemouth are good with topwater, worms, spinners, and crankbait staying with structure. Research your weather conditions for the best success. Hybrid striped bass remain fair. Catfish are good on chicken livers and cut shad.\nCHOKE CANYON: FAIR. Water lightly stained; 72-74 degrees; 18.18’ low. Largemouth bass are good with jigs, topwaters, spinners, and worms. Try fishing vegetation, shallow structure, and creeks. White bass remain good in the mouth of the Frio River and working out to points still in structure. Crappie are good on jigs improving a lot this past week. Catfish are fair in shallow water vegetation and river channels with live bait and cheese bait.\nCORPUS CHRISTI LAKE: GOOD. Water lightly stained; 73-74 degrees; 4.01’ low. Largemouth bass are having the best week of the year! Fish structure, vegetation, and points with spinners, rattletraps, crankbaits, topwater, and plastic worms. White bass remain good in the mouth of the Nueces River working out. Crappie are good fishing live minnows in structure. Catfish are good on cut bait and cheese bait.\nFALCON: GOOD. Water lightly stained; 72 degrees; 39.80’ low. Check boat ramps before you head out because Zapata County Park is closed. All tournaments are canceled till further notice. Black bass remain good on the south end of the lake. Fish rocks and creek channels in the hardwoods. Not much has changed from last week. Crappie are excellent in the hardwoods. Catfish are good on live and prepped baits. Remember to stay on the Texas side unless you possess a Mexican fishing license.\nMEDINA: FAIR. Water lightly stained; 72 degrees; 12.82’ low. Black bass are good on topwater at dusk, crankbaits, and jigs all day. Sunlight and cloud cover are making the biggest difference between good and average days with overcast days excelling. Water has become murky after spring storms affecting visibility. White bass remain fair on spoons and jigs near points and feeder streams. Striped bass are slow. Catfish are fair on live bait, chicken livers, and blood baits.\nTEXANA: FAIR. Water stained; 73 degrees; 3.04’ low. Largemouth bass are good on worms, jigs, buzzbait, crankbaits topwater, and light spinners. The traditional shallow structures are popping. Crappie remain fair on jigs working creek channels. Catfish are good on stinkbait, cut bait, and live bait. Trotlines remain great with live bait.\nSOUTHEAST\nBRAUNIG: GOOD. Water lightly stained; 73 degrees. Largemouth bass remain good fishing typical spots near vegetation and rocky points using Carolina rigged plastic worms, spinners, and jigs. Red drum are good on crawfish and tilapia following birds in open water. Strippers are elusive. Catfish are good on live bait and cheese bait.\nB.A. STEINHAGEN: GOOD. Water stained;73 degrees; 0.58’ low. Largemouth bass remain good with topwater, worms, and spinners fishing creek structures and cove points. Crappie couldn’t be better by fishing in shallow structures with minnows. Catfish are good on cut and prepped bait coming out of the river.\nCONROE: GOOD. Water stained; 74 degrees; 0.26’ low. Largemouth bass are good consistently performing on topwaters, soft plastics, and spinners. Crappie are good on minnows and jigs. Hybrid striped bass remain slow. Catfish are good on stinkbait and cut bait. Sunfish are fair with live worms or crickets in shallow water.\nGIBBONS CREEK: GOOD. Water stained; 74 degrees. Largemouth bass remain great on Carolina rigged worms, spinners and crankbaits. Crappie are fair on jigs and spinners. Catfish are fair on live bait. Sunfish are fair on cutworms shallow.\nHOUSTON COUNTY: GOOD. Water clear to lightly stained; 73-75 degrees; 0.30’ high. Black bass are good on Junebug colored worms 2-3 feet from the surface on the south side of the dam. Some catches have occurred in 2-5’ of water using watermelon red weightless worms and flukes. Crappie are excellent, limiting out off the southeast points using live minnows. Catfish are good on live perch from piers, and using trotlines with 3-15’ hooks in 20′ of water for ops at 30 and 22 pounds each, and 15 blue cats from 3 to 8 pounds each using 3” perch.\nLIVINGSTON: FAIR. Water lightly stained; 72 degrees; 0.30’ high. Black bass are good with several lunkers this past week. Fish creek openings, points, and ledged drops. Striped bass are fair. Crappie are good on minnows and jigs in most structures under 6 feet. White bass remain good on spoons. Catfish are fair on live baits.\nNACONICHE: GOOD. Water slightly stained; 73 degrees. Largemouth bass remain good on spinners, crankbaits, and creature baits. All structures less than 10 feet have been successful. Crappie are good on jigs in shallow structures. Sunfish are fair on jigs and crickets. Catfish are good on dough balls, and cut and live bait.\nRAVEN: GOOD. Water stained; 74 degrees. Largemouth bass are good with Carolina rigged plastics, spinners and jigs fishing drops, mid-depth points, and in creek structures. Sunfish are fair on crickets and cutworms among any shallow structure under 5′.\nSAM RAYBURN: FAIR. Water stained; 73 degrees; 0.35’ high. Largemouth bass remain good on points, in submerged vegetation, and shallow nests. Topwater has been the most improved bait. White bass are fair with minnows. Crappie are excellent on minnows and jigs catching limits. Catfish are good on live and stinkbait.\nTOLEDO BEND: FAIR. Water slightly stained; 72 degrees; 0.31’ high. Largemouth bass are good with vegetative cover. Striped bass are fair on humps and deep water. White bass are fair similar to largemouth locations. Crappie are good on minnows in structure. Channel and blue catfish are fair on stinkbait. Louisiana is not allowing fishing due to Covid-19, so ensure your trip is on the Texas side of Toledo Bend.\nPANHANDLE\nCISCO: FAIR. Water clear; 62-63 degrees; 2.59’ low. Largemouth bass are increasing in success to great with jigs and spinners in creek structure. Sunfish are consistently good on minnows and cutworms. Crappie are good on jigs and minnows in the same creeks as bass. We have been using jigs and catching both bass and crappie. Catfish are fair at night on nightcrawlers, liver, and cut shad all over the lake.\nMEREDITH: FAIR. Water stained; 63 degrees; 46.64’ low. All docks and piers are closed to fishing due to COVID-19. Black bass are fair on crankbaits, spinners, and minnows in the holes and traditional structures. Walleye remain good on crankbaits. Crappie are fair fishing minnows and jigs. Channel catfish are fair on cut bait and live bait near the dam.\nMILLERS CREEK: GOOD. Water stained; 62-63 degrees; 1.06’ high. Largemouth bass remain good in spawning spots, flooded timber, and creeks. The best success has come on spinners, crankbaits, and worms. Crappie remain great on minnows and jigs. White bass and hybrids are good on rattle traps in the deeper coves and points. Catfish are good in the upper lake with live, blood, and liver prepared baits.\nWEST\nALAN HENRY: GOOD. Water clear; 60 degrees; 0.80′ low. Black bass are good on jigs, spinners, and shaky heads fishing beds and the shallow running areas close to beds. Currently, there is an increase in mid-day success. Crappie are good on minnows fishing most structure less than 8 feet. Catfish are fair on live bait and stinkbait.\nARROWHEAD: FAIR. Water stained; 60 degrees; 0.62’ low. Largemouth bass are good with increased activity along rocks and close to spawning spots fishing spinners, jigs, and crankbait. Crappie are good on live minnows and jigs. Catfish are good on cheese bait, stinkbait and shrimp with trotline success.\nCOLEMAN: FAIR. Water slightly stained; 58-59 degrees; 0.45’ low. Hybrid stripers remain great. Largemouth bass remain great on topwaters at dusk plus dawn, jerkbaits, and worms in structures and rivers not getting more than 10 feet off the banks, and 6 feet deep. Crappie are good on jigs. Catfish are fair with stinkbait and cut bait.\nFORT PHANTOM HILL: GOOD. Water stained; 58-59 degrees; 0.41’ high. White bass are good fishing points out from creeks and coves with Alabama Rigs. Black bass are in full spawn remaining good among holes and vegetation with worms and spinners. Crappie are good on live minnows and jigs. Catfish are fair on cut shad and stinkbait all throughout the lake.\nHUBBARD CREEK: GOOD. Water stained; 58-59 degrees; 0.14’ low. Largemouth bass are very successful in our favorite time of year. Spinners, worms, and jigs are working well shallow and those hidden secluded holes. Crappie remain great in numbers fishing with live minnows. White bass are good deeper in the creeks. Catfish are fair on live and cut shad.\nNASWORTHY: GOOD. Water murky; 57-59 degrees; 0.93’ low. Black bass remain great with numbers of fishing spawn structures and shallower coves. The best success has been on fast spinners and jigs. Crappie are good beneath docks and bridges on minnows and jigs. White bass are fair on points. Catfish are fair on live and prepped baits throughout the lake.\nOAK CREEK: FAIR. Water lightly stained; 57-58 degrees; 0.89’ low. Largemouth bass remain great in creeks, shallower vegetation, and holes. Best bait choices have been worms, spinners, and buzzbait. Crappie remain good with tons of keepers on live minnows. White bass remain fair. Catfish are fair on nightcrawlers, live bait, and cut bait.\nO.C. FISHER: FAIR. Water stained; 57-58 degrees. 37.50’ low. Largemouth bass remain good in vegetation, coves, and with everything being shallow, there are many new honey holes. Crappie remain fair on minnows and jigs. White bass are fair fishing creek mouths and points to them. Catfish are fair with limited structure on live and cut bait.\nO.H. IVIE: GOOD. Water clear; 58-60 degrees; 8.85’ low. Black bass are great still spawning in the river with cover and flooded timber by fishing worms and spinners. We’ve seen some signs of slowing, but then the next day was the best all year. Crappie are good with live minnows and jigs. Catfish are good on stinkbait, and live and cut bait. White bass are fair in creeks and river structures.\nPOSSUM KINGDOM: FAIR to GOOD. Water clear; 60- 61 degrees; 0.17’ low. Largemouth are fair to good with Carolina rigged worms, spinners, and jigs. Islands and their surrounding vegetation are the hot spots this week. White bass remain good throughout the river channel, moving deeper. Crappie are increasing in coves and under docks. Striped bass are slow. Catfish are good on cut shad.\nSPENCE: FAIR. Water stained; 60-61 degrees; 36.30’ low. Largemouth are moving rapidly around creeks, coves, and vegetation fishing the mornings with topwater and worms. White bass remain fair on points of creeks. Catfish are fair on live and cut bait.\nSTAMFORD: FAIR. Water stained; 60-61 degrees; 0.96’ high. Largemouth bass are good in coves, creeks, any vegetative structure with worms, spinners, and topwater before 11 am. Crappie are good on minnows fishing stumps and drops. White bass are fair on live shad and slabs. Catfish are fair on live bait and stinkbait.\nTWIN BUTTES: FAIR. Water stained; 59-60 degrees; 7.36’ low. Black bass remain good in North Lake structures. Baits used to success have been spinners, worms, and topwater. Crappie are good on minnows and jigs in less than 4 feet of water with structure. White bass are moving back to points from feeders. Catfish are fair on live and prepped baits throughout the lake.\nWHITE RIVER: SLOW. Water stained; 59-60 degrees; 21.12’ low. Drought conditions continue to be in place. Please check boat ramp access. The Largemouth bass spawn looks to be in the middle of the phase. Catches are happening on jigs, worms, and spinners near obvious holes and structure. Crappie are good on jigs and minnows shallower than before. Walleye is fair with increased activity. Catfish are fair on live bait, cut bait and stinkbait.\nCOASTAL\nSABINE LAKE: FAIR. Water stained; 73-75 degrees. Unchanged. Speckled trout: Best trout fishing is on the lower one half of Sabine Lake along shorelines. As soon as winds subside, there should be trout along jetties or beachfront. Best lures are jig and soft plastics or suspending twitch baits. Live shrimp is good if you can find it. Redfish are best on the jetties, the ship channel, or in the marsh areas. The shoreline of the lake is spotty right now. Live finger mullet, mud minnows, or jigs and soft plastics will work. The spring flounder run is on, but I am not finding large numbers. However, some nice ones are moving into the lake and marsh areas. We have been taking several flounder each day on jigs and soft plastics up to four pounds. Due to the coronavirus, we are not able to cross into Louisiana right now, so we have to launch on the Texas side to fish.\nPORT MANSFIELD: GOOD. 76-77 degrees. All boat ramps are closed in port. Those who have slips on the water can still get out to fish. With the bull spring tides, the water levels have come up, and places you were fishing have changed. You will want to move in closer to the bank or areas you couldn’t access now, as there is plenty of water and fish. Good numbers of trout are out on the flats in 3-5′. With reds mixed in on topwater, kwiggler ball tail and live shrimp. Both reds and flounder can be caught in the back bays on topwater and kwiggler willow tail in dirty jalapeño. Fish can be scattered, but with the higher water levels, once you find them, there’s plenty to be caught.\nTRINITY BAY: GOOD. 72-74 degrees. Check local ordinances related to the current pandemic as well as the status of the location you plan on fish. Follow local ordinances. Wade fishing the shoreline with artificial bait or drifting over the shell reefs off the boat are the best ways to catch redfish or speckled trout here. Flounder are good on minnow around the rocks.\nEAST GALVESTON BAY: GOOD. 70-73 degrees. The city of Galveston is advising against recreational fishing during the shelter in place ordinance. The City of Galveston has closed all beach park amenities. In addition, the following West End Beach access points are closed to vehicular traffic: The north and south side of the San Luis Pass bridge, Salt Cedar Drive access point, access point number 35 which is just to the east of the house at 24125 FM 3005 and Estuary Drive at the beach. Moses Lake floodgate closure effective until April 20th. All commercial fishing piers and charter boat operations are currently closed.\nWEST GALVESTON BAY: GOOD. 70-73 degrees. The City of Galveston is advising against recreational fishing during the shelter in place ordinance. The City of Galveston has closed all beach park amenities. In addition, the following west end beach access points are closed to vehicular traffic: The north and south side of the San Luis Pass bridge, Salt Cedar Drive access point, access point number 35 which is just to the east of the house at 24125 FM 3005 and Estuary Drive at the beach. Moses Lake floodgate closure effective until April 20th. All commercial fishing piers and charter boat operations have been closed.\nTEXAS CITY: GOOD. 73-74 degrees. Redfish are very good over the flats on live shrimp. Flounder are good on live shrimp or minnow around the jetties. Speckled trout are good along the shoreline on shrimp. Black drum are excellent on blue crab. Sheepshead are very good around the dike. The dike will be closed weekends (starting at 5 p.m. Fridays and reopens Monday at 8 a.m.) effective through April 30.\nFREEPORT: GOOD. Water mostly clear; 72-73 degrees. All Freeport beaches are closed until further notice, including Bryan Beach. Check local ordinances and follow guidelines. Black drum are good on a gold spoon, slow bouncing off the bottom. Redfish will be found along the flats and are best on shrimp- on windier days, look for them to be stacked up along the shoreline chasing baitfish. Speckled trout are good on shrimp. Sheepshead will be found around the oyster reeds in the back lakes. Flounder are good around the rockets on mullet.\nROCKPORT: GOOD. Water mostly clear; 72-74 degrees. All beaches and parks are closed until April 30. All public boat ramps are also closed. Shore fishing is still allowed at this time. Redfish are excellent, using small white shrimp or finger mullet around the flats and edges. Trout are excellent on mullet or shrimp and found around the shoreline. Flounder are good on mullet near the rocks. Black drum are excellent and found around grass beds on blue crab or mullet.\nCORPUS CHRISTI: GOOD. 72-74 degrees. Check local ordinances and follow guidelines. Night curfew for beaches is 8:00 p.m. Redfish are good on live mullet. Speckled trout are good around the mid-bay reefs on artificial baits or shrimp. Flounder are good on mullet or shrimp around the rocks. Pompano on dead shrimp, Bull reds on cut bait in the surf. Fish of the jetty for black drum with crab and shrimp.\nSOUTH PADRE: GOOD. 77-79 degrees. For now, fishing is allowed; however, you must maintain a proper distance from others. Soft plastics are still doing well. Natural colored mullet and shrimp bait are producing results. Speckled trout are hanging along with color changes. Redfish will be found along the grass flats and best when the wind picks up. Large amounts of black drum will be in deeper water.\nWEST MATAGORDA BAY: GOOD. 76 degrees. Most public boat ramps are closed, along with cleaning tables and restrooms. Maintain social distancing and follow local ordinances. Wading and drifting are still the best methods. Black drum are good on blue crab or shrimp. Speckled trout are excellent along the shoreline or around flats on shrimp. Redfish are very good on live shrimp. Flounder are good on shrimp around the rocks.\nEAST MATAGORDA BAY: GOOD. 76 degrees. Most public boat ramps have been closed. Maintain social distancing. Trout are good in shallow water over mud on shrimp or soft plastics. Black drum have been good on blue crab. Redfish are good on soft plastics around the reefs and shorelines.\nPORT O’CONNOR: GOOD. 76 degrees. Some access points are closed. Please check with local authorities to ensure fishing activities are allowed at this time. Trout and redfish are good on shrimp. Black drum are good on blue crab or shrimp. Flounder are good around the jetties on shrimp or minnow. Sheepshead are good near the jetty on live shrimp.\nBAFFIN BAY: VERY GOOD. 73-75 degrees. The only restriction that pertains to the bay is that there is an 8 p.m. curfew on the beach; this includes public piers and public boat ramps. There are no fishing restrictions as long as you adhere to the social gathering rules of 10′-by-6′. This means no more than ten people in an area at a time, ensuring that everyone is 6′ apart on the piers. No one will interfere with commercial and sports fisherman that adhere to the rules. Despite the wind changes we’ve been having in the area, it is still holding good trout, redfish and flounder. They will most likely be found in 2-3′ of water and are good on paddle tails in orange or Chicken on a Chain colors. Using darker colors will perform best in dirty water. The Flats in Alazan have been holding good slot reds on the Eastside, and good solid trout are caught around the Los Corrallos area. Flounder have been good on the inside of tide gauge. Work slow and be patient.\nPORT ISABEL: GOOD. 77-78 degrees. Fishing in the Laguna Madre is permitted, and you may utilize private docks but must follow social distancing guidelines. All public ramps and piers are closed. Boats cannot hold more than four people at a time. Trout can be found in the shallow grass flats around the Laguna Madre and are good on shrimp. Redfish will be found in less than 2′ of water around the grass flats and are best on shrimp. Sheepshead are good on mullet around rocks. Flounder are good on fresh shrimp or mullet. Jack crevalle are good on live mullet. Black drum are good on crab and shrimp around vegetation.", "url": "https://apnews.com/1453a359401f6d436f49124252990dd1"}