{"authors": ["Sherisse Pham", "Cnn Business"], "date_download": "2020-05-04 16:06:01", "date_modify": "2020-05-04 16:06:01", "date_publish": "2020-04-02 05:57:14", "description": "SoftBank is walking away from a sizeable chunk of its WeWork rescue package, which included a near billion dollar windfall for ousted founder Adam Neumann.", "filename": "2020_04_02_tech_wework-softbank-bailout_index_1588608361.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191009100250-01-adam-neumann-wework-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_tech_wework-softbank-bailout_index_1588608361.html", "title": "WeWork founder Adam Neumann loses out as SoftBank scraps share buyout", "title_page": "WeWork founder Adam Neumann loses out as SoftBank scraps share buyout - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Hong Kong (CNN Business) SoftBank is walking away from a sizeable chunk of its WeWork rescue package, which included a near billion dollar windfall for ousted founder Adam Neumann .\nThe Japanese tech company has backed out of a plan to buy $3 billion worth of shares in the coworking startup from existing shareholders and investors, according to statements from SoftBank and aspecial committee of WeWork's board.\nSoftBank's chief legal officer, Rob Townsend, said in a statement on Thursday that the share purchase was subject to certain conditions agreed to in October.\n\"Several of those conditions were not met, leaving SoftBank no choice but to terminate the tender offer,\" he said.\nand is further evidence that SoftBank CEO Masayoshi Son is stepping back from his trademark The about face cuts deep for Neumann — the October agreement had included an offer to buy up to $975 million worth of the WeWork founder's shares —and is further evidence that SoftBank CEO Masayoshi Son is stepping back from his trademark high-risk investment strategy after the company's shares cratered earlier this year.\nSoftBank cited several conditions that WeWork didn't meet, including failing to obtain necessary antitrust approvals by April 1, the existence of \"multiple, new, and significant pending criminal and civil investigations\" into the company and global restrictions related to Covid-19 affecting WeWork and its operations.\nWeWork declined to comment. However, the special committee of WeWork's board said in a statement on Wednesday that it \"is surprised and disappointed\" by SoftBank's move. It added that it will evaluate all legal options, including litigation.\ndeal gave SoftBank 80% ownership of the startup. Neumann had already stepped down as CEO amid Last year, WeWork's botched IPO left it teetering on the edge of insolvency until SoftBank stepped in with a rescue package worth roughly $10 billion at the time. The originaldeal gave SoftBank 80% ownership of the startup. Neumann had already stepped down as CEO amid anger from employees and investors over his leadership of the company.\nAt an earnings presentation last month, Son boasted about a turn around plan that would see WeWork generating positive cash flow in a couple of years.\nBut the global coronavirus pandemic has thrown a huge spanner in the works.\nSweeping restrictions on work, travel and social distancing aimed at preventing the spread of the virus are putting both WeWork and SoftBank under enormous pressure.\nWeWork is suffering, as major cities where it operates shut down for weeks on end. It still has to pay long-term leases, even if businesses squeezed by the outbreak cancel contracts with the shared office space company.\nWhile SoftBank's planned stock buyout wouldn't have provided WeWork with any additional cash, the startup will lose out on $1.1 billion in debt financing that was contingent on the deal closing, according to a letter WeWork sent to investors last week, a copy of which was shared with CNN Business.\nSoftBank and its Vision Fund have committed more than $14.25 billion to WeWork to date, including $5.45 billion since October 2019.\nThe coronavirus pandemic poses a catastrophic threat for many of the startups CEO Son has plowed money into through the $100 billion Vision Fund. In an effort to rescue SoftBank's plummeting share price, Son last week made the surprise announcement of what amounts to a fire sale of $41 billion worth of assets to buy back shares and reduce the company's heavy debt load.", "url": "https://www.cnn.com/2020/04/02/tech/wework-softbank-bailout/index.html"}