{"authors": ["Culture", "Parenting Reporter"], "date_download": "2020-05-04 20:31:25", "date_modify": "2020-05-04 20:31:25", "date_publish": "2020-04-30 13:56:41", "description": "The pandemic will affect airports, hotels and other aspects of your future trips.", "filename": "entry_experts-predict-how-coronavirus-will-change-travel_l_5ea208bfc5b669fd8921b59c_1588624285.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa06ce3000003012155272.jpeg?cache=aBJV3mH9jz&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_experts-predict-how-coronavirus-will-change-travel_l_5ea208bfc5b669fd8921b59c_1588624285.html", "title": "Experts Predict How Coronavirus Will Change The Way We Travel", "title_page": "Experts Predict How Coronavirus Will Change The Way We Travel | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "John Moore via Getty Images Airplanes will likely keep passengers more spaced out as demand remains low.\nThe COVID-19 pandemic has upended our lives in countless ways. One of the clearest examples is its impact on travel.\nAs Americans practice social distancing, vacations have been canceled, attractions are closed, and the tourism industry is suffering. Although we don’t know exactly when this will happen, travel will eventually become part of normal life again.\n“There won’t be a distinct moment when travel returns,” Konrad Waliszewski, co-founder and CEO of the travel app TripScout, told HuffPost. “It will trickle back to normal as certain travelers get more comfortable and specific destinations return back to normal.”\nStill, when we do embark on new adventures, the travel experience will undoubtedly be different in many ways. HuffPost asked experts to break down their predictions for the future of travel.\nAirports will implement new systems\n“We need to declare war against congested lines, which we see at check-in, security, the gate, immigration,” said Brian Kelly, founder and CEO of The Points Guy. “For far too long, we’ve just accepted that, but we could use technology to speed through these processes.”\nHe believes biometric screenings, like using facial recognition systems to ID and check in passengers, will cut down on unnecessary human interactions, speed up the airport process and reduce crowding.\n“Is it necessary to hand a piece of paper to another human to board an aircraft in 2020? Absolutely not,” Kelly noted. “Other countries and airlines have been at the forefront of this. You look a screen and it lets you into an area.”\nSystems that involve fingerprint identification, like Global Entry, may pivot to retinal scans to reduce high-touch surfaces in airports. Although people have concerns about privacy, Kelly is of the opinion that protecting health should come first.\n“Privacy is out the window. The government knows what it wants about you,” he said. “The question now is, ‘Do we want to risk dying due to a virus over privacy concerns, or do we want to actually have efficient and safe airports?’”\nFace masks will be a common sight\nAmerican travelers who didn’t even own face masks prior to the pandemic will likely be sporting them in airports and other high-traffic areas along their journeys. Flight attendants may also have more protective attire, at least temporarily.\n“Masks have been mainstay in Asia for years and for good reason,” said Kelly. “In the U.S., we need to get comfortable wearing masks.”\nChris J Ratcliffe via Getty Images Face masks will likely be a common sight at airports and other high-traffic places.\nThis week, JetBlue became the first major U.S. airline to require passengers to wear face masks while traveling, and it seems likely other carriers will follow suit. Even if these requirements are eased over time, many travelers may continue this practice as an extra precaution.\n“What was viewed as excessive and weird a few months ago will be normal,” said Alan Fyall, associate dean of academic affairs and interim chair for the tourism, events and attractions department at the University of Central Florida’s Rosen College of Hospitality Management.\nFlight prices will stay low but then surpass previous levels\n“We already were in a golden age of flight prices,” said Waliszewski. “A lack of demand, record low oil prices and government bailouts should make flight prices even cheaper through 2021, but ultimately consolidation, potential bankruptcies for budget airlines, and the realization that airlines should save cash for a rainy day will cause prices to get much more expensive long term.”\nThough fares may get higher, it’s likely that airlines will offer more flexibility with flight bookings.\n“I wouldn’t be surprised if part of a first-class ticket included free changes for a public health reason,” said Kelly.\nAirplanes will look more spacious for a time\n“Airlines will take a lot of safety steps ― like removing middle seats ― while flight demand is low,” said Waliszewski. “As traveler confidence and bookings increase, they will return to their normal mindset of maximizing every square inch possible.”\nKelly, however, believes there may be some pushback against the overcrowded economy-class cabins, especially as prices rise.\n“What was viewed as excessive and weird a few months ago will be normal.” - Alan Fyall, University of Central Florida\n“There’s going to be new innovation in how people sit on planes in terms of privacy and staggering them differently, but ultimately that probably will lead to more expensive flights,” he said. “I think our golden age of the last 10 years of ‘throw me in a crammed tube for eight hours for $200, I don’t care’ is over. I’m not saying it’s the end of the low-cost carrier, but I think we can no longer accept treating humans like cargo.”\nAirlines may also continue cutting down on in-flight meals and drinks to reduce the possibility of germ transmission, and there’s already more emphasis on cleaning. Although people are sharing photos of potential new airplane designs, such changes would take a long time to implement ― and seem unlikely to go into effect anyway.\nTrip insurance will be more popular\n“This pandemic shined a spotlight on trip insurance,” said Waliszewski. “Nearly every trip insurance product proved to be completely useless for pandemics, so travelers will start paying a lot more attention to the fine print. Trip insurance will get much more expensive, but much more useful and popular.”\nThere will likely be increased interest in the more expensive “cancel for any reason” insurance plans, which, as the name suggests, give travelers the option to cancel a trip for “any reason” ― including concerns about an outbreak, which is not covered under most traditional plans.\n“Insurance will be more important to people booking big life trips like a special anniversary trip or expensive family vacation booked a year in advance when who the hell knows what might happen,” Kelly said.\n“It hasn’t really been part of our culture to get travel insurance as much as in Europe, but I think there will be a surge going forward,” he continued. “Also, there may be new policies coming out that’ll act as a bridge on health care or evacuation. I would expect insurance and credit card companies to retool their policies to give consumers peace of mind.”\nHotels will rethink sanitation\nHotels will have to be transparent about cleaning practices and ways they’re cutting down on the potential for germ transmission. They may have to limit capacity and keep rooms vacant for longer periods between stays.\n“For years, there have been exposés on housekeeping forgetting to clean rooms or bad sanitation practices,” Kelly noted. “I’ve been let into dirty rooms on more than one occasion. We need to rethink the cleaning process. Maybe we could redesign rooms to use heat-resistant furniture and then heat rooms between stays to kill germs and bedbugs. There are lots of interesting concepts.”\nAURORE MESENGE via Getty Images Hotels will likely focus on rigorous cleaning practices.\nAmenities like communal fruit bowls in the lobby and hotel buffets may become a thing of the past. And new innovations could improve the check-in and key process to offer secure, hands-free options.\n“Consumers have been resistant to change because humans don’t like change, but now we have to adapt,” Kelly said. “Do we really need the plastic key when there’s technology allowing you to open it with your phone? Who likes to wait in a crowded line at a hotel check-in to be given a dirty key?”\nAccommodation preferences will shift\nFyall, Kelly and Waliszewski had different thoughts on how the pandemic may affect travelers’ preferences for hotels versus short-term rentals like Airbnbs.\n“Short-term rentals and apartments will outperform hotels as people want to avoid crowds and germs,” Waliszewski said.\nBut Kelly believes Airbnb will be a less appealing option because there are fewer standards in place and much more variety in terms of experience.\n“Airbnb has its work cut out for them because they don’t own their properties, and those owners aren’t employees,” he said. “Airbnb needs to fix their platform to better equip their hosts with cleaning. I’ve stayed at an Airbnb where there was clearly no cleaning. Meanwhile, Marriott has a task force, and they can be uniform and transparent with new procedures.”\nFyall agreed more with Kelly’s take. He believes rigorous standards and brand recognition will serve them well with nervous travelers.\n“Short-term rentals will probably be OK, but you may feel you’re taking more of a risk,” he said. “Strangely, the traditional hotels that have suffered in recent years because of the sharing economy can now say, ‘We’re Marriott. You know what you’re dealing with.’ They’ve got an opportunity to play to their strengths.”\nBusiness travel will be less common\nWaliszewski believes that business travel “will get crushed” thanks to the economic impact and workflow lessons of the pandemic.\n“Many companies have learned for the first time that Zoom is highly effective,” he said. “And with finance budgets being slashed, the bar for what will be considered an essential in-person meeting will be much higher. For the first time ever, leisure travel will become the majority of hotel and airline profits.”\nHe also believes there won’t be nearly as many conferences.\n“The conference industry will likely never recover,” he hypothesized. “Not only will be people not want to go to conferences during a recession and post-coronavirus, but conference organizers did not have pandemic insurance and most will go bankrupt because of this.”\nRoad trips will be all the rage\n“The first kind of travel to return will be road trips, national and state parks, and smaller cities,” predicted Waliszewski.\nKelly said that when it’s safe to travel again, his first big excursion will likely be a cross-country road trip.\n“There are so many amazing places in the U.S.,” he said. “National parks are great places to go because you’re not jammed in with other people, and you can choose your own adventure.”\nJordan Siemens via Getty Images “The first kind of travel to return will be road trips, national and state parks, and smaller cities,” predicted Konrad Waliszewski of TripScout.\nFyall said beaches in particular will likely be popular destinations.\n“People will feel more comfortable with a natural environment, so anything outdoors will be part of the first wave of tourism,” he said. “Anything car-accessible will be popular.”\nRest stops may also change a bit to reduce human interactions ― with more food kiosks, drive-thru options and individually cleaned restrooms that open to the outside.\nPeople will embrace local ‘travel’\n“The desire to travel and have unique experiences will be as strong as ever, but it will be a while before people are comfortable hopping on a plane to Rome,” said Waliszewski. “Local ‘travel’ is going to boom after stay-in-place measures are lifted. People will appreciate much more what’s in their own neighborhood, will want to support local businesses, and will have a reset to their normal routine and grind.”\nThere are many incredible destinations in our own backyards, and staying relatively close to home will offer a comfortable way to ease back into travel when public health officials deem it safe. For those who want to go a little farther beyond their own city, there are many options for that as well.\n“Any travel business offering remote getaways to drivable destinations should do really well,” Waliszewski noted. “Travelers are sick of their houses and are craving getting away, but will still want to be socially distanced and isolated.”\nInternational travel will take time to pick up\n“I don’t think international travel will pick up until 2021,” Fyall predicted. “Even if people want to travel, they won’t until they feel comfortable.”\nDifferent countries may have restrictions, like two-week quarantines for international visitors, that would make them less appealing destinations. And the health conditions will be a bigger factor to consider.\n“This virus isn’t going to magically disappear forever,” Kelly said. “It’s just going to be managed, and there will be more lockdowns if it gets really bad. So until I get a sense I won’t get stranded abroad and that my travel health insurance would cover me if I get sick, I may be less inclined to travel to developing countries where health care systems are strained on a good day. Getting stuck in a hotel for six to eight weeks is more than most people can afford.”\n“Travelers are sick of their houses and are craving getting away, but will still want to be socially distanced and isolated.” - Konrad Waliszewski, TripScout\nOn the other hand, Waliszewski believes the economic impact of the pandemic may incentivize some people to travel to less expensive international destinations.\n“Expect to see a boom in budget travel like backpacking through Southeast Asia and staying in hostels once it’s safe,” he predicted. “Millions of young people just lost their jobs and will be unable to find new work during the recession. So as long as it’s safe enough, they will choose to wait it out in Vietnam, Thailand or Bali instead of in their parents’ basement.”\nCruises won’t go away\n“Cruises won’t go away, but they will never return to normal,” Waliszewski said. “You can’t have the world commonly refer to you as ‘a floating cesspool’ and ever think you’ll thrive in a post-pandemic world. Destinations were already starting to push back on cruises because of overtourism, and this will only accelerate that.”\nKelly had a sunnier outlook. He noted that cruisers are some of the most loyal travelers, who love to see the world and love the cruise concept.\n“This is not the first virus to rampage a cruise ship,” he said. “There have been noroviruses, though obviously those were less deadly.”\nStill, he noted, the only way to revive the cruise industry is to have instant testing to confirm passengers and crew don’t have COVID-19 as they board the ship and at periodic checks after excursions.\nJoe Raedle via Getty Images Things aren't looking great for the cruise industry, but experts don't believe it will disappear completely.\n“There are many ways the industry will adapt to make sure everyone is safe onboard,” Kelly said. “We need testing, widespread thermometers and new procedures to contain potential spread and implement isolation. With the right cleanliness, cruises could be a great place to be during an outbreak. But today, you can get on a cruise ship while deathly ill.”\nHe also suggested exploring new technology to improve the boarding process, which involves large crowds. And technological advances aside, many cruise lines may struggle to remain viable with lower numbers of travelers filling each ship.\nPeople won’t take travel for granted\nThis period of social distancing has caused many to reflect on their past trips and develop a greater appreciation for the privilege of travel.\nThat sense of gratitude will (hopefully) stay with people when travel is safe again, and they embark on new adventures in the U.S. and beyond.\n“Everyone takes travel for granted,” said Fyall. “I don’t think they will anymore.”\nHe believes that’s particularly true for politicians who previously discounted the importance of the tourism sector and the hard work that goes into making that industry thrive.\n“We may see more governmental support and better protection for the workforce,” Fyall noted. “We have an opportunity to reflect and think of ways to do things differently and even better than previously.”\nThis global crisis is also an opportunity for travelers and industry leaders to assess and better understand some of the downsides of past practices.\n“Travel is a force for good, but overtourism has started to have a significant negative impact on destinations, the environment, and quality of life for many locals,” Waliszewski said.\n“We’ve never had a global opportunity to hit the pause button on travel and reset until now,” he continued. “I hope the travel industry and community takes this as an opportunity to get it right once we do get back to travel and take the necessary steps to preserve what we love about travel and destinations for generations to come.”\nExperts are still learning about the novel coronavirus. The information in this story is what was known or available as of press time, but it’s possible guidance around COVID-19 could change as scientists discover more about the virus. Please check the Centers for Disease Control and Prevention for the most updated recommendations.", "url": "https://www.huffpost.com/entry/experts-predict-how-coronavirus-will-change-travel_l_5ea208bfc5b669fd8921b59c"}