{"authors": ["Thomas Clouse"], "date_download": "2020-05-04 20:03:42", "date_modify": "2020-05-04 20:03:42", "date_publish": "2020-04-07 00:00:00", "description": "Plagued by an overwhelming response and a balky computer system, the U.S. Small Business Administration has yet to pay out any of $349 billion in relief to help small-business owners weather the...", "filename": "_f45b05d0f3a245919856fd97e1d9b67c_1588622622.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f45b05d0f3a245919856fd97e1d9b67c_1588622622.html", "title": "Spokane bank executive helping national rollout of small-business relief", "title_page": "Spokane bank executive helping national rollout of small-business relief", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Plagued by an overwhelming response and a balky computer system, the U.S. Small Business Administration has yet to pay out any of $349 billion in relief to help small-business owners weather the coronavirus pandemic.\nBut Greg Deckard, president and CEO of State Bank Northwest of Spokane, said he’s confident the problems will be worked out soon. Deckard, who is treasurer of the Independent Community Bankers of America, joined a conference call Tuesday with President Donald Trump and Treasury Secretary Steven Mnuchin.\nTrump, Mnuchin and SBA Administrator Jovita Carranza told Deckard and others the SBA has approved 225,000 loans totallng about $70 billion, but details are still being ironed out for how that money through the Paycheck Protection Program, or PPP, will be dispersed.\n“They hear our concerns and are allocating all the resources that are available to make this program successful,” Deckard said. “So while it’s frustrating in the details, it’s an extraordinary rollout of a program in this short period of time.”\nOn Monday, Jack Heath, president and chief operating officer of Spokane-based Washington Trust Bank, said he expected the $349 billion set aside by Congress could all be spoken for by the end of the week. Deckard agreed.\n“Even if we approach that congressional limit … both sides of the aisle are indicating that they will provide an additional $250 billion,” Deckard said.\nDeckard said he was told the U.S. Senate should consider a consent vote on Thursday, with the House of Representatives considering a similar vote, to extend the program with another $250 billion on Friday.\n“That means there is still time to submit your application,” Deckard said. “And there is still adequate funding available.”\nJeff McDonald, president of Miramac Metals Inc. based in Mead, said he reached out to Deckard on Tuesday. He got approved for an SBA loan through the SBA’s Paycheck Protection Program within an hour.\n“I don’t know if anybody can say how quickly the money will end up in the bank,” McDonald said. “But if you’ve ever done anything with the SBA before, this is incredible.”\nThe program is designed to allow owners of businesses with 500 employees or fewer to get funding to keep employees on the payroll, so the businesses will be ready to roll as soon as government officials end the stay-home order.\nMcDonald’s company, which manufactures and distributes steel roofing in the region, said he has about 30 employees. He’s remained in business but orders have fallen off.\n“The purpose of this money is that it is to go directly to the employees,” he said. “The employees are incredibly appreciative, of course.”\nBob and Barb Materne, owners of The Swinging Doors restaurant for nearly 39 years, said it took them a week before Deckard called this past weekend to tell them they had obtained approval for an SBA loan.\n“We were a successful restaurant. But you are not successful when you are shut down,” said Bob Materne, who turned 72 on Tuesday. “It’s not a golden egg-type thing. We work hard. When you shut it down, there is no money to pay the bills when you have 40-some employees.”\nTheir daughter, Lisa Emery, manages the restaurant at 1018 W. Francis Ave. and has called the state’s unemployment office so many times she has the number memorized, they said. About a dozen of their employees have worked at the eatery for more than two decades.\nWhen Deckard called with the SBA approval, “it was a sigh of relief,” Materne said. “My daughter said, ‘Dad, we can relax a little bit now.’ We feel relief that we can go forward and survive this coronavirus pandemic. We want to be there another 25 years or more.”\nDeckard said he and his staff have worked nonstop, including through the weekend, to process loan applications from Spokane-area businesses.\n“It’s been overwhelming,” he said. “The response to the rollout of this program has been tremendous for our small-business clients and nonclients.”\nBut Mnuchin did not help matters last week when he announced April 2 that businesses should be able to apply for loans and receive them quickly. “You get the money, you get it the same day,” he said.\nSome five days later, federal officials still haven’t fully explained how the federal government will handle a provision for promising forgiveness as long as the businesses use at least 75% of the loans to retain or rehire workers.\nWhile he didn’t want to directly criticize Mnuchin, Deckard said the secretary’s statement last week has put bankers’ reputations on the line.\n“When the administration says initially that you can go into your bank, apply for a loan and receive funding that same day when the specifics of the program haven’t even been determined yet, that results in the perception … that the issue is with the individual financial institution,” Deckard said. “That’s where it needs to be clarified.”\nDespite that confusion, Deckard praised federal leaders for their willingness to do something for business owners hurt by the pandemic.\n“Three weeks ago, we were on the phone with Sen. Marco Rubio’s staff, providing input to his proposed legislation,” Deckard said. “The devil is always in the details, but the concept was good.”\nThe program is based on 2.5 times a business owner’s payroll for the previous year. The owners need to be able to show how many employees they had, evidence of their business license and receipts for how much they paid their employees.\n“There are a couple catches,” he said. “You can’t reduce your employee work count … substantially from what your head count was before the program. In other words, you can’t … get the proceeds and not hire all these people back.”\nSecondly, if a company had 100 full-time employees, the owner can’t get PPP money and then convert all those employees to part-time status, he said.\n“The purpose of the program is to keep people off unemployment and keep the economy going.”\nHowever, federal officials have been slow to sign up banks and credit unions that were not previously set up as SBA lenders.\nAt the same time Deckard is working to secure funds for local businesses, he’s also helping represent the 3,500 lending institutions that are part of his organization.\nDuring his call with Trump, Deckard said an informal poll showed that one-third of all community banks still did not have access to the SBA loans as part of the Preferred Lender Program portal.\n“We were one of the first ones to get access to the portal,” he said. “But it has been a major frustration for banks around the country who have been shut out of the portal.”\nDeckard, a banker for 36 years, said he’s never seen this kind of mad rush to secure funding.\n“The great banking crisis of 2008 was pretty wild times. This is 10 times more frantic for bankers.”\nBut, he said the long hours have been rewarded.\n“One of the greatest joys that I have as a community banker is when I get to make one of these calls … that funds are forthcoming,” he said. “The absolute joy and relief that these small-business owners have expressed to us … makes it worth it.”", "url": "https://apnews.com/f45b05d0f3a245919856fd97e1d9b67c"}