{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:16:29", "date_modify": "2020-05-04 20:16:29", "date_publish": "2020-04-28 09:02:00", "description": "“This is the new flying etiquette,\" the president of JetBlue said. The company will require all customers to wear face coverings starting May 4.", "filename": "entry_airlines-face-masks-on-planes_n_5ea7c6bac5b6a30004e79aa2_1588623389.html", "image_url": "https://img.huffingtonpost.com/asset/5ea7caa23000002711155031.jpeg?cache=1lwdplhv4w&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_airlines-face-masks-on-planes_n_5ea7c6bac5b6a30004e79aa2_1588623389.html", "title": "Some U.S. Airlines Begin Asking, Or Requiring, Customers To Wear A Mask On Board", "title_page": "Some U.S. Airlines Begin Asking, Or Requiring, Customers To Wear A Mask On Board | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Airlines around the nation have begun asking, and sometimes demanding, that customers wear face coverings in an effort to restore faith in the beleaguered industry as it struggles to get passengers back in the air amid the ongoing coronavirus pandemic.\nJetBlue said Monday all customers would be required to wear a face covering while traveling beginning on May 4, following up on mandates all crew members do so themselves. Many other major airlines, including American, Frontier, United and Delta, have already required their crews to do the same, but JetBlue’s measure is the first to target passengers.\n“Wearing a face covering isn’t about protecting yourself, it’s about protecting those around you,” Joanna Geraghty, JetBlue’s president and chief operating officer, said in a statement. “This is the new flying etiquette.”\nAmerican Airlines, the world’s largest carrier, didn’t go so far as JetBlue this month in terms of face coverings, but said it would begin handing out masks and hand sanitizer when customers board some flights, beginning in May.\n“We are looking out for our customers’ wellbeing to give them peace of mind while they travel with us,” Kurt Stache, a vice president at the airline, said in a statement. “We’re moving quickly on these enhancements and we’ll continue to improve the travel experience for our customers and team members as we navigate these times together.”\nAmerican won’t require the masks be worn by customers, although flight attendants must wear them on all flights beginning May 1.\nAir travel numbers have slowly increased over the last six days, although they remain a fraction of what they were before the coronavirus began spreading throughout the country and many jurisdictions imposed social-distancing regulations or issued stay-at-home orders. The Transportation Security Administration said around 129,000 people had ventured through agency checkpoints on Sunday, down from about 2.5 million the same time last year.\nAirlines have been crippled by the coronavirus, which has grounded fleets for more than a month as millions stay at home. The industry received a $25 billion bailout earlier this month in an effort to prop up airlines, a measure Trump said would “preserve the vital role” they play in the economy.\nBut the slowly increasing number of travelers on board some planes has already prompted backlash. Sara Nelson, the president of the Association of Flight Attendants-CWA, shared a photo taken this weekend on a four-hour flight, showing passengers sitting directly next to each other, many without face coverings.\n“ENOUGH!” Nelson wrote on Twitter. “This is not okay. Masks must be mandated … in airports and on airplanes.”\nENOUGH! This was TODAY on a four hour flight. This is not okay. Masks must be mandated by DOT/HHS in airports and on airplanes. Essential travel only, with proper PPE. #COVID19 #StopTheSpread pic.twitter.com/TzwJyVRBoD — Sara Nelson (@FlyingWithSara) April 27, 2020\nNelson’s union represents about 50,000 flight attendants from more than 20 airlines. Last week, the group wrote to Transportation Secretary Elaine Chao and Health and Human Services Secretary Alex Azar asking the government to make masks mandatory on aircrafts and to ban leisure travel in the country until the virus is contained.\n“Flight attendants are aviation’s first responders, required by federal regulations to help ensure the safety, health, and security of our globally-interconnected aviation system,” the group wrote. “While this global system is integral to our modern economy, its essential inter-connectedness also provides a convenient pathway for opportunistic pathogens to hitch rides on unsuspecting crewmembers and travelers and spread all over the world.”", "url": "https://www.huffpost.com/entry/airlines-face-masks-on-planes_n_5ea7c6bac5b6a30004e79aa2"}