{"authors": ["Marina Villeneuve", "Karen Matthews", "Michael Hill"], "date_download": "2020-05-04 21:06:48", "date_modify": "2020-05-04 21:06:48", "date_publish": "2020-04-13 12:27:09", "description": "NEW YORK (AP) — New York’s coronavirus death toll has now topped 10,000 only about a month after the state recorded its first fatality, Gov. Andrew Cuomo said Monday. The state tallied 671...", "filename": "_90de91a91dfbcb25cddefb95e9cbea69_1588626408.html", "image_url": "https://storage.googleapis.com/afs-prod/media/0a5885d4d25144cc98e1b6f2f867e554/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_90de91a91dfbcb25cddefb95e9cbea69_1588626408.html", "title": "A month after New York's 1st virus death, toll hits 10,000", "title_page": "A month after New York's 1st virus death, toll hits 10,000", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Pedestrians enjoy the warm weather on the boardwalk at Coney Island in New York, Sunday, April 12, 2020. Amid some signs of hope that the coronavirus infection rate is plateauing, New York is still wrapping up its worst week in deaths so far since the outbreak began. (AP Photo/Seth Wenig)\nPedestrians enjoy the warm weather on the boardwalk at Coney Island in New York, Sunday, April 12, 2020. Amid some signs of hope that the coronavirus infection rate is plateauing, New York is still wrapping up its worst week in deaths so far since the outbreak began. (AP Photo/Seth Wenig)\nNEW YORK (AP) — New York’s coronavirus death toll has now topped 10,000 only about a month after the state recorded its first fatality, Gov. Andrew Cuomo said Monday.\nThe state tallied 671 new deaths on Sunday. It was the first time in a week the daily toll dipped below 700.\nCuomo said the count has been “basically flat at a horrific level of pain and grief and sorrow.” More than half of New York’s 10,056 deaths have come in the past week. Hospitals are still getting about 2,000 new patients a day.\nThe bleak numbers overshadowed hopeful trends that prompted Cuomo to tentatively declare Monday that the “worst is over” — as long as New Yorkers continue to follow stay-at-home restrictions.\nThe number of people hospitalized with the virus has almost flattened at just under 19,000, once discharges and deaths are taken into account. That’s a relief after weeks of increases raised fears New York City hospitals would be dramatically overwhelmed by COVID-19 patients.\n“I believe the worst is over if we can continue to be smart,” Cuomo said. “And I believe we can now start on the path to normalcy.”\nThe first reported fatality was an 82-year-old New York City woman with emphysema who died March 11. Officials initially said she died March 13, but the city’s health department corrected the date later.\nHere are other developments in the outbreak.\n___\nPROBLEMATIC TESTING\nNew York City is in danger of running out of swabs for COVID-19 tests and is urging medical providers to continue testing only patients who are gravely ill, the city health department said in a memo to health care providers.\n“As the swab supply continues to decline, there is a real possibility hospitals will completely run out,” the April 11 health alert said. “At this time, providers are reminded to only test hospitalized patients in order to preserve resources that are needed to diagnose and appropriately manage patients with more severe illness.”\nThe warning came amid repeated pleas from New York City and state officials for the federal government to provide widespread testing in order to move to a containment phase in the coronavirus outbreak.\n“If the president of the United States or anyone else wants a recovery — and we all want it, right? But if you’re serious about it, you can’t do it without widespread testing,” Mayor Bill de Blasio said at a City Hall briefing Monday.\nThe city’s health commissioner, Dr. Oxiris Barbot, said the city “won’t be able to get this over the finish line, if you will, if we don’t have the supply that the mayor is calling for or the assistance of the federal government.”\nThrough the end of the day Sunday, more than 478,000 people in New York have been tested for the virus, according to state figures. Of those, nearly 195,000 had tested positive.\nBecause of rationing, just 44% of tests conducted in the state have been done in New York City, even though the city represents 74% of the state’s fatalities from the virus.\nFull Coverage: Virus Outbreak\nLack of testing capability, partly due to rationing of personal protective equipment for the people who would have to administer them, has also stopped officials from doing widespread testing of hospital and nursing home staff who might be passing infections to each other and to patients.\n___\nSTATES COORDINATE\nCuomo and fellow Democratic governors from five other states pledged to coordinate strategies for reopening their economies, even as Republican President Donald Trump asserted he is the ultimate decision-maker.\nCuomo said economic and health experts from each state will be part of a working group to come up with an integrated framework for the states’ re-opening plans. He made the announcement with the governors for Connecticut, Delaware, New Jersey, Pennsylvania and Rhode Island.\nTrump said Monday on Twitter that some are “saying that it is the Governors decision to open up the states, not that of the President of the United States & the Federal Government. Let it be fully understood that this is incorrect...it is the decision of the President, and for many good reasons.” He added that he and his administration are working closely with governors.\nCuomo said even if Trump has the legal authority to order businesses and schools to reopen, the states would need a “clearly defined” federal plan to reopen responsibly.\n“You want to tell me what to do? Fine,” he said. “Then I have to be able to turn around and tell my local governments what to do. So the clarity here is important.”\n___\nDETAINEES INFECTED\nSeven detainees at a federal detention facility in Batavia have tested positive for COVID-19, according to the U.S. Immigration and Customs Enforcement. The individuals who tested positive include a 62-year-old Pakistani, a 29-year-old Somali, two Hondurans, ages 37 and 31, two 21-year-old Salvadorians and a 35-year-old Dominican. ICE officials would not provide information about the detainee’s current health status or whether they had underlying conditions, according to the Times-Union of Albany.\n___\nVilleneuve and Hill reported from Albany, N.Y. Michael R. Sisak contributed from New York.", "url": "https://apnews.com/90de91a91dfbcb25cddefb95e9cbea69"}