{"authors": ["Elie Honig"], "date_download": "2020-05-04 16:24:24", "date_modify": "2020-05-04 16:24:24", "date_publish": "2020-04-06 23:24:31", "description": "Elie Honig writes that with the stroke of a pen, Trump has the power to use the DPA to get crucial lifesaving equipment to the states and medical professionals who need it most.", "filename": "2020_04_06_opinions_trump-p_af65385633cd1acdc44d8c28fafbd6cb_index_1588609464.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404162559-01-coronavirus-briefing-0404-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_opinions_trump-p_af65385633cd1acdc44d8c28fafbd6cb_index_1588609464.html", "title": "Trump has had the power to address medical supply shortages. Why hasn't he used it more?", "title_page": "Trump has had the power to address medical supply shortages. Why hasn't he used it more? (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "In this weekly column \"Cross Exam,\" Elie Honig, a CNN legal analyst and former federal and state prosecutor, gives his take on the latest legal news. Post your questions below. The views expressed in this commentary are his own. View more opinion on CNN. Watch Honig answer readers' questions on \"CNN Newsroom with Ana Cabrera\" at 5:40 p.m. ET Sundays.\n(CNN) Under the Defense Production Act (DPA) , President Donald Trump holds enormous power to put essential lifesaving equipment into the hands of medical professionals on the front lines of the coronavirus crisis. Trump typically exercises executive power aggressively but thus far he has taken a tepid, confused approach to the DPA, at the potential cost of human life.\nThe house is on fire, the law has handed Trump a hose and he's using it to water the flowers.\nOn March 18, Trump said that he would invoke the DPA -- likening himself to \" a wartime president \" -- and issued a broad order mentioning the act but not directly ordering production of any specific equipment under the law.\nA few days later, on March 22 , Trump expressed hesitancy about using the DPA: \"You know, we're a country not based on nationalizing our business. Call a person over in Venezuela, ask them how did nationalization of their businesses work out? Not too well.\" (This mischaracterizes the DPA; the law does not permit the government to take over or \"nationalize\" private industry, but rather to order, expedite and pay private industry for essential goods, and has done so in the past on numerous occasions.)\nBut as the crisis escalated, Trump quickly changed his tune, talking big about his intention to use the staggering legal power granted to him by the DPA. He claimed on March 24 that the act was \" in full force ,\" but he didn't have to use it because companies were already doing what he wanted. He then seemed to reference the act by bizarrely tweeting \" invoke P .\"\nSince then, the administration has used the DPA, though -- inexplicably -- sparingly.\nIt has ordered two private companies, 3M and General Motors , to manufacture ventilators (without specifying publicly how many, on what timetable and at what price), and 3M has agreed to manufacture 55 million protective masks -- according to Trump, under threat of a potential order under the DPA. The administration also has ordered the Department of Health and Human Services to help six other manufacturers get the materials necessary for production (again, without specifics). In the context of the entire industrial might of the United States, these orders are relatively limited.\nTrump also has issued an order allocating vital equipment for domestic purposes generally. This is a good start, as it ensures that crucial supplies will not be shipped out of the United States. But it does not go nearly far enough. Throughout the pandemic, governors and other officials have called on the President to exercise his allocation power far more aggressively within and among the United States.\nThey argue that allocation will prevent bidding wars between states, keeping costs lower to states seeking to purchase vital lifesaving equipment (at the expense of corporate profits). And by allocating scarce but essential goods, the President can ensure optimal distribution to the states most in need. Simply put: If one state has excess ventilators while another state runs short, then people will die, unnecessarily.\nWith the stroke of a pen, Trump has the power to get crucial lifesaving equipment to the states and medical professionals who need it most. He has talked much about the DPA but has deployed it meagerly and ineffectively. That continuing failure is simply inexcusable as the death toll mounts.\nNow, your questions:\nMike (South Carolina): Are quarantine and stay-home orders issued by state governors legally binding? Don't Americans have a constitutional right to travel freely?\nQuarantine and stay-home orders issued by state governors absolutely are legally binding -- and enforceable.\nThe Constitution does not explicitly contain the phrase \" right to travel ,\" but several of its provisions, taken together, do form a latticework of rights relating to free movement: the general right, recognized by the Supreme Court , of citizens to move freely between states; the Privileges and Immunities Clause , which ensures that citizens of one state have the same legal rights when visiting or located in another state; and the Due Process clause , which prohibits the federal government from interfering with the liberty of citizens to move between states without due process of law.\nBut the right to travel is not absolute, and it can be limited when necessary to protect the general welfare. Indeed, every state has laws empowering the governor, or other official, to limit the movement of people through a quarantine or other similar order.\nViolations of such orders are punishable by fines or, in some states, by potential criminal prosecution. While police appropriately regard arrests generally as a last resort of enforcement , in some cases authorities have arrested people who have violated quarantine or other similar orders.\nAmy (Delaware): Should prosecutors and other officials consider releasing certain prisoners in light of the health risks posed by coronavirus?\nYes, prosecutors can and should consider early release for certain categories of low-risk inmates.\nIt is difficult to think of a location more susceptible to the spread of disease than a jail.\nDavid Patton, the head the federal public defender's office in New York City, called jails in the age of coronavirus a \"disaster waiting to happen.\" Indeed, many jails are crowded or overcrowded and offer sub-par health services. Coronavirus threatens to spread not only among inmates, but also to guards and staff who return home after their shifts.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nNew Jersey, Given this reality, several states -- including New York Ohio and California -- have begun to release certain inmates early with the goal of reducing overcrowding and potential spread of the virus. While the specifics vary state to state, generally states have focused on releasing nonviolent offenders, pre-trial detainees who have not yet been tried or convicted and elderly inmates. The Justice Department has said it is considering its options, including potentially expanding home confinement, but has not yet adopted an early-release program.\nThree questions to watch:\n1. Will the administration use the Defense Production Act more aggressively to ensure the manufacture and optimal distribution of ventilators and other essential goods?\n2. Will more states and the Justice Department release certain nonviolent inmates early?", "url": "https://www.cnn.com/2020/04/06/opinions/trump-power-medical-shortage-dpa-opinion-honig/index.html"}