{"authors": ["Kate Sullivan"], "date_download": "2020-05-04 15:57:53", "date_modify": "2020-05-04 15:57:53", "date_publish": "2020-04-07 23:58:23", "description": "Wisconsin Assembly Speaker Robin Vos, a Republican, wore a mask, gloves and other protective gear as he sought to assure voters it was \"incredibly safe\" to vote in person for Tuesday's election amid the coronavirus pandemic.", "filename": "2020_04_07_politics_wisconsin-robin-vos-protective-gear_index_1588607873.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407193938-wisconsin-robin-vos-protective-gear-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_wisconsin-robin-vos-protective-gear_index_1588607873.html", "title": "Republican Wisconsin assembly speaker wears protective gear while telling voters they are 'incredibly safe to go out'", "title_page": "Republican Wisconsin assembly speaker wears protective gear while telling voters they are 'incredibly safe to go out' - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Wisconsin Assembly Speaker Robin Vos, a Republican, wore a mask, gloves and other protective gear as he sought to assure voters it was \"incredibly safe\" to vote in person for Tuesday's election amid the coronavirus pandemic.\n\"You are incredibly safe to go out,\" Vos told The Journal Times in a Facebook livestream. Vos said he was serving as an election inspector and that wearing the personal protective equipment , or PPE, was mandatory.\nStanding in front of cars lined up for curbside voting, Vos said people working at polling locations and those voting in person face \"very minimal exposure.\"\n\"Actually, there's less exposure here than you would get if you went to the grocery store, or you went to Walmart, or you did any of the many things we have to do to live in the state of Wisconsin,\" Vos said.\nVos' message was strikingly disconnected from his PPE-heavy outfit, in which the speaker looked more like a surgeon than one of the state's most powerful politicians. Vos did not immediately respond to a request for comment.\nRead More", "url": "https://www.cnn.com/2020/04/07/politics/wisconsin-robin-vos-protective-gear/index.html"}