{"authors": ["Amanda Jackson"], "date_download": "2020-05-04 16:56:18", "date_modify": "2020-05-04 16:56:18", "date_publish": "2020-04-09 01:16:44", "description": "Before the coronavirus pandemic, Jennifer Knox would walk into her bar and soak in the sounds of people chatting while sipping on their drinks and listening to local musicians strum along on their guitars.", "filename": "2020_04_08_us_sand-bar-dollar-bills-donation-trnd_index_1588611378.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408202343-01-the-sand-bar-tybee-island-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_us_sand-bar-dollar-bills-donation-trnd_index_1588611378.html", "title": "A Georgia bar owner removed $3,714 worth of bills stapled to the walls to give to her unemployed staff", "title_page": "A Georgia bar owner removed $3,714 worth of bills stapled to the walls to give to her unemployed staff - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Want more inspiring, positive news? Sign up for The Good Stuff, a newsletter for the good in life. It will brighten your inbox every Saturday morning.\n(CNN) Before the coronavirus pandemic, Jennifer Knox would walk into her bar and soak in the sounds of people chatting while sipping on their drinks and listening to local musicians strum along on their guitars.\nNow, her restaurant, The Sand Bar -- located in Tybee Island, Georgia -- is quiet, with no customers or employees in sight.\nLike many other restaurants, The Sand Bar had to close its doors after officials put stay-at-home orders in place and mandated restaurants switch to takeout and delivery only. The restrictions, put in place to help control the spread of the virus, also left businesses -- including Knox's -- struggling financially.\nAs she sat in her empty bar at the end of March and looked around, she realized there was an opportunity to help her now unemployed staff.\n\"We were sitting there doors locked and I'm like oh my gosh, 'there's money on the walls and we have time on our hands,\" she told CNN, referring to the bar's decor. \"'We gotta get this money down.'\"\nRead More", "url": "https://www.cnn.com/2020/04/08/us/sand-bar-dollar-bills-donation-trnd/index.html"}