{"authors": ["Daniel Dale", "Marshall Cohen", "Nathan Mcdermott", "Holmes Lybrand", "Cristina Alesci"], "date_download": "2020-05-04 16:52:09", "date_modify": "2020-05-04 16:52:09", "date_publish": "2020-04-08 03:11:52", "description": "President Donald Trump on Tuesday made inaccurate claims about the World Health Organization and delivered more of the false statements that have become a signature trait of his daily coronavirus briefings.", "filename": "2020_04_07_politics_fact-ch_41d92f3eaea746e3aa56db9da3ead1a3_index_1588611129.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407193535-03-coronavirus-briefing-0407-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_fact-ch_41d92f3eaea746e3aa56db9da3ead1a3_index_1588611129.html", "title": "Fact check: Trump makes false claims about his coronavirus record and voter fraud, misleads about the WHO", "title_page": "Fact check: Trump makes false claims about his coronavirus record and voter fraud, misleads about the WHO - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump on Tuesday made inaccurate claims about the World Health Organization and delivered more of the false statements that have become a signature trait of his daily coronavirus briefings.\nWe are still reviewing some of Trump's comments at the daily White House coronavirus briefing. We'll update this article with additional fact checks.\nTrump continues touting unproven drugs\nThe President continued his weeks-long embrace of two anti-malaria drugs as a potential treatment for Covid-19, even though there isn't conclusive scientific proof that they are safe and effective.\nThe Food and Drug Administration recently gave doctors emergency authorization to use the medicines, chloroquine and hydroxychloroquine, to treat Covid-19 in hospitals but not at home. The FDA has not fully \"approved\" the drugs for Covid-19, which requires a much higher scientific standard.\n\"You are not going to die from this pill,\" Trump said, before acknowledging that he isn't a doctor but has reviewed some of the medical studies, adding, \"I really think it's a great thing to try.\"\nFacts First: There is no conclusive scientific evidence to support what Trump is saying. Clinical trials are underway, but the FDA and top public health officials have not endorsed Trump's view that the drugs are already known to be effective against Covid-19 and can be taken safely.\nDoctors have contradicted Trump's specific comment that \"you are not going to die\" from these drugs. Dr. Patrice Harris, president of the American Medical Association, recently told CNN \"you could lose your life\" from this unproven treatment, echoing warnings from other experts.\nOver the past few weeks, there has been a glaring messaging gap between Trump and top public health officials about these drugs. While Trump touts them as miracle drugs that are on the brink of saving lives, the medical experts are cautiously waiting for scientific evidence.\nCNN reported earlier on Tuesday that Trump's comments have triggered a run on the drugs, with doctors and worried Americans emptying out pharmacies. These shortages pose potentially deadly risks to people with autoimmune diseases like lupus, who rely on hydroxychloroquine as a clinically proven treatment to reduce mortality, but are struggling to refill their prescriptions.\nSome medical research suggests that the drugs could work against coronavirus, but the study most commonly cited by Trump was incredibly small and didn't follow typical procedures for randomized trials. A more robust, large-scale clinical trial is underway now in New York.\nOn Tuesday, Trump also referenced a Democratic state lawmaker in Michigan who tested positive for the coronavirus but recovered, and now credits hydroxychloroquine for her success.\nMoments before arriving in the White House briefing room, Trump tweeted a Fox News clip of an interview with the lawmaker. Like Trump, anchors and guests on Fox News have repeatedly touted the potential benefits of hydroxychloroquine in recent weeks.\nThe lawmaker's story is compelling, but anecdotal. Dr. Anthony Fauci, the nation's top infectious disease expert, has said that at this point, there is only anecdotal evidence that the drugs work.\nRevisionist history on the flu\nReminded Tuesday that he had likened the coronavirus to the flu , Trump suggested that he was not downplaying the coronavirus when he did so.\n\"You said I said it was just like a flu. So the worst pandemic we ever had in this world was a flu, and it was called -- you know that -- it was in 1917, 1918. And anywhere from 50 (million) to a hundred million people died. That was a flu. OK. So you could say that I said it was a flu, or you could say the flu is nothing to -- sneeze at,\" he said.\nFacts First: Trump was inaccurately portraying his own comments. When he likened the coronavirus to the flu in February and March, he was saying or strongly suggesting that the virus was like a conventional flu -- a \"regular flu\" or \"common flu\" -- not warning Americans that they could be facing something equivalent to the catastrophic flu pandemic of 1918 and 1919.\nAt a coronavirus briefing on February 26, for example, Trump said, \"It's a little like the regular flu that we have flu shots for. And we'll essentially have a flu shot for this in a fairly quick manner.\" He also said : \"The flu, in our country, kills from 25,000 people to 69,000 people a year.\"\nAs Trump has subsequently noted , the 1918-1919 flu pandemic killed tens of millions of people. Trump clearly was not suggesting in these February 26 comments that the coronavirus would be a devastating pandemic.\nAgain, Trump was invoking a conventional flu season that killed tens of thousands of people, not a pandemic that killed tens of millions. And until mid-March, Trump also downplayed the virus in comments in which he did not specifically mention the flu\nAt a Fox News town hall on March 24, Trump specifically rejected a comparison between the coronavirus pandemic and the 1918-1919 pandemic because of the high mortality rate in that pandemic more than a century ago -- a mortality rate he was exaggerating , but nonetheless.\n\"You can't compare this to 1918 where close to 100 million people died,\" he said.\nEuropean travel ban\nTrump again exaggerated the travel restrictions he imposed on some European countries in March.\nTrump claimed Tuesday that he had \"closed it down to Europe\" and then that he had \"closed it down to all of Europe.\"\nFacts First: Trump never closed the US to travelers from \"all of Europe.\" Rather, he imposed restrictions on travel from most European countries but exempted others. And his restrictions did not apply to some people traveling from Europe: US citizens, permanent US residents, certain family members of both citizens and permanent residents and some other groups of travelers.\nTrump's restrictions initially applied to the 26 countries in the Schengen Area, a European zone in which people can move freely across internal borders without being subjected to border checks. Trump later added the United Kingdom and Ireland. That still left out some European countries, including Croatia, Serbia, Romania, Ukraine and Russia.\nYou can read more about the travel restrictions here\nThe World Health Organization\nDuring Tuesday's White House coronavirus task force briefing, Trump claimed that the World Health Organization downplayed the coronavirus and criticized his January 31 order restricting most travel between the United States and China.\n\"Take a look, I mean go through step by step, they said there's no big deal, there's no big problem, there's no nothing, and then ultimately when I closed it down they actually said that I made a mistake in closing it down, and it turned out to be right.\"\nFacts First: Trump is correct that the World Health Organization organization didn't support his travel restrictions with China -- the WHO opposes most international travel restrictions and sees them as ineffectual -- but he overstated the case when he insinuated that the WHO downplayed the virus.\nThe WHO has been criticized for a January 14 tweet noting that preliminary investigation by Chinese authorities had found no clear evidence of human-to-human transmission of the coronavirus, but the WHO did not say the virus was \"no big deal\" before Trump announced his travel restrictions. The WHO declared the virus a \"public health emergency of international concern\" on January 30 , the day before Trump announced the restrictions, out of concern that the virus could pose a threat to other countries beyond China.\nOn January 30 , the WHO said that it did not recommend any travel or trade restrictions, saying that \"such measures may have a public health rationale at the beginning of the containment phase of an outbreak\" but that they should only be short in duration if over 24 hours because they are not very effective.\nAs recently as February 29 , the WHO reiterated its opposition to blanket travel bans.\nThe WHO has been criticized for relying on official Chinese government figures relating to the virus, numbers which many officials doubt are accurate. Specifically, the WHO sent out a tweet on January 14 that stated \"Chinese authorities have found no clear evidence of human-to-human transmission of the novel #coronavirus\".\nTrump overstates when he insinuates that the WHO knew about the global threat the virus posed, but downplayed it. The WHO defines an emergency of international concern as \"an extraordinary event\" that constitutes a \"public health risk to other States through the international spread of disease\" and \"to potentially require a coordinated international response,\" meaning that the organization recognized that the virus posed an international threat beyond China.\nOn Tuesday, February 4 , the organization said that, while the virus had not yet reached pandemic levels, it was considered to be an epidemic with multiple locations; an epidemic being more than a normal number cases of an illness.\nOn March 11 , the WHO declared the virus a pandemic, meaning the worldwide spread of a new disease.\nTrump denies something he had just said\nTrump announced at the briefing that he planned to \"look into\" the US contribution to the World Health Organization, which he claimed had mishandled the coronavirus. Then, after continuing to criticize the WHO, he said, \"We'll be looking into that very carefully. And we're going to put a hold on money spent to the WHO. We're going to put a very powerful hold on it and we're going to see.\"\nTrump was asked about 16 minutes later whether a pandemic is a good time to freeze funding for WHO. He responded that he is not saying he is going to do that, merely that he will look. When another reporter interjected that Trump had indeed said he would freeze funding, Trump said, \"No I didn't. I said we're going to look at it.\"\nFacts First: Trump was denying something he had plainly said. Though he had originally announced he would look into US spending on the WHO, he then announced he would impose a \"very powerful hold\" on the spending.\nTrump opens new front in lies about voter fraud\nTrump used Tuesday's briefing to launch baseless attacks against voting-by-mail, which many experts say is one fair and effective solution to holding a presidential election amid a pandemic.\n\"Mail ballots, they cheat, people cheat,\" he said. \"Mail ballots are very dangerous thing for this country because they're cheaters. They go and collect them. They're fraudulent in many cases.\"\nHe added, \"the mail ballots are corrupt, in my opinion,\" and said that \"you get thousands and thousands of people sitting in somebody's living room signing ballots all over the place.\"\nFacts First: Trump is lying about voter fraud. Multiple studies over the years have confirmed that there is no widespread voter fraud in this country. Additionally, Democratic and Republican state officials routinely oversee elections where millions of people vote-by-mail without systematic problems.\nTrump has long embraced conspiracy theories about voter fraud. After taking office, Trump set up a commission to investigate the issue, but the panel disbanded without uncovering any evidence supporting Trump's claims that millions voted illegally in 2016.\nAn expansive study in 2017 from the Brennan Center for Justice, a liberal-leaning think tank, found that the rate of voter fraud in the United States was somewhere between 0.00004% and 0.0009%.\nVoting-by-mail has become increasingly popular in US federal elections, and nearly a quarter of all voters cast mail ballots in 2016, according to the Election Assistance Commission. This year, the solid Republican state of Utah will conduct all-mail elections, which undercuts Trump's claims.\nIt's true that voting-by-mail poses some risks that don't exist with in-person voting, which Trump noted on Tuesday. But the most recent example of absentee ballot fraud involved Republican operatives in North Carolina who allegedly rigged an election for the House of Representatives in 2018.\nTrump cast an absentee ballot last month in the Florida Republican primary, per local reports. Asked about this contradiction, Trump said it was OK \"because I'm allowed to\" vote by mail.\nThe vote-by-mail discussion came up at the White House briefing because of Tuesday's elections in Wisconsin, where the Democratic governor tried unsuccessfully to delay the vote, but was thwarted by the GOP-led legislature and the state Supreme Court's conservative majority.\nIn addition to the presidential primaries, there is a general election for a spot on the Wisconsin Supreme Court. Trump has backed an incumbent justice who was appointed by Republican.\nAt the briefing, Trump said, \"All I did was endorse a candidate,\" but that's not a complete portrayal of his involvement in the Wisconsin elections. He tweeted four times in the past few days about the judicial race and urged people to vote Tuesday, saying, \"Wisconsin, get out and vote NOW.\"\nPublic health experts have warned that the election could put voters and poll workers at risk.\nJoe Biden and Trump's travel restrictions on China\nTrump claimed Tuesday that Democratic presidential candidate Joe Biden admitted having been incorrect in his initial stance on Trump's travel restrictions on China.\n\"In all fairness to Joe Biden, he called me xenophobic, like I don't like China. I like China. Like, the Chinese people are phenomenal people. So I was called xenophobic, I was called racist, how could I do a thing like this? Now since then, Joe said that he was wrong and he said that I was right,\" Trump said.\nFacts First: Biden's campaign did say last week that Biden Biden's campaign did say last week that Biden supports Trump's travel restrictions on China . But Biden has not said that he was wrong about anything related to the travel restrictions; Biden's campaign has maintained that his accusations of xenophobia were not specifically about those restrictions, and Biden did not take a firm position on the restrictions until his expression of support last week. \"Never happened,\" campaign spokesperson Andrew Bates said Tuesday of Trump's claim that Biden has made an admission of error.\nAs PolitiFact reported, Biden said on January 31, the day Trump announced the restrictions on China, and again in a tweet on February 1 that \"science\" should lead the way in the response to the coronavirus outbreak, not Trump's \"record\" of \"xenophobia.\"\nGiven the timing of Biden's remarks, it's not unreasonable for Trump to have inferred that Biden was claiming that the travel restrictions were an example of xenophobia. But Biden never specifically said that -- and Biden's campaign says the former vice president had been making a general statement about Trump's record and Biden's hopes for the response, not an accusation about the restrictions in particular.\nDespite the campaign's explanation, we can't say that Trump's claim that Biden called the restrictions xenophobic was inaccurate; Biden left his words open to interpretation. But Trump was incorrect when he said Biden has acknowledged having been wrong.\nTrump touts small business lending program\nThe President claimed the progress of the small business lending program -- the Payroll Protection Program -- was \"way ahead of schedule\" and touted figures that ignored serious challenges the program is facing. He said the Small Business Administration (SBA) has \"processed more than $70 billion in guaranteed loans and will provide much needed relief for nearly a quarter of a million businesses already.\"\nFacts first: The program has been fraught with The program has been fraught with delays since Treasury Secretary Steven Mnuchin announced the program had started five days ago.\nSome lenders claim the Treasury Department and SBA didn't give banks all the tools and guidance they need to make the loans available quickly. Some big banks have made little to no progress disbursing funding to small businesses as of Tuesday night.\nFor example, although Wells Fargo has processed some applications, it hasn't yet funded any companies, according to a person familiar with the bank's activity. Chase has funded \"a number\" of companies through PPP, but that number is so small relative to the number of requests it's not worth citing, according to a person familiar with Chase's activity. Citi has processed a \"limited number\" of applications but hasn't yet funded any businesses through PPP, said a person familiar with Citi's activity.\nAs for the $70 billion in loans Trump and other administration officials keep citing, that number only represents the amount of loans approved and doesn't reflect actual cash advanced to businesses.", "url": "https://www.cnn.com/2020/04/07/politics/fact-check-trump-coronavirus-briefing-april-7/index.html"}