{"authors": ["Chris Isidore", "Cnn Business"], "date_download": "2020-05-04 16:19:08", "date_modify": "2020-05-04 16:19:08", "date_publish": "2020-04-04 13:58:28", "description": "As the economy continues to hemorrhage jobs, it's becoming apparent that some groups are more at risk of unemployment than others.", "filename": "2020_04_04_economy_minority-job-losses-coronavirus_index_1588609148.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403140750-01-usa-minority-women-workers-job-losses-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_economy_minority-job-losses-coronavirus_index_1588609148.html", "title": "Early coronavirus job losses hitting minorities, women, teens particularly hard", "title_page": "Early coronavirus job losses hitting minorities, women, teens particularly hard - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) As the economy continues to hemorrhage jobs, it's becoming apparent that some groups are more at risk of unemployment than others.\nMinority workers, teens and, in many cases, women, are losing jobs at a higher pace than other groups.\n\"There's no doubt about it, they're getting hit worse,\" said Dean Baker, senior economist at the Center for Economic & Policy Research. \"They're working in sectors like hotels, restaurants and retail that are being harder hit.\"\nMinorities are also losing jobs such as custodial services as businesses close or are operating remotely.\nThe virus has so far resulted in 701,000 lost jobs according to the March jobs report released Friday by the Bureau of Labor Statistics. And that doesn't even include the full impact of the nearly 10 million people who filed for jobless benefits in the last two weeks.\nWhile the unemployment rate increased to 4.4% from 3.5% in the official report, the last two weeks of unemployment benefit filings suggest that the true rate is probably about 18.3% for adults, according to William Rodgers, chief economist at the Heldrich Center for Workforce Development at Rutgers University.\nHe estimates the unemployment rates for minorities and teen workers is probably worse. He said the true rate is likely 20.7% percent for African Americans rather than the official rate of 4.1%, and 18.7% for Hispanic workers, as opposed to official rate of 6%. For teens, he puts the true rate at least 26.7% not the 14.3% reported by BLS.\nRodgers agrees that the higher rates for minorities and young workers is primarily because the sectors in which they typically work will be more affected by current lockdown policies in much of the country.\n\"Those groups' jobs were at greater risk going into this downturn,\" he said.\nJessie Morancy recently filed for jobless benefits after she lost her job as a customer service agent at the Fort Lauderdale--Hollywood Airport.\nAbout 30% of workers at hotels in 2019 were Hispanic, and another 19% are black, according to the BLS. Restaurants , bars and other food services, which have been particularly hard hit, had 27% of workers last year who were Hispanic, and 13% who were black.\nAt department stores , most of which have shut down because of the crisis, 19% of employees were black and another 19% were Hispanic. The catchall labor department category that includes temporary workers, custodial help and landscaping services lost 61,000 jobs in the official March labor report. About half of those workers are minorities.\nRodgers estimates that the unemployment rate for women right now is lower than the overall unemployment rate, partly because women are well represented in the fields of nursing and primary and secondary education, which so far have been spared job cuts. But job cuts in these sectors are likely in coming months, he said, particularly since women tend to hold government jobs that could be cut as states and cities respond to budget shortfalls.\nMany segments where women make up a majority of workers have already seen job losses. While hospitals aren't cutting staff, for example, some 40,000 jobs have been lost in the offices of doctors and dentists and other healthcare providers. More than 70% of the workers in those offices are women.\nIn addition, women make up 94% of child day care services workers. That segment lost nearly 19,000 jobs in the official BLS report, and many more the more than 1 million jobs in the sector since then.\n\"The child care infrastructure has been decimated,\" C. Nicole Mason, CEO of Institute for Women's Policy Research, which estimates that nearly 60% of the 700,000 job losses in the March report were held by women. She said women have a majority of jobs in many segments of the service sector that are at extreme risk in the current downturn.\n\"What we see now is a service sector recession that is disproportionately impacting women,\" she said.", "url": "https://www.cnn.com/2020/04/04/economy/minority-job-losses-coronavirus/index.html"}