{"authors": ["Por Christine Armario"], "date_download": "2020-05-04 20:28:49", "date_modify": "2020-05-04 20:28:49", "date_publish": "2020-04-08 19:45:37", "description": "BOGOTÁ (AP) — Alfonso Cedeño falleció en un atestado hospital de Guayaquil, donde la única cama disponible era la camilla de una ambulancia. Dos semanas después, su familia no sabe dónde fue a...", "filename": "_26d1210291684ba089235e0b19e7833a_1588624129.html", "image_url": "https://storage.googleapis.com/afs-prod/media/4656fc28eaca4618b35f04c995d8c189/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_26d1210291684ba089235e0b19e7833a_1588624129.html", "title": "Coronavirus: Guayaquil, ¿adelanto de lo que se viene en AL?", "title_page": "Coronavirus: Guayaquil, ¿adelanto de lo que se viene en AL?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\n1 of 7\n1 of 7\n1 of 7\n1 of 7\nBOGOTÁ (AP) — Alfonso Cedeño falleció en un atestado hospital de Guayaquil, donde la única cama disponible era la camilla de una ambulancia. Dos semanas después, su familia no sabe dónde fue a parar su cadáver.\n“Mi tío no aparece”, expresó Alfonso Mariscal el martes.\nPersonas que han perdido seres queridos, ya sea por el coronavirus o por otros males, en esta metrópolis de 2,6 millones de habitantes dicen que el entierro de sus familiares es tan penoso como conseguir que reciban atención en una de las ciudades más infectadas de América Latina.\nCientos que fallecieron en sus casas permanecieron días en las salas de estar, a la espera de que los médicos forenses vayan a recoger los cadáveres, aunque el gobierno dice que ese trámite se aceleró ahora. Quienes mueren en hospitales son colocados en contenedores de carga refrigerados que hacen de morgues improvisadas.\nRepresentantes del gobierno dicen que ahora recogen y entierran a los muertos más rápidamente, pero numerosos familiares aseguran que el entierro es una odisea confusa y desgarradora. Algunos han tenido que buscar entre bolsas de cadáveres apiladas en las morgues. Otros, como Mariscal, todavía no saben adónde fueron llevados sus parientes.\nLos más afortunados son colocados en ataúdes de cartón porque los de madera han encarecido mucho o no hay disponibles. Los familiares entierran a los muertos después de esperar turno por horas en camionetas en las afueras de los cementerios.\n“Es un llanto total. Las familias gritan”, dijo Merwin Terán, propietario de una funeraria en Guayaquil. “Pero por más que griten, no pueden hacer nada”.\nMuchos temen que Ecuador esté viviendo un adelanto de lo que se viene en el resto de América Latina, una región con muchas menos infecciones confirmadas que en Europa y Estados Unidos, pero con una escasez de médicos, camas en los hospitales y respiradores más grande todavía.\nLa mayoría de los 4.000 casos registrados en Ecuador se concentran en la provincia de Guayas, que incluye a Guayaquil, donde hospitales desbordados a menudo deben rechazar a pacientes del COVID-19 y otras enfermedades.\nJorge Wated, quien encabeza una fuerza de tareas del gobierno, dijo que las autoridades recogieron unos 520 cadáveres de personas que fallecieron en sus casas la semana pasada. Hasta el martes habían sido enterrados 146 y se esperaba que otros 50 fuesen enterrados durante el día, según declaró a una radio local. Agregó que a los servicios de emergencia ahora les toma unas 12 horas recoger un cadáver.\nSe están distribuyendo unos 2000 ataúdes de cartón entre familias que no consiguen de madera, una práctica que Ecuador ya empleó tras un devastador terremoto que mató a casi 700 personas en el 2016, de acuerdo con Wated.\n“Hay que buscar la mejor (opción) que existe en este momento”, dijo el funcionario.\nEn todo el mundo se repiten escenas dolorosas en hospitales y funerarias que no dan abasto para disponer de los muertos por el coronavirus. En regiones devastadas de Italia los funerales son presenciados por un puñado de personas y duran cinco minutos. Terminan sin abrazos. En Estados Unidos algunas funerarias están retirando las sillas para facilitar el distanciamiento social o usando la tecnología para ofrecer libros de visitantes online y servicios transmitidos por la internet.\nEn Ecuador, donde aproximadamente una cuarta parte de la población gana menos de 85 dólares al mes, esos son lujos inalcanzables.\nEl gobierno entierra a muchos de los muertos, informando a los familiares a través de un nuevo portal en el que anuncian en qué cementerio están. Los familiares no podrán visitar las tumbas hasta que pase la emergencia.\nMelanie Peralta dijo que la crisis de Guayaquil pone de manifiesto las diferencias de clases. Su padre, Guillermo Villao, falleció el 31 de marzo tras sufrir fiebre, dolor de garganta y problemas para respirar, todos síntomas de coronavirus. Pero nunca se le hizo la prueba para confirmar si lo tenía o no. Al hospital donde falleció le tomó seis días averiguar adónde estaba el cadáver.\nLa familia pudo averiguarlo después de pagarle a un empleado el equivalente a 100 dólares para que los ayudase a encontrarlo.\n“No tenía manilla (identificación)”, dijo Peralta. “Y el cuerpo ya estaba descompuesto”.\nPeralta se pregunta qué hubiera pasado si no tenía dinero a mano para pagarle a alguien en el hospital para ayudarla a encontrar a su padre.\n“Lamentablemente el que no tiene dinero no encuentra a sus familiares”, manifestó.\nUn empleado estatal fue despedido en otro hospital el martes luego de que familiares de un muerto denunciasen que quería cobrarles para darles información del ser querido.\nWated dijo que esas historias son “una vergüenza”, pero que la identificación de los cadáveres es responsabilidad de los hospitales. Indicó que los empleados de los cementerios están tomando fotos de los muertos antes de enterrarlos. El gobierno dijo que enterrará todo cadáver que no ha sido recogido por familiares en las 24 horas después de su muerte.\nCedeño, un dirigente sindical de 57 años, fue llevado a un hospital público de Guayaquil a fines de marzo tras tener dificultades para respirar. No había camas disponibles, por lo que los médicos lo pusieron en una silla de plástico y le colocaron un tubo intravenoso, según Ricardo Ramírez, médico jubilado y amigo que se comunicó con él por teléfono.\nDoce horas después seguía en la misma silla y necesitaba desesperadamente un respirador, pero la unidad de cuidados intensivos continuaba repleta. Un empleado del hospital improvisó y le consiguió una camilla y una máscara de oxígeno de una ambulancia.\nPero ya era demasiado tarde. Cedeño falleció esa noche. Su familia cree que lo mató el virus, pero nunca se le hizo la prueba para confirmarlo.\nLos médicos “no tienen la culpa”, dijo Ramírez. “Ellos también están impotentes”.\nAgregó, no obstante, que el personal del hospital no siguió los protocolos correspondientes para identificar al cadáver y que las morgues no estaban desbordadas en ese momento.\n“Todo lo que pasó es una cosa increíble. Ese drama, ese horror que viven las personas aquí”, dijo Ramírez.\nMariscal pensó que había ubicado finalmente a su tío el martes cuando ingresó al portal del cementerio Jardines de Esperanza y vio el nombre Alfonso Cedeño, junto con información según la cual había sido enterrado el lunes.\nPero cuando fue a la cripta, su pariente no estaba allí.\n“Abro la bóveda... y estaba vacía”, señaló.\n___\nChristine Armario puede ser ubicada en carmario@ap.org o en www.twitter.com/cearmario .", "url": "https://apnews.com/26d1210291684ba089235e0b19e7833a"}