{"authors": ["Rod Mcguirk"], "date_download": "2020-05-04 20:26:48", "date_modify": "2020-05-04 20:26:48", "date_publish": "2020-04-20 23:46:32", "description": "CANBERRA, Australia (AP) — Virgin Australia, the nation’s second-largest airline, announced Tuesday it had entered voluntary administration, seeking bankruptcy protection after a debt crisis...", "filename": "_89f7484f6808918807f848a5e2dc275c_1588624008.html", "image_url": "https://storage.googleapis.com/afs-prod/media/7ae1e7fe36774de999d03e6005209580/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_89f7484f6808918807f848a5e2dc275c_1588624008.html", "title": "Virgin Australia airline seeks bankruptcy protection", "title_page": "Virgin Australia airline seeks bankruptcy protection ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this April 7, 2020, photo, grounded Virgin Australia aircraft are parked at Brisbane Airport in Brisbane, Australia. Virgin Australia, the nation's second-largest airline, announced Tuesday, April 21, 2020, it had entered voluntary administration as it seeks to strengthen its finances amid a debt crisis. (Darren England/AAP Image via AP)\nIn this April 7, 2020, photo, grounded Virgin Australia aircraft are parked at Brisbane Airport in Brisbane, Australia. Virgin Australia, the nation's second-largest airline, announced Tuesday, April 21, 2020, it had entered voluntary administration as it seeks to strengthen its finances amid a debt crisis. (Darren England/AAP Image via AP)\nCANBERRA, Australia (AP) — Virgin Australia, the nation’s second-largest airline, announced Tuesday it had entered voluntary administration, seeking bankruptcy protection after a debt crisis worsened by the coronavirus shutdown pushed it into insolvency.\nVirgin said in a statement to the Australian Securities Exchange that it had appointed a team of Deloitte administrators to “recapitalize the business and help ensure it emerges in a stronger financial position on the other side of the COVID-19 crisis.”\nVirgin is one of the first major airlines to seek bankruptcy protection in response to the pandemic. Virgin’s administrators have taken control of the company and will try to work out a way to save either the company or its business.\nThe move came after the Australian government refused Virgin’s request for a 1.4 billion Australian dollar ($888 million) loan.\nRival Qantas Airways argued that it had three times more revenue than Virgin and was therefore entitled to a AU$4.2 billion ($2.7 billion) loan if the smaller airline was not to gain an unfair advantage.\nAdministrator Vaughan Strawbridge said in the statement: “Our intention is to undertake a process to restructure and refinance the business and bring it out of administration as soon as possible.”\nVirgin will continue to operate its scheduled international and domestic flights, most of which have been canceled due to the pandemic.\nVirgin is struggling to repay AU$5 billion in debt after several loss-making years. Some analysts predict that if the airline survives, it will drop international services and focus on the Australian domestic market.\nVirgin Australia’s major shareholders are Singapore Airlines and Etihad Airways as well as Chinese investment conglomerates Nanshan Group and HNA Group. British billionaire founder Richard Branson holds a 10% stake.\nTreasurer Josh Frydenberg told reporters his “government was not going to bail out five large foreign shareholders with deep pockets who together own 90% of this airline.”\nBranson told Virgin Australia’s staff that the appointment of administrators was “devastating.”\n“In most countries federal governments have stepped in, in this unprecedented crisis for aviation, to help their airlines,” Branson posted online. “Sadly, that has not happened in Australia.”\nHe said Virgin would work with administrators, investors and the government to get the airline “back up and running soon.”\nBranson has asked the British government for a loan to prop up Virgin Atlantic, which his Virgin Group owns jointly with U.S. carrier Delta Air Lines. He is reportedly asking for 500 million pounds ($3.2 billion).\nHe has said he was willing to put up the private island where he lives in the British Virgin Islands as collateral for the loan\nThe Australian government and businesses fear that a collapse of Virgin would leave Qantas with a virtual monopoly in Australia’s domestic aviation market.\nPrime Minister Scott Morrison said he was encouraged that “10 parties have shown interest” in Virgin’s future and have approached administrators to discuss financial deals.\n“If we’d not taken the actions that we have and not demonstrated the patience that we have, then all we may have ended up doing is sending $1 billion to foreign shareholders and that was never part of my plan,” Morrison told reporters.\n“Our plan was always about seeing two viable airlines on the other side,” he added.\nVirgin filled a gap left when Qantas’ former main domestic rival, Air New Zealand-owned Ansett Australia, collapsed in 2001.\nBrisbane-based Virgin has 130 aircraft and employs 10,000 staff.\nOpposition lawmakers and union leaders urged the government to bail out Virgin to save jobs and low-price domestic airfares.\n“This crisis isn’t a result of market failure, it’s a result of a government decision to shut the market,” opposition leader Anthony Albanese said. “That’s why talk of market-based solutions at the moment is a triumph of ideology over common sense.”\nThe pandemic is a catastrophe for airlines around the world.\nIn the U.S., major airlines are getting $25 billion in government aid to pay workers and avoid massive layoffs. The assistance includes a mix of cash and loans, with the government getting warrants that can be converted into small ownership stakes in the leading airlines.", "url": "https://apnews.com/89f7484f6808918807f848a5e2dc275c"}