{"authors": [], "date_download": "2020-05-04 20:21:04", "date_modify": "2020-05-04 20:21:04", "date_publish": "2020-04-17 02:46:56", "description": "BANGKOK (AP) — Japanese Prime Minister Shinzo Abe said coronavirus social distancing efforts are still insufficient a day after he expanded a state of emergency to the entire country. Abe...", "filename": "_8cf6ce727c56e953e1b97f768512ebde_1588623664.html", "image_url": "https://storage.googleapis.com/afs-prod/media/45f22dce0ef94b719739bf34ae858b3f/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8cf6ce727c56e953e1b97f768512ebde_1588623664.html", "title": "Asia Today: Abe says social distancing still insufficient", "title_page": "Asia Today: Abe says social distancing still insufficient", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Shinzo Abe, Japan's prime minister, removes a face mask to help curb the spread of the coronavirus before speaking during a news conference at the prime minister's official residence in Tokyo, Friday, April 17, 2020. Abe expanded Thursday the state of emergency to step up measures ahead of a major holiday week coming up in early May so that people won’t travel around and possibly spread the virus. The ongoing state of emergency runs through May 6. (Kiyoshi Ota/Pool Photo via AP)\nShinzo Abe, Japan's prime minister, removes a face mask to help curb the spread of the coronavirus before speaking during a news conference at the prime minister's official residence in Tokyo, Friday, April 17, 2020. Abe expanded Thursday the state of emergency to step up measures ahead of a major holiday week coming up in early May so that people won’t travel around and possibly spread the virus. The ongoing state of emergency runs through May 6. (Kiyoshi Ota/Pool Photo via AP)\nBANGKOK (AP) — Japanese Prime Minister Shinzo Abe said coronavirus social distancing efforts are still insufficient a day after he expanded a state of emergency to the entire country.\nAbe asked Japanese in a speech Friday evening to stay home to save lives as infections surge in the nation’s capital. He said the situation in Tokyo is “severe” with a record 201 new coronavirus infections in one day, bringing the capital’s total to almost 3,000.\nAbe expanded the emergency in a bid to reduce the movement of people during Japan’s “golden week” holidays in early May.\nHe said social interactions had declined 60% in downtown Tokyo and 70% in Osaka, but that fell short of what experts deem necessary to slow the virus’s spread to a manageable level.\n“The movement of people from cities to countryside will surely trigger a nationwide rampant spread of the virus, which we fear the most,” he said. “I ask you all again, please refrain from going out.”\nNationwide, Japan has about 9,900 cases, including about 700 from a cruise ship quarantined near Tokyo, with 160 deaths.\nIn other developments in the Asia-Pacific region:\n— WUHAN DEATHS RE-COUNTED: The city where the pandemic began in late December added 1,290 deaths to its toll. Wuhan officials were quoted in state media as saying the deaths were initially missed because the city’s health system was overwhelmed at the outbreak’s peak. The revised Wuhan figures raised China’s death toll to 4,632, up from 3,342.\n— CHINA ACCUSES U.S. OF SHIFTING BLAME: China is accusing the U.S. of attempting to shift the focus from its own shortcomings with the coronavirus by spreading a theory that the pandemic was started by a pathogen that escaped from a Chinese laboratory. “Anyone discerning can tell at a glance that the purpose of the U.S. is simply to confuse the public, divert attention and shirk responsibility,” foreign ministry spokesman Zhao Lijian said Friday. U.S. officials including President Donald Trump and Secretary of State Mike Pompeo have suggested the lab theory may be valid, without presenting evidence. Zhao earlier speculated on Twitter that the virus was brought to Wuhan by the U.S. military,\n— CHINA’S ECONOMY TUMBLES: China suffered its worst economic contraction since at least the 1970s, and weak consumer spending and factory activity suggest it faces a longer, harder recovery than expected. The world’s second-largest economy shrank 6.8% last quarter after factories, shops and travel were closed to contain the virus.\n— HUNGER, NOT COVID: India’s poorest are suffering under the world’s largest lockdown. The virus could ravage the country, given low testing rates, a barely functional health system and its densely packed population of 1.3 billion, leaving a vast lockdown the least bad option. But the weeks without daily wages are an eternity for people at risk of losing their homes and going hungry.\n— CHINA URGED TO BE TRANSPARENT: An Australian Cabinet minister is urging China to be transparent about the origins of the coronavirus and predicted the world will rethink relations with it because of the pandemic. Home Affairs Minister Peter Dutton recently recovered from the virus, which he apparently contracted during a trip to Washington, D.C. Dutton told Nine Network on Friday: “I do think there will be a reset about the way in which the world interacts with China. We do want more transparency.”\n— PRAYUTH TO ASK BILLIONAIRES FOR HELP: Thailand’s leader will appeal directly to the country’s 20 wealthiest people for assistance in overcoming the coronavirus crisis. Prime Minister Prayuth Chan-ocha said the government alone cannot solve the health and economic challenges posed by the pandemic, so other sectors should join what he called “Team Thailand.” A business council warned this week that as many as 10 million Thais could lose their jobs in the next few months if the crisis doesn’t ease. Prayuth said the country’s billionaires are wealthy even by international standards, so they could play important roles in Team Thailand.\n— SINGAPORE CASES SPIKE: Singapore reported 623 new virus cases on Friday, pushing its total infections to 5,050. The increase was broadly expected after testing was increased among foreign workers, who accounted for most of the new cases. Clusters were reported in dormitories crowded with workers who use shared toilets, kitchens and other facilities. The government has quarantined workers in their dorms and moved others to reduce crowding.\n— INDONESIAN RECOVERIES EXCEED DEATHS: Indonesia says more people have now recovered than have died from the coronavirus. The Health Ministry announced Friday that 607 people have recovered while 520 have died. Indonesia has the highest number of fatalities in Asia after China. The country’s case count rose 407, its biggest daily jump, bringing its total to 5,923.\n— SOUTH KOREAN JOB LOSSES: South Korea lost nearly 200,000 jobs in March as the coronavirus shocks its economy and labor markets. Statistics Korea said the 195,000 jobs lost was the largest monthly decline since May 2009 during a global financial crisis. The country has confirmed 10,635 virus cases and 230 deaths. No new cases were reported Friday in the hardest-hit city of Daegu, where infections have waned. The impact of Wednesday’s national parliamentary elections, which had the highest turnout in nearly 30 years despite the coronavirus, will take a week or two to assess.\n— MORE PATIENTS TEST POSITIVE AGAIN: South Korea says it’s continuing to see a rise in patients who test positive for the coronavirus for a second time after being diagnosed as recovered. But it says the risk of transmissions from such cases so far appears to be low. The country’s Centers for Disease Control and Prevention said at least 163 people have tested positive again after their initial release from hospitals, or more than 2% of the country’s 7,829 recoveries. It said that none of the patients was in serious condition although 61 were exhibiting mild symptoms. Health authorities are investigating the causes of such cases. They say it’s likely that infections were re-activated after remaining dormant in patients whose bodies hadn’t fully developed immunity after experiencing mild symptoms.\n___\nFollow AP coverage at https://apnews.com/VirusOutbreak", "url": "https://apnews.com/8cf6ce727c56e953e1b97f768512ebde"}