{"authors": ["David Sharp"], "date_download": "2020-05-04 20:11:52", "date_modify": "2020-05-04 20:11:52", "date_publish": "2020-04-16 16:34:16", "description": "PORTLAND, Maine (AP) — Democratic U.S. Senate candidate Sara Gideon raised $7.1 million — more than double the haul of the longtime incumbent Republican Sen. Susan Collins — during the first...", "filename": "_be9133c749f9df8d42750a0b9f317c62_1588623112.html", "image_url": "https://storage.googleapis.com/afs-prod/media/1c59d60b126f4235aa579ae7b14b403b/2417.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_be9133c749f9df8d42750a0b9f317c62_1588623112.html", "title": "Gideon takes fundraising lead, but Collins has more cash", "title_page": "Gideon takes fundraising lead, but Collins has more cash", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - This pair of file photos shows incumbent U.S. Sen. Susan Collins, R-Maine, in 2019, left, and Maine House Speaker and Senate contender Sara Gideon, D-Freeport, right. Gideon raised more than double what Collins raised during the first quarter of 2020, according to financial disclosure reports. (AP Photos, File)\nFILE - This pair of file photos shows incumbent U.S. Sen. Susan Collins, R-Maine, in 2019, left, and Maine House Speaker and Senate contender Sara Gideon, D-Freeport, right. Gideon raised more than double what Collins raised during the first quarter of 2020, according to financial disclosure reports. (AP Photos, File)\nPORTLAND, Maine (AP) — Democratic U.S. Senate candidate Sara Gideon raised $7.1 million — more than double the haul of the longtime incumbent Republican Sen. Susan Collins — during the first quarter of 2020 to raise her total funding to a state record $14.8 million, according to financial disclosure reports.\nCollins, who’s seeking a fifth term, raised another $2.4 million in the quarter, bringing her total contributions to $13.2 million. She had more cash available, with $5.6 million to Gideon’s $4.6 million, the reports indicated.\nThose big campaign dollars show that Democrats think they have someone who has a chance to unseat the incumbent, said Mark Brewer, a political scientist at the University of Maine.\n“Susan Colllins is in the reelection fight of her life. She’s never run a race like this as a sitting U.S. senator,” he said.\nCollins, for her part, scaled back fundraising and canceled in-person fundraisers during the period to focus on the federal response to the coronavirus pandemic. Her campaign has been running public service announcements focusing on the pandemic.\nCollins and independent Sen. Angus King of Maine were both appointed by Trump to a bipartisan congressional task force that’ll advise the president on how to safely restart the U.S. economy.\n“Senator Collins is solely focused on the health of the people of Maine and our country and the well-being of our economy. Our campaign will have the funds it needs,” said campaign spokesman Kevin Kelley.\nGideon’s allies, meanwhile, have been running ads attacking Collins over the Republican administration’s response to the coronavirus.\nThe latest figures from filings with the Federal Election Commission show money continues to pour into the high-profile race.\nThe race, which is already the most expensive in Maine history, represents one of a handful of opportunities for Democrats to pick up seats in the Senate in the pursuit of seizing control of the chamber from the GOP.\nIn the end, both candidates will have plenty of money, regardless of who can claim they raised the most, Brewer said.\n“This is one of those races where neither campaign is going to be put in a spot where they can’t do something because they don’t have the money to do it. Each side is going to have the money that they want to do, and then some,” Brewer said.\nGideon, speaker of the Maine House, won an early endorsement from the Democratic Senatorial Campaign Committee.\nBut she faces a primary challenge from lobbyist Betsy Sweet and attorney Bre Kidman. The primary has been pushed back to Tuesday, July 14.\nSeveral independents in the race include attorney Tiffany Bond and conservative businessman Max Linn.", "url": "https://apnews.com/be9133c749f9df8d42750a0b9f317c62"}