{"authors": [], "date_download": "2020-05-04 21:10:22", "date_modify": "2020-05-04 21:10:22", "date_publish": "2020-04-30 22:23:22", "description": "Pastors are trying to figure out ways to spread the word of God without spreading the coronavirus.", "filename": "entry_passing-the-plate-church_n_5eab4da2c5b6995f13fe3dad_1588626622.html", "image_url": "https://img.huffingtonpost.com/asset/5eab4e50220000700d827f6c.jpeg?cache=k38zoml9wb&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_passing-the-plate-church_n_5eab4da2c5b6995f13fe3dad_1588626622.html", "title": "Some Churches Are Passing On Passing The Plate For Now", "title_page": "Some Churches Are Passing On Passing The Plate For Now | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "TALLAHASSEE, Fla. (AP) — It’s almost unheard of to go into a Southern Baptist church and not have a plate passed for donations.\nUntil now.\n“It took a pandemic for a Baptist church to quit passing a plate. That’s almost unthinkable. It’s close to heresy. Real close,” said David Uth, pastor of the First Baptist Church of Orlando and president of the Southern Baptist Pastors Conference on a video conference on how to reopen churches. “It’s just not going to be the same.”\nThe meeting was set up by the Florida Family Policy Council and had about 800 church leaders from across the country listening to the conversation about the impact of the coronavirus on religious institutions and what to do going forward. A prominent message was that a church isn’t just a building, but rather a community, so there has to be a new way of thinking about spreading God’s message and not spreading a disease.\n“Everything that we’ll do, we’ll do outside,” said Eli Hendricks, the pastor at a small Tallahassee church. “I will perform baptisms. I feel like that is an instrumental time in the life of a believer.”\nBut he said he will ask people to wear something to cover their faces. And when it comes time for an offering, he, too, won’t pass a plate.\n“We’re not going to pass the tray, because if you have dozens of people touching them, you raise the risk of that virus being passed,” he said.\nInstead, pastors said they’ll set up donation stations at the front of churches, or go back to the long-handled baskets that can be extended down church aisles.\nThey also talked about different ways to reach people, such as social media, the internet or even “snail mail” to deliver a message instead of encouraging large crowds to gather in the same place.\nUth said that included livestreaming a funeral that he only allowed 10 people to attend in person.\n“You know what? It was a beautiful thing. It actually was incredible. I was so worried going into it that it just wasn’t going to be what it can be and should be, but it absolutely was amazing,” Uth said. “So you know what? I think we can do these things, we just have to do them a little differently.\nHe said that may mean not opening up churches to large groups.\n“What are the essentials that God would say for the church? We developed a series called essentials, and guess what? Our building wasn’t one of them,” Uth said. “Do we have to meet to be a church? No. Do we have to have a building to be a church? No. That’s not essential.”\n“The greatest church is a healthy church,” he added.\nAs far as getting back to normal, Uth said he would take a cue from a being larger than his church.\n“When Disney opens, we’re going to open,” said Uth, who has a church with more than 5,000 members. “That sends a message to the people here, our people, that it must be OK. I think we would do well to gain wisdom from them. We don’t have to do it at the same time, but at least learn from them.”\nChurches’ plans to move forward during this crisis could create new opportunities, said John Stemberger, president of the Florida Family Policy Council.\n“This could be the churches’ finest hour. It really could be, if we respond with grace and respond with wisdom,” Stemberger said.\n___\nFollow AP coverage of the pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.", "url": "https://www.huffpost.com/entry/passing-the-plate-church_n_5eab4da2c5b6995f13fe3dad"}