{"authors": ["Tami Luhby"], "date_download": "2020-05-04 15:58:41", "date_modify": "2020-05-04 15:58:41", "date_publish": "2020-04-01 03:07:19", "description": "The Trump administration has decided not to reopen enrollment in the Affordable Care Act's federal exchanges amid the rising coronavirus pandemic, a senior administration official said Tuesday evening.", "filename": "2020_03_31_politics_afforda_bc32b56a356d5801e5ed4c969feab3c7_index_1588607921.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331203235-donald-trump-march-31-2020-01-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_politics_afforda_bc32b56a356d5801e5ed4c969feab3c7_index_1588607921.html", "title": "Obamacare: Trump administration won't reopen enrollment for uninsured", "title_page": "Obamacare: Trump administration won't reopen enrollment for uninsured - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Trump administration has decided not to reopen enrollment in the Affordable Care Act's federal exchanges amid the rising coronavirus pandemic, a senior administration official said Tuesday evening.\nPressure had been building on the White House to launch a special enrollment period to allow the uninsured to purchase Obamacare policies. The decision came the same day that President Donald Trump warned of a painful two-week stretch ahead as infections continue to spread.\nDemocratic lawmakers asked administration officials to temporarily reopen the exchanges several weeks ago. Also, two leading health insurance industry groups wrote congressional leaders in mid-March asking for such a move.\n\"Given the risk posed by Covid-19, it is more important than ever for people to have health coverage,\" the CEOs of America's Health Insurance Plans and Blue Cross Blue Shield Association wrote, referring to the disease caused by coronavirus.\nRead More", "url": "https://www.cnn.com/2020/03/31/politics/affordable-care-act-obamacare-open-enrollment-trump/index.html"}