{"authors": ["Analysis Zachary B. Wolf"], "date_download": "2020-05-04 16:18:19", "date_modify": "2020-05-04 16:18:19", "date_publish": "2020-04-04 04:01:11", "description": "We are all stuck in the midst of this thing -- whether on the front lines of fighting it or just in our houses waiting for it to pass. More and more people are getting sick, and that means more and more people are being directly touched by the devastation of this disease.", "filename": "2020_04_04_politics_what-matters-april-3_index_1588609099.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403180010-02-coronavirus-testing-new-york-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_politics_what-matters-april-3_index_1588609099.html", "title": "'Normal' will look completely different when this is all over", "title_page": "What Matters: 'Normal' will look completely different when this is all over - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story appeared in CNN's What Matters newsletter. To get it in your inbox, sign up for free here\nIt's going to get worse still, but it's not too soon to think about how we will start to come out of this. Here's one economic expert's view on how we climb out of the brewing coronavirus recession . Below, CNN's medical team weighs in about how the immediate health crisis, unprecedented though it is, will ultimately end and how humans will defeat Covid-19.\nWill we just have to deal with this again in the fall\nAnswer: We don't know.\nA vaccine would be great, but it will take at least a year to a year and a half.\nHopefully we'll find something sooner than that to prevent Covid-19, or to treat it. Those trials are underway\nAt some point, herd immunity will come into play, but that will also take a while, since still the vast majority of Americans don't have antibodies and therefore are vulnerable to Covid-19.\nOne of the smartest things I ever heard anyone say about Covid-19 is that we don't know what we don't know.\nViruses surprise us.\nWho knew that Zika could be transmitted sexually? Who knew that Ebola can linger in people's eyes? We don't know if Covid-19 is seasonal, like the flu. (And remember -- the flu doesn't disappear in warmer weather; the numbers just drop dramatically.)\nWe don't know if Covid-19 will return in the fall. This is a new virus and it is teaching us what it is and what it will do.\nWe don't know when this will end. But here's what I hope: We are a better, kinder and stronger group of people.\nHopefully there will be a vaccine and new treatments in several months -- this will help both treat people who are sick and prevent people from getting sick.\nThere's still a lot that we need to learn about this virus -- why does it strike some people so severely and not others?\nWhat interplay do our genes have on this virus ? Why is it some conditions seem to make this disease so much worse? But I do know that in order to get through this we need to work together and hopefully that effort will be the lasting legacy.\nTransition strategies and what comes next\nDr. Mike Ryan, executive director of the World Health Organization health emergencies program, spoke Friday about getting from the crisis to the post-crisis.\nRyan talked about \"transition strategies\" and said each country needs a strong public health architecture, a massive investment in our capacity to do surveillance, contact tracing, isolation and quarantine, and a robust information system so that people know what to do and where to go if they are sick.\n\"And if we do that, we have a chance of transitioning back into a life, and economic and social life, that may, in some senses, not be the same again, maybe a more caring, engaged society with a better health care system, with better universal access to health care, with more social justice, and more care for each other, and that won't be a bad society to go back to.\"\n\"We don't want to end up in a cycle of lockdown, followed by release, followed by another lockdown, followed by release. That's not the way forward. And the way to avoid that is we need a transition strategy that gets us back into more control of the virus. We need to get ahead of the virus.\"\nGet ready for some creative solutions\nProof of immunity -- There are other ideas gaining traction. In the UK, they are considering the possibility of \"immunity passports\" -- people who have recovered from the disease would essentially get papers to return to work.\nOne major issue here: It's unknown how long immunity will last after a person recovers from Covid-19.\nAnd testing, as we know, is imperfect. It might not be possible to guarantee immunity.\nBut certainly there will soon be an army of people who have recovered from Covid-19 and want to return to a functioning society.\nThe thinking will change -- It's never been more clear that health experts and the government are guessing about things too.\nWhile they have long said that only people with symptoms should be tested, it's the countries that engaged in large amounts of testing that have fared best.\nThe CDC used to say there was no evidence that school closures would slow the spread. But nearly every American school kid is home now.\nMore permanent lockdown -- In China, there are color-coded phones for the government to monitor where people go and, also, to enforce quarantine on certain areas.\nRelated: Read this essay by an American woman who has emerged from quarantine in China, Read this essay by an American woman who has emerged from quarantine in China, but says \"normal\" isn't normal there anymore\nWhat about China -- On the one hand, they appear to have turned the corner on the coronavirus.\nStrict restrictions there are starting to be relaxed. But the data coming out of China maybe cannot be trusted\nSpeed read", "url": "https://www.cnn.com/2020/04/04/politics/what-matters-april-3/index.html"}