{"authors": ["Congressional Reporter"], "date_download": "2020-05-04 20:13:37", "date_modify": "2020-05-04 20:13:37", "date_publish": "2020-04-29 00:45:36", "description": "It's a surprise 2020 entry that's been a long time coming.", "filename": "entry_justin-amash-running-2020-president_n_5d801af0e4b077dcbd62fc1e_1588623217.html", "image_url": "https://img.huffingtonpost.com/asset/5d801bac2300001005551a54.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_justin-amash-running-2020-president_n_5d801af0e4b077dcbd62fc1e_1588623217.html", "title": "Justin Amash Announces He's Running For President", "title_page": "Justin Amash Announces He's Running For President | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "WASHINGTON ― It’s been a question weighing on Rep. Justin Amash’s mind for months: whether to run for his House seat again as an independent, or whether he should run for president. On Tuesday, the Michigan lawmaker finally decided he’s going for the White House.\nAmash, a five-term congressman who turned 40 last week, made the announcement Tuesday evening.\n“We’re ready for a presidency that will restore respect for our Constitution and bring people together,” Amash wrote on Twitter. “I’m excited and honored to be taking these first steps toward serving Americans of every background as president.”\nHe will run, he said, as a Libertarian, which will allow him to more easily get on state ballots ― if he does, as expected, win the Libertarian Party’s nomination.\nBut Amash will still have a tough time finding traction in a race between Democrat Joe Biden and Republican President Donald Trump.\nBill Pugliano via Getty Images Rep. Justin Amash was the first then-Republican member of Congress to say that President Donald Trump engaged in impeachable conduct.\nThe Michigan representative has long toyed with the idea of running for president. Sources close to Amash said he originally planned to announce his presidential campaign on Constitution Day, Sept. 17. (Amash declared his “independence from the Republican Party” on July 4 last year.)\nHowever, he held back on the decision, waiting to see how the Democratic presidential primary would shake out. Amash told some staff that he saw more of an opening for his run if Biden won the nomination instead of someone like Sen. Bernie Sanders (I-Vt.).\nAmash privately sounded confident that he could win his congressional seat again, despite facing attacks from Republicans and Democrats. But as it became clear that Biden would be the Democratic nominee, Amash began thinking about running for president again.\nThe coronavirus has potentially complicated his campaign since Amash will rely heavily on earned media rather than paid advertising ― and it may be more difficult to get on TV or conduct interviews during the pandemic.\nHe may have a different strategy, though.\nRather than winning 270 electoral votes and the presidency outright, he may be looking to be a spoiler candidate ― preventing either Trump or Biden from getting 270. In that situation, the election would be thrown to the House of Representatives, and Amash may think he can be a compromise candidate.\nThat, however, seems like extremely wishful thinking.\nEven if Amash is on the ballot in all 50 states, it’s unclear which states he thinks he could win ― and from which candidate he might steal more votes.\nA poll conducted last June by The Detroit News suggested Amash would hurt Biden in Michigan more than he would hurt Trump, though, with time, Amash’s small-government, get-spending-under-control-and-government-out-of-your-life platforms may end up appealing more to disaffected Republicans.\nStill, if Amash is looking to steal votes from the president, the Republican Party’s fealty to Trump is a real problem. He may think Trump’s lackluster response to the coronavirus will help him with Republicans. But polling suggests views of the president’s handling of the crisis are largely seen through a partisan lens. On average, more than 85% of Republicans approve of Trump’s response, while only 16% of Democrats approve.\nAmash may find more traction with disaffected Democrats, but his track record of extreme conservatism may hamper him there, too. He strongly opposes government spending and assistance, and he has taken many unpopular positions that have drawn public ire. (In February, Amash voted against an anti-lynching bill, arguing that the bill would weaken African Americans’ rights and only codify existing law. He was criticized online for weeks.)\nEither way, Amash’s bid may be less about winning and more about sending a message.\nAmash very famously became the first congressional Republican to support Trump’s impeachment in May 2019 before choosing to withdraw from the GOP in July.\nThe former Republican from Michigan has stayed mostly quiet since then. He’s largely avoided television appearances and interviews, but in those he did do ― like this interview with a local Michigan TV station ― Amash was coy about running for president. When asked, he took to saying he wasn’t in the business of ruling things out.\nIndeed, far from ruling things out, the introverted, often-Machiavellian Amash seems to have been plotting his run all along.\nHe’s likely to make his obedience to the Constitution a main platform for his election, and he will almost certainly try to draw a contrast between himself and two men in their 70s.\nAmash will also likely use his reputation as a principled ideologue ― someone who has always valued his own ideas over his party’s — to try to win votes.\nBut again, he’s also gained a reputation as someone who enjoys being the lone dissenter. If there’s ever a vote in the House of Representatives in which all but one lawmaker votes yes, there’s a good chance the no vote is Amash.\nStill, Amash has said he prides himself on his ability to take the proverbial half-loaf. He will vote for legislation that he believes advances good ideas on the whole, even if it’s imperfect.\nAmash was famously the last Republican vote on the GOP health care bill in May 2017, even though he expressed a number of reservations. As one of the founding members of the conservative House Freedom Caucus ― a group Amash has since quit ― he had assured GOP Whip Steve Scalise (R-La.) that he would support the measure if Republicans needed a vote. When it became clear that Republicans actually needed the vote, Scalise shouted across the House floor, “Amash! Amash!”\nHe reluctantly voted for the bill.\nAll the same, Amash’s run for president as a Libertarian is a natural step in his progression from a tea party Republican to an enemy of the modern GOP.\nAmash has said he feels like he’s “the last of the tea party.” And he’s made no secret of his opposition to Trump. It’s as if the president was uniquely designed to represent all the things in the Republican Party that Amash dislikes. But his personal feelings aside, Amash has said he supports impeaching Trump because of the facts presented in special counsel Robert Mueller’s report. And he voted to impeach Trump in December over the president’s conduct regarding military assistance to Ukraine.\nIf Amash follows through on his run, he will forgo running for reelection in his Republican-leaning congressional district, likely handing the seat to a Trump-friendly Republican.", "url": "https://www.huffpost.com/entry/justin-amash-running-2020-president_n_5d801af0e4b077dcbd62fc1e"}