{"authors": [], "date_download": "2020-05-04 16:34:00", "date_modify": "2020-05-04 16:34:00", "date_publish": "2020-04-07 22:12:58", "description": "Former acting Navy Secretary Thomas Modly resigned on Tuesday, a day after calling the former captain of the USS Theodore Roosevelt \"too naive or too stupid\" to be captain of the aircraft carrier following a leaked memo warning of a coronavirus outbreak on the ship.", "filename": "2020_04_07_politics_thomas-modly-resignation-letter_index_1588610040.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407151837-03-thomas-modly-december-2019-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_thomas-modly-resignation-letter_index_1588610040.html", "title": "READ: Former acting Navy Secretary Thomas Modly's resignation letter", "title_page": "READ: Former acting Navy Secretary Thomas Modly's resignation letter - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Former acting Navy Secretary Thomas Modly resigned on Tuesday, a day after calling the former captain of the USS Theodore Roosevelt \"too naive or too stupid\" to be captain of the aircraft carrier following a leaked memo warning of a coronavirus outbreak on the ship.\nRead his resignation letter here:\nIt has been the honor of my life to serve as the Under Secretary of the Navy and for the last five months, the Acting Secretary of the Navy. I am thankful for the confidence both you and President Trump have expressed in me to discharge these weighty duties on behalf of our Sailors, Marines, and the American people.\nMore than anything, I owe every member of the Navy and Marine Corps team a lifetime of gratitude for the opportunity to serve for them, and with them, once again. They are the reason why I will forever remain inspired by the call of service. They are the ones who lift our nation, heal our divides, and make this country the greatest in the history of the world.\nThat is why with a heavy heart, I hereby submit my resignation, effective immediately. The men and women of the Department of the Navy deserve a continuity of civilian leadership befitting our great Republic, and the decisive naval force that secures our way of life. I will be forever grateful for my opportunity, and the blessing, to be part of it.\nRead More", "url": "https://www.cnn.com/2020/04/07/politics/thomas-modly-resignation-letter/index.html"}