{"authors": ["Caroline Kelly"], "date_download": "2020-05-04 16:21:37", "date_modify": "2020-05-04 16:21:37", "date_publish": "2020-04-05 23:45:57", "description": "Washington state Gov. Jay Inslee decried the surgeon general's comments on Sunday comparing the anticipated swell in the coronavirus crisis to Pearl Harbor in light of the President's prior comments on qualifying federal support to states struggling to fight the outbreak.", "filename": "2020_04_05_politics_washing_594f5731899bb4a131978cc548173f6c_index_1588609297.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403084723-washington-gov-jay-inslee-speaks-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_washing_594f5731899bb4a131978cc548173f6c_index_1588609297.html", "title": "Washington governor slams Trump administration for comparing coronavirus' grim outlook to Pearl Harbor", "title_page": "Gov. Jay Inslee: Washington governor slams Trump administration for comparing coronavirus' grim outlook to Pearl Harbor  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Washington state Gov. Jay Inslee decried the surgeon general's comments on Sunday comparing the anticipated swell in the coronavirus crisis to Pearl Harbor in light of the President's prior comments on qualifying federal support to states struggling to fight the outbreak .\n\"Can you imagine if Franklin Delano Roosevelt said, 'I'll be right behind you, Connecticut, good luck building those battleships'?\" Inslee told NBC on Sunday. \"Look, we need a national mobilization of the manufacturing base of the United States as we'd started on December 8, 1941.\"\nEarlier on Sunday, Surgeon General Jerome Adams predicted that this week would be the \"hardest and the saddest\" for \"most Americans' lives,\" describing the upcoming period of the coronavirus pandemic in the United States as \"our Pearl Harbor moment.\"\nInslee, a Democrat, called it \"ludicrous that we don't have a national effort in this, to say 'we're a back up,'\" appearing to reference President Donald Trump's repeated comments that the federal stockpile should serve as \"a backup\" to states' reserves.\nInslee's comments come as governors , struggling to outfit frontline workers with personal protective equipment and ventilators as the number of coronavirus cases and deaths continues to climb, have experienced varying success in securing federal aid\nThe Washington state governor, who ran for the Democratic nomination for president last year, called for invoking the Defense Production Act, which gives the government more control during emergencies to direct industrial production, \"so that we can get these companies, instead of making cupholders, start making visors, start making test kits\" -- a scarce resource in many states, he added.\nInslee said that he and governors of both stripes \"have been urging the President to do what he should.\"\n\"If he wants to be a wartime President, be a wartime President,\" Inslee added. \"Show some leadership, mobilize the industrial base in the United States -- that's what we need.\"", "url": "https://www.cnn.com/2020/04/05/politics/washington-governor-inslee-pearl-harbor-coronavirus/index.html"}