{"authors": ["Reporter"], "date_download": "2020-05-04 20:13:43", "date_modify": "2020-05-04 20:13:43", "date_publish": "2020-04-28 00:02:12", "description": "As many have lost jobs when businesses closed to curb the spread of COVID-19, activists are calling for rent forgiveness for those unable to pay.", "filename": "entry_rent-strike-california-coronavirus_n_5ea75ee1c5b608582577a710_1588623223.html", "image_url": "https://img.huffingtonpost.com/asset/5ea762c42400005a008e9d20.png?cache=loqx3wsgrc&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_rent-strike-california-coronavirus_n_5ea75ee1c5b608582577a710_1588623223.html", "title": "Thousands Of Californians Plan May 1 Rent Strike Amid Coronavirus Crisis", "title_page": "Thousands Of Californians Plan May 1 Rent Strike Amid Coronavirus Crisis | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Patricia Mendoza lost her job with a non-emergency medical transport service after nursing homes placed restrictions on people coming in and out amid the coronavirus crisis. Now the mother of two is out of work and can’t afford to pay her rent due May 1.\n“It’s not like I could put money away and save for a rainy day — we live paycheck to paycheck,” said Mendoza, who is the sole breadwinner in her Imperial Beach, California, household. “How am I gonna pay them if I have no income, there’s nothing coming in?”\nMendoza’s employer, where she’d been working since July of last year, offered no severance pay or other job loss support. Of the $2,000 she earned each month, $1,500 had gone to rent. She’s been trying to file for unemployment benefits, but the government-run website keeps malfunctioning. And she can’t work in grocery stores or other frontline jobs because she has asthma and would be risking her health.\n“That’s hard when you have to choose: work or your health or your kids. Where does it fit?” Mendoza said. “I don’t want to be homeless. I have two kids. I work too hard.”\nMendoza is one of the estimated thousands of Californians who are demanding that Gov. Gavin Newsom (D) cancel rent and mortgage payments during the coronavirus crisis. If he doesn’t, they plan to strike by not paying rent on May 1.\nAround 200 to 300 people have signed up to organize their buildings to strike, according to Jorge Rivera, a regional coordinator for the California housing rights group Tenants Together. While most people will be striking because they can’t afford to pay, some plan to withhold rent in solidarity.\nWhile California has issued a moratorium on evictions during the pandemic, renters are still responsible for any missed payments after the moratorium lifts. Such an approach “only delays the problem,” wrote Hillary Ronen, a member of the San Francisco Board of Supervisors, in a recent report calling on the state to suspend rent and mortgage payments throughout the crisis for “those in need.”\nHuffPost reached out to Newsom’s office for comment but did not get an immediate response.\n“There’s a moratorium right now, but what happens after?” said Mendoza, who has been going to a local food bank and relying on kind neighbors, who have dropped off groceries in recent weeks. “When am I gonna finish paying? Never. I’m never gonna be able to.”\nSF renters, West Side Tenants Association & Veritas Tenant Association call on @GavinNewsom to use his power to #CancelRent, mortgages & utility payments NOW to protect residents from the economic fallout of COVID-19.\nVirtual town hall live now: https://t.co/vlVpy2W82K pic.twitter.com/AKslbti0Fy — Housing Rights Committee (@housingrightsSF) April 27, 2020\nAt a national level, housing rights groups are calling for rent cancellation. And in New York, activists are also organizing tenants to participate in a rent strike for May 1.\nAs the pandemic has led states to broadly shutter businesses, a record 26 million Americans have filed for unemployment benefits over the last five weeks — and that doesn’t count those unable to file or ineligible for unemployment benefits, including undocumented workers.\nEarlier this month, Rep. Ilhan Omar (D-Minn.) introduced legislation calling for “emergency rent and mortgage cancellation” during the crisis. The bill would provide landlords with relief funds from the federal government.\nSuch rent forgiveness would help tenants like Merika Reagan in Oakland, California, who has been unable to pay rent since April 1, after her small pet care business lost almost all its customers amid the state’s stay-at-home order.\nThe 45-year-old, who plans to join the rent strike on May 1, has provided dog walking, pet sitting and other services to local residents for eight years. But since people began staying home and caring for their own pets, her 20-or-so regular monthly clients have dropped to three.\n“As soon as the crisis is over, landlords will be looking for back-pay rent. But if I don’t have it coming in, where is it supposed to come from?” Reagan said.\nShe has yet to receive the federal government’s $1,200 relief check for lower-income Americans — and even if she gets it, it would cover only a fraction of her $2,200 rent.\nReagan is “very worried” about becoming homeless. “Without rent forgiveness, when this thing is over, if they’re planning on evicting anyone who can’t agree to whatever their payment arrangements are, that’s gonna be me,” she said.\nHomeless people are especially at risk of contracting the virus and suffering more severe outcomes because those living in “congregate” settings, like shelters or encampments, are often unable to follow social distancing guidelines. San Francisco saw a major outbreak at one of its shelters earlier this month.\n“The issues that we’re lifting up by doing a ‘cancel rent’ campaign were already there,” said Rivera, adding that the pandemic is “really just bringing into the spotlight the fact people were already having trouble paying rent.”\n“People should have a basic human right to housing,” Rivera said.\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/rent-strike-california-coronavirus_n_5ea75ee1c5b608582577a710"}