{"authors": [], "date_download": "2020-05-04 20:24:25", "date_modify": "2020-05-04 20:24:25", "date_publish": "2020-04-04 23:16:54", "description": "BALTIMORE (AP) — Dozens of inmates have been released from jails and prisons in Baltimore in the past two weeks during new or accelerated bail hearings, the state judicial system said. The actions...", "filename": "_65bebac4607475471615fe4ca790770e_1588623865.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_65bebac4607475471615fe4ca790770e_1588623865.html", "title": "Dozens released from Baltimore jails, prisons", "title_page": "Dozens released from Baltimore jails, prisons ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BALTIMORE (AP) — Dozens of inmates have been released from jails and prisons in Baltimore in the past two weeks during new or accelerated bail hearings, the state judicial system said. The actions come as judiciary leaders nationwide decide whether lowering jail populations would blunt the spread of the coronavirus.\nThose freed were considered by the Baltimore City State’s Attorney’s Office to be low-risk offenders who would not post a public safety threat, according to the Maryland Judiciary Office of Public Affairs.\nSixty people had been released as of Friday, judiciary spokeswoman Nadine Maeser told The Baltimore Sun. More releases are being considered.\n“Numerous individuals have been released through this process every day,” Maeser said. “The judge will make a decision based on the facts and circumstances of each case, taking into account the recommendation of each attorney and the current situation with the COVID-19 emergency.”\nMaryland health officials reported more than 3,100 positive COVID-19 cases and at least 53 deaths as of Saturday. On Friday, there were 42 deaths and more than 2,750 cases.\nThe new coronavirus causes mild or moderate symptoms for most people. For some, especially older adults and people with existing health problems, it can cause more severe illness or death.\n___\nFollow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/65bebac4607475471615fe4ca790770e"}