{"authors": [], "date_download": "2020-05-04 16:27:48", "date_modify": "2020-05-04 16:27:48", "date_publish": "2020-01-30 22:56:42", "description": "Earn bonus miles by signing up for a new Delta credit card from American Express.", "filename": "2020_01_30_cnn-underscored_delta-credit-card-bonus-offer_index_1588609668.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200128172604-underscored-delta-airplane-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_01_30_cnn-underscored_delta-credit-card-bonus-offer_index_1588609668.html", "title": "Bonus Offers and Rewards - CNN", "title_page": "Delta Credit Cards | Bonus Offers and Rewards - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through The Points Guy affiliate network if you apply and are approved for a card, but our reporting is always independent and objective.\nTravel isn't a priority at the moment, but eventually planes will return to the skies. And when that happens, the airlines are likely to offer some great award sales to get people back onto flights. Ideally you'll want to have a pile of frequent flyer miles ready to go so you can take advantage.\nRight now you can earn up to 40,000 bonus miles and 10,000 elite status miles by signing up for a new personal Delta credit card from American Express, and up to 45,000 bonus miles and 10,000 elite status miles for a business credit card.\nLet's start with a look at the personal Delta credit card offers, which break down like this (terms apply):\nDelta SkyMiles® Blue American Express Card: Earn 10,000 bonus miles when you spend $500 in the first three months of account opening.\nDelta SkyMiles® Gold American Express Card: Earn 35,000 bonus miles when you spend $1,000 in the first three months of account opening.\nDelta SkyMiles® Platinum American Express Card: Earn 40,000 bonus miles when you spend $2,000 in the first three months, plus a $100 statement credit after you make a Delta purchase with your new card within your first three months of account opening.\nDelta SkyMiles® Reserve American Express Card: Earn 40,000 bonus miles and 10,000 Medallion Qualification Miles (MQMs) when you spend $3,000 in the first three months of account opening.\nDelta uses a dynamic pricing scheme for its award flights instead of a fixed award chart, so you can expect to get a fairly consistent value for your miles. CNN Underscored's partner The Points Guy values Delta SkyMiles at 1.2 cents apiece, making these bonuses worth between $120 and $480.\nThe bonus MQMs offered on the Delta Reserve can also be a big boost for anyone actively chasing Delta elite status, especially since Delta has announced all 2020 MQMs will roll over to 2021 due to the coronavirus crisis.\nWhich Delta credit card should you choose?\nThere are four different personal Delta credit cards available.\nWhile all these cards are geared toward Delta flyers, the best Delta credit card for you will depend on your spending habits and how frequently you plan to fly with the airline once travel returns to normal.\nIf it's simply bonus miles you're after and you don't want to pay an annual fee, then the Delta SkyMiles Blue Amex card is for you. It earns 2 miles for every dollar you spend on eligible Delta purchases and at restaurants worldwide, and 1 mile per dollar on everything else. It also offers a 20% discount on in-flight purchases, access to Delta's Pay with Miles program and no foreign transaction fees.\nHowever, if you plan to fly Delta occasionally — even once per year — when planes are back in the air and don't mind paying a $99 annual fee (which is even waived for the first year you have the card), you'll get a lot more value from the Delta SkyMiles Gold Amex.\nAside from a much heftier welcome bonus, the Delta Gold Amex comes with more perks, including your first checked bag free (which normally costs $30-$60 for basic economy passengers), priority boarding and a $100 Delta flight credit after you spend $10,000 in eligible purchases on your card in a calendar year. In addition to 2 miles per dollar on Delta and restaurant purchases, it earns 2 miles per dollar on US supermarket spending.\nPremium Delta credit card options\nIf you plan to go on more than a few trips each year after planes return to the skies and Delta is your carrier of choice, it'll probably make more sense to go with one of Delta's more premium credit cards. The Delta SkyMiles Platinum Amex and the Delta SkyMiles Reserve Amex have annual fees of $250 and $550 respectively, but are loaded with elite-like benefits and shortcuts to earning elite status to go along with them.\nThe Delta Platinum Amex has many of the same perks as the Gold version, such as a free checked bag on Delta flights and priority boarding, plus it earns 3 miles for every dollar you spend on eligible Delta purchases and at hotels, and comes with a Global Entry/TSA PreCheck fee credit worth up to $100 every 4 years (or 4½ years for TSA PreCheck), and a domestic main cabin round-trip companion certificate each year upon renewal of your card.\nFor those chasing Silver, Gold or Platinum elite status, the Delta Platinum Amex waives Delta's Medallion Qualifying Dollars (MQD) requirement when you spend $25,000 on the card in a calendar year, and also offers up to 20,000 in bonus MQMs every year — 10,000 MQMs when you spend $25,000 on the card in a year, and another 10,000 MQMs when you get to a total of $50,000 spending in a year.\nDelta MQMs earned in 2020 will roll over to 2021 to help you earn elite status for 2022.\nMeanwhile, the Delta SkyMiles Reserve Amex comes with even more benefits, such as complimentary access to Delta Sky Clubs as well as the exclusive American Express Centurion Lounges when you're flying on a Delta flight, access to complimentary upgrades for non-elites, and an annual companion certificate that can be used for first-class travel each year upon renewal of your card. It earns 3 miles for every dollar you spend on eligible Delta purchases, and 1 mile for every dollar you spend on everything else.\nWith the Delta Reserve Amex, you can also earn up to 60,000 bonus MQMs each calendar year — 15,000 MQMs for every $30,000 spent — and can waive Delta's MQD requirement for elite status up to the Platinum level by spending $25,000 in a calendar year, or the MQD requirement for Diamond status by spending at least $250,000.\nBundle the 60,000 MQMs with the 20,000 MQMs you get from the welcome bonus and the MQD requirement, and you can earn Delta Platinum elite status in your first year without ever setting foot on a plane.\nRelated: Dig into more details with our guide to the best credit cards for Delta flyers.\nDelta credit cards for business owners\nIf you own a business, you might want to consider getting one of the Delta business credit cards, which come with slightly different perks and bonuses than the personal cards. Here's a look at the welcome offers currently available on the three Delta business cards (terms apply):\nDelta SkyMiles® Gold Business American Express Card: Earn 40,000 bonus miles when you spend $2,000 in the first three months of account opening.\nDelta SkyMiles® Platinum Business American Express Card: Earn 45,000 bonus miles and 5,000 Medallion Qualification Miles (MQMs) when you spend $3,000 in the first three months, plus a $100 statement credit after you make a Delta purchase with your new card within your first three months of account opening.\nDelta SkyMiles® Reserve Business American Express Card: Earn 45,000 bonus miles and 10,000 Medallion Qualification Miles (MQMs) when you spend $4,000 in your first three months of account opening.\nSimilar to the personal version, the Delta Gold Business Amex comes with a free checked bag and priority boarding on Delta flights, a 20% discount on eligible in-flight purchases, access to Delta's Pay with Miles program, up to $100 in Delta flight credit after you spend $10,000 in eligible purchases on your card in a calendar year, and no foreign transaction fees.\nBut it earns miles a little differently. In addition to earning 2 miles for every dollar you spend on Delta and US restaurant purchases, you'll also earn 2 miles per dollar on US shipping purchases and US purchases for advertising in select media. Like the personal version, the business version waives its $99 annual fee for the first year.\nThe Delta Platinum Business Amex also has similar perks and benefits to its personal card counterpart, including the same 3 miles per dollar bonus categories, the same free checked bag and priority boarding, the same ability to earn bonus MQMs and the same $250 annual fee. But the business version also earns 1.5 miles per dollar on single eligible purchases of $5,000 or more, which is an extra half point per dollar, up to 50,000 additional miles per year.\nThe American Express Centurion Lounge in Miami.\nFinally, the Delta Reserve Business Amex matches the high-end travel perks of the personal Delta Reserve card, including complimentary access to Delta Sky Clubs and American Express Centurion Lounges when you're flying on a Delta flight, access to complimentary upgrades for non-elites, an annual companion certificate that can be used for first-class travel each year upon renewal of your card, the ability to earn bonus MQMs, 3 miles for every dollar you spend on eligible Delta purchases and a $550 annual fee.\nBut the business version of the card also has another feature: after you spend $150,000 on your card in a calendar year, you'll earn 1.5 miles per dollar on all your eligible purchases for the rest of the year, except eligible Delta purchases, which continue to earn 3 miles per dollar.\nRelated: Which Delta business credit card is right for you? Read our guide to the best credit cards for Delta flyers.\nHow do the Delta credit cards stack up to our benchmark card?\nAll seven Delta credit cards top CNN Underscored's benchmark credit card, the Citi® Double Cash Card, on several of our criteria. They offer welcome bonuses, bonus categories and travel benefits and don't charge foreign transaction fees. If you're a regular Delta flyer, you'll likely find value in at least one if not all of these areas.\nOn the flip side, aside from the Delta Blue Amex, all the Delta cards have annual fees either right off the bat or after the first year, which our benchmark card doesn't. And since Delta SkyMiles are worth 1.2 cents apiece, according to The Points Guy, unless you're really good at maximizing Delta SkyMiles, the Citi Double Cash card's 2% return — 1% when you make a purchase, and another 1% when you pay it off — beats the Delta cards when it comes to everyday spending. You can read more about our methodology and our benchmark credit card concept here.\nFor people who think they'll really utilize the Delta travel benefits on these cards once the airline is back to full service, or who regularly spend a lot of money in one or more of the bonus categories, the pros of these cards likely make the annual fees worth the cost. But if you don't find yourself on a Delta flight very often, even in the best of times, you might want to choose a card that aligns better with your needs. In that case, check out our guide to \"The best credit cards of 2020\" for other options.\nThese Delta credit cards are an investment in the future\nYou're probably not thinking much about travel right now, and getting an airline credit card at the moment is definitely an investment for the future. We've also seen higher welcome bonuses in the past on these Delta cards, so if you're looking to maximize the bonus, you may want to hold off on applying.\nBut if you're considering the idea of banking some frequent flyer miles in anticipation of travel resuming in the next few months, you might think about getting either a personal or business Delta credit card and collecting one or more of these welcome bonuses.\nFor Delta personal credit cards:\nLearn more about the Delta SkyMiles Blue Amex card.\nLearn more about the Delta SkyMiles Gold Amex card.\nLearn more about the Delta SkyMiles Platinum Amex card.\nLearn more about the Delta SkyMiles Reserve Amex card.\nFor Delta business credit cards:\nLearn more about the Delta SkyMiles Gold Business Amex card.\nLearn more about the Delta SkyMiles Platinum Business Amex card.\nLearn more about the Delta SkyMiles Reserve Business Amex card.\nFor more credit card info:\nCNN Underscored's guide to the best credit cards of 2020.\nCNN Underscored's guide to the best credit cards for Delta flyers.\nEditorial Disclaimer: Opinions expressed here are the author's alone, not those of any bank, credit card issuer, airlines or hotel chain, and have not been reviewed, approved or otherwise endorsed by any of these entities.\nNote: While the offers mentioned above are accurate at the time of publication, they're subject to change at any time and may have changed, or may no longer be available.", "url": "https://www.cnn.com/2020/01/30/cnn-underscored/delta-credit-card-bonus-offer/index.html"}