{"authors": ["William J. Kole"], "date_download": "2020-05-04 20:17:10", "date_modify": "2020-05-04 20:17:10", "date_publish": "2020-04-15 11:19:41", "description": "BOSTON (AP) — Seven years ago Wednesday, the unthinkable happened to Bobby O'Donnell: He was nearing the finish line of the 2013 Boston Marathon, where his family was gathered to cheer for him,...", "filename": "_a27b7efe6ce1be3f0d665db812f5061a_1588623430.html", "image_url": "https://storage.googleapis.com/afs-prod/media/41a9f54dabd04f3696bcbe8bd4dd9480/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a27b7efe6ce1be3f0d665db812f5061a_1588623430.html", "title": "Post-pandemic PTSD? Lessons from a marathon bombing survivor", "title_page": "Post-pandemic PTSD? Lessons from a marathon bombing survivor", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this April 14, 2020 photo, Bobby O'Donnell, a Boston Marathon bombing survivor and currently a paramedic, poses at his ambulance's base of operations in Meredith, N.H. O'Donnell has been transporting COVID-19 patients to hospitals in the state's Lakes region. (AP Photo/Charles Krupa)\nIn this April 14, 2020 photo, Bobby O'Donnell, a Boston Marathon bombing survivor and currently a paramedic, poses at his ambulance's base of operations in Meredith, N.H. O'Donnell has been transporting COVID-19 patients to hospitals in the state's Lakes region. (AP Photo/Charles Krupa)\nBOSTON (AP) — Seven years ago Wednesday, the unthinkable happened to Bobby O’Donnell: He was nearing the finish line of the 2013 Boston Marathon, where his family was gathered to cheer for him, when terrorist bombs killed three spectators and injured more than 260 others.\nHis family escaped unscathed. Not O’Donnell, whose wounds were invisible and scarred his soul.\n“My injury,” he says, “was in my head.”\nIt took years for O’Donnell to realize he was suffering from post-traumatic stress disorder. Now 26, he’s the author of “Running Wild,” a newly released memoir of completing marathons or ultramarathons on all seven continents — dodging penguins on Antarctica and bounding along the slopes of Mount Everest — in a quest for inner healing and to rediscover the joy of running.\nO’Donnell, a native of Easton, Massachusetts, and a graduate of Saint Anselm College in New Hampshire, was pursuing an advanced degree in Scotland when he and his girlfriend returned to the U.S. to ride out the coronavirus crisis. A part-time paramedic, he’s been transporting COVID-19 patients to hospitals in the state’s Lakes region.\nHe talked with The Associated Press about his own journey back to mental health, the importance of self-care, and the anxiety, depression and trauma some may be struggling with as the pandemic wears people down.\n___\nAP: So you’re handling COVID-19 patients as a medic now?\nO’Donnell: Occasionally, yes. It’s crazy not even going into someone’s house to assess them. Someone calls 911 and you’re doing it in doorways now from 6 feet away before you even go in the house.\n___\nAP: Yours is the story of someone who suffered PTSD and invisible wounds from the terror attack in 2013, and how you were able to overcome that. But now fast-forward to 2020, and it feels like a lot of people potentially could be suffering.\nO’Donnell: Telling people to stay inside and completely disrupting their daily lives ... mental health is going to be a huge ripple effect that comes out of this. Emergency rooms are going to struggle to deal with psychiatric issues, because we’re telling people to not go to the hospital. People who normally would go out to seek help are now afraid to go into this environment. It’s an important time to be checking up on your own mental health. Just because you think that someone’s gone through something worse than you have, it doesn’t devalue the trauma or distress that you’ve had.\n___\nAP: In your book, you take us on this extraordinary personal journey of trying to come to grips with what happened to you (at the marathon). What was more cathartic — the actual running or the writing of the book?\nO’Donnell: I spent about a year traveling outside the U.S., and a tiny fraction of that — about 44 hours total — was spent running. Much of this healing process for me was meeting people all over the world and creating lifelong friends — opening myself back up to the world. I went from being this 19-year-old kid who was terrified of the world to being able to find myself within it.\nFull Coverage: Life\n___\nAP: At one point in the book, you talk about how it dawned on you that maybe the bombing in a weird way was a blessing in your life.\nO’Donnell: I think people might be able to find this out of COVID. The Boston Marathon bombing undoubtedly was the worst day of my life. But if it didn’t happen, none of anything in the book would have occurred. I would have never traveled, never experienced the world the way I did. It took having this terrible thing happen to me to have all the wonderful things that followed occur. When I face tragedy or adversity, what I’ve come to realize is I need to decide where I want this to go from here.\n___\nAP: Any advice for people navigating all the stress and trauma around COVID?\nO’Donnell: Don’t be afraid to talk to people. One of the worst things we do with mental health is that there’s this huge stigma around it. We don’t talk about it. For me, what helped was getting out into the hills and mountains running — being outside and talking to people. Don’t be afraid to send someone a text and check in on other people.\n___\nFollow AP New England editor Bill Kole on Twitter at http://twitter.com/billkole", "url": "https://apnews.com/a27b7efe6ce1be3f0d665db812f5061a"}