{"authors": ["Alisha Ebrahimji"], "date_download": "2020-05-04 16:22:36", "date_modify": "2020-05-04 16:22:36", "date_publish": "2020-04-04 18:00:24", "description": "To stop the spread of coronavirus, many states are under stay-at-home orders and travel restrictions limit where you can go.", "filename": "2020_04_04_us_spreading-germs-nurse-trnd_index_1588609356.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404114448-germs-spread-gloves-molly-lixey-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_us_spreading-germs-nurse-trnd_index_1588609356.html", "title": "This nurse demonstrates just how fast germs spread even if you're wearing gloves", "title_page": "This nurse demonstrates just how fast germs spread even if you're wearing gloves - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) To stop the spread of coronavirus, many states are under stay-at-home orders and travel restrictions limit where you can go.\nBut that doesn't mean many well-meaning people may not wind up exposing themselves to germs unwittingly.\nOn a recent trip to the grocery store, Molly Lixey, a former emergency room nurse in Saginaw, Michigan, told CNN she noticed a lot of people wearing gloves, which she thought was great.\nBut what wasn't so great? All the cross-contamination she saw.\nIn an off-the-cuff Facebook video, Lixey decided to demonstrate just how quick and easy it is to spread germs at a grocery store.\n\"I was doing some painting around the house and it hit me that paint would be a perfect medium to use to explain this (cross contamination),\" she told CNN. \"It terrifies me to think people believe they're safe only because they are wearing gloves and not have them be aware that they could still be harming themselves or others,\" she said.\nWe know that coronavirus can spread through sneezes and coughs, and new research shows it can be passed from talking, or possibly even just breathing, which makes passing germs from object to object that much easier.\nIn her video, Lixey simulates going to the grocery store and she starts off by putting gloves on her hands, grabbing her cell phone as she leaves her car, cleaning a shopping cart and grabbing some toilet paper. She uses a piece of cardboard as her cell phone and dips her fingers in a plate of paint to symbolize the germs on her hands as a result of grabbing toilet paper.\n\"But it's (the germs) on my gloves, that's fine right? It's on my gloves,\" she said in the video. \"But now I'm walking along and my phone rings, so I've now touched my hands together a couple times, I reach for my phone and oh I have a text message from my husband.\"\nLixey continues to pretend she's walking through the grocery store and as she imitates picking up new items to put in her cart, she dips her fingers back into the paint to mimic the germs she's picking up throughout this process.\n\"I understand as a nurse I have had extensive training in the use of PPE, but many people in the general public have not,\" she said. \"They are all so fearful right now they will do anything to protect themselves, but it's important they do so properly. \"\nEventually, after picking up a simulated phone call, the paint winds up on her cheek, symbolizing the germs that would have traveled to her face. Even once she takes the gloves off, Lixey shows the paint had wound up on her makeshift phone, which she holds after taking the gloves off -- ultimately resulting in cross-contamination.\nHer general message? \"There's no point in wearing gloves, if you're not gonna wash your hands every time you touch something,\" she said in the video.\nThat's because whatever gets on the gloves would migrate to the phone if someone picked it up. Then unless the person disinfects the phone, the germs on it would travel to his or her hand once the gloves were off and the person touched the device.\nLixey currently works inside an infusion clinic at a doctor's office. She said if the virus continues to spread in her area more, she will go back to working in a hospital setting.\nShe isn't the only one taking to social media to educate on the importance of understanding how germs spread.\nHays Earls, a registered nurse in Dallas, Texas, made a TikTok video of an experiment she did to show her three-year-old son how germs stick to our hands and how washing them with soap removes them.\nIn the video, Earls' son dips his finger into a bowl of water with pepper sprinkled on the top. When he takes his finger out, it's covered in pepper, simulating how germs cling to skin. She then pumps some soap on a clean finger and as he dips that into the bowl, the pepper spreads away from his finger.\nEarls said she's happy to pass the experiment onto other parents and that the visual lesson worked with her son. In fact, now her son wants to do the 'washing hands trick' every time they pass a sink.", "url": "https://www.cnn.com/2020/04/04/us/spreading-germs-nurse-trnd/index.html"}