{"authors": [], "date_download": "2020-05-04 20:21:32", "date_modify": "2020-05-04 20:21:32", "date_publish": "2020-04-07 16:18:21", "description": "LOS ANGELES (AP) — More snow and rain fell on parts of California on Tuesday as spring delivered a taste of the kind of weather that winter forgot. The late-season cold weather system...", "filename": "_6639306f5a7935088243bb6eb3e04500_1588623692.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6639306f5a7935088243bb6eb3e04500_1588623692.html", "title": "California's winter-like spring brings more snow and rain", "title_page": "California's winter-like spring brings more snow and rain ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOS ANGELES (AP) — More snow and rain fell on parts of California on Tuesday as spring delivered a taste of the kind of weather that winter forgot.\nThe late-season cold weather system arrived in California during the weekend and continued to spin moisture into state as it moved southward, leaving peaks coated in white and setting rainfall records despite lengthy breaks between bouts of precipitation.\nWinter weather advisories were expected to be replaced with storm warnings Tuesday afternoon in the southern Sierra Nevada, the mountains of Kern County and in ranges stretching across Southern California. Chain controls were in effect for some mountain highways.\nResort webcams showed slopes buried in new snow , but all were off limits to boarders and skiers due to coronavirus closures.\nFlash flood watches were posted for a swath of Southern California extending from Orange and San Diego counties eastward and northward across the deserts to the Arizona and Nevada state lines.\nDowntown Los Angeles received 1.1 inches (27.9 millimeters) of rain Monday, toppling the April 6 record of 0.85 inch (21.5 millimeters) set in 1958. Lytle Creek, in the San Gabriel Mountains 45 miles (72 kilometers) east of Los Angeles, neared 6 inches (152 millimeters) of rain since Sunday.", "url": "https://apnews.com/6639306f5a7935088243bb6eb3e04500"}