{"authors": ["Por Ronald Blum"], "date_download": "2020-05-04 20:24:40", "date_modify": "2020-05-04 20:24:40", "date_publish": "2020-04-20 21:51:45", "description": "NUEVA YORK (AP) — El comisionado del béisbol Rob Manfred aplicó el lunes una medida que les permite a los equipos despedir o reducir sueldos de managers, coaches, personal médico y scouts a tiempo...", "filename": "_08a0ff1ca7ce4970b235322e1ff36295_1588623880.html", "image_url": "https://storage.googleapis.com/afs-prod/media/7b60fb5009df4464927ab26963ead23c/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_08a0ff1ca7ce4970b235322e1ff36295_1588623880.html", "title": "Equipos pueden reducir sueldos a managers desde el 1 de mayo", "title_page": "Equipos pueden reducir sueldos a managers desde el 1 de mayo", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nNUEVA YORK (AP) — El comisionado del béisbol Rob Manfred aplicó el lunes una medida que les permite a los equipos despedir o reducir sueldos de managers, coaches, personal médico y scouts a tiempo completo de Grandes Ligas y Ligas Menores a partir del 1 de mayo.\nManfred suspendió los contratos uniformes de empleados (UEC por sus iniciales en inglés) que incluyen a cerca de 9.000 personas, entre ellas a gerentes generales de algunos equipos. Manfred citó la imposibilidad de realizar partidos debido a la emergencia nacional por la pandemia del nuevo coronavirus.\n“Nuestros equipos tienen una enorme dependencia de los ingresos provenientes de las entradas y concesiones, transmisión, licencias y patrocinios para pagar los salarios”, escribió Manfred en un email, al cual The Associated Press tuvo acceso. “Ante la ausencia de juegos, estos ingresos se perderán o se reducirán de forma significativa, y los equipos no tienen fondos suficientes para cumplir con sus obligaciones financieras”.\n“El impacto de la suspensión de los UEC en la situación laboral de su personal será determinada por su club”, indicó Manfred.\nLa intención de Manfred de suspender los contratos fue reportada en primera instancia por The Athletic.\nArizona, Atlanta, Boston, Medias Blancas, Cincinnati, Minnesota Yanquis, Filadelfia, San Diego, San Francisco y Toronto son algunos de los equipos que se han comprometido a pagarles a sus empleados de tiempo completo durante todo mayo, mientras que Miami prometió pagarle a todo su personal de operaciones deportivas durante todo el mes. Los Cachorros de Chicago pagarán a todos aquellos bajo UEC y al personal de la gerencia hasta el 29 de mayo.\nLa regla 3 (i) de Grandes Ligas requiere que los UEC sean firmados por todos los managers, coaches, personal médico y scouts en nómina, y algunos conjuntos incluyen a personal de operaciones de forma adicional.\n“En virtud de los términos de los UEC, el derecho exclusivo del club por sus servicios permanecerá en vigor durante el periodo de la suspensión, por lo que no se le permitirá brindar sus servicios a ningún otro club”, escribió Manfred. “Reconozco plenamente las adversidades que ha creado esta crisis de salud en todos los miembros de la comunidad del béisbol. Nuestra oficina y los clubes están haciendo todo lo posible por intentar minimizar este impacto para la mayor cantidad de empleados posible”.\nManfred dijo que la organización caritativa Baseball Assistance Team “está disponible para sopesar solicitudes de subvenciones de forma expedita para aquellos que enfrentan adversidades financieras significativas e inmediatas”.", "url": "https://apnews.com/08a0ff1ca7ce4970b235322e1ff36295"}