{"authors": [], "date_download": "2020-05-04 20:22:57", "date_modify": "2020-05-04 20:22:57", "date_publish": "2020-04-14 22:54:58", "description": "PORTLAND, Ore. (AP) — All non-union Portland city employees must take 10 days of unpaid leave by October and Mayor Ted Wheeler will go without a salary for the rest of the year because of revenue...", "filename": "_efc0a8f21a728ed7da6bb939b0643771_1588623777.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_efc0a8f21a728ed7da6bb939b0643771_1588623777.html", "title": "Portland to furlough employees, cut mayor pay amid pandemic", "title_page": "Portland to furlough employees, cut mayor pay amid pandemic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Ore. (AP) — All non-union Portland city employees must take 10 days of unpaid leave by October and Mayor Ted Wheeler will go without a salary for the rest of the year because of revenue loss related to the coronavirus pandemic, officials said Tuesday.\nChief Administrative Officer Tom Rinehart said in an email to employees that the moves, which also include a temporary freeze on raises, are being made as the city anticipates more than $100 million in lost revenue. He said the city cannot wait to reduce costs and prepare.\nThe furloughs and pay freezes for non-represented staff, around 1,700 workers, are expected to save more than $19 million, The Oregonian/OregonLive reported .\nThey include workers in the city’s development services, management and finance, human resources and water bureaus.\n“During times of crisis like this one, we have to face our challenges honestly and directly by making necessary sacrifices for the greater good of all Portlanders,” Rinehart wrote. “We are making these difficult decisions now to keep dedicated public servants employed, providing core services our residents depend on every day.”\nRinehart also said the city is negotiating with the unions that represent other city employees regarding pay freezes and furloughs for them.\nPortland’s government employs around 7,800 people and has already cut 950 jobs, most of them seasonal parks positions, amid the financial fallout of COVID-19.\nWheeler’s salary was $143,665 in 2019, city records show.\nPortland officials anticipate receiving around $100 million in federal aid and are considering borrowing another $100 million to fill funding gaps.", "url": "https://apnews.com/efc0a8f21a728ed7da6bb939b0643771"}