{"authors": ["Colleen Long", "Gene Johnson", "Mike Corder"], "date_download": "2020-05-04 20:23:32", "date_modify": "2020-05-04 20:23:32", "date_publish": "2020-04-20 07:17:09", "description": "SEATTLE (AP) — Boeing and at least one other U.S. heavy-equipment manufacturer resumed production and some states rolled out aggressive reopening plans Monday, despite nationwide concerns there is...", "filename": "_34b48ffba057099eaee794342bce448e_1588623812.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e6131388085f4594a6fa40c783858ff5/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_34b48ffba057099eaee794342bce448e_1588623812.html", "title": "Some US producers, states reopening amid political pressure", "title_page": "Some US producers, states reopening amid political pressure", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Following social distancing rules and wearing face coverings, visitors hike through Enchanted Rock State Park, Monday, April 20, 2020, in Fredericksburg, Texas. Texas state parks are reopened to the public Monday after they had been closed due to the COVID-19 pandemic, but visitors must follow social distancing rules and wear a facial covering or mask. (AP Photo/Eric Gay)\nFollowing social distancing rules and wearing face coverings, visitors hike through Enchanted Rock State Park, Monday, April 20, 2020, in Fredericksburg, Texas. Texas state parks are reopened to the public Monday after they had been closed due to the COVID-19 pandemic, but visitors must follow social distancing rules and wear a facial covering or mask. (AP Photo/Eric Gay)\nSEATTLE (AP) — Boeing and at least one other U.S. heavy-equipment manufacturer resumed production and some states rolled out aggressive reopening plans Monday, despite nationwide concerns there is not enough testing yet to keep the coronavirus from rebounding.\nIn one of the most forceful moves yet, Georgia Gov. Brian Kemp announced plans to restart the state’s economy before the end of the week. Kemp said gyms, hair salons, bowling alleys and tattoo parlors could reopen Friday, as long as owners followed strict social distancing and hygiene requirements.\nBoeing said it was putting about 27,000 people back to work this week building passenger jets at its Seattle-area plants, with virus-slowing precautions in place, including face masks and staggered shifts. Doosan Bobcat, a farm equipment maker and North Dakota’s largest manufacturer, announced the return of about 2,200 workers at three factories around the state.\nThe reopenings came amid economic gloom, as oil futures plunged below zero on Monday and stocks and Treasury yields also dropped on Wall Street. The cost to have a barrel of U.S. crude delivered in May plummeted to negative $37.63. It was at roughly $60 at the start of the year.\nElsewhere around the world, step-by-step reopenings were underway in Europe, where the crisis has begun to ebb in places such as Italy, Spain and Germany. Parts of the continent are perhaps weeks ahead of the U.S. on the infection curve of the virus, which has killed more than 170,300 people worldwide, according to a tally kept by Johns Hopkins University.\nBusinesses that start operating again in the U.S. are likely to engender good will with the Trump administration at a time when it is doling out billions in relief to companies. But the reopenings being announced are a drop in the bucket compared with the more than 22 million Americans thrown out of work by the crisis.\nIn a dispute that has turned nakedly political, President Donald Trump has been agitating to restart the economy, singling out Democratic-led states and egging on protesters who feel governors are moving too slowly.\nIn several states — most of them Republican-led — governors said they had seen signs that the coronavirus curve was flattening, making it possible to start reopening businesses and public spaces.\nKemp, a Republican, said a decline in emergency room visits by people with flu-like symptoms indicated that infections were going down. But he also acknowledged that Georgia had lagged in COVID-19 testing and announced new initiatives to ramp it up.\nTexas on Monday began a week of slow reopenings, starting off with state parks, while officials said that later in the week, stores would be allowed to offer curbside service. Tennessee Gov. Bill Lee announced Monday that businesses across most of the state would begin reopening as early as next week, although the order did not cover counties with the largest cities, including Nashville, Memphis, Knoxville and Chattanooga. Both states are led by Republicans.\nRepublican West Virginia Gov. Jim Justice said Monday that he would allow hospitals to begin performing elective procedures if the facilities met an unspecified set of criteria, while Democratic Colorado Gov. Jared Polis said Monday that he would let his statewide stay-at-home order expire next week as long as strict social distancing and other individual protective measures continued.\nBut governors from many other states said they lacked the testing supplies they need and warned they could get hit by a second wave of infections, given how people with no symptoms can still spread the disease.\n“Who in this great state actually believes that they care more about jet skiing than saving the lives of the elderly or the vulnerable?” Democratic Michigan Gov. Gretchen Whitmer remarked, referring to restrictions in place in her state. “This action isn’t about our individual right to gather. It’s about our parents’ right to live.”\nTrump took to Twitter to complain that the “radical left” and “Do Nothing Democrats” are “playing a very dangerous political game” by complaining about a testing shortage. At the same time, Vice President Mike Pence told governors that Washington is working around-the-clock to help them ramp up testing.\nThe death toll in the U.S. stood at 42,300 — the highest in the world — with nearly 787,000 confirmed infections, by Johns Hopkins’ count. The true figures are believed to be much higher, in part because of limited testing and difficulties in counting the dead.\nIn other developments:\n— Republican Maryland Gov. Larry Hogan announced his state will be able to test 500,000 more people for COVID-19 thanks to a shipment of tests from South Korea. His wife, Yumi Hogan, who is Korean-American, negotiated the shipment with Korean officials. Trump said at an afternoon briefing that governors like Hogan and Democratic Gov. J.B. Pritzker of Illinois don’t understand they already have the testing capacity they need to begin the first phase of reopening their states.\n— Massachusetts has emerged as an alarming hot spot of contagion, with over 1,800 dead and officials hoping to bend the curve through aggressive contract tracing.\n— New York, with the worst outbreak in the nation, reported that hospitalizations in the state have leveled off and the day’s death toll, at 478, was the lowest in three weeks, down from a peak of nearly 800. Still, the city canceled three of its biggest June events: the Puerto Rican Day parade, the Israel parade and the gay pride march.\n— A meatpacking plant in Minnesota was shut down after an outbreak there. But Iowa Gov. Kim Reynolds refused to order the closing of any slaughterhouses in her state that are seeing alarming increases in COVID-19, saying: “Without them, people’s lives and our food supply will be impacted.”\nMobilized by the far right, many Americans have taken to the streets in places such as Michigan, Ohio and Virginia, complaining that the shutdowns are destroying their livelihoods and trampling their rights.\nBut Dr. Anthony Fauci, the government’s top infectious-disease expert, warned on ABC: “Unless we get the virus under control, the real recovery economically is not going to happen.”\nBoeing’s shutdown went into effect March 25 after workers tested positive for the virus and an inspector for the company died. Washington was the first state to see a spike in COVID-19 cases and enacted strict shutdown orders that helped tamp the virus down.\nThe crisis has exacerbated problems at Boeing, which is in dire financial trouble and under federal investigation over two crashes of its 737 MAX jetliner that killed 346 people.\nUnion representatives spent the day walking through factories to see what safeguards had been put in place.\nAt Doosan Bobcat, spokeswoman Stacey Breuer said the reopening came after two weeks spent putting in safety measures.\n“There is definitely still some concern and do we feel 100% safe? Obviously not,” said William Wilkinson, a Bobcat welder and president of a United Steelworkers union local. He said workers there were wearing face masks and keeping their distance from one another.\nEven with the outbreak easing in places, the head of the World Health Organization, Tedros Adhanom Ghebreyesus, cautioned, “The worst is yet ahead of us.” He did not specify why he believed so. But there were signs the virus was swelling in Africa, where the health care system is in poor condition.\n___\nLong reported from Washington. Corder reported from The Hague, Netherlands. AP writers worldwide contributed to this report.\n___\nFollow AP coverage of the pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/34b48ffba057099eaee794342bce448e"}