{"authors": ["Opinion Joseph V. Sakran", "Chethan Sathya"], "date_download": "2020-05-04 16:34:44", "date_modify": "2020-05-04 16:34:44", "date_publish": "2020-04-08 10:05:52", "description": "The Covid-19 pandemic is stifling the voices of patients' most effective advocates, say Drs. Joseph Sakran and Chethan Sathya: their family members. When strategizing how to fight this and future pandemics, they say it will be critical to address the need for infrastructure that can allow family members to interact with patients in isolation.", "filename": "2020_04_08_opinions_covid-1_f1f7dec47b623da9e97da1df1db44f87_index_1588610084.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407111556-spain-coronavirus-0406-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_opinions_covid-1_f1f7dec47b623da9e97da1df1db44f87_index_1588610084.html", "title": "Covid-19 is removing crucial voices from patients' bedsides", "title_page": "Covid-19 is removing crucial voices from patients' bedsides (opinion)  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Dr. Joseph V. Sakran ( @JosephSakran ) is director of emergency general surgery and a trauma surgeon at Johns Hopkins Hospital. Dr. Chethan Sathya ( @drchethansathya ) is a pediatric surgeon and journalist in New York City. The views expressed here belong to the authors. Read more opinion on CNN.\n(CNN) When you are sick in the hospital, no one advocates or cares for you more than your own family. And research suggests that having families at the bedside actually improves outcomes for patients . For us health care workers, families are key players in our ability to make medical decisions. Yes, we use medical expertise and data to provide excellent medical care, but guidance from families is critical in helping us to make the right decisions for each patient.\nDuring this Covid-19 pandemic, strict isolation measures are limiting in-person communication. And many patients have suddenly lost their most important advocates and caregivers as a result -- leaving families feeling more helpless than ever and critically ill patients without someone to speak for them. This is uncharted territory for us all and will undoubtedly have a lasting effect on patients and health care workers alike for decades.\nMany Americans are experiencing what it's like to suffer from illness or die alone -- and families are not there to advocate or comfort them in their greatest moment of need. In some instances, families can't even say goodbye\nAnd that love between a patient and their families knows no boundaries. We see it every day among the patients we care for. Whether it's a mother lying down by the side of her child or a spouse anxiously waiting in the post-operative holding area -- family caregivers are inimitable. They ask the questions that patients themselves may not know to ask; they may also be physically unable, or at times simply too nervous to do so. And typically those questions lead to a discussion that reaffirms the health care team's plan for the day and to more clarity for everyone. Those voices at the bedside are invaluable, whether discussing a minor change in medication or having to navigate the complexity of end-of-life care.\nWe have both seen how the Covid-19 pandemic is stifling those voices.\nWho will be there for your child, your sibling or your parent? That \"safety net\" of having a loved one by your side is now riddled with holes. Health care workers continue to work heroically to try to provide solutions in an attempt to plug up all the holes.\nOne day -- very soon, we hope -- when this is all behind us and the health care community and policymakers can frankly assess our Covid-19 response, in order to prepare for future pandemics, it will be critical that we address the need for infrastructure that would allow family members to interact with patients in isolation. Whether this means connecting families through personal tablets for a video chat or putting in hospital-based systems to allow for video streaming, as some are doing now, more hospital systems must build these more systemically into their palliative plans and provide funding to make them happen.\nAnd as the health care workforce continues to dwindle and fatigue throughout this rapidly evolving pandemic, one cannot help but go back to the question -- what if?\nJUST WATCHED Doctors document life on front lines of Covid-19 pandemic Replay More Videos ... MUST WATCH Doctors document life on front lines of Covid-19 pandemic 03:03\nWhat if you have a situation similar to that of one young woman who told us about her father. He was admitted to a hospital in Arkansas a few days ago with a brain bleed. Her father is Spanish speaking only and no one was allowed to be with him during the entire stay, she said. She also said that her father's hospital team tried to use translation services over FaceTime, since the translation tablet at the hospital was broken, but this was limited and frustrating.\n\"He struggled being alone and not understanding what was happening. His mental state suffered as a result,\" the woman explained. And for families, this can be extremely anxiety-provoking. Her father was given a facemask to wear because of Covid-19 precautions, but due to language barriers, he didn't use it and wasn't asked to comply. The situation became so unpredictable that his daughter and the rest of his family advocated for her father's discharge as quickly as possible, as they did not feel that he was safe at the hospital alone.\nAnother woman we spoke to is married to a man who was recently diagnosed with stage-four cancer; he was admitted to Geisinger Medical Center in Pennsylvania after requiring emergency general surgery for a bowel blockage caused by his disease. After nearly a week at her husband's bedside, she was no longer able to be with her him in the hospital due to Covid-19-related restrictions. And despite the health care workers trying their best to keep her well informed, nothing could replace being with her husband, she said. \"The entire health care team has been amazing. They call me as much as possible. But it's incredibly hard not to be there by my husband's side. I am a forceful advocate for my husband,\" she told us.\nHer husband's ability to understand what is happening from day to day fluctuates, so having his wife by his bedside helped tremendously early on in the hospital stay. But as the days without face-to-face contact went by, her husband's condition deteriorated.\nAnd for her, she notices advancement in her husband's ability to recover when she is with him. \"Today, the doctor was able to use FaceTime to let me speak to my husband. It was great, it made me feel good to see him and for him to see me, so that he knows I am not far away. It's remarkable the difference that it makes when he sees me. Everyone at the hospital says he is more coherent, responsive, and is able to get out of bed when I am with him,\" she remarked. But FaceTime and other video options only offer a few minutes of interaction -- which at the end of the day -- comes nowhere close to sustained time at the bedside.\nAs hospitals and health care workers become more overwhelmed with sick patients -- communication will inevitably become harder. It's not only the communication that happens during the daytime while clinicians are more readily visible that will suffer, but also the communication during the evening and night, as staff, understandably, thins out.\nFor those of us who understand what it's like to be hospitalized, we can attest to the favorable impact, both physical and psychological, of having a loved one by your bedside. Perhaps more telling, are those who have not been as fortunate, those individuals who have had to struggle through a hospital admission alone.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nIt can be terrifying and lonely, and now hundreds and thousands of patients and health care workers navigate through those feelings, on top of the uncertainty of a new illness that has yet to completely unfold. Let's not forget about those patients who may not be able to speak effectively or forcefully for themselves, and the innovative solutions that can transcend this challenge we face.", "url": "https://www.cnn.com/2020/04/08/opinions/covid-19-removing-patients-best-advocates-sakran-sathya/index.html"}