{"authors": ["Por Michael Weissenstein"], "date_download": "2020-05-04 20:18:01", "date_modify": "2020-05-04 20:18:01", "date_publish": "2020-04-04 14:28:17", "description": "LA HABANA (AP) — Un cargamento de asistencia para enfrentar el coronavirus, enviado a Cuba por el hombre más rico de Asia, Jack Ma, ha resultado bloqueado por el embargo que Estados Unidos impuso...", "filename": "_0189c29736c741d4a614cce5dc507b5b_1588623481.html", "image_url": "https://storage.googleapis.com/afs-prod/media/23f2bef6fef2426796122394a3efe528/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0189c29736c741d4a614cce5dc507b5b_1588623481.html", "title": "Embargo de EEUU bloquea ayuda enviada a Cuba por COVID-19", "title_page": "Embargo de EEUU bloquea ayuda enviada a Cuba por COVID-19", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\n1 of 2\n1 of 2\n1 of 2\n1 of 2\nLA HABANA (AP) — Un cargamento de asistencia para enfrentar el coronavirus, enviado a Cuba por el hombre más rico de Asia, Jack Ma, ha resultado bloqueado por el embargo que Estados Unidos impuso a la isla desde hace seis décadas, dijeron funcionarios cubanos.\nEl embajador de Cuba en China, Carlos M. Pereira, dijo en su blog esta semana que la fundación de Ma intentó enviar el mes pasado a Cuba 100.00 mascarillas y 10 equipos para diagnosticar COVID-19, así como otros materiales, como respiradores artificiales y guantes.\nCuba era uno de 24 países de la región que recibirían las donaciones anunciadas el 21 de marzo por la Fundación Jack Ma, que también envió asistencia similar a otros países, incluso a Estados Unidos.\nLos funcionarios cubanos aseguran que la división de transporte de carga de Avianca Airlines, con sede en Colombia, declinó trasladar la asistencia a Cuba porque la principal accionista de la aerolínea es una compañía con sede en Estados Unidos y está obligada a acatar el embargo comercial contra Cuba. El embargo tiene dispensas cuando se trata de asistencia alimentaria y médica, pero las compañías a menudo temen implicarse en operaciones de financiamiento o transporte debido al peligro de que les impongan multas o enfrenten juicios por el embargo.\nDiversos grupos de derechos humanos han exhortado a Estados Unidos a que levante las sanciones contra Venezuela, Cuba e Irán durante la pandemia de coronavirus a fin de permitir un mayor flujo de asistencia. El gobierno del presidente Donald Trump dice que los gobiernos de esos países serían los únicos que saldrían ganando con una disminución de las sanciones.\nUna portavoz de Avianca remitió una pregunta de The Associated Press a una portavoz de la compañía de Ma, Alibaba, que no ha respondido un correo electrónico en el que se solicitaba que hiciera declaraciones.\nCuba ha cerrado sus puertos aéreos y marítimos salvo para carga esencial y vuelos de gobierno a fin de prevenir nuevos casos importados de coronavirus en la isla. Hasta el viernes en la mañana, Cuba tenía 269 casos confirmados, 3.241 personas en cuarentena, 15 pacientes recuperados y seis fallecidos.\nUna localidad del oeste de Cuba fue aislada completamente para impedir la propagación de la enfermedad.\nCuba tiene un sistema de salud universal gratuita y una alta tasa de personal médico, 95.000 para una población de 11 millones, pero labora sin mucho del equipo que suele estar disponible en países desarrollados.\nEl bloqueo de la asistencia debería ser “una acción inconcebible en un momento de crisis global”, pero “no nos sorprende”, dijo Carlos Fernando de Cossío, director general para Estados Unidos del Ministerio de Relaciones Exteriores de Cuba. “Es el tipo de obstáculos que Cuba confronta de manera cotidiana para asegurar las necesidades básicas del país”.", "url": "https://apnews.com/0189c29736c741d4a614cce5dc507b5b"}