{"authors": ["Amy Beth Hanson"], "date_download": "2020-05-04 20:23:42", "date_modify": "2020-05-04 20:23:42", "date_publish": "2020-04-14 21:17:13", "description": "HELENA, Mont. (AP) — State agencies and courts are taking adequate precautions to protect inmates from exposure to the coronavirus, the Montana Supreme Court said Tuesday in rejecting a petition...", "filename": "_826af8b49c048b8b5b143bac8744c3eb_1588623822.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_826af8b49c048b8b5b143bac8744c3eb_1588623822.html", "title": "Justices reject move for release of more Montana inmates", "title_page": "Justices reject move for  release of more Montana inmates ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HELENA, Mont. (AP) — State agencies and courts are taking adequate precautions to protect inmates from exposure to the coronavirus, the Montana Supreme Court said Tuesday in rejecting a petition by Disability Rights Montana seeking the appointment of a special master to reduce the number of people incarcerated.\nThe justices said there was no evidence that the Department of Corrections, courts or jail officials have violated any clear legal duty to reduce inmate populations.\nAuthorities have implemented appropriate measures for prisons and jails to help prevent the spread of the coronavirus, including those issued by Chief Justice Mike McGrath, the unanimous opinion states.\nOn March 20, McGrath asked county and city court judges to “review your jail rosters and release, without bond, as many prisoners as you are able, especially those being held for non-violent offenses” and to hear such motions on an expedited basis.\nHours after Disability Rights Montana filed its petition on April 1, Gov. Steve Bullock issued a directive that suspended new transfers into Department of Corrections custody, called for screening anyone who arrives at a facility and restricts in-person visitation. If the department director does approve a transfer, he said, the inmate must be quarantined for 14 days at the new facility.\nBullock also directed the Board of Pardons and Parole to consider early release for inmates who are 65 or older, have medical conditions that put them at higher risk, are pregnant or are nearing their release dates — if they are not a public safety risk. Many of those steps were already in place.\nHowever, “the state’s efforts so far are insufficient to prevent illnesses, and likely death, among incarcerated people and those who work in Montana’s correctional facilities,” said Caitlin Borgmann, executive director of the ACLU of Montana. “The governor’s executive order lacked a sense of urgency even as we face a crisis.”\nThe petition argued McGrath’s directions were not being enacted uniformly across the state, but justices said the petition provided no evidence of deliberate indifference. The court said individuals who are detained or incarcerated can move individually for bond reductions.\n“More than one-third of people in Montana’s prisons and jails have at least one disability,” said Bernadette Franks-Ongoy, executive director of Disability Rights Montana. “Some jurisdictions are taking proactive steps to reduce their incarcerated populations, among other actions. But not everyone is taking the necessary steps to address this pandemic”\nJustices said they believe the governor’s directives and his reliance on guidance from the Centers of Disease Control best addresses the crisis.", "url": "https://apnews.com/826af8b49c048b8b5b143bac8744c3eb"}