{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:22:14", "date_modify": "2020-05-04 20:22:14", "date_publish": "2020-04-20 17:58:59", "description": "Some of the findings from the Seton Hall Sports Poll in which 762 U.S. adults reached by phone April 6-8 were asked their thoughts during the coronavirus pandemic that has shut down the nation’s...", "filename": "_5f40268c1e0cdd630f5f52b3afe848bd_1588623734.html", "image_url": "https://storage.googleapis.com/afs-prod/media/97d9926cdf1a46fcbe85c4418a57d524/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5f40268c1e0cdd630f5f52b3afe848bd_1588623734.html", "title": "Fans won't feel safe at games without virus vaccine", "title_page": "Poll: Fans won't feel safe at games without virus vaccine", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this June 12, 2019, file photo, St. Louis Blues fans cheer as they watch television coverage of Game 7 of the team's NHL hockey Stanley Cup Final against the Boston Bruins, from seats at Enterprise Center nin St. Louis. With the distinct possibility of pro sports resuming in empty venues, a recent poll suggests a majority of U.S. fans wouldn't feel safe attending games anyway without a coronavirus vaccine. (AP Photo/Scott Kane, File)\nFILE - In this June 12, 2019, file photo, St. Louis Blues fans cheer as they watch television coverage of Game 7 of the team's NHL hockey Stanley Cup Final against the Boston Bruins, from seats at Enterprise Center nin St. Louis. With the distinct possibility of pro sports resuming in empty venues, a recent poll suggests a majority of U.S. fans wouldn't feel safe attending games anyway without a coronavirus vaccine. (AP Photo/Scott Kane, File)\nSome of the findings from the Seton Hall Sports Poll in which 762 U.S. adults reached by phone April 6-8 were asked their thoughts during the coronavirus pandemic that has shut down the nation’s sports calendar. Of the respondents, 54% said they followed sports closely or very closely, while 46% said they didn’t follow sports closely or didn’t follow sports at all. The poll has a margin of error of plus or minus 3.6 percentage points.\nGOING TO GAMES?\n— 72% of those responding said they wouldn’t feel safe attending games without a COVID-19 vaccine. That number dropped to 61% among those who identified themselves as sports fans. Overall, 12% said they would feel safe with social distancing while 13% said they would feel safe attending games like they had in the past.\nRESPONDING TO THE VIRUS\n— 76% felt professional sports leagues in the United States acted at the right time to suspend their seasons, while 16% thought the leagues didn’t react quickly enough. Only 6% said the decisions were made too quickly.\n— Asked if the International Olympic Committee acted too quickly rescheduling the 2020 Tokyo Olympics to 2021, 84% of respondent said no.\nNFL SEASON\n— 70% said the NFL shouldn’t start in the fall to ensure the safety of players, even if some form of social distancing is still in place. And 20% said the season should start with players being allowed to choose not to play, while 6% said the league should start as planned.\nPLAYING AT ALL?\n— 40% said sports shouldn’t be played for the remainder of 2020. For those who said sports should be played, 12% said it should happen with fans present, 23% with restricted attendance and 21% with no fans present.\nWATCHING LIVE GAMES\n— 76% said they would have the same interest watching a broadcast of live sports played without fans; 16% would be less interested and 7% would be more interested.", "url": "https://apnews.com/5f40268c1e0cdd630f5f52b3afe848bd"}