{"authors": [], "date_download": "2020-05-04 16:53:15", "date_modify": "2020-05-04 16:53:15", "date_publish": "2020-04-08 16:27:21", "description": "In addition to donating soap and sensor pumps to vital caregiver organizations in light of the pandemic, Simplehuman is marking down select touch-free sensor tools and soap, now through April 10.", "filename": "2020_04_08_cnn-underscored_simplehuman-sale-touch-free_index_1588611195.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408122405-simplehuman-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_cnn-underscored_simplehuman-sale-touch-free_index_1588611195.html", "title": "Simplehuman sale: Take 25% off touch-free sensors, soaps and trash cans", "title_page": "Simplehuman sale: Take 25% off touch-free sensors, soaps and trash cans - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "As covid-19 continues to spread, keeping your home — and your hands — clean is more important than ever, so Simplehuman, the maker of some of the smartest, sleekest tools for your home, is doing its part to help. In addition to donating soap and sensor pumps to vital caregiver organizations in light of the pandemic, select touch-free sensor tools and soaps are 25% off, now through April 10.\nSensor soap pumps\nSimplehuman sensor soap pumps\nAmong the discounted items are 12 sensor soap pumps. It's the most sanitary way to wash your hands and stop the spread of germs, since these pumps are touch-free. Some pumps are battery operated (battery life is one year), while others are rechargeable, and you can choose between regular liquid soap dispensers or pumps made specifically for foaming soaps in a variety of colors and finishes.\nSensor Pump ($37.50, originally $50; simplehuman.com )\nSensor Pump with Caddy ($45, originally $60; simplehuman.com )\nRechargeable Sensor Pump ($45, originally $60; simplehuman.com )\nFoam Sensor Pump ($60, originally $80; simplehuman.com)\nSoap\nSimplehuman soap\nSeveral soap cartridges made specifically for these pumps are also on sale, though of course, any liquid or foam soap you have on hand will work, depending on the pump you choose. A few designer fragrances are also available at a discount.\nSimplehuman Moisturizing Liquid Hand Soap Refill, 3 pouches ($16.40, originally $21.90; simplehuman.com )\nSimplehuman Foam Soap Cartridge ($5.25, originally $7; simplehuman.com )\nNest Fragrances Foam Soap Cartridge ($18, originally $24; simplehuman.com )\nAntica Farmacista Foam Soap Cartridge ($16.50, originally $22; simplehuman.com )\nDeep Steep Foam Soap Cartridge ($6.75, originally $9; simplehuman.com )\nRefillable Foam Soap Cartridge ($6, originally $8; simplehuman.com)\nSensor trash cans\nSimplehuman sensor trash cans\nFinally, dispose of items without having to touch anything, since several sensor trash cans in a variety of finishes and sizes are on sale. Currently starting at just $75, these cans typically sell for between $150 and $250, and they rarely go on sale. Ultra quiet models with adaptive motion sensors are on sale, along with cans that have both a motion sensor and voice control capabilities, so you can lift the lid simply by saying, \"Open can.\" Plus, the cans' fingerprint-proof coating is infused with nano-silver particles to inhibit the reproduction of microbes on the stainless steel surface, so everything is as sanitary as possible.\nSemi-Round Sensor Can with Plastic Lid, 45 liter ($75, originally $100; simplehuman.com )\nSemi-Round Sensor Can, 45 liter ($112.50, originally $150; simplehuman.com )\nVoice Control Rectangular Sensor Can, 58 liter ($150, originally $200; simplehuman.com )\nVoice Control Black Stainless Steel Rectangular Sensor Can, 58 liter ($157.50, originally $210; simplehuman.com )\nVoice Control Dual Compartment Sensor Can, 58 liter ($187.50, originally $250; simplehuman.com )\nVoice Control Black Stainless Steel Dual Compartment Sensor Can, 58 liter ($195, originally $260; simplehuman.com)\nFor more great deals, check out CNN Coupons.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/08/cnn-underscored/simplehuman-sale-touch-free/index.html"}