{"authors": ["Russell Contreras"], "date_download": "2020-05-04 20:16:01", "date_modify": "2020-05-04 20:16:01", "date_publish": "2020-04-16 18:04:48", "description": "RIO RANCHO, N.M. (AP) — Democratic U.S. Rep. Xochitl Torres Small is maintaining a huge fundraising advantage over three Republican opponents who are trying to oust her from a critical seat in...", "filename": "_f04775330385b6bea170ef87c6ec5d2b_1588623361.html", "image_url": "https://storage.googleapis.com/afs-prod/media/85fd79ae284345b5a43af2cd1bf67ddd/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f04775330385b6bea170ef87c6ec5d2b_1588623361.html", "title": "Torres Small has huge cash advantage in key US House race", "title_page": "Torres Small has huge cash advantage in key US House race", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Feb. 18, 2020, photo, U.S. Rep. Xochitl Torres Small, D-Las Cruces, speaks to voters during a town hall meeting in Belen, N.M. Torres Small announced Thursday, March 19, 2020, she will go into self-quarantine after coming in contact with someone who tested positive for the coronavirus. (AP Photo/Russell Contreras)\nIn this Feb. 18, 2020, photo, U.S. Rep. Xochitl Torres Small, D-Las Cruces, speaks to voters during a town hall meeting in Belen, N.M. Torres Small announced Thursday, March 19, 2020, she will go into self-quarantine after coming in contact with someone who tested positive for the coronavirus. (AP Photo/Russell Contreras)\nRIO RANCHO, N.M. (AP) — Democratic U.S. Rep. Xochitl Torres Small is maintaining a huge fundraising advantage over three Republican opponents who are trying to oust her from a critical seat in southern New Mexico.\nThe Las Cruces Democrat raised nearly $760,000 during the first three months of 2020 and had $2.9 million in cash on hand, according to federal campaign finance records released Thursday. Torres Small has outraised her GOP opponents and has more than three times the amount of money in her campaign coffers as the Republicans combined.\nOil executive Claire Chase reported raising $319,842 during the first three months of 2020. Records show she has pulled in over $1 million since she announced she was seeking the GOP nomination — more than the other Republicans running for the House seat.\nBut an early ad blitz on conservative radio stations by former state lawmaker Yvette Herrell forced Chase to spend on media buys. Chase now has just $263,899 cash on hand, records show.\nHerrell’s campaign said she raised $122,601 during the first three months of 2020 and had $377,755 in cash on hand.\nHerrell has attacked Chase for social media posts that were critical of Donald Trump during the 2016 Republican presidential primary. A super PAC organized by Chase allies has hit back at Herrell for previously supporting U.S. Sen. Ted Cruz of Texas for president.\nAnother Republican seeking the House seat, Las Cruces businessman Chris Mathys, reported raising $3,810 during the same time period and having $200,075 in cash on hand thanks to a loan he previously gave his campaign.\nThe Republican primary election is scheduled for June 2.\nTorres Small, a granddaughter of Mexican immigrants, rarely mentioned Trump in her 2018 campaign and promised to uphold the region’s “rural values.” She has kept a tightly scripted image during town halls and has brushed aside criticism that she voted to impeach Trump. The congresswoman has yet to endorse Democratic presidential candidate Joe Biden like the rest of New Mexico’s all-Democratic congressional delegation.\nIn Congress, Torres Small has tried to portray herself as a moderate on issues around immigration and spending.\nRepublicans have challenged Torres Small over her voting record, though she has voted with Republicans on some issues like minimum wage and trade. She has clashed with some of the more liberal members of Congress.\nThe sprawling district is home to a lucrative oil region but also has some of the most impoverished communities in the U.S. The district has the highest percentage of Hispanic voters in New Mexico, which is the state with the highest percentage of Hispanic residents.\n___\nFollow Russell Contreras on Twitter at http://twitter.com/russcontreras", "url": "https://apnews.com/f04775330385b6bea170ef87c6ec5d2b"}