{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:17:17", "date_modify": "2020-05-04 16:17:17", "date_publish": "2020-04-03 22:30:32", "description": "Each week during the nationwide fight against the coronavirus -- and we are officially through the third week now -- I am looking at 10 leaders -- usually politicians, but not exclusively -- whose voices mattered that week in addressing the pandemic and working to find solutions to get the country through this. (You can see last week's list here.)", "filename": "2020_04_03_politics_10-leaders-coronavirus-response_index_1588609037.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403185611-andrew-cuomo-0330-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_10-leaders-coronavirus-response_index_1588609037.html", "title": "10 leaders who mattered most on coronavirus response this week", "title_page": "10 leaders who mattered most on coronavirus response this week - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Each week during the nationwide fight against the coronavirus -- and we are officially through the third week now -- I am looking at 10 leaders -- usually politicians, but not exclusively -- whose voices mattered that week in addressing the pandemic and working to find solutions to get the country through this. (You can see last week's list here .)\nMy latest roundup is below. And worth noting: This is not organized by who is doing the best job when it comes to leading. \"Leadership\" tends to be a hard thing to agree on, especially in these moments. Rather, it's simply a look at whose voices truly matter most right now.\n: The governor of New York continues to be, for much of the country, the face of the government response to coronavirus. His daily news conferences have become must-see TV and he is now having to dodge questions about running for president His televised back-and-forth with his younger brother -- CNN's Chris Cuomo (more on him below) -- has softened some of his sharpest edges, too.\n: This is, supposedly, the week that the President got serious about the coronavirus threat . I mean, maybe. His tone in the daily coronavirus briefings was more measured, but he still managed to fire off a bunch of boorish tweets and attacked both Jeff Sessions and Chuck Schumer via letter.\n: The doctors won this round. After Trump spent late last week suggesting that the time to reopen society was Easter, Fauci and Birx appeared to talk sense into him as the President announced a 30-day stay-at-home recommendation on Tuesday. Phew.\n4. Mike Pence: The VP took something of a back seat this week as Trump dominated the daily press briefings more and more. But Pence remains the head of the coronavirus task force and is a far more reliable communicator of accurate and necessary information to the public than his boss.\n5. Chris Cuomo: The biggest challenge in covering the coronavirus story is that it's very hard to talk to people who are actively infected with the virus. ( : The biggest challenge in covering the coronavirus story is that it's very hard to talk to people who are actively infected with the virus. ( TV cameras aren't allowed in hospitals .) Enter Cuomo, who since being diagnosed with coronavirus earlier this week, has been not only hosting his nightly show on CNN but also stopped by -- virtually -- his brother's news conference to fill people in on what it's like to actually have the virus.\n6. Steve Mnuchin: The $2 trillion stimulus package is now law, but the treasury secretary remains very much in the spotlight as questions swirl as to whether he can ensure Americans get money from the government in a timely fashion. Amid : The $2 trillion stimulus package is now law, but the treasury secretary remains very much in the spotlight as questions swirl as to whether he can ensure Americans get money from the government in a timely fashion. Amid reports that it could take 20 weeks for some Americans to get checks , Mnuchin said Thursday that he guaranteed that people whose direct deposit information was on file would have the money within two weeks.\n7. Larry Hogan: The Republican governor of Maryland has always been a bit of a rebel in the GOP; he considered a : The Republican governor of Maryland has always been a bit of a rebel in the GOP; he considered a primary challenge to President Trump before deciding against it . From the start of the coronavirus pandemic, Hogan has been on the leading edge in terms of his willingness both to take tough actions to limit the spread and to call out the administration\n8. Jared Kushner: The President's son-in-law is now : The President's son-in-law is now knee-deep in the administration's coronavirus response , with the sort of amorphous role that Kushner seems to like. He appeared for the first time Thursday at the coronavirus task force's daily press briefing, perhaps a sign of things to come.\n9. Chuck Schumer: The New York Democrat -- and Senate minority leader -- is clearly getting under Trump's skin with his demands for more and better federal involvement in responding to the coronavirus. : The New York Democrat -- and Senate minority leader -- is clearly getting under Trump's skin with his demands for more and better federal involvement in responding to the coronavirus. Trump's childish letter to Schumer on Thursday is evidence of that. The question now is whether the President will appoint a coronavirus czar, an idea Schumer has been pushing", "url": "https://www.cnn.com/2020/04/03/politics/10-leaders-coronavirus-response/index.html"}