{"authors": ["Kelly Mena"], "date_download": "2020-05-04 17:01:05", "date_modify": "2020-05-04 17:01:05", "date_publish": "2020-04-10 11:03:38", "description": "State and city governments have started announcing efforts to funnel millions of dollars into new rental assistance programs aimed at dealing with unpaid rent amid the economic downturn resulting from the coronavirus pandemic.", "filename": "2020_04_10_politics_rent-relief-programs_index_1588611665.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401201034-renters-strike-lah-pkg-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_rent-relief-programs_index_1588611665.html", "title": "Cities and states launch emergency rent relief programs", "title_page": "Cities and states launch emergency rent relief programs  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington, DC (CNN) State and city governments have started announcing efforts to funnel millions of dollars into new rental assistance programs aimed at dealing with unpaid rent amid the economic downturn resulting from the coronavirus pandemic.\nThis type of funding assistance is separate from the eviction moratoriums some cities and states have implemented amid declarations of emergency, as they aim to tackle the potential backlog of rent payments.\nThe programs, which range from Nevada to Washington, DC, come as some Americans face unemployment and struggle to pay rent.\nDistrict of Columbia Mayor Muriel Bowser announced on Wednesday a new rental assistance effort.\n\"Out of the Department of Housing and Community Development ... is tenant based rental assistance for individuals,\" Bowser, a Democrat, said during her daily coronavirus briefing. \"Using $1.5 million in federal home funds, DCHD (Department of Housing and Community Development) will provide rental assistance to low-income tenant households sitting in properties facing significant financial impact as a result of Covid-19.\"\nThe rental assistance funding is coming from reallocated money that's already part of Washington, DC's budget, according to Richard Livingston, spokesman for DCHD. He told CNN that the program is in its infancy and officials will launch the program with eligibility requirements later this month.\nLivingston also noted that more rental assistance funding could be down the pipeline once the city receives its funds from the $2.2 trillion federal stimulus package . The District of Columbia is expected to receive a little more than $15 million in federal funds under the Department of Housing and Urban Development's initial allocation of over $3 billion from the package. The funds the District receives have the potential to be used for housing assistance aid.\nLast month, Chicago Mayor Lori Lightfoot announced the creation of a Covid-19 Housing Assistance Grant program, a $2 million program awarding grants of $1,000 to 2,000 recipients. Los Angeles city officials are also considering rental assistance funding, following City Council President Nury Martinez's introduction of legislation to revive an old housing program. Rick Coca, spokesman for Martinez, told CNN the program aims to help low-income and immigrant communities struggling financially.\nMeanwhile, state lawmakers in Nevada on Tuesday approved spending $2 million on a fund that helps struggling individuals with rent. The Nevada Legislature Interim Finance Committee approved funding for emergency rental assistance to the federal Emergency Food and Shelter Program.\nThe funding was already set to be earmarked for the program, but because of how coronavirus has impacted daily life, state lawmakers rushed to authorize the funding, according to the Reno Gazette Journal\nJessica Adair, chief of staff to Nevada Attorney General Aaron Ford, presented the provision to the lawmakers, citing that the recent eviction moratorium issued by Gov. Steve Sisolak is a \"bandaid for the larger problem of an unemployed workforce.\" As of the first week of April, about 200,000 Nevadans had filed for initial unemployment claims so far this year, not including any already existing claims, according to the US Department of Labor\nMinnesota lawmakers are weighing a similar measure, while Delaware Gov. John Carney last week announced rental assistance funding up to $1,500 for eligible renters to be paid directly to landlords.\nOne-third of Americans renters miss April payment\nNearly a third of American renters didn't pay their rent for April, according to data from the National Multifamily Housing Council , a trade association for the apartment industry.\nOf more than 13 million units in the US that the report covered, 69% of renters paid their rent between April 1 and 5. During the same period in April 2019, 82% of households paid their rent on time, the report said.\nDoug Bibby, president of NMHC, told CNN that the significant lack of rent payments is \"surprising\" and just the beginning glimpses of the trouble ahead for the apartment industry struggling to accommodate residents left without an income over the last several weeks as nearly 10 million Americans filing for unemployment in March\n\"Everyone in the industry expects May to be a tougher month. We had record number of people filing for unemployment. Businesses have gone out of business and others have shuttered for the time being,\" said Bibby.\n\"We expect that we are at the beginning of the process, not in the middle,\" added Bibby.\nThe National Apartment Association alongside NHMC sent a letter to Congress on Tuesday asking for additional federal relief and assistance for America's rental housing providers and renters. The letter reiterates a problem some federal lawmakers saw coming a couple weeks ago when they called for suspensions on rent and utility bills\nRep. Alexandria Ocasio-Cortez of New York, anticipating the rent burden facing Americans quickly losing their jobs, recently was one of a handful of Democratic lawmakers leading a popular rent strike movement. The lawmaker, in an interview on State of the Union with CNN's Jake Tapper, said, \"If we're able to get money into households and stop the bleeding with pauses on money going out of households, then we can get working families through this thing.\"\nAmong the priorities outlined by the apartment industry's letter are the creation of an emergency assistance fund for renters not currently receiving federal rental subsidies, providing financial assistance for property owners and mortgage servicers, and expanding the new Small Business Association Paycheck Protection Program to include multifamily property firms.\nThe SBA loan program, meant to help put millions directly into the hands of small business owners affected by coronavirus, is a sticking point for Bibby who argues that small property owners should be treated as a small business for their role in providing critical employment and housing during the pandemic.\nSome banks, in light of the pandemic, last month started letting customers request to defer payments on mortgages and small businesses . Bank of America, Ally Bank and Wells Fargo announced the expanded protection measures in late March in order to ease the financial burden on customers, which also included fee waivers and tacking missed payments to the end of loans.\n\"The federal government has the ability to effect massive stimulus efforts and to get huge amounts of dollars out the door, even with the inefficiency that often happens there. This is unprecedented ... It's the old cliche: 'we are all in this together.' And that's the truth,\" added Bibby.", "url": "https://www.cnn.com/2020/04/10/politics/rent-relief-programs/index.html"}