{"authors": ["Kristen Rogers"], "date_download": "2020-05-04 15:57:45", "date_modify": "2020-05-04 15:57:45", "date_publish": "2020-04-07 23:00:29", "description": "It could be a real-life \"Contagion,\" much like the movie.", "filename": "2020_04_07_health_mammal-hu_48829bfbed21e232e012a3e38b3d7cfe_index_1588607865.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407145422-amazon-rainforest-destruction-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_health_mammal-hu_48829bfbed21e232e012a3e38b3d7cfe_index_1588607865.html", "title": "Human behaviors could make zoonotic diseases worse, study finds", "title_page": "Human behaviors could make zoonotic diseases worse, study finds  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) It could be a real-life \"Contagion,\" much like the movie.\nAs a deadlypandemic spreads across the globe, a timely new study has identified key drivers of \"virus spillover\" from mammals to humans.\nThe risk of virus spillover -- when viruses jump from animals to humans -- was highest when human exploitation and habitat destruction threatened wild animals, according to a data analysis conducted by researchers at the University of California and the University of Melbourne.\nThe research was carried out years before the current pandemic began, but researchers have long expected\"emerging infectious diseases that come from wildlife and affect people,\" said study author Dr. Christine Kreuder Johnson, a professor of epidemiology and wildlife health at the University of California, Davis.\n\"The reason why we did this work was to help understand what are the drivers for spillover, \" she said, and what characteristics appeared in the past \"that can help us [prevent spillover] in the future.\"\nTransmission of zoonotic disease\nA zoonotic disease is a disease spread between animals and people, and they can be caused by bacteria, parasites, fungi and viruses, according to the US Centers for Disease Control and Prevention.\nSome animal-borne diseases may have adapted and transferred easily to humans because the biological makeup of the mammal was similar to that of a human.\nTransfer is also easier if the human and the species have lived together over time, which is typically the case in humans infected with zoonotic disease from pigs and livestock, Johnson said. That's because humans have farmed them for food and lived with or near them for centuries.\nHumans also share more than 98% of DNA with chimpanzees and mice. This makes the animals more susceptible to many of the same health problems as humans -- hence their use in many lab studies, according to the California Biomedical Research Association (PDF).\nBats and primates are \"disproportionately likely sources of viral spillover to humans\" due to their biological similarity and unique metabolic regulation of immune responses to infection, said Thomas Gillespie, a disease ecologist from Emory University. Gillespie was not involved in the study.\nStress caused by humans\nThe human-caused stress that mammals face also increases the risk of zoonotic spillover.\nWhen we capture wild animals from their natural homes to put them into trade and sell them in animal markets, they undergo a great deal of tension, Johnson said.\n\"And when that happens, they're more likely to produce high numbers of viruses that they might be infected with,\" she added.\nHigher numbers of viruses mean greater viral shedding, which is the expulsion and release of excretions infected with the virus. So being around captured, stressed animals exposes people to higher virual loads and a greater chance of catching the virus than if we were to have contact with them in the wild, Johnson said.\nShifts in mammalian populations\nThe researchers studied zoonotic viruses and their land-based mammalian hosts, using 2004 to 2013 data from an internationally recognized authority on threatened species.\nAmong the 142 zoonotic viruses examined, 139 viruses had at least one mammalian host reported at the species level.\nDomesticated mammals -- including cats and dogs, pigs and cattle, horses and sheep-- host 50% of the viruses that can be passed to mankind, despite representing only 12 species, according to the report. Rodents, bats and primates also carried high proportions of zoonotic diseases.\nThere are a couple of reasons why some species have lower or higher risk for zoonotic viruses, Johnson said.\nWild mammals with threatened conservation status are rare, so the probability of those animals encountering humans is low. They also may harbor fewer parasites since their populations are smaller.\nThreatened species with a reduction in population size due to human exploitation -- by hunting, trade and human occupation -- have over twice as many zoonotic viruses compared to those threatened for other reasons.\n\"Exploitation of wildlife through hunting and the wild animal trade may have increased opportunities for virus spillover because of the close contact between wildlife and humans involved in these activities,\" the report said.\n\"The lack of awareness in the society for climate change and the role of wildlife has multiplied this problem to many folds. The wildlife is at run due to lack of habitat and food, leading to an increase in human exposure to wild animals,\" said Dr. Suresh Mittal, professor of virology at Purdue University, who was also not involved with the study.\nThe lack of available data on the presence or absence of zoonotic viruses for nearly 90% of wild mammal species \"creates a tremendous amount of uncertainty in the results,\" Gillespie said.\nFurther studies that observe both animal and human pathogens along with information on natural and human systems are needed, he added.\nHistories of zoonotic diseases\nAnd of course, the latest is the novel coronavirus, potentially either from bats or an unknown spark that could have been circulating at low levels in humans for years before becoming seriously infectious.\nHowever, zoonotic diseases don't always manifest as outbreaks. Some infections lie low and go undetected, while others have and can become much more serious.\nThe gravity of the outcome depends on the characteristics of the virus, including whether it's able to jump from an animal into a human host then move to another human, its infection rate and the severity of symptoms.\n\"Rabies is a good example, right?\" Johnson said. \"Rabies is very common around the world, but there are viruses like rabies that just jump into humans and then they stutter out. They only affect the human that the animal basically was in contact with, so they're limited.\"\nThat's happened with some previous strains of coronavirus, Johnson said. Some have spilled over into humans before, but may have resulted in only mild, sometimes seasonal, disease.\nImplications for the future\nThe decline of species is a health problem that occurs for various reasons, Johnson said. But the declines as underlying causes of virus spillovers urge us to \"think about environmental change and the impact that has on wild animal species.\"\n\"We need to start to think about environmental health together with our health,\" she added. \"Realizing that, we've seen with this pandemic, if our activities with wildlife are not thoughtful and we're not minimizing contact with wildlife, that we are at risk and this disease emergence event is unprecedented in its impact.\"\n\"Far too often, commercial activities that require large-scale land use change levy tremendous costs that are not considered in cost-benefit analysis because the costs are not shouldered by those profiting,\" Gillespie said.\n\"Three months ago, pandemics did not feel like an urgent issue, people did not feel vulnerable. Now the Covid-19 pandemic is affecting people -- it's affecting the stock market, their quality of life, their health and their loved ones,\" he added.\n\"Now this feels urgent, now they feel vulnerable. It's in moments like this that real change can happen. The key is ensuring that this crisis catalyzes societal and environmental solutions instead of reinforcing entrenched irrationality.\"", "url": "https://www.cnn.com/2020/04/07/health/mammal-human-virus-spillover-coronavirus-scn-wellness/index.html"}