{"authors": ["Don Babwin"], "date_download": "2020-05-04 20:10:16", "date_modify": "2020-05-04 20:10:16", "date_publish": "2020-04-09 16:14:13", "description": "CHICAGO (AP) — The Illinois county that includes Chicago is setting up new places to store bodies in preparation for a likely surge in the number of coronavirus deaths that could overwhelm...", "filename": "_b19321c85efab8e546821dc47eb82011_1588623016.html", "image_url": "https://storage.googleapis.com/afs-prod/media/1547ec68614f4ddca130eee6d31a58f0/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b19321c85efab8e546821dc47eb82011_1588623016.html", "title": "Virus prompts Cook County to open warehouse to store bodies", "title_page": "Virus prompts Cook County to open warehouse to store bodies", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Cynthia Riemer, an emergency room nurse at the University of Illinois Hospital, poses for a portrait outside the hospital in Chicago on April 6, 2020. As paramedics rushed another critical COVID-19 patient into her ER, Riemer felt her adrenaline kick in. “Your heart starts racing,” she said. “You're thinking, 'How quickly and safely can we get them intubated?' Because if we don't, in the next five or 10 minutes, they could stop breathing.” Her protective gear: a hospital-supplied yellow gown, foot covers and an N95 mask — plus, from a hardware store, a welder’s mask, which she says \"helps conserve what we have.” (AP Photo/Teresa Crawford)\nCynthia Riemer, an emergency room nurse at the University of Illinois Hospital, poses for a portrait outside the hospital in Chicago on April 6, 2020. As paramedics rushed another critical COVID-19 patient into her ER, Riemer felt her adrenaline kick in. “Your heart starts racing,” she said. “You're thinking, 'How quickly and safely can we get them intubated?' Because if we don't, in the next five or 10 minutes, they could stop breathing.” Her protective gear: a hospital-supplied yellow gown, foot covers and an N95 mask — plus, from a hardware store, a welder’s mask, which she says \"helps conserve what we have.” (AP Photo/Teresa Crawford)\nCHICAGO (AP) — The Illinois county that includes Chicago is setting up new places to store bodies in preparation for a likely surge in the number of coronavirus deaths that could overwhelm hospital morgues.\nCook County Board President Toni Preckwinkle’s office said in a news release Thursday that a 66,000-square-foot refrigerated warehouse located 5 miles from the medical examiner’s office would be up and running by the end of the day. The facility, according to the release, will be able to hold more than 2,000 bodies.\nThe county’s Department of Emergency Management and Regional Security has also acquired 14 refrigerator trailers and is in the process of securing six more. Another trailer has already been set up outside the medical examiner’s office. It’s a grim reminder of the trailers that were hastily set up to handle the overflow of bodies of people who died in the 1995 heat wave that claimed more than 700 lives.\n“While my hope is that we have made plans that we will not have to utilize, I realize that my administration has the responsibility for a surge of deaths due to the COVID-19 pandemic,” Preckwinkle said in the release. “We are working diligently to ensure that the victims of this virus are treated with dignity while under our care.”\nThe county has had 351 COVID-19-related deaths, including 198 in Chicago, according to the state.\nStatewide, public health officials reported 66 more deaths attributable to the illness Thursday, for a total of 528. There were 16,422 people ill with COVID-19, a one-day jump of 1,344.\nThe warehouse and the trailers come at a time when the medical examiner’s office is closing in on the maximum number of bodies it can store. County spokeswoman Natalia Derevyanny said the office has enough space to store 285 bodies and at last count there were 246 bodies stored there. She said there are already two trailers at the facility, each of which can hold 30 bodies.\nShe also said that the other trailers will be placed in parts of the county where there are anticipated surges and they will be moved to be placed wherever officials see there are hot spots.\nFurther, she said the facility opening on Thursday will streamline the process of storing bodies. “This is for all the hospitals so they (bodies) can be taken directly” to that facility, instead of being first brought to the medical examiner’s office, she said.\nDerevyanny did not know the size of morgues for area hospitals but said they are quite small, with space for only a few bodies each.\nMeanwhile, Chicago, which has long been plagued by gun violence, has in recent days been hit by a rash of shootings that is taxing the medical examiner’s office at a time when it is dealing with more and more coronavirus deaths.\nOn Thursday, Chicago Mayor Lori Lightfoot said early estimates by budget officials anticipate receiving $470 million from a federal stimulus package Congress approved as the virus spread across the country. City agencies expect to receive an additional share of the $2 trillion package, including $800 million to the Chicago Transit Authority and $205 million to the city’s public school district.\nBudget officials said the city’s two airports — O’Hare and Midway — are working with federal aviation authorities overseeing a $10 billion fund for U.S. airports. It’s not clear yet how that money will be distributed.\nLightfoot said it’s still difficult to tell how the coronavirus outbreak has affected the city’s financial picture. Exact information likely will remain fuzzy until a statewide stay-at-home order and other prohibitions are lifted and more normal business operations are restored, she said.\nIn the meantime, Lightfoot said she is opposed to city employee layoffs, furloughs or cutbacks in government spending because it could exacerbate economic damage.\nShe cautioned that it’s unclear when Chicago will experience peak demand for medical care.\n“We’re still seeing a rise in the number of cases, the number of deaths, the number of ICU beds taken up with COVID patients or people under investigation for COVID,” she said. “So, we’re not close to seeing what the peak is yet.”\nLightfoot said she wants to see large-scale testing available to the public before restrictions are lifted because people need “confidence about whether or not they are infected.” Easing up too soon could mean a second spike in cases, Lightfoot said.\n“We’re going to be extremely cautious before we will lift anything here locally,” she said, adding that city officials are constantly speaking to the state about those determinations.\n___\nAssociated Press Writer Kathleen Foody contributed to this story.", "url": "https://apnews.com/b19321c85efab8e546821dc47eb82011"}