{"authors": ["Cnn Staff"], "date_download": "2020-05-04 16:15:20", "date_modify": "2020-05-04 16:15:20", "date_publish": "2020-04-03 15:20:36", "description": null, "filename": "2020_04_03_health_sanjay-gu_8ff9c91a928b5b7a0c00c935e941be87_index_1588608920.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402114757-gupta-coronavirus-podcast-top-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_health_sanjay-gu_8ff9c91a928b5b7a0c00c935e941be87_index_1588608920.html", "title": "Surviving isolation in space: Dr. Gupta's podcast 4/3", "title_page": "Surviving isolation in space: Dr. Gupta's podcast 4/3 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) After spending a year in space, Scott Kelly is an expert on managing extreme isolation. The retired astronaut shares valuable advice with CNN Chief Medical Correspondent Dr. Sanjay Gupta on how to cope with social separation here on Earth.\nAnnouncer: And liftoff, the year in space starts now. Kelly, Kornienko and Padalka on their way towards the International Space Station.\nDr. Sanjay Gupta: Station, this is CNN. How do you hear me?\nScott Kelly: I hear you loud and clear. Welcome aboard the space station.\nDr. Gupta: That was me talking to former NASA astronaut Scott Kelly back in 2016. At that time, he was near the end of his 340 days on the International Space Station -- the longest time an American had been in space.\nMany of us have been in relative isolation for weeks now. And there seems to be no clear end in sight. That can take its toll on all of us.\nIn this episode, I called Scott in his home in Houston. I wanted to ask him how he survived nearly a year in space, stuck in one place and away from his friends and family. Now of course, that was space. But in some way, a lot of us are living a similar reality right now.\nI'm Dr. Sanjay Gupta, CNN's Chief Medical Correspondent. And this is \"Coronavirus: Fact vs. Fiction.\"\nAnnouncer: And there are the two one-year crew members Scott Kelly and Mikhail Kornienko saying hello to their crewmates and saying hello to their home for the next 12 months in space.\nDr. Gupta: Scott's year in space was historic in more ways than one. Aside from breaking spaceflight records, he also participated in something called the NASA Twins Study, where scientists tracked Scott and his identical twin brother Mark, who's also a fellow astronaut, back on Earth.\nThey wanted to see how a human body adapted to extreme conditions in space. His twin brother was the perfect control for the study.\nIt put us one step closer to understanding if and how humans can reach farther planets like Mars.\nDealing with long-term isolation is one of the challenges that comes with space travel.\nRight now, many of us are facing a similar challenge here on Earth.\nTalk about social distancing: Scott Kelly was over 200 miles from the planet Earth.\nSo, I decided to ask Scott for some advice, since he is pretty uniquely qualified to talk about isolating for an extended period of time.\nScott Kelly: First of all, you know, having a set schedule if you're lucky enough to be able to work from home, you know, schedule those work times. I would go as far as even scheduling meals. My wife and I have been making a schedule like we were in space because if you keep to that schedule and it has variety, I think what people will find are the days go by much quicker. Other things to put in the schedule: exercise.\nNASA has found that astronauts in isolation have suppressed immune systems because of the isolation. And that is the last thing we need in this environment is to have our immune systems be suppressed.\nThe other thing is pace yourself. For me, I think one of the most important things for me getting to the end of that mission in space was, with as much enthusiasm and energy as I had in the beginning, was the appropriate pace.\nNow, I got to ask you, Sanjay, I see you on TV all the time. Are you pacing yourself?\nDr. Gupta: No. It's funny, as you're talking, Scott, I'm mentally making a checklist because this is all so, so important and practical. I hate to admit it. I probably suppressed my immune system from lack of sleep and all those things. But you know what? I will start pacing myself.\nKelly: This is the inside of the crew quarters. In here, we sleep. This is where we get our change of clothes. We do brush our teeth and, you know, shave and those kinds of things.\nDr. Gupta: Now, Scott wasn't completely alone. Russian cosmonaut Mikhail Kornienko was always with him, as well as other crewmates who rotated in and out of the space station.\nKelly: Knowing who they're in quarantine with is very important. I mean, you got to almost treat the people you are with, almost like they are your crew.\nDr. Gupta: Now, to be clear, for a lot of people, their crewmates right now is their family, but people many times are going through something they haven't gone through before, spending this kind of extended time with somebody, as much as they may love them. Do you really think that the crewmate analogy sort of helps in this case?\nKelly: I think so, because I think about it myself with my wife. You know, I know that there are things that I'm better at than her at and there are things that she's better at (than) me. And, you know, we complement ourselves very well.\nIn this type of situation where our performance is so critical, people need to have a different mindset of what their family unit is right now. And it is more, you know, you are a crew together and you have a mission.\nDr. Gupta: Scott also says that having a hobby is important. It helps take our mind off our current living situation.\nWhen he was in space, Scott took up photography. He shot breathtaking photos of Earth from a porthole in the floor of a lab module.\nHe and his crewmates also listened to a lot of music. He said music had a way of connecting and relaxing him, no matter what his mood was.\nThe Dixie Chicks echoed through the International Space Station. And Pink Floyd.\nDr. Gupta: You're in a type of isolation now that's different than space. You can go outside, which I imagine is a big plus compared to what it took to go outside when you were on the International Space Station. But how is the isolation different now for you?\nKelly: Oh, it's a lot different. I said, when this -- we were about a week into this -- if I had to spend a year in space or a year in my apartment, the apartment wins every time. Not that space is not an extraordinary experience -- and I would do it again in a second -- but at least in my current situation, it's much more comfortable. It's convenient.\nDr. Gupta: Sure.\nKelly: You know, when all your stuff floats all the time and the life support systems are so hard and complicated to maintain. I mean, the toilet costs $10 million and it breaks all the time.\nDr. Gupta: Obviously, there was a lot of uncertainty in space. But the idea that while most people believe we will get through this period, we just don't know how long the tunnel is right now. I just wondered if you had any insights in how to deal with that.\nKelly: Well, when I launched in March of 2015, I knew I was coming home in about a year.\nDr. Gupta: Right.\nKelly: Not exactly when. But it was so far away that I couldn't even see the end of it from the beginning.\nSo, I think the mindset people need to be in is that: I am not looking to the end of this because I don't know. And this is my reality. This is how my life is right now. It will be over someday.\nYou know, I've had a lot of opportunities to be scared in my life. And what I've always found is the way you get past that is you just understand that there are certain things we have control over and certain things we don't, and the things that we don't have control over are the stuff that makes us scared.\nSo, focus on what you can control: taking care of yourself, your family, your schedule, your environment.\nDr. Gupta: One thing I wanted to ask you about was this idea that, you know, humans really are inherently social creatures. I don't think we realize how much our health, our physical health, sometimes is dependent on physical contact. We don't get to do that as much as things stand now. How much of an impact did that have on you? Was it something you were cognizant of when you were up in space?\nKelly: We had a phone that we could call people. They couldn't call us, which in some ways is an advantage because you're always talking on your own terms.\nIt's important to stay connected. We've, you know, we've been doing these virtual happy hours with friends, some of which, you know, I'll probably be closer to after this is over as a result of it, because you have the time now and you want to connect with people. And, you know, often in our normal lives, we just, you know, we're so busy. We just don't have the time to, like, reconnect with old friends. And so hopefully that's one of the positive things that will come out of this, is that people have, you know, strengthened their relationships and friendships with people they otherwise would not have done before this pandemic.\nDr. Gupta: Scott, the inevitable question, when you touch down in Kazakhstan, what will be the first things you'll want to do? Your thoughts as you emerge from a year aboard a confined environment.\nKelly: You know, seeing the sky from below and a breeze and sun, the sun on my face, running water, those kind of things. People.\nYou know, when you look at this Earth from space, it doesn't look all that big. You don't see political borders. It makes you think we are all part of the same team. And now, you know, with this pandemic, you realize, you know, we are all interconnected for better or for worse in this case. And our species is capable of doing amazing things. We can put people on the moon. People living in space for a year. Everything we have done in the last hundred years, we can beat this, absolutely, I am convinced. But it's gonna take an effort on all of our part, working together as a team.\nDr. Gupta: We are all in this together, no question. And Scott, you and I are in this together, and I feel really good about that. I feel like my odds are a lot better with you in the game. Thanks for joining us.\nDr. Gupta: And thank you for listening. This weekend, I hope you will all take time to connect, even remotely, with those you hold dear, as well as be available to those who need a friend right now.\nAnd send voice memos to me about how you're connecting at asksanjay@cnn.com. We'll be back Monday.\nYou can also head to cnn.com/coronavirus and sign up for our daily newsletter , which features the latest updates on this fast-moving story from CNN journalists around the globe.", "url": "https://www.cnn.com/2020/04/03/health/sanjay-gupta-podcast-transcript-april-3-wellness/index.html"}