{"authors": ["Dakin Andone"], "date_download": "2020-05-04 16:08:15", "date_modify": "2020-05-04 16:08:15", "date_publish": "2020-04-02 13:37:50", "description": "A train engineer faces federal charges after he allegedly admitted to intentionally derailing a train Tuesday near the USNS Mercy, a ship sent to Los Angeles to ease the burden of hospitals treating coronavirus patients, according to the Department of Justice.", "filename": "2020_04_02_us_train-derailed-mercy-coronavirus-trnd_index_1588608495.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402135057-01-usns-mercy-los-angeles-0327-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_us_train-derailed-mercy-coronavirus-trnd_index_1588608495.html", "title": "Train derailment: Engineer said he was \"suspicious\" of nearby coronavirus relief ship", "title_page": "Train derailment: Engineer said he was \"suspicious\" of nearby coronavirus relief ship - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A train engineer faces federal charges after he allegedly admitted to intentionally derailing a train Tuesday near the USNS Mercy, a ship sent to Los Angeles to ease the burden of hospitals treating coronavirus patients, according to the Department of Justice.\nEduardo Moreno, 44, told law enforcement investigators he was \"suspicious\" of the ship and believed it \"had an alternate purpose related to COVID-19 or a government takeover,\" the Justice Department said in a news release, citing the affidavit.\nMoreno has been charged with one count of train wrecking, the Justice Department said.\nThe federal public defender's office in Los Angeles, which is representing Moreno, declined to comment on the case.\nThis aerial image taken from video provided by KABC-TV shows a Pacific Harbor Line train that derailed Tuesday, March 31, 2020, at the Port of Los Angeles.\nAccording to the Justice Department, Moreno, a train engineer at the Port of Los Angeles, crashed the train at the end of the tracks, running through barriers before it came to a rest more than 250 yards away from the ship. No one was injured, the news release said, and the ship was not damaged.\nRead More", "url": "https://www.cnn.com/2020/04/02/us/train-derailed-mercy-coronavirus-trnd/index.html"}