{"authors": ["Sarah Lazarus"], "date_download": "2020-05-04 16:24:51", "date_modify": "2020-05-04 16:24:51", "date_publish": "2020-04-07 00:53:49", "description": "After three decades of growth that lifted millions out of poverty, Vietnam's economy is undergoing another transformation -- thanks to technology. CNN speaks to Vietnam's business leaders to find out the latest developments.", "filename": "2020_04_06_asia_vietnam-tech-economy-intl-hnk-spc_index_1588609491.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200326124537-smart-phones-vietnam-2016-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_asia_vietnam-tech-economy-intl-hnk-spc_index_1588609491.html", "title": "New technology is transforming Vietnam's economy", "title_page": "New technology is transforming Vietnam's economy - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN's series often carry sponsorship originating from the countries and regions we profile. However, CNN retains full editorial control over all of its reports. Our sponsorship policy .\n(CNN) In 1975, Vietnam emerged from its 20-year-long war as one of the poorest nations in the world.\nSince then, its economy has been transformed -- largely thanks to a package of economic and political reforms, designed to engineer growth, that was launched by the government in 1986.\nMore than 45 million people were lifted out of poverty between 2002 and 2018 as the country developed industries that span textiles, agriculture, furniture, plastics, paper, tourism and telecommunications.\nVietnam is now undergoing another transformation -- thanks to technology.\nSmartphones are changing the way of life in Vietnam.\nNew infrastructure has given Vietnamese citizens easy access to the internet -- and propelled their country across the digital divide.\nA 2018 report by Google and Singaporean investment company Temasek described Vietnam's digital economy -- which is growing at more than 40% a year -- as \"a dragon being unleashed.\"\nIt's not all plain sailing. Vietnam's government has been widely criticized for its surveillance of citizens and restrictions on freedom of speech. And like the rest of the world, it's impossible to predict how the coronavirus will impact the country's economy.\nWhat's clear, though, is that technology is reshaping the way people in Vietnam do business, manufacture goods, entertain themselves, shop, organize their finances and communicate. CNN spoke to three business leaders -- to take the pulse of a changing nation.\nThe startup pioneer\nNguyen Thuy Lien, head of corporate development for Appota\nNguyen Thuy Lien.\nOne of the country's most dynamic startups, Appota has hitched its wagon to the growth of Vietnam's smartphone market.\nAppota, which launched in 2011, has around 40 million users on its \"digital ecosystem,\" says head of corporate development, Nguyen Thuy Lien. The company publishes games licensed from developers in China (martial arts themes are especially popular) and has developed an e-wallet for gaming purchases. Its apps include a wifi password-sharing facility, a book reader, news, movies, comics and other forms of entertainment.\n\"Vietnamese of all ages love their smartphones\" says Nguyen. \"Everything Appota does is through mobile.\"\nA 2019 report by Google and the Mobile Marketing Association identified Vietnam as a \"mobile-first market\" with \"over 51 million smartphones, representing over 80% of the population aged 15-years and older.\"\nNetwork coverage is extensive. \"People get access to 3G and 4G even in rural and mountainous areas,\" says Nguyen, adding that handsets and tariffs are competitively-priced.\nThe company also operates a business-to-business advertising arm and is looking to expand its mobile payments operations.\nNguyen is responsible for securing funding for Appota -- which has raised $17 million to date. She says that attracting investment is easier now than it was in the past, with the majority of funds coming in from overseas, especially Japan and South Korea. Vietnamese investors, however, tend to lack confidence in tech, she says. \"They are more conservative and prefer putting money into real estate.\"\nAppota's next foray will be into physical products -- which function via smartphones. The company recently launched a \"smart lock,\" operated by an app, that secures everything from front doors to suitcases. Nguyen says her company's vision is to fully integrate smartphones into the workplace and the home. \"It's the next step in digital transformation.\"\nThe sustainability trailblazer\nHans Barkell-Schmitz, assistant to the chairman, Royal Spirit Group\nHans Barkell-Schmitz at the DBW factory.\nA manufacturing powerhouse, Vietnam is the world's third largest exporter of textiles and garments (after China and Bangladesh).\nBut the global textile industry is highly polluting, churning through more than 90 billion cubic meters of water a year, and contributing around 10 percent of global carbon emissions.\nHong Kong-based garment manufacturer Royal Spirit Group opened the Deutsche BekleidungsWerke factory (its name reflects the company's German heritage) on the outskirts of Ho Chi Minh City, in 2016. \"We decided to position ourselves at the forefront of sustainability,\" says Hans Barkell-Schmitz, who conceived and led the project.\nDBW from the air. The roof is fitted out with solar panels and a garden, and is painted with light-reflecting paint.\nKnown as DBW, the $20-million facility is designed to sustain both the environment and the 1,000-strong workforce. The chairs were designed locally to fit the average Vietnamese body size, says Barkell-Schmitz. Throughout the factory, LED lights glow at the optimal level to reduce eye strain and headaches, and complex calculations were used to set the ventilation and air conditioning systems at the right temperatures. \"Our ethos is -- if we have a happy workforce, we'll have more efficiency and it's a win-win\" says Barkell-Schmitz.\nCutting energy consumption was key. The factory runs on renewable energy sources, including hydroelectric power, biofuel and solar, says Barkell-Schmitz. His team chose equipment with \"great care,\" he says, comparing the energy use of different options. They selected German sewing machines that automatically switch off when not stitching, and machines that make and apply pockets with minimal waste and electricity consumption.\nDBW's ironing and sewing machines use much less electricity than conventional machines.\nThe factory is equipped with \"highly technical dyeing machines that use less dye and water,\" says Barkell-Schmitz. The building itself acts as a giant funnel, channeling rainwater into tanks -- which is then filtered and used to wash textiles. The factory also incorporates a \"gray water system\" in which handwashing and dishwashing water is filtered and re-used to nourish a rooftop garden that produces fruit and vegetables for the factory cafeteria.\nAccording to Barkell-Schmitz, the single biggest challenge was the paperwork. By planning and documenting all aspects of the project according to stringent requirements, DBW earned top level awards from both LEED, the US green building certification system, and Lotus, its counterpart in Vietnam.\nBarkell-Schmitz hopes that DBW will inspire other manufacturers. \"It's a win for the planet, for the companies which invest, and for the consumers.\"\nThe e-commerce entrepreneur\nTran Ngoc Thai Son, founder and CEO, Tiki\nTran Ngoc Thai Son.\nIn 2010 Tran Ngoc Thai Son launched his company, Tiki, in his bedroom at his parents' house in Ho Chi Minh City. An online bookseller specializing in English-language titles, he used the family garage as a warehouse. \"It was a tiny store, but my dream was very big,\" says Tran.\nTen years later, Tiki is the one of the top e-commerce platforms in Vietnam, says Tran. It sells a vast array of consumer goods with an average of 17 million customer visits, and around 4.5 million items shipped, per month.\nTiki's expansion has tracked explosive growth in Vietnam's e-commerce market, which was worth $6.2 billion in 2019.\nThis boom reflects, in part, the youthfulness and increasing affluence of Vietnam's population, says Tran. The Vietnamese embrace new technology and feel optimistic about the future, \"which drives them to go online and buy stuff,\" he says.\nAdditionally, smartphones and internet access are extremely affordable, says Tran, while fierce competition between international conglomerates and local startups \"drives innovation and consumer benefits.\"\nTiki's top-sellers are consumer electronics, although sales in lifestyle products and fashion have grown tremendously over the last year, he says.\nTiki's top sellers are consumer electronics.\nEfficient logistics are key to the company's success. Tiki has 33 warehouses in 13 cities and prides itself on a two-hour delivery option, says Tran. However, although Vietnam is urbanizing, almost two-thirds of its population still live in rural areas. Delivery to remote areas typically takes longer and costs more.", "url": "https://www.cnn.com/2020/04/06/asia/vietnam-tech-economy-intl-hnk-spc/index.html"}