{"authors": ["Christopher Rugaber", "Sarah Skidmore Sell"], "date_download": "2020-05-04 20:11:26", "date_modify": "2020-05-04 20:11:26", "date_publish": "2020-04-02 21:35:18", "description": "WASHINGTON (AP) — Nearly 10 million Americans have lost their jobs and applied for unemployment benefits in the past two weeks — a stunning record high that reflects the near-complete shutdown of...", "filename": "_af69fa95dee18483801959a025aa1768_1588623086.html", "image_url": "https://storage.googleapis.com/afs-prod/media/48fd311d69624416bf73c3c567252969/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_af69fa95dee18483801959a025aa1768_1588623086.html", "title": "You've just lost your job? Here's what you need to know", "title_page": "You've just lost your job? Here's what you need to know", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "You’ve just lost your job? Here’s what you need to know\n\"For Sale By Owner\" and \"Closed Due to Virus\" signs are displayed in the window of Images On Mack in Grosse Pointe Woods, Mich., Thursday, April 2, 2020. The coronavirus outbreak has triggered a stunning collapse in the U.S. workforce with 10 million people losing their jobs in the past two weeks and economists warn unemployment could reach levels not seen since the Depression, as the economic damage from the crisis piles up around the world. (AP Photo/Paul Sancya)\n\"For Sale By Owner\" and \"Closed Due to Virus\" signs are displayed in the window of Images On Mack in Grosse Pointe Woods, Mich., Thursday, April 2, 2020. The coronavirus outbreak has triggered a stunning collapse in the U.S. workforce with 10 million people losing their jobs in the past two weeks and economists warn unemployment could reach levels not seen since the Depression, as the economic damage from the crisis piles up around the world. (AP Photo/Paul Sancya)\nWASHINGTON (AP) — Nearly 10 million Americans have lost their jobs and applied for unemployment benefits in the past two weeks — a stunning record high that reflects the near-complete shutdown of the U.S. economy.\nJob losses related to the coronavirus are sure to rise further in coming weeks, with economists saying the U.S. unemployment rate could reach as high as 15%, well above the 10% peak during the Great Recession. As recently as February, the unemployment rate was just 3.5%, a 50-year low.\nFor those who have suddenly lost jobs, it’s a frightening time. Bill need to be paid. Do they qualify for unemployment benefits? How fast will the money arrive?\nHere are some questions and answers:\nHOW CAN I GET UNEMPLOYMENT BENEFITS?\nWorkers who have lost their jobs or income through no fault of their own should immediately file a claim for unemployment aid through their state labor departments . The benefit program is administered by state agencies. Most states are encouraging people to request benefits online or, if necessary, over the phone.\nI’VE HEARD THE SYSTEM IS OVERWHELMED BY REQUESTS.\nYes, some state websites have crashed. Phone lines have been jammed as the number of people seeking jobless aid has far surpassed all previous records. And the eligibility guidelines have changed. New York state, for example, received 8.2 million calls last week — more than 150 times the usual volume.\nStill, people who have lost jobs or whose income has been hurt by coronavirus should keep trying. Many states are bringing on extra workers to handle the crush of applications and are expanding the hours when they accept calls. While it may take several weeks to process a claim, benefit payments will be retroactive: Eligible workers will receive benefits from the date they lost their jobs, regardless of when they file.\nHOW CAN I MAKE THE PROCESS OPERATE MORE SMOOTHLY?\nHave all your information ready. This includes contact information for all your employers from the past 18 months, your Social Security number and documentation of your income, such as from tax forms or pay stubs.\nHOW LARGE ARE THE UNEMPLOYMENT AID CHECKS?\nThey vary sharply by state. Mississippi provides the lowest amount, $235 a week. Massachusetts pays $823 a week, the highest.\nI HEARD THE FEDERAL GOVERNMENT IS PROVING AN EXTRA $600 A WEEK.\nYes. But because that additional money is being paid by the federal government through a new program, rather than by the states’ regular benefits program, you may not receive it as quickly. And state unemployment offices may not be able to answer questions about it just yet.\nI’M SELF-EMPLOYED. WILL I QUALIFY?\nYes, that is one of the changes made by the $2.2 trillion economic rescue package signed into law by President Donald Trump last week. If you are self-employed, a contractor or a gig worker, you are now eligible to claim unemployment benefits. Still, some states, like New Mexico, are not yet set to process claims from groups of people who didn’t qualify in the past.\nI WASN’T LAID OFF, BUT MY EMPLOYER CUT MY HOURS. WILL I QUALIFY FOR BENEFITS?\nYes, you should apply. State rules differ, and it depends how large your income loss is. But in some states, workers whose hours have been sharply cut may be able to claim benefits that would make up for at least some of the lost income. Generally, if your lost pay exceeds what you would receive in unemployment benefits, you may be eligible for aid.\nI HAD TO LEAVE WORK BECAUSE OF THE CORONAVIRUS BUT WASN’T LAID OFF. WHAT ABOUT ME?\nYou can potentially receive benefits, too. The U.S. Labor Department said states can make unemployment benefits available to people who are quarantined, who left work because of risk of exposure or to care for a family member.\nThat said, someone who receives paid sick leave or paid family leave is often still receiving full pay. So according to the Labor Department, that person is not “unemployed” and does not qualify for unemployment benefits.\nWHAT ABOUT THOSE $1,200 CHECKS THE GOVERNMENT IS SENDING OUT? WHEN WILL I GET MINE?\nThe federal rescue package provides a one-time payment of $1,200 for all Americans earning less than $75,000 a year. This money is totally separate from unemployment benefits — and for the jobless, will be in addition to unemployment aid. It will likely be a critical lifeline for many Americans.\nThe payments begin to phase out at above $75,000 for individuals and $150,000 for couples filing jointly and drop to zero for individuals above $99,000 and couples earning $198,000. For heads of household with one child, the benefit starts to decline at $112,500 and falls to zero at $146,500. Even those who just receive Social Security or other government benefit programs can receive a check.\nA congressional memo obtained by the Associated Press said about 60 million Americans will receive the checks through direct deposit, starting the week of April 13. Those payments will go to households that have filed taxes in 2018 or 2019 and that provided the IRS with direct deposit information. For everyone else, checks will be mailed beginning May 4. The paper checks will be issued at a rate of about 5 million a week, which means it could take up to 20 weeks to distribute all the checks. That timeline would delay some checks until the week of Aug. 17.\nHOW LONG WILL UNEMPLOYMENT BENEFITS LAST?\nThe duration varies by state. But the federal relief package adds 13 weeks of coverage for people who have exhausted their existing jobless benefits. Under the emergency legislation, people who exhaust both regular and extended benefits will become eligible for Pandemic Unemployment Assistance. People can receive a maximum of 39 weeks of benefits this year from all three sources combined.\nWHAT ABOUT GOVERNMENT AID FOR COMPANIES? CAN THAT HELP ME?\nIt might. Small businesses will be eligible for loans that will be forgiven if they keep or rehire people they have laid off. Those loans will be available starting Friday, according to the Treasury Department. Airlines should also receive financial aid that is intended to prevent layoffs.\n___\nSell reported from Portland, Oregon.", "url": "https://apnews.com/af69fa95dee18483801959a025aa1768"}