{"authors": [], "date_download": "2020-05-04 20:14:26", "date_modify": "2020-05-04 20:14:26", "date_publish": "2020-04-08 22:31:31", "description": "BELLAIRE, Mich. (AP) — Northern Michigan set up roadside pantries in efforts to help neighbors during the coronavirus pandemic, including stocking Little Free Libraries with food and supplies...", "filename": "_110db3a7fd701514ee7012f49440b7b7_1588623266.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_110db3a7fd701514ee7012f49440b7b7_1588623266.html", "title": "Roadside pantries created to aid communities amid COVID-19", "title_page": "Roadside pantries created to aid communities amid COVID-19", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BELLAIRE, Mich. (AP) — Northern Michigan set up roadside pantries in efforts to help neighbors during the coronavirus pandemic, including stocking Little Free Libraries with food and supplies instead of books.\nThe roadside pantry idea was inspired from a similar effort by an Indiana man who wanted to support college students in his town, the Traverse City Record-Eagle reported.\n“It’s a positive reflection of the community’s good will,” said Brian Adams, owner of The Stone Oven where one of the Little Free Libraries outside the restaurant was transformed into a free pantry.\nLittle Free Library is a nonprofit organization that promotes neighborhood book exchanges, usually in the form of a public bookcase. Communities have begun filling them with food items and household supplies like cleaners and bathroom tissue instead of books.\nRoger Rainey, who stocks the roadside food pantry in Bellaire said only has one rule: take what you need, but eat what you take.\nFollowing a similar effort, an outreach ministry at Bear Lake Christian Church, has created a “share shack” food pantry in its parking lot, available 24/7 for those who need help and those who wish to donate to others.\n“It is our sincere prayer that this may in some small way alleviate some of the stress families are feeling during this difficult time in our community by helping to meet one of the basic needs of all people — the need for food,” said Rev. Scott Hoffer.\nIn Leelanau County, a free pop-up food share was set up under a farmer’s market tent outside Pegtown Station in Maple City.\nOrganizer Kelly Kieft said the food donations arrive at her home, then are sealed into clear bags and quarantined for at least four full days before being delivered to the self-service tent.\n“The last thing we want is for this to be a vector for coronavirus,” Kieft said.", "url": "https://apnews.com/110db3a7fd701514ee7012f49440b7b7"}