{"authors": ["Kristen Rogers"], "date_download": "2020-05-04 16:08:25", "date_modify": "2020-05-04 16:08:25", "date_publish": "2020-04-02 16:03:04", "description": "As we live through a developing pandemic, some of us can't help but compare it to the 2011 American thriller which some claim predicted Covid-19: \"Contagion.\"", "filename": "2020_04_02_movies_contagion_5ebf25f3bc71511785b73c4b1e379d38_index_1588608505.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200326161717-01-contagion-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_movies_contagion_5ebf25f3bc71511785b73c4b1e379d38_index_1588608505.html", "title": "'Contagion' vs. coronavirus: Film and fact", "title_page": "'Contagion' vs. coronavirus: Film and fact - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As we live through a developing pandemic , some of us can't help but compare it to the 2011 American thriller which some claim predicted Covid-19: \"Contagion.\"\nDirected by Steven Soderbergh and written by Scott Z. Burns, the film follows the spread of a virus transmitted when sick humans touch surfaces and leave virus behind that others can catch. Next comes the frantic attempts by public health officials to identify and contain the disease, the anarchy that unfolds amid a pandemic, and the ultimate introduction of a vaccine to stop the spread. Sound like a plot we're in the middle of?\nIts prescience was bolstered by Burns consulting with representatives of the World Health Organization on the ins and outs of infectious diseases, and by Kate Winslet working with the US Centers for Disease Control and Prevention to understand the lifestyle and character of an epidemiologist charged with leading the world through crisis.\nThe filmmakers also consulted medical experts including Dr. W. Ian Lipkin and Lawrence \"Larry\" Brilliant. Lipkin is the director of the Center for Infection and Immunity at Columbia University Mailman School of Health. He recently contracted the novel coronavirus.\nLaurie Garrett also served as a consultant on the film because she wrotethe 1994 book \"The Coming Plague\" and reported on multiple pandemics. In a 2001 article she wrote for CNN , Garrett described \"Contagion\"as \"part fantasy, part reality and totally possible.\"\nHere is how the virus and drama of \"Contagion\" compares with the real life coronavirus pandemic as it currently stands.\nVirus origins\nThe final scene in \"Contagion\" reveals that the fictional \"MEV-1\" virus originated from a pig that ate a piece of banana dropped by an infected bat escaping the destruction of its palm tree forest habitat in China.\nThat pig is then slaughtered and prepared by a chef who, without washing them first, shakes hands with Beth Emhoff (played by Gwyneth Paltrow), thus transmitting the virus to her. Emhoff becomes the \"index case,\" meaning she was the first identified case.\nBeth Emhoff (Gwyneth Paltrow) is considered the index case in \"Contagion,\" here seen transmitting the virus to another patient.\nThe origin of the novel coronavirus terrorizing us today is still a mystery to scientists. It will only be solved if they're able to isolate the live virus in a suspected species (like in the movie), which can be difficult.\nto be the possible source of the coronavirus. However, like \"Contagion,\" bats are considered by some epidemiologists to be the possible source of the coronavirus.\nZoologists, ecologists and disease experts have told CNN that human behaviors -- such as destroying natural habitats -- might be to blame for the transfer of the disease.\nWhen bats are stressed, which can occur from destruction of their habitats, their typically strong immune system is challenged, which makes it harder to cope with pathogens they could usually fight off. This allows an increase in infections and the shedding of them.\nIn \"wet markets,\" wild animals that also may be infected and stressed are held together and sold as food or pets, leading to a mix of viruses and species. One theory on the origin of the current coronavirus is that the initial epicenter was likely a \"wet market\" in Wuhan, China.In \"wet markets,\" wild animals that also may be infected and stressed are held together and sold as food or pets, leading to a mix of viruses and species.\nAny \"zoonotic spillover,\" or the transfer of disease from animals to humans, is exacerbated by population density and public transport, which make it easy for a virus to spread rapidly.\nScientists studying the spread of the coronavirus have provided another theory: It may have spread into humans from animals in a less deadly form and circulated at low levels in humans for years before adapting to us and becoming seriously infectious, according to recent research published in the journal Nature Medicine.\nIf the \"Contagion\" bats were under stress from the palm tree destruction, the origin of the \"Contagion\" virus could mirror the potential origin of the current coronavirus.\nSimilar symptoms\nSick people in the film experienced fevers and profuse sweating, pounding headaches, sore throat and cough but also had seizures, dizziness and frothed at the mouth when they passed.\n\"Contagion\": A man in Hong Kong falls sick with MEV-1, the fictional virus.\nEmergency warning signs of Covid-19 include \"persistent pain or pressure in the chest,\" \"bluish lips or face\" -- indicating a lack of oxygen -- and sudden mental confusion, fatigue or inability to rouse.\nLess common symptoms of Covid-19 include those typically experienced during flu and cold: headaches, digestive issues, body aches and fatigue, and a runny nose, sore throat and sneezing.\nAnosmia, a lack of sense of smell, and dygeusia, a lack of taste, are symptoms that might flag Covid-19 in its early stages among patients with a mild case.\nTransmission\nLike Covid-19, the film's MEV-1 is a respiratory disease, carried in expelled droplets of saliva from a sneeze or cough or other secretions. It spreads directly between people when those droplets reach the eyes, nose or mouth of an uninfected person.\nThe film's virus is also transmitted by fomites, or surfaces that have been contaminated with infections after sick humans touch them.\nThe spreading of MEV-1 is exacerbated by the average person touching their face a few thousand times per day -- while in between, they're touching door handles, elevator buttons, subway poles and each other.\nEvidence shows that the novel coronavirus transmits through the same mechanisms, according to the World Health Organization.\nActors from \"Contagion\" recently urged people to \"control the contagion\" by washing their hands, practicing social distancing and following the advice of health experts In a series of PSAs from Columbia Public Health.\nCan you be immune to the virus?\nThe fictional Mitch Emhoff (played by Matt Damon), husband of index case Beth, is found to be immune to the virus. He dodges the deliberately targeted coughs of strangers in grocery stores and survives through the film physically unscathed.\nToday, there are no reports of people biologically immune to getting the novel coronavirus. But can one be immune to the novel coronavirus after recovering from it? Scientists aren't sure yet.\nIn the March 26 CNN Global Town Hall: Coronavirus Facts and Fears, CNN anchor Anderson Cooper asked physician Dr. Leana Wen whether a person can be immune to the virus via antibodies they developed after having and recovering from the disease.\n\"This is what we want to get to,\" she responded. \"We don't have that test yet. It's being developed. But that would be great. It would be so helpful for people to know whether they have immunity.\"\nAnd if someone could be immune, we don't yet know how long it could last for.\n\"There are some people who speculate that one might have immunity for a long time, even forever, but we just don't know yet,\" she added.\nThe R0\nThe number of people a sick person is likely to infect is called the R0, or R-naught, of a virus. The R0 of the fictional MEV-1 virus was 4, while the R0 of coronavirus is 2.2, according to a recent study of data from the first cases of Covid-19 in Wuhan and investigations conducted by Chinese and American health officials.\nThey found the epidemic doubled about every seven days. In other words, on average, each Covid-19 patient transmits the infection to an additional 2.2 people.\nThe mortality rate\nThe mortality rate of the \"Contagion\" virus, or the percentage of those that die among an infected population, was estimated to be about 25% to 30%.\naccording to the As of March 26, the mortality rate among patients with Covid-19 is between 1.8% to 3.4%,according to the CDC\nAn unproven remedy: Forsythia vs. chloroquine\nIn \"Contagion,\" blogger Alan Krumwiede (Jude Law) pushes forsythia, a floral homeopathic tincture, as the cure for the virus, although studies hadn't proved it worked.\nHe appeared to have recovered from the virus shortly after taking forsythia, and anxious customers clamored for prescriptions of the remedy from their local pharmacies as well as on Krumwiede's blog. He attracted more 12 million followers and several million dollars from the false claim, according to the film.\nLaw, in the production notes for the film , described his character as the \"'index patient' for what becomes a parallel epidemic of fear and panic\" based on mistrust of news media, the government and health officials.\nAlan Krumwiede (Jude Law) is a blogger who is skeptical of the government and news media and touts an unproven remedy for the virus.\nThere are currently no cures or vaccines for Covid-19, yet the drugs chloroquine and its analog hydroxychloroquine have been called \"game changers\" by President Donald Trump. Both drugs are approved by the US Food and Drug Administration to treat malaria and other conditions such as rheumatoid arthritis and lupus.\nA man living in Phoenix died and his wife was in critical care after the two took a non-pharmaceutical version of chloroquine in an attempt to prevent contracting the virus. His wife said he heard Trump tout the drug in a news conference.\nOn March 29, the FDA issued a limited emergency use authorization for chloroquine and hydroxychloroquine to treat patients hospitalized with Covid-19.\nDespite limited evidence on the efficacy of the drugs for Covid-19, the US Department of Human Health Services said in a statement that anecdotal reports suggest they may be beneficial in the treatment of hospitalized patients. The FDA said the benefits outweigh the risks.\nA path toward a vaccine\nIn \"Contagion,\" CDC research scientist Dr. Ally Hextall (Jennifer Ehle) stresses that it can take months, maybe a year, to be able to distribute a vaccine after testing, clinical trials, manufacturing and distribution. However, Hextall speeds up the process by inoculating herself with the final experimental vaccine, then is able to provide doses for human use in just several months.\nFictional CDC research scientist Dr. Ally Hextall leads testing of a MEV-1 vaccine.\nIn reality, leading infectious disease experts say the typical vaccine takes between 8 and 10 years to develop. American health officials are trying to fast track that time frame, as are laboratories around the world.\nDr. Peter Hotez, a leading expert on infectious disease and vaccine development at Baylor College of Medicine, Currently a year to 18 months is an optimistic time window for a possible coronavirus vaccine,Dr. Peter Hotez, a leading expert on infectious disease and vaccine development at Baylor College of Medicine, previously told CNN\nThat said, a novel coronavirus vaccine Phase I trial in the US gave the first dose to test the safety of the vaccine to a participant in March. This trial is meant to establish that the vaccine is safe and that participants immune systems respond well, but proving the vaccine effectively prevents infection will take many more months.\nLife as we haven't known it\nIn \"Contagion,\" civil unrest rips at the fabric of society, leaving banks and grocery stores ransacked. Police seemed unable to respond to crime, as martial law prohibited travel between states to stop the spread of the virus.\nThat hasn't happened in real life. But, as in the film, a lot of us have spent weeks separated from friends, family and places we love, wondering when the pandemic will end so we can get back to life as we've known it. People are under variations of restrictions on movement, including social distancing guidelines, shelter-in-place and stay-at-home orders. On March 29, Trump extended social distancing guidelines to April 30.\nIn one of the final scenes of the film, after successful distribution of vaccines, people wait in an airport to board their flight. Some still wear masks, but when a man in line drops something, the man behind him touches his shoulder to catch his attention, then leans down to pick the item up for him. The man seems grateful. Naivety? Or, maybe it's a sign that the worst is behind them.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nFictional CDC head Dr. Ellis Cheever (Laurence Fishburne) gives the son of a CDC custodian his own intranasal vaccine near the end of the film. The boy hesitantly shakes Cheever's hand, expressing his gratitude.\n\"You know where this comes from, shaking hands?\" Cheever asked. \"It was a way of showing a stranger that you weren't carrying a weapon in the old days. You offered your empty right hand to show that you meant no harm.\"\nIf there are any concrete takeaways \"Contagion\" offers us, it's a reminder to stop touching your face, and a beacon of hope that this too shall pass.\nWe can only hope we will one day be able to reach out and touch again, thankful that our pandemic is over.", "url": "https://www.cnn.com/2020/04/02/movies/contagion-movie-versus-coronavirus-scn-wellness/index.html"}