{"authors": ["Jamie Stengle", "Jake Bleiberg"], "date_download": "2020-05-04 20:04:47", "date_modify": "2020-05-04 20:04:47", "date_publish": "2020-04-07 17:36:10", "description": "DALLAS (AP) — Two Texas prisons have been locked down to slow the spread of the coronavirus, while inmates at other facilities are making masks to fight the pandemic. Nearly 1,000 people...", "filename": "_a41f06ed5ca29c8530a4420f8f636e8e_1588622687.html", "image_url": "https://storage.googleapis.com/afs-prod/media/fa1de9f0731c493a9cec97a1b870f9b2/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a41f06ed5ca29c8530a4420f8f636e8e_1588622687.html", "title": "Texas prisoners lock down, make masks to fight coronavirus", "title_page": "Texas prisoners lock down, make masks to fight coronavirus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sparkling Clean Professional Exterior Cleaning & Restoration owner Carlos Sanchez uses a sanitizing solution on the Woldert Park playground in Tyler, Texas on Friday, April 3, 2020. Sanchez offered to clean the city's playgrounds for free to support the community during the coronavirus pandemic. (Sarah A. Miller/Tyler Morning Telegraph via AP)\nSparkling Clean Professional Exterior Cleaning & Restoration owner Carlos Sanchez uses a sanitizing solution on the Woldert Park playground in Tyler, Texas on Friday, April 3, 2020. Sanchez offered to clean the city's playgrounds for free to support the community during the coronavirus pandemic. (Sarah A. Miller/Tyler Morning Telegraph via AP)\nDALLAS (AP) — Two Texas prisons have been locked down to slow the spread of the coronavirus, while inmates at other facilities are making masks to fight the pandemic.\nNearly 1,000 people have been confined to their cells on medical restriction at the Rufe Jordan Unit, in the Texas Panhandle, along with more than 1,100 at the Dr. Lane Murray Unit, according to the Texas Department of Criminal Justice. As of Monday, one person had tested positive for COVID-19 at Jordan and four had at Murray, a women’s prison about 100 miles (160 kilometers) north of Austin.\nMeanwhile, the number of coronavirus cases and deaths continued to grow in Texas, with more than 8,200 infections and 154 deaths, state officials said Tuesday.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia.\nMASK MANUFACTURING\nAll Texas prisoners on medical restriction were confined to their cells Sunday, said TDCJ spokesman Jeremy Desel. Restricted prisoners receive medical checks twice a day and can be moved off restricted status based on the time that’s passed since they were potentially exposed to the disease, he said.\nAmerica’s largest state prison system has had 19 prisoners and 28 employees or contractors test positive for COVID-19. More than 4,800 people were locked in on medical restriction as of Monday.\nInmates in 10 other Texas prison factories are making cotton masks that staff and prisoners can wear to help reduce the spread of the virus, according to the department. About 50,000 masks have been distributed from prison factories that typically manufacture shoes, clothing, mattresses and furniture.\nThe prison factories are making up to 20,000 masks a day. They are also producing plastic face masks.\nAll personnel working at prison units will have to wear the cotton masks. They will be optional for those in administrative jobs and parole officers in the field.\nInmates in medical restriction areas also have to wear the masks.\nCORRECTIONS OFFICER DIES\nA 49-year-old state corrections officer died Monday after testing positive for COVID-19 while hospitalized for a heart condition.\nThe Texas Department of Criminal Justice said Tuesday that it was investigating whether the disease contributed to Kelvin Wilcher’s death. No one else at the Estelle Unit prison in Huntsville where he worked has tested positive, the agency said.\nVOTING IN A PANDEMIC\nThe Texas Democratic Party filed a lawsuit that aims to ensure any voter can cast a mail-in ballot during the pandemic.\nTexas Democratic Party Chair Gilberto Hinojosa said neither Republican Gov. Greg Abbott nor Secretary of State Ruth Hughs have issued “concrete guidance” to county officials on mail-in ballots.\nThe lawsuit says a state advisory that envisions more residents voting by mail says a voter must have a qualifying reason. Those reasons include being away from their county, age 65 or older, sick, disabled or jailed. State law says a disability includes a condition that prevents a person from going to a polling place without a likelihood of injuring the voter’s health.\nThe lawsuit notes that historically most residents have voted in person, but the upcoming primary runoffs and November general elections are “certain” to be influenced by the pandemic.\nMarc Rylander, a spokesman for the Texas Attorney General’s Office, said state Democrats are trying “to distract Texas officials from the public health crisis and hoodwink courts into changing Texas election laws.”\nHe said, “We will vigorously defend against this frivolous lawsuit.”\nSTATE PARKS CLOSED\nThe Texas Parks and Wildlife Department announced that parks would close at the end of the day Tuesday because people were not practicing social distancing and they were struggling to keep parks sanitized.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/a41f06ed5ca29c8530a4420f8f636e8e"}