{"authors": ["Jazmin Goodwin", "Laura He", "Charles Riley", "Cnn Business"], "date_download": "2020-05-04 16:51:06", "date_modify": "2020-05-04 16:51:06", "date_publish": "2020-04-07 23:06:51", "description": "Asia Pacific markets were volatile Wednesday, following losses on Wall Street as investors continue to look out for more signs of economic damage from the coronavirus pandemic.", "filename": "2020_04_07_investing_global-stocks_index_1588611066.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407180049-nyse-0405-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_investing_global-stocks_index_1588611066.html", "title": "Global stocks and US futures retreat on coronavirus caution", "title_page": "Global stocks and US futures retreat on coronavirus caution - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York/Hong Kong/London (CNN Business) Global stocks and US futures lost ground Wednesday as economic damage from the coronavirus pandemic continued to mount.\nHong Kong'sfell 1.2% and China'sdropped 0.2%, while benchmark indexes in Australia and South Korea also retreated. Japan'sbucked the trend, finishing with a gain of over 2%.\nIn Europe, Franceshed 1.8% in early trading, while Germany'slost 1%. Thedropped 1.6% in London.\nUS stock futures were slightly lower after declines Tuesday on Wall Street.andfutures were all down by less than 0.2%.\nCaution has once again taken hold as investors weigh the effects of the pandemic, said Jingyi Pan, a strategist for IG Group.\nGermany's top economic research institutes said Wednesday that Europe's biggest economy is likely to shrink by 4.2% this year. It expects a contraction of 9.8% in the current quarter, which would be the sharpest decline recorded since record keeping began in 1970.\nThe dire prediction came as France's central bank estimated the country's economy shrank by around 6% in the first three months of the year. The central bank said the last contraction of a similar magnitude came in the second quarter of 1968, when weeks of demonstrations and general strikes sharply curtailed economic output.\nThere are some signs of progress in fighting the pandemic.\nThis week is also a shortened one for many stock exchanges. Those in the United States, Europe, Hong Kong, and Australia will close later this week for the Easter holiday.\nUS crude futures settled Tuesday sharply lower at $23.63 a barrel, down 9.4% from the previous day. Futures rebounded 2.8% on Wednesday to trade at $24.29 a barrel.\nBrent crude — the global benchmark — was little changed at $31.91 a barrel.\nThe moves come ahead of an OPEC meeting with Russia on Thursday to discuss oil production cuts in response to plummeting demand and to deescalate a price war.\n— Anneken Tappe contributed to this report.", "url": "https://www.cnn.com/2020/04/07/investing/global-stocks/index.html"}