{"authors": ["Edith M. Lederer"], "date_download": "2020-05-04 20:20:42", "date_modify": "2020-05-04 20:20:42", "date_publish": "2020-04-15 03:45:26", "description": "UNITED NATIONS (AP) — The U.N. envoy for Colombia said Tuesday that former combatants are now making face masks to respond to the new coronavirus pandemic, but COVID-19 hasn’t stopped violence...", "filename": "_c416aee1f174f48f5ec8f9b65a213c75_1588623642.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c1965da4d7de41a1a77bfaf2739ed493/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c416aee1f174f48f5ec8f9b65a213c75_1588623642.html", "title": "UN Colombia envoy: ex-combatants making masks amid pandemic", "title_page": "UN Colombia envoy: ex-combatants making masks amid pandemic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A woman wearing a protective face mask walks next to a house painted with colors of Colombia's flag, during the lockdown ordered by the government in an effort to prevent the spread of the new coronavirus, in Bogota, Colombia, Tuesday, April 14, 2020. (AP Photo/Fernando Vergara)\nA woman wearing a protective face mask walks next to a house painted with colors of Colombia's flag, during the lockdown ordered by the government in an effort to prevent the spread of the new coronavirus, in Bogota, Colombia, Tuesday, April 14, 2020. (AP Photo/Fernando Vergara)\nUNITED NATIONS (AP) — The U.N. envoy for Colombia said Tuesday that former combatants are now making face masks to respond to the new coronavirus pandemic, but COVID-19 hasn’t stopped violence against social leaders, human rights defenders and ex-fighters despite a nationwide stay-at-home order.\nCarlos Ruiz Massieu told a video meeting of the U.N. Security Council that three social leaders and three former combatants were killed in recent weeks, bringing the number of ex-combatants killed since the government signed a peace agreement with Colombia’s main rebel group, the FARC, in 2016 to 195.\nHe urged the government “to adopt all necessary measures to protect social leaders, human rights defenders and former combatants.”\nOn a positive note, Ruiz Massieu said the National Reintegration Council approved three new collective projects on April 2 including a textile cooperative led by 22 former combatants — 11 men and 11 women — which has begun producing face masks to respond to COVID-19. He said eight other former combatants’ cooperatives have also initiated efforts to make face masks.\nIn response to Secretary-General Antonio Guterres’ call for a global cease-fire to tackle the pandemic, the U.N. envoy said the National Liberation Army, known by its Spanish acronym ELN, which is one of Colombia’s last remaining rebel groups, declared a month-long unilateral cease-fire in April.\nHowever, Ruiz Massieu said, “armed clashes continue between illegal armed groups in several departments.”\nColombia’s Foreign Minister Claudia Blum told the council the cease-fire by the ELN is actually partial “because they claim they would attack in certain cases.”\nShe reiterated President Ivan Duque’s statement “that the ELN must demonstrate its commitment to peace through concrete actions such as the release of kidnapped citizens and the cessation of any criminal act.”\nU.S. Ambassasdor Kelly Craft and many other Security Council members echoed the U.N. envoy in urging the government to take action to end the killing of ex-combatants, social leaders and human rights defenders.\n“Criminal groups have targeted several high-profile social leaders in recent weeks, coinciding with the onset of COVID-19,” Craft said. “Ending this violence is essential, and those responsible must be held accountable.”\nBlum stressed that a government priority is the safety of former combatants and their families and members of the FARC political party.\nMore than 3,700 police and military are protecting ex-combatants settled in former training and reintegration areas, and a special unit protects another 300 former fighters “with solid security schemes,” she said.\nThe government is working on other measures to strengthen protection and security, Blum said, and the attorney general’s office has made progress in investigating 102 events in which ex-combatants were victims, out of 223 reported since 2017.\nShe said 24 convictions were formalized and 178 arrest warrants were issued for murder, attempted murder, and forced disappearances, including for 51 alleged “intellectual authors” of crimes.\n“To put and end to these crimes and threats,” Blum said, the government is also acting against organized armed groups dedicated to drug trafficking and illegal mining.\nRuiz Massieu, the U.N. envoy, said “COVID-19 is and will continue affecting the implementation of the peace agreement” but all parties have an obligation to ensure progress on fulfilling it.\n“Colombia cannot be, should not be, a casualty of this pandemic,” he said.", "url": "https://apnews.com/c416aee1f174f48f5ec8f9b65a213c75"}