{"authors": ["Jeffrey Sachs"], "date_download": "2020-05-04 16:12:54", "date_modify": "2020-05-04 16:12:54", "date_publish": "2020-04-03 03:23:58", "description": "Jeff Sachs writes that our best hope for saving lives and restoring economic activity is to bring the number of active coronavirus cases down sharply through the temporary lockdowns across the nation while rapidly building our public health containment system for the post-lockdown phase.", "filename": "2020_04_02_opinions_coronavirus-end-pandemic-opinion-sachs_index_1588608774.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402181407-trump-coronavirus-test-briefing-04022020-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_opinions_coronavirus-end-pandemic-opinion-sachs_index_1588608774.html", "title": "How US can keep death toll far below the 100,000 projection", "title_page": "How US can keep coronavirus death toll far below the 100,000 projection (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Jeffrey Sachs is a professor and director of the Center for Sustainable Development at Columbia University. The opinions expressed in this commentary are those of the author; view more opinion articles on CNN.\n(CNN) On Tuesday, the White House projected an alarming possibility: Between 100,000 and 240,000 Americans could die from the Covid-19 pandemic , despite the efforts in place to minimize the spread of the disease. Yet these 100,000 to 240,000 deaths are not inevitable. Far from it. As of Thursday night there have been around 5,850 to date in the US, and of the 242,000 active cases, unfortunately several thousand are likely to die. But the US could still keep the death toll well below 100,000. It all depends on our public policy, and especially on our public health system.\nWe are now fighting the disease in intensive care units and through lockdowns, but that's because the US missed the early chance to take sufficient containment measures through testing, isolating, and contact tracing of individual cases. The federal government was grossly unprepared to handle the rapidly spreading infection, and so were the states and cities, which relied heavily on the federal government. The pandemic engulfed the country before governments at all levels recognized the dire emergency. By that time, the public health containment systems were overwhelmed by tens of thousands of confirmed cases, and many times more untested and unconfirmed infections.\nNow, our best hope for saving lives and restoring economic activity is to bring the number of active cases back down sharply through the temporary lockdowns across the nation while rapidly building our public health containment system for the post-lockdown phase.\nIf lockdowns are able to prevent further viral spread, and they should be able to do so if properly enforced and managed-- which is not yet the case in many parts of the country -- the number of active cases will fall sharply, mostly through recoveries but also through tragic deaths. But when the infection rate drops, and the economy as well as our daily lives are enabled to gradually restart, we will need to contain the infectious cases that will remain in circulation, so as not to allow the pandemic to resurge.\nThe spread of the pandemic can be understood using a simple numerical example. The numbers in this illustration are not precise, as they will vary place to place and as there is still much that is not known about the spread of the disease.\ntimeline laid out in current studies. Let's call today day one. Suppose an individual, we'll call him Jack, becomes infected through contact with a person who caught the virus a few days earlier. Jack becomes infectious to others on day four, but without symptoms appearing on that day. The symptoms, such as coughing, difficulty breathing and fever, begin on day five and Jack remains infectious and in the community through day nine. At that point most individuals recover or at least become much less infectious to others. The unlucky ones end up in hospital and in the most severe cases, die. Such numbers will vary by case, but are broadly in line with the\nDuring days four through nine, Jack circulates in the community, especially if his symptoms are on the mild side, potentially passing the infection to others. Let us say that he makes on average 16 daily contacts with others, some briefer, some longer. Most of those contacts don't infect the other person, but every once in a while the contact does infect the other person, at work, in the theater, across the dining room table, or in some other place.\nJack is infectious to others for six days (during days four to nine), during which he makes 96 contacts in total, and infects 2.4 other individuals (the reproductive number, or the number of secondary infections generated from one infected person, of the novel coronavirus -- is thought to be between two and 2.6, according to models from Imperial College ). In this scenario, that comes out to about 40 contacts for every one infection, again a rough number broadly consistent with the evidence about the rate of disease transmission.\nThere are two main ways to stop the pandemic. The first way -- the approach now widely used around the country -- is through an economic lockdown and \"shelter in place.\" By deliberately closing down most businesses, the daily contacts per person fall. Suppose that falls by more than half, say to six per day. Over six days, Jack now only makes 36 contacts rather than 96, and as a result now infects on average less than one other person.\nThis is why the lockdown works, if it is enforced. Over time, the number of infected people declines as those currently infected recover, followed by the smaller number of people they have infected. The lockdown policy, however, comes at a high short-term cost. Daily life and the economy are put on hold. Incomes, jobs, tax revenues, and businesses could collapse during the lockdown.\nThere is a much better way -- when it is feasible. Suppose that on the evening of day five, after two days of symptoms, Jack is visited by a public health worker who has conducted vigorous contact tracing. The health worker explains, \"We are here because your colleague at work developed a mild Covid-fever three days ago. Do you also have symptoms?\"\n\"Well, yes,\" comes Jack's reply. \"I woke up today feeling not so great, but thought I could shake it.\" The health worker is able to perform a diagnostic test and Jack remains isolated at home until the test confirms the Covid-19 infection. After a positive diagnosis, he is instructed to stay at home for the recommended stretch after his symptoms disappear.\nJack is informed that he will receive full sick pay as long as he sends a text message of his temperature every six hours and as long as he abides by self-isolation or, if he's not able to text, he will be visited daily by a community health worker to monitor his temperature and condition. He is also given an emergency call-in number and a website for food deliveries if necessary. The health worker leaves some face masks in case Jack must have any contacts with others, such as a family member or delivery service. The health worker also leaves a thermometer if one is needed.\nJack has been caught by the public health service after just two days of being infectious, and so will have made an average of only 32 contacts (16 contacts a day for two days), even less than the 36 contacts we've assumed he would make during 6 days of partial lockdown (six contacts a day for six days). This containment system can find a substantial proportion of symptomatic cases as long as the lockdown phase has done its job of repressing the pandemic.\nAnd for those the system does not catch, individuals themselves can step up their own response. Those with symptoms can call a Covid-19 hotline to arrange for a rapid diagnostic test at home or a pharmacy. The outcome should be the same: early isolation so as not to infect others. Of course, individuals should have guaranteed paid sick leave and free testing so that they can afford to self-isolate.\nThe newly scaled up public health system, augmented by heightened self-monitoring by the public at large, can keep ahead of new infections. If enough newly infected people are visited early on by public health workers, or go quickly into self-isolation before infecting other people, the pandemic will continue to slow and then stop. Other steps, such as wearing face masks, monitoring temperatures in crowded public places, and placing hand sanitizers in many locations, could also help.\nThere are many uncertainties and details. How fast can the system track and isolate infected individuals? What limits on big gatherings should remain to prevent \"super-spreading\" of the virus? Yet the basic logic should be clear: the lockdown phase must be followed by a containment phase based on the public health system. There's also the important factor of asymptomatic individuals, who, could make up as much as 25% of all infected individuals, according to the director of the Centers for Disease Control and Prevention.\nWhile some of these people may be caught by contact tracing and tested, others will not. To compensate for asymptomatic transmission, a high proportion of the symptomatic individuals must isolate early, either through contacts by the public health system or by their own initiative.\nEurope and the US did not have effective public health systems in place at the start of the pandemic. In contrast, some countries in East Asia, such as Singapore Hong Kong, and Taiwan, have highly effective public health systems, with experience after the 2003 SARS outbreak. By taking a proactive approach to testing and tracking the infection, and by promoting personal hygiene (such as hand washing) and widespread temperature monitoring, they by and large succeeded in isolating a significant share of infections. As a result, they have so far kept the confirmed cases per 1 million population far below the levels of the US and Western Europe.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook", "url": "https://www.cnn.com/2020/04/02/opinions/coronavirus-end-pandemic-opinion-sachs/index.html"}