{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:23:37", "date_modify": "2020-05-04 20:23:37", "date_publish": "2020-04-30 04:00:55", "description": "Grogan, who is also an influential member of the White House coronavirus task force, said he'll be relinquishing his post on May 24.", "filename": "entry_joe-grogan-resignation-domestic-policy-council-director-trump-coronavirus_n_5eaa3edac5b6edf4130e0d61_1588623817.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa44df240000f3018e9faf.jpeg?cache=7keovi6ylx&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_joe-grogan-resignation-domestic-policy-council-director-trump-coronavirus_n_5eaa3edac5b6edf4130e0d61_1588623817.html", "title": "Joe Grogan, Trump's Top Domestic Policy Aide, Leaving White House Next Month", "title_page": "Joe Grogan, Trump's Top Domestic Policy Aide, Leaving White House Next Month | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Joe Grogan, President Donald Trump’s top domestic policy adviser and an influential member of the White House coronavirus task force, has announced his intention to resign from the Trump administration next month.\nGrogan, who currently serves as director of the White House Domestic Policy Council overseeing a wide range of issues, including health care and regulation, confirmed to The Wall Street Journal that May 24 would be his last day on the job.\nHe said he’s leaving the White House on good terms and that, despite reports of his repeated clashes with Health and Human Services Secretary Alex Azar, his departure “has nothing to do with Azar,” Politico reported. Azar himself has been the subject of speculation in recent weeks that the White House is mulling his potential ouster.\n“I promised my wife two years, and I’m in my fourth year. No one outworked me,” Grogan told Politico of his planned departure, adding that he’d had a “great conversation” about it with Trump and White House chief of staff Mark Meadows.\nNEWS: Top White House policy adviser Joe Grogan is leaving his post, the latest sign of turnover as the administration grapples with coronavirus. His resignation is effective May 24. w/@stepharmour1 https://t.co/sf4mDqHMHf — Rebecca Ballhaus (@rebeccaballhaus) April 29, 2020\nAs Politico noted, Grogan — who worked as a lobbyist for drugmaker Gilead prior to his time at the White House — has played a significant role in crafting major health policies, including drug pricing, for the Trump administration.\nMore recently he’s been closely involved in the administration’s efforts to stem the coronavirus pandemic. Grogan reportedly was among the first officials to warn the White House of the virus’s potential to disrupt American life.\nBack in January, Grogan warned the administration “to take the virus seriously or it could cost the president his reelection, and that dealing with the virus was likely to dominate life in the United States for many months,” The Washington Post reported last month.", "url": "https://www.huffpost.com/entry/joe-grogan-resignation-domestic-policy-council-director-trump-coronavirus_n_5eaa3edac5b6edf4130e0d61"}