{"authors": ["Por Mark Thiessen"], "date_download": "2020-05-04 20:09:49", "date_modify": "2020-05-04 20:09:49", "date_publish": "2020-04-09 20:23:02", "description": "ANCHORAGE, Alaska, EE.UU. (AP) — Nova Knight tiene 5 años y se toma muy en serio el mantener a salvo a otras personas durante la pandemia del nuevo coronavirus. Así lo dijo en un video que...", "filename": "_9259127fa92d4ef0b786b3542db03e28_1588622989.html", "image_url": "https://storage.googleapis.com/afs-prod/media/af809f4b8ab047bdb658c20f6daf5d2c/2861.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9259127fa92d4ef0b786b3542db03e28_1588622989.html", "title": "Consejos de niña de Alaska sobre COVID-19 llegan a Trudeau", "title_page": "Consejos de niña de Alaska sobre COVID-19 llegan a Trudeau", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nANCHORAGE, Alaska, EE.UU. (AP) — Nova Knight tiene 5 años y se toma muy en serio el mantener a salvo a otras personas durante la pandemia del nuevo coronavirus.\nAsí lo dijo en un video que la joven de Fairbanks, Alaska, realizó y que ha sido visto más de 18.000 veces, y que generó elogios del primer ministro canadiense Justin Trudeau.\n“Lamento que no puedan salir a jugar”, dijo Nova en el video del 26 de marzo. “No vayan a ningún lado. Y lávense las manos. Lo dijo en serio”.\nNova vive con sus padres, Robby y Rebecca Knight y su hermano Colton, de 2 años. La niña ofrece más consejos sobre cómo lavarse las manos en su video de 40 segundos, en el que exhorta a las personas a ver el video repetidamente para recordar qué hacer para mantenerse a salvo del virus.\n“Lo digo muy en serio, así que deberían ver este video todos los días”, resaltó.\nNova le dijo a su mamá que quería hacer el video después de que su tía, Jennifer Trevors en Halifax, Nueva Escocia, le enviara un video en el que Trudeau les agradece a los niños de Canadá por no salir a jugar y por hacer lo que les corresponde para frenar la propagación del virus.\nNova dijo que ella intentaba ver ese video todos los días, así que sabía qué hacer.\n“Y luego ella me preguntó, ‘¿Me podrías subir a Facebook Live? Hay algo que quiero decir’”, contó su madre. “Yo le dije, bueno, no traes pantalones así que no voy a subirte a Facebook Live, pero te grabaré un video”.\nNova no quedó satisfecha con la primera toma.\n“¿Podemos hacer una más?”, recordó Knight que su hija le preguntó. “No creo que sepan qué tan en serio lo digo”.\nRebecca Knight envió el video a su madre, Cindy Trevors de Miramichi, New Brunswick, Canadá. Al día siguiente, su madre le dijo que ella publicó el video a manera de comentario al tuit de Justin Trudeau del 27 de marzo en el que pedía a la gente que permaneciera en sus casas.\nTrevors escribió, “Mi nieta de cinco años hizo este video inspirada en las palabras que usted dirigió a los niños sobre el virus”.\nTrudeau respondió: “Grandioso recordatorio. Gracias por compartir este video, Cindy _por favor hágale saber a su nieta que me alegra que esté ayudando a difundir el mensaje. Espero que todos sigan su consejo y recuerden lavarse las manos y permanecer en casa. Porque ella tiene razón _esa es la manera en que todos nos mantendremos seguros”.\nNova quedó boquiabierta cuando se enteró que Trudeau respondió a su video.\n“Este es el mejor día de mi vida”, le dijo a su madre.\nOtros políticos compartieron el video por Twitter, agregó Knight.\nLa respuesta llevó a Nova a grabar otros dos videos. En uno, le muestra a la gente cómo lavarse las manos correctamente, incluyendo el uso de agua que “no esté muy caliente ni muy fría”. En su tercer video dice a las personas qué hacer para evitar propagar gérmenes y exhorta al distanciamiento social.\nKnight dijo que su hija “siempre ha sabido que desea hacer algo para ayudar a las personas”.", "url": "https://apnews.com/9259127fa92d4ef0b786b3542db03e28"}