{"authors": ["Parija Kavilanz", "Cnn Business"], "date_download": "2020-05-04 16:27:44", "date_modify": "2020-05-04 16:27:44", "date_publish": "2020-04-07 14:00:32", "description": "Social distancing is putting strains on religious communities, which thrive on human interaction, social gatherings and shared meals. That's why some houses of worship are seeking out innovative solutions to adapt religious observance to life in the pandemic.", "filename": "2020_04_07_business_prefilled-communion-cups_index_1588609664.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403104124-02-disposable-prefilled-communion-cups-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_business_prefilled-communion-cups_index_1588609664.html", "title": "Easter is here, and so are disposable, pre-filled Communion cups", "title_page": "Prefilled communion cups take off as churches adapt to social distancing  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Social distancing is putting strains on religious communities, which thrive on human interaction, social gatherings and shared meals. That's why some houses of worship are seeking out innovative solutions to adapt religious observance to life in the pandemic.\nIn the United States, the Chicago-based business Blessed Communion, which makes pre-filled disposable communion cups, has seen a deluge of orders ahead of Easter Sunday . The cups are sealed with grape juice at the bottom and a single wafer sealed in a separate compartment on top.\n\"Our phones have not stopped ringing in the last two weeks,\" said Israel Idonije, a former NFL player with the Chicago Bears who founded the company in 2009.\nIn February, the business was producing 300,000 of its pre-filled cups a day; in March that figure doubled to 600,000 daily, said Idonije. Blessed Communion manufactures the cups in a 15,000-square-foot facility for customers including churches, ministries, faith-based organizations and individuals around the world.\nThe surge in demand for the cups has coincided with the fast spread of the coronavirus pandemic.\nThere are at least 368,449 cases of coronavirus and at least 10,993 people have died according to Johns Hopkins University's tally of cases in the United States, which now has the most number of known cases of the virus. Globally, the novel coronavirus has infected more than 1.3 million people and killed over 69,000.\nSome churches in towns and cities that are on lockdown, with stay-at-home orders for all but essential workers, have also closed their doors. They're instead offering virtual services by live streaming them to their congregants. Idonije, whose parents were ministers, said his company is supporting both churches that are live streaming services and those that continue to have their doors open for mass but want to offer Holy Communion in a more sanitary way while maintaining social distancing.\nTypically, during traditional mass, congregants come forward one by one to take communion. The priest offers the Eucharist, a round wafer, either in their mouth or in their hand. During a special mass, such as Easter mass, they also offer wine from a shared cup.\nWith pre-filled communion cups, Idonije said congregants can still fully participate in mass. Some Church officials have deemed taking communion at home acceptable during the pandemic.\nBlessed Community has doubled production to 600,000 cups a day.\nTo keep up with demand, Idonije is prioritizing bulk orders \"of 250 to 500 cups,\" he said. (100 cups cost $24.97)\n\"We run a lean operation of 20 people. Our facility is still operating and we're taking all precaution to keep the facility sanitized and all employees protected,\" he said. The business takes in $2 million in annual sales and is profitable.\nWith many small businesses either shut down or shifting online, Idonije hopes to be able to keep producing the cups for as long as possible.\n\"We're considered an essential business so we've stayed open,\" he said. \"We're up to the task and faith is what we lean on in difficult times.\"\nParking lot services\nDisposable pre-filled communion cups, or \"Fellowship cups,\" for Methodist churches, have also exploded in popularity. Methodists, like Catholics, take communion.\n\"They've been around for a while, but are in significant demand now,\" said Blake Aldridge, executive director of marketing and ecommerce for Cokesbury. The Nashville, Tennessee, company has manufactured private-label supplies for Methodist churches since the late 18th century. It now supplies products to institutions affiliated with various faiths.\nCokesbury's pre-filled Fellowship cup sales soared 1,000% in March 2020 compared to March 2019.\n\"We keep running out of inventory and are restocking as fast as we can,\" said Aldridge.\nSome churches, he said, are mailing the pre-filled communion cups to their congregants so they have them ready for a livestreamed service.\n\"We've also heard of churches that are holding service in large parking lots and broadcasting the service over a radio station,\" said Aldridge.\nHe said congregants park at a safe distance from one another and participate via the radio channel and with their pre-filled communion cups.\n\"In a time of challenge, churches pull together to keep the community together,\" said Aldridge.", "url": "https://www.cnn.com/2020/04/07/business/prefilled-communion-cups/index.html"}