{"authors": ["Grace Sparks"], "date_download": "2020-05-04 16:58:22", "date_modify": "2020-05-04 16:58:22", "date_publish": "2020-04-09 15:00:44", "description": "Former Vice President Joe Biden holds a wide lead over President Donald Trump in the national race for the White House, according to a new CNN poll conducted by SSRS.", "filename": "2020_04_09_politics_cnn-poll-biden-trump_index_1588611502.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409100412-biden-trump-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_cnn-poll-biden-trump_index_1588611502.html", "title": "CNN poll: Biden leads Trump in national head-to-head matchup", "title_page": "CNN poll: Biden leads Trump in national head-to-head matchup - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Former Vice President Joe Biden holds a wide lead over President Donald Trump in the national race for the White House, according to a new CNN poll conducted by SSRS .\nBiden leads Trump 53% to 42% among registered voters, roughly steady from CNN's poll in early March . The nationwide picture shows Biden starts with an edge among voters generally, but national polling cannot address the state-by-state electoral college race which ultimately determines the presidency.\nThe coronavirus pandemic has drastically altered presidential campaigning. Biden and Trump have paused in-person campaign events, and states have pushed back primary elections until the summer months.\nBiden holds an edge over Trump as more trusted to handle several key issues, including the response to the coronavirus outbreak (52% to 43%), health care (57% to 39%) and helping the middle class (57% to 38%).\nBut Trump narrowly tops Biden on who would do a better job handling the economy, with 50% saying the President would and 46% saying Biden, despite a down tick in Trump's approval rating for handling the economy and a sharp rise in negative views of the nation's economy, according to data from the same poll released earlier this week.\nBiden's advantages on health care and helping the middle class are bolstered by crossover from those who approve of Trump -- around one in 8 Americans who give Trump positive reviews think Biden would do a better job than him on health care and helping the middle class.\nAnd even though very few Democrats defect from Biden on those two issues, the President's edge on the economy gets a boost from the 16% of Democrats who say Trump would do a better job than Biden on the issue.\nIn the general election match up, however, there is very little crossover support for either Biden or Trump among partisans: Biden is supported by 91% of Democrats, while Trump holds 96% of Republicans. Independent voters break for Biden, 52% behind the former vice president, 40% for Trump.\nThe demographic divides that defined the 2016 election seem likely to persist in 2020. Biden carries 62% of women to 32% for Trump, while Trump leads among men (51% to 44% for Biden).\nBiden performs well among voters of color, 72% of whom support him, while white voters break toward Trump (52% for Trump, 44% for Biden).\nAnd the poll suggests Biden holds a broad advantage among younger voters, who tended to be more supportive of Sanders in the Democratic primary fight. Among those under age 35, 62% back Biden, 31% Trump, while Trump's support is stronger among seniors (55% Trump to 42% Biden).\nAs calls for increased voting by mail rise amidst the coronavirus outbreak, most Americans say they think it is important for states to continue to offer in-person voting (54%). A sizable number (41%) would like to see November's vote go all mail. But there is a big partisan split behind those numbers: 57% of Democrats say all voting in the presidential election should be conducted by mail, just 28% of Republicans say the same.\nIndependents prefer offering some in-person voting, with 56% saying it's important that it is still offered and 40% saying go all mail.\nOn Friday at a White House press briefing, Trump denounced mail voting, saying it's easy to cheat. It was reported that Trump voted using mail ballot in 2018.\nWith the nation focused firmly on the coronavirus, enthusiasm for voting in the presidential election among registered voters has dipped down nine percentage points, from 66% who said they were extremely or very enthusiastic in March to 57% now. Overall enthusiasm is down more among Democrats than Republicans -- falling 12 points for Democrats, while remaining steady for Republicans. And as of now, those who say they support Trump are far more enthusiastic about voting (70%) than are those who back Biden (50%).\nBiden's path to the Democratic nomination has cleared since the poll fielded from Friday through Monday. His chief rival, Bernie Sanders, announced he was suspending his campaign on Wednesday. The poll found that before Sanders ended his bid, 65% of Democrats and Democratic-leaning independent voters backed Biden, while 30% backed Sanders.\nThe CNN Poll was conducted by SSRS April 3 through 6 among a random national sample of 1,002 adults reached on landlines or cellphones by a live interviewer. Results for the full sample have a margin of sampling error of plus or minus 3.7 percentage points. For the sample of 875 registered voters, it is 3.9 percentage points.", "url": "https://www.cnn.com/2020/04/09/politics/cnn-poll-biden-trump/index.html"}