{"authors": ["Jeff Amy"], "date_download": "2020-05-04 20:26:04", "date_modify": "2020-05-04 20:26:04", "date_publish": "2020-04-13 17:08:49", "description": "ATLANTA (AP) — The number of confirmed cases of the new coronavirus in Georgia crossed 13,600 Monday, while the number of deaths from COVID-19, the respiratory illness caused by the virus, rose to...", "filename": "_f1f96f1d44672a9ac6bbec13f58b9062_1588623964.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ebd5b6b1c90c48449d8d6280b5fc84ff/2792.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f1f96f1d44672a9ac6bbec13f58b9062_1588623964.html", "title": "Care facilities remain hotspots amid virus growth in Georgia", "title_page": "Care facilities remain hotspots amid virus growth in Georgia", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The 265th Infectious Control Georgia Army National Guard enters Canterbury Court, a senior living facility in Atlanta, to disinfect the building during the coronavirus outbreak, Friday, April 10, 2020. (Steve SchaeferAtlanta Journal-Constitution via AP)\nThe 265th Infectious Control Georgia Army National Guard enters Canterbury Court, a senior living facility in Atlanta, to disinfect the building during the coronavirus outbreak, Friday, April 10, 2020. (Steve SchaeferAtlanta Journal-Constitution via AP)\nATLANTA (AP) — The number of confirmed cases of the new coronavirus in Georgia crossed 13,600 Monday, while the number of deaths from COVID-19, the respiratory illness caused by the virus, rose to at least 480.\nNursing homes and assisted living facilities continue to be hotspots for infections in the state. The South Central Health District said Sunday that 16 people have tested positive for the virus at an unnamed long-term care facility in Wilcox County, northeast of Albany. The state Department of Public Health last week confirmed infections in 80 long-term care facilities statewide, with at least 81 deaths resulting.\nGov. Brian Kemp said during a news conference Monday afternoon that lags in testing capabilities “continue to frustrate” officials as the state works to increase hospital bed capacity ahead of a projected peak in infections.\n“We have got to have enough hospital beds when we reach our peak, we’ve got to do more testing and we’ve got to continue to focus on our long-term care facilities,” Kemp said.\nWilcox County is one of a number of counties statewide that has recently seen jackrabbit growth in the number of confirmed infections, along with Muscogee County, which includes Columbus, and Richmond County, which includes Augusta. It’s unclear whether that growth represents spread of the disease or more testing. Georgia has struggled to ramp up testing, crossing the 50,000 test mark only in recent days.\nThe highest per-capita rate of infections remains in southwest Georgia. Randolph County has reported 122 confirmed infections, the highest rate in Georgia and more than 10 times the rate statewide. Dougherty County, which includes Albany, has reported 78 deaths, the most in the state. Neighboring Terrell County, with 10 deaths, has the highest per-capita death rate.\nDougherty and Terrell counties have African American majorities. Statewide, a majority of deaths where race is known are among black people. A third of the state’s population is African American.\nDougherty County Coroner Michael Fowler told a news conference Monday he fears the toll there could reach 100 this week and bodies could soon begin filling a refrigerated trailer set up as an additional morgue.\n“I was hoping not to need that morgue,” Fowler said. “But the way it’s going, I’m going to need that morgue and another morgue.”\nThe frustrated coroner said too many residents are still ignoring social distancing practices — gathering in large groups even at homes of people who died from the virus, where other relatives are likely infected.\nHe held up a body bag, still wrapped in plastic.\n“Maybe you’ll get the message,” Fowler said. “It may be your loved one, it may be you, that I’ll have to come out and announce and use this body bag.”\nKemp says Georgia’s peak number of infections is expected in late April.\nThe Republican governor recently announced that a 200-bed hospital is being set up at the mammoth Georgia World Congress Center in downtown Atlanta, with the potential to expand capacity even further if needed. Kemp said Monday that the facility will be able to house Georgians with mild to moderate illness and will not have intensive care capabilities.\nAdjutant General Tom Carden, who oversees the Georgia National Guard and has been helping direct the state response, said that modeling has shown a potential need for the expansion. Carden said the state has more than a thousand-bed cushion compared to what median predictions are calling for. “But when you look at the upper-bound range of the current models,” Carden said, “we’re not in such great shape.”\nThe facility, being built by private contractor PAE in conjunction with state agencies, is supposed to be ready for patients within a week.\nMacon-Bibb County Emergency Management Director Spencer Hawkins told WMAZ-TV that the state has considered three or four locations in the Macon area for a temporary facility, but declined to name them. He said the location will depend on needs. The state has also considered a temporary facility at the Savannah Convention Center.\nMeal distribution resumed Monday for many Georgia public school students after a week off for spring break. Many school systems have pickup points for meals, while others deliver them by bus.\n——\nAssociated Press writers Ben Nadler in Atlanta and Russ Bynum in Savannah, Georgia, contributed to this report.\n___\nFollow AP coverage of the virus outbreak at\nhttps://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/f1f96f1d44672a9ac6bbec13f58b9062"}