{"authors": [], "date_download": "2020-05-04 20:15:46", "date_modify": "2020-05-04 20:15:46", "date_publish": "2020-04-28 04:29:35", "description": "The administration unveiled a “blueprint” for states to scale up their testing in the coming week.", "filename": "entry_trump-white-house-coronavirus-guidelines_n_5ea7ad2fc5b6dd3f9089f9d9_1588623346.html", "image_url": "https://img.huffingtonpost.com/asset/5ea7ae31250000bb0feb071a.jpeg?cache=pmeaflg0fb&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_trump-white-house-coronavirus-guidelines_n_5ea7ad2fc5b6dd3f9089f9d9_1588623346.html", "title": "Trump Says Virus Testing 'Not A Problem,' But Doubts Persist", "title_page": "Trump Says Virus Testing 'Not A Problem,' But Doubts Persist | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "WASHINGTON (AP) — The White House released new guidelines Monday aimed at answering criticism that America’s coronavirus testing has been too slow, and President Donald Trump tried to pivot toward a focus on “reopening” the nation.\nStill, there were doubts from public health experts that the White House’s new testing targets were sufficient.\nMonday’s developments were meant to fill critical gaps in White House plans to begin easing restrictions, ramping up testing for the virus while shifting the president’s focus toward recovery from the economic collapse caused by the outbreak. The administration unveiled a “blueprint” for states to scale up their testing in the coming week — a tacit admission, despite public statements to the contrary, that testing capacity and availability over the past two months have been lacking.\nThe new testing targets would ensure states had enough COVID-19 tests available to sample at least 2.6% of their populations each month — a figure already met by a majority of states. Areas that have been harder hit by the virus would be able to test at double that rate, or higher, the White House said.\nThe testing issue has bedeviled the administration for months. Trump told reporters on March 6 during a visit to the CDC in Atlanta that “anybody that wants a test can get a test,” but the reality has proved to be vastly different.\nThe initial COVID-19 test developed by the Centers for Disease Control and Prevention was contaminated, and early kits operated only on platforms able to perform a small number of tests per day. While the rate of testing increased as tests developed for higher-capacity platforms, they were still limited by shortages of supplies, from nasal swabs to the reagents used to process the samples.\nAdministration officials maintained Monday that the limiting factor now is actually the availability of samples from people who have been tested — either because guidelines on who could be tested are too stringent or because there are not enough health workers able to take nasal swab samples from them.\nThe CDC moved to address one of those concerns Monday, expanding the list of people to be prioritized for virus testing to include those who show no symptoms but are in high-risk settings like nursing homes. And Trump met with leaders of businesses including CVS, Walmart and Kroger, who said they were working to expand access to tests across the country.\n“Testing is not going to be a problem at all,” Trump said later in the Rose Garden.\nHowever, many of the administration’s past pledges and goals on testing have not been met.\nJeremy Konyndyk, a disaster preparedness expert who helped lead the Obama administration response to Ebola, said the administration’s testing plans are well short of what is needed.\nResearchers at Harvard have estimated the country needs to be testing a minimum of 500,000 people per day, and possibly many more. Konyndyk said the aim should be 2 million to 3 million per day. Trump said the current total, up sharply in recent days, is over 200,000 per day.\nKonyndyk said: “Over the past month, we’ve doubled or if you want to be really generous tripled the testing capacity in this country. We need to take where we are now and expand it tenfold.”\nThe testing blueprint for states provides details missing from the administration’s guidelines for them to return to normal operations, which were released more than a week ago. It includes a focus on surveillance testing as well as “rapid response” programs to isolate those who test positive and identify those with whom they had come in contact. The administration aims to have the market “flooded” with tests for the fall, when COVID-19 is expected to recur alongside the seasonal flu.\nTrump and administration medical experts outlined the plan on a call with governors Monday afternoon, before unveiling them publicly in a Rose Garden press conference.\nThe White House announcements came as Trump sought to regain his footing after weeks of criticism and detours created in part by his press briefings.\nDays after he set off a firestorm by publicly musing that scientists should explore the injection of toxic disinfectants as a potential virus cure, Trump said he found little use for his daily task force briefings, where he has time and again clashed with medical experts and reporters. Trump’s aides had been trying to move the president onto more familiar and, they hope, safer, ground: talking up the economy in more tightly controlled settings.\nRepublican Party polling shows Trump’s path to a second term depends on the public’s perception of how quickly the economy rebounds from the state-by-state shutdowns meant to slow the spread of the virus.\nOn Monday, the White House initially announced there would be a Trump briefing, but canceled it as Trump’s greatest asset in the reelection campaign — his ability to dominate headlines with freewheeling performances — was increasingly seen as a liability.\nBut hours later, it became clear Trump had other ideas. He held court in the Rose Garden for a bit less than an hour.\nSpokeswoman Kayleigh McEnany said briefings would be held later in the week but “they might have a new look to them, a new focus to them.”\nTrump said he hoped that virus deaths would end up no more than 60,000 to 70,000, slightly revising upward his public estimate of recent days as the U.S. toll neared 56,000 on nearly 1 million cases. Still, he claimed a victory given dire, tenfold-higher predictions if the U.S. hadn’t adopted restrictive social distancing measures.\nOn his conference call with governors, Trump suggested that many states should consider reopening schools before the end of the academic year, easing the way for parents to go back to work.\n“Some of you might start thinking about school openings because a lot of people are wanting to have the school openings,” Trump told the governors. The Associated Press obtained an audio recording of the call.\nMeanwhile, the CDC was beginning to release more detailed guidelines on reopening schools, restaurants and other establishments. Draft guidelines sent by the CDC to Washington include a long list of recommendations for organizations as they begin to reopen, such as closing break rooms at offices, spacing desks six feet apart at schools and using disposable plates and menus at restaurants. The draft guidance was obtained by The Associated Press from a federal official who was not authorized to release it.\nSome states have started to ease closure orders, and Trump is expected to spend coming days highlighting his administration’s efforts to help businesses and employees. Aides said the president would hold more frequent roundtables with CEOs, business owners and beneficiaries of the trillions of dollars in federal aid already approved by Congress, and begin to outline what he hopes to see in an additional recovery package.\nTrump last left the White House complex a month ago, and plans are being drawn up for a limited schedule of travel within the next few weeks, aides said. It would be a symbolic show that the nation is beginning to reopen.\nThe shift toward the economy comes in conjunction with what the White House sees as encouraging signs across the country, with the pace of new infections stabilizing and deaths declining.\nStill, medical experts warn that the virus will continue to haunt the country at least until a vaccine is developed. And they say the risk of a severe second wave is high if social distancing measures are relaxed too quickly or if testing and contact tracing schemes aren’t developed before people return to normal behaviors.\n___\nLemire reported from New York. Associated Press writers Michelle Smith in Providence, R.I., Mike Stobbe in New York, Darlene Superville in Washington and Alan Suderman in Richmond, Va., contributed to this report.", "url": "https://www.huffpost.com/entry/trump-white-house-coronavirus-guidelines_n_5ea7ad2fc5b6dd3f9089f9d9"}