{"authors": ["Colleen Long", "Zeke Miller"], "date_download": "2020-05-04 20:17:25", "date_modify": "2020-05-04 20:17:25", "date_publish": "2020-04-15 15:47:26", "description": "WASHINGTON (AP) — President Donald Trump's name will be printed on the stimulus checks that the IRS will be sending to tens of millions of Americans around the country, an unprecedented move...", "filename": "_8eafb90e92a676278a5644a2b72b734c_1588623445.html", "image_url": "https://storage.googleapis.com/afs-prod/media/5d89af1bc7bb4f35b86db14d7754cdb3/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8eafb90e92a676278a5644a2b72b734c_1588623445.html", "title": "Stimulus checks to bear Trump's name in unprecedented move", "title_page": "Stimulus checks to bear Trump's name in unprecedented move", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE- In this March 14, 2020 file photo, President Donald Trump talks after speaking during a news conference about the coronavirus in the James Brady Briefing Room at the White House in Washington. Trump’s name will be printed on the stimulus checks that the Internal Revenue Service will be sending to tens of millions of Americans around the country. It's an unprecedented move finalized this week. That's according to two officials with knowledge of the decision, who spoke to The Associated Press on Wednesday on the condition of anonymity to discuss internal planning. (AP Photo/Alex Brandon)\nFILE- In this March 14, 2020 file photo, President Donald Trump talks after speaking during a news conference about the coronavirus in the James Brady Briefing Room at the White House in Washington. Trump’s name will be printed on the stimulus checks that the Internal Revenue Service will be sending to tens of millions of Americans around the country. It's an unprecedented move finalized this week. That's according to two officials with knowledge of the decision, who spoke to The Associated Press on Wednesday on the condition of anonymity to discuss internal planning. (AP Photo/Alex Brandon)\nWASHINGTON (AP) — President Donald Trump’s name will be printed on the stimulus checks that the IRS will be sending to tens of millions of Americans around the country, an unprecedented move finalized this week.\nThe Treasury Department confirmed the decision in a statement Wednesday. It marks the first time a president’s name has appeared on any IRS payments, whether refund checks or other stimulus checks that have been mailed during past economic crises.\nTreasury said that the decision to add Trump’s name will not delay issuance of the paper checks, which will be mailed to people who are not set up to receive direct deposit payments from the IRS.\n“Economic Impact Payment checks are scheduled to go out on time and exactly as planned — there is no delay whatsoever,” Treasury’s statement said. “In fact, we expect the first checks to be in the mail early next week, which is well in advance of when the first checks went out in 2008 and well in advance of initial estimates.”\nTwo administration officials told The Associated Press that “President Donald J. Trump” will appear on the left side in the memo section of the checks. They spoke to the AP on the condition of anonymity because they were not authorized to speak publicly about the plans.\nThe Washington Post, which first reported that Trump’s name would appear on the checks, said the name would be below a line that reads, “Economic Impact Payment.”\nThe checks will be mailed to people who do not have information on file with the IRS to allow for direct deposits, many of them low-income individuals.\nThe checks will carry a signature of an official from the Bureau of the Fiscal Service, the Treasury division that prints the checks. The checks are signed by civil servants to ensure government payments are nonpartisan. A president is not an authorized signer for money sent by the U.S. Treasury.\nEarlier this month, Trump denied wanting to sign the checks when he was asked about published reports stating the opposite.\n“No. Me sign? No,” Trump said at an April 3 briefing. “There’s millions of checks. I’m going to sign them? No. It’s a Trump administration initiative. But do I want to sign them? No.”\nOn Wednesday, when he was asked why he wanted his name on the checks, the president said he didn’t know too much about it.\n“I do understand it’s not delaying anything, and I’m satisfied with that,” he said, adding that he didn’t think it was a big deal.\n“I’m sure people will be very happy to get a big, fat, beautiful check and my name is on it,” Trump said before cutting off the reporter from asking a follow-up question.\nThe payments are part of the $2.2 trillion rescue package signed into law at the end of last month aimed at combating the economic free-fall caused by shutdown orders in the coronavirus pandemic .\nA memo obtained last week by the AP from the House Ways and Means Committee said the IRS would make about 60 million payments to Americans through direct deposit in mid-April, likely this week. The IRS has direct deposit information for these individuals from their 2018 or 2019 tax returns.\nFull Coverage: Business\nThen, starting the week of May 4, the memo said, the IRS would begin issuing paper checks to individuals. It said the paper checks would be issued at a rate of about 5 million per week, which means it could take up to 20 weeks to get all the checks out.\nAnyone who earns up to $75,000 in adjusted gross income and who has a Social Security number will receive a $1,200 payment. That means married couples filing joint returns will receive the full payment, $2,400, if their adjusted gross income is under $150,000.\nThe payment amount steadily declines for those who make more. Those earning more than $99,000, or $198,000 for joint filers, are ineligible. For heads of household with one child, the benefit starts to decline at $112,500 and falls to zero at $146,500.\nParents also will receive $500 for each qualifying child.\n___\nAssociated Press writers Matthew Daly and Martin Crutsinger contributed to this report.", "url": "https://apnews.com/8eafb90e92a676278a5644a2b72b734c"}