{"authors": ["Kate Bennett", "Evan Perez"], "date_download": "2020-05-04 16:06:21", "date_modify": "2020-05-04 16:06:21", "date_publish": "2020-04-02 02:52:32", "description": "Dr. Anthony Fauci, the country's top medical expert on the coronavirus pandemic and a member of President Donald Trump's coronavirus task force, is facing threats to his personal safety and now requires personal security from law enforcement at all times, including at his home, a source confirms to CNN.", "filename": "2020_04_01_politics_anthony-fauci-security-detail_index_1588608381.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331124419-02-fauci-0327-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_anthony-fauci-security-detail_index_1588608381.html", "title": "Dr. Anthony Fauci forced to beef up security as death threats increase", "title_page": "Dr. Anthony Fauci forced to beef up security as death threats increase - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Dr. Anthony Fauci, the country's top medical expert on the coronavirus pandemic and a member of President Donald Trump's coronavirus task force, is facing threats to his personal safety and now requires personal security from law enforcement at all times, including at his home, a source confirms to CNN.\nA law enforcement official told CNN that the Department of Health and Human Services Inspector General, the agency's law enforcement arm, asked the US Marshals Service for assistance following threats to Fauci. The Marshals then deputized HHS officers to act as personal security for the doctor.\nA source also confirmed to CNN last week the presence of several members of the Washington, DC, Metropolitan Police Department stationed at all times around Fauci's home in the district. The source added the stepped up visible police presence was a response to growing threats to Fauci's safety, though the source of the threats was not identified.\nDuring the White House coronavirus task force briefing with reporters on Wednesday, Fauci was asked whether he or White House coronavirus response coordinator Dr. Deborah Birx , who also serves on the task force, had received threats of any kind or whether they had been assigned a security detail. He said he was not able to answer.", "url": "https://www.cnn.com/2020/04/01/politics/anthony-fauci-security-detail/index.html"}