{"authors": ["Gary D. Robertson"], "date_download": "2020-05-04 20:12:33", "date_modify": "2020-05-04 20:12:33", "date_publish": "2020-04-08 17:35:35", "description": "RALEIGH, N.C. (AP) — North Carolina health officials on Wednesday ordered new resident and employee protections in the state's nursing homes and similar settings after the new coronavirus further...", "filename": "_968f81a16586923329ceff8b0a361366_1588623153.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c43e2214027d4b12a8a8960b70ad0025/2728.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_968f81a16586923329ceff8b0a361366_1588623153.html", "title": "More deaths spur new North Carolina nursing home directives", "title_page": "More deaths spur new North Carolina nursing home directives", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "North Carolina Governor Roy Cooper listens to Mike Sprayberry, Director of Emergency Management as he fields questions about FEMA aid during a press briefing on the COVID-19 virus on Wednesday, April 8, 2020, in Raleigh, N.C. (Robert Willett/The News & Observer via AP)\nNorth Carolina Governor Roy Cooper listens to Mike Sprayberry, Director of Emergency Management as he fields questions about FEMA aid during a press briefing on the COVID-19 virus on Wednesday, April 8, 2020, in Raleigh, N.C. (Robert Willett/The News & Observer via AP)\nRALEIGH, N.C. (AP) — North Carolina health officials on Wednesday ordered new resident and employee protections in the state’s nursing homes and similar settings after the new coronavirus further penetrated those facilities, leading to more deaths.\nThe new directives, which will require all workers to wear masks when interacting with patients and daily health screenings of residents and staff, come as more than 60 residents at an Orange County long-term care facility have tested positive. Two of them have died and seven are hospitalized, Gov. Roy Cooper said.\n“These are shockingly large numbers,” Cooper said of the facility, which local legislators identified as PruittHealth-Carolina Point. Moore County health officials also announced Wednesday that more than two dozen residents and several staffers at Pinehurst Health Care and Rehabilitation Center also have COVID-19. One resident at a Northampton County adult care home died at a Virginia hospital last month.\nThe state had more than 3,400 positive cases of the virus Wednesday morning — 200 cases more than Tuesday — according to data from the state Department of Health and Human Services. More than 50 state residents have died and close to 400 people testing positive are hospitalized.\nThe additional restrictions come as civil rights groups and several prisoners asked the North Carolina Supreme Court on Wednesday to order the state prison system to release offenders who are at higher risk for infection and those already scheduled to be released soon. They contend social distancing requirements ordered statewide by Cooper are impossible within the 35,000-person prison system.\n“When there is an outbreak, these individuals will be at the mercy of a prison system that is ill-equipped to handle a novel, deadly virus that has overwhelmed healthcare systems across the country,” lawyers for the groups and prisoners wrote in the emergency petition. Similar releases are occurring in California, New York, Colorado and Iowa, the petition reads.\nCooper and Public Safety Secretary Erik Hooks, who are defendants in the case, said the prison system is doing all that it can to halt the virus’s spread. Leaders are prohibiting prison visitors, promoting hygiene, giving correctional officers protective gear and isolating offenders who’ve tested positive. Attorney General Josh Stein’s office, which is expected to represent Hooks and Cooper, is reviewing the lawsuit, a spokeswoman said.\n“We are taking this very seriously. Our staff is at the forefront of our minds, as well as our individuals that are incarcerated,” said Hooks. A little over a dozen prisoners have tested positive so far, he added. One of the plaintiffs, John Sturdivant, 73, who is incarcerated at a Pasquotank County prison, said he has high blood pressure, suffered a stroke and has had prostate cancer.\n“Because of my age and health problems, I am afraid that if I catch COVID-19, I will die,” Sturdivant said in an affidavit. He’d live with his son if released and can follow social distancing guidelines. The Department of Public Safety said late Wednesday it’s been looking for avenues for reducing the prison population while maintaining public safety.\nFor most people, the coronavirus causes mild or moderate symptoms, and the vast majority survive. But for others, especially older adults and people with existing health problems, it can cause pneumonia or death.\nOutbreaks, defined as two or more laboratory confirmed cases, have been reported at more than 20 nursing homes, skilled nursing facilities, adult care homes or correctional facilities. Cooper and state health Secretary Mandy Cohen said the new rules also will close all common areas and require residents testing positive to be segregated in the facility for treatment. Visitation to long-term care facilities already had been severely restricted.\n“If an outbreak happens, then quick and aggressive action must also follow,” Cohen said. “This is really hard work.”\nCooper has signaled additional orders this week to prevent crowds in essential retail stores like groceries to redouble social distancing directives. Cooper has said he doesn’t know yet whether a statewide stay-at-home order will continue beyond its current April 29 expiration. But he’s highlighted a report showing state hospitals have a better chance to avoid bed shortages with social distancing restrictions extended beyond April.\n___\nFollow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.", "url": "https://apnews.com/968f81a16586923329ceff8b0a361366"}