{"authors": [], "date_download": "2020-05-04 16:14:28", "date_modify": "2020-05-04 16:14:28", "date_publish": "2020-04-03 13:55:52", "description": "These pajamas are so good you'll actually look forward to wearing them all night, and maybe all day, too.", "filename": "2020_04_03_cnn-underscored_best-pajama-sets-nordstrom_index_1588608868.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401092819-nordstrompajamalead2-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored_best-pajama-sets-nordstrom_index_1588608868.html", "title": "Best pajama sets: 20 Nordstrom pajamas and loungewear", "title_page": "Best pajama sets: 20 Nordstrom pajamas and loungewear  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored has interviewed experts and found the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nSince many of us have been in self-quarantine — some 14 days and counting — can we all agree on something? Have any of us, ever, worn loungewear and pajamas so often for so long? Good. Same.\nWe think it's rather understandable. Staying in your jammies all day is comforting, warm and well, saves time 14 hours later, when you're thinking about getting back into bed yet again.\nThat's why, as a form of self-care, we think now is the time to treat yourself to a little loungewear refresh. Whether it's a new robe or pair of pajama pants or sweet silk chemise, what we're after is pajamas that we will all look forward to slipping on every night — or day.\nOn the side of all pajamas, all the time, we rounded up our favorite Nordstrom PJs and loungewear picks. Even if you choose to only wear them during sleeptime, you're getting more comfortable already, aren't you?\nPajama sets\nNordstrom Lingerie Moonlight Pajamas ($65; nordstrom.com)\nNordstrom Lingerie Moonlight Pajamas\nA classic menswear set that's kinda Don Draper, but with a slouchy fit and no pressure to look that good.\n_______________________________________________________________________________\nNordstrom Lingerie Short Moonlight Pajamas ($49; nordstrom.com)\nNordstrom Lingerie Short Moonlight Pajamas\nOne customer said they've purchased three pairs and would like \"a hundred more.\" The short version will have a long life through the summer, too.\n_______________________________________________________________________________\nHearts Pajamas Roller Rabbit ($118; nordstrom.com)\nHearts Pajamas Roller Rabbit\nThink of these as an act of self-love. Plus, they have pockets for the belongings you regularly transport from one room to another.\n_______________________________________________________________________________\nKate Spade New York Floral Jersey Short Pajamas ($68; nordstrom.com)\nKate Spade New York Floral Jersey Short Pajamas\nSuch an optimistic, spring-y print may just lift your spirits upon waking.\nNightgowns\nHanro Cotton Nightshirt (Starting at $86.25; nordstrom.com)\nHanro Cotton Nightshirt\nLike one of your chicest pocket tees, and just as soft. Get ready to daydream about slipping it on over a bathing suit.\n_______________________________________________________________________________\nTommy John Henley Sleep Dress ($40.98, originally $60; nordstrom.com)\nTommy John Henley Sleep Dress\nA more fitted silhouette, and according to multiple customers, it's the perfect weight.\n_______________________________________________________________________________\nBarefoot Dreams Cozychic Ultra Lite Caftan ($134; nordstrom.com)\nTommy John Henley Sleep Dress\nWe legit want to wear this for a night out — and fully intend to one day. In the meantime, we could live/work/cook/sleep in this.\n_______________________________________________________________________________\nKate Spade New York Bell Cuff Sleep Shirt ($29, originally $58; nordstrom.com)\nKate Spade New York Bell Cuff Sleep Shirt\nPart-tee, part-dress, all comfort, with a flattering scoop neck.\nChemises\nIn Bloom By Jonquil Lovin' You Floral Satin Chemise ($21, originally $42; nordstrom.com)\nIn Bloom By Jonquil Lovin' You Floral Satin Chemise\nIf lingerie-style sleepwear is your thing, this is such a pretty option — and is now half off.\n_______________________________________________________________________________\nThe White Company Lace Trim Silk Chemise ($118.30, originally $169; nordstrom.com)\nThe White Company Lace Trim Silk Chemise\nTo be honest, this one is elegant enough to qualify as Saturday-night-candlenight-dinner attire during quarantine.\n_______________________________________________________________________________\nLauren Ralph Lauren Chemise ($49; nordstrom.com)\nLauren Ralph Lauren Chemise\nA sleep dress that very well might make it into summer rotation as a sundress or cover-up.\nRobes\nThe White Company Long Lightweight Waffle Robe ($85; nordstrom.com)\nThe White Company Long Lightweight Waffle Robe\nThe almost-to-the-floor length makes this feel so luxurious.\n_______________________________________________________________________________\nPlum Pretty Sugar Floral Print Short Robe in Peony Sea ($65; nordstrom.com)\nPlum Pretty Sugar Floral Print Short Robe in Peony Sea\nThis pretty robe — perfect for some pre-bath \"me\" time — gets a ringing endorsement from one customer, who says they bought the piece for all their bridesmaids who \"actually still use them months after my wedding because it's not cheap, uncomfortable satin material.\"\nTops\nPJ Salvage Camisole ($32.30, originally $38; nordstrom.com)\nPJ Salvage Camisole\nA number of customers mentioned buying this in both colors and wanting it in more. Makes sense, as it's the perfect sleeper top and could do double duty under blouses or blazers.\n_______________________________________________________________________________\nLauren Ralph Lauren His Sleep Shirt ($59; nordstrom.com)\nLauren Ralph Lauren His Sleep Shirt\nFor those who like a nostalgic, sort of sexy men's-style sleepshirt, this one is handsome, and, one buyer notes, \"is not stiff,\" and \"doesn't fit too tight.\"\n_______________________________________________________________________________\nBP Cozy Sleep Top, Plus Size ($39; nordstrom.com)\nBP Cozy Sleep Top, Plus Size\nA cute, cozy crewneck with the cutest pattern that will be a springtime, and year-round, workhorse.\n_______________________________________________________________________________\nBarefoot Dreams CozyChic Lite Circle Cardigan in Indigo ($116; nordstrom.com)\nBarefoot Dreams CozyChic Lite Circle Cardigan in Indigo\nOn these still often-chilly days and nights, a sleeper cardigan is a must.\nPants\nSocialite Foldover Wide Leg Lounge Pants ($44; nordstrom.com)\nSocialite Foldover Wide Leg Lounge Pants\nThese pants actually were made for lounging. Buy them now, wear them forever.\n_______________________________________________________________________________\nFree People FP Movement Sunny Skinny Sweatpants ($48; nordstrom.com)\nFree People FP Movement Sunny Skinny Sweatpants\nA slim-fit jogger that functions for basically everything you need to do right now — including at-home exercise, when possible.\n_______________________________________________________________________________\nTommy John Second Skin Lounge Pants ($58; nordstrom.com)\nTommy John Second Skin Lounge Pants\nYou may not want to get of bed in these, but if you must, you can lounge in them all day.\nNote: The prices above reflect the retailers' listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/best-pajama-sets-nordstrom/index.html"}