{"authors": ["Matthew Barakat"], "date_download": "2020-05-04 20:20:40", "date_modify": "2020-05-04 20:20:40", "date_publish": "2020-04-09 14:04:22", "description": "FALLS CHURCH, Va. (AP) — Nearly 150,000 Virginians filed unemployment claims in the last week, the third straight week of record-setting claims in reaction to the coronavirus outbreak. The...", "filename": "_af8c3657ca987ea57bf024406423752c_1588623640.html", "image_url": "https://storage.googleapis.com/afs-prod/media/df26ecac54e346ef8f81059a355ff53c/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_af8c3657ca987ea57bf024406423752c_1588623640.html", "title": "Weekly jobless claims in Virginia approach 150,000", "title_page": "Weekly jobless claims in Virginia approach 150,000", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Virginia Gov. Ralph Northam gestures during a news conference at the Capitol Wednesday, April 8, 2020, in Richmond, Va. Northam gave an update on his COVID-19 plans. (AP Photo/Steve Helber)\nVirginia Gov. Ralph Northam gestures during a news conference at the Capitol Wednesday, April 8, 2020, in Richmond, Va. Northam gave an update on his COVID-19 plans. (AP Photo/Steve Helber)\nFALLS CHURCH, Va. (AP) — Nearly 150,000 Virginians filed unemployment claims in the last week, the third straight week of record-setting claims in reaction to the coronavirus outbreak.\nThe U.S. Department of Labor said Thursday that 149,758 claims were filed in the state in the week ending April 4. That’s about a one-third increase over the previous week, which was itself record-setting.\nBefore the coronavirus forced so many businesses into stasis, weekly jobless claims in Virginia averaged around 2,600.\nVirginia’s jobless claims continued to accelerate even as the national number of 6.6. million claims essentially leveled off from the previous week.\nIn the last three weeks, more than 308,000 Virginians have applied for unemployment, according to the Labor Department. The real figure may be higher because the Virginia Employment Commission, like other states, has been overwhelmed by the volume of claims, and many applicants report difficulties in getting their claims filed and processed.\nFor context, the U.S. Bureau of Labor Statistics estimates the size of the Virginia workforce at about 4.46 million. meaning that about 7% of Virginia workers have applied for unemployment in the last three weeks.\nDavid Miles is normally a DJ and karaoke host in Norfolk, with steady gigs at bars and restaurants, parades, weddings and other big events that have all been canceled due to the coronavirus.\n“All of my shows gone in a flash,” he said.\nMiles is among those now scrambling to make ends meet while waiting weeks for their unemployment claims to be processed under new rules passed in the federal stimulus meant help independent contractors, like Miles and his husband. Miles said he filed a claim the day the stimulus package passed, but got a letter Wednesday saying he’d been denied because of his status as an independent contractor.\nMiles now accompanies his husband, who has an injured hand, on Amazon and Grubhub deliveries, even though both have underlying health issues that put them in a high-risk category if they were to catch the virus.\n“We’re really not supposed to be in contact (with people), but we have no choice.”\nHe said he’s hoping the state acts quickly to make it possible for independent contractors to receive unemployment as the stimulus envisioned, so he and his husband won’t have to put themselves at risk.\nState officials say they’re revamping their website to accommodate claims filed by independent contractors.\nAlso on Thursday, the Virginia Department of Health reported that coronavirus deaths in the state have exceeded 100 and positive tests for the virus have exceeded 4,000. A week ago, the health department reported 41 deaths and more than 1,700 positive cases.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death. The vast majority of people recover.\nAs the virus has stretched into Virginia’s jails and prisons, a coalition of organizations led by the state chapter of the American Civil Liberties Union urged a greater statewide effort to release more inmates from detention, where it is feared that cramped conditions make facilities especially susceptible to outbreaks.\nSpecifically, the ACLU advocated that anyone “who is not a demonstrable, imminent threat of bodily harm to others” should be released, including anyone eligible for parole, anyone who is within a year of being released and anyone being held in pretrial detention who has not been convicted of a crime.\nAshna Khanna, legislative director for the ACLU of Virginia, said efforts so far by Gov. Ralph Northam’s administration to reduce the prison population “do not go nearly far enough in addressing this pandemic within Virginia prisons, jails and custodial facilities.”\n___\nAssociated Press writer Alan Suderman contributed to this report.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/af8c3657ca987ea57bf024406423752c"}