{"authors": ["Dave Kolpack"], "date_download": "2020-05-04 20:22:17", "date_modify": "2020-05-04 20:22:17", "date_publish": "2020-04-16 15:40:26", "description": "FARGO, N.D. (AP) — Health officials and National Guard members spent Thursday afternoon screening people for the coronavirus after eight positive tests were confirmed among workers at a North...", "filename": "_78b6fc2c392f4961f8ad324a40b3e2cf_1588623737.html", "image_url": "https://storage.googleapis.com/afs-prod/media/97ac13b355304f19a9a716a0ff9bde66/2720.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_78b6fc2c392f4961f8ad324a40b3e2cf_1588623737.html", "title": "Testing held near North Dakota plant while virus cases climb", "title_page": "Testing held near North Dakota plant while virus cases climb", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FARGO, N.D. (AP) — Health officials and National Guard members spent Thursday afternoon screening people for the coronavirus after eight positive tests were confirmed among workers at a North Dakota wind turbine plant that employs a large number of immigrants from African countries.\nThe drive-thru screenings outside the LM Wind Power in Grand Forks took place on a day when state officials reported a record number of new coronavirus cases for the second consecutive day. A total of 52 cases were confirmed in the last two days, including 28 on Thursday.\nCars were lined up in four lanes outside the LM plant, where officials administered 424 tests in five hours to people who may have come in close contact with the infected workers, said John Bernstrom, spokesman for the city of Grand Forks.\n“It’s stressful. It’s scary,” Bernstrom said. “You come up to a location and the people are in full personal protection equipment with masks and shields on their faces, among other stuff. Investigators have been really good working through different cultures and, for some, different languages.”\nShirley Dykshoorn, vice president at Lutheran Social Services in Fargo, the state’s refugee resettlement agency, said many of the employees are immigrants or former refugees who have worked at the plant for some time.\n“Most of them have good English skills,” Dykshoorn said. “Maybe not as many in their family understand everything so we’ve tried to support them and help them with what they need going forward.”\nDr. Paul Carson, a public health and infectious disease specialist at North Dakota State University and adviser to the governor’s COVID-19 team, said he’s not surprised to see several cases pop up in a large plant. He said it’s important to aggressively pursue people who came in close contact with those who are infected.\n“We’re going to find these little flare-ups and I think we should accept them. What we need to able to do is jump on them and try to prevent them from going any further,” Carson said. “We want to avoid what happened with the meat packing plant down in Sioux Falls, South Dakota.”\nOver half of the more than 1,300 cases in South Dakota have been tied to an outbreak at a Smithfield pork processing plant in Sioux Falls. The plant is one of the largest known clusters of COVID-19 cases in the country. A total of 598 employees have confirmed infections, plus 135 of their close contacts.\nCarson and Grand Forks Public Health Director Debbie Swanson said Thursday’s testing at the LM plant is the start of what will likely be an extended process. Any positive tests will lead to further rounds of testing of people identified to have had close contact with anyone infected.\n“It’s a process that works somewhat in concentric circles with each person who tests positive,” Swanson said.\nGrand Forks Mayor Michael R. Brown and Altru Health System’s president, Dr. Steven Weiser, released a video Thursday urging residents to follow recommendations to stay home and practice physical distancing to slow the spread of COVID-19\n“If we don’t continue practicing basic prevention measures to slow community spread, we could overwhelm our health care system. The responsibility to ensure that does not happen falls on each and every one of us,” Brown said.\nThe state has tested 11.704 people, with 387 coming back positive. North Dakota Gov. Doug Burgum said the state is on track to double its capacity of testing to 1,100 tests daily soon, and aims to double that number next month, and again in June.\nFederal officials announced Thursday they are prohibiting recreational use of Theodore Roosevelt National Park in western North Dakota to help slow the spread of the coronavirus. The park is the state’s top tourist attraction, drawing more than 700,000 visitors annually.\n——\nAssociated Press writer James MacPherson reported from Bismarck.", "url": "https://apnews.com/78b6fc2c392f4961f8ad324a40b3e2cf"}