{"authors": ["Brian Witte"], "date_download": "2020-05-04 20:22:47", "date_modify": "2020-05-04 20:22:47", "date_publish": "2020-04-20 21:18:29", "description": "ANNAPOLIS, Md. (AP) — Maryland has dramatically boosted its testing capacity for the new coronavirus with a shipment of 500,000 tests from a South Korean company, the state's governor announced...", "filename": "_1c0fc863cd4c3fe2b70b72038e2b0180_1588623767.html", "image_url": "https://storage.googleapis.com/afs-prod/media/48e56341130745b1b8e0e64e32d4abe4/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1c0fc863cd4c3fe2b70b72038e2b0180_1588623767.html", "title": "South Korean shipment to up Maryland virus tests by 500K", "title_page": "South Korean shipment to up Maryland virus tests by 500K ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Maryland Gov. Larry Hogan speaks at a news conference on Monday, April 20, 2020 in Annapolis, Md., with his wife, Yumi Hogan, right, where the governor announced Maryland has received a shipment from a South Korean company to boost the state's ability to conduct tests for COVID-19 by 500,000. Hogan said he asked his wife, who is Korean, to help negotiate with Korean officials, on March 28, and that set in motion 22 days of vetting and negotiations to bring the large increase in testing capacity to Maryland. (AP Photo/Brian Witte)\nMaryland Gov. Larry Hogan speaks at a news conference on Monday, April 20, 2020 in Annapolis, Md., with his wife, Yumi Hogan, right, where the governor announced Maryland has received a shipment from a South Korean company to boost the state's ability to conduct tests for COVID-19 by 500,000. Hogan said he asked his wife, who is Korean, to help negotiate with Korean officials, on March 28, and that set in motion 22 days of vetting and negotiations to bring the large increase in testing capacity to Maryland. (AP Photo/Brian Witte)\nANNAPOLIS, Md. (AP) — Maryland has dramatically boosted its testing capacity for the new coronavirus with a shipment of 500,000 tests from a South Korean company, the state’s governor announced Monday, noting his Korean-born wife played a major role in championing the $9 million purchase.\nAs states have scoured the world for testing supplies, Republican Gov. Larry Hogan said he asked wife Yumi Hogan on March 28 to help negotiate the purchase, tapping into the goodwill she has sought to foster between the state and South Korea. Hogan said 22 days of negotiations led to the shipment’s delivery on Saturday by air.\nHe called the shipment “an exponential, game-changing, step forward,” in increased testing capacity — which has been a huge challenge in the U.S. for states like Maryland, near the nation’s capital. The governor noted that President Donald Trump had told state officials the states need to lead on boosting their testing capacity.\n“The administration made it clear over and over again. They want the states to take the lead, and we have to go out and do it ourselves, and so that’s exactly what we did,” Hogan said at the news conference, flanked by the first lady.\nThe purchase was cited at Monday’s press briefing at the White House, with President Donald Trump opining that he didn’t believe it was necessary. Administration officials have been pushing governors to step up testing, while some governors have said that testing infrastructure is inadequate.\nVice President Mike Pence said he didn’t know when Hogan placed the order: “I wouldn’t begrudge him or his health officials for ordering tests,” he said.\nHowever, Pence stressed that National Institutes of Health and Defense Department facilities in Maryland were also at the state’s disposal to increase testing capacity.\nTrump didn’t let the opportunity to criticize Hogan slide. It was Hogan, a Republican and leader of the National Governors Association, who called out Trump after the president said anyone who wanted a COVID-19 test could get one. “That’s not true,” Hogan had said.\nTrump said Hogan could have saved a lot of money by calling the vice president.\n“I don’t think he needed to go to South Korea. I think he needed to get a little knowledge -- would have been helpful,” Trump said.\nHogan confirmed the administration pointed to federal labs as a way to meet the state’s testing needs. “We’ve been pushing to get NIH to help us with testing for more than a month now, but it was a productive meeting overall,” Hogan said.\nHogan said the shipment does not include everything needed to conduct all the tests, such as lab capability and swabs, though the state has acquired and continues to work to find the other needed components from other suppliers.\n“Unfortunately, we have also had to compete with every state in America in our attempts to procure tests from every domestic producer in the U.S. and from sources around the globe,” Hogan said in the governor’s mansion appearance.\nHogan said adequate testing is one of the four building blocks on the road to recovery from the global pandemic and reopening businesses. The others are increasing personal protective equipment, boosting hospital capacity for a surge of patients and creating a strong contact tracing operation to monitor those exposed to the virus.\nHogan said the shipment, which arrived at Baltimore-Washington International Thurgood Marshall Airport, was brought in on a Korean Air passenger plane — a Boeing 777 — with no passengers. It was the first Korean Air plane to land at the airport.\nThe company that produced the tests is called LabGenomics.\nHogan thanked his wife for her major role in the project. He noted she is the first Korean-American first lady of any state and lauded her work promoting friendship ties with South Korea. Hogan said Maryland and South Korean officials have been working for weeks on what he described as “a confidential project called Operation Enduring Friendship.”\n“It’s why we have, and we’re so proud to have, such a special bond with South Korea,” Hogan said.\nHe called the international collaboration on the medical supplies unprecedented — “from identifying and vetting the Korean testing company and getting the scientists in our labs to work through all of the technical details with the teams in Korea to the complexities of the international procurement contracts.”\nAdded Hogan: “It really was an amazing team effort.”\n__\nAssociated Press writer Kevin Freking contributed to this report from Washington.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.", "url": "https://apnews.com/1c0fc863cd4c3fe2b70b72038e2b0180"}