{"authors": ["Paul Leblanc"], "date_download": "2020-05-04 16:04:40", "date_modify": "2020-05-04 16:04:40", "date_publish": "2020-04-01 22:14:55", "description": "California Gov. Gavin Newsom had a pointed question Wednesday for state leaders who haven't yet issued stay-at-home orders amid the novel coronavirus pandemic: \"What are you waiting for?\"", "filename": "2020_04_01_politics_gavin-n_6298538beaaafe5860d43f1699f4efc0_index_1588608280.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200326170801-02-gavin-newsom-file-2019-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_gavin-n_6298538beaaafe5860d43f1699f4efc0_index_1588608280.html", "title": "Gavin Newsom: California governor urges state leaders to issue stay-at-home orders", "title_page": "Gavin Newsom: California governor urges state leaders to issue stay-at-home orders - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) California Gov. Gavin Newsom had a pointed question Wednesday for state leaders who haven't yet issued stay-at-home orders amid the novel coronavirus pandemic : \"What are you waiting for?\"\nNewsom, a Democrat, issued the first statewide mandatory restrictions in the United States last month, ordering California's nearly 40 million residents to stay home to help combat the outbreak. He spoke to CNN's Jake Tapper on \"The Lead\" as the virus continues to surge across the US, with more than 210,000 people infected and at least 4,650 deaths nationwide as of Wednesday afternoon. California alone has reported at least 8,150 cases and 150 deaths.\n\"Our message is this: 'What are you waiting for?' \" Newsom told Tapper when asked about governors who haven't followed suit. \"What more evidence do you need? If you think it's not going to happen to you, there are many proof points all across this country; for that matter, around the rest of the world.\"\n\"You'll never regret overcompensating at the moment so that you're preparing people for meeting this moment in the responsible way,\" he continued.\nNewsom told Tapper on Wednesday that more of those orders can help \"bend the curve, can save lives and ultimately can get people back to work and get society back to some semblance of normalcy faster than anything else we can do.\"\nThat message was echoed later Wednesday by Michigan Gov. Gretchen Whitmer, another Democrat, who assessed that the US \"should have a national strategy instead of a patchwork of policies\" at the state level.\n\"That's why I think it's important that we governors are leading and showing the way and being aggressive. I'm grateful that I have great, you know, colleagues here in the Midwest in particular. We've been pretty aggressive as a geography and I think that's important,\" Whitmer told CNN''s Anderson Cooper on \"AC360.\"\n\"But without a national strategy, without a uniform policy, this is going to go on longer than it needs to and more lives are going to be lost, more than we otherwise would,\" she added.\nOn Tuesday, President Donald Trump warned of a \"painful\" and \"tough\" two-week stretch ahead as he extended nationwide distancing measures that -- even if followed closely -- could still mean more than 100,000 and up to 240,000 Americans die in the pandemic.\n\"I want every American to be prepared for the hard days that lie ahead. We're going to go through a very tough two weeks,\" Trump said during a news briefing, setting expectations for a dire fortnight where death rates spike.\nIt was a stark message from a President who had spent weeks downplaying the severity of the virus and who has lashed out at several Democratic governors responding to the crisis.\nIn turn, the President has garnered intense criticism from scores of governors over a lack of federal assistance. Several struggling states are becoming increasingly desperate to obtain needed medical supplies to outfit health care workers on the front lines of the fight against the pandemic.\nNewsom on Wednesday stressed the need to \"raise above the partisanship\" during \"times of crisis.\"\n\"I've extended always an open hand, not a closed fist, in those circumstances and this is no different. But let me just be candid with you: I'd be lying to you to say that he hasn't been responsive to our needs,\" Newsom said of the President.\n\"Every time I've called the President, he's quickly gotten on the line.\"", "url": "https://www.cnn.com/2020/04/01/politics/gavin-newsom-california-coronavirus-cnntv/index.html"}