{"authors": ["Bukola Adebayo"], "date_download": "2020-05-04 16:24:12", "date_modify": "2020-05-04 16:24:12", "date_publish": "2020-04-06 12:49:30", "description": "Nigerian actress Funke Akindele-Bello has been arrested after hosting a birthday party during a lockdown in the country -- despite fronting a 'Stay Home' campaign.", "filename": "2020_04_06_africa_nigerian-actress-party-lockdown-intl_index_1588609452.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/170526115512-african-voices-funke-akindele-bello-nigeria-comedy-star-a-00004824-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_africa_nigerian-actress-party-lockdown-intl_index_1588609452.html", "title": "Funke Akindele, Nigerian actress who fronted 'Stay Home' campaign, arrested after hosting a party", "title_page": "Funke Akindele, Nigerian actress who fronted 'Stay Home' campaign, arrested after hosting a party - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Lagos, Nigeria (CNN) Nigerian actress Funke Akindele-Bello has been arrested after hosting a birthday party for her husband during a lockdown in the country -- despite fronting a 'Stay Home' campaign.\nThe Nollywood comedy star faced backlash after her husband posted a video of the party on his Instagram live feed on Saturday.\nNews about the party caused outrage among Nigerians who said her actions violated movement restrictions put in place by the government to curb the spread of coronavirus in the city.\nThe actress was also called out for hypocrisy as she was one of many celebrities who advised people to stay at home in a campaign by Dettol Nigeria to raise awareness about proper hygiene and social distancing.\nThe couple were arrested and appeared in court on Monday on charges connected with breaking the Lagos State Infectious Disease 2020 regulation under the Public Health Law. The couple pleaded guilty and were fined and handed a 14-day community service sentence.\nJUST WATCHED The makings of a Nigerian comedy star Replay More Videos ... MUST WATCH The makings of a Nigerian comedy star 07:54\nRead More", "url": "https://www.cnn.com/2020/04/06/africa/nigerian-actress-party-lockdown-intl/index.html"}