{"authors": ["Opinion Merrill Brown"], "date_download": "2020-05-04 16:55:23", "date_modify": "2020-05-04 16:55:23", "date_publish": "2020-04-09 00:24:17", "description": "Merrill Brown writes about the impact the coronavirus pandemic will have on the media industry. As a field that has already gone through tremendous upheaval, the economic and practical results of Covid-19 will add an accelerant to the fire.", "filename": "2020_04_08_opinions_media-c_b2422a3c2c5ea4a1c32f2cb1859e2c79_index_1588611323.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/121210021139-kurtz-news-organizations-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_opinions_media-c_b2422a3c2c5ea4a1c32f2cb1859e2c79_index_1588611323.html", "title": "A new revolution in media means we're increasingly on our own", "title_page": "A new revolution in media means we're increasingly on our own - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Merrill Brown is the founder and CEO of The News Project Inc ., which provides technology and services for small- to medium-sized news organizations. He was founding editor-in-chief of MSNBC.com , a former reporter and executive at The Washington Post, and founding director of the School of Communication and Media at Montclair State University. The views expressed in this commentary are his own. View more opinion at CNN.\n(CNN) In a time of pandemic crisis, when we need new voices, new ideas, and more thorough verification of claims, we're headed to a media world with significantly fewer outlets, fewer fresh faces and fewer media resources.\nNews consumption and video streaming use may be soaring , but now the public needs more authoritative media and important, trusted voices than ever before, the Covid-19 crisis is guaranteeing that we'll wind up with fewer.\nThat's the result of a revolution in media that is being dramatically accelerated by the coronavirus and will rival the introduction of television, the growth of cable and the development of the Internet in terms of profound change. This is occurring only in part because of market forces and technological change. But for the first time a mass media phenomenon is accelerating as a result of global catastrophe.\nWhat we're looking at is a new stage of news and entertainment consolidation . Many small and midsized digital information and entertainment businesses are going to either fold or be gobbled up by large companies as a result of a collapse of advertising support and limits on consumers' pocketbooks in the economic contraction.\nBut it's not only that. Consolidation, especially consolidation built out of human and economic horror -- and not new technology, economic growth or product innovation -- is nearly certain to mean fewer credible voices, less high quality, newly produced news and entertainment options, more use of existing programming by networks and distributors, and more low-cost options.\n\"We're going to see the coronavirus accelerate the digital media trend over many years that makes everything look more and more like the old media oligopoly,\" industry consultant Howard Homonoff told me in an interview.\nCompanies that are likely to be gobbled up and either merged or shut down include: newspapers, older large scale and even smaller news sites that are dependent on advertising and second tier new television programming networks, and poorly rated legacy networks, which will struggle to make it on their own. They are at risk in this process, but so are our collective psyches.\nTo be sure, it's important that Amazon, Google, Comcast, Disney, AT&T and a couple of other media giants (CNN is a division of WarnerMedia, which is part of AT&T) stay healthy and vibrant, even as others around them collapse. These large companies provide us vital services such as deliveries and internet access, as well as news and entertainment and do so on a global scale. But there's nothing good about all this for consumers of media who are looking for more voices in our political discourse, or for emerging creative talent looking for outlets.\nWhile the boom in streaming outlets like Netflix has created new markets for television and film, the streaming services and cable networks that seemed to be in boom times as 2020 dawned will largely contract as movie theaters collapse in the absence of being able to even open their doors, and as producers scramble to finance television programs in a severe economic downturn.\nMeanwhile, the local newspaper industry may well be doomed. \"The conventional wisdom was that print revenue was still holding the newspaper industry together,\" said Dave Morgan , CEO and founder of Simulmedia, a TV advertising platform, in a recent interview. \"Now that will be devastated.\" Perhaps, Morgan suggested hopefully, noting the already certain shrinkage in daily newspapers, there's a \"silver lining\" in this regard: the accelerated collapse is going to get us on to the next thing and we'll need media and advertising to lead us through this crisis. \"Media has never been more important than it is now.\"\nDespite the people's rising interest in reading more information amid the pandemic, newspapers are cutting staff and even days they print. Furthermore, news networks' viewership has surged more than 50% and app downloads for all kinds of news outlets have increased. However, at the same time, TV pilot development is falling behind, and new program development efforts -- now stalled -- won't soon recover\nIndustry experts had forecast an expansive future for streaming services, with The New York Times as recently as November describing the boom in streaming as a \"seismic shift\" in how Hollywood does business. But even with television viewership booming because of the nation becoming homebound, the future for new streaming services and new artists is no better than uncertain.\n\"The whole TV industry will be retooling,\" Morgan observed in the interview. \"There isn't enough subscription revenue to support multiple streaming networks. They were being subsidized by the capital markets. That support won't be there but hopefully you'll see more advertising support come into these services\" to fill in the gaps and stabilize their business prospects. In addition, Morgan notes, The Walt Disney Company's ability to underwrite new services like their own Disney+ with massive profits from now-shuttered theme parks is out the window for the near future.\nSo, fewer channels, fewer newspapers, and struggles throughout digital media even as an aspirational world of small-scale digital news startups emerges to take the place of large publishers.\nBut it's clear even to the US Centers for Disease Control and Prevention that we require public sources and media confirmation to clarify our actions and confirm what we're being told. What could be more important at this moment?\nThe CDC, last year, in a paper entitled \"The Psychology of a Crisis\" pointed out that we need validation from fresh, familiar, credible and local voices in moments of crisis. \"We remember what we see and tend to believe what we've experienced,\" the paper states. \"During crises, we want messages confirmed before taking action.\" That confirmation is received when those in crisis \"change television channels,\" when we call friends and family, when we \"turn to a known and credible local leader for advice\" and by checking to see what our social media contacts are saying. \"This confirmation first -- before we take action -- is very common in a crisis.\"\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nA world with fewer authoritative, validated voices, fewer channels, and fewer media outlets lies ahead in the aftermath of the coronavirus era. Hopefully, as is often the case, new outlets -- most likely digital ones in our cities and towns that cover vital topics -- will continue their growth and fill our community voids. But until that happens, in the period just ahead we'll be increasingly on our own.", "url": "https://www.cnn.com/2020/04/08/opinions/media-coronavirus-entertainment-newspapers-television-brown/index.html"}