{"authors": [], "date_download": "2020-05-04 16:16:51", "date_modify": "2020-05-04 16:16:51", "date_publish": "2020-04-03 20:53:35", "description": null, "filename": "2020_04_03_cnn-underscored_how-to-set-up-a-vpn-outbrain-2_index_1588609011.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200317104437-1-underscored-how-to-setup-a-vpn-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored_how-to-set-up-a-vpn-outbrain-2_index_1588609011.html", "title": "A VPN is vital when working from home, so here's everything you need to know", "title_page": "A VPN is vital when working from home, so here's everything you need to know - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "We've interviewed experts and found the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nA Virtual Private Network is a vital tool for internet security, especially when you're working from home.\nEssentially, a VPN is a service that protects your data and online activity by connecting your device — be it a smartphone, tablet or computer — to a separate server. But how does it protect your information? And what server are you connecting to?\nIn this brief guide, we'll go into detail about how a VPN works as well as how it keeps your information private. We'll start with what a VPN actually is, after which we'll outline the benefits of using one. Along the way, we'll unpack some of the jargon that surrounds VPNs. Finally, you can take a look at some recommendations we have for safe, effective and user-friendly VPN services.\nWhat is a VPN?\nA VPN is a virtual private network.\nBefore we define what a VPN is, it's important to understand a little bit about internet traffic. When you use the internet, your traffic is the flow of data between your computer and the internet. This is the case whether you're on a computer, laptop, smartphone or tablet. During this time, your data is open and accessible to anyone who can intercept it. This could be your Internet Service Provider, government agencies, your employer or even hackers. A public Wi-Fi network, password-protected or otherwise, can present even greater vulnerabilities, as you can't be sure who has access to the hotspot.\nWhen you connect to a VPN, your traffic flows through a remote server, which is a computer somewhere else in the world. When you use the internet, it's as if you're using that computer rather than your own. On the way to and from the server, your data is transferred via an encrypted tunnel. The \"encrypted\" part means that your data is sent in an uninterpretable form. The \"tunnel\" is the secure connection between your computer and the server. Only your computer and the server have the key to translate the encryption — to anyone else who intercepts the data, it'll look like nonsense.\nWhy does it matter?\nUsing a VPN is a great way to keep your data secure.\nWe're not saying anything bad will happen to you if you don't use a VPN, but there are risks you run by not protecting your data. These can be minor, like receiving targeted ads. When ISPs sell your data, or companies get hold of it, your search history and preferences can be used to create these ads. Likewise, your location can be determined via your IP address, basically the address for your computer, which is masked when you're using a VPN.\nOf course, the greater risks arise if malicious parties get hold of your data. Anyone with the right tools can intercept passwords, banking information and anything else you transmit via the internet (which is probably a lot). A VPN isn't just about deterring threats, though. With a VPN, you can bypass your country's content restrictions when you connect to a server in another country.\nTo sum things up: Passing up a VPN doesn't spell certain doom, but you simply aren't protecting your data either. Plus, you're opening yourself to potential censorship of content, which you could circumvent with a VPN. Keep reading to take a look at our favorites. And don't worry, none of them interferes with VoIP calls like FaceTime, Skype or Google Duo.\nNow that we have the basics out of the way, let's dive into your best bets for choosing the right VPN for you.\nNordVPN gives you access to a plethora of servers and a quick connect function.\nNordVPN is a trusted VPN service that many of us at CNN Underscored use. Once you've signed up, you'll see a stylized world map with a massive number of server locations to choose from. Aside from being visually pleasing, the interface is easy to use, which is a big plus. If you're looking to access content in a specific country, move the map until that country is in view to see if there are servers to choose from. You can also scroll through a list or search by country. Otherwise, you can tap Quick Connect to instantly connect to the best server for you. A single account can support up to six devices.\nIn addition to these functions, you can hook up Nord to Siri on mobile iOS devices, allowing you to connect to the VPN with your voice and check if you're currently connected. On computers, you have access to even more tools, like an Internet Kill Switch, which lets you disable your internet connection whenever the VPN isn't active. Plus, NordVPN is currently on a huge birthday sale, so there's never been a better time to get it.\nPureVPN gives you all the traditional features and also offers a dedicated IP address.\nNext up is PureVPN, a straightforward VPN with a number of premium features available. Much like NordVPN, once you sign up you'll be presented with a screen where you can Quick Connect to the ideal server for you. You can also select from a large number of servers available around the world if you're looking to access content from other countries too. Your account will give you access to PureVPN on five devices.\nThis VPN also has many premium features, not the least of which is a dedicated IP. This feature will not only hide your actual IP address, but it will give you your own dedicated IP address, too. Normally, the server (computer) that a VPN connects you to may be shared by others using the VPN. With a dedicated IP, the server is private, which can improve the connection speed between your computer and the server. Like NordVPN, Pure is currently on a substantial discount. You can also go here to try a seven-day free trial of PureVPN, premium features and all, for just $0.99.\nYes, ExpressVPN provides the normal VPN services but it can generate secure passwords.\nFinally, there's ExpressVPN, another streamlined VPN service. After you've signed up, you can hop right on the application and immediately connect to the best server available for you. And, like the others, you can access a list of servers — more than 3,000 to be exact. It gives you access for five devices, like PureVPN. And it's on sale, too, reducing the price of a one-year plan by almost half, along with throwing in three months for free.\nExpressVPN includes some additional features on top of the VPN service. Under its Privacy & Security Tools, there is a password generator that creates very strong passwords that are extra hard to crack. You can also get 30 days free each time you persuade a friend to buy a subscription, which is certainly a nice bonus.\nThough we ended up preferring NordVPN for its speed and plethora of servers, each choice has its own unique benefits. And whichever you choose, a VPN is a vital internet security tool that you can use at home and on the go. Don't pass one up, especially at these prices.\nNote: The prices above reflect the retailers' listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/how-to-set-up-a-vpn-outbrain-2/index.html"}