{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:08:52", "date_modify": "2020-05-04 20:08:52", "date_publish": "2020-04-08 21:41:54", "description": "CLEVELAND (AP) — Owners of The Plain Dealer newspaper in Cleveland laid off 22 more journalists and told the remaining 14 staffers they can no longer cover a large swath of the state. Those...", "filename": "_25cdf1e353c2eea975c4e99a1b21e3b2_1588622932.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_25cdf1e353c2eea975c4e99a1b21e3b2_1588622932.html", "title": "Union outraged after Ohio paper cuts staff, limits coverage", "title_page": "Union outraged after Ohio paper cuts staff, limits coverage", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CLEVELAND (AP) — Owners of The Plain Dealer newspaper in Cleveland laid off 22 more journalists and told the remaining 14 staffers they can no longer cover a large swath of the state.\nThose duties are being shifted instead to cleveland.com, a nonunion website owned by the same parent company, recently appointed Plain Dealer editor Tim Warsinskey told staff Monday.\nWarsinskey said the layoffs were prompted by reduced advertising revenue, not by the economic toll the coronavirus is having on the news industry. He called it a “company-wide strategy decision” at a meeting Monday with union members, according to a Facebook post from Northeast Ohio Newspaper Guild Local 1.\nBut officials with the Newspaper Guild, the union that represented around 340 Plain Dealer employees two decades ago, said the cuts were aimed at punishing union members.\n“It’s clear the company doesn’t value the expertise and institutional knowledge” of the newspaper’s veteran reporters, according to the Facebook post.\n“A move like this is incomprehensible and can only be interpreted as a way to punish people for belonging to a union,” Newspaper Guild officials said.\nWarsinskey wrote in a statement that there are now a total of 77 “journalists and content creators” between cleveland.com and The Plain Dealer, which split into separate newsrooms in 2013 when the newspaper reduced home delivery to four days a week. Stories produced by the two news organizations are shared online and in print.\nFour of the remaining 14 Plain Dealer journalists — two columnists, a critic and a travel writer — were told at that meeting they can continue their assignments. The other 10 reporters and photographers were told they would be reassigned to cover five counties surrounding Cleveland.\nThe most recent layoffs were announced March 1, a few weeks before the coronavirus shut down most of the U.S., leading to a massive economic downturn that has caused historic unemployment rates and prompted layoffs, pay cuts and staff reductions in nearly every industry.\nThe virus has exacerbated financial problems for the media industry, which has been reeling financially for years due to the loss of advertising revenue and plummeting circulation.", "url": "https://apnews.com/25cdf1e353c2eea975c4e99a1b21e3b2"}