{"authors": ["Katie Hunt"], "date_download": "2020-05-04 16:07:15", "date_modify": "2020-05-04 16:07:15", "date_publish": "2020-04-02 14:21:32", "description": "We're washing our hands, staying at home and standing 6 feet apart when we do need to go out. What else can we do to limit the spread of Covid-19? Public health experts say not enough is being done to tackle face touching -- something that could make a very large difference to the transmission of the virus.", "filename": "2020_04_02_health_how-to-stop-touching-your-face-wellness_index_1588608435.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200306040030-hands-touching-face-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_health_how-to-stop-touching-your-face-wellness_index_1588608435.html", "title": "How to train yourself not to touch your face", "title_page": "How to train yourself not to touch your face  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) We're washing our hands, staying at home and standing 6 feet apart when we do need to go out. What else can we do to limit the spread of Covid-19?\nPublic health experts say not enough is being done to tackle face touching -- something that could make a very large difference to the transmission of the coronavirus.\nThe challenge, says Susan Michie, the director of the Centre for Behaviour Change at University College London, is frustratingly simple.\nIt's much, much harder not to do something than to do something.\n\"Do wash your hands, do stand 2 meters apart -- but don't touch your face? It's much more difficult,\" Michie says.\nWe touch our face for many reasons: to groom, to gesture (like with the classic face palm) and to scratch. It can even be soothing in times of stress. According to one study , people touch their face about 23 times an hour.\nTo overcome these ingrained habits, Michie recommends making a conscious effort to keep your hands below shoulder level at all times and train yourself to resist the urge to touch your face.\nWhy your face?\nThe face, specifically what doctors call the T-zone of your eyes, nose and mouth, is a key route of transmission for the novel coronavirus. It can be spread via droplets that are expelled into the air and contaminate surfaces and objects like cellphones, car keys, door handles and elevators.\nIf you touch the mucus membranes in your nostrils, mouth and eyes after touching infected surfaces and objects -- what scientists call fomites -- you can become infected.\n\"If you never touched your face, it wouldn't matter if you didn't wash your hands. Your hands could be as dirty or as contaminated as you like,\" says Robert West, a professor of health psychology at University College London.\n\"The only reason why it's important is because eventually your hands are going to come in contact with a mucus membrane. It's the mucus membranes that are the key ... (they) act as the pathway into the body.\"\nFloating Doctors, a US medical relief group, has launched a \"Don't Touch Your Face\" campaign to implore people to break the physical and psychological habit of touching their face.\nUnlike, say, measles, for the most part you can't get Covid-19 simply by being in the same room as someone who has it already.\n\"The fact that it's mainly droplet-based and that it survives quite a long time on surfaces means that these fomites are going to be a really important route of transmission,\" said West. \"We need more hand awareness and actions that are incompatible with touching your face.\"\nWhile it was especially important not to touch your face when you're out and about, West said the best approach to break the habit would be to practice not doing it in general -- even when you're at home and you've washed your hands.\nOne option? Head nets\nSo what exactly can we do to stop touching our faces?\nFloating Doctors, a US medical relief group, has a novel suggestion born of experience working in rural communities in central America. It is recommending that people use a head net when they go out -- like the ones used to protect from mosquito bites, or that you might see on a beekeeper.\nA man poses wearing a hat with a mosquito net.\n\"They are totally comfortable, and you can see really well,\" said Dr. Ben LaBrot, the founder of Floating Doctors and a clinical assistant professor of medical education at the University of Southern California's Keck School of Medicine. \"You wear it over your hat.\"\n\"The mind is quite aware of the barrier so you don't even really reach up,\" he said, adding that head nets are readily available in most places and inexpensive.\n\"This is a small, individual act that can prevent you from getting sick or one person from getting infected,\" he added.\nWest said this kind of physical barrier could be quite effective.\n\"There is research on how to control microhabits -- things that you do without really thinking about it,\" said West. \"You take away the opportunity to do it.\"\nSimilarly, West said wearing a face mask could help people stop touching their mouth and nose, although there was a risk that the act of putting the mask on and taking it off could cause contamination.\nCounter habits and mindfulness\nAnother strategy West recommended was coming up with a \"counter-habit.\" \"The trigger is noticing your hand is moving to your face. One obvious thing is to divert it and scratch the back of your head -- redirect it.\n\"A few people have contacted me to say they put something on their hands to make it more mindful, like a scent,\" West continued. \"What you're trying to do is bring (the act) into consciousness.\"\nHe said the \"toughest nut to crack\" was the facial itch.\n\"Itches have evolved for us to scratch. Historically, ticks or other bugs landed on our face and buried in our skin -- this would have been quite dangerous for us.\"\nWhen I have an itch, said West, \"I notice it. I don't fight it but I don't give into it as it were. You notice it but you don't have to act on it.\"\nWest said he was \"astonished\" more wasn't being done to encourage people not to touch their faces given what a critical role the behavior plays in spreading the virus.\n\"If you've got a big problem (people think) you need a big solution,\" he said. \"Face touching [appears to be] such a trivial thing. It's almost silly, and it just doesn't feel right that stopping face touching could make much of a difference.\n\"That's my hypothesis about why people aren't taking it seriously because if you look at the logic of it and the infection pathway it's clearly critical.\"\nWest said we need to get to the point where if someone touched their face in public it elicited an \"ewww.\"\n\"We need to get it into our heads that face touching isn't even a thing you can do. It would be like taking your trousers down in public.\"", "url": "https://www.cnn.com/2020/04/02/health/how-to-stop-touching-your-face-wellness/index.html"}