{"authors": ["Brian Stelter", "Cnn Business"], "date_download": "2020-05-04 16:13:26", "date_modify": "2020-05-04 16:13:26", "date_publish": "2020-04-03 03:26:43", "description": "CNN's Chris Cuomo has become the most visible face of the coronavirus in the United States by giving daily updates about his condition on TV, social media and, on Thursday, at his brother's New York state press briefing.", "filename": "2020_04_02_media_chris-cuomo-coronavirus-reliable-sources_index_1588608806.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402232249-cuomo-covid-town-hall-0402-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_media_chris-cuomo-coronavirus-reliable-sources_index_1588608806.html", "title": "Chris Cuomo shares covid-19 experience: 'The beast comes at night'", "title_page": "Chris Cuomo shares covid-19 experience: 'The beast comes at night'  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) A version of this article first appeared in the \"Reliable Sources\" newsletter. You can sign up for free right here.\nCNN's Chris Cuomo has become the most visible face of the coronavirus in the United States by giving daily updates about his condition on TV, social media and, on Thursday, at his brother's New York state press briefing.\nOther television stars (Andy Cohen) and household names (Tom Hanks) have contracted the virus... there are more than I can list at this point... but Cuomo stands out because he is giving frequent updates to an audience of millions of people.\nHe began to anchor from home on Monday, and he was formally diagnosed on Tuesday. On Thursday night his 9 p.m. program was pre-empted for CNN's weekly town hall about the virus, so he joined from his home for a check-up. \"I'm doing well. The beast comes at night,\" he told Anderson Cooper and Dr. Sanjay Gupta. \"As we know the health care workers have taken to call the virus 'the beast.' I understand why. My fever has gone up a couple of degrees in like the last 30 minutes. Nights are tough, and I've learned something that I didn't know before: It is responsible journalism to say that 80% of people who get this, statistically, wind up okay, meaning they don't get a hospital, they get through it. It is not humanly responsible, though, from an ethical perspective. Now that I am one of the anointed and these people reach out to me -- you SUFFER when you have this at home, unless you are ridiculously lucky, statistically, and maybe karmically as well.\"\nCuomo said he has lost 13 pounds in the past three days. \"I'm just sweating it out and it's the sickness,\" he said. Chicken soup has helped. B.S. on the internet hasn't helped. \"Fake pills, fake tonics... I think we have to be very careful about people preying on desperation,\" he said.\nRead More", "url": "https://www.cnn.com/2020/04/02/media/chris-cuomo-coronavirus-reliable-sources/index.html"}