{"authors": ["Andrew Welsh-Huggins", "Mark Gillispie"], "date_download": "2020-05-04 21:06:18", "date_modify": "2020-05-04 21:06:18", "date_publish": "2020-04-16 13:25:57", "description": "COLUMBUS, Ohio (AP) — Some Ohio businesses could begin reopening after May 1 as long as proper precautions are taken amid the coronavirus pandemic, Gov. Mike DeWine said Thursday as he provided...", "filename": "_b8a883d7f78cd26d4207adb6ebe12f4f_1588626378.html", "image_url": "https://storage.googleapis.com/afs-prod/media/475f6f7c7d474b9ab4e555c22d677f28/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b8a883d7f78cd26d4207adb6ebe12f4f_1588626378.html", "title": "Ohio governor says some businesses may reopen after May 1", "title_page": "Ohio governor says some businesses may reopen after May 1", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Ohio governor says some businesses may reopen after May 1\nBrian Turnquist delivers pizzas during the coronavirus pandemic, Thursday, April 16, 2020, in Beachwood, Ohio. Ohio has paid a record $227 million to more than 271,000 individuals who filed for unemployment in the past four weeks. Nationally, a record 22 million people have sought jobless benefits, including 5.2 million new claims reported Thursday. (AP Photo/Tony Dejak)\nBrian Turnquist delivers pizzas during the coronavirus pandemic, Thursday, April 16, 2020, in Beachwood, Ohio. Ohio has paid a record $227 million to more than 271,000 individuals who filed for unemployment in the past four weeks. Nationally, a record 22 million people have sought jobless benefits, including 5.2 million new claims reported Thursday. (AP Photo/Tony Dejak)\nCOLUMBUS, Ohio (AP) — Some Ohio businesses could begin reopening after May 1 as long as proper precautions are taken amid the coronavirus pandemic, Gov. Mike DeWine said Thursday as he provided the first concrete timeline for a return to normal conditions after weeks of uncertainty, fear and economic hardship.\nThe Republican governor cautioned that the thaw in the state’s stay-at-home order would be gradual and would be marked by many of the elements that have become part of Ohioans’ routines, including social distancing, the cleaning of surfaces, frequent hand-washing and mask wearing.\nOhio has reported more than 8,400 COVID-19 cases and 389 deaths since announcing the first three cases March 9.\nDeWine announced the possible reopening timeline during his daily news briefing, then interrupted his own press conference several minutes later to tamp down expectations as the news tore across social media. He said the plan won’t work if people, whether as workers or consumers, are afraid to venture out.\n“We want to do it a way that engenders confidence in the people of the state of Ohio,” DeWine said.\nHe cautioned that mass gatherings, from concerts to sporting events to county fairs, would be “tougher” and might not happen until the end of the reopening process. DeWine has previously said life won’t be completely back to normal until a vaccine is available, which could still be a year away.\nThe governor didn’t address schools, which remain closed through May 2, but promised: “We’ll be dealing with schools shortly, probably early next week.”\nCalls have been growing to reopen parts of the Ohio economy, including from hospitals who want the ban on elective surgeries lifted, and lawmakers in rural areas that have seen few coronavirus cases or deaths.\nProtesters have picketed the Ohio Statehouse during DeWine’s news conferences demanding that the state reopen immediately. And even as DeWine discussed a May 1 reopening, a Columbus bridal shop sued state Health Director Dr. Amy Acton, saying Acton’s shuttering of nonessential employers is leading to “decimation of their businesses, livelihoods, and economic security.”\nThe Ohio Chamber of Commerce welcomed DeWine’s announcement. Though the COVID-19 crisis isn’t over, “businesses are ready to get back to work, and knowing that May 1 is the target date for this happening will allow them sufficient time to prepare to reopen safely and successfully,” said chamber CEO Andrew Doehrel.\nDeWine said he understands the importance of getting the economy moving again, but Ohio must be careful to avoid problems such as future COVID-19 spikes after society has reopened. The state will keep a close eye on supplies of personal protective equipment like gowns, masks and face shields, and also on testing, the governor said.\n“If we don’t do it right, the consequences are horrendous,” the governor said.\nDeWine also said he’s working with the governors of Illinois, Indiana, Kentucky, Michigan and Wisconsin to reopen the region in coordinated fashion.\nA look at other coronavirus-related developments Thursday in Ohio:\nECONOMY\nThe state reported 158,678 unemployment compensation claims for the week ending April 11 for a total of 855,197 over the past four weeks. That is significantly above the combined 715,512 claims filed in the previous two years, according to the human services agency.\nThe state has paid a record $227 million to more than 271,000 individuals who filed for unemployment in the past four weeks.\nNationally, a record 22 million people have sought jobless benefits, including 5.2 million new claims reported Thursday.\n___\nHOSPITALS\nThe percentage of beds available in Ohio hospitals is unchanged since before the coronavirus pandemic began, and so far facilities set aside to take extra patients are going unused, hospital officials said.\nThe cancellation of elective surgeries, Ohio’s stay-at-home order and adherence to social distancing practices have allowed hospital systems in the state to avoid the surges in coronavirus patients that have overwhelmed hospitals in other states, officials said.\nOhio hospital bed use in the last four weeks has remained steady at between 50% and 60%, which is the average in normal times, said John Palmer, a spokesman for the Ohio Hospital Association.\nIn Cleveland, just over half of University Hospitals’ 1,800 beds were occupied earlier this week, with 58% of intensive care beds in use, said Dr. William Brien, the system’s chief medical officer and chief quality officer. Officials planned for a surge in coronavirus cases of as much as 300% of the system’s bed capacity, he said.\nBrien said he is cautiously optimistic as COVID-19 infections in the state appear to have plateaued.\nHospital systems throughout Ohio made plans together to create hospital capacity in facilities such as convention centers and university field houses that have not been needed thus far. In Cleveland, University Hospitals, the Cleveland Clinic and MetroHealth Medical Center worked closely together in anticipation of a surge in coronavirus cases, Brien said.\n“We were prepared, and maybe had a little luck going for us, too,” Brien said.\n___\nCASES\nTo date, Ohio has confirmed more than 8,400 cases and 389 deaths, according to new federal guidelines that allow cases and deaths considered “probable” COVID-19 infections without a positive test.\nThe pandemic has caused more than 2,300 hospitalizations in Ohio, with more than 700 people needing treatment in intensive care units.\nHealth care workers account for 20% of the overall cases in the state. Nursing homes have reported more than 800 cases, or about one in 10.\nThe virus has infected more than 150 state prison employees and more than 270 inmates, and killed one guard and three inmates. Six inmates have died at a federal prison in Elkton in eastern Ohio.\nFor most people, the virus causes mild or moderate symptoms that clear up in a couple of weeks. Older adults and people with existing health problems are at higher risk of more severe illness, including pneumonia, or death.\n___\nMark Gillispie reported from Cleveland.", "url": "https://apnews.com/b8a883d7f78cd26d4207adb6ebe12f4f"}