{"authors": ["Stephen Hawkins"], "date_download": "2020-05-04 20:22:11", "date_modify": "2020-05-04 20:22:11", "date_publish": "2020-04-20 22:19:53", "description": "FORT WORTH, Texas (AP) — The race is on among states willing to be the first to host NASCAR races without fans. Texas Gov. Greg Abbott tweeted Monday that NASCAR was working with Texas Motor...", "filename": "_b89f1a91b174b15216147c7b041d1236_1588623731.html", "image_url": "https://storage.googleapis.com/afs-prod/media/12eccd6cd9ab48d59e15dd3a54f2c5fd/2283.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b89f1a91b174b15216147c7b041d1236_1588623731.html", "title": "Texas, Florida eager for NASCAR to rev engines again", "title_page": "Texas, Florida eager for NASCAR to rev engines again ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Feb. 24, 2019, file photo, a NASCAR Monster Energy NASCAR Cup Series auto race starts at Atlanta Motor Speedway in Hampton, Ga. NASCAR and IndyCar have each called off their races this weekend. NASCAR was scheduled to run Sunday at Atlanta Motor Speedway without spectators but said Friday, March 13, 2020, it is calling off this weekend and next week’s race at Homestead-Miami Speedway. IndyCar was scheduled to open its season Sunday on the streets of St. Petersburg, Florida, but suspended it’s season through the end of April.(AP Photo/Scott Cunningham, File)\nFILE - In this Feb. 24, 2019, file photo, a NASCAR Monster Energy NASCAR Cup Series auto race starts at Atlanta Motor Speedway in Hampton, Ga. NASCAR and IndyCar have each called off their races this weekend. NASCAR was scheduled to run Sunday at Atlanta Motor Speedway without spectators but said Friday, March 13, 2020, it is calling off this weekend and next week’s race at Homestead-Miami Speedway. IndyCar was scheduled to open its season Sunday on the streets of St. Petersburg, Florida, but suspended it’s season through the end of April.(AP Photo/Scott Cunningham, File)\nFORT WORTH, Texas (AP) — The race is on among states willing to be the first to host NASCAR races without fans.\nTexas Gov. Greg Abbott tweeted Monday that NASCAR was working with Texas Motor Speedway on a plan to race there.\n“I hope to announce the exciting details in the near future,” Abbott said. “To prevent spread of #COVID19 it will be without fans. But they will put on a great show for TV.”\nFlorida Gov. Ron DeSantis had already spoken to Daytona Beach-based NASCAR executive Lesa France Kennedy, potentially putting both NASCAR-controlled Homestead-Miami Speedway and Daytona International Speedway in play at some point.\nAfter Abbott’s announcement, Texas Motor Speedway President Eddie Gossage said his track was working on the rescheduling of its Cup Series event, one of eight races NASCAR has postponed because of the coronavirus pandemic. NASCAR has said it plans to run all of its remaining 32 races.\nThe Texas race, the first of two this year at the 1 1/2-mile Fort Worth track, was scheduled for March 29.\n“Texas Motor Speedway will work aggressively with the sanctioning bodies and TV networks to give American society, as well as people around the world, a positive distraction during this crisis,” Gossage said. “A non-spectator event is not perfect because in our sport, the fans come first. But circumstances are such that this is a novel answer for the return of the sport for now. We are now working on a hard date.”\nMarcus Smith , the CEO of Speedway Motorsports — which owns Charlotte Motor Speedway and the Texas track — said he is eager to work with North Carolina Gov. Roy Cooper to ensure the Coca-Cola 600 runs as scheduled May 24. Republican state lawmakers have asked Cooper, a Democrat, to allow the showcase race.\n“For 60 years. this race has been a Memorial Day weekend tradition,” Smith said. “We want to do everything possible to support NASCAR, the dozens of race teams in North Carolina and the fans to get back on track.”\nMost NASCAR race teams are based in North Carolina, which is under a stay-at-home order through April.\nA Cooper spokesman, Ford Porter, said Sunday the governor “knows the importance of NASCAR to our state and he’s already been talking with track and team owners about how we could potentially restart racing. It’s too soon to predict specific decisions about future sporting events but any plan would prioritize public health and safety and preventing spread of the virus.”\nNASCAR teams have cars built for the tracks at Atlanta and Homestead, so the first track back has to be suitable to their design. That doesn’t take Daytona out of the equation; it just means the teams have to be allowed to go back to work in their shops to build superspeedway cars.\nAs states begin to relax restrictions intended to prevent the spread of the virus, there will be more opportunities for NASCAR to go racing.\nThe series could eventually get to Darlington Raceway in South Carolina, Bristol Motor Speedway in Tennessee or Atlanta Motor Speedway, where teams were preparing to race when a national state of emergency was issued in mid-March and the season was indefinitely suspended.\nIn Texas, state parks reopened Monday as the state began what its Republican governor said will be a gradual unraveling of restrictions. The state also this week will also allow doctors to resume nonessential surgeries and let retailers sell items for curbside pickup, with more restrictions to be lifted before the end of the month.\n“Our sport is unique because the competitors are inside the race cars with no body-to-body contact like most other sports,” Gossage said. “That is a distinct advantage over other sports and why you will likely see auto racing as the first live sport returning to action.”\n___\nAP Racing Writer Jenna Fryer contributed to this report.", "url": "https://apnews.com/b89f1a91b174b15216147c7b041d1236"}