{"authors": ["Por Tim Reynolds"], "date_download": "2020-05-04 21:06:42", "date_modify": "2020-05-04 21:06:42", "date_publish": "2020-04-06 23:52:41", "description": "El comisionado de la NBA Adam Silver se prepara para más semanas de incertidumbre sobre el futuro de la temporada, al revelar el lunes que no anticipa que la liga pueda tomar una decisión hasta,...", "filename": "_cf5de19d288b47fea92f63f04bb10523_1588626402.html", "image_url": "https://storage.googleapis.com/afs-prod/media/1024e39ab0e14460b1b985dc8a4ba5cc/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cf5de19d288b47fea92f63f04bb10523_1588626402.html", "title": "Silver: NBA no tomará decisión sobre reanudación hasta mayo", "title_page": "Silver: NBA no tomará decisión sobre reanudación hasta mayo", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nSilver: NBA no tomará decisión sobre reanudación hasta mayo\nEn esta fotografía del 8 de octubre de 2019 el comisionado de la NBA Adam Silver durante un juego de pretemporada entre los Rockets de Houston y los Raptors de Toronto en Saitama, cerca de Tokio. El 26 de marzo del 2020 la NBA reducirá el 20% del salario de sus altos ejecutivos por la pandemia de coronavirus. (AP Photo/Jae C. Hong, Archivo)\nEn esta fotografía del 8 de octubre de 2019 el comisionado de la NBA Adam Silver durante un juego de pretemporada entre los Rockets de Houston y los Raptors de Toronto en Saitama, cerca de Tokio. El 26 de marzo del 2020 la NBA reducirá el 20% del salario de sus altos ejecutivos por la pandemia de coronavirus. (AP Photo/Jae C. Hong, Archivo)\nEl comisionado de la NBA Adam Silver se prepara para más semanas de incertidumbre sobre el futuro de la temporada, al revelar el lunes que no anticipa que la liga pueda tomar una decisión hasta, por lo menos, mayo.\nSilver habló en la cuenta oficial de Twitter de la NBA como parte de la iniciativa de la liga NBATogether, en una conversación con Ernie Johnson, de Turner Sports. Tocó distintos temas, incluyendo el proceso en que la liga analiza los distintos escenarios para su regreso, pero en todos los casos la incertidumbre causada por la pandemia de coronavirus imposibilita adelantarse demasiado.\n“Esencialmente, lo que les he dicho a mis colegas en la última semana es que simplemente debemos aceptar que, al menos durante el mes de abril, no estaremos en posición de tomar ninguna decisión”, dijo Silver. “Y no creo que eso signifique necesariamente que lo estemos el 1 de mayo”.\nLa NBA fue la primera de las grandes ligas deportivas de Estados Unidos en cesar sus actividades debido a la amenaza del COVID-19, tomando la decisión después de que el pívot del Jazz de Utah Rudy Gobert se convirtiera en el primer jugador de la liga en ser diagnosticado con el virus. La temporada regular estaba programada a concluir el 15 de abril, y tres días después iniciaría la postemporada.\nEso no sucederá, como se sabe desde hace tiempo. La NBA quiere que la temporada se reanude, pero simplemente no pude señalar con certeza si eso sucederá o no.\n“La extrañamos mucho”, comentó. “A todas las familias que están viendo esto, sé que la NBA es una parte importante de sus vidas. Solo queremos asegurarles a todos que aunque primero estamos poniendo la salud y la seguridad de todos, estamos analizando todas las posibilidades para que nuestros jugadores vuelvan a la cancha y puedan volver a jugar.\nSilver dijo que no se ha tomado una decisión sobre si se reanudará la campaña, o si la liga — asumiendo que pueda reanudarse — irá directo a los playoffs.\nTambién se analiza la posibilidad de que se realicen partidos en arenas de NBA en instalaciones de práctica, por lo que tendría que decidirse cómo se llevarían a cabo los encuentros televisados y si la liga puede trasladar a todos a un solo lugar para finalizar la campaña. Hay ciudades que han expresado interés en esa opción y han contactado a la liga con esa intención, admitió Silver.\n“En este momento estamos escuchando”, dijo.", "url": "https://apnews.com/cf5de19d288b47fea92f63f04bb10523"}