{"authors": ["Maegan Vazquez"], "date_download": "2020-05-04 16:10:59", "date_modify": "2020-05-04 16:10:59", "date_publish": "2020-04-02 20:36:38", "description": "The White House announced Thursday that President Donald Trump is invoking the Defense Production Act to clear up supply-chain issues encountered in the manufacturing of ventilators and to ensure the production of additional N95 face masks.", "filename": "2020_04_02_politics_defense_eb4ea389d4b4ae843f585f0046ffe3f7_index_1588608659.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331230558-01-trump-coronavirus-briefing-0331-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_defense_eb4ea389d4b4ae843f585f0046ffe3f7_index_1588608659.html", "title": "Trump invokes Defense Production Act for ventilator equipment and N95 masks", "title_page": "Trump invokes Defense Production Act for ventilator equipment and N95 masks - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The White House announced Thursday that President Donald Trump is invoking the Defense Production Act to clear up supply-chain issues encountered in the manufacturing of ventilators and to ensure the production of additional N95 face masks.\naround the country. The use of ventilators among critical coronavirus patients and the demand for protective equipment, such as the N95 respirator, has skyrocketed since the coronavirus pandemic hit the US. Thursday's orders come amid increased fears of ventilator shortages and personal protective equipmentaround the country. The use of ventilators among critical coronavirus patients and the demand for protective equipment, such as the N95 respirator, has skyrocketed since the coronavirus pandemic hit the US.\nThe first order, a White House statement said, will help domestic manufacturers \"secure the supplies they need to build ventilators needed to defeat the virus.\"\nThe President also said the move \"will save lives by removing obstacles in the supply chain that threaten the rapid production of ventilators.\"\nThe order, which came in the form of a presidential memorandum, directs the supply of materials to make ventilators to six companies: General Electric Co., Hill-Rom Holdings Inc., Medtronic Public Limited Co., ResMed Inc., Royal Philips N.V. and Vyaire Medical Inc.\nRead More", "url": "https://www.cnn.com/2020/04/02/politics/defense-production-act-ventilator-supplies/index.html"}