{"authors": ["Opinion Jill Biden", "Lily Eskelsen García", "Randi Weingarten"], "date_download": "2020-05-04 16:06:39", "date_modify": "2020-05-04 16:06:39", "date_publish": "2020-04-02 12:41:30", "description": "Jill Biden, Lily Eskelsen García & Randi Weingarten write that, as educators, their hearts are with everyone who is struggling to give their children the stability and opportunities they need during the uncertainty of this crisis. But they have advice on how to make the experience more manageable.", "filename": "2020_04_02_opinions_covid-1_7030430fdb78b0d9bc9751b351af299a_index_1588608399.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200318084700-virtual-learning-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_opinions_covid-1_7030430fdb78b0d9bc9751b351af299a_index_1588608399.html", "title": "Jill Biden and leading teachers: How to school your kids", "title_page": "Jill Biden and leading teachers: How to school your kids (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Jill Biden is a professor at Northern Virginia Community College. She is the wife of Democratic presidential candidate Joe Biden and served as Second Lady of the United States from 2009 - 2017. Lily Eskelsen García is a sixth-grade teacher, Utah Teacher of the Year and president of the 3-million member National Education Association. Randi Weingarten is a former high school social studies and civics teacher and president of the 1.7-million member American Federation of Teachers. The views expressed in this commentary are their own. View more opinion on CNN.\n(CNN) In mid-March, as schools across the country began closing to protect Americans from the spread of Covid-19, television producer Shonda Rhimes tweeted, \"Been homeschooling a 6-year-old and 8-year-old for one hour and 11 minutes. Teachers deserve to make a billion dollars a year. Or a week.\"\nJill Biden\nLily Eskelsen García\nRandi Weingarten\nShe echoed what so many parents -- those who must now find child care while they continue to go to essential jobs, those working remotely and those who have lost their jobs -- are feeling right now.\nAs educators, as well as the leaders of the nation's two largest educators' unions, the American Federation of Teachers and the National Education Association, our hearts are with everyone who is struggling to give our children the stability and opportunities they need during the uncertainty of this crisis. But we want you to know -- we are all in this together.\nFamilies are receiving help from public schools in the form of grab-and-go meals , learning packets, digital platforms and virtual counseling. Educators, using innovative tools that keep us physically distant but socially connected, are on the front lines of navigating how to turn lessons into home learning. A strong partnership between teachers, parents and students is always the best way for children to learn, and that's truer today than ever.\nStill, learning is uneven. Families without internet or limited access to computers and tablets face challenges, as well as English language learners and students with disabilities.\nRead More", "url": "https://www.cnn.com/2020/04/02/opinions/covid-19-how-to-school-kids-biden-garcia-weingarten/index.html"}