{"authors": ["Shannon Liao", "Cnn Business"], "date_download": "2020-05-04 17:02:58", "date_modify": "2020-05-04 17:02:58", "date_publish": "2020-04-10 19:51:17", "description": "Nintendo has paused shipments of the Nintendo Switch and Switch Lite from its production facilities in China and Vietnam to Japan, amid global shortages of the popular video game consoles.", "filename": "2020_04_10_tech_nintendo-switch-shipment-pause-shortage_index_1588611778.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410120518-nintendo-switch-game-console-0331-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_tech_nintendo-switch-shipment-pause-shortage_index_1588611778.html", "title": "Nintendo Switch shipments to Japan are paused amid global shortage", "title_page": "Nintendo Switch shipments to Japan are paused amid global shortage - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Nintendo has paused shipments of the Nintendo Switch and Switch Lite from its production facilities in China and Vietnam to Japan, amid global shortages of the popular video game consoles.\nThe company confirmed to CNN Business that there will be no new shipments of the Nintendo Switch and the Switch Lite this week to Japan apart from pre-orders. It tweeted in Japanese on Tuesday that it would update customers next week on the shipping schedule.\n\"Demand for Nintendo Switch soared thanks to ' Animal Crossing: New Horizons ' and the surge in home gaming during Covid-19,\" Lisa Hanson, president of Niko Partners, a research firm that focuses on the gaming industry in Asia, told CNN Business.\nShe noted that sales of the Switch in Japan surged 240% in March compared to a year ago. \"Nintendo could be mitigating the short global supply issue by limiting shipments to Japan when demand there may be lower in April after big sales in March,\" Hanson added.\nOn February 6, Nintendo announced it was dealing with production delays in China due to the ongoing pandemic. Even though Nintendo began to move part of its manufacturing to Vietnam in 2019, it still relies on China for supply. The company declined to say how much the supply chain has recovered since then.\nRead More", "url": "https://www.cnn.com/2020/04/10/tech/nintendo-switch-shipment-pause-shortage/index.html"}