{"authors": ["Matt Egan", "Cnn Business", "Paola Rodriguez-Masiu", "Senior Oil Market Analyst At Rystad Energy"], "date_download": "2020-05-04 16:56:12", "date_modify": "2020-05-04 16:56:12", "date_publish": "2020-04-07 18:55:04", "description": "The drama playing out in the oil market is not short on oversized characters. But Vladimir Putin and MBS could soon have to make room for a new player: Tariff Man.", "filename": "2020_04_07_business_oil-tariffs-trump-saudi-arabia-russia_index_1588611372.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403102810-russia-oil-tanks-0323-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_business_oil-tariffs-trump-saudi-arabia-russia_index_1588611372.html", "title": "Trump could tariff foreign oil. That won't end the oil crisis", "title_page": "Trump could tariff foreign oil. That won't end the oil crisis - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) The drama playing out in the oil market is not short on oversized characters. But Vladimir Putin and MBS could soon have to make room for a new player: Tariff Man.\nThose two nations are engaged in an epic price war that, along with an historic collapse in demand from the coronavirus pandemic, has helped send crude crashing to 18-year lows . Dozens of US oil companies are now facing bankruptcy.\nTariffs are not really a stick. They would prove futile.\"\n\"We want to save a great industry,\" Trump said during a press briefing Sunday.\nThe goal is to force Putin and Saudi Crown Prince Mohammed bin Salman to reach a breakthrough at Thursday's highly-anticipated meeting by massively cutting production.\n\"If they don't get along, I would do that,\" Trump said. \"I would do tariffs, very substantial tariffs.\"\nBut that negotiating strategy would likely be ineffective because the United States imports little crude from Saudi Arabia and Russia these days. If anything, it could backfire on US refineries that rely on a healthy dose of foreign crude to go full blast.\nDo oil companies even want tariffs? Depends on who you ask\nAnd the tariff threat has exposed a deep divide within the oil industry itself. Large oil companies, the ones built to withstand cheap crude, are urging Trump not to resort to tariffs.\n\"The operation of the free market is the most efficient means of resolving the extreme supply and demand imbalances we are now experiencing,\" ExxonMobil, the largest US oil producer, told CNN Business in a statement.\nExxon XOM To protect its dividend,announced Tuesday it will slash spending by 30% , including by dialing back investment in the Permian Basin shale oilfield that made the United States the world's largest producer.\nYet independent oil companies, many of which are struggling to survive, are begging Trump to use tariffs to punish Saudi Arabia and Russia for targeting high-cost US producers. That push has been driven by the Domestic Energy Producers Alliance, a coalition of oil companies led by shale pioneer Harold Hamm.\n\"Saudi Arabia and Russia are acting like energy superpowers, conspiring in illegal dumping, in an attempt to crush US energy independence and restore their ability to hold the US and the world hostage to high energy prices,\" DEPA said in a statement last month calling for a Commerce Department investigation.\nContinental Resources CLR , the fracker Hamm founded and is executive chairman of, is getting crushed by cheap oil. Not only did Continental say Tuesday it will cut production by 30%, but the company has been forced to suspend its dividend altogether.\nHamm was among a group of oil company CEOs who met with Trump at the White House Friday. During that summit, Trump expressed a willingness to use tariffs, Mike Sommers, the CEO of the American Petroleum Institute, told CNN Business after participating in the White House meeting.\nTariffs could prove to be 'futile'\nIt's not clear whether Trump is considering targeted tariffs against Russia and Saudi Arabia, blanket levies against all foreign oil or something in between. The White House did not respond to a request for comment.\nAnalysts are deeply skeptical that tariffs against Russia and Saudi Arabia would be a gamechanger in the oil industry.\n\"I'm confident that among all the different things the administration can do to help the industry, tariffs are at the bottom of the list,\" said Joe McMonigle, senior energy policy analyst at Hedgeye Risk Management and a former Energy Department official under President George W. Bush.\nThat's because the United States imported just 401,000 barrels of oil per day from Saudi Arabia in January, according to the latest stats from the US Energy Information Administration. That's down 44% from a year ago and among the lowest monthly total since the mid-1980s. Russia sent just 95,000 barrels of oil to the United States in January.\nTaken together, Russia and Saudi Arabia represent just 8% of total US oil imports.\n\"Tariffs are not really a stick. They would prove futile,\" said Paola Rodriguez-Masiu, senior oil market analyst at Rystad Energy.\n'We don't want foreign oil'\nTrump, however, sees tariffs as a way to convey US energy dominance.\n\"We're independent now; we have our own oil,\" Trump said Sunday. \"If I did the tariffs, we essentially would be saying, 'We don't want foreign oil....We're just going to use our own oil.'\"\nThe United States has certainly made huge strides towards weaning itself off foreign oil. Yet it is not truly independent.\nMore than 6 million barrels of foreign crude is still imported everyday, most of that from neighbors Canada and Mexico.\n\"The idea of the US being energy independent is just a political stump speech,\" said Michael Tran, director of global energy strategy at RBC Capital Markets.\nRefiners caught in the middle\nAnd there's a reason for those oil imports: America's decades-old refinery system can't run on US shale alone. To profitably churn out gasoline, jet fuel and diesel, these refineries require a significant amount of heavy oil that can only be found overseas. And some of those barrels have already been sidelined by US sanctions against Venezuela.\nThat means blanket tariffs against all foreign oil, or even just ones imposed against countries outside North America, could be disastrous for US refineries. Refinery margins are already very weak because of the unprecedented collapse in demand for gasoline and jet fuel caused by the coronavirus pandemic.\nGasoline margins are even flirting with negative territory, meaning refineries could actually lose money on each gallon of gasoline produced.\nAdding tariffs to that toxic mix would only exacerbate the pain for refiners.\n\"They're the ones eating the tariffs,\" said Tran. \"Trump could be catering towards the Texas oil-producing base that he needs in the fall, but he may be doing that at the detriment of the US refining industry.\"\nTariffs or not, much is riding on Thursday's OPEC meeting. Crude prices spiked by a record 32% last week on hopes of Saudi Arabia and Russia will declare a truce and massively cut their production.\n\"If OPEC and friends can't stick the landing,\" Tran said, \"it could be a very rough ride potentially back into the low-20s or even teens.\"", "url": "https://www.cnn.com/2020/04/07/business/oil-tariffs-trump-saudi-arabia-russia/index.html"}