{"authors": ["Priscilla Alvarez", "Leyla Santiago"], "date_download": "2020-05-04 16:53:43", "date_modify": "2020-05-04 16:53:43", "date_publish": "2020-04-08 11:11:50", "description": "The wide range of officials and entities involved in the federal government's response to the coronavirus pandemic has fueled confusion over who exactly is in charge of fulfilling the dire needs of hospitals nationwide -- and how supplies in high demand will ultimately be distributed.", "filename": "2020_04_08_politics_fema-governor-response_index_1588611223.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200326170029-trump-fema-0319-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_fema-governor-response_index_1588611223.html", "title": "'No one really knows who's in charge': States navigate federal agencies amid crisis", "title_page": "'No one really knows who's in charge': States navigate federal agencies amid crisis - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The wide range of officials and entities involved in the federal government's response to the coronavirus pandemic has fueled confusion over who exactly is in charge of fulfilling the dire needs of hospitals nationwide -- and how supplies in high demand will ultimately be distributed.\nNearly three weeks since taking over the federal operations response, the Federal Emergency Management Agency has enlisted help across agencies and industries to respond to an emergency of unprecedented magnitude. The vast scope of the response, as well as the involvement of the White House, President Donald Trump's son-in-law Jared Kushner , and the Pentagon, has at times perplexed governors and lawmakers desperate for equipment for their states to treat coronavirus patients.\n\"FEMA is tasked with figuring out what areas need different resources. Is it FEMA? Is it the White House? Is it HHS?\" a congressional aide told CNN. \"No one really knows who's in charge... who's making decisions.\"\nIn late March, House Homeland Security Committee Chairman Bennie Thompson, a Mississippi Democrat, requested additional information on the availability of personal protective equipment -- which is in high demand -- and on the distribution of that equipment to states in a letter to the secretaries of Homeland Security and Health and Human Services.\nWeeks later, the committee hasn't received a response. And FEMA's administrator, Pete Gaynor, has largely vanished from public view.\nBehind the scenes, Gaynor has led internal calls, connected with state delegations, including governors, and been in touch with federal agencies. Gaynor has also worked closely with Rear Admiral John Polowczyk, the vice director of logistics from the office of the Joint Chiefs at the Department of Defense, to handle supply chain needs.\nAt times, the White House, Kushner and his team have also gotten involved and micromanaged parts of the response, despite close coordination between agency heads, according to an administration official -- a move that risks throwing a wrench in response or over complicating the matter.\nKushner has made several appearances at the National Response Coordination Center -- the nerve center of FEMA's response efforts located in FEMA headquarters -- and unleashed a team of officials to embed with FEMA and HHS officials , including Adam Boehler, a former HHS official who is now the head of the US International Development Finance Corporation, and Brad Smith, the director of the Center for Medicare and Medicaid Innovation. A coterie of McKinsey consultants are also helping Kushner's team.\nA FEMA spokesperson underscored the increased coordination, given the scope of the coronavirus response, maintaining that Gaynor is still in charge of emergency management.\n\"The administrator, leadership all the way down, they're all still doing the FEMA jobs because of the magnitude of this response,\" a FEMA spokesperson told CNN, adding, \"This is a highly integrated effort.\"\n\"Jared and his team have played an integral role in connecting with the private sector and helping assess the universe of supplies out here to quickly procure supplies, and that's been his role,\" the spokesperson said.\nVice President Mike Pence, who helms the White House task force leading the public health and policy response, heralded Gaynor and Polowczyk and their efforts during Monday's briefing. \"It's an extraordinary system,\" Pence said.\nTouting a longstanding working relationship with regional FEMA partners, Casey Tingle, deputy director of the Louisiana governor's Office of Homeland Security & Emergency Preparedness, acknowledged the differences between the federal government's management of the coronavirus crisis and previous disasters in the state.\n\"Some of the things we're trying to get our hands on, like PPE and ventilators, are not things that FEMA typically stocks in large measures,\" he said.\nTypically, Tingle explained, Louisiana requests hurricane relief supplies, like water and tarps, from its regional FEMA partners, and supplies are shipped over from FEMA's own warehouse. The scope and type of the current emergency has required the country to pull from several stockpiles and most recently, expedite the shipment of supplies from overseas.\nBut it's not just securing the supplies that poses a logistical challenge for states like Louisiana. Tingle points out that decisions are not being made at a regional level, and the process for obtaining supplies as a state can be confusing and lacks transparency.\n\"In some instances, we get word that something is coming, and we go ask FEMA and they're not aware that it's coming,\" Tingle said. \"It doesn't seem to me that FEMA is in charge of making all the decisions of what requests get filled at what level. Some of that seems to be made at a higher level.\"\nInternally, FEMA has established a so-called National Resource Prioritization Cell within its Supply Chain Task Force to help coordinate allocation of equipment. The cell, composed of US government personnel, public health officials, and health care personnel, reviews data to provide recommendations to inform the prioritization of government resources and private sector distribution decisions, according to FEMA.\nThe agency told stakeholders that needs not met by the state or tribe should be sent to their respective FEMA regional office, which then directs requests to the FEMA national coordination center.\nBut Kushner has, at times, circumvented the process.\nWhile corporate executives have largely praised Kushner's efforts to help cut through red tape, inside the government, he has rankled some officials. They argue Kushner is circumventing protocols that ensure all states' requests are handled appropriately, instead directing FEMA and HHS officials to prioritize specific requests from people who are able to get Kushner on the phone.\nAt a White House briefing, Kushner touted an example of how the administration is working on supply chains, explaining how he procured N95 masks for New York's public hospital system after the President heard about a shortage from \"friends.\"\nNew York officials including Gov. Andrew Cuomo and New York City Mayor Bill De Blasio have been warning against critical mask shortages for weeks.\n\"The President's been very, very hands-on in this. He's really instructed us just to leave no stone unturned. Just this morning, very early this morning, I got a call from the President. He told me he was hearing from friends of his in New York that the New York public hospital system was running low on critical supply,\" Kushner told reporters.\nAt Trump's direction, Kushner said he inquired about the items in short supply and shortly thereafter, Trump pledged to send them to the New York public hospital system.\nIn a letter to Gaynor on Tuesday, Thompson and Democratic Rep. Carolyn Maloney of New York, the chair of the House Committee on Oversight and Reform, questioned Kushner's role.\n\"The Committees also do not understand the role in FEMA's operations of Jared Kushner, Senior Advisor to the President, although his involvement has been described as 'integral,'\" they wrote.\n\"It appears that Mr. Kushner is unclear about basic facts regarding the purpose of the Strategic National Stockpile, which he erroneously described in the following manner: 'And the notion of the federal stockpile was it's supposed to be our stockpile—it's not supposed to be state stockpiles that they then use.' Reports also indicate that Mr. Kushner may believe that requests for PPE and other medical supplies from the states may be inflated, and that '[i]n some cases, people are requesting 10 times what they actually need.'\"\nThe lack of clarity over those distribution decisions has been an ongoing theme among states seeking equipment. Even so, FEMA is continuing to shore up supplies through multiple avenues, including flying in shipments from abroad.\nThirteen flights from overseas have landed in various locations across the United States containing personal protective equipment as of Monday, according to a FEMA advisory dated April 7 and obtained by CNN.\nThe flights are part of \"Project Air Bridge,\" a FEMA initiative to expedite supplies to the US that's been heralded by Trump. Seven flights were scheduled to arrive Tuesday -- six in Chicago and one in Los Angeles, according to the advisory, which says it's \"the greatest number of air bridge flights in a single day since the start of the program.\"\nBut not all of the supplies will go directly to states . That, coupled with a slew of agencies and officials involved in the response effort, adds yet another layer of complexity to an already complicated effort.\nThis story has been updated Wednesday to include the Thompson and Maloney letter to Gaynor.", "url": "https://www.cnn.com/2020/04/08/politics/fema-governor-response/index.html"}