{"authors": ["Katie Lobosco"], "date_download": "2020-05-04 16:16:17", "date_modify": "2020-05-04 16:16:17", "date_publish": "2020-04-03 12:00:23", "description": "In an unprecedented move, the US government is automatically suspending payments and waiving interest on federal student loans for six months, providing immediate relief for more than 20 million people currently paying off their debt.", "filename": "2020_04_03_politics_student-loan-debt-suspension-economy_index_1588608977.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402154647-student-loans-graduation-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_student-loan-debt-suspension-economy_index_1588608977.html", "title": "Most student loan payments are suspended. Here's what you need to know.", "title_page": "Student loans: Most payments are suspended. Here's what you need to know. - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) In an unprecedented move, the US government is automatically suspending payments and waiving interest on federal student loans for six months , providing immediate relief for more than 20 million people currently paying off their debt.\nBut the change, which was included in the $2 trillion economic stimulus package signed into law last week by President Donald Trump , came fast and it's taking some time for some loan servicers to update their guidance.\nWhat you need to know about coronavirus\nIt's creating some confusion for borrowers, many of whom may be newly unemployed and in need of relief. Part of the uncertainty stems from the fact that the President first announced a similar, but more limited , debt relief plan for borrowers. Two weeks later, the congressional legislation extended the forbearance period from 60 days to six months and made the suspension of payments automatic.\nThe Department of Education has also announced that the waivers would be implemented retroactively to March 13. Any borrower who has made a payment since then can request a refund.\nStill, the student loan repayment system is complex. Here's what you need to know about who qualifies and how it works with existing loan forgiveness plans:\nNo, you don't need to request a forbearance\nThe legislation made the suspension of payments automatic. That will remain in place until September 30. The change will take effect retroactively to March 13, but it could take some time for it to show up on your account.\nThe Department of Education said it directed servicers to implement the changes by April 10 -- but some borrowers may still be seeing outdated information.\n\"It takes time to train people and get correct guidance out,\" said Betsy Mayotte, the founder of The Institute of Student Loan Advisors, which created a resource to help borrowers understand the new changes.\n\"I've been in this industry through a lot of disasters, 9/11 and Katrina, and these waivers are like nothing I've seen before,\" she added.\nThe interest waiver will also go into effect automatically.\nMost people qualify, but not everyone\nThe six-month suspension and interest waiver applies only to federally held loans, which covers roughly 85% of federal student loans. That includes loans known as Direct federal loans, as well as PLUS loans that parents may have taken out on behalf of their children.\nIt excludes some federal loans that are guaranteed by the government by not technically held by it. Generally, those were disbursed prior to 2010. About half of those with loans known as Federal Family Education Loans won't qualify, according to government data.\nLoan servicers should be able to tell borrowers which loans are eligible and at least one is offering some relief to those with non-qualifying loans. Navient says it will postpone payments for three months for those who request it.\nPrivate student loans are also excluded from the payment suspension and interest waivers, but some banks are offering debt relief to borrowers during the pandemic. For example, they may charge a fee for the ability to postpone payments for a period of time.\n\"If someone is struggling, they should absolutely call their lender,\" Mayotte said.\nA benefit for those seeking loan forgiveness\nThere's a bonus for those borrowers who were already enrolled in the Public Service Loan Forgiveness program or another federal forgiveness plan.\nThey won't have to make their payments over the next six months, and they will still receive credit toward the forgiveness program as if they had -- as long as they are still working full time for a qualifying employer.\nThe Public Service Loan Forgiveness program requires 120 monthly payments before borrowers see their remaining debt wiped away. Borrowers will knock off six of those without paying through September.\nCollections on defaulted debt will stop\nThe legislation suspends collections on defaulted federally owned loans, including wage and tax refund garnishment. Defaulted loans will not accrue interest through September.\nThe Department of Education is also refunding any garnishments made since March 13. It has said that 830,000 borrowers will receive $1.8 billion back\nYou can still keep paying on your loans\nIf you can afford to keep making your payments, you can do so. But auto-debits have been suspended. You may need to contact your servicer to make manual payments.\nYour payments won't be lower than they normally are. The full amount of any payment should be applied to principal once all interest accrued prior to March 13 is paid.", "url": "https://www.cnn.com/2020/04/03/politics/student-loan-debt-suspension-economy/index.html"}