{"authors": ["Opinion Peggy Drexler"], "date_download": "2020-05-04 16:25:01", "date_modify": "2020-05-04 16:25:01", "date_publish": "2020-04-07 02:21:28", "description": "The loss of Maeve Kennedy McKean and her 8-year-old son, Gideon is the latest tragedy to hit America's version of the royal family, writes Peggy Drexler.", "filename": "2020_04_06_opinions_kennedy-tragedy-maeve-giddeon-drexler_index_1588609501.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403151722-maeve-kennedy-mckean-family-2019-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_opinions_kennedy-tragedy-maeve-giddeon-drexler_index_1588609501.html", "title": "Why Americans share the pain of Kennedy tragedies", "title_page": "Why Americans share the pain of Kennedy tragedies - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Peggy Drexler is a research psychologist and the author of \"Our Fathers, Ourselves: Daughters, Fathers, and the Changing American Family\" and \"Raising Boys Without Men.\" She is at work on a book about how women are conditioned to compete with one another. The opinions expressed in this commentary are hers. View more opinion on CNN.\n(CNN) Maeve Kennedy McKean's body was recovered this afternoon while her 8-year-old son, Gideon, is presumed dead after going missing Thursday night in the Chesapeake Bay near Annapolis, Maryland. McKean -- the daughter of former Maryland Lt. Gov. Kathleen Kennedy Townsend and the granddaughter of former US Attorney General and US Senator Robert F. Kennedy -- and her son were isolating from coronavirus with their family and playing kickball in the yard when the ball went into the water. The pair took a canoe to retrieve it and never came back. Divers and boats went back to sea to search for their bodies Monday.\n\"With profound sadness, I share the news that the search for my beloved daughter Maeve and grandson Gideon has turned from rescue to recovery,\" Kennedy Townsend said in a statement Saturday.\n\"My heart is crushed, yet we shall try to summon the grace of God and what strength we have to honor the hope, energy and passion that Maeve and Gideon set forth into the world.\"\nIt is the latest tragedy to afflict the Kennedy family. The notion of a \"Kennedy curse\" dates back to 1969, when the late US Senator Ted Kennedy, Maeve McKean's great uncle, drove his car off a bridge on Martha's Vineyard, killing passenger Mary Jo Kopechne along with Ted's hope for a presidential run.\nIt was in the aftermath of that accident that Ted himself suggested his family's tragedies -- which started with the 1944 death of his oldest brother, Joe, during World War II -- were a result of an unnatural burden, some terrible luck. Although some saw the suggestion as a way for Ted to absolve himself of responsibility for Kopechne's death (he had, in fact, been drinking the night of the accident), it was hard to dispute the family had, even then, already suffered an unusual number of losses for one group of people, including the 1968 assassination of Ted's brother, Robert, and, of course, that of his other brother President John F. Kennedy in 1963.\nRead More", "url": "https://www.cnn.com/2020/04/06/opinions/kennedy-tragedy-maeve-giddeon-drexler/index.html"}