{"authors": ["Brian Melley"], "date_download": "2020-05-04 20:22:52", "date_modify": "2020-05-04 20:22:52", "date_publish": "2020-04-20 22:34:13", "description": "LOS ANGELES (AP) — An estimated 320,000 adults in Los Angeles County may have been infected with coronavirus, according to preliminary results of a study that suggests the illness is far more...", "filename": "_f5ad9442cdc645a4ae6d4cb769bcc977_1588623772.html", "image_url": "https://storage.googleapis.com/afs-prod/media/16bca844fec143e7b544d4d408fbc0aa/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f5ad9442cdc645a4ae6d4cb769bcc977_1588623772.html", "title": "Los Angeles study suggests virus much more widespread", "title_page": "Los Angeles study suggests virus much more widespread", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOS ANGELES (AP) — An estimated 320,000 adults in Los Angeles County may have been infected with coronavirus, according to preliminary results of a study that suggests the illness is far more widespread than current testing shows and the death rate is much lower.\nThe study conducted April 10-11 by the county and the University of Southern California estimated that approximately 4.1% of the county’s adult population of 8 million has antibodies to the virus. When adjusted for margin of error, the infection rate ranged from 2.8% to 5.6%, or about 220,000 to 440,000 adults.\nThe study, which was criticized by some outside experts, follows other research that has suggested more people have had coronavirus than previously determined through testing — many without symptoms or without feeling ill enough to seek a test. But it also means that more people have been silent carriers of the virus that has killed more than 1,200 people in California.\nPublic health officials emphasized that the results do not mean people should stop practicing social distancing and should assume that most people are still susceptible to the virus.\n“Given the high rate of people that may have been infected at some point with COVID-19, we need to assume that at any point in time that we could be infected and that all the other people that we come in contact with could also be infected,” Public Health Director Barbara Ferrer said.\nThe study was similar to one conducted among 3,300 Santa Clara County residents in early April that estimated 48,000 and 81,000 of the county’s 1.9 million people — a range of 2.5% to 4.2% — had been infected.\nThe Santa Clara study that used some of the same researchers as USC was heavily criticized for its methodology, which recruited volunteers on social media. The test it used — the same one used by USC — was criticized as unreliable for producing false negative or positive results.\nDr. Eric Topol, a professor of molecular medicine at Scripps Research, said the tests are not well validated and they overestimate the number of people who have been infected. Some may conclude that if that many people have been infected without symptoms severe enough to seek a test or medical attention, it’s not a major threat.\n“The problem is they’ve given a false sense that this is not a bad virus after all,” Topol said. “It’s bad math, bad tests and bad outcomes for the confusion that it engenders.”\nUnlike the Santa Clara study, USC used subjects representative of the county population who were part of a market research firm database. Neither study was peer-reviewed, a critical step to publication.\nDr. George Rutherford, an epidemiologist at University of California, San Francisco, said a lot of coronavirus research results are being released prematurely. While he doesn’t think the results will influence decisions to let people return to work, they could be problematic.\n“This is the time when ultra-critical decisions are being made,” Rutherford said. “It could come down to something someone hangs their hat on and it turns out it’s not peer reviewed ... and hyped ... and you reach an erroneous conclusion.”\nUntil the study results were announced, Los Angeles had been relying on testing people who are sick or have symptoms of the virus to determine the rate of infection. But that statistic is biased because only a limited number of people can get the test and many people are believed to be asymptomatic or could have symptoms consistent with the flu or colds also prevalent this time of year.\nAt the time the testing was conducted, the county had reported nearly 8,000 cases, meaning that the actual number was probably 28 to 55 times higher and the fatality rate was much lower than that based on the number of people tested.\n“The fatality rate is not the only number we should focus on,” said Neeraj Sood, a USC professor of public policy. “What the findings show is that only 4% of our population has been infected, which means we are very early on in the epidemic and many more people in LA County could potentially be infected. And as those number of infections rise, so will the number of deaths, the number of hospitalizations and the number of ICU admissions.”\nAs of Monday, the county had 13,816 cases out of 80,000 people tested, or 13% positive, the county reported. The county had more than 600 deaths, which accounts for about half the state’s total. The county has 10 million residents, or a quarter of the state’s population.\nTesting has been problematic around the globe with a shortage of supplies to collect and transport samples and not enough protective clothing for people who administer the test. Gov. Gavin Newsom and officials around the U.S. have said more robust testing and the ability to track people who may have been infected by each person who tests positive is key to lifting restrictions on leaving home.\nOfficials are also trying to get a better sense of how widespread the virus might be among homeless people.\nLos Angeles began sending medical teams to the streets Monday to provide homeless people with health screenings and fast-result tests for the virus.\nA line snaked down the block at a new pop-up testing clinic on Skid Row that’s staffed by the Los Angeles Fire Department. Those who are infected will be offered transportation to makeshift shelters or hotels where they can be treated while staying isolated.\nAt least 47 homeless people have tested positive for COVID-19 in Los Angeles County, health authorities said. A dozen of those were unsheltered. There are investigations at eight homeless shelters to determine if any staff or residents need to be quarantined.\nCalifornia had over 33,000 reported cases Monday and 1,225 deaths, according to a Johns Hopkins University tally.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death. The vast majority of people recover.", "url": "https://apnews.com/f5ad9442cdc645a4ae6d4cb769bcc977"}