{"authors": ["Joan Biskupic", "Cnn Legal Analyst", "Supreme Court Biographer"], "date_download": "2020-05-04 16:13:39", "date_modify": "2020-05-04 16:13:39", "date_publish": "2020-04-03 12:01:32", "description": "The Supreme Court's decision to postpone indefinitely cases related to President Donald Trump's financial records represents the latest setback to efforts by the US House to compel information from the President and White House officials.", "filename": "2020_04_03_politics_supreme_19937369743129c89dce373eef002167_index_1588608819.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200206112016-pelosi-trump-sera-siempre-un-acusado-tendra-la-cicatriz-del-juicio-politico-sot-00000000-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_supreme_19937369743129c89dce373eef002167_index_1588608819.html", "title": "Delay in Trump's financial documents cases clouds House power on investigations", "title_page": "Delay in Trump's financial documents cases clouds House power on investigations   - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The Supreme Court's decision to postpone indefinitely cases related to President Donald Trump's financial records represents the latest setback to efforts by the US House to compel information from the President and White House officials.\nAny erosion of congressional power could have consequences for future investigations, including during the Covid-19 pandemic , as lawmakers are likely to examine the Trump administration's early approach to the outbreak. House Speaker Nancy Pelosi on Thursday proposed the formation of a bipartisan select committee to exercise oversight of the federal response to the coronavirus. In polarized Washington, new complaints about stonewalling on documents and testimony would surely arise.\nThe Supreme Court postponements also increase the likelihood that Trump would not be forced to turn over personal business documents before the November election. House general counsel Douglas Letter told the justices in a written filing that lawmakers had been exploring conflicts of interest, including \"whether any foreign actors have financial leverage over President Trump and whether legislative reforms are necessary to address these risks.\"\nCurrent legal battles find a Democratic-led House pursuing a Republican president, but the contours of the law are being shaped for what might come irrespective of which political party controls Congress and the White House.\nThe nine justices have suspended their courtroom oral arguments because of the coronavirus. Yet, unlike lower federal courts, they have not announced whether they would turn to teleconference hearing alternatives or resolve cases based solely on the briefs. In limbo are some 20 cases , including the Trump disputes, that were scheduled to be heard in the final March and April sittings of the Supreme Court's 2019-2020 session.\nThe pending cases centered on Trump's financial records are only the most prominent of lawsuits arising from efforts by the President and his top aides to fight House committee demands for documents or testimony.\nTrump's personal and administration lawyers have argued that investigators lack sufficient legislative grounds to make the requests. In some cases, administration lawyers contend judges, as a threshold matter, do not possess the power to resolve these disputes between branches of government.\nA panel of the US Court of Appeals for the District of Columbia Circuit in late February sided with the administration as it ruled that judges could not prevent former White House counsel Don McGahn from defying a subpoena.\nThe House Judiciary Committee wants him to testify regarding Trump's possible obstruction of former special counsel Robert Mueller's probe into Russia's interference in the 2016 presidential election. Trump told McGahn to refuse, contending that top executive branch officials have \"absolute testimonial immunity\" from such congressional requests.\nThe full DC Circuit in March agreed to rehear that McGahn case . Arguments are scheduled for April 28.\nJudge Judith Rogers, who dissented from the 2-1 panel decision favoring the Trump administration, asserted that the panel majority removes \"any incentive for the Executive Branch to engage in the negotiation process regarding accommodation (of a subpoena), all but assures future Presidential stonewalling of Congress, and further impairs the House's ability to perform its constitutional duties.\"\nWhen the full DC Circuit agreed to hear the McGahn case anew, it voided the panel's ruling. The DC Circuit also said it would hold a similar \"en banc\" hearing in a separate dispute over the ability of judges to resolve standoffs between the branches. The second case, US House of Representatives v. Mnuchin, stems from a House challenge to the Trump administration's diversion of appropriated funds to pay for a wall at the southern border with Mexico.\nTrump and Treasury Secretary Steven Mnuchin both criticized Pelosi's announcement of the new committee related to the coronavirus pandemic on Thursday.\n\"It's not any time for witch hunts. It's time to get this enemy defeated,\" Trump said at the White House coronavirus task force briefing. \"Conducting these partisan investigations in a pandemic is a big waste of vital resources, time, attention.\"\nAnticipated cases\nThe Supreme Court cases, which had been scheduled to be heard this week, were among the most anticipated of the annual session. Lower US courts had upheld House committee subpoenas for Trump financial records dating back years from his longtime accounting firm Mazars USA and from Deutsche Bank and Capital One.\nHouse investigators contended they needed the information as the House was considering new legislation related to money laundering and government ethics.\nTrump's lawyers, who intervened to stop the subpoenas directed at Trump accountants and banks, reject the contention of a valid legislative purpose, saying that if those grounds are affirmed, any committee would force presidents to relinquish information by claiming it was writing legislation. Those appeals in Trump v. Mazars and Trump v. Deutsche Bank were scheduled to be heard on Tuesday.\nA third case scheduled for Tuesday, emerging from a New York grand jury's investigation, concerns whether a sitting president can be immune from any criminal proceeding while in office, even if any alleged misconduct occurred before the president took office. In that case, Trump v. Vance, one of the issues is whether Trump directed \"hush money\" to women who claimed to have affairs with him. Trump has denied the affairs.\nLawyers for the US House had urged the Supreme Court not to take up the Trump appeals, arguing that the President had already stalled and stymied Congress. House lawyers had stressed the time-sensitive nature of investigations by House members. They hold office for two-year terms, and any subpoena issued dissolves as the end of a congressional session.\nOverall, the paired House cases and others still in lower courts grow from Trump's decision to keep ties to private business interests, unlike past presidents who divested or used blind trusts. As House lawyers told the justices, his financial interests around the world \"pose both perceived and actual conflicts of interest.\"\n\"To determine whether and how to update ethics and conflict-of-interest laws to account for these changed circumstances,\" House lawyers insist, committee members \"must obtain information about President Trump's financial arrangements and the completeness of his disclosures.\"\nTrump's personal lawyer, William Consovoy, backed by the Department of Justice, describes the requests as politically motivated and legally invalid. DOJ contends any subpoena directed at the President must be authorized by the full chamber, not a committee, and that judges should scrutinize and reject the claim that the requested records arise from a legitimate legislative purpose.\n\"This is the first time that Congress has subpoenaed private records of a sitting President,\" Consovoy wrote on behalf of Trump, adding, \"These subpoenas are no more valid than would be demands for the President's medical records so Congress may consider health care reform.\"", "url": "https://www.cnn.com/2020/04/03/politics/supreme-court-trump-documents-coronavirus/index.html"}