{"authors": ["Jeremy Douglas"], "date_download": "2020-05-04 16:13:05", "date_modify": "2020-05-04 16:13:05", "date_publish": "2020-04-02 02:12:34", "description": "To say the global novel coronavirus pandemic is causing chaos and affecting lives in real and tangible ways is certainly no understatement.", "filename": "2020_04_01_opinions_coronav_69750613e7ef4dec21f6c227253df307_index_1588608785.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200324083914-01-southeast-asia-border-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_opinions_coronav_69750613e7ef4dec21f6c227253df307_index_1588608785.html", "title": "The coronavirus pandemic is an opportunity for organized crime in Asia", "title_page": "The coronavirus pandemic is an opportunity for organized crime in Asia - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Jeremy Douglas is the Regional Representative of the United Nations Office on Drugs and Crime (UNODC) in Southeast Asia and the Pacific. He can be followed on Twitter @jdouglasSEA. The opinions expressed in this commentary are his. View more opinion articles on CNN.\n(CNN) To say the global novel coronavirus pandemic is causing chaos and affecting lives in real and tangible ways is certainly no understatement.\nBut one impact that has not received significant attention is how its spread is hurting the efforts of governments to combat transnational organized crime and trafficking -- especially in Asia, where the outbreak began.\nThe virus and the strong measures required to combat its spread are challenging the United Nations Office on Drugs and Crime's (UNODC) ability to bring Asia's law enforcement and justice authorities together to share information and intelligence, and to plan and conduct joint operations.\nThough the movement of people and goods across borders has slowed, international and cross-border cooperation is more necessary than ever given the presence of multi-billion dollar trafficking syndicates in the region.\nPractical effects\nRead More", "url": "https://www.cnn.com/2020/04/01/opinions/coronavirus-law-enforcement-asia-intl-hnk/index.html"}