{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:13:27", "date_modify": "2020-05-04 20:13:27", "date_publish": "2020-04-29 14:03:43", "description": "More and more people can use SNAP benefits to buy groceries online.", "filename": "entry_coronavirus-food-stamps_n_5ea24319c5b669fd8921e9fa_1588623207.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8c974240000ae008e9e71.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_coronavirus-food-stamps_n_5ea24319c5b669fd8921e9fa_1588623207.html", "title": "Coronavirus Is Bringing A Big, Permanent Change To Food Benefits", "title_page": "Coronavirus Is Bringing A Big, Permanent Change To Food Benefits | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Jeanne Page of Springfield, Missouri, lost her partner of 26 years to pneumonia at the end of January. It was right before her birthday, and right before their favorite team won the Super Bowl.\n“He and I had already planned our Super Bowl snacks,” she said.\nPage, 60, went from planning what to eat to figuring out how to eat.\nThe death of her significant other meant Page would have to get by with only her meager Social Security disability benefits, and she would have to find a new place to live. She calls it a new chapter in her life.\nShe signed up for the Supplemental Nutrition Assistance Program and was quickly approved. But the benefits could only be redeemed in-store, and Page has severe agoraphobia, an anxiety disorder that makes it difficult to leave the house.\nShe soon learned she couldn’t use her food benefits to buy groceries online, either. So she began a cumbersome process of getting her next-door neighbor approved to use the benefits to buy groceries on her behalf.\nAnd then a pandemic hit, pushing many people who never thought twice about going to the grocery store to avoid it as much as possible.\nLast week, Page got good news: Missouri had applied for a waiver to let SNAP recipients buy their groceries online, and the U.S. Department of Agriculture had approved the request. A spokesperson for the Missouri Department of Social Services said SNAP recipients would be able to use their cards online within the next month. The change will allow Page to order groceries for delivery ― and she’ll be able to shop from home, just like pretty much everybody else is now doing.\n“Being able to order groceries online with my EBT card and have them delivered to my house will be a HUGE improvement in my situation,” Page said in an email. “It gives me more independence and lets me retain some dignity. I should be able to take care of myself and it’s a little bit humiliating to ask my neighbors for help.”\nFor low-income individuals living with disabilities, the grocery store struggle may soon become a thing of the past. Because of the coronavirus pandemic, the USDA has been rapidly adding states to its pilot program testing the feasibility of letting SNAP recipients use their EBT cards online, ahead of an eventual nationwide rollout.\nFood benefits were originally distributed on color-coded stamps; the shift to online retail is reminiscent of the transition from stamps to electronic benefit cards finalized in the early 2000s.\nAgriculture Secretary Sonny Perdue has said online ordering will “go a long way” in helping Americans follow social distancing guidelines laid out by the Centers for Disease Control and Prevention.\nThe online pilot program started in New York last April and expanded to Washington state at the beginning of the year. The USDA has since made online benefits available in Alabama, Iowa, Nebraska, and Oregon. They’re pending in Arizona, California, the District of Columbia, Florida, Idaho, Kentucky, Missouri North Carolina, Texas, Vermont and West Virginia.\nMore than half of the 35 million SNAP recipients nationwide live in the states that have signed up for online ordering, the USDA said last week.\nAlexi Rosenfeld via Getty Images People wearing protective masks stand in line for a supermarket in New York City on April 16.\nOnline ordering may still have been a bit of a luxury back when Congress last overhauled SNAP rules in 2018, but it’s become a routine part of life and a necessity for more households, especially since the government has urged people to stay at home. Lawmakers told the USDA to allow online redemption of SNAP benefits nationwide, but never set a deadline. The coronavirus has seemingly kicked the program into high gear.\nWhen the stay-at-home orders are rescinded, SNAP benefits will still be online. There has been little opposition to the policy.\n“Online purchases, whether or not they are made through SNAP, can increase access to fresh foods for customers in rural and urban communities alike who are not near, or able to travel to, a fresh-food retailer,” Rep. Mike Conaway (R-Texas), the former chair of the House Agriculture Committee, said at a 2016 hearing on the topic.\nDemand for grocery delivery and pickup has surged, with companies like Instacart planning to hire hundreds of thousands more workers to meet a crush of new orders.\nAmazon and Walmart are the only two retailers that accept online SNAP payments in every state where the program operates. The benefits can only be used to buy the food ― delivery fees have to be paid separately. And if the time slots for delivery or pickup are all taken, then there’s not much good the option can do. One SNAP recipient in Staten Island, New York, said she had been unable to get a delivery slot for the past six weeks.\nBut there are probably a lot of people who receive food benefits whose lives would be significantly easier if they could shop for groceries on the internet. Nationwide, 81% of SNAP households include someone who is a child, elderly or disabled.\nAs news about the highly contagious coronavirus got more and more ominous, Lisa Charles, a single mom in Crozet, Virginia, wanted to avoid going to the grocery store if she could.\nShe said her 12-year-old son is “profoundly medically complex,” with panhypopituitarism ― a deficiency in his endocrine system ― and an acquired brain injury. Charles said her son has already been to the hospital 11 times this year for pneumonia that resulted from saliva getting in his lungs. The last thing he needs is a new acute respiratory illness.\nLast month, Charles placed a pickup order for groceries from a nearby supermarket. She had to place the order a week in advance to get a time slot. When she got to the parking lot, a manager told her that if she was using an EBT card, she still had to go inside the store to pay for the food. She couldn’t just pick it up curbside like everyone else ― essentially defeating the purpose of ordering online.\nRather than take her son who uses a wheelchair and his 5-year-old brother into the store, she went home empty-handed.\nVirginia is not one of the states that the USDA has approved for online transactions, but a spokesperson for the state’s Department of Social Services said it had submitted a request. “Our EBT vendor will be able to support this request by June 1, and we have received support from participating retailers, some of which already offer on-line ordering and curbside pickup and payment,” the spokesperson said.\nCharles has basically been homebound to care for her son for the past several years. With everyone else now stuck at home and worrying about the safest way to get their groceries, it’s as though the rest of society has caught up to her dilemma. She doesn’t think food delivery should be out of reach for people who get help with their groceries from a social program.\n“It’s ridiculous,” she said. “It is not a luxury.”", "url": "https://www.huffpost.com/entry/coronavirus-food-stamps_n_5ea24319c5b669fd8921e9fa"}