{"authors": ["Bukola Adebayo", "Samson Ntale"], "date_download": "2020-05-04 16:00:16", "date_modify": "2020-05-04 16:00:16", "date_publish": "2020-04-01 13:53:12", "description": "Members of Uganda's internationally known Watoto Church children's choir who just returned from Europe are among 11 new reported cases of coronavirus in the country, President Yoweri Museveni has said.", "filename": "2020_04_01_africa_watoto-childrens-choir-coronavirus-intl_index_1588608016.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327145039-04-cnn-gfx-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_africa_watoto-childrens-choir-coronavirus-intl_index_1588608016.html", "title": "Watoto children's choir: Members in Uganda test positive for coronavirus after UK tour", "title_page": "Watoto children's choir: Members in Uganda test positive for coronavirus after UK tour - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Kampala (CNN) Members of Uganda's internationally known Watoto Church children's choir who just returned from Europe are among 11 new reported cases of coronavirus in the country, President Yoweri Museveni has said.\nTheir cluster brings the nation's total to 44 confirmed cases, Minister of Health Dr. Jane Ruth Aceng said.\nSome members of the singing group were already under government quarantine following their return in mid-March from the United Kingdom, Museveni said in a televised address on Tuesday.\nTwo groups from the famous children's choir returned two weeks ago from tours of the United Kingdom and Canada, Watoto Church said Wednesday in a statement\nMost of the new positive cases were detected in travelers who returned from the United Kingdom, according to the nation's Health Ministry. No one who'd been to Canada has shown symptoms of the virus, church leaders said.\nRead More", "url": "https://www.cnn.com/2020/04/01/africa/watoto-childrens-choir-coronavirus-intl/index.html"}