{"authors": [], "date_download": "2020-05-04 20:04:21", "date_modify": "2020-05-04 20:04:21", "date_publish": "2020-04-09 04:01:08", "description": "SANTA FE, N.M. (AP) — New Mexico is deploying self-isolation locations with food, lodging and mental counseling for members of its health care workforce who have tested positive for the...", "filename": "_4c4ca45eec30331846a384731bf5f570_1588622661.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ce1d97cc054949269048932666c9df44/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4c4ca45eec30331846a384731bf5f570_1588622661.html", "title": "New Mexico plans self-isolation spots for those with virus", "title_page": "New Mexico plans self-isolation spots for those with virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Closed stores are shown at a central plaza and shopping district amid a public health order that has closed down most retail stores and suspended dine-in restaurant service in Santa Fe, N.M., Friday, March 27, 2020. New Mexico Cabinet Secretary for Tourism Jen Schroer says the state's tourism industry will continue to suffer amid COVID-19 restrictions and vowed the state will do what it can to help hotels, tourist spots, and businesses recover once restrictions are lifted. (AP Photo/Morgan Lee)\nClosed stores are shown at a central plaza and shopping district amid a public health order that has closed down most retail stores and suspended dine-in restaurant service in Santa Fe, N.M., Friday, March 27, 2020. New Mexico Cabinet Secretary for Tourism Jen Schroer says the state's tourism industry will continue to suffer amid COVID-19 restrictions and vowed the state will do what it can to help hotels, tourist spots, and businesses recover once restrictions are lifted. (AP Photo/Morgan Lee)\nSANTA FE, N.M. (AP) — New Mexico is deploying self-isolation locations with food, lodging and mental counseling for members of its health care workforce who have tested positive for the coronavirus as well as Native American communities hit hard by the virus, Gov. Michelle Lujan Grisham announced Thursday.\nFive of the self-isolation centers were opened this week and eight more are due next week in efforts to stem the spread of the coronavirus and care for critical populations. The infection rate has surged in the northwest of the state, sweeping across much of the Navajo Nation and penetrating the small indigenous pueblos of Zia and San Felipe.\nHuman Services Secretary David Scrase said plans also are underway to dedicate an nursing home to elderly patients with COVID-19 so that they can be quickly removed form otherwise healthy assisted living centers. That isolation strategy also would also provide transitional care for elderly patients as they emerge from hospitalization or intensive care and recover.\nLujan Grisham announced that more than a dozen businesses have been served with cease and desist orders for violating public health directives that closed down many nonessential businesses.\nShe admonished people who continue to flout a stay-at-home order with large gatherings documented on social media, despite a ban of public gathering of more than five people.\n“If you can’t comply, we’re going to let you know,” she said. “We will enforce because we have an obligation to save as many lives as possible.”\nLujan Grisham held up a a portrait of her own mother who is confined to an assisted living facility as an example of the people most endangered by cavalier attitudes toward social distancing.\nIf “the nurses and the doctors who are coming to that particular facility where she lives have been to grocery stores where too many people have been, and have been at a gas station where too many people have been, and have been at a park where too many people have been,” the governor said, “then the life that you could destroy could be mine because I could lose my mother.”\nThe state’s 17th death linked to coronavirus was a woman in her 80s who lived at a retirement and nursing center in Albquerque where dozens of residents and staff have contracted the virus.\nConfirmed COVID-19 infections statewide rose to 989 on Thursday, after more than 25,000 tests.\nHealth Secretary Kathy Kunkel said the state has forged ahead with expanded testing procedures that search for asymptomatic patients that can still transmit the disease, with a focus on nursing homes, drug treatment centers and Native American pueblo communities.\nThe infection rate in three northwestern counties is nearly three times the statewide average. Seven counties in the east and northeast of the state have yet to detect an infection.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.\nIn other virus-related news:\n—Rural hospitals that have suspended non-urgent procedures while bracing for a surge in coronavirus patients have begun receiving a temporary financial lifeline from the federal government, members of New Mexico’s congressional delegation announced.\nU.S. Rep Xochitl Torres Small and Sen. Martin Heinrich say that the Gila Regional Medical Center in Silver City will receive an advance Medicare payment of $6.8 million.\nRural hospitals and clinics are being starved of usual income as they postpone elective surgeries and procedures to open up beds and equipment for a likely upswing in patients infected with COVID-19. The accelerated Medicare payments to hospitals and clinics are an outcome of the most recent coronavirus aid package.\n— Las Cruces Mayor Ken Miyagishima signed a citywide emergency proclamation Tuesday, requiring residents to keep following all the state’s current public health orders to April 30, the Las Cruces Sun News reported . The proclamation allows the city easier access to emergency funding and grants more mayoral abilities, including enacting a curfew, restricting public gatherings and requiring area evacuations.\n— Albuquerque Public School students will finish the academic year online until May 21. Seniors are expected to finish their high school careers with pass or fail grades and modified requirements, including lower passing scores for end-of-course exams, the Albuquerque Journal reported .", "url": "https://apnews.com/4c4ca45eec30331846a384731bf5f570"}