{"authors": ["Opinion Charles A. Kupchan"], "date_download": "2020-05-04 16:05:38", "date_modify": "2020-05-04 16:05:38", "date_publish": "2020-04-02 07:20:30", "description": "Charles A. Kupchan writes that Donald Trump's bumbling Covid-19 response is pushing Europe toward China at the same time that the United States is pushing Europeans away from its close partnership with America.", "filename": "2020_04_02_opinions_trump-c_f205dfc29a15593520dd3a9b8839e8a1_index_1588608338.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327170321-trump-xi-jinping-hablan-coronavirus-panorama-cnnee-00000000-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_opinions_trump-c_f205dfc29a15593520dd3a9b8839e8a1_index_1588608338.html", "title": "Trump's Covid-19 lapse gives China an opening", "title_page": "Trump's Covid-19 lapse gives China an opening - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Charles A. Kupchan is Professor of International Affairs at Georgetown University and Senior Fellow at the Council on Foreign Relations. He served in the Obama administration as Special Assistant to the President on the National Security Council from 2014-2017 and is the author of the forthcoming book \"Isolationism: A History of America's Efforts to Shield Itself from the World.\" The opinions expressed here are his own. Read more opinion at CNN.\n(CNN) Americans know all too well the adverse impact of the Covid-19 pandemic right here at home: the lost lives, the gravely ill, the overwhelmed hospitals, the severe economic downturn and spiking numbers of unemployed, the social isolation.\nBut they should also recognize that the pandemic is doing significant harm to the nation's influence and image abroad. Countries around the world still look to the United States to provide global leadership. When it comes to Covid-19, however, Washington has been missing in action, dealing the United States a self-inflicted wound.\nAfter the Ebola crisis broke out in 2014, the Obama administration jumped to it , turning to international teamwork to contain and stamp out the epidemic. In contrast, the Trump administration has been egregiously slow off the mark not only in preparing for and responding to the pandemic at home, but also in coordinating an international response.\nThe absence of US leadership has taken a particular toll on relations with America's traditional allies in Europe. Transatlantic relations have been strained ever since Trump took office. Trump's support for Britain's exit from the European Union, his disparaging attitude toward NATO allies and the principle of collective defense , his protectionist trade policies -- these and other aspects of \"America First\" have left Europeans disgruntled with and disaffected from the United States.\nThen came Covid-19. After weeks of downplaying the virus, Trump in early March finally grew alarmed as the spread of the disease led to a plunge in the US. stock market. On March 11, Trump announced sweeping restrictions on travel from most of Europe -- without providing advance warning to his European counterparts. The European Union's co-presidents issued a response that did not hide their pique: \"The Coronavirus is a global crisis, not limited to any continent and it requires cooperation rather than unilateral action. The European Union disapproves of the fact that the U.S. decision to impose a travel ban was taken unilaterally and without consultation.\"\nWhen the virus' dangerous potential became readily apparent in January, Trump should have immediately led an international effort to procure, allocate, and distribute needed medical equipment, to generate and share best practices on testing and isolation, and to advance the preparedness of lower income communities and countries that are likely to be particularly hard hit.\nInstead, it was not until March 16 -- months too late -- that Trump participated in a video conference to discuss the pandemic with the leaders of the G7, a grouping of the world's leading democracies. The following week, G7 foreign ministers could not muster the solidarity to issue a joint statement -- reportedly because Secretary of State Mike Pompeo insisted on inserting the term \"Wuhan virus\" into the communique rather than using the standard \"coronavirus\" or \"Covid-19\" terminology. The US government, in the midst of an unprecedented worldwide health emergency, broke with its key allies for the sole purpose of fingering China.\nPompeo may be so keen to score points against Beijing precisely because China so far has the upper hand when it comes to public perceptions of international efforts to handle the pandemic -- especially in Europe. Covid-19 has admittedly hit Beijing with a significant image problem. Wuhan was ground zero for the virus and the Chinese government initially suppressed information about its spread and severity.\nBut Beijing has already succeeded in putting forward a different face.\nThe same week that Trump announced his travel restrictions on Europeans, the Chinese sent a planeload of medical supplies to Italy. Thousands of Chinese masks, ventilators, and test kits have been arriving across Europe, in some cases accompanied by Chinese medics. Such assistance may be part of a Chinese charm offensive, but the bottom line is that China is stepping up for Europe at a time when the United States is nowhere to be found. \"We are not alone, there are people in the world who want to help Italy,\" remarked the Italian foreign minister, Luigi Di Maio, in response to the arrival of Chinese help.\nChina's medical assistance to Europe builds on Beijing's ongoing efforts to woo the continent through its Belt and Road Initiative, which entails massive Chinese investment in infrastructure and the construction of new trade linkages that span Eurasia. China already has financial stakes in over a dozen European ports , including major gateways in Greece and Italy. The allure of deeper ties to Asia's markets is pulling Europeans eastward.\nThe Chinese are waiting for Europe with open arms at the same time that the United States is pushing Europeans away from the close partnership with America that has served both sides of the Atlantic so well since the 1940s. Trump's bumbling response to the pandemic is only expediting this trend.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nEurope's geopolitical realignment is still in its early stages and a definitive break with the United States is by no means foreordained. Europeans still look to the United States, not China, as their partner of choice. Indeed, they are hoping and praying that Trump is a one-term president, and that whoever comes next reclaims the mantle of international leadership and teamwork.\nThe outcome of the November election may well determine the fate of the transatlantic partnership. Even as they cope with a dire emergency at home, Americans should keep in mind that they need friends abroad. Otherwise, when this pandemic abates and Americans welcome the end of social distancing, they will nonetheless find the United States a very lonely country in the world.", "url": "https://www.cnn.com/2020/04/02/opinions/trump-covid-china-charles-kupchan-opinion/index.html"}