{"authors": ["Opinion Joe Lockhart"], "date_download": "2020-05-04 16:04:48", "date_modify": "2020-05-04 16:04:48", "date_publish": "2020-04-02 02:03:20", "description": "Joe Lockhart writes that by looking over the last two months, it is clear is that President Trump and his team have had a sophisticated reelection strategy when it came to dealing with the fast spreading Covid-19 pandemic.", "filename": "2020_04_01_opinions_trump-c_f3a6f4498d4996136b51b3b79e5a8be2_index_1588608288.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331230558-01-trump-coronavirus-briefing-0331-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_opinions_trump-c_f3a6f4498d4996136b51b3b79e5a8be2_index_1588608288.html", "title": "Trump's Covid-19 reelection strategy", "title_page": "Trump's Covid-19 reelection strategy (Opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Joe Lockhart was White House press secretary from 1998-2000 in President Bill Clinton's administration. He co-hosts the podcast \"Words Matter.\" The opinions expressed in this commentary are his own. View more opinion at CNN.\n(CNN) President Donald Trump has received considerable criticism from many quarters -- governors, public health officials and doctors and nurses on the frontline -- for being unprepared for the coronavirus pandemic, and for not having a national plan to deal with it. Much of that criticism is well deserved.\nWhat is clear looking over the last two months is that the president and his team have had a sophisticated political strategy to deal with the fast spreading pandemic.\nThat strategy began in January, where at every turn the president downplayed the risks of the virus spreading in the United States . In interview after interview, and speech after speech, he assured Americans we were OK and any risk to the country was contained.\nPresident Trump pointed to the shutting down of some flights from China, and one of his aides recently inaccurately said that Trump was the first to do it. North Korea closed its borders on January 22, and Italy banned flights from China to Italy staring January 31.\nThe president's strategy was that if the US could avoid the pandemic, despite all the loud calls for more action, he would be seen as the wise leader who didn't overreact and didn't kill our economy. In an ironic twist, he co-opted former President Barack Obama's mantra of hope as a strategy. But I believe Trump had a fallback plan in case the deadly virus hit us hard and he had a political plan ready to deploy.\nWhen the virus did erupt here, the president justified his earlier comments as an attempt to keep Americans calm. He also began shifting the blame in many different directions. One of his first targets was the Obama administration, which he claimed had left him with an obsolete system not fit for a 2020 pandemic.\nThat criticism ignored the fact that Trump had already been in office for three years and had done nothing to remedy the purported deficiencies.\nThe blame game continued and shifted to China. The president renamed Covid-19 the \"China virus,\" and the secretary of state held up diplomatic communiques at the G-7 and the United Nations because other countries wouldn't join in the race-baiting name of the \"Wuhan virus.\"\nThe president ultimately backtracked ; I suspect in part because he realized Asian-Americans in swing states vote, and this strategy was politically counterproductive.\nOn Tuesday, Senate Majority Leader Mitch McConnell had another theory on the slow response: impeachment distracted everyone from the virus , which echoed Trump blaming House Speaker Nancy Pelosi earlier this week for his being distracted by impeachment.\nAll of this is belied by the fact that the president, who got his first briefing about the risk to the United States in January, according to the Washington Post, found plenty of time to play golf between that briefing and the calls for social distancing.\nThe important and lasting blame game moved to governors, and not just any governors. The president directed his criticism toward governors of big, blue states, most that he has little chance of winning in the 2020 election. So far, much of the intense outbreaks of the virus have occurred in blue states, which have much higher population density.\nBut the president made it seem that the main responsibility for any response to the pandemic was left to the governors, and he learned very early on to either ignore or deny their pleas for help. He criticized them personally for failing to be prepared. On Monday, during a conference call, Trump told Montana Gov. Steve Bullock that -- despite enormous evidence -- he hadn't heard of any problems with the testing regime.\nDuring Friday's White House briefing, Trump foreshadowed his strategy by praising the work of Florida's Republican Gov. Ron DeSantis , who sought to keep New Yorkers from coming to Florida.\nBlaming the blue state governors has a phase two also. As the virus spreads to the less densely populated states that are mostly red, the president is poised to blame the blue state governors for not doing enough to stop the spread of the virus. Thus, deflecting blame for the lack of a national response and setting up an important talking point for the fall.\nHis most insidious blame game tactic came over the weekend when he implied that New York frontline responders -- docs, nurses and hospital workers -- who were all putting their lives on the line, might be guilty of stealing desperately needed respirators and inflating the need for ventilators so they could hoard them. He publicly called out health care workers for their need of hundreds of thousands of masks when tens of thousands in the past were enough. He conveniently left out we're in the middle of a deadly pandemic.\nAnd the president had an offensive strategy prepared also. Daily briefings that last nearly 90 minutes were designed to show a president in charge, and a beneficial leader giving his people everything they wanted and needed. Trump touted big numbers on how many tests, protective equipment and ventilators were being produced every day, each time missing the context of how these numbers were just a drop in the bucket for the overall need -- both now and as the virus spreads.\nThe president also used the presence of corporate leaders to highlight what the administration was doing with the private sector. The reality, though, is that many of the things that he promised would materialize quickly simply haven't -- like a Google national website, and nationwide testing in the parking lots of Target, Walgreens, Walmart and CVS.\nAnd every day he produced public health officials who looked like they were forced to praise the president publicly in return for any chance of influencing him in private. Most of all, he flooded the press with so much misinformation that the public couldn't keep up. By the time the press had caught up with one grandiose misstatement, he was on to several others.\nAnd with Trump's approval up modestly, the briefings might be having their intended effect.\nAttacking the press in the briefings is a critical part also. He both undermines the legitimacy of the accurate press reporting and plays to his base's contempt for the press in general.\nHis latest move is the age-old practice of moving the goal posts. After spending months saying this would not be a problem in the US, the president is now posing a different test for himself. This weekend he said if he'd done nothing like many suggested, more than 2 million people would have died.\nBut because he is doing something, he claims, that number will be closer to 100,000-240,000.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nOf course, that ignores the impact of what little was done between January and February.\nClearly the President is concerned about how the pandemic will affect his reelection chances. After all, November is just seven months away. His hope, now described as an \"aspiration,\" last week to open the country by Easter may have been driven by polls showing high anxiety over the economy.\nThe president's climb down can be traced in large part to what the polls were telling him.\nAll of this confirms that while the president was slow off the mark to respond to the pandemic, he was always working off a political plan that had his reelection as the top priority.\nIn January and February his administration didn't see a political benefit in getting out ahead of this. In late March as the cases grew, that changed. But judging from his actions, it's still politics and reelection that are largely driving his response.", "url": "https://www.cnn.com/2020/04/01/opinions/trump-covid-19-response-reelection-strategy-lockhart/index.html"}