{"authors": ["On Assignment For Huffpost"], "date_download": "2020-05-04 20:17:09", "date_modify": "2020-05-04 20:17:09", "date_publish": "2020-04-28 09:45:09", "description": "Canned tuna is a great healthy stay-at-home food during the coronavirus pandemic. Here's a guide to each type, from chunk light to oil-packed.", "filename": "entry_best-canned-tuna-health_l_5ea09fa3c5b6b2e5b83c5106_1588623429.html", "image_url": "https://img.huffingtonpost.com/asset/5ea0a6df300000cf0d154b2a.jpeg?cache=ppPr8zWh6Z&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_best-canned-tuna-health_l_5ea09fa3c5b6b2e5b83c5106_1588623429.html", "title": "The Best Canned Tuna For Your Health, According To Experts", "title_page": "The Best Canned Tuna For Your Health, According To Experts | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Ah, the lowly can of tuna — how far it is has risen! Whether you spread it on a baguette, put a scoop on top of a fresh, crunchy green salad or slip it between a piece of cheese and a slice of whole grain bread for a tuna melt, there are few things a can of tuna can’t do.\nIn the age of the coronavirus pandemic’s shelter-in-place mandates, canned tuna is especially relevant. Because it comes in a can and is packed with omega-3 fatty acids and protein, it’s one of the few healthy food staples that you can grab at the grocery store in bulk and let sit in your pantry until you need it. This means fewer trips to the grocery store, which is always a plus these days.\nIf a stroll down the canned fish aisle leaves you scratching your head, though, we don’t blame you: The number of tuna options out there is overwhelming. There’s tuna in olive oil, tuna in water, chunk light tuna, yellowfin tuna ― the list goes on and on.\nSo, which tuna choices are healthiest? Let’s take a look.\nFirst things first: How much tuna is too much tuna?\nWhile fish is generally lauded as an excellent source of protein and healthy fat, it also contains mercury, which can be toxic for the body in large quantities. According to nutritionist Tamar Samuels, founder of All Great Nutrition and co-founder of Culina Health, fish and seafood tend to be higher in mercury than other foods because mercury emissions released into the air from coal-fired power plants and other industrial sources settle into the ocean, thus affecting fish.\nThe U.S. Food and Drug Administration and Environmental Protection Agency “recommend limiting intake of high-mercury fish and seafood (including tuna and other large predatory fish like shark, swordfish, tilefish and king mackerel) to no more than six ounces a week, and one can of tuna is typically five ounces,” Samuels told HuffPost.\nIf you’re pregnant, that recommendation is even lower. Because high mercury levels can have a negative impact on developing fetuses, the Environmental Working Group suggests pregnant women consume 25% less high-mercury fish than the FDA and EPA recommendation.\nTim Boyle via Getty Images Too much tuna: Options in stores abound, with little explanation of the differences between each type.\nNow, onto those often-expensive cans of fancy-looking tuna: Do they ever contain less mercury, making them safer to eat in larger quantities? Actually, yes.\n“All tuna has some mercury, but the amount does vary depending on the type of fish,” Samuels explained. “Some brands like Safe Catch do test the mercury content of each can of tuna and only sell cans that have mercury levels lower than the FDA limits. I think these are totally worth it! You can also just incorporate lower mercury fish and seafood into your diet, like canned salmon or frozen fish.”\nThe inside scoop on all those different types of tuna\nRegardless of the brand of tuna, you’ll likely see certain words pop up on cans of tuna over and over again, like slipjack, yellowfin, albacore. While you probably shouldn’t be eating canned tuna for breakfast, lunch and dinner, you can make informed decisions about the type of tuna you choose to consume, based on your personal dietary needs.\nRegistered dietician Vanessa Rissetto broke down the different types of tuna. Here’s what you need to know about each:\nChunk light tuna: “This is typically from yellowfin tuna or skipjack, meaning it’s lower in calories and fat and therefore lower in omegas and lower in mercury,” Rissetto said.\nSolid/albacore tuna: Rissetto said this type of tuna tends to be higher in calories and lower in protein and B12, and higher in mercury. “It has a mild flavor,” she added.\nYellowfin: Also referred to as ahi tuna, yellowfin tuna is higher in mercury than albacore or skipjack. It’s also high in omega-3 fatty acids.\nSkipjack: “Skipjack is the species most commonly used in canned tuna,” Rissetto said. “It is mainly sold as ‘canned light’ or ‘chunk light’ tuna, and it is also available fresh and frozen. It’s high in omega-3s, too.”\nPacked in water: “There’s no added salt or calories here, which should be taken into consideration,” Rissetto said.\nPacked in water, salt added: Rissetto said that some people like this for flavor. “But if you’re having blood pressure issues, then you would want to pay attention to the sodium content.”\nPacked in olive oil: While this can be a flavorful option with some additional healthy fats, Rissetto said to be careful what you mix it with. “Because of the fat [content], you wouldn’t want to add mayo,” she explained.", "url": "https://www.huffpost.com/entry/best-canned-tuna-health_l_5ea09fa3c5b6b2e5b83c5106"}