{"authors": ["Kaya Yurieff", "Cnn Business"], "date_download": "2020-05-04 16:26:05", "date_modify": "2020-05-04 16:26:05", "date_publish": "2020-04-07 12:58:34", "description": "Jeff Martin was enjoying a vacation with his wife Joleen in Mexico in mid-March when they woke up one morning to an onslaught of cancellations to their various Airbnb properties.", "filename": "2020_04_07_tech_airbnb-hosts-coronavirus_index_1588609565.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406091928-02-airbnb-hosts-struggle-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_tech_airbnb-hosts-coronavirus_index_1588609565.html", "title": "Airbnb hosts struggle to pay the bills as the pandemic sparks mass cancellations", "title_page": "Airbnb hosts struggle to pay the bills as the pandemic sparks mass cancellations - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Jeff Martin was enjoying a vacation with his wife Joleen in Mexico in mid-March when they woke up one morning to an onslaught of cancellations to their various Airbnb properties.\nThe couple typically sees bookings peak for their 22 Airbnb rentals mostly across Phoenix, Arizona, from January to March, largely in part to nice weather and various conferences and events. They've had about 150 cancellations so far due to the coronavirus pandemic\n\"It's like somebody dropped a nuclear bomb on our calendar,\" Martin told CNN Business. \"It's just wiped clean. It's crazy.\"\nTravelers have rushed to change their upcoming plans as the novel coronavirus spreads worldwide, and many countries and cities announced travel bans, shelter-in-place orders or quarantines. Covid-19 has infected more than 1.34 million people and killed over 74,000 worldwide, according to Johns Hopkins University\nFor over a decade, Airbnb has attracted people who have remodeled garages and spare rooms or bought new properties to earn or supplement an income. In some cases, the deluge of cancellations threatens their ability to pay their mortgage, bills or property costs. The sharp downturn has forced some Airbnb hosts to abandon their homes to make them available for long-term rentals, scramble to pause mortgage payments and stare down their dwindling bank account balances.\nJeff and Joleen Martin have 22 Airbnb listings in Arizona. They typically see peak bookings in January through March, but have seen a flood of cancellations due to coronavirus.\nMartin, who also works as a professor of education at Grand Canyon University in Phoenix, said these cancellations will likely cost about $130,000 in expected income. Although the couple doesn't own the properties they list on Airbnb, they rent them through agreements with real estate developers and sub-lease them primarily on Airbnb in a practice known as arbitrage. This allows the family to earn far more money than from Martin's day job.\n\"We're still on the hook for monthly rent,\" said Martin, adding they should be able to manage with cash reserves, as well as revenue from long-term tenants and the percentage that Airbnb is covering for cancellations, through September. \"Beyond that, it's anyone's guess what will happen to us.\"\nIn the meantime, the Martins have found some success renting locally, such as people who are going through divorces and need a place to stay. They're also offering a 70% discount for longer-term rentals.\nAirbnb itself is in a challenging position. After announcing a broader cancellation policy to appease frustrated customers, CEO Brian Chesky later apologized for not consulting hosts. Airbnb will need keep both its hosts and users happy to weather the pandemic. (Airbnb has reportedly delayed plans for a stock market debut this year.)\n$250 million to hosts to help cover the costs of coronavirus-related cancellations. It will pay hosts 25% of what they would typically get back through their individual cancellation policies. On Monday, Airbnb announced Silver Lake and Sixth Street Partners will invest $1 billion in the company. \"The new resources will support Airbnb's ongoing work to invest over the long term in its community of hosts who share their homes and experiences,\" Airbnb Last week, Airbnb announced it would give$250 million to hosts to help cover the costs of coronavirus-related cancellations. It will pay hosts 25% of what they would typically get back through their individual cancellation policies. On Monday, Airbnb announced Silver Lake and Sixth Street Partners will invest $1 billion in the company. \"The new resources will support Airbnb's ongoing work to invest over the long term in its community of hosts who share their homes and experiences,\" Airbnb said in a press release.\nDiana and Greg Pasquali converted an old garage in their Oakland, California backyard into an Airbnb cottage.\nThe company also created a $10 million \"superhost\" relief fund designated for people who rent out their own home on the platform and need help paying their rent or mortgage, and \"long-tenured\" hosts for Airbnb Experiences. Hosts can apply for grants of up to $5,000.\nThis builds on Airbnb's previous announcement to offer free or subsidized housing to people working on the front lines of the coronavirus pandemic, including health care professionals, emergency workers and relief personnel.\nHosts had mixed reactions to the financial relief announcements. Some praised the efforts; others said they've been too minimal, considering there are 2.9 million Airbnb hosts worldwide. \"I'm glad they're taking steps to support hosts financially, but I'm concerned how Airbnb will equitably make critical decisions about who gets the funds,\" Airbnb host Diana Pasquali told CNN Business. \"I hope they create a fair process to distribute funds to hosts most in need.\"\nIn private Facebook Groups for Airbnb hosts viewed by CNN Business, the announcements have set off fiery debates over how the company should be helping its hosts.\nSome Airbnb hosts said the situation prompted them to rethink their overall Airbnb strategy, such as pivoting to longer-term rentals, offering their property for alternative uses such as office space for people working remotely, or listing on competing sites, such as HomeAway, Facebook Marketplace or Craigslist. Some are considering offering guests discounts or gift cards for future bookings.\nAirbnb hosts Chris (left) and Marty Morrow on their boat in San Diego County in August 2019. They are temporarily living on their boat to make their home available for longer-term stays on Airbnb.\nChris Morrow and her husband Marty, who typically rent out their home on Airbnb on weekends to help pay their mortgage, temporarily moved out of their house in San Diego County to rent it to health care workers, first responders or other people in need. They said the house, where they've lived for seven years, will be available at an 80% discount for stays of at least 30 days. (They're currently living on their boat nearby.)\n\"We never expected to have to move out of our first home,\" she said, adding the fee they're charging will go toward utility bills. \"It's emotional because we live here on the weekdays and the house is furnished and set up for us by us. We are hoping to receive an invitation from Airbnb to receive the $5,000 grant.\"\nnow has more than 24,000 subscribers, will help them earn additional income. So far, they've made $400 from YouTube's monetization offerings. Morrow has also filed for unemployment and a small business loan. Morrow started a YouTube channel documenting their life on the boat during the coronavirus pandemic. The couple hopes the channel, whichnow has more than 24,000 subscribers, will help them earn additional income. So far, they've made $400 from YouTube's monetization offerings.Morrow has also filed for unemployment and a small business loan.\nan old garage in their Oakland, California, backyard into an Airbnb cottage for additional income that helps cover their mortgage and pay for childcare. But when Airbnb hosts like Pasquali and her husband Greg are thinking creatively about how to attract people to their rental. Four years ago, the couple convertedan old garage intheir Oakland, California, backyard into an Airbnb cottage for additional income that helps cover their mortgage and pay for childcare.But when the shelter-in-place order happened in the San Francisco Bay Area, guests canceled. \"The reality is, we're losing thousands of dollars a month [right now],\" she said. \"It will make things tighter for our family for awhile, and that's hard.\"\nShe recently was able to rent out the cottage for a one-day photo shoot, but otherwise hasn't had luck in securing new bookings. With more people working from home, Pasquali suggests other hosts rent out properties as temporary office space. She is also mulling discounts for people who book a future stay or may offer gift cards.\nStill, it may be next to impossible to make up for all of the cancellations.\n\"I would imagine that people are hesitant to spend money right now, and they're hesitant to book future travel,\" Pasquali said. \"For us, we're just going to lose the income. There's no other way for us to make it up.\"", "url": "https://www.cnn.com/2020/04/07/tech/airbnb-hosts-coronavirus/index.html"}