{"authors": ["Alicia Lee"], "date_download": "2020-05-04 16:28:31", "date_modify": "2020-05-04 16:28:31", "date_publish": "2020-03-23 16:49:14", "description": "As the US grapples with the rapid spread of the novel coronavirus that has the health care system at a tipping point, a growing number of states are ordering their residents to stay at home.", "filename": "2020_03_23_us_coronavirus-w_7bd065317d197c2f47aaae3db4295c9d_index_1588609711.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200323103821-01-new-york-coronavirus-empty-streets-0322-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_23_us_coronavirus-w_7bd065317d197c2f47aaae3db4295c9d_index_1588609711.html", "title": "Stay-at-home orders: Which states are implementing them", "title_page": "Stay-at-home orders: Which states are implementing them - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Though the White House has advised all Americans to practice social distancing, the number of coronavirus cases in the US continues to rise. So, governors are taking stronger action by issuing stay-at-home orders.\nThese are the states that have implemented stay-at-home orders. CNN will update the list as more do so.\nAlabama\nOn April 3, Gov. Kay Ivey issued an order, effective for the next day at 5 p.m.\nThe order says: \"Every person is ordered to stay at his or her place of residence except as necessary to perform any of the following 'essential activities.'\"\nIn the list of exempted activities -- religious services, for example -- the state health officer wrote no more than 10 people can gather.\nAlaska\nAlaska ordered its residents to stay at home unless absolutely necessary, starting March 28. Limited outdoor activities are allowed as long as social distancing of 6 feet is maintained.\nPeople also are ordered to avoid travel between communities, Alaska Department of Health and Social Services Commissioner Adam Crum said.\nThe mandates will be reconsidered by April 11, Crum said.\nArizona\nGov. Doug Ducey has ordered residents to stay at home unless they have to be out for essential business. The order went into effect at 5 p.m. on March 31.\nDucey encouraged people to continue to engage in outdoor activities using social distancing. He also said it's important that people stay in touch with one another.\n\"This is going to be a tough month ... or two,\" Ducey said.\nThe new order comes on the same day that state officials ordered all schools to remain closed for the remainder of the academic year.\nCalifornia\nOn March 19, Gov. Gavin Newsom became the first governor to set mandatory stay-at-home restrictions to help combat the coronavirus.\nSince the order went into effect, all nonessential services such as dine-in restaurants, bars, gyms and convention centers have been shut down.\nEssential services, such as grocery stores, pharmacies, gas stations, food banks, convenience stores and delivery restaurants, have remained open. So have banks, local government offices that provide services and law enforcement agencies.\nWhile the order is not being enforced by police, Newsom urged all Californians to stay at home. Residents who need to leave home to take part in essential activities are advised to practice social distancing.\nColorado\nGov. Jared Polis declared a stay-at-home order , beginning March 26 and extending through at least April 11. Coloradans must stay at home unless they need to leave for necessary business, according to Polis.\nWhile critical businesses are exempt from the order, they must comply with social distancing requirements. Simple guidance wasn't enough, Polis said. \"Now is the time to stay home.\"\nConnecticut\nUnder Gov. Ned Lamont's executive order, all nonessential businesses and nonprofit entities were told to close.\nThe order excludes any essential business or entity providing essential services such as health care, food service, law enforcement and similar critical services, according to a news release.\nNonessential public gatherings of any size should be canceled, and if residents must leave their home, they should not travel in groups and should keep at least 6 feet away from each other when possible, the governor advised.\nDelaware\nGov. John Carney issued a statewide stay-at-home order that went into effect March 24 and will remain until May 15 or until the \"public health threat is eliminated.\"\nThe order advises residents to stay at home whenever possible and close all nonessential businesses, according to a news release.\nDelaware residents may leave their home for essential activities, such as getting groceries, seeing a doctor and engaging in \"other activities essential to their health, and the health and well-being of their family members, including pets,\" Carney said.\n\"Delawareans may also engage in outdoor activity, but must adhere to social distancing guidelines,\" Carney said.\nDistrict of Columbia\nMayor Muriel Bowser has issued a stay-at home order that directs residents to stay at home except for essential activities, such as grocery shopping or obtaining medical care.\n\"Any individual who willfully violates the order may be guilty of a misdemeanor and, upon conviction, subject to a fine not exceeding $5,000, imprisonment for not more than 90 days, or both,\" Bowser said in a tweet.\nFlorida\nGov. Ron DeSantis issued a \"Safer at Home\" order that goes into effect April 3. It limits movement outside homes to providing or getting essential services or carrying out essential activities. That also applies to interaction with other people outside of residents' homes. The order is in effect until April 30.\nReligious services conducted in churches, synagogues and houses of worship are counted as \"essential business\" and are exempt from the order.\nGeorgia\nGeorgia Gov. Brian Kemp announced a statewide shelter-in-place order that goes into effect April 3 and runs until April 13. Details of the order are expected to be finalized April 2.\nPublic schools will be closed for the remainder of the school year, Kemp added.\nThe mayor of Atlanta, the state's largest city, issued a 14-day stay-at-home order on March 23.\nHawaii\nGov. David Ige issued a \"stay at home\" order for Hawaii residents. The order took effect March 25 and will last through at least April 30.\n\"These actions are extreme, but necessary, to flatten the curve and lay the groundwork for our recovery,\" Ige said.\nExceptions to the order are being made for essential services, medical care and grocery shopping.\nIdaho\nGov. Brad Little issued a stay-at-home order March 25 that went into effect immediately and extends for at least 21 days.\nIdaho residents can still leave home to obtain essential services, but the order closes all nonessential businesses, and restaurants can provide only delivery or takeout options.\nLittle has also activated the Idaho National Guard to \"assist civil authorities and local jurisdictions\" with executing the state's coronavirus response. He did not specify any specific mission or role for the National Guard but did say in Wednesday's news conference that they are preparing to \"stand up a joint task force, if requested.\"\nIllinois\nResidents can go to grocery stores, pharmacies, medical offices, hospitals and gas stations. They can still go running or hiking and walk their dogs, according to the governor.\nIndiana\nis set to last through April 6. Gov. Eric Holcomb issued an order that went into effect March 24 andApril 6.\nEssential employees, including health care workers, grocery and transit workers, among others, can leave their home. Indiana residents can leave their home to exercise, Holcomb said.\nThe governor added that the Indiana National Guard is not assisting with enforcing the order, but it is assisting in the distribution of hospital supplies the state receives.\nKansas\nGov. Laura Kelly issued a general stay-at-home order starting March 30 at 12:01 a.m.\nThe order allows for several exemptions, including traveling to essential work, and getting food, medicine and medical care, and other household necessities.\nOutdoor activity is allowed, provided people maintain a distance of 6 feet from one another, and gatherings are limited to 10 people.\nThe measure initially was scheduled to be in place until at least April 19.\nThe Kansas Department of Health and Environment earlier ordered 14-day quarantines for Kansans who traveled to California, Florida, Illinois, New Jersey, New York and Washington, starting March 23.\nKentucky\nKentucky has issued a \"Healthy at Home\" order encouraging residents starting March 26 to stay at home and directing only life-sustaining businesses to remain open starting.\nGov. Andy Beshear issued an executive order on March 29 banning Kentuckians' travel to other states, except for job-required and health care-related travel, need-based trips for those who live on the border, and in cases of court orders. Those who return to Kentucky from out of state must to quarantine for 14 days.\nLouisiana\nBel Edwards said he will extend it through April 30. The order took effect March 23, andBel Edwards said he will extend it through April 30.\nToday, I am issuing a statewide Stay at Home order that goes into effect at 5 p.m. Monday, March 23, to further fight the spread of COVID-19 in Louisiana, as the number of confirmed cases is now more than 800. #lagov #lalege\n📰: https://t.co/wOccTZmd0z pic.twitter.com/v5XHoMseQZ — John Bel Edwards (@LouisianaGov) March 22, 2020\nWhile state buildings and other essential businesses such as grocery stores, pharmacies and doctors' offices will remain open, nonessential businesses were ordered to close.\nRestaurants remain open for drive-thru, delivery and takeout options only.\nMaine\nMaine Gov. Janet Mills issued an order requiring people to stay at home, unless for an essential job or an essential personal reason.\nThe order is to start on April 2 and initially was scheduled to last through April 30.\nMaryland\nGov. Larry Hogan announced a statewide stay-at-home order after Maryland reported 1,400 coronavirus cases.\nThe order, which went into effect March 30 at 8 p.m., restricts residents from leaving their homes except to visit grocery stores and pharmacies, to seek medical attention or to exercise.\nHogan's order also limited gatherings to no more than 10 people.\nEssential businesses, which the order didn't specifically define, will remain open but must limit contact between customers and staff, according to the order. Theaters, malls, fitness centers, nursing homes and restaurants that can't deliver or provide take-out must close, according to a copy of the order obtained by CNN affiliate WJZ\nMassachusetts\nGov. Charlie Baker issued an emergency order requiring all businesses and organizations that do not provide essential services to close their physical workplaces, but these businesses are encouraged to continue their operations remotely.\nThe order, effective March 24 through May 4 , limits gatherings to 10 people in confined spaces, but does not prohibit gatherings of more than 10 people in an outdoor space, such as a park or athletic field, according to a news release.\nMichigan\nGov. Gretchen Whitmer has ordered Michigan residents to stay at home unless they are critical workers. The order went into effect March 24 and was to last for at least the next three weeks, according to a news release from her office.\nWhitmer is banning gatherings, public and private, of any number of people. This does not apply to single households where people may already live together.\n\"This is an unprecedented crisis that requires all of us working together to protect our families and our communities,\" Whitmer said in the news release. \"If we all come together, get serious, and do our part by staying home, we can stay safe and save lives.\"\nMinnesota\nGov. Tim Walz ordered Minnesota's 5.6 million residents to shelter in place starting 11:59 p.m. on March 27 until April 10.\nResidents can still leave their homes for groceries and exercise, Walz said, adding that he hopes to \"strike a proper balance\" of \"making sure our economy can function\" while protecting the most vulnerable and slowing the rate of transmission.\nMississippi\nMississippi Gov. Tate Reeves issued a shelter-in-place order effective April 3 at 5 p.m. Residents are to leave their homes only for \"essential activities, such as caring for someone in the vulnerable population, getting food or necessary supplies, and working for an essential business,\" according to the order.\nPeople are ordered to keep a 6-foot distance from others and avoid groups of 10 or more. Nonessential gatherings of more than 10 people are not allowed.\nMissouri\nMissouri Gov. Mike Parson issued a statewide \"Stay Home Missouri\" order April 3. The order takes effect at 12:01 a.m. on April 6 until 11:59 p.m. on April 24, a news release from Parson's office said.\nThe order says individuals living in Missouri must avoid leaving their homes or places of residence unless necessary. The order does not prohibit people from going out for \"essential services,\" like grocery stores, gas stations, banks or outdoor recreation, as long as precautions are taken and social distancing requirements are met.\nPeople are advised to avoid eating or drinking at restaurants or bars, but takeout and delivery are allowed, the release said.\nMontana\nGov. Steve Bullock has ordered all citizens to stay at home except for essential work and limited outdoor activities. The order went into effect March 28.\n\"With 90 cases in our state today ... we have to do more to curtail the spread of this virus,\" Bullock said. \"I'd rather be accused of overreacting than to have our health care system overwhelmed. In order to have a healthy economy, we need to have a healthy population.\"\nNevada\nGov. Steve Sisolak issued a \"stay at home\" directive, effective at midnight April 1.\nIt orders people to stay at home, with exceptions such as leaving for certain essential jobs or obtaining services from essential business, including grocery stores.\nThe order extended previously announced closures -- of non-essential businesses, gaming operations and schools -- through at least April 30.\nGatherings of 10 people or more are banned, the governor's office said.\nNew Hampshire\nGov. Chris Sununu issued a stay-at-home order to go into effect on March 27 and last until May 4. Nonessential businesses, including all state beaches along the coast, were ordered to close by the end of the day March 27.\nSununu clarified on Twitter that this is \"not a shelter in place. No one will be prevented from leaving their home & the state is not closing its borders.\"\nThe order advises residents to stay at home and leave only for essentials.\nNew Jersey\nIn New Jersey, a stay-at-home order has been in effect since March 21 . The order prohibits all gatherings, such as celebrations, according to Gov. Phil Murphy.\nThe executive order requires all retail businesses to close except for essential businesses, including pharmacies and medical marijuana dispensaries, grocery stores, gas stations, pet stores, laundromats, banks, liquor stores and mail and delivery stores.\nOn April 7, Murphy expanded the order to include all state and county parks and state forests.\nNew Mexico\nGov. Michelle Lujan Grisham instituted a \"statewide stay-at-home instruction\" beginning March 24, according to a series of tweets on her official account.\n\"All New Mexicans are instructed to stay at home except for outings essential to health, safety, and welfare,\" Grisham wrote in a tweet.\nToday I am announcing that effective tomorrow at 8 AM, New Mexico will be under a statewide stay-at-home instruction. All New Mexicans are instructed to stay at home except for outings essential to health, safety, and welfare. #AllTogetherNM #coronavirus pic.twitter.com/py4oeOjWm1 — Michelle Lujan Grisham (@GovMLG) March 23, 2020\nThe governor declared that \"all businesses except those deemed essential to public health, safety and well-being will be ordered closed,\" according to the series of tweets.\n\"Our society must continue to operate -- but in an extremely limited way,\" she said.\nNew York\nUnder the executive order, which took effect March 22, civil fines and mandatory closures will be issued to businesses that don't comply, Cuomo said.\nCivil fines, however, will not be issued for individuals who violate the policy, the governor said. Nonessential gatherings are restricted, and individuals are being asked to limit outdoor recreational activities to non-contact activities.\nFor essential workers who must go out in public, Cuomo encouraged social distancing. Grocery stores, food delivery service and public transportation are still operational.\nNorth Carolina\nGov. Roy Cooper has issued a stay-at-home order for North Carolina that went into effect March 30 at 5 p.m.\nResidents may leave their home for essential activities, but if they need to go outside, they must maintain social distancing of at least 6 feet from other people, the order states. All nonessential businesses must close. The order limits gatherings to 10 people or less.\n\"Being apart from family & friends is difficult,\" Cooper said in a tweet . \"But we have to act now in the safest, smartest way when we have the chance to save lives.\"\nOhio\nOn March 22, Gov. Mike DeWine announced he was issuing a statewide stay-at-home order.\nThe order went into effect March 23 and was to remain in place until at least April 6, DeWine said.\nEssential businesses and restaurants for takeout will be allowed to stay open. The governor encouraged Ohioans to maintain a distance of at least 6 feet from others if they need to go outside.\nOklahoma\nGov. Kevin Stitt has issued a statewide \"Safer at Home\" order for adults over the age of 65 and other vulnerable residents until April 30.\nAll nonessential businesses will remain closed during this time, including gyms, barbers, tattoo and massage parlors, he said.\n\"I don't make these decisions lightly but based on the data, we need to take action,\" Stitt said.\nOregon\nOn March 23, Gov. Kate Brown issued an executive order telling Oregon residents to stay home except for essential needs.\nThe order, effective immediately, prohibits all nonessential social and recreational gatherings, regardless of size, according to her office.\nI want to make it perfectly clear what's allowed and what's not under my new Executive Order. If you're still not sure about an activity, skip it. Staying home will save lives. pic.twitter.com/Fi8i1oxv4C — Governor Kate Brown (@OregonGovBrown) March 23, 2020\nThe order closes retail businesses in which close personal contact is difficult to avoid, such as barber shops, arcades, gyms and theaters. Businesses that are not closed by the order must implement social distancing policies in order to remain open, her office said.\nFailure to follow the new order could be punished as a misdemeanor.\n\"If businesses are not complying with this order, we will shut them down,\" Brown said.\nPennsylvania\nGov. Tim Wolf issued stay-at-home orders on all 67 Pennsylvania counties, effective April 1 at 8 p.m. until April 30.\nResidents may only leave their homes to perform essential activities and while engaging in outdoor activity such as walking or running is allowed, people must maintain social distancing.\n\"This statewide stay-at-home order is not just to protect ourselves from exposure to COVID-19, but it protects those on the front lines,\" Secretary of Health Dr. Rachel Levine said in a news release. \"Staying at home doesn't mean making a daily stop at the grocery store because you need to get out of the house. Staying at home means you must stay at home.\"\nRhode Island\n\"This means unless you're getting food, medicine, gas or going to work, you need to stay home,\" she wrote on Twitter.\nGatherings of more than five people are prohibited under this order\n• Is closing all \"non-critical retail businesses,\" starting March 30. The order specifies many types of businesses that can stay open . The allowed businesses include food stores, pharmacies, gas stations, auto repair stores, banks and firearms stores, to name just a few. Restaurants can operate for pickup and delivery.\n• Says any person traveling from any other state \"for a non-work-related purpose\" must immediately self-quarantine for 14 days, though health care and public safety workers are exempt. Rhode Island residents who must travel to another state for work can do so but must self-quarantine at home in Rhode Island while not working.\nA separate order says anyone entering Rhode Island from New York must self-quarantine for 14 days, citing the high number of coronavirus cases in New York. It runs from March 26 to April 26. Law enforcement may pull over people with New York license plates to record their contact information and inform them of the self-quarantine order, Raimondo said March 27.\nSouth Carolina\nOn April 6, Gov. Henry McMaster announced a mandatory \"home or work\" order.\nThe order goes into effect April 7 at 5 p.m. Under it, everyone in South Carolina should stay home unless they are working, visiting family, exercising outside at a safe distance or obtaining necessary goods or services, McMaster said.\nI have issued a Home or Work order. All South Carolinians must remain at home or work unless visiting family, exercising, or obtaining essential goods or services.\n(1/) https://t.co/IWtiQXz5qJ — Gov. Henry McMaster (@henrymcmaster) April 6, 2020\nSouth Carolina was one of the last states in the nation to issue a stay-at-home order, which McMaster states are previous recommendations \"becoming orders with criminal penalties attached.\"\n\"This is a stay at home order. You call it what you like,\" McMaster told reporters.\nTennessee\nGov. Bill Lee announced April 2 he was issuing an order because data showed Tennesseans were moving around too much.\n\"Over the last few weeks, we have seen decreases in movement around the state as Tennesseans socially distance and stay at home,\" said the governor, who had been criticized for not issuing an order. \"However, in recent days we have seen data indicating that movement may be increasing and we must get these numbers trending back down.\"\nHe said he updated a previous executive order to require that people only leave their homes for essential activities.\nThe order is in effect until April 14.\nTexas\nGov. Greg Abbott ordered all Texans to stay home beginning at 12:01 a.m. on April 2 through the month's end.\nResidents must stay home unless providing essential services or doing \"essential things like going to the grocery store,\" Abbott said in a video posted April 1 to Twitter.\nAbbott in an executive order signed days earlier had been reluctant to use the term \"shelter in place\" or \"stay at home\" because it references an imminent disaster such as a tornado, he said March 31.\nAbbott also ordered 14-day quarantines for people flying to Texas from New York, New Jersey, Connecticut, Washington, California, Louisiana, Miami, Detroit, Chicago and Atlanta or motorists driving from Louisiana.\nMany of the state's counties previously had issued stay-at-home orders, including Dallas, Harris and Bexar.\nVirginia\nGov. Ralph Northam issued a stay-at-home order effective March 30. Everyone must stay at home unless leaving to get food, supplies, going to work, seeking medical care or going outside to get exercise.\nNortham said his order is partially in response to seeing beaches in his state \"literally packed\" over the weekend. Beaches are now closed except to those exercising or fishing, Northam said.\nVermont\nGov. Phil Scott issued a \"Stay Home, Stay Safe\" order which directs all in-person operations and nonessential businesses to close from March 25 until at least April 15.\nUnder the order, Vermonters should leave the house only for reasons that are critical to health and safety, according to a news release.\n\"I fully recognize the emotional, financial and economic impact of these decisions, but based on the best science we have available, these measures are necessary,\" Scott said.\nWashington\nGov. Jay Inslee issued a \" Stay Home, Stay Healthy \" order March 23, requiring Washington residents to stay at home for the next two weeks. The order took effect immediately. Exceptions are made for critical jobs and grocery shopping.\nThe order does not prohibit people from going outside for a walk, Inslee says, but people must keep 6 feet away from each other.\nEffective immediately, all Washingtonians must stay home unless they are pursuing an essential activity.\nThose include:\n➡️ Grocery shopping\n➡️ Doctor appointments\n➡️ Essential work duty — Governor Jay Inslee (@GovInslee) March 24, 2020\nThe order includes a ban on all gatherings and \"the closure of many businesses.\" Inslee said the only businesses that are allowed to stay in operation for the next two weeks are those that are \"essential to the healthy functioning of our community or are able to let employees work remotely from home.\" Those essential positions include medical professionals and pharmacists.\nWhile the general order takes effect immediately, the governor's office says nonessential businesses had until March 25 to close.\n\"It's time to hunker down in order to win this fight,\" Inslee said in a televised address.\nWest Virginia\nGov. Jim Justice issued a stay-at-home order that went into effect on March 24.\nJustice is directing all West Virginia residents to only leave home for essential needs. Taking a walk, riding a bike and being out in nature for exercise is allowed, but people should stay at least 6 feet away from others.\nAll nonessential businesses should close, and restaurants should only offer takeout, delivery or drive-thru, the governor said.\nWisconsin\nGov. Tony Evers issued a \"Safer at Home\" order that prohibits all nonessential travel. The order went into effect March 25 and remains until April 24 or until a superseding order is issued.\nThe order allows Wisconsin residents to leave the house for essential tasks such as visiting the doctor, caring for family members in another household or getting groceries, but people should stay at home as much as possible.\nEssential businesses allowed to remain operating include banks, pharmacies, grocery stores and gas stations.", "url": "https://www.cnn.com/2020/03/23/us/coronavirus-which-states-stay-at-home-order-trnd/index.html"}