{"authors": ["Rachel La Corte"], "date_download": "2020-05-04 21:09:20", "date_modify": "2020-05-04 21:09:20", "date_publish": "2020-04-13 19:33:09", "description": "OLYMPIA, Wash. (AP) — The governors of Washington, California and Oregon announced Monday they’ll work together to re-open their economies while continuing to control the spread of COVID-19,...", "filename": "_350d2362358f1549107ecf78b9afae8a_1588626560.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b2b2e790b28245ffab1d32a670cd7597/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_350d2362358f1549107ecf78b9afae8a_1588626560.html", "title": "Washington, Oregon, California announce coronavirus pact", "title_page": "Washington, Oregon, California announce coronavirus pact ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Washington Gov. Jay Inslee speaks during a news conference Monday, April 13, 2020, at the Capitol in Olympia, Wash. Inslee, along with California Gov. Gavin Newsom and Oregon Gov. Kate Brown, announced Monday that they will work together to re-open their economies while continuing to control the spread of COVID-19. (AP Photo/Ted S. Warren)\nWashington Gov. Jay Inslee speaks during a news conference Monday, April 13, 2020, at the Capitol in Olympia, Wash. Inslee, along with California Gov. Gavin Newsom and Oregon Gov. Kate Brown, announced Monday that they will work together to re-open their economies while continuing to control the spread of COVID-19. (AP Photo/Ted S. Warren)\nOLYMPIA, Wash. (AP) — The governors of Washington, California and Oregon announced Monday they’ll work together to re-open their economies while continuing to control the spread of COVID-19, though Washington Gov. Inslee said that there are no set timelines and that the states will retain the ability to pick the dates they want to lift their restrictions.\nInslee said at a news conference that the partnership with California Gov. Gavin Newsom and Oregon Gov. Kate Brown has resulted in “a statement of broad principles that will abide across the West Coast.”\nWhile each state is building a state-specific plan, the three states have agreed to a framework that focuses on them working together, putting their residents’ health first, and letting science guide decisions.\n“This pact is about what do we do after we reduce some of our social distancing stay home initiatives,” Inslee said. “It’s more of the issue of how are we going to have consistent-as-we-can testing and contact tracing initiatives. In order for any of these three states to be successful we simply have to have increased products available with which to do this testing. This is absolutely critical.”\nThe Seattle-area saw the nation’s first COVID-19 outbreak, with dozens of deaths tied to a suburban nursing home. California, too, saw an early outbreak and the San Francisco-area was the first major region to impose stringent stay-at-home policies.\n“COVID-19 has preyed upon our interconnectedness,” the three governors wrote in the official announcement. “In the coming weeks, the West Coast will flip the script on COVID-19 – with our states acting in close coordination and collaboration to ensure the virus can never spread wildly in our communities.”\nThe governors said that while each state has made progress in slowing the spread of COVID-19 each state’s public health leaders will focus on four goals: Protecting vulnerable populations — such as those in nursing homes — who are at risk if infected; ensuring adequate hospital capacity and personal protective equipment in order to care for those who may get sick; mitigating the non-direct COVID-19 health impacts, particularly on disadvantaged communities; and protecting the general public “by ensuring any successful lifting of interventions includes the development of a system for testing, tracking and isolating.”\nInslee said “we know we have to have measures of testing and contact tracing and the ability to come out of this in a rational, thoughtful, scientifically-based way.”\n“I am pleased we are moving as a region on basic principles so we can be as coordinated as possible,” he said.\nThe West Coast pact announcement came the same day several northeastern states — Connecticut, Delaware, Massachusetts, New Jersey, New York, Pennsylvania and Rhode Island — announced a similar compact.\nWashington state’s stay-at-home order is currently in place through May 4, though Inslee has warned that it is possible the order may have to be extended once again.\nMore than 10,400 people in Washington state have tested positive for COVID-19 and at least 508 have died. The virus causes mild to moderate symptoms in most patients, and the vast majority recover. But it is highly contagious and can be spread by those who appear healthy and can cause severe illness and death in some patients, particularly the elderly and those with underlying health conditions.\nInslee said officials will be looking at a range of data, including the rate of infection, rate of fatalities and percentage of positive tests.\n“All of those things need to be low enough to give us confidence that we can have a second part strategy to keep that rebound from happening,” he said.\nInslee’s chief of staff, David Postman, said that the initial statement released by the West Coast states was the beginning of the work, and that they are committed to trying to find ways to collaborate.\n“There’s nothing in this agreement that binds any state to do anything with any other state,” he said. “It’s not mandated actions or timelines by any state. It’s a way for us to share expertise, information, alert people to pitfalls. We think there’s just a value in having a consistent approach to the economy up and down the West Coast.\nPostman said he doesn’t expect any detailed plan to emerge in the next couple of days, but said instead there will likely soon be more information on specific principles and measurements each state will look at.", "url": "https://apnews.com/350d2362358f1549107ecf78b9afae8a"}