{"authors": [], "date_download": "2020-05-04 20:04:33", "date_modify": "2020-05-04 20:04:33", "date_publish": "2020-04-07 16:30:57", "description": "PROVIDENCE, R.I. (AP) — Gov. Gina Raimondo on Tuesday extended to May 8 a series of executive orders meant to keep Rhode Islanders at home during the pandemic. The orders limit social...", "filename": "_38cbaaf5a39db359a46c45278374aece_1588622673.html", "image_url": "https://storage.googleapis.com/afs-prod/media/067c163b63dc4c8ebeb06e90160f84f6/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_38cbaaf5a39db359a46c45278374aece_1588622673.html", "title": "State orders extended to May 8; Providence parks closed", "title_page": "State orders extended to May 8; Providence parks closed", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "People read and walk through India Point Park, in Providence, R.I., as temperatures reach the 60s, Monday, April 6, 2020. Many people are working from home out of concern for the coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Steven Senne)\nPeople read and walk through India Point Park, in Providence, R.I., as temperatures reach the 60s, Monday, April 6, 2020. Many people are working from home out of concern for the coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Steven Senne)\nPROVIDENCE, R.I. (AP) — Gov. Gina Raimondo on Tuesday extended to May 8 a series of executive orders meant to keep Rhode Islanders at home during the pandemic.\nThe orders limit social gatherings to no more than five people, close restaurants for dine-in service, shutter entertainment, recreation and other non-essential businesses, and mandate arriving travelers to self-quarantine for 14 days.\nA look at more coronavirus developments in Rhode Island:\nPARKS CLOSED:\nProvidence is shuttering parks and recreational areas to control the spread of the coronavirus as springtime weather is drawing more residents outdoors.\nDemocratic Mayor Jorge Elorza said the order that took effect at noon Tuesday covers all green spaces, dog parks, sports fields and courts, and off-road trails. That includes the popular Roger Williams Park, Blackstone Boulevard and Pleasant Valley Parkway, he said.\nGolf courses also will be closed effective Wednesday. Violators could face fines ranging from $100 to $500.\nElorza said people should stay close to home and go outside alone or only in small groups.\n__\nVIRUS CASES\nThirty people have died and more than 1,200 have tested positive in Rhode Island since the pandemic started, Raimondo said Tuesday.\nThe latest tally comes after state health officials confirmed three more Rhode Islanders died from COVID-19 and about 150 people tested positive, she said.\n__\nJOBLESS CLAIMS\nNearly 100,000 residents have filed unemployment claims for virus-related reasons, state labor officials said Tuesday. Another 14,000 have also applied for temporary disability benefits because of the virus, the agency said.\n___\nDETAINEE HUNGER STRIKE\nMore than 60 immigration detainees are on a hunger strike at a Central Falls prison, according to a pastor who has spoken to the detainees. The detainees say they are concerned about the potential spread of the virus at the Donald W. Wyatt Detention Facility and want to be released, Rev. Annie Gonzalez Milliken told The Providence Journal.\nChristopher Hunter, a spokesman for the facility, said there no positive coronavirus cases at the facility.\n__\nARTIST RELIEF\nRhode Island artists are getting a boost from local nonprofits in the pandemic.\nThe Rhode Island State Council on the Arts announced Tuesday it is launching the Artist Relief Fund to provide grants of up to $1,000 to artists who are in financial distress.\nThe awards will be made weekly until funds are exhausted. The fund has an initial $100,000 to distribute and will be accepting donations.\nThe Rhode Island Foundation and the city’s Department of Art, Culture and Tourism helped launch the effort, which will be managed by the Alliance of Artists Communities in Providence.\n__\nOPIOID CRISIS\nThe University of Rhode Island is moving its free training seminars on opioid overdose prevention and treatment online starting this week.\nThe South Kingstown institution said Tuesday that participants in its Community First Responder Program will still be trained to recognize and respond to a drug overdose.\nThey’ll also learn how to administer the overdose reversal medication naloxone and receive a free kit of the nasal spray and fentanyl test strips by mail.\nMore information is available at the “RI Community First Responder Program” on Facebook.", "url": "https://apnews.com/38cbaaf5a39db359a46c45278374aece"}