{"authors": ["Gabriel Kinder"], "date_download": "2020-05-04 16:11:02", "date_modify": "2020-05-04 16:11:02", "date_publish": "2020-04-03 00:22:28", "description": "CNN Heroes everywhere have quickly pivoted to keep their communities supported and connected in this age of quarantine and social distancing.", "filename": "2020_04_02_us_coronavirus-cnnheroes-messages-of-hope_index_1588608662.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402180535-cnnheroes-messages-of-hope-1-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_us_coronavirus-cnnheroes-messages-of-hope_index_1588608662.html", "title": "CNN Heroes share messages of hope as they respond to the pandemic", "title_page": "CNN Heroes share messages of hope as they respond to the pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) During the best of times, CNN Heroes go above and beyond to fulfill their missions of serving others and making the world a better place. The Covid-19 pandemic has made their jobs much harder.\nBut CNN Heroes everywhere have quickly pivoted to keep their communities supported and connected in this age of quarantine and social distancing.\nThe restaurant shutdown forced Brandon Chrostowski to close the dining room at Edwin's . The upscale restaurant is not only one of Cleveland's finest eateries, but it is staffed almost entirely by people who were once incarcerated.\nChrostowski changed up Edwin's menu to focus on homestyle takeout and delivery options. They moved the chairs and tables out of the dining area, transformed it into a store featuring baked goods and bottles of wine, and set up an outdoor grill cooking up steak and ribs.\nMaria Rose Belding and her team run the food rescue app MEANS . They connect businesses with excess food to charities that feed the hungry. Despite the restaurant shutdown, she says they recently had more than half a million pounds of food donated through their platform in just five days.\nVicki Sokolik's nonprofit, Starting Right, Now , supports homeless high school students. For the organization, closed schools pose the biggest challenge. Sokolik and her group are now providing meals the teens were getting from school, while her office staff is now jumping in as home school tutors.\nOther Heroes are also filling in the gaps with food. Shara Fisler and Ocean Discovery Institute , along with Jennifer Cox and Empower4Life , are continuing their educational missions remotely while making sure their students are fed.\nFor more than 24 years, Michelle Christie and No Limits for deaf children have been working to improve the lives of children with hearing loss. When Covid-19 hit, they moved their classes, therapy, and tutoring online as quickly as possible. And they've created \"Friday Friend Day\" to help their kids socialize remotely.\nLeslie Morissette knows the importance of keeping kids connected. Through Grahamtastic Connection , she has spent the last 21 years providing free technology to children battling serious illnesses, ensuring they stay in touch with their classes and friends and don't feel isolated. In this crisis, she is calling on Internet companies to provide their services for free to kids in need.\nSchool is where children get free vision and hearing screenings by Chelsea Elliot and the Half-Helen Foundation , as well as assistance getting corrective wear. Now, the group is in the process of mailing more than 100 pairs of prescription glasses to students.\nDuring the crisis, Amanda Boxtel and Bridging Bionics aren't able to provide their usual high-tech physical therapy to people with mobility impairments. Instead, they are offering free remote counseling for their clients.\nMichelle Allen, who runs Monkey's House , and her husband are now caring for 25 homeless hospice dogs in their home without the help of their usual volunteers.\nKhali Sweeney is putting one of his nonprofit Downtown Boxing Gym's mottos into action: \"One day the strong is going to be called upon to protect the weak.\" His staff is stepping up to make sure the families in their program have the food they need.\nThe pandemic forced Ned Norton to close his Warriors on Wheels gym, where he has trained members of Albany, New York's disabled community for more than 30 years. He knew his members not only missed their camaraderie but were also scared. So, Norton recorded a video on Facebook to reconnect while trying to replicate the fun and laughs from the gym.\nWhen the pandemic hit, Jamyle Cannon had just acquired a 10,000 square foot church to use as the new headquarters for his youth boxing and mentoring program, The Bloc . He says he is using this time to remodel and prepare to open his doors again, offering the students on Chicago's West side a place where they can \"push to be their best selves.\"\nWhile this pandemic has changed the way many CNN Heroes serve others, they are also looking beyond today's crisis. Vicki Sokolik reminded us that \"Community is powerful, and kindness is also contagious.\" Michelle Christie invoked Helen Keller's quote, \"Alone we can do so little; together we can do so much.\"\n\"And together,\" adds Amanda Boxtel, \"we'll get through this.\"", "url": "https://www.cnn.com/2020/04/02/us/coronavirus-cnnheroes-messages-of-hope/index.html"}