{"authors": ["Madeline Holcombe"], "date_download": "2020-05-04 16:22:11", "date_modify": "2020-05-04 16:22:11", "date_publish": "2020-04-06 09:22:56", "description": "United Airlines and American Airlines have slashed the number of flights offered at New York City-area airports as the coronavirus outbreak wreaks havoc on both the city and the airline industry.", "filename": "2020_04_06_us_airlines-susp_15cc09cdab90b33ab2c4af91f5e77e74_index_1588609331.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406090121-american-airlines-jfk-0303-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_us_airlines-susp_15cc09cdab90b33ab2c4af91f5e77e74_index_1588609331.html", "title": "Airlines pare down New York City-area flights during coronavirus outbreak", "title_page": "Airlines pare down New York City-area flights during coronavirus outbreak - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) United Airlines and American Airlines have slashed the number of flights offered at New York City-area airports as the coronavirus outbreak wreaks havoc on both the city and the airline industry.\nWith stay at home orders in place in many states and officials advising against travel, the airlines are paring down their flights to just a handful.\nAmerican Airlines once flew 170 departures from LaGuardia Airport, 80 from John F. Kennedy International Airport and 21 from Newark Liberty International Airport on an average day. But beginning April 7 and running at least until May 6, the airline will fly eight daily flights from LaGuardia, three from JFK and two from Newark. An additional flight from Newark to Chicago will be suspended April 9.\n\"This limited New York service will continue to provide critical connectivity for our customers, including transportation for any essential personnel and goods needed by the community and medical professionals battling the disease,\" Senior Vice President of Operations at American Airlines David Seymour said.\nUnited Airlines Vice President of Communications Stephen Restivo said the company is pulling back \"as far as you can go.\"\nRead More", "url": "https://www.cnn.com/2020/04/06/us/airlines-suspending-flights-new-york-coronavirus/index.html"}