{"authors": ["Adam Beam", "Daisy Nguyen"], "date_download": "2020-05-04 20:18:02", "date_modify": "2020-05-04 20:18:02", "date_publish": "2020-04-04 05:01:41", "description": "SACRAMENTO, Calif. (AP) — California has cut its COVID-19 testing backlog by more than two-thirds, Gov. Gavin Newsom announced Saturday, but has still managed to test less than one half of 1% of...", "filename": "_5533796f43cd6e74cf42aca5db27ce55_1588623482.html", "image_url": "https://storage.googleapis.com/afs-prod/media/558f1925df2c4b6f9d68bc433a5e812a/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5533796f43cd6e74cf42aca5db27ce55_1588623482.html", "title": "California COVID-19 testing backlog cut by two-thirds", "title_page": "California COVID-19 testing backlog cut by two-thirds", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A pedestrian in a mask during the coronavirus outbreak walks by a mural of the late actor James Dean on Hollywood Boulevard, Saturday, April 4, 2020, in Hollywood section of Los Angeles. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Mark J. Terrill)\nA pedestrian in a mask during the coronavirus outbreak walks by a mural of the late actor James Dean on Hollywood Boulevard, Saturday, April 4, 2020, in Hollywood section of Los Angeles. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Mark J. Terrill)\nSACRAMENTO, Calif. (AP) — California has cut its COVID-19 testing backlog by more than two-thirds, Gov. Gavin Newsom announced Saturday, but has still managed to test less than one half of 1% of the state’s nearly 40 million residents.\n“I own that. I have a responsibility as your governor to do better,” the governor said during his daily press briefing.\nCalifornia has tested 126,000 people. Of those, 13,000 test results are still pending as of Friday. That’s down from the 59,500 pending results that were reported Thursday. As of Friday, the state reported 12,026 confirmed COVID-19 cases, a 12.4% increase from the previous day, plus 276 deaths.\nAcross the state, cooped-up residents were pushing the limits of California’s stay-at-home order, with the San Diego County sheriff reporting issuing 22 citations to people near the beach in Encinitas, saying violators were doing things like having picnics near the beach.\nMany beaches, parks and hiking trails around the state and most beach parking lots have been closed because they attracted large crowds. Death Valley National Park began closing Saturday, citing public health concerns during the pandemic.\nNewsom has not stepped up statewide enforcement of his stay-at-home order. But he warned people to obey local authorities.\n“The state is always prepared to do more. I just want to encourage people, don’t force our hand in that respect,” Newsom said. “We cannot allow cabin fever to come in. We cannot allow people to start congregating again.”\nThat appears to include major sports leagues such as the NFL, which has three teams in California. Asked if he thought the football season would start on time in September with fans in the stands, Newsom said: “I’m not anticipating that happening in this state.”\nNewsom on Saturday praised the state’s counties for agreeing, on a case-by-case basis, to cancel property-tax penalties for homeowners, small businesses and other property owners who have a demonstrated economic hardship. The governor added, however, that property owners who can afford to pay these taxes should continue to pay on time.\n“This is good news for Californians. I would like to thank the California State Association of Counties and the California Association of County Treasurers and Tax Collectors for committing to providing economic relief for residents and small businesses facing hardships due to COVID-19,” Newsom said.\nThe governor also signed an executive order temporarily suspending regulations to make it easier for essential workers in the health crisis such as nurses. doctors, emergency medical technicians, grocery workers and law enforcement officers to enroll their children in state-subsidized child care programs.\nThere have been about 12,700 confirmed cases of COVID-19 virus infections in California and about 280 deaths, according to data compiled by Johns Hopkins University. Los Angeles County announced 28 new deaths Saturday — by far the largest rise in fatalities in a day there — for a total of 117. The county also reported 711 new cases, bringing the total number of cases to more than 5,300.\n“This is the most dramatic increase in deaths we have seen since the COVID-19 crisis began, and our condolences go out to each and every person impacted by these heartbreaking losses,” the county’s public health officer, Barbara Ferrer, said in a statement.\nThe coronavirus mainly is spread though coughs and sneezes. For most people, it causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.\nLike most states, California has struggled to define the scope of the virus outbreak because of a lack of testing. Newsom said the Golden State was “turning the page on our old approach.”\nHe announced new partnerships with University of California campuses in Davis and San Diego to set up between five to seven testing hubs. Plus, he said Illinois-based Abbott Laboratories had committed to setting up 75 testing sites throughout the state.\nHe said researchers at Stanford University were close to getting approval for an antibody test that would tell not just whether someone has the virus, but also if they are immune. A spokeswoman for Stanford’s School of Medicine said one test is being performed as part of a study and another will be launched in its lab shortly.\n“We are now in a position where I can confidently say it is a new day,” Newsom said.\nNewsom’s comments came the day before Palm Sunday, the beginning of Holy Week for Christians. Most churches have moved their services online. But a few were defying public health officials by still having in-person worship services.\nCross Culture Christian Center in Lodi, in the agricultural Central Valley, sent the city a “cease and desist” letter after police entered the church last week during a service attended by about 30 people. The church said the shelter-in-place orders violate its First Amendment rights regarding religious freedom and that it intended to continue its services, attorney Dean Broyles of the National Center for Law & Policy told the Sacramento Bee.\nPublic health officials issued an order Friday closing the building the church uses for services.\n“The faith-based community is all about love,” Newsom said. “If you love thy neighbor, you will practice physical distancing. You won’t put them in a congregant setting to put their lives at risk.”\n___\nNguyen reported from San Francisco. Associated Press writer Robert Jablon in Los Angeles contributed to this report.", "url": "https://apnews.com/5533796f43cd6e74cf42aca5db27ce55"}