{"authors": ["Drew Griffin", "Curt Devine", "Scott Bronstein", "Nelli Black"], "date_download": "2020-05-04 16:04:54", "date_modify": "2020-05-04 16:04:54", "date_publish": "2020-04-01 22:35:52", "description": "As the US health care system has scrambled to track the spread of coronavirus, one of the nation's largest commercial labs has faced a backlog of tests that ballooned in the last two weeks, and has delayed results in some cases up to 10 days.", "filename": "2020_04_01_politics_testing-backlog-coronavirus-quest-invs_index_1588608294.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331194624-01-drive-through-testing-cvs-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_testing-backlog-coronavirus-quest-invs_index_1588608294.html", "title": "Documents show backlog of 160,000 coronavirus tests at just one lab company", "title_page": "Coronavirus testing: Documents show backlog of 160,000 tests at just one lab company - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As the US health care system has scrambled to track the spread of coronavirus , one of the nation's largest commercial labs has faced a backlog of tests that ballooned in the last two weeks, and has delayed results in some cases up to 10 days.\nNew Jersey-based Quest Diagnostics had about 160,000 coronavirus test orders waiting to be processed on March 25, which amounted to about half of the 320,000 total orders for the tests the company had received up to that date, according to Quest internal materials obtained by CNN.\nThe company, which is now testing for the virus at a dozen labs across the country, referred to the orders as a \"significant amount of backlog,\" according to the materials.\nAlthough a vast network of labs at public health departments and universities are also testing for the novel coronavirus, the Trump administration has leaned on commercial labs, which have greater capacity, to roll out widespread testing\nQuest and an array of other commercial labs have launched and expanded their testing capacity over the last month, and on Monday President Donald Trump announced that the US had tested more than 1 million people for the virus.\nYet health care workers, state officials and others have criticized the pace of coronavirus testing in the US as insufficient to enable timely quarantining of patients and to obtain an accurate understanding of the virus' scope. The White House warned Tuesday that the virus could lead to the deaths of anywhere from 100,000 to 240,000 Americans\nDr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said on Sunday that safely loosening restrictions on businesses and public gatherings in the US depends on the availability of more rapid testing.\n\"So that when you identify someone who's infected, that person doesn't go out into society for a few days, infect a bunch of people, and then you bring them back because the test is positive,\" Fauci said on CNN's \"State of the Union.\"\nA spokesperson for Quest, Wendy Bost, told CNN the backlog for coronavirus tests has begun to shrink in recent days as the company has expanded its capacity, which now amounts to more than 30,000 tests a day and an average turnaround time of four to five days.\n\"Much of the backlog was due to huge demand in the early days of testing when we were primarily offering a lab-developed test we developed at a single laboratory,\" Bost said. \"In recent days, our capacity has exceeded our demand, allowing us to reduce the backlog.\"\nAfter CNN published this report, Quest posted a statement on its website Wednesday night that said the company currently has a backlog of 115,000 tests.\nQuest is not alone in dealing with turnaround times of multiple days and other testing complications resulting from extreme demand.\nLabCorp, another major commercial lab company, said turnaround time for results is approximately four to five days, though that varies depending on factors such as transport time.\nARUP Laboratories earlier this month was accepting specimens for coronavirus testing outside of its home state of Utah but stopped that about two weeks ago due to \"supply constraints in the face of extraordinary demand,\" the company said.\nJUST WATCHED Here's how the novel coronavirus outbreak unfolded Replay More Videos ... MUST WATCH Here's how the novel coronavirus outbreak unfolded 02:32\nIn March, leaders from Quest, LabCorp and other companies met with White House officials to discuss expanded testing. President Trump touted the plan as \"a new partnership with private sector to vastly increase and accelerate our capacity to test for the coronavirus.\"\nBut some health care workers have told CNN testing has not accelerated fast enough.\nDr. Joseph Kanter, an ER doctor in New Orleans and the Assistant State Health Officer for the Louisiana Department of Health, said longer wait times for test results force hospitals to use more personal protective equipment, which is in short supply nationally and must be used when treating patients who have been tested until it's confirmed they do not have the virus.\n\"The faster we can turn those tests around, some of those will be negative and we'll save the PPE burn,\" Kanter said. \"It's getting better, but it still is a bottleneck.\"\nMegan Schlanser, a nurse in Michigan, said limited testing has prevented frontline health workers, including some of her colleagues who feel sick, from knowing whether they have contracted the virus.\n\"We're not getting tested,\" Schlanser said. \"The scary thing is that we could potentially all be carriers and even not even show symptoms... so I could be potentially infecting all of my coworkers.\"\nSome patients who waited initially to even get tested for the virus have yet to get their results.\nShannon Mason, a 38-year-old attorney in northern California, tells CNN she is still waiting for the result of the Covid-19 test she had on March 18.\nMason, who said she is at particularly high risk because she has an immune dysfunction, said she became very sick with a cough and fever in February that became a respiratory infection.\nShe finally went to the ER at the University of California-Davis Medical Center in Sacramento. \"I was feeling really bad. That's the worst I've ever felt,\" said Mason, who said she tested negative for the flu.\nMason is still waiting for the results of her test, and said she has repeatedly called the medical center and asked for her result, but said no one seems to know the result. CNN contacted the medical center but did immediately not hear back. After publication, the medical center said they \"are looking into\" the issue.\nJUST WATCHED Nurse struggled to get tested and worked while infected Replay More Videos ... MUST WATCH Nurse struggled to get tested and worked while infected 03:12\nVarious hospital systems have begun implementing their own internal coronavirus testing, which cuts the time needed to ship specimens to external labs.\nThe Yale New Haven Health System does its own in-house testing for the sickest patients and critical health care workers, but the rest are sent to outside labs.\n\"Initially, we sent out a lot of samples to Quest but their turnaround times were quite delayed recently, sometimes over a week,\" said Steven Choi, the health system's chief quality officer. \"We're now transitioning to the Mayo Clinic Labs for our outpatient specimen testing.\"\nA spokesperson for the RWJBarnabas Health hospital system in New Jersey told CNN its in-house testing has a turnaround time of a few hours, but the majority of its tests are still sent to private labs that require five to 10 days for results.\nThe Henry Ford Health System in Michigan said test results for admitted patients are returned in 24 hours but outpatients' samples are sent to an outside lab that typically provides results in about a week.\nBost, the Quest spokesperson, told CNN that while hospitals may be able to efficiently test ill hospital patients, commercial labs like Quest have the capacity and logistical operations to test far greater numbers of patients at regional levels.\nBost added that global supply chain issues have constrained labs throughout the country.\nMedical officials at several state departments and labs told CNN in March they needed more swabs and reagents, which are used to extract the genetic code of a virus from swabs, along with other materials to conduct Covid-19 tests.\nA spokesperson for the University of Nebraska said on Tuesday that the two labs on campus testing for coronavirus have been able to turnaround results in four to six hours but due to a lack of reagents, the labs have had to limit capacity.\nAt Vanderbilt University Medical Center in Tennessee, overall volume of testing and a shortage of reagents caused its lab's backlog to jump over the last week from a 48-to-72-hour timeframe to five-to-seven days.\n\"We have the reagent back in stock but it took several days. During that time we had samples accumulate in the queue,\" said spokesperson John Howser.\nSome commercial labs have said they have cut backlogs that developed after they initially rolled out coronavirus tests. A spokesperson for the company Eurofins, for example, said its labs are now running 7,000 tests a day with a 24-hour turnaround time.\nCaroline Buckee, an associate professor of epidemiology at the Harvard T.H. Chan School of Public Health, said that until the US health care system develops the capacity to widely test patients, including those only exhibiting mild symptoms, the full scope of the virus cannot be fully understood and effectively addressed.\n\"Right now we are not testing enough people so we don't know what's happening with community-level transmission, and we're almost certainly missing many cases,\" Buckee said.\nThis story has been updated Wednesday night to reflect University of California-Davis Medical Center's response that they are \"looking into\" Mason's case and to include Quest's current backlog.", "url": "https://www.cnn.com/2020/04/01/politics/testing-backlog-coronavirus-quest-invs/index.html"}