{"authors": ["Thomas Lake"], "date_download": "2020-05-04 16:59:20", "date_modify": "2020-05-04 16:59:20", "date_publish": "2020-04-09 01:28:22", "description": "Jennifer Taff was angry. So before she defied Wisconsin's stay-at-home order and went to vote--after the US Supreme Court declined to extend the time to return absentee ballots, even in a pandemic--she made a cardboard sign that said just how she felt, writes Thomas Lake.", "filename": "2020_04_08_opinions_wisconsin-voter-this-is-ridiculous-lake_index_1588611560.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407182226-milwaukee-wisconsin-voting-sign-restricted-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_opinions_wisconsin-voter-this-is-ridiculous-lake_index_1588611560.html", "title": "This Wisconsin voter was furious, so she made this sign", "title_page": "This Wisconsin voter was furious, so she made this sign - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "In a series of essays called The Distance, Thomas Lake is telling the stories of Americans living through the pandemic. Email thomas.lake@cnn.com if you have a story to share.\n(CNN) Jennifer Taff went to bed Monday night and lay there, too angry to sleep. The Wisconsin Supreme Court had ruled that Tuesday's election would go on, despite the pandemic, and the US Supreme Court declined to give absentee voters more time to turn in their ballots. Taff had not yet received her absentee ballot. The state was under a stay-at-home order because of the coronavirus. If Taff wanted to vote, she would have to defy that order.\nTHE DISTANCE Americans living apart and together in the age of pandemic\nTaff, a 38-year-old school social worker who works from home these days, got up around 6:30 a.m. Tuesday morning and went rummaging in her closet. She took a piece of cardboard from an old box. With a Sharpie, she made a sign that read: \"THIS IS RIDICULOUS.\"\nAt the LaFollette School, a K-8 public school in one of Milwaukee's poorest neighborhoods, Taff is known as \"the coffee lady\" because she usually has a fresh pot in her office for any teacher who needs a boost.\nHow angry was she at home on Tuesday morning? So angry that she forgot to make herself coffee. She pulled up the hood on her sweatshirt, put a bandanna over her face, said a prayer, and walked outside, carrying her sign.\nTrue, she could she have stayed home. But she cared about what was on the ballot: the race for Wisconsin Supreme Court, the local races for mayor and county executive, the referendum on millions in new spending for Milwaukee Public Schools. \"Too many things that meant too much,\" as she told me on the phone.\nRead More", "url": "https://www.cnn.com/2020/04/08/opinions/wisconsin-voter-this-is-ridiculous-lake/index.html"}