{"authors": ["Jeff Zeleny", "Senior Washington Correspondent"], "date_download": "2020-05-04 16:19:27", "date_modify": "2020-05-04 16:19:27", "date_publish": "2020-04-04 11:56:24", "description": "Just eight US governors have decided against issuing statewide directives urging their residents to stay at home as the outbreak of the coronavirus escalates and spreads across the country, the last holdouts in the nation.", "filename": "2020_04_04_politics_republi_3b82278b4acfc6311bba924d1d738aea_index_1588609167.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404105742-republican-governors-stay-at-home-order-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_politics_republi_3b82278b4acfc6311bba924d1d738aea_index_1588609167.html", "title": "Why these 8 Republican governors are holding out on statewide stay-at-home orders", "title_page": "Why these 8 Republican governors are holding out on statewide stay-at-home orders  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Just eight US governors have decided against issuing statewide directives urging their residents to stay at home as the outbreak of the coronavirus escalates and spreads across the country , the last holdouts in the nation.\nThe governors, all of whom are Republican, have offered a variety of explanations for why they have not followed the lead of their colleagues from coast-to-coast -- along with countries across the world -- by ordering people to restrict their movement in hopes of slowing the pandemic.\nIn doing so, they've collectively ignored the stay-at-home pleas of Dr. Anthony Fauci , the nation's top infectious disease expert, who said in a CNN interview: \"If you look at what's going on in this country, I just don't understand why we're not doing that.\"\nAbsent a nationwide order, which President Donald Trump once again on Saturday declined to give, a patchwork of rules has emerged in all corners of the country that offer conflicting guidance for how citizens should protect themselves and their families from coronavirus.\n\"We have a thing called the Constitution, which I cherish\", Trump said at his daily news briefing, praising the decision of the governors. \"Now in some cases we'll supersede ... it depends on the individual state that you're talking about. ... If I saw something wrong, if I saw a massive outbreak, of which there's not, I would come down very hard.\"\nBut as the week wore on, with the death toll rising, confirmed cases mounting and an absence of national leadership, several once-reluctant governors ultimately heeded the call and issued statewide orders of their own.\nIt wasn't until late Friday that Alabama took action, with Gov. Kay Ivey reversing course and imposing a statewide mandate beginning Saturday. Missouri Gov. Mike Parson followed suit, one day after saying his state didn't easily lend itself to \"a blanket order.\" He signed just that, but said it wouldn't take effect until Monday.\nThe remaining exceptions are eight red states, all of which Trump carried four years ago and is hoping to do so again in the fall. They stretch from the South to the Midwest and the West, spanning the alphabet from Arkansas to Wyoming.\nIt's not as though the novel coronavirus hasn't touched each of their states in some way. Yet a combination of states' rights defiance, persuasion from some business and agricultural leaders and a largely rural composition have branded these governors as outliers during a moment of national crisis, where the actions of one potentially affect all.\nIn South Dakota, a Republican state lawmaker was among the first in the state to test positive, followed soon after by his wife, brother and sister-in-law. His 51-year-old niece has died of Covid-19, family members told reporters, with several others experiencing symptoms.\nIn explaining her rationale against issuing a stay-at-home order, Gov. Kristi Noem told reporters, \"The people themselves are primarily responsible for their safety.\" She also pointed to the state and national constitutions that \"prevent us from taking draconian measures much like the Chinese government has done.\"\nIn state after state, the Republican governors have all used the argument of government intrusion as one of the leading reasons for not following the lead of a majority of states in issuing stricter guidelines that could help sound the alarm about the serious nature of the threat.\nAll states have made strong recommendations to practice social distancing and at least half have some degree of restrictive measures in place, often because mayors or county officials made local decisions. But these governors have stopped short of giving statewide orders that have been in place for weeks elsewhere.\nIn Iowa on Friday, a statewide board of medicine voted unanimously to recommend a so-called shelter-in-place order to limit the movements of residents to essential work and travel.\n\"A stronger commitment to isolation is in the best interest of the public and health care providers,\" Kent Nebel, executive director of the Iowa Board of Medicine, told the Des Moines Register\nGov. Kim Reynolds said she is studying the data from across her state, which she said did not yet merit a statewide directive to restrict movement in places that have not yet been affected by coronavirus. As of Friday evening, the state had nearly 700 cases and 11 deaths, according to Johns Hopkins University\nShe acknowledged Friday that refusing to impose a shelter-in-place order had become a \"divisive issue.\" She pushed back on Fauci's remark that questioned why all states have not issued stay-at-home orders.\n\"I would say that maybe he doesn't have all the information,\" Reynolds told reporters. \"You can't just look at a map and assume no action has been taken.\"\nOther governors said that they are following medical advice from their own experts, including in Nebraska, where Gov. Pete Ricketts said he was taking cues from his advisers, rather than national health officials.\nHe pointed to Dr. James Lawler, co-director of the University of Nebraska Medical Center's Global Center for Health Security, who said people should spend more time heeding the warnings of social distancing and handwashing, rather than focusing on semantics of a statewide order.\n\"What I think we should really focus on is improving compliance and adherence,\" Lawler told reporters. \"This depends on people taking this seriously and doing the right thing.\"\nHe added that if Nebraskans do \"what we've already implemented and we do it well, I think we'll get much more bang for our buck than we would from going to a much more draconian posture.\"\nThe remainder of the holdouts are North Dakota, South Carolina and Utah. In each state, the Republican governors have been urged by experts and Democratic officials to take the additional step of issuing a statewide order, even if the action would only serve to draw attention to the rising severity of the health crisis, but several made clear they were taking their cues from the White House.\nGov. Asa Hutchinson of Arkansas continued to defy calls for a statewide order and dismissed Fauci's comments.\n\"It's understandable that (Fauci) looks at that as a solution, a nationwide shutdown order. What's important is that has not been given,\" Hutchinson said Friday at a news conference. \"The CDC -- I watch their guidelines regularly -- and they have not indicated that's an appropriate or necessary step across the country.\"\nIn North Dakota, Gov. Doug Burgum acknowledged that some residents were taking seriously the guidelines for social distancing and limiting gatherings, while others were not. Still, he said he was resisting a statewide order, instead urging residents to \"stay home, stay healthy and stay connected.\"\nIn South Carolina, Gov. Henry McMaster declared a state of emergency last month, restricted use of the state's beaches and ordered non-essential businesses to close. But he has stopped short of issuing a statewide order, saying: \"We are not ordering people to stay at home, but from the very beginning we've been telling people to stay home.\"\nIn Utah, Gov. Gary Herbert has resisted arguments from Salt Lake City officials and leaders in five of the state's 29 counties where local stay-at-home orders are in place. He said his \"stay home, stay safe\" instructions struck a more positive tone, without a statewide mandate.\nIn Wyoming, where the state medical society called for a stay-at-home order this week, Gov. Mark Gordon said he believes such a statewide directive would not accomplish its goal. His spokesman told reporters the governor was more focused on \"changing behavior right now.\"\nAides to several of the Republican governors said the only persuasion that was likely to move their positions was specific guidance from the President.\nBut with each new order, it becomes clear the rules are far from uniform from state to state. The Alabama order signed Friday, for example, leaves open big box stores and garden stores, prompting local officials in Birmingham to follow their previous, stricter policy of traveling for things people only need to survive.\nIn Florida, Gov. Ron DeSantis had repeatedly dismissed the notion of imposing a statewide stay-at-home order, even as cases of coronavirus were rising. But then, this week he suddenly urged Americans to brace for \"a very tough two weeks\" after citing the President's \"demeanor the last couple of days\" to explain why he was taking this step.\nDeSantis said it was the President's alarm -- not warnings health officials had been making for weeks -- that finally persuaded him.\nThis story has been updated to reflect Trump's comments from the Saturday evening White House briefing.", "url": "https://www.cnn.com/2020/04/04/politics/republican-governors-stay-at-home-orders-coronavirus/index.html"}