{"authors": ["Kim Tong-Hyung"], "date_download": "2020-05-04 20:16:04", "date_modify": "2020-05-04 20:16:04", "date_publish": "2020-04-16 02:59:26", "description": "SEOUL, South Korea (AP) — South Korea's ruling liberal party secured a resounding victory in parliamentary elections that had the highest turnout in nearly three decades, despite the coronavirus...", "filename": "_3949ba4109a4fd9f312396d552ab93c1_1588623364.html", "image_url": "https://storage.googleapis.com/afs-prod/media/cbf07cde9ab84f46a2cd6377970f3b04/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3949ba4109a4fd9f312396d552ab93c1_1588623364.html", "title": "South Korean ruling party wins vote held amid virus fears", "title_page": "South Korean ruling party wins vote held amid virus fears", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Lee Hae-chan, left, Chairperson of the Election Campaign Committee of the ruling Democratic Party, places a sticker onto one of the party's winning candidates' photographs for parliamentary election at the National Assembly in Seoul, South Korea, Wednesday, April 15, 2020. South Korean voters wore masks and moved slowly between lines of tape at polling stations on Wednesday to elect lawmakers in the shadows of the spreading coronavirus. (Kim In-chul/Yonhap via AP)\nLee Hae-chan, left, Chairperson of the Election Campaign Committee of the ruling Democratic Party, places a sticker onto one of the party's winning candidates' photographs for parliamentary election at the National Assembly in Seoul, South Korea, Wednesday, April 15, 2020. South Korean voters wore masks and moved slowly between lines of tape at polling stations on Wednesday to elect lawmakers in the shadows of the spreading coronavirus. (Kim In-chul/Yonhap via AP)\nSEOUL, South Korea (AP) — South Korea’s ruling liberal party secured a resounding victory in parliamentary elections that had the highest turnout in nearly three decades, despite the coronavirus forcing social distancing at polling places.\nThe ruling Democratic Party and a satellite party it created to win proportional representative seats combined to win 180 seats in the 300-seat National Assembly, election officials said Thursday. Conservatives suffered their worst showing in the densely populated Seoul metropolitan area in years.\nThe comfortable majority will likely embolden President Moon Jae-in’s government to pursue its key domestic and foreign objectives, such as reviving diplomacy with nuclear-armed rival North Korea, while it grapples with the pandemic that is shuttering businesses and threatening livelihoods.\nMoon thanked the country’s “great people” for “giving strength to a government that’s fighting desperately to overcome a national crisis.”\nMore than 17 million South Koreans voted on Wednesday. When combined with the 11.8 million early and mailed-in votes, turnout was 66.2%, the highest since 71.9% turnout in a 1992 general election, the National Election Commission said.\nThe voting drew sharp contrasts with upended election cycles in the United States and Europe and possibly set an example for how democratic elections can be handled during the pandemic.\nHealth officials described the election as a crucial experiment as they discuss more sustainable forms of social distancing that allow for some communal and economic activity while containing the risk of infection. But they acknowledged it would take at least a week to assess the election’s impact on the epidemic.\nWhile South Korea is just three years removed from mass protests that led to the ouster of Moon’s corrupt conservative predecessor, public displays of the country’s dynamic democracy were largely muted this year as candidates, wearing masks and gloves, avoided large rallies and handshakes.\nBefore the virus began absorbing public attention, Moon’s support was faltering over a decaying job market, corruption scandals surrounding key political allies and troubled ties with North Korea.\nBut surveys ahead of the polls indicated growing support for his government, reflecting public approval of an aggressive test-and-quarantine program credited with lowering fatality rates compared to China and some places in Europe and North America. As of Thursday, South Korea reported more than 10,600 people infected with 229 confirmed deaths.\nSouth Korea’s electorate is deeply split along ideological and generational lines and regional loyalties. But surveys since infections surged in late February showed swing voters in their 20s and 50s expressing stronger willingness to vote, said Jeong Han-wool from Hankook Research, an opinion-research firm in Seoul.\nPark Sung-min, president of Seoul-based MIN Consulting, a political consulting firm, said a sense of urgency over the coronavirus drove more people to the polls. He said the conservatives failed to establish themselves as a viable alternative, squabbling internally over agendas and candidate selections.\nHwang Kyo-ahn, who led the conservative United Future Party, stepped down as chairman after losing in a key Seoul district to Democratic Party candidate Lee Nak-yeon, a former prime minister who emerged as a front-runner for the 2022 presidential race. Hwang, also an ex-prime minister, apologized to supporters for “failing to prevent the country from going in the wrong direction at an important time.”\nSouth Korean election and health officials prepared safeguards to reduce the risk of the virus being spread during the voting.\nMasks were worn by voters and poll workers. A meter (3 feet) of social distancing space was marked from nearby streets all the way to the ballot booths. Voters who passed a fever screening were given sanitizing gel and disposable plastic gloves before entering booths. Anyone with a fever was whisked to a separate area to vote.\nMore than 11,150 people formally quarantined in their homes were escorted or monitored through tracking apps while they cast their ballots later than other voters. Workers dressed in full protective suits sanitized the booths after each vote. Those hospitalized or in isolation or quarantine could vote by mail or at temporary shelters during early voting last week.\nThe controls weren’t perfect. Park Jong-hyun, an official from the Ministry of the Interior and Safety, said at least six quarantined voters wandered around after leaving home to cast their ballots. Officials planned to bring charges against at least one of them who visited a billiard club and a computer gaming room.", "url": "https://apnews.com/3949ba4109a4fd9f312396d552ab93c1"}