{"authors": ["Oliver Darcy", "Kevin Liptak", "Cnn Business"], "date_download": "2020-05-04 16:26:58", "date_modify": "2020-05-04 16:26:58", "date_publish": "2020-04-07 16:07:23", "description": "As President Donald Trump flips through the cable news channels, one doctor in particular has caught his eye: Dr. Mehmet Oz, the celebrity cardiac surgeon whose medical advice has been called into serious question in the past.", "filename": "2020_04_07_media_dr-oz-trump-coronavirus_index_1588609618.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406203524-dr-oz-coronavirus-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_media_dr-oz-trump-coronavirus_index_1588609618.html", "title": "Dr. Oz catches Trump's attention as he pushes unproven drug to fight coronavirus", "title_page": "Dr. Oz catches Trump's attention as he pushes unproven drug to fight coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) As President Donald Trump flips through the cable news channels, one doctor in particular has caught his eye: Dr. Mehmet Oz, the celebrity cardiac surgeon whose medical advice has been called into serious question in the past.\nTrump has been intrigued by Oz's appearances on Fox News in which he has talked up the potential effectiveness of the anti-Malaria drug hydroxychloroquine as a way to treat the novel coronavirus, a White House official told CNN.\nThe White House official added that Trump has mentioned Oz's television appearances to aides when discussing the drug.\nTrump has obsessed as of late over hydroxychloroquine, repeatedly hyping the unproven drug at news conferences as a potential \"game changer\" and even going as far as to say he would consider taking it himself.\nIt is not clear whether Oz, who has become a fixture on Fox News in recent weeks, has spoken directly with the President. Trump has been known to phone people after seeing them on the conservative network.\nOz could not be reached by CNN for comment. The Daily Beast first reported Trump's interest in Oz's Fox News segments.\nIt is no secret that Trump pays close attention to Fox News. Throughout his presidency, Trump has tweeted about the network, called into its shows, touted its star hosts who support him, and even hired its personalities for positions in the White House.\nWhich is to say that it is no surprise that Trump has leaned on the network and its medical experts during the coronavirus pandemic.\nOn Monday night, for instance, Trump tweeted praise for another Fox News health expert: Dr. Nicole Saphier. And The Washington Post reported Monday that Fox News host Laura Ingraham visited the White House last week with two of her medical experts to talk up hydroxychloroquine.\nOz has appeared dozens of times on Fox News to discuss the coronavirus. He was even featured during a town hall Fox News held with the White House and he used his appearance to ask Vice President Mike Pence about hydroxychloroquine.\nIn contrast to the other doctors on Fox News, Oz is one of the nation's most recognized physicians and commands a sizable following, making him a powerful potential ally for Trump.\nOz, who is an advocate of alternative medicines and treatments, rose to television fame after serving for years as Oprah Winfrey's medical expert. In 2009, he parlayed those segments into a show of his own, \"The Dr. Oz Show,\" which has been on air for 10 seasons and won a number of daytime Emmy awards.\nNow Oz has become one of the most passionate and prominent backers of using hydroxychloroquine to fight coronavirus -- despite the lack of firm scientific evidence that it is an effective treatment.\nStudies in humans have presented conflicting conclusions . A small Chinese study said the prognosis was \"good\" but the drug requires further investigation. Meanwhile, a French study combining the drug with a popular antibiotic showed \"no evidence of rapid antiviral clearance or clinical benefit.\"\n\"The fact of the matter is we don't know if hydroxychloroquine works,\" CNN chief medical correspondent Sanjay Gupta said Monday.\nExperts have also said that side effects from the drug are rare, and most commonly include nausea and diarrhea. Less common side effects can include skin rashes and hair changes.\nNevertheless, Oz has repeatedly touted hydroxychloroquine.\nOz has even called on New York Gov. Andrew Cuomo to lift restrictions on its potential use, despite acknowledging the lack of clinical evidence of whether or not it is effective against the coronavirus.\n\"There's no question it's not proven to be beneficial in large clinical trials we expect in America, certainly that the FDA and medical societies would desire,\" Oz acknowledged Monday on Fox News. \"But these have been supported with case studies.\"\nIn recent years, Oz appears to have developed a friendly relationship with Trump.\nDuring the 2016 election, Trump sat down with Oz and revealed the results of his physical exam. Oz said at the time that if a patient of his had Trump's records he would \"be very happy\" and \"send them on their way.\"\nTrump in 2017 appointed Oz to the Department of Health and Human Services' council on sport, fitness, and nutrition. The council works to educate Americans on how to live a healthy lifestyle.\nThe relationship between Trump and Oz seems to have benefited both parties: Oz has made headlines and Trump has received praise from one of the country's most famous physicians.\nOz, however, has been skewered by the medical community in the past for his recommendations.\nIn 2015, a group of physicians wrote Columbia University , saying they were \"dismayed\" Oz was a member of the school's faculty.\nThe physicians accused Oz of \"manifesting an egregious lack of integrity by promoting quack treatments and cures in the interest of personal financial gain.\"\nOz responded at the time saying he provides the public \"information that will help them on their path to be their best selves,\" provides \"multiple points of view,\" and contended that \"doesn't sit well\" sometimes \"with certain agendas which distorts the facts.\"\nIn 2014, Oz was scolded by senators during a congressional hearing over his promotion of weight-loss products on his television show.\n\"I don't get why you say this stuff because you know it's not true,\" then Democratic Sen. Claire McCaskill said at the hearing.\n\"The scientific community is almost monolithic against you in terms of the efficacy of the three products you called 'miracles,'\" McCaskill added.\nOz defended himself at that hearing, saying, \"My job, I feel on the show, is to be a cheerleader for the audience. And when they don't think they have hope, when they don't think they can make it happen, I want to look and I do look everywhere, including alternative healing traditions, for any evidence that might be supportive to them.\"", "url": "https://www.cnn.com/2020/04/07/media/dr-oz-trump-coronavirus/index.html"}