{"authors": ["Por Tales Azzoni"], "date_download": "2020-05-04 20:20:14", "date_modify": "2020-05-04 20:20:14", "date_publish": "2020-04-08 18:47:34", "description": "MADRID (AP) — Toni Dovale tiene una rutina distinta a la mayoría de los futbolistas españoles durante la pandemia de coronavirus. Mientras que algunos pasan el tiempo intentando mantenerse...", "filename": "_09d9156534c64415add0bf442da741f2_1588623614.html", "image_url": "https://storage.googleapis.com/afs-prod/media/1f9457c5f18543f7a6363ef8fd70fb15/2000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_09d9156534c64415add0bf442da741f2_1588623614.html", "title": "Exjugador de la MLS ayuda en España contra el coronavirus", "title_page": "Exjugador de la MLS ayuda en España contra el coronavirus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nEn foto publicada el 18 de marzo del 2020 Toni Dovale posa en la farmacia de su familia. El 8 de abril del 2020 el ex jugador del Sporting de Kansas City y el Celta de Vigo, ha dedicado su tiempo durante la pandemia de coronavirus a ayudar en la farmacia de su familia en la Coruña. . (Photo via AP)\nEn foto publicada el 18 de marzo del 2020 Toni Dovale posa en la farmacia de su familia. El 8 de abril del 2020 el ex jugador del Sporting de Kansas City y el Celta de Vigo, ha dedicado su tiempo durante la pandemia de coronavirus a ayudar en la farmacia de su familia en la Coruña. . (Photo via AP)\nMADRID (AP) — Toni Dovale tiene una rutina distinta a la mayoría de los futbolistas españoles durante la pandemia de coronavirus.\nMientras que algunos pasan el tiempo intentando mantenerse en forma o negociando una reducción de salario con sus equipos, Dovale trabaja para garantizar que se tengan suficientes máscaras de protección, guantes y medicina para ayudar en la batalla contra el virus que ha golpeado fuertemente a España.\nEl exjugador del Sporting de Kansas City y de Celta de Vigo, formado en la academia del Barcelona, ahora viste bata blanca y trabaja en la pequeña farmacia de su familia en el noroeste de La Coruña, mientras el fútbol se mantiene suspendido debido al COVID-19.\nJugaba en el fútbol de Tailandia antes de volver a España para las vacaciones y se quedó varado por la pandemia.\n“Estaba empacando para volver a Asia para la nueva temporada, pero la situación con el virus se complicó”, dijo el jugador de 30 años en una entrevista telefónica con The Associated Press esta semana. “No esperaba tener que trabajar ahora, pero lo único que podía hacer era ayudar. Fue el momento idóneo para venir a la farmacia y ayudar a mi gente”.\nEspaña registra más de 140.000 casos confirmados de COVID-19, con casi 14.000 fallecidos. El país se encuentra en una rígida cuarentena desde mediados de marzo y las restricciones se esperan continúen hasta al menos finales de abril.\n“Decidí que lo mejor que podía hacer era ayudar a mi comunidad, venir a la farmacia y ayudar a la gente, hacer lo mejor para que podamos volver a la normalidad lo antes posible y esperemos poder volver a jugar pronto”, dijo Dovale, quien tiene estudios en farmacología.\nDovale trabaja haciendo de todo, pero una de sus principales responsabilidades es negociar la compra de medicamentos y de insumos con los laboratorios y proveedores.\n“Hay escasez de muchas medicinas. No tenemos máscaras o alcohol. Los guantes no son fáciles de encontrar”, comentó. “Intento llamar a los laboratorios y a cualquiera que pueda proveer el material para ayudar a la gente. Es duro cuando la gente viene a la farmacia pidiendo máscaras y no les puedes dar el material”.\nDovale, un mediocampista ofensivo, anotó cuatro goles y dio cuatro asistencias en 25 encuentros con el Sporting KC de la MLS en 2014.\nInició su carrera en la academia juvenil del Barcelona antes de llegar al Celta, equipo en el jugó bajo las órdenes del entrenador de la selección española Luis Enrique. Posteriormente jugó con los clubes Leganés, Rayo Vallecano y Lugo, entrenando con el actual técnico del Barcelona Quique Setién.\n“Grandes experiencias”, dijo Dovale, quien también pasó por el Bengaluru FC de la India y estaba jugando para el club Navy FC en Tailandia antes de que la pandemia de coronavirus lo obligara a quedarse en España y que terminaran su contrato.\nDovale cree que aún puede jugar bien por cuatro o cinco años y no le importaría regresar a Estados Unidos o Asia.", "url": "https://apnews.com/09d9156534c64415add0bf442da741f2"}