{"authors": ["On Assignment For Huffpost"], "date_download": "2020-05-04 20:20:34", "date_modify": "2020-05-04 20:20:34", "date_publish": "2020-04-28 17:19:18", "description": "Prime Minister Jacinda Ardern has led with empathy and science. But she still faces huge tests.", "filename": "entry_new-zealand-coronavirus-jacinda-ardern-lockdown-lifted_n_5ea7df0ec5b6a30004e7cbde_1588623634.html", "image_url": "https://img.huffingtonpost.com/asset/5ea83e043000004a101550be.jpeg?cache=vauptozuo9&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_new-zealand-coronavirus-jacinda-ardern-lockdown-lifted_n_5ea7df0ec5b6a30004e7cbde_1588623634.html", "title": "How New Zealand Stamped Out The Coronavirus", "title_page": "How New Zealand Stamped Out The Coronavirus | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "On Monday at 11:59 p.m. local time, New Zealand lifted its strict lockdown. While many restrictions remain, the economy will restart nearly five weeks after it was shuttered. Businesses, restaurants and schools will begin to reopen, with limitations in place, and an estimated 1 million New Zealanders will return to work.\n“There is no widespread undetected community transmission in New Zealand. We have won that battle,” said the country’s prime minister, Jacinda Ardern, on Monday. “But we must remain vigilant if we are to keep it that way.”\nWhile much of the rest of the world continues to struggle under the weight of the coronavirus pandemic, New Zealand has stood out not only for how quickly it contained the virus but for the way its leader has led the country through the crisis.\nWhen faced with the difficult task of telling New Zealanders they were about to be placed into lockdown for at least four weeks, Ardern came through with a simple message: Be kind. “We will get through this together but only if we stick together, so please be strong and be kind,” Ardern said.\nThe 39-year-old leader’s approach has been driven by messages of unity and empathy, communicated in an accessible way. Just before lockdown, she addressed the country on a Facebook Live video, wearing a green sweatshirt after just having put her toddler daughter to bed.\nHer leadership style stands in stark contrast to those of other world leaders, such as President Donald Trump, who has swung from downplaying the significance of COVID-19 to rushing to pin blame ― on China and the World Health Organization ― when the severity of the pandemic became clear.\nWhile the style of her approach has been informal and relatable, her action has been firm.\nArdern has led the way in embracing science and has a good relationship with her public health officials. On their advice, New Zealand pursued a policy of elimination, rather than mitigation, which meant the country shut down businesses and its borders when there were around 100 coronavirus cases and before any deaths. Meanwhile other countries, such as the U.S. and the U.K., stepped up restrictions only as the impacts of the pandemic worsened.\nAnd her approach appears to have worked, with the caveat that we are so early on in our understanding of this virus, no one can be sure what will happen as economies start to reopen. The country has not only flattened the curve but, in a phrase coined by The Washington Post, has squashed it. At the time of writing, there have been 19 recorded deaths and 1,122 confirmed cases there. Ardern says the virus is “currently eliminated” from New Zealand.\nDespite the toughness of her response, which placed huge restrictions on New Zealanders, Ardern’s approval rating is her highest since taking office.\nLooking at other leaders who don’t listen to science and appear not to have the empathy that Jacinda does, well, it’s easy to see why her response stands out. Helen Clark, former prime minister of New Zealand\nShe has taken steps to ensure messages of unity are more than just words. At a time when some U.S. politicians stood accused of making money from the virus, Ardern and her ministers took a 20% pay cut for six months to show solidarity with those affected by the coronavirus outbreak.\nMany hope that her particular brand of leadership could not only help steer New Zealand away from the tragic death tolls experienced in other countries, but also help her to take the opportunity to build a better society in New Zealand post-pandemic. The country now faces an uphill battle to recover economically, with growing rates of unemployment in a nation already struggling with homelessness and child poverty.\nA leadership style built on empathy\nThose who know Ardern say her unique package of skills sets her apart on the global stage. “Jacinda has three fantastic qualities,” Helen Clark, who was New Zealand’s prime minister from 1999 to 2008, told HuffPost. “She is clever, she is empathetic and she is a good communicator. Put those three things together and when you are faced with an unprecedented challenge like COVID-19, you have a leader that has enormous assets that can pull a country through just about anything.”\nClark noted that Ardern has already shown her leadership abilities in dealing with two domestic crises. After the Christchurch mosque shootings, where a gunman killed 51 people in March 2019, she moved quickly to implement stricter gun laws. Then in December 2019 came the White Island volcanic eruption, which killed 21 people. Ardern, who was photographed embracing first responders, received praise for a response perceived as human and empathetic.\nDom Thomas/Pool Photo via AP Jacinda Ardern hugs a first responder in Whakatane, New Zealand, the day after a volcanic island in New Zealand erupted on Dec. 9, 2019.\n“She knows what she is doing in high-pressure, tragic situations, and in a sense, how she has handled coronavirus is no different to how she handled those two tragedies,” said Clark, highlighting Ardern’s ability to engage with the public and to earn their trust.\nOf course, New Zealand has some advantages when it comes to dealing with a pandemic. It is small in terms of population, with just shy of 5 million inhabitants, and as an island nation at the bottom of the South Pacific it is in a favorable position to fight the virus ― borders can be shut relatively easily. But for Clark, the key ingredient was Ardern’s willingness to “step out in front and take command.”\n“Looking at other leaders who don’t listen to science and appear not to have the empathy that Jacinda does, well, it’s easy to see why her response stands out,” Clark said. “We are very, very lucky to have her here in New Zealand. The world is lucky to have her.”\nBut there isn’t blanket approval of Ardern’s COVID-19 response.\nArdern has also faced criticism for her government’s decision to keep the shutdown in place for more than four weeks. Dr. Simon Thornley, a senior epidemiology lecturer at the University of Auckland, called Ardern’s strict lockdown an “overreaction.” Meanwhile Simon Bridges, leader of the center-right opposition National Party, accused Ardern of making New Zealand businesses “sacrificial lambs” during the lockdown, a charge Ardern denies. He also complained of insufficient testing and contact-tracing, and not enough personal protective equipment.\nSome critics have called her out for being evasive at briefings. “There has been some criticism that the government hasn’t been as open or ready to answer questions as they might have been,” said political commentator David Cormack.\nOthers have warned about the “hero-worship” of Ardern, saying it runs the risk of creating a leader who can not be held to account over any aspect of the country’s COVID-19 response. “Even gentle questioning ... is seen as a personal attack on Ardern,” political journalist Andrea Vance wrote in the online news site Stuff. “Just because Ardern is remarkable, does not mean she is always right.”\nWhat comes after a pandemic?\nAs the country takes the first tentative steps toward something like normality, Ardern’s empathetic and science-led leadership could face an even bigger test: What comes next?\nIn New Zealand, as around the world, COVID-19 is laying bare stark structural inequalities.\nIn common with patterns emerging elsewhere, communities of color have been hit hardest. A study found the indigenous Maori population and the Pasifika population in New Zealand were twice as likely to die of COVID-19 ― a key reason Ardern extended the restrictive Level 4 lockdown by a week.\nThe country must also grapple with a housing affordability crisis and pockets of deep child poverty, according to a February report from The Salvation Army, which pointed to “entrenched poverty,” in the country.\nKai Schwoerer via Getty Images A homeless woman on March 26 in Christchurch, New Zealand.\nThere are growing calls for Ardern to use her unique leadership qualities to deliver the “transformational change” she promised when she was delivered to the top job back in 2017.\nArdern’s impressive leadership throughout the COVID-19 crisis has generated her a “huge amount of goodwill and support” that could be used toward policies that address some of the country’s social inequities, said public policy researcher Jess Berentson-Shaw.\nBerentson-Shaw suggested that helping women should be a key focus, but so far hasn’t been at the forefront of Ardern’s economic response: “The majority of job losses have been in industries dominated by women, so [Ardern’s pandemic response] really lacks the equity focus I would hope for from a feminist leader.”\nArdern should also ensure that her government’s commitment to fast-tracking infrastructure projects post-pandemic is done carefully, said Berentson-Shaw. “Any infrastructure investment should prioritize planetary health as a minimum.”\nJacob Anderson, program manager for the environmental education organization Blake, also wants Ardern to prioritize the environment.\nGrappling with a post-COVID-19 world will be a “defining moment in New Zealand’s history,” he said. He hopes the combination of Ardern’s trust in science with her empathy, which has proved to be a winning formula in containing COVID-19, will also be applied to the climate crisis. “We are now used to looking at daily graphs, numbers and figures. … Terms like ‘flatten the curve’ are now well-known and understood,” he said, “and concepts like this can be used to communicate the exponential increase in carbon emissions, or rapid declines in biodiversity.”\nArdern gained international plaudits last year when New Zealand passed a national law to reach net-zero carbon emissions by 2050. But New Zealand’s latest plan for how it intends to meet its United Nations climate commitments, released last week, contained the same overall emissions reduction targets as five years ago, despite the U.N. urging countries to set higher goals.\nNew Zealand “missed an opportunity” to strengthen its overall emissions ambitions in line with the spirit of the 2015 Paris climate agreement, said Helen Mountford, vice president for climate and economics at the World Resources Institute, who emphasized “the urgent need for countries to build back better coming out of the COVID-19 crisis.”\nArdern’s most immediate task is to win the country’s general election, due to be held in September. She is expected to be returned to power, but will face the enormous task of trying to keep a country united that by then is highly likely to be well into the depths of a recession.\nPutting the environment and social inequality at the heart of any economic stimulus plan that’s adopted ― while essential for a more just recovery ― could be a tougher sell than it may seem.\n“Jacinda is a powerful leader, she has influence, but the change that is really needed takes a lot of courage, and she is really going to have to drive a hard bargain with her party and say, ‘We have to do better than this,’” said environmentalist and former New Zealand Green Party politician Catherine Delahunty.\n“This is an opportunity for real change,” she added, “and it’s up to Jacinda Ardern to decide whether or not her government has the vision to do what needs to be done, because there is no going back to where we were before COVID-19.”\nFor more content and to be part of the “This New World” community, follow our Facebook page.\nHuffPost’s “This New World” series is funded by Partners for a New Economy and the Kendeda Fund. All content is editorially independent, with no influence or input from the foundations. If you have an idea or tip for the editorial series, send an email to thisnewworld@huffpost.com.", "url": "https://www.huffpost.com/entry/new-zealand-coronavirus-jacinda-ardern-lockdown-lifted_n_5ea7df0ec5b6a30004e7cbde"}