{"authors": ["Adam Beam"], "date_download": "2020-05-04 20:09:31", "date_modify": "2020-05-04 20:09:31", "date_publish": "2020-04-16 05:02:31", "description": "SACRAMENTO, Calif. (AP) — California Gov. Gavin Newsom expects to spend up to $7 billion this year battling the coronavirus and the economic disruption it has unleashed as state budget experts...", "filename": "_1cc26195fdfe0e956aeb1c8d7e4f671e_1588622971.html", "image_url": "https://storage.googleapis.com/afs-prod/media/83fd3e8a64be40a9bbb1e44aec13c740/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1cc26195fdfe0e956aeb1c8d7e4f671e_1588622971.html", "title": "California governor expects $7 billion in virus spending", "title_page": "California governor expects $7 billion in virus spending", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "State Sen. Holly Mitchell, D-Los Angeles, chair of the Senate budget committee, gives a double thumbs after Sen. Nancy Skinner, D-Berkeley, joins by video, an oversight hearing of the senate budget special subcommittee on COVID-19 at the Capitol in Sacramento, Calif., Thursday, April 16, 2020. Lawmakers are looking into how Gov. Gavin Newsom has been spending money to address the new coronavirus crisis. Following social distancing procedures, two Senators, Mitchell, and Sen. Jim Nielsen, R-Gerber, attended the hearing in person while the rest of the committee members joined by video. (AP Photo/Rich Pedroncelli, Pool)\nState Sen. Holly Mitchell, D-Los Angeles, chair of the Senate budget committee, gives a double thumbs after Sen. Nancy Skinner, D-Berkeley, joins by video, an oversight hearing of the senate budget special subcommittee on COVID-19 at the Capitol in Sacramento, Calif., Thursday, April 16, 2020. Lawmakers are looking into how Gov. Gavin Newsom has been spending money to address the new coronavirus crisis. Following social distancing procedures, two Senators, Mitchell, and Sen. Jim Nielsen, R-Gerber, attended the hearing in person while the rest of the committee members joined by video. (AP Photo/Rich Pedroncelli, Pool)\nSACRAMENTO, Calif. (AP) — California Gov. Gavin Newsom expects to spend up to $7 billion this year battling the coronavirus and the economic disruption it has unleashed as state budget experts warned lawmakers on Thursday to prepare for revenue loss akin to the Great Recession.\nThe news came Thursday as state lawmakers held their first oversight hearing of the more than $2 billion Newsom has already spent, questioning administration officials about a nearly $1 billion contract with a Chinese-owned company to provide up to 200 million masks per month.\nLawmakers from both political parties were upset the administration has yet to release details of the contract, with Republican state Sen. Jim Nielsen saying he was not confident the masks would ever arrive.\n“We cannot just be throwing out a false hope to people,” he said.\nTina Curry, chief deputy director for the Governor’s Office of Emergency Services, said there is so much demand for the masks state officials are afraid their supply could be disrupted if they release too many details.\n“We do intend to provide that when we have assurances that the supply is going to be arriving and with the requirements we have set forth,” Curry said.\nThe coronavirus’ spread in California has not been as devastating as public health officials had feared, with the growth in hospitalizations slowing as the state has been under a mandatory stay-at-home order for nearly a month that has closed schools and nonessential businesses. Still, Newsom warned earlier this week that the virus’ steady presence would likely continue to disrupt public life well into the summer and beyond.\nUnemployment data reflecting the coronavirus restrictions won’t be available until next month. But Legislative Analyst Gabriel Petek said the number of people who have filed for unemployment benefits — more than 2.7 million as of Wednesday — indicate between 12% and 15% of Californians have lost their jobs.\n“The pace of job losses that we are seeing, caused by an abrupt halting of economic activity, make it clear the economy has entered a recession, and possibly a quite severe one,” he said, adding the experience could be similar to the Great Recession a decade ago and that the Legislature should prepare for a “very substantial” decline in revenue.\nThe $7 billion Newsom plans to spend does not include other increased costs for things like Medicaid and other social safety net programs that have been affected by the virus. So far, the money Newsom has spent came from an emergency reserve fund and $1 billion the state Legislature gave to him just before they recessed on March 16.\nVivek Viswanathan, chief deputy director for budget at the California Department of Finance, said they expect the federal government to reimburse up to 75% of the state’s coronavirus spending because of President Donald Trump’s major disaster declaration.\n“This is an unprecedented situation,” Viswanathan said.\nIt’s unclear how Newsom wants to spend this money. Viswanathan said the administration would have more details when it updates its budget proposal next month.\nMost lawmakers on the special budget subcommittee participated via videoconference on Thursday in a hearing that tested the technological limits of public debate in an era of social distancing.\nJust two senators attended the hearing in person, held in a large committee room in the state Capitol. Senate Budget and Fiscal Review Committee chairwoman Holly Mitchell wore a mask and conducted the hearing with a package of disinfectant wipes at her side.\nThe hearing was delayed by nearly an hour because the Senate’s website crashed as more than 10,000 people beyond what state officials had expected tried to watch the hearing. More than 30 people offered public comment over the phone.\nIt was the first legislative hearing since lawmakers recessed on March 16 because of the coronavirus, believed to be the first unscheduled work stoppage at the Capitol in 158 years.\nCalifornia has more than 27,600 confirmed cases and more than 950 deaths, according to data compiled by Johns Hopkins University.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.", "url": "https://apnews.com/1cc26195fdfe0e956aeb1c8d7e4f671e"}