{"authors": ["Overnight Editor"], "date_download": "2020-05-04 21:09:35", "date_modify": "2020-05-04 21:09:35", "date_publish": "2020-05-01 03:26:19", "description": "The Fox News host claimed young children can't spread the COVID-19 disease.", "filename": "entry_tucker-carlson-coronavirus-children_n_5eab79fcc5b6995f13fe819e_1588626575.html", "image_url": "https://img.huffingtonpost.com/asset/5eab9185220000690d827f85.jpeg?cache=yjxicx34dn&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_tucker-carlson-coronavirus-children_n_5eab79fcc5b6995f13fe819e_1588626575.html", "title": "Tucker Carlson Gets Hit With Blunt Coronavirus Fact-Check Live On His Own Show", "title_page": "Tucker Carlson Gets Hit With Blunt Coronavirus Fact-Check Live On His Own Show | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Fox News host Tucker Carlson tried to spread another myth about coronavirus infections on Thursday.\nIt didn’t go well. Carlson got a quick fact-check on his own show when his guest, Fox News contributor Dr. Marc Siegel, stepped in with a correction.\nCarlson had claimed that “young children do not spread the coronavirus.”\nBut Siegel said kids can get the viral infection and spread it, it’s just not as severe when they get sick themselves.\n“They appear to have a protein in the lungs that protects them from severe disease,” he said, so when kids get the virus, they have mild cases or don’t show symptoms.\n“But it’s not true that children don’t get it, and it is not true that they can’t spread it,” he said. “Just much less likely than adults.”\nTucker Carlson: There’s new evidence that young children do not spread the Coronavirus\nMarc Siegel shortly after: It is not true that children don’t get it and it is not true that they can’t spread it pic.twitter.com/L0YK49JEij — Acyn Torabi (@Acyn) May 1, 2020\nAs Carlson and Siegel spoke, the graphics on the screen claimed “Studies: No evidence kids under 10 spread virus” and that there were no cases of young children passing the virus to an adult.\nBut one of the authors of the study is, as Siegel noted, taking issue with that interpretation in the media. Alasdair Munro said on Twitter that there have been “MAJOR misunderstandings” about the report and clarified that “Children almost certainly DO transmit COVID-19.”\nHe added:\nSo where do we stand?\nWe don't know for sure but growing evidence suggests children are less susceptible to infection, have milder infection, and are infrequently responsible for household transmission.\nSee more here.https://t.co/FVoWNdO6m7\nEnd.\n6/6 — Alasdair Munro (@apsmunro) April 30, 2020\nThe data on the extent of infection in children and their ability to spread it is still far from clear.\n“All we really know at this point is that with a small number of exceptions, children are mildly affected by this infection,” Adam Finn, a professor of pediatrics at the University of Bristol and chairman of the World Health Organization’s European Technical Advisory Group of Experts on Immunization, told Bloomberg. “What is much less clear is how often they get infection and how infectious they are to each other and to other people in their families.”\nOne study out of Germany has suggested that, although kids may not have the same symptoms, they could be as infectious as adults in terms of how much virus they can carry.\nThere have also been reports of coronavirus in young children leading to Kawasaki disease, which causes inflammation in the walls of some blood vessels.\nThe World Health Organization says it is “urgently” looking into that connection.", "url": "https://www.huffpost.com/entry/tucker-carlson-coronavirus-children_n_5eab79fcc5b6995f13fe819e"}