{"authors": ["Samantha Murphy Kelly", "Cnn Business"], "date_download": "2020-05-04 16:34:05", "date_modify": "2020-05-04 16:34:05", "date_publish": "2020-04-07 11:05:53", "description": "When Shelby Law gave birth to her baby seven weeks early in late March, she and her husband freely visited their newborn in the hospital's Neonatal Intensive Care Unit.", "filename": "2020_04_07_tech_facetime-hospitals-coronavirus_index_1588610045.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403160937-nicu-newborn--stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_tech_facetime-hospitals-coronavirus_index_1588610045.html", "title": "As hospitals enforce strict rules, parents are using FaceTime to see their newborns", "title_page": "As hospitals enforce strict rules, parents are using FaceTime to see their NICU newborns  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) When Shelby Law gave birth to her baby seven weeks early in late March, she and her husband freely visited their newborn in the hospital's Neonatal Intensive Care Unit.\nBut three days later, Northside Cherokee Hospital in Camden, Georgia, changed its policies to suspend all visitors to its special care nurseries amid growing concerns over the coronavirus outbreak.\n\"We were told we were no longer allowed to visit our son Rory in the NICU,\" Law told CNN Business. \"We said goodbye to him and went home.\"\nThe couple now checks in on him twice a day via Apple's FaceTime video chat platform, when a nurse calls at scheduled times when he's feeding or taking a bath.\n\"We are relieved to have the option to FaceTime with our son and we understand why there's a policy in place, but I'd be lying if I didn't admit I've also cried for days,\" Law said.\nHospitals across the United States continue to be overwhelmed with COVID-19 patients; in New York, patient beds line the hallways of some facilities, morgues are overflowing and supplies like ventilators are in short supply. As a result, an increasing number of hospitals are banning or limiting visitations to nurseries specializing in the care of ill or premature newborns — a demographic that is particularly vulnerable to contracting outside sicknesses. Video chat services like FaceTime have become a lifeline for many families grappling with these changes, giving them a chance to bond with their babies from afar.\nJulianna Grogan, a New York City-based mother who was diagnosed with COVID-19 before the birth of her daughter on April 2, told CNN Business her husband and doula cheered her on during the delivery via FaceTime, as they were not permitted into the room. \"They were watching the whole time,\" she said. \"Luckily, I had a stand with a clip to attach my phone to the bed.\"\nNow recovering alone in her hospital room, both from childbirth and the virus, the nurses at Metropolitan Hospital Center use FaceTime periodically throughout the day so she can see her baby.\nA parent uses the NICU2Home app to see and talk to their newborns in special care nurseries as more hospitals are banning or limiting visitations during the coronavirus crisis.\nSome hospitals have a more formal process in place. At Northwestern Medicine's Prentice Women's Hospital, which now restricts NICU visits to only one parent, an app called Smart NICU2Home allows remote checkins on babies. Parents can receive updates throughout the day on their child's vital signs, including information around their breathing, weight, bowel movements and medications, and access mental health features such as stress-reducing techniques.\n\"As Covid-19 began to spread and hospitals started shutting doors to visitors, we realized this was a tremendous and necessary connection for parents to their new babies,\" said Northwestern pediatrics professor Dr. Craig Garfield, who also works at Lurie Children's Hospital of Chicago. Along with Northwestern adjunct professor Dr. Young Seok Lee, they launched the app several years ago for a small group of the sickest babies in the NICU but rolled it out to all families in the special care unit last week.\n\"While it is hard for anyone to have a loved one in the hospital and not be able to visit, new parents are particularly traumatized, as they have been waiting months and months to become mothers and fathers,\" Garfield added.\nMeanwhile, some hospitals have formalized video chat systems already in place. The University of California Davis Medical School's FamilyLink webcam program launched in 2014 as a way to allow parents with newborns who needed long-term hospital assistance to return home to care for their other children or head back to work, allowing them to save maternity and paternity leave for a later time.\nParents receive secure log-in information when their baby is admitted to the NICU. All 49 of its NICU beds are now equipped with Logitech webcams.\nWhile interacting remotely with a newborn may seem impersonal, Dr. Kristin Hoffman of UC Davis said research has shown parents are still effectively able to bond with babies this way, especially when it comes to helping breastfeeding — a concern for many families with babies in the NICU. \"From our previous research, we know that families who used FamilyLink were more likely to have a sustained intention to breastfeed — breast milk is like medicine, particularly for small babies, and so this finding is very exciting,\" she said.\n@CoombeHospital Just like to say a big thank you to the staff in NICU and a big thanks to Mary Ó Connor for our facetime with our baby girl Harper yesterday it ment the world to us 😊 we need to do our part and stay apart ❤️ Keep safe everyone. Thank you ❤️ pic.twitter.com/tHtMhz3tAN — Mairéad Mck (@MckMairead) April 1, 2020\nAlthough bonding with babies remotely is not what many parents imagine, it's becoming a new normal for many.\n\"We were asked if we'd like to use FaceTime to see our daughter, and it's been amazing,\" said 28-year-old Mairead McKenna, who recently gave birth to her daughter Harper at 26 weeks. \"But I'm also struggling so much not seeing her.\"\nCoombe Women & Infants University Hospital in Dublin, Ireland, urged her to temporarily stay out of the NICU because she was not feeling well with symptoms unrelated to COVID-19.\n\"I fear in the coming days or weeks, [the hospital] will stop all parents from visiting, as things will likely get worse before it gets better,\" McKenna said. \"I'm guessing this will be our new setup [for awhile now].\"", "url": "https://www.cnn.com/2020/04/07/tech/facetime-hospitals-coronavirus/index.html"}