{"authors": ["Exclusive Lauren Del Valle", "Miguel Marquez", "Dr. Lorenzo Paladino", "Of Young Patients In The Er", "Cheryl Rolston", "Director Of The Emergency Department", "Dr. Robert Gore", "Dr. Wayne Riley", "Julie Eason To Medics Around The Country", "Michael Mcgillicuddy"], "date_download": "2020-05-04 16:22:16", "date_modify": "2020-05-04 16:22:16", "date_publish": "2020-04-06 00:01:01", "description": "\"CODE-99\" rings out. In 40 minutes, six patients go into cardiac arrest. Four die. This is what it's like inside a New York City ER treating people with coronavirus.", "filename": "2020_04_05_health_inside-new-york-coronavirus-hospital_index_1588609336.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405150329-07-inside-coronavirus-hospital-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_health_inside-new-york-coronavirus-hospital_index_1588609336.html", "title": "Inside an ER during the coronavirus outbreak", "title_page": "Inside an ER during the coronavirus outbreak - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Brooklyn, New York (CNN) One emergency room. Forty minutes. Six patients go into cardiac arrest. Four die before they make it out of the ER.\nThe blare of the critical \"CODE 99\" from the hospital alert system rings out five other times in less than an hour, calling medics to scramble to a patient needing resuscitation.\nIt's not chaos to them, but to an onlooker, it seems like hell.\n\"They're so sick you lose them in a heartbeat, they're that sick,\" respiratory therapist Julie Eason told CNN. \"They're talking to you and then a few minutes later you're putting a tube down their throat and you're hoping that you can set the ventilator in such a way that it actually helps them.\"\nThis is the truth of what coronavirus is doing to thousands of Americans , and likely will to many thousand more. It has been largely unseen because visitors are not allowed to be in hospitals, and everyone else is staying home.\nThe University Hospital in Brooklyn is now dedicated to only coronavirus patients.\nThe volume of people coming to the ER is lower than before the virus, but because they are all suffering from Covid-19, the patients are sicker and the death rate is high. Nearly 25% of the patients admitted to the hospital with the virus have died.\n\"It's not the hospital it's the nature of the disease,\" Dr. Lorenzo Paladino, an emergency medicine physician, told CNN.\nThere are no broken bones or stomach viruses these days. These doctors are only seeing people who are struggling to breathe because they've contracted the virus that's caused a pandemic across the globe and is now heading to a peak in New York City, according to some scientists.\nMore and more patients are coming to SUNY Downstate by the day, its doctors said.\n\"It's relentless,\" Paladino said.\nAnd there is no time for rest. CNN reporters saw a health care worker wrap the body of a deceased patient. Within 30 minutes, the body was gone, the space was sanitized and there lay a critically ill man, coughing, with an oxygen mask on his face.\nThey just watched four codes happen. This is 'Grey's Anatomy' stuff for them, not real life. It shouldn't happen in front of them Dr. Lorenzo Paladino, of young patients in the ER\nOf the nearly 400 people admitted for Covid-19 treatment at the hospital, 90% of them are over the age of 45, and 60% are older than 65, staff said. But it's not only an affliction for the old. Their youngest patient was a toddler, age 3.\n\"We have some young people in there in their 20s, not used to seeing this and some had a thousand-mile stare, just crying,\" Paladino said of patients seeking treatment for coronavirus in the emergency room.\n\"They just watched four codes happen. This is 'Grey's Anatomy' stuff for them, not real life. It shouldn't happen in front of them.\"\nDr. Cynthia Benson says it's hard emotionally to prepare to have so many patients that cannot be saved.\nThe doctors, nurses, respiratory therapists and hospital staff stay calm as they fight to save their patients.\n\"This is what we signed up for, just not in this volume,\" Dr. Cynthia Benson, who works with Paladino in the ER, told CNN.\nThey are not used to this -- the frequency of people struggling to breathe, the number of alarms ringing with a \"code\" alerting doctors that a patient isn't breathing, the percentage they cannot save because Covid-19 strikes so hard and so fast.\nWe have to be prepared for the overwhelming amount of deaths that we are going to have Cheryl Rolston, director of the emergency department\n\"You know you may have a code, maybe on a bad shift you may have two codes where you carry that emotion and you wonder if you did everything that you could,\" Benson said. \"I think it's emotionally hard to prepare for this level of sickness and suffering and morbidity and mortality in such a short period of time. I don't think any of us are well prepared for it.\"\nNinety-four people have died from complications related to Covid-19 at SUNY Downstate since the pandemic hit three weeks ago.\nJUST WATCHED Protective equipment runs short in another Brooklyn hospital Replay More Videos ... MUST WATCH Protective equipment runs short in another Brooklyn hospital 05:49\n\"The hardest part, I think, for nursing is also we are always looking to make people better,\" Cheryl Rolston, a registered nurse and director of the emergency department, told CNN. \"We have to be prepared for the overwhelming amount of deaths that we are going to have.\"\nRolston said it's difficult for her to watch the patients suffer without loved ones at their bedside.\n\"I had one patient's son call me the other day and he said, 'my dad is 80-something years old...I know he's going to die ... and I'm sad because he's dying alone.'\"\nYou're driving down New York Avenue or Nostrand Avenue, which are pretty busy thoroughfares -- it's almost crickets. But then here in the emergency department, it's a level of intensity that you only see in disaster zones Dr. Robert Gore\nThe war zone-like scene inside SUNY Downstate -- an 8-story state-run hospital in the East Flatbush neighborhood of Brooklyn -- is so different from the world outside, subject to \"stay at home\" orders.\n\"You're driving down New York Avenue or Nostrand Avenue, which are pretty busy thoroughfares -- it's almost crickets,\" Dr. Robert Gore, an emergency medicine physician, told CNN. \"But then here in the emergency department, it's a level of intensity that you only see in disaster zones.\"\nDr. Robert Foronjy says life has turned upside down for everyone associated with the hospital.\nDr. Robert Foronjy, Downstate's Chief of Pulmonary and Critical Care Medicine, grew up 10 blocks away from the hospital.\n\"My life was pretty normal three weeks ago and this happened almost overnight,\" Foronjy told CNN.\n\"It's tough on everyone,\" he added. \"But the people I feel most for are the families, especially the ones that never have an opportunity to say goodbye to their loved ones.\"\nThe sickest patients struggling to breathe are put on ventilators that essentially take the breaths for them. The complex, expensive machines are essential in the fight against coronavirus. Cuomo has said the state of New York could need more than 30,000 additional ventilators.\nBut these machines aren't a magic cure. Data has shown the odds of surviving are low for Covid-19 patients on ventilators, Paladino said.\nDr. Lorenzo Paladino has researched using one ventilator for multiple patients.\nPaladino is one of the researchers who's shown that one ventilator can help two patients at once in certain circumstances -- something Cuomo has said may need to be tried. But Paladino says the co-ventilating technique isn't a solution to the shortage.\n\"It was always meant to be a temporary bridge for hours, 12 hours, until an area hospital can deliver us some more vents or until the stockpile can come,\" he said.\nHe hopes his research does not get tested in this emergency, but acknowledged it may be the lesser of two evils.\n\"We're worried about, what if the day comes where we don't have enough ventilators,\" Paladino said. \"We don't want to make the decision between two viable patients by simply trying to decide who's more worthy or flipping a coin.\"\nJulie Eason says patients with coronavirus are different to any she has seen before.\nEason, the hospital's respiratory therapy department director, said the need for ventilators also means a need for trained people.\n\"It's very complex and if you don't set it up right, that patient outcome is different,\" Eason said. \"You need skilled people who have lots of experience doing this to have good outcomes with these patients, and these patients are so different from any patients we've ever seen before.\"\nWe're really taking a lot of tactics from military medicine to do this disaster medicine Dr. Wayne Riley\nThe need for trained medical staff is set to become acute for SUNY Downstate and many others. Cuomo has mandated all hospitals in the state to expand their bed capacity by at least 50%.\nSUNY Downstate has more than 2,000 employees that care for patients in 225 beds.\nTo meet the anticipated surge of patients, the hospital's cafeteria will be equipped for about 50 more patient beds and tents sprawling the parking lots are already outfitted as negative pressure spaces, a sterilizing technique that prevents airborne contaminants from spreading the virus.\nSoon, they'll open a second Covid-19 overflow space at a facility in a nearby Brooklyn neighborhood.\nDr Wayne Riley, president of SUNY Downstate, is worried about keeping his staff healthy.\nThe tents are what you might imagine a military base to look like in a war zone, but they're in the middle of the neighborhood, surrounded by rowhomes just yards away.\n\"We're really taking a lot of tactics from military medicine to do this disaster medicine,\" said SUNY Downstate President Dr. Wayne Riley. \"You make it up, you improvise, you get creative in the times of disaster and epidemic.\"\nHe said he's worried most about having enough healthy medical professionals to treat patients.\n\"There's a lot of things that keep me up at night,\" Riley said. \"First of all, the safety of my physicians and my nurses and respiratory therapists -- I worry deeply about them in terms of their exposure.\"\nEmployees at the hospital are working mandatory overtime, and vacations and scheduled personal leave have been canceled indefinitely.\nAnd still more help is needed. The day CNN visited the hospital, an emergency alert sounded on everyone's phones across New York City.\nA request for volunteers was sent as a phone alert.\n\"Attention all healthcare workers: New York City is seeking licensed healthcare workers to support healthcare facilities in need. Visit NYC.gov/helpnow to volunteer,\" the alert said.\nSUNY Downstate has had more than 50 healthcare workers offer to help and some are already on the frontlines.\nOne offer ca​me from a critical care physician over 70 years old, said Dr. Mafuzur Rahman, who assigns physicians throughout the hospital.\n\"Donating their time is almost taking away from the bigger sacrifice they're making,\" Rahman said of the volunteers. \"They're putting themselves at risk, their families at risk, to care for our patients.\"\nGet ready, because whatever you've imagined as your worst day ever, you've not seen it yet Julie Eason to medics around the country\nThe medical staff at SUNY Downstate have that same dedication, though with little knowledge about this new strain of coronavirus, much of the treatment is trial and error.\n\"The hopelessness, helplessness I see in their eyes -- they want to do the very best they can,\" Rahman said.\nAfter long, intense and challenging shifts trying to help sick strangers, most of the medical professionals can't even get a hug or a kiss from their loved ones -- they've quarantined themselves from their families because they're afraid of exposing them to the virus.\n\"I see them from a distance with a mask and wave, you know, from 20 feet away or so and just make sure that they're OK,\" Paladino said of his own family.\nWith a disaster we know what we're getting. Here, it is nonstop Michael McGillicuddy, morgue supervisor\nThis is the new normal for SUNY Downstate, at least for now, and they want their colleagues in cities like Chicago and Detroit -- viewed as the next hot spots for Covid-19 -- to prepare for disaster.\n\"Get ready, because whatever you've imagined as your worst day ever, you've not seen it yet,\" Eason, the respiratory therapist, warned.\n\"We normally have a couple patients that are this level sick. (Now) Our ICUs are filled with them, filled with them, and none of them can breathe,\" Eason said.\nSo many have died and so quickly that the hospital now has two refrigerated trucks parked outside to hold the bodies because its own mortuary is full.\nMichael McGillicuddy, morgue supervisor, says the pandemic frightens him.\nMorgue supervisor Michael McGillicuddy said he may need to order more trucks.\n\"This is pretty much the worst that I've seen. Because with a (natural) disaster we know what we're getting. Here, it is nonstop,\" McGillicuddy told CNN.\n\"I'm a volunteer fireman. I've run into burning buildings. I've seen accidents. This scares me. For myself, for my family and for everyone.\"\nAnd for the dead, the staff are trying to give them one last mark of respect, SUNY Downstate Director of Government Relations Jelanie DeShong told CNN.\n\"We've been trying our best not to stack the bodies.\"", "url": "https://www.cnn.com/2020/04/05/health/inside-new-york-coronavirus-hospital/index.html"}