{"authors": [], "date_download": "2020-05-04 20:16:11", "date_modify": "2020-05-04 20:16:11", "date_publish": "2020-04-15 17:16:40", "description": "PHOENIX (AP) — Public health officials in Arizona's largest county say they're seeing improvements in the number of people hospitalized for the coronavirus. The Maricopa County Department...", "filename": "_1d4ac285f79eb245eb3c99f3afdcaea0_1588623371.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1d4ac285f79eb245eb3c99f3afdcaea0_1588623371.html", "title": "Maricopa County says coronavirus hospitalizations slowing", "title_page": "Maricopa County says coronavirus hospitalizations slowing", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PHOENIX (AP) — Public health officials in Arizona’s largest county say they’re seeing improvements in the number of people hospitalized for the coronavirus.\nThe Maricopa County Department of Public Health said Wednesday the rate of growth in hospitalizations is slowing. Officials say that’s likely due to the social distancing measures that have closed businesses and left people avoiding large gatherings.\n“This is exactly why the governor put protective measures in place,” Dr. Rebecca Sunenshine, the county’s medical director for disease control, said in a statement. “Flattening the curve allows hospitals to have the resources to care for everyone who becomes sick. The challenge is that for the curve to remain flat and eventually slope down, we cannot relax our social distancing measures yet.”\nThe county also released data showing that people with high blood pressure, diabetes or heart, kidney, lung or liver disease are more likely to be hospitalized. People with high blood pressure, for example, make up 35% of hospitalizations but only 17% of the total group of people with cases of COVID-19, the disease caused by the coronavirus.\nMeanwhile, state health officials said 11 more people in Arizona have died from complications of the coronavirus, bringing the total number of deaths since the start of the outbreak to 142. The 11 deaths reported Wednesday were in Maricopa, Pima, Coconino and Navajo counties.\nThe state reports 156 new infections, bringing the number of cases to nearly 4,000.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.\nIn another development, Gov. Doug Ducey’s office announced Wednesday that Arizona is joining other places around the country in lighting buildings blue as a symbol of support for medical workers and others responding to the outbreak.\nBuildings and structures that will be lit blue will include the State Capitol, the state Executive Tower and Phoenix Children’s Hospital, the announcement said.\n“Arizona is immensely grateful to our frontline medical workers and all the men and women who have stepped up to keep others safe and healthy,” Ducey said in a statement.\nDucey also signed an executive order allowing food trucks to operate at highway rest stops. Commercial activity is normally prohibited at rest areas that get federal funding, but Ducey’s office says the Federal Highway Administration has relaxed those rules.\nDucey says the food trucks will be permitted initially at eight rest areas, and he may allow more if the demand is strong. He says the move will help struggling food trucks and ensure long-haul truckers have access to food while they keep goods moving to store shelves.\nIn state prisons, the number of inmates who tested positive grew from 10 on Tuesday to 17 on Wednesday. No cases have been reported among inmates and employees in Arizona’s county jails.", "url": "https://apnews.com/1d4ac285f79eb245eb3c99f3afdcaea0"}