{"authors": ["Gregory Lemos"], "date_download": "2020-05-04 16:02:34", "date_modify": "2020-05-04 16:02:34", "date_publish": "2020-04-01 19:03:43", "description": "A growing chorus of Tennessee doctors and local leaders want Gov. Bill Lee to issue a stay-at-home order, warning that the coronavirus outbreak will only worsen in the state if he doesn't.", "filename": "2020_04_01_us_coronavirus-t_c16ec6d78418569a6000e3d033b3d1d9_index_1588608154.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401125508-tennessee-gov-bill-lee-0316-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_us_coronavirus-t_c16ec6d78418569a6000e3d033b3d1d9_index_1588608154.html", "title": "Tennessee doctors and local officials call on Gov. Bill Lee to mandate stay-at-home order", "title_page": "Tennessee doctors and local officials call on Gov. Bill Lee to mandate stay-at-home order - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A growing chorus of Tennessee doctors and local leaders want Gov. Bill Lee to issue a stay-at-home order, warning that the coronavirus outbreak will only worsen in the state if he doesn't.\nAt least 80% of the U.S. population is under a stay-at-home or shelter-in-place order, according to a CNN count. In Tennessee, Lee has resisted issuing a mandate, opting instead to issue an order that strongly urges residents to stay at home.\n\"I want again, to speak to the Tennesseans, who have the privilege and the capacity to safely stay home for the next two weeks. We need you to do that,\" Lee said at a press conference on Tuesday.\nSigned Monday, the order closes non-essential businesses that were still open, like hair salons, spas, theaters, concert venues and other entertainment establishments. Churches are exempt from the state order which took effect overnight on Tuesday.\nLee said Monday that he was not issuing a mandated shelter in place order because it is \"deeply important to me\" to protect personal liberties.", "url": "https://www.cnn.com/2020/04/01/us/coronavirus-tennessee-doctors-bill-lee-stay-at-home-trnd/index.html"}