{"authors": ["Holly Yan", "Christina Maxouris", "Steve Almasy"], "date_download": "2020-05-04 16:05:34", "date_modify": "2020-05-04 16:05:34", "date_publish": "2020-04-01 07:15:45", "description": "More data showing people without symptoms are fueling the spread of coronavirus have top officials rethinking whether the general public should be wearing masks.", "filename": "2020_04_01_health_us-coronavirus-updates-wednesday_index_1588608334.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331143903-coronavirus-math-lesson-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_health_us-coronavirus-updates-wednesday_index_1588608334.html", "title": "As coronavirus cases pass 200,000, more states are saying stay at home", "title_page": "As coronavirus cases pass 200,000, more states are saying stay at home - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) On a day several more states, including Florida, told most of their residents to stay at home, the number of US coronavirus cases skyrocketed past 200,000 on Wednesday.\nThe news comes while debate revs up on whether all Americans should be wearing a mask.\nAs of Wednesday afternoon, more than 210,000 people in the United States have been infected, and at least 4,703 have died. The number of fatality reports again reached a new daily high, with more than 900 reported.\nOne of the deaths was a 6-week old in Connecticut, Gov. Ned Lamont said.\nMore data showing people without symptoms are fueling the spread has top US officials rethinking whether the general public should be wearing masks . But the World Health Organization, while it says it is reviewing its advice, tells people there is no need to keep your mouth covered if you are not a patient or health worker.\nA quarter of people in US who are sick have no symptoms\nIn the US, an estimated 25% of coronavirus carriers have no symptoms, said the director of the Centers for Disease Control and Prevention.\n\"Information that we have pretty much confirmed now is that a significant number of individuals that are infected actually remain asymptomatic. That may be as many as 25%,\" CDC Director Dr. Robert Redfield told NPR\nTo prevent further spread, the top infectious disease expert in the US says health officials are reconsidering guidance on face masks.\n\"We're not there yet, but I think we're close to coming to some determination,\" Fauci said.\nIf federal officials recommend widespread use of face masks, it would be a stark reversal from recommendations by the World Health Organization and the CDC , who have said face masks should be worn only by health care workers, those who are sick, and those who are taking care of someone sick.\nThe organization is \"continuing to study the evidence\" about whether the general public should use masks during the coronavirus pandemic, WHO Director-General Tedros Adhanom Ghebreyesus said during a media briefing in Geneva, Switzerland, on Wednesday.\nThe WHO recommends the masks for sick people and caregivers, he said.\n\"This is still a very new virus, and we are learning all the time. As the pandemic evolves, so does the evidence, and so does our advice,\" he said.\nBut this week, new information about asymptomatic spread could change public guidelines, Adams said.\nA major argument against the widespread use of masks is that health care workers don't have enough.\n\"We have a massive global shortage,\" Dr. Mike Ryan, executive director of the WHO health emergencies program, said. \"Right now, the people most at risk from this virus are frontline health workers who are exposed to the virus every second of every day. The thought of them not having masks is horrific.\"\nSo some people are making their own masks. JOANN Fabrics and Craft Stores released a video tutorial on how to make face masks.\nEvidence shows social distancing helps\nNearly 90% of the US population now lives in areas that have stay-at-home orders, according to a CNN count based on various state, county and city orders.\nFlorida, with 21 million residents and a large senior citizen population, joined the list Wednesday. Gov. Ron DeSantis issued an executive order directing seniors and people with underlying medical conditions to stay home. All Floridians must limit their movements, he wrote. The order takes effect early Friday.\nGovernors in Georgia and Mississippi also issued orders Wednesday.\nWhile 12 states have not issued stay-at-home mandates, President Donald Trump said he doesn't think a national order is necessary.\n\"States are different and I understand that the governor of Florida, great governor, Ron DeSantis, issued one today and that's good, that's great. But there are some states that are different. There are some states that don't have much of a problem,\" Trump said at a news conference on the US coronavirus response.\nHealth officials say social distancing efforts seem to be paying off, including in Washington state's King County -- the country's first coronavirus epicenter.\n\"We are looking at reductions in person-to-person contact that have progressively improved and have led us to a point where we are making a very positive impact,\" said Dr. Jeff Duchin, the public health officer for Seattle and King County.\nIn hard-hit New York, a CNN analysis shows the day-to-day average of case increases in the past week was 17% -- a major decrease from 58% for the previous seven-day period.\nAnd a large-scale study found that early interventions, such as social distancing and severe restrictions on people's movement, have already saved tens of thousands of lives across Europe.\nScientists at imperial College London studied interventions in 11 European countries and concluded that they \"have together had a substantial impact on transmission.\"\nThe researchers estimate as of March 31, \"interventions across all 11 countries will have averted 59,000 deaths.\"\nEquipment still in short supply\nThe calls for help with vital equipment for treating patients continue. One hospital CEO even went to Twitter on Wednesday to ask Tesla head Elon Musk whether he could supply ventilators.\n\"We are down to one critical care ventilator,\" the message from the account of Mark Geller said about Montefiore Nyack Hospital.\nHospital spokeswoman Lauren Malone told CNN in an email that Geller \"decided it was worth sending a message\" to the Tesla head.\n\"We have not heard back from Mr. Musk, but perhaps we will be lucky enough to receive ventilators,\" Malone said.\nThe hospital was able to obtain 10 ventilators from another source, Malone said.\nCNN has reached out to Tesla for comment.\nColorado Gov. Jared Polis said the state has been talking to factory owners from China and other countries, trying to buy equipment.\n\"We know that not having gotten nearly enough from the federal government, we have really taken it upon ourselves as a state to engage in the purchasing of medical equipment,\" he said.\nPolis said the state doesn't have the hospital beds, ICU units, ventilators and personal protection equipment to treat all potential patients. He said they have ordered some supplies, but, for instance, need to make sure the masks they bought aren't counterfeits.\nCORRECTION: This story has been updated with the correct percentage of Americans under a stay-at-home order.", "url": "https://www.cnn.com/2020/04/01/health/us-coronavirus-updates-wednesday/index.html"}