{"authors": ["Flora Charner"], "date_download": "2020-05-04 16:58:18", "date_modify": "2020-05-04 16:58:18", "date_publish": "2020-04-09 16:45:14", "description": "When the coronavirus first emerged, it seemed like a distant threat to Brazil and the country's sprawling and impoverished favelas. But as the virus spreads across the South American nation, one favela resident is taking it upon himself to protect the neighborhood.", "filename": "2020_04_09_americas_brazil-coronavirus-favela-intl_index_1588611498.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408191743-02-brazil-favelas-coronavirus-intl-super-tease.jpeg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_americas_brazil-coronavirus-favela-intl_index_1588611498.html", "title": "The Brazilian favela resident who saw coronavirus coming", "title_page": "The Brazilian favela resident who saw coronavirus coming - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) When the coronavirus first emerged, it seemed like a distant threat to Brazil and the country's sprawling and impoverished favelas. But as the virus spreads across the South American nation, one favela resident is taking it upon himself to protect the neighborhood.\nThiago Firmino, 39, heard the early reports and decided to find some equipment to protect him and the community of the Santa Marta favela in Rio de Janeiro. \"I started keeping an eye on it when it was still in China and thought, if it's out of control there who knows what could happen here,\" Firmino told CNN during a telephone interview.\nThe community activist and entrepreneur bought two disinfectant sprayers and two white body suits that he found in a local paint shop. He already had a gas mask, purchased in the past to protect himself from police tear gas during anti-government protests.\nLast weekend, Firmino suited up and started spraying bleach on the side streets, alleys and nooks of his favela in balmy 80-degree heat. Rio's sanitation service, Comlurb, has been cleaning many of the city's bus stops, train stations and other areas of high circulation since March but Firmino said he has not seen them in Santa Marta or heard of them working in any other favela.\nAccording to the latest figures from the Brazilian Health Ministry, over 15,000 people have been infected with the coronavirus and 800 people have died. The number of cases has been increasing sharply, with health officials warning the high point may be between April and May.\nRead More", "url": "https://www.cnn.com/2020/04/09/americas/brazil-coronavirus-favela-intl/index.html"}