{"authors": ["Kathryn Vasel", "Cnn Business"], "date_download": "2020-05-04 16:02:42", "date_modify": "2020-05-04 16:02:42", "date_publish": "2020-04-01 16:50:40", "description": "Companies are furloughing thousands of workers due to the economic fallout from the coronavirus pandemic.", "filename": "2020_04_01_success_what-is-a-furlough_index_1588608162.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331083230-new-orleans-empty-street-0327-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_success_what-is-a-furlough_index_1588608162.html", "title": "What does it mean to be furloughed?", "title_page": "What does it mean to be furloughed?  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Companies are furloughing thousands of workers due to the economic fallout from the coronavirus pandemic.\nMacy's,and announced Monday they are furloughing workers, while hotel chain also recently announced that tens of thousands of workers are facing a similar fate.\nBut what exactly does it mean to be furloughed and how does it differ from being laid off?\nLayoff vs. furlough\nA layoff is a separation of employment that can be either temporary or permanent This means the worker is not kept on the company's payroll, but could be rehired at a later date.\nA furloughed worker is still considered an employee, but they have been forced to take a break from work without pay or to reduce their hours.\nFurloughs tend to last less than six months since any period longer than that could trigger employment laws that mandate companies to provide the type of advance notification that can be required ahead of mass layoffs, according to Laura O'Donnell, partner at law firm Haynes and Boone.\nFurloughed workers also usually get to keep their seniority status and return to the same pay level when they are brought back.\nGenerally, furloughed workers' retirement benefits stay in place for as long as they are on the payroll, but the status of their health coverage can depend on the company's plans. Many require employees to work a certain number of hours to be eligible for coverage, but some insurance companies are loosening their requirements for furloughed workers due to the outbreak, O'Donnell said.\nWhy do a furlough?\nFurloughing workers is a cost-saving move that can help a company weather a rough patch.\nThe decision is usually temporary with the hope that workers will eventually be brought back once economic conditions improve.\nIt can also be good for morale.\n\"If they are expecting it to be much more temporary and short term, it is easier to bring folks back than it is to go through the rehire process,\" said Michael Schmidt, vice chair of the labor and employment department at the law firm Cozen O'Connor.\nWhat furloughed workers should know\nWhile state laws vary, furloughed workers can usually apply for unemployment benefits, according to Schmidt.\nFurloughed employees are not supposed to work during their time off and, unless you are contractually obligated to a company, you can still look for another job while being furloughed.\nAlso, employers cannot discriminate when it comes to who gets furloughed.\n\"Companies want to make sure they are not discriminating or retaliating in their employment decisions, including who is getting furloughed and who is not,\" warned Schmidt. \"If it's not the entire workforce, make sure there is legitimate business interest in making the selection.\"", "url": "https://www.cnn.com/2020/04/01/success/what-is-a-furlough/index.html"}