{"authors": ["David Eggert"], "date_download": "2020-05-04 20:21:41", "date_modify": "2020-05-04 20:21:41", "date_publish": "2020-04-16 13:45:30", "description": "LANSING, Mich. (AP) — An additional 219,000 people in Michigan filed for unemployment last week, bringing the total number who have lost their jobs in the coronavirus pandemic to more than 1...", "filename": "_54b972e6c1c894d959be91c716eb3b0e_1588623701.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f6eb15129e5749a0b66ef2cc516f9f76/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_54b972e6c1c894d959be91c716eb3b0e_1588623701.html", "title": "1 million file for Michigan unemployment in a month", "title_page": "1 million file for Michigan unemployment in a month", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Chloe Long and her son, Asa, 8, put up repurposed yard signs reading \"You Are Our Heroes,\" in a show of support for health care workers during the COVID-19 pandemic Thursday, April 16, 2020, at Spectrum Health Lakeland Regional Medical Center in St. Joseph, Mich.(Don Campbell/The Herald-Palladium via AP)\nChloe Long and her son, Asa, 8, put up repurposed yard signs reading \"You Are Our Heroes,\" in a show of support for health care workers during the COVID-19 pandemic Thursday, April 16, 2020, at Spectrum Health Lakeland Regional Medical Center in St. Joseph, Mich.(Don Campbell/The Herald-Palladium via AP)\nLANSING, Mich. (AP) — An additional 219,000 people in Michigan filed for unemployment last week, bringing the total number who have lost their jobs in the coronavirus pandemic to more than 1 million — a staggering quarter of the state’s workforce.\nThe initial claims were among 5.2 million nationally , the federal government reported Thursday. Only two states, California and New York, saw more filings over a four-week period despite Michigan ranking 10th in population.\n“We appreciate the patience of our working families as we process the historic need for benefits,” said Jeff Donofrio, director of the state Department of Labor and Economic Opportunity. He said there are roughly 745,000 people currently receiving payments, double the highest active total in the Great Recession.\nSome people who apply for unemployment aid are turned down and do not actually receive checks. The number of applicants getting benefits also lags behind the number of first-time jobless claims figure by a week.\nPeople have struggled to file online and by phone. Earlier this week, the state’s deluged website was down for about six hours.\n“We know there is more work to do to improve our systems and we’re committed to quickly providing every dollar of emergency financial assistance our workers are entitled to,” Donofrio said.\nMichigan is among 29 states that have started adding $600 to the weekly unemployment aid as provided under the federal government’s $2.2 trillion economic relief package.\n___\nFollow Eggert on Twitter at https://twitter.com/DavidEggert00", "url": "https://apnews.com/54b972e6c1c894d959be91c716eb3b0e"}