{"authors": ["Jocelyn Gecker", "Ben Margot"], "date_download": "2020-05-04 20:24:51", "date_modify": "2020-05-04 20:24:51", "date_publish": "2020-04-10 21:35:57", "description": "OAKLAND, Calif. (AP) — Amid all the shutdowns across the country, Oakland, California, is taking a different approach. It’s closing 74 miles (119 kilometers) of streets to vehicles to create more...", "filename": "_f089348caaee7ea9033de4ba5f7d1cf1_1588623891.html", "image_url": "https://storage.googleapis.com/afs-prod/media/6a3d8082d8da47b797d21a971dd46168/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f089348caaee7ea9033de4ba5f7d1cf1_1588623891.html", "title": "Taking it to the streets: Oakland closes roads to curb virus", "title_page": "Taking it to the streets: Oakland closes roads to curb virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Surfers watch as body surfers ride a wave the \"Wedge\" area of Newport Beach, Calif., Friday, April 10, 2020. The Wedge is closed to all surfboards and flotation devices from 10 a.m. to 5 p.m. May 1 through October 31 each year. The City's directive advances the seasonal blackball order by about three weeks in light of COVID-19. (AP Photo/Chris Carlson)\nSurfers watch as body surfers ride a wave the \"Wedge\" area of Newport Beach, Calif., Friday, April 10, 2020. The Wedge is closed to all surfboards and flotation devices from 10 a.m. to 5 p.m. May 1 through October 31 each year. The City's directive advances the seasonal blackball order by about three weeks in light of COVID-19. (AP Photo/Chris Carlson)\nOAKLAND, Calif. (AP) — Amid all the shutdowns across the country, Oakland, California, is taking a different approach. It’s closing 74 miles (119 kilometers) of streets to vehicles to create more space for people to get outside for safe, socially distanced exercise.\nThe move by Mayor Libby Schaaf to close about 10% of streets comes ahead of an expected sunny Easter weekend that officials worry will bring more people outside.\nThe measure — “Oakland Slow Streets” — will banish traffic in many places starting Saturday.\n“By opening our streets to bikes, joggers and pedestrians we are giving Oaklanders more room to spread out safely,” Schaaf said at an outdoor news conference where she and city officials pulled face masks aside to speak. Schaff said she hoped the decision will “help give some joy” amid sweeping restrictions aimed at slowing the spread of COVID-19.\nAfter weeks of social distancing, California officials say the virus is spreading at a slower pace than anticipated but Gov. Gavin Newsom urged people not to get complacent. The state had more than 580 deaths as of Friday, with more than 21,000 confirmed infections.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.\n“Let’s continue to hold the line. Let’s just do this together. Give us a few more weeks to see where these trend lines go,” Newsom said.\nExtraordinary closures were being implemented at beaches, parks and gardens as the state entered its fourth week of a “stay at home” order that has shuttered schools and non-essential businesses.\nEaster weekend is typically one of the busiest of spring at state parks, which include redwood forests, pristine beaches and idyllic picnic spots. This year, the parks department has asked people not to visit.\nLos Angeles County officials said all botanic gardens, lakes and parks will be closed on Sunday to prevent an influx of Easter visitors. The parks have otherwise remained open but play and sports have been banned and indoor facilities, nature centers, golf courses, various programs and trails have closed.\nLos Angeles Mayor Eric Garcetti similarly ordered all parks closed from Saturday evening through Monday morning.\nA traditional Easter sunrise service that draws hundreds of people to a towering cross atop Mount Rubidoux in the city of Riverside was cancelled.The service dates to 1909 and has only been canceled twice previously, The Press-Enterprise reported.\n“Please look to a local church for a live stream of their Easter services,” the organizers’ website said.\nA blackball flag was raised Friday morning over the lifeguard tower at the Southern California surfing mecca called the Wedge, requiring surfers to get out of the water as Newport Beach implemented new rules barring surfing between 10 a.m. and 5 p.m. and closing the adjacent beach.\nOverall beach use was down 95% in Newport Beach, the city said, but higher numbers of surfers and spectators had been noted at the Wedge during the week’s strong swell.\nIn the inland region east of Los Angeles, authorities warned that the hugely popular San Bernardino Mountains were closed to snow play and parking restrictions would be enforced. The move came as a storm dumped fresh snow on the range.\nAfter a week of chilly weather and rain, the forecast for the weekend in much of California was for warmer weather and sunshine. Oakland officials said the reality that people will want to get outside was part of their rationale in creating pedestrian zones.\nRyan Russo, director of the city’s Department of Transportation, emphasized that part of staying healthy is to “move your body in your local neighborhood — which is why we couldn’t have this be just one street.”\nRusso said the shutdowns will be phased in starting Saturday. Emergency vehicles, essential traffic and vehicles driven by residents who live on affected streets will still be allowed.\n“Isn’t the message to stay home?” said Aura Campa, who lives near Oakland’s Lake Merritt but has been strict about staying home the past few weeks. “If they close the streets, they’re inviting everyone to come out and party. I don’t agree with it. I’m completely against it.”\n___\nGecker reported from San Francisco. Associated Press writers John Antczak in Los Angeles and Amy Taxin in Orange County also contributed to this report.", "url": "https://apnews.com/f089348caaee7ea9033de4ba5f7d1cf1"}