{"authors": [], "date_download": "2020-05-04 20:19:54", "date_modify": "2020-05-04 20:19:54", "date_publish": "2020-04-16 18:26:55", "description": "DENVER (AP) — More than 104,000 people filed unemployment claims last week in Colorado, easily doubling the previous week's figure and raising the total during the coronavirus pandemic to more...", "filename": "_211cd1b66571f5c3d5820d21dd36fd10_1588623594.html", "image_url": "https://storage.googleapis.com/afs-prod/media/fba3dccd693247059cc912af9ff4394b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_211cd1b66571f5c3d5820d21dd36fd10_1588623594.html", "title": "Colorado jobless claims exceed 266,000 during pandemic month", "title_page": "Colorado jobless claims exceed 266,000 during pandemic month", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Wearing a face mask to protect against the new coronavirus, a shopper wrestles with a cart to head into a store to pick up groceries during a heavy snowfall on Thursday, April 16, 2020, in Westminster, Colo.(AP Photo/David Zalubowski)\nWearing a face mask to protect against the new coronavirus, a shopper wrestles with a cart to head into a store to pick up groceries during a heavy snowfall on Thursday, April 16, 2020, in Westminster, Colo.(AP Photo/David Zalubowski)\nDENVER (AP) — More than 104,000 people filed unemployment claims last week in Colorado, easily doubling the previous week’s figure and raising the total during the coronavirus pandemic to more than 266,000.\nThe surge in applications largely was driven by workers displaced in the hotel and restaurant industries, physician, dentists and other medical specialists’ offices, children’s day care, auto dealers, clothing, sporting goods and manufacturing, based on data collected during the week of March 28, the Colorado Department of Labor and employment said Thursday.\nThese sectors have seen significant drop-offs in business since statewide stay-in-place orders, nonessential business closures and other measures were implemented in Colorado to combat the coronavirus pandemic in March. All told, more than 266,000 applications have been filed over the past month, department deputy director Cher Haavind said.\nNationally, the U.S. government said 5.2 million more Americans applied for unemployment benefits last week, bringing the four-week total to about 22 million out of a work force of 159 million.\nThe data does not include an anticipated surge in applications for federal benefits for individuals not previously eligible for unemployment benefits such as gig workers, independent contractors and the self-employed. Colorado will soon be processing those claims and payments, which were authorized under the the federal $2.2 trillion coronavirus aid bill, Haavlind said.\nThe new aid also includes an additional $600 per week — on top of the state’s $400 weekly payment — in unemployment benefits.\nColorado paid $92 million in unemployment benefits during the two-week period ending April 11, said Ryan Gedney, the department’s senior economist. By comparison, Colorado paid an average $19 million each week during the height of the Great Recession in 2009-2010.\nGedney said Colorado’s $1.1 billion unemployment trust fund will withstand the crisis. He noted the state can borrow from the federal government or issue bonds — as it did during the Great Recession — should the fund approach insolvency.\nAt least 374 people have died in Colorado in the outbreak. That includes at least four employees of the JBS USA meat processing plant in Greeley, where another 102 workers have tested positive for the virus, according to the state health department. The plant is closed until April 24 for cleaning and has been ordered by the state and Weld County to strengthen its protections for the plant’s 6,000 workers.\nOne person has died and 15 have tested positive for the coronavirus at the Cargill meatpacking plant in Fort Morgan, the state says.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.\n—Colorado Supreme Court Chief Justice Ben Coats extended a suspension of jury trials until June 1. Coats’ order comes after safety concerns first delayed, then forced a mistrial, in the case of Dreion Dearing, accused of killing Adams County Sheriff’s Deputy Heath Gumm. A rescheduled trial is expected.\n—An agent for Denver Broncos star Von Miller says the linebacker has tested positive for the coronavirus and is resting at home.", "url": "https://apnews.com/211cd1b66571f5c3d5820d21dd36fd10"}