{"authors": [], "date_download": "2020-05-04 20:05:59", "date_modify": "2020-05-04 20:05:59", "date_publish": "2020-04-07 16:29:31", "description": "FARGO, N.D. (AP) — The leaders of North Dakota's largest metropolitan area said Tuesday that some residents are not following state orders meant to slow the spread of the coronavirus and they may...", "filename": "_643b39bb465169080662cb4f948e2125_1588622759.html", "image_url": "https://storage.googleapis.com/afs-prod/media/48fb02eee0514d1c90e73934ead20101/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_643b39bb465169080662cb4f948e2125_1588622759.html", "title": "Citizens should follow governor's orders", "title_page": "Fargo-area leaders: Citizens should follow governor's orders", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "North Dakota Gov. Doug Burgum answers questions during his daily COVID-19 press briefing held at the state Capitol in Bismarck, N.D. Tuesday, April, 7, 2020. On the left is sign language interpreter Lindsey Solberg Herbel. (Mike McCleary/The Bismarck Tribune via AP)\nNorth Dakota Gov. Doug Burgum answers questions during his daily COVID-19 press briefing held at the state Capitol in Bismarck, N.D. Tuesday, April, 7, 2020. On the left is sign language interpreter Lindsey Solberg Herbel. (Mike McCleary/The Bismarck Tribune via AP)\nFARGO, N.D. (AP) — The leaders of North Dakota’s largest metropolitan area said Tuesday that some residents are not following state orders meant to slow the spread of the coronavirus and they may take further steps, such as closing parts of city parks.\nFargo Mayor Tim Mahoney and West Fargo City Commission President Bernie Dardis said they’re not issuing stay-at-home orders or expanding on Burgum’s edict that shut down some businesses. However, Mahoney was upset to see 10 people playing basketball last week at a Fargo park.\n“One game of pickup basketball could lead to 160 people contracting the virus,” he said, referring to the potential of spreading COVID-19.\nCity officials said they want residents to enjoy the parks but will be monitoring activity to make sure people are following social distancing guidelines. State officials have reported 16 cases of the virus in the last two days in Cass County, which includes Fargo and West Fargo.\nA total of 237 people across the state have tested positive for the coronavirus, or about 3% of the more than 7,770 people tested. Four people have died.\nBurgum has shut down restaurants, bars, movie theaters, gyms and beauty salons. He has not issued a stay-at-home order.", "url": "https://apnews.com/643b39bb465169080662cb4f948e2125"}