{"authors": ["Mj Lee", "Cnn Political Correspondent"], "date_download": "2020-05-04 15:57:41", "date_modify": "2020-05-04 15:57:41", "date_publish": "2020-04-07 23:07:11", "description": "New York City's domestic violence resource website, NYC Hope, has seen a notable surge in the number of visits in recent weeks, as the city attempts to curb the spread of the coronavirus by enforcing strict stay-at-home measures.", "filename": "2020_04_07_us_nyc-domestic-violence-website-surging_index_1588607861.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200324160941-coronavirus-domestic-violence-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_us_nyc-domestic-violence-website-surging_index_1588607861.html", "title": "Visits to New York City's domestic violence website surged amid coronavirus pandemic", "title_page": "Visits to New York City's domestic violence website surged amid coronavirus pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN) New York City's domestic violence resource website, NYC Hope, has seen a notable surge in the number of visits in recent weeks, as the city attempts to curb the spread of the coronavirus by enforcing strict stay-at-home measures.\nWebsite visits more than doubled -- going from about 45 visits per day to 115 visits per day -- from the period of March 18 to April 5, according to data shared with CNN on Tuesday by the mayor's Office to End Domestic and Gender-Based Violence (ENDGBV).\nThis uptick of visits to the website comes as New York City has been forced to shutter many of its businesses and organizations to adhere to strict stay-at-home and other measures in an effort to contain the spread of the coronavirus. One of the many results of those rules is that the city's Family Justice Centers offices, where victims of abuse can physically visit to get assistance, have been temporarily closed since March 18.\nThe centers have continued to provide help to victims via phone, and the city's domestic violence shelters and a 24-hour domestic violence hotline are also fully operating, according to ENDGBV.\n\"Survivors need us now more than ever in these extraordinary times, and our top priority remains to ensure continuity of services and unwavering support,\" ENDGBV Commissioner Cecile Noel said in a statement.\nRead More", "url": "https://www.cnn.com/2020/04/07/us/nyc-domestic-violence-website-surging/index.html"}