{"authors": ["Marianne Garvey"], "date_download": "2020-05-04 16:22:34", "date_modify": "2020-05-04 16:22:34", "date_publish": "2020-04-06 13:36:55", "description": "John Krasinski surprised one young Broadway fan with her ultimate wish on his \"Some Good News\" show.", "filename": "2020_04_06_entertainment_john-krasinski-hamilton_index_1588609354.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406082020-hamilton-cast-krasinski-zoom-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_entertainment_john-krasinski-hamilton_index_1588609354.html", "title": "John Krasinski surprises young 'Hamilton' fan with a cast reunion", "title_page": "John Krasinski surprises young 'Hamilton' fan with a cast reunion  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) John Krasinski surprised one young Broadway fan with her ultimate wish on his \"Some Good News\" show.\nThe actor and his wife, actress Emily Blunt, appeared together on the second episode of his YouTube show, where they treated a 9-year-old \"Hamilton\" fan to a Zoom session with the original Broadway cast , including Leslie Odom Jr., who played Aaron Burr, Anthony Ramos, who played John Laurens, Philip Hamilton and Lin-Manuel Miranda. They sang opening number, \"Alexander Hamilton,\" for the young girl.\nCast members Daveed Diggs, Okieriete Onaodowan, Phillipa Soo and Christopher Jackson also joined in on the surprise.\nThe young girl, Aubrey, was supposed to see \"Hamilton\" show in Jacksonville, Florida, but the performance was canceled due to the coronavirus outbreak\nThe girl's mom had tweeted on March 21: \"We were supposed to see Hamilton in Jacksonville tonight. DD's 9th bday present (seeing Hamilton has been her dream since she saw her 1st Broadway show last year), but we're home watching Mary Poppins Returns instead. At least we're safe & healthy.\"\nRead More", "url": "https://www.cnn.com/2020/04/06/entertainment/john-krasinski-hamilton/index.html"}