{"authors": ["Jeffrey Collins"], "date_download": "2020-05-04 20:21:38", "date_modify": "2020-05-04 20:21:38", "date_publish": "2020-04-17 16:47:42", "description": "COLUMBIA, S.C. (AP) — For the first time since the coronavirus started to spread across South Carolina more than a month ago, some people will be able to do more outside their homes. Gov....", "filename": "_181677daa48963b7e3c31a3fb48b5cc0_1588623698.html", "image_url": "https://storage.googleapis.com/afs-prod/media/dbb2a2d4213b4b00a35a848de896be85/2880.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_181677daa48963b7e3c31a3fb48b5cc0_1588623698.html", "title": "Careful reopening of SC from COVID-19 starts with boat ramps", "title_page": "Careful reopening of SC from COVID-19 starts with boat ramps", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Myrtle Beach Public Works crews close down public beach access points on Tuesday morning, March 31, 2020. following S.C. Governor Henry McMaster's order to close access to beaches and public waterways amid the coronavirus threat. (Jason Lee/The Sun News via AP)\nMyrtle Beach Public Works crews close down public beach access points on Tuesday morning, March 31, 2020. following S.C. Governor Henry McMaster's order to close access to beaches and public waterways amid the coronavirus threat. (Jason Lee/The Sun News via AP)\nCOLUMBIA, S.C. (AP) — For the first time since the coronavirus started to spread across South Carolina more than a month ago, some people will be able to do more outside their homes.\nGov. Henry McMaster’s order opening public boat ramps went into effect at noon Friday. It is a tiny, baby step to what the governor hopes will be a carefully planned, staggered reopening of the state that will have the economy “humming” by the end of June.\nBeaches remain closed along with most everything else outside of grocery stores, pharmacies, home improvement stores and medical facilities.\nOfficials are starting to plan the state’s reopening even as COVID-19 continues to spread. South Carolina reported nearly 4,100 cases and seven additional deaths to bring the total death toll to at least 116 as of Friday afternoon, according to the state Department of Health and Environmental Control .\nHealth officials added a new estimate that two-thirds of people infected had recovered, based on a formula of when positive tests were reported and hospitalized patients were discharged.\nThere were fresh reminders of the ease in which the virus can spread and its toll.\nHealth investigators determined that six people, all over age 60 and African American, died from the coronavirus after likely being infected at the same funeral they attended in southern Kershaw County in early March, Sumter County Coroner Robbie Baker told The State newspaper.\n“Unfortunately, a large amount of people congregated at that funeral, somebody there was infected with it, spread it, and just didn’t know it,” Baker said.\nHealth officials continue to investigate why COVID-19 is infecting and killing African Americans at a higher rate. Blacks make up 27% of South Carolina’s population, but are 41% of the people infected and 56% of the people in the state killed by the coronavirus, according to DHEC.\nSo far, DHEC and private labs have combined to administer about 36,000 tests. Health officials said testing must increase to be able to reopen businesses and other public places so there is a better idea exactly how many people have been infected. DHEC estimates the number of COVID-19 cases in the state is nine to 10 times the more than 4,000 people known to be infected.\nFor most people, this coronavirus causes mild or moderate symptoms. For some, it can cause severe illness such as pneumonia, or even death.\nAlso on Friday, the state released March’s unemployment figures, but the survey used to determine the figure was completed around March 12, before almost everything was shut down, the South Carolina Department of Employment and Workforce said.\nThat means the official March unemployment rate of 2.6% vastly understates jobs lost in South Carolina. Weekly unemployment claim figures released each Thursday are a better indicator, and show about 268,000 people — about 11% of the labor force of nearly 2.4 million people — have reported losing their jobs since the pandemic shutdown began, the agency said.\nOne surprisingly large category among those making jobless claims is healthcare workers. Hospital systems across the state furloughed workers as elective surgeries and other medical visits not related to COVID-19 were postponed or canceled.\nPrisma Health furloughed nearly 4,000 workers, while the Medical University of South Carolina furloughed about 900 employees.\nBut the MUSC employees not working and not getting paid did get a little good news Friday, when two anonymous donors agreed to pay around $384,000 to cover their health insurance premiums through June 30, said MUSC’s vice president for Institutional Advancement, Kate Azizi. The hospital system already agreed to keep paying its contribution, she said.\n___\nFollow Jeffrey Collins on Twitter at https://twitter.com/JSCollinsAP.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/181677daa48963b7e3c31a3fb48b5cc0"}