{"authors": ["Senior Culture Reporter"], "date_download": "2020-05-04 20:22:08", "date_modify": "2020-05-04 20:22:08", "date_publish": "2020-04-29 19:03:37", "description": "January, February and early March feel like a year ago thanks to the coronavirus pandemic.", "filename": "entry_netflix-movies-2020-forgot_l_5ea70fbfc5b6dd3f9088ba2b_1588623728.html", "image_url": "https://img.huffingtonpost.com/asset/5ea88d8b3000009a1115513f.jpeg?cache=ze8RJ8Qs4r&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_netflix-movies-2020-forgot_l_5ea70fbfc5b6dd3f9088ba2b_1588623728.html", "title": "8 Netflix Movies From Earlier This Year You've Already Forgotten About", "title_page": "8 Netflix Movies From Earlier This Year You've Already Forgotten About | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Laura T. Magruder/Netflix Anne Hathaway and Ben Affleck in \"The Last Thing He Wanted.\"\nAt the end of March, a friend reminded me that Pete Buttigieg was still running for president at the beginning of the month. I couldn’t believe it.\nAmericans generally began to reckon with the coronavirus pandemic around the middle of March. (Arguably the night of March 11, when Tom Hanks and Rita Wilson announced they had COVID-19 and the NBA suspended its season.) Everything before mid-March feels like a different era.\nHow does this relate to Netflix and streaming? It means that any movies that debuted in the first few weeks of the year now feel ancient rather than recent.\nOf course, it comes from a place of great fortune to muse about warped time. In the grand scheme, nobody needs to shed tears for the creators whose movies came and went in a blip due to the crisis.\nBut with so many needing the mental medicine of streaming right now, I figured I’d remind viewers of a few technically recent Netflix movies worth considering. (Fair warning: not all of them are upbeat.)\nRead on for the full list, and if you want to stay informed of everything joining Netflix every week, subscribe to the Streamline newsletter.\nJi Sub Jeong/HuffPost\nPremise: In this psychological drama co-written by Alison Brie, a young woman experiences deteriorating mental health. Amid her deep loneliness, visits to a local stable bring her a modicum of joy. The woman begins dating someone new, but her mental health declines rapidly soon after the budding of this relationship.\nSetting: Los Angeles\nDebut date: Feb. 7, 2020\nNotable cast: Alison Brie, John Reynolds, Debby Ryan and Molly Shannon\nRuntime: 1 hour, 43 minutes\nPremise: In this political thriller directed and co-written by Dee Rees, a Washington Post reporter gets caught up in the Iran-Contra scandal. Her dying father, who has a mysterious career, asks for a favor that ultimately puts her career and life in danger. The movie is based on a 1996 novel by Joan Didion of the same name.\nI should note this has a 6% on Rotten Tomatoes, so it may be for the best if you forgot about this one.\nSetting: Washington, D.C., and Central America in the mid-1980s\nDebut date: Feb. 21, 2020\nNotable cast: Ben Affleck, Willem Dafoe, Anne Hathaway and Rosie Perez\nRuntime: 1 hour, 55 minutes\nPremise: In this thriller written and directed by Tyler Perry, a public defender tries to prove the innocence of an older woman accused of murdering her husband. The public defender can tell that something’s missing in the case and spends the movie trying to figure out the truth.\nAlthough it fared better than “The Last Thing He Wanted,” this movie has a 17% on Rotten Tomatoes.\nSetting: Small-town Virginia\nDebut date: Jan. 17, 2020\nNotable cast: Crystal Fox, Tyler Perry and Phylicia Rashad\nRuntime: 1 hour, 55 minutes\nPremise: In this German drama, a 9-year-old struggles to control her own aggressive, violent behavior. Her mother puts her in different care programs, which reject her after her outbursts. An anger management trainer tries his best, and the two end up bonding.\nSetting: Various locations in Germany\nDebut date: Feb. 21, 2020\nNotable cast: Helena Zengel\nRuntime: 2 hours, 5 minutes\nPremise: In this teen romantic comedy, a high schooler has begun dating a crush after writing him a love letter and then fake dating him to help him make his ex jealous (again, the characters are teens). But in a twist, another boy she wrote a love letter to ― someone she thought she’d never see again ― starts volunteering at the same place as she does. So a love triangle ensues.\nThis movie is a sequel to the 2018 film “To All the Boys I’ve Loved Before,” and they’re based on a book series by Jenny Han.\nSetting: Portland, Oregon\nDebut date: Feb. 12, 2020\nNotable cast: Noah Centineo, Lana Condor, John Corbett and Jordan Fisher\nRuntime: 1 hour, 41 minutes\nPremise: In this romantic drama, two teenagers mistrust the burgeoning love they feel for each other given past trauma. One of them deals with thoughts of suicide and, therefore, both carry that emotional weight.\nSetting: Small-town Indiana\nDebut date: Feb. 28, 2020\nNotable cast: Elle Fanning, Keegan-Michael Key, Alexandra Shipp, Justice Smith and Luke Wilson\nRuntime: 1 hour, 47 minutes\nPremise: In this mystery drama, a mother fights to convince her community and local police force to continue looking for her missing daughter. Through searching for her daughter, the mother discovers a larger pattern of murders.\nSetting: Long Island, New York\nDebut date: March 13, 2020\nNotable cast: Lola Kirke, Oona Laurence, Thomasin McKenzie, Amy Ryan and Dean Winters\nRuntime: 1 hour, 35 minutes\nPremise: In this action comedy directed by Peter Berg, an ex-cop gets out of jail for a crime he insists he didn’t commit. Soon after his release, he teams up with an old mentor and a new mentee to try to thwart a conspiracy involving cop killings.\nThis movie was the most popular movie on Netflix for weeks, according to Netflix’s ranking system. So maybe you didn’t completely forget about it. But its debut still feels from another era.\nSetting: Boston\nDebut date: March 6, 2020\nNotable cast: Alan Arkin, Winston Duke, Post Malone, Iliza Shlesinger and Mark Wahlberg", "url": "https://www.huffpost.com/entry/netflix-movies-2020-forgot_l_5ea70fbfc5b6dd3f9088ba2b"}