{"authors": ["Senior Lifestyle Reporter"], "date_download": "2020-05-04 20:22:56", "date_modify": "2020-05-04 20:22:56", "date_publish": "2020-04-30 00:07:23", "description": "Laura Gao hopes her comic combats xenophobia and convinces people to see the Chinese city as more than the epicenter of the coronavirus pandemic.", "filename": "entry_chinese-american-illustrator-life-in-wuhan_n_5ea9c739c5b63115cec2be5a_1588623776.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9f5213000005d12155264.jpeg?cache=o77g9k0few&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_chinese-american-illustrator-life-in-wuhan_n_5ea9c739c5b63115cec2be5a_1588623776.html", "title": "Artist Illustrates What Her Hometown Of Wuhan Is Really Like", "title_page": "Artist Illustrates What Her Hometown Of Wuhan Is Really Like | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Laura Gao lived in Wuhan, China ― the first city to report a coronavirus outbreak ― until the age of 3, when her parents moved the family to a small town in Texas.\nSeeing her hometown in news reports over the last few months because of the COVID-19 pandemic has been an incredibly strange experience.\n“Because the media was so hyper-focused on the virus, the wet markets and the government, they never talked about how the people were doing and what Wuhan means to them,” said Gao, who now lives in San Francisco and works as a product manager at Twitter.\n“There wasn’t much that was incorrect as much as there just wasn’t any news about the overall picture of Wuhan outside of the coronavirus,” she told HuffPost.\nLaura Gao Photos of a young Laura Gao in Wuhan, China, before her family moved to Texas.\nIncreasingly, the incomplete picture of life in Wuhan has been coupled with racism and xenophobia against Chinese Americans and people of Asian descent in general. Last week, a group of Asian American organizations documenting the surge of racist incidents related to the COVID-19 pandemic said they’d received nearly 1,500 reports of anti-Asian harassment and discrimination over the last month.\n“These negative messages about Wuhan influence how people think about Chinese people,” Gao told HuffPost. “Unfortunately that leads to the type of xenophobia many Asians and Asian Americans, including myself, have faced.”\nSo to remind people that Wuhan is more than just the epicenter of a virus, Gao created a comic that highlights the rich history and culture of the people of Wuhan. The comic went viral on Twitter and was even turned into an animated clip by the account @TwitterAsians:\n\"Instead of remembering my hometown as the 'the place where COVID originated', I want people to respect Wuhan as a city with beautiful history, culture, and people. This is the Wuhan I know.\" - @heylauragao pic.twitter.com/pnnhou3Kjt — Twitter Asians (@TwitterAsians) April 10, 2020\nIn the comic, Gao highlights the town’s history ― how the Chinese Revolution against the ruling Qing originated with the Wuchang Uprising in Wuhan, for instance ― and its gorgeous architecture (like the majestic Yellow Crane Tower, which stands on the banks of the Yangtze River at the top of Snake Hill.)\nIMAGEMORE Co, Ltd. via Getty Images The Yellow Crane Tower in Wuhan, China.\nShe also highlights some of the delicious perks of life in Wuhan, including its unparalleled street food scene. (The city’s signature dish, hot dry noodles, or re gan mian, gets a shoutout midway through the comic.)\n“I made this comic strip to to both fight against xenophobia but also to shine light on everything I love about my hometown,” Gao said.\nAs Wuhan slowly begins to lift social distancing restrictions, Gao hopes the comic compels people to see the city in a different, more nuanced light.\n“Wuhan is as big as New York or London with a history and culture just as rich,” she said. “When we discuss COVID and how it connects with Chinese or Wuhanese people, we have to be mindful of how our perspective may negatively bias us against people from that region, and instead, focus on the full human story.”\nScroll down to read Gao’s comic in its entirety and head to her site for more of her work.\nLaura Gao\nLaura Gao\nLaura Gao\nLaura Gao\nLaura Gao\nLaura Gao\nExperts are still learning about the novel coronavirus. The information in this story is what was known or available as of press time, but it’s possible guidance around COVID-19 could change as scientists discover more about the virus. Please check the Centers for Disease Control and Prevention for the most updated recommendations.", "url": "https://www.huffpost.com/entry/chinese-american-illustrator-life-in-wuhan_n_5ea9c739c5b63115cec2be5a"}