{"authors": ["Ben Westcott"], "date_download": "2020-05-04 17:01:55", "date_modify": "2020-05-04 17:01:55", "date_publish": "2020-04-10 05:05:01", "description": "The Chinese government has issued a new draft list of livestock that can be farmed for meat in the wake of the coronavirus epidemic, which is suspected to have originated from wild animals in a Wuhan wet market.", "filename": "2020_04_10_asia_china-wildlife-law-coronavirus-intl-hnk_index_1588611715.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/140923145218-china-pork-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_asia_china-wildlife-law-coronavirus-intl-hnk_index_1588611715.html", "title": "Chinese government reveals draft list of animals which can be farmed for meat", "title_page": "Chinese government reveals draft list of animals which can be farmed for meat - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Hong Kong (CNN) The Chinese government has issued a new draft list of livestock that can be farmed for meat in the wake of the coronavirus epidemic, which is suspected to have originated from wild animals in a Wuhan wet market.\nBeijing temporarily banned all trade in wild animals for food following the outbreak, which has now spread globally to infect more than 1.6 million people, but the new law has yet to be finalized.\nChina's Ministry of Agriculture issued a draft list of animals considered fit to be used as livestock on Wednesday night, including dietary staples such as pigs, cows, chickens and sheep, as well as \"special livestock\" such as a number of species of deer, alpaca and ostriches.\nTwo species of fox, raccoons and minks can be kept as livestock but not for their meat.\nThere is no mention of the species of animal which are suspected by scientists to have spread the virus to humans, such as pangolins, bats and civet cats.\nRead More", "url": "https://www.cnn.com/2020/04/10/asia/china-wildlife-law-coronavirus-intl-hnk/index.html"}