{"authors": ["Sara Burnett", "Hannah Fingerhut"], "date_download": "2020-05-04 20:17:22", "date_modify": "2020-05-04 20:17:22", "date_publish": "2020-04-06 12:00:53", "description": "CHICAGO (AP) — Americans in overwhelming numbers are actively avoiding others as much as possible and taking additional steps to protect themselves from the coronavirus, according to a survey from...", "filename": "_d77fc19f5fc596d54ceb9618cd9dc38c_1588623442.html", "image_url": "https://storage.googleapis.com/afs-prod/media/73bf1b170cef47c7b8f46d253648829a/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d77fc19f5fc596d54ceb9618cd9dc38c_1588623442.html", "title": "AP-NORC poll: Americans increasing effort to avoid infection", "title_page": "AP-NORC poll: Americans increasing effort to avoid infection", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this April 3, 2020, file photo a man crosses an empty street in downtown Kansas City, Mo. Americans are increasingly taking preventative measures, including staying away from large crowds and avoiding touching their hands to their faces, amid growing fears of infection with COVID-19, a new poll from The Associated Press-NORC Center for Public Affairs Research found. (AP Photo/Charlie Riedel, File)\nFILE - In this April 3, 2020, file photo a man crosses an empty street in downtown Kansas City, Mo. Americans are increasingly taking preventative measures, including staying away from large crowds and avoiding touching their hands to their faces, amid growing fears of infection with COVID-19, a new poll from The Associated Press-NORC Center for Public Affairs Research found. (AP Photo/Charlie Riedel, File)\nCHICAGO (AP) — Americans in overwhelming numbers are actively avoiding others as much as possible and taking additional steps to protect themselves from the coronavirus, according to a survey from The Associated Press-NORC Center for Public Affairs Research that shows how concerns about infection have grown sharply in the past six weeks.\nThe survey finds Americans are increasingly isolating, washing their hands and avoiding touching their face. Large portions of the country are confronting lay-offs and pay cuts and are adjusting to kids forced home from school and day care amid the coronavirus pandemic , which has upended American life and the nation’s economy.\nHalf of Americans now say they are extremely or very worried that they or a family member will be infected by the virus. That compares with 31% who said the same in mid-March and 22% who said so in February . Another 34% are somewhat worried, while just 16% say they are not worried.\nThe spike in concern comes as the number of confirmed cases of COVID-19, the disease caused by the virus , has grown to about 1.3 million worldwide and about 340,000 in the U.S., according to Johns Hopkins University . Containment efforts have canceled in-person classes for most of the country’s students, thrown more than 10 million people out of work and put 90% of the population under stay-at-home orders.\nConfronted by the seriousness of the pandemic, Americans are more likely than they were in mid-March to report taking protective steps. Today, 94% of Americans say they are staying away from large groups, up from 68%. Somewhat fewer, though still an overwhelming majority, 86%, say they are avoiding other people as much as possible.\nMost states are now under a statewide stay-at-home order, while in the remaining states some orders have been issued at the city or county level. But there are not wide differences in behavior based on where a person lives, according to the poll. Americans in states that were not under a statewide stay-at-home order on or before March 26 were about as likely as Americans in states that were under such a directive to say they were avoiding contact with others.\n“To me it was just common sense,” said Richard Walker, 62, of St. Augustine, Florida, who said he and his family began making changes weeks before Gov. Ron DeSantis last Wednesday issued a statewide stay-at-home order .\nWalker said that he and his wife are no longer watching their 3-year-old granddaughter once a week and that their 33-year-old daughter is doing their grocery shopping. To celebrate his son’s birthday on Tuesday, the family gathered in the son’s driveway — staying at least 10 feet (3 meters) apart — and sang “Happy Birthday.” The party continued later via FaceTime, a video phone app.\n“It’s all you can do right now,” Walker said.\nThe change in behavior isn’t limited to staying at home or avoiding groups. Ninety-two percent of Americans say they are washing their hands more frequently and 70% are avoiding touching their face. About half, 52%, now report stocking up on extra food, compared with 35% who said they were doing so earlier in March. Still, just 16% say they are consulting with a health care provider.\nWhile the public’s concern has risen overall, there still remain partisan differences.\nRepublicans are far less worried than Democrats about themselves or a relative being infected with the coronavirus. Just 35% are extremely or very worried, compared with 61% of Democrats who are highly concerned. Another 4 in 10 Republicans are somewhat worried, and about another quarter are not worried.\nStill, the share of Republicans who are very worried has grown from just 21% in AP-NORC’s mid-March poll.\nThe widespread closing of schools and day cares also has caused concern. Among parents with a child in school or day care, nearly all, 96%, say it has closed. About a third of them say they are extremely or very concerned about their child falling behind academically, with another third somewhat concerned.\nMia Morris, of Atlanta, said she and her kids, ages 18 and 16, are doing the best they can to adjust to online learning. Morris, 41, is in a technical school program that has moved to online classes, and she watches a 7-year-old who is navigating first grade.\nFull Coverage: Virus Outbreak\n“It’s hard because we’re not used to it, but we all pull together and help each other,” Morris said. And when they still don’t know the answers, there’s another option: “We go to Google a lot.”\nThe closing of businesses and global economic uncertainty have widely impacted working Americans. Among those who were employed prior to the outbreak, 23% say they or a household member has already been laid off, 38% scheduled for fewer hours, 27% taken unpaid time off and 26% had wages or salary reduced.\nIn all, about half of workers have experienced at least one form of lost household income. Those with lower incomes and without college degrees are especially likely to say households have been hit by layoffs.\nKyle Beason, of Bowling Green, Ohio, said he and his girlfriend both have had their hours slashed at the manufacturing plant where they work, from 40 hours per week to a low of 24 hours because the appliance makers who buy the parts they produce aren’t placing as many orders. The 26-year-old said the couple is still able to pay the bills, but that could change if things don’t improve soon.\n“I’m hoping that people do what they need to do — stay home as much as they can or stay away from people — so we can get over it,” Beason said.\n___\nThe AP-NORC poll of 1,057 adults was conducted March 26-29 using a sample drawn from NORC’s probability-based AmeriSpeak Panel, which is designed to be representative of the U.S. population. The margin of sampling error for all respondents is plus or minus 4.1 percentage points. Respondents were first selected randomly using address-based sampling methods and later were interviewed online or by phone.\n___\nOnline:\nAP-NORC Center: http://www.apnorc.org/", "url": "https://apnews.com/d77fc19f5fc596d54ceb9618cd9dc38c"}