{"authors": ["Nathaniel Meyersohn", "Cnn Business"], "date_download": "2020-05-04 16:14:53", "date_modify": "2020-05-04 16:14:53", "date_publish": "2020-04-03 14:02:08", "description": "Large retail and grocery chains staying open during the coronavirus crisis are on hiring sprees. But some of the companies' existing part-time employees who want more work are concerned that the plans will make it harder for them to get ahead.", "filename": "2020_04_03_business_compani_6e2c2e0a37e2c7430205b0c586a37b31_index_1588608893.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402115422-kroger-distribution-center-0320-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_business_compani_6e2c2e0a37e2c7430205b0c586a37b31_index_1588608893.html", "title": "Stores are hiring like crazy. But they have part-time workers who want more hours", "title_page": "Stores are hiring like crazy. But they have part-time workers who want more hours - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Large retail and grocery chains staying open during the coronavirus crisis are on hiring sprees. But some of the companies' existing part-time employees who want more work are concerned that the plans will make it harder for them to get ahead.\nis adding 150,000 workers through the end of May at stores and warehouses to help keep pace with customer demand during the pandemic.is bringing on an additional 100,000 warehouse and delivery workers.is filling 50,000 positions. And Albertsons,, 7-Eleven and others want to pick up hundreds of thousands of new workers combined for both part-time and full-time slots.\nThese companies are speeding up their normal hiring timelines from several weeks to 24 hours in some cases. Walmart said it's hiring about 5,000 workers a day. Some chains are also increasing wages for employees on a temporary basis in part to sign on new workers.\nThe openings are welcome developments for the millions of Americans who have lost their jobs in recent weeks. This is a deep recession, and industries such as travel, hotel and restaurants are laying off workers. Other retailers are furloughing hundreds of thousands of employees.\nBut some part-time hourly workers at these companies are frustrated that new workers are coming in when they have already been struggling to find enough hours to pay their bills. Although these part-time workers are fortunate to have a job during a crisis, they worry the new hires will cut into their own schedules and make it harder for them to gain full-time status at the chains in the future.\nAmazon is bringing on an additional 100,000 warehouse and delivery workers to help meet demand.\nLast year, there were more than 700,000 retail workers who were classified by the Bureau of Labor Statistics as \"involuntary part-time workers\" — that is, workers who wanted to work full-time but couldn't either because their hours were cut back or they could not find a full-time job.\n\"As we enter a recession, it's great to see hiring,\" said Daniel Schnieder, an assistant professor of sociology at University of California, Berkeley. \"But, the key thing to keep in mind is that many existing workers aren't getting enough hours to make ends meet and the same problem may [be] present for these new workers.\"\nIn addition to fewer hours, the difference between part-time and full-time employment status at some retailers can also mean qualifying for health care; access to more paid time off days, parental and sick leave; and steadier schedules.\nArmy of part-time workers\nAround one-quarter of America's more than 15 million retail workers worked fewer than 35 hours a week last year, making them-part time employees, according to the Bureau of Labor Statistics.\nRetailers typically want to have a larger pool of part-time workers making the minimum wage, instead of a smaller group of full-time staffers with benefits and guaranteed hours, experts say. This strategy allows them to adjust workers' schedules based on demand, like during the coronavirus shopping rush.\n\"From the employer perspective, these workers then are flexible, willing to stay late if needed or work on call because they need the hours,\" said Schneider. \"But, from the worker perspective, this is instability and unpredictability.\"\nAt Walmart, America's largest private employer with a workforce of around 1.5 million, more than 40% of employees work part time. CEO Doug McMillon has said the company has been increasing its share of full-time positions in recent years.\nAlthough part-time jobs can give workers flexibility and is often suited well for students and older citizens, many part-time Walmart workers want more hours. Around 69% of part-time Walmart workers said they would prefer to work full-time, according to employees surveyed in 2018 by worker advocacy groups the Center for Popular Democracy and United for Respect.\nCVS is filling 50,000 positions during the crisis.\n\"Our full-time and part-time associates are being given as many hours as they want right now, including overtime, for the most part,\" a spokesperson for Walmart said. \"We're pleased to have thousands of associates joining us each day to complement our existing workforce and help with the strong demand in our stores. At the same time, we're able to provide a bridge for many Americans who are temporarily out of work.\"\nAt Kroger, around 60% of the company's approximately 453,000 employees worked part-time in 2018, according to the company's latest recent data.\n\"If the store just gave more hours to the part-timers there would be no problem,\" said one Kroger worker in Ohio who spoke on the condition of anonymity. The employee has been struggling to pay rent with volatile part-time hours and pay.\n\"Kroger's most urgent priority is to provide a safe environment for associates and customers, with open stores, comprehensive digital solutions and an efficiently operating supply chain, so that our communities have access to fresh, affordable food and essentials,\" a spokesperson for Kroger said. Kroger has offered a $2 an hour bonus for hourly workers, both full-and part-time, and our family of companies hired more than 32,700 new workers in 14 days.\nCVS does not break out the rate of part-time employees in its workforce. But a store manager in Ohio who spoke on the condition of anonymity said the company has been reducing full-time employees' hours in the store over the past two years.\nSome full-time employees are on the verge of losing their health care benefits because of reduced hours, this employee said. \"Where is the company coming up with the hours and payroll to hire 50,000 people?\"\nA spokesperson for CVS said the company regularly monitors \"customer traffic and prescription volume in each store throughout the day. We make scheduling adjustments for our team members accordingly, and those adjustments result in customized staffing schedules for each store. In all cases, appropriate work hours are allocated to ensure we have the right staff in place and at the right times.\"\n'Bill of rights'\nLawmakers have been responding to erratic schedules for part-time retail and service workers in recent years.\nSan Francisco, New York, Seattle, Chicago and other cities have passed \"fair workweek\" legislation. In some cases, these laws require businesses to offer their existing part-time workers more hours when they become available before hiring additional staff.\nSenators Elizabeth Warren of Massachusetts and Cory Booker of New Jersey have introduced the \"part-time workers bill of rights.\" This legislation would require employers with more than 500 workers to compensate existing employees if they hire new employees instead of assigning work to their current employees.\n\"Giant companies force millions of workers to work part-time every year rather than hiring full-time staff to skimp on wages and benefits,\" Warren said in a statement in February.", "url": "https://www.cnn.com/2020/04/03/business/companies-hiring-walmart-amazon-cvs-kroger/index.html"}