{"authors": ["Opinion Devika Koppikar"], "date_download": "2020-05-04 15:59:48", "date_modify": "2020-05-04 15:59:48", "date_publish": "2020-04-01 04:06:28", "description": "Devika Koppikar writes that almost 40 days after emerging from her mandatory quarantine in the city of Wuxi she's learned that it's not possible to return to life before Covid-19.", "filename": "2020_04_01_opinions_china-c_b58f1a6039d71c0fd578c6017357bcf2_index_1588607988.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200318094815-03-china-return-to-business-0312-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_opinions_china-c_b58f1a6039d71c0fd578c6017357bcf2_index_1588607988.html", "title": "I'm out of quarantine. But 'normal' isn't normal in China anymore", "title_page": "I'm out of quarantine. But 'normal' isn't normal in China anymore - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Devika Koppikar teaches AP Psychology and English at an international Chinese high school program in Wuxi, about 80 miles west of Shanghai. Previously, she was the press secretary to the late US Congressman Elijah E. Cummings and a communications consultant in Washington, DC. The opinions expressed here are her own. Read more opinion at CNN.\nWuxi, China (CNN) My Facebook feed bulged with post-lockdown food fantasies. Friends dreamed of a \"salted caramel milkshake\" or \"a cheeseburger topped with feta, fried egg, and avocado with sweet potato french fries.\" But if there's anything I've learned after emerging from my own two-week quarantine in China, it's that we can't simply click our ruby slippers and return to life BC -- before Covid-19 .\nI'm from Woodbridge, Virginia, and I've lived in China for four years. I was traveling in Australia and New Zealand over the Chinese New Year when I heard that the coronavirus had raged through the city of Wuhan, about 500 miles west of where I live. I got repeated notices from the US Embassy that \"recommended,\" but did not mandate, that Americans leave China. As my return date neared, many colleagues decided not to go back until the virus madness subsided. \"Any place but China is safe,\" they said.\nWhen I heard that everyone entering China must go through a mandatory, sealed quarantine I had a sense of doom. What if I needed to escape? How would I get food? Another expat who was in the middle of her own lockdown convinced me that it was manageable. \"You're in your own home with all amenities and they bring you food and other supplies as needed,\" she said.\nI felt I needed to get back to my students. As we would not be allowed to enter our campus until we completed the two-week quarantine, I felt the sooner I did it the sooner I'd be able to get back to my regular routine. A human rights activist by vocation, I realized I was more fortunate than those who faced uncertain fates, such as refugees and undocumented workers.\nI entered my 14-day quarantine welcoming it as a spiritual and psychological challenge. I chronicled my in-home journey on the Afro website , describing my life in quarantine.\nOn February 22, I completed my time in isolation and broke the barrier that had concealed me in my apartment unit for two weeks. Interestingly, I had not been as confined as I thought. I'd been under the impression that my door was bound by a heavy-duty, airtight tape. In reality, it was only obstructed by a simple piece of paper. The neighborhood committee -- somewhat like a homeowners' association -- that monitored my quarantine had glued this paper from the door's left panel to the frame. If I had broken quarantine, the paper would have ripped, indicating my escape.\nI have now been out of quarantine for almost 40 days -- and life is far from normal. Even though the virus hit China around Christmas and rose exponentially until mid-February, life as we knew it is just seeing dawn three months later.\nOn my discharge day, before going anywhere I had to go to my apartment leasing office, where I showed the committee a chart of my daily temperature readings and a medical professional checked my temperature so I could get a certificate saying I was \"free and clear\" from Covid-19. This qualified me for a \"green\" scan phone code that I had to show before entering any grocery store or taking public transportation. That code would have turned red if I'd gone out of town or turned off my GPS. I still carry the code and show it in some places like malls, but the requirement has become more lax. Similarly, the security guards sitting at tables outside my apartment complex have become a little less rigorous about taking my temperature every time I come and go from my apartment complex\nQuarantine seal on the door of the apartment of American teacher Devikka Koppikar in Wuxi, China\nMy first excursion was walking down the street outside of my apartment complex. About half the stores were open. The others were bolted shut, with their windows displaying \"Merry Christmas\" and \"Happy Year of the Rat,\" many weeks after those holidays had passed. It was an image frozen in time, waiting to melt.\nI was, however, excited to be able to go to the grocery store. During my quarantine I'd texted my grocery lists to the school's office assistant and the neighborhood committee brought me the food every three days. Now at least I could get the brands I wanted. But I misjudged again: shelves were mostly empty, and I had no choice but to buy non-favorites like salted butter or sweetened yogurt. I craved a Starbucks Signature Chocolate, but the coffee chain served only carry-out orders. What would have been the point? The hot chocolate would cool down by the time I returned home and I couldn't drink it outdoors because the seating had been disassembled.\nMost of my friends were still in their home countries or doing their own quarantines here, so I couldn't see them. They also could not visit me because my apartment complex only allowed residents inside the gates. Even though I had been released from the quarantine, I was still isolated.\nThen I heard that our local Italian eatery, Mammamia, was delivering. I ordered a pizza, garlic bread and arugula salad. If I had to eat alone at home, I might as well treat myself, I thought. But when the delivery people tried to enter my gate, they could not get in and my dinner cooled as I grappled through a series of mistranslations before getting my food.\nObtaining bottled water was a challenge too. In normal times, I had a company deliver the bottles straight to my 6th floor unit. Now I had to get the heavy containers myself, risking a relapse of a shoulder injury I had just recovered from. I was beginning to feel that the only advantage to ending the quarantine was to be able to throw away my own garbage.\nAt my school, we are still teaching online. Some restaurants have reopened for full service after receiving clearances from the provincial government. Now, Mammamia thoroughly checks its suppliers, takes the temperature of the staff and requires them to wear masks and gloves during service hours. As a customer, I am asked to wear a mask when I'm not eating. Tables honor social distancing policies and are set up for small groups. Malls are open, but close at 8 p.m. rather than their usual 10 or 11 p.m. to give the crew time to clean and sanitize.\nJust as I thought \"normal\" was beginning to see daylight, on March 28, China closed its borders to most foreigners to avert a resurgence of Covid-19 imported from returning residents.\nAs I rejoice about returning to campus in the next week or so, I mourn that the saga has shifted to America. I pray for my mother in Florida, a very social person, who must face isolation and, at age 82, falls within the high risk group. I grieve for the 3,800-plus families who must plan funerals as we speak and the 185,000 patients who are fighting for their lives. And what about my friends who work in health care? They are running out of Personal Protection Equipment (PPE) and find it hard to get new supplies.\nWhat will \"normal\" be like when it arrives? The short answer is that it will be like a roller coaster and Ferris wheel: progress will be both volatile and slow.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nFirst, we will have to make up for lost time at our jobs. Even though many of us are lucky enough to work online, we have had to improvise. My weekly class time with students has been sliced in half, and I've had to rush through several lessons to cover all the AP exam objectives. My experience is a microcosm of what's going on in other industries. Recovery will take time.\nNevertheless, I also see opportunities. Now that we've learned that we can quickly cross over to online work, those with mobility challenges or parents who want a work-life balance may be able to avail themselves of the remote operational model. Telemedicine could streamline health care when normalcy returns. Hopefully companies will now realize the importance of providing all their employees with sick leave and health insurance.\nAnother important lesson we have learned from this pandemic is that no one is an island. This experience has honed our resiliency and acumen. The crisis proves that under trying circumstances, we still give our best. As many have said here in China, Jiayou (Jeye-yo), which in Chinese means, \"let's keep at it.\"", "url": "https://www.cnn.com/2020/04/01/opinions/china-coronavirus-end-quarantine-devika-koppikar-opinion/index.html"}