{"authors": ["Becky Bohrer"], "date_download": "2020-05-04 20:03:41", "date_modify": "2020-05-04 20:03:41", "date_publish": "2020-04-07 00:48:16", "description": "JUNEAU, Alaska (AP) — A state forecast released Monday shows projected revenues down sharply from an estimate issued several months ago, with low oil prices and economic impacts from the COVID-19...", "filename": "_049e29d30443192389259729ba748661_1588622621.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_049e29d30443192389259729ba748661_1588622621.html", "title": "Projected Alaska revenues down sharply partly over outbreak", "title_page": "Projected Alaska revenues down sharply partly over outbreak", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "JUNEAU, Alaska (AP) — A state forecast released Monday shows projected revenues down sharply from an estimate issued several months ago, with low oil prices and economic impacts from the COVID-19 outbreak cited as factors.\nThe state Revenue Department projects unrestricted general fund revenue of $1.6 billion for the fiscal year ending June 30, and $1.2 billion for the year starting July 1, excluding scheduled transfers from earnings of the state’s oil-wealth fund, the Alaska Permanent Fund. That is down from projections of $2.1 billion and $2 billion, respectively, from a forecast released in December.\nTransfers from permanent fund earnings include $2.9 billion for the current year, which the Alaska Permanent Fund Corp. last month said largely has been fulfilled, and $3.1 billion planned for the next fiscal year. The state in 2018 began using permanent fund earnings, traditionally used to pay yearly dividend checks to residents, to also help cover government costs as oil prices have remained low.\nThe fund has felt the effects of recent market volatility.\nAlaska lawmakers have long budgeted around oil, a volatile commodity, and dug into savings to help fill a persistent budget deficit. The recently passed budget relies heavily on savings, which would further draw down a major reserve fund. Gov. Mike Dunleavy is reviewing the budget.\nIn fiscal year 2012, the state received $8.9 billion in unrestricted petroleum revenue. The figure fell to $877 million in fiscal year 2017, according to the department report. For the current year, about $1.1 billion is projected in unrestricted petroleum revenue and about $717 million in the next fiscal year, the report says.\nThe forecast released Monday is based on oil prices remaining below $30 a barrel for the rest of the current fiscal year and forecasts a price of $37 a barrel for the year starting July 1, state Revenue Commissioner Lucinda Mahoney said in a letter included in the report.\nShe said the forecast was made difficult “by the ongoing and unknown nature of the pandemic, compounded by highly volatile investment markets and oversupplied oil markets.”\nGiven the uncertainty, “the department has developed a plausible scenario upon which to base the spring revenue forecast,” she said. “This scenario provides a reasonable baseline for planning purposes and highlights some of the important variables that can be monitored as events unfold over coming months.”", "url": "https://apnews.com/049e29d30443192389259729ba748661"}