{"authors": ["Opinion Vicky Ward"], "date_download": "2020-05-04 16:23:23", "date_modify": "2020-05-04 16:23:23", "date_publish": "2020-04-06 01:00:21", "description": "Vicky Ward writes that the wealthy one-percenters who've fled urban coronavirus hotspots for their other homes don't realize they may be in a bubble of false security", "filename": "2020_04_05_opinions_coronav_82508d278ac2c28623b6a94b4ec96bd1_index_1588609403.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190805092549-02-hamptons-real-estate-market-sothebys-quimby-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_opinions_coronav_82508d278ac2c28623b6a94b4ec96bd1_index_1588609403.html", "title": "How the very rich are different in the Covid-19 fight", "title_page": "How the very rich are different in the Covid-19 fight - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Vicky Ward is a senior reporter at CNN. She is the former executive editor of Talk Magazine, a former contributing editor to Vanity Fair and author of \"The Devil's Casino,\" \"The Liar's Ball\" and \"Kushner, Inc.\" The opinions expressed here are her own. Read more opinion at CNN.\n(CNN) I have spent two decades reporting on people at the nexus of money, power and culture. I've written books about corruption among the country's wealthiest 1%, Wall Street greed and the ruthlessness of New York real estate titans. So these past few weeks I have been on the phone to many people who are not stuck, like me, in a New York City apartment, where we are on constant alert for the ominous sound of sirens puncturing the silence with increasing frequency.\nInstead, many of those I spoke to are in places where they feel relatively safe. Many don't realize they may be in a bubble of false security as the number of coronavirus infections spreads out into suburban and rural Long Island — including Suffolk County, home of the Hamptons — and other areas where the country's extremely wealthy have second homes.\nOne hedge fund billionaire is at his ranch in Texas; another is isolating from other family members on a compound in Martha's Vineyard; a couple is in a villa on Harbour Island, Bahamas; an individual rented a yacht on the Long Island Sound ... and so on.\nIt would be unfair to say that these people are living without fear. If they needed any proof that Covid-19 doesn't discriminate by pocketbook, they need look no further than some of the high-profile confirmed cases like Knicks owner James Dolan, actor Tom Hanks and Prince Charles.\n\"We are just trying to do our best for ourselves and our families. You can't blame us for that,\" one multimillionaire with three country homes told me.\nAll I spoke to did so on condition of anonymity; all felt they were better placed to outrun Covid-19 if they were not stuck in high-density areas like New York City. (I should add that those who spoke to me are not necessarily representative of the entire socio-economic group. Major Wall Street financiers have been spotted in Central Park and certainly billionaires like Bill Gates have donated significant funding to coronavirus research.)\nBut while the wealthy may not be immune, their affluence makes it easier for them to insulate themselves. Unlike essential workers, housekeepers or nannies who cannot survive without their weekly paychecks, publications like The New York Times have data showing how those of means were able adopt protective isolation measures earlier than lower-income workers.\nThe top 1% of US earners can do that even better than the rest of us. Some of those in the Hamptons seem even to be enjoying themselves. Some are playing golf while others are gardening and comparing notes about hygiene. One person I know has her family's food driven out from New York City every day. It's not the same experience as walking past the hospital tents in Central Park or the boarded-up stores. And it can be harshly antithetical to the experience of an essential worker who must take public transport to get to a hospital or grocery store for a day's work.\nFor some of the rich I speak to, a more urgent headache than the symptom of the virus is the possible ramifications of the economic shutdown — but even that may be much less meaningful than you'd think given the tax break some are getting from the stimulus package. A clause in the bill allows commercial real estate developers to offset paper losses from the depreciation of their buildings against taxes on profits from other investments like the stock market. A New York Times report says the estimated cost of the change over 10 years is $170 billion.\nOne real estate mogul told me that he cracked open the champagne beside the pool the day the CARES Act was passed by Congress.\n\"Some people are going to get very rich out of this,\" says someone else I know in the health care supplies business.\nHarvard-trained epidemiologist Dr. Ashwin Vasan told me that he's heard disturbing stories of wealthy individuals procuring their own ventilators. This at a time governors of hard-hit states say they're about to run out of their own essential supplies.\nTwo people I spoke to told me that they have obtained prophylactically, their own stash of the malaria drug, hydroxychloroquine, currently undergoing clinical trials as a possible therapy but not yet proven safe and effective for this use. Vasan says that whichever doctor supplied the drug behaved not only dangerously, but irresponsibly.\n\"Every hospital in the city is doing clinical trials of that medicine under controlled conditions so to say: I'm going to give it to someone in their home without the ability to truly monitor them ... I don't consider them to be remotely responsible,\" Vasan said.\nVasan says that this is a time for health care professionals to pull together. \"This is not a time for concierge medicine,\" he says. And yet several in the Hamptons told me they felt safe precisely because there are private doctors who have homes there and whose private staff will pay house calls, assuming you have paid their multi-thousand-dollar subscription fee.\nThe self-protectionist mindset of the wealthy is not new, according to the historian Dr. Amanda Foreman . \"During the Second World War, despite the rationing across the United Kingdom, those who could afford it, could have dinner in the Ritz hotel,\" she says.\nBut the irony of an elitist approach during these times is that it may well backfire, according to Dr. William Haseltine , a biologist and former Harvard medical professor who recently chaired the ninth US-China health summit in the pandemic epicenter of Wuhan.\nAccording to Haseltine, the people who have left the city have put themselves at greater risk than if they had stayed put and practiced careful isolation and hygiene, because they have put themselves further away from the best hospitals. His opinion was echoed by New York Gov. Andrew Cuomo in his April 3 press conference , where he talked about the spike in Nassau and Suffolk counties. \"Long Island does not have as elaborate a health care system as New York City ... and that has us very concerned,\" he said.\nHaseltine says it's \"a fundamental mistake\" to think you are safer in a wide-open space.\n\"It's comfortable to be in a country house ... People feel they have more control,\" he says. \"You have more space, you think that you're not one of many, you're more special. But it's all psychological.\"\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nThe risk of Covid-19, he says, is equated to how many people you meet who might be infected. It's not like the bubonic plague of London that was spread by fleas and rats. With Covid-19 there is no reason to think that people in the countryside are any less infected than the people in New York City.\nSomewhere in all this, there is a very grim morality story.", "url": "https://www.cnn.com/2020/04/05/opinions/coronavirus-wealthy-false-security-vicky-ward-opinion/index.html"}