{"authors": ["Richard Galant"], "date_download": "2020-05-04 16:20:47", "date_modify": "2020-05-04 16:20:47", "date_publish": "2020-04-05 12:27:54", "description": "In the absence of a powerful government, human life is \"solitary, poor, nasty, brutish, and short,\" wrote British philosopher Thomas Hobbes 369 years ago. That dire picture seemed especially apt this week.", "filename": "2020_04_05_opinions_donald-_02af6922b8f3162aaced22499ee5f25a_index_1588609247.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404162542-trump-wh-4-04-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_opinions_donald-_02af6922b8f3162aaced22499ee5f25a_index_1588609247.html", "title": "Donald Trump's supreme challenge", "title_page": "Donald Trump's supreme challenge (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Sign up to get our new weekly column as a newsletter. We're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\nThat dire picture seemed especially apt this week: The US government confronted a monumental challenge, perhaps the biggest in nearly a century, with a pandemic killing thousands and infecting hundreds of thousands more, businesses laying off millions and signs that federal and state officials may be overwhelmed by the scale of the disaster.\nThink back to the 1980s, when President Ronald Reagan famously said, \"The nine most terrifying words in the English language are: I'm from the government, and I'm here to help.\" That sentiment animated decades of scorn for Washington DC, which arguably reached its conclusion in 2016 with the election of a president with zero government experience. But now America is looking to President Donald Trump to say, \"I'm here to help\" and to deliver on that.\nOne of Trump's senior advisers in the crisis is his son-in-law, Jared Kushner.wrote, \"When he stood at the White House podium on Thursday, what Americans heard was a spine-chilling performance from a believer in small government, delivered at a time when only big government can save the day.\n\"Of all the times to have a global pandemic, did it have to happen during the reign of an administration that wants to shrink the government to a fraction of its ability? Did it have to come under a president who has no respect for crucially relevant expertise or qualifications, who has surrounded himself with people whose principal talent is their ability to pay him public homage?\"\nAmy Plasencia, of the Committee of Interns and Residents, affiliated with the Service Employees International Union, \"and The need is great. \"Hospitals are facing severe shortages in personal protective equipment, ventilators, and ICU beds,\" wrote Dr., of the Committee of Interns and Residents, affiliated with the Service Employees International Union, \"and more and more health care workers are becoming infected .\"\nGovernors in some states refused to order citizens to stay home to prevent the spread of the virus. Many small businesses encountered obstacles in applying for a government loan program aimed at keeping people on payrolls. And officials said it may take as long as 20 weeks to fully distribute the government checks that could be a lifeline to taxpayers. To be sure, the enormity of the crisis is far beyond anything the US government has experienced in recent memory.\nAs John Avlon noted, President Trump described himself as a \"cheerleader for the country\" at one of his White House briefings this week. \"But, with apologies to cheerleaders, Trump is confronting a crisis he can't hype his way out of. He is standing on the sidelines, out of his depth and now we're all paying the price.\"\n\"What we need in the presidency right now is a quarterback -- someone who calmly calls strategic plays under intense pressure . Instead, we have Donald Trump. And his instincts are perfectly wrong for a pandemic. ...This is all coming as the administration is warning to expect deaths to rise sharply in the coming weeks, with President Trump even trying to spin fatalities under 100,000 as evidence they had done 'a very good job.' Seriously.\"\nJoe Lockhart wrote that blaming blue state governors like New York's Andrew Cuomo is just part of a sophisticated blame-shifting strategy designed to improve Trump's reelection chances. \" Trump, facing criticism that he acted too slowly, tried to deflect that onto states like New York, the epicenter of the pandemic in the US, suggesting that it was the state government -- not the federal government -- that got off to a \"very late start.\"wrote that blaming blue state governors like New York's Andrew Cuomo is just part of a sophisticated blame-shifting strategy designed to improve Trump's reelection chances. \" His most insidious blame game tactic came over the weekend when he implied that New York frontline responders -- docs, nurses and hospital workers -- who were all putting their lives on the line, might be guilty of stealing desperately needed respirators and inflating the need for ventilators so they could hoard them.\"\nMarc Thiessen in the Washington Post: \"Before this pandemic, we had many warning signs that our homeland was in peril: the 2002 SARS outbreak; the 2003 resurgence of H5N1 avian flu; the 2009 H1N1 swine flu outbreak; the 2012 MERS outbreak; the 2014 Ebola outbreak. Despite the warnings, we didn't take the danger seriously enough -- Blaming only the Trump administration for its response misses the full picture, wrotein the Washington Post: \"Before this pandemic, we had many warning signs that our homeland was in peril: the 2002 SARS outbreak; the 2003 resurgence of H5N1 avian flu; the 2009 H1N1 swine flu outbreak; the 2012 MERS outbreak; the 2014 Ebola outbreak. Despite the warnings, we didn't take the danger seriously enough -- and were caught unprepared for Covid-19. ... And there is no excuse for it .\"\nHarvey V. Fineberg laid out a six-step \"forceful, focused campaign to eradicate Covid-19 in the United States. What can be done now? In the New England Journal of Medicine, Dr.laid out a six-step \"forceful, focused campaign to eradicate Covid-19 in the United States. The aim is not to flatten the curve; the goal is to crush the curve. China did this in Wuhan. We can do it across this country in 10 weeks.\"\nPaging Dr. Fauci\nGil Eyal, who has studied the nature of expertise. At a few recent briefings, he noted, \"It became clear that the President and the nation's foremost public health expert were The contrast between Trump and Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, was stark, wrote, who has studied the nature of expertise. At a few recent briefings, he noted, \"It became clear that the President and the nation's foremost public health expert were battling, however politely, over who the American people should trust . While the scales may be tipping in Fauci's favor at the moment, the battle is far from won.\"\nMichael D'Antonio noted that \"somehow Fauci seems to have won President Trump's confidence even as he has corrected him in real time. In this way the doctor has served both the President and the country while maintaining his own credibility. Neither a toady nor an attention-seeker, he has put himself in the position noted that \"somehow Fauci seems to have won President Trump's confidence even as he has corrected him in real time. In this way the doctor has served both the President and the country while maintaining his own credibility. Neither a toady nor an attention-seeker, he has put himself in the position to tell everyone the truth, even when it's hard to hear.\n(For more on Fauci's background and his experiences working for six presidents, check out Dr. Sanjay Gupta's coronavirus podcast .)\nAnother US government official paid a price for telling the truth about the impact of the virus. Capt. Brett Crozier, the commanding officer of the aircraft carrier USS Theodore Roosevelt, was removed from his post Thursday after he wrote a memo urging Navy officials to take more aggressive steps to respond to an outbreak that infected more than 100 sailors. \"We are not at war. Sailors do not need to die,\" Crozier wrote. \"If we do not act now, we are failing to properly take care of our most trusted asset -- our Sailors.\"\nJohn Kirby, a retired Navy rear admiral, called it \"an unwarranted firing, CNN analyst, a retired Navy rear admiral, called it \"an unwarranted firing, reckless in its timing and petty in appearances. \" The decision \"could have a chilling effect on other commanding officers in similar circumstances, making them fearful of speaking up and thereby negatively impacting the Navy's ability to combat the deadly disease.\"\nAround America\nHaig Aintablian came face-to-face with the way the disease ravages patients when an ambulance brought in a 59-year-old man with a history of smoking and chronic obstructive pulmonary disease. \"He's been sick for three days, first with a dry cough and fever, but now with respiratory distress. I already know where this is heading. ... This man, this husband and father, is breathing with what seems like every muscle in his body. His belly bows in and out as he tries to fill his lungs while feeling like he's drowning. He's starting to tire out. In Los Angeles, emergency medicine resident Dr.came face-to-face with the way the disease ravages patients when an ambulance brought in a 59-year-old man with a history of smoking and chronic obstructive pulmonary disease. \"He's been sick for three days, first with a dry cough and fever, but now with respiratory distress. I already know where this is heading. ... This man, this husband and father, is breathing with what seems like every muscle in his body. His belly bows in and out as he tries to fill his lungs while feeling like he's drowning. He's starting to tire out. His body is losing this fight.\nKent Sepkowitz, an infectious disease specialist at Memorial Sloan Kettering Cancer Center. \"It is now clear that While the struggles of New York and New Orleans have gained a great deal of attention, the US should realize that another wave of the epidemic is hitting towns and cities across the country, wrote Dr., an infectious disease specialist at Memorial Sloan Kettering Cancer Center. \"It is now clear that the epidemic has found a foothold not just in coastal cities, but also in mid-sized cities and towns across the country,\" he observed. Albany, a town in southwestern Georgia, \"was the first to gain attention as the epidemic appeared, possibly spread by people at a funeral. To date, 462 people have been diagnosed in Dougherty County, where Albany is situated, and 18 have died.\"\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nGeorgia's governor, Brian Kemp, this week issued a stay-at-home order, explaining Wednesday that he had just learned that the disease could be spread by people even if they weren't experiencing any symptoms. But Fauci and other experts have been warning about that for months.\nSujit Sharma, Ann Chahroudi and Gregory Sysyn. The upshot? \"We saw a Atlanta's experience in 2014 may help explain the power of social distancing. Two winter storms that year, including one that stranded thousands of commuters, led to emergency declarations that kept most people at home for days. \"Offices were closed, and schools were shut; the conditions were like what millions of us are experiencing right now,\" wrote Drs.and. The upshot? \"We saw a substantial shortening of the flu season in Georgia compared to both the national trend in 2014, and the otherwise natural pattern of flu spreading throughout our large metropolitan area in other years.\"\nErrol Louis, Gov. Ron DeSantis \" And in Florida, wrote, Gov. Ron DeSantis \" has been late and lackadaisical , in ways that will undoubtedly cost many Floridians their health -- and, perhaps, their lives. Despite surging numbers of fatalities in New York and Washington and a rising tide of Florida editorial boards demanding action, DeSantis did not issue a statewide stay-at-home order until April 1. That made Florida the last state with more than 5,000 coronavirus cases to implement a statewide shutdown.\"\nAfter the quarantine is over ...\nDevika Koppikar is from Virginia and she's out of quarantine. But that's because she's based in Wuxi, China, where she teaches AP psychology and English in a high school program. During the coronavirus lockdown there, her Facebook friends shared fantasies of milkshakes and cheeseburgers while they dreamed of returning to normal life.\n\"I have now been out of quarantine for almost 40 days -- and life is far from normal . Even though the virus hit China around Christmas and rose exponentially until mid-February, life as we knew it is just seeing dawn three months later. On my discharge day, before going anywhere I had to go to my apartment leasing office, where I showed the committee a chart of my daily temperature readings and a medical professional checked my temperature so I could get a certificate saying I was 'free and clear' from Covid-19. This qualified me for a 'green' scan phone code that I had to show before entering any grocery store or taking public transportation. ... The security guards sitting at tables outside my apartment complex have become a little less rigorous about taking my temperature every time I come and go from my apartment complex.\"\nCharles A. Kupchan, who served on the National Security Council staff in the Obama White House, noted that \"Wuhan was ground zero for the virus and the Chinese government initially suppressed information about its spread and severity.\n\"But Beijing has already succeeded in putting forward a different face.\n\"The same week that Trump announced his travel restrictions on Europeans, the Chinese sent a planeload of medical supplies to Italy. Thousands of Chinese masks, ventilators, and test kits have been arriving across Europe, in some cases accompanied by Chinese medics. Such assistance may be part of a Chinese charm offensive, but the bottom line is that China is stepping up for Europe at a time when the United States is nowhere to be found .\"\nLaurie Garrett wrote, \"the 2020 pandemic is, at its root, the story of In the New Republic,wrote, \"the 2020 pandemic is, at its root, the story of two deeply flawed leaders, Xi Jinping and Donald Trump , who for too long minimized the coronavirus threat—and who, because of the enormous, largely unaccountable power they wield, must share responsibility for its global scale. At key moments when their mutual transparency and collaboration might have spared the world a catastrophic pandemic, the world's two most powerful men fought a war of words over trade policies, and charged each other with responsibility for the spread of the disease.\"\nMore views on the struggle against Covid-19:\nDr. Jennifer Lee: Face masks could be part of the answer in coronavirus pandemic\nRobyn Curnow: What happened when a president ignored the science on an epidemic\nIra Bedzow and Lila Kagedan: The ethical minefield of prioritizing health care for some with Covid-19 and\nSelena, 25 years later\nAt the age of 23, the singer Selena Quintanilla-Perez was murdered, touching off mourning and an appreciation of her gifts that has lasted for a quarter century.\nXimena Larkin wrote that the \"Queen of Tejano\" music was caught between two worlds, an American of Mexican descent.\n\"As a result, Selena was seen as not being Mexican enough for those with whom she shared cultural ancestry --particularly because she had not started to speak Spanish until her teens. The flip side, of course, was that many people did not see her dark features and curvy body as American enough for them. She was part of two worlds where neither one completely welcomed her.\n\"But instead of trying to fit into one or the other, she carved out her own space. She was never supposed to make it. For her to succeed meant that others like her could, too. ... She showed people what life can look like when they keep fighting -- when they have hope. The Tejano singer kicked down the door for an entire generation of Latino talent .\"\n(For a Spanish-language version of Ximena Larkin's piece, visit our sister site CNNE Opinion . You'll also find original commentary in Spanish on the pandemic and other topics.)\nDon't miss:\nVanessa Hua: The kitchen ritual getting my family and me through the pandemic\nJill Biden, Lily Eskelsen Garcia and Randi Weingarten: How to school your kids and\n'You never know what will break you ...'\nIt's been a tough few weeks in the music world, with the loss of Bill Withers due to heart complications and of others -- including Ellis Marsalis, Bucky Pizzarelli and Adam Schlesinger -- from Covid-19, wrote Gene Seymour.\n\"Of all music genres, however, it is jazz that's been struck especially hard and deep by Covid-19 ,\" Seymour added. \"No one knows how long this coronavirus siege will last, or who else we may lose. But one can hope that the spaces left open by these musicians' deaths will be occupied over time not only with fresh new voices, but with a wider, deeper appreciation of how jazz nurtures and nourishes many lives at once -- maybe even your own, if you let it.\"\nCountry music, too, has been affected.\n\"You never know what will break you in a time like this, with your bones feeling hollow and your heart beating fast,\" wrote Thomas Lake, in his latest \"The Distance\" essay on Americans living together and apart.", "url": "https://www.cnn.com/2020/04/05/opinions/donald-trumps-supreme-challenge-opinion-weekly-column-galant/index.html"}