{"authors": ["Analysis Marshall Cohen"], "date_download": "2020-05-04 17:01:07", "date_modify": "2020-05-04 17:01:07", "date_publish": "2020-04-10 11:05:45", "description": "President Donald Trump this week opened a new front in his campaign of lies about voter fraud in US elections, this time falsely claiming that voting-by-mail is \"corrupt\" and \"dangerous,\" even while states embrace it as a safe alternative during the pandemic.", "filename": "2020_04_10_politics_fact-check-trump-lying-voter-fraud_index_1588611667.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409190451-us-testing-trump-coronavirus-task-force-sot-tsr-vpx-00000000-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_fact-check-trump-lying-voter-fraud_index_1588611667.html", "title": "Fact check: Trump lies about voter fraud while states, CDC encourage voting-by-mail as pandemic-friendly option", "title_page": "Fact check: Trump lies about voter fraud while states, CDC encourage voting-by-mail as pandemic-friendly option - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) President Donald Trump this week opened a new front in his campaign of lies about voter fraud in US elections, this time falsely claiming that voting-by-mail is \"corrupt\" and \"dangerous,\" even while states embrace it as a safe alternative during the pandemic.\nWhile ramping up his attacks at White House briefings and on Twitter, Trump did not hide his political calculations, openly surmising that Republicans will lose ground if more people vote by mail.\nExperts say expanded postal voting is a critical component of any effort to hold a safe and fair election during the coronavirus pandemic, and Trump appears to be drawing a line in the sand.\n\"Mail ballots, they cheat. People cheat,\" Trump said Tuesday, when asked if states should expand absentee voting during the pandemic. \"Mail ballots are very dangerous thing for this country because they're cheaters. They go and collect them. They're fraudulent in many cases.\"\nOne day later, Trump tweeted that voting-by mail \"doesn't work out well for Republicans.\" He urged Republicans to \"fight very hard\" against any efforts to expand statewide mail-in voting, even though he has previously taken advantage of absentee voting in his home state of Florida.\n\"I'm not going to say which party does it, but thousands of votes are gathered, and they come in and they're dumped in a location, and then all of a sudden you lose elections that you think you're going to win,\" Trump later said, implying wrongdoing by Democrats, even though the most egregious alleged voter fraud scheme in decades was designed to help a Republican.\nFacts First: Trump is lying about voter fraud. Multiple studies have confirmed that there is no widespread voter fraud in this country, and millions of Americans vote-by-mail each year without systemic problems. This year, Democratic and Republican state officials have made it easier to vote-by-mail, acting on a recommendation from the Centers for Disease Control and Prevention.\n'This is a flat-out lie'\nFor years, Trump has embraced conspiracy theories about voter fraud. He set up a presidential commission to investigate the issue, but the panel disbanded without uncovering any evidence to support Trump's claims that millions voted illegally in 2016, costing him the popular vote.\nVoter fraud does exist, but not on the massive scale that Trump claims. An expansive study in 2017 from the Brennan Center for Justice, a liberal-leaning think tank, found that the rate of voter fraud in the United States was somewhere between 0.00004% and 0.0009% of all votes.\nVoting-by-mail has become increasingly popular in US elections, and nearly a quarter of all voters cast mail ballots in 2016, according to the Election Assistance Commission. This includes traditional absentee ballots plus the handful of states that conduct elections entirely by mail, which Trump singled out this week as a particularly \"dangerous\" system that is \"ripe for fraud.\"\nThose claims are false. While there are vulnerabilities, multiple layers of protections are in place to make sure voting-by-mail is clean, both by election officials and volunteers, sometimes assisted by technology such as special software that compares signatures in a statewide database. If anything, experts say too many absentee ballots are improperly rejected.\nVoting-by-mail is getting more popular, too. The ruby-red state of Utah will use all-mail elections this year, undercutting Trump's theory that this system is only embraced by Democrats because it hurts Republicans. In Utah, the governor, lieutenant governor and attorney general are Republicans, and there are GOP supermajorities in both chambers of the state legislature.\nUtah joined the small ranks of states that conduct all-mail elections, including the liberal strongholds of Washington state, Oregon and Hawaii, and the battleground state Colorado.\n\"This is a flat-out lie from the President,\" said Ari Berman, a leading expert on voting rights. \"We have tons of data on the prevalence of voter fraud in this country, and it's a very small problem, whether you vote in-person or by mail. In Democratic-controlled states like Oregon and Republican-controlled states like Utah, there has been no evidence of significant voter fraud.\"\nIt's true that voting-by-mail poses some risks that don't exist with in-person voting, which Trump noted on Tuesday. But some of the most serious and credible allegations of absentee ballot fraud involved Republican operatives in North Carolina in an election for the House of Representatives in 2018. State election officials refused to certify the results and held a redo election in 2019.\nTrump cast an absentee ballot last month in the Florida Republican primary, per local reports , and voted absentee in the 2018 midterms as well. Asked about this contradiction, Trump said it was acceptable \"because I'm allowed to\" vote by mail while living outside the state of Florida.\nOther prominent members of the Trump administration have repeatedly voted absentee with mail-in ballots, according to The New York Times . This includes Vice President Mike Pence, Health and Human Services Secretary Alex Azar and Commerce Secretary Wilbur Ross.\nSafe voting during a pandemic\nTrump's views on postal voting also undercut advice from other parts of his own government.\nPublic health experts have warned that the in-person voting could put voters and poll workers at risk. The CDC published recommendations for how state and local officials should conduct safe elections. The very first recommendation says states should, \"encourage mail-in methods of voting if allowed in the jurisdiction\" so people can vote while maintaining social distancing.\nAfter the White House briefing Wednesday, the Trump campaign blasted out a press release with the subject line: \"There's Evidence of Vote-by-Mail Fraud, Despite Media Indifference.\" The email highlighted a scattershot of alleged incidents from across the country, and cited a report from the conservative Heritage Foundation documenting 1,071 \"proven instances of voter fraud.\"\nThe spin from the Trump campaign inadvertently confirmed the big-picture truth about voter fraud -- that it is an extremely rare event in US election and is not a system-wide problem.\nThe 1,071 cases of fraud flagged by the Heritage Foundation span decades. But if there had been 1,071 fraudulent votes in the same election, in the same state, then that still would not have been enough to change the outcome of the closest state in the 2016 presidential election, which was Michigan. That would require a nearly tenfold increase in the number of fake votes.\nElection professionals and voting experts are warning that the coronavirus pandemic is already threatening the safety and integrity of the next presidential election. These unprecedented challenges could lead to waves of litigation and potentially even trigger a constitutional crisis.\nThis chaos was on display this week in Wisconsin , where a late maneuver by the Democratic governor to delay the primary election was challenged by state Republicans and eventually blocked by the conservative majority on the Supreme Court. A similar saga played out last month in Ohio, where the Republican governor found a creative way to postpone the election.\nExperts from across the political spectrum have said that major changes are needed in all 50 states to make sure that what happened in Wisconsin doesn't play out nationwide in November.\nSome Republican officials are making postal voting easier, despite Trump's objections.\nOhio's Republican Gov. Mike DeWine delayed the March primary and the state switched to a largely vote-by-mail election. And Georgia's Republican Secretary of State Brad Raffensperger also said he would send absentee request forms to all voters, who can ask for mail-in ballots for the May primary and November general election.\n\"In this current environment, we're going to have to choose between lesser evils,\" said Matthew Petersen, a Republican who served on the Federal Election Commission for 11 years, and was an unsuccessful Trump nominee for a federal judgeship in 2017. \"Even if you are someone who generally prefers people voting in polling places, these are not ordinary circumstances.\"\n\"The expanded use of mail-in balloting has got to be an option on the table,\" Petersen added.", "url": "https://www.cnn.com/2020/04/10/politics/fact-check-trump-lying-voter-fraud/index.html"}