{"authors": ["Grant Schulte"], "date_download": "2020-05-04 20:20:33", "date_modify": "2020-05-04 20:20:33", "date_publish": "2020-04-16 15:40:00", "description": "LINCOLN, Neb. (AP) — A central Nebraska county with a major meatpacking plant and a lot of nursing homes and manufacturing facilities now has more coronavirus cases than any other county in the...", "filename": "_32570bd42a11adb89f82b0f3b7cee072_1588623633.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_32570bd42a11adb89f82b0f3b7cee072_1588623633.html", "title": "Grand Island area now has most coronavirus cases in Nebraska", "title_page": "Grand Island area now has most coronavirus cases in Nebraska", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LINCOLN, Neb. (AP) — A central Nebraska county with a major meatpacking plant and a lot of nursing homes and manufacturing facilities now has more coronavirus cases than any other county in the state, according to new public health data.\nHall County had 278 residents with COVID-19 on Wednesday, surpassing the 263 known cases Douglas County, which includes Omaha and has nearly nine times as many residents.\nHall County, which includes Grand Island, has seen a spike in cases at the JBS USA meatpacking plant, the McCain Foods frozen appetizer factory, nursing homes and a health clinic. Last week, the farm equipment manufacturer Case New Holland temporarily halted production to protect line workers who work in close proximity.\n“Grand Island’s a manufacturing town, so it’s not an easy place to just work from home,” Gov. Pete Ricketts said Thursday at a news conference.\nThe actual number of Hall County cases is likely much higher than what’s reported because the county has a “very limited” number of tests available, said Central District Health Department Director Teresa Anderson. The Nebraska National Guard helped test people last week, and Ricketts said members will continue that work this weekend.\nLast week, 45 Grand Island doctors sent an open letter to Ricketts urging him to impose tougher social distancing restrictions to encourage more people to stay at home.\n“COVID-19’s arrival has been much swifter than we ever imagined,” the doctors wrote to the Omaha World-Herald .\nRicketts has repeatedly said he won’t issue a formal stay-home order as most other governors has done, but he has put in place a statewide health directive that bans public gatherings of more than 10 people and requires restaurants and bars to close their dining areas. On Thursday he defended the plan, arguing that it has worked as intended because all of the state’s hospitals are still well below their capacity.\n“We’re not overwhelming the health care system,” he said.\nNebraska has seen 952 confirmed cases statewide and 21 deaths, according to the state Department of Health and Human Services. Nearly 11,400 people have tested negative. The number of new cases has declined in recent days, from 61 on Monday to 48 on both Tuesday and Wednesday, according to the department’s tracker.\nRicketts said the state is working to help the city’s manufacturers develop safety plans. He noted that JBS USA has installed plastic dividers at work stations and in its lunchroom, and is taking the temperature of everyone who enters the facility. Workers are also wearing masks and washing their hands often, he said. The plant hasn’t closed because it’s considered an essential food processor.\nDespite the surge in cases in Grand Island, the region’s major hospital is successfully managing the influx of patients with COVID-19, the disease caused by the virus, said Dr. Gary Anthone, Nebraska’s chief medical officer.\nAnthone said CHI St. Francis is Grand Island had 18 COVID-19 patients as of Thursday morning. Twelve of those patients were in the hospital’s intensive care unit, down from 16 on Wednesday, he said.\nAnthone said Mary Lanning Hospital in Hastings, about 25 miles south of Grand Island, had 10 COVID-19 patients as of Thursday morning.\n“Those are the hot spots in the state right now,” Anthone said.\n___\nFollow Grant Schulte on Twitter: https://twitter.com/GrantSchulte", "url": "https://apnews.com/32570bd42a11adb89f82b0f3b7cee072"}