{"authors": ["Madeline Holcombe", "Dakin Andone"], "date_download": "2020-05-04 16:21:44", "date_modify": "2020-05-04 16:21:44", "date_publish": "2020-04-05 07:41:20", "description": "The next two weeks will be crucial in the United States' fight against the coronavirus, warn health officials, who are urging Americans to continue practicing social distancing measures.", "filename": "2020_04_05_health_us-coronavirus-sunday_index_1588609304.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405013851-02-coronavirus-0404-new-york-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_health_us-coronavirus-sunday_index_1588609304.html", "title": "The coronavirus fight in the United States enters crucial weeks", "title_page": "The coronavirus fight in the United States enters crucial weeks  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The next two weeks will be crucial in the United States' fight against the coronavirus, warn health officials, who are urging Americans to continue practicing social-distancing measures.\nWhat you need to know about coronavirus\nVice Admiral Jerome Adams, the US surgeon general, likened the coming week to a Pearl Harbor or 9/11 moment, saying on \"Fox News Sunday\" it would be the \"hardest and the saddest week in most Americans' lives.\"\nThe number of cases nationwide Sunday climbed to at least 337,274 with at least 9,633 dead , according to data compiled by Johns Hopkins University . Of those deaths, 1,344 were reported Saturday -- the most fatalities recorded in the US in a single day.\nDespite the rising numbers and grim warnings from health officials, President Donald Trump said in a White House briefing Sunday evening, \"We are starting to see a light at the end of the tunnel.\"\nHis comments were echoed by Vice President Mike Pence, who said, \"We are beginning to see the glimmers of progress.\"\nAsked about the apparent dissonance in messages from administration officials, Trump said, \"I think we all know we have to reach a certain point, and that point is going to be a horrific point in terms of death, but it's also a point at which things are going to start changing.\"\n\"We're getting very close to that level right now,\" the President said, \"and the next week and a half, two weeks, I think they're going to be very difficult.\"\nEarlier in the day, appearing on CBS's \"Face the Nation,\" Dr. Anthony Fauci of the National Institute for Allergy and Infectious Diseases conceded it \"would be a false statement\" to say the US has the pandemic under control.\n\"We are struggling to get it under control,\" Fauci said.\nBut Fauci told reporters at the White House briefing that a lag in the disease explained the apparent contradiction between a positive long-term outlook and the expectation of a bad week ahead.\n\"So, right now we're seeing -- as we all said correctly -- that this is probably going to be a really bad week. That is a reflection of what happened two and a half weeks ago. So if we start seeing now a flattening or stabilization of cases -- what you're hearing about, potential light at the end of the tunnel -- doesn't take away from the fact that tomorrow, the next day, is going to look really bad.\"\nFauci continued to stress the importance of social distancing measures. On Saturday he pointed to Washington state, where such measures appear to be paying off\nThe Boston Department of Health issued a public health advisory Sunday recommending residents -- except for those deemed essential workers -- stay home from 9 p.m. to 6 a.m., beginning Monday, Mayor Marty Walsh said.\nAdditionally, everyone is encouraged to wear a face covering when in public, a step that aligns with the White House's recommendation Friday that Americans wear face masks -- though Trump said the recommendation was voluntary.\n\"If you don't agree with me or you don't believe me or the governor or someone else, just turn the TV on,\" Walsh said. \"Watch the number of lives that are being lost every day to this virus.\"\nStill, modeling cited by White House officials this week project that, even with stringent mitigation efforts, between 100,000 and 240,000 Americans will die from coronavirus. And President Trump has refrained from a nationwide stay-at-home order , preferring to leave it to states to decide.\nA battle to stop the spread\nNew York Gov. Andrew Cuomo offered a bit of good news in a news conference in Albany on Sunday, saying the number of deaths in his state has been dropping over the past few days for the first time.\nThe significance of that, he said, is \"too early to tell.\" The number of new hospitalizations is also down, while the hospital discharge rate is up, Cuomo said.\nBased on the data, Cuomo said the state is either near the apex of its curve, \"or the apex could be a plateau and we could be on that plateau right now.\"\n\"We won't know until we see the next few days,\" he said.\nWith 122,031 cases and at least 4,159 deaths, Cuomo warned the state's hospital systems are running on just a few days' supply of medical equipment.\nOther states are coming to New York's aid, offering what supplies they can afford to give.\nNew York state will receive 140 ventilators from Oregon, Cuomo said Saturday in a news conference, adding the gesture was both \"kind\" and \"smart.\" China is donating another 1,000 ventilators, Cuomo said.\n\"Help New York today,\" Cuomo said Sunday. \"And then nationally, we shift the resources to the next place that is most impacted.\"\nAdditional help is on the way from Washington state, which was the initial epicenter of the outbreak in the United States.\nBecause of mitigation efforts and the cooperation of residents, the state has seen fewer infections than it anticipated, Dr. Raquel Bono, director of the state's Covid-19 Health System Response Management, said in a news release.\nHealth workers with a patient outside Mount Sinai Hospital in New York, which has seen a surge of coronavirus patients.\nAs a result, Washington state will return more than 400 ventilators it received from the national stockpile to help other communities in need, Gov. Jay Inslee said.\n\"These ventilators are going to New York and other states hardest hit by this virus,\" Inslee said. \"I've said many times over the last few weeks, we are in this together. This should guide all of our actions at an individual and state level in the coming days and weeks.\"\nWashingtonians should still stay home, wash their hands and practice social distancing, the news release added.\n\"People have been so beautiful to us,\" Gov. Cuomo said. \"And it is the New York way -- we're going to codify everything we've learned, and we get past this curve, whatever part of the country goes next, we will be there with equipment and personnel and however we can help.\"\nHoly Week in the time of coronavirus\nSocial distancing measures were complicated by the fact that Sunday marked the beginning of Holy Week in the Christian faith, which leads up to Easter.\n\"We don't get our rights to worship freely from the government. We get those from God,\" said the Rev. Tony Spell of Life Tabernacle Church in Baton Rouge, Louisiana, where he said more than 1,200 people gathered Sunday. \"We'd rather obey God than man.\"\nSpell was charged last week for violating the state's ban\nMeantime, the Rev. Alvin Gwynn Sr. of Friendship Baptist Church in Baltimore said he had a steady stream of people walking through the church, processional style. He said he was careful not to have more than eight or nine in the building at a time.\nArkansas Gov. Asa Hutchinson told reporters Sunday churches there were allowed to stay open, noting most churches are making services available online.\n\"Churches by and large do the right thing. They want to protect their parishioners,\" Hutchinson said. \"There are a few that have a very small attendance and they socially distance. We don't recommend that but if it's within the guidelines then that's understandable.\"\nMiami-Dade County Mayor Carlos Gimenez on Sunday thanked religious leaders who held services online, calling it the \"safest way to keep us all connected.\"\n\"Let's help us all stay safer at home during these religious holy days,\" Gimenez said.\nOther religious holidays are soon to follow, with the beginnings of the Jewish holiday of Passover on Wednesday evening and the Muslim holy month of Ramadan later this month.\nStates are under siege\nSeveral states have reported big jumps in cases, including Pennsylvania, which saw an increase of 1,494 cases, the governor's office said Sunday, bringing the statewide total to 11,510.\nNew Jersey reported another 3,482 cases on Sunday for a total of 37,505. At least 917 have died, New Jersey Gov. Phil Murphy's office said.\nAfter \"multiple\" conversations with the White House, Murphy on Sunday said the state had secured an additional 500 ventilators. He called them the state's No. 1 need.\n\"We're deeply grateful,\" Murphy told CNN's Wolf Blitzer Sunday evening, before adding, \"It won't be enough.\"\n\"We're going to have, I think, not just a tough week ahead, but I think a tough several weeks ahead,\" Murphy said. \"Whether it's ventilators, personal protective equipment, beds, health care workers -- those will all be constraints as we go through the next few weeks.\"\nA doctor from SOMOS Community Care prepares to test a patient at a drive-thru testing center for coronavirus.\nLouisiana reported a 21% increase in cases on Saturday, bringing the total to 12,500 cases, according to the state health department.\n\"We are still very much in this,\" Dr. Joseph Kanter, assistant state health officer, said in a news conference. \"In fact we haven't even hit halfway.\"\nNew Orleans' coroner's office and mortuaries have reached their limit, said Mayor LaToya Cantrell, and she's asked the federal government for additional refrigeration. Officials are responding to the influx by converting a convention center into an emergency hospital.\nLouisiana Gov. John Bel Edwards said Sunday his state could run out of ventilators by the end of the week if cases continue to surge.\n\"We now think it's probably around the 9th of April before we exceed our ventilator capacity based on the current number on hand, and ... we're a couple of days behind that on ICU bed capacity being exceeded,\" he told CNN's Jake Tapper on \"State of the Union.\"", "url": "https://www.cnn.com/2020/04/05/health/us-coronavirus-sunday/index.html"}