{"authors": ["Overnight Editor"], "date_download": "2020-05-04 21:10:08", "date_modify": "2020-05-04 21:10:08", "date_publish": "2020-05-01 08:41:47", "description": "The president claimed Obama left behind \"bad, broken tests\" for a virus that didn't exist yet.", "filename": "entry_donald-trump-barack-obama-coronavirus-test_n_5eab7d3ec5b6995f13fe85d4_1588626608.html", "image_url": "https://img.huffingtonpost.com/asset/5eaba344220000ef0d827f8f.jpeg?cache=owt10mxw5k&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_donald-trump-barack-obama-coronavirus-test_n_5eab7d3ec5b6995f13fe85d4_1588626608.html", "title": "Trump Called Out To His Face After Blaming Obama For 'Broken' Coronavirus Tests", "title_page": "Trump Called Out To His Face After Blaming Obama For 'Broken' Coronavirus Tests | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "President Donald Trump blamed his predecessor, former President Barack Obama, on Thursday for leaving him with faulty tests for coronavirus infections.\n“The last administration left us nothing,” Trump said. “We started off with bad, broken tests and obsolete tests.”\nBut Obama left office in 2017 and COVID-19 didn’t exist until last year, as CNN’s Jim Acosta was quick to point out to the president.\n“You say ‘broken tests,’” Acosta said. “It’s a new virus, so how could the tests be broken?”\nTrump was unfazed by the timeline.\n“We had broken tests. We had tests that were obsolete. We had tests that didn’t take care of people,” Trump said. He then attacked the Obama administration’s handling of the H1N1 swine flu outbreak, complete with a couple of digs at former Vice President Joe Biden:\n.@Acosta: You say you had \"broken tests\" from Obama -- the coronavirus is a new virus, so how could the tests be broken?\nTRUMP: \"We have broken tests. We had tests that were obsolete. We had tests that didn't take care of people.\" (None of this makes sense.) pic.twitter.com/r7oobJNFU2 — Aaron Rupar (@atrupar) April 30, 2020\nThen, Trump gave his administration a “spectacular” rating for its performance in handling the pandemic.\nThe president’s critics on Twitter weren’t having it:\nTrump again blames the Obama administration for the \"broken\" coronavirus tests that were developed during the Trump administration because the virus was not around during the Obama administration. — Daniel Dale (@ddale8) April 30, 2020\nTrump is blaming Obama for leaving him with “broken tests” for a virus that didn’t exist. Yes, really. https://t.co/bsUCuo7Qjj via @voxdotcom — Donna Brazile (@donnabrazile) May 1, 2020\nThe Obama administration set up the White House National Security Council Directorate for Global Health Security and Biodefense to prepare for future pandemics like COVID-19.\nTrump disbanded it. https://t.co/rFpYRElkWP — The Democrats (@TheDemocrats) May 1, 2020\nObama responds to Trump saying he left tests for Covid-19 in the pandemic book even though the virus didn't exist until three years after he left office. He said he left it in a briefing book on the resolute desk but didn't realize Trump doesn't read — Joe Lockhart (@joelockhart) April 30, 2020\nObama and his team left Trump a thorough handbook on pandemics and a top notch team to monitor and deal with such a crisis. Trump threw it all in the trash. Apparently they were supposed to leave him with the tests for a pandemic that came nearly 4 years after they left office. https://t.co/OKPnLK6S8q — Jennifer Hayden (@Scout_Finch) April 30, 2020\nIt speaks volumes that the Trump supporters who endlessly question Joe Biden’s mental capacity seem to have no problem with Trump constantly blaming Barack Obama for not supplying working tests to diagnose a virus that didn’t exist when he was president.pic.twitter.com/Q7QwT36QSV — Andrew Weinstein (@Weinsteinlaw) April 30, 2020\nOnce again, Trump said he inherited \"broken\" Covid-19 tests from Barack Obama.\nCovid-19 DID NOT EXIST when Obama was President. — Mikel Jollett (@Mikel_Jollett) April 30, 2020\nTrump keeps saying he inherited “broken” Covid-19 tests from Obama. The virus wasn’t known when Obama was president. It’s impossible.\nEither Trump is that ignorant *or* Trump thinks so little of his supporters that he figures enough of them are ignorant enough to believe that. — Brian Klaas (@brianklaas) April 30, 2020\nEffing insane. The tests couldn't have been broken because COVID-19 didn't exist during Obama. AND the approval polls for Obama's handling of H1N1 averaged 67%.\nNow, if only the Democrats would stop flogging each other and focus on winning, we might actually beat this a-hole. https://t.co/Ty1a19ohmA — Bob Cesca (@bobcesca_go) April 30, 2020", "url": "https://www.huffpost.com/entry/donald-trump-barack-obama-coronavirus-test_n_5eab7d3ec5b6995f13fe85d4"}