{"authors": ["Christina Maxouris", "Christina Zdanowicz"], "date_download": "2020-05-04 16:20:01", "date_modify": "2020-05-04 16:20:01", "date_publish": "2020-04-05 08:00:49", "description": "Kevin Klemm is going into his third week of teaching from home.", "filename": "2020_04_05_us_us-coronavirus-teachers-school-closures_index_1588609201.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404040802-coronavirus-teachers-split-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_us_us-coronavirus-teachers-school-closures_index_1588609201.html", "title": "US teachers had days to re-define class amid a nationwide crisis. The weeks stuck in limbo haven't been easy", "title_page": "US teachers had days to re-define class amid a nationwide crisis. The weeks stuck in limbo haven't been easy - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Kevin Klemm is going into his third week of teaching from home.\nSince the first day the Illinois social studies teacher found out schools were shutting down due to the coronavirus pandemic , there was no time to pause and think.\n\"This is really tough when we're being taken away from what we normally do ... knowing how much importance we have on kids' daily lives,\" he said.\nNow at least 124,000 schools have been shuttered across the US in hopes of slowing the spread of coronavirus, according to Education Week . At least ten states have already announced students will not be going back to class this year.\nBut for many educators who, like Klemm, had days to go online, the transition has been overwhelming. Moving around their classroom and looking over students' shoulders has turned into answering emails, recording quick lessons and putting together homework packets often delivered by teachers themselves to students' doorsteps.\nThe biggest challenge for most educators has been being away from their class.\n\"School is the only good thing for some of them, whether it's the best meals they have or the only meals they have,\" Klemm says of his students.\n\"It may be that we are the people they need to see with a smile on their face to realize that everything is going to be okay.\"\n'We're a family'\nTrying to recreate a sense of normalcy amid an unprecedented global crisis, teachers turned to all kinds of online tools to stay in touch with their class.\n\"Just being able to see someone in person matters a whole lot. I hope people don't take things for granted. Whenever something horrible happens, I think people learn lessons,\" Staci Scott-Stewart, a third-grade teacher in Indiana, says.\nStaci Scott-Stewart in her home set-up\n\"For these kids, this will be a major event in their life. I want to make sure that I do it right for the kids. Twenty years from now I want them to say Mrs. Scott-Stewart was there even though we couldn't be together,\" she says.\nIndiana leaders announced last week school closures would last through the end of the academic year. Scott-Stewart, who's been a teacher for nearly 25 years and says was never \"super techy,\" has resorted to Zoom meetings to keep a sense of community.\n\"I'm trying to figure out how to manage 24 kids who are so excited to see each other. I'm doing one every week,\" she says. \"That's when I ask for feedback from parents. What went well, what was a challenge and what do you want me to do more of? The parents said the students just want to see you.\"\nIn Georgia, special education teacher Lisa Cumberland says she tries to video chat with her elementary school students at least once a week.\nLisa Cumberland, a Georgia special education teacher\n\"It's hard not being there for my students to just give them that little squeeze or that pat on the back and be like, 'we're going to get through this,' or 'we can fix this,\" Cumberland says. \"To let them know it's okay.\"\n\"I just hope that people realize how important all of these relationships are,\" she says. \"That it's not just, I have to teach your kid, your kid has to get a good grade. We're a family.\"\nFears of falling behind\nBut with so many lingering questions about what's next, some teachers fear the online tools might not be enough to keep students on track for their coursework. What's being taught, how often and how students are graded all differ in each state -- and often in each district.\nIn Anchorage, Alaska, elementary school teacher Cody Collier says his school has set up a system to deliver packets to families without access to internet. Each Friday, new packets are prepared and the ones of the previous week are collected and carefully disinfected with Lysol for teachers to grade.\n\"I've told my parents in many different personal conversations and emails that at this time, leniency and care is much more important than things being turned in on time because they're learning new things just as much as their kids are.\"\nBut Klemm, in Illinois, says he fears the months away from school may mean some students will fall behind.\n\"I'm worried the gap is going to grow amongst students. You know there are students out there whose parents are having them learn things and then there are parents who have to work and their kids don't have that,\" he said.\nKevin Klemm, an Illinois social studies teacher\n\"The fact that they could go five full months without being in a classroom is concerning. We know that having summers off puts kids back quite a bit. What's another two months going to do?\"\nIn Georgia, Cumberland says her special education students heavily rely on the structure of the school day, especially those with autism or with ADHD.\nTo make sure they're staying on track, she says she's had to rely on the parents' involvement.\n\"Just reaching out to parents and just letting them know, let's set up a schedule, let's make this as easy as possible,\" she says. \"Making sure that the parents know, 'Okay you're going to be working on this, this is the language we use, this is the prompting that we use, (these are) the breaks in the schedule that we use within these lessons.'\"\n\"And just basically turning these parents into a special ed teacher,\" Cumberland says.\n'We're all in the same boat'\nThe efforts teachers across the country have poured into their digital classrooms are endless. But being away from school has had massive effects -- for them, their students and their families.\n\"The first day I had a kid point blank say, 'Hey do you know when we'll be back together again?\" Collier, in Alaska, says. \"For a lot of kids, school is their second home. Or in some ... cases, it might be a kid's first home.\"\nCody Collier teaches 4th and 5th graders in Anchorage, Alaska\n\"When you're gone from home you miss it,\" he says.\nAcross the country, Cumberland knows she won't see her students any time soon. Georgia Gov. Brian Kemp announced schools wouldn't open for the remainder of the academic year.\nCumberland, a mother of a kindergartener and two elementary school students, says she's still trying to strike a balance between her children, her students, their parents and taking a break for herself.\n\"The one thing that I spent the first entire two weeks telling my (students') parents was give yourself some grace, we are all going a little bonkers right now and none of us, not even your kids' teachers, know 100% what's going on,\" she says.\n\"We're all in the same boat,\" she says. \"We just have to show grace and just keep going and it will all work out.\"", "url": "https://www.cnn.com/2020/04/05/us/us-coronavirus-teachers-school-closures/index.html"}