{"authors": ["Joyce M. Rosenberg", "Dee-Ann Durbin"], "date_download": "2020-05-04 20:25:23", "date_modify": "2020-05-04 20:25:23", "date_publish": "2020-04-20 06:39:01", "description": "Some big restaurant chains have obtained loans from the government under a small-business relief program, leading business groups to call for changes to the program before Congress provides it...", "filename": "_44ba37de4628042ba3dac0df64642865_1588623923.html", "image_url": "https://storage.googleapis.com/afs-prod/media/00d79fe0766f421fb6ad5c26776d5853/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_44ba37de4628042ba3dac0df64642865_1588623923.html", "title": "Gov't relief loans to restaurant chains draw complaints", "title_page": "Gov't relief loans to restaurant chains draw complaints", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this March 16, 2020, file photo, a bread delivery is made to a Shake Shack restaurant in the Brooklyn borough of New York. The burger chain Shake Shack says it will return a small-business loan it got to help weather the coronavirus crisis after topping up its funding. (AP Photo/John Minchillo, File)\nFILE - In this March 16, 2020, file photo, a bread delivery is made to a Shake Shack restaurant in the Brooklyn borough of New York. The burger chain Shake Shack says it will return a small-business loan it got to help weather the coronavirus crisis after topping up its funding. (AP Photo/John Minchillo, File)\nSome big restaurant chains have obtained loans from the government under a small-business relief program, leading business groups to call for changes to the program before Congress provides it with new funding.\nThe Paycheck Protection Program exhausted its $350 billion in funding last week and many small businesses were unable to obtain loans they desperately need to stay afloat. Congress and the White House say they’re close to an agreement on that would give the program about $300 billion in fresh funds.\nRestaurant chains Shake Shack, Ruth’s Hospitality Group and Potbelly’s each announced last week they’d obtained loans worth a combined $40 million under the program. Although the loans are within the guidelines of the PPP, Shake Shack said Monday it will return its loan to give smaller restaurants a chance to get government money. The New York burger chain, which employs nearly 8,000 workers across 189 outlets, said it secured alternate funding.\nThe government program, which is overseen by the Treasury and administered by the Small Business Administration, limits loan recipients to businesses with fewer than 500 employees and revenue of less than $2.5 billion. But it makes an exception for restaurants and other food service businesses that employ fewer than 500 people per location, meaning that restaurant chains are as eligible for the loans as a neighborhood restaurant or bar.\nKaren Kerrigan, president of the advocacy group Small Business & Entrepreneurship Council, said the program is flawed and has obsolete rules.\n“Some of these rules and provisions disproportionately hurt the chances of the smallest of businesses accessing this capital, or not getting sufficient and proportionate relief to help salvage their businesses,” she said.\nThe Trump administration and Congress expect to reach agreement Monday on an aid package that could include up to $300 billion to boost the loan program.\nThe small business lending program is part of the $2.2 trillion rescue package approved by Congress last month. The intent of the law may have been to encourage restaurants of all sizes to reopen and bring back their laid-off workers — the larger companies are likely looking at their locations with an eye to closing underperforming ones. When restaurants do reopen, it will also restore revenue for small businesses that supply food, liquor and services to restaurants in their area.\nSmall business advocacy groups say changes are needed before the next round of funding is doled out. The National Federation of Independent Business says a portion of the money should be set aside for companies with 20 or fewer employees. While the NFIB did not mention small restaurants specifically, they would be among the beneficiaries under the NFIB plan.\nMany restaurants are scrambling to shore up their finances as customers obey stay-at-home orders. U.S. restaurant sales were down 43% the week ending April 12, according to NPD Group, a data and consulting firm. The drop-off has been sharpest for sit-down restaurants that have closed their dining rooms.\nFull Coverage: Business\nPotbelly Sandwich Works, which which has 474 restaurants and 7,000 employees, said last week it received a $10 million loan. Ruth’s Chris Steakhouse, which has 150 restaurants and more than 5,700 employees, received two loans of $10 million each.\nRestaurant chains are also tapping other sources for cash to weather the crisis. Ruth’s Chris recently announced it drew down $120 million available under an existing credit line, suspended its dividend and had top level executives agree to reduce their salaries. Darden Restaurants — which owns the Olive Garden chain — took out a $270 million loan earlier this month. McDonald’s took out a $1 billion loan and has cut executives’ pay.\nIn a statement, Shake Shack CEO Randy Garutti and its founder Danny Meyer said, “It’s inexcusable to leave restaurants out (of the PPP) because no one told them to get in line by the time the funding dried up. That unfairly pits restaurants against restaurants.”\n___\nDurbin reported from Ann Arbor, Michigan.", "url": "https://apnews.com/44ba37de4628042ba3dac0df64642865"}