{"authors": ["Opinion Ariel Zwang"], "date_download": "2020-05-04 16:19:36", "date_modify": "2020-05-04 16:19:36", "date_publish": "2020-04-05 00:09:13", "description": "Ariel Zwang writes that with victims services agencies facing new and unfamiliar challenges during the pandemic, this crisis has made us realize how many services can, if needed, be delivered remotely. Non-profits with little funding need more tech resources, and regulatory flexibility, to be able to provide services even when we can't see people in person.", "filename": "2020_04_04_opinions_domesti_08e3df1367c08acbd478ea5d20b6d879_index_1588609176.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403201038-domestic-violence-kid-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_opinions_domesti_08e3df1367c08acbd478ea5d20b6d879_index_1588609176.html", "title": "We're all supposed to stay home. What about kids who aren't safe there?", "title_page": "We're all supposed to stay home. What about kids who aren't safe there? (Opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Ariel Zwang is the CEO of Safe Horizon, the nation's largest victims services agency. If you are in New York City and are a victim of crime or abuse, you can contact Safe Horizon at 1-800-621-HOPE (4637) or www.safehorizon.org/SafeChat. The opinions expressed in this commentary are solely her own. View more opinion articles on CNN.\n(CNN) Our nation and world are facing an unprecedented challenge with the Covid-19 pandemic. To combat this crisis, experts have urged Americans to practice social distancing and to stay at home as much as possible.\nFor many, that is practical advice. But for others, home is not safe. That is the reality many clients of Safe Horizon --the victims service agency that I direct, supporting more than 250,000 victims each year--are facing right now.\nAriel Zwang\nFor instance, we are working with a client whose abusive partner has been spotted in her neighborhood. Though the client currently has an order of protection in place, now that she and her children are home due to the quarantine, instead of out of the house during their normal work and school hours, they face a heightened risk of being attacked.\nOur clients, both adults and children, also are dealing with the stress of being at home almost full time, and some are experiencing greater mental health challenges. We are extending our \"brief trauma intervention\" services, which are usually limited to a few sessions, to include additional sessions as needed to clients. This, we hope, will help adults better manage their own anxiety, and help them interact more positively with their children -- and will also provide an outlet for children to express their feelings.\nAs with organizations at every level in this country during a time of pandemic, victims services agencies are facing new and unfamiliar challenges as they attempt to support victims of crime and abuse, many of whom are also survivors of domestic violence and child abuse. Our top priority is the safety of our clients and their families.\nRead More", "url": "https://www.cnn.com/2020/04/04/opinions/domestic-violence-child-abuse-social-distancing-zwang/index.html"}