{"authors": ["Julie Carr Smyth"], "date_download": "2020-05-04 20:14:21", "date_modify": "2020-05-04 20:14:21", "date_publish": "2020-04-15 05:18:36", "description": "COLUMBUS, Ohio (AP) — After a month of draconian steps to minimize deaths and prevent hospital overload from the coronavirus pandemic, governors now face a new challenge: Deciding when and how to...", "filename": "_66ca7d78851900496248552be952ddf7_1588623261.html", "image_url": "https://storage.googleapis.com/afs-prod/media/25bb42250da74c33bf0441bbcf9b649c/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_66ca7d78851900496248552be952ddf7_1588623261.html", "title": "US governors grapple with relaxing virus restrictions", "title_page": "US governors grapple with relaxing virus restrictions  ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "California Gov. Gavin Newsom discusses an outline for what it will take to lift coronavirus restrictions during a news conference at the Governor's Office of Emergency Services in Rancho Cordova, Calif., Tuesday, April 14, 2020. Newsom said he won't loosen the state's mandatory stay-at-home order until hospitalizations, particularly those in intensive care units, \"flatten and start to decline.\"(AP Photo/Rich Pedroncelli, Pool)\nCalifornia Gov. Gavin Newsom discusses an outline for what it will take to lift coronavirus restrictions during a news conference at the Governor's Office of Emergency Services in Rancho Cordova, Calif., Tuesday, April 14, 2020. Newsom said he won't loosen the state's mandatory stay-at-home order until hospitalizations, particularly those in intensive care units, \"flatten and start to decline.\"(AP Photo/Rich Pedroncelli, Pool)\nCOLUMBUS, Ohio (AP) — After a month of draconian steps to minimize deaths and prevent hospital overload from the coronavirus pandemic, governors now face a new challenge: Deciding when and how to begin easing restrictions on businesses and social gatherings.\nMany of the states’ chief executives say they don’t want to move too quickly and risk a public health crisis, despite pressure from Republican lawmakers, business leaders, professional sports leagues and some parents.\n“We all want to open up tomorrow, but people will die if we do that without having things in place,” Democratic Minnesota Gov. Tim Walz said Monday.\nGovernors have consistently said that before they can loosen social restrictions, they need to know where their states are in terms of infections. To do that, they need widespread testing and tracing procedures.\nDr. Anthony Fauci, the government’s top infectious disease expert, said Tuesday that the country is “not there yet.”\n“Let’s not make the mistake of pulling the plug too early, as much as we all want to,” California Gov. Gavin Newsom said Tuesday as he announced a series of steps, including testing, needed to help the nation’s most populous state “transition from surge to suppression.”\nNo one is questioning the devastating effects the statewide shutdowns and business closures have had on the nation’s economy. Nearly 17 million Americans filed for unemployment in three weeks’ time, a record; state and local government tax revenue is plummeting, and businesses large and small are warning of imminent ruin.\n“There’s not a debate here about whether we need to get the economy open again,” Walz said. “Of course we do.”\nCalifornia, Oregon and Washington have agreed to coordinate how the West Coast states will begin lifting their shelter-in-place restrictions. Seven states in the Northeast, including New York, New Jersey and Pennsylvania, have done the same — even as President Donald Trump asserted on Monday that he, not the governors, had the power to reopen the nation’s economy.\nTrump abruptly reversed course on Tuesday, saying he would leave it to governors to determine the right time and manner to reopen activity in their states.\nMost have said it will be slow going. Besides testing and tracking, several have said they will consider the need to protect the people most at risk and ensure hospitals can handle a surge. They also have said they need to be able to to reinstate stay-at-home orders if needed. A poorly planned rollback of restrictions would only deepen the economic pain, they said.\n“We’ve got to make sure that we avoid a second wave at all costs,” said Michigan Gov. Gretchen Whitmer, a Democrat and possible vice presidential contender. “That would be devastating for our economy. So we’re going to make decisions based on science and having a real strategic phase-in of our economy when it’s appropriate and safe to do so.”\nWhitmer’s decision to maintain a statewide shutdown despite calls to reopen some rural areas and businesses has drawn the ire of Republicans, even those who backed her moves initially.\nSenate Majority Leader Mike Shirkey took to Facebook to accuse Whitmer of “DESTROYING OUR HEALTH BY KILLING OUR LIVELIHOODS!”\nThe state Republican Party in New Mexico is pressuring Democratic Gov. Michelle Lujan Grisham to ease up on her restrictions so small businesses can reopen.\nIn Ohio, the shouts of protesters punctuate Republican Gov. Mike DeWine’s daily briefings, and lawmakers of his own party are beginning to criticize his once widely praised aggressive approach to containing the virus, decrying the effects on businesses and communities.\nDeWine has been unfazed by the protests so far. He calls the COVID-19 disease a “monster” that is waiting to “pick members of our society off.” On Tuesday, he gave a sobering assessment for those wanting a return to normal amid the pandemic.\n“As we reopen Ohio, people will have to be very, very careful. ... You’ll have to weigh benefit versus risk,” he said. “You will have to make sure you’re wearing a mask when you go out, continue social distancing, etc. COVID-19 is not going away until we get a vaccine.”\nFull Coverage: Virus Outbreak\nEven Indiana Gov. Eric Holcomb, a Republican who was lieutenant governor under Vice President Mike Pence, has said he does not want the state to “relax at the wrong time” and see another wave of virus illnesses.\nHolcomb issued a statewide stay-at-home order that took effect March 25. In addition to other concerns, Holcomb said he wanted to see the state build up its own stockpile of protective supplies and hospital equipment.\n“Should there be a second wave come fall, like some suggest there could be, we need to be in a better position than when we first went into this storm,” Holcomb said.\nRepublican Texas Gov. Greg Abbott says he won’t reopen businesses all at once.\nAbbott has issued what is effectively a stay-at-home order through the end of April in Texas, where officials in some of the state’s largest cities say they don’t expect the number of COVID-19 cases to peak until May.\n“This isn’t going to be a rushing the gates, everyone is able to suddenly reopen all at once,” Abbott said Monday.\n___\nAssociated Press writers Adam Beam in Sacramento, California; Tom Davies in Indianapolis; David Eggert in Lansing, Michigan; Steve Karnowski in Minneapolis; Rachel La Corte in Olympia, Washington; Geoff Mulvihill in Cherry Hill, New Jersey; Paul Weber in Austin, Texas; and Andrew Welsh-Huggins in Columbus, Ohio, contributed to this report.", "url": "https://apnews.com/66ca7d78851900496248552be952ddf7"}