{"authors": ["Cnn Staff"], "date_download": "2020-05-04 16:01:10", "date_modify": "2020-05-04 16:01:10", "date_publish": "2020-04-01 16:00:04", "description": "Dr. Anthony Fauci has become one of the most recognizable names in the fight against the novel coronavirus pandemic. CNN Chief Medical Correspondent Dr. Sanjay Gupta talks to Fauci about his personal life, career and navigating his current position.", "filename": "2020_04_01_health_sanjay-gupta-podcast-april-1_index_1588608070.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401104736-fauci-coronavirus-podcast-transcript-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_health_sanjay-gupta-podcast-april-1_index_1588608070.html", "title": "Checking in with Dr. Fauci: Dr. Gupta's podcast 4/1", "title_page": "Checking in with Dr. Fauci: Dr. Gupta's podcast 4/1 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Dr. Anthony Fauci has become one of the most recognizable names in the fight against the novel coronavirus pandemic. CNN Chief Medical Correspondent Dr. Sanjay Gupta talks to Fauci about his personal life, career and navigating his current position straddling both science and politics.\nDr. Anthony Fauci, Director, National Institute of Allergy and Infectious Diseases: This is so different, Sanjay, than any anything else that I've experienced, despite the, you know, 40-plus years I've been doing this.\nDr. Sanjay Gupta: That's Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases and a member of the White House coronavirus task force. He's now one of the most recognizable leaders fighting this pandemic.\nFauci's signature gravelly voice -- a result of the copious press conferences, briefings and interviews he's been doing -- combined with his calm, evidence-based assurances, have become such a comfort to Americans lately that when he missed two White House briefings in a row, the hashtag #whereisdrfauci started trending on Twitter.\nEven at the age of 79, the nation's top infectious disease doctor has been working around the clock. But he found time to talk to me for this episode.\nI'm Dr. Sanjay Gupta, CNN's Chief Medical Correspondent. And this is \"Coronavirus: Fact vs. Fiction.\"\nWe've seen Dr. Fauci in front of the cameras at the White House briefings answering reporters' questions. His advice to the nation has had a profound effect on how we are all navigating this crisis.\nBut behind the cameras, when he's not working, Tony Fauci and his family are adapting to this new reality much like the rest of us.\nI asked him how he's coping on a personal level.\nDr. Fauci: You know, I'm doing fine, Sanjay. It's very exhausting. I think maybe about three or four weeks ago, I realized that I was really running myself completely into the ground. And it was the wisdom of my wife -- who is the head of the Department of Bioethics at the NIH but before that she was a nurse and still is a nurse, and she's a pretty good clinician -- and she sort of said, \"Tony, you just got to really be careful because you're going to burn out in about a week.\" So, with that, what I did is, I didn't say, pull back, but I started to make sure that I ate. Like, I would go a whole day without eating anything just because I was so busy, I just didn't have time to eat. And the adrenalin was so high that it doesn't make you hungry. And then I find that at the end of the day, I'm feeling hypoglycemic and I don't know why. And then my wife goes, \"Duh, you're hypoglycemic because you didn't eat anything.\" And it's the same thing with sleep. So, I'm really trying now, to the best as possible, to get five hours. I was getting three to four, which doesn't work for me, Sanjay. I'm not at my best at three to four.\nDr. Gupta: Right. I mean, I think nobody would be. And even five, as you know, is probably not enough. I know you probably don't have time to run and do things like that, because I know you're very active, but would you run outside?\nDr. Fauci: You know, I would. I mean that there's a little bit of a, I wouldn't say controversy, but there's something we need to sort out here, because, by the way last night, I got back from the White House press conference a little bit earlier because it was less of going on and on and on and on the way it happens sometimes. And so she and I went out for a run last night in (the) dark.\nDr. Gupta: Really?\nDr. Fauci: Yeah. And that answers your question. You know, we're telling people to hunker down, stay in. And then on the other hand, it just makes sense that if you don't want to go stir crazy, if you can get outside and really physically separate yourself, don't just go outside and congregate and see the neighbors and schmooze. But actually, just go out. So, my wife and I went out last night and you know, on the streets of Washington -- we live in northwest DC -- the streets of Washington were essentially deserted. We passed a few people. We passed them well beyond 6 feet of physical separation. So, frankly, Sanjay, I don't see anything wrong with that.\nDr. Gupta: You have had medicine and health in your family for a long time. You grew up in Brooklyn. Your family owned a pharmacy. Was that what sort of inspired you to go into medicine?\nDr. Fauci: You know, a little bit, Sanjay. I don't think overwhelming. Probably the thing that got me to go into medicine is that I'm very much of a people person. But also, I'm very analytical and I'm very scientific. And I was trying to figure out how do you, how do you mesh those two together? How do you do something that's evidence-based, science-based but absolutely has to do with people? You know, I grew up as an Italian-American Catholic boy from Brooklyn. I had Jesuit training my entire educational career. And the one theme that was always underlying our interactions was service for others. So, if you put science, I like people, service for others -- that was medicine. It was the NIH, when I went down to the NIH that got me introduced to science that got me involved with what I'm doing now. Fundamentally, I'm a physician. And, and when I think of my identity, it's a physician.\nDr. Gupta: Well, I think everybody in the world thinks of you that way, Dr. Fauci. Let me let me ask a couple questions about December of 2019. When you first heard about this novel coronavirus, the early reports out of China, what was your initial response?\nDr. Fauci: I was concerned, but it was a muted concern. In fact, it goes back even before it was discovered to be a coronavirus because we were hearing these reports of a strange pulmonary illness out of China that may be associated with wet markets. When I heard it was a coronavirus, the only thing I said -- not the only thing, but one of the things I said -- to myself: \"Let's hope that it remains difficult to readily transmit from human to human.\" In an interview, I don't even know when, but something that you interviewed me 20 years ago, whenever it was, you asked me, \"What keeps you up at night? What worries you?\" And if you go back, I told you, I said: \"It's a respiratory-borne illness. It may be influenza, but maybe it isn't influenza that has multiple characteristics. One, it's readily transmissible from human to human. And two, it has a high degree of morbidity and mortality.\" That's the nightmare that everybody who's in infectious diseases always worries about. And here we are in, you know, in 2020, it's happened.\nDr. Gupta: You know, it's interesting because I remember that conversation well, and I think it's really affected how I report about all of these outbreaks, epidemics and even pandemics over the last 20 years now. And in January 2017, you gave a talk at Georgetown University about the challenges the next administration might face. And you said there is going to be a surprise outbreak. That was incredibly spot on. You were prophetic on this. Why were you so convinced there would be a surprise outbreak?\nDr. Fauci: Well, you know, that was a lecture I put together at the end of the Obama administration because I reflected back that I had advised five presidents up to that time. And I noticed with some curiosity and impending concern that every one of the presidents that I've dealt with have been confronted with a substantial public health crisis. You know, Reagan with HIV into George H.W. Bush with HIV. You know, Clinton had a couple of West Nile and a few other things. Then, George W. With anthrax and then again with Ebola, and then Obama with Ebola. And then I said, you know, \"It's eerie, but I don't know what it's gonna be. But as we enter into this new administration, there's no doubt in my mind that we're going to get challenged with an unexpected outbreak.\" I didn't anticipate it would be as bad as this, but it certainly is unexpected.\nDr. Gupta: This is not at all a political question, but I'm just wondering in terms of style, you have spent so much time with so many different presidents. Is it typically the same sort of way of interacting? Do you make appointments and you meet in the Oval Office? Is there a certain casualness or is there always a formality to it? How do you describe those meetings?\nDr. Fauci: You know, they're different with every president, Sanjay. And within a given presidency, it's different. You know, I mean, I could give so many different examples. With George H.W. Bush, just by accident I developed a really close friendship with him because he came to the NIH in the in the late '80s when he was vice president and was thinking of running for president. And he sincerely wanted to learn about HIV. He was a very modest, unbelievable human being. And he came in, he says, \"I want to learn.\" So, he came to the NIH and I gave him a bit of a tutorial on HIV. I introduced him to patients, et cetera. He was very struck by that. And all of a sudden, he decided he was going to be my friend. Thank goodness. And he invited me to the White House, and we had a very warm, personal-type relationship. That was different. I mean, with Clinton, Clinton had all the right vibes about what to do. I had a good relationship with him, but it was quite formal, as you would have with respect to the presidency. With George W. Bush, I mean, it started off in crises because we had 9/11. We had anthrax. So, I got to know him under crises situation. And then subsequent to that, you know, I had the privilege of being close to him and developing PEPFAR, which to me was one of the most important things any American president has ever done.\nDr. Gupta: For our listeners, can you just tell us, what that is?\nDr. Fauci: PEPFAR is the President's Emergency Plan for AIDS Relief, which was established by President Bush in 2003, in which he marshaled an extraordinary amount of resources to help the people in the developing world, particularly in sub-Saharan Africa, who were challenged with an amazing degree of pain and suffering with HIV AIDS. I believe it is one of the most important mandates from a United States president in history because it saved millions of lives. So, a lot of credit goes to President George W. Bush for doing that. With Obama, Obama, you know, just a very easy person to get along with and a really good human being. And we had multiple crises. We had Ebola, we had Zika.\nDr. Gupta: H1N1 --\nDr. Fauci: Yeah, it was a marathon of infec--, of you know, he even, he didn't joke about it because he was serious. But I remember once he walked into the Situation Room and we were sitting around and he just put his hand on his head. He said, \"I got, I got children at the border, I got wars going on, and I'm spending all my time with these diseases. Would you guys please do something about this?\" It was, it was sort of like almost tongue-in-cheek, but it was serious. And then now, we're faced here. You know, I had no interaction with President Trump for the first three-plus years because there was not any reason to interact. We were doing our job. You know, he was doing what he was doing. And then when this came along, all of a sudden, now I'm in a situation where I spend like more than an hour every day with him. I mean, we go there, we brief him, we have a press conference, we debrief after the press conference. And it's like the answer to your question, a little bit long-winded, is that it's very different with each president, and it's dictated almost completely by the circumstances that you're under.\nDr. Gupta: Do you feel like you're being listened to? And let me give a little context to the question, because this is just my own observation as we talk on this podcast, that I feel like you've known a lot of the answers and a lot of the strategic direction things are gonna go earlier than sometimes you let on. I'm just going to throw that out there. And I wonder, is that a stylistic thing? Is that a strategic thing? Am I totally off base?\nDr. Fauci: No. In many respects, you're correct. You have to be discussing and presenting things in a way that people would appreciate it and accept it. I mean, sometimes if you come out and you get this instinct that it's going to be this way and most of the times your instinct is right, mostly because you have a lot of experience, you've got to be careful that you don't get ahead of what the facts and the data are, because then people will think you're just winging it, you know, you're shooting from the hip.\nDr. Gupta: You knew it seems that when this, this 15-day pause was first recommended that it was gonna have to be longer than that. If for no other reason that the data was going to catch up. Was the intent to sort of, let's slow-roll this, not let's not jar the country too much and let them accept it a bit more slowly?\nDr. Fauci: Yeah. It was a combination of a couple of things, Sanjay, you're absolutely correct. I was totally convinced that we would have to go beyond that. But there were a lot of forces that were, you know, conflicting. You know, if you keep it going longer, there's a lot of economic issues. If you don't, you might be responsible for making things worse than they were. I put all the economic things off my table. I said, you know, I care about the health and the economy of the country, but my job is the health of the nation. So, what I did was instead of coming out and trying to get ahead of everybody and saying, \"I know now that 15 days from now we're gonna have to go longer.\" It was, \"It's going to happen. Let's discuss it in a way that it happens.\" And it worked. Because when we presented the information to the president, he was -- this is (Dr.) Deb Birx and I -- that we went and presented it to him, he was very receptive to it. I mean, the thought that there'd be a lot of pushback, \"Oh, no, no, no.\" And he said it. He said, you know, \"The most important thing is the health of the country.\" So, I mean, I don't like the idea that we're going to have to do it longer. But if it's got to be done, it's got to be done.\nDr. Gupta: Does this feel especially strange for you?\nDr. Fauci: Oh, yeah. It's so, it's just different. I mean, the intensity of it, the potential for, you know, the fight, you know, it really looks like an ongoing war. You know, the, the dynamics of the virus against our attempts to mitigate it. And it's just it's, it's really intense. You know, hopefully we'll get through this. But it's, it's tough-going, man. This is an unusual disease. I'm fascinated, Sanjay, by what I would call the pathogenesis. You know, you get so many people who do well and then some people who just, bingo, they're on a respirator, they're on ECMO (a life-support machine) and they're dead. I mean, the dichotomy between that, there's something there, Sanjay, that we're missing from a pathogenesis standpoint. And I don't think it's only if you're elderly or if you have underlying conditions. There's something else going on there that hopefully we'll ultimately figure out.\nDr. Gupta: You know, you and I are both medical professionals. We're bonded by that. And I have to say that maybe you heard the story of Dr. James Goodrich, a pediatric neurosurgeon who died of Covid. We don't know for sure how he contracted it. But I found it really challenging, Dr. Fauci, to see what our health care professionals are going through, what they're talking about in terms of the lack of personal protective equipment (PPE) and then having to go home and worried about infecting their families. How about you? How have you sort of worked through that in your own mind?\nDr. Fauci: I'm doing everything I possibly can. And I'm not alone. I'm not the only person. There are a lot of good people that are trying to do that to make absolutely certain that we don't get to that point where people are putting themselves into even greater danger than the situation, even when you're optimally prepared with PPEs and everything you need, you are still putting yourself in danger. I mean, we've got to make sure regardless of what it takes, I mean, pull out all the stops, which I think we're doing. To me, that is the absolute highest priority to protect the health workers who are putting their lives on the line every day.\nDr. Gupta: We've done a lot of reporting about masks and the advice, really, from the World Health Organization, from the CDC: Healthy people don't need them. If you're sick, you should be staying inside anyway. But if you have to go out, We've done a lot of reporting about masks and the advice, really, from the World Health Organization, from the CDC: Healthy people don't need them. If you're sick, you should be staying inside anyway. But if you have to go out, then you can wear a mask . China, they said, you know, basically everyone should wear a mask at least in Wuhan. Do you think that we should be wearing a mask? Not a medical mask -- we don't want to take away from health care providers -- but even a cloth mask or anything to reduce the likelihood that we might be spreading the virus?\nDr. Fauci: If you look back, this whole story of masks has been confounded and conflated with things that I think have created a little bit of confusion, because the issue is that if everybody wears a mask and you don't have enough masks, the health care workers who need them may not get it. But that has driven the conversation, I think, to an extreme, because it says, \"Well, you know, masks are not that effective in preventing you from infecting somebody else or infecting somebody else, affecting somebody else in their ability to infect you.\" It's not perfect, but I think this is one of those times where we need to relook at it because although it isn't a 100% protected, if you have enough masks that you don't take away from the people who really need them, i.e. the health care workers, I think we should seriously consider the pros and the cons of maybe modifying our stance on whether people should be wearing masks because something doesn't have to be 100% effective to be beneficial.\nDr. Gupta: Will you recommend it?\nDr. Fauci: You know, from what I've seen, Sanjay, I think that if we do not have the problem of taking away masks from the health care workers who need them, I would lean towards it because, I mean, what harm can it do if you have enough masks?\nDr. Gupta: You know, it's interesting. You know, many years ago when I was back in residency, we made a decision to not shave (patients') hair as much as possible when we were doing brain operations. And part of the thinking was it doesn't really make a difference, really, in terms of their recovery. It's either shaving their hair or not. But it was the way they felt, and we found that in our own small study that people who did not have their head shaved actually recovered more quickly. They were more likely to be out of bed the next day, up and about, whatever it might be. The optics of masks, how much of that concerns you? Does it make it look like we are a nation that is sick?\nDr. Fauci: You know, that was part of the conversation. If everybody wears a mask, does that look like we're all frightened of each other? But, you know, the people in Asia have been doing that long before coronavirus, and it's become part of their culture. I mean, is it good? Is it bad? I think it's neither. It's neither good nor bad. They've just integrated that into their culture. And, you know, as I said, I cannot imagine it's doing harm and it might be doing some good.\nDr. Gupta: You know, I have found myself at times toggling between bewilderment and anger sometimes, especially given that it does seem like so many things were done right at the beginning. But then wondering if that time wasn't spent well. We knew how many masks were gonna likely be needed. We knew how many ventilators based on the federal government's modeling. Were there missed opportunities, do you think?\nDr. Fauci: You know, it's complicated. I mean, obviously, there probably were some missed opportunities, but I don't think that's the prevailing theme here. You know, I go back years and years when we got involved in pandemic preparedness. You know, if you would have said to anybody, \"What we really need is tens and tens of thousands, not 12.5 thousand, but tens and tens and tens of thousands of ventilators,\" there would not have been a lot of support for that. I got to tell you, there would not have been. Or, \"We've got to mobilize the industry to make a billion masks.\" I mean, now when you look back, we say, \"Oh, my God, why didn't we do it? So that we can not only give the masks to every health care worker who needs it, but if we want to go out and even have everybody in the community put a mask on.\" I mean, looking back retrospectively, it would have been nice. But I remember back before all this happened. I mean, there was good preparedness, but it wasn't the kind of thing we wish we had now.\nDr. Gupta: We don't think of our health care system with that sort of redundancy, I guess. If anything, the number of hospital beds that we have in the country may be even lower now than it was a decade or two ago. We do have a lot of redundancy in areas like defense.\nDr. Fauci: Right.\nDr. Gupta: Should we have this sort of redundancy? Isn't this a kind of defense and war as well?\nDr. Fauci: Sanjay, you're asking the question and preaching to the choir here. I mean, this is what I've spent the last almost 40 years arguing: that even though it is very difficult to get support for something that hasn't happened yet, it will happen, and then you will be kicking yourself that you didn't do that. And I think you used the right word. I had not heard it before, but I'm going to start using it now and that is \"redundancy.\" You're absolutely correct. There was very little redundancy to face a challenge like this. It's almost like you get one shot at it. If you don't knock it down, you run out (of) ammunition. You can't run out of ammunition. You can't run out of ammunition.\nDr. Gupta: You think we've learned that lesson? Do you think it will be applied in the future?\nDr. Fauci: Oh, I hope so, Sanjay. I mean, you know, when this is over -- and it will be over -- I think what we need to do is, is not just do a \"lessons learned\" paper that you write and stick in a drawer but really shake ourselves by the collars and say, \"Whoa, you know, look what we just went through. This cannot happen again.\"\nDr. Gupta: Is there something about this particularly that concerns you the most? That keeps you awake at night?\nDr. Fauci: Yeah. What I'm concerned about is we don't know the full impact of its ability to infect. You know there are probably a lot of people who are infected who we don't know, who are asymptomatic. I'm concerned about if this circles out into the developing world. I mean, Africa could be a disaster. Certain parts of the developing world of Asia could be a disaster. Caribbean, some parts of South America. So, we're in a developed world now. You're seeing China, USA, Europe. I'm looking about what might happen the rest of the world. That's very troublesome.\nDr. Gupta: I have three daughters, I think as, as you know. And do you have three daughters as well?\nDr. Fauci: I do, Sanjay. I have three daughters. Yes.\nDr. Gupta: That's another way we are connected here. But my daughters, you know, I've been thinking about them a lot and, and sort of imagine that this this event, what is happening right now with this coronavirus, is going to have a lifelong impact on them, not necessarily physically but I think in terms of how they see the world and the way that they act. How much of an impact do you think this is going to leave even after the pandemic is gone?\nDr. Fauci: I think it's going to be profound, Sanjay. I really do. I could hear it in the inflections in my daughters' voices when I speak with them on the phone. This is going to be imprinted on the personality of our nation for a very long time. I think this is going to be something that will be with them and have some impact, subconsciously or otherwise, for a very long time in their lives.\nDr. Gupta: Do you think that when we get the all-clear, for lack of a better way of describing it, that it's going to feel like it's all clear, or are people still going to be frightened, do you think, to push the elevator button, to shake a hand, to do whatever?\nDr. Fauci: Well, I actually think, I'm not a psychiatrist, so I don't want to go into that realm, but I think that when we do get the all clear, in some respects, there'll be relief, but I think there's going to be some subliminal post-traumatic stress syndrome that we're all going to face.\nDr. Gupta: You know, when you go out for a run with your wife at night, people probably don't stop you because they know they should keep their distance and you're running pretty fast. But if people stop you and ask you for your best advice, given all that's going on, Dr. Fauci, what do you tell them?\nDr. Fauci: You know what I tell them, and actually, interesting you should ask that, because that happened last night as I was, was running with my wife. Someone did stop and I said, you know, hang in there. This is really a painful, difficult time for our nation. But we're a strong nation and we've been through things in our history that is worse than this. And yet we've come through. There's going to be an end to this. You know, we're in the middle of it, but there will be an end so hang in there and pull together. And that's what we need to each of us need to tell everybody that. That's how we talk to each other.\nDr. Gupta: I really admire you, Dr. Fauci. I really appreciate your service. I've tried to say that every time I get a chance to speak to you and I really mean it. You've instructed the world on this. You've instructed me, personally. And I think besides your scientific knowledge, you set an incredible, steady example. And I thank you for that.\nDr. Fauci: Well, thank you, Sanjay. It's been great being with you today, but it's been a really, really great experience being your friend and colleague over the last couple of decades or more.\nDr. Gupta: That's Dr. Anthony Fauci, the nation's top infectious disease doctor.\nAs you heard him say, the best thing we can all do at the moment is hang in there.\nWe will get through this, and we'll get through this together.\nWe'll be back tomorrow. Thanks for listening.", "url": "https://www.cnn.com/2020/04/01/health/sanjay-gupta-podcast-april-1/index.html"}