{"authors": ["Trends Reporter"], "date_download": "2020-05-04 20:24:05", "date_modify": "2020-05-04 20:24:05", "date_publish": "2020-04-30 07:04:45", "description": "The former national security adviser denounced Trump's son-in-law for calling the Trump administration's handling of the crisis \"a great success story.\"", "filename": "entry_susan-rice-jared-kushner-success-story_n_5eaa560fc5b62eaf043ee7ba_1588623845.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa77e5300000a1121552a1.jpeg?cache=acxxm2wblr&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_susan-rice-jared-kushner-success-story_n_5eaa560fc5b62eaf043ee7ba_1588623845.html", "title": "Susan Rice Slams Jared Kushner's 'Ridiculous' Boast About U.S. Coronavirus Response", "title_page": "Susan Rice Slams Jared Kushner's 'Ridiculous' Boast About U.S. Coronavirus Response | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Former national security adviser Susan Rice tore into Jared Kushner on Wednesday for claiming the federal government’s handling of the coronavirus outbreak has been a “great success story.”\nKushner made his comments after the U.S. topped 1 million cases of the virus and more than 59,000 deaths.\nPresident Donald Trump’s son-in-law appeared on “Fox & Friends” Wednesday morning to congratulate the administration on its efforts. He claimed “the federal government rose to the challenge” and predicted the country would be “rocking” again by July.\nHe didn’t mention the U.S. death toll ― higher than any other country in the world ― the persistently inadequate testing, shortages of critical medical equipment and the lack of preparation that have plagued the administration’s crisis response.\nRice, a former Obama White House official, told CNN host Wolf Blitzer that Kushner’s claim “would be laughable if it weren’t so deadly serious.”\n“It’s ridiculous,” she said. “I don’t know how anybody with a straight face can call this a great success and declare this a mission accomplished moment when more than 60,000 Americans are dead.”\nRice also noted that according to the experts, the pandemic is far from over. Citing Dr. Anthony Fauci, whose judgment she said she trusts “implicitly,” Rice said that a second wave of infections is expected for the fall.\nFauci, who heads the National Institute of Allergy and Infectious Diseases, told CNN that if states ease restrictions too soon, there could be a rebound that would “get us right back in the same boat that we were a few weeks ago” and that a second wave was “inevitable.”\n“It’s ridiculous. And it would be laughable if it weren’t so deadly serious,” Former Obama national security adviser Susan Rice reacts to Jared Kushner calling the Trump administration’s response to the pandemic a “great success story.” pic.twitter.com/si0FOMn3ZL — CNN (@CNN) April 30, 2020\n“So we are far from being able to declare victory,” Rice said. “And in any event, there’s no victory when the losses on the battlefield in less than two months exceed all of those through the entirety of the Vietnam War, 26-plus million Americans are out of work, the GDP is declining at a rate of almost 5%.”\nWith this in mind, Rice said people need to come together and make a realistic assessment of where we are. She also called for the continued implementation of steps to keep Americans safe instead of inviting a rebound by declaring premature victory and reopening businesses too soon.", "url": "https://www.huffpost.com/entry/susan-rice-jared-kushner-success-story_n_5eaa560fc5b62eaf043ee7ba"}