{"authors": ["Chloe Melas"], "date_download": "2020-05-04 16:55:39", "date_modify": "2020-05-04 16:55:39", "date_publish": "2020-04-06 16:19:21", "description": "Global Citizen and the World Health Organization announced a virtual benefit concert on Monday.", "filename": "2020_04_06_entertainment_gl_691d722d7400783b68ccd19092c76339_index_1588611339.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406091602-jimmy-fallon-and-jimmy-kimmel-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_entertainment_gl_691d722d7400783b68ccd19092c76339_index_1588611339.html", "title": "Late-night hosts unite for Covid-19 relief concert", "title_page": "Global Citizen announces One World: Together At Home benefit - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Global Citizen and the World Health Organization announced a virtual benefit concert on Monday.\nThe event, curated by Lady Gaga and titled \"One World: Together At Home,\" is set for April 18. It will be co-hosted by Jimmy Fallon, Jimmy Kimmel and Stephen Colbert. Alanis Morissette, Andrea Bocelli, Billie Eilish, Billie Joe Armstrong of Green Day, Burna Boy, Chris Martin, Eddie Vedder, Elton John, J Balvin, John Legend, Kacey Musgraves and Keith Urban are all scheduled to appear.\nKerry Washington, Lang Lang, Priyanka Chopra Jonas will also take part.\nProceeds from the fundraiser will be directed toward the World Health Organization's efforts to equip frontline healthcare workers with protective equipment and to various charities providing food and shelter to those in need, according to organizers.\n\"As we honor and support the heroic efforts of community health workers, 'One World: Together At Home' aims to serve as a source of unity and encouragement in the global fight to end COVID-19. Through music, entertainment and impact, the global live-cast will celebrate those who risk their own health to safeguard everyone else's,\" Global Citzen CEO Hugh Evan said in a statement.\nRead More", "url": "https://www.cnn.com/2020/04/06/entertainment/global-citizen-concert-2020-lineup-coronavirus-relief/index.html"}