{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:11:07", "date_modify": "2020-05-04 20:11:07", "date_publish": "2020-04-07 10:40:29", "description": "Your daily look at late-breaking news, upcoming events and the stories that are being talked about today: 1. GRISHAM OUT AS PRESS SECRETARY: White House press secretary Stephanie Grisham is...", "filename": "_2bddb2b0cd6be5cfa19ea4d122ec468c_1588623067.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c0f3d6cb9bd347798f448cb4734a43be/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2bddb2b0cd6be5cfa19ea4d122ec468c_1588623067.html", "title": "5 things to know today", "title_page": "5 things to know today - that aren't about the virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "5 things to know today - that aren’t about the virus\nIn this March 25, 2020 provided by the Department of Defense, Pentagon Press Secretary Alyssa Farah briefs the press on the department's COVID-19 response efforts, at the Pentagon in Washington. White House press secretary Stephanie Grisham is leaving her post nine months into the job after never holding a single press briefing. She will be replaced by two women who are familiar names in Trump world. Trump campaign spokeswoman Kayleigh McEnany will be joining the administration as press secretary, while Pentagon spokeswoman Alyssa Farah will be moving to the White House in a strategic communications role. (Lisa Ferdinando/Department of Defense via AP)\nIn this March 25, 2020 provided by the Department of Defense, Pentagon Press Secretary Alyssa Farah briefs the press on the department's COVID-19 response efforts, at the Pentagon in Washington. White House press secretary Stephanie Grisham is leaving her post nine months into the job after never holding a single press briefing. She will be replaced by two women who are familiar names in Trump world. Trump campaign spokeswoman Kayleigh McEnany will be joining the administration as press secretary, while Pentagon spokeswoman Alyssa Farah will be moving to the White House in a strategic communications role. (Lisa Ferdinando/Department of Defense via AP)\nYour daily look at late-breaking news, upcoming events and the stories that are being talked about today:\n1. GRISHAM OUT AS PRESS SECRETARY : White House press secretary Stephanie Grisham is leaving her post after never holding a single formal press briefing. She’ll take over as first lady Melania Trump’s chief of staff.\n2. CIVIL RIGHTS ICON LEWIS BACKING JOE BIDEN : Georgia congressman John Lewis’ endorsement boosts the prospective Democratic presidential nominee among African American voters.\n3. PRESIDENT TRUMP GETS WIN IN EXECUTIONS CASE : An appeals court sides with the Trump administration in its effort to resume executions of federal death row prisoners.\n4. ORANGE HUNTING CAP UNDER MICROSCOPE : A judge orders DNA testing on a hat left at the scene of a fatal 1976 shooting that an Iowa inmate hopes will prove he has been wrongly imprisoned for decades.\n5. OPRAH PICKS HER NEXT BOOK : Oprah Winfrey’s new book club pick is Robert Kolker’s “Hidden Valley Road,” an in-depth account of a 1950s family in which six of 12 children were diagnosed with schizophrenia.", "url": "https://apnews.com/2bddb2b0cd6be5cfa19ea4d122ec468c"}