{"authors": ["Alex Rogers", "Clare Foran"], "date_download": "2020-05-04 16:56:27", "date_modify": "2020-05-04 16:56:27", "date_publish": "2020-04-09 10:04:35", "description": "On April 4, Republican Rep. Lee Zeldin of New York heard that the Suffolk County stockpile of masks, gowns, face shields and body bags was empty.", "filename": "2020_04_09_politics_lawmaker-reaction-covid-19_index_1588611387.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408165303-rice-richmond-tlaib-zeldin-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_lawmaker-reaction-covid-19_index_1588611387.html", "title": "'This is brutal': Lawmakers in hard-hit areas try to deliver during pandemic", "title_page": "'This is brutal': Lawmakers in hard-hit areas try to deliver during pandemic - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) On April 4, Republican Rep. Lee Zeldin of New York heard that the Suffolk County stockpile of masks, gowns, face shields and body bags was empty.\nSo that Saturday night, Zeldin tweeted a plea to his followers and within minutes received a response from Jared Kushner, President Donald Trump's son-in-law and senior White House adviser, who asked him about the burn rate of medical supplies for the past 30 days and the expected demand for the next.\nThe next day, Trump announced the administration would send 200,000 N95 masks to the county encompassing much of Long Island, New York, one of the hardest hit by the coronavirus pandemic.\n\"I get a phone call from someone who is a nurse at a local hospital, and they're telling me about how they're wearing the same N95 mask for two weeks,\" Zeldin said. \"There's few things that can possibly motivate me more in my entire time in Congress to deliver a specific item than hearing a story like that.\"\nAfter rushing to pass the largest US economic stimulus in history , rank-and-file members of Congress are serving as the conduit between hospitals and protective medical supplies, the unemployed and their next paycheck, small businesses and the loans they need to survive.\nThe coronavirus pandemic has infected over 400,000 Americans. More than 13,000 have succumbed to the disease. Millions have lost their jobs while businesses, schools and churches have closed. The stock market has tanked.\nThe twin economic and health care crises have struck all parts of the country and have particularly impacted states like New York, Louisiana and Michigan. Many of their representatives in Congress say they have been working the phones at all hours of the day to try and cut through the massive red tape and get their constituents help.\nDemocratic Rep. Kathleen Rice of New York heard of a woman who tried her unemployment insurance line 800 times. Democratic Rep. Cedric Richmond of Louisiana heard from a mother wondering whether her daughter with respiratory issues can stay in South Korea. Rep. Rashida Tlaib of Michigan, another Democrat, has heard from workers who still have to report to work and are worried their employers aren't doing enough to keep them safe.\nThe far-reaching $ 2 trillion stimulus passed by Congress last month in response to the pandemic provided relief for businesses and American workers impacted by the economic toll of everyday life shutting down. It set aside billions in aid to state and local governments, unemployed workers and small businesses.\nBut lawmakers on both sides of the aisle agree that more will be be needed and that implementation of various parts of the law has gotten off to a rocky start.\n\"It didn't go far enough,\" Tlaib said of the stimulus package. \"This is a crisis that is expanding.\"\nTlaib, whose Detroit-area congressional district is one of the poorest in the nation, is worried about first responders getting the supplies and resources they need in communities where budgets were stretched thin even before the coronavirus.\n\"Our local firefighters, our local police, and those at the local government level have been saying, 'you can't leave us out of any relief packages,'\" she said.\nPeter King, a Republican who represents another Long Island district, has heard from constituents who have been stuck on hold for hours as they try to apply for unemployment compensation or small business loans. The congressman's office has been working to alert the federal and state government to the issues as residents of his district seek to access the relief.\n\"There are going to be start-up pains. We have to address them, we can't deny they're there,\" King said.\nThe pandemic has also hit close to home for lawmakers.\nRichmond said he knows dozens of people who have tested positive and others who have died. He noted the particular pain those in New Orleans feel for not being able to hold funerals in public.\n\"It's how we celebrate life and the transition to the other side,\" Richmond said.\nKing's district director, Anne, recently lost her father to the virus. She couldn't visit her father when he was in the hospital and now, after his death, she can't be with family members due to social distancing.\n\"This is brutal. I think the most searing impact is going to be afterwards, the fact that people who lost their loved ones were unable to grieve with them,\" King said. \"It's definitely all around us.\"\nEveryone has an idea on what to do next.\nZeldin wants the country to plan for the next pandemic, creating an emergency domestic manufacturing plan so the US can stockpile and be self-reliant in providing protective equipment, ventilators, tests and medicine.\nRichmond wants the federal government to replenish the state's coffers decimated by a plunge in tourism and the price of oil.\nTlaib wants the next legislative relief package passed by Congress to require the Federal Reserve Bank to bail out local governments to prevent them from falling into bankruptcy.\nKing wants the federal government to protect and shore up pension funds that have taken a hit due to economic fallout from the pandemic.\nRice wants increased antibody testing, which could provide a clearer picture of the scope of the outbreak.\nIn the coming days, Congress is expected to pass an extra $250 billion for a small business loan program that directs forgivable loans to businesses with fewer than 500 employees on the grounds the money is used to pay salaries, payroll expenses and other costs like mortgages, rent or utilities. Last month, Congress appropriated $349 billion for the Paycheck Protection Program, but Rice said that would not be enough to deal with an \"unprecedented economic crisis\" even worse than the recessions after September 11, 2001, or during the 2008 financial crisis.\nFor now, these members are trying to deliver to their constituents through help from both the private and public sectors. Richmond, for example, is now trying to secure a donation for 100,000 test kits.\n\"I think every congressman has become a middleman,\" said Richmond, working between vendors and constituents who need protective gear, tests and \"you name it -- a little bit of everything.\"", "url": "https://www.cnn.com/2020/04/09/politics/lawmaker-reaction-covid-19/index.html"}