{"authors": ["Manuel Rueda"], "date_download": "2020-05-04 20:17:08", "date_modify": "2020-05-04 20:17:08", "date_publish": "2020-04-08 20:01:30", "description": "BOGOTA, Colombia (AP) — A large crowd of people violated a stay-at-home order in Colombia to attend the funeral of a notorious gang leader who had been arrested for extortion in December, and died...", "filename": "_647499fa5bcd03719a07efe6f7889a55_1588623428.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_647499fa5bcd03719a07efe6f7889a55_1588623428.html", "title": "Crowd attends Colombian gang leader's funeral amid lockdown", "title_page": "Crowd attends Colombian gang leader's funeral amid lockdown", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BOGOTA, Colombia (AP) — A large crowd of people violated a stay-at-home order in Colombia to attend the funeral of a notorious gang leader who had been arrested for extortion in December, and died from a heart attack Sunday while being transferred to a new prison.\nVideos posted on social media Tuesday showed more than 200 people parading down a street in the Medellin suburb of Bello with the coffin of gang leader Edgar Pérez while men on motorcycles honked their horns.\nSome members of the funeral procession carried red-and-white balloons and a poster that bore Pérez’s name, while a couple of police officers watched the scene unfold helplessly from a sidewalk as the large crowd appeared to overwhelm them.\n“This shows you how in some parts of Colombia gang leaders and drug dealers continue to hold strong relationships with the local population,” said Sergio Guzmán, a Colombian risk analyst. “Gang leaders provide jobs in some of these communities and also administer justice.”\nThe incident also highlights how Colombia is struggling to enforce a month-long national lockdown aimed at slowing down infections of the novel coronavirus.\nIn wealthy neighborhoods of cities like Bogota and Medellin residents can still be spotted jogging, disregarding a stay at home order that began on March 24. In working class neighborhoods, meanwhile, street vendors who cannot afford to go without a day of work are also plying their trade.\nAnd as the Easter holiday approaches the mayors of vacation towns near Colombia’s capital have complained that wealthy residents of Bogota are trying to sneak into their towns through small country roads, so that they can spend time in rural homes.\nIn Bello, which is just a half hour drive from Medellin, police said they fined 15 people who participated in Pérez’s funeral procession. Authorities said they could not take stronger measures to break up the procession because there were many children and elderly people in the group.\nColombia is urging its citizens to stay at home and imposing $300 fines on those who head outdoors without good reason. Residents of the country of 50 million are only allowed to be outside if they are going to buy food or medicine, or if they are working on jobs considered to be essential during the lockdown.\nCommercial flights have been shut down as well as public transport between cities in Colombia, which has so far reported 2,054 cases of COVID-19 and 54 deaths.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.\n“On paper Colombia has taken strong measures” Guzman said. “But its been difficult to convince working class people and the upper classes to comply with them.”", "url": "https://apnews.com/647499fa5bcd03719a07efe6f7889a55"}