{"authors": ["Rishi Iyengar", "Cnn Business"], "date_download": "2020-05-04 17:02:56", "date_modify": "2020-05-04 17:02:56", "date_publish": "2020-04-10 17:22:56", "description": "Apple and Google are partnering to help authorities track exposure to the coronavirus using Bluetooth technology.", "filename": "2020_04_10_tech_apple-google-contact-tracing-technology_index_1588611776.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410132012-sundar-pichai-tim-cook-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_tech_apple-google-contact-tracing-technology_index_1588611776.html", "title": "Apple and Google are working together to help track the coronavirus", "title_page": "Apple and Google are working together to help track the coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "San Francisco (CNN Business) Apple and Google are partnering to help authorities track exposure to the coronavirus using Bluetooth technology.\nThe two Silicon Valley giants will work on a platform to enable contact tracing , a measure that identifies people who have been exposed to the virus and who they have been in contact with, the companies announced Friday.\nThe companies will first release interfaces built on existing public health apps in May that can work on iOS or Android systems, followed by a more comprehensive platform in the coming months to which users will be able to opt in.\nA smartphone user that tests positive for the coronavirus can input their result into an app from a public health authority, which will feed into an anonymous \"identifier beacon,\" according to an explanation from Google. That identifier will then be anonymously exchanged with anyone the user comes into contact with who also has the service enabled.\nUsers then upload their identifier records to the cloud, following which they will receive a notification if they have been exposed to anyone who has tested positive for the virus.", "url": "https://www.cnn.com/2020/04/10/tech/apple-google-contact-tracing-technology/index.html"}