{"authors": ["Alaa Elassar"], "date_download": "2020-05-04 17:03:49", "date_modify": "2020-05-04 17:03:49", "date_publish": "2020-04-11 00:21:05", "description": "Like most of the world, the residents of a small town in Iowa are stuck at home, feeling isolated, alone, and trying their best to stay positive during the coronavirus pandemic.", "filename": "2020_04_10_us_iowa-earlham-anonymous-donor-gift-cards-trnd_index_1588611829.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410171023-iowa-earlham-anonymous-donor-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_iowa-earlham-anonymous-donor-gift-cards-trnd_index_1588611829.html", "title": "Anonymous donor gives every household in an Iowa town $150 in gift cards for food", "title_page": "Anonymous donor gives every household in an Iowa town $150 in gift cards for food - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Like most of the world, the residents of a small town in Iowa are stuck at home, feeling isolated, alone, and trying their best to stay positive during the coronavirus pandemic.\nSo when an anonymous donor gave everyone in the town of Earlham $150 worth of gift cards for food, the community received something more valuable than money: hope.\nIt started on March 26, when Earlham Mayor Jeff Lillie received a call from a friend who told him there was a donor interested in interjecting money into the town's economy. Earlham, population 1,450, is 30 miles west of Des Moines,\nAt first, the donor, who did not reveal their identity to the mayor, said they would buy 100 gift cards from three local businesses. An hour later, his friend called Lillie again and said the donor was bumping the number up to 250. An hour after that, the number was raised to 500.\n\"I said to him, at 500, you're darn near giving a gift card to every single household in Earlham,\" Lillie said. \"When I told him there were 549 households in town, he said 'Done.' And that was it. I was ecstatic because it made sure everyone would get a card.\"\nRead More", "url": "https://www.cnn.com/2020/04/10/us/iowa-earlham-anonymous-donor-gift-cards-trnd/index.html"}