{"authors": ["Steve Reed"], "date_download": "2020-05-04 20:18:10", "date_modify": "2020-05-04 20:18:10", "date_publish": "2020-04-07 14:19:59", "description": "CHARLOTTE, N.C. (AP) — Cam Newton says he feels like a “fish out of a water” being a free agent for the first time in his nine-year NFL career. Newton said during a conversation with...", "filename": "_8ccc1cb57cc25595b1c44a3aa5123c70_1588623490.html", "image_url": "https://storage.googleapis.com/afs-prod/media/84e696d99ea14f7db0ab869e32832c4a/2000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8ccc1cb57cc25595b1c44a3aa5123c70_1588623490.html", "title": "Cam Newton feels like 'fish out of water' as free agent", "title_page": "Cam Newton feels like 'fish out of water' as free agent", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHARLOTTE, N.C. (AP) — Cam Newton says he feels like a “fish out of a water” being a free agent for the first time in his nine-year NFL career.\nNewton said during a conversation with Oklahoma City Thunder guard Chris Paul on Instagram Live on Monday that being released by the Carolina Panthers has left him with a chip on his shoulder that has “turned into family-size real quick.”\nNewton didn’t give any indication where he might be interested in signing.\nThe 2015 league MVP played in only two games last season and is coming off surgery for a Lisfranc fracture in his foot. He also had surgery in the 2019 offseason for a partially torn rotator cuff in his right shoulder.\nBecause players are not allowed at NFL facilities due to the coronavirus pandemic, Newton has not been able to visit any potential suitors and work out for teams to prove he’s healthy.\n“It’s so much possibility for me right now, but the fact that this corona situation has hit, I’m not a person to blame or do any of that things,” Newton said. “But at the same time, I think I have been affected in a lot of ways, and it’s just (unfortunate). But at the end of the day, man, I’m going to let the ball play how it play and go from there.”\nThe Panthers replaced Newton with free agent Teddy Bridgewater.\nGeneral manager Marty Hurney said Monday on a conference call with reporters that releasing Newton was an extremely difficult decision. It was one of several moves Carolina made this offseason in an effort to remake the roster.\n“You have to make very difficult decisions every year,” Hurney said. “This was probably one of the most difficult. I drafted Cam. We all know everything he’s brought to the organization both on and off the field, so it was extremely difficult.”\nAs for the 30-year-old Newton, he’s still looking for a new home.\n“I’ve never not known anything other than the Carolina Panthers, and now it’s like I want God to direct my path and put me in a position where I can thrive and be myself,” Newton said.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/8ccc1cb57cc25595b1c44a3aa5123c70"}