{"authors": ["Por Yuri Kageyama Y Stephen Wade"], "date_download": "2020-05-04 20:20:13", "date_modify": "2020-05-04 20:20:13", "date_publish": "2020-04-03 18:16:22", "description": "TOKIO (AP) — La Villa Olímpica que se encuentra bajo construcción para los Juegos de Tokio podría ser usada como un hospital temporal para personas contagiadas con el nuevo coronavirus. La...", "filename": "_b166549ed0b7459cb40e8747d1bd7935_1588623613.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f6b3a1f15d1442a9b2153f63a3d64e60/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b166549ed0b7459cb40e8747d1bd7935_1588623613.html", "title": "Sopesan usar Villa Olímpica como hospital ante coronavirus", "title_page": "Sopesan usar Villa Olímpica como hospital ante coronavirus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nARCHIVO - En imagen de archivo del 23 de marzo de 2020, un trabajador recorre la Volla Olímpica para los Juegos de Tokio 2020, en Tokio. (AP Foto/Jae C. Hong, archivo)\nARCHIVO - En imagen de archivo del 23 de marzo de 2020, un trabajador recorre la Volla Olímpica para los Juegos de Tokio 2020, en Tokio. (AP Foto/Jae C. Hong, archivo)\nTOKIO (AP) — La Villa Olímpica que se encuentra bajo construcción para los Juegos de Tokio podría ser usada como un hospital temporal para personas contagiadas con el nuevo coronavirus.\nLa gobernadora de Tokio, Yuriko Koike, ha mencionado la posibilidad de ocupar el enorme complejo habitacional de Tokyo Bay, que albergará hasta 11.000 deportistas olímpicos y 4.400 paralímpicos y personal de ayuda durante los Juegos el año próximo.\nSe espera que el complejo, que estará conformado por 24 edificios, permanezca desocupado una vez que los Juegos fueron aplazados por 16 meses.\nKoike dijo que la Aldea Olímpica fue “una de las opciones, pero no ha sido terminada aún. Estamos hablando sobre lugares que estén disponibles incluso hoy o mañana y evaluando la posibilidad de uno en uno”.\nOtras alternativa, sostuvo Koike el viernes, es que el gobierno de la ciudad de Tokio compre un hotel para internar a los pacientes en medio de la pandemia.\nHasta el jueves, Japón había reportado cerca de 3.300 casos de coronavirus y 74 muertes, de acuerdo con el ministro de salud. Tokio reportó 97 nuevos casos el jueves mientras las autoridades buscaban más camas en la capital ante el aumento en las cifras.\nEn la mayoría de las personas, el nuevo coronavirus provoca síntomas de leves a moderados que desaparecen en dos a tres semanas. En algunas personas, sobre todos los adultos mayores y las que padecen trastornos de salud subyacentes, puede provocar enfermedades más graves, como la neumonía, e incluso la muerte.\nLas 5.600 unidades en la Villa Olímpica serán renovadas después de los Juegos y vendidas. Casi 1.000 de ellas se encuentran actualmente a la venta o ya han sido vendidas. Se espera que empiecen a ser ocupadas como área habitacional a partir de 2023, y los precios de los apartamentos están anunciados entre 500.000 y dos millones de dólares.\nLa Villa Olímpica es un negocio conjunto entre 10 compañías importantes y las autoridades de la ciudad de Tokio. El complejo será conocido como Harumi Flag y el grupo de constructores incluye a Mitsui Fudosan Residential Co., Nomura Real Estate Development Co. y Sumitomo Realty & Development Co.", "url": "https://apnews.com/b166549ed0b7459cb40e8747d1bd7935"}