{"authors": [], "date_download": "2020-05-04 20:20:06", "date_modify": "2020-05-04 20:20:06", "date_publish": "2020-04-04 17:06:10", "description": "LITTLE ROCK, Ark. (AP) — An Arkansas church that officials had accused of disregarding restrictions on large group gatherings amid the coronavirus pandemic has agreed to comply with the rules,...", "filename": "_6a624d78c6c02d687ce96797bd9378ef_1588623606.html", "image_url": "https://storage.googleapis.com/afs-prod/media/51c2f346ffa54feb83eed234e3403002/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6a624d78c6c02d687ce96797bd9378ef_1588623606.html", "title": "Arkansas church to follow rules on large services amid virus", "title_page": "Arkansas church to follow rules on large services amid virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Wednesday, April 1, 2020 photo, nurse Mandy Stuckey reaches into a patient's vehicle window to do a COVID-19 test as fellow nurse Tonya Green, right, looks on at the drive-thru COVID-19 testing site at New Life Church in North Little Rock. The site, a partnership between Sniffle Health and Natural State Laboratories will be open daily from 10 a.m.- 4p.m. through April 11. (Thomas Metthe/The Arkansas Democrat-Gazette via AP)\nIn this Wednesday, April 1, 2020 photo, nurse Mandy Stuckey reaches into a patient's vehicle window to do a COVID-19 test as fellow nurse Tonya Green, right, looks on at the drive-thru COVID-19 testing site at New Life Church in North Little Rock. The site, a partnership between Sniffle Health and Natural State Laboratories will be open daily from 10 a.m.- 4p.m. through April 11. (Thomas Metthe/The Arkansas Democrat-Gazette via AP)\nLITTLE ROCK, Ark. (AP) — An Arkansas church that officials had accused of disregarding restrictions on large group gatherings amid the coronavirus pandemic has agreed to comply with the rules, Gov. Asa Hutchinson said Saturday.\nOfficials had threatened to issue a directive ordering Awaken Church in Jonesboro to comply with the rules. While Arkansas has restricted gatherings of 10 or more people, churches have been exempted as long as they “limit person-to-person contact and maintain appropriate social distancing of at least six (6) feet to prevent the spread of this virus.”\nArkansas officials have been discouraging large church gatherings since an outbreak at one church in Greers Ferry last month that infected more than three dozen members and resulted in at least three deaths.\nState health officials said Saturday that the number of people with coronavirus had risen to at least 743, an increase of 100 from the day before. The number of deaths increased by two to 14.\nHutchinson said officials believed the pastor of Awaken Church, Chad Gonzales, intended to continue holding large services. But Hutchinson said the church has been persuaded to comply with the state’s restrictions.\n“We’ve really not had to issue a specific directive to them because after the conversations with the Department of Health, they’ve agreed to comply with the public health directives and we’re grateful for that,” Hutchinson said at a news conference Saturday.\nGonzales had told the Arkansas Democrat-Gazette earlier that he would comply with any order issued by the state.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.\nHutchinson said he has directed the state’s travel industry to not provide lodging to out of state recreational travelers.\n“We believe that it will have some significant effect out there in reducing the travel that we’ve already discouraged,” Hutchinson said.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/6a624d78c6c02d687ce96797bd9378ef"}