{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:12:25", "date_modify": "2020-05-04 20:12:25", "date_publish": "2020-04-09 14:27:03", "description": "The outbreak of the coronavirus has dealt a shock to the global economy with unprecedented speed. Following are developments Thursday related to the global economy, the work place and the spread...", "filename": "_36991b4ad9e1f27746052ba7fede4b74_1588623145.html", "image_url": "https://storage.googleapis.com/afs-prod/media/144c5acf3c174fccb330ea82a256c68d/2801.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_36991b4ad9e1f27746052ba7fede4b74_1588623145.html", "title": "Panic grocery buying slows; iPhone sales plummeted in March", "title_page": "Panic grocery buying slows; iPhone sales plummeted in March", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Shoppers walk in and out of a Meijer store for grocery shopping during the coronavirus outbreak as they wear masks and gloves in Arlington Heights, Ill., Thursday, April 9, 2020. (AP Photo/Nam Y. Huh)\nShoppers walk in and out of a Meijer store for grocery shopping during the coronavirus outbreak as they wear masks and gloves in Arlington Heights, Ill., Thursday, April 9, 2020. (AP Photo/Nam Y. Huh)\nThe outbreak of the coronavirus has dealt a shock to the global economy with unprecedented speed. Following are developments Thursday related to the global economy, the work place and the spread of the virus.\n___________________\nGLOBAL SHOCK: There is no place on earth inhabited by humans that is not being hit by the economic shock of the pandemic. The U.S. rolled out a $2.3 trillion plan to stabilize the economy Thursday.\n— Oxfam is warning half a billion people in the developing world could be pushed into poverty. In a report based on research at King’s College London and the Australian National University, Oxfam is calling for the immediate cancellation of $1 trillion in debt payments due from developing countries this year.\n— Sub-Saharan Africa is expected to fall into a recession for the first time in a quarter-century, according to the World Bank. A new report from the bank projects growth across the nearly 50-country region to fall this year from 2.4%, to at best minus 2.1% , and potentially negative 5%.\n— Canada lost more than a million jobs last month. The unemployment rate is now 7.8%. The 2.2% jump in unemployment is the largest single-month change in more than four decades.\nTHIN AIR: There has never been a more severe disruption to travel, particularly travel by air . The devastation in the travel industry has continued to ripple outward daily.\n— Pilots and flight attendants are demanding more personal protective equipment as hundreds test positive for the virus. So far, 41 pilots at American Airlines and nearly 200 pilots at other U.S. carriers have tested positive, according their unions. About 250 flight attendants have tested positive, according to The Association of Flight Attendants said, and hundreds more are isolated after possible exposure.\n— Portugal halted commercial flights at all five of its international airports. New restrictions were activated Thursday that would prevent travel or more than five people gathering in one place, essentially a prohibition on travel with other people.\n— The number of passengers carried by French-Dutch airline group Air France-KLM plunged by 57% in March compared with the same month a year ago. The group anticipates the suspension of more than 90% of its planned capacity in April and May due to travel restrictions, it said Thursday.\nAir France and KLM are seeking aid from the French and Dutch governments to be able to survive the crisis.\nSUPPLY DEMANDED: The need for protective equipment and other medical gear has prompted a broad response from companies to produce it .\n— More than 100 companies have submitted legitimate responses to the German government’s calls for protective medical equipment, the country’s health minister said. Germany wants to reduce its dependence on Asian manufacturers because surging demand has made supply scarce.\nSTOCKED UP: U.S. consumers are still buying more groceries than usual, but the panic buying that took place in mid-March has slowed.\nConagra Brands — which makes packaged foods like Birds Eye frozen vegetables, Chef Boyardee canned pasta and Duncan Hines cake mixes — said sales in the week ending March 29 were up 31% from the prior year, UBS said in an analyst note Thursday. For the two weeks before that, sales were double the previous year.\nNCSolutions, a data and consulting firm, said U.S. grocery spending was 23% higher the week ending March 28, but that was down from the week before.\nTECH MALFUNCTION: No sector in the S&P has been unscathed by the outbreak, and that includes technology. Every company, from startups to the biggest tech firms in the world, are suffering.\n— U.S. sales of iPhones dropped 56% in March compared with a year earlier, according to a report from KeyBanc Capital Markets. The firm used data from 2 million KeyBanc credit and debit cards to reach that conclusion. Online sales have not been able to make up for the loss of sales from Apple stores, closed for the outbreak. KeyBank also found that people who are buying iPhones are leaning toward cheaper models now, with the economic outlook dark.\n— A venture capital firm says it has raised $2 billion in new funds to invest in startups it believes will be key to a global economic recovery. Index Ventures, with headquarters in London and San Francisco, is betting that there will be lucrative opportunities to emerge from the crisis.\nMARKETS: Wall Street closed out its best week since 1974 after the Federal Reserve launched its latest effort to bolster the economy.\nPANDEMIC AND CHILL: Isolation during the outbreak has created a number of shared experiences, in addition to scrambling for toilet paper and consuming more mac & cheese . Endless hours streaming TV shows and movies is one more.\n— Since it began monitoring COVID-19 related growth three weeks ago, analysts with Citi say Netflix, Hulu and Disney have all registered double-digit traffic increases. That growth comes from new members and increased usage by existing users stuck inside.", "url": "https://apnews.com/36991b4ad9e1f27746052ba7fede4b74"}