{"authors": [], "date_download": "2020-05-04 20:12:32", "date_modify": "2020-05-04 20:12:32", "date_publish": "2020-04-09 11:12:17", "description": "MADISON, Wis. (AP) — The Latest on the coronavirus outbreak in Wisconsin (all times local): 5 p.m. The Wisconsin Hospital Association has unveiled an enhanced website to get out more...", "filename": "_17fe2ed50f1187e650268c367dd296fc_1588623152.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_17fe2ed50f1187e650268c367dd296fc_1588623152.html", "title": "The Latest: New dashboard to track medical readiness", "title_page": "The Latest: New dashboard to track medical readiness", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MADISON, Wis. (AP) — The Latest on the coronavirus outbreak in Wisconsin (all times local):\n5 p.m.\nThe Wisconsin Hospital Association has unveiled an enhanced website to get out more data about the state’s response to the coronavirus pandemic.\nThe dashboard has information on hospital admissions and bed count, available ventilators and the number of hospitals with seven days or fewer of personal protective equipment for workers.\nAssociation President Eric Borgerding said the site should help the public understand what’s being done to build up capacity for a potential surge in coronavirus cases that could overwhelm hospitals.\n___\n12:50 p.m.\nGov. Tony Evers will allow churches to offer drive-up services on Good Friday and Easter, his spokeswoman said on Thursday.\nThe conservative law firm the Wisconsin Institute for Law and Liberty and religious groups asked for clarity earlier Thursday.\n“Our intention was always to ensure that people could still practice their faith while also following the public health and safety measures necessary to flatten the curve and keep folks safe,” said Evers’ spokeswoman Melissa Baldauff.\nEvers last week denied a request from Republican lawmakers asking him to roll back his stay-at-home order that doesn’t allow more than 10 people to gather for a church service.\nMany churches have moved to broadcasting services online, while others have already been offering drive-up services.\n“We are not asking law enforcement to supervise or take enforcement steps against religious gatherings,” Baldauff said. “Rather, law enforcement has been working hard to help congregations understand the order and take precautions to keep themselves and their members safe.”\n___\n11:25 a.m.\nReligious groups and a conservative law firm asked Gov. Tony Evers on Thursday to clarify whether churches can offer drive-up services for Good Friday and Easter, saying not allowing them could be unconstitutional.\nThe request comes after Republican state lawmakers last week asked Evers to roll-back his stay-at-home order so in-person Easter and Passover services could be held.\nEvers denied the request from lawmakers. His spokeswoman did not immediately return a message about the latest request.\nThe letter from the Wisconsin Institute for Law & Liberty cited a memo from nonpartisan attorneys for the Legislature saying that outdoor services that adhere to social distancing guidelines would be permissible. But the group said some local government officials are using the order to prohibit such services from happening.\n“We understand the Governor’s responsibility to facilitate the safety of all Wisconsinites in the midst of this pandemic,” WILL President Rick Esenberg wrote to Evers. “But we cannot lose our heads. And state and local actors cannot use the occasion of a public health threat to run roughshod over the right to the free exercise of religion.”\n___\n6:10 a.m.\nWisconsin corrections officials say they don’t know how three more inmates in the state’s prison system contracted the coronavirus.\nThe Department of Corrections believes the first prisoner with a confirmed case of COVID-19 April 2 was exposed while on a trip outside the Columbia Correctional Institution.\nOn Sunday, the DOC confirmed three additional cases in the system. The three inmates had not left the prisons recently, according to DOC spokeswoman Anna Neal.\nOne of the three cases is at Columbia where three employees have also tested positive.\nThe State Journal reports the other two inmates with COVID-19 are at Oshkosh Correctional Institution. No employees there have tested positive, so it’s unclear how the virus could have gotten into the prison.", "url": "https://apnews.com/17fe2ed50f1187e650268c367dd296fc"}