{"authors": [], "date_download": "2020-05-04 20:25:01", "date_modify": "2020-05-04 20:25:01", "date_publish": "2020-04-15 11:45:59", "description": "ST. PAUL, Minn. (AP) — The Latest on the coronavirus outbreak in Minnesota (all times local): 6:30 p.m. The family of Minnesota Attorney General Keith Ellison says his 82-year-old...", "filename": "_d5f8ad4dae7f2259ccc2c3b9b8fb8893_1588623901.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d5f8ad4dae7f2259ccc2c3b9b8fb8893_1588623901.html", "title": "Minn. AG's mother died of COVID-19 complications", "title_page": "The Latest: Minn. AG's mother died of COVID-19 complications", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ST. PAUL, Minn. (AP) — The Latest on the coronavirus outbreak in Minnesota (all times local):\n6:30 p.m.\nThe family of Minnesota Attorney General Keith Ellison says his 82-year-old mother died last month from COVID-19 complications.\nClida Martinez Ellison died March 26 in Michigan. Her grandson, Minneapolis City Council member Jeremiah Ellison, wrote in a New York Times editorial Wednesday that he found out last week his grandmother tested positive for the coronavirus.\nAttorney General Keith Ellison, a Democrat, has responded to scams, evictions and price-gouging related to COVID-19. He told the St. Paul Pioneer Press on Wednesday his mother was “just one of those people who held the sky up and you never thought you’d be without and suddenly here we are.”\nOriginally from Natchitoches, Louisiana, Clida Martinez Ellison was a child advocate and social worker. She graduated from Xavier University with a bachelor’s degree in medical technology and went back to college at age 57 to earn a master’s degree in social work. Keith Ellison was among her five sons.\n___\nThis story has been corrected to remove reference to Clida Martinez Ellison being diagnosed with the coronavirus before her death; she tested positive after her death.\n___\n4:20 p.m.\nThe Boundary Waters Canoe Area in northern Minnesota will be closed until early May to help prevent the spread of COVID-19.\nThe wilderness area will be closed for both day and overnight use from April 15 through May 4. That’s when Gov. Tim Walz’s extended state stay-at-home order is set to expire. Reservations made through May 4 will receive a full refund, including reservation fees.\nThe Superior National Forest also plans to change its permit pickup requirements beginning May 5, to follow guidelines for social distancing. Visitors can either print their Boundary Waters reservation confirmation email at home and use that as their permit, or pick up the permit in person at a business that remains open and is under an agreement with the Forest Service.\n___\n6:40 a.m.\nNearly two dozen local elected officials are calling on Gov. Tim Walz to suspend rent and mortgage payments and stop commercial property evictions during the coronavirus pandemic.\nIn a letter to Walz, the officials say “mass displacement, home foreclosures, and the shuttering of businesses are imminent unless aggressive measures are taken immediately.”\nThe officials include a majority of the City Council members in Minneapolis and St. Paul.\nThe governor issued an executive order last month to prevent residential evictions, but added that it doesn’t relieve a tenant’s obligation to pay rent.\nThe Star Tribune reports Walz has asked the Legislature for an increase to the Family Homeless Prevention and Assistance Program to help people cover rent and mortgage payments, but there’s no deal yet.", "url": "https://apnews.com/d5f8ad4dae7f2259ccc2c3b9b8fb8893"}