{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:16:54", "date_modify": "2020-05-04 20:16:54", "date_publish": "2020-04-28 09:33:39", "description": "The agency wants about 10,000 “mission-critical” employees to return to work, but says it doesn't have enough protective equipment for all of them.", "filename": "entry_irs-employees-masks-coronavirus_n_5ea7e4eec5b6dd3f908a62a9_1588623414.html", "image_url": "https://img.huffingtonpost.com/asset/5ea7efa8220000e10b827c59.jpeg?cache=jzb1yy39tp&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_irs-employees-masks-coronavirus_n_5ea7e4eec5b6dd3f908a62a9_1588623414.html", "title": "B.Y.O. Mask: IRS Under Fire For Not Providing Protective Coverings To Returning Workers", "title_page": "B.Y.O. Mask: IRS Under Fire For Not Providing Protective Coverings To Returning Workers | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "The Internal Revenue Service says it wants about 10,000 “mission-critical” employees to return to work as soon as this week ― and to remain masked while on agency premises. But since the IRS says it may not be able to provide masks for everyone, workers will have to provide their own.\nIRS officials said in a Friday email, obtained and shared online by Democrats on the House Ways and Means Committee, that returning employees would be required to wear face masks at all IRS facilities and workspaces to help prevent the spread of COVID-19.\n“Although the IRS is seeking to procure personal protective equipment (PPE) such as masks and gloves, each IRS facility may not be able to initially procure the PPE for all employees immediately,” officials wrote. “Employees are therefore required to bring personal face coverings for their nose and mouth area when they come to work.”\nIf employees fail to cover their faces, they “may be required to return home until such time the employee adheres to these requirements,” the email added.\nIn a blistering statement, Rep. Richard Neal (D-Mass.), chairman of the Ways and Means Committee, and Rep. John Lewis (D-Ga.), chairman of Ways and Means Oversight Subcommittee, said it was “completely irresponsible and unethical for the IRS to demand those workers obtain their own protective equipment.”\n“This is the responsibility of the federal government to its workers,” the lawmakers continued. “The agency is expecting entirely too much of employees who are likely distraught over the health risks returning to work presents for themselves and for their families, as well as the potential repercussions they could face if they do not clock in ... with the mandated equipment in-hand.”\nNEWS: Chairman @RepRichardNeal and Oversight Subcommittee Chairman @repjohnlewis learned that potentially more than 10,000 IRS employees resuming on-site work Monday will need to obtain their own PPE.\nRead their statement on the unreasonable mandate: https://t.co/INMnq6ZDbr — Ways & Means Committee (@WaysMeansCmte) April 25, 2020\nThe National Treasury Employees Union, which represents about 70,000 IRS employees, told NPR that the agency has first asked for volunteers to return to work and has offered them incentive pay to do so.\nThe union said, however, that if there aren’t sufficient volunteers, the IRS “will direct employees to return to the workplace.”\nThis is an extremely hectic time for the IRS, which is under pressure to send out the government’s stimulus payments as quickly as possible on top of its usual work during tax season.\nAt least 100 IRS employees have been diagnosed with COVID-19 to date, according to the agency. Four of them have died.", "url": "https://www.huffpost.com/entry/irs-employees-masks-coronavirus_n_5ea7e4eec5b6dd3f908a62a9"}