{"authors": ["Aj Willingham"], "date_download": "2020-05-04 16:22:13", "date_modify": "2020-05-04 16:22:13", "date_publish": "2020-04-06 10:19:43", "description": "Here's what else you need to know to Get Up to Speed and Out the Door.", "filename": "2020_04_06_us_five-things-april-6-trnd_index_1588609333.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405013646-01-coronavirus-0404-new-york-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_us_five-things-april-6-trnd_index_1588609333.html", "title": "5 things to know for April 6: Coronavirus, health, economy, elections, White House", "title_page": "5 things to know for April 6: Coronavirus, health, economy, elections, White House - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "If your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' newsletter.\nIt's not just toilet paper and ground beef people are stockpiling. Since coronavirus measures have made everything harder to get, some people are hoarding their illegal drugs of choice . Here's what you need to know to. (You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily. Sign up here .)\n1. Coronavirus\n2. Health\nWhite House officials and medical experts are at odds over President Trump's endorsement of unproven coronavirus treatments. Trump has repeatedly recommended hydroxychloroquine , the anti-malaria drug, and azithromycin, a common antibiotic, despite warnings from researchers that neither drug has been proven to treat or prevent someone from contracting Covid-19. This rift reportedly caused a heated disagreement in the Situation Room this weekend , with several aides and outside advisers siding with Trump. While researchers are conducting tests with hydroxychloroquine, doctors say it's too early to be sure of its efficacy, and have warned its side effects could be dangerous to otherwise healthy individuals.\n3. World economy\nJUST WATCHED Why oil prices are slumping Replay More Videos ... MUST WATCH Why oil prices are slumping 02:21\nThe meeting between Saudi Arabia, Russia and members of the Organization of the Petroleum Exporting Countries has been postponed to April 9 , sending an optimistic oil market into a bit of a backslide. Saudi Arabia and Russia have been locked in an epic price war since early March when the OPEC alliance cracked, flooding the oil market with cheap crude just as the coronavirus pandemic poked a giant hole in international demand. Trump says he's optimistic the meeting, which will be held virtually, will end the price war and rebalance the market. Meanwhile, global stocks surged early Monday after hard-hit areas like Italy, Spain and New York City reported drops in coronavirus deaths.\n4. Election 2020\nJUST WATCHED Activists look to black voters in key state for 2020 Replay More Videos ... MUST WATCH Activists look to black voters in key state for 2020 03:02\nThe Republican National Committee and Wisconsin Republicans have asked the Supreme Court to freeze a lower court opinion that extends the state's absentee ballot deadline, giving voters an extra six days to submit their ballots from election day to April 13. They say such a measure will threaten the integrity of the contest. Wisconsin has refused to postpone or alter its primary election, which is scheduled for Tuesday, April 7. After resisting any election day change for weeks, the state's Gov. Tony Evers called a special legislative session this weekend in an attempt to change the contest to a vote-by-mail one and delay it until May, but as of now, the vote is still set for tomorrow.\n5. White House\nJUST WATCHED Trump fires Inspector General Michael Atkinson Replay More Videos ... MUST WATCH Trump fires Inspector General Michael Atkinson 02:22\nPresident Trump is catching heat for his recent firing of Intelligence Community Inspector General Michael Atkinson . Atkinson was the one who told Congress about the whistleblower complaint that led to Trump's impeachment. This little detail has led several people, including Atkinson , to suspect that his ousting was politically motivated. Even some Republicans have said Atkinson's firing requires more of an explanation. Trump defended his decision by saying the inspector general \"did a terrible job\" and \"took a fake report and gave it to Congress.\" Atkinson is one of several officials involved in the impeachment trial who have since been removed or reassigned from their posts.\nBREAKFAST BROWSE\nPeople are talking about these. Read up. Join in.\nKobe Bryant headlines the latest NBA Hall of Fame class\nHere's why you should reconsider trying to conceive in quarantine\nLucky, the San Antonio Zoo's oldest elephant, celebrates her birthday\nThese are the long-lost hobbies people are revisiting during stay-at-home orders\nA Florida county is reminding people to keep one alligator's length away from each other\nTODAY'S NUMBER\n$10 million\nThat's how much Oprah is donating to coronavirus relief for Americans, including $1 million to America's Food Fund to alleviate food insecurity.\nTODAY'S QUOTE\n\"I hope in the years to come everyone will be able to take pride in how they responded to this challenge.\"\nQueen Elizabeth II, in a rare televised speech to the nation calling for unity in the coronavirus crisis. Britain's\nTODAY'S WEATHER\nJUST WATCHED Spring snow and heavy rain for California Replay More Videos ... MUST WATCH Spring snow and heavy rain for California 02:00\nAND FINALLY\nA 42,000-piece puzzle in less than 3 minutes\nNot only is it fun to watch this come together, but the completed image is really something we can appreciate right now.", "url": "https://www.cnn.com/2020/04/06/us/five-things-april-6-trnd/index.html"}