{"authors": ["Mallika Kallingal"], "date_download": "2020-05-04 16:15:31", "date_modify": "2020-05-04 16:15:31", "date_publish": "2020-04-03 15:55:04", "description": "Louisville, Kentucky residents who have been in contact with coronavirus patients and refusing to isolate themselves are being made to wear ankle bracelets.", "filename": "2020_04_03_us_kentucky-coro_223331b5db7087bbd9005afb56276a3b_index_1588608931.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403111132-ankle-monitor-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_us_kentucky-coro_223331b5db7087bbd9005afb56276a3b_index_1588608931.html", "title": "Kentucky coronavirus: Some residents are refusing to self-isolate to wear ankle monitors", "title_page": "Kentucky coronavirus: Some residents are refusing to self-isolate to wear ankle monitors - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Kentucky is taking severe measures to ensure residents exposed to the coronavirus stay at home. Louisville residents who have been in contact with coronavirus patients but refuse to isolate themselves are being made to wear ankle bracelets.\nA judge has ordered one resident to stay at home after refusing to self-quarantine. CNN affiliate WDRB reports that the person, identified as D.L. in the court order, is living with \"someone who has tested positive for the illness and another person who is a presumptive case,\" according to an affidavit from Dr. Sarah Moyer, director of the health department.\nHaving been exposed to the highly contagious disease, D.L. was ordered to stay at home last week. But according to family members, D.L. \"leaves the house often.\"\nWhen D.L. didn't respond to the health department's messages, Jefferson Circuit Court Judge Angela Bisig ordered the Department of Corrections to fit D.L. with a global positioning device for the next 14 days. If D.L. leaves the house again, he or she could be criminally charged, WDRB reports.\nD.L. is not the only Louisville resident ordered to wear ankle monitors to contain the spread of the coronavirus. According to WDRB, there are three other known cases so far. Two other people who live in the same home — one who has tested positive, and the other who has not — were ordered to remain in their home last week after both refused to stay isolated.\nRead More", "url": "https://www.cnn.com/2020/04/03/us/kentucky-coronavirus-residents-ankle-monitors-trnd/index.html"}