{"authors": ["Samantha Vinograd"], "date_download": "2020-05-04 16:20:20", "date_modify": "2020-05-04 16:20:20", "date_publish": "2020-04-04 20:02:24", "description": "The Trump administration needs to do what it takes to save lives right now in the Covid-19 pandemic. But it should be aware that the reliance on China comes at great cost, writes Samantha Vinograd.", "filename": "2020_04_04_opinions_preside_508f1d4f76c21f91e540e0089c3c72e9_index_1588609220.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403082550-donald-trump-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_opinions_preside_508f1d4f76c21f91e540e0089c3c72e9_index_1588609220.html", "title": "Trump put American lives in China's hands", "title_page": "Trump put American lives in China's hands (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Samantha Vinograd is a CNN national security analyst. She is a senior adviser at the University of Delaware's Biden Institute, which is not affiliated with the Biden campaign. Vinograd served on President Barack Obama's National Security Council from 2009 to 2013 and at the Treasury Department under President George W. Bush. Follow her @sam_vinograd . The views expressed in this commentary are her own. View more opinion articles on CNN.\nChina: A country that the White House has called a \"strategic competitor\"; a country engaged in active influence operations against us; a country the State Department describes as an authoritarian state that engages in gross human rights abuses; a country that the White House said has \"consistently taken advantage of the US economy\"; a country whose leadership Secretary of State Mike Pompeo described as a \"substantial threat to our health and way of life\"; a country Trump administration officials are blaming for covering up the truth about the coronavirus outbreak.\nChina: The country the United States is relying on to supply equipment to save American lives.\nIn a perverse -- and avoidable -- twist of fate, the country that was arguably responsible for the virus' spread because of its attempts to cover up the initial outbreak is now the one best positioned to profit from its fatal impact.\nThe US intelligence community has warned that China is intent on expanding its global economic reach. Now, as the epicenter of the pandemic has shifted to the United States with more than 300,000 confirmed cases of Covid-19 as of April 4, Trump's lack of preparation has given China an opening to expand that reach quickly.\nThe Trump administration should have had a strategy in place to adequately stockpile and distribute key supplies before the pandemic hit the homeland. It did not.\nTo make matters worse, President Donald Trump hesitated for weeks to use the Defense Production Act , which he finally invoked to help direct materials and other resources to domestic manufacturers to produce ventilators and N95 masks. On Friday, he moved to curtail the export of lifesaving personal protective equipment -- after more than 7,000 Americans already died.\nDespite Trump's latest moves, the United States is still not producing enough equipment to meet the needs of health care workers and the sick.\nThe administration's failure to prepare for the pandemic has left people with no other choice than to find supplies where they can. New York Gov. Andrew Cuomo , who said Saturday that the Chinese government helped facilitate the donation of 1,000 ventilators to the state, already ordered 17,000 ventilators from China. Meanwhile, private citizens such as Patriots owner Robert Kraft have desperately sourced masks from China.\nChina's top medical device maker said that the demand for ventilators, for example, is now 10 times higher than what's available at hospitals globally. While data from Chinese sources is far from reliable, a Chinese government official indicated that China has 21 invasive ventilator makers and that Chinese manufacturers have orders for 20,000 ventilators from abroad. At this rate, orders for Chinese products will continue to surge.\nChina is cashing in on a crisis they played a large part in creating.\nThis is both a boon to China's economy and a great propaganda point for the Chinese Communist Party. Their disinformation attacks of late have tried to paint the Party as a global leader when it comes to crisis response, despite the fact it is directly responsible for suppressing information about the outbreak, which allowed the coronavirus to spread for weeks.\nWhile the United States is struggling to contain the virus, treat those who have been infected and get enough medical supplies, China, claiming to be \"post-virus,\" is manufacturing supplies at a rate we can't. After months of lockdowns, China can start to bounce back by filling the economic void while we scramble just to contain the virus. They have a strategy -- and we don't.\nThey also have more foreign policy leverage now than any time in recent history.\nWe've already seen this play out. The war of words between US officials and the Chinese has quieted down in the past few days. Pompeo has rightfully called out the Chinese for their culpability in this crisis. But his -- and the President's -- insistence on referring to the virus as the \"Chinese virus\" or \"Wuhan virus\" was a misfire on multiple fronts.\nNot only because it may have unnecessarily fueled racist attacks against Asian-Americans, it also sent mixed messages to the rest of the world, especially since Trump praised China's efforts to contain the virus back in January. To top it off, US insistence on calling it the \"Wuhan virus\" in a G7 statement -- which other members wouldn't agree to -- meant that the G7 put out no statement at all. We fractured the group at a time when unity is sorely needed.\nNow, with American lives depending on the Chinese Communist Party agreeing to export medical supplies to the United States, the war of words has cooled . We don't know what China may have eked out of the Trump administration in return. But what's clear is that China knows the Trump administration has a critical interest in saving American lives -- and that the United States needs to keep the Communist Party happy to fulfill that objective.\nBecause the CCP has a finger in the Chinese economy, it has the ability to manipulate trade and manufacturing to serve state needs.\nWe've seen this play out in the past during the trade war when the government engaged in retaliatory measures such as unnecessary government inspections and slower customs clearance against US companies operating in China, for example. The same applies during the pandemic -- China has the ability to cut off or slow the export of supplies from China that American lives depend on. They have us over a barrel.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nWe are not the only country in this position . China has the upper hand as countries scramble to fight the pandemic. Meanwhile, the CCP is trying to do abroad what it does at home -- sell a false narrative. They're using all the tools at their disposal to spread disinformation about their role in addressing the virus, its origin and more.\nThe Trump administration and other officials need to do what it takes to save lives right now. But it should be aware that the reliance on China comes at great cost.\nThe terrible reality is that the administration has put American lives in Chinese hands.", "url": "https://www.cnn.com/2020/04/04/opinions/presidential-weekly-briefing-trump-american-lives-china-vinograd/index.html"}