{"authors": ["Reporter"], "date_download": "2020-05-04 21:06:09", "date_modify": "2020-05-04 21:06:09", "date_publish": "2020-04-30 16:40:33", "description": "The lawsuit claims the New York governor is the only state governor not providing an ASL interpreter during his highly watched daily COVID-19 updates.", "filename": "entry_cuomo-coronavirus-press-briefings-sign-language-interpretation_n_5eaae870c5b633a854469b5f_1588626369.html", "image_url": "https://img.huffingtonpost.com/asset/5eaaf3ee300000d112155343.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_cuomo-coronavirus-press-briefings-sign-language-interpretation_n_5eaae870c5b633a854469b5f_1588626369.html", "title": "Deaf New Yorkers Sue Cuomo For Not Providing Sign Language Interpreter At Daily Briefings", "title_page": "Deaf New Yorkers Sue Cuomo For Not Providing Sign Language Interpreter At Daily Briefings | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "New York Gov. Andrew Cuomo (D) is excluding deaf New Yorkers from his daily coronavirus press conferences, a new lawsuit from disability rights advocates alleges, urging the governor to provide an American Sign Language interpreter.\nThe lawsuit was filed Wednesday by Disability Rights New York on behalf of four New York residents who are deaf. It claims that Cuomo is the only state governor not providing an ASL interpreter during his highly watched daily briefings.\n“It is inexplicable that during this pandemic, the Governor would choose not to have ASL interpreters at his daily live televised briefings. As a result, deaf New Yorkers are unable to obtain vital life and death information at the time they need it most,” Timothy A. Clune, executive director of Disability Rights New York, said in a statement accompanying the lawsuit.\nMore than 3.4 million Americans identify as deaf, and about 17 million report having “serious difficulty hearing,” according to a 2014 Census survey of Americans with disabilities. At least 200,000 residents of New York City, the epicenter of the global pandemic, are deaf or hard of hearing.\nIn its lawsuit, Disability Rights New York said it has received “a large number of complaints from deaf New Yorkers who are unable to understand Governor Cuomo’s daily briefings due to the lack of in frame televised ASL interpretation.”\nIn response to the group’s complaints, Cuomo’s office said an ASL version of each day’s briefing is available on Cuomo’s website. However, the lawsuit points out that this option is not available to people who don’t have internet access. Closed captioning, which is required by federal law, is also an insufficient alternative because it can be slow and inaccurate in real time, or if the person’s first language is not English.\nSeveral of the plaintiffs represented by the lawsuit cited some of these difficulties. One of them, Dennis Martinez, works as an advocate for deaf residents of New York City’s Harlem neighborhood.\n“Deaf community members have contacted Mr. Martinez asking for information about what Governor Cuomo said during his press briefings,” the lawsuit read. “Mr. Martinez is unable to answer community questions about Governor Cuomo’s briefings because he does not have access to the information himself. Mr. Martinez has to seek out videos on social media platforms with ASL interpretation of the information covered by Governor Cuomo, thereby delaying timely access to information.”\nAnother plaintiff, James Hallenbeck, did not know of Cuomo’s stay-at-home order until Hallenbeck’s brother called him, according to the lawsuit.\nPlaintiff Jill Wildberger, who also has a learning disability, said she was not aware of Cuomo’s executive order earlier this month requiring New York residents to wear face masks, citing her difficulty following the closed captioning.\nDisability rights advocates have also criticized the White House, whose coronavirus briefings have also not included an ASL interpreter, CNN reported last week.\nIn a letter to the White House last month, the National Association of the Deaf said it “has received daily complaints from deaf and hard of hearing citizens across the country asking why their President is not ensuring they are getting the same access to emergency information as everyone else.”\nAs of this week, the White House has yet to provide an ASL interpreter at the briefings, which have been curtailed due to President Donald Trump’s tendency to turn the briefings into his own airing of grievances and provide false and misleading information.", "url": "https://www.huffpost.com/entry/cuomo-coronavirus-press-briefings-sign-language-interpretation_n_5eaae870c5b633a854469b5f"}