{"authors": ["Daniel Burke", "Cnn Religion Editor"], "date_download": "2020-05-04 16:59:31", "date_modify": "2020-05-04 16:59:31", "date_publish": "2020-04-08 10:56:18", "description": "This year many Jews are lamenting the loss of one of Passover's greatest pleasures -- the gathering of family generations under the same roof, at the same table.", "filename": "2020_04_08_world_passover-2020-coronavirus-real-plague_index_1588611571.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407135610-01-passover-2020-coronavirus-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_world_passover-2020-coronavirus-real-plague_index_1588611571.html", "title": "Passover 2020: This year, the plague is real", "title_page": "Passover 2020: This year, the plague is real - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Millions of Jews gather at Passover to remember their Hebrew forbears' exodus from Egypt, where they escaped thanks to 10 divinely sent plagues.\nAs the coronavirus pandemic sweeps across the globe, some of the parallels are hard to miss.\n\"The plagues are a central part of the Seder experience,\" says Rabbi Elana Friedman, the chaplain of Jewish life at Duke University. \"This year it feels like we have an 11th plague circling us.\"\nPassover is a celebratory affair, with friends and family gathering in homes, crowding around tables, feasting on food and good conversation. It's by far the most-celebrated holiday of American Jewish life, with 70% saying they participate in seders each year\nBut the holiday, which begins Wednesday evening and lasts for 8 days, will look quite different this year.\nWhat you need to know about Passover\nWhat you need to know about Passover 01:07\nWhat you need to know about Passover\nPre-Passover gatherings at synagogues have been canceled. Social distancing and travel restrictions put in place to stop the spread of the virus prohibit that large home gatherings. Multiple trips to the supermarket for horseradish and bitter herbs are out. The cottage industry created by Passover travel has been decimated.\nMost importantly, many Jews are lamenting the loss of one of Passover's greatest pleasures -- the gathering of family generations under the same roof, at the same table.\n\"The inability to spend Passover with their grandparents has been really difficult for a lot of students, and they are mourning the loss of that,\" says Friedman. \"At the same time, they realize the risks and that it's not safe for us all to celebrate the holiday together.\"\nMany Jews are hosting virtual seders\nNow, as young couples prepare to host their first seders, rabbis are sending encouragement and tips over text. Some elderly Jews may spend Passover alone, their first without family in decades. And some families who span generations -- from bubbes to babies -- will have to meet via technology or not at all.\nJews from more liberal traditions have already prepared to host virtual seders on websites like OneTable , a nonprofit that connects Jews for communal gatherings on Shabbat and holy days.\nRabbi Mitchell Wohlberg of Beth Tfiloh in Baltimore waves to members of his congregation before giving instruction on how to conduct Passover rituals and seders during a \"Lunch and Learn\" online conference session from his home study on March 26, 2020.\nThe website will host online 800 seders this year, said CEO and founder Aliza Kline, up from 200 last year. A few of the seders posted thus far: The Seder-in-Place, Sederstream, Pandemic Passover, May the Plague Passover Us, and, poignantly, the Orphan Seder.\nKline says her own parents, both in their 80s, live just four blocks away in New York City. This Passover they will stay four blocks away.\n\"My dad taught me how to make matzoh. Now thousands of people are going to learn to make matzoh on their own,\" she says. \"There's something really beautiful about that.\"\nAn old ritual is taking on a new importance\nRabbi Rick Jacobs, president of the Union for Reform Judaism, says this will be the first year his family will be separated for Passover. One of his three children will stay where he lives in Washington, DC, rather than travel to New York City.\n\"We've had all kinds of Passovers over the years, but we haven't had a Passover without our kids,\" Jacobs says. \"I already miss having everyone around the table.\"\nCaterer Aliza Grayevsky Somekh, right, and her husband Nadav Somekh prepare vegetables for takeaway Seder plates in the kitchen at Temple Beth Abraham in Oakland, California, on April 2, 2020.\nJacobs says he's hosting a seder on Zoom on Wednesday, when he expects 35 or so people to log on.\nGuests will notice that Jacbos has adapted aspects of Passover rituals to address the current pandemic. One often overlooked part of the seder, the rabbi said, is the ritual washing of hands.\nThis year, Jacobs will ask everyone on the Zoom seder not to just symbolically wash their hands but to do it for real, for 20 seconds, as health officials have advised to prevent contagion.\n\"Washing our hands is the saving of lives, not just our own but the people's around us,\" Jacobs says.\nSome traditions are being adapted or scuttled\nThis year there are Haggadot -- prayer books that guide the seder -- for nearly every situation, including one called \" The Four Children and Covid-19 ,\" which replaces questions about Jewish history traditionally asked by children at seders with contemporary ones.\nAnother text, \" Ideas for the Solo Seder ,\" recognizes that many Jews might be celebrating their first Passover alone this year.\n\"The right Seder for you this year might involve matzoh and cream cheese, a good book, and sleep,\" it says. \"That might be all you're up for, and that is totally okay.\"\nEven traditionalist streams of Judaism have been more lenient this year, Jewish experts say. For example, some rabbis have advised that households don't need to burn all the leavened bread before Passover this year, is the usual custom\n\"They can throw it in the trash ... [in] as dignified a way as possible,\" says Rabbi Yaakov Glasser, dean of the Center for Jewish Future at Yeshiva University in New York.\nIn a just-for-this-year exception , the Conservative Jewish movement's Rabbinical Assembly said streaming seders online is acceptable.\nOther rabbis have counseled Jews to buy much of the traditional food online to limit trips to the market. In fact, Orthodox rabbis have banned all travel, including visits to family in the same city.\nMatzoh ball soup is a staple of many seder dinners.\nGlasser says Orthodox rabbis realize some Jews might feel celebrating Passover alone, but that videoconferencing on a holy day is not permitted. Instead, rabbis have encouraged scattered families to gather online before Passover begins Wednesday evening and to make other accommodations for those for whom isolation presents challenges to their mental health.\nThe Chabad movement of Hasidic Jews has likewise barred videoconferencing on Passover, says spokesman Motti Seligson.\nInstead the organization is encouraging Jews to \"be their own Moses\" and lead seders at home. To that end, Chabad has sent some 250,000 Seder-to-go kits to Jews across the country.\n\"A seder is not a screen-based experience,\" Seligson says. \"It's interactive. You go through the steps of the seder and you smell and touch and feel. You talk to the people around the table. That's something we have done for thousands of years. And we're going to do that this year, too.\"", "url": "https://www.cnn.com/2020/04/08/world/passover-2020-coronavirus-real-plague/index.html"}