{"authors": ["Tom Davies"], "date_download": "2020-05-04 21:07:09", "date_modify": "2020-05-04 21:07:09", "date_publish": "2020-04-16 15:40:23", "description": "INDIANAPOLIS (AP) — Indiana’s number of coronavirus-related deaths in one month has tripled the state’s typical level of flu deaths over a seven-month period. Gov. Eric Holcomb said Thursday he...", "filename": "_64f92a74e8cba886361fcf48d5709b85_1588626429.html", "image_url": "https://storage.googleapis.com/afs-prod/media/a73b3aab5e3f43adafbb65bdcb943a91/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_64f92a74e8cba886361fcf48d5709b85_1588626429.html", "title": "Indiana virus deaths near 500 as job losses keep rising", "title_page": "Indiana virus deaths near 500 as job losses keep rising", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "An empty parking lot is seen at retail stores are closed, Wednesday, April 15, 2020, in Whitestown, Ind. Evidence of the devastating impact of the coronavirus on the U.S. economy has been steadily emerging, and the evidence is ominous. Sales at retail stores and restaurants plunged in March by the most on records dating back almost 30 years.(AP Photo/Darron Cummings)\nAn empty parking lot is seen at retail stores are closed, Wednesday, April 15, 2020, in Whitestown, Ind. Evidence of the devastating impact of the coronavirus on the U.S. economy has been steadily emerging, and the evidence is ominous. Sales at retail stores and restaurants plunged in March by the most on records dating back almost 30 years.(AP Photo/Darron Cummings)\nINDIANAPOLIS (AP) — Indiana’s number of coronavirus-related deaths in one month has tripled the state’s typical level of flu deaths over a seven-month period. Gov. Eric Holcomb said Thursday he was working with other Midwestern states on how to loosen business and travel restrictions as than 100,000 people filed new unemployment claims in Indiana last week amid the ongoing economic fallout.\nVIRUS DEATHS GROW\nThe Indiana State Department of Health on Thursday reported 41 additional COVID-19 deaths, raising the state’s death toll to at least 477 people. The newly recorded deaths occurred between April 2 and Wednesday.\nThe first reported death in Indiana happened March 15, with more than three-quarters of the deaths occurring in the past two weeks. Indiana has averaged about 150 flu deaths over a seven-month period in recent years, according to Dr. Kristina Box, the state health commissioner.\nThe health department also reported 611 new COVID-19 infections Thursday, giving Indiana more than 9,500 cases even though testing has been largely limited to those seriously ill and health care workers.\nMIDWEST PACT\nHolcomb and six other governors announced Thursday they planned to coordinate on reopening their state economies after weeks of coronavirus restrictions.\nHolcomb described the pact with Illinois, Ohio, Michigan, Kentucky, Wisconsin and Minnesota as a way of making sure all the state leaders know about the actions each other are taking.\nHolcomb said he spoke Thursday with Ohio Gov. Mike DeWine about loosening business and travel restrictions but that he believed the coming days were important to make sure a surge in coronavirus cases doesn’t happen.\n“We’re both thinking about May. I’m not being date specific,” Holcomb said. “I’m going to be looking at the numbers.”\nIndiana has had a stay-at-home order in place since March 25 and Holcomb could announce Friday whether he’ll extend or modify that order.\nUNEMPLOYMENT JUMPS\nThe number of people who have lost jobs in Indiana during the coronavirus outbreak has grown to at least 444,000, according to federal statistics released Thursday.\nIndiana had some 118,000 initial claims for unemployment benefits filed last week. That was down slightly from the 127,000 filed a week earlier but still far beyond the previous record levels seen during the recession in 2009.\nIndiana’s jobless claims have soared along with rest of the country over the past four weeks as many retailers, hotels, factories and other businesses closed amid restrictions aimed at slowing the spread of COVID-19 illnesses. The state was typically receiving fewer than 3,000 new unemployment claims a week before that.\nPRIMARY ELECTION CHANGES\nState Republican and Democratic leaders have agreed to shorten the time for early in-person voting ahead of the June 2 primary election from the normal 28 days to one week.\nSecretary of State Connie Lawson, a Republican, said election officials still plan to have polling sites open on primary day but that the state election commission will vote Friday on a plan for giving county officials more flexibility for designating voting locations.\nThe election commission voted last month to delay the primary from its original May 5 date and allow any voter to cast a mail-in ballot without having to meet an excuse required under state law.\nLawson said the state couldn’t afford to follow the move by Indianapolis officials to mail an absentee ballot application to all voters. She said she encouraged people to vote by mail but that many people feel strongly about casting their ballots in person so she wanted to keep early voting sites open starting May 26.\n“Hopefully that will spread the number of people in any one location out so that there won’t be close contact with poll workers and election workers and the voters at the same time,” Lawson said.", "url": "https://apnews.com/64f92a74e8cba886361fcf48d5709b85"}