{"authors": ["Kate Brumback"], "date_download": "2020-05-04 20:20:17", "date_modify": "2020-05-04 20:20:17", "date_publish": "2020-04-08 18:53:44", "description": "ATLANTA (AP) — By requiring Georgia voters to provide their own stamps for mail-in ballots, the state is effectively imposing a poll tax that is an unconstitutional barrier to the right to vote,...", "filename": "_3c7307b65d63c656d0b56ce3f836baf4_1588623617.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ccbd47203edb4e468a420e35c2cf359d/2738.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3c7307b65d63c656d0b56ce3f836baf4_1588623617.html", "title": "Lawsuit: Georgia mail-in ballot postage is unconstitutional", "title_page": "Lawsuit: Georgia mail-in ballot postage is unconstitutional", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this April 6, 2020 file photo Georgia Secretary of State Brad Raffensperger speaks during a news conference at Liberty Plaza in downtown Atlanta. By requiring Georgia voters to provide their own stamps for mail-in ballots, the state is effectively imposing a poll tax that is an unconstitutional barrier to the right to vote, according to a federal lawsuit filed Wednesday, April 8, 2020. (Alyssa Pointer/Atlanta Journal-Constitution via AP)\nFILE - In this April 6, 2020 file photo Georgia Secretary of State Brad Raffensperger speaks during a news conference at Liberty Plaza in downtown Atlanta. By requiring Georgia voters to provide their own stamps for mail-in ballots, the state is effectively imposing a poll tax that is an unconstitutional barrier to the right to vote, according to a federal lawsuit filed Wednesday, April 8, 2020. (Alyssa Pointer/Atlanta Journal-Constitution via AP)\nATLANTA (AP) — By requiring Georgia voters to provide their own stamps for mail-in ballots, the state is effectively imposing a poll tax that is an unconstitutional barrier to the right to vote, according to a federal lawsuit filed Wednesday.\nCiting the continuing spread of the coronavirus , Secretary of State Brad Raffensperger encouraged people to vote by mail in the May 19 primary election. Election officials are mailing a form that can be used to request an absentee ballot to all 6.9 million active registered voters. Voters can return the ballot application and the ballot by mail, avoiding an in-person trip to the polls and potential exposure to the virus.\nThe lawsuit filed by the American Civil Liberties Union and its Georgia chapter on behalf of an individual voter and Black Votes Matter Fund, an organization that seeks to empower communities of color, asks a judge to order election officials to provide envelopes with prepaid postage to return mail-in ballots and ballot applications.\nThe U.S. Constitution bans the imposition of a poll tax, the lawsuit says.\n“Georgia election officials require voters to use their own postage when submitting mail-in absentee ballots and applications. Postage costs money. Thus, Defendants have imposed a poll tax in violation of the Constitution,” the suit says.\nRepresentatives for Raffensperger, who’s a defendant in the lawsuit, did not immediately have a comment Wednesday.\nGeorgia voters will still be able to vote in person, either during early voting or on Election Day, but “the ‘option’ of voting in-person does not really exist because of the pandemic,” the lawsuit says, adding that in-person voting is also nearly impossible for some elderly or disabled voters.\nMany voters may be unfazed by the cost of a stamp and may already have stamps on hand or be able to order them easily online, the lawsuit says. But some don’t have internet access or credit cards to buy stamps online and can’t get to the post office or don’t want to go there and risk exposure to virus, the suit says.\n“This case is about marginalized voters who come from communities who have historically faced over a century of racist voter suppression, including the use of poll taxes to disenfranchise voters, and who rightfully refuse to pay another cent for the right to vote,” the lawsuit says.\nIf absentee ballots are mailed without sufficient postage, the U.S. Postal Service has a policy of not delaying their return to election officials, spokeswoman Martha Johnson said in an email. If the missing postage isn’t caught when the ballot is mailed, the postal service charges local election officials for the postage due, she said.\n“The Postal Service is steadfast in our commitment to support democracy,” Johnson wrote. “We will not deny a voter their right to vote by delaying a time sensitive ballot because of insufficient postage.”\nGeorgia’s presidential primary elections were originally scheduled for March 24. Noting the spread of the virus, Raffensperger in mid-March announced that they would be postponed until May 19 , when other elections were already set to be held.\nSome have called for the elections to be further delayed as the number of coronavirus cases in Georgia continues to rise, but Raffensperger has so far held firm on the May date.", "url": "https://apnews.com/3c7307b65d63c656d0b56ce3f836baf4"}