{"authors": ["Alicia Lee"], "date_download": "2020-05-04 16:21:20", "date_modify": "2020-05-04 16:21:20", "date_publish": "2020-04-05 22:09:54", "description": "With their birthday parties canceled because of the coronavirus, 5-year-old Jaxon Zawacki and his younger sister, Croix, went about their day as usual. But then they heard sirens on their street, so they raced outside and were greeted with something that made their birthday unforgettable.", "filename": "2020_04_05_us_coronavirus-b_0204e0b005e38019fe3112be78e18eda_index_1588609280.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405153804-02-coronavirus-wisconsin-birthday-fire-trucks-police-trnd-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_us_coronavirus-b_0204e0b005e38019fe3112be78e18eda_index_1588609280.html", "title": "First responders throw a personal parade for kids whose birthday parties were canceled due to coronavirus", "title_page": "First responders throw a personal parade for kids whose birthday parties were canceled due to coronavirus  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) With their birthday parties canceled because of the coronavirus, 5-year-old Jaxon Zawacki and his younger sister, Croix, went about their day as usual. But then they heard sirens on their street, so they raced outside and were greeted with something that made their birthday unforgettable.\nAs Jaxon, Croix and their parents stood in front of their home in Osseo, Wisconsin, a parade of four firetrucks, two ambulances and two police cars flashed their lights and sounded their sirens as they drove by. One fireman got out of his truck to drop off some plastic firefighter hats and stickers.\nFor Jaxon, who has always loved firetrucks and police cars, the personal parade was more than he could ever ask for.\n\"It made it the best birthday ever,\" Jaxon told CNN.\nJaxon Zawacki and his family were treated to their own parade of firetrucks, police cars and ambulances Saturday.\nJaxon's mother, Hailey, knew it was coming because she was the one who made the request. She messaged the Osseo Rural Fire Department on Facebook after seeing the department's post offering the birthday \"drive-by\" service.\nRead More", "url": "https://www.cnn.com/2020/04/05/us/coronavirus-birthday-fire-trucks-police-wisconsin-trnd/index.html"}