{"authors": ["Anthony Izaguirre"], "date_download": "2020-05-04 20:12:16", "date_modify": "2020-05-04 20:12:16", "date_publish": "2020-04-06 20:39:10", "description": "CHARLESTON, W.Va. (AP) — A West Virginia judge in the county with the state's highest coronavirus caseload has approved strapping ankle monitors to people who test positive but refuse to...", "filename": "_6b082395194d53b10629bb9bb3d037a2_1588623136.html", "image_url": "https://storage.googleapis.com/afs-prod/media/604deb2f29ff469ea67e99bb2a6f2e8e/1600.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6b082395194d53b10629bb9bb3d037a2_1588623136.html", "title": "W.Va. judge allows ankle monitors for virus scofflaws", "title_page": "W.Va. judge allows ankle monitors for virus scofflaws", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Phyllis Slay prays in her car during a Palm Sunday parking lot service at Famiily Worship Center in Beckley, W.V., Sunday, April 5, 2020. (Jenny Harnish/The Register-Herald via AP)\nPhyllis Slay prays in her car during a Palm Sunday parking lot service at Famiily Worship Center in Beckley, W.V., Sunday, April 5, 2020. (Jenny Harnish/The Register-Herald via AP)\nCHARLESTON, W.Va. (AP) — A West Virginia judge in the county with the state’s highest coronavirus caseload has approved strapping ankle monitors to people who test positive but refuse to quarantine, officials said Monday.\nThe order allows Kanawha County sheriffs to use the GPS bracelets after a county commissioner said “a few” people with the virus ignored isolation orders.\n“We do not want to use the GPS ankle bracelets to enforce the quarantines, however, if we must we will. This must be taken seriously,” said Kent Carper, president of the Kanawha County Commission.\nThe ruling comes after judges in Kentucky put ankle monitors on at least three people who have flouted quarantine orders after testing positive.\nKanawha County, where the state Capitol is located, was included in a set of executive orders last week from Republican Gov. Jim Justice that tightened existing virus restrictions in six counties that make up 60% of the state’s positive cases.\nThe orders in Berkeley, Jefferson, Morgan, Harrison, Monongalia and Kanawha counties limit gatherings to no more than five people, urge businesses to have employees work from home and direct local health departments to establish maximum occupancy rules for stores. State police will help enforce the county rules.\nThe move intensified previous orders from Justice, who has issued a statewide stay-home order, directed nonessential businesses to close and shuttered schools until at least April 30. The governor has also pushed back the primary election from May 12 to June 9 over fears about the virus spreading at polling places.\nAt least 345 people statewide have the virus after 9,940 tests, health officials said Monday. Kanawha County has the state’s highest number of cases with at least 56 positives.\nThe state reported its fourth virus death on Monday, an 85-year-old Harrison County man with underlying health conditions, according to a health department spokeswoman. Officials have previously said the first three victims were an 88-year-old Marion County woman, a Jackson County resident with several underlying health issues and a 76-year-old man linked to the Sundale nursing home in Morgantown, a particularly hard-hit facility where at least 29 people have tested positive.\nVirus testing remains limited, meaning most people now spreading the highly contagious virus may not know they have been infected, and state health officials have admitted their count lags behind the actual total as results pour in from counties around the state.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks, and the overwhelming majority of people recover. But severe cases can need respirators to survive, and with infections spreading exponentially, hospitals across the country are either bracing for a coming wave of patients, or already struggling to keep up.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/6b082395194d53b10629bb9bb3d037a2"}