{"authors": ["Eliza Mackintosh"], "date_download": "2020-05-04 16:22:17", "date_modify": "2020-05-04 16:22:17", "date_publish": "2020-04-06 11:21:07", "description": "The US Surgeon General has told Americans this week to brace themselves for a \"Pearl Harbor moment,\" even as Trump says he sees \"light at the end of the tunnel.\"", "filename": "2020_04_06_world_coronavirus-newsletter-04-06-20-intl_index_1588609337.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_world_coronavirus-newsletter-04-06-20-intl_index_1588609337.html", "title": "What you need to know about coronavirus on Monday, April 6", "title_page": "What you need to know about coronavirus on Monday, April 6 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story appeared in the April 6 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every weekday\n(CNN) In the span of 40 minutes inside one New York City emergency room, six patients went into cardiac arrest, and four died before they made it out of the ER. There was no time to regroup.\nA hospital worker wrapped the body of a deceased patient. A half hour later, the body was gone, the space sanitized, and another critically ill patient arrived, coughing, with an oxygen mask on his face.\nThis is what coronavirus is doing to thousands of Americans, and likely will to many thousands more, Lauren del Valle and Miguel Marquez write . The US Surgeon General has told Americans this week to brace themselves for a \"Pearl Harbor moment,\" as the national death toll nears 10,000. Still, President Donald Trump says he sees \"light at the end of the tunnel.\"\nAs the US heads towards the peak, Europe's numbers offer some hope . Fatalities and infections seem to be slowing in Italy, Spain and France, among the hardest-hit countries on the continent -- and in the world.", "url": "https://www.cnn.com/2020/04/06/world/coronavirus-newsletter-04-06-20-intl/index.html"}