{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:23:41", "date_modify": "2020-05-04 20:23:41", "date_publish": "2020-04-20 13:28:59", "description": "Boeing said it will put about 27,000 people back to work this week building passenger jets at its Seattle-area plants, with virus-slowing precautions in place, including face masks and staggered...", "filename": "_d6a1d976b15441aa0bffc71df437cfff_1588623821.html", "image_url": "https://storage.googleapis.com/afs-prod/media/0fe65d3837d84b5ab195486a54e34867/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d6a1d976b15441aa0bffc71df437cfff_1588623821.html", "title": "What you need to know today about the virus outbreak", "title_page": "What you need to know today about the virus outbreak", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "What you need to know today about the virus outbreak\nAn elderly woman wearing a mask against the spread of the new coronavirus walks with an umbrella at the San Gregorio Atlapulco market in Mexico City, Monday, April 20, 2020. (AP Photo/Marco Ugarte)\nAn elderly woman wearing a mask against the spread of the new coronavirus walks with an umbrella at the San Gregorio Atlapulco market in Mexico City, Monday, April 20, 2020. (AP Photo/Marco Ugarte)\nBoeing said it will put about 27,000 people back to work this week building passenger jets at its Seattle-area plants, with virus-slowing precautions in place, including face masks and staggered shifts. The modest reopenings come amid protests in some states by people who say it’s time to get back to work.\nBoeing is among a small number of manufacturers around the U.S. that geared up Monday to resume production amid pressure from President Donald Trump to reopen the economy and resistance from governors who warn there is not enough testing yet to keep the new coronavirus from rebounding. Maryland secured 500,000 tests from South Korea after the governor’s Korean American wife negotiated the shipment.\nThe moves are accompanied by signs of economic gloom as oil futures plunged below zero to a historic low. Stocks and Treasury yields also dropped on Wall Street.\nHere are some of AP’s top stories Monday on the world’s coronavirus pandemic. Follow APNews.com/VirusOutbreak for updates through the day and APNews.com/UnderstandingtheOutbreak for stories explaining some of its complexities.\nWHAT’S HAPPENING TODAY:\n— Boeing and a small number of other manufacturers around the U.S. ar e gearing up to resume production this week. Doosan Bobcat, a farm equipment maker and North Dakota’s largest manufacturer, announced the return of about 2,200 workers at three factories around the state.\n— Federal officials said Monday they plan to start tracking and publicly sharing information on infections and deaths in nursing homes, which they are calling the ground zero of the coronavirus crisis. The move to help spot trends about how the virus is spreading comes as critics, industry officials and local leaders call for the federal government to take more aggressive action to track infections and contain outbreaks in the homes.\n— About 200 people rallied in Maine’s capital demanding the state to open back up , despite officials’ insistence on a cautious approach in order to prevent another outbreak. Similar rallies have happened in New Hampshire, Michigan, Ohio and elsewhere in the country. Participants include gun rights activists, opponents of stay-at-home orders and supporters of President Donald Trump.\n— Some big restaurant chains have obtained loans from the government under a small-business relief program, leading business groups to cry foul even though the loans are within the guidelines of the lending program. The Paycheck Protection Program exhausted its $350 billion in funding last week and many small businesses were unable to obtain loans they desperately need to stay afloat.\n— Reports of accidental poisonings from cleaners and disinfectants are up in the U.S. this year, and researchers believe it’s related to the coronavirus epidemic. Such poisonings were up about 20% in the first three months of this year, compared with the same period in 2018 and 2019, according to a report Monday from the Centers for Disease Control and Prevention.\n— The U.S. state of Maryland will be able to test 500,000 more people for COVID-19 thanks to a shipment of tests from South Korea. Gov. Larry Hogan announced Monday that wife Yumi Hogan, who is Korean American, negotiated the shipment with South Korean officials. The Republican governor said Maryland has been doing everything in its power to increase testing capacity.\n___\nWHAT YOU NEED TO KNOW:\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death. The vast majority of people recover.\nHere are the symptoms of the virus compared with the common flu.\nOne of the best ways to prevent spread of the virus is washing your hands with soap and water. The U.S. Centers for Disease Control and Prevention recommends first washing with warm or cold water and then lathering soap for 20 seconds to get it on the backs of hands, between fingers and under fingernails before rinsing off.\nYou should wash your phone, too. Here’s how.\nTRACKING THE VIRUS: Zoom in at the individual county level to access numbers showing the situation where you or loved ones live.\n___\nONE NUMBER:\n— 1,553 : India recorded its biggest single-day spike in coronavirus cases on Monday. The government has eased one of the world’s strictest lockdowns to allow some manufacturing and agricultural activity to resume.\nIN OTHER NEWS:\n— Brad Paisley has been surprising people on video conference calls to share in a virtual happy hour. The country star has already joined a group of elementary school teachers in Illinois, a young man celebrating his 21st birthday and a group of health care workers.\n— COLLEGE SENIORS : The pandemic has forced many of the nearly 2 million people expected to earn U.S. bachelor’s degrees in 2020 into instant “adulting.” Gone are housing, friends and dreams of a graduation ceremony.\n— COLLEGE SPORTS CUTS : College sports programs already are being cut as the pandemic triggers fears of an economic meltdown on campuses around the country.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/d6a1d976b15441aa0bffc71df437cfff"}