{"authors": ["Austen Bundy"], "date_download": "2020-05-04 16:55:54", "date_modify": "2020-05-04 16:55:54", "date_publish": "2020-04-09 04:10:38", "description": "A multi-platform digital fundraiser hauled in more than $1.7 million for Covid-19 relief on Tuesday, World Health Day.", "filename": "2020_04_09_us_home-from-home-charity-livestream-trnd_index_1588611354.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408211404-01-jacksepticeye-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_us_home-from-home-charity-livestream-trnd_index_1588611354.html", "title": "Jacksepticeye helped raise nearly $660,000 in 12 hours for Covid-19 relief efforts", "title_page": "Jacksepticeye helped raise nearly $660,000 in 12 hours for Covid-19 relief efforts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "The #HopeFromHome livestream brought together entertainers, influencers, gamers and other creators across platforms including YouTube, Facebook Twitter and TikTok to benefit three global charities.\nSeán McLoughlin, a London-based Irish YouTube creator and the face behind the Jacksepticeye channel, was YouTube's main organizer of the event on the platform.\nHis near 12-hour livestream Tuesday raised almost $659,000 alone, close to 40% of the global total raised.\n\"Words cannot express how crazy today was,\" McLoughlin wrote in an Instagram post after his stream. \"I am so emotionally overwhelmed but I have nothing but love and gratitude to all of those who donated and made such a huge difference today.\"\nDonations were facilitated by fundraising platform Tiltify and funds will be evenly split across the three charities, United Way Worldwide; the United Nations Foundation's Covid-19 Solidarity Response Fund for the World Health Organization; and Comic Relief US's Red Nose Day, according to an April 1 news release from United Way Worldwide announcing the project.\n\"It was inspiring to see the online community come together for #HopeFromHome,\" Tiltify CEO Michael Wasserman said in a statement Wednesday. \"Yesterday was the highest numbers of unique online donations we have ever seen in 12 hours.\"\nAll three participating charities confirmed to CNN in separate statements that the funds they receive will go towards financial and social services to assist vulnerable populations during the global pandemic. The UN Foundation said some of its funds will also go to the World Health Organization to help develop a vaccine for Covid-19.\n\"As WHO leads the global fight against this disease, we need them to succeed. To see online communities small and large in a surge of commitment yesterday to raise funds for that work is deeply gratifying,\" United Nations Foundation President and CEO, Elizabeth Cousens, said. \"Seán and his many collaborators created a way for people -- some of whom had never donated to anything before -- to join something larger that will ultimately benefit us all.\"\nIn an interview with CNN Wednesday, McLoughlin said he reached out to \"as many creators as I could\" to organize the fundraiser on the online side.\n\"I felt like more money could be raised if we mobilized everybody and all of their communities and all of their audiences and kind of band together under one banner,\" McLoughlin said. \"And then everyone could do their own small streams within that.\"\nHe said the aim of the event was to come together as a global community to fight the virus, making it clear that his significant fundraising numbers should not \"detract from what everybody else is doing... I think the global total is more important than what any individual was doing.\"\n\"I think we always talk about the money that gets raised in these,\" McLoughlin said. \"But I also think that what's really important is the awareness that gets raised around it as well.\"\nMcLoughlin's channel puts on charity livestreams monthly for various causes close to his heart, including a January 2020 stream that raised more than $212,000 for Australian wildfire relief and his April 2019 stream that raised more than $111,000 for Comic Relief U.S.A.'s Red Nose Day.\n\"Sean in particular has been a tremendous ally to the Red Nose Day campaign and we can't thank him enough for mobilizing his network on behalf of those in need,\" Alison Moore, CEO of Comic Relief U.S.A. said in a statement. \"It was incredible to have so many creators and their fans come together around #HopeFromHome in support of children and families suffering from the devastating social, economic and health effects of COVID-19.\"\n\"Amazing things happen when people and communities come together,\" Brian Gallagher, President and CEO of United Way Worldwide, said in a statement. \"I want to thank Seán for bringing his community together to help us fight COVID-19 at this critical time, as well as for the opportunity to join #HopeFromHome personally.\"", "url": "https://www.cnn.com/2020/04/09/us/home-from-home-charity-livestream-trnd/index.html"}