{"authors": ["Reporter", "Labor Reporter"], "date_download": "2020-05-04 20:26:26", "date_modify": "2020-05-04 20:26:26", "date_publish": "2020-04-28 20:36:28", "description": "The order applies to Tyson and other companies that are struggling to operate amid the coronavirus crisis.", "filename": "entry_trump-order-tyson-meatpacking-plants_n_5ea86c77c5b62271082f7e7e_1588623986.html", "image_url": "https://img.huffingtonpost.com/asset/5ea86e0f300000b611155104.jpeg?cache=37rf0r45nm&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_trump-order-tyson-meatpacking-plants_n_5ea86c77c5b62271082f7e7e_1588623986.html", "title": "Trump Orders Meatpacking Plants To Stay Open", "title_page": "Trump Orders Meatpacking Plants To Stay Open | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "President Donald Trump has invoked the Defense Production Act to force meat processing plants operated by Tyson Foods and other major suppliers to stay open even as the coronavirus spreads among workers.\nThe president’s executive order, signed Tuesday evening, hands oversight powers to the Department of Agriculture “to determine the proper nationwide priorities and allocation of all the materials, services, and facilities necessary to ensure the continued supply of meat and poultry.”\nA number of facilities that process beef, chicken and pork products have closed in recent weeks due to the hundreds of workers who have contracted COVID-19. Trump’s order stated that such closures are “undermining critical infrastructure during the national emergency.”\nUnlike some other workplaces, employees at meat processing plants cannot easily observe social distancing guidelines and must stand close to one another. Earlier this month, the now-shuttered Smithfield Foods pork processing plant in Sioux Falls, South Dakota, had at least 600 employees who tested positive for the virus out of a workforce of 3,700.\nCompanies warned this week of a potential meat shortage across the country.\nThe problem, however, is not supply. With distribution to restaurants and schools temporarily suspended, many farmers have a surplus of animals. The trouble lies in transporting them to facilities capable of butchering and packaging them for grocers. With sick workers and closed plants, that becomes a serious challenge.\nSuch disruptions to the nation’s food supply chain have already led farmers to destroy surplus items even while some grocery store shelves sit empty.\nBut Trump’s mandate to keep plants open could end up taking a deadly toll on those who process meat ― a category of essential workers who tend to be people of color or immigrants working for low wages.\nUnder the order, all plants must still follow guidance issued by the Centers for Disease Control and Prevention and the Occupational Safety and Health Administration, but it is unclear how that is to be done.\nWorker safety advocates have been frustrated by the limited supply of personal protective equipment and the dizzying work pace at many plants. In April, the Agriculture Department granted a record number of waivers allowing poultry facilities to increase their line speeds, which can force employees to work even faster without additional staff.\nThe United Food and Commercial Workers union represents the majority of workers in beef and pork facilities and a sizable portion of those in poultry facilities. The union said Tuesday that if Trump wants to order plants to stay open, the White House needs to ramp up COVID-19 testing and require other safety precautions on the processing lines.\nThe union, which has been tracking coronavirus infections and deaths in the industry, said at least 20 meatpacking workers have died and another 5,000 have been hospitalized or shown symptoms of COVID-19 since the pandemic began. By the union’s estimates, at least 22 meatpacking plants have had to close, causing pork production to drop by 25% and beef production by 10%.\n“The reality is that these workers are putting their lives on the line every day to keep our country fed during this deadly outbreak,” Marc Perrone, the union’s president, said in a statement Tuesday. “For the sake of all our families, we must prioritize the safety and security of these workers.”\nSome plants have been struggling to staff their lines due to workers calling in sick. The meatpacking industry is not known for having generous paid leave policies. As HuffPost reported, one large poultry producer told workers they cannot use the paid leave program unless they provide a doctor’s note documenting COVID-19 symptoms, even though many such consultations are happening online during the pandemic.\nThe union said the White House should order meat producers to provide adequate paid leave and protective equipment, while also mandating social distancing measures inside plants. The latter have been instituted in some facilities’ break areas but not necessarily in work areas. Dozens of worker and public health groups recently petitioned the poultry industry to install plastic barriers between workers if they cannot separate them by at least 6 feet.\nAs one poultry worker in Texas recently told HuffPost, her plant is operating just as it did before the pandemic, with workers side by side on the processing line.\nTrump has been criticized for dragging his feet on implementing the Defense Production Act, which gives the government certain powers over domestic manufacturers in the interest of national security. He invoked the act in mid-March to require companies to prioritize orders of emergency supplies of ventilators and personal protective equipment. But the president has refused to use the full power of the act ― which allows the executive branch to essentially take control of supply chains ― to boost supplies of medical equipment.", "url": "https://www.huffpost.com/entry/trump-order-tyson-meatpacking-plants_n_5ea86c77c5b62271082f7e7e"}