{"authors": ["Kent Sepkowitz"], "date_download": "2020-05-04 16:27:21", "date_modify": "2020-05-04 16:27:21", "date_publish": "2020-04-07 17:24:09", "description": "The long-woefully-underfunded Indian Health Service is encountering yet another major challenge: Covid-19 -- or as the Navajo call it Dikos Ntsaaígíí, writes Kent Sepkowitz. The American Indian population has high rates of health problems, like diabetes and heart disease, that are strongly associated with greater risk for Covid-19, and indeed the Navajo Nation has seen a sharp rise in cases.", "filename": "2020_04_07_opinions_native-_bd76aa6af18a8141a5c716a3179c86ef_index_1588609641.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406200410-navajo-nation-2002-file-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_opinions_native-_bd76aa6af18a8141a5c716a3179c86ef_index_1588609641.html", "title": "The risk to Native American nations from Covid-19", "title_page": "The risk to Native American nations from Covid-19 (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Kent Sepkowitz is a CNN medical analyst and a physician and infection control expert at Memorial Sloan Kettering Cancer Center in New York City. The views expressed in this commentary are his own. View more opinion at CNN.\n(CNN) The Indian Health Service, founded 65 years ago and criticized ever since, has encountered yet another major challenge: Covid-19 -- or as the Navajo call it Dikos Ntsaaígíí.\nRecent reports from the Navajo Nation, which straddles Arizona, Utah and New Mexico, have shown a sudden rise in cases , from about 10 people diagnosed two weeks ago to 216 on April 1, including 40 cases added in a single day. The latest tally from the Navajo Department of Health is 354, though the exact number of cases is difficult to determine because of different lines of reporting to state and Navajo health departments.\nUnfortunately, the Navajo Nation experience, thus far, resembles the United States experience throughout the pandemic, one of inadequate testing, short supplies, and insufficient health care capacity.\nAnd the fact that this particular outbreak is occurring in a population already at high risk for poor outcomes, with services distributed across a very wide geographic area, chronic staffing shortages, and a need to compete with larger, more wealthy states and cities for desperately needed supplies and equipment likely will result in many lost lives.", "url": "https://www.cnn.com/2020/04/07/opinions/native-american-nations-risk-from-covid-19-sepkowitz/index.html"}