{"authors": ["Zachary Cohen"], "date_download": "2020-05-04 17:03:42", "date_modify": "2020-05-04 17:03:42", "date_publish": "2020-04-10 22:48:27", "description": "As early indications of China's coronavirus outbreak emerged in late December, the Trump administration notified Congress it would still follow through with its plan to shutter a US Agency for International Development surveillance program tasked with detecting new, potentially dangerous infectious diseases and helping foreign labs stop emerging pandemic threats around the world.", "filename": "2020_04_10_politics_trump-usaid-prevent-program-coronavirus_index_1588611822.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410173338-01-coronavirus-test-tubes-lab-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_trump-usaid-prevent-program-coronavirus_index_1588611822.html", "title": "Trump administration shuttered pandemic monitoring program, then scrambled to extend it", "title_page": "Trump administration shuttered pandemic monitoring program, then scrambled to extend it - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As early indications of China's coronavirus outbreak emerged in late December, the Trump administration notified Congress it would still follow through with its plan to shutter a US Agency for International Development surveillance program tasked with detecting new, potentially dangerous infectious diseases and helping foreign labs stop emerging pandemic threats around the world.\nThe administration ultimately backtracked nearly three months later, granting an emergency six-month extension for the program known as PREDICT on April 1. The extension allowed the US to provide \"emergency support to other countries for outbreak response including technical support for early detection\" of the virus that causes the disease Covid-19, according to a notice posted by University of California-Davis , one of the project's implementing partners.\nBut by that time, the coronavirus outbreak had already been declared as a global pandemic by the World Health Organization and had claimed the lives of more than 4,300 people in the US.\nSpillover\nThe administration planned to launch a successor project for PREDICT sometime in 2020 but did not appear to have an interim plan until that happened.\nThe PREDICT program's cancellation and the subsequent scramble to secure an emergency extension reflects the Trump administration's broader pattern of dismantling or downsizing key offices and programs focused on protecting the US from a pandemic, despite multiple warnings in recent years about the need to prepare for such an event.\nIt is also indicative of the Trump administration's seeming lack of urgency in the months leading up to the coronavirus outbreak in the US, even as the disease was beginning to ravage countries overseas.\nThe PREDICT program was launched in 2009 and is tasked with monitoring zoonotic infectious diseases -- those that normally exist in animals but can jump to humans -- in an effort to help stop pandemics before they emerge. Nearly 75% of all new, emerging or re-emerging diseases affecting humans at the beginning of the 21st Century are zoonotic, according to USAID.\nWhile there is still some disagreement among scientists regarding the exact origins of coronavirus, researchers agree that it was the result of \"zoonotic spillover,\" exactly the type of virus the PREDICT program was tasked with monitoring.\nSen. Angus King, an Independent from Maine, wrote to USAID in late November to express concerns over the plan to end the PREDICT surveillance program, which was written before the US had clear information related to the emerging coronavirus outbreak in China.\n\"The work that these projects do may help our country and our world to avoid future catastrophic epidemic and pandemic events akin to Ebola and HIV,\" King said in the letter.\nUSAID officials responded on December 31 to inform King that PREDICT would not be renewed after it expired in March 2020, despite concerns raised by the Maine Independent that canceling it before a replacement program was up and running could hinder the US ability to track possible pandemics.\n\"As planned, PREDICT is scheduled to end in March 2020 following the expiration of its second, five-year period of performance. While PREDICT is closing, the Bureau for Global Health at USAID is planning a successor project, which we intend to award through a competitive procurement process in 2020,\" wrote Richard Parker, assistant administrator for the Bureau of Legislative and Public Affairs, according to a copy of the letter obtained by CNN.\n\"The new program will seek to continue our investments in this critical area, by focusing on mitigating risks associated with the spillover of emerging viruses from animals, based on a more-informed understanding of what is needed at the country level to address these risks,\" he added.\nThe letter is dated on the same day that China reported its first cases of an unknown virus to the World Health Organization, marking the first public acknowledgment of the coronavirus outbreak in the Wuhan region.\n'Great ironies'\nIn an interview on Tuesday, King called the administration's December response \"one of the great ironies,\" given how rapidly the outbreak has spread in the months since and President Donald Trump's initial comments downplaying the situation in China earlier this year.\nCNN previously reported that two top administration officials last year listed the threat of a pandemic as an issue that greatly worried them, undercutting Trump's repeated claims that the pandemic was an unforeseen problem.\nHealth and Human Services Secretary Alex Azar and Tim Morrison, then a special assistant to the President and senior director for weapons of mass destruction and biodefense on the National Security Council, made the comments at the BioDefense Summit in April 2019.\n\"Of course, the thing that people ask: 'What keeps you most up at night in the biodefense world?' Pandemic flu, of course. I think everyone in this room probably shares that concern,\" Azar said, before listing efforts to mitigate the impact of flu outbreaks.\nTechnically, PREDICT ended in September, two months prior to King's letter to USAID after its second, five-year contract expired, but was given a \"no cost extension\" so implementing partners could allow some core staff to finish work that was still in progress, according to Christine Kreuder Johnson of UC Davis One Health Institute.\n\"We just had a few things that were remaining to do both on the in country side as well as on the global side. That's what carried us through this whole year,\" she said, referring to the initial no-cost extension.\nBut the situation changed in January once the scale of the outbreak became clearer.\nPREDICT staff were deployed to several countries almost immediately to provide technical assistance with testing and additional supplies as needed.\nFor months, those efforts were funded by a limited pool of funds the program had left over from the previous year, as USAID worked to secure an emergency extension, Johnson told CNN.\nThat extension came more than two months after the first case of coronavirus was confirmed on US soil. USAID announced on March 31 that a $2.26 million extension had been granted for the program and would take effect on April 1.\n\"With the $2.26 million extension, the PREDICT project will continue to provide technical expertise to support detection of SARS CoV-2 cases in Africa, Asia and the Middle East to inform the public health response. The project will also investigate the animal source or sources of SARS CoV-2 using data and samples collected over the past 10 years in Asia and Southeast Asia,\" the UC Davis notice posted on March 31 said.\n'All hands on deck'\nStill, the future of the program remains unclear once the six-month extension expires. While Johnson says PREDICT implementing partners plan to apply for the new contract award when the competition opens this spring, details about the new program remain murky. A USAID spokesperson emphasized that it will \"build on the lessons learned and data gathered\" during PREDICT's 10-year run.\n\"USAID is currently developing the STOP Spillover Project that will focus on strengthening national capacity to develop, test and implement interventions to reduce the risk of the spillover, amplification, and spread of zoonotic pathogens in animal and human populations,\" they told CNN.\nJohnson told CNN that implementing partners are already communicating with other colleagues who work in the same field, as the current situation will require \"all hands on deck,\" regardless of who is awarded the next contract.\nBut she also acknowledged that there will likely be inevitable challenges going forward.\n\"The kind of work that we're doing requires a lot of forward thinking on the preparedness front in between epidemics. It's always really easy after a huge epidemic to get Congress and other funding mechanisms behind public health, but what happens in terms of these emerging zoonotic diseases, which is the wildlife health sector, needs to be strengthened,\" she said.", "url": "https://www.cnn.com/2020/04/10/politics/trump-usaid-prevent-program-coronavirus/index.html"}