{"authors": [], "date_download": "2020-05-04 20:31:24", "date_modify": "2020-05-04 20:31:24", "date_publish": "2020-04-05 20:58:10", "description": "OLYMPIA, Wash. (AP) — Washington Gov. Jay Inslee said Sunday that the state will return more than 400 ventilators of the 500 it has received from the federal government so they can go to New York...", "filename": "_853dcf44c20d9183f71b6c6ad5443a60_1588624284.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ab42555f7ec44317a01542be995a1038/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_853dcf44c20d9183f71b6c6ad5443a60_1588624284.html", "title": "Washington state returns ventilators for use in New York", "title_page": "Washington state returns ventilators for use in New York ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Soldiers walk through a treatment area following a training session at the site of a military field hospital, Sunday, April 5, 2020, at the CenturyLink Field Event Center in Seattle. Officials said the facility, which will be used for people with medical issues that are not related to the coronavirus outbreak, has more than 200 beds and is ready to receive patients. (AP Photo/Ted S. Warren)\nSoldiers walk through a treatment area following a training session at the site of a military field hospital, Sunday, April 5, 2020, at the CenturyLink Field Event Center in Seattle. Officials said the facility, which will be used for people with medical issues that are not related to the coronavirus outbreak, has more than 200 beds and is ready to receive patients. (AP Photo/Ted S. Warren)\nOLYMPIA, Wash. (AP) — Washington Gov. Jay Inslee said Sunday that the state will return more than 400 ventilators of the 500 it has received from the federal government so they can go to New York and other states hit harder by the coronavirus.\nThe Democratic governor said Sunday that his statewide stay-at-home order and weeks of social distancing have led to slower rates of infections and deaths in Washington.\nWashington state has 7,666 confirmed cases of the virus and 322 deaths, according to a Johns Hopkins University tally on Sunday afternoon. New York has more than 122,000 confirmed cases and more than 4,000 deaths .\nWashington received 500 ventilators last month from the Strategic National Stockpile.\n“I’ve said many times over the last few weeks: We are in this together,” Inslee said. “This should guide all of our actions at an individual and state level in the coming days and weeks.”\nRetired Vice Adm. Raquel Bono, director of the state’s COVID-19 Health System Response Management, said mitigation efforts put in place by Inslee resulted in fewer infections in communities.\n“Our current status allows us to help others who have a more immediate need,” Bono said.\nOfficials said the ventilators are not powerful enough to treat coronavirus patients, but they can be used for other patients to free up stronger ventilators.\nOfficials said residents need to continue to stay home, wash hands and maintain social distancing to make sure Washington’s success in fighting the virus continues.\n“We are especially concerned that physical distancing outside the Puget Sound needs to improve to sustain our gains as more cases are diagnosed across the state,” Inslee said.\nThe coronavirus mainly is spread through coughs and sneezes. For most people, it causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.", "url": "https://apnews.com/853dcf44c20d9183f71b6c6ad5443a60"}