{"authors": ["Ilan Ben Zion"], "date_download": "2020-05-04 20:18:51", "date_modify": "2020-05-04 20:18:51", "date_publish": "2020-04-06 19:35:36", "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu announced Monday a complete lockdown over the upcoming Passover holiday to control the country's coronavirus outbreak, but offered...", "filename": "_262adb646d8515f2ec987228c317c064_1588623531.html", "image_url": "https://storage.googleapis.com/afs-prod/media/3171135675a147428d196a2a34ac8d12/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_262adb646d8515f2ec987228c317c064_1588623531.html", "title": "Israeli leader announces lockdown over Passover holiday", "title_page": "Israeli leader announces lockdown over Passover holiday", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A woman is reflected on a bus station as she wears a protective face mask amid concerns over the country's coronavirus outbreak, in Tel Aviv, Israel, Monday, April 6, 2020. (AP Photo/Oded Balilty)\nA woman is reflected on a bus station as she wears a protective face mask amid concerns over the country's coronavirus outbreak, in Tel Aviv, Israel, Monday, April 6, 2020. (AP Photo/Oded Balilty)\nJERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu announced Monday a complete lockdown over the upcoming Passover holiday to control the country’s coronavirus outbreak, but offered citizens some hope by saying he expects to lift widespread restrictions after the week-long festival.\nNetanyahu’s announcement came as leaders of the Coptic Orthodox Church in neighboring Egypt said they were suspending Easter celebrations because of the coronavirus.\nIsrael has already greatly restricted movement to help slow the outbreak, allowing people to leave their homes to buy food or other essential activities.\nIn a nationally televised address, Netanyahu said the government was further restricting movement for Passover, which begins Wednesday evening with a festive meal known as the “Seder.”\n“Every family will sit down for Seder night on its own. Celebrate only with the immediate family that’s at home with you now,” he said.\nBeginning Tuesday afternoon, Israel will ban movement between cities. From Wednesday evening until Thursday morning, Israelis will not be allowed to leave their homes.\nNetanyahu said similar travel restrictions would be in place for the upcoming holidays of Easter and Ramadan later in April.\nAt the same time, he said “there are positive signs on the horizon” and that preparations were already underway for a possible easing of movement restrictions after Passover.\nIsrael has reported nearly 9,000 cases of coronavirus and 57 deaths.\nFor most people, the virus causes mild to moderate symptoms such as fever and cough. But for some, especially older adults and the infirm, it can cause pneumonia and even lead to death.\nIn Egypt, the Coptic church said it was suspending Easter prayers and celebrations at churches later this month.\nChurch spokesman Boulis Halim told The Associated Press that the church also suspended services for the Holy Week leading up to Easter Sunday, celebrated on April 19 by Egyptian Coptic Orthodox followers, one the world’s oldest Christian communities.\nMosques and churches have already been ordered to shut across Egypt to slow the spread of the deadly virus. Egypt on Monday reported 149 new infections, the biggest single-day jump so far, bringing the case count to 1,322 and 85 fatalities.\nIran is facing the worst outbreak in the region. Iranian state TV reported Monday that the death toll there from the coronavirus rose by another 136 people, pushing total deaths to 3,739 amid 60,500 confirmed cases.", "url": "https://apnews.com/262adb646d8515f2ec987228c317c064"}