{"authors": [], "date_download": "2020-05-04 20:10:57", "date_modify": "2020-05-04 20:10:57", "date_publish": "2020-04-08 02:19:11", "description": "PORTLAND, Ore. (AP) — A romance mystery novelist charged with killing her chef husband is asking a judge to let her leave jail and spend the rest of the coronavirus outbreak at an undisclosed...", "filename": "_dd6133e558985b81ec407b9bd527d8b8_1588623057.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dd6133e558985b81ec407b9bd527d8b8_1588623057.html", "title": "Romance writer accused of murder seeks release due to virus", "title_page": "Romance writer accused of murder seeks release due to virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Ore. (AP) — A romance mystery novelist charged with killing her chef husband is asking a judge to let her leave jail and spend the rest of the coronavirus outbreak at an undisclosed guest house in the Portland area, court records show.\nLawyers for Nancy Crampton Brophy, 69, claim their client’s age and diabetic history require her immediate transfer from the Multnomah County Detention Center to what they described as “alternate confinement,” The Oregonian/OregonLive reported .\nThe attorneys, Lisa Maxfield and Kristen Winemiller, also filed a habeas corpus petition against Multnomah County Sheriff Mike Reese, alleging the conditions in the jails he oversees create a medically dangerous environment and threaten the defendant’s life.\nCrampton Brophy has been behind bars since September 2018 after police say she shot Daniel Brophy, her husband of 27 years, at the Oregon Culinary Institute that June.\nThe case became international news after The Oregonian/OregonLive revealed Crampton Brophy once wrote an essay titled “How to Murder Your Husband.”\nCrampton Brophy is among a growing number of inmates in Oregon and around the U.S. seeking release from local, state and federal custody amid the coronavirus epidemic, which public health experts say can spread more aggressively within jails than the community at large.\nMultnomah County’s two jails have yet to report a known COVID-19 case.\nMultnomah County prosecutors have rejected the release proposal outright, records show, and have argued that the court should hold a release hearing to determine whether Crampton Brophy is eligible for bail. Crampton Brophy has previously waived her right to have one.", "url": "https://apnews.com/dd6133e558985b81ec407b9bd527d8b8"}