{"authors": ["Jason Hanna", "Melissa Alonso"], "date_download": "2020-05-04 16:19:37", "date_modify": "2020-05-04 16:19:37", "date_publish": "2020-04-04 22:18:22", "description": "The Coral Princess cruise ship docked at Flordia's PortMiami with two guests dead and several others ill from Covid-19 after a weeks-long search for a port that would let passengers leave.", "filename": "2020_04_04_us_coral-princes_208a796bf53581226c39c5108242e208_index_1588609177.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404134345-01-coral-princess-cruise-ship-0404-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_us_coral-princes_208a796bf53581226c39c5108242e208_index_1588609177.html", "title": "Coral Princess cruise ship docks in Miami with coronavirus patients", "title_page": "Coral Princess cruise ship docks in Miami with coronavirus patients - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Coral Princess cruise ship docked Saturday at Florida's PortMiami with two guests dead and several others ill from Covid-19, officials said, after a weeks-long search for a port that would let its passengers disembark.\nThis ends a voyage that began March 5 in Chile and was supposed to finish March 19 in Argentina, but it ran on for days as countries declined to welcome passengers ashore during the coronavirus pandemic.\nThe Coral Princess' trip was lengthened even though none of the ship's occupants tested positive for the disease until this week.\nIt's still not clear how soon all of the 1,000-plus passengers and 878 crew will disembark in Miami, but some of the most seriously ill will leave first and go to hospitals, Miami Dade Mayor Carlos Gimenez said Saturday.\nPrincess Cruises had said Thursday that 12 people aboard -- seven guests and five crew -- were positive for Covid-19, after a small group of people with respiratory illness were tested Tuesday.\nThe company announced Saturday that two guests had died. Gimenez said both died of coronavirus. Their names were not released.\n\"I want to offer my condolences to the families of the loved ones of the two people who died from Covid-19 on that ship. It is heartbreaking news,\" Gimenez said.\n\"Our hearts go out to their family, friends and all who are impacted by this loss,\" the cruise line said in a statement released to news media.\nHealthy passengers will start leaving Sunday\nTwo passengers needing immediate medical attention will be taken to Miami's Larkin Community Hospital, and an unspecified number of others also will be taken to hospitals soon, Gimenez said.\nAbout 15 other ill passengers who don't need immediate hospitalization will remain aboard for medical treatment until they are cleared for travel by the US Centers of Disease Control and Prevention, Gimenez said.\nGuests fit to fly home will start leaving the ship Sunday, but the disembarking \"is expected to take several days due to limited flight availability,\" Princess Cruises said\nMore than 990 passengers and 840 crew members have been deemed fit for travel, Gimenez said Saturday.\n'It's a stressful time,' daughter says as ill parents remain aboard\nJulie Maa is worried about her parents, who are aboard the ship and ill.\nHer father, in his early 70s, tested positive for Covid-19 this week. Her mother, in her 60s, also has a fever and is coughing, Maa said.\nMaa, at her home in New York, has been talking to them by phone. On Saturday morning, officials were telling them that they would have to convalesce in a medical ward on the ship, and that her father needed supplemental oxygen.\nAll guests had been asked to stay in their rooms starting Monday after medical staff noticed a higher-than-normal number of people with flu-like symptoms, the company said.\nWith the ship docked Saturday, Maa's parents were preparing for their stay in the medical ward.\nHer parents, from the San Francisco area, were traveling with three senior couples they've known since college.\n\"It's a stressful time at the moment,\" she told CNN on Saturday.\nCaught at sea as the world changed\nThe Coral Princess was about halfway through its voyage around South America when, on March 12, Princess Cruises said it would end underway cruises as soon as possible as worldwide concerns about coronavirus grew.\nThe ship was to disembark at Buenos Aires as originally scheduled on March 19, in part because guests already had air travel booked there, the company said.\nIt did dock there, but the government allowed only Argentine passport holders and people with confirmed flights that day to disembark, according to Princess Cruises.\nThe ship then departed that night, after the Argentine government warned the ship would be required to stay there indefinitely -- with no passengers disembarking -- if it remained past midnight, the company said.\nThe Coral Princess then asked for permission to disembark passengers at port in Uruguay, where it picked up provisions, March 21, and Brazil, but were denied.\nThe ship, then heading toward Florida, picked up more supplies in Barbados on March 31.\nTwo other cruise ships carrying passengers with flu-like symptoms -- the Zaandam and the Rotterdam -- docked in Florida's Port Everglades on Thursday evening , ending their own nightmarish voyages disrupted by the coronavirus pandemic.\nMost of the cruise line industry announced a voluntarily suspension of cruise ship operations from US ports of call on March 13, and the CDC issued a \"no sail\" order on March 14 to all cruise ships that had not voluntarily suspended operations.", "url": "https://www.cnn.com/2020/04/04/us/coral-princess-cruise-ship-docks-miami-coronavirus/index.html"}