{"authors": ["Jonathan Mattise"], "date_download": "2020-05-04 20:13:54", "date_modify": "2020-05-04 20:13:54", "date_publish": "2020-04-16 18:01:22", "description": "NASHVILLE, Tenn. (AP) — Republican Bill Hagerty injected $2.5 million of his personal wealth into Tennessee's open race for U.S. Senate last quarter, while his main GOP rival, Manny Sethi, added...", "filename": "_484dc7b71ac76c9f04d2bb31871a0773_1588623234.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_484dc7b71ac76c9f04d2bb31871a0773_1588623234.html", "title": "GOP Senate hopefuls pour personal cash into Tennessee race", "title_page": "GOP Senate hopefuls pour personal cash into Tennessee race", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NASHVILLE, Tenn. (AP) — Republican Bill Hagerty injected $2.5 million of his personal wealth into Tennessee’s open race for U.S. Senate last quarter, while his main GOP rival, Manny Sethi, added $400,000 of his own, bringing his personal stake in the contest to more than $1.9 million.\nThe quarter that ended in March included the first weeks of pandemic campaigning in the race to replace retiring Republican Sen. Lamar Alexander. The coronavirus has largely shuttered the world economy, leaving questions about prospective donors and rendering traditional campaign events impossible due to social distancing requirements.\nA third Republican joined Sethi and Hagerty by reaching seven-figure loan territory. The federal campaign finance numbers reported by Wednesday’s deadline show that George Flinn added $1.3 million of his own money last quarter. Flinn, a frequent federal candidate unafraid to spend his wealth, has now infused more than $1.5 million into the race.\nHagerty, a Nashville businessman and the former U.S. ambassador to Japan, was also able to raise $1.2 million last quarter. He spent more than $1 million and entered April with $5.6 million cash remaining.\nSethi, a Nashville trauma surgeon, raised $419,500 last quarter, spent $730,100, and ended March with $2 million cash on hand.\nFlinn, a Memphis radiologist, spent more than $1 million last quarter and had more than $520,900 cash left. Flinn has tapped into millions of his own dollars during previous unsuccessful runs for U.S. House and Senate.\nHagerty is highlighting his endorsement from President Donald Trump at every turn, including a mention in a TV ad he released Thursday in which he criticizes China over the coronavirus pandemic.\nSethi has likewise praised Trump and blasted China. He’s been donning his lab coat in Facebook videos and asking people to email and call him with any questions.\nOn the Democratic side, Nashville attorney and former Army helicopter pilot James Mackler raised $410,900 last quarter, spent $282,100, and ended March with $531,300 cash on hand.\nFifteen Republicans, five Democrats and nine independents have qualified for the Senate race.\nRepublicans have held both Tennessee seats in the Senate since 1994.", "url": "https://apnews.com/484dc7b71ac76c9f04d2bb31871a0773"}