{"authors": ["Andrew Demillo"], "date_download": "2020-05-04 20:25:25", "date_modify": "2020-05-04 20:25:25", "date_publish": "2020-04-20 20:43:29", "description": "LITTLE ROCK, Ark. (AP) — Nearly a third of the inmates at an Arkansas prison have tested positive for coronavirus, state health officials said Monday as two more people in the state died from the...", "filename": "_6e6c948153679922f8e4bd6305712909_1588623925.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6e6c948153679922f8e4bd6305712909_1588623925.html", "title": "Arkansas reports 250 more coronavirus cases at state prison", "title_page": "Arkansas reports 250 more coronavirus cases at state prison", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LITTLE ROCK, Ark. (AP) — Nearly a third of the inmates at an Arkansas prison have tested positive for coronavirus, state health officials said Monday as two more people in the state died from the virus.\nAbout 600 inmates in the Cummins Unit tested positive for the virus, an increase of about 250 from a day earlier, state Health Secretary Dr. Nathaniel Smith said. Prison officials announced the first case at the facility a little over a week ago.\nSmith said the department has completed most of its testing of inmates at the prison. A health department spokeswoman said the agency has tested more than 1,000 inmates and is awaiting results from 25 more from the prison.\n“Until we have completely interrupted chains of transmission in the prison, I’m not going to say it’s over,” Smith said. “Once we know who’s positive, who’s negative, who’s exposed, who’s not exposed, then we can begin moving people around and that, I would say, is the beginning of containment.”\nCummins has 1,675 inmates in the main building and another 279 in a modular unit that is separate from the main building.\nHealth officials said the total number of coronavirus cases in Arkansas has risen to 1,923. Forty-two people have died from COVID-19, the illness caused by the virus. The statewide number reported Monday does not include all of the Cummins cases because of a lag in entering them in Arkansas’ database, Smith said.\nMost of the Cummins inmates have been asymptomatic, but three have been hospitalized.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia.\nGov. Asa Hutchinson has said he hopes to lift some of the state’s restrictions on May 4 if new cases start going down and the state’s testing capacity expands. The Republican governor said the prison cases will be a factor when he makes that decision.\n“Obviously the prison system is a city unto itself, an environment unto itself and what happens there is very, very important to us,” he said.\nHutchinson on Sunday said he’s asked the state parole board to review 1,990 non-violent, non-sex offender inmates statewide who are due for release within six months for possible early release\n___\nCheck out more of the AP’s coronavirus coverage at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/6e6c948153679922f8e4bd6305712909"}