{"authors": ["Reporter"], "date_download": "2020-05-04 21:06:22", "date_modify": "2020-05-04 21:06:22", "date_publish": "2020-04-30 18:04:55", "description": "Things got awkward on Thursday's episode of \"Fox & Friends\" during a discussion about coronavirus beach bans.", "filename": "entry_fox-news-ainsley-earhardt-brian-kilmeade-awkward-coronavirus_n_5eaafd8dc5b633a85446e23b_1588626382.html", "image_url": "https://img.huffingtonpost.com/asset/5eaaff99250000b711eb0a5b.png?cache=dznxn2vvac&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_fox-news-ainsley-earhardt-brian-kilmeade-awkward-coronavirus_n_5eaafd8dc5b633a85446e23b_1588626382.html", "title": "Fox Host Brian Kilmeade Shows Little Concern For Ainsley Earhardt’s Sick Mom", "title_page": "Fox Host Brian Kilmeade Shows Little Concern For Ainsley Earhardt’s Sick Mom | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "It happened while Kilmeade, Earhardt and Steve Doocy were talking about Newsom’s decision to close all beaches and state parks on Friday.\nKilmeade grumbled about the closures, which Newsom ordered after tens of thousands of people flocked to the seashore last weekend.\n“To go ahead and say, ‘I’m closing the beaches. I didn’t like the way you acted last week,’ when most of that state is perfectly fine, just some congested areas aren’t, this is the foundation for an overreach,” Kilmeade said.\nEarhardt was more sympathetic to the governor’s plight, arguing that his main job at this point is flattening the curve and minimizing deaths.\n“The governors have to make tough decisions, because they don’t want a relapse in all of this. That wouldn’t make them look good,” she added. “Their residents would be dying!”\nEarhardt then tried to put a personal spin on the issue by revealing that her mother is very sick and at high risk should she contract the coronavirus.\n“My mom is very sick,” Earhardt said. “And as much as I want to go out, ... I still want everyone to play by the rules, because when I finally do get to go home to visit her … ”\nKilmeade then interrupted her. “But is your mom going to the beach?” he asked.\nEarhardt didn’t look impressed one bit, but gamely attempted to explain her situation in terms he might ― fingers crossed ― comprehend.\n“No, but Brian, you know, eventually she’s going to be around family again,” Earhardt said. “I understand both sides, I really do. I just don’t want a resurgence of this. You know, I just don’t want us to go through all of this. It’s been — it’s been hard for everyone at different levels.”\nYou can watch the exchange below.\nthis is so incredibly awkward pic.twitter.com/Wpuc3BmnSa — Bobby Lewis (@revrrlewis) April 30, 2020", "url": "https://www.huffpost.com/entry/fox-news-ainsley-earhardt-brian-kilmeade-awkward-coronavirus_n_5eaafd8dc5b633a85446e23b"}