{"authors": ["Veronica Stracqualursi"], "date_download": "2020-05-04 16:19:39", "date_modify": "2020-05-04 16:19:39", "date_publish": "2020-04-04 22:40:09", "description": "President Donald Trump on Saturday said it was \"inappropriate\" for the former USS Theodore Roosevelt commander to widely send a letter warning that action was needed to save the lives of his crew from an outbreak of coronavirus aboard the aircraft carrier.", "filename": "2020_04_04_politics_trump-u_c165c26dddd3822ff931ca62f84f4ed9_index_1588609179.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401090526-02-uss-theodore-roosevelt-guam-grab-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_politics_trump-u_c165c26dddd3822ff931ca62f84f4ed9_index_1588609179.html", "title": "Trump says it was 'inappropriate' of ex-USS Theodore Roosevelt commander to write memo", "title_page": "Trump says it was 'inappropriate' of ex-USS Theodore Roosevelt commander to write memo - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) President Donald Trump on Saturday said it was \"inappropriate\" for the former USS Theodore Roosevelt commander to widely send a letter warning that action was needed to save the lives of his crew from an outbreak of coronavirus aboard the aircraft carrier.\nCapt. Brett Crozier was relieved of his command this week by acting US Navy Secretary Thomas Modly, for what Modly called \"poor judgment,\" going outside the chain of command, and too widely disseminating the memo over an unsecured system.\n\"I thought it was terrible what he did, to write a letter. I mean, this isn't a class on literature. This is a captain of a massive ship that's nuclear powered, and he shouldn't be talking that way in a letter. He could call and ask and suggest,\" Trump told reporters Saturday during a White House briefing on coronavirus.\nTrump added, \"I thought it looked terrible, to be honest with you.\"\nHe also criticized the carrier for its scheduled port visit in early March to Vietnam.\nRead More", "url": "https://www.cnn.com/2020/04/04/politics/trump-uss-roosevelt-commander-coronavirus/index.html"}