{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:23:08", "date_modify": "2020-05-04 20:23:08", "date_publish": "2020-04-30 02:39:52", "description": "\"This is not the time to back off of protective measures,\" the California senator said.", "filename": "entry_feinstein-mcconnell-senate-coronavirus_n_5eaa33ebc5b6edf4130dff5a_1588623788.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa34a7220000640d827e46.jpeg?cache=d5fc4ypfny&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_feinstein-mcconnell-senate-coronavirus_n_5eaa33ebc5b6edf4130dff5a_1588623788.html", "title": "Feinstein Urges McConnell To Delay Senate’s Return: ‘We Remain In A Critical Time’", "title_page": "Feinstein Urges McConnell To Delay Senate’s Return: ‘We Remain In A Critical Time’ | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Sen. Dianne Feinstein (D-Calif.) urged Senate Majority Leader Mitch McConnell (R-Ky.) to reconsider plans to reconvene the chamber next week, saying the country was clearly still in a “critical time” of the coronavirus pandemic.\n“In the interest of public health and sending the right message to the nation, I ask that you allow the Senate to continue working remotely,” Feinstein wrote in a letter to McConnell and Senate Minority Leader Chuck Schumer (D-N.Y.) on Wednesday.\nMcConnell confirmed this week the Senate will reconvene as planned on May 4, saying the body would not “sit on the sidelines” as the nation reels from a bevy of stay-at-home orders and social distancing guidelines that have wrought economic havoc. Jobless claims have climbed to record heights, and the U.S. economy shrunk by a nearly 5% annual rate in the first quarter of the year.\n“We feel like if people on the front lines are willing to work during the pandemic, we should be as well,” he told Fox News Radio. “And so the Senate will come back; we’ll be in session next week.”\nBut the move comes amid stark warnings from the nation’s top medical officials about the country getting back to normal too quickly. More than 1 million people have been infected with the coronavirus in the United States, and more than 60,000 people have died, numbers that may be dramatically undercounted.\nFeinstein, who at 86 is the oldest senator, referenced those statistics in a statement Wednesday, saying that in some places around the country cases were still increasing.\n“Every day I look at the numbers of new cases and deaths in the world, in the United States and in California. It is clear that we remain in a critical time,” she said. “In many states, the spread of this disease is continuing at a steady rate and transmission is even accelerating in others. This is not the time to back off of protective measures.”\nThe House, which had planned to return on May 4 as well, delayed its reconvening this week after consulting with Congress’s attending physician.\n“We had no choice,” House Speaker Nancy Pelosi (D-Calif.) said Tuesday. “If the Capitol physician recommends that we not come back, then we have to take that guidance.”\nWhile McConnell has pledged lawmakers wouldn’t be able to pass any further economic stimulus measures to build on the $2 trillion act signed by the president in March and a $484 billion package signed Friday, some Democrats have slammed his other legislative plans.\nMcConnell stressed last month that he will quickly return to his efforts to fill federal court vacancies with conservative judges, even amid the pandemic.\n“Of course, we will go back to judges,” McConnell told conservative radio host Hugh Hewitt on March 31. “My motto for the rest of the year is, ‘Leave no vacancy behind.’”\nEvery Democrat on the Senate Judiciary Committee wrote a letter to Sen. Lindsey Graham (R-S.C.), the chairman of the panel, on Tuesday, urging him to delay a confirmation hearing that is already being planned for next week.\n“Now is not the time to process routine judicial nominations,” the 10 lawmakers wrote in a letter. “We therefore urge you to delay the May 6 nominations hearing and instead focus the Committee’s efforts on responding to the COVID-19 pandemic and protecting the lives and livelihoods of all Americans.”", "url": "https://www.huffpost.com/entry/feinstein-mcconnell-senate-coronavirus_n_5eaa33ebc5b6edf4130dff5a"}