{"authors": ["Paolo Gerbaudo", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Alex Gourevitch", "Sohale Andrus Mortazavi", "Chris Maisano", "Max B. Sawicky"], "date_download": "2020-05-04 19:49:20", "date_modify": "2020-05-04 19:49:20", "date_publish": "2020-05-01 00:00:00", "description": null, "filename": "2020_05_post-democracy-after-crises-colin-crouch-review-liberalism_1588621760.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/05/01232040/SAAM-1965.18.43_1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_05_post-democracy-after-crises-colin-crouch-review-liberalism_1588621760.html", "title": "Liberal Democracy Is in Trouble - And Liberals Won’t Save It", "title_page": "Liberal Democracy Is in Trouble — And Liberals Won’t Save It", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Review of Post-Democracy After the Crises , by Colin Crouch (Polity, 2020).\nThese are no easy times for liberal theorists. The multiple crises we are living through all seem to carry negative implications for the liberal order’s credibility — and its future. Rampant inequality, widespread political dissatisfaction, the rise of anti-liberal populist movements — and, indeed, the devastating consequences that the pandemic will have for a globalized economy — all seem to pose serious challenges to liberalism. Even before the coronavirus outbreak, this was already a theme widespread in political science literature, from Edward Luce’s The Retreat of Western Liberalism , to William A. Galston’s Anti-Pluralism , and Patrick Deneen’s Why Liberalism Failed — a trend amplified by the growth of all sorts of populist movements. Furthermore, on the economic front, neoliberalism as “really existing liberalism” is blamed for many of the ills societies are experiencing, at a time of huge economic inequality and failing public services. The dominant atmosphere in liberal circles is thus, understandably, one of dejection and confusion. And all that liberal theorists seem to have to offer is an appeal to the lofty ideals of liberal democracy and trite pleas for a more “rational,” “well-informed,” and “balanced” politics. This disorientation is reflected not only among unrepentant Blairites such as Yascha Mounk, but also among more progressive liberal political scientists that have been critical of the neoliberal involution of liberal democracy. The foremost example is Colin Crouch, emeritus professor at the University of Warwick. He is the theorist of “post-democracy” — a notion that has become widely used by sociologists and political scientists to express the progressive erosion of democratic accountability in a neoliberal era, marked by technocracy, the government of experts, and suspicion toward all forms of popular participation. Coining this term at the turn of the millennium, Crouch reported that while society “continues to have and to use all the institutions of democracy, [. . .] they increasingly become a formal shell.” In Post-Democracy After the Crises (Polity, 2020), a title just released amid the coronavirus emergency, Crouch aims to revise and update this influential thesis, at a time marked by multiple crises that seem to further aggravate the hollowing out of democracy. Indeed, from a diagnostic perspective, current events seem to be a vindication of his early thesis. Yet this impressive analytical prescience is not matched by a convincing “prognosis.” All Crouch has to offer are symptomatic remedies, a mere “tweaking” of the global system, with more effective forms of transnational cooperation, the return to a “truly competitive” market system as a means to reduce political interference by economic oligarchies, and more institutional “responsiveness.” But is this really enough to address the crisis of democracy?\nPost-Democracy Deepens The term “post-democracy” was first introduced by Crouch in 2000 in the book Coping with Post-Democracy , and then developed in a number of later works such as Post-Democracy in 2004, and The Strange Non-Death of Neoliberalism in 2011. According to this theory, our democracy is marked by a split between political form and substance, in which democracy continues to exist formally but its substance is lost. In this context, “the energy and innovative drive pass away from the democratic arena and into the small circles of a politico-economic elite.” Putting forward this concept at the height of Tony Blair’s New Labour, Crouch had different trends in mind: the growth of technocratic government, making all political decisions a matter of “expertise”; the lurching of political debates toward propaganda and advertising; the privatization of public services through practices known as “new public management,” with the profit logic encroaching on health and education; and, more generally, the disruptive role of globalization on economics and politics. These different tendencies were leading to increasing fatigue of the electorate and serious short circuits in political accountability, with nefarious consequences for democracy’s legitimacy. Updating this thesis in his new book, Crouch asserts that many of the trends identified at the beginning of the 2000s are coming to maturity. He argues that the economic crisis of 2008 and the way governments managed it marked a further blow to democracy. The European sovereign debt crisis, and the way in which in 2011 the Troika of European institutions forced both Greece and Italy to change their prime ministers, provided glaring demonstrations of this suspension of democratic substance. However, amid this crisis, Crouch does not seem to find any ally in the political arena. In fact, he paints all emerging actors of both the Left and Right who have criticized failing neoliberal democracy as “populists” who do not deserve a serious hearing. For Crouch, populism in all its forms is no solution to present problems. If anything, it leads to an even worse situation, where we move from technocracy to outright autocracy and xenophobia. Populism’s particularism, furthermore, puts us in an untenable position when it comes to dealing with global issues such as climate change. The term “populism” here is not only used to take aim only at Trump, Bolsonaro, and Salvini. Rather, as with other liberal theorists — such as Atlantic contributing writer and former director at Tony Blair’s Global Change Institute, Yascha Mounk — the term is also used to attack all new left phenomena from former Labour leader Jeremy Corbyn to Podemos and La France Insoumise. Adopting a spiteful bitterness that has become prevalent among many left-liberals both in the United States and in Europe, Crouch accuses this “post-crash left” wave of being on par with right-wing populism, because of its supposed anti-internationalism and even hostility to migrants. This, despite the fact that these same forces are the most adamant defenders of the rights of migrants and refugees. Ultimately, what seems unacceptable to Crouch is the way so-called left-populists have mounted a critique of economic globalism and again invoked the need for state interventionism. In other words, for Crouch, while the global liberal system is failing, none of the alternatives that have emerged in recent years are any better.\nA Slightly Better Liberalism Crouch’s book is most disappointing when he makes recommendations on a better politics. All he has to offer is some “tweaking” of some structural mechanisms of liberal democracy that do not seem to be working too well. Crouch calls for “fully democratic responsive politicians” and a “more resilient democracy.” Some readers may find this as an expression of empty rhetoric. And to a large extent, it is. It seems that, for Crouch, a few changes around the edges would be sufficient to deliver us from the sorry state of liberal democracy and open the way for a real democracy, closer to the lofty ideals liberal theorists such as himself associate with the term. If only communication were more rational, information more available, capital less concentrated, markets truly competitive, our public sphere more open, our institutions more responsive, liberal democracy’s ills would be resolved, and we would not have to witness the deranged behavior of anti-liberal populists such as Donald Trump. This is most evident when Crouch discusses the way the political class allowed financial deregulation, creating the conditions for the 2008 crisis. Crouch makes no excuses for the disastrous way in which the crisis was handled. However, he seems to read this mismanagement simply as a problem of information or institutional design. Thus, he argues, “had politicians in the 1990s been willing to listen to a wider range of opinion . . . cautionary voices would surely have been more likely to have been heard and deregulation would have proceeded more carefully.” Similarly, “had politicians been in more active, two-way contact with groups in society outside the financial elite, they would have been less ready to concede the banks’ initial deregulatory demands.” Had politicians done this and that… But the fact is that politicians did not do that. And they didn’t do it, not because of a problem of communication or of inadequate institutions, but because they could not listen, because they were representing interests that were by and large incompatible with citizens’ interests. Alike what happens in large swathes of Anglo-American political science, dominated by obtuse liberal positivism, there is little attention for the material interests that motivate different parties. All comments are made at the level of political institutions, as if political institutions were independent from society. The narrow functionalism of Crouch dispenses with everything that makes politics political, starting from political conflict and class interests. It dubiously suggests that with some minor “superstructural” adjustment, there will be no need to really delve into the root causes of current social and political ills.", "url": "https://jacobinmag.com/2020/05/post-democracy-after-crises-colin-crouch-review-liberalism"}