{"authors": ["Ariane De Vogue", "Adam Levy"], "date_download": "2020-05-04 16:21:16", "date_modify": "2020-05-04 16:21:16", "date_publish": "2020-04-04 23:01:20", "description": "The Republican National Committee and Wisconsin Republicans on Saturday asked the Supreme Court to freeze a lower court opinion that extends the state's absentee ballot deadline, giving voters an extra six days to submit their ballots from Election Day to April 13.", "filename": "2020_04_04_politics_rnc-wisconsin-republicans-voting_index_1588609276.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200303111313-04-biden-sanders-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_politics_rnc-wisconsin-republicans-voting_index_1588609276.html", "title": "RNC and Wisconsin Republicans file emergency petition in voting dispute", "title_page": "Wisconsin primary: RNC and Wisconsin Republicans file emergency petition in voting dispute - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Republican National Committee and Wisconsin Republicans on Saturday asked the Supreme Court to freeze a lower court opinion that extends the state's absentee ballot deadline, giving voters an extra six days to submit their ballots from Election Day to April 13.\nThe emergency filing marks the first coronavirus-related petition that the justices will review since the pandemic gripped the country. Although the Supreme Court's doors are closed to the public, the justices are still working remotely.\nIn the emergency petition, filed Saturday afternoon, lawyers for the RNC and Wisconsin Republicans argue that \"requiring a state to permit unlimited absentee voting for almost a week after election day presents significant dangers to election integrity, voter confidence and the orderly administration of an election that already has strained state resources due to the difficult circumstances associated with COVID-19.\"\nThe lawyers, noting that the election is \"already in full swing,\" asked the Court to block the absentee extension for now as the appeals process plays out and clarify that absentee ballots must be postmarked (or personally delivered to the polls) no later than April 7 in order to be counted. They asked the Court to act \"no later than Monday, April 6.\"\nOn Sunday, lawyers for the Democratic National Committee responded to the Republicans by arguing that the record \"conclusively establishes that thousands of voters, at a minimum, will be disenfranchised if their requested absentee ballots must be postmarked by Tuesday the 7th.\"\nRead More", "url": "https://www.cnn.com/2020/04/04/politics/rnc-wisconsin-republicans-voting/index.html"}