{"authors": ["Kerry Flynn", "Cnn Business"], "date_download": "2020-05-04 16:02:25", "date_modify": "2020-05-04 16:02:25", "date_publish": "2020-04-01 16:07:28", "description": "Over the last few years, a wave of unionization has swept local newsrooms and digital media outlets. As coronavirus forces media companies to enact drastic cost-cutting plans, unionized newsrooms are putting the power of collective bargaining to the test.", "filename": "2020_04_01_media_media-labor-unions-coronavirus_index_1588608145.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401112914-newspaper-stack---stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_media_media-labor-unions-coronavirus_index_1588608145.html", "title": "Coronavirus is testing the power of unionized newsrooms", "title_page": "The power of unionized newsrooms during the coronavirus pandemic   - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Since joining at The Arizona Republic in 2008, reporter Rebekah Sanders has seen many rounds of layoffs , buyouts and furloughs at the Gannett-owned newspaper.\n\"Every single time I felt helpless,\" Sanders told CNN Business. \"There was nothing that I could do. I could go home and be angry. I could complain to my coworkers, but I had no power to make any kind of change to the situation.\"\nBut on Monday, after Sanders learned of Gannett's furlough plan — requiring employees making more than $38,000 to take five days unpaid in April, May and June — she didn't feel helpless like she did in the past. The Arizona Republic is one of more than 30 unionized newsrooms under Gannett ownership, represented by the NewsGuild.\n\"We deserve better than this. Having a union allows you to [ask for] that in a coordinated way. I would never know what's going on in Eugene, Oregon, Rochester, Jacksonville and Milwaukee, except that I have friends now in all of those newsrooms. We're all sharing information and talking about how we can best serve our journalists,\" Sanders said.\nOver the last few years, a wave of unionization has swept local newsrooms and digital media outlets . As the coronavirus sweeps the country, forcing media companies to enact drastic cost-cutting plans , unionized newsrooms are putting the power of collective bargaining to the test.\nNewsGuild's stimulus plan\nAction plans aren't just being formed within individual newsrooms. On Wednesday, the NewsGuild-CWA, which represents thousands of media workers in the US and Canada, called for public stimulus funds for the media industry , NewsGuild president Jon Schleuss told CNN Business. The plan, passed unanimously by the labor union's executive council, calls for federal, state, provincial and local governments to provide public funds to sustain newsrooms.\n\"We're calling for a stimulus plan that would protect the fourth estate and protect the work because it's an essential service,\" Schleuss said. \"It's really about public health, and it's about trying to do this in the interest of our communities who are desperate for this information at this critical moment.\"\nThe stimulus plan has certain stipulations for employers who request public funds. For example, executives are not allowed to take bonuses, stock options or \"golden parachutes\" for five years. An executive's compensation also cannot be more than twice as much as that of an editor in chief's.\n\"We entered the pandemic without enough people to cover this story [because] private equity and hedge funds have used [media] as a distressed asset situation to just take as much money as they can,\" Schleuss said. \"That's terrible for our communities.\"\nUnion protections\nLabor unions have gained traction at newspapers and digital media outlets in recent years as staffers witnessed round after round of layoffs even as traffic soared on some sites. This created unstable work environments that called for job protections, better benefits and severance packages. Thrillist staffers announced their intention to unionize with the Writers Guild of America, East in early 2017 after approximately 20 employees were laid off. BuzzFeed voted to unionize in early 2019 after 15% of its workforce, or about 220 people, were laid off.\nOther newsroom unions have existed for decades. The Knoxville Newspaper Guild, which includes staffers of the Knoxville News-Sentinel, formed in 1936. The Arizona Republic, meanwhile, voted to unionize in October, seeking workplace protections prior to the merger of newspaper conglomerates Gannett and GateHouse\nGary White, union chair of the Gannett-owned Lakeland Ledger, told CNN Business that since the paper unionized in 2016, they have had two \"modest raises,\" frozen health care premiums, received two more personal days and secured \"just-cause protection, when previously management could fire employees at will.\"\nIndeed, Gannett journalists said they have witnessed their newsrooms shrink drastically in recent years. Travis Dorman, union president of the Knoxville News-Sentinel, said his newsroom lost six reporters and only hired one over the last six months. Andrew Pantazi, union co-chair at the Florida Times Union Guild, said that since GateHouse bought the Jacksonville-based paper in 2017 the newsroom staff has dropped from 62 to 28 people.\nSome unions have successfully pushed back against layoffs. Pantazi said his paper's union prevented two layoffs last year. Sanders of The Arizona Republic said they negotiated buyouts rather than layoffs at the end of last year.\n\"One of the most affirming things about why this union effort was successful is one of our retirees on the last day went by every single desk in the newsroom saying goodbye,\" Sanders said. \"That maybe seems small in the scheme of things, but to give people the opportunity to leave on their own terms in an industry that is cratering is actually a pretty big deal.\"\nUnions during coronavirus\nSince Monday's news, union chairs across Gannett newsrooms have been been in constant communication with each other through phone calls, Zoom video conference calls, texts, emails and Google Hangouts to discuss action plans.\nInitially, some unionized newsrooms were planning to bargain collectively. But according to two union chairs, Gannett declined the opportunity. Still, Gannett staffers are working together behind the scenes to plan their individual bargaining discussions with management and other tactics.\n\"Journalists in some sense are the most ideal union members because we are trained to question authority, to research the data, to hold power to account and that's all we're doing,\" Sanders said.\nGiven the already shrunken staffs at newsrooms, Gannett reporters told CNN Business that they are fearful for the effects of the furloughs. Pantazi likened the plan to cut hours by 25% each month to reducing the amount of reporting by 25%. He worries that the cuts could spell trouble for communities hard hit by the coronavirus pandemic.\n\"We're concerned that in the middle of a crisis we're going to see 25% less stories about how people can stay safe, how people can get tested as well as 25% less accountability of government organizations that have not been handling this crisis well and companies that have been exploiting this crisis,\" Pantazi said.\nThough, not every staffer will be furloughed since the plan requires employees to make at least $38,000. Dorman of the Knoxville News-Sentinel said about little less than half his staff of 23 reporters and photographers make under $38,000, including himself. Austin White, union chair of the Pueblo Chieftain, said three out of eight reporters would not be furloughed and that these employees would not be eligible for overtime pay.\n\"People are going to have to make up for other people's work that won't be there or just have a horrible output,\" White said. \"I don't understand how you can get away with no overtime.\"\nA Gannett spokesperson told CNN Business that under the company's policies, furloughed employees could be eligible paid overtime as long as it is approved by their managers.\nOne concern union chairs have is Gannett's lack of due diligence in reviewing other cost-cutting options. For example, while Gannett CEO Paul Bascobert announced he would not take salary until the furloughs were over, there was no mention of the company's other CEO, Mike Reed, taking a pay cut.\nA Gannett spokesperson said Reed is not employed by Gannett, but by Fortress Investment Group, the private equity firm in New York that manages the newly combined company.\nSanders said she hopes to relax freelance restrictions, allowing furloughed staffers to write for other outlets as another source of income.\nIn the meantime, some papers have organized relief funds, and others are considering similar efforts. Pantazi said the Florida Times Union had raised about $10,000 as of Tuesday.\n\"It's going to help our members if they do get any pay cuts to be able to make their rent, to be able to pay for their medicine, to be able to cover the expenses that they've been accruing,\" Pantazi said. \"That's going to help us take care of our coworkers, even as we continue to fight to have the least amount of reduction in reporting as possible.\"", "url": "https://www.cnn.com/2020/04/01/media/media-labor-unions-coronavirus/index.html"}