{"authors": ["Jim Salter"], "date_download": "2020-05-04 20:29:10", "date_modify": "2020-05-04 20:29:10", "date_publish": "2020-04-17 20:37:38", "description": "O'FALLON, Mo. (AP) — A lawsuit filed by civil rights groups on Friday seeks to allow all Missourians to vote absentee in upcoming elections to help reduce the risk of catching or spreading the...", "filename": "_86dcd5d8542333f5f1a888e2e0ed7c1d_1588624150.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_86dcd5d8542333f5f1a888e2e0ed7c1d_1588624150.html", "title": "Lawsuit: Let Missourians vote absentee during virus crisis", "title_page": "Lawsuit: Let Missourians vote absentee during virus crisis", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "O’FALLON, Mo. (AP) — A lawsuit filed by civil rights groups on Friday seeks to allow all Missourians to vote absentee in upcoming elections to help reduce the risk of catching or spreading the coronavirus.\nThe lawsuit was filed in Jefferson City by the American Civil Liberties Union of Missouri and the Missouri Voter Protection Coalition on behalf of the NAACP, the League of Women Voters and several residents. It claims that requiring voters to appear at traditional polling places during the pandemic puts lives at risk.\n“No one should be forced to choose between staying safe and voting,” Sophia Lin Lakin, deputy director of the ACLU’s Voting Rights Project, said in a statement. “Expanding absentee ballot access to all registered voters during the pandemic is a common-sense solution that protects people’s health and their right to vote.”\nMissouri law allows absentee voting, but only for people with certain reasons, such as illness or travel away from home on the day of the election. Municipal elections will be June 2, Missouri’s primary election is Aug. 4 and the general election is Nov. 3.\nWhile President Donald Trump has expressed concerns that voting by mail is “ripe for fraud,” officials in some states have eased access to mail-in ballots. Nebraska’s Republican governor urged voters to apply for absentee ballots.\nIn Missouri, some county clerks have suggested that the Legislature change the law this year given the social distancing aimed at slowing the spread of the coronavirus. The virus has sickened more than 5,500 Missourians and killed 170, prompting statewide stay-at-home orders through May 3 and social distancing requirements expected to continue for several months.\nRepublican Gov. Mike Parson, asked about absentee voting during a news conference earlier this week, called it “more of a political issue than it is anything,” and said it wasn’t the time to consider changing election law.\nThe ACLU said one of the allowable reasons to vote absentee in Missouri is “incapacity or confinement due to illness or physical disability.” The lawsuit asks the court to rule that voters confining themselves due to the coronavirus can invoke that clause as a reason to vote absentee.\nAn email message seeking comment from the Missouri Secretary of State’s office was not immediately returned.", "url": "https://apnews.com/86dcd5d8542333f5f1a888e2e0ed7c1d"}