{"authors": ["Overnight Editor"], "date_download": "2020-05-04 20:14:19", "date_modify": "2020-05-04 20:14:19", "date_publish": "2020-04-29 03:55:40", "description": "The New York Times' entire response is only three sentences — with the key summed up in a single word.", "filename": "entry_sean-hannity-new-york-times-legal-threat_n_5ea8e6d4c5b6106b8ecf3005_1588623259.html", "image_url": "https://img.huffingtonpost.com/asset/5dafed5e200000e91b506810.jpeg?cache=4resamttif&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_sean-hannity-new-york-times-legal-threat_n_5ea8e6d4c5b6106b8ecf3005_1588623259.html", "title": "NYT Attorney Sums Up Response To Sean Hannity’s 12-Page Legal Threat In 1 Blunt Word", "title_page": "NYT Attorney Sums Up Response To Sean Hannity’s 12-Page Legal Threat In 1 Blunt Word | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Fox News host Sean Hannity threatened legal action against The New York Times over some stories about the coronavirus pandemic that painted both him and the network in an unflattering light.\nHannity’s attorney sent the Times a 12-page letter demanding a retraction and an apology over its recent coverage, including a story about a Fox News viewer who went on a cruise in March and later died of COVID-19.\nThe Times’ April 18 opinion column by Ginia Bellafante quoted a woman saying that her father, Joe Joyce, “watched Fox, and believed it was under control,” so he flew to Florida and went on a cruise in Spain.\nThe newspaper said Joyce became sick within two weeks of his return home but resisted getting a test.\n“He didn’t think that he could have it, because he wasn’t 100 percent confident that it was a thing,” his daughter told the Times.\nJoyce died on April 9.\nHannity complained on the air that the newspaper “all but accused me of murder,” and on Monday, his attorney sent the legal threat.\nBut the newspaper’s lawyer fired back with just three sentences ― and a single word in response to the demand for a retraction and an apology.\nNew York Times newsroom lawyer David McCraw delivers this response to @seanhannity request for retraction and apology related to @nytimes coverage: \"No.\" Addressed to Hannity lawyer Charles Harder: pic.twitter.com/0v7URfo1kz — ErikWemple (@ErikWemple) April 28, 2020\nHannity notes that he called the virus dangerous in January. However, he also repeatedly downplayed the threat, said the flu was more dangerous, and in one infamous moment, put up a graphic with a big “0” to show the infection hadn’t killed anyone in the United States at that point.\nEarlier this month, 74 journalism and communications professors signed a letter calling Fox News’ coverage of the pandemic “a danger to public health.”", "url": "https://www.huffpost.com/entry/sean-hannity-new-york-times-legal-threat_n_5ea8e6d4c5b6106b8ecf3005"}