{"authors": ["Sara Sidner"], "date_download": "2020-05-04 16:15:48", "date_modify": "2020-05-04 16:15:48", "date_publish": "2020-04-03 14:48:31", "description": "The Covid-19 ICU at Harborview Medical Center in Seattle is packed with equipment waiting for an expected surge of patients. But the statistics suggest Washington state may be heading in the right direction to beat coronavirus.", "filename": "2020_04_03_us_washington-seattle-coronavirus-numbers-sidner_index_1588608948.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403084731-harborview-medical-center-seattle-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_us_washington-seattle-coronavirus-numbers-sidner_index_1588608948.html", "title": "Coronavirus first ravaged parts of Washington state. Now there are signs of a change", "title_page": "Coronavirus first ravaged parts of Washington state. Now there are signs of a change. - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Seattle (CNN) Seattle's hospitals are preparing for a surge of coronavirus cases , but there are faint glimmers the situation is improving in the place where the US outbreak first took hold.\nThe first thing you notice in the Covid-19 unit at the Harborview Medical Center is the sheer amount of equipment lining the walls -- crash carts, protective hoods, hoses and more.\nIt's there to try to save patients already here, in the heart and the heat of the epidemic in Washington state. But it's also ready for the many more patients the planners think are coming to this hospital managed by University of Washington Medicine.\n\"This whole unit was supposed to be for people with brain injuries and strokes and so forth,\" said Dr. John Lynch, Harborview/UW medicine director of infectious disease control. \"So, we had to move all them someplace else because we have to continue that care.\"\nAll around is a sense of purpose, of professionalism and determination. But there is also a tension -- the staff here don't know exactly what is coming, but they do believe there will be a surge in coronavirus cases before things get better.\n\"It's certainly a sense of anxiety right now,\" Harborview registered nurse Ariel Rogozinski told CNN. \"We are kind of wondering what it's going to be like when that peak comes and when people are flooding in. ... It's the unknown -- we don't know what that's going to look like.\"\nThe scientists crunching the numbers think if there is a surge, the peak in Washington State will come in a week or two. This state's time line is ahead of other areas in the US, likely because the virus broke out here first.\nIt was on January 21 this year that Washington announced it had the first confirmed case of the novel coronavirus in the United States. A little over month later, Harborview witnessed another grim first -- a man admitted from the Life Care Center of Kirkland died -- believed to be the first US death from Covid-19.\nThat was before social distancing. Before stay-at-home orders. Before all the business closures.\nBut as Washington state officials began to react, they may have created a case study of how to \"flatten the curve\" and reduce the spread of the virus\nOn March 11, Gov. Jay Inslee restricted gatherings of more than 250 people in King, Snohomish and Pierce counties. Two days later he announced all schools would close for six weeks. And two days after that, with coronavirus infections and deaths still rising, he ordered the temporary shutdown of all bars, restaurants, gyms, hair and nail salons, and other social gathering places to stop the spread of Covid-19, and he revised his restrictions on gatherings down to 50 people maximum.\n\"This is bigger than all of us, and I am fully confident that Washingtonians will rise to this challenge to get back to a normal state of our life as soon as humanly possible,\" he said.\nA carpenter covers a closed store with plywood panels near the Pike Place Market in downtown Seattle amid the stay-at-home order.\nWashington was not the first to introduce a general \"stay-at-home\" mandate -- the governors of California, Ohio, New York, New Jersey and Illinois were ahead of Inslee, who took that move on March 23.\nBut Washington has not seen the sky-high spikes in cases and anticipated cases that New York and New Jersey are suffering, according to the Institute for Health Metrics and Evaluation at the University of Washington, whose research has been used by the White House task force.\nInslee referenced similar statistics from Johns Hopkins University at a news conference at which a screen showed the curve of new infections beginning to bend down.\nWashington Gov. Jay Inslee says it's much too early to know that the state is winning against coronavirus.\n\"This is suggestive that some of the things we're doing together is having some very modest improvement. The things we did two weeks ago are now appearing in our hospitals,\" Inslee said.\nBut he warned: \"We are not within 10,000 miles of champagne corks popping.\"\nNothing is certain in this new world of Covid-19. There are always caveats. Cities and rural areas differ greatly in both resources and residents' proximity to one another. Cities like New York, where public space is usually jammed with people, is seeing a tsunami-like surge of patients. There is still insufficient testing. But while the state of Washington is still seeing new cases and a rise in deaths, it now has the fifth highest number of deaths in the US. It was No. 1 for weeks, according to the Johns Hopkins data.\nOn the front lines inside the Covid-19 ICU at Harborview Medical Center, it's hard to get a good sense of the bigger picture, said Lynch, the infectious disease control chief.\n\"I'll just tell you that we saw more infections yesterday than the day before. And we look at the proportions of positives (on tests) and the proportions of positives are more than they were last week,\" Lynch said. \"When I look at those general trends, I see signs that the surge is still ahead of us. I certainly hope that I'm wrong.\"\nAs the medics treat their current patients and prepare for more, they do everything they can not to fall victim themselves. Doctors and nurses have become infected and died in China, Italy and now the US, too.\nSeattle Mayor Jenny Durkan raises a flag on the roof of the Space Needle reading, \"#We Got This Seattle,\" saying it was intended as a symbol of encouragement and solidarity.\nSo the Harborview/UW medicine doctors and nurses cover themselves in personal protection equipment -- a mask over nose and mouth, then a hood with a clear visor at the front and a hose at the back to pump in clean air.\nThese hoods could save lives, but Harborview Medical Center does not have enough of them. So, the staff is doing something that is not recommended -- using them over and over again.\n\"They do get cleaned inside and out so they can be reused. The way they were built was for one-time use, but that is not the way anymore,\" Lynch said. \"If we did that, we would already be out of them.\"\nGetting into the equipment is a meticulous dance. One person watches and maintains the checklist for every step, every connection, while the other person follows each direction carefully.\nGetting out of it is taken even more seriously. That's the time that experts believe medical staff are at the most danger of being exposed to coronavirus, and if Washington is to get its cases down, that simply cannot happen.\n\"What they do every day is heroic,\" Lynch said. \"Going and taking care of patients without protection is not acceptable.\"", "url": "https://www.cnn.com/2020/04/03/us/washington-seattle-coronavirus-numbers-sidner/index.html"}