{"authors": ["Mike Calhoun", "Jim Parrott", "Mark Zandi For Cnn Business Perspectives", "Mark Zandi For"], "date_download": "2020-05-04 17:01:51", "date_modify": "2020-05-04 17:01:51", "date_publish": "2020-04-10 14:19:19", "description": "Unfortunately for the mortgage servicers who collect these payments, they are still on the hook to the investors who provided the cash lent to mortgage borrowers.", "filename": "2020_04_10_perspectives_mor_86e6e58305793ef6e614fd99f2cc1249_index_1588611711.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409155242-houses-1104-file-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_perspectives_mor_86e6e58305793ef6e614fd99f2cc1249_index_1588611711.html", "title": "The Trump administration may turn a health crisis into a housing crisis", "title_page": "The Trump administration may turn a health crisis into a housing crisis (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Mike Calhoun is the president of the Center for Responsible Lending. Jim Parrott is non-resident fellow at the Urban Institute and co-owner of Parrott Ryan Advisors, which provides strategic advice on housing finance issues. Some of his clients are companies that make and service mortgages. Mark Zandi is chief economist for Moody's Analytics. The opinions expressed in this commentary are their own.\nCongress recently did the right thing by giving Americans suffering under the economic impact of the coronavirus a big break on their mortgage payments. If you've lost your job or seen a drop in your income because of the virus, and your mortgage is backed by the government, you can get up to six months of forbearance on your mortgage. If at the end of that period you are still under financial stress, you can get six more.\nIt's an unprecedented measure in keeping with the unprecedented nature of the economic crisis ahead.\nBut it also means that millions of borrowers are not going to send in their mortgage payments this month. Unfortunately for the mortgage servicers who collect these payments, they are still on the hook to the investors who provided the cash that was lent to mortgage borrowers. There is, after all, no free lunch. Congress hasn't made the repayment obligation disappear, but simply moved it from the borrower to the mortgage servicer. As these mortgages are guaranteed by the government, the mortgage servicers will eventually be paid back by the government. But that can take upwards of a year . In the meantime, the servicers must come up with billions of dollars a month to foot the bill for their borrowers.\nTo give one a sense of the amount of money we're talking about, if just one in four families with a mortgage takes Congress up on their offer of mortgage forbearance for six months, mortgage servicers will have to cover payments of more than $70 billion . If they take them up on it for the full year, servicers will have to cover over $140 billion, according to Moody's Analytics analysis. To put those numbers in perspective, last year, servicers had total net profits of less than $10 billion.\nThe arithmetic doesn't work. Only the very largest, best capitalized servicers would be able to handle that kind of strain. The rest would falter, and many would fail altogether.\nRead More", "url": "https://www.cnn.com/2020/04/10/perspectives/mortgage-payments-coronavirus-housing-crisis/index.html"}