{"authors": ["Sarah Mucha", "Maeve Reston"], "date_download": "2020-05-04 16:04:46", "date_modify": "2020-05-04 16:04:46", "date_publish": "2020-04-02 01:02:14", "description": "A phone call between President Donald Trump and former Vice President Joe Biden, the leading Democratic contender for his position, is in the works to discuss the coronavirus pandemic.", "filename": "2020_04_01_politics_joe-biden-trump-coronavirus_index_1588608286.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191205005729-joe-biden-donald-trump-split-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_joe-biden-trump-coronavirus_index_1588608286.html", "title": "Biden campaign says it will arrange call with Trump about coronavirus", "title_page": "Joe Biden campaign says it will arrange call with Trump about coronavirus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A phone call between President Donald Trump and former Vice President Joe Biden, the leading Democratic contender for his position, is in the works to discuss the coronavirus pandemic .\n\"Our teams will be in touch and we will arrange a call,\" said Kate Bedingfield, Biden's deputy campaign manager, in a statement Wednesday evening.\nThe potential steps toward a call come after Trump was asked about Biden's offer to speak with him at his daily coronavirus press briefing.\n\"I would absolutely take his call,\" Trump said. \"I would love to speak with him, sure.\"\nThe campaign had vaguely indicated willingness for a phone call earlier in the day, albeit with no concrete plan, after Kellyanne Conway, a counselor to the President, rebuked Biden for criticizing Trump's coronavirus response.\n\"I find it petty and partisan and completely unhelpful to the American population to have a former vice president, who was here for eight years, in his bunker in Wilmington just lobbing criticisms, reading from prepared notes and not that well,\" Conway said.\nBiden, for his part, has pushed back on any notion that his comments might politicize the pandemic, saying in an interview Monday on MSNBC, \"Everything that I have done has been designed to be constructive.\"\nHe added, \"The best I can do from my position is to lay out what I think should be done, how to do it, and when it's not being done, say why the experts say, 'This is what we should be doing. Let's do it.' \"\nTrump's willingness to speak to Biden about the coronavirus crisis would mark a shift in tone between the rivals.\nBiden has been sharply critical of the President's slow response to the crisis, accusing him of repeatedly misleading Americans about the risks of the virus and seeking to cast blame on others for shortages in personal protective equipment and flaws in testing\nDuring CNN's town hall with Biden last week, he criticized the President for sparring with governors who have been critical of the federal response (including Trump's remark that Washington Gov. Jay Inslee was a \"snake\").\n\"This is not personal. It has nothing to do with you, Donald Trump, nothing to do with you, do your job. Stop personalizing everything,\" Biden said at the town hall last Friday night.\nThe former vice president also wrote an op-ed on January 27 admonishing Trump as the \"worst possible\" leader to deal with the outbreak.\n\"I am concerned that the Trump administration's shortsighted policies have left us unprepared for a dangerous epidemic that will come sooner or later,\" Biden wrote at the time, when the United States had only a handful of confirmed coronavirus cases.\nHe has since striven to remain a relevant voice in the national conversation as attention is focused on the virus by conducting television interviews and news briefings from a basement studio at his home in Wilmington, Delaware.\nThough campaigning by all of the candidates -- Trump, Biden and Sen. Bernie Sanders of Vermont -- has been sharply curtailed while most of the country is operating under stay-at-home restrictions, the politicization of the pandemic has heated up on the airwaves\nBiden's campaign has released several digital coronavirus-related ads, some directly criticizing Trump and another pitching Biden as an empathetic leader in an implicit contrast with the President.\nOutside groups, including the super PAC supporting Biden's campaign, also have blasted Trump's response to the pandemic, accusing him of downplaying the severity of the crisis and suggesting that Democrats were exaggerating the potential impact of the pandemic to drag down his campaign.\nOn Wednesday, America First Action super PAC, which backs the Trump campaign, announced a $10 million ad buy that will target Biden in the key states of Pennsylvania, Michigan and Wisconsin.\nBiden told CNN's Brooke Baldwin on Wednesday afternoon that the President needs to act like a wartime president during the struggle against the pandemic.\n\"The President said he's a wartime president. This is a war against this virus. He should act like a wartime president,\" the former vice president said.\nThis story has been updated with background information.", "url": "https://www.cnn.com/2020/04/01/politics/joe-biden-trump-coronavirus/index.html"}