{"authors": [], "date_download": "2020-05-04 20:18:20", "date_modify": "2020-05-04 20:18:20", "date_publish": "2020-04-04 14:55:23", "description": "BRISTOL, R.I. (AP) — Two teams of college students from Rhode Island have swept the top two spots in a national business competition. The teams from Roger Williams University recently took...", "filename": "_5e512e920b410ce73982c7d83c5ffe89_1588623500.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5e512e920b410ce73982c7d83c5ffe89_1588623500.html", "title": "Rhode Island college students win national business contest", "title_page": "Rhode Island college students win national business contest", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BRISTOL, R.I. (AP) — Two teams of college students from Rhode Island have swept the top two spots in a national business competition.\nThe teams from Roger Williams University recently took first and second place in the Association for Information Systems’ national collegiate analytics challenge, the Bristol school said in a statement.\nThe students had been preparing to pitch their presentations in-person, but the final round shifted from Illinois State University to Zoom video conferencing because of the coronavirus pandemic.\nMatthew Feldman and Misha Dubuc took first place for their look at the way elementary school book fairs are held and a plan to pivot Scholastic into the subscription service.\n“Coronavirus helped us in a way because, right now, their main distribution channels are obsolete. They’re probably racing to find a way to sell books to people. It’s an opportune time for them to launch a subscription service,” Feldman said in a statement.\nThe team of Brooke Travers, Madison Young and Hannah Dennette took second place for looking at practical ways to increase book sales with a number of recommendations from creating culturally distinct incentive programs for each region of the U.S. market to digitizing the book club catalog to make ordering more efficient.", "url": "https://apnews.com/5e512e920b410ce73982c7d83c5ffe89"}