{"authors": ["Dan Merica"], "date_download": "2020-05-04 16:16:26", "date_modify": "2020-05-04 16:16:26", "date_publish": "2020-04-03 19:11:20", "description": "Pete Buttigieg launched a new super PAC on Friday, hoping to turn the excitement around his presidential campaign into a political organization that will help a new generation of Democratic leaders.", "filename": "2020_04_03_politics_pete-buttigieg-pac_index_1588608986.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200302154716-06-buttigieg-south-bend-0301-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_pete-buttigieg-pac_index_1588608986.html", "title": "Pete Buttigieg launches a new PAC aimed at helping down-ballot Democrats", "title_page": "Pete Buttigieg launches a new PAC aimed at helping down-ballot Democrats - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Pete Buttigieg launched a new super PAC on Friday, hoping to turn the excitement around his presidential campaign into a political organization that will help a new generation of Democratic leaders.\nThe group, called \"Win the Era\" in a call back to a line he often used during his failed presidential run , will raise money and distribute it to down-ballot Democrats with the express purpose of helping lesser-known candidates.\nThe group has a five-part criteria for endorsing candidates, focusing on politicians who represent a generational shift in politics, come from a diverse cross section of the United States, are campaigning in typically conservative areas of the country, are pushing for policies that address topics his 2020 campaign advocated for and those who are \"in it for the right reasons,\" according to an email Buttigieg sent out.\n\"This is a big part of how we'll continue the work we started with the campaign, and it's only possible because of your hard work and our shared vision for the country,\" Buttigieg writes in the email. \"Our nation and world are in a period of upheaval right now, which will make it more important than ever to support and elect good leaders this November and into the future.\"\nThe announcement comes as the spread of the novel coronavirus has all but halted American life, including the in-person portion of the presidential campaign.\nRead More", "url": "https://www.cnn.com/2020/04/03/politics/pete-buttigieg-pac/index.html"}