{"authors": ["Kevin Mcgill", "Melinda Deslatte"], "date_download": "2020-05-04 20:08:48", "date_modify": "2020-05-04 20:08:48", "date_publish": "2020-04-08 16:49:26", "description": "NEW ORLEANS (AP) — A simple gift from a bitter political rival — a medical mask emblazoned with Louisiana's state seal — has helped Democratic Gov. John Bel Edwards pound home a bipartisan plea...", "filename": "_a1d9cc0990e00df1b4bf219f8d057708_1588622928.html", "image_url": "https://storage.googleapis.com/afs-prod/media/5a9fe5c5efe2427692b1ba7a1acdbac8/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a1d9cc0990e00df1b4bf219f8d057708_1588622928.html", "title": "Louisiana responds to coronavirus with rare bipartisanship", "title_page": "Louisiana responds to coronavirus with rare bipartisanship", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this March 19, 2020 file photo, a streetcar conductor wears a mask due to the coronavirus pandemic as she runs her route on St. Charles Ave. in New Orleans. Where political divides marred early recovery efforts after Hurricane Katrina in 2005, Louisiana is showing rare political unity in the fight against the new coronavirus. (AP Photo/Gerald Herbert, File)\nFILE - In this March 19, 2020 file photo, a streetcar conductor wears a mask due to the coronavirus pandemic as she runs her route on St. Charles Ave. in New Orleans. Where political divides marred early recovery efforts after Hurricane Katrina in 2005, Louisiana is showing rare political unity in the fight against the new coronavirus. (AP Photo/Gerald Herbert, File)\nNEW ORLEANS (AP) — A simple gift from a bitter political rival — a medical mask emblazoned with Louisiana’s state seal — has helped Democratic Gov. John Bel Edwards pound home a bipartisan plea for people to stay at home and avoid spreading the new coronavirus.\nThe token from Republican Attorney General Jeff Landry — and Landry’s pledge to stand “shoulder to shoulder” with Edwards in the fight against the pandemic — marked a jaw-dropping truce in a state known for cantankerous politics.\nThe rare show of unity comes in an era of deep, political divides nationwide that have persisted, and in some cases, worsened amid the virus pandemic, even as some call for leaving such disputes aside in favor of working together.\nAnd it seems to be having a positive effect: The growth in the number of hospitalized COVID-19 patients in Louisiana appears to have slowed, and the number of patients on ventilators was down as of Wednesday afternoon.\nBefore his recent demonstrations of support, Landry had been at odds with the governor over policy and political turf since both took office in 2016, while Edwards’ more than four years in office had been marked by ugly budget battles with a Republican-dominated Legislature.\nEven President Donald Trump, who called Edwards “a disaster” while campaigning for a Republican to replace him in last year’s state election, had rare words of praise for the governor.\n“In the case of Louisiana, we have a very good governor, John Bel Edwards, though he’s a Democrat,” the president told Fox News on March 26.\nRepublican Sen. John Kennedy, a frequent cable news talking head and critic of Edwards, is on board as well. “I’m not going to second-guess Gov. Edwards,” he said. “We’re all working together.”\nRepublican House Speaker Clay Schexnayder said he initially thought Edwards went too far with a statewide stay-at-home order, but he quickly changed his mind. “It’s actually kind of nice that we’re not all mad at each other right now,” he said in a recent interview.\nThe current atmosphere of bipartisanship marks a striking contrast to 2005, when the response to catastrophic levee failures after Hurricane Katrina was marked by disagreements between the late Democratic Gov. Kathleen Blanco and Republican President George W. Bush’s administration; and the ineffective efforts of Democratic New Orleans Mayor Ray Nagin, who later went to federal prison for corruption.\nBipartisan unity in the age of COVID-19 may be due to the virus’s broad scope, said Pearson Cross, an associate dean and political science professor at the University of Louisiana-Lafayette. Katrina hit a heavily Democratic part of a state that had a Democratic governor in 2005. It was easy for a Republican administration to lay the problems with recovery at Blanco’s feet, Cross said. The pandemic affects Republican-led states as well as Democratic ones, making it harder to try to single out a Democratic administration for problems with the response.\n“That being said, John Bel Edwards has clearly gone out of his way to make nice with President Trump,” Cross said.\nThe unified message in the time of the coronavirus appears to be having a positive effect. Last month there were fears that Louisiana would, by now, have reached a grim coronavirus reckoning on par with the devastated country of Italy, with too few life-saving ventilators to go around and the number of critically ill patients exceeding the number of available beds.\nInstead, Edwards is sounding notes of extremely cautious hope.\n“It appears we’re trending in a positive direction because of the mitigation measures that people have been taking,” the governor said at his daily news conference Tuesday.\nThe reasons for hope lie in the number of those requiring hospitalization. Although it was nearly 2,000 as of Wednesday, that number had dropped slightly from the day before and officials believe the overall rate of growth has slowed. The number of patients requiring ventilators to do their breathing for them had dropped to 490, down from 519 Tuesday and 552 Monday.\nEdwards credited medical professionals with fine-tuning their use of ventilators, lessening the amount of time patients spend on them and easing the need to stockpile them.\nMitch Landrieu, who oversaw a revitalized Katrina recovery effort as mayor from 2010 to 2018, credits his successor, fellow Democrat LaToya Cantrell, and Edwards with strong early responses to COVID-19′s emergence in Louisiana in March.\nThose efforts included early, firm orders for social distancing and business closures, coupled with measures to convert a convention center into a hospital space.\nLandrieu is harshly critical of Trump for downplaying the virus’s threat earlier this year and for lashing out at governors who criticize his handling of the pandemic. Landrieu said Edwards “has done a great job of trying to keep his powder dry with the president under difficult circumstances” while keeping all state officials, Republican and Democrat, “in the loop because you’re one team.”\nLouisiana’s situation is still far from rosy. Known cases have spread to 63 of Louisiana’s 64 parishes. The New Orleans area remains a hot spot, with more than half of the more than 17,000 known Louisiana cases, a number that grows daily, in part because the state’s testing capacity is improving. The number of Louisiana deaths attributed to the disease increased by 70, to 652 as of Wednesday.\n“Just because we think we’re starting to flatten the curve doesn’t mean our job is over,” Edwards said Tuesday. “In fact, now is the time to double down.”\n___\nDeslatte reported from Baton Rouge, Louisiana.", "url": "https://apnews.com/a1d9cc0990e00df1b4bf219f8d057708"}