{"authors": ["Renee Valdes"], "date_download": "2020-05-04 16:24:54", "date_modify": "2020-05-04 16:24:54", "date_publish": "2020-04-06 08:01:02", "description": "Last week, a 99-year-old New Jersey man who went to an engagement party was arrested in New Jersey for defying the state's ban on gatherings. In a separate case, a 100-year-old man violated a stay-at-home order by attending a funeral.", "filename": "2020_04_06_us_older-people-_2d59bbb9e5683f7e306e68e154dd0deb_index_1588609494.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330103621-01-seniors-coronavirus-invincible-super-tease.jpeg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_us_older-people-_2d59bbb9e5683f7e306e68e154dd0deb_index_1588609494.html", "title": "Even with a pandemic, many older Americans are carrying on as usual", "title_page": "Even with a pandemic, many older Americans are carrying on as usual - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Last week, a 99-year-old New Jersey man who went to an engagement party was arrested in New Jersey for defying the state's ban on gatherings. In a separate case, a 100-year-old man violated a stay-at-home order by attending a funeral.\nWhile not as severe, many elderly Americans are flouting shelter-in-place directives. They're hitting stores, visiting family and inviting over friends and neighbors.\nFor a group that's considered very high risk for contracting coronavirus , they're carrying on life as usual -- much to the worry of their grown children.\nTalk to a few of them and they'll tell you there are several reasons why.\nFor some, it's cabin fever\nAlke Muirhead, 95, has been cooped up and she's tired of it. Though increasingly she's staying in, she hit the Trader Joe's in Santa Fe near her home recently. She was thrilled when a worker gave her flowers from the shelf.\nSometimes, Muirhead hops in the car just to drive around. She drops in to visit her daughter-in-law Apple and grandsons Tristan and Trevor. She admits, though, that she's doing so less and less with the stay-at-home restrictions in New Mexico.\n\"It's good, old-fashioned cabin fever ... it's as simple as that,\" Muirhead told CNN. \"I'm probably super lucky I can still operate on my own and I can drive. It's something that helps because you concentrate.\"\nSome aren't tech savvy\nWith self-isolation, life has moved online. But Suzy Jennings, 76, is old school. She uses the internet but doesn't know how to order plants, groceries or use online banking.\nEarlier this week, the Avondale Estates, Georgia resident hit the bank, then ran other errands. On Friday, she said she was \"bad\" and went to Lowe's to pick out hostas. That's the second time in as many weeks she hit a nursery for plants.\n\"I shouldn't have done it over a few hostas,\" Jennings said. \"But everybody was there buying flowers and things.\"\nSuzy Jennings (left), her son William and his wife, Mary.\nTo keep his mom at home, William Jennings, who lives in New York, is ordering her groceries and having them delivered. He's not yet aware of his mom's latest jaunt.\n\"The sum of her technical prowess is using her speaker phone and there is no way she could navigate on her own the process of downloading the app, setting up and account ordering ... etc.,\" he told CNN.\n\"My mom is quite a strong woman. She's fiercely independent and marches to her own drum. It took her longer than I would have liked for her to understand the severity of the situation. To make matters worse, she is very much a social butterfly.\"\nHe might just have more of a bargaining chip.\n\"My mom has her first grandchild being born this July, so anything I can do to keep her safe and secluded is well worth it.\"\nSome just need human interaction\nOf course, Suzy Jennings is concerned about the coronavirus. She knows the risks, admitting she has serious health issues.\nBut staying social keeps her occupied during the long days. Sometimes, she just sits on her porch and talks to neighbors passing by.\nLast week, she took the ultimate chance inviting a neighbor over to drink Prosecco on her porch. Of course they sat six feet apart.\n\"It went great,\" she said. \"My friend thought it was a great idea to have a change of pace. I consider myself a people and party person. I might just put a few chairs out every night to see if anyone wants to stop and have a glass of wine. A lot of people need that social outlet.\"\nSome are leaving things to chance\nIn the United States, there are at least 245,600 coronavirus cases, including more than 6,100 patient deaths. According to the CDC, 8 out of 10 deaths among adults with confirmed Covid-19 reported in the US have been in those 65 years old and older.\nSuzy Jennings wants to put out a few chairs each night to see if neighbors want to stop and have a glass of wine\n\"At my age, you better get familiarized with your future,\" Muirhead said. \"I'm already overstaying my welcome so to speak by many years. So if it happens, it happens.\nI would hope that if it happens, I would not have to go on any ventilator.\"\nSuzy Jennings said her faith is helping her get through.\n\"I have faith in God, which gives me a lot of peace in knowing that I need to trust that everything is going to be all right,\" she said.\nFor the children, it's a double headache\nAs for the children of these older adults, they're worried sick. Many think their parents act like teenagers. Nadine Finigan-Carr, a professor at the University of Maryland School of Social Work, said she's hearing all about it from friends. She has an elderly father living in Brooklyn, New York.\n\"The roles are very much reversed,\" Finigan-Carr told CNN, adding it's like the old public service commercial from the late 1960s, \"It's 10 p.m. Do you know where your children are?\"\nThose commercials came about due to riots and civil unrest at the time. Finigan-Carr posted a screengrab of the PSA with 'children' replaced by 'Baby Boomer parents' -- \"It's 10 p.m. Do you know where your Baby Boomer parents are?\"\nTina Muirhead-Walden of Dunwoody, Georgia, is worried about her mom in New Mexico being on her own.\n\"Once you know that your parents are aware of the dangers and they know what your feelings are, it's really up to them,\" Muirhead-Walden said. \"Our parents, if they are lucky, get to decide how they want to live and die, so I feel I have to respect that decision. I may not like it, but I am at peace with my parents living their lives on their own terms.\"\nHere's how to deal with your parents\nMany parents prefer independence if they're still able in body and mind. But there are risks for older people if they're isolated and social distancing.\nDr. Laurie Archbald-Pannone, a geriatrician and professor at the University of Virginia in Charlottesville, Virginia, says it's important to balance social distancing with self-isolation.\n\"Both are critically important right now,\" Archbald-Pannone told CNN.\nShe offers that people should talk more on the phone, get outside and take walks for fresh air and think through how to get essentials, including drugstore and grocery delivery, even if it means asking for help. She suggested trying community-based activities from home.\n\"That shift of roles is challenging,\" Archbald-Pannone said. \"No one conversation will fix anything. These are ongoing conversations and ongoing discussions centered in love and relationship.\n\"There's no easy answer.\"", "url": "https://www.cnn.com/2020/04/06/us/older-people-coronavirus-invincible-high-risk-wellness-trnd/index.html"}