{"authors": ["Lisa Respers France"], "date_download": "2020-05-04 16:16:12", "date_modify": "2020-05-04 16:16:12", "date_publish": "2020-04-03 18:13:34", "description": "Janet Broderick is just happy to be alive.", "filename": "2020_04_03_entertainment_janet-broderick-coronavirus_index_1588608972.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403143410-matthew-broderick-janet-broderick-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_entertainment_janet-broderick-coronavirus_index_1588608972.html", "title": "Matthew Broderick's sister Janet thought coronavirus would kill her", "title_page": "Matthew Broderick's sister Janet thought coronavirus would kill her  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "The older sister of actor Matthew Broderick has survived after becoming critically ill with Covid-19, and is now sharing her story.\nBroderick, who is a rector at All Saints' Episcopal Church in Beverly Hills, told New York magazine's Intelligencer that while hospitalized she told herself, \"I'm going to die,\" as she began planning her funeral.\n\"I was very, very sick,\" she said. \"I could tell I was actually in big trouble.\"\nBroderick said she began feeling ill after returning home from an annual conference in Kentucky. She later found out another attendee at the conference had tested positive for the coronavirus.\nHer symptoms of body aches, swollen glands, fever, a dry cough and foggy thinking sent her to Cedars-Sinai Medical Center in Beverly Hills where she was tested for the virus.\nBut Broderick said she took a turn for the worse and was placed on oxygen when she began having breathing difficulty. She ended up in the intensive care unit.\n\"I was close to death. I kind of had gone off the cliff — my lungs had to make a decision,\" she said. \"I had pneumonia and water in my lungs. I remember thinking, 'Calm down and go to sleep.'\"\nAfter six days in the hospital where doctors administered antibiotics and Kaletra, an antiviral medicine used to treat HIV, she began to get better.\nBroderick also saw a higher power at work, saying she \"must have had 200 people praying for me\" on one of her sickest nights.\n\"I know many people would be very angry to hear that, because you can pray for somebody and they would die,\" she said. \"That's absolutely true. Whatever was going to happen was going to happen.\"\nShe didn't fear death, Broderick said.\n\"But I don't mean to say I didn't take it seriously,\" she said. \"I realized in a very, very deep and very real way that I had absolutely no control.\"\nHer illness made headlines and Broderick also said she believes she was given preferential treatment because she is a member of the clergy and has a famous brother.\n\"I think I'm absolute living proof that this system is completely corrupt,\" she said. \"My [general practitioner] didn't know I was Matthew Broderick's sister and didn't care very much. But as soon as I got a hold of the guy at the hospital who knew who Matthew was, I was given the name of the head of the emergency room.\"\nHer brother told the publication he would text his sister as often as he could as he was was in rehearsals for the revival of Neil Simon's 1968 comedy \"Plaza Suite\" which reunited him on Broadway with his wife, Sarah Jessica Parker.\n\"I was nervous and scared, but the reports at the time were saying people would be okay,\" Matthew Broderick said. \"It was shocking.\"\nShe was released to quarantine at her Beverly Hills home where she said she was feeling both better and grateful.\n\"I'm alive,\" Broderick said. \"Thank God, really.\"", "url": "https://www.cnn.com/2020/04/03/entertainment/janet-broderick-coronavirus/index.html"}