{"authors": [], "date_download": "2020-05-04 20:24:23", "date_modify": "2020-05-04 20:24:23", "date_publish": "2020-04-29 19:46:54", "description": "“They’ll be fading out because now the governors are doing it,\" the president told reporters in the Oval Office Wednesday.", "filename": "entry_trump-says-will-not-extend-social-distancing-guidelines_n_5ea9d738c5b6ad0a43179853_1588623863.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9d7ec3000009512155241.jpeg?cache=qaij1pfv3t&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_trump-says-will-not-extend-social-distancing-guidelines_n_5ea9d738c5b6ad0a43179853_1588623863.html", "title": "Trump Says He Won't Extend Social Distancing Guidelines", "title_page": "Trump Says He Won't Extend Social Distancing Guidelines | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "WASHINGTON (AP) — President Donald Trump said Wednesday the federal government’s coronavirus social distancing guidelines will be “fading out” when they expire Thursday, counting on states taking charge as they pivot to reopening .\nThe administration says the its cautionary guidance issued 45 days ago has been incorporated into recommendations given to the states on how they can begin gradually easing restrictions and reopening their economies.\n“They’ll be fading out because now the governors are doing it,” Trump told reporters in the Oval Office Wednesday as he met with John Bel Edwards, the Democratic governor of Louisiana.\nEdwards told Trump that his state has turned the corner in its fight against the virus, meeting on a day that brought hopeful signs for a new treatment but also grim economic numbers.\nThe U.S. economy shrank at a 4.8% annual rate last quarter — a precursor to far grimmer reports that are expected this summer from the pandemic that has shut down much of the country and triggered a severe recession.\nWhile Trump spoke confidently of the governors steering recovery in their states, transition is not going smoothly everywhere.\n“I just wanted to congratulate you,” Trump said to Edwards, commending him on the job he’s done after New Orleans became one of the nation’s coronavirus hot spots.\nHowever, Edwards is currently under fire from Republican lawmakers in his state after he extended Louisiana’s stay-at-home order through May 15. As he was in Washington, some GOP legislators were trying to rally support to take the extraordinary step of trying to override the governor’s emergency decision-making about the state’s outbreak.\nDuring the meeting, Trump, who has both threatened to force states to reopen and said decisions will be left to them, confirmed the White House will not be extending its “30 Days to Slow the Spread” guidelines when they expire Thursday.\nThose guidelines — which were originally supposed to last 15 days and were then extended an additional 30 — encouraged Americans to work from home and avoid restaurants and discretionary travel and advised older Americans and those with serious underlying health conditions to isolate themselves.\nVice President Mike Pence said the guidelines have been incorporated into the new guidance issued by the White House earlier this month that lays out how states can gradually begin to reopen as the rate of new cases slows.\nThe White House on Wednesday was also talking up the prospect of an experimental drug, Remdesivir, which proved effective against the virus in a major new study run by the National Institutes of Health, shortening the time it takes for patients to recover by four days on average.\nDr. Anthony Fauci, the nation’s top infectious diseases expert, said the drug reduced the time it takes patients to recover by 31% — 11 days on average versus 15 days for those just given usual care.\n“It’s highly significant,” said the usually cautious doctor. “What it has proven is that a drug can block this virus.”\nThe White House and Trump in particular have been eager to give the country positive news as they work to move past the crisis and rebuild the economy, even as the country’s death tally continues to rise. The U.S. has now recorded more than 58,000 deaths from the virus, surpassing the total number of Americans who were killed in the Vietnam War. More than one million people have now tested positive.\nTrump said that number has risen so high in large part because of increased U.S. testing.\n“That’s a tremendous amount and the reason is because of testing,” he said.\nThe U.S. has dramatically increased its testing after a slow and rocky start, but many health experts say the country still must do more — as many as 5 million a day — to safely reopen the economy. Otherwise, they warn, cases will skyrocket as Americans return to work, creating another deadly spike.\nTrump has dismissed that recommended number, calling it unnecessary and a “media trap.”\nSeparately on Wednesday, Jared Kushner, the president’s son-in-law and senior adviser, told “Fox and Friends” that the administration is preparing the country to “get as close back to normal as possible as quickly as possible.”\n“I think what you’ll see in May, as the states are reopening now, is May will be a transition month,” he said. “And I think you’ll see by June, a lot of the country should be back to normal and the hope is that ... by July the country is really rocking again.”\n___\nAssociated Press writer Darlene Superville contributed to this report.", "url": "https://www.huffpost.com/entry/trump-says-will-not-extend-social-distancing-guidelines_n_5ea9d738c5b6ad0a43179853"}