{"authors": ["Senior Culture Reporter"], "date_download": "2020-05-04 20:20:36", "date_modify": "2020-05-04 20:20:36", "date_publish": "2020-04-29 15:01:13", "description": "Director Jake Wilson used his collection of vintage toys to pay homage to Smith and Lovato's new dance-pop hit from his Los Angeles apartment.", "filename": "entry_sam-smith-demi-lovato-im-ready-toy-video-tribute_n_5ea888a8c5b68fa1edcd9a1f_1588623636.html", "image_url": "https://img.huffingtonpost.com/asset/5ea89c9b2500004c10eb083a.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_sam-smith-demi-lovato-im-ready-toy-video-tribute_n_5ea888a8c5b68fa1edcd9a1f_1588623636.html", "title": "Sam Smith And Demi Lovato Are Action Figures In Reimagined 'I'm Ready' Video", "title_page": "Sam Smith And Demi Lovato Are Action Figures In Reimagined 'I'm Ready' Video | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Pop culture may be at a near standstill during the coronavirus pandemic, but that didn’t stop Sam Smith and Demi Lovato from filling the void with a sterling new single this month.\nSmith has described “I’m Ready,” which dropped April 16, as “2020 ABBA.” Indeed, the song’s thumping bass line and empowering lyrics have the feel of a dance-pop classic.\nSadly, it may be a while before “I’m Ready” will be heard as Smith and Lovato had intended it ― that is, at maximum volume amid a sweaty crowd of revelers on a dance floor. Nonetheless, the duet gave writer and director Jake Wilson the chance to envision what that might eventually look like by staging a “toy version” of their music video.\nReleased last week, Wilson’s “I’m Ready” replicates the feel of Smith and Lovato’s original, with action figures of Disney’s Hercules and “X-Men” superhero Storm taking the place of the two pop stars. Together, the characters lead other toys ― including a Britney Spears Funko doll and a miniature Barack Obama ― in a pint-sized LGBTQ Pride parade before executing a stop-motion dance routine.\nWilson, who has worked with Lizzo and the Jonas Brothers on videos and other musical projects, told HuffPost he was “itching to be creative” while self-isolating in Los Angeles during the coronavirus crisis.\nCourtesy of Jake Wilson Using his toy collection to reimagine Sam Smith and Demi Lovato's new video \"made me feel like a kid again,\" said director Jake Wilson.\n“I ran into problems I’ve never had with actors before,” Wilson explained, “like Storm falling over mid-take and knocking down half of her castmates, or me spending 90% of the shoot literally laying on the floor, as our ‘locations’ were primarily on the ground.”\n“I also ran into problems I have on normal shoots, like losing daylight through my blinds as 20 toys and a tripod were set up in their precise places, meaning I’d have to pick up filming the following day,” he continued.\nThe end result, Wilson said, required five days of shooting and editing, but “made me feel like a kid again.”\n“The whole idea felt like a perfect quarantine project,” he added.\nAfter Wilson posted his reimagined “I’m Ready” on social media, the video was liked by Olympian Gus Kenworthy, NPR journalist Ari Shapiro and former Pussycat Doll Ashley Roberts, among others. No one’s praise, however, was greater than Smith’s, who reposted the clip to their Instagram account with the caption, “I am SCREAMING!”\nCalling Wilson “so fucking clever and brilliant,” Smith added: “The thought of you making this during isolation makes my heart cry.”\nWatch Jake Wilson’s reimagined “I’m Ready” video:", "url": "https://www.huffpost.com/entry/sam-smith-demi-lovato-im-ready-toy-video-tribute_n_5ea888a8c5b68fa1edcd9a1f"}