{"authors": ["Eric Bradner"], "date_download": "2020-05-04 16:28:40", "date_modify": "2020-05-04 16:28:40", "date_publish": "2020-04-07 10:11:38", "description": "Long lines of voters, many of them wearing face masks, stretched for blocks through Milwaukee early Tuesday as Wisconsin held its primary in the middle of a pandemic.", "filename": "2020_04_07_politics_wisconsin-primary-coronavirus_index_1588609720.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407102830-03-wisconsin-voting-0407-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_wisconsin-primary-coronavirus_index_1588609720.html", "title": "Wisconsin holds its primary election in the middle of a pandemic", "title_page": "Wisconsin holds its primary election in the middle of a pandemic - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Long lines of voters, many of them wearing face masks, stretched for blocks through Milwaukee early Tuesday as Wisconsin held its primary in the middle of a pandemic.\nRepublicans who have insisted on keeping the election on schedule won two legal battles Monday, as the state Supreme Court blocked Democratic Gov. Tony Evers' bid to delay it until June and the US Supreme Court reversed a lower court's ruling that gave voters six extra days to return their ballots by mail.\nEvery other state with an election scheduled for April postponed their contest or shifted it to by-mail voting only . But Monday's court decisions mean Wisconsin -- with 2,511 reported cases of coronavirus and 85 dead as of late Monday night -- is pressing forward, though votes won't be counted until at least April 13.\nIt has positioned Wisconsin as the first battleground over voting rights in a year in which the question of how elections are conducted could be shaped by the coronavirus pandemic, as Democrats seek funding for expanded vote-by-mail options across the nation and Republicans express concerns about election security.\nVoters line up outside of a permanently closed Sears before polls open at the Janesville Mall on Tuesday, April 7, 2020, in Janesville, Wis.\nLines early Tuesday as voting began were long: So many poll workers quit that Milwaukee consolidated its 180 polling places down to just five locations -- and in those locations, voters stretched around multiple blocks . Staffing at polling places looks different: Nearly 300 of the state's National Guard troops will be replacing volunteers who quit.\nAnd thousands of people requested absentee ballots ahead of last week's deadline, but they won't receive those ballots in time to mail them back, according to data reported by local clerks to the Wisconsin Elections Commission. Those people will be forced to choose between voting in person or skipping the election.\nDressed in full medical protective gear -- a mask, gloves and a gown -- Republican state Assembly Speaker Robin Vos, who said he'd been instructed to wear the equipment, volunteered at a polling place in Burlington. Vos had opposed efforts to make Wisconsin's election a by-mail-only contest and successfully fought in court to force the election to take place without delay. He told reporters Tuesday that \"you are incredibly safe to go out.\"\nHe blamed Milwaukee city officials for failing to open more polling places as lines stretched for hours there.\n\"It made no sense to cancel the election and just push it off to a future date with no idea how it was going to work and no better plan than people have done right here today,\" he said.\n\"We have no guarantee that it's going to be any safer in June than it is right here today,\" Vos said, noting that \"there's a chance this virus is going to come back some time in the fall.\"\nVos also gave voters inaccurate information: He said the thousands of people who requested absentee ballots that hadn't yet arrived in the mail could call their local clerks on Tuesday and ask for absentee ballots to be emailed to them. That is false, Wisconsin Elections Commission administrator Meagan Wolfe said Monday night.\n'Here we are'\nOn Tuesday morning, voters and poll workers described the unprecedented circumstances they faced at the polls.\nA Milwaukee Journal Sentinel photographer captured a moment that went viral on social media: A woman standing in line outside a polling place held a sign that said simply, \"This is ridiculous.\"\nA defining photo of our current time....\ncaptured in Milwaukee today by @Pmcknightnews, an intern with the @journalsentinel. pic.twitter.com/pCFjhOPuep — Dianne Gallagher (@DianneG) April 7, 2020\nOutside a curbside voting station, Sami Kleiber tweeted that -- after requesting an absentee ballot that never arrived -- she was waiting in a line of more than 30 cars.\nJust going to vent for a minute. I submitted for an absentee ballot on Mar 17 and never got it. I reached out to my municipal clerk Mar 31 and they were going to send another one. Never got it. And now I'm in a 30+ car line to vote in person. I will persevere. pic.twitter.com/XyUWsgdlXa — Sami Kleiber (@sami_kleiber) April 7, 2020\nKleiber told CNN she wound up going inside to vote.\n\"It seemed like they tried to keep everything separated and handed out sterilized pens and hand sanitizer,\" she said. \"Some of the staff had masks and maybe 25% of the voters. There were lines on the ground for six feet apart and I would say people were adhering to that.\"\nIn Milwaukee, Chris Williams tweeted photos of long lines waiting to vote.\nLines around the block to vote in #WisconsinPandemicVoting. Just wanted to share this insanity. #lacheesarie pic.twitter.com/Vbky5GE6Yt — Chris Williams (@n0th00tie) April 7, 2020\nIn Milwaukee standing on line to vote in the WI Primary and Local Election during the Pandemic. Thanks a million WI Leg, WI Supreme Crt, and SCOUS. #WisconsinPandemicVoting #WisconsinPrimary pic.twitter.com/75juwFDDSs — Chris Williams (@n0th00tie) April 7, 2020\nHe told CNN he waited in line for an hour and 20 minutes to vote. \"I was not nervous, my wife was more than I, but it is my civic duty that my family fought for me to vote. I would have preferred absentee ballot or a delay, but here we are,\" Williams said.\nKatherine Wilson volunteered as a poll worker in Appleton, telling CNN that \"it made me so angry to think of all those who may be silenced by the threat of the virus or the inability to vote absentee.\"\nShe said the situation there wasn't as bad as it was in Milwaukee, and that she wished poll workers had been asked if they were willing to travel.\n\"We were provided gloves and sanitizer, as well as little plexiglass shields,\" she said. \"I am lucky and have an N95 mask I've been saving for today from a home improvement project. We taped standing spaces on the floor to keep people six feet apart, and the pleasant young National Guardsmen are making sure not too many people enter at once. We are also handing out new pens for each ballot.\"\nNew election procedures\nState and local elections officials were forced to craft procedures over the last few weeks to conduct the election despite the public health concerns.\nThe Wisconsin Elections Commission worked with the state's health department to develop procedures for in-person voting that includes a public health checklist for poll workers, limiting how many people can be in each location at a time and making signs to let voters know what to do if they are experiencing symptoms. Voters will also be asked to sanitize their hands at the start and end of the process.\nAt their polling locations, voters may see tape on the floor with six-foot line designations as well. When they step up to poll book tables, there will be six-foot markers on both sides for voters and poll workers. Voters will step up to the table when instructed, set down their ID, and step away while the poll worker examines (but doesn't touch) the ID. The poll worker will then open the poll book for the voter to sign, step away and ask the voter to sign it with a provided pen that they can keep or discard after voting.\nLate moves lead to confusion\nThe question of whether to hold the election Tuesday has turned into a bitter partisan battle in recent days. But Evers lagged far behind other governors in moving to delay his state's primary, waiting until 11 days before the election to ask the GOP-led legislature to send every voter a ballot by mail -- a request Republicans immediately rejected -- and until Monday to sign an executive order that would delay the election until June 9, a move the conservative-dominated state Supreme Court halted.\nThose late moves led to confusion and chaos for local elections officials, who were navigating severe shortages of poll workers and a surge in absentee ballot requests.\nNearly 1.3 million people had asked for absentee ballots, according to the Wisconsin Elections Commission's tally, which is based on reports by local clerks. Nearly 550,000 of those ballots had not yet been returned as of Monday morning -- and 11,090 people requested ballots but had not even been mailed those ballots.\nThe US Supreme Court's decision Monday required that, in order to be counted, absentee ballots must be postmarked no later than Tuesday and must arrive by April 13.\nThe thousands of people who requested ballots but will not receive them in time for their ballots to be postmarked by Tuesday, Wisconsin Elections Commission administrator Meagan Wolfe told the commission's six members on an emergency call Monday night, can only vote in person.\nWhile in-person voting will take place Tuesday, Wisconsin won't count its results until April 13 -- a delay that US District Judge William Conley had ordered and that the US Supreme Court did not strike down Monday, even as it reversed other portions of Conley's decision.\nThe question of when to count votes was the cause of confusion in Monday night's emergency meeting of the state elections commission, in an exchange that demonstrated the uncertainty surrounding how to move forward in the wake of Monday's court rulings.\n\"We're not going to report the results until the following week,\" said Dean Knudson, the Republican-appointed commission chair.\n\"The court said that was unconstitutional,\" shot back Mark Thomsen, a Democratic appointee.\n\"It's basically unclear,\" said Republican Robert Spindell Jr.\nAfter consulting with the commission's attorney, members agreed that votes couldn't be counted until the deadline of 4 p.m. on April 13 that Conley had set for absentee ballots to be returned and the Supreme Court left in place.\nThe commission's meeting capped a day of chaos in Wisconsin.\nEarly Monday afternoon, Evers -- who had previously said he had neither the desire nor the authority to delay the election -- signed an executive order doing just that. Evers said in the order that \"no Wisconsinite should ever have to choose between exercising their constitutional right to vote and being safe, secure, and healthy.\"\nWisconsin's Republican state legislative leaders, Assembly Speaker Robin Vos and Senate Majority Leader Scott Fitzgerald, immediately asked the state Supreme Court -- where Republicans have a 5-2 majority -- to block Evers' executive order. The court, meeting virtually because of the coronavirus pandemic, quickly did so, voting 4-2 on partisan lines, with one member abstaining because he is on the ballot Tuesday.\n\"The state's highest court has spoken: the governor can't unilaterally move the date of the election,\" Vos and Fitzgerald said in a joint statement.\nWisconsin Republicans have in recent years enacted restrictive voter identification laws, and Vos and Fitzgerald said in recent days that they were concerned the election would not be secure if ballots were allowed to be returned after election day.\nOn the ballot Tuesday\nFor voters to decide Tuesday is the state's Democratic presidential primary between former Vice President Joe Biden and Vermont Sen. Bernie Sanders.\nSanders, who had called for the primary to be delayed, lambasted the court rulings Monday night, saying his campaign would not be involved in any traditional get-out-the-vote efforts in Wisconsin.\n\"Let's be clear: holding this election amid the coronavirus outbreak is dangerous, disregards the guidance of public health experts, and may very well prove deadly,\" Sanders said in a statement.\nBiden, who last week said he thought in-person voting could go forward as long as voters and polling places observed social distancing guidelines, did not weigh in on the matter Monday.\nThe state is also holding general elections for a state Supreme Court seat and a host of local offices.\nPresident Donald Trump has endorsed Justice Daniel Kelly, a conservative on the state Supreme Court.\nThe court is deadlocked 3-3 on a voting rights case that could result in 240,000 people being removed from Wisconsin's voter rolls ahead of November's election. Kelly's seat could represent the deciding vote, and Kelly has abstained from voting ahead of the spring election.\nTrump tweeted Monday evening about the Wisconsin election, urging people there to \"VOTE for Justice Daniel Kelly tomorrow, and be safe!\"", "url": "https://www.cnn.com/2020/04/07/politics/wisconsin-primary-coronavirus/index.html"}