{"authors": [], "date_download": "2020-05-04 20:13:13", "date_modify": "2020-05-04 20:13:13", "date_publish": "2020-04-08 14:24:11", "description": "ANCHORAGE, Alaska (AP) — An Alaska tribe and city asked have the governor to shut down a prosperous fishery this year in response to the coronavirus pandemic. The Curyung Tribal Council and...", "filename": "_e3d00c4ae6a502bf458dc46ccdb36213_1588623193.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e3d00c4ae6a502bf458dc46ccdb36213_1588623193.html", "title": "Alaska community asks for fishery shutdown because of virus", "title_page": "Alaska community asks for fishery shutdown because of virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ANCHORAGE, Alaska (AP) — An Alaska tribe and city asked have the governor to shut down a prosperous fishery this year in response to the coronavirus pandemic.\nThe Curyung Tribal Council and the city of Dillingham requested the closure of the Bristol Bay fishery in a letter to Republican Gov. Mike Dunleavy Tuesday, Indian County Today reported .\nThe Bristol Bay fishery typically opens in June and harvests more Sockeye salmon than anywhere else globally. Fish harvesters there caught 56.5 million salmon in 2019.\nThe fishery brings about 14,000 people to the region for work with fish processing plant companies while drawing about 1,800 fishermen who have been named essential workers by the state.\n“Our community does not have the capability to control the movement of this group,” the letter to Dunleavy said. “This is unacceptable and places us in an impossible situation.”\nThe governor’s office did not immediately respond to a message seeking comment.\nThe tribal council and the city considered many alternatives but cannot foresee a plan that would avoid a significant impact by the coronavirus on the community, they wrote.\nThe council and city contend there are not enough medical facilities in the region or the state to handle a mass coronavirus outbreak.\n“There is no way to prevent a potential mass disease situation,” the letter said.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.\nThe officials urged Dunleavy to determine whether limited resources should go toward attempting to control the fishery or mitigating the economic impacts of not having a fishery.\nAlaska has required fish processors that want to operate in the area this season to submit health and safety plans for preventing the spread of the coronavirus.\nThe council and city credited processors for considering residents in proposals, but said “it is appalling that our community must rely on their corporate conscience to be a part of the planning process.”", "url": "https://apnews.com/e3d00c4ae6a502bf458dc46ccdb36213"}