{"authors": ["Amanda Watts", "Veronica Stracqualursi"], "date_download": "2020-05-04 16:55:08", "date_modify": "2020-05-04 16:55:08", "date_publish": "2020-04-08 18:31:15", "description": "The head of the World Health Organization on Wednesday defended the organization's response to the coronavirus pandemic, at one point directly responding to criticisms leveled by President Donald Trump.", "filename": "2020_04_08_politics_who-responds-trump-claims-coronavirus_index_1588611308.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407032701-general-tedros-adhanom-ghebreyesus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_who-responds-trump-claims-coronavirus_index_1588611308.html", "title": "WHO defends coronavirus response after Trump criticism", "title_page": "WHO defends coronavirus response after Trump criticism - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The head of the World Health Organization on Wednesday defended the organization's response to the coronavirus pandemic, at one point directly responding to criticisms leveled by President Donald Trump.\nThe organization's initial response to the outbreak has been increasingly scrutinized as global cases soar over 1 million. Trump on Tuesday threatened to pull US funding for the organization, only to later backtrack from the threat.\n\"Please don't politicize this virus. It exploits the differences you have at the national level. If you want to be exploited and if you want to have many more body bags, then you do it,\" WHO Director-General Tedros Adhanom Ghebreyesus said at a news conference in Geneva, Switzerland. \"If you don't want many more body bags, then you refrain from politicizing it. My short message is: Please quarantine politicizing Covid. The unity of your country will be very important to defeat this dangerous virus.\"\nTedros outlined a timeline of actions his organization took in response to the crisis.\nOn New Year's Day, a day after China reported a cluster of cases in Wuhan that were later determined to be the novel coronavirus, the agency activated its Incident Management Support Team to coordinate its response at headquarters, regional headquarters and country level, Tedros said.\nRead More", "url": "https://www.cnn.com/2020/04/08/politics/who-responds-trump-claims-coronavirus/index.html"}