{"authors": ["Kelly Mena"], "date_download": "2020-05-04 16:03:50", "date_modify": "2020-05-04 16:03:50", "date_publish": "2020-04-01 20:54:08", "description": "As states around the country issue \"stay-at-home\" orders amid the coronavirus pandemic, firearm and ammunition retailers have been designated an \"essential service,\" according to updated guidance from the federal government.", "filename": "2020_04_01_politics_guns-essential-service_index_1588608230.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190314113638-dicks-guns-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_guns-essential-service_index_1588608230.html", "title": "Gun retailers deemed 'essential service' by federal government", "title_page": "Gun retailers deemed 'essential service' by federal government - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington, DC (CNN) As states around the country issue \"stay-at-home\" orders amid the coronavirus pandemic, firearm and ammunition retailers have been designated an \"essential service,\" according to updated guidance from the federal government.\nChristopher Krebs, director of the Cybersecurity and Infrastructure Security Agency, identified \"firearm and ammunition product manufacturers, retailers, importers, distributors, and shooting ranges\" as critical infrastructure in the updated \"Essential Critical Infrastructure Workforce\" advisory, which was issued over the weekend.\nThe list is intended to be advisory and not to be considered \"the exclusive list of critical infrastructure sectors, workers, and functions that should continue during the Covid-19 response across all jurisdictions.\"\n\"Individual jurisdictions should add or subtract essential workforce categories based on their own requirements and discretion,\" the advisory states.\nThe Covid-19 health crisis has prompted at least 30 states and the District of Columbia to issue stay-at-home orders that force the closure of \"non-essential services.\" Firearm retailers haven't been specifically mentioned in some states' lists of essential businesses, so they're assumed to be non-essential.\nThe new guidance is being hailed as a victory by leading national gun rights groups like the Second Amendment Foundation and the Firearms Policy Coalition, who had already filed a series of lawsuits in places like New Jersey and California challenging stay-at-home orders that didn't specifically designate firearm retailers as an \"essential service.\"\n\"The president and his administration have done the right thing,\" SAF founder and Executive Vice President Alan Gottlieb said in a press release . \"They are dealing with a national emergency while remembering that no malady, however severe, can nullify or even temporarily suspend the exercise of a constitutionally delineated fundamental right.\"\nThe new guidance led to New Jersey Gov. Phil Murphy, a Democrat, announcing on Monday an updated list of permitted businesses during the stay-at-home order to include firearms retailers by appointment only and during limited hours. Los Angeles County Sheriff Alex Villanueva issued a similar order Monday, the second time he has deemed gun stores as an essential business after ordering them closed last week.\nGottlieb told CNN that SAF is still looking at Vermont, New Mexico and New York as possible \"targets\" for lawsuits if they don't update their essential business list.\n\"We don't have a problem with governor's stay-at-home orders in any of these states and we are for measures like social distancing...but we are not happy and what we won't put up with, is the closing of gun manufacturers and gun retailers,\" Gottlieb told CNN.\nThe National Rifle Association is now keeping track of all the emergency orders and their possible effect on gun rights. In a Twitter post last week , the NRA said \"gun-grabbing politicians are exploiting this pandemic to strip you of your rights.\"\nGun sales surging as virus case count grows\nAs of the first week of April, there were more than 200,000 cases of coronavirus in the United States across all 50 states, the District of Columbia, Guam, Puerto Rico and the US Virgin Islands. Deaths from Covid-19 have topped 4,400 in the country, as the US struggles to contain the virus's reach.\nAs the pandemic is unfolding, gun sellers across the country are reporting a surge in firearm and bullet purchases.\nThese purchases have been tracked to an increase in the search term \"coronavirus\" according to the ammunition website Ammo.com which said it has recorded an unprecedented surge in bullet sales since February 23 when the term gained traction online\nAdministrators for the site, which ships ammunition to all but four states across the nation, released sales figures on Friday showing a 350% increase in website visits between Feb. 23 to March 26 compared to the previous 32 day time period.\nMeanwhile, revenue has increased 777%, according to the site, which said coronavirus fears are fueling the sales surge.\n\"We know certain things impact ammo sales, mostly political events or economic instability when people feel their rights may end up infringed, but this is our first experience with a virus leading to such a boost in sales,\" said Alex Horsman, spokesman for Ammo.com in an email to CNN. \"It makes sense. A lot of our customers like to be prepared. And for many of them, it's not just facemasks and TheraFlu. It's knowing that no matter what happens, they can keep themselves and their families safe,\" Horsman added.", "url": "https://www.cnn.com/2020/04/01/politics/guns-essential-service/index.html"}