{"authors": ["Em Steck", "Andrew Kaczynski"], "date_download": "2020-05-04 17:02:54", "date_modify": "2020-05-04 17:02:54", "date_publish": "2020-04-10 15:00:35", "description": "White House trade adviser Peter Navarro publicly said Americans had \"nothing to worry about\" while he privately warned the White House that the coronavirus pandemic could cost trillions of dollars and hundreds of thousands of American lives.", "filename": "2020_04_10_politics_peter-navarro-coronavirus_index_1588611774.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200326135339-peter-navarro-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_peter-navarro-coronavirus_index_1588611774.html", "title": "Navarro publicly said Americans had 'nothing to worry about' while privately warning coronavirus could cost lives and dollars", "title_page": "Navarro publicly said Americans had 'nothing to worry about' while privately warning coronavirus could cost lives and dollars - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) White House trade adviser Peter Navarro publicly said Americans had \"nothing to worry about\" while he privately warned the White House that the coronavirus pandemic could cost trillions of dollars and hundreds of thousands of American lives.\nNavarro circulated two memos at the White House in late January and February warning that a full-blown coronavirus outbreak would leave American lives and the economy vulnerable.\nBut Navarro, a frequent surrogate for President Donald Trump and his administration on television, continued to present a far more optimistic message in public, CNN's KFile found after reviewing Navarro's interviews, statements and writings.\nIn the January 29 memo, Navarro wrote that the \"increasing probability of a full-blown COVID-19 pandemic\" could infect as many as 100 million Americans and kill \"as many as 1-2 million souls.\" That same day -- in which the coronavirus task force was also formed -- Navarro made no mention of the possibility when asked a question about the impact of the coronavirus while appearing on CNBC promoting the USMCA trade agreement.\n\"Not to jump too quickly to the impact of the coronavirus, but obviously there's the fear that it's going to unwind some of the potential benefits of phase one,\" CNBC's Carl Quintanilla said. \"(Secretary of Agriculture) Sonny Perdue today said he didn't know whether it would affect ag commitments. How much are you worried about that unwind or potential unwind?\"\n\"Well, we have a really strong leadership with (Health and Human Services) Secretary (Alex) Azar and the CDC. We're working very carefully and diligently on this, so, well, let's see how this unfolds. This is not my lane per se, so I'm going to let others come on CNBC and inform that,\" Navarro said.\nBut in the memo, Navarro had privately urged the White House to impose a travel ban on China. The White House imposed restrictions on -- but did not ban -- travel from mainland China on January 31, two days after the memo circulated.\nIn a statement to CNN regarding his CNBC appearance, Navarro said, \"A question about agricultural purchase commitments is clearly not my lane.\"\nAt the White House coronavirus briefing Tuesday, Trump said he didn't know about Navarro's memos until a few days ago and still hadn't read it.\n\"He wrote a memo and he was right and I haven't seen the memo,\" the President said. \"I will see it later on, after this. But it didn't matter whether I saw or not, because I acted on my own. I guess I had the same instincts as Peter.\"\nIn Navarro's second memo, dated February 23, he urged for immediate funding to \"minimize economic and social disruption.\"\n\"Any member of the Task Force who wants to be cautious about appropriating funds for a crisis that could inflict trillions of dollars in economic damage and take millions of lives has come to the wrong administration,\" Navarro wrote.\nBut at a press gaggle on February 24, Navarro assured that coronavirus was \"nothing to worry about for the American people\" under Trump's leadership.\n\"Since the day that President Trump pulled down the flights from China to the US, he has been actively leading the situation in terms of this crisis with the task force. Nothing to worry about for the American people,\" Navarro said.\n\"This country's done a beautiful job under President's leadership [sic] in terms of managing this situation. He's working on a daily basis with the task force and we're taking steps to anticipate -- what I like to say -- where the puck's gonna be. We're skating there in defense of the American people and the American economy. So you can be sure you're that in great hands with the Trump administration.\"\nIn a statement to CNN, Navarro defended his February 24 statement.\n\"'Nothing to worry about' indicates the American people should be confident in the strong leadership of President Trump handling the crisis, NOT the seriousness of the crisis itself. To suggest otherwise is simply mischief and fake news,\" said Navarro.\nNavarro continued to wave off concern that America's economy would suffer from the virus.\nOn February 23, while appearing on Fox News' Sunday Morning Futures , Navarro said that the American economy was not \"particularly vulnerable to what happens in China\" with the virus.\n\"With respect to the economic impacts, Maria, I think what we have learned, with President Trump's tough stand on China, is that the American economy is extremely strong and not particularly vulnerable to what happens in China. So we're going to go about our business and try to get what we need in Trump time.\"\nDuring an appearance on The Hugh Hewitt Show , Hewitt asked Navarro if he agreed with White House economic adviser Larry Kudlow's assessment that there would not be an economic downside. Navarro said it was \"not likely to materially harm this economy.\"\n\"I think if we learned anything in the trade negotiations with China, it's that our economy can be very, very strong in the presence of tariffs and reduced imports from China,\" Navarro said. \"So the fact that China is struggling is not likely to materially harm this economy.\"\nNavarro added that the focus should be to address supply chains, including for pharmaceuticals and to develop a vaccine, and suggested in the Fox News appearance on February 23 that \"in crises like this, we have no allies.\"\nNavarro also explained to CNN his answers on the economy.\n\"I was explicitly asked whether a slowdown in the China economy would harm the US economy and clearly responded 'no' because the US economy is not highly dependent on China,\" Navarro said. \"I was NOT asked either explicitly or implicitly about the potential impact of a pandemic on the US economy and any suggestion by CNN that my comments pertained in any way to the possible economic impacts of a possible pandemic is misleading and irresponsible.\"\nNavarro had previously warned of a pandemic in his 2006 book \"The Coming China Wars.\"\n\"China has become the world's prime breeding ground for new and exotic strains of influenza and other viruses, including both the deadly SARS virus and avian flu,\" Navarro wrote, without providing links to scientific evidence. \"The primary reason, as the preceding excerpt indicates, is that so many different farm animals live in such close proximity to humans and other species.\"\nNavarro also echoed this statement after a Fox News host asked without a factual basis whether China created the virus as a potential biological weapon. Navarro did not address the specific question, but said that China \"will have to be held accountable for how that started,\" pointing to his book.\n\"The question of how this started ultimately has to be answered. I don't think now is necessarily the time to do that 'cause what we have to do is fight the crisis first. But China will have to be held accountable for how that started,\" Navarro said on February 10. \"Fourteen years ago in a book called the 'Coming China Wars' that I wrote, I actually predicted a pandemic from a virus from China precisely because of the way they run their country in terms of the animal husbandry practices. So whether it was bats or other things, I'm not really sure at this point, but I was very surprised that the Chinese ambassador did not answer that question.\"\nScientists remain divided on the origins of the coronavirus -- whether it stemmed from wild animals, for example. There is zero evidence that coronavirus was manufactured by a government. New research indicates that the virus came to New York earlier than previously known, and that it was brought by travelers mainly from Europe and not Asia, according to The New York Times.\nNavarro reiterated to CNN that the origins of the virus must be determined.\n\"When I was asked whether the China virus 'started in a research lab,' my response was simply that the question of the origin of the virus would ultimately have to be answered. There is no other possible answer to that question until we know the origins of the virus,\" Navarro said.", "url": "https://www.cnn.com/2020/04/10/politics/peter-navarro-coronavirus/index.html"}