{"authors": ["Senior Editor"], "date_download": "2020-05-04 20:19:20", "date_modify": "2020-05-04 20:19:20", "date_publish": "2020-04-28 13:40:30", "description": "As countries begin to reopen society, there is growing evidence that people are becoming complacent — raising the risk of a second wave of infections.", "filename": "entry_coronavirus-lockdown-restrictions-fatigue-europe_n_5ea8002fc5b6dd3f908ab4d2_1588623560.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8019b220000030c827c64.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_coronavirus-lockdown-restrictions-fatigue-europe_n_5ea8002fc5b6dd3f908ab4d2_1588623560.html", "title": "Coronavirus Lockdowns Have Been Hard. Ending Them May Be Even Harder.", "title_page": "Coronavirus Lockdowns Have Been Hard. Ending Them May Be Even Harder. | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "For the past few weeks, the basic message from politicians and public health officials around the world has been straightforward: Stay home, reduce the spread of the coronavirus and save lives. As authorities begin to ease restrictions on daily life, however, that simple directive risks becoming muddled, leading people to believe the danger has passed and they are free to resume their normal activities.\nAlready, troubling scenes have emerged in Spain, France and parts of the United States.\nIn Paris, a throng of people danced together on a street corner in the 18th arrondissement on Saturday as music played over a loudspeaker, HuffPost France reported. The French government plans to ease lockdown restrictions starting May 11.\nOn Sunday, following an announcement by the Spanish government that children under 14 would be allowed outside under the supervision of a single adult, images shared on social media showed families and groups of people congregating in the streets, playing soccer and lounging at the beach, HuffPost Spain reported.\nAnd as the weather gets warmer, tens of thousands of people flocked to beaches in Southern California this past weekend — clearly violating guidance about maintaining social distancing.\nSOPA Images via Getty Images People in Barcelona, Spain, take a walk outside on April 26, the first day of allowing kids to go out for one hour with an adult.\nFernando Simón, director of the Center for the Coordination of Health Alerts and Emergencies at Spain’s Ministry of Health, said seeing families out in the streets together highlighted the challenges that come with gradually easing lockdown restrictions.\n“These images bring me joy, because they show how, more and more, we will be able to return to a more normal life — but they are also concerning,” Simón said during a press conference Monday. The fact that some restrictions have been lifted “does not mean that we can do everything we want.”\nWhile the strict lockdown may have been a severe measure, Simón said, it was also a simple one for the public to understand and follow. The next phase, with an evolving mix of restrictions and permissible behavior, will be trickier.\n“We are going to do the difficult thing now,” he added. “Now is when all of us have to demonstrate our responsibility as individuals and families to guarantee that this gradual opening does not create a risk for the population.”\nMargarita Robles, Spain’s defense minister, warned on Sunday that if Spanish citizens do not comply with the official guidelines, lockdown restrictions could be reinstated in order to avoid a second wave of coronavirus infections.\nDisobeying the rules would create “a risk that Spain cannot afford,” she said.\nJUSTIN TALLIS via Getty Images People enjoy the spring sunshine in London Fields park in east London on April 25.\nIn the United Kingdom, Prime Minister Boris Johnson struck a similar note on Monday as he urged people to continue to abide by the national lockdown restrictions, even as it appears that the peak of the country’s outbreak has passed.\n“This is the moment when we have begun together to wrestle it to the floor, and so it follows that this is the moment of opportunity,” Johnson said in Downing Street during his first public appearance since recovering from COVID-19 himself. “This is the moment when we can press home our advantage. It is also the moment of maximum risk.”\nBy and large, people have been adhering to the lockdown measures. In the U.K., studies have shown high compliance with, and acceptance of, the government guidelines. Some people even feel the lockdown could be stricter. Some parents said they would continue homeschooling their children if they felt like schools were reopening too soon.\n“Our data suggest that people’s adherence to guidelines is still very high, but a few people may be starting to be slightly less strict in their behaviors,” Daisy Fancourt, the lead researcher of one study being conducted by University College London, told HuffPost U.K. “It’s vital that people continue to follow the advice closely.”\nIn France, Interior Minister Christophe Castaner said last week that the public was generally obeying the restrictions as well, despite the onset of warm springtime weather.\nIn the United States, however, researchers at the University of Maryland have found that, throughout the country, more people have begun to go outside over the past two weeks and are doing so more frequently — suggesting that people are feeling a growing sense of “quarantine fatigue.”\n“It just seems that people are getting a little tired collectively of staying at home after we passed that one-month mark,” Lei Zhang, who is leading the research, told The New York Times.\nMediaNews Group/Orange County Register via Getty Images via Getty Images Large crowds gather near the Newport Beach Pier in California on Saturday, April 25, to cool off during the hot weather despite the coronavirus pandemic.\nEven as officials encourage the public to follow the rules, however, experts said it’s also imperative that authorities provide clear guidance and help make it possible for people to behave responsibly.\nShaming people for not maintaining social distancing or threatening them with fines is not the best response, said Stephen Reicher, a professor of psychology and neuroscience at St. Andrews University.\n“In the end, what I think was going on there was not that people were stupid and not that they didn’t want to socially distance, but that they’d been told they could go out, that going out is good for you, but there isn’t the space,” Reicher told HuffPost U.K., pointing to the examples of people congregating in parks and other public spaces. “I mean, if there is limited space, there are going to be bottlenecks.”\nAs restrictions ease, government officials shouldn’t focus on how to stop people from breaking the rules, he said. Instead, the emphasis should be on helping people follow them.\nWith reporting from HuffPost France, HuffPost Spain and HuffPost U.K.", "url": "https://www.huffpost.com/entry/coronavirus-lockdown-restrictions-fatigue-europe_n_5ea8002fc5b6dd3f908ab4d2"}