{"authors": ["Mark Scolforo", "Marc Levy", "Michael Rubinkam"], "date_download": "2020-05-04 20:23:07", "date_modify": "2020-05-04 20:23:07", "date_publish": "2020-04-16 13:22:07", "description": "HARRISBURG, Pa. (AP) — Gov. Tom Wolf said Thursday that he has not set any timetable for allowing nonessential businesses to reopen or people to leave their homes, insisting that Pennsylvania has...", "filename": "_bef702655dd5424e1ebb0def1d092699_1588623787.html", "image_url": "https://storage.googleapis.com/afs-prod/media/458994c8f8674f1586e18b60820c753f/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bef702655dd5424e1ebb0def1d092699_1588623787.html", "title": "Wolf resists calls to reopen economy, ease stay-home order", "title_page": "Wolf resists calls to reopen economy, ease stay-home order", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A person wearing a protective face mask as a precaution against the coronavirus walks past a boarded up Wine and Spirits store in Philadelphia, Thursday, April 16, 2020. Pennsylvania's liquor agency says workers are coming back on the job at more than 100 shuttered state-owned liquor stores to help process online orders. (AP Photo/Matt Rourke)\nA person wearing a protective face mask as a precaution against the coronavirus walks past a boarded up Wine and Spirits store in Philadelphia, Thursday, April 16, 2020. Pennsylvania's liquor agency says workers are coming back on the job at more than 100 shuttered state-owned liquor stores to help process online orders. (AP Photo/Matt Rourke)\nHARRISBURG, Pa. (AP) — Gov. Tom Wolf said Thursday that he has not set any timetable for allowing nonessential businesses to reopen or people to leave their homes, insisting that Pennsylvania has not made enough progress to “declare victory” over the coronavirus and ease up on social distancing.\nGOP lawmakers have been pressing Wolf to ease his economic shutdown, more business owners are fearing bankruptcy and at least 1.4 million Pennsylvania residents have been thrown out of work during a pandemic that has killed more than 700 statewide.\nBut Wolf, while acknowledging catastrophic damage to the economy, said adequate testing capabilities are not yet in place in Pennsylvania or anywhere else to start trying to return to normal.\n“I think that we ought to stay the course right now,” the Democrat told reporters on a telephone conference call. “It is hard, it is devastating the economy, no question about it, but letting this virus overwhelm the health care system and the ability of Pennsylvanians to resist it would be even worse for the economy.”\nHe suggested that many people still do not feel safe going to work or going out to patronize businesses, and that reopening is not as easy as it sounds.\n“There’s no reason to take our feet off the brakes at this point,” Wolf said. “We need to get through this phase as quickly as possible and keep Pennsylvanians safe, and so that’s what I’m focused on.”\nAsked about plans for a protest at the Capitol on Monday, Wolf said he had not heard about it. Wolf said it would be “unfortunate” if it came off, suggesting that protesters could expose themselves to the virus by gathering in a group.\n“The harm they’re doing is basically to themselves and to each other,” Wolf said.\nIn other coronavirus-related developments:\nTESTING DOWN\nPennsylvania’s testing numbers are way down.\nEarlier in April, the state health department was reporting the results of more than 7,000 coronavirus tests per day. For each of the last three days, health officials have announced the results of fewer than 4,000 tests.\nState health officials said they want to do more testing but haven’t been able to get the necessary supplies. A mass testing site in Philadelphia has also shut down.\n“We’ve had great difficulty accessing the reagents and chemicals,” the state health secretary, Dr. Rachel Levine, said Thursday. “We’d like to do much more widespread testing.”\nFewer people might be showing up to get tested, as well, health department spokesman Nate Wardle said.\n___\nLIQUOR STORES\nWorkers are returning to the job at more than 100 shuttered state-owned liquor stores to help process online orders, Pennsylvania’s liquor agency said Thursday.\nWolf’s office gave the OK to reopen 106 of the state system’s 600 stores to help with online fulfillment, a Pennsylvania Liquor Control Board spokeswoman said. They remain off-limits to the public and are not engaging in retail sales.\nThe store closings have been widely unpopular, especially since the state’s swamped online ordering system has been unable to meet customer demand in a state where the liquor board controls the overwhelming majority of retail sales of hard alcohol.\nThe liquor agency said 46 facilities have begun performing the work, most of them starting over the past few days, and dozens of additional stores are expected to open through the weekend.\nWendell Young IV, president of Local 1776 of the United Food and Commercial Workers Union, which represents about 3,500 of the store clerks, said the PLCB plan is designed to meet a crushing demand for online sales.\nBefore the COVID-19 crisis, online sales had been a small part of the state liquor system’s $2.7 billion in annual revenue. The agency also sells much of the wine consumed in the state.\nThrough online fulfillment centers in Pittsburgh and the Philadelphia suburbs, the agency was able to fill only about 9,600 orders worth $2.1 million from April 1-8.\nOn Wednesday, the system more than doubled its daily capacity, filling 4,400 orders. The PLCB said it expects to reach 10,000 orders a day or more shortly.\nProducers, breweries, wineries and distilleries, and privately owned beer distributorships have been permitted to sell during the shutdown of businesses deemed “non life-sustaining.”\n___\nWOLF WARNS OF BIG BUDGET DEFICIT\nPennsylvania is facing a projected budget deficit of up to $5 billion, Wolf warned in a letter to President Donald Trump.\nThe letter, dated Wednesday, backed calls from other governors for another $500 billion in federal aid for states fighting the spread of the coronavirus. It was signed by Wolf and two other Democratic governors, Tony Evers of Wisconsin and Gretchen Whitmer of Michigan.\nWolf said the projected deficit ranging between $4.5 billion and $5 billion will make it more difficult for the state to support workers and businesses as it attempts to rebuild its economy.\n___\nCASES\nPennsylvania’s COVID-19 death toll rose by 60 to 707, the state health department reported Thursday, with more than 1,200 additional people testing positive for the new coronavirus.\nNursing homes have been hit especially hard. More than half of the state’s fatalities have occurred in more than 300 nursing and personal-care homes scattered throughout Pennsylvania, according to the Department of Health. Nearly 3,300 long-term care residents have contracted the virus.\nStatewide, more than 27,700 people have tested positive, according to the latest health department statistics.\n___\nBERKS COUNTY SOUNDS ALARM\nA sharp rise in coronavirus cases threatens to overwhelm hospitals in Berks County, officials said Thursday.\nTower Health’s Reading Hospital and Penn State Health St. Joseph released a model that shows a looming shortage of regular hospital beds and ICU beds. Hospital officials said they are working to avoid that worst-case scenario by creating additional bed capacity, adding staff and procuring supplies.\nThe hospital executives took part in a news conference arranged by the Berks County commissioners.\nBoard chairman Christian Leinbach said virus cases are rising at a sharper rate in Berks than in neighboring counties. He chided residents and businesses for failing to adhere to social distancing guidelines.\n“The numbers are bleak in Berks County,” Leinbach said. “We are not doing well. Businesses and individuals are not doing enough of the basic things, like wearing a mask.”\nMore than 1,400 Berks residents have tested positive for the virus, according to the state health department. Leinbach, citing data from the coroner’s office, said 52 have died.\n___\nFollow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.", "url": "https://apnews.com/bef702655dd5424e1ebb0def1d092699"}