{"authors": ["Elizabeth Cohen", "Dr. Minali Nigam"], "date_download": "2020-05-04 15:56:18", "date_modify": "2020-05-04 15:56:18", "date_publish": "2020-04-15 17:06:10", "description": "More than 9,200 health care workers have been infected with Covid-19, the US Centers for Disease Control and Prevention has found in its first look at the issue.", "filename": "2020_04_15_health_coronavirus-9200-health-workers-infected_index_1588607778.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408144616-health-care-worker-new-york-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_15_health_coronavirus-9200-health-workers-infected_index_1588607778.html", "title": "CDC estimates more than 9,200 health care workers have been infected with covid-19", "title_page": "CDC estimates more than 9,200 health care workers have been infected with covid-19   - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) More than 9,200 health care workers have been infected with Covid-19, the US Centers for Disease Control and Prevention has found in its first look at the issue.\nThe number is likely an underestimate, since most reports of coronavirus cases don't include whether the person worked in healthcare.\nJUST WATCHED Nurse struggled to get tested and worked while infected Replay More Videos ... MUST WATCH Nurse struggled to get tested and worked while infected 03:12\n\"This national surveillance article spotlights the large number of healthcare personnel already infected with Covid-19,\" said Dr. Anne Schuchat, principal deputy director of the CDC. \"I think we've all learned this virus was a greater threat than we had thought.\"\nShe added that the virus spreads more quickly than was expected, especially since doctors did not at first realize the extent to which people could be infected without showing symptoms.\n\"The role that asymptomatic infection played was not appreciated initially,\" she said. \"I think this virus spread more rapidly and more furtively than we may have understood initially.\"", "url": "https://www.cnn.com/2020/04/15/health/coronavirus-9200-health-workers-infected/index.html"}