{"authors": ["Russell Contreras"], "date_download": "2020-05-04 20:04:21", "date_modify": "2020-05-04 20:04:21", "date_publish": "2020-04-09 16:49:28", "description": "RIO RANCHO, N.M. (AP) — Nearly 73,000 people in New Mexico have lost their jobs over that last three weeks as new numbers show another surge in unemployment claims for the state, according to...", "filename": "_5f35c3ac8f86d9a6ad2c38ae40670e54_1588622661.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ce1d97cc054949269048932666c9df44/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5f35c3ac8f86d9a6ad2c38ae40670e54_1588622661.html", "title": "New Mexico gets 3rd surge in a row on unemployment claims", "title_page": "New Mexico gets 3rd surge in a row on unemployment claims", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Closed stores are shown at a central plaza and shopping district amid a public health order that has closed down most retail stores and suspended dine-in restaurant service in Santa Fe, N.M., Friday, March 27, 2020. New Mexico Cabinet Secretary for Tourism Jen Schroer says the state's tourism industry will continue to suffer amid COVID-19 restrictions and vowed the state will do what it can to help hotels, tourist spots, and businesses recover once restrictions are lifted. (AP Photo/Morgan Lee)\nClosed stores are shown at a central plaza and shopping district amid a public health order that has closed down most retail stores and suspended dine-in restaurant service in Santa Fe, N.M., Friday, March 27, 2020. New Mexico Cabinet Secretary for Tourism Jen Schroer says the state's tourism industry will continue to suffer amid COVID-19 restrictions and vowed the state will do what it can to help hotels, tourist spots, and businesses recover once restrictions are lifted. (AP Photo/Morgan Lee)\nRIO RANCHO, N.M. (AP) — Nearly 73,000 people in New Mexico have lost their jobs over that last three weeks as new numbers show another surge in unemployment claims for the state, according to federal data made public Thursday.\nThe ongoing swell in applications in one of the poorest states in the U.S. was more evidence that the effects of COVID-19 continue to ravage the economy. And some workers are opting to not to look for employment while they wait out the pandemic.\nAccording to the U.S. Department of Labor, 26,606 people in New Mexico applied for unemployment benefits last week compared to a revised record of 27,849 the week before. Though the number of applicants dropped slightly, it was still among the highest one-week figures in state history.\nFilings for unemployment aid generally reflect the pace of layoffs.\nThe Labor Department report said 6.6 million Americans applied for unemployment benefits last week — a decrease of 261,000 from the previous week’s revised level.\nMore than one in 10 workers in the U.S. have lost their jobs over just the past three weeks because of the economic fallout from coronavirus outbreak.\nThe national figures constitute the largest and fastest string of job losses in records dating to 1948. By contrast, during the Great Recession it took 44 weeks— about 10 months — for unemployment claims to go as high as they now have in less than a month.\nRudolfo Carrillo, 55, and his wife, Samantha, 42, of Albuquerque, New Mexico, are among those who filed for unemployment payments. They were laid off in late March from their editorial jobs at the hard-hit alternative newspaper the Weekly Alibi, based in Albuquerque. The said they aren’t looking for jobs now and will wait for turmoil around the pandemic to end.\n“We’re both healthy. Our bills are paid off for the current week...we got about $500 in the bank,” said Carrillo, the paper’s former news editor.\nCarrillo said he thought it was futile to look for another job in journalism, especially since many of the state’s newspapers have announced furloughs, pay cuts, and layoffs.\nNew Mexico has waved requirements for unemployment payment applicants to actively look for temporary jobs.\n“But I got to tell you, it’s starting to drag on,” Carrillo said.\nSamantha Carrillo said she’s looking into freelance copywriting work in the meantime.\nState Rep. David Gallegos, R-Eunice, said workers in the oil and gas region of southeastern New Mexico who have filed for unemployment payments also are waiting out the pandemic because there aren’t many options for them.\n“I know some may consider working at Walmart or Lowe’s since they are the only ones hiring. It’s tough right now,” Gallegos said.\nThis week, New Mexico Gov. Michelle Lujan Grisham, a Democrat, ordered liquor stores to close as part of more restrictions aimed at stopping the spread of the novel coronavirus.\n___\nRussell Contreras is a member of The Associated Press’ race and ethnicity team. Follow him on Twitter at http://twitter.com/russcontreras", "url": "https://apnews.com/5f35c3ac8f86d9a6ad2c38ae40670e54"}