{"authors": ["Hadas Gold", "Cnn Business"], "date_download": "2020-05-04 16:27:29", "date_modify": "2020-05-04 16:27:29", "date_publish": "2020-04-07 14:53:08", "description": "WhatsApp is trying to stem the rapid spread of coronavirus misinformation by placing new limits on the number of times a forwarded message can be shared simultaneously.", "filename": "2020_04_07_tech_whatsapp-misinformation-forward-limit_index_1588609649.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407115734-01-whatsapp-phone---stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_tech_whatsapp-misinformation-forward-limit_index_1588609649.html", "title": "WhatsApp limits forwarding as coronavirus misinformation spikes", "title_page": "WhatsApp limits forwarding as coronavirus misinformation spikes - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) WhatsApp is trying to stem the rapid spread of coronavirus misinformation by placing new limits on the number of times a forwarded message can be shared simultaneously.\nA message received by a person on the-owned platform that has already been forwarded five times can now only be passed on to one chat at a time.\nThe new limits are WhatsApp's strictest yet.\nThe chat app has been gradually tightening the restrictions on its forwarding function, where a user can easily choose multiple groups or people to receive the message. Two years ago, a user could pass on a forwarded message to 250 groups at once, with each group capable of hosting hundreds of users.\nBy last year, the company had reduced that limit to five groups at a time. Now it's one, although a user could theoretically still forward the same message to individuals or groups one by one.\n\"We've seen a significant increase in the amount of forwarding which users have told us can feel overwhelming and can contribute to the spread of misinformation,\" WhatsApp said in a blog post . \"We believe it's important to slow the spread of these messages down to keep WhatsApp a place for personal conversation.\"\nWhatsApp has long been plagued by misinformation, but the ease with which its group chats and forwarding capabilities can be used to spread such content has been magnified by the coronavirus pandemic.\nUnlike Facebook or Instagram, WhatsApp fully encrypts its messages, meaning the company has no idea what's being said or shared. And unlike Facebook, it does not have the capability to attach a warning and explanation to posts deemed false by fact checkers.\nthat have been debunked by medical experts. The problem is now so acute that WhatsApp, like other text messaging platforms, has been used in recent months to spread messages that often contain a mixture of claims about the virus, some accurate and somethat have been debunked by medical experts. The problem is now so acute that world leaders are urging people to stop sharing unverified information using the app.\nThe five-time fowarding limit was introduced after viral hoax messages in India contributed to more than a dozen lynchings in 2018. WhatsApp says forwarding was reduced by 25% as a result.\nExperts welcomed the tighter limit announced on Tuesday but said it still doesn't go far enough.\nvia stricter forwarding limits should have already been in place. London School of Economics professors Shakuntala Banaji and Ram Bhat, who have studied the spread of misinformationvia WhatsApp in India, saidstricter forwarding limits should have already been in place.\nBanaji and Bhat told CNN Business that without other measures, like being able to report, ban and prosecute users who pass on hateful misinformation, \"this new measure for much forwarded content will perforce prove to be ineffective.\"\n\"Our work in India suggested the urgent need for forward limits as one of a bundle of measures in order to curb the rapid spread of hate speech and misinformation,\" they added.\nstudy conducted last year by the Federal University of Minas Gerais in Brazil found that while limiting forwarding to five groups could delay the spread of misinformation \"depending on the virality of the content, those limits are not effective in preventing a message to reach the entire network quickly.\"\nWhatsApp has taken other steps in the light of the coronavirus pandemic to fight misinformation, such as donating money to fact checking organizations, some of which run accounts people can send messages to. They've also teamed up with international and national health organizations to create chat bots that can answer people's coronavirus questions.\n. In screenshots The platform is also working on a new feature that would allow users to take a message they've received and quickly search the web to check its contentIn screenshots shared with TechCrunch last month, a magnifying glass appears next to a message, which would take the user to a related Google search.\nA WhatsApp spokesperson told CNN Business that feature is still being tested.", "url": "https://www.cnn.com/2020/04/07/tech/whatsapp-misinformation-forward-limit/index.html"}