{"authors": ["Chloe Melas"], "date_download": "2020-05-04 16:27:59", "date_modify": "2020-05-04 16:27:59", "date_publish": "2020-04-07 17:43:24", "description": "Jim and Jeannie Gaffigan explain why they're trying to give back to medical personnel on the frontline of the coronavirus pandemic.", "filename": "2020_04_07_entertainment_ji_f7cf9f1eea889b4b33f5da5d8ba311c1_index_1588609679.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/170503143717-jim-jeannie-gaffigan-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_entertainment_ji_f7cf9f1eea889b4b33f5da5d8ba311c1_index_1588609679.html", "title": "Jim Gaffigan and his wife are trying to feed New York's front line", "title_page": "Jim Gaffigan and his wife are trying to feed New York's front line - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) There's a hospital in New York that holds a very special place in the hearts of comedian Jim Gaffigan and his wife, Jeannie Gaffigan.\nManhattan's Mt. Sinai Hospital is where Jeannie had a near-fatal brain tumor removed in 2017. She credits her life to the doctors and nurses there, which is why she and her husband are trying to give back to medical personnel on the front line of the coronavirus pandemic.\n\"We were notified that, understandably, [the hospital] is under a lot of pressure. They are working crazy hours. We can't provide PPE (protective equipment) but we thought we could send over some burgers. So, we teamed up with Shake Shack and sent over food for a whole shift,\" Jim Gaffigan told CNN in a recent interview.\n\"These medical workers need just a little brightness in their day, anything,\" Jeannie Gaffigan said.\nThe couple has started a fundraising effort to deliver food to hospitals across New York City's five boroughs through their nonprofit organization, The Imagine Society\nRead More", "url": "https://www.cnn.com/2020/04/07/entertainment/jim-gaffigan-meals-coronavirus-mt-sinal-hospital/index.html"}