{"authors": ["Anna Bahney", "Cnn Business"], "date_download": "2020-05-04 16:54:33", "date_modify": "2020-05-04 16:54:33", "date_publish": "2020-04-08 17:12:14", "description": "With millions of people experiencing job loss because of the outbreak, people are looking for ways to cover expenses in the short term.", "filename": "2020_04_08_success_retireme_cc1590827e2b2b697363026ec1d1ab8c_index_1588611273.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/180926181045-brains-earning-vs-savings-gfx-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_success_retireme_cc1590827e2b2b697363026ec1d1ab8c_index_1588611273.html", "title": "What to know before you 'break the glass' on your 401(k)", "title_page": "401(k) early withdrawal: What to know before you 'break the glass' - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "With millions of jobs lost because of the coronavirus pandemic , people are looking for ways to cover expenses in the short term.\nOne option is to take an early distribution from your 401(k), which is now penalty-free for those hit by the pandemic thanks to the stimulus bill. But is it a smart move?\n\"It is a long-term solution for what might be a short-term problem,\" said Steve Parrish, co-director of the Center for Retirement Income at the American College of Financial Services.\nAs part of the massive stimulus bill , those affected by coronavirus (either by a diagnosis within their family or financial hardship due to the outbreak, according to the new rule ) can now pull up to $100,000 out of a retirement account, including a 401(k) or IRA, without the 10% early-withdrawal penalty.\nThe money you take from your 401(k) can be re-contributed within three years, even if it exceeds the maximum contribution limits for that year. While the distribution is taxable, that tax liability can be spread out over the next three years.\nBut just because you can take out up to $100,000 from your 401(k) penalty-free, should you?\nHere are the risks and rewards of breaking the glass on your 401(k) to access your retirement funds now.\nRisks of a penalty-free withdrawal\nThe latest legislation allowing penalty-free withdrawals is more about survival, said Parrish.\n\"Should this be the first way to get at money? I would say no,\" he said. \"Retirement plans should be among the last places to look.\"\nWhen faced with a cash shortfall, about 14% of people plan to withdraw money from a retirement account, according to a study conducted during the last week of March by SimplyWise, a retirement planning company. While 16% plan to borrow from friends or family, only 10% expect to take out a personal loan. More people plan to find other work, rely on unemployment insurance payments or sell assets, the study showed.\nParrish fears people may take out more than they need in the near-term and get stuck with a huge tax bill, all the while sacrificing their future security in retirement.\n\"It offers useful relief, but the concern is that 401(k)s are becoming the Swiss cheese of retirement accounts,\" he said. \"Every time the government gives a new way to access pre-retirement money from a 401(k), the plan starts looking more and more like a savings account, leading to holes in many people's retirement.\"\nHe suggests borrowing from friends and family or taking out a low interest rate personal loan before puling from retirement savings.\n\"The only thing that is worse would be running up your credit cards, because of high interest.\"\nDistribution vs. borrowing\nIn certain circumstances, borrowing from a 401(k) could be a better option than taking a distribution, said Cal Brown, a certified financial planner with Savant Capital Management in the Washington, DC area.\nHe says that while a loan will cost more because interest is charged on the amount borrowed, at least repayment is guaranteed.\n\"From a financial perspective it would be better to take a penalty-free withdrawal from the 401(k) because it won't cost you as much,\" said Brown. \"But it can be hard psychologically to take from yourself in the future and pay yourself back. It might be better to borrow the money because you have a regular bill to pay and the cost is immediate. And your retirement remains funded.\"\nNot all 401(k) plans allow employees the opportunity to borrow against them. But if your plan allows it, there are now increased limits to how much you can take out in a loan.\nThe stimulus bill doubled the amount you can borrow from an eligible retirement plan for the next six months, from $50,000 to $100,000 and the loans are now capped at 100% of your vested balance, up from 50%.\nBut just be aware: If you borrow from your 401(k) and you lose your job, typically you would need to pay the entire amount very quickly or the outstanding amount will be considered a taxable distribution.\nIn the stimulus package, those impacted by the coronavirus, with an outstanding loan from a retirement plan may delay their repayments that are due in 2020 for one year. The repayments and interest will then be adjusted to reflect the delay.\nContributions and required minimum distributions\nSome companies experiencing hardships themselves may halt company contributions to 401(k)s. But if you have a job and are getting paid, Brown said, you should continue to pay into your retirement fund.\n\"Even without a company match, 401(k) contributions are one of the best remaining tax deductions,\" said Brown. \"It is sacred money because there are no longer pensions for most people. If you just have that and Social Security, don't touch it and let it accumulate.\"\nThe stimulus legislation also has a helpful provision for retirees that waives required minimum distributions in 2020 that those 72 and older need to take from their 401(k)s and IRAs, said Parrish.\n\"Having the government force a retiree to take taxable distributions from an IRA when the stock market is down is neither popular nor logical,\" Parrish said. \"This is an easy and temporary fix. If you can keep going with what you have and can avoid the RMD, it is a great tax opportunity.\"", "url": "https://www.cnn.com/2020/04/08/success/retirement-401k-early-withdrawal-coronavirus/index.html"}