{"authors": ["Nic Robertson", "Mohammed Tawfeeq", "Hamdi Alkhshali"], "date_download": "2020-05-04 16:56:16", "date_modify": "2020-05-04 16:56:16", "date_publish": "2020-04-09 09:27:29", "description": "The Saudi-led coalition fighting Houthi rebels in Yemen has declared a two-week ceasefire in a bid to stem the spread of the coronavirus in the war-torn country, according to state-run Saudi Press Agency (SPA).", "filename": "2020_04_09_middleeast_saudi-yemen-coronavirus-ceasefire-intl_index_1588611376.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191119145502-yemens-huthi-rebels-generic-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_middleeast_saudi-yemen-coronavirus-ceasefire-intl_index_1588611376.html", "title": "Saudi Arabia declares ceasefire in Yemen over coronavirus", "title_page": "Saudi Arabia declares ceasefire in Yemen over coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Saudi-led coalition fighting Houthi rebels in Yemen has declared a two-week ceasefire in a bid to stem the spread of the coronavirus in the war-torn country, according to the state-run Saudi Press Agency (SPA).\nThe ceasefire in the five-year conflict was set to begin Thursday, according to coalition spokesman Col. Turki al-Malki. SPA said the move was prompted by United Nations Secretary-General Antonio Guterres' call for a pause of hostilities in the country in order to counter the spread of Covid-19.\nThe coronavirus has now infected more than 1.5 million people and killed over 88,000 worldwide, according to Johns Hopkins University.\nMalki also said the temporary ceasefire would pave the way for talks between the Saudi-backed government in Aden, and Iran-backed Houthi rebels based in the Yemeni capital of Sanaa.\nThe ceasefire would create the environment for the UN \"to hold a meeting between the legitimate government and the Houthis, and a military team from the (Saudi-led) coalition under the supervision of the UN envoy to discuss his proposals on the steps and mechanisms to implement a permanent ceasefire in Yemen,\" said Malki, according to SPA.\nRead More", "url": "https://www.cnn.com/2020/04/09/middleeast/saudi-yemen-coronavirus-ceasefire-intl/index.html"}