{"authors": ["Jonathan Epstein"], "date_download": "2020-05-04 16:56:52", "date_modify": "2020-05-04 16:56:52", "date_publish": "2020-04-09 10:24:00", "description": "Jonathan Epstein, an expert on animals and disease, says we have much more to learn about how animals such as bats can transmit viruses to humans and about how they can be spread from there to other animals", "filename": "2020_04_09_opinions_from-ba_474267eb8f53ff214f1fc459d0f81a04_index_1588611412.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405171251-bronx-zoo-tiger-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_opinions_from-ba_474267eb8f53ff214f1fc459d0f81a04_index_1588611412.html", "title": "From bats to people to tigers? Viruses that can jump species", "title_page": "From bats to people to tigers? Viruses that can jump species - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The discovery that a tiger at the Bronx Zoo tested positive for the coronavirus has raised new questions about viruses that can jump from animals to humans to animals.\nThe topic is crucial since the virus that is causing the Covid-19 pandemic is believed to have originated in animals. For insight into the issue, we reached out to Jonathan Epstein, a veterinarian and disease ecologist who serves as vice president for science and outreach at the EcoHealth Alliance, a nonprofit organization, and has been involved in field and laboratory research on the sources of coronavirus. Epstein was the chief science adviser for the Smithsonian exhibit \"Outbreak: Epidemics in a Connected World\" which has been on display at the National Museum of Natural History since 2018.\nCNN: A 4-year-old female Malayan tiger at the Bronx Zoo developed a dry cough and tested positive for the coronavirus. What possible significance could that have?\n: The confirmed tiger case is the first evidence of SARS CoV2 in a captive wildlife species -- a big cat-- and also suggests likely transmission from a person (likely one of the animal care staff).\nThis finding (other big cats at the zoo had signs of coughing, but weren't tested) provides important information about what the disease might look like in big cats, and also lets other zoos know what could happen within their collection. To protect the health of the animals in the collection, it's probably a good idea for zoos to have staff start wearing masks (homemade, not scarce N95s!) when working near the animals or in their enclosures.\nThere's so much we don't yet know about the virus that causes the Covid-19 pandemic, SARS CoV2. But we are learning a tremendous amount from the human epidemiological data that comes in from the US, China and every other country.\nSimilarly, we know little about which other species may be susceptible to infection and how this virus affects other susceptible species. Recent studies , still not yet peer reviewed, provide evidence that domestic cats are susceptible to experimental infection with SARS CoV2 and that cats sampled in Wuhan after the outbreak started had antibodies against SARS CoV2, suggesting that cats may have been infected by owners with Covid-19.\nCNN: Should people be concerned about passing Covid-19 to their pets or being at risk of getting the virus from them?\nEpstein: There's currently no evidence that pet cats have transmitted or can transmit SARS CoV2 to people. It's clear that the Covid-19 pandemic is driven by human-to-human transmission; however, there's still a lot we don't know, and the absence of evidence of a person being infected by a companion animal does not mean it can't happen.\nPets do play an important role in our lives, particularly when we're facing steep challenges such as this. The best guidance right now is from the US Centers for Disease Control and Prevention, which recommends that people who have pets and are sick should treat them like other family members and avoid contact with them.\nCNN: How do coronaviruses jump from other animals to human beings?\nEpstein: Prior to the emergence of SARS coronavirus in 2002, there were only four known coronaviruses in humans. None of them caused significant illness or mortality. SARS was our first known experience with a zoonotic (passed between animals and people) coronavirus -- though we now know that the first four human coronaviruses also originated in animals -- and one that caused both significant respiratory disease and had a case fatality rate of about 9%.\nBy comparison, Middle East Respiratory Syndrome (MERS) coronavirus emerged in 2012 and has a case fatality rate around 35%. There's still uncertainty about the case fatality rate of Covid-19 because we don't truly know how many are infected, but it's tracking so far between 1-2%. It's less severe than SARS or MERS, but much more easily transmitted among people.\nCoronaviruses are a large family of viruses, and many mammals and birds have their own strains. Often, coronaviruses stay within a single species, but some, like SARS, MERS and now SARS CoV2 (the virus that causes Covid-19) have demonstrated the ability to infect several different animal species, including humans.\nHow they jump is an important question, and one which remains unanswered in terms of the current outbreak. We know that certain types of bats, called horseshoe bats, are the natural reservoir for SARS and related coronaviruses. We've found dozens of closely related viruses in horseshoe bats in China. Not all of them have the ability to infect humans.\nViruses, in general, have to enter a host's cells and hijack the cell's machinery to make more virus. To do this, each viruses must attach to a specific part of a host cell called a receptor, and then inject its genetic material (RNA in the case of coronaviruses) into the host cell for replication. It's like a lock and key mechanism.\nIf the virus's key doesn't fit the host's lock, it cannot bind to and enter the cell and can't cause an infection. SARS CoV and SARS CoV2 both use the ACE2 receptor which is found in cells in the respiratory and GI tract of mammals, including people. We're still learning which species are susceptible to SARS CoV2, but we know that bats, people, ferrets and cats are among them.\nWhen a virus can bind to a receptor found in many species, it has more opportunities to successfully jump out of its natural reservoir -- or population -- and infect new hosts. If the virus is able to adapt to its new host such that it can replicate and be efficiently transmitted to other individuals, it has the opportunity to establish itself within that new host.\nMore than half of known human viruses, including HIV and measles, originally came from animal reservoirs, and have since become endemic in human populations. When people bring various kinds of wildlife, including bats and domestic animals, together in wet markets in China, they create a perfect opportunity for a virus like SARS CoV2 to jump from a bat to another animal or to people.\nWe know coronaviruses are shed by bats in their feces. When people or other animals are exposed to bat feces or bodily fluids in wet markets through the process of handling and butchering them, with little attention paid to handwashing or cleaning the space where they work, then it becomes easy for a virus to jump hosts.\nWe don't know for sure how SARS CoV2 emerged -- whether a person was directly infected by contact with bats, or whether other animals were involved -- either is possible. Figuring out the details of how SARS CoV2 emerged is vital to making sure we prevent additional spillover events. If this virus is still circulating in bats that are hunted, or other animals that are part of the market system, then the risk of a second Covid-19 outbreak remains.\nCNN: You studied the origin of the SARS epidemic and helped trace it to horseshoe bats. Could you explain how you established that?\nEpstein: In 2004 I was part of an international team that included colleagues at EcoHealth Alliance and partners in China and Australia. Our goal was to identify the wildlife reservoir for SARS coronavirus. Originally the suspected source was civets because the same virus had been isolated from civets and the people who sold them in the markets.\nWhen a study by a Chinese research group came out about a year after the outbreak showing that wild and farmed civets outside the markets in Guangdong had no evidence of current or past infection with SARS, it suggested that civets became infected in the markets just like people. That meant that there was another animal that was likely the reservoir for this virus.\nWe focused on bats as a possible source because they are commonly eaten and were sold widely in markets at the time. There were also multiple clusters of SARS cases early on in different parts of Guangdong that were apparently unrelated to each other, and it made sense to us that an animal that was common and widely distributed, like bats or rodents, could be responsible for independent infections in different locations.\nWe caught and tested bats in the wild as well as those we found in wet markets in several provinces, including Guangdong. We sampled multiple species, and ultimately found viruses closely related to SARS in four different species of horseshoe bats.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nThe virus we found wasn't identical to SARS, but when you looked at a family tree of coronaviruses, it appeared that this was a direct ancestor - meaning that SARS had evolved from this virus. This was the first clue we had that SARS had come from bats. The issue we faced was that the virus we found was only 92% identical to SARS and didn't act like SARS - it didn't use the ACE2 receptor that SARS did to enter into cells and couldn't have theoretically infected people or civets. It also didn't cause respiratory disease in lab animal experiments the way SARS did.\nAfter years of continuous research looking at coronaviruses in horseshoe bats in China, we finally found a virus which was genetically closer to SARS and that did use the ACE-2 receptor. In the lab it was able to infect human lung tissue cells, suggesting that this was a virus capable of direct bat-to-human transmission. This finding provided the strongest evidence to date that SARS came from horseshoe bats.\nCNN: What do we know about the origin of Covid-19?\nEpstein: Based on the same body of research, our group identified a virus from Yunan province in horseshoe bats that is 96% similar across its entire genome to SARS CoV2. This is the closest relative known to the virus that causes Covid-19, and it was found in the same type of bat that carries other SARS-related coronaviruses. This is what gives us confidence that SARS CoV2, like SARS, is a bat virus. However, we still aren't sure exactly how this virus got from bats into people.\nCNN: What can be done to lessen the chance of future diseases passing from animals to people?\nEpstein: We've only scratched the surface of identifying the diversity of viruses circulating in animals, but clearly coronaviruses are an important group. The scientific community was not surprised by the emergence of yet another zoonotic SARS-like coronavirus, now the third since 2002, and we will likely see more unless we significantly change the way we interact with wildlife.\nWe now have a pretty good understanding of which parts of the world are most likely to experience outbreaks of unrecognized zoonotic viruses and we also know that most zoonotic disease outbreaks are driven by human activities -- those that bring us and our livestock into more frequent contact with wildlife.\nThe activities that should concern us include land use change (deforestation, urbanization, and agricultural land conversion), intensive livestock production without sufficient separation of livestock from wildlife; and the wildlife trade, which includes bringing live wildlife into markets where they mix with each other, domestic animals and people.\nFortunately, there are things we can do to reduce the risk of zoonotic viruses emerging. We should continue to support research and surveillance efforts that identify viruses in bats and other key wildlife groups (e.g. rodents and primates) in order to better understand what's out there in nature that may have the potential to cause disease in people or livestock.\nWe should invest in strengthening public health and surveillance systems globally, specifically in emerging disease hotspots. An outbreak anywhere is a threat everywhere, as we've seen with Covid-19. Countries need to be able to identify known and new viruses that cause disease in livestock or people, and rapidly respond to outbreaks while they're small and can be contained.\n\"An outbreak anywhere is a threat everywhere.\" Jonathan Epstein\nThis requires building a skilled workforce that works across human and animal health sectors, using what we call a \"One Health\" approach. It also requires investment in laboratory capacity, so that labs are able to quickly identify and characterize new viruses that emerge.\nWe should continue to identify high-risk activities or environments, such as wildlife markets or livestock farming systems that allow domestic animals to co-mingle with wildlife and provide opportunities for viruses to jump from wildlife into other animals or people. If we can identify and modify (or eliminate) some of the riskiest environments, we will probably protect ourselves from both the viruses we know about and those we don't.\n'Unseen Enemy: Pandemic' CNN Films' documentary explores how diseases like Zika, Ebola and influenza spread. Watch now on CNNgo.\nRisk reduction should also begin with community engagement. Research by local social scientists who have the best understanding of local customs and cultural context will be vital to developing realistic strategies to change high risk behavior. Legislation is necessary, but alone is insufficient, and making an activity illegal can drive it underground, making it harder to monitor.\nWe recognize that we're not going to prevent every spillover event and there will continue to be zoonotic disease outbreaks, but we have to take pandemic prevention more seriously. The money required to do this is a fraction of what Covid-19 will end up costing the global economy. It's an easy decision, and hopefully our policy makers will remember what we're all going through when it comes time to invest in pandemic preparedness.", "url": "https://www.cnn.com/2020/04/09/opinions/from-bats-to-people-to-tigers-viruses-jump-species-epstein/index.html"}