{"authors": ["Katelyn Polantz"], "date_download": "2020-05-04 16:54:50", "date_modify": "2020-05-04 16:54:50", "date_publish": "2020-04-08 21:53:02", "description": "The Justice Department has turned to biological warfare laws to bring two new cases against alleged coronavirus hoaxsters this week.", "filename": "2020_04_08_politics_biological-warfare-laws-covid-19_index_1588611290.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330095131-05-new-york-medical-supplies-0324-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_biological-warfare-laws-covid-19_index_1588611290.html", "title": "US prosecutors use biological warfare laws against alleged Covid-19 hoaxers", "title_page": "US prosecutors use biological warfare laws against alleged Covid-19 hoaxers - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Justice Department has turned to biological warfare laws to bring two new cases against alleged coronavirus hoaxsters this week.\nIn San Antonio, federal prosecutors charged a 39-year-old man for claiming online he paid a person to spread the virus at grocery stores. And in St Petersburg, Florida, a 31-year-old man allegedly coughed and spit on police as they searched him during two domestic violence-related arrests.\nTaken together, the charges are notable new prosecutions in the Justice Department's effort to fight coronavirus-related fraud and other issues. In other coronavirus criminal cases, police have used assault charges for people who spit on them and claimed to have the virus. And many of the federal cases to this point had been focused on scammers, price gouging and hoarding medical gear and other goods in short supply.\nBut the biological warfare cases targeted both an online troll and an unruly person during an arrest.\nIn the Texas case, a weapons of mass destruction investigator got a tip about a deleted Facebook post claiming Christopher Charles Perez's Covid-19-positive cousin had licked items in a grocery store.\nRead More", "url": "https://www.cnn.com/2020/04/08/politics/biological-warfare-laws-covid-19/index.html"}