{"authors": ["Amy Beth Hanson"], "date_download": "2020-05-04 20:06:55", "date_modify": "2020-05-04 20:06:55", "date_publish": "2020-04-07 22:24:25", "description": "HELENA, Mont. (AP) — Gov. Steve Bullock extended the state's stay-at-home, school closures and business restrictions through April 24 in a continuing effort to prevent the spread of the...", "filename": "_ba15ac7de088321426117cc84503f151_1588622815.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ba15ac7de088321426117cc84503f151_1588622815.html", "title": "Montana governor extends stay-at-home order, school closures", "title_page": "Montana governor extends stay-at-home order, school closures", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HELENA, Mont. (AP) — Gov. Steve Bullock extended the state’s stay-at-home, school closures and business restrictions through April 24 in a continuing effort to prevent the spread of the coronavirus, while the Department of Justice confirmed Tuesday what is believed to be the first positive COVID-19 case in a jail inmate.\nBullock also extended his other directives Tuesday, including restrictions for on-premises food and beverage businesses; a prohibition of gatherings larger than 10 people; consumer protections against evictions and the cancellation of utilities; and a continuing of a mandatory 14-day quarantine for people entering the state on non-work-related travel.\nHe also recommended residents wear a cloth face mask consistent with Centers for Disease Control and Prevention guidelines in settings where social distancing measures are difficult to maintain, such as at a grocery store or pharmacy.\n“For every person we take out of the chain of transmission of this virus, the more likely our health care facilities can handle the capacity to respond, and the more likely we can beat back this virus sooner rather than later,” Bullock said.\n“We also stay home so that we can more quickly rebuild to a thriving economy. It is not a choice between a healthy population and a healthy economy — the two go hand in hand. Managing this public health crisis now will help to prevent long-term consequences that could upend our economy for a longer duration and with a worse outcome,” he said.\nIn a Department of Justice response to a petition filed by Disability Rights Montana seeking the release non-violent jail and prison inmates to prevent the spread of coronavirus, Attorney General Tim Fox confirmed Tuesday that an inmate at the Gallatin County Detention Center had tested positive for COVID-19. Gallatin County has the largest number of cases in the state with 119 of the 319 confirmed Monday evening.\nGallatin County Attorney Marty Lambert said the inmate who tested positive had been at the county Re-entry Program when he was sanctioned by his probation officer for a violation and was taken to jail on Saturday. He was released Monday.\nMike Thatcher, CEO of Community Counseling and Correctional Services, which runs the re-entry program, said the man was not symptomatic when he was taken to jail. Another resident and a staffer at the pre-release program have also tested positive for COVID-19, Thatcher said Tuesday. Other tests are pending, he said.\nLambert said he did not know how many Gallatin County jail inmates might be tested for exposure to the coronavirus.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough. But for others, especially older adults and people with health problems, it can cause life-threatening pneumonia.\nIn other coronavirus-related developments:\n— Since Friday, Montana National Guard members have screened just over 1,200 people at airports and train stations, six were referred to health care providers and none of those six have tested positive for COVID-19, Bullock said.\n— Twenty cases of COVID-19 have been connected to a long-term care facility in Toole County, with all residents under quarantine and three in isolation. Seven cases were confirmed among residents of the facility, five among staff and seven in a related hospital along with with one family member, Bullock said. Three of the state’s six COVID-19 deaths happened in Toole County.\n— The state took advantage of the historically low interest rates to sell $33 million in bonds at a 1.56% interest rate to be used when the state is able to begin infrastructure projects. The bond sale will leverage an estimated $55.3 million investment in communities and support more than 400 jobs and provide more than $20.5 million in wages, Bullock said.\n— The Montana Department of Labor and Industry issued nearly $7.9 million in unemployment payments to 24,646 people from March 30 through April 3, for an average payment of $320 per claimant. The federal Coronavirus Aid, Relief and Economic Security Act includes a temporary additional $600 a week for unemployment claims. Agency officials have said claimants will receive that money when it is available to the state.\n— Bullock authorized county health departments to notify first responders if they’re being dispatched on an ambulance or other call for a resident who has tested positive for COVID-19, allowing them to be be prepared with the proper protective gear.\n— The governor waived a requirement that local and county governments implement a 2 mill emergency levy in order to access funding under the $2.2 trillion federal stimulus bill.", "url": "https://apnews.com/ba15ac7de088321426117cc84503f151"}