{"authors": ["Ryan Browne"], "date_download": "2020-05-04 16:25:51", "date_modify": "2020-05-04 16:25:51", "date_publish": "2020-04-07 11:58:10", "description": "A crewmember of the US Navy hospital ship dispatched to New York harbor to help with the coronavirus pandemic has tested positive for the virus and has been isolated from patients and other crew members, a Navy spokesperson said Tuesday.", "filename": "2020_04_07_politics_usns-comfort-coronavirus_index_1588609551.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330114929-usns-comfort-coronavirus-new-york-0330-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_usns-comfort-coronavirus_index_1588609551.html", "title": "Crewmember aboard Navy ship dispatched to NYC tests positive for coronavirus", "title_page": "Crewmember aboard Navy ship dispatched to NYC tests positive for coronavirus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) A crewmember of the US Navy hospital ship dispatched to New York harbor to help with the coronavirus pandemic has tested positive for the virus and has been isolated from patients and other crew members, a Navy spokesperson said Tuesday.\n\"There is no impact to Comfort's mission, and this will not affect the ability for Comfort to receive patients. The ship is following protocols and taking every precaution to ensure the health and safety of all crewmembers and patients on board,\" ,\" Navy spokesperson Lt. Marycate Walsh told CNN.\nWalsh said the crewmember had no contact with patients. As of Tuesday morning, the ship has treated over 50 patients, according to a defense official.\nA US defense official tells CNN, \"those who had contact with the crew member who tested positive have been tested and will remain in isolation for several days regardless of the test result, out of an abundance of caution.\nThe USNS Comfort's initial mission was to treat only non-coronavirus patients, but the US military announced Monday night that the Comfort will take patients without regard to whether they have tested positive for Covid-19 or not.\nRead More", "url": "https://www.cnn.com/2020/04/07/politics/usns-comfort-coronavirus/index.html"}