{"authors": ["Aj Willingham"], "date_download": "2020-05-04 17:01:01", "date_modify": "2020-05-04 17:01:01", "date_publish": "2020-04-10 10:11:58", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "filename": "2020_04_10_us_five-things-april-10-trnd_index_1588611661.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410000439-social-distancing-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_five-things-april-10-trnd_index_1588611661.html", "title": "5 things to know for April 10: Coronavirus, economy, OPEC, election 2020, Iran", "title_page": "5 things to know for April 10: Coronavirus, economy, OPEC, election 2020, Iran - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "If your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' newsletter.\n(CNN) Britain's Prime Minister Boris Johnson is out of the ICU and on his way to recovery after displaying persistent coronavirus symptoms . Here's what you need to know to Get Up to Speed and On with Your Day .\n(You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily. Sign up here .)\n1. Coronavirus\n2. Economy\nThe Federal Reserve announced a new $2.3 trillion round of loans that include even more support for small businesses and consumers — and, for the first time, for states, cities and municipalities, too. The package includes several new 12-figure lending programs, including 500 billion in loans and $35 billion in credit protection to states, Washington DC, and large counties and cities. The loan package also expands other credit facilities already in place in an effort to provide as much relief and stability to the tumultuous economy as possible. And, the Fed may not be done yet. Economists say the central bank hasn't exhausted potential resources and may contribute even more if needed. Despite the Fed's carte blanche tactics, economists say the US is already in a recession and will remain that way for the first half of the year.\nJUST WATCHED Fed boosts support for small businesses, local governments Replay More Videos ... MUST WATCH Fed boosts support for small businesses, local governments 02:13\n3. OPEC\nRussia and Saudi Arabia have called off their brutal price war and could be headed toward a multinational deal to stabilize the global oil market. A marathon OPEC meeting, conducted over video call, ended in a tentative deal among crude producers that would slash production by 10 million barrels per day in May and June. That's the biggest production cut the world's oil producers have ever agreed to. However, there are some major snags: Mexico says they don't support the agreement, and it can't move forward until the country consents. Also, the deal doesn't make up for how much the world's oil demand has collapsed, and likely wouldn't stem the massive plunge in oil prices. Another round of talks between the Group of 20 is scheduled for Friday.\nJUST WATCHED Oil producers grapple with demand collapse Replay More Videos ... MUST WATCH Oil producers grapple with demand collapse 02:13\n4. Election 2020\nDemocrats want to give states more funding for mail-in voting efforts , but President Trump and Congressional Republicans are railing against the idea. Top Democrats want the initiative included in the next coronavirus stimulus package to address the dangers voters face going to the polls in the midst of a pandemic. They want to expand vote by mail and early voting for all states, as well as allow for same-day voter registration across the country. Trump and the GOP have rejected the idea, claiming that mail-in voting would jeopardize the integrity of elections. This impasse could become a major sticking point as Congress negotiates their fourth big-ticket attempt at propping up the national economy.\nJUST WATCHED Cooper calls out Trump's hypocrisy over mail-in voting Replay More Videos ... MUST WATCH Cooper calls out Trump's hypocrisy over mail-in voting 02:01\n5. Iran\nThe Trump administration wants to block the International Monetary Fund from providing a $5 billion emergency coronavirus relief loan to Iran. US officials believe the money would not actually go towards the country's public health crisis and instead go to, in the words of one State Department official, \"their own pockets and to their terrorist proxies.\" Iran has been devastated by coronavirus, with nearly 4,000 deaths and nearly 65,000 reported cases -- though experts believe the actual statistics could be much higher. The country is also plagued by a weak economy, in part because of US sanctions and a shortage of medical supplies. The US decision to block the aid could create further friction with the European Union, which has already pledged millions in relief to the country.\nJUST WATCHED Iran VP: We think we're in control of Covid-19 Replay More Videos ... MUST WATCH Iran VP: We think we're in control of Covid-19 12:40\nBREAKFAST BROWSE\nNetflix is bringing \"Tiger King\" back for one more episode\nWoman was arrested after licking $1,800 worth of grocery store items\nHow the coronavirus may end the political handshake\nA crew of prehistoric monkeys rafted across the Atlantic to South America\nScientists reconstruct skulls of 200-million-year-old dinosaur embryos\nTOTAL RECALL\nQuiz time!\nThis state held its primary elections this week in the midst of the coronavirus pandemic, despite efforts to delay the election until June.\nA. North Carolina\nB. Kansas\nC. Wisconsin\nD. Wyoming\nTODAY'S NUMBER\n31%\nThe percentage of Americans who didn't pay their rent by the 5th of this month . Last April, that number was 18%. The wide margin shows how the coronavirus pandemic is devastating the US job market and Americans' financial health.\nTODAY'S QUOTE\n\"There's been inequalities and injustice going on for a long time especially when you think about minorities. Until those things change, we're still going to have a lack of health care. We're still going to be behind the 8 ball.\"\nMagic Johnson, talking about the , talking about the documented racial disparities in coronavirus care and his hope that all Americans will soon be able to be tested.\nJUST WATCHED Magic Johnson calls out racial disparities with pandemic Replay More Videos ... MUST WATCH Magic Johnson calls out racial disparities with pandemic 02:56\nTODAY'S WEATHER\nJUST WATCHED Severe storms threaten millions Easter weekend Replay More Videos ... MUST WATCH Severe storms threaten millions Easter weekend 02:09\nAND FINALLY\nOh I could write a sonnet, about your Easter bonnet", "url": "https://www.cnn.com/2020/04/10/us/five-things-april-10-trnd/index.html"}