{"authors": ["Analysis John Harwood"], "date_download": "2020-05-04 16:20:15", "date_modify": "2020-05-04 16:20:15", "date_publish": "2020-04-05 13:31:50", "description": "In his closing argument before the 2016 election, Donald Trump pointed voters toward his \"under budget and ahead of schedule\" new Washington hotel: \"A metaphor for what we can accomplish for this country.\"", "filename": "2020_04_05_politics_president-management-covid-2020_index_1588609215.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404162559-01-coronavirus-briefing-0404-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_president-management-covid-2020_index_1588609215.html", "title": "Trump's coronavirus mismanagement again undercuts his CEO image", "title_page": "White House: Trump's mismanagement of the health crisis again undercuts his CEO image - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) In his closing argument before the 2016 election, Donald Trump pointed voters toward his \"under budget and ahead of schedule\" new Washington hotel: \"A metaphor for what we can accomplish for this country.\"\nTrump pitched himself as a successful businessman and an executive, even though his actual record included a string of spectacular bankruptcies and lawsuits -- including an effort during the 2008 financial crisis to sidestep a $40 million debt to Deutsche Bank by invoking a \"force majeure\" clause likening the economic catastrophe to riots or floods . Rather than pay what he owed, he sued the bank claiming harm to his finances and reputation, eventually settling out of court.\nThat's the executive Americans have seen in the White House during the coronavirus calamity. Instead of accepting responsibility for the administration's laggard, chaotic response, Trump has launched a full-scale attempt to shift blame onto others, including China and the media. Instead of crisp action and clear lines of command, Trump has offered indecision, changing his positions on guidance to the public and routinely undermining his own health experts\nIt's the opposite of the \"buck stops here\" leadership that defines strong corporate executives and presidents alike. Yet while blame-casting may represent Trump's best option as a matter of raw politics, the \"not my fault\" line poses a much tougher sell from the Oval Office than in 2016, when Trump was an outsider.\nThat Trump tried to duck the coronavirus issue from the beginning makes it even harder. The nation's worsening predicament places later rationalizations at odds with earlier ones\n\"I've felt it was a pandemic long before it was called a pandemic,\" he said, to rebut complaints that he overlooked the threat . Earlier, apparently to calm rattled investors, he and his aides repeatedly called coronavirus under control.\nHe has insisted the virus \"snuck up on us,\" faulting China for failing to give \"earlier notice.\" Earlier, when minimizing the risks posed by the disease, he said China's \"very hard\" work would protect Americans\nHe has blamed the Centers for Disease Control and Prevention for years in which it \"did nothing\" to upgrade testing systems. Earlier, at CDC headquarters, he called testing \"perfect\" and available to all\nAs the damage has grown, so have Trump's attempts to absolve himself.\n\"I don't need to have the numbers double because of one ship that wasn't our fault,\" he said, explaining his desire to keep a cruise ship with infected Americans offshore\n\"I don't take responsibility at all,\" he said of the administration's testing woes.\nHis cast of culprits has expanded as desperately-needed medical supplies grow more scarce. He accused his predecessor Barack Obama of having left \"an empty shelf\" in the Strategic National Stockpile.\nHe faulted states, rather than his administration, for failing to counter coronavirus faster. \"They have experts,\" he shrugged.\nHe accused New York Gov. Andrew Cuomo, whose state is bearing the brunt of the US outbreak so far, of requesting ventilators he didn't need . He hit hospitals and front-line medical workers, suggesting they were letting personal protective equipment disappear \"out the back door\" of their facilities.\nHe blamed the media for stoking panic, Democrats for making his crisis management \"their new hoax,\" the Federal Reserve for not protecting the economy earlier. He blamed General Motors for problems in manufacturing new ventilators , having earlier praised business cooperation to justify not using his powers under the Defense Production Act.\nLess than a month ago, he blamed leaders in Europe for insufficient aggression to contain the threat. Now Vice President Mike Pence acknowledges America's plight as \"most comparable\" to that of Italy, which has suffered the most coronavirus deaths on the continent.\nPolls show Trump has benefited from the American tradition of rallying around leaders during crises. But his uptick lags behind those of previous presidents and the governors he targets.\nThat poses political problems for fellow Republicans in November. His allies have lately proffered another excuse: that the Democrats' impeachment effort distracted Trump from coronavirus.\nThe President's aversion to accepting responsibility proved too strong for that. \"Had I not been impeached,\" he told reporters, \"I don't think I'd have acted any faster.\"\nLife and death provides the ultimate yardstick. Claiming success in late February, Trump insisted: \"We have a total of 15 people and they're in a process of recovering.\"\nThis week, administration public health experts called 100,000 to 240,000 fatalities their best-case outcome. Trump in turn credited himself with resisting earlier entreaties to sit back and \"ride it out\" at a cost of more than a million dead.\nVoters soon will judge whether that he has met the standard he set as business executive-turned-candidate four years ago.\n\"The most basic duty of government is to defend the lives of its own citizens,\" he told the 2016 Republican convention. \"Any government that fails to do so is a government unworthy to lead.\"", "url": "https://www.cnn.com/2020/04/05/politics/president-management-covid-2020/index.html"}