{"authors": ["Sarah Westwood"], "date_download": "2020-05-04 16:12:19", "date_modify": "2020-05-04 16:12:19", "date_publish": "2020-04-03 00:11:30", "description": "Dr. Deborah Birx said she can tell by looking at the US curve of coronavirus cases that not every American is following the guidelines set out by the administration for people to stay home and be vigilant about washing their hands.", "filename": "2020_04_02_politics_deborah-birx-coronavirus-slow-spread_index_1588608739.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200319084622-birx-pence-wh-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_deborah-birx-coronavirus-slow-spread_index_1588608739.html", "title": "Dr. Birx: 'Not every American is following' the coronavirus guidelines", "title_page": "Dr. Birx: 'Not every American is following' the coronavirus guidelines - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Dr. Deborah Birx said she can tell by looking at the US curve of coronavirus cases that not every American is following the guidelines set out by the administration for people to stay home and be vigilant about washing their hands.\n\"I know you've seen the slope on the US versus the slope in Italy, and we have to change that slope,\" Birx said. \"What it means in the US is not everyone is doing it.\"\n\"So we're only as strong as every community, every county, every state, every American following the guidelines to a T,\" Birx said. \"And I can tell by the curve ... that not every American is following it.\"\nBirx said other countries have been able to slow the rate of Covid-19 spread after implementing social distancing guidelines.\n\"We can bend ours, but it means everybody needs to take that same responsibility,\" she said, adding that the guidelines mean people should be having \"no dinner parties, no cocktail parties.\"\nRead More", "url": "https://www.cnn.com/2020/04/02/politics/deborah-birx-coronavirus-slow-spread/index.html"}