{"authors": ["Tom Withers"], "date_download": "2020-05-04 21:06:22", "date_modify": "2020-05-04 21:06:22", "date_publish": "2020-04-16 21:23:15", "description": "CLEVELAND (AP) — Andrew Berry knew his first NFL draft as Browns general manager would be special. He didn't expect it to be unlike any draft before it or likely any again. The 33-year-old...", "filename": "_224bdec270bf3ba97de26af9a6ed139a_1588626382.html", "image_url": "https://storage.googleapis.com/afs-prod/media/49b24bff041342c2af58f49f6ee68853/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_224bdec270bf3ba97de26af9a6ed139a_1588626382.html", "title": "Browns likely to land left tackle with No. 10 pick in draft", "title_page": "Browns likely to land left tackle with No. 10 pick in draft", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - At left in a Feb. 28, 2020, file photo, Alabama offensive lineman Jedrick Wills runs a drill at the NFL football scouting combine in Indianapolis. At right, also in a Feb. 28, 2020, file photo, Iowa offensive lineman Tristan Wirfs runs a drill at the NFL football scouting combine in Indianapolis. The Browns are expected to grab a left tackle with the No. 10 overall in this year's NFL draft. There are four highly ranked tackles in this year's class and one should be available when the Browns are on the clock. (AP Photo/Michael Conroy, File)\nFILE - At left in a Feb. 28, 2020, file photo, Alabama offensive lineman Jedrick Wills runs a drill at the NFL football scouting combine in Indianapolis. At right, also in a Feb. 28, 2020, file photo, Iowa offensive lineman Tristan Wirfs runs a drill at the NFL football scouting combine in Indianapolis. The Browns are expected to grab a left tackle with the No. 10 overall in this year's NFL draft. There are four highly ranked tackles in this year's class and one should be available when the Browns are on the clock. (AP Photo/Michael Conroy, File)\nCLEVELAND (AP) — Andrew Berry knew his first NFL draft as Browns general manager would be special. He didn’t expect it to be unlike any draft before it or likely any again.\nThe 33-year-old Berry couldn’t have imagined he’d be picking players inside a “virtual” draft room while connected by computer with Cleveland’s coaches or watching Commissioner Roger Goodell announce the first-round selections from his man-cave basement in a New York suburb.\nBut the COVID-19 pandemic has forced radical adjustments for everyone.\n“We feel like we are going to have a good plan and be very prepared,” said Berry, who has been separated from his wife and their 1- and 2-year-old children during most of the virus outbreak. “I do intend to be in Cleveland on draft night, and we will be ready to go.”\nBerry, believed to be the youngest GM in league history, is hoping to continue a productive offseason for the Browns, who failed to live up to anyone’s expectations last season when they went 6-10 and then went through another coaching and front office purge.\nBerry has addressed some major needs in free agency, while leaving one sizable hole — starting left tackle.\nThe Browns have spent the past two seasons using a Band-Aid approach at the vital position, which was held down for more than a decade by perennial All-Pro Joe Thomas, who retired before the 2018 season.\nIt’s time to find a permanent fix and luckily for the Browns, this year’s draft is loaded with quality tackles, a class led by Alabama’s Jedrick Wills, Iowa’s Tristan Wirfs, Georgia’s Andrew Thomas and Louisville’s Mekhi Becton, a 6-foot-7, 360-pounder brimming with confidence.\n“I feel I’m the most dominant tackle in this draft,” he said at the combine. “You wouldn’t go wrong picking me.”\nTruthfully, the Browns can’t go wrong with any of those four, and Berry said last week that he’s not hung up on whether a player is better suited to play left or right tackle. Wills was strictly a right tackle for the Crimson Tide and Wirfs played mostly right tackle.\n“From my perspective, tackles are tackles,” Berry said. “In terms of guys making the switch, certainly there is an element of muscle memory that needs to be reprogrammed, so to speak, for people who have played one side or the other for a long period of time.”\nThe Browns, who will enter the draft with seven picks, are set at right tackle after signing free agent Jack Conklin to a three-year, $42 million contract.\nGEEK SQUAD\nWith a computer science degree from Harvard, Berry would seem equipped to handle any issue that might arise in the draft. He’s tech savvy.\n“This is maybe where my particular age demographic is perhaps a little bit helpful,” he said. “We live in the age of technology where we have FaceTime, Zoom, Microsoft Teams and just even picking up the phone and giving people a call. From that perspective, it is different, but it is not a challenge that is insurmountable by any means.”\nBACKUP PLAN\nThe loss of linebackers Joe Schobert and Christian Kirksey in free agency has created a depth and experience problem the Browns need to address.\nIt’s unlikely that Clemson’s Isaiah Simmons would slide as far as No. 10, but if he does or if the Browns’ top target at tackle is gone, then this would be an ideal pick. The 6-foot-4, 230-pound Simmons would make an immediate impact behind a defensive line strengthened by the signings of free agents Andrew Billings and Adrian Clayborn.\nSPREAD OUT\nWhile Berry anchors the draft from Cleveland, new Browns coach Kevin Stefanski will be 750 miles away in Minnesota.\nStefanski and his family had delayed their move until after the draft and the coronavirus outbreak has pushed things back even further.\nBerry said he’s confident the Browns are ready for whatever may happen in this most unusual draft.\n“We are going to make sure that we are prepared in any decision-making scenario that we have what we need if there was to be a kind of a Armageddon scenario with power, internet access or something along those lines,” he said.\n“That is really no different than anything you would experience if you were actually in the building navigating the draft process. I think we are pretty well prepared on that front and have a number of strong contingency plans in place.”\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/224bdec270bf3ba97de26af9a6ed139a"}