{"authors": ["Abdul Sattar"], "date_download": "2020-05-04 20:18:50", "date_modify": "2020-05-04 20:18:50", "date_publish": "2020-04-07 10:52:45", "description": "QUETTA, Pakistan (AP) — Pakistan's military promised Tuesday that dozens of doctors who were briefly jailed for protesting a lack of protective equipment needed to treat the growing number of...", "filename": "_8efbc22fbf6b9bee704df6f7330970a1_1588623530.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e4d102cc4f774e8abeeb282ed54c11d5/2722.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8efbc22fbf6b9bee704df6f7330970a1_1588623530.html", "title": "Military promises Pakistani doctors gear to fight virus", "title_page": "Military promises Pakistani doctors gear to fight virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Health workers collect a specimen at a drive-thru testing and screening facility for the coronavirus, in Karachi, Pakistan, Monday, April 6, 2020. Authorities in Pakistan's Sindh province established the first ever drive-thru coronavirus testing facility in Pakistan as part of to control the spread of pandemic coronavirus in the province. (AP Photo/Fareed Khan)\nHealth workers collect a specimen at a drive-thru testing and screening facility for the coronavirus, in Karachi, Pakistan, Monday, April 6, 2020. Authorities in Pakistan's Sindh province established the first ever drive-thru coronavirus testing facility in Pakistan as part of to control the spread of pandemic coronavirus in the province. (AP Photo/Fareed Khan)\nQUETTA, Pakistan (AP) — Pakistan’s military promised Tuesday that dozens of doctors who were briefly jailed for protesting a lack of protective equipment needed to treat the growing number of coronavirus cases will get the equipment they need.\nThe 47 doctors protested in Quetta, the capital of southwestern Baluchistan province, on Monday, when they were detained. They were released later the same day, according to provincial spokesman Liaquat Shahwani.\nAn army statement Tuesday said the “emergency supplies of medical equipment, including PPE (Personal Protective Equipment) are being dispatched to Quetta.”\nHowever, some of the doctors said they were mistreated by police and that some of their colleagues were beaten. The physicians declined to give their names, fearing reprisals.\nTwo doctors have died after contracting the new virus in Pakistan, which has recorded 4,004 cases and 54 deaths. Many of the cases have been traced to pilgrims returning from neighboring Iran. Pakistani authorities have imposed a countrywide lockdown until April 14.\nIn Iran, authorities struggling to battle the virus announced Tuesday they would expand testing to asymptomatic people, but didn’t say how many test kits they have available or provide other details.\nIran’s Health Minister Saeed Namaki said that with active screening of such cases, there are expectations the virus and COVID-19, the illness it causes, can be brought under control by mid-May.\n“With this step, we will go after people without symptoms,” said Namaki, adding this would require a large number of tests. He didn’t elaborate. The health ministry said searching for asymptomatic cases would be combined with restrictions on both city and intercity travel and quarantine.\nIran is facing the worst outbreak in the region. Iran’s state TV said Tuesday the new coronavirus has killed another 133 people, pushing the country’s death toll to 3,872 amid 62,589 confirmed cases.\nThe health ministry’s spokesman, Kianoush Jahanpour, said 27,039 people have recovered so far while 3,987 remain in critical condition.\nThere are nearly 109,000 confirmed cases across the Middle East, with more than 4,600 fatalities.\nIn Amman, Jordan, state-run news agency Petra reported that a criminal case had been filed against a person infected with the coronavirus who knowingly contacted others, exposing them to infection.\nThe report came as government spokesperson Amjad Adaileh said Tuesday that anyone infected with the coronavirus who doesn’t isolate themselves faces a possible fine or imprisonment.\nJordan has more than 350 confirmed cases of the virus, among them six fatalities.\nIn Egypt, the Ministry of Religious Endowments, which oversees mosques nationwide, called off all celebrations and late-evening prayer services for Ramadan, the holiest month of the Islamic calendar. The holiday, when devout Muslims fast from sunrise to sunset, begins April 23. To the dismay of many impoverished Egyptians already hit hard by restrictive measures, the ministry added that mosques would not host public iftars, the traditional dinners where Muslims end their daily fast.\nMosques and churches have already closed for prayer to curb the spread of the virus in the Arab world’s most populous country. There is also a nightly curfew but the government has resisted a harsher lockdown.\nPresident Abdel Fattah el-Sissi on Tuesday sought to reassure the jittery public as the Health Ministry’s case count jumped to 1,450, including 94 deaths.\n“So far, the situation is under control,” he said in televised comments. “The goal is to minimize the damage caused by the pandemic.”\nFor most people, the new coronavirus causes mild to moderate symptoms such as fever and cough. But for some, especially older adults and the infirm, it can cause pneumonia and lead to death.\nIsrael said Tuesday it would begin requiring face masks for most people in public places starting Sunday.\nMeanwhile, at a retirement home ravaged by the coronavirus in the southern Israeli city of Beersheba, another resident died, the eighth so far there. Dozens of the home’s residents have been infected and relatives have been staging angry protests outside the premises in recent days.\nOverall, more than 9,200 have been infected in Israel and 65 have died, the vast majority elderly and many in assisted living facilities.\n___\nAssociated Press writers Nasser Karimi and Amir Vahdat in Tehran, Iran; Samy Magdy and Isabel DeBre in Cairo, Omar Akour in Amman, Jordan, and Tia Goldenberg and Aron Heller in Jerusalem contributed to this report.\n___\nFollow AP news coverage of the coronavirus pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/8efbc22fbf6b9bee704df6f7330970a1"}