{"authors": ["Paul R. La Monica", "Cnn Business"], "date_download": "2020-05-04 16:02:28", "date_modify": "2020-05-04 16:02:28", "date_publish": "2020-04-01 18:57:12", "description": "Doctors used to make house calls as a normal part of their practice. That's starting to become more common again.", "filename": "2020_04_01_investing_heal-doctor-house-calls_index_1588608148.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401093541-heal-app-doctor-home-appointment-file-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_investing_heal-doctor-house-calls_index_1588608148.html", "title": "The doctor will see you now...in your living room", "title_page": "The doctor will see you now -- in your living room - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Doctors used to make house calls as a normal part of their practice. That's starting to become more common again.\nMany Americans are being asked to shelter in place because of the coronavirus outbreak. That's why several health care tech companies have been touting services that allow patients to see doctors at their homes if they're not feeling well but don't have Covid-19 symptoms.\nOne high-profile home doctor company is called Heal -- founded in 2015 by entrepreneur Nick Desai and his wife Dr. Renee Dua, a nephrologist (kidney specialist) who is also Heal's chief medical officer.\nCNN Business spoke to Desai about the growth potential for the company and the unique challenges posed by the fact that patients and doctors need to be extra careful given how contagious the coronavirus is.\nDesai said if a patient thinks they may have Covid-19, Heal will first set up a telemedicine visit and only send a doctor to a person's home after ruling out coronavirus.\nHeal has a team of more than 150 doctors in seven states and Washington, DC. The physicians and other medical professionals work for Heal -- not hospitals or private practices. The goal is to expand even further, Desai said.\nAnd once a doctor does make a house call, they wear masks, gloves and other full body protective gear. A medical assistant also joins the doctor to administer vaccines and other shots and take blood and urine samples as needed.\nMaking doctor visits as easy as ordering food online\nThe goal is to prevent people from getting more sick by being exposed to a doctor's waiting room or ER.\n\"If we think you have Covid-19 and if the symptoms are mild, then the care plan is to stay home. We want to keep people out of the hospital,\" Desai said.\nHe added that it is also important to not overlook the many Americans who still need routine health care for chronic conditions -- or who just happen to get sick from a cold, flu or other common ailment.\nAnd it isn't always helpful for a sick person to go to their doctor, urgent care or an emergency room when they aren't feeling well -- especially now that hospitals are already under immense pressure.\nIn fact, Desai said he and his wife decided to start Heal five years ago after their infant son had a fever. Their pediatrician told them to go to the ER...and after the baby was finally seen by a doctor following a seven hour wait, the fever was gone.\n\"We thought that there has to be a better way,\" Desai said. \"We wanted to make ordering a doctor as easy as ordering a pizza by using an app or a website.\"\nDesai added that with Heal, regular patients can also request specific doctors so they don't have to see someone different whenever there is a problem.\nHome and virtual medical visits part of a growing trend\nTeladoc TDOC There is a lot of competition from rivals. Pager, MedZed, Dose Healthcare and DispatchHealth are some of the more prominent home doctor services. Heal also has to contend with the likes of, a virtual doctor service whose stock has soared this year.\nBut Heal is backed by $100 million in venture capital funding.\nQualcomm QCOM The company also has an eclectic mix of investors -- including formerChairman Paul Jacobs, former Florida governor Jeb Bush and singer Lionel Richie.\nUnitedHealth UNH CVS CVS Anthem ANTM Heal accepts Medicare and health insurance from all the major corporate plan providers (i.e. companies like-owned Aetna and) and charges an upfront price for each visit. A standard house call visit is $159 while a telehealth appointment is $79.\nDesai said the goal for his company is to let patients rest easy and not worry about leaving their home when they are not feeling well...and feeling worse once they get a bill or explanation of benefits statement.\n\"If a patient is sick, it's odd that they have to pick if they should go to their doctor or not or maybe the ER. The doctor should come to them and make the decisions. And there should be price transparency,\" Desai said.", "url": "https://www.cnn.com/2020/04/01/investing/heal-doctor-house-calls/index.html"}