{"authors": ["Clare Foran"], "date_download": "2020-05-04 16:24:29", "date_modify": "2020-05-04 16:24:29", "date_publish": "2020-04-06 23:35:56", "description": "A bipartisan group of senators sent a letter to President Donald Trump on Monday calling for him to \"lead a strong, coordinated federal effort to support first responders\" by addressing a national shortage of personal protective equipment as the US fights the coronavirus crisis.", "filename": "2020_04_06_politics_coronav_32c7fa009f2c9a9dc6a734220e5f722f_index_1588609469.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402194627-lakewood-new-jersey-police-car-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_coronav_32c7fa009f2c9a9dc6a734220e5f722f_index_1588609469.html", "title": "Bipartisan group of senators calls on Trump to address protective equipment shortage for first responders", "title_page": "Bipartisan group of senators calls on Trump to address protective equipment shortage for first responders   - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) A bipartisan group of senators sent a letter to President Donald Trump on Monday calling for him to \"lead a strong, coordinated federal effort to support first responders\" by addressing a national shortage of personal protective equipment as the US fights the coronavirus crisis.\nThe senators wrote, \"Specifically, this requires utilizing your authorities under the Defense Production Act to strengthen domestic manufacturing capacity by incentivizing private firms to produce PPE, including respirators, gloves, gowns, and eye protection, and to allocate some of these resources to first responders.\"\nThe Defense Production Act was passed in 1950 in response to production needs during the Korean War and gives the government more control during emergencies to direct industrial production.\nEleven senators signed the letter, including Democrats Chris Coons and Tom Carper of Delaware, Maggie Hassan of New Hampshire, Gary Peters of Michigan, Dick Durbin of Illinois, Richard Blumenthal of Connecticut and Amy Klobuchar of Minnesota, along with Republicans Susan Collins of Maine, Lisa Murkowski of Alaska, Bill Cassidy of Louisiana and Jerry Moran of Kansas.\nThe Trump administration has faced intense pressure to make use of the DPA, and has invoked it in some instances. But there have been ongoing calls from lawmakers for the President to take further action to utilize the law.\nRead More", "url": "https://www.cnn.com/2020/04/06/politics/coronavirus-personal-protective-equipment-first-responders/index.html"}