{"authors": [], "date_download": "2020-05-04 20:15:06", "date_modify": "2020-05-04 20:15:06", "date_publish": "2020-04-04 16:48:57", "description": "WICHITA, Kan. (AP) — A cluster of COVID-19 cases has been found at a rehabilitation center in Kansas City, Kansas, where 17 residents and two staff members have tested positive for the...", "filename": "_de42d691badaeeb5ae056851f9ca71dd_1588623306.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_de42d691badaeeb5ae056851f9ca71dd_1588623306.html", "title": "Virus cluster found at Kansas rehabilitation center", "title_page": "Virus cluster found at Kansas rehabilitation center", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WICHITA, Kan. (AP) — A cluster of COVID-19 cases has been found at a rehabilitation center in Kansas City, Kansas, where 17 residents and two staff members have tested positive for the virus.\nSix of those 17 residents at the Riverbend Post Acute Care Center have been hospitalized, said Dr. Allen Greiner, chief medical officer with the Unified Government of Wyandotte County and Kansas City, Kansas. The facility has 135 residents.\nRiverbend executive director Cory Schulte told The Kansas City Star that patients who remain at the facility are receiving care from its clinical team.\nKansas health officials on Saturday reported 21 coronavirus deaths as the number of confirmed cases in the state increased to 698, up 78 from a day earlier.\nThe greatest number of cases are in the Kansas City area, with 185 cases in Johnson County and 149 in Wyandotte County. But the outbreak continues to spread across Kansas with 49 of the state’s 105 counties now having a confirmed case.\nMost infected people develop mild or moderate symptoms that clear up within three weeks, such as fever and cough. But older adults and people with existing health problems are particularly susceptible to more severe illness, including pneumonia.\nKansas officials said they have received some medical supplies from the Strategic National Stockpile. Starting this weekend, the Kansas National Guard and Kansas Wing of the Civil Air Patrol are distributing masks, face shields, surgical gowns and gloves to all 105 counties, based on each county’s population. The supplies are being coordinated through county emergency managers who are distributing them.\nWichita State University also announced it has decided to move this summer’s classes to an online or remote format. Provost Rick Muma said in a letter to students and faculty that the decision was made out of an abundance of caution.\n“As our lives, both on campus and off, continue to be disrupted by the COVID-19 crisis, our priority remains the health, safety and well-being of our entire campus community. While we had hoped to be able to return to some sense of normal by the summer months, the situation remains uncertain,” he wrote.", "url": "https://apnews.com/de42d691badaeeb5ae056851f9ca71dd"}