{"authors": ["Analysis Laura He", "Cnn Business"], "date_download": "2020-05-04 16:55:43", "date_modify": "2020-05-04 16:55:43", "date_publish": "2020-04-09 03:40:11", "description": "Oil is cheaper right now than it has been in years. That's great news for China — the world's second largest consumer of oil and its biggest importer — which has been building up huge reserves and needs energy to restart its economy.", "filename": "2020_04_08_business_oil-prices-china-imports_index_1588611343.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407221133-china-oil-spr-us-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_business_oil-prices-china-imports_index_1588611343.html", "title": "China has been stockpiling oil for years. Low prices give it reason to buy more", "title_page": "China has been stockpiling oil for years. With prices this low, it may buy more - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Hong Kong (CNN Business) Oil is cheaper right now than it has been in years. That's great news for China — the world's second largest consumer of oil and its biggest importer — which has been building up huge reserves and needs energy to restart its economy.\nUS oil futures and Brent crude cratered to 18-year lows last month as demand collapsed because of lockdowns sparked by the coronavirus pandemic, and as Saudi Arabia flooded the market with additional supply in a price war with Russia.\nWhile prices have recovered somewhat since then on hopes that OPEC and Russia may agree to cut production , it's still \"clearly good timing\" for the world's largest importer of crude to step in and snap up whatever it can, according to Dennis Ip, head of China and Hong Kong energy research at Daiwa Capital Markets.\nStocking up on foreign oil\nHoarding inexpensive oil is critical for China, which has been working for years to bolster its emergency stockpile of oil reserves\nAs the country's economy grows, China has become increasingly reliant on foreign oil. Last year, it imported 72% of the crude oil it used, the highest proportion on record, according to CNPC Economics and Technology Institute, the research arm of a major state-owned energy conglomerate in China.\nThe heavy dependence on foreign supply has spurred Beijing to focus on ways it can prevent energy shortages. In addition to requiring state-owned oil companies to increase production, the country has spent years working to increase the amount of oil it keeps in reserve.\nThe reserve is especially important, given how much domestic production lags behind imports. Last year, China produced 191 million tons of crude oil, according to CNPC, less than 30% of its annual consumption.\n\"It has become more clear that China should — and will — pay more attention\" to increasing its reserves, Ip said.\nThis year is also supposed to mark an important milestone for China's oil reserves. By the end of 2020, the country wants to have 85 million tons of oil in its emergency stockpile. That's almost as much as the United States keeps in its Strategic Petroleum Reserve — the world's largest backup oil supply.\nEven government researchers in China have pointed out the fortuitous timing of last month's crash.\nThe country needs to \"seize the opportunity of super-low oil prices\" and expand its strategic oil reserve before prices rise again, according to an article published in state media last month by Wang Li, a researcher for the Ministry of Commerce.\nA closing window of opportunity\nBeijing already appears to have started stocking up. China bought 44.9 million tons of crude in March, up significantly from February's 11-month low of 39.8 million tons, according to Refinitiv. The data provider expects April's imports to match or exceed last month's.\nThe amount of crude that China bought in March nearly rivaled what it was buying before the coronavirus pandemic broke out, even though the crisis depressed industry in the country. The amount of power generated each day in China by mid-March was around 80% of pre-coronavirus levels, for example. And air passenger travel last month was less than half of what it was before the pandemic.\nIt is possible some of that cheap crude might be going into the country's strategic reserve — China is notoriously secretive about its emergency supply, making it difficult to know exactly how and when it is stocked.\nBut the reserve may not be the only reason China wants more oil right now. As the country emerges from the worst of the coronavirus pandemic and tries to restart its economy, it is going to need more oil. Factories are starting to open up again, and cars are returning to the roadways as lockdowns are lifted.\nDomestic refineries are also reopening along with the rest of the coronavirus-stricken economy, meaning that they can now process foreign crude again, said Yan Chong Yaw, director of oil research and forecasts in Asia at Refinitiv.\n\"China's industry is coming back to life, and they need oil and lots of it,\" said Stephen Innes, chief global market strategist for Axi Corp.\nIn his article last month, Wang, the Ministry of Commerce researcher, noted that barrels trading below $30 are \"abnormal\" and unlikely to last long. Brent has already crept back up above that mark, and US oil last week got a boost on expectations that big production cuts could be on the way.\nOPEC, meanwhile, is expected to meet with Russia on Thursday to discuss supply cuts and ending the price war, which could give oil prices another boost.\n\"There's a solid chance we get an OPEC deal this week,\" Innes said. \"When the going is cheap,\" he added, it's wise to take advantage of the dip.", "url": "https://www.cnn.com/2020/04/08/business/oil-prices-china-imports/index.html"}