{"authors": ["Rob Gillies"], "date_download": "2020-05-04 20:09:20", "date_modify": "2020-05-04 20:09:20", "date_publish": "2020-04-09 17:02:06", "description": "TORONTO (AP) — Canadian Prime Minister Justin Trudeau said Thursday Canadians will need to stay at home and practice physical distancing for months as the first wave of COVID-19 cases in the...", "filename": "_ab8e2d99f1caec1ffef9148d758ea8d3_1588622960.html", "image_url": "https://storage.googleapis.com/afs-prod/media/631a69434a6c4b738857469eb049701c/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ab8e2d99f1caec1ffef9148d758ea8d3_1588622960.html", "title": "Canada's first wave of cases won't end until the summer", "title_page": "PM: Canada's first wave of cases won't end until the summer", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "TORONTO (AP) — Canadian Prime Minister Justin Trudeau said Thursday Canadians will need to stay at home and practice physical distancing for months as the first wave of COVID-19 cases in the country won’t end until the summer and Canada won’t return to normal until there is a vaccine — which could take a year and a half.\nTrudeau’s starkest comments to date about the pandemic came as Canada’s top public health officer predicted it could cost at least 4,500 lives and a government agency announced the Canadian economy lost 1,011,000 jobs in March.\nTrudeau said the country is in the early stage of the outbreak because the virus came to Canada later than to some other nations and he said the first wave won’t reach its peak until late spring. Trudeau called it the “challenge of our generation.”\n“This is the new normal, until a vaccine is developed,” Trudeau said. “It will take months of continued, determined effort. We’ll need to keep practicing physical distancing, staying home and washing our hands.”\nOnce Canada gets through the first wave, some economic activity will start up again, he said.\n“It’s important that people understand that we will have to be vigilant for a year or year and half. There will be things we are not able to do,” Trudeau said.\nHe said that even after the first wave ends, smaller outbreaks are likely until there is a vaccine. Canada had more than 19,774 confirmed cases and 461 deaths as of Thursday. The country has conducted more than 373,000 tests.\nHealth officials said they expected the number of Canadians killed by the disease to double over the next week said that without controls in place, models show as many as 80% of Canada’s population could become infected, and as many as 350,000 could die.\n“These stark numbers tell us we must do everything we can now to remain in that best-case scenario,” said Dr. Theresa Tam, Canada’s chief public health officer.", "url": "https://apnews.com/ab8e2d99f1caec1ffef9148d758ea8d3"}