{"authors": ["Por Stephen Wade"], "date_download": "2020-05-04 20:24:44", "date_modify": "2020-05-04 20:24:44", "date_publish": "2020-04-20 16:24:29", "description": "TOKIO (AP) — Un profesor japonés especializado en enfermedades infecciosas manifestó sentirse “muy pesimista” de que los pospuestos Juegos Olímpicos de Tokio se puedan inaugurar dentro de 15...", "filename": "_f4de7792b86640f4842da4153ecb5a3c_1588623884.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c1c63b8bde644647a2966af5eb4a46d0/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f4de7792b86640f4842da4153ecb5a3c_1588623884.html", "title": "Experto japonés ve con pesimismo realizar JJOO en 2021", "title_page": "Experto japonés ve con pesimismo realizar JJOO en 2021", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\n1 of 2\n1 of 2\n1 of 2\n1 of 2\nTOKIO (AP) — Un profesor japonés especializado en enfermedades infecciosas manifestó sentirse “muy pesimista” de que los pospuestos Juegos Olímpicos de Tokio se puedan inaugurar dentro de 15 meses.\n“Siendo honestos con ustedes, no creo que los Juegos Olímpicos se realizarán el año próximo”, dijo Kentaro Iwata, profesor de enfermedades infecciosas en la Universidad de Kobe al participar el lunes en una teleconferencia. “Organizar los Juegos Olímpicos necesita de dos condiciones; la primera es controlar el COVID-19 en Japón, y controlar el COVID-19 en todas partes”.\nToshiro Muto, el director ejecutivo del comité organizador de los Juegos de Tokio, planteó sus propias dudas hace 10 días. Desde entonces, el comité organizador y el Comité Olímpico Internacional señalaron que no existe un “Plan B”, salvo seguir con la fecha prevista para inaugurar la justa, el 23 de julio de 2021.\n“Estoy muy pesimista de tener los Juegos Olímpicos el próximo verano al menos que se puedan efectuar con una estructura totalmente diferente, como lo sería sin público o con una participación muy restringida”, dijo Iwata en un foro organizado por el Club de Corresponsales Extranjeros de Japón en Tokio.\n“Tienes que invitar a muchos deportistas de diversos lugares, lo cual no compagina con esta infección de COVID-19 que ha causado una pandemia. Japón podría tenerlo bajo control para el próximo verano. Espero que podamos. Pero no creo que eso será posible en cada rincón del planeta”.\nJapón sorteó bien la fase inicial del brote del nuevo coronavirus. Pero los casos se han disparado, particularmente en Tokio y otras grandes ciudades. El número de casos en Japón llegó el lunes a los 12.000, con casi 250 decesos.\nDevi Sridhar, profesora de salud pública de la Universidad de Edinburgo, afirmó que la realización de los Juegos podría depender de encontrar una vacuna.\n“Todo depende de que tengamos una vacuna”, dijo Sridhar la semana pasada. “Si usted habla con alguno de los científicos, lo que te dicen es que tendremos una vacuna en otoño y podremos fabricarla rápidamente para que la gente la reciba. Si lo logramos, yo diría que tendríamos una buena posibilidad de ir adelante con los Juegos Olímpicos”.\nSridhar indicó que sin una vacuna, la cita de 2021 es poco probable. Lo mismo se aplica a los Juegos de Invierno de 2022 en Beijing a inaugurarse en China en febrero — apenas seis meses después de la clausura de la cita de verano.\n“Si pareciera que en los próximos meses tener la vacuna resulta ser complejo, que provoque serios efectos colaterales o que no sea efectiva o no estemos generando inmunidad en la población, me parece que (los Juegos) tendrían que retrasarse”, dijo Sridhar.\nEl doctor Ali S. Khan, decano de la Facultad de Salud Pública de la Universidad de Nebraska, dijo a The Associated Press en un correo electrónico que la competencia podría realizarse sin una vacuna.\n“Quince meses es mucho tiempo en salud pública para controlar este problema sin vacuna o una medicina”, dijo Khan, al sugerir que la creatividad del “aparato médico industrial” podrá resolver el problema.\n“Piensen en tener dispositivos personales para detectar la enfermedad de la misma manera que lo hacemos para medir los niveles de azúcar en la sangre”, dijo Khan.\nTambién señaló que se debería “replantear” la magnitud de los Juegos en cuanto a “sedes, deportistas y espectadores”.\nLos Juegos de Verano convocan a 11.000 deportistas, con 4.400 en los Paraolímpicos, todos acompañados con entrenadores y colaboradores. Los deportistas se alojarán en un complejo de departamentos en la Bahía de Tokio. Además, miles de visitantes extranjeros acuden a los Juegos Olímpicos, dependiendo de desplazamientos en avión y cientos de hoteles.\nEl miembro del COI John Coates, director de la misión observadora de Tokio, dijo la semana pasada que el COI cuenta con “la mayor cantidad de tiempo posible”. Pero reconoció la posibilidad de un cambio no esperado.\n“Podría enfrentar una situación con respecto a las conglomeraciones de gente, las pruebas a las que deberá someter a los deportistas”, dijo Coates. “Es algo prematuro”.", "url": "https://apnews.com/f4de7792b86640f4842da4153ecb5a3c"}