{"authors": ["Lauren Fox", "Manu Raju"], "date_download": "2020-05-04 16:06:36", "date_modify": "2020-05-04 16:06:36", "date_publish": "2020-04-02 12:36:44", "description": "The White House and federal agencies face a colossal challenge of dispersing more than $2 trillion of stimulus money approved by Congress last week.", "filename": "2020_04_02_politics_trump-a_17f2e89422a8fc380e7964ad54b99d77_index_1588608396.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327164033-trump-signs-stimulus-package-0327-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_trump-a_17f2e89422a8fc380e7964ad54b99d77_index_1588608396.html", "title": "Trump administration faces difficult test as it prepares to spent trillions from stimulus", "title_page": "Trump administration faces difficult test as it prepares to spent trillions from stimulus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The White House and federal agencies face a colossal challenge of dispersing more than $2 trillion of stimulus money approved by Congress last week .\nWith the economy in freefall, there is a particular emphasis on speed, but also fears that the government won't be able to meet the demand of struggling Americans as it tries to get its programs up and running while guarding against fraud.\nOfficials involved with implementing the legislation say federal agencies are staffing up, issuing guidance and working around the clock to prepare to disburse money quickly , but glitches in technology, delays and staffing and resource shortages are almost inevitable given the sheer size of the country's largest-ever stimulus package.\n\"This is a national consequence of passing a $2 trillion bill in two weeks,\" one person familiar with the implementation told CNN on background in order to speak freely about what they are hearing. \"I don't know if we know all the implementation issues yet.\"\nThe current crisis is unlike any that federal officials have ever dealt with. The closest comparison, sources say, was the aftermath of the 2008 financial crisis, that led to the passage of the $700 billion bank bailout followed by the $787 billion stimulus bill in 2009 . That money took months to disburse and amounted to just fraction of the amount in the newly enacted laws.\nThe bureaucratic challenges are massive. New programs have to be established, people have to be hired, and new rules are needed to govern the distribution of hundreds of billions in new loans. This bureaucratic burden is going to fall particularly hard on one agency, the Small Business Administration, which handled $28 billion in loans in 2019, and is suddenly in charge of doling out more than 10 times that amount with $350 billion allocated for new loans for small businesses\nTo expedite the processing of the loans, the new legislation allows lenders who weren't previously approved to work with SBA -- but they'll have to apply, which could also take time.\nSmall businesses affected by coronavirus will be able to apply for two types of loans. The first, Economic Injury Disaster Loans, existed before the stimulus, but were expanded by $10 billion.\nThe larger lift will be implementing the new Paycheck Protection Program, which small business owners can begin applying to on Friday. But, while the Treasury Department has issued guidance about how the program will work, there are questions as to whether SBA and lenders around the country will be able to handle such a large volume of applicants in just a matter of days.\nAnd, there are questions about what happens if the demand for loans exceeds the money available.\nAdministration officials said there \"could be millions of applications\" on Friday and beyond, and acknowledged that there is potential for problems, particularly given that the vast number of applicants will apply online given stay-at-home orders across the country.\n\"This is an unprecedented program,\" one administration official said. \"We don't know until people actually start applying for the program, but we are making sure the system has the capacity to process whatever loans come in on Friday.\"\nTapping the private sector\nA source familiar with the SBA implementation told CNN that the stimulus bill included $500 million for administrative costs associated with the massive increase in loans, and that SBA had already hired Microsoft and Amazon to help the agency implement the expansion.\n\"They are developing a simple, streamlined standard application and between all of the partners have about 3,000 people supporting this from the private sector,\" the source said.\nThe SBA also contracted with Rocket Mortgage to help them process the Economic Injury Disaster loans.\nBut, over the weekend, one aide familiar with the program said that they heard concerns from small business owners applying for the disaster loan program online that the portal had slowed. Disaster loans are administered directly by the SBA. Aides say starting Friday, most small business owners will apply for the Paycheck Protection Program loans directly through their lenders, not on the SBA website, which may help shore up issues with business owners directly experiencing delays.\nEven with that help, it's still unclear if the SBA will be able to handle a program that is more than 10 times the size of the annual loans they disburse.\nOn Capitol Hill, aides say Sens. Marco Rubio, the chairman of the Senate's Small Business Committee, and Rep. Nydia M. Velázquez, chairwoman of the House Small Business Committee, have been in regular communication with SBA Administrator Jovita Carranza. Rubio has also had several conversations with Treasury Secretary Steve Mnuchin, who is helping oversee the program.\nOther agencies could feel the strain\nTrouble could also arise in getting direct payments that were part of the stimulus package to people who make less than $100,000 a year. Aides familiar with the process tell CNN that the IRS informed lawmakers last week that roughly 150 million taxpayers will be eligible for the payments. Of those, the IRS said about 70 million people's direct deposit information is on file. But, for roughly 80 million Americans, the IRS only had mailing addresses.\nOn Wednesday, 41 members of the Senate Democratic Caucus sent a letter raising more concerns about \"contradictory\" guidance from the IRS and Treasury about whether Social Security beneficiaries who don't file tax returns at all can get the checks outlined in the stimulus legislation.\n\"This (IRS) filing requirement would place a significant burden on retired seniors and individuals who experience disabilities,\" the senators wrote.\nLate Wednesday, the Treasury Department clarified that Social Security beneficiaries can get their stimulus checks without having to file tax returns.\nStill, aides familiar with the situation tell CNN that Treasury is confident they can get people with direct deposit information their checks within three weeks, but for the other 80 million people, the timeline could stretch months.\n\"The Bureau of Fiscal Service estimates they can cut 20 million checks a month,\" a source familiar told CNN.\nThat means it could take some Americans up to four months to get their money. The checks could take even longer to get to people for whom the IRS does not have tax information.\nAides say that one idea being floated is to see if the IRS can create a web portal where individuals could authenticate themselves and upload their direct deposit information. But, there are still barriers to ensuring the program is protected against fraud and to ensure the program is accessible and easy enough for people stuck at home.\nNext steps divide Congress\nEven as the federal government is trying to determine how to deal with the recently enacted measures, Speaker Nancy Pelosi is intensifying her focus on a fourth recovery package , which she wants to move soon after the House returns -- currently scheduled for April 20.\nAlready, Pelosi has outlined a host of measures -- from a major investments in infrastructure and broadband to funding for state and local governments to bolstering vote-by-mail programs -- that she wants to advance in a matter of weeks.\nPelosi said there's no reason to wait to put the bill together amid the worsening economic situation.\n\"So rather than putting it off further, why aren't we working together?\" she said Wednesday on CNN.\nBut Senate Majority Leader Mitch McConnell has said he disagrees with Pelosi's talk of imminently moving a fourth package.\n\"The Treasury Department's got a massive, complicated problem here in getting all this money out rapidly,\" McConnell said on Fox News radio. \"And the speaker is already talking about phase four. Well, we may need a phase four, but we're not even fully into phase three yet.\"", "url": "https://www.cnn.com/2020/04/02/politics/trump-admin-challenge-dispersing-trillions-in-stimulus/index.html"}