{"authors": ["Andrew Demillo"], "date_download": "2020-05-04 20:06:17", "date_modify": "2020-05-04 20:06:17", "date_publish": "2020-04-09 17:12:00", "description": "LITTLE ROCK, Ark. (AP) — Arkansas' top health official on Thursday encouraged a Little Rock abortion clinic to stop seeing out-of-state patients during the coronavirus outbreak but stopped short...", "filename": "_aa4fdf195159361ff24f12047dfd63db_1588622777.html", "image_url": "https://storage.googleapis.com/afs-prod/media/3c4a403f5dae40ae8e38f2282dcf8529/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_aa4fdf195159361ff24f12047dfd63db_1588622777.html", "title": "Arkansas advises abortion clinic to halt out-of-state visits", "title_page": "Arkansas advises abortion clinic to halt out-of-state visits", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Two people walk past exercise equipment that has been taped off to keep people from using it as part of the newest measure by Mayor Harold Perrin in the effort to prevent the spread of COVID-19 on Thursday, April 9, 2020, at Craighead Forest Park in Jonesboro, Ark. (Quentin Winstine/The Jonesboro Sun via AP)\nTwo people walk past exercise equipment that has been taped off to keep people from using it as part of the newest measure by Mayor Harold Perrin in the effort to prevent the spread of COVID-19 on Thursday, April 9, 2020, at Craighead Forest Park in Jonesboro, Ark. (Quentin Winstine/The Jonesboro Sun via AP)\nLITTLE ROCK, Ark. (AP) — Arkansas’ top health official on Thursday encouraged a Little Rock abortion clinic to stop seeing out-of-state patients during the coronavirus outbreak but stopped short of ordering the facility to halt abortions.\nHealth Secretary Dr. Nathaniel Smith said officials investigated the Little Rock Family Planning Services, the state’s only surgical abortion provider. Arkansas has ordered medical providers to reschedule elective procedures that can be “safely postponed” because of the outbreak, but has not said whether that restricts or bans abortion in the state.\n“We have found a significant portion of the patients were coming from surrounding states and have advised them to discourage that,” Smith told reporters. He said the state would consider further directives if the clinic doesn’t follow its advice.\nThe American Civil Liberties Union of Arkansas, which represents the clinic, has said the facility has modified its practices in response to the state’s directives but did not say whether that means the facility has stopped performing abortions for out-of-state patients.\nOther states, including neighboring Texas and Oklahoma , have moved to ban or restrict abortions using similar orders.\nTHREE MORE DEATHS\nHealth officials said the number of coronavirus cases in Arkansas has risen to at least 1,119, up from 1,071 the night before.\nThree more people have died from the virus, bringing the state’s total deaths to 21. Smith said two of the deaths were in their 60′s, while the other was in their 70′s.\nCASES IN STATE HOSPITAL\nThe Arkansas State Hospital and the Arkansas Department of Health are responding after seven hospital patients tesed positive for COVID-19, the illness caused by the new coronavirus.\nIn a joint statement Thursday, hospital and department officials said two other patients tested negative and one still has test results pending.\nAll 10 staff members tested had negative results. Employees are screened daily as they enter the hospital.\nEASING ABSENTEE RULES REJECTED\nArkansas lawmakers rejected an effort to allow voters this fall to cast an absentee ballot without an excuse because of the coronavirus outbreak.\nThe Joint Budget Committee voted down the proposal, which would have waived state law that only allows absentee ballots due to illness, physical disability or the voter being unavoidably absent. The proposal would have waived the requirement through the end of this year.\nGov. Asa Hutchinson had waived the requirement for the state’s primary runoff last month. Arkansas does not have a statewide election until the November general election.\nArkansas has had at least 1,077 coronavirus cases and 18 deaths. For most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia.\nSen. Joyce Elliott, who proposed the absentee voting measure, cited the long lines and waits voters in Wisconsin faced this week.\n“There’s no need for that to happen here,” said Elliott, a Democrat who’s running against Republican U.S. Rep. French Hill in November for a congressional seat representing central Arkansas.\nHutchinson said he’d be open to again waiving the rules if the state is still in the midst of a coronavirus emergency in November.\n___\nCheck out more of the AP’s coronavirus coverage at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/aa4fdf195159361ff24f12047dfd63db"}