{"authors": ["Konstantin Toropin"], "date_download": "2020-05-04 16:12:07", "date_modify": "2020-05-04 16:12:07", "date_publish": "2020-04-03 03:41:08", "description": "The Life Care Center of Kirkland, Washington, which was an epicenter of Covid-19 cases in the early days of the pandemic, faces a fine of more than $611,000 if it does not correct problems found by federal inspectors.", "filename": "2020_04_02_health_washington-nursing-home-life-care_index_1588608727.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200324090013-03-life-care-center-kirkland-0307-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_health_washington-nursing-home-life-care_index_1588608727.html", "title": "Washington coronavirus: Nursing home where dozens died faces federal fine", "title_page": "Washington coronavirus: Nursing home where dozens died faces federal fine - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Life Care Center of Kirkland, Washington, which was an epicenter of Covid-19 cases in the early days of the pandemic, faces a fine of more than $611,000 if it does not correct problems found by federal inspectors.\nInspectors for the Centers for Medicare and Medicaid Services (CMS) found three \"immediate jeopardy\" deficiencies as well as several less severe issues when they first visited the facility from March 6 to March 16, a summary for that visit shows.\n\"The facility failed to have a system in place that ensured timely action related to an identified respiratory outbreak within the facility,\" the federal agency wrote in the report, explaining why Life Care didn't provide its residents an adequate level of care.\n\"There was no evidence the facility recognized all possible systemic risks and concerns related to this known outbreak,\" the report adds.\nAt least 35 coronavirus deaths are associated with the Washington state facility, according to officials. The virus infected two-thirds of residents and dozens of staff members.", "url": "https://www.cnn.com/2020/04/02/health/washington-nursing-home-life-care/index.html"}