{"authors": ["David Biller"], "date_download": "2020-05-04 20:24:22", "date_modify": "2020-05-04 20:24:22", "date_publish": "2020-04-14 20:05:30", "description": "RIO DE JANEIRO (AP) — The governors of Rio de Janeiro and Para states in separate videos on Tuesday said they have tested positive for the new coronavirus, after weeks of imposing measures aimed...", "filename": "_5252ab10789d6ddefe255015826cd8be_1588623862.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9e27a671f582476f98e0214781ab8341/2871.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5252ab10789d6ddefe255015826cd8be_1588623862.html", "title": "2 Brazilian governors announce they have COVID-19", "title_page": "2 Brazilian governors announce they have COVID-19", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Sept. 23, 2019 file photo, Gov. Wilson Witzel speaks during a news conference in Rio de Janeiro, Brazil. Witzel said Tuesday, April 14, 2020, that he has tested positive for the new coronavirus. (AP Photo/Silvia Izquierdo, File)\nFILE - In this Sept. 23, 2019 file photo, Gov. Wilson Witzel speaks during a news conference in Rio de Janeiro, Brazil. Witzel said Tuesday, April 14, 2020, that he has tested positive for the new coronavirus. (AP Photo/Silvia Izquierdo, File)\nRIO DE JANEIRO (AP) — The governors of Rio de Janeiro and Para states in separate videos on Tuesday said they have tested positive for the new coronavirus, after weeks of imposing measures aimed at limiting its spread.\nIn a video posted to his official Twitter account, Rio de Janeiro’s Gov. Wilson Witzel said he has experienced fever and sore throat since Friday. His positive test results came back on Tuesday, he said, adding that he feels well.\n“I will continue working,” he said. “I request once again that you stay at home. This sickness, as you can all perceive, does not choose and contagion is rapid.”\nWitzel, 52, has been one of Brazil’s foremost proponents of self-quarantine and last month he imposed restrictions on business, transit and gatherings to contain the spread of COVID-19. This week he extended the measures through the end of the month.\nThat stance -- shared by most Brazilian governors -- has put him at odds with President Jair Bolsonaro, who has played down the severity of the virus that has thus far killed more than 1,500 people in Latin America’s largest country. Bolsonaro has called for confinement of only high-risk individuals and otherwise for life to resume as normal to avoid economic meltdown.\nRio has the second-largest incidence of COVID-19 of any Brazilian state, with 3,410 cases and 224 deaths. For most people, the new coronavirus causes mild or moderate symptoms. For some, especially older adults and people with existing health problems, it can cause more severe illness and lead to death.\nA poll earlier this month showed three-quarters of Brazilians support the governors’ quarantine measures regardless of the economic cost.\nThe governor of the Amazonian state of Para, Helder Barbalho, said in a separate video posted to his Twitter account on Tuesday that he also tested positive for the virus. He said he is asymptomatic and, like Witzel, urged people to self-quarantine.\nThe virus “doesn’t choose age, it doesn’t choose social class. Everyone is exposed, and everyone can get it,” Barbalho said. “That’s why I am appealing to you: stay at home and we will defeat the coronavirus.”\nBarbalho has also bristled at Bolsonaro’s calls to resume activity. Bolsonaro on March 24 gave a national address in which he said jobs should be maintained and Brazilian states should abandon their “scorched earth” policy of prohibiting public transport, closing business and schools, and calling for mass confinement.\nBarbalho in a press conference the following day said he isn’t obliged to agree with the president and will always opt for saving lives over sparing the economy, local media G1 reported at the time.\nThe Supreme Court has stepped into the fray, with a justice this month issuing an injunction prohibiting the federal government from overruling state and municipal isolation measures. Bolsonaro said April 9 his government will appeal, but that the decision had a silver lining: it made clear local leaders were responsible for shutdown measures and he said people should bring complaints to their doorsteps.", "url": "https://apnews.com/5252ab10789d6ddefe255015826cd8be"}