{"authors": ["Dr. Tom Frieden", "Dr. Cyrus Shahpar"], "date_download": "2020-05-04 16:59:34", "date_modify": "2020-05-04 16:59:34", "date_publish": "2020-04-09 23:05:19", "description": "A month ago, I detailed 19 critical gaps in our knowledge of how we can best respond to the Covid-19 pandemic. This past month, we have learned an amazing amount and have made progress answering 13 of these important questions. We urgently need answers to the other six questions, although we already have many of the answers we need to start putting a halt to the pandemic.", "filename": "2020_04_09_health_coronavirus-important-questions-analysis_index_1588611574.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403100044-health-worker-coronavirus-drive-thru-testing-center-0328-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_health_coronavirus-important-questions-analysis_index_1588611574.html", "title": "The most important coronavirus questions we still need to answer", "title_page": "The most important coronavirus questions we still need to answer - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A month ago, I detailed 19 critical gaps in our knowledge of how we can best respond to the Covid-19 pandemic. This past month, we have learned an amazing amount and have made progress answering 13 of these important questions. We urgently need answers to the other six questions, although we already have many of the answers we need to start putting a halt to the pandemic.\nHere is the status of what we currently know about these 19 questions, and where we still need more information, as we see it from the Resolve to Save Lives team. As we learn more, we can strengthen our ability to do what's needed to reduce the spread of infection, improve patient survival, and mitigate societal harms.\nSneak preview of the four most important questions we still need to answer (in addition, of course to finding an effective treatment and vaccine):\n• Do kids spread the virus commonly? -- if not, opening schools will be easier;\n• How are health care workers getting infected? -- so we can protect them;\n• Is infection protective against future infection? -- so recovered people can help society recover;\n• What interventions work best to reduce spread while minimizing social and economic disruption? -- a question to which the answer will be different in different places.\nTransmissibility\n1. How is the virus spreading?\nIn terms of transmission, Covid-19 is a super-SARS -- it spreads in all the same ways SARS spreads, and more. It is spread primarily from symptomatic people to others who are in close contact through respiratory droplets, by direct contact with infected persons, or by contact with contaminated objects and surfaces (fomites). Covid-19 can sometimes spread from asymptomatic people, and this is an area we need to learn much more about. Spread by aerosolization appears limited to medical procedures and unique settings which can create superspreading events such as choir practice\n2. How contagious is the virus (the R0, or basic reproductive rate)?\nHigh. It was 14 (a single infected person infecting an average of 14 others) on the Diamond Princess cruise ship. The best current estimate is that that the R0 is between 2-2.5 , roughly twice that of seasonal influenza. Some studies have reported higher estimates, including this look at 11 countries in Europe which had initial reproduction numbers of 3.8. Even with physical distancing measures, the R0 was still 1.4, indicating continued spread. It appears very difficult to get this below 1, although several countries have done so. This is what it will take to end the pandemic.\n3. How common is spread from contaminated surfaces?\nWe know contact transmission is possible, as documented in this description of transmission via a seat in church. It is probably more common in health care facilities (as was the case with SARS) and cruise ships, which have more frequently touched surfaces.\n4. How effective is increasing ventilation at reducing risk?\nWe don't know how effective this is, but it is not likely to be high. Still, the World Health Organization recommends increased ventilation in all phases of a pandemic because simulation studies show that increasing the ventilation rate would reduce influenza transmission, specifically aerosol transmission and perhaps to a lesser extent, large respiratory droplet transmission or indirect contact transmission.\n5. How much spread is from asymptomatic cases?\nThere is some, but most Covid-19 infections are not spread this way. Studies have shown that between 6% and 13% of cases were attributed to presymptomatic or asymptomatic transmission. This means it will be harder but not impossible to control (though may make complete elimination virtually impossible until there is a vaccine), and we need to adapt control measures to account for presymptomatic and asymptomatic spread.\nTesting\n6. How sensitive are PCR assays -- what is the false-negative rate from properly collected nasopharyngeal, or NP, samples?\nThis is one area where we don't yet know the answer. A lot depends on how well the sample was taken, how much virus the patient was shedding at that time, and the quality of the test. An FDA document for LabCorp's Emergency Use Authorization of RT-PCR boasts near 100% \"positive agreement\" and \"negative agreement\" for both upper respiratory and lower respiratory samples. In literature from China's experience, sensitivity for NP swab PCR-based testing has been as low as 60% and as high as 85% testing. Specificity has been higher than sensitivity. The CDC's fact sheet for health care providers that accompanies testing kits does contain information about false negative tests; however, it does not report a sensitivity or specificity. CDC guidance for labs states: \"FDA Sensitivity Evaluation: The analytical sensitivity of the test will be further assessed by evaluating an FDA-recommended reference material using an FDA developed protocol if applicable and/or when available.\"\n7. Is serology accurate, and what is the time course of antibody response?\nSerology for Covid-19 is likely accurate if done well. The median time for seroconversion (antibody response) has been shown to be around 11 days for total antibody, 12 days for IgM (generally the first antibody made in response to infection), and 14 days for IgG (the most common and generally long-lasting antibody that fights off viral infection). Antibodies were present in less than 40% of patients within one week of symptom onset, and in almost 100% of patients after 15 days. At eight days after symptom onset, the sensitivity of serology may rise above that of PCR. In samples from patients during days 8 to 14 after onset, the sensitivities of antibody (90%), IgM (73%) and IgG (54%) were all higher than that of RNA test (54%). Among samples from patients in later phase (day 15-39 since onset), the sensitivities of antibody, IgM and IgG were 100%, 94% and 80%, respectively.\nMore importantly, we still don't know whether antibodies protect against repeat infection, whether they reflect a lack of the potential to infect others, and, if they are protective, how long that protection lasts.\n8. Can an accurate, rapid point-of-care test be developed?\nMany rapid point-of-care tests which detect IgM/IgG have been created and are starting to be used. These tests take between 2 and 20 minutes to obtain results. The first approval for this type of testing in the United States was for Cellex Inc.'s rapid serology tester, approved on April 1. In addition, rapid RT-PCR tests (e.g., Cepheid GeneXpert Xpress SARS-CoV-2) provide rapid (30 minute) PCR RNA testing where the GeneXpert Xpress machine is available and if test kits are available. The Abbott ID NOW test is a rapid test that can provide positive results in as little as 5 minutes and is most suitable for office and urgent care clinics which need timely results but don't require high throughput, but is not yet widely available. (This machine is approved for use outside of clinical laboratories). Shortages of sampling and laboratory supplies are one of the many limiting factors to expanding testing in the United States.\nSeverity\n9. How deadly is the virus?\nReported case fatality rates vary greatly from country to country (range 0-17%), but are strongly age dependent in all settings. Using data available on April 6, mortality starts to rise sharply in those aged over 60 years (globally) and over age 65 in the U.S., which hasn't reported 60-65 year-olds separately (6.5%), and is highest in those over age 80 (>20%). China, which initially saw a case fatality rate greater than 10%, now has a CFR of 0.7% as its epidemic winds down. Most models anticipate that the global case fatality rate will ultimately be determined to be to near or just below 1%.\n10. Which are the most vulnerable groups we need to protect? Which underlying diseases increase risk the most?\nGroups at highest risk include the elderly (beginning at age 60) and people with the following conditions: chronic lung disease (including moderate or severe asthma); serious heart disease; immunocompromised status (including HIV); chronic kidney disease (especially those dependent on dialysis); liver disease; diabetes mellitus (type 1 or 2); and severe obesity (BMI greater than 40). Also at higher risk are people living in congregate settings (e.g., nursing homes, prisons). There are concerns about the risk level of pregnant/peripartum women and newborns as well as the homeless ; however, there is currently insufficient data to determine risk.\n11. Do different types of virus cause different levels of severity?\nSARS-CoV-2 is mutating at a rate as expected for similar RNA viruses. None of the mutations detected so far are associated with significant change in virus behavior or virulence, but information continues to emerge, and it is possible that some of the differences seen in different areas could reflect subtle genetic changes in the virus.\n12. Is the virus changing genetically in important ways as it spreads?\nThis requires a more in-depth evaluation -- stay tuned.\nTreatment\n13. What treatments work to decrease the severity of Covid-19 disease?\nWe are still trying to find out. If there are effective anti-viral treatments, not only can patients' lives be saved, but the duration of intensive care stay can be reduced. This would allow more patients to be treated and reduce the risk to health care workers, and contacts and health care workers could potentially receive preventive treatment to reduce spread. There are multiple ongoing trials to evaluate several classes of therapeutics, including the Solidarity clinical trial coordinated by the World Health Organization, with preliminary results expected by early May. The Solidarity trial is assessing four different treatment options, including antivirals (remdesivir, lopinavir/ritonavir), antimalarials (chloroquine, hydroxychloroquine), and Interferon beta-1a (used to treat multiple sclerosis).\n14. Can a preventive medication be identified to be given to contacts of patients with Covid-19 as is done for influenza with oseltamivir (Tamiflu) in nursing homes and other areas?\nAs with potential treatments, there is yet no conclusive data to report, but effective prophylaxis would help greatly until a vaccine is developed. More than 60 clinical trials for Covid-19 preventive medications are registered on the NIH ClinicalTrials.gov website and are currently recruiting or planned among household and community contacts, health care workers and rheumatology patients. Some candidates include chloroquine, hydroxychloroquine, azithromycin, remdesivir, lopinavir/ritonavir, bacille Calmette-Guerin (BCG) vaccine, zinc, vitamin D, inhaled nitrous oxide, and intranasal IFNα.\n15. Is there any role for steroid treatment of patients with severe pneumonia caused by SARS-CoV-2?\nOne recent study in February 2020 found that Covid-19 patients would obtain minimal if any benefit from corticosteroid treatment, and might more likely be harmed by it. An Expert Consensus Statement from the Chinese Thoracic Society cited in The Lancet calls for individual risk benefit consensus and consideration of low-dose short courses in severe Covid-19 pneumonia (except those already using corticosteroids for another chronic condition). A non-randomized comparison of 26 pneumonia patients given low-dose methylprednisolone had faster improvement in lung function and resolution of chest computed tomography findings. Six clinical trials registered ClinicalTrials.gov are currently planned or recruiting participants.\nControl\n16. What works to change behavior, including hand-washing and cough hygiene? Telling people what to do gives leaders a sense they are doing something, but does it actually work?\nWe can only know and improve our messaging by objectively monitoring how people respond, but there is limited evidence of what is happening today. A 2017 Cochrane Review of interventions to improve handwashing among health workers found moderate evidence to support placement of alcohol-based hand rub and providing performance feedback; there was low certainty of evidence for multimodal strategies including increasing the availability of alcohol‐based hand hygiene products, education for staff, reminders, performance feedback, administrative support and staff involvement. A 2012 systematic review of community handwashing was associated with reduction of influenza and respiratory infection in both wealthy and low/middle-income countries, but there was no impact shown within households where an index case was already present.\n17. What works to limit spread? For example, will school closures make a difference?\n18. What are the most important ways to protect health care workers and patients in health facilities?\n19. How can creation of a safe and effective vaccine be accelerated?\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nWe need to get good data from everywhere on what is being done and what works. As we continue to get better answers to all of these questions, we'll be better able to fight World War C against our viral enemy", "url": "https://www.cnn.com/2020/04/09/health/coronavirus-important-questions-analysis/index.html"}