{"authors": ["Opinion Thomas Lake"], "date_download": "2020-05-04 16:06:18", "date_modify": "2020-05-04 16:06:18", "date_publish": "2020-04-02 12:15:45", "description": "Thomas Lake writes about real heroes on the frontlines of the coronavirus: the doctors and nurses who put their lives at risk daily. On March 27, volunteers from Atlanta flew to New York City to assist at overloaded hospitals.", "filename": "2020_04_02_opinions_nurses-_f33abb245821ad2767901111262390d6_index_1588608378.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330174839-southwest-flight-health-care-workers-new-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_opinions_nurses-_f33abb245821ad2767901111262390d6_index_1588608378.html", "title": "The real heroes in the fight against coronavirus", "title_page": "The real heroes in the fight against coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "In a series of essays called The Distance, Thomas Lake is telling the stories of Americans living through the pandemic. Email thomas.lake@cnn.com if you have a story to share.\n(CNN) They were going somewhere dangerous, and most or all were smiling: 29 health care workers on a plane from Atlanta to the front lines of the coronavirus pandemic in New York. It was Friday, March 27. They made heart symbols with their fingers. A ramp agent took their picture, and Southwest Airlines put it on Instagram. By the following Tuesday, when the picture had circled the internet, at least one of the passengers was on the verge of tears.\n\"I'm very scared,\" a nurse named Letha Love told me on the phone from a hotel in Manhattan, shortly before leaving for another overnight shift treating coronavirus patients at a Coney Island hospital. \"You can call it brave if you want to. It's brave. But I'm scared. I'm very scared. But I'm here.\"\nSomeday, when all this is over, we'll likely put up statues of people in hospital scrubs. We'll have parades in their honor. Their names will go on bridges, highways and memorial walls. Maybe they'll get their own national holiday. Right now, though, our nurses and doctors are busy fighting for our lives. Some of them are dying\nThomas Lake\n\"I'm very scared. But I'm here.\" This is both honest and courageous. Love is 48 years old. Usually she's a nurse manager serving cancer patients at Emory University in Atlanta. Last week, when a friend told her that health care workers from Atlanta were going to New York to fight the virus, she signed up for a six-week rotation.\nHer armor: shoe covers, a gown, an N95 mask and a face shield. Normally she would go through several masks per shift, throwing them away after every visit to a patient's room. But supplies are scarce , and she finds herself reusing the masks. Does this put her in more danger? Of course it does. One day you're a nurse, the next you're a patient. She has a 4-year-old daughter and a 12-year-old son, staying with relatives back in Georgia. She FaceTimes her son two or three times a day. He reminds her to put her gloves on.\nLetha Love\nAlso on the flight to New York was Love's friend Trina Southerland, a registered nurse with three children. When I spoke with her on Tuesday night, she said she felt like a soldier in combat. Sometimes she wanted to give up. Sometimes she wanted to cry. \"Trina, you can do this,\" she told herself all day, on her feet, surrounded by the sick and the dying, trying hard not to touch her face. These were not complaints. They were merely statements of fact, the raw material for the stories she might be telling for decades to come. This work does not always have to feel grim. Here and there you find hope, along with a deep sense of accomplishment.\n\"This is the highlight of my nursing career,\" Southerland told her 16-year-old daughter, who also wants to be a nurse.\nIt was about 5:45 p.m. Tuesday. The bus would leave the hotel in an hour, and Love was thinking about the night ahead.\n\"Covid-19 is deadly,\" she said. \"What I can say is, there is no age limit. There is no color. There is no size...There is no status, no class, no nothing. It will get anyone.\nTrina Southerland\n\"We need support. Because it could be us laying in that bed, being taken care of by one of our fellow nurses.\"\nStruggling for the right words, I finally said what civilians usually say to someone going to war: \"Thank you for your service.\"\n\"Pray for all of us,\" she said, and went out once again to meet the enemy.", "url": "https://www.cnn.com/2020/04/02/opinions/nurses-doctors-volunteers-covid19-coronavirus-lake/index.html"}