{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:23:32", "date_modify": "2020-05-04 16:23:32", "date_publish": "2020-04-06 14:02:50", "description": "President Donald Trump fired Michael Atkinson, the inspector general of the intelligence community, late on a Friday night amid the coronavirus pandemic in hopes that you wouldn't know what he did. Or you'd note it in passing, and then quickly move on to other pressing worries like, well, the coronavirus and its impact on the US economy.", "filename": "2020_04_06_politics_michael-atkinson-firing_index_1588609412.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403175217-01-trump-coronavirus-presser-0403-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_michael-atkinson-firing_index_1588609412.html", "title": "Why Michael Atkinson's firing is so, so egregious", "title_page": "Why Michael Atkinson's firing is so, so egregious - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump fired Michael Atkinson , the inspector general of the intelligence community, late on a Friday night amid the coronavirus pandemic in hopes that you wouldn't know what he did. Or you'd note it in passing, and then quickly move on to other pressing worries like, well, the coronavirus and its impact on the US economy.\nYou absolutely should not do either of those things. Because, while the removal of the intelligence community's watchdog is less obviously urgent in your own life than coronavirus, the mentality that informs the decision to remove Atkinson is hugely corrosive to our American system of government.\nLet's go through the basics.\nOn Friday night -- the favored night for politicians to dump their worst news -- Trump announced he had fired Atkinson.\n\"As is the case with regard to other positions where I, as President, have the power of appointment ... it is vital that I have the fullest confidence in the appointees serving as inspectors general,\" Trump wrote in a letter to the House and Senate Intelligence committees informing them of the move. \"That is no longer the case with regard to this Inspector General.\"\nAt issue was Atkinson's decision last fall to inform Congress that a whistleblower complaint had been filed to his office about the Trump administration. That complaint eventually turned into the basis for the House impeachment investigation into Trump's July 2019 phone call with Ukrainian President Volodymyr Zelensky -- and Trump's eventual impeachment by the House. (He was later acquitted in the Senate.)\nRepublicans argued that Atkinson had overstepped his authority by informing Congress of the existence of a complaint. That job should have technically fallen to then-Director of National Intelligence Joseph Maguire, who was legally bound to let Congress know of the complaint no more than seven days after Atkinson had determined that it was credible. Atkinson made that determination on August 26, 2019. Maguire didn't turn the complaint over to Congress until September 25, saying the slowdown was necessary because the complaint involved the President and therefore he had to work with the Justice Department to see if there was anything covered by executive privilege in the complaint.\nPut simply: What Atkinson did was nothing more than his job. He is -- or was -- in charge of oversight of the intelligence community. Whistleblower complaints go to him as a matter of course and Atkinson's job is determine if they are indeed credible and need to be shown to the relevant committees in Congress. That's the job.\nWhich is the point Atkinson made in a statement Sunday night -- 48 hours after learning he had been removed from his job. Here's the key bit\n\"It is hard not to think that the President's loss of confidence in me derives from my having faithfully discharged my legal obligations as an independent and impartial Inspector General, and from my commitment to continue to do so. I was legally obligated to ensure that whistleblowers had an effective and authorized means to disclose urgent matters involving classified information to the congressional intelligence committees, and that when they did blow the whistle in an authorized manner, their identities would be protected as a guard against reprisals.\"\nHere's why Atkinson's firing matters: Because it reveals -- again -- that Trump doesn't really get the whole idea of independence and oversight within the administration. Inspectors general are in place to ensure that leaders follow the law and that the rank-and-file within the government feel as though they have a place to raise concerns without fear of reprisal. The independence of IGs is critical to that process because you a) can't provide adequate oversight if you are in the pocket of the President (or any other leader) and you can't be trusted as a safe harbor for concerns of the rank-and-file if you are perceived as a lackey of the President.\nTrump, of course, doesn't get the idea of independence within the government. He didn't get it with the Justice Department when they launched a special counsel investigation into Russian meddling attempts in the 2016 election. And he doesn't get it when it comes to Atkinson and the intelligence community.\nIn Trump's mind, every single person in the administration works for him and therefore needs to be entirely loyal to him. Job descriptions, oversight, necessary independence are all brushed aside as excuses. For Trump, you either are on his team or you are an enemy. It's how he has always seen the world as two-sided: Pro-Trump and anti-Trump.\nWhile viewing things that way is OK in private industry, it's a deep misunderstanding of how our government is built to work. The President isn't a king or an emperor. This is a democracy where the peoples' will matters. There are checks and balances purposely built into the system to ensure that the voice of anyone in government who sees a problem feels comfortable saying, \"This isn't right.\"\nTrump doesn't -- or chooses not to -- understand the difference between his old job and his new one. But we shouldn't make the same mistake. This isn't Trump's government. It's all of ours.", "url": "https://www.cnn.com/2020/04/06/politics/michael-atkinson-firing/index.html"}