{"authors": ["Opinion Louis P. Masur"], "date_download": "2020-05-04 16:59:22", "date_modify": "2020-05-04 16:59:22", "date_publish": "2020-04-09 21:24:02", "description": "Louis Masur writes that part of what made Lincoln such an effective leader was that he never let the gravity of the situation, or his own tendencies toward melancholy, keep him from finding ways to offer solace and hope.", "filename": "2020_04_09_opinions_lincoln-inspiration-coronavirus-masur_index_1588611562.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/160312080726-abraham-lincoln-portrait-2-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_opinions_lincoln-inspiration-coronavirus-masur_index_1588611562.html", "title": "What Abraham Lincoln can teach us about resilience in the face of crisis", "title_page": "What Abraham Lincoln can teach us about resilience in the face of crisis  (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Louis P. Masur is distinguished professor of American studies and history at Rutgers University. He is the author of \"Lincoln's Last Speech\" and the forthcoming book \"The Sum of Our Dreams: A Concise History of America.\" Visit his website. The opinions expressed in this commentary are those of the author. View more opinion articles on CNN.\n(CNN) \"The President quite unwell,\" reported John Hay on November 26, 1863. On his return from the dedication of Gettysburg National Cemetery, where he delivered \"a few appropriate remarks\" that would stand to define the war and the meaning of America, Abraham Lincoln had taken ill with varioloid fever, a mild but highly contagious form of smallpox. Even the New York World, a virulent anti-administration newspaper, hoped that \"the President will soon be restored to health and strength.\"\nLouis Masur\nLincoln handled the illness with humor. He joked that since becoming president, crowds of people had asked him to give them something and now he had something he could give everyone. He also commented, in typical self-deprecating fashion, that being ill offered the consolation that the disease, which could leave scars, \"cannot in the least disfigure me.\"\nI have been thinking about Lincoln as the Covid-19 pandemic continues to unfold. Public figures such as Dr. Anthony Fauci , director of the National Institute of Allergy and Infectious Diseases, and New York Gov. Andrew Cuomo have modeled what it means to be a leader in a time of crisis. They have communicated the facts as they know them, have not shied away from telling the hard truth, have offered comfort to the grieving and have used humor, not to trivialize but to humanize these most difficult of times.\nPart of what made Lincoln such an effective leader was that he never let the gravity of the situation, or his own tendencies toward melancholy, keep him from finding ways to offer solace and hope. In my research on Lincoln, time and again, I return to a letter he wrote on December 23, 1862, to Fanny McCullough , the daughter of his friend William McCullough, who had been killed in battle.\nLincoln had every reason not to reach out to Fanny. The war was not going well, there was opposition to his announcement of a preliminary Emancipation Proclamation and suspension of habeas corpus, and in the November elections Republicans had taken a drubbing.\nRead More", "url": "https://www.cnn.com/2020/04/09/opinions/lincoln-inspiration-coronavirus-masur/index.html"}