{"authors": ["Marianne Garvey"], "date_download": "2020-05-04 17:03:20", "date_modify": "2020-05-04 17:03:20", "date_publish": "2020-04-10 21:23:07", "description": "The Netflix show everyone is talking about has some well-known detractors.", "filename": "2020_04_10_entertainment_tiger-king-netflix_index_1588611800.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200329125429-tiker-king-joe-exotic-netflix-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_entertainment_tiger-king-netflix_index_1588611800.html", "title": "'Tiger King' doesn't appeal to everyone, just ask Larry David", "title_page": "'Tiger King' doesn't appeal to everyone, just ask Larry David - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) While Netlix reports that millions of people have watched \"Tiger King: Murder, Mayhem and Madness,\" it has some notable detractors.\nLarry David hates \"Tiger King.\"\nThe docuseries everyone is talking about came up in a recent profile of the \"Curb Your Enthusiasm\" star in The New York Times, in which David said he \"couldn't get past the first episode.\"\n\"I found it so disturbing,\" he told the publication. \"The lions and the tigers just really scared the hell out of me. They were going to attack somebody. They were going to kill somebody. I didn't want to see them attack and those people were just so insane, I couldn't watch it.\"\nHoward Stern isn't a fan of \"Tiger King\" either. On his radio show Tuesday, Stern criticized the series for showcasing animal abuse and said it left him \"bummed out.\" He bailed, he said, before finishing the series.\n\"There are a few reasons that I think some people really might despise this show,\" Robert Thompson, the Director of Bleier Center for Television & Popular Culture at Syracuse University, told CNN. \"They don't want to spend time with these characters, people who are sensitive to stories about animals very much could be bothered.\"\nStill, with coronavirus and \"Tiger King\" seemingly the top two topics in our culture right now, watching the series may feel hard to avoid -- even if you're hate watching it.\n\"Whenever anything gets the kind of attention that 'Tiger King' has been getting, there is an automatic built in backlash with this American sense of superiority,\" Thompson said. \"There are some people who figure that if that many people are so excited about something, it couldn't be very good.\"\nThompson was both \"disturbed\" and \"captivated\" by \"Tiger King.\"\n\"It is an exquisitely put together thing,\" Thompson said. \"One of the reasons it's captivated so many people is the way it's edited. You get to know these characters and they wait one episode, two episodes, three episodes before they drop, like really major, major bits of detail.\"\nHe also thinks \"Tiger King\" would have found a large audience regardless of the coronavirus pandemic keeping people at home.\n\"I think this would have been one of those things that every now and again breaks through the incredibly fragmented pop culture environment,\" Thompson said.\nBut you're not alone if you can't get into the show.\n\"These investigative stories may not appeal to you at all in the first place. I think there is nothing wrong with the many, many people who just don't like that,\" Thompson said. \"Like some people don't like sitcoms, I think there's nothing inherently wrong with someone who doesn't like 'Tiger King.'\"", "url": "https://www.cnn.com/2020/04/10/entertainment/tiger-king-netflix/index.html"}