{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:21:50", "date_modify": "2020-05-04 20:21:50", "date_publish": "2020-04-06 10:47:30", "description": "The Latest on the effects of the coronavirus outbreak on sports around the world: ___ Three minor league players in the Texas Rangers organization are in self-isolation after...", "filename": "_9fd41b9bb57122ad5a6a1cd60334b30b_1588623710.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ad11118538a740098463fa45e66dc659/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9fd41b9bb57122ad5a6a1cd60334b30b_1588623710.html", "title": "The Latest: 3 Rangers minor leaguers in self-isolation", "title_page": "The Latest: 3 Rangers minor leaguers in self-isolation", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "1 of 3 FILE - In this April 25, 2019, file photo, Oklahoma quarterback Kyler Murray embraces NFL Commissioner Roger Goodell after the Arizona Cardinals selected Murray in the first round at the NFL football draft in Nashville, Tenn. NFL vice president Troy Vincent has sent a letter to several prospects inviting them to participate “live” in the NFL draft in three weeks. In recent drafts, first-round selections were announced by Commissioner Goodell. Then followed hugs involving players and Goodell — some of them comical — and photo sessions with the players wearing team ball caps or even showing off team jerseys. This year, with all public events at the planned site of Las Vegas canceled and the draft set to proceed remotely, players will likely be at their homes when their names are called. (AP Photo/Mark Humphrey, File)\n1 of 3 FILE - In this April 25, 2019, file photo, Oklahoma quarterback Kyler Murray embraces NFL Commissioner Roger Goodell after the Arizona Cardinals selected Murray in the first round at the NFL football draft in Nashville, Tenn. NFL vice president Troy Vincent has sent a letter to several prospects inviting them to participate “live” in the NFL draft in three weeks. In recent drafts, first-round selections were announced by Commissioner Goodell. Then followed hugs involving players and Goodell — some of them comical — and photo sessions with the players wearing team ball caps or even showing off team jerseys. This year, with all public events at the planned site of Las Vegas canceled and the draft set to proceed remotely, players will likely be at their homes when their names are called. (AP Photo/Mark Humphrey, File)\nThe Latest on the effects of the coronavirus outbreak on sports around the world:\n___\nThree minor league players in the Texas Rangers organization are in self-isolation after exhibiting symptoms consistent with the new coronavirus.\nRangers general manager Jon Daniels said Monday that two of the three players had connections to family members who had tested positive for COVID-19. Daniels, who didn’t name the three players, said all were doing well, and were presumed positive even though they hadn’t been tested.\n___\nThe Charlotte Hornets Foundation has initiated a multi-faceted response to assist with coronavirus relief efforts in the Charlotte, North Carolina area.\nThe foundation will be donating $100,000 to the COVID-19 Response Fund, as well three $25,000 donations to local nonprofit organizations. The foundation has pledged another $75,000 for future to-be-determined needs resulting from COVID-19.\nHornets employees have also pledged to complete 1,000 hours of in-home volunteerism. That will include writing letters and cards to patients, making phone calls, administrative work, and utilizing their various skills to assist others. The Hornets have also established a COVID-19 resource center on the team’s website.\n“Even though there is no basketball being played, we still want to provide a way to be of service to our community and to have an immediate impact,” Hornets president and vice chairman Fred Whitfield said.\n___\nThe NFL draft will be conducted in a virtual format, with team personnel working from their homes.\nIn a memo sent to the 32 teams, NFL Commissioner Roger Goodell outlined procedures for the April 23-25 draft. The guidelines include no group gatherings.\n“We have reviewed this matter in the past few days with both the competition committee and CEC (a group of league executives),” Goodell said, “and this will confirm that clubs will conduct their draft operations remotely, with club personnel separately located in their homes.”\nThe draft originally was scheduled to be held in Las Vegas, but the NFL canceled all public events last month as a safeguard against the coronavirus.\n___\nThe heads of the ATP and WTA professional tennis tours tell the AP that they are coordinating with each other as they weigh how to reschedule the sport’s calendar for whenever play can resume after the COVID-19 pandemic.\nThe hypotheticals include extending the season beyond November by moving tournaments that already have been postponed to dates later in the year.\nAs of now, both tours have suspended play until at least July 13 because of the novel coronavirus outbreak.\nWimbledon, which is run by the All England Club, was canceled for the first time since 1945.\nWTA Chairman Steve Simon says the women’s tour is “considering an extension to the current 44-week season to enable more tournaments to take place” in order to “maximize earning possibilities” for players left without the possibility of earning income by competing.\nATP Chairman Andrea Gaudenzi says the men’s tour is working “with the aim of rescheduling as many tournaments as possible.”\n___\nThe Italian soccer players’ association has rejected a proposal from Serie A clubs to reduce salaries by a third if the season does not resume as “shameful and unmanageable.”\nSerie A said earlier that the guideline measure was agreed on by 19 of the 20 clubs. Juventus already reached a similar deal with its players.\nThe reduction would be equal to four months of salary but would be reduced to only two months if the season is completed.\nPlayers’ association vice president Umberto Calcagno says in Gazzetta dello Sport that Serie A’s proposal makes “clear the intention to make only the players pay for the eventual damages from the crisis.”\n___\nThe Indianapolis Colts and Indiana Pacers have issued a challenge to area residents: Raise $200,000 for the city’s 12 community centers by noon Thursday and the two professional teams will kick in an extra $420,000.\nThe community centers are helping to feed, support and care for vulnerable residents during the current COVID-19 pandemic.\n“There is no more important time to strengthen them, and we are encouraging everyone who can to chip in. We thank our friends at the Colts and are proud to join them in supporting our neighbors,” Pacers Sports & Entertainment president Rick Fuson said.\nThe announcement comes one day after Colts owner Jim Irsay donated more than 10,000 of the hard-to-find N-95 masks to the Indiana State Department of Health for health care workers.\n___\nBoston Celtics forward Jayson Tatum and Washington Wizards guard Bradley Beal are each pledging $250,000 to help provide meals for those affected by the coronavirus pandemic in Boston and St. Louis.\nTatum made the announcement on Instagram .\nThe pledges will benefit Feeding America, the St. Louis Food Bank and Greater Boston Food Bank. Both Tatum and Beal are natives of St. Louis.\n“Just trying to find a way where I could be of some assistance during this time and always find a way to give back,” Tatum said during a conference call on Monday.\n___\nLiverpool will no longer use a government scheme to furlough some non-playing staff after a backlash against the use of public cash by the wealthy European champions.\nLiverpool chief executive Peter Moore says “we believe we came to the wrong conclusion last week to announce that we intended to apply to the Coronavirus Retention Scheme and furlough staff due to the suspension of the Premier League football calendar, and are truly sorry for that.”\nUnder a job retention scheme implemented to help businesses survive the national lockdown, staff can be put on furlough and receive 80% of their salaries from the government, up to a maximum of 2,500 pounds ($3,000) a month.\nLiverpool had said it would top up salaries to ensure staff still received the full amount, but that still means using public funds to pay some staff.\nMoore says the club still wants to “ensure the entire workforce is given as much protection as possible from redundancy and/or loss of earnings during this unprecedented period” but is now seeking “alternative ways to operate while there are no football matches.”\nLiverpool leads the league with 25 points and nine games to go in a season that has been indefinitely suspended.\nMoore says “despite the fact we were in a healthy position prior to this crisis, our revenues have been shut off, yet our outgoings remain.”\n___\nManchester United has told staff they will all remain on full pay without any of them being furloughed during the coronavirus pandemic.\nPremier League rival Tottenham has faced criticism for placing some non-playing staff on a scheme that sees the government fund wages.\nUnited emailed its full-time staff on Monday morning and encouraged them to volunteer for the National Health Service or in their communities if their workload has been reduced or they cannot work from home due to the COVID-19 outbreak.\nFor around 950 non-match-day, part-time workers, United is covering their average weekly pay based on hours worked between December and February. That commitment has been extended from the end of April until June 1.\nUnited is also paying around 3,000 part-time match-day personnel for the remaining Premier League games they would have worked this season.\nThe season has been on hold since last month. No date has been set for the resumption of games.\n___\nCelta Vigo forward Fedor Smolov has left his confinement in Spain to be closer to his family back home in Russia.\nSmolov says he informed the Spanish club of his plan and had its support.\nThe club says the player “repeatedly requested permission to travel to Russia for a personal matter” but “the Spanish league did not authorize it.”\nCelta says Smolov reported his whereabouts and was committed to return after the personal issues were resolved. It says Smolov would still be subjected to possible penalties for breaking the club’s internal regulations.\nSpain is expected to remain in a nationwide lockdown because of the coronavirus pandemic until April 26. The country has more than 135,000 confirmed cases of the new virus with more than 13,000 deaths.\nSmolov wrote on Instagram that because of the closure of borders “I have found myself obligated to return to Russia to be closer to my family.”\nSmolov says he is “very grateful to Celta for its support and I want to emphasize that I informed the club about every step.”\nSpanish media reported the 30-year-old Smolov flew home on a private jet for the 18th birthday of Maria Yumasheva. She is the granddaughter of former Russian President Boris Yeltsin. Smolov published photos on Instagram in January showing him and Yumasheva together on vacation.\n___\nChicago’s eight pro teams and mayor Lori Lightfoot are teaming up to encourage residents to stay home to help prevent the spread of the COVID-19 virus.\nThe Bears, Blackhawks, Bulls, Cubs and White Sox as well as the WNBA’s Sky, MLS’ Fire and National Women’s Soccer League’s Red Stars are joining with the mayor in the “We Are Not Playing” campaign to promote compliance with Illinois’ stay at home order.\nThe initiative will kick off with billboards around Chicago and digital and social media advertisements. Player videos will come online in the next phase.\n“I am grateful to each of our hometown teams for stepping up and doing their part by joining in this call for every neighborhood and community,” Lightfoot said in a statement. “They’re not playing, and neither are we. The more we stay home and act responsibly, the more lives we’ll save, and the sooner we’ll be able to get our city back on track and enjoying the games we love.”\n___\nWashington Capitals coach Todd Reirden says he and his family are taking special precautions amid the new coronavirus pandemic because 17-year-old son Travis has a common variable immune deficiency.\n“We’ve really had to be careful about what we’re bringing into the house and not leaving and making sure that if we do go out and do something, that we basically leave all of our clothes at the door and make sure that they get washed and wash our hands and make sure we’re really making the right choices because it can get scary for someone like him,” Reirden said Monday.\nReirden says his family opted to stop having a nurse come to the house and give Travis plasma treatments for multiple reasons. He says his son didn’t want a nurse taking up four to six hours a trip when that time could be better used to treat patients with more urgent needs, and the family thought it better not to have another person in the house.\nTravis was out of school earlier this year because of the flu, and his parents continued to hold him out when COVID-19 became a serious concern. A doctor visit in mid-March before the NHL season was suspended turned up positive bloodwork and gave the Reirdens enough confidence that Travis was in a good spot healthwise.\nThey continue to monitor the situation.\n“We are really on top of him and how he is feeling and right now,” Todd said.\n___\nThe 2020 Madrid Open, one of more than 30 professional tournaments canceled or postponed because of the novel coronavirus, is going to be contested April 27-30 by tennis players holding controllers instead of rackets.\nThe clay-court tournament on Monday announced its plan to go virtual, saying it will involve “the world’s biggest tennis stars squaring off from their own homes.”\nThere will be 150,000 euros (about $160,000) in prize money each for the men’s and women’s events, with the winners deciding how much they want to donate to tennis players who are having a hard time financially without any tournaments to enter. An additional 50,000 euros (about $55,000) will be given to reduce the social impact of the pandemic.\nThe list of players who will “compete” will be released later.\nThe Madrid Open was supposed to be played May 1-10, but the entire European clay circuit was abandoned by the ATP and WTA. Both tours are suspended until at least July 13.\nWimbledon was canceled entirely for 2020, while the French Open has been postponed from May until September.\n___\nHouston Astros pitcher Joe Smith and his wife, TNT sideline reporter Allie LaForce, have started a program to donate meals to medical workers in Ohio and Texas hospitals during the global COVID-19 pandemic.\nThrough Project FRONTLINE the couple is funding the first 250 meals, which will be delivered to Mercy Hospital in Lorain, Ohio, on Wednesday. Another 300-500 meals are going to Harris Health in Houston on Tuesday.\nLaForce said over the phone from Florida that former Browns Pro Bowl tackle Joe Thomas has donated and the couple has been in contact with Cavaliers forwards Kevin Love and Larry Nance Jr. about expanding the program.\nSmith and LaForce are both Ohio natives.\n“We’re hoping people can kick in anything, $10 or $20, for a cause to help people who are putting their lives on the line every single day,” LaForce said.\n___\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports", "url": "https://apnews.com/9fd41b9bb57122ad5a6a1cd60334b30b"}