{"authors": [], "date_download": "2020-05-04 20:31:41", "date_modify": "2020-05-04 20:31:41", "date_publish": "2020-04-15 22:56:54", "description": "RALEIGH, N.C. (AP) — North Carolina's legislative complex will be off limits to the general public for three weeks while lawmakers attempt to conduct business as the annual session begins later...", "filename": "_1f27df8d99fcbaf9a056244d4279a5ff_1588624301.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1f27df8d99fcbaf9a056244d4279a5ff_1588624301.html", "title": "N. Carolina legislative complex closed to public for session", "title_page": "N. Carolina legislative complex closed to public for session", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "RALEIGH, N.C. (AP) — North Carolina’s legislative complex will be off limits to the general public for three weeks while lawmakers attempt to conduct business as the annual session begins later this month during the COVID-19 pandemic .\nHouse Speaker Tim Moore and Senate leader Phil Berger announced on Wednesday that the Legislative Building and nearby Legislative Office Building only will be accessible to legislators, staff and credentialed media starting Monday until May 8.\nThe session begins April 28. The chamber leaders said in a news release the policy seeks “to balance the need for legislators to return to Raleigh to carry out their constitutional duties with the health and safety of members and the general public, as well as to limit the spread of COVID-19 while opening for business.” People seeking to enter once the session begins will have their temperatures taken.\nThe news release said the public can participate in the legislative process through phone calls, emails and other electronic contacts with lawmakers. The logistics of conducting business during the session, including public involvement, will be released by each chamber. The release said the legislature intends to “work in a collaborative manner to pass consensus COVID-19 legislation.”\nThe release said the policy was developed with media covering the General Assembly and public access advocacy organizations.", "url": "https://apnews.com/1f27df8d99fcbaf9a056244d4279a5ff"}