{"authors": ["Emiko Jozuka"], "date_download": "2020-05-04 16:12:48", "date_modify": "2020-05-04 16:12:48", "date_publish": "2020-04-02 23:48:47", "description": "Japanese workers fear the social repercussions of working from home -- even if they want to.", "filename": "2020_04_02_business_japan-c_a75842ceda11bff015c0c800fdb8f86d_index_1588608768.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/180622133116-japan-salaryman-01-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_business_japan-c_a75842ceda11bff015c0c800fdb8f86d_index_1588608768.html", "title": "Japan coronavirus: People won't work from home until Shinzo Abe makes them", "title_page": "Japan coronavirus: People won't work from home until Shinzo Abe makes them - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Tokyo (CNN Business) Salary men in suits crammed into trains during the rush-hour commute are staple scenes in Tokyo.\nUp until a few weeks ago, 52-year-old Hideya Tokiyoshi, who traveled into the capital from neighboring Saitama prefecture for work each day, was among them.\nThe English-language teacher moved to online lessons after his students grew anxious over the coronavirus pandemic , which has killed more than 46,800 people globally, according to the Johns Hopkins University.\nTokiyoshi, however, is a rare case.\nWhile Tokyo's governor Yuriko Koike has urged the city's 13.5 million residents to telework where possible until April 12, and major Japanese companies such asandhave asked staff to work from home, many employees are still commuting into the capital, where subway trains are busy during rush hour.\nIt's a similar story across Japan, where about 80% of companies do not have the ability to let their employees work remotely, according to 2019 government data.\nAnd with Prime Minister Shinzo Abe this week declining to declare a state of emergency, which would put pressure on businesses to enforce social distancing, companies can still legally operate from their offices.\nPeople wearing a protective face mask wait at a pedestrian crossing Thursday, April 2, 2020, in Tokyo.\nUnderpinning this is Japan's notorious hard-work culture. A 2016 government study found that one in five employees was at risk of working themselves to death. The country even has its own word for it: \"karoshi,\" or death by overwork, which is defined as employees working so hard that they die from stress-related diseases — or become so depressed that they kill themselves.\n\"The [coronavirus] information is on our mind and we're scared more than you would expect,\" tweeted Tokiyoshi recently. \"But for average Japanese, work is always the highest priority and the biggest excuse.\n\"Unless [the] government shuts all businesses down with a few exemptions, no one will stay at home. We're slaves to work.\"\nExposing old habits\nThe now-delayed Tokyo 2020 Olympics were meant to showcase Japan as a high-tech nation with robots showing guests to their seats and artificial meteorites in the sky.\nIn reality, often people are wedded to more traditional ways of conducting business.\nThe fax machine, for example, remains a fixture in many offices, and people still use the company stamp to give official documents a seal of approval. In Japan, personal and company stamps are often used instead of electronic or handwritten signatures.\nSlack WORK Zoom ZM During the pandemic, many multinational companies have turned to messaging and video conferencing software such as, Webex andto keep in touch with colleagues.\nJUST WATCHED Experts call for more testing as coronavirus worsens Replay More Videos ... MUST WATCH Experts call for more testing as coronavirus worsens 03:05\nBut Rochelle Kopp, a business consultant at Japan Intercultural Consulting who has worked between Japan and the United States for more than three decades, says Japanese firms have not made sufficient IT investments to do this.\nMany employees don't have laptops they can take home, Kopp said, and companies do not have VPNs or remote access to their servers, meaning things can only be accessed in person at the office.\nTo accelerate change as the coronavirus crisis continues, Japan's Ministry of Labor is offering grants of up to $77,000 to help small and medium-sized companies prepare for teleworking, said Misaki Togoshi, a spokeswoman at the Japanese Teleworking Association.\nCommuters wearing face masks ride on a train on March 26, 2020 in Tokyo, Japan.\nNevertheless, barriers remain. \"We've started receiving up to 25 applications a day since March 9 from companies that want to adopt teleworking practices, but the funding is finite so not everyone will receive it,\" Togoshi said.\nAnother barrier is that a quarter of Japan's population is aged 65 and over . Many still occupy senior positions and are not known for being tech savvy. In 2018, for example, the country's then 68-year-old cybersecurity minister admitted he had never used a computer in his professional life.\n\"Even if the hardware became available, older people may not have the experience or knowledge to adapt quickly,\" said Hisakazu Kato, a professor of economics at Meiji University in Tokyo. \"There's a clear digital divide in Japan.\"\nFace-to-face work culture\nThe reluctance to close offices and work remotely speaks to Japan's intense work culture, where employees are expected to put in long hours.\n\"Some workers will stay at the office after hours because they think that the boss may be coming back after dinner with his associates,\" said Jesper Koll, a Japan-based economist and financial strategist. \"All of this is very real part of Japanese corporate culture.\"\nThe cultural emphasis on collective decision-making in Japan can also make people feel reluctant to work from home, where they will not be physically surrounded by colleagues.\n\"The situation in Japan is a bit unique compared to other countries where people have a more individualistic work style. It's easier for them to transition to teleworking,\" Kato said. \"In Japan, one person can't make an important decision alone at their home — people have to come together to make decisions.\"\nJapanese office workers are seen reflected in a window as they walk to a train station.\nIn many places, governments have led by example. In Hong Kong, for instance, the government announced that civil servants would work from home when it asked private businesses to let employees work remotely.\nJapan has not done that. While some government employees are teleworking, many are still going into the office.\nNakane Tsuyoshi, a human resources officer at the Ministry of Health, Labor and Welfare in Tokyo, is going to work, although the ministry has staggered the arrival times of staff, with some starting at 8 a.m. and others at 10 a.m.. \"We would worry that we can't help people and get the job done properly if we worked worked from home,\" he said.\nAt the Tokyo Metropolitan Government, workers dealing with the coronavirus pandemic, the delayed Olympics and those answering calls from the public are still going to the office, according to a spokesman.\nService industry\nMore than 70% of Japan's workforce was also employed in the service sector in 2019, according to Japan's Bureau of Statistics. For many of those workers, it is near impossible to telework, Kato said.\nHaru, who works as a massage therapist in a mall in Tokyo, still catches a bus to work. But now many customers are canceling their reservations, especially since 78 people tested positive for coronavirus in the capital on Tuesday — the country's highest single-day jump.\n\"I'm anxious as the number of cases keeps going up in Tokyo and I want to stay at home. But I feel conflicted,\" Haru said.\n\"Even if the boss told us to close the shop and stay at home, we would have nothing to fall back on. So far, the government has only told people to avoid public gatherings and that has meant fewer customers for us. But the government hasn't specifically said how they would support businesses teetering on the edge.\"\nBebe Ishikawa runs a Tokyo business supplying fruit to cake shops, hotels and wedding venues. She manages five staff in her office, all of whom come to work.\n\"If they take the train, I tell them to come in late or leave early to avoid the rush hour or to take a traxi to and from their homes,\" she said.\nIshikawa said she understood that a complete lockdown might be needed eventually to curb the spread of the coronavirus, but warned that many businesses would go bankrupt.\n\"If we stop delivering our produce then that means our customers can't sell their commodity so each link in the supply chain is affected,\" she said.\nFalse sense of security?\nSo far Japan — a country of 127 million people — has more than 2,300 cases of coronavirus, including 57 deaths. A total of 472 people have recovered.\nCommuters wait in line at a bus stop on March 26, 2020 in Tokyo, Japan.\nHowever, Japan has only tested about 34,508 people, compared with over 431,700 people tested in South Korea, which has a population of 51 million\nThe relatively low recorded infection rate has created a sense of security in Japan, which could be encouraging workers to go into their offices.\n\"The [Japanese] government should be stricter like in Europe,\" Kato said. \"The government has too much faith in the public doing the right thing by themselves, but they should send a clearer and more decisive message that tells people that this [coronavirus] situation is really serious.\"\nBack in Saitama, Tokiyoshi has embraced his teleworking lifestyle and found more time for passion projects. He and his students have overcome the occasional delayed connection, and he hopes this work style can become more accepted in the long term.\n\"Before, people thought it would be impossible for people to work from home as employees might not be able to focus on their jobs. But now people have realized they can do a lot of things from home,\" he said.", "url": "https://www.cnn.com/2020/04/02/business/japan-coronavirus-work-lockdown-guilt-hnk-intl/index.html"}