{"authors": ["Chloe Melas"], "date_download": "2020-05-04 16:22:53", "date_modify": "2020-05-04 16:22:53", "date_publish": "2020-04-06 15:30:50", "description": "Duran Duran's John Taylor has revealed that he tested positive for the coronavirus and has recovered.", "filename": "2020_04_06_entertainment_duran-duran-john-taylor-coronavirus_index_1588609373.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/121015094812-ctw-duran-duran-john-taylor-00022925-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_entertainment_duran-duran-john-taylor-coronavirus_index_1588609373.html", "title": "Duran Duran's John Taylor says he's recovered from coronavirus", "title_page": "Duran Duran's John Taylor says he's recovered from coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Duran Duran's John Taylor has revealed that he tested positive for the coronavirus and has recovered.\nThe bassist from the '80s band with hits like \"Girls on Film\" and \"Hungry Like the Wolf\" took to Instagram to reveal the news.\n\"DEAR FRIENDS OF MINE after giving some thought to this, I have decided to share with you that I tested positive with the Corona Virus almost three weeks ago,\" Taylor wrote. \"Perhaps I am a particularly robust 59 year old - I like to think I am - or was blessed with getting only a mild case of Covid 19 - but after a week or so of what I would describe as a 'Turbo-charged Flu', I came out of it feeling okay- although I must admit I didn't mind the quarantine as it gave me the chance to really recover.\"\nHe went on to write, \"I am speaking out in answer to the enormous amount of fear being generated by the pandemic, some of it entirely justified, and my heart goes out to everyone who has had to deal with real loss and pain. But I want to let you know that it isn't always a killer, and we can and will beat this thing.\"", "url": "https://www.cnn.com/2020/04/06/entertainment/duran-duran-john-taylor-coronavirus/index.html"}