{"authors": ["Cnn Staff"], "date_download": "2020-05-04 16:58:15", "date_modify": "2020-05-04 16:58:15", "date_publish": "2020-04-09 16:41:02", "description": "There have been numerous reports of black Americans dying from Covid-19 in disproportionate numbers. CNN's Chief Medical correspondent Dr. Sanjay Gupta breaks down the various factors and demographics that may make some people and communities more susceptible.", "filename": "2020_04_09_health_sanjay-gu_c730765fc51f988dcfe7cd5854e8aaf4_index_1588611495.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402114757-gupta-coronavirus-podcast-top-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_health_sanjay-gu_c730765fc51f988dcfe7cd5854e8aaf4_index_1588611495.html", "title": "Race and Risk: Dr. Sanjay Gupta's coronavirus podcast 4/9", "title_page": "Race and Risk: Dr. Sanjay Gupta's coronavirus podcast 4/9 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) There have been numerous reports of black Americans dying from Covid-19 in disproportionate numbers. CNN's Chief Medical correspondent Dr. Sanjay Gupta breaks down the various factors and demographics that may make some people and communities more susceptible.\nYou can listen on your favorite podcast app or read the transcript below.\nGupta: Recently we've seen disturbing reports of black Americans dying from the novel coronavirus at a disproportionate rate.\nYou may remember I told you that a virus doesn't discriminate. And that is still true.\nBut there are other factors that play a part into how susceptible certain communities are to the virus. Today I'll talk you through some of them.\nI'm Dr. Sanjay Gupta, CNN's Chief Medical Correspondent. And this is \"Coronavirus, Fact vs. Fiction.\"\nDr. Jerome Adams, US Surgeon General (on \"CBS This Morning\"): Blacks are more likely to have diabetes, heart disease, lung disease and I shared myself personally that I have high blood pressure, that I have heart disease and I and many black Americans are at higher risk for Covid.\nGupta: That's the US Surgeon General Dr. Jerome Adams talking to CBS.\nOn Tuesday, he sounded the alarm about the racial disparity in deaths as a result of Covid-19 -- and how underlying health issues play into it.\nThe federal government has not yet tracked coronavirus by demographic groups, but what we are seeing from some states is pretty shocking.\nIn Michigan, where I grew up, 14% of the population is black, yet they make up 41% of coronavirus deaths.\nIn Illinois, 15% identify as black or African American, but they make up 43% of deaths.\nA similar pattern is emerging in Louisiana.\nCNN Political Commentator Van Jones: The African American community is about to get decimated by this virus and it's time for start talking about it in those terms.\nGupta: That's criminal justice reform advocate and CNN commentator Van Jones.\nHe outlined some of the other issues that make black America more vulnerable, starting with the fact that they are disproportionately low-income.\nJones: The thing about being poor is it's hard to get away from people. Rich people are already socially isolated. They got gated communities. They got mansions. Part of being poor is you've got a bunch of people around you you can't get away from.\nThis virus actually is ultra-lethal for black communities because it is an epidemic jumping on top of other epidemics. So, you already have an epidemic of hypertension, high blood pressure in the black community. All the doctors are saying: people who have high blood pressure and hypertension are very at risk to dying when they get this virus. Nobody is saying that to the black community loudly enough.\nYou know, older people or people who have other factors, co-morbidities or whatever they say. Nobody knows what that means. What that means is if your grandmother has high blood pressure or diabetes, grab her and pull her into the house and do not let her out for two months. That level of urgency and specificity has been missing.\nGupta: There's also been a lot of misinformation.\nJones: Literally a rumor started in the black community that we are immune to this virus. \"This is a virus that kills old white people.\" And the only thing that spread faster than the virus was this rumor. And so you now have tens of millions of black people who have heard, \"Eh, this is really not our issue.\" And in fact, nothing could be further from the truth.\nGupta: Van says he's particularly worried about the South where the majority of America's black community lives.\nJones: My sister, who lives in Tennessee, could not get her employer to let her stay home from work, even though she has a ton of health issues that would make this virus almost immediately fatal to her. The employer said, listen, if the mayor is not telling you to stay home and the governor is not telling you stay home, who am I to tell you to stay home, come to work. My sister finally got permission on Thursday of last week to work from home. This is happening to African Americans across the South and to white people across the south as well. But the black community has special underlying epidemic of health problems that make this virus lethal to us. And yet we live in states where governors are the most delinquent. It's been shown in study after study that people reporting the same symptoms, if it's a black person versus a white person, doctors tend to take black pain less seriously. And that on top of the fact that you've got this virus coming through without us taking proper precautions and our underlying health means we're headed for a disaster.\nGupta: Van's concerns are well founded.\nThere's no doubt this virus has brought into even greater focus the structural inequalities in our health care system which puts certain communities at greater risk.\nMichigan lawmaker Tyrone Carter -- who contracted the virus himself -- explained why on CNN.\nState Rep. Tyrone Carter: When we talk about health care, it's easy to say that it's accessible, but to people that don't have a job, a service job that has health care, sometimes they use urgent care or the emergency room as their primary care physician. So what this has done is magnified those issues.\nGupta: Epidemiologist, Dr. Camara Phyllis Jones, who was also a former president of the American Public Health Association, echoed those same sentiments.\nCamara Jones: What we're seeing in these statistics right now reflects that black folks are now getting it more and that's because they're more on the frontline and less protected on the frontline, right? So it is not as easy for them to shelter in place. And it's not as easy because they might have front-facing jobs like home health aides or bus drivers or postal workers or working at Amazon and the like. They might, even if they wanted to shelter in place, not have paid sick leave available to them, although the third rescue package that the Congress passed is meant to address with that, but may not even be eligible for you know, unemployment insurance because they haven't been working at a job for two years.\nGupta: But it goes even further to include a social bias.\nFor example, as the CDC released new guidelines urging people to wear masks, some black people have come out and said that wearing a mask could put them at even greater danger.\nHere's Van Jones again.\nVan Jones: We already get shot and profiled and people treat us with alarm just walking in the store to buy some Skittles. Literally. Just wearing a hoodie can be a death sentence in some communities. So the idea you're gonna be wearing a hoodie and a mask, if that's going to be the new social norm, then people need to adapt to see -- to give African American men and young women and other people of color more the benefit of the doubt. This virus is hitting different communities differently.\nGupta: So what can be done to level the playing field?\nDr. Jones told me, fundamental to all of this is still the basic idea of identifying who's sick.\nCamara Jones: I think the more fundamental problem is that our whole testing strategy has been more of a clinical strategy -- that is a strategy that doctors might take to treat a disease, as opposed to a public health, kind of population-based surveillance strategy where you want to intervene on the course of the pandemic.\nGupta: She, like many other officials, is urging the government to keep comprehensive demographic data on people who are tested.\nRacial and ethnic data will enable us to better inform communities at greater risk and allow us to tackle the underlying inequality that is still plaguing the system.\nCamara Jones: My work for decades has, for decades now, has been on naming, measuring and addressing the impacts of racism on the health and well-being of the nation. And why am I doing that? Because we don't have to be here.\nGupta: It is sad but true that so many black Americans have higher rates of some underlying conditions like heart disease and diabetes, conditions that may also increase their risk for Covid-19.\nBut again, it is these structural inequalities that have led to these higher rates of preexisting illness, lack of access to good food, lack of access to health care. And on top of that, black America is disproportionately at the front line of this pandemic. Not just within health care settings but within food delivery, grocery stores and pharmacies. People doing work, risking their lives, in order to keep the country running.\nThese are all factors that have made this pandemic so much more severe in parts of the black American community.\nI want to stress again that no one should feel immune to this disease. It is a highly transmittable virus that can infect anyone and everyone, regardless of race, socioeconomic status or location.\nThs US Surgeon General may have said it best ...\nAdams: \"My recommendation is to all of America that we're really doing this to protect not just ourselves but each other. Every single person who stays at home is a person who is not spreading Covid and is a person who can protect their neighbors.\"\nGupta: We need to help each other. We are dependent on each other. And the best thing we can do for now is to try and stay at home.\nWe'll be back tomorrow. Thanks for listening.\nYou can also head to cnn.com/coronavirus and sign up for our daily newsletter, which features the latest updates on this fast-moving story from CNN journalists around the globe.", "url": "https://www.cnn.com/2020/04/09/health/sanjay-gupta-coronavirus-podcast-april-9-wellness/index.html"}