{"authors": ["Nicholas Riccardi"], "date_download": "2020-05-04 20:10:58", "date_modify": "2020-05-04 20:10:58", "date_publish": "2020-04-08 04:09:28", "description": "Wisconsin's chaotic primary may just be the beginning. Both major parties are preparing for a monthslong, state-by-state legal fight over how citizens can safely cast their ballots should the...", "filename": "_e1a6172a1cd4429e379bba9216e6f8a3_1588623058.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e3b81a89e0294fc988de7d147ffc7f27/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e1a6172a1cd4429e379bba9216e6f8a3_1588623058.html", "title": "Voting rights disputes in virus era spark court battles", "title_page": "Voting rights disputes in virus era spark court battles", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Wisconsin’s chaotic primary may just be the beginning. Both major parties are preparing for a monthslong, state-by-state legal fight over how citizens can safely cast their ballots should the coronavirus outbreak persist through November’s election.\nThe outcome of the court battles — expected to litigate mail-in voting rules, voter identification requirements and safe access to polls — may have a significant impact on how many people turn out to vote in hundreds of elections across the country, including the White House race. It will likely play out in presidential battlegrounds amid an already roiling debate over voting rights and protecting access to the ballot.\n“We have already seen more litigation, even before COVID, than ever before in 2020,” said Marc Elias, a prominent attorney who represents the Democratic Party on voting issues. “What COVID has done is added fuel to that fire.”\nElias said he expects to file lawsuits within the coming weeks against states that Democrats argue haven’t taken adequate steps to protect voters and poll workers during the outbreak. The party is pushing steps to make it simpler to request and return mail-in ballots.\nRepublicans are ready to fight back. President Donald Trump has already tried to portray voting by mail as suspicious and warned that it could lead to so many people voting that “you’d never have a Republican elected in this country again.” The Republican National Committee will spend some of the $10 million it set aside for presidential year election-related litigation to fight back against Democratic lawsuits over the virus.\nTuesday’s presidential primary in Wisconsin was a preview of confusion the court fights can cause. After Democratic Gov. Tony Evers tried to delay the election at the last minute, a court initially postponed and tweaked the rules for the contest, only to have the U.S. Supreme Court on Monday night reinstate many of the original rules and the election.\nThe election went on as planned — although Milwaukee opened just five of its 180 in-person polling places after hundreds of poll workers declined to show up. Voters cast ballots while wearing protective masks and stood in long lines, trying to keep a safe distance in a state where the virus has killed 92 people.\nOnly five states send ballots to all voters to be returned through the mail. Roughly one-third of states require a formal excuse to procure an absentee ballot that can be sent in remotely, including the swing state of New Hampshire, which has yet to designate the pandemic as a legitimate reason to get a mail ballot. Other states crucial to the presidential contest, like Wisconsin and North Carolina, require a witness to sign an application for a mail ballot — a requirement that can be difficult to meet for voters in quarantine.\nIn Texas, the state Democratic Party has filed a lawsuit seeking to allow the pandemic to qualify as a legitimate excuse for any voter seeking an absentee ballot. The Republican National Committee, meanwhile, helped New Mexico Republicans try to stop that state’s Supreme Court from allowing a request by county clerks to turn their June primary into an all-mail event.\nThe party argues that such changes are premature and, in some cases, unworkable.\n“Imposing a new system onto states unnecessarily will result in significant problems in the November election, and it is critical we work to preserve the integrity of the democratic process,” said RNC spokeswoman Mandi Merritt.\nThe Trump campaign has laid down markers on what sort of changes it expects state Republicans to fight. Vote-by-mail options can “play a role during a pandemic by enabling at-risk voters to vote safely,” legal counsel Justin Clark said in a statement.\nBut, Clark added, “states should resist proposals that open the door to voting fraud such as mailing ballots to voters who haven’t asked for one.” Notably, some Republican secretaries of state, such as in Iowa and Ohio, have already moved to send mail ballots out widely.\nThe brewing legal fight comes as Democrats’ efforts to mandate no-excuse mail-in voting have fizzled in Congress.\nSenate Republicans prevented measures from making it into the stimulus bill passed last month. Democratic leaders said the Wisconsin primary strengthened their resolve to try again in the next bill, but voting rights groups are pessimistic that will succeed.\nInstead, advocates are trying to secure more funding for local elections offices. They got $400 million in the last stimulus but estimate at least $1.6 billion more would be needed to enable the states to prepare for a radically changed voting landscape in November.\n“Making sure that our elections can be conducted fully and fairly is a very high priority for us,” Senate Minority Leader Chuck Schumer told reporters Tuesday.\nStill, voting rights advocates believe more litigation is inevitable as parties look closely at vote-by-mail procedures. Elias said Democrats are pushing for some standards, including a postage-paid return envelope, counting ballots postmarked by Election Day, allowing voters to resolve issues arising from questions about a signature and allowing groups to drop off and collect mail ballots from voters.\nDemocrats argue the latter provision, dubbed “ballot harvesting,” is essential for elderly voters and others isolated by the pandemic. But it’s another red line for the Trump campaign.\nTrump complained Tuesday that Democrats wanted to extend the time for mail ballots to come in.\n“Now, mail ballots, they cheat, OK? People cheat. Mail ballots are a very dangerous thing for this country,” said the president, who requested an absentee mail-in-ballot last month for Florida’s primary.\nRick Hasen, an election law professor at the University of California-Irvine, said he expects “a lot of litigation, especially in states that offer excuse absentee balloting.” But, he added, fighting over elections was already going to be intense before the outbreak.\nHasen tracks election litigation and said it soared to a high record in 2018 — an unusual mark for a nonpresidential year. “Part of it is hyperpolarization,” Hasen said. “Part of it is that we have a lot of close elections, and people realize that, in really close elections, rules matter.”\n___\nAssociated Press writer Lisa Mascaro and Kevin Freking in Washington contributed to this report.\n___\nCatch up on the 2020 election campaign with AP experts on our weekly politics podcast, “Ground Game.”", "url": "https://apnews.com/e1a6172a1cd4429e379bba9216e6f8a3"}