{"authors": ["On Assignment For Huffpost"], "date_download": "2020-05-04 20:15:07", "date_modify": "2020-05-04 20:15:07", "date_publish": "2020-04-29 09:45:19", "description": "The same foods you buy out of preference could be foods someone else buys out of medical necessity.", "filename": "entry_7-foods-not-to-buy-during-pandemic_l_5ea3065ec5b669fd8923fd7d_1588623307.html", "image_url": "https://img.huffingtonpost.com/asset/5ea33074250000a92b6b882a.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_7-foods-not-to-buy-during-pandemic_l_5ea3065ec5b669fd8923fd7d_1588623307.html", "title": "7 Foods To Avoid Buying Amid The Coronavirus Outbreak Due To Others' Health Needs", "title_page": "7 Foods To Avoid Buying Amid The Coronavirus Outbreak Due To Others' Health Needs | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Now that many of us are stockpiling weeks’ worth of food to minimize our outings and help quash the spread of the coronavirus, it’s easy to overlook that one person’s cache can cause problems for others who rely on certain products out of medical necessity.\n“This may not always be life-threatening,” said Eve Persak, a certified nutrition support clinician and private nutritional counselor. “Most individuals on special diets have learned from doctors or dietitians how to substitute, troubleshoot or simply ‘go without.’”\nBut if the lack of the product becomes long-term ― say, due to a pandemic — it could compound into dangerous health risks, including weight loss, nutrient deficiencies or a decline in an underlying condition.\nAll of this can domino into a compromise of a person’s immune function. To top it off, the uptick in trips to the supermarket to find their MIA foods, combined with the looming possibility of additional specialist or emergency room visits, increases their chances of contracting COVID-19, the disease caused by the coronavirus.\nTo help others stay well, experts recommend the general population avoid — or minimize — purchasing certain foods until the pandemic is over. And there’s plenty of flexibility to replace them with nutritionally similar grub.\nCoconut Oil\nVital for people with liver disease, gallbladder disease\nCoconut oil is naturally rich in medium-chain triglycerides (MCTs). Compared to other fats, these don’t tax the liver or gallbladder the way other fats do. (MCTs bypass metabolism in the liver and don’t require as much pancreatic enzymes and bile to be digested.)\nSpecialty MCT products are available, but with the lack of stock or delay in shipment from online vendors, coconut oil serves as a nice stand-in. The oil is “also far less expensive for people that require it on an ongoing basis,” Persak said.\nbelchonock via Getty Images For people with liver and gallbladder disease, coconut oil is a healthy fat option.\nSwap it out:\nPalm kernel oil has a similar MCT oil percentage and would be a suitable stand-in for those who don’t have liver or gallbladder disease, Persak said. But because palm oils are taxing to the environment, she added, make sure the variety you choose is sustainably-sourced (RSPO certified), which may require it be purchased online.\nIf you use coconut oil because you appreciate its high-temp cooking capacity, other fats and oils that also boast a higher smoke point include refined avocado oil, clarified butter, grassfed ghee and refined extra virgin olive oil, Persak said.\nAnd if it’s flavor you’re after, “almond oil can provide a mild flavor and be used in both sweet and savory dishes,” said New York-based registered dietitian Jackie Elnahar.\nFrozen Berries\nVital for people with chronic kidney conditions\n“For people with chronic renal conditions, there are very few fruits and vegetables that are safe to consume,” Persak said. “Most plant-based foods are rich in potassium and phosphorus — two minerals that tax the kidneys.”\nBlueberries, strawberries, raspberries, cherries and cranberries, though, are low in these minerals, and therefore safe. But with fresh being harder to come by and frozen so attractive right now to cut down on trips to the supermarket, many renal patients are likely missing out.\n“For many, these are also their only consistent sources of vitamin C in the diet,” Persak said.\nBecause vitamin C is fragile and degrades quickly, it’s not as effective a nutrient to score through vegetables (since they’re typically cooked before eating). Ditto for dehydrated fruits.\nNot that you have to ditch fresh and frozen berries entirely during the pandemic, but “refraining from excessively stocking up would be a considerate gesture,” Persak said.\nSwap them out: If you’re looking to enjoy similar low-sugar fruits, peaches, melon, tangerines, grapefuits and kiwis could hit the spot. You might also consider blending smoothies that star frozen mango, pineapple or frozen-from-fresh bananas for the time being.\nBut if it’s the valuable anthocyanin phytochemicals from berries you’re most interested in (thanks to their anti-inflammatory, anti-viral and anti-cancer benefits), plenty of other plant-based foods offer them, Persak said. These include grains (purple and black rice, purple corn), vegetables (red cabbage, eggplant, red onion) and other fruits (red grapes, goji berries, plums).\nCertified Gluten-Free Products\nVital for people with celiac disease\nFor people with celiac disease (or a gluten allergy), obtaining truly gluten-free foods is essential. The best way to do this is to buy products that have been certified gluten-free, which means the items meet the strictest of gluten-free standards.\n“Due to shortages of standard products, like bread and pasta, some people are crossing over into the gluten-free foods sections for these purchases, and this can be a significant imposition for people with celiac disease (or parents of children with celiac),” Persak said.\nWhen store shelves are empty of the certified gluten-free items, it can be difficult for those needing them to create meals calorie- and nutrient-dense enough to ensure a balanced diet.\nAnd eating the slightest amount of gluten-based products is out of the question: “To do so would cause immediate GI tract discomfort (usually lasting a week or two) and injure or inflame the small intestine (which can often take several months to heal),” Persak said.\nChicago Tribune via Getty Images Try to avoid buying gluten-free baking flours right now unless you actually have a gluten allergy.\nSwap them out: Choosing regular wheat pasta and making at least 50% of the meal vegetables is the healthier alternative than the pasta itself, Elnahar said.\nIf you prefer or require a gluten-free diet but don’t need to eliminate it as strictly as some, consider sticking to products labeled as gluten-free but that don’t bear the full certification.\nNutritional Shakes\nVital for people with COPD, cancer\nPeople with chronic obstructive pulmonary disease (COPD, an inflammatory lung disease that causes poor airflow and breathing difficulties) burn calories at an extremely high rate (10 times faster just from their body working harder to breath), making it necessary to eat a large amount of calories throughout the day.\n“If they’re unable to gain access to foods high in calories, yet relatively healthy, they may face extreme weight loss and malnutrition,” said Trista Best, a registered dietitian at Balance One Supplements.\nOne way such people typically accomplish getting the calories they need is through drinking high-protein nutritional shakes, such as Ensure.\nThose going through chemotherapy for cancer can experience appetite loss, weight loss and nausea, so keeping nutritional shakes on hand can be helpful in making sure they’re getting the necessary protein, calories, vitamins and minerals for maintaining nutrition and fighting the cancer.\nThe problem? “It’s not uncommon for the general population to purchase these items out of fear of food loss because they supply adequate protein and calories,” Best said.\nSwap them out: Opt for homemade smoothies with protein powder or lower-calorie protein shakes not marketed for medicinal purposes, Best suggested.\nWhole Milk\nVital for people with COPD\n“The general population begins stocking up on milk of any kind during potential food panic, but whole milk in particular is necessary for people with COPD to meet their calorie and fat needs,” Best said.\nSwap it out: Consider purchasing lower-fat milk or milk alternatives, such as almond milk, until the pandemic is over.\nRice or Oat Milk\nVital for people with gallbladder disease, pancreatitis\nWhen someone has gallbladder disease or pancreatitis, their ability to digest fats is impaired. “Any ingestion of fat can cause an acute attack of abdominal pain and gastrointestinal distress, as well as inflammation,” Elnahar said.\nThis is why non-fat and low-fat dairy ― as well as dairy-free alternatives that are naturally low in fat, such as rice and oat milk ― are paramount to preventing the onset of pain.\nSwap them out: When buying non-fat and low-fat dairy, don’t stockpile — only buy what you need. And instead of rice or oat milk, consider going with milk alternatives that are still dairy-free but slightly higher in fat, such as almond milk (higher by roughly 1 gram per serving).\nLow Sodium Products\nVital for people with chronic kidney conditions, lung diseases, hypertension, high blood pressure\nQuite a few medical conditions require significant restrictions in dietary sodium so as to avoid fluid retention. “Low sodium foods are important during this time for people with these conditions,” Best said. Otherwise, they risk compromising their health even further (taxing kidney function, developing breathing difficulties, raising blood pressure).\nWith canned and pantry products in such high demand, however, many consumers are reaching for the low sodium canned products like vegetables, beans and soups when the standard versions aren’t available.\nSwap them out: People who don’t have sodium concerns should try to avoid stocking up on low sodium items and stick to the standard versions when possible. Purchasing fresh or frozen is another option to save low sodium goods for people who need them most.\nFor anyone who’s salt-sensitive or wanting to budget their salt intake for preventative reasons, you can reduce the sodium in standard varieties of canned vegetables and beans by draining and rinsing them well before using.\n“You can also trim down your overall salt intake in other ways, like using spices and herbs, reducing salts in recipes and removing the salt shaker from the kitchen table,” Persak said.", "url": "https://www.huffpost.com/entry/7-foods-not-to-buy-during-pandemic_l_5ea3065ec5b669fd8923fd7d"}