{"authors": ["Ashley Strickland"], "date_download": "2020-05-04 17:03:17", "date_modify": "2020-05-04 17:03:17", "date_publish": "2020-04-10 16:49:02", "description": "One NASA astronaut just arrived on the International Space Station and two others are preparing to return to Earth soon. And when they do, it will be to a very different Earth than the one they left months ago.", "filename": "2020_04_10_us_astronauts-space-station-interview-scn_index_1588611797.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410104626-nasa-astronaut-presser-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_astronauts-space-station-interview-scn_index_1588611797.html", "title": "Being an astronaut during a pandemic: 'I think I will feel more isolated on Earth'", "title_page": "Being an astronaut during a pandemic: 'I think I will feel more isolated on Earth' - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) NASA astronauts Jessica Meir and Andrew Morgan have watched the coronavirus pandemic unfold just like the rest of us, but from a very different vantage point aboard the International Space Station.\nAnd when they return to Earth on April 17 after being gone for seven and nine months, respectively, they will find it a very different place than when they left.\nOn Friday, Morgan, Meir and Christopher Cassidy, who just arrived on the space station Thursday, held a press conference from the space station on Friday. Coronavirus dominated the questions they received.\nNASA astronauts (left to right) Andrew Morgan, Jessica Meir and Christopher Cassidy are currently on the International Space Station together.\n\"It's quite surreal to see it unfolding on Earth below,\" Meir said. \"From here, Earth looks just as stunning as usual, so it's hard to believe all of the changes that have taken place since we left.\"\nAstronauts on long-term spaceflight missions to the space station always expect that Earth will change, Morgan said.\nRead More", "url": "https://www.cnn.com/2020/04/10/us/astronauts-space-station-interview-scn/index.html"}