{"authors": ["Chloe Melas"], "date_download": "2020-05-04 17:02:13", "date_modify": "2020-05-04 17:02:13", "date_publish": "2020-04-10 16:17:04", "description": "With his hit series \"Modern Family\" coming to an end this week after 11 seasons, Ty Burrell has turned his efforts toward providing relief to the restaurant workers impacted by the coronavirus.", "filename": "2020_04_10_entertainment_ty_b786be86111278218b64965d764504d6_index_1588611733.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409181454-ty-burrell-coronavirus-pandemic-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_entertainment_ty_b786be86111278218b64965d764504d6_index_1588611733.html", "title": "Ty Burrell is providing relief for restaurant workers impacted by coronavirus closures", "title_page": "Ty Burrell is providing relief for restaurant workers impacted by coronavirus closures - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) With his hit series \"Modern Family\" coming to an end this week after 11 seasons, Ty Burrell has turned his efforts toward providing relief to the restaurant workers impacted by the coronavirus.\nBurrell and his wife, co-owners of two bars in Salt Lake City, Utah, have personally seen how coronavirus closures have left thousands of restaurant employees in the city suddenly out of work. Burrell told CNN in an interview on Thursday that he wanted to do something to help, so he teamed up with Salt Lake City Mayor Erin Mendenhall and the Downtown Alliance to start the Tip Your Server initiative\n\"Salt Lake City was hit twice, the Covid crisis and also a series of earthquakes,\" Burrell said. \"About 15,000 [restaurant workers] are unemployed right now.\"\nThe Burrells have already donated $100,000 to the program and are hoping to soon provide grants up to $2,000 to food and beverage employees in the area. For Burrell, the restaurant industry holds a special place in his heart.\n\"I was a waiter when I first started, I was an awful, terrible waiter but I was a waiter,\" he said. \"Unemployment is really hard for that industry anyway because your living is essentially tips... they are often part-time employees without benefits, so it's a particularly vulnerable part of our population.\"\nRead More", "url": "https://www.cnn.com/2020/04/10/entertainment/ty-burrell-modern-family-coronavirus-tip-your-server/index.html"}