{"authors": ["Politics News Reporter", "Huffpost Uk"], "date_download": "2020-05-04 20:31:26", "date_modify": "2020-05-04 20:31:26", "date_publish": "2020-04-30 14:40:46", "description": "Victims' commissioner Dame Vera Baird says people are cooped up with their abusers.", "filename": "entry_police-face-tsunami-of-domestic-abuse-reports-once-coronavirus-lockdown-ends_n_5eaae1f7c5b6efb0d33d3bb6_1588624286.html", "image_url": "https://img.huffingtonpost.com/asset/5ea84264300000b6111550c9.jpeg?cache=hp36mgovug&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_police-face-tsunami-of-domestic-abuse-reports-once-coronavirus-lockdown-ends_n_5eaae1f7c5b6efb0d33d3bb6_1588624286.html", "title": "Police Face 'Tsunami' Of Domestic Abuse Reports Once Coronavirus Lockdown Ends", "title_page": "Police Face 'Tsunami' Of Domestic Abuse Reports Once Coronavirus Lockdown Ends | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Coronavirus has changed everything. Make sense of it all with the Waugh Zone, our evening politics briefing. Sign up now.\nPolice face dealing with a “tsunami” of domestic and sexual abuse reports when the coronavirus lockdown ends, Dame Vera Baird has said.\nThe victims’ commissioner, who gave evidence to the Commons’ justice committee on Tuesday, said curbs on Brits due to Covid-19 meant many people were cooped up with their abusers at home.\nCharges and arrests have gone up as much as 24% in some areas, but calls to charities such as Women’s Aid have surged by 50%, suggesting the real problem could be masked by the lockdown.\nBaird told MPs cops must start preparing for a rush in official reports when restrictions are lifted.\nShe said: “What we do think will happen [is] there is likely to be tsunami of complaints, pleas for help, police reports as soon as the lockdown is over.\n“I hope that if they didn’t plan particularly fantastically well for the epidemic now that they will be planning for the recovery which will inevitably produce this tsunami.”\nShe added: “Calls to the helplines have rocketed. Complaints to the police have not gone up commensurately, but complaints to victims’ services clearly have.\n“There are real worries about access to any help if you are locked down with the perpetrator in the next room.”\nTessa Bunney via Getty Images Victims' commissioner Dame Vera Baird\nBaird also told the committee there had been “some suggestion of abuse by older children on parents” emerging during the coronavirus lockdown.\n“This is a newer kind of domestic abuse which is probably suggestive of kids wanting to go out and not being allowed to,” she said. “We are talking teenagers.\n“That is, I think, a worry and there’s a sense in which there’s a spike likely to emerge of this kind of domestic abuse complaining which is just coming through now.”\nThere has also been “quite a big spike” in calls about anti-social behaviour, she said.\n“It looks like, if I can put it this way, people are getting more frustrated and slightly angrier at things like noise nuisance, which perhaps isn’t a surprise given what’s going on,” she said.\n“But that is a big upturn, quite a big spike, in calls about anti-social behaviour.”\nVictims’ services have also seen a high number of calls about welfare.\n“Victims’ services are getting quite a lot of welfare-related calls – so, about not having enough food, not being on Universal Credit, not having enough money, they’ve lost their job, as if people are having to resort to a friendly face and they’ve been victims of crime before,” she said.\n“They are asking for stuff which the victims’ services can’t answer.”", "url": "https://www.huffpost.com/entry/police-face-tsunami-of-domestic-abuse-reports-once-coronavirus-lockdown-ends_n_5eaae1f7c5b6efb0d33d3bb6"}