{"authors": ["Claudia Sahm", "Kate Bahn For Cnn Business Perspectives", "Kate Bahn For"], "date_download": "2020-05-04 16:26:46", "date_modify": "2020-05-04 16:26:46", "date_publish": "2020-04-07 15:15:39", "description": "On Friday, the Bureau of Labor Statistics announced that the unemployment rate rose to 4.4% in March, up from 3.5% in February. In addition, it reported 701,000 jobs were lost.", "filename": "2020_04_07_perspectives_recession-unemployment_index_1588609606.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407093247-usa-recession-coronavirus-0401-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_perspectives_recession-unemployment_index_1588609606.html", "title": "Millions of Americans have lost their jobs. There's no doubt we're in a recession", "title_page": "Millions of Americans have lost their jobs. There's no doubt we're in a recession (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Claudia Sahm is the director of macroeconomic policy at the Washington Center for Equitable Growth. Kate Bahn is the director of labor market policy at the Washington Center for Equitable Growth. The opinions expressed in this commentary are their own.\nOn Friday, the Bureau of Labor Statistics announced that the unemployment rate rose to 4.4% in March, up from 3.5% in February. In addition, it reported 701,000 jobs were lost.\nThat may sound dire, but due to the timing of the government survey, the report actually paints a much rosier picture than the reality. Earlier in the week, we learned that another 6.6 million people applied for unemployment benefits — bringing the total to nearly 10 millionin the last two weeks of March and signaling an unprecedented collapse in jobs.\nThe latest unemployment rate reminds us our labor market was relatively strong right before Donald Trump declared a national emergency on March 13. March 13 was also the last day that people were asked, in the job report released Friday, if they were working.\nNow, we are in a recession.\nHow do we know? The millions of workers who filed for unemployment benefits told us. Past experience tells us, too. Since the 1970s, a half-point increase in the three-month average unemployment rate, relative to its low in the prior year, has occurred in the early months of every recession. This indicator is known as the \"Sahm rule.\"\nBy our estimates, using the recent jobless claims, the unemployment rate on March 27 was 7% — twice the jump that the Bureau of Labor Statistics reported on Friday. This is a huge one-month increase.\nAveraging our 7% unemployment estimate for March with the official rates for January and February implies a reading of the Sahm rule that's more than twice the level at the start of past recessions.\nLayoffs will continue until the pandemic is under control and it is safe to reopen businesses and leave our homes again. The treatment required to keep Americans healthy and \"flatten the curve\" has meant putting the economy in a coma. How quickly we can bring the economy back to life depends on how quickly our healthcare professionals can beat this virus.\nBut policymakers must do their part as well. Though the Federal Reserve has taken many actions to keep markets working, and Congress passed a $2.2 trillion relief package, more must be done. As the economy hemorrhages jobs and businesses struggle to stay afloat, Congress must put more money into unemployment insurance and the Supplemental Nutrition Assistance Program, and it must make the benefits more generous and accessible to everyone. Small businesses also need more support to buffer against millions more lost jobs, or we risk emerging from this crisis with new levels of corporate concentration.\nWe must strengthen our social safety net. Workers and their families must be kept whole, regardless of whether they can work, with full paychecks and full grocery carts. Policymakers can and must do better.\nDecision makers in the government must commit to move fast and stay the course. We know that distributing additional financial support — support that automatically turns on in a crisis, and doesn't turn off until the economy is back on its feet — works.\nPolicymakers must also address the inequality that has made our economy so fragile to begin with. Continued and deep support for our most vulnerable workers and small businesses, a permanent program to ensure earned paid sick leave and generous worker protections combined with labor standards for those at the frontline of this crisis are the building blocks we need to ensure a sustained recovery.\nThe reality is we are now in a recession, and we must call on government to do more. We can't afford to wait.", "url": "https://www.cnn.com/2020/04/07/perspectives/recession-unemployment/index.html"}