{"authors": ["Joe Johns", "Daniel Burke", "Nikki Carvajal"], "date_download": "2020-05-04 16:08:37", "date_modify": "2020-05-04 16:08:37", "date_publish": "2020-04-02 16:50:23", "description": "For at least the second time in two weeks, Vice President Mike Pence is expected to hold a conference call with faith leaders and other conservatives to bring them up to date on the rapidly changing coronavirus pandemic.", "filename": "2020_04_02_politics_mike-pe_5a16d76653fdf95f9d543f228bec4823_index_1588608517.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200321140706-pence-coronavirus-briefing-0321-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_mike-pe_5a16d76653fdf95f9d543f228bec4823_index_1588608517.html", "title": "Pence expected to brief faith leaders in second coronavirus call in two weeks", "title_page": "Pence expected to brief faith leaders in second coronavirus call in two weeks - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) For at least the second time in two weeks, Vice President Mike Pence is expected to hold a conference call with faith leaders and other conservatives to bring them up to date on the rapidly changing coronavirus pandemic.\nA source who was on the last call, on March 23, told CNN that the first call involved about 20 people. Thursday's call is expected to include a much larger group. A senior administration official said it would include more than 500 \"grassroots leaders\" from across the country.\nThe calls have been organized as part of Pence's \"public liaison function\" in his role leading the White House coronavirus task force. The content of the last call was described as \"not much different\" than the kind of information shared in the daily White House coronavirus briefings.\nOn the first call, Pence talked about President Donald Trump's social distancing guidelines to stress to people \"if we do this we can have a better outcome.\"\n\"A lot of this is desire to have an additional communication portal to get the word out,\" the source said.\nRead More", "url": "https://www.cnn.com/2020/04/02/politics/mike-pence-faith-leaders-religion-coronavirus/index.html"}