{"authors": ["Ben Westcott", "David Culver"], "date_download": "2020-05-04 16:25:06", "date_modify": "2020-05-04 16:25:06", "date_publish": "2020-04-06 08:45:56", "description": "Large numbers of people flocked to popular tourists sites and major cities across China over the country's holiday weekend, despite warnings from health authorities that the risk posed by the coronavirus pandemic remains far from over.", "filename": "2020_04_06_asia_china-coronavirus-tourist-warning-intl-hnk_index_1588609506.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406153843-01-huangshan-tourists-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_asia_china-coronavirus-tourist-warning-intl-hnk_index_1588609506.html", "title": "China: Tourist sites packed as country comes out of coronavirus lockdown", "title_page": "China: Tourist sites packed as country comes out of coronavirus lockdown - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Hong Kong (CNN) Large numbers of people flocked to popular tourists sites and major cities across China over the country's holiday weekend, despite warnings from health authorities that the risk posed by the coronavirus pandemic remains far from over.\nImages from the Huangshan mountain park in Anhui province on Saturday April 4 showed thousands of people crammed together, many wearing face masks, eager to experience the great outdoors after months of travel restrictions and strict lockdown measures.\nSuch was the rush to get into the popular tourist spot, that at 7.48 a.m., authorities took the unusual step of issuing a notice declaring that the park had reached its 20,000 person daily capacity, and would not be accepting any more visitors, according to state media Global Times.\nMeanwhile in Shanghai, the famous Bund waterfront was once again packed with shoppers and tourists, after weeks of being near deserted. Many of the city's restaurants that were shuttered only days ago also appeared to be doing a brisk trade, with several requiring reservations to enter.\nA similar story played out in the capital Beijing, with locals flocking to the city's parks and open spaces.\nThe abrupt return to apparent normality comes more than three months after the virus was first detected in the Chinese city of Wuhan. The outbreak, which has since spread around the world infecting more than a million people, saw much of China brought to a near standstill in an effort to contain transmissions.\nAt its peak, thousands of new cases were recorded in China everyday. However, in recent weeks the rate of infection has slowed significantly. On Monday, China reported just 39 new cases, all but one of which were imported. To date, China has recorded 82,641 cases and 3,335 deaths.\nBut while the government is slowly relaxing restrictions, Chinese health experts have urged the public to continue to practice caution.\nZeng Guang, chief epidemiologist with the Chinese Center for Disease Control and Prevention, told the Health Times on Thursday that China had not seen the end of the epidemic.\n\"China is not near the end, but has entered a new stage. With the global epidemic raging, China has not reached the end,\" he said.\nToo much, too soon?\nWith the number of new infections in China reportedly falling, the government has tentatively begun efforts to restart the country's manufacturing and service industries.\nThe collapse in activity has affected every sector of the country's economy , leading to concerns of long term damage.\nIn recent weeks, however, there have been signs that the government has been wary of opening up too quickly and sparking a second wave of infections in the country.\nPlans to re-open movie cinemas were canceled in late March, less than two weeks after they had been told to restart, according to state media. While numerous tourist attractions in Shanghai were open for just 10 days before they were shut again on March 31.\nJUST WATCHED How Chinese businesses are adjusting to coronavirus outbreak Replay More Videos ... MUST WATCH How Chinese businesses are adjusting to coronavirus outbreak 01:25\nAfter pictures of the crowds at Huangshan emerged on social media, the People's Daily, the official newspaper of the ruling Communist Party, issued a stern reprimand on social media warning tourists: \"Do not gather!\"\nIn a commentary published on the newspaper's website, one opinion writer said while it was understandable people would want to get out after being shut up in quarantine, now was not the time to stop being \"vigilant.\"\n\"If there are asymptomatic carriers present during large-scale gatherings, the consequences would be severe,\" the article said.\nAccording to the paper, Huangshan has since announced it will stop receiving tourists.\nCrowds gather in Beijing to celebrate the Qingming Festival on April 6, after weeks of coronavirus fears.\nThird wave\nConcerns around whether China is relaxing its coronavirus restrictions too soon have led Hong Kong experts and authorities to warn of the possibility of a \"third wave\" of infections in the city.\nSpeaking to local journalists Sunday, Hong Kong epidemiologist Yuen Kwok-yung said that there could be a \"new wave\" of cases in mainland China, off the back of imported infections from Europe and the US.\n\"So in Hong Kong, we might have a third wave of cases coming from the mainland after a second wave ...The epidemic is still serious in the society. At this stage, it is still not optimistic. What worries me the most is inadequate testing on patients with mild symptoms, which prevents us from cutting off the chain of transmission,\" he said.\nThe global financial hub is still trying to contain a second wave of imported cases after returning citizens and expatriates from Europe and the United Kingdom led to a new outbreak in late March.\nIn just under two weeks, the number of local infections has risen from 317 to almost 900.\nThe convenor of Hong Kong's Executive Council, Bernard Chan, told public broadcaster RTHK Sunday that the city's government still had stricter measures it could bring in to contain the coronavirus epidemic.\nSuch measures could include restricting restaurants to \"take-out only\" or even a citywide lockdown.\n\"It could also risk spreading panic but we have to accept that it may be necessary if the alternative is the risk of something worse,\" he said.", "url": "https://www.cnn.com/2020/04/06/asia/china-coronavirus-tourist-warning-intl-hnk/index.html"}