{"authors": ["Jeremy Gong", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Grace Blakeley", "Ryan Bruckenthal", "Bue Rübner Hansen", "David Broder"], "date_download": "2020-05-04 19:57:59", "date_modify": "2020-05-04 19:57:59", "date_publish": "2020-03-16 00:00:00", "description": null, "filename": "2020_03_coronavirus-pandemic-profiteering-corporations-health-care_1588622279.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/16135451/GettyImages-1212413237.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_coronavirus-pandemic-profiteering-corporations-health-care_1588622279.html", "title": "We Can Stop Pandemic Profiteering", "title_page": "We Can Stop Pandemic Profiteering", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Under normal circumstances, socialists advocate for workers to fight capitalists. During this pandemic, that’s still true — in fact, it’s our only hope. If our society is going to win the war against COVID-19, workers need to continue to fight against the bosses and landlords.\nScientists are warning that not only will this crisis be unimaginably deadly and disruptive, it could last for eighteen months or longer. While our society is adopting “social distancing” measures that will save lives but could put tens of millions out of work, some “nonessential” companies are still insisting on continuing operations so as not to lose profits. And companies in “essential” industries like health care and logistics are set to make huge profits off the crisis. In the name of profit, companies are putting their workers and our whole society at risk by not helping to slow the spread of coronavirus and “flatten the curve.”\nThe Intercept revealed today that investors are hoping health-care firms will raise prices on critical goods like N95 masks and experimental pharmaceuticals. In California, Tesla, owned by union-buster billionaire Elon Musk, fought a losing battle against an order to shut down “nonessential” businesses, to keep production going at its ten-thousand-worker Fremont factory. Pharmaceutical companies, with the help of Joe Biden, are hoping that an eventual COVID-19 vaccine will be a huge profit-maker, instead of affordable or free to all. At least three Republican senators and Democratic senator Dianne Feinstein of California have all been caught off-loading millions of dollars in stocks, before the public caught on to the seriousness of the pandemic and the markets crashed — and after confidential briefings they received in their positions on Senate committees. Amazon is failing to protect its workers, meaning already poorly paid and overworked warehouse workers and delivery drivers risk contracting and spreading the virus to keep our logistics supply chains flowing — all because megabillionaire Jeff Bezos wants to keep profit margins high.\nAnd, on top of all of this, our balkanized, multipayer, mostly-for-profit health insurance system that leaves tens of millions — likely far more as unemployment skyrockets — without health care will mean continued massive profits for health insurance and massively more death, misery, and poverty for everyone else.\nThis sort of profiteering off the crisis is not only immoral on its face — it will worsen the crisis and lead to thousands or even millions more deaths. Profits are effectively resources siphoned off into investors’ bank accounts that could be going into slowing the pandemic, growing health-care capacity, and general social welfare like housing and food. The profit motive will drive decisions and broader dynamics as firms produce and provide services in the interest of private gain, not social good. Profit is the reason that “nonessential” businesses are still running against government recommendations, endangering their workers and all of society. And because profits come from raised prices, poorer quality products, lower wages, and worse working conditions, it will make the lives of workers in essential sectors worse and less safe while making it harder for patients, hospitals, and municipalities to procure essential goods.\nJust as socialists and workers were opposed to war profiteering during World War II, we should do everything we can today to oppose pandemic profiteering.\nNo company should be making exorbitant profits from providing health care at any time, but especially right now. The same is true of any other “essential service,” from selling food to delivering packages. Workers who must work must be protected, compensated, and supported as much as possible. And any company that can shut down to slow the virus should do so immediately, no matter the cost to its profits.\nTo fight fascism during World War II, workers and capitalists in the United States and other countries joined together in an uneasy alliance. The federal government virtually nationalized major industries to redirect production toward the war effort, subsidized infrastructure and welfare projects, and instituted price and wage controls. But employers still abused and exploited workers to maximize profits.\nBy late 1943, as the late historian Art Preis wrote in Labor’s Giant Step , corporate profits were higher than at any prior point in American history, massively subsidized by US taxpayers as part of the war effort. But even though most unions sided with FDR to enforce the wartime “no-strike” agreements, workers fought back, undertaking thousands of mostly illegal, wildcat strikes to resist low wages and inhumane conditions and pace of work.\nTo effectively fight the COVID-19 pandemic, pandemic profiteering should be strictly curtailed by government controls — and when necessary, worker action.\nWorkers should strike or organize in other ways that work for their industries, and we should demand the government nationalize industries and companies as needed. Nationalization, with transparency and democratic oversight, will secure compliance with social distancing and paid time off, eliminate wasteful profiteering from the crisis response, and ensure we have maximum coordination and efficiency to win the war against the virus.\nNo one who has lost wages or their job should be expected to pay for health care, housing, or food — that is barbaric, and also risks forcing them out into the streets and unsafe jobs, worsening the spread of COVID-19. And, of course, even after this crisis, basic goods like these should be guaranteed social rights to all, regardless of employment, not commodities for private profit.\nLuckily, we can already see workers fighting back in workplace after workplace. In New York and Chicago, the threat of teacher strikes shuttered schools. Wildcat strikes by autoworkers helped convince the Big Three auto companies to suspend production. And National Nurses United (NNU) is fighting for full safety and staffing for health-care workers, and for redirecting private industry to produce medical supplies. (They appear to have won the latter demand from Trump on Wednesday.)\nIn Europe, workers are fighting back too, from postal workers in London to autoworkers in Italy. Strong unions and worker militancy have won massive responses from some governments, including in Denmark and the UK, where laid-off workers will get paid time off covered mostly by the government. The Spanish government has already imposed government command over private hospitals. These governments are overhauling their economies overnight to halt the pandemic in a much more immediate and humane way than the United States’ free-market, profit-obsessed approach will allow.\nUltimately, the most efficient and humane way to solve this crisis and prevent the next one would be to decide that health care, food, and housing are basic human rights, not subject to the whims of the market or to who can make a profit. Further, we should assert public, democratic control over industry, health care, pharmaceutical research, food production and distribution, and logistics. In other words, the closer we get to democratic socialism, the safer and more humane our society will be.\nBut under capitalism, employers will still try to profit off of this crisis — and it is up to workers to fight pandemic profiteering and save the world.", "url": "https://www.jacobinmag.com/2020/03/coronavirus-pandemic-profiteering-corporations-health-care"}