{"authors": ["Brendan Savage"], "date_download": "2020-05-04 20:11:16", "date_modify": "2020-05-04 20:11:16", "date_publish": "2020-04-07 22:11:26", "description": "Flint Beecher coach Mike Williams is certain the Mr. Basketball Award would be residing on the east side of Michigan rather than the west had Jalen Terry not missed seven games with foot and ankle...", "filename": "_4ace5daade53cad33749c84858e022ef_1588623076.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4ace5daade53cad33749c84858e022ef_1588623076.html", "title": "Terry repeats as AP Division 3 Player of the Year", "title_page": "Terry repeats as AP Division 3 Player of the Year", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Flint Beecher coach Mike Williams is certain the Mr. Basketball Award would be residing on the east side of Michigan rather than the west had Jalen Terry not missed seven games with foot and ankle injuries.\nThe Beecher guard finished second in the Mr. Basketball race behind Benton Harbor’s Carlos “Scooby” Johnson, who nipped Terry in voting by members of the Basketball Coaches Association of Michigan. But what if Terry hadn’t missed those seven games and had played a full schedule?\n“He was on his way to winning it when he got hurt,” Williams said. “No doubt about it.”\nAlthough he wasn’t named Mr. Basketball, Terry did earn The Associated Press Division 3 Player of the Year award for the second straight season, as chosen by a panel of Michigan sports writers. Beecher was No. 1 all season in AP’s Division 3 rankings and Terry was a big reason the Bucs had a 20-2 record and were in the district finals when the MHSAA suspended the season because of COVID-19.\nHe averaged 20.4 points, 6.5 assists, 5.4 rebounds and 3.6 steals while making the All-State first team for the third straight year despite missing three weeks late in the season after an ankle injury flared up for the second time.\nTerry was at his best in the biggest games on Beecher’s rugged schedule, leading the Bucs to victories over Division 1 Orchard Lake St. Mary’s and Division 2 Benton Harbor. Both games were on the road.\nIn a 76-62 victory over Benton Harbor on Jan. 4 in Kalamazoo, Terry had 19 points despite injuring his ankle in the third quarter. He returned in the fourth to help the Bucs seal the victory. Johnson led all scorers with 32 points.\n“We wanted to play Scooby on Scooby’s grounds,” Williams said. “That was one of the reasons I scheduled that game. He had just went by Scooby and dunked. He was on a fast break and laid it up and unfortunately, he stepped on somebody’s foot.”\nIn a 70-61 victory Jan. 20 over Orchard Lake St. Mary’s and senior Lorne Bowman, who finished third in the Mr. Basketball voting, Terry had 26 points, nine assists and three steals. He made four 3-pointers and 11 of 12 free throws.\n“To come back three weeks later against St. Mary’s, that let me know what level he’s at. He’s got the potential to be a pro.” Williams said.\nTerry can score in a variety of ways. The Oregon recruit made 11 3-pointers en route to a career-high 43 points during a 93-45 win over Burton Bentley on Feb. 7 — and he was often unstoppable while driving to the basket.\nTerry was joined on the first team by Reece Hazelton of Maple City Glen Lake, Jeffrey Carrier of Mason County Central, Sam Vasiu of Grand Rapids NorthPointe Christian, Joey Liedel of Erie Mason, Foster Wonders of Iron Mountain, Marcus Johnson of Iron Mountain, JaVaughn Hannah of Mt. Clemens, William Dunn of Quincy and Ty Horky of Manchester.\nCourtney Kemp of Ravenna was selected as Coach of the Year.\n___\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports", "url": "https://apnews.com/4ace5daade53cad33749c84858e022ef"}