{"authors": ["Keith Allen"], "date_download": "2020-05-04 16:05:05", "date_modify": "2020-05-04 16:05:05", "date_publish": "2020-04-02 03:45:12", "description": "Ellis Marsalis Jr., a New Orleans jazz legend, educator and father of four musical sons died on Wednesday, Ellis Marsalis Center for Music Director Emeritus Quint Davis told CNN. He was 85.", "filename": "2020_04_01_us_ellis-marsalis-pianist-dies-coronavirus_index_1588608305.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401233919-ellis-marsalis-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_us_ellis-marsalis-pianist-dies-coronavirus_index_1588608305.html", "title": "Ellis Marsalis Jr., pianist, educator and patriarch of legendary musical family, dies of complications from coronavirus", "title_page": "Ellis Marsalis Jr., pianist, educator and patriarch of legendary musical family, dies of complications from coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Ellis Marsalis Jr., a New Orleans jazz legend, educator and father of four musical sons died on Wednesday, Ellis Marsalis Center for Music Director Emeritus Quint Davis told CNN. He was 85.\nThe cause of death was complications of Covid-19, his son Branford Marsalis told the New York Times.\n\"Ellis Marsalis was a legend. He was the prototype of what we mean when we talk about New Orleans jazz,\" New Orleans Mayor LaToya Cantrell said in a statement Wednesday night. \"He was a teacher, a father, and an icon -- and words aren't sufficient to describe the art, the joy and the wonder he showed the world.\"\nFour of Marsalis' six sons followed in his musical footsteps, and established their own lasting careers in the industry. His son Wynton is managing and artistic director of Jazz at Lincoln Center, and winner of multiple awards. His son Branford is a jazz saxophonist who has recorded albums with Sting, among others.\nIn addition to his own storied career as a jazz pianist and composer, Ellis Marsalis was also the first jazz instructor at the New Orleans Center for the Creative Arts, and the first chair of the jazz studies program at the University of New Orleans, according to Cantrell's statement.", "url": "https://www.cnn.com/2020/04/01/us/ellis-marsalis-pianist-dies-coronavirus/index.html"}