{"authors": [], "date_download": "2020-05-04 16:28:37", "date_modify": "2020-05-04 16:28:37", "date_publish": "2020-03-25 18:59:49", "description": "We've interviewed experts and found the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.", "filename": "2020_03_25_cnn-underscored__aaaabe1338f62ad17b5aed54a03d6f4c_index_1588609717.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200324142440-underscored-staffpicks-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_25_cnn-underscored__aaaabe1338f62ad17b5aed54a03d6f4c_index_1588609717.html", "title": "CNN Underscored Staff Picks: 10 products that have been keeping us sane", "title_page": "CNN Underscored Staff Picks: 10 products that have been keeping us sane - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "We've interviewed experts and found the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nWhether you're a homebody or more of an extrovert who thrives on social interaction, if you're self-quarantining, it may be taking a toll right now — and if it hasn't yet (lucky you!), the cabin fever may start to surface soon. You might be working from home, managing remote learning for your children, crossing long-ignored things off your to-do list, or just trying to stay pulled together with each less-than-fruitful trip to the grocery store, but life is definitely not normal, for anybody.\nIn light of that, we've rounded up some of CNN Underscored staffers' favorite products for keeping our sanity intact as we all get through this crisis one day at a time. If you've been feeling bored, lonely or anxious, we hope at least one thing on this list inspires you to find ways to add small doses of joy to your day.\nBlack+Decker 20V MAX Drill & Home Tool Kit, 68-piece ($79; amazon.com)\nBlack+Decker 20V MAX Drill & Home Tool Kit, 68-piece\nI spent my first week working from home doing all the home improvements I've been putting off for the last year and a half of living in my apartment, meaning I've been breaking out my tool kit more often in the last seven days than I have in my entire life. Framed art and shelves are finally hanging in their designated spots thanks to my hammer and nails, organizers have finally been built with my handy screwdriver, string lights are up with the help of putty, and hooks are holding jackets and robes via Command tape. (The putty and tape didn't come with the kit, I just keep them in there.)\nIt's been oddly comforting to finally pay attention to these small details in my home, and really, it makes me feel less averse to staying inside, since I now actually want to be present to enjoy my new decor. Next on my home fixes list: spackling the old nail holes in my walls, now that I've moved things around. — Chelsea Stone, commerce editor\n_______________________________________________________________________________\nPerky-Pet Copper Panorama Bird Feeder ($13.86, originally $18.99; chewy.com)\nPerky-Pet Copper Panorama Bird Feeder\nWorking from home is a privilege that I feel lucky to have — but after enough time doing so, while social distancing to boot, I think it's pretty normal for anyone to develop a case of the stir-crazies. To help add some joy to my day, I recently bought this wild bird feeder and hung it in my yard, which I have a direct view of when I work from my kitchen table. I love seeing all the sparrows, cardinals, blue jays and the occasional odd bird that I can't identify stopping by for a snack. It's a delightful distraction that, as silly as it sounds, reminds me that birds have no idea what humans are going through right now — and that in due time, things will eventually return to normalcy. — Emmy Favilla, deputy editor\n_______________________________________________________________________________\nHeadspace app (free; headspace.com)\nHeadspace app\nI'm currently locked in with my girlfriend, and we've been doing a pretty good job occupying ourselves with cooking, games and shows. What we really have needed help with is managing the existential stress as COVID-19 spreads all around NYC. She is immunocompromised, so we've both been really nervous about catching it. Two days ago we went out on our last run to pick up some odds and ends, and we were stuck in a really crowded supermarket, which had us pretty riled up.\nSo that night I made some tea and we both tuned into the meditation app Headspace, which until now I haven't used that much. We chose one of the stress meditations, which mainly told us to pay attention to our bodies and our breathing. It really helped me take my mind off things after a day of over-worrying, plus I was knocked out in under 10 minutes. We've used it the past two nights since, and it's a nice centering routine that I think we'll continue to do while we self-quarantine. — Kai Burkhardt, editorial coordinator\n_______________________________________________________________________________\nThinkFun Gravity Maze Game ($29.95; amazon.com)\nThinkFun Gravity Maze Game\nMy 11-year-old son and I have been loving this logic puzzle game. Players are tasked with arranging multi-level plastic towers to lead a marble from one space to another on a grid. The first of four levels of difficulty should be easy enough for a younger elementary school-aged player, while the hardest — well, let's just say the boy is the only one in the house (so far!) who is able to complete those. Now that even the kids' school is delivered via a screen, this game has provided a wonderfully tactile way to engage our brains. — Michael Bruno, editorial director\n_______________________________________________________________________________\nGaiam Yoga Mat ($28.99; amazon.com)\nGaiam Yoga Mat\nYoga is an amazing way to de-stress, wind down and reset your focus. I love this yoga mat because it's comfortable and doesn't leave my knees or hands feeling irritated, and it's easy to roll up and store. (Also, the design is chic and reflects my inner fashionista!) I use my yoga mat at night while following guided exercises on YouTube, which helps me feel relaxed and more positive right before bed. — Sarai Thompson, editorial coordinator\n_______________________________________________________________________________\nBreville Smoking Gun Wood Smoke Infuser ($99.99; bedbathandbeyond.com)\nBreville Smoking Gun Wood Smoke Infuser\nMy usual glass of bourbon and takeout after work just seems a bit too boring and lazy now that I'm home all day. So I've upped my culinary and bartending game thanks to this handy smoking gun. Now that I actually have time to leave meat marinating and drinks sitting in a smoky haze for 15 minutes, the tiny gun helps me bring a delicious out-of-the-smoker taste to dishes like ribs and steaks, and elevates cocktails like Manhattans and margaritas to the $18 drinks I'd usually be sipping at bars. — Scott Simone, deputy editor\n_______________________________________________________________________________\nPhilips Hue Go Portable Light ($79.99; meethue.com)\nPhilips Hue Go Portable Light\nWe have a bunch of those Philips Hue bulbs and lamps at my house, so I set one up in our living room as an \"on air\" light so my family knows when I'm on a call. So far, it's working out well — I just change it to red on my phone when I have a video chat or call open. They have the idea of \"scenes\" where you can just switch colors to specific configurations on one touch. I haven't done that yet — I just hit something that's roughly the color red. But other than that enhancement, the beauty is the simplicity. Of course, nothing guarantees that my kids look at or care about the damned thing. :) — Toby Boudreaux, senior director of technology\n_______________________________________________________________________________\nSonos One (Gen 2) Voice-Controlled Smart Speaker ($199; amazon.com)\nSonos One (Gen 2) Voice-Controlled Smart Speaker\nBefore this week, I'd always have my TV on in the background on the rare occasions when I'd work from home. After this week, I've realized that more than 12 hours of \"Friends\" reruns isn't good for anyone's mental health. Now, instead of turning on the TV, I listen to a podcast or some soothing music on my Sonos speaker when things get too quiet in my apartment. I've had it for a while, but I appreciate the splurge-y smart speaker now more than ever. — Chelsea Stone, commerce editor\n_______________________________________________________________________________\nDaily Harvest (starting at $6.99/smoothie or bowl, get $20 off your first order; daily-harvest.com)\nDaily Harvest\nIf you've been to your local supermarket lately, chances are you may not have been able to find all the items you were looking for — from staples like fresh produce and pasta to condiments and almond milk. To avoid the anxiety of wondering whether I'll be able to pull together three diverse edible meals every day (and because I don't eat meat and try to avoid dairy), I've been relying on Daily Harvest to get me through my working-from-home days.\nDaily Harvest is a plant-based meal service that sends frozen smoothies, meals, soups, and even desserts and lattes to your door. All you need to do is blend 'em with your favorite milk or heat up the savory meals (like cauliflower rice and pesto) on the stovetop. All of the options are utterly delicious, full of nutrients, and provide the variety that's been increasingly hard to come by as this situation has become the new normal. — Emmy Favilla, deputy editor\n_______________________________________________________________________________\nIkea Softwood Mala Easel ($39.99, originally $44.18; amazon.com)\nIkea Softwood Mala Easel\nThis Ikea easel has been an essential part of quarantine life in our New York City apartment. Space is a constant issue with two boys under 7 years old and zero outdoor space. This easel has a chalkboard surface, a whiteboard surface and a paper roll holder for maximum fun, and it easily folds up flat to stow away between a dresser and the wall. We used the paper roll for brainstorming our quarantine house rules, which we then hung prominently on the wall. We also use the paper for art projects. Because it has surfaces on both sides, two young kids can work independently at the same time. We stocked up on chalk, whiteboard markers and washable tempera paints to get the most out of this versatile little workhorse. Be sure to put an old sheet or drop cloth underneath to catch accidental spills, splatters and splotches. — Dana Holmes, editor\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/03/25/cnn-underscored/underscored-favorite-products-to-keep-you-sane/index.html"}