{"authors": ["Audrey Mcavoy"], "date_download": "2020-05-04 20:24:07", "date_modify": "2020-05-04 20:24:07", "date_publish": "2020-04-21 03:14:27", "description": "HONOLULU (AP) — Hawaii Gov. David Ige said Monday the islands aren’t yet ready to relax restrictions put in place to control the spread of the coronavirus but his administration will be releasing...", "filename": "_a3a6a7d0c92f491a58b5422a196b64a3_1588623847.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a3a6a7d0c92f491a58b5422a196b64a3_1588623847.html", "title": "Hawaii governor says state not ready to relax restrictions", "title_page": "Hawaii governor says state not ready to relax restrictions", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HONOLULU (AP) — Hawaii Gov. David Ige said Monday the islands aren’t yet ready to relax restrictions put in place to control the spread of the coronavirus but his administration will be releasing criteria for doing so in the next few days.\nIge said one of the first activities he’d like to allow to resume is elective medical procedures.\nIge imposed a stay-at-home order for the entire state through April 30, though he said it’s possible he may extend it.\nOn Monday, the state Department of Health said Hawaii had 584 cases of COVID-19, an increase of just four from the day before, including two on Maui and two on the Big Island. Oahu and Kauai had no new cases.\nIge said he understood the frustration of some in the community who want restrictions lifted, acknowledging Hawaii went from having one of the nation’s lowest unemployment rates to the highest within a few weeks as the tourism industry shut down. He said the government wants to restore normalcy when conditions are right.\n“We are looking for the path forward based on science and data that can assure the public safety as we look at this evolving situation of COVID-19,” Ige said at a news conference streamed online.\nBruce Anderson, the director of the state Department of Health, said the state needs to make sure that it has the situation under control for a sustained period of time before relaxing controls.\nHawaii will also need to have the infrastructure in place to quickly identify cases and close contacts as well as quarantine people quickly so the virus doesn’t spread, Anderson said.\nLt. Gov. Josh Green, who is also an emergency room physician, noted the state had news of two significant clusters just last week, one at Maui Memorial Medical Center and another centered on three McDonald’s restaurants in Kona.\n“It really boils down to how safe we are from significant spread,” Green said. “There’s discussion obviously with how careful we are going to have to be with our travelers coming to Hawaii. But we defer those conversations into the future because we don’t actually don’t know yet that we’ve completely stamped out this virus.”", "url": "https://apnews.com/a3a6a7d0c92f491a58b5422a196b64a3"}