{"authors": [], "date_download": "2020-05-04 20:25:02", "date_modify": "2020-05-04 20:25:02", "date_publish": "2020-04-15 20:42:24", "description": "MINNEAPOLIS (AP) — The U.S. Food and Drug Administration on Wednesday approved a low-cost ventilator developed by the University of Minnesota and aimed at helping COVID-19 patients breathe....", "filename": "_d6ef0cb2fa4870d7eb6dba043643bdec_1588623902.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8a39cd0b05ce446aa04223e4911a4a35/2056.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d6ef0cb2fa4870d7eb6dba043643bdec_1588623902.html", "title": "FDA approves low-cost ventilator developed by U of Minnesota", "title_page": "FDA approves low-cost ventilator developed by U of Minnesota", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this March 29, 2020, photo provided by the University of Minnesota is a ventilator called the Coventor at the Bakken Medical Device Center, University of Minnesota. The U.S. Food and Drug Administration has approved a low-cost ventilator developed by the University of Minnesota and aimed at helping COVID-19 patients breathe. The FDA on Wednesday, April 15, 2020, authorized use of the device, known as the Coventor. The compact device was quickly developed and designed by a team of university researchers, a medical school resident and an engineer. (Breanne Retherford/University of Minnesota via AP)\nIn this March 29, 2020, photo provided by the University of Minnesota is a ventilator called the Coventor at the Bakken Medical Device Center, University of Minnesota. The U.S. Food and Drug Administration has approved a low-cost ventilator developed by the University of Minnesota and aimed at helping COVID-19 patients breathe. The FDA on Wednesday, April 15, 2020, authorized use of the device, known as the Coventor. The compact device was quickly developed and designed by a team of university researchers, a medical school resident and an engineer. (Breanne Retherford/University of Minnesota via AP)\nMINNEAPOLIS (AP) — The U.S. Food and Drug Administration on Wednesday approved a low-cost ventilator developed by the University of Minnesota and aimed at helping COVID-19 patients breathe.\nThe FDA authorized use of the compact device, known as the Coventor, that was quickly developed and designed by a team of university researchers, a medical school resident and an engineer.\nThe developers hope the Coventor will be used in clinical settings where traditional ventilators are unavailable.\n“With FDA authorization, we are closer to that happening,” said Stephen Richardson, a cardiac anesthesiology fellow in the Medical School, M Health Fairview.\nVentilators are used to help increase patients’ blood oxygen levels and have been in short supply as hospitals deal with COVID-19, the respiratory disease caused by the coronavirus.\nWorking with a university team, Richardson and fellow inventor Aaron Tucker adapted their initial prototype to a custom slider-crank mechanism that allows control over how oxygen is delivered to patients.\nFDA authorization allows the design to move forward with production and distribution to health care systems, the university said.\nUniversity researchers say the Coventor’s specifications will be made open source, making the plans accessible to health care providers worldwide.\n“The Coventor gives people a chance and that is what this is all about,” Richardson said.", "url": "https://apnews.com/d6ef0cb2fa4870d7eb6dba043643bdec"}