{"authors": ["Shen Lu", "For Cnn Business"], "date_download": "2020-05-04 16:55:59", "date_modify": "2020-05-04 16:55:59", "date_publish": "2020-04-08 22:45:23", "description": "After her company laid her off last month, Tang Chen couldn't sleep. For days, her heart kept racing. There was one question at the front of her mind: would she be able to stay in the United States?", "filename": "2020_04_08_business_china-us-coronavirus-workers-intl-hnk_index_1588611359.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408123140-us-immigration-0303-01-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_business_china-us-coronavirus-workers-intl-hnk_index_1588611359.html", "title": "Chinese workers in the US are losing their visas. But flying home is too expensive", "title_page": "Chinese workers in the US are losing their visas. But flying home is too expensive  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Boston (CNN Business) After her company laid her off last month, Tang Chen couldn't sleep. For days, her heart kept racing. There was one question at the front of her mind: would she be able to stay in the United States ?\nTang comes from eastern China's Zhejiang province, but has worked in the US since 2014. Her H1-B work visa is due to expire later this year, so the travel firm where Tang worked as a software developer in Fort Washington, Pennsylvania, had begun the arduous process of applying for a green card, which would allow her to live and work in the US permanently.\nThe 33-year-old was so confident about building a life in America, she even bought an apartment in the US.\nBut when Tang was made redundant on March 13, she didn't just lose her source of income — she lost her visa status. Now her former employer has decided not to proceed with her green card application, her path to permanent residency has been lost, too.\nA sign showing the closure of a US Citizenship and Immigration Services (USCIS) field office in Washington. Immigrants in the US have faced uncertainty over their work visas due to the coronavirus crisis.\nWhen H1-B visa holders like Tang lose their jobs they have 60 days to file for a change of status — such as becoming a tourist or student — or find a new employer willing to sponsor their work visa.\nIf they can't get a new job or change their status, they have to leave the US — or illegally overstay their visa. If they leave the US after having overstayed for more than 180 days, they could be banned from reentering in future.\nFinding a job in the current climate is tough, let alone finding an employer willing to shoulder the additional costs and paperwork of visa sponsorship. Since she was laid off, Tang has not had much luck getting interviews and is not optimistic about being hired in the middle of a pandemic with a recession looming.\nShe had resigned herself to going back to China — only to find out that she can't. There are no seats available on any direct flights in April, and Tang is worried that cobbling together a multi-stop trip could put her at risk of catching the virus.\n\"Even if I want to go back now, I can't get a flight ticket,\" she said. Instead, she's desperately applying to university to get a student visa that will allow her to remain in the US legally.\nJUST WATCHED Gig workers fear financial help may come too late Replay More Videos ... MUST WATCH Gig workers fear financial help may come too late 02:26\nNo way home\nWith the pandemic having seemingly turned a corner in mainland China, authorities there have focused their attention on preventing a new wave of infections coming into the country from overseas.\nSince late March, China's aviation administration has cut the number of inbound international flights to under 134 per week, a mere fraction of pre-pandemic totals. The dwindling number of flights has seen ticket prices soar.\nThe number of daily travelers, including Chinese citizens, entering the country by air has been limited to 4,000.\nThere are no official statistics on how many Chinese nationals in the US have lost jobs as a result of the coronavirus pandemic, but CNN has seen two groups on WeChat, a \"must-have\" messaging platform for the Chinese diaspora, in which hundreds of people claiming to be in this situation share stories and exchange information.\nEvery day, the chat rooms are filled with palpable anxiety over uncertain employment and visa prospects, as laid-off workers and those with visas due to expire soon discuss potential solutions and offer advice.\n\"I've never seen so many visa holders losing their jobs,\" said Ying Cao, a New York-based immigration lawyer whose clients are mostly Chinese expats. \"It's worst than in 2008,\" she added, when the global financial crisis caused some 2.6 million job losses\nIn March, Cao received twice as many inquiries as she would in a usual month. She advises most clients to file for a change of visa status if their grace period is expiring — perhaps to a tourist, student or dependent visa — to buy themselves more time.\nTsui Yee, another New York-based immigration attorney, said many of her clients are facing the same situation. She too has seen a surge in panicked calls from Chinese expats in recent weeks.\n\"(The immigration environment) was already bad, but this pandemic has propelled it to an even more dire situation,\" Yee said. \"A lot of my clients who are here on work visas are extremely concerned.\"\nJUST WATCHED Record 6.6 million Americans file jobless claims Replay More Videos ... MUST WATCH Record 6.6 million Americans file jobless claims 04:09\n'Needlessly endangering lives'\nSo far, the US authorities have done little to help those in Tang's situation.\nH1-B visas are the most common type of employment visa in the US, and some 900,000 were issued in the last five years . The visa is tied to a specific employer and is valid for three years, with an option to extend it for a further three years.\nIn 2019, Chinese nationals accounted for around 15% of H1-B visas issued, according to the US State Department\nSo far, the US Citizenship and Immigration Services (USCIS) has not moved to temporarily extend the grace period for work visa holders whose permits may expire during the coronavirus pandemic. The federal agency did not respond to a request for comment.\nLast month, the American Immigration Lawyers Association (AILA) sent a letter to USCIS, calling on it to suspend immigration deadlines during the coronavirus emergency. On April 3, AILA filed suit against USCIS to try to maintain the status of non-immigrants and extend immigration-related deadlines.\n\"USCIS must join many other federal agencies in extending its filing deadlines so that lawfully present foreign nationals in the United States can maintain status during this national crisis,\" AILA President Marketa Lindt said in a statement. \"By refusing to do so, USCIS is needlessly endangering lives.\"\nAs they wait to see if they can remain in the country, many laid-off Chinese expats are unlikely to be applying for unemployment benefits.\nAccording to official data , more than 10 million US workers applied for unemployment benefits in March. But Yee and Cao, the immigration lawyers, both said this figure is unlikely to include visa holders, because many are reluctant to claim the benefits as they worry that doing so could mean they are denied a visa in the future.\nAnother issue, said Cao, is that even though work visa holders are eligible for unemployment insurance under federal immigration laws, they may not meet specific state laws, which require beneficiaries to be readily available for work.\nWhile H-1B holders might be keen to start right away, they need to get their visa transferred to another company before they can do so — a process that could take months, according to Cao.\n\"It's hard to imagine any employer can wait that long,\" she added.\nNo more American dream\nFor Walton Wang, who recently lost his internship with a New York cosmetics company, there is yet another layer to his predicament.\nWang came to the US for college in 2015. As a member of the LGBT community, he always hoped to stay in the country, drawn to the more open environment for sexual minorities compared to China. But Wang has changed his mind after seeing the US government's handling of the crisis, and increased racial animosity and violence against Asians in the US.\n\"I don't know if I'll be the next victim of a hate crime,\" Wang said. \"Recently I've been pondering about which identity is more important to me: being gay or being Asian?\"\nAnd he has come to a painful conclusion: \"I've been leaning toward choosing my Chinese identity because I won't get beaten up in China for being gay.\"\n\"I feel like I have no options,\" Wang said. \"And this was a really harsh realization.\"\nLike Tang, however, making the decision to go home does not mean Wang will actually be able to do so.\nHe is in the US on a post-graduation grace period, which allows him to stay without a work visa for a year. But according to the rules, he can't be out of employment for more than 90 days -- and if the pandemic drags on, Wang thinks he could easily be jobless for three months.\nHe started looking at flights in mid-March, but has so far been unable to find a route home due to the reduced number of flights and soaring prices.\n\"I have no way of returning to China, and I can't stay here for long,\" Wang said. \"I have nowhere to go.\"", "url": "https://www.cnn.com/2020/04/08/business/china-us-coronavirus-workers-intl-hnk/index.html"}