{"authors": ["Gary D. Robertson"], "date_download": "2020-05-04 20:04:17", "date_modify": "2020-05-04 20:04:17", "date_publish": "2020-04-09 18:52:11", "description": "RALEIGH, N.C. (AP) — A surge in North Carolina's unemployment benefit claims has slowed in recent days, according to data released Thursday, but not enough to diminish the historic hit the state's...", "filename": "_9376b3d9c06e9efc9f9277b2e99a6c66_1588622657.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9376b3d9c06e9efc9f9277b2e99a6c66_1588622657.html", "title": "North Carolina jobless claims slowed, still historic", "title_page": "North Carolina jobless claims slowed, still historic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "RALEIGH, N.C. (AP) — A surge in North Carolina’s unemployment benefit claims has slowed in recent days, according to data released Thursday, but not enough to diminish the historic hit the state’s economy has suffered during the COVID-19 outbreak.\nApplications for temporary unemployment assistance in North Carolina for the week ending last Saturday totaled nearly 137,600, or a 20% decrease compared to the week before, according to the U.S. Labor Department’s Employment and Training Administration.\nStill, the state’s unemployment benefits office had processed close to 404,000 claims since March 14, the federal agency said — equal to more than 9% of the total state workforce eligible for unemployment insurance. Prior to the coronavirus pandemic, the state was processing about 3,000 claims a week.\nThursday’s weekly U.S. numbers , which originate from individual state unemployment offices such as North Carolina’s Division of Employment Security, showed another 6.6 million people seeking benefits last week.\nNorth Carolina’s division said separately on Thursday that initial claims between March 16 and Wednesday exceeded 497,000, with 87% marked as being related to COVID-19.\nThe economic struggles continue amid a statewide shutdown that Democratic Gov. Roy Cooper — in line with governors across the nation — ordered to stop the spread of the coronavirus.\nThe number of virus cases were increasing in the state: Health officials reported about 3,650 positive COVID-19 cases of Thursday morning, a 7% increase compared to Wednesday. There have now been 65 virus-related deaths, compared to 53 the day before. About 400 people are currently hospitalized.\nThe slowdown in unemployment claims may be in keeping with the fact that massive layoffs likely occurred right after March 17, when Cooper ordered a statewide ban on dine-in services at restaurants. The restaurant industry’s association told lawmakers last week that 350,000 of the state’s 500,000 restaurant positions have been eliminated for now. Cooper’s more recently instituted stay-at-home order is in effect until April 29.\nFor steakhouse restaurant server Vicki Edwards, 53, of Durham, the unemployment benefits she’s now receiving have eased her anxiety. “It gives me an extraordinary relief,” she said.\nBut Edwards needed help from a state legislator’s office to ensure her application was completed properly after struggling with the overloaded unemployment benefits computer system. Countless others have contacted their lawmakers or posted online their frustration with the unemployment benefit process. They tell stories of getting knocked off the system repeatedly, waiting on hold for several hours and knowing little about whether their requests have been processed.\nSen. Jim Perry of Lenoir County said an informal survey of constituents seeking benefits show 90% of them had major problems. “This is a textbook case of government inefficiency,” Perry, a Republican, said in a Thursday news release. “These citizens don’t have time to wait for benefits. They need them now.”\nCooper said the state has distributed $40 million in unemployment benefit payments as of Thursday. Division of Employment Security chief Lockhart Taylor told lawmakers earlier this week that more call center workers were coming online, and other state employees were being trained to handle claims questions.\nThe division said on Thursday that it would start making the first $600 weekly benefit payments approved by Congress by April 17. Another new initiative that allows independent contractors and self-employed workers — groups usually ineligible for benefits — to receive payments is taking longer. Taylor said his agency just received the rules for this program earlier this week, and claims won’t be accepted online until around April 25.\nThat could further delay benefits for people who rely heavily on self-employment income and have already tried to apply. Freelance music and culture writer Dan Epstein of Greensboro said he sought unemployment benefits for the first time since 1996. His work assignments at magazines and other outlets he contributes to regularly have all but dried up.\n“Things have gotten a lot tougher and the options have gotten a lot fewer,” said Epstein, 53, adding that his confidence level in government in general is low right now. “It really feels like we’re just being hung out to dry.”\n___\nFollow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.", "url": "https://apnews.com/9376b3d9c06e9efc9f9277b2e99a6c66"}