{"authors": ["Trends Reporter"], "date_download": "2020-05-04 20:18:12", "date_modify": "2020-05-04 20:18:12", "date_publish": "2020-04-29 11:04:01", "description": "The \"Late Show\" host wondered if the president would've responded faster to the coronavirus pandemic if he'd have known it would affect the meat supply.", "filename": "entry_stephen-colbert-late-show-meat-trump_n_5ea90a72c5b6106b8ecf4b29_1588623492.html", "image_url": "https://img.huffingtonpost.com/asset/5ea910472500008d10eb0878.png?cache=ieu93tzyq4&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_stephen-colbert-late-show-meat-trump_n_5ea90a72c5b6106b8ecf4b29_1588623492.html", "title": "Colbert Grills 'Burger Enthusiast' Trump For Ordering Meat Plants To Stay Open", "title_page": "Colbert Grills 'Burger Enthusiast' Trump For Ordering Meat Plants To Stay Open | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Stephen Colbert grilled President Donald Trump on Tuesday for ordering meat processing plants to stay open, after coronavirus outbreaks and worker safety concerns at numerous facilities forced closures that threatened the nation’s meat supply.\nDozens of meatpacking plants have reported cases of COVID-19, and more than 20 facilities had at some point temporarily suspended operations due to outbreaks. The United Food and Commercial Workers union, the nation’s largest meatpacking union, said in a statement that 20 workers had died and an estimated 5,000 more were sick from the coronavirus. The union urged better protections and for workers.\nThe president signed an executive order earlier on Tuesday invoking the Defense Production Act to compel slaughterhouses to stay open.\n“Fortunately, this problem came to the attention of America’s No. 1 meat fan,” Colbert said, referencing Trump’s famous fondness for fast food burgers.\n“Maybe they should’ve put that in the initial intelligence briefing. Mr. President, hundreds of thousands of Americans could be infected with this deadly virus, and some of those people make your hamburgers.”\nCheck out “The Late Show” roast about the burger-enthusiast-in-chief below:", "url": "https://www.huffpost.com/entry/stephen-colbert-late-show-meat-trump_n_5ea90a72c5b6106b8ecf4b29"}