{"authors": ["Reporter"], "date_download": "2020-05-04 20:24:41", "date_modify": "2020-05-04 20:24:41", "date_publish": "2020-04-29 20:26:01", "description": "The coronavirus pandemic threatens the life of the Postal Service just as it is needed help the most.", "filename": "entry_postal-service-vote-by-mail-pandemic_n_5ea9c7dfc5b60db2c79d94da_1588623881.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9c83b3000003012155236.jpeg?cache=dumh2uzocf&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_postal-service-vote-by-mail-pandemic_n_5ea9c7dfc5b60db2c79d94da_1588623881.html", "title": "U.S. Postal Service Funding Shortfall Could Derail Vote-By-Mail Efforts During Pandemic", "title_page": "U.S. Postal Service Funding Shortfall Could Derail Vote-By-Mail Efforts During Pandemic | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "If Congress allows the U.S. Postal Service to fail ― as President Donald Trump seems willing to do ― the nation’s ability to hold free, fair elections would be at risk, as would millions of voters who would be forced to go to the polls during a pandemic if they wanted to exercise their rights.\nIn the 2016 election, 33 million Americans voted through the mail, using either absentee, military or mail-in ballots. Every state anticipates a significant increase in mailed ballots due to the coronavirus pandemic, with anywhere from a doubling of vote-by-mail to a near 100% replacement of in-person voting. All of the states rely on the Postal Service to deliver and return those ballots.\nBut the Postal Service projects that the drop in mail volume due to the pandemic could lead it to run out of funds in late summer or early fall. The independent agency is asking Congress for $75 billion in relief funding to keep it afloat, but faces resistance from Trump.\nState election officials ― Republicans and Democrats ― are joining in the call for the funding to ensure voters have every option available to them to vote in the 2020 elections, given new social distancing needs stemming from the COVID-19 crisis.\n“America needs Congress to do its part to ensure the very foundation on which we conduct our elections does not crumble,” Vermont Secretary of State Jim Condos (D) said.\nWashington state is one of five states that conducts its elections almost entirely through the mail. If the Postal Service is forced to halt or scale back delivery, it will affect the ability of the state to conduct the election. The same is true of the other vote-by-mail states ― Colorado, Hawaii, Oregon and Utah.\n“The U.S.P.S. is integral in our success as a country and ensuring everyone has access to our elections in arguably the most anticipated election in over 100 years,” Washington Secretary of State Kim Wyman (R) said.\nASSOCIATED PRESS A United States Postal worker makes a delivery with gloves and a mask in Warren, Michigan, earlier this month.\nEven if Washington state were able to use a private vendor like UPS or FedEx, many voters would be disenfranchised because they use postal boxes provided by the Postal Service as their primary address.\n“It would be disastrous,” Wyman said.\nAnother problem is that private delivery companies operate on a profit-motive and therefore aren’t required to deliver to every conceivable address like the Postal Service.\n“There’s no private company that by mandate has to go to every address in the country,” said Mark Dimondstein, president of the American Postal Workers Union.\nEven if the Postal Service survived but was forced to cut back service, it could wreak havoc on elections. The most troubling area would concern voters who request a ballot a week or less before Election Day (Nov. 3 this year). Service interruptions could delay the delivery of that ballot, possibly causing the voter to not receive it in time.\nThat would leave some voters being forced to trade their safety to exercise their democratic right to vote by appearing in-person at a time when, as most health experts predict is likely, the pandemic will still represent a threat. The dangers have already been realized in Illinois and Wisconsin, where cases of coronavirus transmission and death have been tied to primaries those states held in March and April, respectively.\n“Do we really want people to have to put their health and safety at risk in order to meet what is a constitutional right?” Condos asked.\nLegislation to provide the $75 billion in relief funding enjoys bipartisan support in Congress. The request was made by the Postal Service Boards of Governors, a majority of whom are Republicans appointed by Trump.\nTrump, however, looms as the biggest obstacle ― which stems in part from his belief that the Postal Service provides Amazon with an unfair deal on package delivery (the president blames Amazon-owner Jeff Bezos for the negative coverage he receives from the Bezos-owned Washington Post)\nLast Friday, he termed the Postal Service “a joke,” and he has called on it to increase package rates four or five times in order to receive relief funding. “But they don’t want to raise it because they don’t want to insult Amazon, and they don’t want to insult other companies, perhaps, that they like,” he said.\nTrump has also falsely claimed that mail voting is “horrible” and “corrupt.” (He cast a ballot himself in the March Republican Party presidential primary in Florida by mail.)\n“We shouldn’t be playing politics with the Postal Service because it will disenfranchise and suppress voters,” Condos warned.", "url": "https://www.huffpost.com/entry/postal-service-vote-by-mail-pandemic_n_5ea9c7dfc5b60db2c79d94da"}