{"authors": ["On Assignment For Huffpost"], "date_download": "2020-05-04 20:15:13", "date_modify": "2020-05-04 20:15:13", "date_publish": "2020-04-29 09:45:19", "description": "You're bathing with washcloths, sponges, bath mitts and shower poufs — can the coronavirus live on them?", "filename": "entry_coronavirus-replace-shower-washcloth-loofah-bath-covid-19_l_5ea6fe56c5b6dd3f90887a41_1588623313.html", "image_url": "https://img.huffingtonpost.com/asset/5ea70322250000450feb0699.jpeg?cache=qAXuai3lwV&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_coronavirus-replace-shower-washcloth-loofah-bath-covid-19_l_5ea6fe56c5b6dd3f90887a41_1588623313.html", "title": "How Often To Replace Loofahs And Other Shower Accessories During COVID-19", "title_page": "How Often To Replace Loofahs And Other Shower Accessories During COVID-19 | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "We learn more each day about how the coronavirus behaves, but we all wonder how long the virus can live on the surfaces and on household items we interact with daily.\nThis definitely includes such essential items as clothing and shoes. The Centers for Disease Control and Prevention has said that the virus can live for hours or days on surfaces made from a variety of materials.\nWe’re careful to shower every time we come home after going out in public, so we have to wonder: Can the virus live on our bath accessories (loofahs, mitts, shower poufs and sponges)?\nTo address just how long the coronavirus can live on our bath accessories and how to clean them properly, we tapped two board-certified dermatologists and an epidemiology expert to break down everything you need to know on this topic.\nRead their need-to-know advice on everything from when to toss them to the antibacterial tools we should be using.\nThe Coronavirus Can Live On Plastic Surfaces\nThe National Institutes of Health said the coronavirus can live on plastic for up to three days. It’s probably a good idea to clean our tools often, as many bath accessories are made with plastic materials, board-certified dermatologist Rina Allawh told HuffPost.\nThe virus that causes COVID-19 “may live on bath accessories made of plastic for up to three days,” Allawh said. “With this in mind, surfaces need to be thoroughly cleaned and not used by more than one individual in the household to prevent spread.”\nWashing our hands with soap and water for 20 seconds can prevent the spread of COVID-19. Does that mean taking a shower with a pouf and soap eliminates the virus from the plastic?\nYes. But there’s a caveat.\nAnnie Richards via Getty Images Shower poufs made of plastic need to be thoroughly cleaned after each use and shouldn't be shared.\n“Washing any object with soap — whether it be a shower tool, a toy or your own hands — would disinfect and neutralize the majority of organisms and pathogens on the surface,” Stanford infectious disease physician Sudeb C. Dalai said.\nBut “the shower tools, then left damp and hanging, would begin to ‘re-colonize’ with multiplication of any bacteria that are present or nearby on adjacent surfaces,” Dalai added. “So they would serve as a focus on which bacteria would grow fairly rapidly. The dampness of the object and the shower environment — as well as the fact that these objects were used to scrub bacteria off the body — make them ideal breeding grounds for bacteria.”\nCotton washcloths are a better alternative to plastic-based bath accessories, said board-certified dermatologist Melanie Palm. They are washable and are less likely to harbor the virus, making them a good tool to use throughout the pandemic.\n“Cloth is much less likely to harbor the virus for long periods of time, as this material dries the virus out more quickly than other surfaces,” Palm told HuffPost. “Just remember that tighter weaves will dry slower, while open weaves more quickly.”\nBath Accessories Can Host Other Bacteria And Germs\nStanford’s Dalai said that he’s more concerned with the growth of bacteria and fungi on bath accessories than the growth of the coronavirus.\n“These items are literally bacteria traps ― in that we are using them to remove bacteria from our bodies,” Dalai told HuffPost. “Loofahs and sponges will trap bodily bacteria such as staph, strep and other organisms, such as E.coli.”\nThese organisms are normal flora of the human skin, and a limited quantity of them on bath sponges and loofahs is to be expected, Dalai said. But “when using a bath sponge that is saturated with bacteria and is not cleaned properly, there is a potential for them to be reintroduced into cuts and hair follicles, possibly causing irritation or superficial infections,” he added.\nTo ensure that your loofah or sponge is safe to use, Dalai advised looking out for warning signs of bacterial colonization: a musty odor or visible growth of colonies, which can look white-yellow, brown or black in color and have a creamy or spore-like appearance.\nClean Your Bath Accessories Carefully\nTo thoroughly clean your bath accessories, Allawh advises washing sponges, poufs and loofahs in either antibacterial soap or vinegar after each use. A diluted bleach solution can be equally effective if your supplies are limited, she added.\n“I recommend thoroughly washing it after each shower/use with antibacterial soap (i.e., dish soap) or vinegar (four to five tablespoons of vinegar — apple cider or white vinegar — in one to two cups of water),” Allawh said. “If you don’t have either at home, you can use diluted bleach and soak the loofah for at least five minutes.”\nTypically, Allawh recommends washing your bath accessories every three to four weeks. “In this current COVID-19 climate, I recommend washing with the above instructions after every use,” she said.\nAfter cleaning the bath accessory, hang it in a cool place so that it can thoroughly dry, Allawh said. Leaving it in the moist, steamy shower may further promote bacteria and mold growth), she added.\nChange Your Bath Accessories Often\nGoing forward, you should replace shower poufs and loofahs regularly, depending how often you use them, Palm advised.\n“Loofahs and shower puffs are likely best replaced every two to four months, depending on frequency of usage,” Palm said.\nStock up on antibacterial bath accessories to get you through the worst of quarantine, Allawh said. She pointed to one that you can get online and is less likely to harbor bacteria, yeast and mold.\n“For those interested in lathering up and exfoliating during each shower, an antibacterial bath accessory that I recommend is the BOIE Body Scrubber,” which you can buy for $10, Allawh said. “It is made of antibacterial material that can be easily, thoroughly cleaned and dried, less likely to harbor bacteria, yeast and mold.”\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/coronavirus-replace-shower-washcloth-loofah-bath-covid-19_l_5ea6fe56c5b6dd3f90887a41"}