{"authors": ["Denise Royal"], "date_download": "2020-05-04 16:20:08", "date_modify": "2020-05-04 16:20:08", "date_publish": "2020-04-05 10:02:01", "description": "To fill the void in this new era of social distancing, Alcoholics Anonymous has, out of necessity, brought its gatherings online.", "filename": "2020_04_05_us_alcoholics-anonymous-coronavirus-online_index_1588609208.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403111556-alcoholics-anonymous-coronavirus-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_us_alcoholics-anonymous-coronavirus-online_index_1588609208.html", "title": "Alcoholics Anonymous members find support during coronavirus pandemic", "title_page": "Alcoholics Anonymous members find support during coronavirus pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Anthony B. used to get to his Alcoholics Anonymous meetings early enough to set up the folding chairs synonymous with the gatherings.\nFor Anthony it was a small way to contribute and also spend extra time with those like himself in recovery.\n\"After we set up the chairs, we grab a bite to eat and catch up,\" he said. \"The meeting before the meeting is another way that we support each other.\"\nWhen social distancing requirements during the coronavirus crisis took those meetings away, Anthony was concerned about the potential fallout.\n\"Our gatherings are about a lot more than not drinking,\" he said. \"When they stopped, I worried about losing my connections . . . . Attending meetings helps to balance me. I wasn't sure what I was going to do. Like most alcoholics, I don't like change.\"\nAnthony's concerns are well-founded: Social contact is a vital part of support and treatment for those in recovery. Alcoholics Anonymous (AA) meetings offer an alternative to a common problem — isolation — a struggle for many who deal with substance abuse.\nTo fill the void in this new era of social distancing, Alcoholics Anonymous has, out of necessity, brought its gatherings online through meeting host websites like Zoom . Anthony has traded in the folding chair for his sofa at home and found a vital lifeline.\n\"The online meetings provide a connection,\" Anthony said. \"There is still a sense of community. It doesn't compare to the energy at an in-person meeting. When I'm at those meetings, I can feel God in the room. But for now, these online meetings are a godsend.\"\nAddressing concerns about security and anonymity\nZoom's free plan allows for an unlimited number of meetings and hosting for up to 100 participants for 40 minutes. The video conference app and others like it were new to many users looking for AA meetings.\n\"We believe every business has the social responsibility to contribute back to the community and to society, and it's critically important during times of crisis,\" said Zoom founder and CEO Eric Yuan in a recent blog post.\nSome AA members greeted the online alternatives with skepticism, said Lawrence R., who hosts a nightly meeting from northern California.\n\"Some people started out being worried,\" he said. \"Their first thought was these things cannot possibly substitute for in-person meetings.\"\nLawrence begins each meeting by addressing some concerns, mostly about security and anonymity.\n\"I always start the meetings by saying there is inherently less privacy in these online meetings,\" he said. \"I go into detail about the different settings. I tell everyone here's how you can change your name, or here's how you turn your video off. If you want to be totally anonymous, just dial in— then all anybody can see is your phone number.\"\nThe FBI has issued a warning about so-called \"Zoombombing,\" where hackers or trolls hijack a public video call. The agency cited examples of users entering meetings or virtual classrooms to shout profanities and share pornography.\nA spokesperson for Zoom told CNN in an email on Thursday that the company \"appreciates all efforts to raise awareness around how to best prevent these kinds of attacks. The company said it began \"actively educating users on how they can protect their meetings and help prevent incidents of harassment\" on March 20.\nLawrence said he's added a sort of \"digital bouncer\" to help police the chats in the meetings he hosts.\n\"On one hand, you want we want a to be open and welcoming to newcomers, and available to people who are calling in from all over the country,\" he said. \"On the other hand, you know, we want to protect our members.\"\nIt's vital to have an emotional connection\nThe goal of Alcoholics Anonymous is to help its more than two million members achieve and maintain sobriety. Recovery groups meet regularly and abide by a program of 12 steps that focus on self-reflection and finding a higher power to deal with any desire to return to drinking, and the lifestyle that accompanies it.\nAA groups are diverse. The meetings vary from being open to everyone to niche groups consisting of men-only, women-only, LGBTQ, and so on.\nAnthony's first online experience hit a few speed bumps. The organizer had to figure out how to mute the participants but still maintain the feeling of a traditional AA meeting. Once the technical issues were resolved, attendees said prayer and continued. Then, the chairperson announced that it was a gathering for a transgender-specific group.\n\"I wasn't asked to leave, but I don't identify as trans so it was politely suggested that I attend a different meeting,\" he said. \"So, I did.\"\nSome mental health professionals warn that this public health emergency poses a serious threat to people for whom social contact is a crucial element of support and treatment. Social distancing and isolation can be triggers for people with mental health issues. There's also the fear of contracting the coronavirus or losing one's job.\nHaving an emotional connection is vital now, says Titus Tucker, an assistant clinical director at a health care facility in South Florida that specializes in addictive behaviors. And technology is filling a void.\n\"When people access a platform like Zoom for a meeting, it's an extension of what they're learning in treatment,\" he says. \"Outside of treatment, it speaks to what some people know best—communicating through a device like texting, Skyping, or FaceTiming. Either way, if someone is feeling isolated or lonely, they have a way to connect.\"\nLawrence said the online meetings are convenient for moms who struggle with finding child care, as well as people who feel under the weather and who, because of fears about coronavirus, don't want to chance leaving their homes. He also says people share their personal information and stories just like they would at a traditional meeting.\nSome members want the online meetings to continue once life returns to normal.\n\"I get a lot of feedback about the advantages to this,\" Lawrence said. \"Many people want to keep this going, even when we return to our in-person meetings.\"", "url": "https://www.cnn.com/2020/04/05/us/alcoholics-anonymous-coronavirus-online/index.html"}