{"authors": ["Senior Lifestyle Reporter"], "date_download": "2020-05-04 20:14:04", "date_modify": "2020-05-04 20:14:04", "date_publish": "2020-04-28 00:08:31", "description": "These therapist-endorsed conversation starters can help your loved ones open up about how they're feeling amid the COVID-19 pandemic and quarantine.", "filename": "entry_questions-ask-family-friends-social-distancing_l_5ea72803c5b67fb409b8da79_1588623244.html", "image_url": "https://img.huffingtonpost.com/asset/5ea73b12220000d60b827bc9.jpeg?cache=0SdU638EfM&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_questions-ask-family-friends-social-distancing_l_5ea72803c5b67fb409b8da79_1588623244.html", "title": "6 Questions To Ask Your Family And Friends While Social Distancing", "title_page": "6 Questions To Ask Your Family And Friends While Social Distancing | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "“Encouraging family and friends to open up can be as simple as opening up yourself! Instead of focusing on your personal highlight reel, think of the personal struggles you’re facing and share with others. When you open yourself up and allow yourself to be seen, you create a safe container for others to share their own vulnerabilities.\nWhen asking questions, try relaying a personal struggle to segue into the question. For example, you might say something like, ‘I have been having a really tough time sticking to a schedule during quarantine. Have you been experiencing this too, or do you have any tips?’ Or you could try saying, ‘I’m going through waves of emotion through this experience. How have you been feeling?’” ― Danielle Massi, a marriage and family therapist in Philadelphia.\n“How are you coping with your fears of catching the virus?”\n“Facetime with friends and close families give you a chance to open up about concerns you may have compartmentalized during the day. Be aware of your feelings, especially your fears. Share the sensible steps you’re taking to protect yourself and others in the prescribed ways, like physical distancing, wearing a mask in public and often washing your hands for 20 seconds with soap\n“Follow up with questions about how your friend or family member is coping: You might ask, ’Are you noticing yourself acting differently in daily life, like doing more emotional eating, drinking, or arguing with your partner?′ In these stressful times, some people may be doing more binge drinking, emotional eating or taking out their frustrations about being sheltered in place by picking fights with their spouse or whoever they live with.” ― Marcia Naomi Berger, a psychotherapist and the author of Marriage Meetings for Lasting Love: 30 Minutes a Week to the Relationship You’ve Always Wanted.\n“How are you really doing?”\n“My suggestion is to lay the cards on the table and just dive in. ‘How are you really? I want to know how this has been for you.’ Let your loved one know that you are interested in their actual experience and not just the pleasantries of the typical, ‘How are you?’ ‘I’m good’ exchange we’ve grown accustomed to can go a long way.” ― Kennedy\n“What was the highlight of your day?”\n“Consider asking about positive changes they’ve noticed, or something beautiful or interesting they’ve seen or learned recently. Open up the sharing conversation on a positive or neutral note. Then if you’d like to discuss something tougher, it’s easier from that stepping stone. If you start with the hard stuff, it can feel invasive, condescending or surprising to suddenly start asking them especially if it’s not a typical part of your dynamic to ask probing questions.” ― Rachel Kazez, a Chicago therapist and founder of All Along, a program that helps people understand mental health and find therapy\n“How are you managing day-to-day?” “This question essentially means: how are you coping? I ask it when I went to see if anything significant stands out for my family and close friends. Then you can even can ask, ‘What have the last 24 hours been like for you?’ This expands on question one. “Just acknowledging that people everywhere are struggling at this time and it’s OK to feel sad or down is helpful. It’s OK not to have a lot of motivation to do things. Asking questions like this helps us deal with the emotional roller coaster that we’re all experiencing right now.” ― Kristin Davin, a psychologist in New York City\n“What are some of the things you’ve been doing to entertain yourself or keep busy?”\n“Add some encouragement to the conversation! Ask: ‘What are some of the things you have been doing to entertain yourself or keep busy?’ Focus on some of the things we can do at a time when there is so much we can’t do.” ― Kennedy", "url": "https://www.huffpost.com/entry/questions-ask-family-friends-social-distancing_l_5ea72803c5b67fb409b8da79"}