{"authors": ["Matt Egan", "Cnn Business"], "date_download": "2020-05-04 16:05:51", "date_modify": "2020-05-04 16:05:51", "date_publish": "2020-04-02 10:24:55", "description": "The first domino in the oil industry has fallen. Whiting Petroleum, once a rising star in the shale industry, filed for Chapter 11 protection Wednesday, marking the first of what will almost surely be a series of major oil bankruptcies.", "filename": "2020_04_02_business_oil-crash-bankruptcies-whiting_index_1588608351.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401120222-whiting-oil-and-gas-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_business_oil-crash-bankruptcies-whiting_index_1588608351.html", "title": "A wave of oil bankruptcies is on the way", "title_page": "A wave of oil bankruptcies is on the way - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) The first domino in the oil industry has fallen.\nWhiting Petroleum, once a rising star in the shale industry, filed for Chapter 11 protection Wednesday. The oil driller survived for years at $50-a-barrel oil. But the recent collapse to $20 proved unbearable, sparking the first major oil bankruptcy of the current crisis.\nsurely won't be the last. The coronavirus pandemic has crushed the oil industry, setting off a swift and unprecedented decline in demand for gasoline, jet fuel and diesel. That pain has been amplified by an epic price war between Saudi Arabia and Russia, a mountain of debt on oil company balance sheets and the virtual shutdown of the junk bond market.\nThose factors will almost surely set off a spike in oil patch bankruptcies in the coming months. And unlike the 2014-2016 oil crash, some of thosecompanies may not survive.\n\"There will be a wave of bankruptcy filings this year,\" said Spencer Cutter, credit analyst at Bloomberg Intelligence.\nNearly 100 US oil and gas producers could file for Chapter 11 over the next year, according to Buddy Clark, co-chair of the energy practice at Houston law firm Haynes and Boone.\nThat would nearly match the total number of bankruptcies in 2015 and 2016 combined when oil prices crashed to $26 a barrel.\n\"It's not just the guys that levered up in the mad rush of late 2010 to 2014 and put on way too much debt. Some of these companies are well structured,\" Clark said.\n30% of junk energy bonds could default\nThe obvious problem for the oil industry is US oil prices have plunged by two-thirds since early January to 18-year lows. March was crude's worst month since oil futures started trading on NYMEX in 1983.\n\"In any business, if the sale price of a product falls 70% overnight, even companies with the best plans will struggle to overcome that,\" said Clark.\nIt's not just that prices have collapsed. At $20 a barrel they are now sharply below breakeven levels across every single major oil-producing region in the United States.\nAmerica's energy boom, require an average of $49 a barrel to profitably drill, according to a survey by the Even companies in the Permian Basin, the low-cost oilfield in West Texas that has ledAmerica's energy boom, require an average of $49 a barrel to profitably drill, according to a survey by the Dallas Federal Reserve.\nAt $40 a barrel, only 15% of oil companies would survive for a year or less, the Dallas Fed survey found. Another 24% of oil companies might be able to hold out for one to two years.\n\"Many companies will be in trouble in this unprofitable environment,\" analysts at Bank of America wrote in a note to clients Tuesday.\nDefaults on high-yield energy bonds could potentially spike to 30%, they added.\nDenver-based Whiting might not be a household name, but it was valued at nearly $5 billion in late 2018. Whiting focuses on drilling for oil in the Bakken, the high-cost North Dakota oilfield that thrived at $100 oil in the last decade but has struggled mightily since.\n\"At sub-$60 oil prices, it became a slow bleed for Whiting. There was just no way they would survive with oil prices below $45 a barrel,\" said Cutter, the Bloomberg Intelligence analyst.\nWhiting's bankruptcy filing lists between $1 billion and $10 billion of debt. The company said it has reached a deal with creditors to exchange $2.2 billion of debt for equity.\nMoney-losing oil companies can't refinance debt\nOil companies aren't just bleeding cash. They have a mountain of debt coming due, and limited ability to refinance it.\nMore than perhaps any other industry, oil benefited from a decade of extremely low borrowing costs and insatiable demand for yield among investors. The junk bond market was wide open, even to the riskiest oil companies. Cheap financing helped make the United States the world's leading oil producer.\nEven before this financial catastrophe investors were growing frustrated with the oil industry's weak financial performance. Over the last decade, the energy sector of the S&P 500 was the worst performer -- by far. Wall Street demanded oil companies live within their means by spending less and paying down debt.\nAnd now that cash-strapped oil companies need to refinance their debt, the junk bond market is closed. No energy junk bonds were issued anywhere, to any company, in February and March, according to Dealogic.\nNot surprisingly, investors have no interest in providing more capital to money-losing firms. \"That is going to force a lot of these companies over the edge,\" said Cutter.\nRed lights flashing\nThe financial markets are signaling that more bankruptcies are coming.\nThe percentage of oil and gas companies with distressed credit ratios spiked from about 25% at the end of last year to 94% in mid-March, according to S&P Global Ratings.\nBond yields in the oil sector have also spiked well above ultra-safe Treasuries. That spread has more than tripled since the beginning of the year, to 11 percentage points, according to S&P. Spreads in the oil sector are nearly twice as high as the next-closest industry (metals and mining) and they have surpassed the highs of the 2008 financial crisis.\n\"The entire sector is distressed,\" Cutter said.\nA number of other large companies are likely to fail in the oil sector in coming months.\nChesapeake Energy CHK California Resources CRC Denbury Resources DNR Ultra Petroleum UPLC Oasis Petroleum OAS Analysts say the obvious candidates are companies whose bonds are flashing red lights, includingand\nDevon Energy DVN Hess HES Continental Resources CLR Even oil companies that recently had investment-grade credit ratings could come under pressure, includingand former Bakken darling\nOccidental Petroleum OXY Even, the shale giant backed by legendary investor Warren Buffett, is grappling with heavy debt incurred by its ill-timed takeover last year of Anadarko Petroleum . Occidental's debt rating suffered a rare triple downgrade by Fitch Ratings last month.\nSurvival of the fittest\nThe key to surviving this downturn will be how long oil prices stay below $40 a barrel.\nA rapid rally, perhaps driven by a V-shaped economic recovery, would allow many struggling oil companies to get back on their feet.\nBut a sustained downturn in prices will be catastrophic for many oil companies. Unlike the 2014-2016 oil crash, some oil companies that file for Chapter 11 may not attract the financing needed to emerge from bankruptcy.\nIf that happens, the oil assets won't die. They would get scooped up at basement prices by whatever oil companies are left standing.\nThe silver lining, if there is one, is that the latest oil crash could bring about a much-needed cleansing in a terribly inefficient industry.\n\"There have been too many weak companies hanging on for too long,\" said Jeff Wyll, senior energy analyst at Neuberger Berman.\nIt sounds oxymoronic, but a wave of bankruptcies could be just what's needed for America's oil industry to emerge stronger and more resilient.", "url": "https://www.cnn.com/2020/04/02/business/oil-crash-bankruptcies-whiting/index.html"}