{"authors": ["Opinion Shai Held"], "date_download": "2020-05-04 16:25:41", "date_modify": "2020-05-04 16:25:41", "date_publish": "2020-04-07 09:59:02", "description": "Rabbi Shai Held writes that celebrating Passover, which is about bringing together families, will sadly have to be observed apart. But times of immense difficulty can also be times of profound growth. Let's try, in the face of fear and anxiety, to let our vulnerability help us to love more fully.", "filename": "2020_04_07_opinions_passove_9e5786712767530ea089bf1f15fb6462_index_1588609541.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403082820-20200403-socially-distanced-seder-gfx-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_opinions_passove_9e5786712767530ea089bf1f15fb6462_index_1588609541.html", "title": "Celebrating Passover during a modern-day plague", "title_page": "Celebrating Passover during a modern-day plague (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Rabbi Shai Held is president and dean of the Hadar Institute , a center for traditional, egalitarian Jewish learning in New York City. The views expressed in this commentary are his own. View more opinion on CNN.\n(CNN) In just a few days, Jews around the world will celebrate Passover. At the Seder, they'll recall -- and re-enact -- God's liberation of the Israelite slaves from their Egyptian tormentors.\nThe timing is painfully ironic. Passover, after all, is about miraculous deliverance from woe -- but this year we'll be marking it in the very midst of coronavirus, a brutal plague whose end is nowhere in sight.\nWhat makes it all the more painful is that we will be forced to celebrate it apart. Passover is, by design, intergenerational. Many of us have been shaped by memories of multiple generations sitting around the same table, sharing songs, traditions, memories, melodies and foods.\nMore than that, Passover is intended to be about welcoming the stranger. \"Let all who are hungry come and eat,\" we proclaim as the Seder gets underway. We are meant to open our homes to others, and in so doing, to open our hearts to them, too.\nAnd yet this year we are forced to remain apart. There is something profoundly sad about all this, and the sense of loss many of us feel is palpable.\nBut perhaps there is something we can learn from all of this.\nThe holiday this moment brings to mind is Sukkot, a time in early fall when Jews traditionally leave their homes and spend a week dwelling in huts built of cloth, wood and/or bamboo. The festival, which serves as a reminder of the journey through the wilderness that followed the Exodus from Egypt, is a time of deep joy. We celebrate the love between God and the Jewish people -- and delight in the mutual faithfulness that has sustained our bond.\nBut Sukkot is also about something else. Dwelling in temporary structures, exposed to the elements, we are reminded in physical, tactile ways of our fragility and vulnerability. We are only flesh and blood; the structures we may be tempted to imagine will always protect us can easily collapse and disappear. Vulnerability is a brute fact of human existence -- there is no escaping it.\nThe Hebrew Bible goes to great lengths to remind the Israelites of how vulnerable and dependent they are. The land of Egypt, which irrigates itself, is not the land of promise; the land of Canaan (modern-day Israel), which depends on rain that does not always come, is the promised land.\nFrom a farmer's perspective, this is quite odd. Wouldn't we prefer the land that reliably and consistently has enough water? God worries that if the Israelites have everything they need, they would be rendered complacent and self-satisfied. God wants them to know that they are dependent. Total autonomy and self-sufficiency are always illusions.\nOf course, the moment we find ourselves in is not Sukkot, and not just because it's a different time of year. Sukkot is a ritual enactment of vulnerability -- but powerful as it can be, it is only a ritual. If it rains too hard, Jewish tradition says we are exempt from dwelling in huts, and we go back into our permanent homes. There is nothing metaphorical about Covid-19 -- the intense threat it represents is with us, stubborn and relentless, no matter where we are.\nSo, it is important to understand that vulnerability is a double-edged sword. It can teach us compassion, but it can also make us hard-hearted and unfeeling. It can expand the circle of our concern to include others who are vulnerable too, but it can also lead us to tighten the circle around ourselves and ignore, or forget, everyone but those closest to us. When we are reminded of just how vulnerable we are, the ultimate moral test is not whether we hold our loved ones close but whether we remember others -- especially those without loved ones to hold them close.\nThe challenge of the moment is to let our shared vulnerability open our hearts to one another. Ideally, in Jewish thought, being ever conscious of our vulnerability yields a sense of gratitude and indebtedness to God, and it also opens the door to genuine care and concern for others.\nAcknowledging our vulnerability enables us to move from pity to compassion. Pity is driven by a sense of superiority -- \"what happened to you could never happen to me.\" But compassion is animated by a sense of shared humanity -- \"what happened to you could happen to any of us.\" Whereas pity is vertical, compassion is horizontal. In showing another person compassion, I reach across to them rather than looking down at them.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nOn Passover, we remember that we were strangers, vulnerable outsiders, in the land of Egypt. That experience is intended to teach us to love and protect the vulnerable among us. This year we will need no reminder of our vulnerability, but we do need to internalize the aspiration: Let your vulnerability teach you love. This is hard work, but there is no ethical and spiritual mandate that matters more -- in general, and all the more so now.\nFor most of us, this Passover will not be easy. We will be separated from people we love, and we will be anxious for those we wish to protect. But times of immense difficulty can also be times of profound growth. Let's try, in the face of real and legitimate fear and anxiety, to let our vulnerability help us to love more fully. Let's open our hearts, even if we cannot open our doors.", "url": "https://www.cnn.com/2020/04/07/opinions/passover-coronavirus-lesson-vulnerability-held/index.html"}