{"authors": ["Kelly Mena"], "date_download": "2020-05-04 16:19:05", "date_modify": "2020-05-04 16:19:05", "date_publish": "2020-04-04 17:45:48", "description": "The coronavirus outbreak has led to near shutdowns of entire states — from schools to restaurants to retailers -- with one major exception: local government.", "filename": "2020_04_04_politics_state-legislatures-coronavirus_index_1588609145.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/131127143713-colorado-state-capitol-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_politics_state-legislatures-coronavirus_index_1588609145.html", "title": "States adjust to governing in the time of coronavirus", "title_page": "States adjust to governing in the time of coronavirus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington, DC (CNN) The coronavirus outbreak has led to near shutdowns of entire states — from schools to restaurants to retailers -- with one major exception: local government.\nThe pandemic has upended the 2020 sessions of state legislatures and forced state lawmakers to move toward innovative forms of conducting \"business as usual\" in a time of an unprecedented health crisis.\nSome have gotten creative about their meeting locations, while others have had to scramble to move to a remote voting system to comply with social distancing guidelines. Others have given up on the 2020 session completely and at least one is fighting for the future of their session in federal court. At least 26 legislatures have postponed their legislative sessions as of March 31, according to the National Conference of State Legislatures\n\"There's definitely been good adaptability in a time no one ever expected,\" Gene Rose, spokesman from NCSL, told CNN. \"This is historic, even in 1918 when we had the Spanish Flu epidemic, state legislators weren't looked at as places of power. But that's definitely changed over the years.\"\nMeeting outside of state capitols\nLast week, the Arkansas' General Assembly met at the nearby University of Arkansas-Little Rock basketball arena. The 100 members of the Arkansas House of Representatives spread out across the 5,600 seat Jack Stevens Center to pass emergency coronavirus funding bills, according to Cecillea Pond-Mayo, spokesperson for the Arkansas House.\n\"The governor asked us to convene for a special session and after looking at our current chamber and accommodating for about 100 members, it was agreed upon by leadership to move it to the nearby arena to accommodate for social distancing,\" Pond-Mayo said.\nDubbed the \"Extraordinary Session of 2020,\" the meeting marked the first time Arkansas lawmakers held a legislative session at a non-government site and only the second time in recent history that the Arkansas House of Representatives has met outside the Capitol building. The last time was under much different circumstances: About six years ago, the House members met at the Old State House while the current Capitol building was undergoing construction, Pond-Mayo told CNN.\nArkansas lawmakers were also given \"health screenings\" in the form of temperature checks and asked about their travel within the last 14 days, according to Pond-Mayo.\nArkansas Speaker of the House Matthew Shepherd tweeted out an image of the day's proceedings: \"The House and Senate came together in a short period of time and in a unified voice let Arkansans know we are taking action to address this crisis.\"\nMove to remote voting\nOn Tuesday night, the New York State Senate held its first and \"unprecendented\" remote session, in which the legislative body began to tackle the state budget. The Senate has a statutory requirement to pass a state budget by April 1, which came in on time and was signed by the governor \"as usual\", according to Senate spokesperson Gary Ginsburg.\n\"During these unprecedented times, our state government requires continuity and must provide leadership and action,\" said Senate Majority Leader Andrea Stewart-Cousins ahead of the historic vote. \"The decision to authorize limited remote voting will ensure government continues to function and do the work New Yorkers expect of us.\"\nThe normally packed Capitol chamber was sparsely attended, with only a few legislators present out of the 63 member body. The new remote voting procedure option came just a day after the chamber marked its first confirmed case of Covid-19. Sen. James L. Seward, a Republican, announced on Monday that he and his wife had tested positive for the virus and were experiencing mild symptoms.\nThe New York state Assembly is expected to also move to a similar system later this week. At least four members of the assembly have tested positive for the novel coronavirus.\nState legislatures in South Dakota and Vermont have also switched to remote voting, allowing lawmakers to participate in crucial votes from their homes. The Utah legislature is also planning for a \"virtual\" special session.\nMatthew Romei, chief of the Vermont Capitol Police, told CNN that the state capitol building has been a \"ghost town the last couple of days.\"\n\"Everybody's meeting by Zoom , everybody's learned to get onto that Zoom meeting. It's definitely a shift,\" Romei said. \"I don't think anyone has seen anything like this. ... We are a tech-heavy society, and maybe one of the last bastions of that has been in the state legislature.\"\n\"Are we doing things we don't normally do? Sure, absolutely. But, really what we are concentrating on right now is making sure the state legislature can do their job, whatever that takes,\" he added.\nCourt battle over future of legislative session\nIn at least one state, the postponement of the legislative session spurred lawsuits. The Colorado state Assembly, split down party lines, filed opposing lawsuits in late March over the amount of time lawmakers would have left at the Capitol once back in session. The state Supreme Court eventually sided with Democrats on the matter this week.\nhave come to be interpreted by both sides to mean 120 \"consecutive and continuous days,\" according to a The state constitution requires the legislature to conclude its work 120 days after convening. Those dayshave come to be interpreted by both sides to mean 120 \"consecutive and continuous days,\" according to a joint bill that suspended the 2020 session.\nThe Colorado Assembly first convened for the 2020 legislative session on January 8, according to the legislative calendar, with an expected end date of May 6. However, on May 16 the assembly passed a joint resolution to suspend the session for two weeks, until March 30.\naccording to the Democratic court filing. In response, Democratic lawmakers, who hold a majority in both chambers of state legislature -- House and Senate -- argued that the deadline no longer applied in the midst of a \"declared disaster emergency,\" and that the counting of days would begin again once the assembly returned to the Capitol,\nRepublicans, on the other hand, argued that the May 6 deadline stands and that such a change in the way in which \"working days\" are counted violates the state constitution, according to their filing . As such, the Republicans noted that the governor has the authority to call a special legislative session which would convene the assembly after the deadline.\nGov. Jared Polis and Lt. Gov. Dianne Primavera, both Democrats, in a separate brief , sided with the Democratic majority, noting in their filing that the state constitution has a provision that allows for exceptions for disruptions of the regular session, which include a \"public health disaster outside of the General Assembly's control that causes widespread infections -- such as COVID-19.\"\nThe Colorado Supreme Court on Wednesday ruled that the state legislative session no longer needs to end on May 6, saying in the ruling that \"'one hundred twenty calendar days' is ambiguous as to whether those calendar days must be counted consecutively.\" The ruling went onto to note that a special session would be \"inadequate\" and is a narrow function compared to the broader, more general purpose of the legislature's regular session.\"\nColorado's legislative session remains suspended, according to Democratic Speaker of the House KC Becker, who told Colorado's public radio station that lawmakers are still in talks about the right day to return.\n\"This is an unprecedented time that calls for thoughtful action. We will continue looking at the data and talking to public health experts to determine when it is safe to come back to the Capitol. Once we do return, we'll need everyone at the table to solve our most difficult challenges,\" Becker told CPR.", "url": "https://www.cnn.com/2020/04/04/politics/state-legislatures-coronavirus/index.html"}