{"authors": ["Opinion Jill Filipovic"], "date_download": "2020-05-04 16:52:18", "date_modify": "2020-05-04 16:52:18", "date_publish": "2020-04-08 03:57:47", "description": "Jill Filipovic writes that Donald Trump demotion of Glenn Fine, the man tapped last month to independently oversee spending on the $2 trillion federal coronavirus stimulus package, shows the President \"exploiting the pandemic to sack anyone who might point out just how terribly he has mangled the response.\"", "filename": "2020_04_07_opinions_trump-c_91a2ea023594292ad379cd8a3f5388ab_index_1588611138.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407193623-04-coronavirus-briefing-0407-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_opinions_trump-c_91a2ea023594292ad379cd8a3f5388ab_index_1588611138.html", "title": "Trump is desperately seeking to avoid blame", "title_page": "Trump is desperately seeking to avoid blame - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Jill Filipovic is a journalist based in New York and author of the book \" The H-Spot: The Feminist Pursuit of Happiness .\" Follow her on Twitter . The opinions expressed in this commentary are solely her own. View more opinion articles on CNN\n(CNN) President Donald Trump has royally screwed up the federal government's coronavirus response, and he knows it. And he's doing what he always does: Instead of fixing any of the many problems he's caused, he's trying to weasel his way out of blame and doing all he can to dodge oversight and responsibility .\nOn Tuesday, Trump demoted Glenn Fine, the man tapped last month to independently oversee spending on the $2 trillion federal coronavirus stimulus package. Because Fine, who was the acting inspector general from the Defense Department, was removed from that role , he also lost his chairmanship of the Pandemic Response Accountability Committee (only inspectors general are eligible to be on that committee). No explanation was offered.\nThis isn't just about the specter of the President potentially attempting to assert free rein over the outlay of taxpayer-funded relief. American lives are at stake. The health of our economy -- not just Wall Street winnings, but the livelihoods of tens of millions of Americans, and our basic ability to put food on our tables and care for our families -- is at risk.\nFine's role -- the one that will now be assumed in an \"acting\" capacity by Sean W. O'Donnell, who will do this along with his other job as Environmental Protection Agency Inspector General -- was to make sure that an enormous stimulus package was being spent as allocated, with minimal waste and no abuse or corruption.\nIt's disturbing that Americans now may have to worry that our President and his cronies could turn a relief package into a vehicle for self-dealing and a sweetheart deal for the rich, but here we are.\nFine had been picked by a group of independent federal inspectors general who determined he would do the best job. According to The New York Times , the former Justice Department inspector general \"earned a reputation for aggression and independence in scrutinizing the FBI's use of surveillance and other law enforcement powers in the years after the September 11, 2001, attacks.\"\nBut in Trumpland, such competence and expertise aren't a requirement but a barrier, especially when it comes to oversight duties. The incompetent man at the top is desperate not to have his inadequacy revealed.\nFine's head is just the latest to roll as the President has been systematically guillotining watchdogs across the federal government. In a transparently vindictive move, he also removed Michael Atkinson last Friday as the Intelligence Community inspector general. Atkinson had done his job in informing Congress about the whistleblower complaint that led to Trump's impeachment. Trump doesn't like being held responsible for his actions, so Atkinson was out\nOn Monday Trump also attacked Health and Human Services Inspector General Christi Grimm for doing her job. Grimm's office had reported what Americans already know: That there are widespread delays in testing for coronavirus, and serious supply shortages at the nation's hospitals. None of this is news to anyone. But Trump nonetheless tweeted that the report was \"Another Fake Dossier!\"\nTrump seems to fancy himself more of a king than a President. The same man who once pledged to \"drain the swamp\" seems to love mucking around in it, and attacks anyone who tries to clean it up.\nNo administration is perfect -- remember the Obamacare rollout debacle ? Nobody expects error-free governance, but good leaders are able to deal with mistakes, swiftly correct them, and accept independent oversight. Anything else isn't democracy, it's dictatorship. Americans in urgent need of relief during and after the pandemic need to see this stimulus plan wisely and efficiently dispatched.\nThere are about 400,000 confirmed coronavirus cases and more than 12,800 dead -- and those numbers may be significant underestimates. Without effective oversight -- and there is no reason to believe that Glenn Fine would not have provided it -- it will be impossible to tell if the stimulus package is being used efficiently to help as many people as possible. Without immediate, unflinching feedback on how Health and Human Services is managing this crisis, it will be harder to know the ways to improve the stimulus in real time and stem the tide of disease, death and financial ruin.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nDonald Trump could not care less about the health and well-being of the American people. He has no attachment to good governance, professional ethics, or public service. He doesn't like independent watchdogs because they're inconvenient for him ; he prefers lapdogs. And so he is exploiting the pandemic to sack anyone who might point out just how terribly he has mangled the response.\nThe result won't just be a swampier and more corrupt White House. We Americans may pay with our lives.", "url": "https://www.cnn.com/2020/04/07/opinions/trump-covid-19-stimulus-glenn-fine-filipovic/index.html"}