{"authors": [], "date_download": "2020-05-04 20:14:49", "date_modify": "2020-05-04 20:14:49", "date_publish": "2020-04-08 14:33:11", "description": "INDIANAPOLIS (AP) — Thirty more Indiana residents have died from COVID-19, pushing the state’s death toll past 200, as its confirmed coronavirus cases neared 6,000, state health officials said...", "filename": "_ff89cfd7c230bc562f2f7bdb7bb94df3_1588623289.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ff89cfd7c230bc562f2f7bdb7bb94df3_1588623289.html", "title": "30 more COVID-19 deaths in Indiana, death toll rises to 203", "title_page": "30 more COVID-19 deaths in Indiana, death toll rises to 203", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "INDIANAPOLIS (AP) — Thirty more Indiana residents have died from COVID-19, pushing the state’s death toll past 200, as its confirmed coronavirus cases neared 6,000, state health officials said Wednesday.\nThe Indiana State Department of Health reported the state’s coronavirus death toll has risen to 203. Wednesday’s tally was the second highest after 34 deaths were reported Tuesday. The department has said the deaths it reports each day occur over multiple days.\nThe agency also said an additional 439 Indiana residents have COVID-19, the disease caused by the virus. That boosts Indiana’s confirmed cases to 5,943 following corrections to the previous day’s total.\nMarion County, the home of Indianapolis, again had the most new COVID-19 cases, at 151, raising its total to 2,290 — or about 39% of Indiana’s total. Northwestern Indiana’s Lake County had 43 new cases, and six other Indiana counties had more than 10 new confirmed cases.\nTHE LATEST:\nIndiana has received 15 point-of-care testing machines for the COVID-19 virus that will enable testing “in a period of about 15 to 30 minutes,” said Indiana Health Commissioner Dr. Kristina Box.\nSo far, Indiana has received only enough cartridges to test about 124 people with the machines, but is expecting more, Box said Wednesday during a news briefing with Gov. Eric Holcomb.\nEMS SERVICES:\nDr. Michael Kaufmann, state EMS medical director with the Indiana Department of Homeland Security, said 75% of EMS provider agencies have adequate levels of personal protective equipment.\nHolcomb said he signed an executive order Tuesday that allows retired EMS personnel to return to service.\nFEDERAL FUNDING:\nAlso Wednesday, the U.S. Department of Health and Human Services announced that it had awarded 28 Indiana health centers nearly $23.8 million to help them respond to the pandemic. The health centers can use the funding for efforts that include maintaining or increasing staffing levels to address the coronavirus and preventing, diagnosing and treating COVID-19.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia.", "url": "https://apnews.com/ff89cfd7c230bc562f2f7bdb7bb94df3"}