{"authors": ["Christopher Sherman", "Carlos Rodríguez"], "date_download": "2020-05-04 20:08:25", "date_modify": "2020-05-04 20:08:25", "date_publish": "2020-04-06 19:04:26", "description": "MEXICO CITY (AP) — Mexico President Andrés Manuel López Obrador promised Monday to stick with his modest economic recovery plan after the country’s main business groups reacted negatively to the...", "filename": "_3847127753e8f8668688d0cd9dfdc0c7_1588622905.html", "image_url": "https://storage.googleapis.com/afs-prod/media/be7d7a376b45432e9556f1a365b7a9ea/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3847127753e8f8668688d0cd9dfdc0c7_1588622905.html", "title": "Mexico president sticks to modest economic recovery plan", "title_page": "Mexico president sticks to modest economic recovery plan", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Mexican President Andres Manuel Lopez Obrador stands at attention at the National Palace in Mexico City, Sunday, April 5, 2020. López Obrador spoke to the nation about his economic recovery plan. Mexico's government has broadened its shutdown of \"non essential activities,\" and prohibited gatherings of more than 50 people as a way to help slow down the spread of COVID-19. The one-month emergency measures will be in effect from March 30 to April 30. (AP Photo/Eduardo Verdugo)\nMexican President Andres Manuel Lopez Obrador stands at attention at the National Palace in Mexico City, Sunday, April 5, 2020. López Obrador spoke to the nation about his economic recovery plan. Mexico's government has broadened its shutdown of \"non essential activities,\" and prohibited gatherings of more than 50 people as a way to help slow down the spread of COVID-19. The one-month emergency measures will be in effect from March 30 to April 30. (AP Photo/Eduardo Verdugo)\nMEXICO CITY (AP) — Mexico President Andrés Manuel López Obrador promised Monday to stick with his modest economic recovery plan after the country’s main business groups reacted negatively to the proposal, which would expand his signature social programs and tighten government austerity measures in the face of economic havoc wrought by Covid-19.\nUnlike the United States’ $2 trillion economic stimulus package to help the country weather the pandemic’s effects, Mexico will increase some public investment, but López Obrador said in a speech Sunday evening he would avoid public debt.\n“Some said that the president just gave a general outline and that this week the Treasury secretary is going to detail and break down the measures, but no, there isn’t anything else, it’s just this,” López Obrador said Monday.\nMexico’s Business Coordinating Council (CCE), a national business association, said it welcomed some of the president’s ideas, but ultimately termed his plan “an incomplete response before the great dimensions of the crisis we face.”\nManuel Molano, director of the policy think tank Center for Research in Public Policy, also saw a disconnect between the scope of López Obrador’s proposals and the dimensions of the economic hit Mexico will take.\n“We have a problem where the president is not understanding the magnitude of the crisis,” Molano said. “He’s not understanding the historic moment he’s living and how he would have to react to these events.”\nLópez Obrador on Sunday had outlined measures that focus on Mexico’s poorest citizens and has spoken repeatedly in recent weeks of the needs to protect the informal half of Mexico’s economy and those living day to day.\nHowever, Molano said the president appears to be failing to comprehend the massive loss of jobs that is coming for the formal economy and how the loss of those jobs will affect the poorest Mexicans.\n“Not understanding the tie between the person selling food on the corner and the person who works in a factory and buys that food, really implies there isn’t a real comprehension of how the economy works,” Molano said. López Obrador said he would create 2 million jobs in what remains of the year, a fanciful number for an economy already in technical recession.\nMolano predicted 1 million or more people would become underemployed or work fewer than 20 hours a week and 500,000 to 600,000 people would lose their jobs in the formal economy.\nMexico is still waiting on the pandemic’s full impact. The government has pushed social distancing measures in the past two weeks and has reported more than 2,439 confirmed infections and 125 deaths. Non-essential businesses have been told to keep their employees at home.\nOn Monday, the big Mexican multinational cement company Cemex said it would comply with government instructions and suspend production through April 30. Offiicals in the northern Mexico state of Coahuila said everyone should wear face masks in public areas.\nOn Sunday, López Obrador said top level of government bureaucrats — from undersecretaries on up to him — will have their salaries reduced and give up their annual year-end bonuses.\nMexico’s currency continued to lose value Monday morning, hovering around 25 to the dollar. Banco Base economist Gabriela Siller said the peso was the second most depreciated currency after the Japanese yen “due principally to the decision of Mexico’s executive to not present a plan of counter-cyclical measures,” essentially spending to stimulate the economy.\n“The exchange rate reacted because without counter-cyclical fiscal policy, there is no way to lessen the coronavirus’ hit on the economy,” Siller said in an analysis Monday.\nMolano said López Obrador’s aversion to taking on more public debt is understandable considering Mexico’s checkered past of bailing out failing businesses and the related corruption. But he said that helping small and medium-sized businesses — responsible for most of Mexico’s jobs — would have a greater impact than simply giving small cash transfers to poor families. One of those families that receives $100 is likely to use it to pay down its existing debt, when what’s really necessary is for people to spend that money or even expand their debt to counter the recession, he said.\nBut that’s anathema to López Obrador. “They’re accustomed to those at the top being rescued, to not being charged taxes,” the president said Monday. “Some say,, ‘Where is the plan to reactivate the economy?’ because what they want is a starting flag to once again install corruption.”", "url": "https://apnews.com/3847127753e8f8668688d0cd9dfdc0c7"}