{"authors": ["Nectar Gan"], "date_download": "2020-05-04 16:52:15", "date_modify": "2020-05-04 16:52:15", "date_publish": "2020-04-07 23:43:13", "description": "China has ended its lockdown of Wuhan, the original epicenter of the coronavirus crisis, as the city reemerges from a deadly outbreak that is now raging across the globe.", "filename": "2020_04_07_asia_coronavirus-wuhan-lockdown-lifted-intl-hnk_index_1588611135.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407155858-wuhan-crowds-train-station-0408-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_asia_coronavirus-wuhan-lockdown-lifted-intl-hnk_index_1588611135.html", "title": "Wuhan lockdown lifted as city reemerges from coronavirus crisis", "title_page": "Wuhan lockdown lifted as city reemerges from coronavirus crisis - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) China has ended its lockdown of Wuhan, the original epicenter of the coronavirus crisis , as the city reemerges from a deadly outbreak that is now raging across the globe.\nBut even as Wuhan reopens its borders after 76 days, some restrictions within the city will remain in place, and officials warn that the threat of further infections remains far from over.\nThe metropolis of 11 million, where the coronavirus was first detected in December, had been sealed off from the outside world since January 23 in an unprecedented effort to contain the outbreak.\nOn Wednesday, healthy residents and visitors will finally be allowed to leave Wuhan, the capital of Hubei province, with trains and flights resumed and highway entrances reopened.\nWuhan's railway authority estimated more than 55,000 passengers will leave Wuhan by train Wednesday, with about 40% bound for the Pearl River Delta region, a major manufacturing hub in China, according to state broadcaster CCTV.\nThe easing of travel restrictions on Wuhan is the latest milestone in China's fight against Covid-19. The country reported nearly zero new local infections in recent weeks, leading to similar restrictive measures being lifted for other parts of Hubei province late last month.\nLuo Ping, an epidemic control official in Wuhan, told CCTV Sunday that the lifting of the lockdown marks a \"full restart\" of the city's economic and social activities from their previous \"suspension.\" But he warned the city faces an arduous task preventing imported cases and a recurrence of local infections.\n\"After work and production resumed, the movement of people increased and so did the risk of cross-infections from mass gatherings. Some residents have dropped their guard and don't wear masks when they go on the streets,\" he told the broadcaster.\n\"The reopening of Wuhan does not mean the all-clear, neither does it mean a relaxing of epidemic prevention and control measures (within the city),\" he said.\nPassengers wear facemasks as they form a queue at the Wuhan Wuchang Railway Station in Wuhan, early on April 8, as they prepare to leave the city for the first time in more than ten weeks.\nA city brought to a halt\nWuhan, a sprawling industrial hub on the banks of the Yangtze River, reported more than 50,000 infections and over 2,500 deaths, accounting for 77% of all coronavirus deaths across China, according to the National Health Commission.\nAs the outbreak swept the city, much of Wuhan was brought to a halt by strict epidemic control measures -- some of which would later be introduced throughout the world as the virus spread to more than 200 countries and territories, infecting more than 1.4 million people worldwide\nFor more than two months, public transport in Wuhan was suspended, businesses were shut and millions of residents were confined to their homes and residential communities -- not even allowed to go outside for grocery shopping.\nThe draconian measures apparently worked. By mid-March, the number of new infections had slowed to a trickle from thousands per day at its worst in February. In a major show of confidence, Chinese President Xi Jinping visited Wuhan on March 10, praising the city and its people for being \"heroic.\"\nPeople stand near the Yangtze River in the city of Wuhan, on April 6. In recent weeks, officials have gradually eased some of the lockdown measures, allowing a limited number of residents to leave their residential compounds for a short time.\nA degree of normalcy amid restrictions\nOver the past two weeks, life in Wuhan has gradually gained some semblance of normality.\nResidents with a government-assigned green QR code on their mobile phones -- meaning they're healthy and safe to travel -- have been allowed to go back to work as long as their employers issue them a letter.\nIn residential communities where no new cases have been reported for 14 days, one person per household with a green QR code can leave the compounds two hours per day.\nOn March 25, public buses started to resume service; three days later, underground trains began running too. Businesses and shops gradually reopened, and cars and pedestrians returned to the city's once-deserted streets.\nLuo, the Wuhan official, told CCTV that 10,641 large-scale factories and businesses in the city have reopened as of April 3, accounting for 91.4% of the total.\nOn Monday, there was even a long line outside the Wuhan Blood Center, following a call from the municipal government for citizens to donate their blood, the state-run People's Daily reported. The center received 874 donors in a day, the newspaper said.\nBut officials warned that the restrictions on residential communities will remain in place after the lockdown is lifted on Wednesday.\nTo leave their compounds, residents still need to produce a green QR code and a letter from their employer, Luo said.\n\"For now, we still call on citizens to remain vigilant on the epidemic, don't go out unless it's necessary, and wear masks and properly protect yourself when you do,\" he told CCTV.\nA community volunteer uses her mobile phone near a barrier separating a residential compound in Wuhan on April 2.\nThreat of a return of the virus\nChinese health experts have also urged the public to continue to practice caution.\nZeng Guang, chief epidemiologist with the Chinese Center for Disease Control and Prevention, told the state-run Health Times on Thursday that China had not seen the end of the epidemic.\n\"China is not near the end, but has entered a new stage. With the global epidemic raging, China has not reached the end ,\" he said.\nWith the number of global infections continuing to surge, a growing number of cases have been imported back to China from overseas -- many of them Chinese students and workers eager to return home.\nAs of Tuesday, 698 imported coronavirus cases have been reported by Chinese authorities.\nConcerns have also been growing in recent weeks over asymptomatic carriers.\nIn China, only patients showing symptoms and positive results in nucleic tests are included in the official tally of confirmed cases. Asymptomatic patients who have tested positive are monitored and placed under quarantine until they develop symptoms or turn negative in later tests.\nAmid mounting public concerns, China started to announce a separate daily number of asymptomatic carriers last week. Since then, dozens of new asymptomatic carriers have been found in Wuhan everyday, with 673 currently under medical observation.\n\"Although for now, it seems that the infectiousness of asymptomatic cases are relatively low, they are still infectious and we should be vigilant,\" Yang Jiong, a respiratory expert at the Zhongnan Hospital of Wuhan University, told the Health Times on Monday.\nA man wearing a mask and a blue raincoat holds a portrait as he stands outside the Biandanshan cemetery in Wuhan on March 31.\nBurying the dead\nApart from the easing of travel restrictions, there is another sign that Wuhan is starting to move on from the crisis: It has finally started to bury the dead.\nFor months, residents in Wuhan had been unable to bury their loved ones, as the government banned all funerals and closed cemeteries on January 25. The remains of thousands of people who died both from coronavirus and other causes were stored at funeral homes. Families were told to await government advice on when they could be collected.\nMany would not get to see the body of their loved ones before cremation. To curb the spread of the virus, all bodies of confirmed and suspected coronavirus patients were taken directly from hospitals to funeral homes for cremation, according to a notice issued by the National Health Commission.\nLike everything else in the city, the normal process for dealing with grief was put on hold.\nIn late March, Wuhan residents were finally able to retrieve the ashes of their relatives from funeral homes and find them a resting place, reported the state-run Changjiang Daily, citing an official from the Municipal Civil Affairs Bureau.\nThe news came just ahead of the Ching Ming, also known as Tomb Sweeping Day, the most important Chinese festival for honoring the dead.\nFuneral ceremonies are still not permitted. It is not clear what rituals family members are allowed to observe when laying their loved ones to rest.", "url": "https://www.cnn.com/2020/04/07/asia/coronavirus-wuhan-lockdown-lifted-intl-hnk/index.html"}