{"authors": ["David Sharp"], "date_download": "2020-05-04 20:09:27", "date_modify": "2020-05-04 20:09:27", "date_publish": "2020-04-07 21:20:48", "description": "PORTLAND, Maine (AP) — Maine’s education commissioner recommended that school administrators keep classrooms closed and to continue online learning programs for the rest of the academic...", "filename": "_b4cd04efcab74293b99a32b42b698d9a_1588622967.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c412e5f70ce54f9bbd569eee1c6d6adc/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b4cd04efcab74293b99a32b42b698d9a_1588622967.html", "title": "Maine schools to remain closed; state wants more test kits", "title_page": "Maine schools to remain closed; state wants more test kits", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sam Mawhinney does his best to bring a moments of joy to motorists as spreads his message of love while walking in Cape Elizabeth, Maine, Wednesday, April 8, 2020. Officials announced Wednesday that Maine now has more than 500 confirmed cases of coronavirus. (AP Photo/Robert F. Bukaty)\nSam Mawhinney does his best to bring a moments of joy to motorists as spreads his message of love while walking in Cape Elizabeth, Maine, Wednesday, April 8, 2020. Officials announced Wednesday that Maine now has more than 500 confirmed cases of coronavirus. (AP Photo/Robert F. Bukaty)\nPORTLAND, Maine (AP) — Maine’s education commissioner recommended that school administrators keep classrooms closed and to continue online learning programs for the rest of the academic year.\nCommissioner Pender Makin said her recommendation is based on guidelines from the federal Centers for Disease Control and Prevention, which recommends avoiding in-person instruction for eight to 20 weeks once there is evidence of community spread of the coronavirus.\n“It is difficult to make such a recommendation, recognizing the profound challenge of reinventing public education and the many culminating events and rites of passage that educators and students anticipate all year long,” she wrote in a notice posted online Tuesday evening.\nIn Maine, more than 500 people have tested positive for the virus and 14 people have died from COVID-19, the disease it causes, officials say.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.\n—-\nFEWER TESTS\nThe director of the Maine Center for Disease Control expressed disappointment in the initial allotment of COVID-19 test kits produced by Abbott Laboratories in Scarborough.\nMaine received 15 testing machines but only a handful of testing kits, forcing the state to go “back to the drawing board” to make other testing plans, Dr. Nirav Shah said.\nAbbott is producing 50,000 testing kits daily and will ship more of them out. “We’re prioritizing delivery to outbreak hotspots across the country for front-line health care workers and first responders,” said spokesman John Koval.\n___\nTHANKS, MAINE\nShah used his daily briefing to thank the state’s residents for the sacrifices they’ve made while abiding by the governor’s stay-at-home order.\n“No one thanks you for canceling your child’s birthday party. No one thanks you for postponing your wedding. No one thanks you for not going to the prom. And no one thanks you for fundamentally changing the way you observe and celebrate important religious holidays. But I’d like to change that today. I’d like to thank each and every person in Maine for the personal sacrifices that they’ve made,” he said.\n“Three months ago, who would have ever thought that by canceling a birthday party or a pub crawl or a prom, that you could help save lives? But that’s precisely what your actions, or inactions, have done,” he added.\n___\nDELAYED CHECKS\nUnemployment checks are going to be delayed for tens of thousands of Mainers because of very high call volume, the Maine Department of Labor said.\nThose who filed their weekly claim on Sunday or Monday may not see a payment for 72 hours, the department said.\nThis week, the department begin using an alphabetical call-in schedule after fielding about 23,800 initial unemployment claims for the week before, setting a new weekly record.\nMany people have said they are still having trouble getting through on the phone and on the department’s website.", "url": "https://apnews.com/b4cd04efcab74293b99a32b42b698d9a"}