{"authors": [], "date_download": "2020-05-04 17:02:11", "date_modify": "2020-05-04 17:02:11", "date_publish": "2020-03-20 13:45:17", "description": "In these distressing times, self-care can really step in and make a small difference. So we rounded up some of our favorite soothing — and rewarding — beauty products that get the job done.", "filename": "2020_03_20_cnn-underscored_beauty-products-for-self-care_index_1588611731.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200318140916-selfcarelead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_20_cnn-underscored_beauty-products-for-self-care_index_1588611731.html", "title": "Practice self-care at home with these soothing beauty products", "title_page": "Relaxing beauty products for self-care when you're stuck at home - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "It goes without saying that we're in an unprecedented moment, as we're all trying to practice social distancing to slow the spread of coronavirus. It's so stressful to not be able to see friends, family or leave the house (if you're lucky enough to work from home), and the serious nature of this pandemic weighs heavy on all of us.\n\"Self-care strategies such as baths and face masks can also provide stress relief, and additionally maintaining social connections can be helpful in maintaining a positive mood/reducing feelings of isolation,\" says Elise Hall, a clinical social worker.\nThat's how self-care can really step in and make a small difference. You can take control of some part of your day, and potentially emerge from your social distancing journey with better skin and even a more positive state of mind. So slather on that mask and get on FaceTime or Zoom with your friends for a remote night in, because we've got plenty of time.\nGlow Recipe Avocado Melt Retinol Sleeping Mask ($49; sephora.com)\nGlow Recipe Avocado Melt Retinol Sleeping Mask\nWe love this mask because you can apply a lot for a quick mask, or smooth on a lighter swath for an overnight treatment. Honestly, use it during an afternoon nap, and wake up with nourished, calm skin.\n_______________________________________________________________________________\nLaneige Lip Sleeping Mask ($20; sephora.com)\nLaneige Lip Sleeping Mask\nWhile you're working on your skin while napping, don't forget your lips. This leave-on mask, with over 300,000 likes on Sephora, softens skin and targets fine lines.\n_______________________________________________________________________________\nBliss In the Honey Mega Moisturizing Lavender Honey Mask ($24.99; amazon.com)\nBliss In the Honey Mega Moisturizing Lavender Honey Mask\nTry this moisture bomb of a mask during the day, even if you're logging in to a video meeting with your co-workers. It goes on thin and is barely noticeable — especially if you use Zoom's \"secret\" beauty filter. You'll end your meeting with soft, dewy skin.\n_______________________________________________________________________________\nHerbivore Jade Facial Roller ($30; sephora.com)\nHerbivore Jade Facial Roller\nLove the idea of a facial roller, but not sure when you'd ever have the time to sculpt your cheekbones and massage your oil in? Your time is now, and this classic jade roller from Herbivore is designed to reduce your stress puffiness.\n_______________________________________________________________________________\nHerbivore Lapis Balancing Facial Oil ($72; sephora.com)\nHerbivore Lapis Balancing Facial Oil\nWhile you're rolling, add a few drops of this luxurious facial oil, which is good for all skin types and can improve redness and blemishes.\n_______________________________________________________________________________\nEpielle Assorted Hologram Masks (starting at $5.10; ebay.com)\nEpielle Assorted Hologram Masks\nThese assorted masks are moisturizing and calming, and you'll have a lot of fun sharing them with your family.\n_______________________________________________________________________________\nGolden Star Beauty Self Tanner ($28.79; amazon.com)\nGolden Star Beauty Self Tanner\nLet's face it, we may be stuck inside for longer than we want. But that doesn't mean we have to give up a golden, sun-kissed glow. This sunless tanning oil kit comes with everything you need to build a tan at home, and bonus, you don't have to get dressed right after you apply.\n_______________________________________________________________________________\nSheaMoisture Jamaican Black Castor Oil Strengthen & Restore Leave-In Conditioner ($9.99; target.com)\nSheaMoisture Jamaican Black Castor Oil Strengthen & Restore Leave-In Conditioner\nMade with fair trade shea butter, this moisture-packed leave-in strengthens hair and is infused with peppermint to refresh your scalp.\n_______________________________________________________________________________\nBumble and Bumble While You Sleep Damage Repair Masque ($49; sephora.com)\nBumble and Bumble While You Sleep Damage Repair Masque\nAnother treat for your hair, this sleeping hair repair masque can help repair damage overnight, or during the day while you're working from home (and you don't have a Zoom meeting).\n_______________________________________________________________________________\nOrthland Microfiber Hair Towel Wraps, 2 Pack ($9.49; amazon.com)\nOrthland Microfiber Hair Towel Wraps, 2 Pack\nAfter you comb in your leave-in, give your hair (and spirit) the full spa treatment by wrapping a turban around your head and let the heat do the work. How chic are you going to feel swanning about in a turban? Very.\n_______________________________________________________________________________\nVirtue Restorative Treatment Hair Mask ($30; amazon.com)\nVirtue Restorative Treatment Hair Mask\nFor a quicker hair mask option, all this nourishing mask needs is three minutes to help hydrate and strengthen your strands. You can use once a week or as needed, just after shampooing.\n_______________________________________________________________________________\nBaby Foot Peel ($25; amazon.com)\nBaby Foot Peel\nIf you've tried the Baby Foot Peel before you know it's, um, kinda gross. But it also produces results. And right now, you're probably not as concerned about your feet shedding randomly at work or on a date.\n_______________________________________________________________________________\nOuai Rose Hair and Body Oil ($32; sephora.com)\nOuai Rose Hair and Body Oil\nThis oil smells like fresh-plucked roses and is great for adding a bit of texture to freshly washed hair. As a body oil, it's a little thick to use on a busy morning, but if you're looking to smell and feel amazing after a bath or shower, right now you probably have time to let this highly rated oil soak in.\n_______________________________________________________________________________\nEsarora Ice Roller ($14.99; amazon.com)\nEsarora Ice Roller\nOne of our favorite multifunctional beauty products, this simple ice roller can be rolled across your face to help fight face puffiness, and even calm migraines.\n_______________________________________________________________________________\nBath Bombs Gift Set ($21.99; amazon.com)\nBath Bombs Gift Set\nThese fizzy, fun bombs are great for kids and parents. With 16 bombs in the pack, featuring eight \"flavors\" like Midnight Charm and Lavender in Dream, there's something to relax and delight everyone in the social distancing family.\n_______________________________________________________________________________\nDr Teal's Foaming Bath with Lavender ($4.87, originally $5.99; amazon.com)\nDr Teal's Foaming Bath with Lavender\nYour bath just got a lot more soothing with this foaming bath salt, which emits a scent of lavender to help you completely unwind.\n_______________________________________________________________________________\nHomesick Scented Candle, Evening Unwind ($44.95; amazon.com)\nHomesick Scented Candle, Evening Unwind\nBeloved for its specialty candles meant to remind you of moments and even states, Homesick recently unveiled this Evening Unwind candle that is all about deep relaxation.\n_______________________________________________________________________________\nPremium Dry Brushing Body Brush Set ($19.95; amazon.com)\nPremium Dry Brushing Body Brush Set\nThat prebath body brushing practice you've been meaning to start? Why not jump on the exfoliating trend now with this premium dry brushing set?\nNote: The prices above reflect the retailers' listed prices at the time of publication.", "url": "https://www.cnn.com/2020/03/20/cnn-underscored/beauty-products-for-self-care/index.html"}