{"authors": ["Anna-Maja Rappard"], "date_download": "2020-05-04 16:54:04", "date_modify": "2020-05-04 16:54:04", "date_publish": "2020-04-08 16:28:34", "description": "Carl Goldman and his wife, Jeri, were still aboard the Diamond Princess when the threats began.", "filename": "2020_04_08_us_coronavirus-stigma-diamond-princess-passengers_index_1588611244.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407215711-03-coronavirus-stigma-diamond-princess-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_us_coronavirus-stigma-diamond-princess-passengers_index_1588611244.html", "title": "The stigma of having coronavirus: One California couple's experience after departing the Diamond Princess", "title_page": "The stigma of having coronavirus: One California couple's experience after departing the Diamond Princess - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Carl Goldman and his wife, Jeri, were still aboard the Diamond Princess when the threats began.\nThe California couple, who had traveled to South Asia for vacation, were among the passengers stuck onboard the American-run cruise ship when the coronavirus pandemic hit in February.\nFor a time in early February, the Diamond Princess had the largest concentration of cases outside of mainland China -- and positive cases in the United States were in single digits. At least 712 passengers and crew members on the ship tested positive for coronavirus by late March, according to the Centers for Disease Control and Prevention.\nCarl Goldman was one of the hundreds of passengers who tested positive for coronavirus. Jeri Goldman was not.\n\"People started posting that we shouldn't be allowed to come back to the US, or if we did, we should be locked up in cages,\" Carl Goldman told CNN.\nThe Goldmans said that since leaving the ship and returning home in March, the threats have only gotten worse. While the bulk of the threats occurred when Jeri returned home, they have not stopped weeks later.\nThe Goldman's and friends on day 10 of quarantine aboard the Diamond Princess.\nThe couple's experience reflects the stigma some people who have tested positive for the virus face, as the public increasingly has come to fear potentially catching it themselves.\nMost states have stay-at-home orders in place. As a result, businesses have closed, bars and restaurants have turned to take-out or delivery-only options and schools have moved to remote teaching.\nAs of Wednesday midday, at least 399,979 people in the US had tested positive for Covid-19, according to Johns Hopkins University. There are at least 12,912 coronavirus-related deaths.\nDeparting the ship\nAfter being evacuated from the cruise ship, the couple took a flight from Japan to Nebraska. They were transported to University of Nebraska Medical Center, where Carl tested positive for coronavirus.\nHe spent weeks under close medical supervision until he fully recovered. Health care workers performed multiple tests during his two week quarantine in Nebraska. Once he was free of symptoms and tested negative three days in a row, he was released.\nHe returned home on March 16.\nCarl Goldman in quarantine at a hospital in Nebraska, after testing positive for coronavirus.\nJeri, he said, somewhat miraculously never contracted the virus and had already returned to their home in Santa Clarita Valley, California, two weeks earlier.\nDuring that time, Carl said his wife feared for her safety after the initial threats. The Goldmans are known in their local community for owning the local radio station, KHTS. Now, they felt like they were being treated like pariahs.\nAll this came before Gov. Gavin Newsom implemented stay-at-home restrictions on March 19 in order to combat the spread of the virus.\n\"We kept getting threats on social media and YouTube directed at my wife,\" said Carl, who began blogging about his experience after testing positive for the virus. \"There were vile descriptions of me dying from drowning in my own fluids. People we had never met posted on our radio station's Facebook.\"\nCarl said the local sheriff set up additional patrols near their house, and neighbors were asked to be on alert for anything unusual in the neighborhood.\nBut even among their own community, they started to feel people's fear of encountering them.\nSeveral friends refused to see Jeri, Carl said. She was denied services at businesses including her nail salon, personal workout trainer and hair stylist, where she had been a customer for nearly 30 years.\nCarl said their dog walker and house sitter returned the house keys to Jeri. The house sitter, who declined CNN's request for comment, then got fired from his daytime job after the employer found out he had physical contact with Jeri, Carl said.\nCarl says he has been assured by his doctors that it is not possible for him to contract the virus again, and his immunity may last for months, potentially even years. He thinks that reassurance will do little to quell the animosity.\n\"I think people are still so afraid, and are living in fear,\" he said. \"There is still so little information about the virus, and so much misinformation.\"\nCarl had planned the cruise as a surprise birthday and Christmas gift for his wife. It was supposed to be a fun celebration.\nNow, the Goldmans, like nearly 40 million other Californians and 97% of the American public, are abiding by the state's stay-at-home orders for the foreseeable future.\nHe said he and Jeri are hoping to move past the threats.\n\"It's not coming from hatred, it's coming from a place of fear,\" Carl said. \"We are making a conscious effort not to let it affect us. It is what it is.\"", "url": "https://www.cnn.com/2020/04/08/us/coronavirus-stigma-diamond-princess-passengers/index.html"}