{"authors": ["Senior Editor", "The Huffington Post Uk"], "date_download": "2020-05-04 20:19:14", "date_modify": "2020-05-04 20:19:14", "date_publish": "2020-04-28 12:56:00", "description": "Two weeks of celebration would likely be followed by a second – potentially larger – wave of Covid-19.", "filename": "entry_this-is-what-could-happen-if-the-coronavirus-lockdown-was-lifted-tomorrow_n_5ea8276dc5b6a741e49603bc_1588623554.html", "image_url": "https://img.huffingtonpost.com/asset/5ea6d951250000a82d6b89ab.jpeg?cache=bc1amgkyat&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_this-is-what-could-happen-if-the-coronavirus-lockdown-was-lifted-tomorrow_n_5ea8276dc5b6a741e49603bc_1588623554.html", "title": "This Is What Could Happen If The Coronavirus Lockdown Was Lifted Tomorrow", "title_page": "This Is What Could Happen If The Coronavirus Lockdown Was Lifted Tomorrow | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Get the latest on coronavirus. Sign up to the Daily Brief for news, explainers, how-tos, opinion and more.\nThe restrictions are up for review on May 7. As things stand, the lockdown will be lifted incrementally, though no one is sure when. Foreign secretary Dominic Raab has said the reopening of schools – thought to be one of the first institutions likely to come out of hibernation – would be “inconceivable” without some further measures in place.\nBut as the crisis wears on, and the number of patients in hospital with Covid-19 begins to show signs of dropping, Brits may be growing weary of the restrictions – especially when, outside of hospitals and care homes, coronavirus is an invisible enemy. Another weekend of warm weather will only compound the frustration of being largely stuck indoors.\nSo, for argument’s sake, we asked some scientists what would happen if the UK government announced a full and total lifting of the coronavirus lockdown tomorrow.\nDay 1\nIt’s 9am on April 28. After 36 days of being largely confined to their houses, the population of Britain tentatively steps outside and tries, as best they can, to pick up where they left off on March 23.\n“When we lift off restrictions people are likely to celebrate like the end of the war when there were mass parties,” Professor Keith Neal, emeritus professor in the epidemiology of infectious diseases at the University of Nottingham, told HuffPost UK.\nEven without restrictions, there are still a number of things that can’t yet happen.\nNo one will be boarding a plane for a summer holiday while other countries still have restrictions in place. Even in the UK, pubs, hotels and other leisure destinations will need a few days to get back on their feet.\nBut the weather is nice and April has regularly seen temperatures of over 20 degrees in parts of the country so, as would normally be the case, everyone heads to the park.\nPA People sunbathing at the mixed bathing pond on Hampstead Heath in 2018.\nAt the daily government press briefing, Dominic Raab announces the lowest number of daily coronavirus related deaths and infections since the beginning of the month.\nDay 2\nAfter being caught unawares, Britain’s pubs have caught up with the news, reopened their doors and seen record numbers of revellers.\nDuring the day, four million furloughed workers pass the time visiting friends and family and in the evening they’re joined by those lucky enough to have kept their jobs.\nAt the daily government press briefing, it’s Michael Gove’s turn to announce the lowest number of daily coronavirus related deaths and infections for four weeks.\nAnd so it continues until day 14.\nDay 14\nWith the novelty of our rediscovered freedom wearing off, life is settling into the new post-lockdown routine.\nThere’s still no chance of a foreign holiday any time soon but most people are content with two weeks of socialising with friends and family and the ability to book tickets for that festival that had to be postponed until June.\nTwo weeks of declining deaths and new coronavirus infections appear to vindicate the decision to lift the lockdown.\nBut with hindsight, this two-week period will be remembered as the prelude to a second and quite possibly far bigger coronavirus wave.\nDr Freya Jephcott, research fellow at Cambridge University, told HuffPost UK: “The increase would be quite subtle at first. But as we’ve seen with the first wave, it escalates very quickly.”\nThere is currently no effective way of tracing coronavirus in real time and the current method of testing in the UK means there is a lag of about two weeks between when it begins to spread due to an easing of the lockdown and when we actually detect these new infections.\nEMPICS Entertainment A drive-in coronavirus testing centre at Brighton & Hove Albion's American Express Community Stadium in Falmer.\nHospital admissions and deaths lag even further behind and we wouldn’t see the inevitable increase associated with more infections until nearly a month after the lockdown was lifted.\nTesting On April 2, health secretary Matt Hancock set a target of 100,000 Covid-19 tests every day by the end of the month, but with just three days to go that ambition looks increasingly unrealistic. On Sunday, 29,058 tests were carried out, the vast majority in hospitals. New testing services were supposed to remedy this but home testing kits were listed as “unavailable” on the site an hour after it opened at 9am, and drive-through regional testing sites in England and Northern Ireland were inundated. “Because at the moment we’re mostly testing people at the point where they’re ill enough to be in hospital, that puts us about two weeks behind on being able to trace these trends,” says Jephcott.\nDay 21\nAny argument that the lockdown should be lifted in full to save the economy is snuffed out as hundreds of thousands of workers call in sick.\nIt’s a double blow for UK businesses, as the government’s furlough scheme ended when restrictions were eased.\nDay 28\nIt’s impossible to predict just how bad a second peak would be, but without any social distancing at all it’s likely to be worse than the middle of April when nearly 1,000 deaths were being reported each day.\n“It would probably be worse than we were at the worst of the peak,” says Neal.\n“It would double every two and half days.”\nPA Student paramedics during a training exercise at the Louisa Jordan Hospital in Glasgow earlier this month.\nThe report from Imperial College London that initially spurred the government into action projected 250,000 deaths even with “home isolation of cases, home quarantine and social distancing of those over 70 years”.\nWith none of these in place it is almost certain the death toll would be even higher. Early in the crisis, as Britain got to grips with what was unfolding, it was suggested in one model that as many as half a million Brits could die, a scenario that seems a whole lot more likely without any mitigation in place.\nThe second peak Any easing of the lockdown – in full or otherwise – will almost certainly lead to an increase of cases, but the timing is crucial. The government’s “flatten the curve” approach isn’t necessarily about reducing the numbers of people who contract a fatal case of Covid-19 so much as reducing the flow of cases so the NHS can handle them. Lifting the lockdown in one go could cause the NHS to be overwhelmed, meaning doctors would have to choose who lives and who dies.\nProfessor Beatrice Heuser, chair in international relations at the University of Glasgow, told HuffPost UK: “We’re also talking about young people dying – it’s not just people near the end of their lives anyway.\n“You’d have people suddenly disappearing from society – not just people locked up in care homes, but people who are normal members of households.\n“And that’s where I think everybody else’s pain threshold would suddenly go down because they’d suddenly be more aware of these people.”\nThe increase in deaths and infections wouldn’t be equally spread out around the country but would be particularly concentrated in those areas where people gathered in the largest numbers when the lockdown was lifted.\n“Areas with a greater population density or older populations are probably the ones most susceptible to a large number of severely ill people,” says Jephcott.\nWith the death and infection rates rapidly on the rise again, the government has two options – let the virus rip through the country or reintroduce lockdown.\nHerd immunity The idea that allowing enough of the population to become infected, recover and then become immune from coronavirus due to the antibodies they produce has been touted since the beginning of the crisis. But there are two fundamental problems. “Herd immunity would not be achieved towards the end of the year or even later than that, if it was allowed to happen,” says Heuser. “Even in Sweden [which has resisted full lockdown measures] it’s still only a small percentage of the population that has had the infection and survived it. “Herd immunity would mean deaths at the rate of hundreds of thousands just in the UK.” The second issue is that herd immunity is based on the assumption that once someone catches and then recovers from Covid-19 they are, actually, immune. Currently it is just that – an assumption. Over the weekend, the World Health Organisation said there is currently no evidence that people who have recovered from Covid-19 and have antibodies are protected against a second infection.\nDay 35\nWith the death toll surging to record highs and still no evidence that herd immunity can work, the government is forced to reintroduce the lockdown. But whether this would be partial or full is yet another difficult decision with no certain answers.\n“It’s useful to look at other countries that have lifted lockdowns – places like Singapore and Japan,” says Jephcott.\n“They had to bring that back quite quickly when case numbers shot back up again, and that will probably be the case here.”\nThe Japanese island of Hokkaido was quick off the mark to introduce a three-week lockdown but was hit by a second, far larger peak when it was lifted.\nDr Kiyoshi Nagase, chair of the Hokkaido Medical Association, told Time Magazine: “Now I regret it. We should not have lifted the first state of emergency.”\nCarl Court via Getty Images Coronavirus measures in Japan.\nBut a second UK lockdown could be more nuanced than the full and total measures introduced on March 23.\n“We know lockdown measures have worked,” says Neal.\n“Disease rates have stopped increasing and every country that has gone for social distancing in some form or other has slowed the rate of spread.”\n“The difficulty is knowing which bit of the social distancing has worked.”\nCrowded pubs in inner cities and mass gatherings such as that festival that was postponed would almost certainly be helping the spread of the virus, says Neal.\nOn a more positive note, he adds: “Garden centres could be opened up quite easily because they’re massive and open air and it’s a much lower risk in the open air.”\nLessons from other countries The UK’s coronavirus crisis lags slightly behind other European countries that have so far been similarly hit, so the government will be able to watch how these countries lift their own lockdowns to see what helps limit the spread of the virus. On April 26 Italian prime minister Giuseppe Conte announced “public parks and gardens will be re-opened and people will be able to visit relatives, if they live in the same region”. He added that if all goes well, retail shops will be able to reopen later in May, while restaurants, cafes, coiffeurs and barber shops on June 1. Schools would stay closed until the start of the new term in September.\nDay 42\nSix weeks after the lockdown was lifted, the UK is reminded that coronavirus is not the only crisis it has recently faced.\nDr Gianluca Pescaroli from University College London’s Institute for Risk and Disaster Reduction, told HuffPost UK: “We are focusing our attention on Covid-19 right now and that’s totally legitimate. The problem is we’re forgetting that other things are going on.”\nPescaroli points to last summer when heatwaves, floods so bad entire towns had to be evacuated and power cuts all occurred. All made headline news at the time and all required huge efforts to fix.\nPA An RAF Chinook helicopter flying in sandbags to help repair the dam at Toddbrook reservoir near the village of Whaley Bridge in Derbyshire after it was damaged by heavy rainfall last year.\n“We need to start to prepare for this kind of event,” he says.\n“We need to prepare to have something else going on and be sure that our emergency services are not bogged down. We need to plan, prepare and understand which resources we need to mobilise.\nDay 365\nOne year after lifting lockdown would represent the best case scenario for the holy grail in tackling coronavirus – a vaccine.\n“The lockdown was never meant to fundamentally fix or change anything,” says Dr Jephcott.\n“It was just meant to slow transmission down enough so we could gather enough information and put enough capacity in place and develop a longer-term strategy.”\nUntil a vaccine is found – or if it turns out to be unobtainable – this longer-term strategy is likely to be a future where the lifting and then reimposition of some lockdown measures become a normal part of life.\nThe vaccine A vaccine is not guaranteed and even if a one does prove effective, there won’t be enough to go around. Richard Hatchett, head of the Coalition for Epidemic Preparedness Innovations (CEPI) told Reuters that having reserves ready worldwide to immediately inoculate critical populations – health care workers, the elderly, people made vulnerable by medical conditions – would stamp out the pandemic faster and reignite economies The alternative, he said, is a replay of past pandemics, including the H1N1 influenza outbreak of 2009, with wealthy countries hoarding the vaccines.", "url": "https://www.huffpost.com/entry/this-is-what-could-happen-if-the-coronavirus-lockdown-was-lifted-tomorrow_n_5ea8276dc5b6a741e49603bc"}