{"authors": ["Kip Hill"], "date_download": "2020-05-04 20:03:44", "date_modify": "2020-05-04 20:03:44", "date_publish": "2020-04-07 00:00:00", "description": "State environmental regulators will hold a pair of online information sessions Wednesday to discuss plans to temporarily alter pollution limits in the Spokane River. The online events held...", "filename": "_be3720d194e84ffe9cce2ce14319e22a_1588622624.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_be3720d194e84ffe9cce2ce14319e22a_1588622624.html", "title": "Pollution limits in Spokane River subject of Ecology online meetings Wednesday", "title_page": "Pollution limits in Spokane River subject of Ecology online meetings Wednesday", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "State environmental regulators will hold a pair of online information sessions Wednesday to discuss plans to temporarily alter pollution limits in the Spokane River.\nThe online events held by the Washington Ecology Department will begin at 10 a.m. and 6 p.m. They are taking the place of an in-person open house, that had been scheduled for last month, updating the public on applications made by the city of Spokane, Spokane County and other entities discharging pollutants known as polychlorinated biphenyls, or PCBs, into the river.\nThey’ll also be held as conservation groups are asking Gov. Jay Inslee to intervene and halt the process during his stay-home order to combat the coronavirus.\nThe governments, along with Inland Empire Paper Co. and Kaiser Aluminum, are asking for a reprieve from a federal standard that they say is too small to be measured by current technology and would cost too much to implement. Inland Empire Paper is owned by the Cowles Co., which also publishes The Spokesman-Review.\nConservation groups and native tribes argue the federal standard is necessary to ensure the safe consumption of fish harvested from the river. Changing the limit without holding in-person meetings to allow the public to understand the process would not allow “meaningful participation,” wrote Jerry White Jr., Spokane Riverkeeper, in a letter to Inslee calling for it to halt until at least May 4.\nThe Ecology Department plans to issue a draft rule limiting PCBs next month. The rule is expected to be approved in the fall.\nThose with questions are asked to email them in advance of the meeting to swqs@ecy.wa.gov. Information on joining one of the online meetings is available on Ecology’s website, ecology.wa.gov, or by clicking this link: bit.ly/PCBweb20.", "url": "https://apnews.com/be3720d194e84ffe9cce2ce14319e22a"}