{"authors": ["Michael Tackett"], "date_download": "2020-05-04 20:28:17", "date_modify": "2020-05-04 20:28:17", "date_publish": "2020-04-14 16:57:17", "description": "WASHINGTON (AP) — President Donald Trump insists there are “numerous provisions” in the Constitution to support his view that he has “total authority” to order states to open their economies as...", "filename": "_ec00d5b8f4e0f7550282bd22a6b90027_1588624097.html", "image_url": "https://storage.googleapis.com/afs-prod/media/7b809cb580ee40878c879251adb591a5/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ec00d5b8f4e0f7550282bd22a6b90027_1588624097.html", "title": "Trump's 'I alone can fix it' view and state powers collide", "title_page": "Trump's 'I alone can fix it' view and state powers collide", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Donald Trump speaks during a meeting with people that have recovered from COVID-19, in the Cabinet Room of the White House, Tuesday, April 14, 2020, in Washington. (AP Photo/Evan Vucci)\nPresident Donald Trump speaks during a meeting with people that have recovered from COVID-19, in the Cabinet Room of the White House, Tuesday, April 14, 2020, in Washington. (AP Photo/Evan Vucci)\nWASHINGTON (AP) — President Donald Trump insists there are “numerous provisions” in the Constitution to support his view that he has “total authority” to order states to open their economies as the coronavirus pandemic roils.\nHe did not enumerate what they were. And the consensus among constitutional scholars is that’s because they don’t exist.\nTrump’s statement on Monday was another head-snapping turn in a presidency filled with them. In the days and weeks before, Trump had laid responsibility for the pandemic response at the feet of the nation’s governors. Now, he says he has vast powers as president to compel states to action.\nIn doing so, he reignited a debate as old as the nation over the division of power and authority between the federal government and the states.\nThe United States was founded in the late 18th century in part on a profound skepticism of the dangers of power concentrated in a central government. The 10th Amendment of the Bill of Rights was designed to apportion authority. Thomas Jefferson called it “the foundation of the Constitution.”\nThe amendment itself seems straightforward enough: “The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.”\nBut it’s not so simple, according to Trump.\nAsked what authority he had to make such an assertion of presidential power, Trump promised that he would provide a legal memorandum that supported his view. In adopting his position, he was offering a direct challenge both to the norms of constitutional authority and the orthodoxy of his Republican Party.\n“When somebody’s the president of the United States, the authority is total, And that’s how it’s got to be,” Trump said.\nAndrew Cuomo, the Democratic governor of New York, offered a blunt rejoinder that echoed the country’s colonial-turned-separatist past. “We don’t have a king in this country,” Cuomo said in his daily news briefing Tuesday. “We didn’t want a king. So we have a Constitution and we elect a president.”\n“The president is clearly spoiling for a fight on this issue,” Cuomo said. “The worst thing we can do ... is start with political division.”\nFormer Vice President Joe Biden, the presumed Democratic challenger to Trump, echoed that theme, tweeting: “I am not running for office to be King of America. I respect the Constitution. I’ve read the Constitution. I’ve sworn an oath to it many times. I respect the great job so many of this country’s governors — Democratic and Republican — are doing under these horrific circumstances.”\nBy Tuesday evening, Trump seemed to be placing responsibility back on the governors, even as he said that he might authorize some states to open before the end of the month.\n“The governors are responsible,” he said during a briefing. “They have to take charge.” In particular, he said that governors would have to oversee testing for the virus. “The governors are supposed to do the testing,” he said.\nThe federal government does have broad constitutional authority over states on things that cross state lines and involve the entire nation, like regulating interstate commerce and immigration, levying taxes or declaring war. Its powers are drawn from the Supremacy Clause of the Constitution, which establishes that federal laws in most cases supersede state laws. Congress can also pass laws giving the president additional authority.\nWhat Trump is proposing, however, is different. He is wading into states’ sharply defined powers to protect public health.\n“The president can un-declare his national emergency declarations, which freed up federal funds and provided assistance to state and local governments,” said Walter Dellinger, a former acting U.S. solicitor general. “But he has no federal statutory or constitutional power to override steps taken by governors and mayors under state law. He has never understood that he lacks a general power to rule by decree.”\nDavid B. Rivkin Jr., who served in the Justice Department and White House Counsel’s Office, said there are instances where Trump could override the states. “President Trump has authority under Defense Production Act to compel the reopening and continued operations of various industrial and agricultural facilities and enterprises,” he said. “Therefore, as a practical matter, he can reopen a large portion of the American economy.”\nStill, Trump’s position is also at odds with the philosophy of the Republican Party, which often leans in favor of states being able to make decisions, and at odds with some leading conservative legal thinkers, including the late Justice Antonin Scalia, whom Trump has hailed a judicial hero.\n“The Federal Government may neither issue directives requiring the States to address particular problems, nor command the States’ officers, or those of their political subdivisions, to administer or enforce a federal regulatory program,” Scalia wrote in Printz v. United States, which in 1997 struck down part of a federal gun law on 10th Amendment grounds.\nHe added a sentence of emphasis: “Such commands are fundamentally incompatible with our constitutional system of dual sovereignty.”\nFull Coverage: Understanding the Outbreak\nJohn Yoo, a law professor at the University of California and a former Justice Department counsel in the Bush administration, brought that view forward to today.\n“The federal government does not have the power to reopen the economy,” Yoo said in an email. “The Constitution’s grant of limited, enumerated powers to the national government does not include the right to regulate either public health or all business in the land.”\nCongress, he said, “can bar those who might be infected from entering the United States or traveling across interstate borders, reduce air and road traffic, and even isolate whole states. But our federal system reserves the leading role over public health to state governors.”\nOn Tuesday, three members of Congress, led by Rep. Tom Malinowski, D-N.J., offered a resolution that, while largely symbolic, carried an unmistakable rebuke for Trump.\n“Resolved,” it said, “that the House of Representatives affirms that when someone is the President of the United States, then authority is not total.”\n___\nMichael Tackett is deputy Washington bureau chief for The Associated Press. Follow him on Twitter at https://twitter.com/tackettdc", "url": "https://apnews.com/ec00d5b8f4e0f7550282bd22a6b90027"}