{"authors": ["Sarah Jorgensen"], "date_download": "2020-05-04 16:27:24", "date_modify": "2020-05-04 16:27:24", "date_publish": "2020-04-07 02:49:56", "description": "Two employees of the Holyoke Soldiers' Home in Massachusetts told CNN they felt the home was woefully unprepared for a coronavirus outbreak, in part due to long-standing systemic issues like short staffing.", "filename": "2020_04_06_us_holyoke-soldiers-home-coronavirus_index_1588609644.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331011226-veterans-home-coronavirus-deaths-massachusetts-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_us_holyoke-soldiers-home-coronavirus_index_1588609644.html", "title": "Holyoke Soldiers' Home, site of deadly outbreak, dealt with systemic issues for years, staffers and union say", "title_page": "Holyoke Soldiers' Home, site of deadly outbreak, dealt with systemic issues for years, staffers and union say - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Two employees of the Holyoke Soldiers' Home in Massachusetts told CNN they felt the home was woefully unprepared for a coronavirus outbreak, in part due to long-standing systemic issues like short staffing.\nAdditionally, according to the employees and a union representative, a lack of personal protective equipment and the home's recent decision to consolidate veterans into tighter quarters likely enhanced the outbreak at the facility.\nAs of Monday, 25 veteran residents have died since March, 18 of whom have tested positive for Covid-19, with three additional results pending.\nOne nurse, speaking on the condition of anonymity since they are not authorized to speak to the press, said the home has been short-staffed for about two years.\nEmails shared with CNN between union officials and the state reflect concerns by the union about staffing levels over the past few years.\nCory Bombredi, an internal organizer for SEIU Local 888, which represents 270 members of the home's staff, said that according to his data the facility has been operating at 80% staffing levels for the past few years. Within the past two years, Bombredi said that the facility had fired 70 certified nurse's assistants and licensed practical nurses.\n\"They've gone through all the available workforce\" in the western Massachusetts region, Bombredi said. Emails and meeting agendas from both 2019 and earlier this year show repeated concerns expressed by the union about mandatory overtime being used in place of adequate staffing.\nMassachusetts Health and Human Services, which oversees the facility, declined to respond to the union allegations despite repeated attempts by CNN.\nMany nurses are working overtime and quick turnarounds right now, according to the nurse.\nWhen staff started to get sick during March, the nurse said that the home began consolidating veteran units to allow for the smaller staff to administer to more veterans at once -- for example, nine veterans shared a dining room together as a unit, and 3-person bedrooms accommodated four veterans.\n\"We already were having staffing issues, already understaffed, so I don't think they were prepared for the amount of staff that became ill and had to leave,so then they had to combine units so there were more veterans per staff member,\" the nurse told CNN.\nBombredi explained that the dining room, which does not normally accommodate beds, didn't have adequate electricity hook ups, leaving the beds for veterans unable to move up and down for their comfort and for the caregivers to be able to attend to them more comfortably. The nurse and Bombredi also said that the facility mixed in veterans who were being tested for Covid-19 with other residents.\n\"This is a building that clearly housed all of these veterans in their own private setting,\" Bombredi said. \"For whatever reason, the team of managers thought the best course of action was to combine sick veterans with healthy veterans.\"\n\"Completely senseless\"\nErin Saykin, a certified nurse's aide who has worked at the home for 16 years, echoed these same concerns. Saykin said that the staff were instructed to wear simple surgical masks and gowns which she said were not normally used and that they did not have access to N95 masks. Bombredi told CNN that he had heard from other staff that they did not have proper access to proper personal protective equipment.\nDuring her overtime shifts, Saykin worked with a patient who would later test positive. That veteran was mixed in a room with other veterans, she said. She believes the patient should have been isolated, despite the difficulty in isolating some patients who have dementia.\n\"He should've been moved off the unit, closed off from everyone,\" Saykin said.\nSaykin woke up in the middle of the night after her shift and felt like she couldn't breathe. She was tested and learned she was positive for Covid-19, and has been recovering at home for more than two weeks.\nLast week, CNN reported that a nurse in the home was reprimanded in March for wearing personal protective equipment (PPE). The worker -- a caregiver -- says he first came into contact with a veteran with symptoms consistent with Covid-19, who was not isolated, but rather walking around and coughing, and while working on a different floor at the facility he also observed a second veteran displaying symptoms. The employee's actions were called \"disruptive\" and \"extremely inappropriate\" which purportedly \"alarmed staff.\"\n\"We don't have a voice to challenge what management decides,\" the second nurse who wished to remain anonymous said when asked if any of these concerns had been raised with management. The nurse said that the staff is worried about not only their own safety, but also the safety of their family members.\nUnion representative Bombredi confirmed he had heard many of the same concerns of the nurse and Saykin from other members.\n\"This isn't one or two of my workers telling me these stories,\" Bombredi said. \"This is, at this point, a majority, and they're all telling an identical story.\"\nThe union filed an official grievance on behalf of its members on Saturday demanding that four other additional management members be placed on leave, in addition to the superintendent of the home who has already been placed on leave\n\"We need insurance that they're going to have a thorough investigation,\" Bombredi said. \"At this point, we're going to need to see an entirely new team of management take over that home to have any confidence going forward.\"\nA total of 59 veteran residents have tested positive along with 31 staff, according to the Massachusetts Department of Health and Human Services. Last week, Gov. Charlie Baker ordered an investigation into the home and what led to the outbreak.\n\"The veterans that we lost -- some of them could've stayed with us a little longer,\" Saykin said. \"This was completely senseless.\"\nThe second nurse acknowledged things have begun to change within the past week. Everyone at the facility -- veterans and staff -- have been tested, the nurse said, and an entire unit of veterans who tested negative have been evacuated from the facility to another home. The nurse said that veterans are being separated more, and other enhanced cleanings have happened.\n\"It's starting to look up,\" the nurse said. Bombredi added that workers now had access to proper PPE. Additional nurses and staffing are being added with help from the National Guard, according to the Executive Office of Health and Human Services. Among other enhanced measures, the EOHHS has hired additional cleaning staff and has been distributing PPE.\nBut that doesn't negate the nurse's belief that the facility was not prepared. \"This is no surprise,\" the nurse said of Covid-19. \"It should not be a surprise to any place in the United State that it was coming.\"\n\"I still love working there, and I know people that are still working there love being there because we have a terrific bond with our veterans,\" Saykin said. \"That's not something you can duplicate anywhere.\"", "url": "https://www.cnn.com/2020/04/06/us/holyoke-soldiers-home-coronavirus/index.html"}