{"authors": ["Kathryn Vasel", "Cnn Business"], "date_download": "2020-05-04 16:59:49", "date_modify": "2020-05-04 16:59:49", "date_publish": "2020-04-09 22:32:35", "description": "It's not too late to set up your home office", "filename": "2020_04_09_success_newsletter-setting-up-home-office_index_1588611589.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330100333-20200330-work-from-home-office-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_success_newsletter-setting-up-home-office_index_1588611589.html", "title": "The right way to set up your new home office", "title_page": "The right way to set up your new home office  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Editor's Note: A version of this story appeared in CNN's Work Transformed newsletter. To get it in your inbox, sign up for free here .\nI'm going to be honest: I wrote this sitting cross-legged on my couch hunched over my laptop.\nProbably not the best position for my posture, but in a New York City apartment (read: small) with two kids and a husband, I will take whatever space I can get.\nAt least I'm not writing this in bed, right?\nSo many workers are finding themselves working from home to help curb the spread of coronavirus. And many of us don't have a designated space to set up shop.\nEven if you do have a home office, you probably weren't thinking you would be spending 40-plus hours a week in it.\nSo what can you do to maximize productivity and minimize waking up aching every morning? Here's what the experts told me\nThe ground rules: Look for a quiet space, with a flat surface. It's even better if it's near a window to give a little natural light and fresh air. You want your desk to be around elbow height when seated. Setting up camp close to outlets will also help save your sanity.\nSit like a pro: Your legs should be parallel to the ground when sitting with your feet on the floor or on a footrest (which is easy to improvise with a box).\nMonitor placement: Try and get your monitor at eye level and place it about an arm's-length away. If possible, get a separate keyboard and mouse for your laptop so you can prop up your screen to the right height.\nMove around: Be sure to take breaks and walk around, especially if your workspace is less than ideal. Give your muscles some time to relax and stretch.\nNeed some inspiration? Some people are getting quite creative when it comes to making their own remote offices. From ironing boards to liquor cabinets, people are proving work really can be done from anywhere (well, anywhere in the house).\nCheck out this video for tips on finding the best spot to work in your house and how to be the most efficient.\nWho is hiring during the pandemic?\nI keep reminding myself that those of us trying to make our home offices more comfortable are lucky to still have a paycheck.\nNot every job can be done remotely and millions of people have been furloughed or laid off in just the past few weeks. This morning, the government reported that another 6.6 million Americans filed for unemployment benefits last week.\nBut there are still some companies hiring.\nCNN's Nathaniel Meyersohn reports that large retail and grocery chains that have remained open reports that large retail and grocery chains that have remained open are quickly adding to their payrolls to keep up with customer demand.\nAnd the numbers are pretty staggering: Walmart wants to add 150,000 workers through the end of May, Amazon is planning to bring on an additional 100,000 and CVS is looking to fill 50,000 positions. Dollar General, Kroger, Albertsons and 7-Eleven are also looking for help.\nWhile job openings are good news for job hunters, Meyersohn reports some existing part-time workers \"are frustrated that new workers are coming in when they have already been struggling to find enough hours to pay their bills.\" They worry new workers will infringe on their hours or hurt their chances of eventually becoming full-time.\n'A wild grab for cash' for small business owners\nSmall business owners feel they're in a race for their livelihoods, reports CNN's Jeanne Sahadi. Many are in desperate need of cash injections as sales dried up in the wake of sweeping stay-at-home orders.\nThe federal stimulus' Paycheck Protection Program is supposed to pay out up to $349 billion in forgivable loans on a first-come, first-served basis, but the details of the program were still uncertain even after the program launched Friday.\nStill, lenders were flooded with applicants as soon as the program opened.\nNow many small businesses are still waiting to hear whether they've been approved and when they will see the money. One small business owner called it \"a wild grab for cash.\"\nTapping your 401(k): Should you do it?\nFeeling a little cash-crunched? Or even cash-negative? The federal stimulus package has loosened some of the restrictions on tapping into your 401(k) prematurely.\nNormally, dipping into your retirement funds before age 59 1/2 would result in a 10% early-withdrawal penalty. But the new legislation eliminates that penalty for those hit by the pandemic.\nCNN's Anna Bahney you have. But just because you can, doesn't mean you should. Read report here on the risks and other options you have.\nDusting off old hobbies\nRemember your favorite hobby when you were younger and you had a lot more free time on your hands? Well it's never too late to pick it back up. With most of the country under stay-at-home orders, Americans are falling back in love with sewing, doodling, and model trains.\nCoffee Break\nSpeaking of DIY ... It's one thing to create your own workspace, but can you also give yourself a haircut?\nA lot of us are looking a little shaggy on top these days and are missing the professionals that help us look good.\nSo how hard is it really to cut your own hair? Watch this video before breaking out the clippers.\nLet's circle back\nWe want to hear about your successes, your best tips and tricks, and even your failures and the lessons you've learned along the way. Remember: We're all in this together. Send us an email at worktransformed@cnn.com and tell us what you want to see us cover.", "url": "https://www.cnn.com/2020/04/09/success/newsletter-setting-up-home-office/index.html"}