{"authors": ["Kat Stafford"], "date_download": "2020-05-04 20:28:14", "date_modify": "2020-05-04 20:28:14", "date_publish": "2020-04-20 13:00:07", "description": "DETROIT (AP) — The Congressional Black Caucus PAC endorsed Joe Biden's presidential bid on Monday, further cementing his support among the nation's influential black political...", "filename": "_46ab3da5490db0633a4de161182473b9_1588624094.html", "image_url": "https://storage.googleapis.com/afs-prod/media/0369dacee2fe48b7a0e854b486fa8d40/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_46ab3da5490db0633a4de161182473b9_1588624094.html", "title": "Congressional Black Caucus PAC backs Biden's White House bid", "title_page": "Congressional Black Caucus PAC backs Biden's White House bid", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Oct. 24, 2019, file photo members of the Congressional Black Caucus gather for a memorial ceremony for the late Maryland Rep. Elijah Cummings, at the Capitol in Washington. From left are Rep. Joe Neguse, D-Colo., Rep. John Lewis, D-Ga., Rep. Robin Kelly, D-Ill., Rep. Gwen Moore, D-Wis., Rep. Gregory Meeks, D-N.Y., and Rep. Barbara Lee, D-Calif. The Congressional Black Caucus PAC is endorsing Joe Biden’s presidential bid, further cementing his support among the nation’s influential black political leadership. Black voters have long anchored the former vice president’s White House bid with decisive wins in South Carolina and on Super Tuesday. The chairman of the Congressional Black Caucus political action committee is New York congressman Gregory Meeks, who tells The Associated Press there’s “no question” Biden is the right person to lead the country.(AP Photo/J. Scott Applewhite, File)\nFILE - In this Oct. 24, 2019, file photo members of the Congressional Black Caucus gather for a memorial ceremony for the late Maryland Rep. Elijah Cummings, at the Capitol in Washington. From left are Rep. Joe Neguse, D-Colo., Rep. John Lewis, D-Ga., Rep. Robin Kelly, D-Ill., Rep. Gwen Moore, D-Wis., Rep. Gregory Meeks, D-N.Y., and Rep. Barbara Lee, D-Calif. The Congressional Black Caucus PAC is endorsing Joe Biden’s presidential bid, further cementing his support among the nation’s influential black political leadership. Black voters have long anchored the former vice president’s White House bid with decisive wins in South Carolina and on Super Tuesday. The chairman of the Congressional Black Caucus political action committee is New York congressman Gregory Meeks, who tells The Associated Press there’s “no question” Biden is the right person to lead the country.(AP Photo/J. Scott Applewhite, File)\nDETROIT (AP) — The Congressional Black Caucus PAC endorsed Joe Biden’s presidential bid on Monday, further cementing his support among the nation’s influential black political leadership.\nThe political action committee’s unanimous endorsement came on the heels of several key nods of support among caucus leadership and members, including civil rights icon Rep. John Lewis of Georgia and caucus Chairwoman Rep. Karen Bass of California. The PAC is the caucus’s separate campaign arm.\n“There’s no question that Joe Biden is badly needed by this country,” CBC PAC Chairman Rep. Gregory Meeks of New York said in an interview with The Associated Press. “His leadership, his experience, his understanding on how to get things done and his ability to work and pull people together is needed now more than ever. We need someone that is a healer and not a divider, and that’s Joe Biden.”\nBiden, who is on the cusp of clinching the Democratic presidential nomination , had already scored key endorsements from 38 of the 54 members of the group, which is composed of most African American members of Congress.\nBlack voters have long anchored the former vice president’s White House bid with overwhelming support in South Carolina , on Super Tuesday and in Midwestern states like Michigan . But that was before the coronavirus pandemic disrupted the presidential race, forcing several states with significant black populations, like Georgia, to postpone their primaries. African Americans have been disproportionately impacted by COVID-19, the disease caused by the virus.\nAn AP analysis last week found nearly one-third of those who have died are African American, with black people representing just 14% of the population in the areas covered in the analysis.\nEarlier this month, Biden joined a growing call for the release of comprehensive racial data on the coronavirus pandemic, which he said has put a spotlight on inequity and the impact of “structural racism.”\nMeeks said he believes Biden is well-suited to address the lasting impact of the pandemic and he’d like to see an agenda from him that specifically addresses racial disparities that have long plagued black Americans. Many of the nation’s front-line workers, who are among the most at risk, are black Americans and other people of color.\n“There’s no question in my mind that there needs to be an agenda that pushes forward black America,” Meeks said. “Joe Biden has proven that he has the ability to get things done and that he has a vision to bring us together and have an agenda of significant importance for the black community.”\nThe CBC PAC endorsed Hillary Clinton in 2016 over Vermont Sen. Bernie Sanders. When asked what will be the road map to winning the election this time after Democrats suffered a bitter defeat, Meeks said it’s simple: Listen to black women, who are among the Democratic Party’s most loyal voting bloc.\n“Black women over-performed in 2016, and had we listened to them, we might not have the person that’s there now,” Meeks said.\nBut Meeks said he’s confident Biden will be able to drum up support among key demographics.\n“There was a reason why Barack Obama chose Joe Biden to be his vice president,” Meeks said. “He is the appropriate person now to step forward and take the reins of this great nation of ours.”\n___\nKat Stafford is a member of The Associated Press’ Race and Ethnicity team. Follow her on Twitter at https://twitter.com/kat__stafford .\n___\nCatch up on the 2020 election campaign with AP experts on our weekly politics podcast, “Ground Game.”", "url": "https://apnews.com/46ab3da5490db0633a4de161182473b9"}