{"authors": ["Nathaniel Meyersohn", "Sara Ashley O'Brien", "Cnn Business"], "date_download": "2020-05-04 16:20:32", "date_modify": "2020-05-04 16:20:32", "date_publish": "2020-04-05 16:03:48", "description": "Aside from health care workers, no one is more exposed to coronavirus than the workers continuing to show up to grocery stores and warehouses to ensure people have access to essential goods.", "filename": "2020_04_05_business_masks-w_fa483964adc8fab436adff20c053c021_index_1588609232.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404101156-01-amazon-employee-0326-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_business_masks-w_fa483964adc8fab436adff20c053c021_index_1588609232.html", "title": "Stores are scrambling to get masks for their workers. It's no easy task", "title_page": "Stores are scrambling to get masks for their workers. It's no easy task - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Aside from health care workers, no one is more exposed to coronavirus than the workers continuing to show up to grocery stores and warehouses to ensure people have access to essential goods.\nSo when the US government recommended Friday that people wear masks in public, company efforts to get masks to their employees became even more crucial.\nThe problem is: masks are extremely hard to source right now.\nKroger wanted to give masks to store workers to help keep them safe against the coronavirus. But it ran into a challenge getting them from a supplier: The Italian government needed them for its health care workers.\nIn this case, Italy, which has the highest number of deaths in the world from the pandemic, was given priority over Kroger by the supplier.\nKroger KR Althoughsaid it has still been able to secure masks for most workers, the example highlights the difficulty grocery stores, retailers, and on-demand delivery companies now face. As the virus spread from Asia earlier this year to the Middle East, Europe and North America, masks fell into short supply. This has resulted in a mask shortage around the world and hospitals are struggling to get supplies.\nMany large chains staying open during the outbreak have been slow to provide their workers with masks, despite growing concern from workers and unions. But a wave of companies shifted their positions this week ahead of new guidance from the Centers for Disease Control and Prevention Friday.\nWalmart WMT Target TGT Amazon AMZN Lowe's LOW Walgreens WBA , Instacart and Doordash all announced in recent days they would start providing workers with masks in the coming weeks. Some of the companies say they will \"strongly encourage\" workers to wear masks, while others said they would offer them to workers who want to wear them.\nWalmart, the largest private employer in the United States, waited to secure protective gear to avoid limiting equipment that could go to strained health care workers and hospitals, Dan Bartlett, the company's vice president of corporate affairs, told reporters. The company will need more than seven million masks each week for its employees, he said. The first shipment will arrive in one to two weeks.\nWalmart, Target, Amazon, Lowe's, Walgreens, Instacart and Doordash all said they would start providing workers with masks in the coming weeks.\n\"The millions of masks we ordered weeks ago are now arriving, and we're distributing them to our teams as quickly as possible,\" Amazon spokesperson Alyssa Bronikowski said in a statement Friday. \"Masks will be available as soon as today in some locations and in all locations by early next week.\"\nBut for the millions of workers at these companies, the masks could be coming too late: Coronavirus hotspots in places like New York and Michigan are set to peak in the coming days.\nMixed signals and homemade masks\nFederal agencies and public officials have sent mixed messages about the use of masks.\nOn Friday, President Donald Trump announced new guidance from the White House that the CDC advises the use of \"non-medical cloth based\" face coverings, although he stressed it was voluntary and that he would not wear one. It was a reversal of previous guidance that suggested masks were unnecessary for people who weren't sick.\nThe changing stance puts added pressure on companies to provide masks for those who continue to show up to work for essential jobs and could be putting their health at risk.\nThe Labor Department's Occupational Safety and Health Administration, which enforces workplace safety law, says that workers in \"some high-volume retail settings\" have \"medium exposure risk\" and employers should \"consider offering face masks to ill employees and customers.\"\nGrocers are trying creative ways to get their hands on masks.\nTrader Joe's is having them made by a manufacturer that makes its shirts, a spokesperson said. Walmart is initially sourcing its masks from China and plans to get them within the United States as well, a spokesperson said.\nMorton Williams, a grocery chain in New York, is mandating its employees wear masks, said owner Avi Kaner. It's getting them from a maintenance supply company and Wakefern, the owner of ShopRite.\nKaner's mother is also \"sewing homemade ones\" for employees.\nFor other chains, it's been more difficult. \"Karns is trying to source masks, but it is proving problematic,\" said Andrea Karns, a representative of Karns Foods, a chain of nine grocery stores in Pennsylvania.\nTraditional suppliers Karns contacted are required to divert their masks to medical personnel, so the company is searching online to source masks.\n\"We have an initial order for disposable masks set to arrive in the coming day, but we know that our need reaches far beyond our current inventory,\" she said.\nSome companies like Kroger and union leaders are pushing state and federal lawmakers to designate grocery workers as emergency personnel. This status would allow grocery workers to get priority access to personal protective equipment. Vermont and Minnesota have designated them as emergency workers, while a handful of states have other special designations for grocery workers.\nWithout access to personal protective equipment such as gloves and masks, \"grocery workers are more at risk of exposure to the virus,\" said a spokesperson for the United Food and Commercial Workers union representing 1.3 million workers at Kroger, Albertsons and other chains.\nKarns believes that \"having grocers included as an approved recipient of PPE is necessary in this situation.\" That hasn't happened in Pennsylvania yet.\n\"Until then, we are working our hardest to source and outfit our team members with protective gear,\" she said.", "url": "https://www.cnn.com/2020/04/05/business/masks-workers-amazon-instacart-walmart-lowes/index.html"}