{"authors": [], "date_download": "2020-05-04 20:27:21", "date_modify": "2020-05-04 20:27:21", "date_publish": "2020-04-28 22:17:52", "description": "Beshear incorrectly assumed that the claim filed by a Lexington cook with the same name as the iconic rapper was a prank, but has vowed to get this Shaku...", "filename": "entry_and-beshear-tupac-shakur_n_5ea8a8f2c5b6106b8eced84f_1588624041.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8aa53240000eb008e9e66.jpeg?cache=qafffpyuy6&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_and-beshear-tupac-shakur_n_5ea8a8f2c5b6106b8eced84f_1588624041.html", "title": "Kentucky Governor Andy Beshear Sorry He Held Up Tupac Shakur's Unemployment Check", "title_page": "Kentucky Governor Andy Beshear Sorry He Held Up Tupac Shakur's Unemployment Check | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "FRANKFORT, Ky. (AP) — It’s no joke — Tupac Shakur lives in Kentucky and needs unemployment benefits to pay his bills.\nThe Lexington man’s name was brought up by Gov. Andy Beshear on Monday night as he spoke about how the state is trying to process all unemployment claims filed in March amid the coronavirus pandemic by the end of April.\nAccording to Beshear, a few “bad apples” including a person who filed an unemployment claim under the name of rapper Tupac Shakur — who was killed in a 1996 shooting — are responsible for slowing down the state’s unemployment processing. He blamed people who “think they’re funny” for making “thousands of other people wait” for their unemployment payments.\nBut the Lexington Herald-Leade reports Tupac Malik Shakur, 46, who goes by Malik, lives in Lexington and worked as a cook before restrictions to stop the spread of the coronavirus shut down restaurants.\nHe filed for unemployment March 13 and has been waiting to receive his first check.\n“I’ve been struggling for like the last month trying to figure out how to pay the bills,” Shakur said.\nHe told the newspaper he wondered why his benefits were being held up, but did not think the labor cabinet would declare his claim was a prank.\n“I’m hurt, I’m really embarrassed and I’m shocked,” Shakur said.\nBeshear’s office originally said the state could not verify the identity on the application but after getting information from the newspaper, the state is working to resolve the claim.\nBeshear called Shakur personally on Tuesday to apologize and Shakur said he appreciated the gesture and forgave Beshear.\n“I understand, he’s dealing with a lot,” Shakur said. “Mistakes happen.”\n___\nFollow AP coverage of the pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.", "url": "https://www.huffpost.com/entry/and-beshear-tupac-shakur_n_5ea8a8f2c5b6106b8eced84f"}