{"authors": ["Por Mesfin Fekadu"], "date_download": "2020-05-04 20:24:31", "date_modify": "2020-05-04 20:24:31", "date_publish": "2020-04-08 17:01:42", "description": "NUEVA YORK (AP) — El coronavirus ha paralizado muchos planes en la industria de la música, desde giras hasta lanzamientos de discos, pero no evitó que el DJ y productor Alesso y el exintegrante de...", "filename": "_a6c953f59c7d43fc9053fccf3afbd645_1588623871.html", "image_url": "https://storage.googleapis.com/afs-prod/media/75ff6059de7744ba9d6574d003b0c29c/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a6c953f59c7d43fc9053fccf3afbd645_1588623871.html", "title": "Aun varados en casa, Alesso y Liam Payne filman videoclip", "title_page": "Aun varados en casa, Alesso y Liam Payne filman videoclip", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nEn esta combinación de fotos, Alesso, a la izquierda, en la fiesta de Spotify para los mejores artistas nuevos el 25 de enero de 2018 en Nueva York, y Liam Payne en la ceremonia de los Premios Brit en Londres el 20 de febrero de 2019. El coronavirus ha paralizado muchos planes en la industria de la música, pero no evitó que Alesso y Payne filmaran un nuevo video musical. El DJ sueco y el cantante inglés lanzaron el miércoles 8 de abril del 2020 “Midnight”, grabada desde la distancia. (AP Foto)\n1 of 3\n1 of 3\nEn esta combinación de fotos, Alesso, a la izquierda, en la fiesta de Spotify para los mejores artistas nuevos el 25 de enero de 2018 en Nueva York, y Liam Payne en la ceremonia de los Premios Brit en Londres el 20 de febrero de 2019. El coronavirus ha paralizado muchos planes en la industria de la música, pero no evitó que Alesso y Payne filmaran un nuevo video musical. El DJ sueco y el cantante inglés lanzaron el miércoles 8 de abril del 2020 “Midnight”, grabada desde la distancia. (AP Foto)\n1 of 3\n1 of 3\nNUEVA YORK (AP) — El coronavirus ha paralizado muchos planes en la industria de la música, desde giras hasta lanzamientos de discos, pero no evitó que el DJ y productor Alesso y el exintegrante de One Direction Liam Payne filmaran un nuevo video musical.\nEl par unió esfuerzos para la nueva canción bailable “Midnight”, y como no pudo filmar un video típico debido al distanciamiento social y la cuarentena impuesta por la propagación del virus, Alesso fue al estudio de Los Ángeles donde originalmente creó el tema para filmar su parte mientras que Payne, quien vive en Londres, le pidió a un amigo que lo grabara cantando en su balcón.\nEl resultado, lanzado el miércoles, es un video limpio y sencillo que podría pasar por uno hecho sin limitaciones.\n“Fue lindo simplemente hacer un video con mucho menos ruido alrededor — los videos musicales siempre están tan cargados”, dijo Payne en una entrevista telefónica con The Associated Press esta semana. “Para mí personalmente, el solo hecho de poder salir de mi casa, cantar una canción en el balcón e interpretarla del modo que yo quería en lugar de que otra persona me dijera cómo moverme o qué hacer _ es nuestro video y estoy orgulloso de eso”.\n“Es refrescante ver a Liam cantar y a mí simplemente trabajando en la canción”, agregó Alesso. “Así fue como lo hicimos, permitiendo que la canción por sí pueda brillar”.\n“Midnight” trata sobre una pareja que se reúne, pero los artistas dijeron que con el impacto que el coronavirus ha tenido alrededor del mundo, el tema ha adquirido un significado especial.\n“Esto definitivamente le da un significado más grande. Siempre vamos a escuchar esta canción, al menos Liam y yo, y pensar en este momento”, dijo Alesso. “Pienso que definitivamente le da un sentimiento especial”.\n“Todos estamos aprendiendo cosas nuevas sobre nuestras parejas y pasando tanto tiempo con ellas, la gente unida está superando cosas tan grandes en el mundo. Pienso que eso definitivamente le da una mano a la canción, y a cómo uno supera este tipo de cosas”, dijo Payne.\n“Midnight” es una de muchas canciones que el artista inglés de 26 años ha lanzado desde que One Direction se puso en pausa en 2015. En diciembre lanzó su álbum debut, “LP1”, y llegó a los primeros lugares de la lista Hot 100 de Billboard con el éxito multiplatino “Strip It Down”. También ha colaborado con J Balvin, Zedd, French Montana, A Boogie wit da Hoodie y Rita Ora.\nAlesso, quien es sueco, ha figurado en el Top 40 con los éxitos platino “Heroes (We Could Be)”, con Tove Lo, y “Let Me Go”, con Hailee Steinfeld, Florida Georgia Line y Watt. El músico de 28 años también ha tenido éxito como remixer, recibiendo incluso una nominación al Grammy por su versión house de “If I Lose Myself” de OneRepublic.\nAlesso estaba buscando un cantante para “Midnight” y se alegra de Payne haya aceptado el reto: “Él le agregó su increíble sabor. Realmente resultó maravilloso”.\nAmbos se han mantenido creativos durante estos tiempos de confinamiento. Alesso está trabajando incansablemente en el mismo estudio donde produjo “Midnight”.\n“Trabajo como 10 veces más ahora porque tengo más tiempo libre. Mi creatividad realmente fluye mejor ahora porque estoy en casa y no estoy distraído con giras y ese tipo de cosas”, dijo el DJ, y acotó que “por supuesto, también me siento y juego muchos videojuegos y veo mucho Netflix”.\nPayne dice que ha estado “dibujando, pintando cosas”. También le ha devuelto a su comunidad donando 360.000 comidas a bancos de alimentos necesitados durante la pandemia a través de la fundación benéfica The Trussell Trust.\nEspera que “Midnight” — la canción y el video — puedan tener un impacto positivo en las personas.\n“Es importante en este momento estar ahí para nuestros fans. Mientras todo el mundo está varado en casa en autoaislamiento, me parece importante seguir sacando cosas para darle un poquito de luz a sus días”, dijo Payne.", "url": "https://apnews.com/a6c953f59c7d43fc9053fccf3afbd645"}