{"authors": ["David Blank"], "date_download": "2020-05-04 17:02:20", "date_modify": "2020-05-04 17:02:20", "date_publish": "2020-04-10 15:16:29", "description": "A single white truck rolls down the desolate streets of Colerain Township, outside of Cincinnati, Ohio. Residents sheltering from the coronavirus peer from their windows, some waving as the truck makes its rounds.", "filename": "2020_04_10_us_iyw-ohio-mailman-delivers-elderly-trnds_index_1588611740.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409203818-02-ohio-mailman-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_iyw-ohio-mailman-delivers-elderly-trnds_index_1588611740.html", "title": "This mailman in Ohio is delivering essential supplies to the elderly on his route", "title_page": "This mailman in Ohio is delivering essential supplies to the elderly on his route - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A single white truck rolls down the desolate streets of Colerain Township, outside of Cincinnati, Ohio. Residents sheltering from the coronavirus peer from their windows, some waving as the truck makes its rounds.\nTo the casual observer, it's just a postal truck.\nBut these days, it's also a lifeline, and the mailman driving the truck, Kyle West, delivers much more than letters.\nA mail route in distress\nIt started about five weeks ago with a conversation that West, 23, had with an elderly person on his route who needed toilet paper. On his own time, the mailman went to a nearby store to pick up the goods. There, he saw a frenzied scene, sparse shelves and another elderly mail customer leaving empty-handed, defeated by the long lines and chaos.\nKyle West made notes to bring to his customers to facilitate supply requests.\nWest picked up goods for both senior customers and delivered them the next day. After talking to others on his route, he realized far too many customers were suffering similar problems. But one, a well-prepared patron, donated a stockpile of toilet paper and paper towels to West's new mission.\nA letter carrier on a mission\nThe man known as \"Mailman Kyle\" has been delivering the letters in his hometown for almost two and a half years. During that time, he's gotten to know most of his customers -- either from face-to-face contact or through delivery messages he sometimes leaves behind with packages and other mail. West realized message slips would be a great way to communicate with customers during the quarantine.\nWest says the US Postal Service is following a stringent safety protocol, providing masks, gloves and sanitizer for its letter carriers.\n\"I had notes made to bring to my customers to let them know how I could help them. I have the toilet paper in my truck. I'll put rolls in my satchel and drop them off based on what their notes request.\"\nMeanwhile, West continues his appointed rounds and feels the love. He says the US Postal Service is following a stringent safety protocol, providing masks, gloves and sanitizer for its letter carriers.\nAnd customers are also grateful.\n\"It's nice to see thank you notes,\" West tells CNN. \"I'm getting more than I've ever seen before in mailboxes.\"\nHe's also getting messages from people he's never met; family members of the elderly he's helping.\n\"I've gotten phone calls from people's kids. I've gotten more 'thank yous' than I've ever gotten in my postal career.\"\nThe mailman always delivers\nWest points out that nationwide, letter carriers are continuing to perform a crucial service.\n\"We are delivering so many essential things to people. We're delivering more medicine than ever right now.\"\nAnd he urges the public to continue taking the health crisis seriously.\n\"If 50 percent of the post office gets sick, who's going to get this medicine? We need people to follow the CDC guidelines so people can keep on keepin' on.\"\nWest truly lives the philosophy that the post office always delivers, with nothing keeping this mailman from his appointed rounds.", "url": "https://www.cnn.com/2020/04/10/us/iyw-ohio-mailman-delivers-elderly-trnds/index.html"}