{"authors": ["Chris Isidore", "Cnn Business"], "date_download": "2020-05-04 17:03:06", "date_modify": "2020-05-04 17:03:06", "date_publish": "2020-04-10 21:03:58", "description": "Car insurers are giving billions back to drivers. But the industry is saving even more during the pandemic, even after subtracting the payments being made to policyholders.", "filename": "2020_04_10_business_car-insurance-rebates-coronavirus_index_1588611786.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409081401-lone-car-detroit-0408-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_business_car-insurance-rebates-coronavirus_index_1588611786.html", "title": "Car insurers' rebates and discounts are giving billions back to drivers. It may not be enough", "title_page": "Car insurers' rebates and discounts are giving billions back to drivers. It may not be enough - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) With most of the country operating under stay-at-home orders, drivers are spending less time on the road -- which means fewer accidents and insurance claims.\nNow the top 10 insurers, who together own 72% of the market, have all announced programs to return more than $7.5 billion to their customers in coming weeks.\nBut some watchdog groups say insurers could -- and should -- be doing more. The industry is saving tens of billions of dollars during the pandemic, they say, even after subtracting the payments being made to policyholders.\n\"It's good the industry is broadly participating in these credits,\" said Dan Karr, the CEO of ValChoice , a data analytics company that acts as an insurance industry watchdog. \"However, all of these discounts, rebates and credits are still dimes on the dollar compared to how much profit Covid-19 is likely to deliver to auto insurance companies.\"\nThe top 10 insurers collect annual premiums of $178 billion, according to the Insurance Information Institute. Claims data isn't yet available for the weeks since the pandemic caused roads and highways to empty out -- but given the historical data for the relationship between accidents and traffic, it's likely the amount being returned to policyholders will be only a fraction of what the insurers might save from reduced claims, said Karr.\nRead More", "url": "https://www.cnn.com/2020/04/10/business/car-insurance-rebates-coronavirus/index.html"}