{"authors": ["Will Ripley", "James Griffiths"], "date_download": "2020-05-04 16:25:20", "date_modify": "2020-05-04 16:25:20", "date_publish": "2020-04-07 04:18:01", "description": "Much of Japan will enter a state of emergency Tuesday, as the country struggles to rein in the coronavirus pandemic, months after the first domestic cases were reported.", "filename": "2020_04_07_asia_japan-coron_a6a1f1d46c3d2425bc859b11447609ed_index_1588609520.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407101356-abe-japan-0406-01-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_asia_japan-coron_a6a1f1d46c3d2425bc859b11447609ed_index_1588609520.html", "title": "Japan to declare state of emergency over coronavirus pandemic", "title_page": "Japan to declare state of emergency over coronavirus pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Tokyo (CNN) Much of Japan will enter a state of emergency Tuesday, as the country struggles to rein in the coronavirus pandemic, months after the first domestic cases were reported .\nPrime Minister Shinzo Abe said that \"basic economic activity\" will continue in Tokyo, Kanagawa, Saitama, Chiba, Osaka, Hyogo and Fukuoka, the seven affected prefectures, with public transport and supermarkets remaining open, but urged people to exercise social distancing and avoid unnecessary trips.\nThe state of emergency, which is expected to be formally announced at a press conference Tuesday,will last for approximately one month. The declaration comes as Japan reported 252 new cases of the coronavirus and seven more deaths Monday, bringing the total number of infections to over 4,600, with 91 deaths.\nAbe has faced criticism for not activating emergency measures earlier , as experts warned the true number of cases could be far higher than the official statistics suggest, due to a lack of widespread testing.\nGrowing concerns\nThe Japanese capital Tokyo is among one of the country's worst hit areas, and on Monday doctors in the city declared a state of medical emergency , citing a possible collapse of the healthcare system.\nOzaki Haruo, president of the Tokyo Medical Association, told reporters Monday that the rising number of coronavirus cases could result in a shortage of beds and the spreading of the virus within hospitals, according to Japanese public broadcaster NHK.\nWhen this happens, medical staff will be unable to provide services to critically ill patients, Ozaki said, adding that the next six weeks will be critical in preventing an \"explosive spread\" of the virus.\nJapan only has seven intensive care beds for every 100,000 people, a fifth of the proportion available in the US.\nPart of the problem is that authorities had previously been urging anyone with symptoms to go to hospital, putting additional strain on the health care system. However, Dr. Yoshihiro Takayama, an infectious diseases specialist at Okinawa Chubu Hospital, said that the authorities are preparing to shift to a new policy of requiring those with mild symptoms to \"self-isolate at home.\"\nTakayama was concerned however that the number of cases could be far greater than it appears from the official statistics, due to the paucity of testing nationwide.\nAs of last week, Japan had only conducted some 30,000 tests, compared with almost 400,000 carried out in neighboring South Korea.\n\"In some cases, the number of patients may be several times, or could be ten times more. I think it is necessary to use such imagination and prepare the medical system to deal with it,\" Takayama said. \"The battle has only just begun.\"\nThe country is also facing a potential shortage of ventilators for the worst affected. As of February, Japan was estimated to have more than 22,000 ventilators, for a population of over 126 million, according to a report in NHK.\nAt least 40% of those ventilators are already in use, as officials scramble to ramp up production and source new machines from overseas.\nJUST WATCHED Japan's tourism industry braces for economic 'bloodbath' Replay More Videos ... MUST WATCH Japan's tourism industry braces for economic 'bloodbath' 02:37\nSlow response\nJapan, with strong economic and transport links to China, was among the first countries to report cases of the coronavirus. For a long time, an outbreak on board the Diamond Princess cruise ship, docked in Yokohama, was the worst outside mainland China.\nDespite this long exposure to the virus, the country has been slow to take the kind of radical steps seen in many other parts of the world, and officials have faced accusations of deliberately dragging their feet to avoid greater damage to the economy after the postponement of the Tokyo Olympics, which is expected to cause a big hit\nBut experts have warned that the failure to respond quickly could result in a far worse situation.\n\"Japan needs to have the courage to change, when we are aware we are on the wrong path,\" said Kentaro Iwata, an infection control specialist from Kobe University, who has repeatedly warned that Japan isn't doing enough to halt the spread of the virus. \"We might see the next New York City in Tokyo.\"\nIwata said that the situation in the Japanese capital is comparable to that in New York, Spain and Italy just before they saw explosions in the number of cases, and he called on the government to conduct more widespread testing in order to get an idea of the true number of infections.\nThe Japanese government says its testing regime is adequate and suitably targeted to high risk cases.\n\"Testing people with a low probability of novel coronavirus would be a waste of resources,\" Japan's Health Ministry told CNN in a statement. \"We ask people with some symptoms to stay home for a period of time.\"\nA government panel warned last week that hospitals and medical clinics in Tokyo, Aichi, Kanagawa, Osaka and Hyogo were already stretched and that \"drastic countermeasures need to be taken as quickly as possible.\"", "url": "https://www.cnn.com/2020/04/07/asia/japan-coronavirus-state-of-emergency-intl-hnk/index.html"}