{"authors": ["Scottie Andrew"], "date_download": "2020-05-04 17:01:23", "date_modify": "2020-05-04 17:01:23", "date_publish": "2020-04-10 12:54:09", "description": "Time's latest edition has five different covers - each spotlighting a worker on the front lines of the coronavirus fight: paramedics, an anesthesiologist and a cafeteria employee.", "filename": "2020_04_10_media_time-magazine-coronavirus-covers-trnd_index_1588611683.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410065209-time-magazine-covid-19-covers-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_media_time-magazine-coronavirus-covers-trnd_index_1588611683.html", "title": "This week's Time magazine cover spotlights coronavirus front line workers", "title_page": "This week's Time magazine cover spotlights coronavirus front line workers - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The \"essential workers\" charged with keeping America afloat during the coronavirus pandemic risk their lives daily. Now, the health care workers, grocery store employees and everyday people we depend on are telling their own stories on the cover of Time magazine this week.\nTime's latest edition has five different covers - each spotlighting a worker on the front lines of the coronavirus fight: paramedics, an anesthesiologist and a cafeteria employee.\nTheir stories and more are featured in print and online, told through photos or videos they took of themselves on the job or interviews with Time correspondents who spent shifts with them.\nMedia organizations have had to get creative to cover the coronavirus crisis while working remotely. Some reporters, including CNN's Lauren del Valle and Miguel Marquez and Time's Charlotte Alter, have been granted access inside hospitals to cover the crisis from the ground, though their time there is limited and they must follow strict safety precautions.\nRead More", "url": "https://www.cnn.com/2020/04/10/media/time-magazine-coronavirus-covers-trnd/index.html"}