{"authors": [], "date_download": "2020-05-04 20:04:32", "date_modify": "2020-05-04 20:04:32", "date_publish": "2020-04-07 18:44:04", "description": "COLLEGE PARK, Md. (AP) — Maryland forward Jalen Smith intends to enter the 2020 NBA Draft and forgo his remaining two years of eligibility. Smith averaged 15.5 points and 10.5 rebounds as a...", "filename": "_c3e569c3c08788d2e0efc7c7b85fd2a0_1588622672.html", "image_url": "https://storage.googleapis.com/afs-prod/media/039eb92f755443ef8c4597e6fffdab2c/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c3e569c3c08788d2e0efc7c7b85fd2a0_1588622672.html", "title": "Maryland star Jalen Smith to leave school for NBA draft", "title_page": "Maryland star Jalen Smith to leave school for NBA draft", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Maryland forward Jalen Smith (25) dunks against Michigan guard Eli Brooks (55), guard Zavier Simpson (3) and forward Isaiah Livers, back, during the second half of an NCAA college basketball game, Sunday, March 8, 2020, in College Park, Md. (AP Photo/Nick Wass)\nMaryland forward Jalen Smith (25) dunks against Michigan guard Eli Brooks (55), guard Zavier Simpson (3) and forward Isaiah Livers, back, during the second half of an NCAA college basketball game, Sunday, March 8, 2020, in College Park, Md. (AP Photo/Nick Wass)\nCOLLEGE PARK, Md. (AP) — Maryland forward Jalen Smith intends to enter the 2020 NBA Draft and forgo his remaining two years of eligibility.\nSmith averaged 15.5 points and 10.5 rebounds as a sophomore, helping the Terrapins to a 24-7 finish and a share of the Big Ten regular-season title. He ranked first in the conference and third nationally with 21 double-doubles.\nThe 6-foot-10 star announced his plans to leave on Tuesday, saying, “The time is right for me to move forward to the next phase in my basketball career.”\nMaryland made the NCAA Tournament during Smith’s freshman year and was poised to return as a high seed before the coronavirus brought an abrupt end to the 2019-20 season.\nTerrapins coach Mark Turgeon was appreciative of Smith’s contribution and looked forward to seeing him perform at the next level.\n“From the minute we started recruiting Jalen, we knew the kind of quality player and person we would be getting and he lived up to it in every way,” Turgeon said. “As incredible of a player Jalen is on the court, he is that and more as an individual off the court. We will miss him in College Park.”\nA 2020 First Team All-Big Ten and All-Defensive Team selection, Smith was the only player in the country to have 60 blocks and 30 3-pointers.\n___\nMore AP college basketball: https://apnews.com/Collegebasketball and https://twitter.com/AP_Top25", "url": "https://apnews.com/c3e569c3c08788d2e0efc7c7b85fd2a0"}