{"authors": ["Holly Ramer", "Kathy Mccormack"], "date_download": "2020-05-04 20:04:10", "date_modify": "2020-05-04 20:04:10", "date_publish": "2020-04-08 14:23:11", "description": "CONCORD, N.H. (AP) — Health officials said Wednesday there have been outbreaks of COVID-19 at three long-term care facilities in New Hampshire, and state leaders expressed frustration about being...", "filename": "_3233dbc400d232c3d7fa44dabf6d53d3_1588622650.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3233dbc400d232c3d7fa44dabf6d53d3_1588622650.html", "title": "NH gets unusable testing machines, 10 die in long-term care", "title_page": "NH gets unusable testing machines, 10 die in long-term care", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CONCORD, N.H. (AP) — Health officials said Wednesday there have been outbreaks of COVID-19 at three long-term care facilities in New Hampshire, and state leaders expressed frustration about being sent new machines to test for the disease caused by the coronvirus without supplies to use them.\nOther developments in New Hampshire:\nNURSING HOME OUTBREAKS\nTen people have died and 90 others have tested positive for COVID-19 at three long-term care facilities in New Hampshire, the state’s health commissioner said Wednesday.\nNineteen assisted living residents and 11 staff members at the Huntington at Nashua have tested positive for the disease caused by the coronavirus, and five residents have died, said Health and Human Services Commissioner Lori Shibinette.\nAt the Hanover Hill nursing home in Manchester, there have been four resident deaths among 37 infected residents and 13 infected employees. And at a group home run by the Crotched Mountain Foundation in Greenfield, one resident has died after three residents and 11 staff members were diagnosed.\nThe New Hampshire Health Care Association, which represents nursing homes, is calling on the state to use federal Medicaid money to support nursing home care as several other New England states have done.\n___\nUNUSABLE TESTING MACHINES\nNew Hampshire received 15 machines from the federal government that confirm within minutes if someone tests positive for the coronavirus — but it can’t use them due to a lack of test cartridges.\nThe state expected 1,500 cartridges for the machines, but only received 120.\n“I’m banging my head against the wall, I really am,” Gov. Chris Sununu said Wednesday. “It’s really frustrating. We’re going to keep pushing on Washington multiple times a day to get what we need.”\nU.S. Sen. Jeanne Shaheen wrote to the Federal Emergency Management Agency, saying she finds it “unacceptable” that the state won’t be able to use the machines to the fullest extent possible.\n___\nSPENDING OVERSIGHT\nLegislative leaders are trying to assert their authority over spending federal money allocated in response to the pandemic.\nRepublican Gov. Chris Sununu said Tuesday he will create a Governor’s Office for Emergency Relief and Recovery with “a bipartisan legislative advisory board” to ensure input and transparency.\nHouse Speaker Steve Shurtleff and Senate President Donna Soucy, both Democrats, argue that state law expressly requires that the Legislature’s joint fiscal committee approves any expenditures during an emergency.\nThe committee meets Friday.\n___\nUNEMPLOYMENT CLAIMS\nNew Hampshire has seen more unemployment claims in the last three weeks due to the coronavirus pandemic than in the last three years, a state official said Wednesday.\nThe state has received 100,000 new claims since March 17, said George Copadis, commissioner of New Hampshire’s Department of Employment Security. More than 67,000 claims have been paid for nearly $19 million.\n___\nINSURANCE ENROLLMENT\nU.S. Sen. Jeanne Shaheen on Wednesday urged the Trump administration to reopen the Affordable Care Act’s health insurance marketplaces during the coronavirus pandemic.\nMultiple states have started special enrollment periods, and others are urging the administration to open a similar window for more Americans. The White House has said it would reimburse hospitals that treat uninsured patients for COVID-19, and the massive rescue package signed into law last month set aside $100 billion for hospitals for uncompensated care.\nShaheen, a Democrat, criticized that approach.\n“It doesn’t make sense to take the billions of dollars that are going to keep our rural hospitals afloat and use it to provide health insurance coverage when people can get health insurance coverage on the market,” she said.\n___\nTHE NUMBERS\nAs of Tuesday, 788 people in New Hampshire have tested positive for the COVID-19. Eighteen people have died.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and the infirm, it can cause more severe illness, including pneumonia, or death.\n___\nREQUEST TO RELEASE INMATES\nDale Holloway, accused of shooting a New Hampshire church pastor and bride during a wedding and later attacking his own lawyer, is among inmates asking to be released from jail on house arrest due to health concerns over the spread of the coronavirus.\nHolloway, who requires treatment by inhaler for asthma, has pleaded not guilty to attempted murder, assault and other charges related to the October shooting at a Pelham church. A hearing on his request is set for April 14.", "url": "https://apnews.com/3233dbc400d232c3d7fa44dabf6d53d3"}