{"authors": ["Dave Kolpack"], "date_download": "2020-05-04 20:17:51", "date_modify": "2020-05-04 20:17:51", "date_publish": "2020-04-07 21:46:39", "description": "A Microsoft engineer who designed an app to track North Dakota State University football fans on their annual trek to Texas for the national championship has taken that concept and applied it to...", "filename": "_d9d1a9a8d2a7333adf9ca369ad04329d_1588623471.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f9ee4cc0aecc4fc8a6b92cca23a808da/2750.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d9d1a9a8d2a7333adf9ca369ad04329d_1588623471.html", "title": "Microsoft engineer adapts fan-tracking app for COVID-19 use", "title_page": "Microsoft engineer adapts fan-tracking app for COVID-19 use", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This March 14, 2012, photo, provided by Sanford Health, shows Tim Brookins, principal software engineer at the Fargo, N.D. Microsoft campus and CEO of sports app software company ProudCrowd, in Fargo. Brookins came up with the popular Bison Tracker app to track the movements of North Dakota State fans on their way to a national championship game in Texas. Now he has taken that idea to design an app meant to help reduce the spread of the new coronavirus by retracing the steps of people who test positive for the virus. (Courtesy of Sanford Health via AP) This March 14, 2012, photo, provided by Sanford Health, shows Tim Brookins, principal software engineer at the Fargo, N.D. Microsoft campus and CEO of sports app software company ProudCrowd, in Fargo. Brookins came up with the popular Bison Tracker app to track the movements of North Dakota State fans on their way to a national championship game in Texas. Now he has taken that idea to design an app meant to help reduce the spread of the new coronavirus by retracing the steps of people who test positive for the virus. (Courtesy of Sanford Health via AP)\nA Microsoft engineer who designed an app to track North Dakota State University football fans on their annual trek to Texas for the national championship has taken that concept and applied it to contact tracing for the coronavirus.\nThe Care19 app is meant to help reduce the spread of COVID-19 by retracing the steps of people who test positive for the virus, in order to find others who may have had contact with the sick person and also collect data to help with modeling, Gov. Doug Burgum said Tuesday during his daily briefing.\n“This is a way that every North Dakotan can save lives by downloading the Care19 app,” Burgum said.\nTim Brookins, 55, a principal software engineer at Fargo’s Microsoft campus and CEO of sports app software company ProudCrowd, came up with the popular Bison Tracker app a half-dozen years ago. Last year, more than 15,000 football fans from various states and provinces accessed the app en route to North Dakota State’s eighth national title in nine years.\nBurgum, a former executive at Microsoft, sparked the idea at a COVID-19 brainstorming session with Microsoft engineers when he introduced Brookins as the creator of Bison Tracker.\n“My staff just lit up and said, ‘That’s what we need,’” Brookins told The Associated Press.\nThe app is free and optional. It has been approved for Apple users and should be available for Android devices in about a week, Burgum said.\nLike the Bison Tracker, Care19 is anonymous and doesn’t ask for names, phone numbers or log-in information. Once the app is downloaded, individuals will be given a random ID number and it will cache the individual’s locations throughout the day. Users are then encouraged to categorize their movement into different groups such as work or grocery.\nState health officials have so far been relying on extensive interviews with people who are sick, or in some cases incapacitated. The app should show all the places the user has been for at least 15 minutes, the time it takes to put people at high risk for contracting the virus if there’s face-to-face contact, according to federal health officials.\nThe app can also assign a risk score to the users depending how they move and interact across the state, Brookins said. If a person stays home for the most part with maybe an occasional trip to the grocery store or gas station, he or she would be assigned to a low-risk pool. If people go to work for eight hours, in many cases for jobs deemed essential, that would likely place them in the high-risk bucket.\nThe information should be valuable for state officials in their modeling and planning, said Brookins, noting that Burgum is a “very data-driven man.” One reason the governor has not issued a stay-at-home order is because he said he hasn’t found statistics showing that it makes a difference.\n“Everybody wants to know, especially our president, when we can go back to normal, when we can release the stay-at-homes, things like that,” Brookins said. “Well, knowing how people are moving will inform that and we’ll have much better projections.”", "url": "https://apnews.com/d9d1a9a8d2a7333adf9ca369ad04329d"}