{"authors": ["Donie O'Sullivan Video Sofia Barrett"], "date_download": "2020-05-04 16:18:25", "date_modify": "2020-05-04 16:18:25", "date_publish": "2020-04-04 12:33:06", "description": "The Trump administration wants to use Americans' smartphone location data to help track and combat the spread of coronavirus. Now, a pair of US data companies are making a public pitch to show just how that kind of technology might work.", "filename": "2020_04_04_tech_location-tracking-florida-coronavirus_index_1588609105.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403160149-miami-beach-0318-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_tech_location-tracking-florida-coronavirus_index_1588609105.html", "title": "How the cell phones of spring breakers who flouted coronavirus warnings were tracked", "title_page": "How the cell phones of spring breakers who flouted coronavirus warnings were tracked - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Trump administration wants to use Americans' smartphone location data to help track and combat the spread of coronavirus. Now, a pair of US data companies are making a public pitch to show just how that kind of technology might work.\nThe results of tracking data, a map posted on Twitter , showed where people went after they visited the beach, spreading out all across the country to major cities including New York and Chicago, possibly bringing the coronavirus with them.\nX-Mode says it provides location tracking services to app makers for the likes of weather and transit apps. The locations of spring breakers and others with those apps on their phones could have been tracked. X-Mode says the data it collects through apps and then provides to advertisers and other companies is anonymized, meaning it does not match individuals to the devices it tracks. The company did not provide the names of the apps their technology is embedded in.\n\"We wanted to showcase the impact of what happens when you don't exercise social distancing and essentially how small our community is,\" Josh Anton, X-Mode's CEO, told CNN Business on Tuesday. \"Our community's very connected.\"\nThe map generated from X-Mode's data by Tectonix, a data visualization firm, is indeed powerful and underlines why the US government might be considering using location data from Americans' cell phones to try to track and possibly curtail the spread of the coronavirus.\nIt also may point to a potential sea change in how some in the tech industry talk about the data they possess. Silicon Valley has endured years of high-profile data privacy scandals. But now smaller companies like X-Mode, unheard of unknown by the majority of Americans, are publicly touting demonstrations of their technology — suggesting businesses like theirs see the potential of helping track the spread of the coronavirus as an opportunity to show how their often maligned data can be used for good. Cuebiq, another location tracking company, has been similarly public about its abilities.\nAcross the globe governments are weighing the need to contain the virus against citizens' privacy, with privacy losing in some cases. Israel last month deployed spy technology to track coronavirus patients and the people they may have come in contact with. And authorities in Moscow are using the city's vast system of 170,000 surveillance camera with facial recognition technology to catch and fine people violating quarantine and self-isolation rules.\nFacebook and Google confirmed to CNN Business in March that they were exploring ways to use aggregated, anonymized data to help in the US coronavirus effort. The location data conversations were part of a series of interactions between the White House and the tech industry about how Silicon Valley could can contribute to the response to the pandemic.\nThe potential embrace of such technologies by the US government is leaving privacy advocates feeling uneasy.\nDavid Carroll, an associate professor at The New School in New York and a privacy campaigner who has worked for years exposing Facebook's Cambridge Analytica data scandal, warned the coronavirus pandemic could be used as a way to undermine American civil liberties.\n\"Pandemics offer an urgent justification to surrender to surveillance that informs response efforts. But privacy protections, especially related to health data, are among the first to be rescinded in this type of emergency,\" Carroll told CNN Business on Wednesday.\n\"Beyond taking pains to exploit our location data responsibly and temporarily, we need to ensure that when we return to normal, we do the work of dismantling the pandemic panopticon and finish overdue reform in the United States, which includes improving how we enforce fundamental data protection rights around the world,\" he added. \"Otherwise pandemic-level surveillance capabilities will surely be abused.\"\nLocation tracking, like what X-Mode does, is not out of the ordinary in the technology industry, but normalizing it could incentivize exploitation of such capabilities.\nAnton says X-Mode does not match people's identities to the devices it tracks and that the company complies with European and Californian privacy laws, both Europe and California have implemented new data privacy laws in recent years.\nBut as an investigation by The New York Times found in 2018 , anonymization of data does not always guarantee individuals cannot be identified.\nAnton said his company would be willing to assist the US government if it could help save lives — pointing to how the company's data was previously used in a study aimed at improving how ambulances are dispatched after a disaster.\nThe CEO said he believes any tracking tool built for this purpose should ask for the consent of the people being tracked. \"People will willingly consent for something like that if it means saving their lives,\" he said, \"people they know, or people they don't.\"", "url": "https://www.cnn.com/2020/04/04/tech/location-tracking-florida-coronavirus/index.html"}