{"authors": ["Arnie Stapleton"], "date_download": "2020-05-04 20:23:46", "date_modify": "2020-05-04 20:23:46", "date_publish": "2020-04-16 19:36:04", "description": "ENGLEWOOD, Colorado (AP) — For the first time in four years, John Elway didn’t spend his offseason analyzing quarterbacks ad nauseam. He’s set at QB at long last with second-year pro Drew...", "filename": "_441e3b5e8cfab3f54ca625ff8c3aa4b1_1588623826.html", "image_url": "https://storage.googleapis.com/afs-prod/media/16f130d4b5724477975d52aabf176360/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_441e3b5e8cfab3f54ca625ff8c3aa4b1_1588623826.html", "title": "Broncos' Elway building around his quarterback for a change", "title_page": "Broncos' Elway building around his quarterback for a change", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Feb. 25, 2020, file photo, Denver Broncos president of football operations and general manager John Elway speaks during a press conference at the NFL football scouting combine in Indianapolis. Elway has selected a defensive player with his first draft pick six times in his nine drafts. (AP Photo/Michael Conroy, File)\nFILE - In this Feb. 25, 2020, file photo, Denver Broncos president of football operations and general manager John Elway speaks during a press conference at the NFL football scouting combine in Indianapolis. Elway has selected a defensive player with his first draft pick six times in his nine drafts. (AP Photo/Michael Conroy, File)\nENGLEWOOD, Colorado (AP) — For the first time in four years, John Elway didn’t spend his offseason analyzing quarterbacks ad nauseam.\nHe’s set at QB at long last with second-year pro Drew Lock, who won four of his five starts last season, his only loss coming in the snow at Kansas City.\n“It feels a little better ... without having to worry about that position,” Elway said as he prepared for the NFL draft , in which half of the Denver Broncos’ 10 picks are in the top 100.\nWhile stressing that Lock has “a long way to go” Elway said he feels he’s finally found a worthy successor to Peyton Manning, who retired four years ago.\n“Now is the fun part of trying to fill around him,” said Elway, who began that task with the free agent signings of O-lineman Graham Glasgow, running back Melvin Gordon, tight end Nick Vannett and backup QB Jeff Driskel.\nIt continues in the draft. The Broncos own the 15th overall selection in the first round.\nThe Broncos’ biggest needs are fortifying the front line and giving Lock more targets, necessities that intersect with two of the draft’s deepest positions.\nA wide receiver class like none other could land Alabama’s Henry Ruggs III or Jerry Jeudy in Denver, or Elway might take a tackle if the likes of Georgia’s Andrew Thomas is there at 15.\n“We still have enough needs on both sides of the ball that I think the best player will still be the philosophy used for the most part,” coach Vic Fangio said.\nAlthough Elway wouldn’t be averse to grabbing a passer in the latter rounds, the turnstile at quarterback in Denver has finally stopped.\n“We’re thrilled the way Drew finished, finished 4-1. I think where we sit right now there is no question that Drew is the guy,” Elway said, adding, “We’re always going to try and surround the quarterback with people that he can be successful with and also protect him.”\nHere are some other things to keep in mind as Elway enters his 10th draft:\nDEFENSE FIRST\nElway has selected a defensive player with his first draft pick six times in his nine drafts. The outliers: QB Paxton Lynch in 2016, LT Garett Bolles in 2017 and TE Noah Fant last year.\nLynch was a bust and Bolles has been flagged 46 times in 48 games, but Fant looks like a gem after a solid rookie season.\nElway demurred when asked if he plans to exercise Bolles’ fifth-year option: “Don’t know yet. We’re going to wait until after the draft on Bolles.”\nPLAYOFF DROUGHT\nThe Broncos are counting on a third straight solid draft class to help them end a four-year playoff drought, something that became a tad easier when the league voted to add another wild-card team in each conference to the Super Bowl chase.\n“Yeah, we’re close,” Elway said. ”... the last couple of drafts have been pretty successful and so you know we’ve got to keep building on that. I’m excited about (having) a bunch of picks again this year and so if we do the right things, and if the young guys get better ... then we’ll have a chance to get competitive.”\nFILM STUDY\nWith in-person visits forbidden, NFL teams are having to rely more heavily on game film of college prospects as they prepare for the draft at a time when the COVID-19 pandemic has halted business as usual across the globe.\nFangio said scouts and college personnel appraisers are fond of suggesting that nine-tenths of the evaluation of a player is based on what he did in college, with just 10% coming off the NFL scouting combine, college pro days and personal interviews.\n“This is the year that it’s really put to the test,” Fangio said.\n___\nFollow Arnie Melendrez Stapleton on Twitter: http://twitter.com/arniestapleton\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/441e3b5e8cfab3f54ca625ff8c3aa4b1"}