{"authors": ["Nathaniel Meyersohn", "Cnn Business"], "date_download": "2020-05-04 16:20:19", "date_modify": "2020-05-04 16:20:19", "date_publish": "2020-04-05 13:42:19", "description": "America's grocery stores, retail chains and warehouses staying open during the coronavirus crisis can't seem to agree on how exactly to keep their millions of workers safe at the height of a pandemic.", "filename": "2020_04_05_business_walmart_72cbf3820208a99008afc49a748acbd5_index_1588609219.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404074602-01-coronavirus-shopping-0313-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_business_walmart_72cbf3820208a99008afc49a748acbd5_index_1588609219.html", "title": "Companies are making their own safety rules as the federal government stands aside", "title_page": "Companies are making their own safety rules as the federal government stands aside - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) America's grocery stores, retail chains and warehouses staying open during the coronavirus crisis can't seem to agree on how exactly to keep their millions of workers safe at the height of a pandemic.\nandannounced last week that they plan to start taking employees' temperatures before they come into work and provide masks and gloves if workers want to wear them.\nsaid it will provide workers with masks and gloves and will \"strongly encourage that they be worn while working.\" But it's not taking workers' temperatures.\nwill give thermometers to workers and ask them to check their own temperatures before showing up, but it's not providing workers with masks., its top rival, is doing the opposite: The hardware chain will give masks to workers who want them, but it's not offering them thermometers or taking their temperatures before they come in.\nMeanwhile,andhave not announced new measures on personal protective equipment for employees or taking workers' temperatures before they show up.\nThe National Retail Federation, which represents the industry, defended its members, saying they're following government guidance guidance and recommendations. \"Health and safety are priority number one for retailers during this crisis,\" a spokesperson for the group said.\nBut the federal government lacks uniform directions for all retailers and grocery stores to protect workers during the pandemic. In the absence of enforceable federal standards, retailers have created a patchwork system as the outbreak worsens and workers' fears of contracting the virus on the job intensify.\nThis has hamstrung worker protection efforts, public health experts and union leaders say. Retailers are not health care experts and the mix of policies are a safety risk for shoppers because these stores are one of the few public spaces still open. Millions of Americans are still visiting them every day and coming into close contact with workers who may be exposed to the virus.\nTarget will provide workers with masks and gloves and \"strongly encourage that they be worn while working.\"\n\"Without overarching guidelines from the federal government, this has been a story of each state, each city, and each business doing it their own way,\" said Leonard Marcus, co-director of the National Preparedness Leadership Initiative at the Harvard School of Public Health.\nHowever, during a pandemic, \"uniformity is your strength\" to limit weak spots and contain the virus' spread, he said. Federal standards are the best way to achieve that goal.\nThe example of whether retailers should take customers' temperatures before they enter stores highlights their uncertainty on how to respond without action from public leaders.\nWalmart executive vice president of corporate affairs Dan Bartlett told reporters on a call Tuesday that the government would have to step in for that to happen. \"That's not for us to solve in my opinion. That's something that we would have to be given clear guidance from the government.\n'Missing in action'\nThe federal government isn't completely devoid of advice for worker safety during coronavirus. President Donald Trump said Friday his administration was now recommending Americans wear \"non-medical cloth\" face coverings, a reversal of previous guidance that suggested masks were unnecessary for people who weren't sick.\nThe Labor Department's Occupational Safety and Health Administration, which enforces workplace safety law, has issued guidance on preparing for coronavirus. But the guidance from OSHA is \"not a standard or regulation and it creates no new legal obligations\" for companies to fulfill. The recommendations OSHA provides are \"advisory in nature.\"\nOSHA has issued limited guidance to retailers and grocery stores. It says that workers in \"some high-volume retail settings\" have \"medium exposure risk\" and should employers should \"consider offering face masks to ill employees and customers.\" Additionally, workers with medium exposure risk \"may need to wear some combination of gloves, a gown, a face mask, and/or a face shield or goggles.\"\nIn a statement to CNN, a spokesperson for the Department of Labor said OSHA is \"using a risk-based approach to assess and prioritize our field work, and is employing all inspection protocols available to support the mission of protecting worker safety and health.\"\n\"OSHA is providing robust compliance assistance to employers and workers during this challenging time,\" the spokesperson added. \"The agency's proactive measures are focused on getting workers the protections they need -- this balanced with OSHA's enforcement tools.\" If OSHA found \"flagrant violations of the law, the agency would use all enforcement tools available.\"\nHouse Speaker Nancy Pelosi said Monday that OSHA should adopt an emergency standard with regulations for essential workers like pharmacists and grocery store workers.\nFormer OSHA leaders believe the agency should more aggressively enforce requirements, not just providing voluntary guidance to companies. The number of federal and state safety inspections of workplaces has fallen by more than 50% since the mid-March start of coronavirus restrictions, Bloomberg reported.\n\"OSHA is missing in action,\" said David Michaels, who ran OSHA during the Obama administration. \"This administration has decided that OSHA should not be actively involved in the response,\" he said.\nDebbie Berkowitz, a senior official for OSHA under President Obama and now a worker safety expert with the National Employment Law Project, said the agency was \"leaving it up to employers\" to decide on their own policies, jeopardizing both worker and public safety. \"Worker health is public health,\" she said. \"If we don't protect workers, it will spread and endanger the public.\"\nBerkowitz believes the agency should require and enforce that all retail and grocery chains provide masks to workers and require that they remain six feet apart at all times. \"This is all guidance now, not enforceable,\" she said. \"Employers can ignore it.\"\nMarc Perrone, president of the United Food and Commercial Workers union representing 1.3 million grocery and food processing workers, said \"the government really should take a position as it relates to people in these essential positions.\" UFCW represents workers at Kroger and Albertsons and has pushed for more stringent safety measures to protect workers in contracts with these companies.\nThe lack of uniform standards from federal officials \"does in fact jeopardize public safety\" because of the increase in customers visiting stores and also makes it more difficult for companies to craft responses, he said.\n\"The companies have, in fact, been trying to get ahead of it. They don't have a central notice about what they should do from OSHA.\"", "url": "https://www.cnn.com/2020/04/05/business/walmart-amazon-home-depot-masks-retail-coronavirus/index.html"}