{"authors": ["Zachary B. Wolf"], "date_download": "2020-05-04 16:10:50", "date_modify": "2020-05-04 16:10:50", "date_publish": "2020-04-02 18:15:32", "description": "The US government effectively shut down the US economy in its effort to keep Americans at home and, hopefully, slow the spread of Covid-19.", "filename": "2020_04_02_politics_what-matters-april-2-covid-economy_index_1588608650.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331130218-closed-gap-store-usa-0326-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_what-matters-april-2-covid-economy_index_1588608650.html", "title": "What Matters: Our economy and the way we live have been changed for good", "title_page": "What Matters: Our economy and the way we live have been changed for good - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story appeared in CNN's What Matters newsletter. To get it in your inbox, sign up for free here\n(CNN) The US government effectively shut down the US economy in its effort to keep Americans at home and, hopefully, slow the spread of Covid-19 .\nThe direct result is that a stupefying number of American workers -- nearly 10 million in two weeks -- filed for first-time unemployment benefits\nBut while it is now agonizingly clear the pandemic outbreak is nowhere near finished, the economic crater being dug to deal with the health crisis seems likely to last even longer and is already much worse than anyone predicted . That means it will be much harder for the government to put back together the economy it took apart in order to save lives.\nAt the same time, it's already possible to see how this outbreak will permanently change our lives.\nI talked to David Wessel, who is director of the Hutchins Center on Fiscal & Monetary Policy at the Brookings Institution, about exactly how unprecedented all of this is and how we all might go about putting back together a decimated economy. Read more from Brookings on this here\nOur conversation, edited slightly for flow, follows:\nTotally unprecedented \"kill switch\"\nZBW: It seems safe to say there is no precedent for what's taking place since, rather than fighting a war or dealing with failures in the economic system, the US and other countries intentionally hit the \"kill switch\" on economic activity. What parallels do you see between this and previous global events?\nThis is like a major war in some respects, but it's really unusual for the government to hit the \"kill switch\" and tell everyone to stay home, not go to work or to shop, and to close so many businesses. In wartime, we try to mobilize resources to increase production; this time, we are doing the opposite.\nThere's an interesting new paper by some San Francisco Fed economists that compares the long-run economic effects of major deadly pandemics to deadly wars: They note that wars destroy lots of physical capital; pandemics don't.\nAnd think how different this is from the days following 9/11 when President George W. Bush told us all the patriotic duty was to go shopping; now it's the opposite.\nMoving quickly is key\nZBW: In the Great Recession, the economy dug out for a long period after the housing crisis. But in this case the government has gone to extraordinary lengths almost before the worst of the pandemic has hit. Will that have any effect on how and whether the extraordinary measures by the Fed and the government work?\nDW: Answer: Yes!\nThe fiscal and monetary responses are aimed both at cushioning the blows to people hit hard by Covid-19 AND at keeping businesses and other employers on life support so we can more quickly restart the economy when the virus passes.\nI have no doubt the recession will be shorter and shallower and the recovery stronger than they would have been without these measures. But we're still going to have a deep recession, and a lot of people will get hurt economically. And unless all the virus disappears with unanticipated speed, Congress probably will need to do more\nHoping for a quick bounce back\nZBW: What do you make of the idea that since the economy appeared to be on solid footing and is now dealing with a \"force majeure rather than a fundamental problem, that it will bounce back?\nDW: Answer: Hope so.\nIt's true that the economy was in good shape before the virus hit, and that's a plus. We're a lot better off than Europe in that respect.\nWe don't yet know, though, how we will re-start the economy -- presumably in stages -- or whether the virus will return or how much damage we've done to the economy's capacity to produce goods and services.\nIf a lot of firms go under, if consumers are frightened, if banks are reluctant to lend, if travel and tourism is depressed for a long time, then the recovery could be painfully weak.\nThis will change the way we live\nZBW: What's your best guess as to what the US economy look like on the other side of this? Will this lead to permanent changes in the way Americans interact, work and trade.\nDW: Answer: Good question, hard to answer.\nWe'll surely -- I hope -- be investing more in public health after this. I suspect that the expansion of tele-medicine will last beyond the Covid-19 crisis.\nMore people may work from home with implications for transit systems and office space.\nWe may find that virtual conferences are a reasonably good substitute for in-person meetings and travel less often.\nAnd perhaps this'll show us the pros (and cons) of online education.\nOne thing seems likely: interest rates will be very low for a long time. That's bad for savers, good for borrowers.\nWill people save money for retirement and save differently, given the declines in their 401(k) plans?\nWe'll surely be re-examining the wisdom of importing so much from abroad, and will probably be sure we are producing more health care gear here at home.\nI think a really big question is whether we emerge from this with more sense of common purpose -- of helping each other -- or with even more xenophobia and hostility to immigrants and foreigners than we had before.\nWe all thought life would never be the same after 9/11, and in some respects, it isn't. We all had to get used to TSA screening at the airports. But New York City didn't wither, as some predicted. And until Covid-19 hit, I didn't sense any widespread anxiety about terrorism (other than the cyber kind) that changed the way we live.\nWorse by far than the Great Recession\nZBW: Around 10 million Americans have filed a first unemployment claim in the past two weeks. How should we all view these staggering figures in the weeks ahead?\nDW: Answer: Staggering is the right word.\nThe good news, if there is any, is that 6.6 million people managed to file claims despite all the reports of crashing computer systems and long waits on phone lines at state unemployment offices", "url": "https://www.cnn.com/2020/04/02/politics/what-matters-april-2-covid-economy/index.html"}