{"authors": ["General Assignment Reporter"], "date_download": "2020-05-04 20:13:01", "date_modify": "2020-05-04 20:13:01", "date_publish": "2020-04-30 17:12:30", "description": "The comedian and former talk show host first became pen pals with the ex-fixer for her mortal enemy, Donald Trump.", "filename": "entry_rosie-odonnell-michael-cohen-prison-visit_n_5eaada06c5b634687cb442c3_1588623181.html", "image_url": "https://img.huffingtonpost.com/asset/5eaae2b4240000f3018ea047.png?cache=hqlsxnu1x8&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_rosie-odonnell-michael-cohen-prison-visit_n_5eaada06c5b634687cb442c3_1588623181.html", "title": "Rosie O'Donnell Visited Michael Cohen In Prison. Yes, That Michael Cohen.", "title_page": "Rosie O'Donnell Visited Michael Cohen In Prison. Yes, That Michael Cohen. | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Rosie O’Donnell was willing to let bygones be bygones in her long feud with President Donald Trump ― well, at least with one of his associates.\nThe comedian told “Late Night” host Seth Meyers on Wednesday that she’d visited former Trump lawyer and fixer Michael Cohen in prison before the coronavirus pandemic swept across the U.S. She said Cohen was contrite about his crimes ― and apologized for his role in Trump’s treatment of her.\nCohen was sentenced to three years in prison in 2018 after he pleaded guilty to lying to Congress and violating campaign finance law by funneling hush money to women who allegedly had trysts with Trump.\nTrump has feuded with O’Donnell for years, starting long before he was elected president. He repeatedly threatened to sue the former talk show host, as is his pattern. But mostly the rivalry has involved name-calling. Trump has labeled her a “loser” and a “pig,” among other insults, while O’Donnell has dissed Trump as “dumb” and a “con man.”\nO’Donnell explained to Meyers that she saw something familiar in Cohen. As Trump’s impeachment unfolded, she found herself thinking that while Cohen was sitting in prison, the man he did the dirty work for was sitting in the White House.", "url": "https://www.huffpost.com/entry/rosie-odonnell-michael-cohen-prison-visit_n_5eaada06c5b634687cb442c3"}