{"authors": [], "date_download": "2020-05-04 20:24:19", "date_modify": "2020-05-04 20:24:19", "date_publish": "2020-04-08 22:40:12", "description": "OKLAHOMA CITY (AP) — The re-election bid of U.S. Rep. Kendra Horn, the only Democrat in the state's congressional delegation, drew nine challengers Wednesday as Oklahoma's three-day candidate...", "filename": "_7e582b77d6c629ecaa4e84d94ae148d5_1588623859.html", "image_url": "https://storage.googleapis.com/afs-prod/media/217495af8a8344b4b13f7fc8a10de4d5/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7e582b77d6c629ecaa4e84d94ae148d5_1588623859.html", "title": "9 challengers seek to beat Horn in Oklahoma's 5th District", "title_page": "9 challengers seek to beat Horn in Oklahoma's 5th District", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Paul Ziriax, right, Secretary of the Oklahoma State Election Board, wears a mask and gloves and practices social distancing due to COVID-19 concerns as people drive-thru a registration area for candidate filing outside the state Capitol Wednesday, April 8, 2020, in Oklahoma City. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Sue Ogrocki)\nPaul Ziriax, right, Secretary of the Oklahoma State Election Board, wears a mask and gloves and practices social distancing due to COVID-19 concerns as people drive-thru a registration area for candidate filing outside the state Capitol Wednesday, April 8, 2020, in Oklahoma City. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Sue Ogrocki)\nOKLAHOMA CITY (AP) — The re-election bid of U.S. Rep. Kendra Horn, the only Democrat in the state’s congressional delegation, drew nine challengers Wednesday as Oklahoma’s three-day candidate filing period opened.\nEight Republicans and one Democrat filed to take on Horn, who pulled off one of the country’s biggest upsets in 2018 when she knocked off a two-term GOP incumbent to win the 5th District seat, which includes Oklahoma City.\nState Election Board workers donned masks, gloves and face shields to accept paperwork from candidates who drove up to the state Capitol to file from their vehicles.\nU.S. Sen. Jim Inhofe, the state’s senior senator elected in 1994, filed for re-election on Wednesday and drew one Republican and two Democratic opponents.\nA Libertarian, a Democrat and Republican state Sen. Joseph Silk all filed to challenge U.S. Rep. Markwayne Mullin, a Republican seeking his fifth term in the 2nd District seat. Silk is giving up his seat to challenge Mullin.\nU.S. Rep. Tom Cole in the 4th District drew a Democratic challenger as well as two Republicans, and one Democrat filed to challenge U.S. Rep. Frank Lucas in the 3rd District.\nU.S. Rep. Kevin Hern, elected in 2018, is unchallenged for his 1st District seat in Tulsa.\nFiling continues through Friday.", "url": "https://apnews.com/7e582b77d6c629ecaa4e84d94ae148d5"}