{"authors": ["Eric Levenson"], "date_download": "2020-05-04 16:26:29", "date_modify": "2020-05-04 16:26:29", "date_publish": "2020-04-07 00:27:35", "description": "The rapid spread of coronavirus has sent states scrambling to buy ventilators. But ventilators do not operate on their own.", "filename": "2020_04_06_health_respirato_3738034f21e39511c7478379f5aa6b40_index_1588609589.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200326123140-04-coronavirus-ventilators-wisconsin-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_health_respirato_3738034f21e39511c7478379f5aa6b40_index_1588609589.html", "title": "These little-known health care workers operate the all-important ventilators", "title_page": "Respiratory therapists: These little-known health care workers operate the all-important ventilators - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The rapid spread of coronavirus has sent states scrambling to buy ventilators to prepare for a coming apex of cases.\nBut ventilators do not operate on their own. And while the ventilator shortage remains a serious issue , much less attention has been paid to the health care workers needed to operate those machines: respiratory therapists.\n\"It's not just this machine they talk about on TV that we don't have enough of. It's very complex,\" said Julie Eason, the respiratory therapy department director at University Hospital in Brooklyn , part of the SUNY Downstate Health Sciences University.\n\"If you don't set it up right, that patient outcome is different. You need skilled people who have lots of experience doing this to have good outcomes with these patients,\" she said.\nEnter the respiratory therapist, who is specially trained to treat people with breathing problems. Amid the coronavirus pandemic, their role as master of the mechanical ventilator has brought them a new level of recognition for what has long been an unfamiliar job.\n\"When I tell people I'm a respiratory therapist, they look at me with a blank stare,\" said Lisa Shultis, a respiratory therapist and director for Long Island University's respiratory care program. \"Until this time. Now they look at me with fear.\"\nA ventilator and other hospital equipment is seen in an emergency field hospital in New York's Central Park to aid in the response to the Covid-19 pandemic.\nRespiratory therapists are the ones who track Covid-19 patients' oxygen levels, manage their breathing and, if need be, intubate them and set up a mechanical ventilator.\nThere are 155,000 licensed respiratory therapists in the US, according to American Association for Respiratory Care (AARC). The job's median salary is just over $60,000 per year, according to the Bureau of Labor Statistics\nStill, their work remains \"virtually unknown,\" said Tom Kallstrom, the CEO and executive director of the AARC.\n\"On doctor (TV) shows, they never really show respiratory therapists,\" he said. \"They show others doing what we do. I'm grateful to know that at least people know who we are (now).\"\nWhat respiratory therapists do\nJUST WATCHED Trump says that there could be a shortage of ventilators Replay More Videos ... MUST WATCH Trump says that there could be a shortage of ventilators 01:50\nAs the name suggests, respiratory therapists focus on breathing -- the issue at the core of the pandemic.\nIn normal times, respiratory therapists treat acute conditions, such as premature babies with underdeveloped lungs or adults with heart attacks, as well as chronic issues, such as asthma or chronic obstructive pulmonary disease.\nNow, though, coronavirus is the focus. Coronavirus causes Covid-19, which affects the lungs and can lead to pneumonia, shortness of breath and, in worst-case scenarios, acute respiratory distress syndrome, known as ARDS.\n\"These patients are so different from any patients we have ever seen before,\" Eason said. \"We normally have a couple patients that are this level sick. (Now) our ICUs are filled with them. And filled with them. None of them can breathe.\"\nOne treatment for these issues is to provide supplemental oxygen through a nasal cannula, a device that goes into a patient's nose. If that doesn't work, then a more extreme treatment is to stick a tube down a patient's throat, known as intubation, and connect them to a mechanical ventilator that breathes for them. That's often a deteriorating patient's last best hope to recover.\nRespiratory therapists are tasked with tracking the patient's oxygen levels and working with physicians to decide if and when to use those treatments.\n\"It requires a lot of knowledge, experience and skill to be able to advise a physician on the best way to ventilate,\" said Tom Barnes, lead faculty member and consultant for Northeastern University's Master of Science in Respiratory Care Leadership program.\nTheir work helps alleviate the responsibilities of physicians and nurses.\n\"Neither party really has the background and training on mechanical ventilators that a respiratory therapist has,\" Kallstrom said. \"It's really a three-legged stool. You really need your doctor, nurse and respiratory therapist continually working together.\"\nRespiratory therapists sometimes are the ones who physically do the intubations. They set up and manage the ventilators. They then work its controls to adjust for the patient's needs: the size of the breath, the number of breaths per minute, the oxygen concentration, the airway pressure and more variables. And they set up alarms on the machine so that, if something goes wrong, the ventilator will alert nearby workers quickly.\n\"It's like if you were to sit in the cockpit of an airplane, you wouldn't know what to do,\" said Kallstrom. \"I don't think a ventilator is that confusing necessarily, but there are a lot of buttons and modes that a modern-day ventilator has.\"\nIt can be dangerous, too. Because respiratory therapists sometimes are the ones doing the intubations, hovering over an infected patient's open airways, they are particularly at risk of catching the virus.\n\"You have to see where you're going with that tube down the trachea, not the esophagus. It's very difficult when you've got a mask, goggles, everything on,\" Shultis said. \"The patient is having exhaled breaths in your face. So that's why it's very dangerous. That's why it's imperative that we have the right (personal protective equipment) for whomever is in the room, but especially for respiratory therapists.\"\nShultis, Kallstrom and Barnes said they have been frustrated watching officials and the media discuss the need for ventilators without acknowledging the role of respiratory therapists.\n\"They're out there working their hearts out and it's especially hard when people don't acknowledge them,\" Barnes said.\nIt's not just national figures, either. Shultis said even inside hospitals, respiratory therapists often aren't acknowledged on level footing with other health care workers.\n\"Call us by our name. We are not just the people who run the ventilators. We're respiratory therapists. We're an important profession on the health care team,\" she said.", "url": "https://www.cnn.com/2020/04/06/health/respiratory-therapist-ventilators-coronavirus/index.html"}