{"authors": ["Mark Morales", "Laura Ly", "Ralph Ellis"], "date_download": "2020-05-04 17:03:08", "date_modify": "2020-05-04 17:03:08", "date_publish": "2020-04-10 08:52:04", "description": "New York City officials say that Hart Island, which for decades has been used as the final resting place for people who died unclaimed, will also be used for unclaimed coronavirus victims.", "filename": "2020_04_10_us_new-york-hart-island-burials_index_1588611788.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409161959-09-week-in-photos-0409-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_new-york-hart-island-burials_index_1588611788.html", "title": "New York may bury unclaimed coronavirus victims on Hart Island", "title_page": "New York may bury unclaimed coronavirus victims on Hart Island - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) New York City officials say that Hart Island, which for decades has been used as the final resting place for people who died unclaimed, will also be used for unclaimed coronavirus victims.\nMayor Bill de Blasio responded Friday to concerns that mass burials would be necessary because of the high number of bodies caused by the pandemic. Drone photos appeared to show groups of caskets being covered with dirt in long trenches on Hart Island.\n\"There will be no mass burials on Hart Island,\" he tweeted. \"Everything will be individual and every body will be treated with dignity.\"\nThe mayor said in the tweet, \"The heartbreaking numbers of deaths we're seeing means we are sadly losing more people without family or friends to bury them privately. Those are the people who will be buried on Hart Island, with every measure of respect and dignity New York City can provide.\"\n\"This is not a new procedure,\" the mayor said at a news conference, adding it's a \"sad topic.\"\nRead More", "url": "https://www.cnn.com/2020/04/10/us/new-york-hart-island-burials/index.html"}