{"authors": ["Trends Reporter"], "date_download": "2020-05-04 20:15:31", "date_modify": "2020-05-04 20:15:31", "date_publish": "2020-04-28 01:30:08", "description": "The anecdote involving a delivery man and \"wall of penises\" could be a scene right out of her show.", "filename": "entry_wall-of-penises-phoebe-waller-bridge_n_5ea770d2c5b6dd3f908984a5_1588623331.html", "image_url": "https://img.huffingtonpost.com/asset/5ea7758224000078008e9d34.png?cache=ofoc7hghmd&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_wall-of-penises-phoebe-waller-bridge_n_5ea770d2c5b6dd3f908984a5_1588623331.html", "title": "Phoebe Waller-Bridge Shares Hilariously Awkward Story About Raunchy 'Fleabag' Prop", "title_page": "Phoebe Waller-Bridge Shares Hilariously Awkward Story About Raunchy 'Fleabag' Prop | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Phoebe Waller-Bridge shared a hilariously awkward real-life story that could truly be a scene straight out of her show “Fleabag.”\nDuring an interview on “The Graham Norton Show,” Waller-Bridge, who wrote, created and starred in the multiple award-winning British comedy series “Fleabag,” revealed she’s stuck with the show’s infamous “wall of penises” prop while isolating at home in England during the pandemic.\nAs fans may recall, the sculpture formed a part of the “Sexhibition” hosted by her godmother (played by Olivia Colman) in the finale of season one.\n“They’re all here, keeping me company,” Waller-Bridge laughed in her interview last week. “They’re actually stored here ... I’m meant to be moving into my office whenever lockdown is over, and I’m hoping it will eventually become a hat stand or something adorable like that.”\nCurrently, she said, the piece sits in the entryway to her home. Waller-Bridge said she felt the sculpture was a little too “intense” for the kitchen and bedroom but pondered whether it could work as a towel rack in the bathroom.\n“You know when you just put something down at your house, and then you don’t think about it for ages?” she said. “It just becomes invisible to you, and you forget that you have 12 massive penises at your front door.”\nShe said she was suddenly reminded of their presence when faced with a delivery man.\n“I suddenly saw them again, for the first time in ages, and I was like, ‘Oh, god, I’m so sorry!’ And he looked me dead in the eye and just said: ‘It’s art, never apologize for art.’”\nWaller-Bridge appeared on Norton’s program to promote the stage version of her show, which, following a sold-out stint on Broadway and West End, is now available to rent online on Amazon Prime Video for a $5 donation. Proceeds will be donated to a number of U.K. charities combating the coronavirus pandemic.\nIf you’re interested in seeing the sculpture, Waller-Bridge shows it off in the video below.", "url": "https://www.huffpost.com/entry/wall-of-penises-phoebe-waller-bridge_n_5ea770d2c5b6dd3f908984a5"}