{"authors": ["Cristina Alesci", "Kaitlan Collins"], "date_download": "2020-05-04 15:58:10", "date_modify": "2020-05-04 15:58:10", "date_publish": "2020-04-01 00:16:48", "description": "As he was facing intense criticism for a lack of adequate testing, President Donald Trump announced in the Rose Garden in mid-March that the federal government would partner with private companies to set up drive-thru coronavirus testing sites.", "filename": "2020_03_31_politics_drive-thru-coronavirus-testing_index_1588607890.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331194719-02-drive-through-testing-cvs-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_politics_drive-thru-coronavirus-testing_index_1588607890.html", "title": "Major retailers have opened only 5 drive-thru testing locations", "title_page": "Major retailers have opened only 5 drive-thru testing locations - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As he was facing intense criticism for a lack of adequate testing, President Donald Trump announced in the Rose Garden in mid-March that the federal government would partner with private companies to set up drive-thru coronavirus testing sites.\nHe invited chief executives from Target, Walgreens, Walmart and CVS to the microphone and showered them with praise over the new effort. The President told attendees he envisioned consumers driving up, getting swabbed and having their samples sent off to the lab to be tested -- \"without having to leave your car.\"\nBut the President's celebrated announcement hasn't come close to being fulfilled.\nWhile these retailers have approximately 30,000 locations combined, the Department of Health and Human Services confirmed that there are only five locations from these major retailers that are currently offering drive-thru testing -- and none are open to the general public.\nThere is one drive-thru at a CVS in Massachusetts, three at two Walmarts and a Walgreens in the Chicago area and another at a Rite Aid in Philadelphia.\nRead More", "url": "https://www.cnn.com/2020/03/31/politics/drive-thru-coronavirus-testing/index.html"}