{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 17:02:33", "date_modify": "2020-05-04 17:02:33", "date_publish": "2020-04-10 14:23:01", "description": "Being the governor of Florida is, well, a big job. That's true anytime -- Florida is the third most populous state in the country with more than 21 million residents -- but especially so in the midst of a global pandemic.", "filename": "2020_04_10_politics_florida-ron-desantis-coronavirus_index_1588611753.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/181031153309-02-ron-desantis-file-103118-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_florida-ron-desantis-coronavirus_index_1588611753.html", "title": "What the governor of Florida doesn't know about the coronavirus is a lot", "title_page": "What the governor of Florida doesn't know about the coronavirus is a lot - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Being the governor of Florida is, well, a big job. That's true anytime -- Florida is the third most populous state in the country with more than 21 million residents -- but especially so in the midst of a global pandemic.\nUnfortunately for Republican Florida Gov. Ron DeSantis, the fight against coronavirus has exposed the fact that he may simply not be up to this moment in history.\nThe latest evidence of that came Thursday, when DeSantis sought to explain his thinking about potentially re-opening schools in the state. (So far 19 states have closed schools for the year .) Here's what DeSantis said\n\"This particular pandemic is one where, I don't think nationwide there's been a single fatality under 25. For whatever reason it just doesn't seem to threaten, you know, kids.\n\"And we lose in Florida between five and 10 kids a year for the flu. This one, for whatever reason, much more dangerous if you're 65 and plus than the flu, no doubt about that, if you're younger it just hasn't had an impact. So that should factor into how we're viewing this.\nRead More", "url": "https://www.cnn.com/2020/04/10/politics/florida-ron-desantis-coronavirus/index.html"}