{"authors": ["Greg Beacham"], "date_download": "2020-05-04 20:27:26", "date_modify": "2020-05-04 20:27:26", "date_publish": "2020-04-06 20:30:51", "description": "UFC 249 is still on schedule for April 18, with Tony Ferguson fighting Justin Gaethje for an interim lightweight title in the main event. Although UFC President Dana White hasn’t announced a...", "filename": "_cd60e016b800e96f48302828fb4ab0e7_1588624046.html", "image_url": "https://storage.googleapis.com/afs-prod/media/4eeb0ce14810458284c38de653bb4249/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cd60e016b800e96f48302828fb4ab0e7_1588624046.html", "title": "UFC 249 still on, with Ferguson fighting Gaethje on April 18", "title_page": "UFC 249 still on, with Ferguson fighting Gaethje on April 18", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this June 8, 2019, file photo, Tony Ferguson, right, punches Donald Cerrone, left, during their lightweight mixed martial arts bout at UFC 238 in Chicago. The UFC says Ferguson will fight Justin Gaethje for the interim lightweight title in the main event of UFC 249 on April 18, 2020. The mixed martial arts promotion announced the matchup Monday, April 6, 2020. Gaethje replaces lightweight champ Khabib Nurmagomedov, who is apparently unable to leave Russia during the coronavirus pandemic. (AP Photo/Kamil Krzaczynski, File)\nFILE - In this June 8, 2019, file photo, Tony Ferguson, right, punches Donald Cerrone, left, during their lightweight mixed martial arts bout at UFC 238 in Chicago. The UFC says Ferguson will fight Justin Gaethje for the interim lightweight title in the main event of UFC 249 on April 18, 2020. The mixed martial arts promotion announced the matchup Monday, April 6, 2020. Gaethje replaces lightweight champ Khabib Nurmagomedov, who is apparently unable to leave Russia during the coronavirus pandemic. (AP Photo/Kamil Krzaczynski, File)\nUFC 249 is still on schedule for April 18, with Tony Ferguson fighting Justin Gaethje for an interim lightweight title in the main event.\nAlthough UFC President Dana White hasn’t announced a venue for his promotion’s biggest pay-per-view show of the spring, he remains determined to hold an event in less than two weeks amid the coronavirus pandemic.\nThe mixed martial arts promotion announced the change to UFC 249′s main event bout Monday. Gaethje replaces lightweight champ Khabib Nurmagomedov, who is apparently unable to leave Russia amid the pandemic.\n“The fight is signed and is 100% ON LIVE on ESPN somewhere on EARTH!!!!” White tweeted Monday.\nWhite has remained steadfast in his plan for the UFC to fight on while virtually all high-level sports competition has stopped around the world. Even if the UFC fights without fans as expected, most U.S. states and developed nations have restrictions in place that would make it impossible to stage an MMA show.\nWhite later told TMZ he is attempting to secure the use of a private island to hold several shows over the next two months, flying the fighters and support personnel to the island on private planes. He said the UFC will screen the health of every participant before the fights occur.\nWhite also confirmed several additional matchups for UFC 249. Former strawweight champions Rose Namajunas and Jessica Andrade will meet in the penultimate bout, and heavyweights Francis Ngannou and Jair Rozenstruik also will compete.\nWhite’s quest hit another obstacle later Monday when the Association of Ringside Physicians issued a statement calling for the indefinite suspension of all combat sports events.\n“Any combat sport taking place during this global pandemic places the athletes, officials, and anyone else involved in the event under unnecessary risk of infection and transmission of COVID-19,” ARP’s statement read. “In addition, combat sports athletes often require medical attention after a bout, and we do not wish to see any additional strain on an already overwhelmed medical system.”\nTo hold an event, White will have to find ringside physicians willing to work against the ARP’s recommendation. The UFC already is likely to be forced to hire its own judges and referees while serving as its own regulatory body, since most state athletic commissions will not currently allow an event to take place in their jurisdictions.\nAlthough others speculated that White would attempt to stage his fights on tribal lands on the West Coast, a private island might be the most logical place for White’s illogical quest.\nWhite has steadily attempted to buck the rest of the sports world’s collective plan for handling the pandemic over the past five weeks. The UFC held a full fight card in an empty arena in Brazil last month, but was forced to cancel its ensuing three scheduled shows when not even the promotion’s native Nevada would allow it to hold fights in an empty arena.\nMost UFC fighters have expressed an eagerness to fight during the pandemic. Mixed martial artists typically don’t get paid unless they fight, although Bellator and other promotions have paid fighters whose bouts were canceled by the pandemic in recent weeks.\nFerguson (25-3) is a longtime lightweight contender who has been booked to fight Nurmagomedov five times. Every single bout has fallen through due to injury or other circumstances.\nGaethje (20-2) is among the UFC’s most exciting fighters, with a heedless brawling mentality that suggests a thrilling matchup with the equally reckless Ferguson.\n“I’m terrified and I ... love it,” Gaethje tweeted after the announcement.\nNurmagomedov announced last week that he wasn’t planning to leave his native Dagestan , suggesting Russia’s travel restrictions made it impossible. The unbeaten champion later claimed he would be willing to leave for the fight, but couldn’t plan because he didn’t know where or when it would occur.\nUFC 249 initially was slated for Barclays Center in Brooklyn.\n___\nMore AP sports: https://apnews.com/tag/apf-sports and https://twitter.com/AP_Sports", "url": "https://apnews.com/cd60e016b800e96f48302828fb4ab0e7"}