{"authors": ["Edith M. Lederer"], "date_download": "2020-05-04 20:24:06", "date_modify": "2020-05-04 20:24:06", "date_publish": "2020-04-21 02:00:44", "description": "UNITED NATIONS (AP) — The U.N. General Assembly approved a resolution Monday night calling for global action to rapidly scale up development, manufacturing and access to medicine, vaccines and...", "filename": "_d2fcadb4620e6633a6d04f32230fad96_1588623846.html", "image_url": "https://storage.googleapis.com/afs-prod/media/2eb7f8efda634a57b16a04ba2d207d4b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d2fcadb4620e6633a6d04f32230fad96_1588623846.html", "title": "UN calls for scaling up all efforts to confront pandemic", "title_page": "UN calls for scaling up all efforts to confront  pandemic ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A woman listens to music at a park on Roosevelt Island, Tuesday, March 17, 2020, in New York, with a United Nations building in the background. New York State entered a new phase in the coronavirus pandemic Monday, as New York City closed its public schools, and officials said schools statewide would close by Wednesday. New York joined with Connecticut and New Jersey to close bars, restaurants and movie theaters along with setting limits on social gatherings. (AP Photo/Mary Altaffer)\nA woman listens to music at a park on Roosevelt Island, Tuesday, March 17, 2020, in New York, with a United Nations building in the background. New York State entered a new phase in the coronavirus pandemic Monday, as New York City closed its public schools, and officials said schools statewide would close by Wednesday. New York joined with Connecticut and New Jersey to close bars, restaurants and movie theaters along with setting limits on social gatherings. (AP Photo/Mary Altaffer)\nUNITED NATIONS (AP) — The U.N. General Assembly approved a resolution Monday night calling for global action to rapidly scale up development, manufacturing and access to medicine, vaccines and medical equipment to confront the new coronavirus pandemic.\nThe Mexican-drafted resolution requests U.N. Secretary-General Antonio Guterres to work with the World Health Organization and recommend options to ensure timely and equitable access to testing, medical supplies, drugs and future coronavirus vaccines for all in need, especially in developing countries.\nIt reaffirms the fundamental role of the United Nations system in coordinating the global response to control and contain the spread of COVID-19 and in supporting the 193 U.N. member states, “and in this regard acknowledges the crucial leading role played by the World Health Organization.”\nU.S. President Donald Trump suspended funding to the World Health Organization earlier this month, accusing the U.N. agency of failing to stop the virus from spreading when it first surfaced in China, saying it “must be held accountable.” But the United States did not block adoption of the resolution.\nUnder new voting rules instituted because the General Assembly isn’t holding meetings during the pandemic, a draft resolution is circulated to member nations. If a single country objects before the deadline, the resolution is defeated. Normally, assembly resolutions are adopted by majority votes or by consensus.\nGeneral Assembly President Tijjani Muhammad-Bande sent a letter to the 193 U.N. member states Monday night saying there were no objections to the resolution.\nIt calls on all countries “to immediately take steps to prevent ... speculation and undue stockpiling that may hinder access to safe, effective and affordable essential medicines, vaccines, personal protective equipment and medical equipment.”\nCo-sponsored by about 170 countries, the resolution also encourages all countries to work in partnership to increase research and funding for vaccines and medicine, and to strengthen international scientific cooperation to combat the coronavirus.\nAnd it calls for stepped up coordination, incIuding with the private sector, “towards rapid development, manufacturing and distribution of diagnostics, anti-viral medicines, personal protective equipment and vaccines.”\nThe resolution is the second on COVID-19 approved by the General Assembly.\nOn April 2, the world body approved a resolution recognizing “the unprecedented effects” of the pandemic and calling for “intensified international cooperation to contain, mitigate and defeat” the virus.\nThe General Assembly has until noon EDT on Wednesday to consider two other draft resolutions on the coronavirus pandemic, one from Russia and the other from Saudi Arabia.\nThe original Russian draft resolution, which failed to win approval on April 2, called for abandoning trade wars and protectionist measures, and said no unilateral sanctions should be applied without approval from the U.N. Security Council. Diplomats said the European Union, United Kingdom, United States and Ukraine objected to it.\nThe revised Russian resolution being considered now expresses grave concern at “the negative impact of the spread of COVID-19 on public health and the global economy,” and makes a commitment to pursue “coordinated and decisive actions aimed at defeating the pandemic, guided by the spirit of solidarity and international cooperation.”\nThe revised draft drops the reference to unilateral sanctions, but welcomes the April 3 statement on COVID-19 by the Group of 77 and China — the main group of developing countries at the United Nations which now has 134 member states. That statement includes a call on the international community “to adopt urgent and effective measures to eliminate the use of unilateral coercive economic measures against developing countries.”\nThe Russian draft also still includes a call to end protectionist practices.\nSaudi Arabia currently chairs the Group of 20 major global economies and its draft welcomes their March 26 summit call for “effective and coordinated action” to fight COVID-19, and their statement “on injecting 5 trillion United States dollars into the global economy, as part of targeted fiscal policy, economic measures and guarantee schemes to counteract the social, economic and financial impacts of the pandemic.”\nThe Saudi draft also stresses “the necessity of urgent short-term actions” to expand manufacturing capacity, swiftly deliver medical supplies, increase funding for research and development of vaccines and medicines, and engage with international organizations and multilateral and regional banks “to deploy robust, coherent, coordinated and rapid financial packages to strengthen global financial safety nets.”\nGeneral Assembly resolutions are not legally binding but do reflect world opinion. Some diplomats have expressed concern at the proliferation of proposed pandemic-related resolutions.\nIn apparent response, Muhammad-Bande sent a letter to U.N. members Monday saying he has appointed Afghanistan’s U.N. Ambassador Adela Raz and Croatia’s U.N. Ambassador Ivan Simonovic as “co-coordinators” to coordinate General Assembly approaches and initiatives aimed at defeating COVID-19.\nThe more powerful 15-member Security Council, whose resolutions are legally binding, has not adopted a resolution since the pandemic began circling the globe.", "url": "https://apnews.com/d2fcadb4620e6633a6d04f32230fad96"}