{"authors": ["Brett Martel"], "date_download": "2020-05-04 20:10:13", "date_modify": "2020-05-04 20:10:13", "date_publish": "2020-04-16 20:44:53", "description": "NEW ORLEANS (AP) — Saints general manager Mickey Loomis and coach Sean Payton could transform legacies by finding a big-play talent or two in the NFL draft. Chances are running out for star...", "filename": "_9824d64b2cef0f4d9c50cbf5799f2297_1588623013.html", "image_url": "https://storage.googleapis.com/afs-prod/media/881e42c7566945babb94959b980ae87b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9824d64b2cef0f4d9c50cbf5799f2297_1588623013.html", "title": "For Saints, draft could help end recent run of playoff pain", "title_page": "For Saints, draft could help end recent run of playoff pain", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Dec. 7, 2019, file photo, Clemson wide receiver Tee Higgins (5) catches a pass while Virginia cornerback Nick Grant (1) defends during the second half of the Atlantic Coast Conference championship NCAA college football game in Charlotte, N.C. The NFL's shutdown because of the coronavirus pandemic is denying teams the opportunity to get face time with draft prospects who have been injured, have checkered pasts or are under the radar. Higgins’ 6-foot-4 frame and superb hands stand out in a deep pool of receivers. Speed is the question, and a private workout might have helped. (AP Photo/Mike McCarn, File)\nFILE - In this Dec. 7, 2019, file photo, Clemson wide receiver Tee Higgins (5) catches a pass while Virginia cornerback Nick Grant (1) defends during the second half of the Atlantic Coast Conference championship NCAA college football game in Charlotte, N.C. The NFL's shutdown because of the coronavirus pandemic is denying teams the opportunity to get face time with draft prospects who have been injured, have checkered pasts or are under the radar. Higgins’ 6-foot-4 frame and superb hands stand out in a deep pool of receivers. Speed is the question, and a private workout might have helped. (AP Photo/Mike McCarn, File)\nNEW ORLEANS (AP) — Saints general manager Mickey Loomis and coach Sean Payton could transform legacies by finding a big-play talent or two in the NFL draft.\nChances are running out for star quarterback Drew Brees to play in a second Super Bowl. The Saints also brought back another member of their 2009 championship team in free agency when they signed safety Malcolm Jenkins away from Philadelphia.\nThe 41-year-old Brees and 32-year-old Jenkins will occupy leadership roles on a club that has retained most key players from a run of three straight NFC South titles, including 13-3 records the past two regular seasons.\nBut each of those division crowns was followed by excruciating exits from the NFC playoffs — twice in overtime and once by giving up a long touchdown pass on the final play of regulation.\nWhen the margins are that tight, drafting immediate contributors can make the difference between devastating postseason defeats and Super Bowl celebrations.\nWide receiver and linebacker are positions where new talent could help most. But neither position represents a major weakness. If the Saints are more confident in talent available at tight end, defensive back, running back, or even on the offensive or defensive lines, it would hardly be surprising to see them go that way.\n“We’re going to be smart with the draft relative to the grades and paying attention to our board,” said Payton, whose team is slated to make its first pick at 24th overall. “There’s still a handful of things we’re looking at.\n“Interior offensive lineman is something we’ll pay close attention to,” Payton continued. “Obviously, there’s a lot of receivers in this draft. I think from a secondary standpoint we’ll pay close attention to the corner market and then I would say also linebacker.”\nPASSING GAME\nThe Saints added receiver Emmanuel Sanders in free agency to help a receiver corps led by All-Pro Michael Thomas. But whether the Saints will have a strong third receiving option remains in question. New Orleans is waiting for Tre’Quan Smith, a 2018 third-round pick, to produce consistently. The Saints so far have chosen not to re-sign 35-year-old receiver Ted Ginn Jr.\nTop prospects such as Oklahoma’s CeeDee Lamb, Jerry Jeudy and Henry Ruggs III could be tough to get without trading up, but Clemson’s Tee Higgins, LSU’s Justin Jefferson and Baylor’s Denzel Mims could be available when New Orleans is on the clock.\nLINEBACKER NEEDS\nThe Saints are in the market for a quick and versatile defender to play alongside Demario Davis at linebacker. Alex Anzalone, a 2017 third-round pick, is a candidate, but whether he can shake a pattern of recurring injuries remains to be seen. Kiko Alonso, acquired from Miami last season, has been productive, but he had a major knee injury late last season. New Orleans’ depth took a hit when veteran A.J. Klein left for Buffalo in free agency.\nOklahoma’s Kenneth Murray or LSU’s Patrick Queen could be realistic targets in the first round.\nQB CONSIDERATIONS\nWhile the Saints expect to retrain reserve quarterback Taysom Hill as a backup to Brees, Payton said Hill’s ability to serve as a utility player on offense and contribute on special teams means the Saints are in the market for another quarterback.\n“The uniqueness of Taysom’s role will make it important for us to have a third quarterback. But what we are looking for in that third quarterback is another player we want to develop, work with and improve,” Payton said. “We’re not specifically saying that has to be a player that comes through the draft. We’re not saying it has to be a veteran player. It’ll be the best available player that we feel like fits our program.”\nPLANNING AHEAD\nIt has been three years since the Saints’ 2017 draft produced both the offensive and defensive rookies of the year. Now both players — running back Alvin Kamara and cornerback Marshon Lattimore — are entering their final seasons under contract.\nFor now, the Saints have decent depth at both spots\nJanoris Jenkins is expected to start opposite Lattimore at cornerback, with veterans Patrick Robinson and P.J. Williams in regular reserve roles.\nVeteran Latavius Murray backs up Kamara and proved his effectiveness by eclipsing 100 yards rushing in both games Kamara missed with injuries last season.\nBut the contract situations of Kamara and Lattimore could cause the Saints to think twice before passing up exceptional value at either of those spots.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n___\nFollow Brett Martel on Twitter: http://twitter.com/brettmartel", "url": "https://apnews.com/9824d64b2cef0f4d9c50cbf5799f2297"}