{"authors": ["Michael Liedtke"], "date_download": "2020-05-04 20:12:03", "date_modify": "2020-05-04 20:12:03", "date_publish": "2020-04-16 23:48:30", "description": "BERKELEY, Calif. (AP) — A Pacific Gas & Electric lawyer told a federal judge that the beleaguered company's plan for getting out of bankruptcy is winning support from the victims of Northern...", "filename": "_1fde48d08d1d6182df4e68a42add6e95_1588623123.html", "image_url": "https://storage.googleapis.com/afs-prod/media/479a23f9a3db4ac8aff45bb5ce54dd4c/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1fde48d08d1d6182df4e68a42add6e95_1588623123.html", "title": "PG&E: Wildfire victims backing bankruptcy plan so far", "title_page": "PG&E:  Wildfire victims backing bankruptcy plan so far", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - This Oct. 13, 2017 file photo shows a row of chimneys standing in a neighborhood devastated by the Tubbs fire near Santa Rosa, Calif. Pacific Gas & Electric will face another legal challenge to a $13.5 billion settlement with more than 80,000 Northern California victims worried they're being shortchanged in a deal that's supposed to repay them for losses caused by the utility's negligence. (AP Photo/Jae C. Hong, File)\nFILE - This Oct. 13, 2017 file photo shows a row of chimneys standing in a neighborhood devastated by the Tubbs fire near Santa Rosa, Calif. Pacific Gas & Electric will face another legal challenge to a $13.5 billion settlement with more than 80,000 Northern California victims worried they're being shortchanged in a deal that's supposed to repay them for losses caused by the utility's negligence. (AP Photo/Jae C. Hong, File)\nBERKELEY, Calif. (AP) — A Pacific Gas & Electric lawyer told a federal judge that the beleaguered company’s plan for getting out of bankruptcy is winning support from the victims of Northern California wildfires ignited by the utility’s crumbling equipment, despite concerns they will be shortchanged in a $13.5 billion settlement.\nThe disclosure made Thursday by PG&E lawyer Kevin Orsini is an early indication that PG&E is thwarting an attempt to pressure the San Francisco company into revising a deal that it reached in December to pay for the staggering losses suffered during catastrophic wildfires in 2017 and 2018.\nA bankruptcy committee representing the victims recently has been raising red flags about the $13.5 billion settlement that it helped negotiate because half of the amount consists of PG&E stock that has been fluctuating wildly amid the economic turmoil caused by the coronavirus pandemic.\nJust last week, lawyers for the victims’ committee unsuccessfully tried to persuade U.S. Bankruptcy Judge Dennis Montali to approve a letter warning that the $13.5 billion deal wasn’t panning out as envisioned. Besides concerns about the value of the promised stock, the victims’ committee is also worried the bankruptcy plan will miss its Aug. 29 date for raising the money needed to pay claims.\nThe letter would have advised more than 82,000 to delay voting until at least April 25 to give the committee time to address its concerns, but Montali declined to put the court’s seal of approval on the warning. The voting on PG&E’s plan began earlier this month and will continue through May 15.\nIn Thursday’s hearing involving another wildfire matter, Orsini told U.S. District Court Judge James Donato that the victims so far are “overwhelmingly” voting in favor of the company’s plan. Orsini didn’t say how many of the victims’ ballots have been cast so far. PG&E declined any further comment.\nThe plan also needs backing from a wide range of investors, lenders, government agencies and insurers that also have claims in PG&E’s bankruptcy case, but their support has been widely expected for several months. PG&E’s biggest challenge has been getting the wildfire victims on board, given their deal represents more than half of the $25.5 billion in settlements contained within PG&E elaborate plan.\nWhile the victims’ committee has been griping about shortcomings in the plan, it has continued to gain support from other lawyer representing people who lost family, homes and businesses in the wildfires that drove PG&E into bankruptcy and caused the company to plead guilty to 84 felony counts of involuntary manslaughter.\nThe lawyers siding with PG&E contend the company plan is the best hope to get money to victims at a time when the crumbling economy threatens to make some of them even more destitute than they are.\nEven so, almost everyone agrees the stock market turmoil is threatening to erode the original value of the $13.5 billion fund for the wildfire victims. One financial expert that company stock pledged in the deal may turn out to be worth $4.85 billion, instead of the promised $6.75 billion. On the flip side, the PG&E stock could still rebound and end up paying victims even more than they hoped.\nThe company’s shares closed Thursday at $11.13. That’s down dramatically from the stock’s six-month high of $18.34, but a rebound from its recent low of $7.85 earlier this month.", "url": "https://apnews.com/1fde48d08d1d6182df4e68a42add6e95"}