{"authors": ["Ryan Prior"], "date_download": "2020-05-04 16:52:47", "date_modify": "2020-05-04 16:52:47", "date_publish": "2020-04-08 08:16:45", "description": "As the pandemic rages, those who are blind, deaf or contending with a chronic illness are now at a double disadvantage. Social distancing and stay at home orders can turn buying groceries or showing up for doctors appointments into existential risks.", "filename": "2020_04_08_health_coronavir_c451659f08bb1a754f6fda8b195489d8_index_1588611167.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407141642-02-disability-and-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_health_coronavir_c451659f08bb1a754f6fda8b195489d8_index_1588611167.html", "title": "Coping with disease and disability in the time of coronavirus", "title_page": "Coping with disease and disability in the time of coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Sassy Outwater-Wright has fought off cancer three times in the last 33 years, losing most of her eyesight to a rare form of the disease at the age of three.\nAnd now, at age 37, she's fighting a fourth cancer -- this time in her brain.\nAs a result, Outwater-Wright is no stranger to navigating the byzantine corridors of the healthcare system, and she guides others who've lost their sight in her role as executive director of the Massachusetts Association for the Blind and Visually Impaired.\nAs someone who relies on touch to navigate the world, the potential threats to her existence have multiplied now that the novel coronavirus might be waiting on the next door knob or window sill.\nIn the midst of the pandemic, those who live with disability or contend with a chronic illness are now at a double disadvantage.\nHome deliveries of goods are much harder to arrange, even if stores have what people need in stock. And leaving the home for each life-sustaining visit to a doctor to treat a condition begins to feel like playing Russian roulette.\n'You're forced to face your own mortality'\n\"It's terrible to have cancer in the time of corona,\" Outwater-Wright said. \"I still have to go to the hospital for my conditions. Each time, we're putting our health and the lives of our loved ones at risk.\"\nShe worries that she could be exposed to coronavirus if she see a healthcare worker who's seen 20 other patients that day, one of whom could be an asymptomatic carrier of the virus.\nAnd she worries where her brain tumor diagnosis might place her on the triage list if she contracts Covid-19 and needs a ventilator.\ndoctors must find ways of identifying which patients are should be prioritized for the scarce number of ventilators available. One In some hospitals,doctors must find ways of identifying which patients are should be prioritized for the scarce number of ventilators available. One increasingly used system for doing that -- developed by Dr. Douglas White, a professor of critical care medicine at the University of Pittsburgh -- operates under two larger sets of criteria: save the most lives and save the most number of life years the patient is expected to have should they receive treatment and survive.\nOutwater-Wright welcomes blind Boston Marathon runners and their guides at a dinner for the Massachusetts Association for the Blind and Visually Impaired.\nWhen looking at the number of life years a patient may have left, this point system would de-prioritize patients with medical conditions associated with a life expectancy of less than one year and less than five years.\nThese guidelines don't discriminate against those living with disabilities, so Outwater-Wright's visual impairment doesn't make her less eligible for a ventilator should she need one. But as a patient living with brain tumors, Outwater-Wright is worried about what could happen if she falls ill, seeing as how one's expected life span following Covid-19 is a factor.\nRecent news reports detailing those criteria have left her feeling horrified.\n\"A lot of the medical modeling coming out is focusing on who's not going to get resuscitated,\" she said. \"Every time your phone pings with a news notification, you're forced to face your own mortality.\"\nWhen cleaning supplies and support are scarce\nJennifer McNary is a single mother and a consultant raising four children with rare or respiratory diseases in Newton, Massachusetts.\nHer two oldest boys, Austin and Max, who are ages 21 and 18 respectively, suffer from Duchenne muscular dystrophy, a terminal progressive muscle-wasting disease that requires them to use wheelchairs to get around. Her 12-year-old, James, suffers from primary immune deficiency, and her youngest, 9-year-old Norah, has asthma.\nEach of them would fare poorly if infected with coronavirus. Many with Duchenne's are expected to live only into their 20s, due to the disease affecting the lungs and respiratory system in its later stages.\n\"They're one pneumonia away from lung failure,\" McNary says.\nBecause germs can live on cardboard and other household products, McNary has for years been in the habit of wiping down everything that comes in the house or heavily disinfecting it. Her 12-year-old \"doesn't have an immune system,\" she says.\nBut with Lysol wipes and household cleaning supplies now scarce, she's getting nervous. In February, she had a panic attack at a store.\nTheir family normally requires two full-time care assistants and a nanny. Now, because of social distancing guidelines, they're down to just one person helping out about halftime.\nShe and her children hadn't left the house in 25 days as of April 7, getting everything they need via deliveries from Amazon or CVS. This is a life or death matter for her family.\nIf one of her children gets Covid-19, they could likely require a ventilator. If ventilators, ICU beds or other supplies become scarce, the medical guidelines used in many hospitals would potentially de-prioritize her sons because they're unlikely to survive long after a possible hospitalization.\n\"I will do everything I can to make sure they don't go to a hospital, even if they have Covid,\" McNary said.\nStill, she says, as long as they get through this, there could be a silver lining in this crisis, particularly with mainstreaming the kinds of telehealth services and at-home learning her children rely on.\n\"Lots can be done over the phone,\" she says.\nEach of McNary's conditions children has a condition that could make them very vulnerbale if infected by the coronavirus.\nThe chronically ill have less access to care\nMike Porath, the founder and CEO of The Mighty, an online community for more than three million chronic disease patients and caregivers, said the most common issues members are facing include disruption of routine and lack of access to care, along with anxiety about the future regression in health.\nHis platform surveyed members about their experiences during the coronavirus pandemic, and received more than 13,000 responses.\nSeventy-two percent of respondents said the way they experience healthcare is different now, with 35% saying they had to forgo doctor's visits they'd previously planned. Another 23% said they'd gone without their medications or treatments.\nAnd 11% reported that their condition had worsened in the last two weeks. Porath said he and his team have been repeating the survey weekly. As the pandemic deepens and shelter in place orders become more common, the percentages in each successive survey tick upwards.\nLikewise, Inspire, a company hosting support groups for more than two million patients across hundreds of diseases, was seeing its own uptick in conversations related to the coronavirus.\nSeth Rotberg, a patient engagement manager for the company, told CNN that patients in Inspire's support groups for lung-related conditions, including pulmonary fibrosis and chronic obstructive pulmonary disease, were concerned that Covid-19 might delay \"wait periods and eligibility\" for lung donor and transplant programs.\nRotberg also said other chronically ill patients were worried about how the pandemic is affecting supplies of drugs coming from Europe and China.\nOccupational therapy services are less available\nFernando Albertorio lost much of his sight due to complications related to albinism. He earned his PhD in analytical chemistry and completed a postdoc at Harvard before becoming a serial entrepreneur focused on developing products to help the blind and visually impaired.\nthat helps them get a sense of their physical surroundings. The technology is meant to be a complement to the cane or guide dog that many with visual impairment use to negotiate their daily lives. His company, Sunu, created a wristband that sends out sonar signals enabling the user to receive vibration feedbackthat helps them get a sense of their physical surroundings. The technology is meant to be a complement to the cane or guide dog that many with visual impairment use to negotiate their daily lives.\nHe said that without sight it's hard to know if you're abiding by social distancing guidelines and staying six feet away from others when you go out in public.\nFurther, he noted that under social distancing, services like occupational therapy aren't available for blind people to get help with tasks such as cooking or reading their mail. And orientation and mobility specialists, who coach those losing their sight in how to negotiate a city bus or move around a supermarket, are also limited because they require being in the same physical vicinity.\n\"Being blind is isolating,\" Albertorio said. \"A lot of programs are being affected, further enhancing the isolation.\"\nis unavailable. One tool, a smartphone app called As workarounds, there are additional tools those who are blind can lean on when the in-person help they needis unavailable. One tool, a smartphone app called Be My Eyes , makes it possible to call sighted volunteers who can offer visual assistance via a video phone call.\nHearing press briefings and doctors' advice is an issue for the Deaf community\nThe lack of resources presents differently in each community, and for the deaf, many issues center around communication.\nThe National Association for the Deaf created a guide for deaf people to use when visiting the hospital, along with one for medical facilities to use when caring for patients or caregivers who are deaf or hard of hearing.\nMany who are deaf or hard of hearing aren't able to bring in-person American Sign Language interpreters to hospitals, out of precautions designed to prevent the spread of disease. Exacerbating the issue, it's difficult to lip-read if your nurse or doctor is speaking to you while wearing a mask or positioned behind a curtain.\nCraig Radford, the director of Connect Direct, a subsidiary of Communication Service for the Deaf, told CNN that his organization had created a dedicated \"ASL Now\" hotline for deaf people to get answers to commonly asked coronavirus questions.\n\"We provide answers from reputable sources like the IRS, CDC [and] local government to answer their questions, and we provide them in American Sign Language instead of written English,\" Radford said. \"We have to update the source daily, staff the representatives, and provide a hotline number. We have received hundreds of calls in just 10 days of launch.\"\nThe organization is providing closed captioning and ASL interpretation for the White House's coronavirus press briefings.\nSome hope this shock might improve care in the future\nJessie Hadley-Stokes, 29, lives in Derbyshire, England, and for the past seven years has suffered from multiple sclerosis. Practicing social distancing, she says she hasn't left the house much at all in the last month. She needs to visit the doctor every three months for a blood test and to stock up on a medication she needs to take twice daily.\nHer husband does the grocery shopping, but \"I can't really send someone else to have my blood test for me,\" she said.\nJessie Hadley-Stokes, who has multiple sclerosis, works on her podcast, which features the stories of those who live inspiring lives in the face of chronic disease or disability.\nShe hosts a podcast called \"DISabled to ENabled,\" highlighting inspiring journeys of those faced with life-altering diagnoses, and advocating for those with similar diseases. She's optimistic that certain innovations may come from the pandemic, including wider acceptance for otherwise capable people who need allowances to work from home.\nSpeaking on CNN's \"Coronavirus: Fact vs. Fiction\" podcast , CNN Medical Analyst Art Caplan said this pandemic is spurring a move toward tele-medicine. \"Now I think it's going to explode and become the way many of us get primary care, maybe even other kinds of care.\"\nHe also said that the current healthcare scarcity for those with Covid-19, and any other disease, would likely prompt leaders to rethink how they allocate resources in the future.\n\"Quite a lot of us are used to this,\" Hadley-Stokes said. \"It's the chronic illness community now teaching those who are more able.\"\nOutwater-Wright, the brain cancer patient and advocate for the blind, felt similarly, arguing that the coronavirus pandemic was hitting hardest in exactly the kinds of populations whose wisdom could be extracted for the benefit of all.\n\"Older adults with disabilities are at a huge disadvantage right now,\" she said. \"Disabled and elderly people have so much worth for this world.\"", "url": "https://www.cnn.com/2020/04/08/health/coronavirus-disability-and-chronic-illness-wellness/index.html"}