{"authors": ["Devan Cole"], "date_download": "2020-05-04 16:20:26", "date_modify": "2020-05-04 16:20:26", "date_publish": "2020-04-05 13:52:13", "description": "Defense Secretary Mark Esper on Sunday defended the recent removal of the commander of the USS Theodore Roosevelt, who warned that action was needed to save the lives of his crew from an outbreak of coronavirus, saying the move is an example of how \"we hold leaders accountable for their actions.\"", "filename": "2020_04_05_politics_mark-es_a20e86a2c2394f6d34f38297d28e6e93_index_1588609226.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190822113442-01-mark-esper-0807-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_mark-es_a20e86a2c2394f6d34f38297d28e6e93_index_1588609226.html", "title": "Esper defends removing USS Theodore Roosevelt commander who sounded alarm over coronavirus", "title_page": "Mark Esper defends removing USS Theodore Roosevelt commander who sounded alarm over coronavirus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Defense Secretary Mark Esper on Sunday defended the recent removal of the commander of the USS Theodore Roosevelt, who warned that action was needed to save the lives of his crew from an outbreak of coronavirus, saying the move is an example of how \"we hold leaders accountable for their actions.\"\n\"I think acting Secretary (Thomas) Modly made a very tough decision -- a decision that I support. It was based on his view that he had lost faith and confidence in the captain based on his actions,\" Esper told CNN's Jake Tapper on \"State of the Union.\" \"It's just another example (of) how we hold leaders accountable for their actions.\"\nCapt. Brett Crozier was relieved of his command last week by acting US Navy Secretary Thomas Modly, for what Modly called \"poor judgment,\" going outside the chain of command and too widely disseminating the memo over an unsecured system.\nIn his memo sent earlier last week, Crozier pleaded with Navy leaders that \"decisive action is required\" to remove a majority of the ship's personnel and isolate them for two weeks. The letter was published in the San Francisco Chronicle on Tuesday.\nAsked by Tapper if a current investigation into Crozier's actions should have been launched prior to his removal, Esper said such a decision was \"not unheard of\" in the Navy.\nRead More", "url": "https://www.cnn.com/2020/04/05/politics/mark-esper-uss-theodore-roosevelt-defends-removal-cnntv/index.html"}