{"authors": ["Grace Sparks"], "date_download": "2020-05-04 16:03:34", "date_modify": "2020-05-04 16:03:34", "date_publish": "2020-04-01 19:38:45", "description": "A new poll shows a majority of Americans are self-isolating and nearly all of them are concerned about the novel coronavirus pandemic -- and fewer than half trust the federal government to do the right thing.", "filename": "2020_04_01_politics_ipsos-a_8e486b53956903c4ef92652a6d117871_index_1588608214.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401171502-08-coronavirus-0331-washington-dc-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_ipsos-a_8e486b53956903c4ef92652a6d117871_index_1588608214.html", "title": "Poll: The public's habits and coronavirus expectations have changed significantly in the last few weeks", "title_page": "Poll: The public's habits and coronavirus expectations have changed significantly in the last few weeks - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A new poll shows a majority of Americans are self-isolating and nearly all of them are concerned about the novel coronavirus pandemic -- and fewer than half trust the federal government to do the right thing.\nOverall, 92% of Americans are concerned about the coronavirus outbreak, according to an Ipsos/Axios poll released Wednesday. A majority now say they are self-isolating, and the share who say they have at least a fair amount of trust in the federal government to look out for the best interests of their family has dropped below 50%.\nA majority of Americans (53%) now say they've self-quarantined, described in the survey as \"stay[ing] at home and avoid[ing] contact with others for 14 days.\" That's up from 10% who said so two weeks ago and 39% last week. One of the biggest increases is among those over the age of 65 -- almost two-thirds of that group are self-quarantining, up from only 11% said so in mid-March.\nNearly a third of Americans (31%) report that their ability to access health care has gotten worse in the last week, up from 25% last week and 9% two weeks ago. About a quarter now (24%) say their ability to protect the health of their household has also gotten worse in the past week.\nAlmost 9 in 10 Americans say they know what to do if they were to feel sick and suspect they have the virus. Only 1 in 10 say they know someone with coronavirus, but that's more than doubled from the 4% who said so two weeks ago. And 1 in 10 say they tried to get tested for coronavirus themselves, but were turned away. That's up from 5% two weeks ago.\nRead More", "url": "https://www.cnn.com/2020/04/01/politics/ipsos-axios-poll-coronavirus-changes-trends/index.html"}