{"authors": ["Paul R. La Monica", "Cnn Business"], "date_download": "2020-05-04 16:59:38", "date_modify": "2020-05-04 16:59:38", "date_publish": "2020-04-09 20:30:50", "description": "Hospitals are swamped with coronavirus cases. And Americans are being encouraged to stay home unless absolutely necessary. That's why virtual health care services like Teladoc are thriving.", "filename": "2020_04_09_investing_teladoc-coronavirus-virtual-health_index_1588611578.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409081942-teladoc-app---stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_investing_teladoc-coronavirus-virtual-health_index_1588611578.html", "title": "Teladoc soars on bet that virtual health is here to stay", "title_page": "Teladoc soars on bet that virtual health is here to stay - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Hospitals are swamped with coronavirus cases. And Americans are being encouraged to stay home unless absolutely necessary.\nSo if you need to see a doctor any time soon and it's unrelated to Covid-19, chances are that your visit will be a virtual one.\nThat's led to a boom in demand for Teladoc, a leader in the telemedicine industry. Shares ofhave soared nearly 75% this year.\nThe company said last month that it was \"experiencing unprecedented daily visit volume,\" adding that demand quickly soared to about 15,000 visits requested per day -- much higher than peak volume during a normal flu season and up 50% from the week just before the start of the coronavirus outbreak in the United States.\n\"There is no doubt that we are seeing positive momentum and that awareness has increased. Telemedicine is now a household term,\" said Dr. Lewis Levy, chief medical officer of Teladoc, in an interview with CNN Business.\nLevy said the company has thousands of physicians under the umbrella of the Teladoc Health Medical group, including those recently added to support the increased demand. Most are contractors supervised by staff clinicians and a clinical leadership team.\nMore people want (and need) to see doctors virtually\nTeladoc physicians, who work in a variety of disciplines, can usually diagnose and treat most medical problems virtually by discussing patients' symptoms, so they needn't risk leaving their homes to get blood work or other diagnostic tests.\nsurvey earlier this month by internet research firm BroadbandNow found that 75% of Americans are open to the idea of seeing a doctor virtually instead of an in-person visit.\nLots of competition for Teladoc\nTeladoc may be the best known company in the burgeoning virtual health field, which is reflected in the stock's stunning surge this year. But it's not the only one.\nMDLIVE reported Thursday that its virtual visit volume, new individual user registrations, and the number of its employer partners have hit all-time highs since March, when the outbreak took hold.\n\"While many industry experts said consumer adoption was at a tipping point at the start of 2020, it is clear that Covid-19 put virtual care on a fast track for substantial growth,\" said Charles Jones, MDLIVE's chairman and chief executive officer, in a statement.\nJUST WATCHED Doctor: Counting on seasonal reduction isn't a safe bet Replay More Videos ... MUST WATCH Doctor: Counting on seasonal reduction isn't a safe bet 02:48\nfocusing on virtual care, too. Intel INTC Big tech companies are nowfocusing on virtual care, too.told CNN Business that it is working with a software company called Medical Informatics Corp. on a virtual ICU that turns normal hospital beds into critical beds. The virtual ICU is equipped with software, clinical surveillance and data analytics to track patients.\nWhat's more, Intel said that its technology lets health care providers remotely monitor patients from a PC, tablet, or phone in order to reduce the risk of spreading the highly contagious coronavirus.\nOther companies are focusing virtually on mental health.\nAnisha Patel-Dunn, chief medical officer with LifeStance, a behavioral health company with 2,000 practicing mental health professionals in 200 offices, said it got all its clinical practitioners on board with a teletherapy system within the first two weeks of March.\nLifeStance had been planning to make the move to a virtual model gradually over the next few years but the Covid-19 pandemic forced it to accelerate those plans.\n\"Everyone had to be quick on their feet to address the needs of clients. There has been a learning curve for clinicians and patients,\" Patel-Dunn said.\nEasing the strain in an overtaxed health care system\nTeladoc also has its fair share of behavioral health practitioners.\nLevy said that about 60% of Teladoc's patients in the past month are first time users and that many are seeking mental and behavioral health advice, since the outbreak is leading to a spike in anxiety and depression.\nCVS CVS Walgreens WBA Amazon AMZN The company, much like other services that focus on in-home medical visits, allows doctors to digitally prescribe medications, which are filled by big drugstore chainsandas well as online pharmacies like Capsule and-owned PillPack , and then sent by mail to patients.\nUnitedHealth UNH Anthem ANTM Cigna CI Humana HUM Levy added that Teladoc accepts medical insurance from all the major health care insurers -- i.e.and CVS-owned Aetna -- as well as government programs like Medicaid and Medicare.\nTeladoc is on the verge of becoming more of a powerhouse with its proposed acquisition of InTouch Health, which provides virtual medical care for hospitals and clinics.\nThis, Levy hopes, will help reduce the stress on an already overtaxed hospital system dealing with the Covid-19 pandemic.\n\"Virtual medical care keeps health care workers safe, especially since there are great shortages of personal protection equipment,\" Levy said. \"You really have to triage patients in order to only send people who really need critical in-person care.\"", "url": "https://www.cnn.com/2020/04/09/investing/teladoc-coronavirus-virtual-health/index.html"}