{"authors": ["Susan Montoya Bryan"], "date_download": "2020-05-04 20:04:54", "date_modify": "2020-05-04 20:04:54", "date_publish": "2020-04-07 16:03:44", "description": "ALBUQUERQUE, N.M. (AP) — Some residents of a southern New Mexico village, immigrant advocates and others are raising concerns about an influx of workers in the community as part of the effort to...", "filename": "_f60f5958b4d82c157e0dd11871124f51_1588622694.html", "image_url": "https://storage.googleapis.com/afs-prod/media/fa5eded982d340a1854d4c5377cc9995/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f60f5958b4d82c157e0dd11871124f51_1588622694.html", "title": "Border wall workers in New Mexico spark coronavirus anxiety", "title_page": "Border wall workers in New Mexico spark coronavirus anxiety", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This Monday, April 6, 2020 photo, shows portable housing being erected in Columbus, N.M., for workers who are building a section of the U.S.-Mexico border wall. Immigrant advocates, some village residents and others are raising concerns about the influx of workers from elsewhere given the coronavirus pandemic. (Ray Trejo via AP)\nThis Monday, April 6, 2020 photo, shows portable housing being erected in Columbus, N.M., for workers who are building a section of the U.S.-Mexico border wall. Immigrant advocates, some village residents and others are raising concerns about the influx of workers from elsewhere given the coronavirus pandemic. (Ray Trejo via AP)\nALBUQUERQUE, N.M. (AP) — Some residents of a southern New Mexico village, immigrant advocates and others are raising concerns about an influx of workers in the community as part of the effort to build the U.S.-Mexico border wall during the coronavirus outbreak.\nThey’ve asked the state’s top elected officials to step in after the federal contractor working on the project began erecting portable housing.\nThe request reflects growing worries on both the northern and southern U.S. borders over construction workers bringing the virus to areas with sparse health care services.\nOpponents of the work effort argued in a letter that public health orders issued by Gov. Michelle Lujan Grisham are aimed at limiting groups of people and contact to keep the coronavirus pandemic from worsening.\n“We respectfully ask that you do everything within your power to halt the influx of out-state-workers into our border communities to protect the safety and health of rural New Mexicans and border communities,” their letter reads. “The lives of New Mexicans are depending on it.”\nIn remote northern Montana, work began over the weekend on the Keystone XL pipeline. Democratic Gov. Steve Bullock says concerns about planned worker camps that could house as many as 1,000 people each need to be resolved before sponsor TC Energy finalizes its construction plans.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.\nDespite a clampdown on people’s movements across much of the U.S., the border wall and pipeline work are exempt from stay-at-home restrictions. Even in New Mexico, the public health orders carve out exemptions for infrastructure operations such as public works construction and the repair and construction of roads.\nThe U.S. Army Corps of Engineers, which oversees contractors working on the border, told The Associated Press last week when concerns were first raised that the agency follows federal guidelines but declined to share specifics on how it’s protecting public health during construction.\nLujan Grisham, a Democrat, has long been a critic of President Donald Trump’s immigration policies and the plan to build more sections of the border wall. Her administration was unsuccessful in its efforts last year to sue federal immigration authorities over their handling of the surge of asylum seekers.\nLt. Gov. Howie Morales said Monday that the workers posed an additional risk. The work is happening near Columbus, a village of less than 1,500 people about 80 miles (130 kilometers) west of El Paso, Texas.\nMorales has been in contact with Columbus Mayor Esequiel Salas about the 40 to 60 workers coming into the community. He said those workers will have to go to grocery stores and pick up food from local restaurants and that means more contact in the community.\n“The national emergency right now is not building the border wall. The national emergency is the health crisis that we’re dealing with,” Morales said, stressing that the focus should be on building the capacity of the health care system.\nRay Trejo, coordinator with the New Mexico Wildlife Federation, was in Columbus on Monday and saw the rows of portable housing. His group is among those that signed the letter with the ACLU of New Mexico, the New Mexico Center on Law and Poverty and others.\n“While we all do our best to stay at home and adhere to the governor’s guidance, these individuals pose an uncontrollable threat to our community as they work side-by-side in close quarters and travel in and out of our city and patronize local businesses. They should be gone tomorrow,” Trejo said.\nThe federal contractor, Texas-based SLS, was awarded nearly $790 million last year to install steel bollards in southern New Mexico.\nPromises of border security were a highlight of Trump’s 2016 campaign. Bolstered by the immigration surge in 2019, he pushed a goal to have 500 miles (800 kilometers) done by early next year. More than 100 miles (161 kilometers) have been built, most of it replacing decades-old inadequate barriers.", "url": "https://apnews.com/f60f5958b4d82c157e0dd11871124f51"}