{"authors": ["Jacques Billeaud", "Paul Davenport"], "date_download": "2020-05-04 20:05:15", "date_modify": "2020-05-04 20:05:15", "date_publish": "2020-04-08 14:09:19", "description": "PHOENIX (AP) — The first two cases of the coronavirus have been confirmed among the 42,000 inmates in Arizona’s prisons, but authorities declined to say whether any of the thousands of corrections...", "filename": "_4a68f2b44e2c91b19aaf112ceeddbc94_1588622715.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b02e1064f2e642a4b222a4fde53f77f4/1600.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4a68f2b44e2c91b19aaf112ceeddbc94_1588622715.html", "title": "First cases of coronavirus confirmed in Arizona's prisons", "title_page": "First cases of coronavirus confirmed in Arizona's prisons", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Monday morning, April 6, 2020 photo, plastic netting is covers some equipment and a portable chain link fence surrounds other equipment at Ray Smucker Park in Yuma, Ariz., as the city follows the latest coronavirus guidelines set down by Arizona Gov. Doug Ducey (Randy Hoeft/The Yuma Sun via AP)\nIn this Monday morning, April 6, 2020 photo, plastic netting is covers some equipment and a portable chain link fence surrounds other equipment at Ray Smucker Park in Yuma, Ariz., as the city follows the latest coronavirus guidelines set down by Arizona Gov. Doug Ducey (Randy Hoeft/The Yuma Sun via AP)\nPHOENIX (AP) — The first two cases of the coronavirus have been confirmed among the 42,000 inmates in Arizona’s prisons, but authorities declined to say whether any of the thousands of corrections employees who cycle in and out of prisons each day has contracted the virus.\nInmate advocates who have questioned whether Arizona’s prisons are prepared for an outbreak say the discovery of COVID-19 is a sign of bad things to come, given that inmates with compromised health live in close quarters and inmate families are reporting a growing number of sick prisoners.\n“I think it’s the tip of the iceberg,” said attorney Corene Kendrick, who represents inmates in a longstanding lawsuit over the quality of health care for inmates.\nThe first coronavirus case was confirmed in an inmate from the Tucson prison has been hospitalized since March 27. Another inmate at a private prison in Marana also tested positive.\nAcross Arizona, more than 2,700 coronavirus cases with 80 deaths have been reported.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death. The vast majority of people recover.\nThe Arizona Department of Corrections, Rehabilitation and Reentry has repeatedly declined to say whether any corrections employees have tested positive.\nThe agency has previously said it’s separating inmates with flu symptoms from the general prison population, providing soap to inmates for cleaning housing areas and practicing good hygiene, and waiving a $4 medical copayment for inmates with cold and flu symptoms.\nAdvocates for inmates on Tuesday asked Arizona’s top public health official to order inspections of prisons, saying corrections officials haven’t consistently followed COVID-19 prevention guidelines and have done an inadequate job of keeping the public informed on those efforts.\nWhile dozens of nonviolent inmates have been released from county jails in Arizona as part of COVID-19 prevention efforts, Gov. Doug Ducey has ruled out early release for vulnerable inmates in state prisons.\n“Not only are we focused on protecting public health, we’re continuing to focus on protecting public safety,” Ducey said.\nDucey spokesman Patrick Ptak said Wednesday that the governor’s office wasn’t considering the release of any category of prisoners.\nKendrick said the small number of cases is likely a reflection of a scarcity of testing within the prisons.\nThe Corrections Department said the health care providers for prisoners had adequate COVID-19 tests, though it’s unclear how many are available. Officials say 60 inmates have been tested so far.\nThe supply of tests throughout Arizona has generally been limited. So far, only 35,000 tests have been conducted in the state, though testing has ramped up in the past two weeks. State health officials have repeatedly pointed out that treatment remains the same whether or not someone tests positive for the virus.\nIn another developments: — Dr. Rebecca Sunenshine, medical director for disease control at the Maricopa County Department of Public Health, said there has been a slight decline in coronavirus-related hospitalizations in the past week.\n“We are effectively starting to flatten the curve,” Sunenshine said. But she warned it would be premature to predict when social distancing could be lifted. Ending restrictions too early could trigger another wave of cases.\n“My message is, “It’s working, keep doing it and we’re doing everything we can to see when we can pull back,’” she said.\n—The Arizona Legislature informed members and staff on Tuesday it will extend its recess and assess the situation again at the end of the month. Lawmakers adjourned on March 23 after passing a bare-bones emergency state budget and had hoped to reconvene next week.\n___\nAP reporters Terry Tang in Phoenix and Bob Christie in Glendale, Arizona, contributed to this report.", "url": "https://apnews.com/4a68f2b44e2c91b19aaf112ceeddbc94"}