{"authors": ["Nicole Aschoff", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "David Harvey", "Grace Blakeley", "Kate Aronoff", "Alyssa Battistoni", "Daniel Aldana Cohen"], "date_download": "2020-05-04 19:49:39", "date_modify": "2020-05-04 19:49:39", "date_publish": "2020-03-24 00:00:00", "description": null, "filename": "2020_03_corporate-bailout-2009-auto-workers-recession-coronavirus_1588621779.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/24114439/GettyImages-85703308.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_corporate-bailout-2009-auto-workers-recession-coronavirus_1588621779.html", "title": "Socialism for Corporations. Brutal Capitalism for Everyone Else.", "title_page": "Socialism for Corporations. Brutal Capitalism for Everyone Else.", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The coronavirus crisis is wreaking havoc on the US economy, pushing companies large and small to seek help from the federal government. As elected officials debate how to provide this aid, they would do well to remember the 2009 bailout of General Motors and Chrysler as a model of what not to do. The auto bailout was terrible for both workers and the environment.\nTo be sure, the rapid and frightening spread of COVID-19 is a very different type of crisis from the 2008 global financial meltdown. While both crises triggered surging unemployment and losses across multiple sectors, the current crisis has enveloped the entire country in a matter of weeks necessitating a rapid and meaningful response from the federal government.\nNonetheless, it is worth revisiting the government’s management of the 2008–9 auto crisis, which is widely viewed as a successful intervention. Contrary to popular opinion, however, the resolution of the auto crisis should not be a template for corporate bailouts. It had dire long-term implications for both working people and the environment.\nIn 2008 skyrocketing fuel prices and the disappearance of credit, both for consumers to finance vehicle purchases and dealers to purchase inventory from assemblers, brought the US auto industry skidding to a halt. As sales dropped to a nearly thirty-year low in 2009 and cash flows evaporated, the threat of collapse loomed over US auto manufacturers, and by extension all of the suppliers, dealers, workers, and communities that relied on them.\nIn response the incoming Obama administration negotiated a multibillion-dollar bailout deal that exchanged cash for a Treasury-led restructuring at General Motors and Chrysler. (Ford’s cash reserves enabled it to avoid bankruptcy and federal restructuring.) Following the fairly rapid structured bankruptcy, twenty-two assembly and supply plants and three warehouses were shuttered, numerous divisions were wound down or sold off, and thousands of workers were laid off or bought out.\nFor auto manufacturers the bailout was a godsend. It enabled General Motors and Chrysler to eliminate less profitable lines and cut their costs much more quickly than they would otherwise have been able to do. Within two years US motor vehicle manufacturers had returned to profitability, posting solid earnings. The bailout was chalked up as a success.\nBut was the 2009 auto bailout a success? Not from the perspective of the environment and workers.\nThe moment when the Obama administration decided that the US companies needed a major overhaul was also a moment of opportunity — a time when the government could have leveraged its power and resources to push the auto industry in a new direction, away from gas-guzzling SUVs and towards a greener more sustainable transportation system. The plants idled in the process of restructuring could have been retooled to produce materials for greening the economy, such as solar panels and wind turbines. Laid off auto workers could have been core contributors to a “just transition.”\nInstead, the skills and dedication of autoworkers were treated as a liability. Fulfilling the long-held wishes of the automakers, the Obama administration insisted that the only way forward for the industry was to drag down the wages and benefits of unionized autoworkers to match those of nonunion autoworkers.\nPractically overnight the Treasury-led corporate restructuring and downsizing rolled back decades of hard-won gains: thousands of blue-collar and white-collar auto jobs were destroyed; an unfair multitiered wage and benefit system was normalized and expanded; and livelihoods for many auto workers were slashed to poverty levels.\nThe auto companies tried to put a positive spin on these cuts, claiming that the cash they saved by cutting labor costs would enable them to focus on developing profitable small cars and electric vehicles rather than relying so heavily on SUVs.\nPromises, promises. General Motors spent $22 billion on dividends and buybacks between 2015 and 2019, all while closing even more plants. US automakers rely on SUVs to generate profits more than ever before and have essentially abandoned the small car market. They claim to be channeling money toward electric vehicle development, but electric vehicles represent a minuscule percentage of their fleet. Meanwhile, low oil prices (thanks in part to fracking) and Trump’s freeze on corporate average fuel economy standards promise to lock in automakers’ addiction to SUVs for the foreseeable future.\nA little over a decade has passed since the auto bailout, but the ramifications are clear. The crisis was used to push through changes that benefited corporate executives and investors and hurt ordinary people and the environment. More broadly, the nature of the restructuring sent a clear message to working people: when push comes to shove you are dispensable.\nWith the economy in free fall it may feel like there is no time to worry about what will happen ten or twenty years down the road. Given the very real dangers posed by COVID-19 to not only our livelihoods but also our lives, there is an understandable sense of urgency to do something and do it quickly.\nBut before we hand over billions and possibly trillions of dollars to corporations that have proven time and again that they value profits above all else, we should take a pause. There is time to put people first.", "url": "https://jacobinmag.com/2020/03/corporate-bailout-2009-auto-workers-recession-coronavirus"}