{"authors": ["Hanna Ziady", "Cnn Business"], "date_download": "2020-05-04 16:01:47", "date_modify": "2020-05-04 16:01:47", "date_publish": "2020-04-01 17:19:03", "description": "The maker of Camel, Lucky Strike and Pall Mall cigarettes is trying its hand at a new product: a coronavirus vaccine.", "filename": "2020_04_01_business_coronav_1c8ff8942afc39b807b4c5d3f6864452_index_1588608107.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401115106-kentucky-bioprocessing-facility-file-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_business_coronav_1c8ff8942afc39b807b4c5d3f6864452_index_1588608107.html", "title": "Coronavirus vaccine race now includes British American Tobacco", "title_page": "Coronavirus vaccine race now includes British American Tobacco - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) The maker of Camel, Lucky Strike and Pall Mall cigarettes is trying its hand at a new product: a coronavirus vaccine.\nBritish American Tobacco BTAFF said Wednesday that its biotech subsidiary, Kentucky BioProcessing, is working on a potential vaccine for the novel coronavirus that can be produced in lab-grown plants closely related to tobacco.\nThe biotech firm, which helped develop an experimental Ebola treatment in 2014, joins dozens of other companies racing to develop a vaccine for Covid-19, which has now infected over 880,000 people globally and claimed more than 44,000 lives.\nThe development of vaccines typically takes years, but scientists and government authorities are hoping to fast-track the process to prevent a resurgence of the virus. Many experts say a vaccine is at least 18 months away, but others caution that even that timetable is optimistic.\nBritish American Tobacco said that its potential vaccine is currently being tested on animals, and it is \"exploring partnerships with government agencies\" to bring the vaccine to clinical studies.\nRead More", "url": "https://www.cnn.com/2020/04/01/business/coronavirus-vaccine-british-american-tobacco/index.html"}