{"authors": ["Kristen Holmes", "Daniella Diaz"], "date_download": "2020-05-04 16:09:32", "date_modify": "2020-05-04 16:09:32", "date_publish": "2020-04-02 20:56:34", "description": "The federal government had faulty ventilators. Then the coronavirus hit.", "filename": "2020_04_02_politics_ventilators-maintenance-fema-coronavirus_index_1588608572.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401081209-ventilators-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_ventilators-maintenance-fema-coronavirus_index_1588608572.html", "title": "Thousands of ventilators in maintenance as government struggles to meet needs", "title_page": "Thousands of ventilators in maintenance as government struggles to meet needs - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Thousands of ventilators managed by the federal government were unable to be deployed in the wake of the novel coronavirus pandemic because of a lapse in the government contract to keep the machines maintained, a source familiar with the matter told CNN.\nPresident Donald Trump said Tuesday the federal government was holding on to 10,000 ventilators because of an anticipated surge in the novel coronavirus. But roughly 20% of that reserve -- were out of commission because they needed maintenance.\nThe news of the inaccessible ventilators comes as states, hospitals and the federal government fight to acquire enough ventilators to treat patients suffering from coronavirus amid the pandemic. And as of this week, the Strategic National Stockpile is almost empty, a source familiar with the situation told CNN Wednesday.\nBoth California and New York, states reporting higher cases of coronavirus, have reported being sent ventilators that weren't operational.\nLate last summer, the US government contract with the company that maintains ventilators and other medical devices within the stockpile lapsed. In September, Agiliti, a Minnesota-based company specializing in these kinds of acute medical devices, was contracted to take over that role but almost immediately after the contract was awarded, the company was told to stand down by the federal government.\nOn January 24, Agiliti was contracted to maintain the ventilators that would eventually be needed, after the first case of the novel coronavirus had been detected in the United States.\nAs the number of coronavirus cases rose in the US, the administration announced there were 16,600 ventilators ready to be deployed, failing to mention that an additional 2,425 of them were out of commission.\nIn a statement to CNN, a spokesperson from Health and Human Services said that all of the 16,600 ventilators in the stockpile were \"serviced, recertified and operable\" and that the more than 2,000 others \"were in maintenance at that time as part of the normal process,\" adding that \"the SNS, with Agiliti, is committed to making all of these ventilators available for the COVID-19 response by April 30.\"\nOn Wednesday, the government issued a new contract with Agiliti to accelerate the maintenance of the ventilators. The company already has to get them ready to be sent out by the end of the month, and get those ventilators that have already been serviced out the door. This contract will also add a new field service component so that once they are in the field they work and maintain these devices once they are in the hospitals.\nSupply problems in New York and California\nThe Strategic National Stockpile, the federal government's supply of medical supplies that is managed by the Department of Health and Human Services and distributed to states by the Federal Emergency Management Agency, has seen other problems as well.\nAs of this week, the stockpile has been almost fully exhausted of medical equipment like masks and ventilators, a source familiar with the situation told CNN Wednesday. But leading up to the start of the novel coronavirus pandemic, California and New York reported having been sent ventilators that were inoperational.\nNew York health care provider Northwell Health told CNN it was sent ventilators that were missing parts in an order from the national stockpile.\n\"We are grateful for the pumps we got from the stockpile but some of them were missing air hoses and stands,\" said Northwell Health spokesman Terence Lynam.\nLynam said after the company received the faulty ventilators, it directly ordered the hoses and stands from the manufacturer to get them operational.\nAnother hospital in New York, NewYork-Presbyterian Hospital, also told CNN it received 220 ventilators from the national stockpile last week but the machines needed repair.\nCalifornia also received a shipment of ventilators that weren't operational.\n\"We're working with Bloom energy and others to convert that cache of 514 ventilators that we had, to refurbish them and to get them fully operational,\" California Gov. Gavin Newsom said last week.\nNewsom said he worked directly with Bloom Energy to get them operational rather than work with the federal government.\n\"There was a casual conversation about the 170 ventilators that came from the national stockpile directly to LA County,\" Newsom said later in the week.\n\"The conversation wasn't just about those 170, it was about the fact those 170 were not working, and rather than lamenting about it, rather than complaining about it, rather than pointing fingers, rather than generating headlines in order to generate more stress and anxiety, we got a car, and a truck, and we had those 170 brought here to this facility at 8 a.m. this morning.\"", "url": "https://www.cnn.com/2020/04/02/politics/ventilators-maintenance-fema-coronavirus/index.html"}