{"authors": [], "date_download": "2020-05-04 20:05:14", "date_modify": "2020-05-04 20:05:14", "date_publish": "2020-04-09 21:17:28", "description": "RICHMOND, Va. (AP) — Six more residents of a Virginia long-term care facility have died, bringing the death toll there amid a coronavirus outbreak to 39, an employee said Thursday. “Our...", "filename": "_b9da44db9d5a1d1c06fc1aa48974c165_1588622714.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f255913982d9459385dba36483b33971/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b9da44db9d5a1d1c06fc1aa48974c165_1588622714.html", "title": "Deaths at Virginia care facility with outbreak climb to 39", "title_page": "Deaths at Virginia care facility with outbreak climb to 39", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This Friday, March 27, 2020 photo shows the Canterbury Rehabilitation & Healthcare Center in Richmond, Va. The Center is dealing with an outbreak of COVID-19 cases. Officials said Thursday that a few residents have died and dozens are showing symptoms. (AP Photo/Steve Helber)\nThis Friday, March 27, 2020 photo shows the Canterbury Rehabilitation & Healthcare Center in Richmond, Va. The Center is dealing with an outbreak of COVID-19 cases. Officials said Thursday that a few residents have died and dozens are showing symptoms. (AP Photo/Steve Helber)\nRICHMOND, Va. (AP) — Six more residents of a Virginia long-term care facility have died, bringing the death toll there amid a coronavirus outbreak to 39, an employee said Thursday.\n“Our hearts go out to the families of those who have passed, and we deeply feel the loss within our community,” Jeremiah Davis, the administrator of Canterbury Rehabilitation & Healthcare Center in suburban Richmond, said in a statement.\nCanterbury has 84 other residents who have tested positive for COVID-19 and were receiving treatment either at a regional hospital or onsite, the statement said.\nCanterbury has one of the worst-known outbreaks of coronavirus among long-term care facilities in the U.S. Its death toll is approaching that of the Life Care Center of Kirkland, a Seattle-area nursing home that was an early center of the disease before it became more widespread in the United States. At least 40 deaths have been connected to that facility.\nThe death toll at Canterbury has more than doubled in a week.", "url": "https://apnews.com/b9da44db9d5a1d1c06fc1aa48974c165"}