{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 17:02:38", "date_modify": "2020-05-04 17:02:38", "date_publish": "2020-04-10 17:04:11", "description": "The Wall Street editorial board is a notoriously conservative group, usually supporting conservative policies and Republican presidents. So, when the WSJ writes an op-ed hammering the sitting GOP president, it's worth standing up and taking notice.", "filename": "2020_04_10_politics_wall-st_27a6134ac184156aa01787f31129072f_index_1588611758.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409005522-donald-trump-april-8-2020-01-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_wall-st_27a6134ac184156aa01787f31129072f_index_1588611758.html", "title": "What the Wall Street Journal Editorial Board gets exactly right about Trump's problematic coronavirus briefings", "title_page": "What the Wall Street Journal Editorial Board gets exactly right about Trump's problematic coronavirus briefings - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Wall Street editorial board is a notoriously conservative group, usually supporting conservative policies and Republican presidents. So, when the WSJ writes an op-ed hammering the sitting GOP president, it's worth standing up and taking notice.\nThat's what happened earlier this week when the WSJ published a piece headlined \" Trump's Wasted Briefings\" that criticized President Donald Trump for his performance at the daily coronavirus task force press briefings. Here's the key bit (bolding is mine):\n\"But sometime in the last three weeks Mr. Trump seems to have concluded that the briefings could be a showcase for him. Perhaps they substitute in his mind for the campaign rallies he can no longer hold because of the risks. Perhaps he resented the media adulation that New York Gov. Andrew Cuomo has been receiving for his daily show. Whatever the reason, the briefings are now all about the President.\"\nThat absolutely nails what's gone wrong with these daily briefings. What began -- roughly a month ago -- as a useful way to inform a public desperate for facts and information in the face of the surging pandemic has turned into the Trump Show. Or, in the words of Trump himself in a 1990 interview with Playboy magazine : \"The show is Trump, and it is sold-out performances everywhere.\"\nEverything you need to know to understand Trump and how he views his life (and the presidency) is contained in that one quote. The world is one big reality show to Trump. He is the executive producer, the maestro in charge of filling each day with the most watchable material. And that most watchable material is produced -- in virtually every situation -- by him.\nRead More", "url": "https://www.cnn.com/2020/04/10/politics/wall-street-journal-trump-coronavirus-task-force/index.html"}