{"authors": ["Analysis Stephen Collinson"], "date_download": "2020-05-04 16:12:14", "date_modify": "2020-05-04 16:12:14", "date_publish": "2020-04-03 03:17:11", "description": "President Donald Trump is pinning the blame on states for a shortage of ventilators that governors warn could effectively condemn coronavirus patients to death when the pandemic peaks.", "filename": "2020_04_02_politics_donald-_9ee0d0a9e9d9951cc5722e4616d8ec59_index_1588608734.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402022125-donald-trump-coronavirus-briefing-states-ventilators-fact-check-dale-ctn-vpx-00002320-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_donald-_9ee0d0a9e9d9951cc5722e4616d8ec59_index_1588608734.html", "title": "Trump passes the buck as deadly ventilator shortage looms", "title_page": "Trump passes the buck as deadly ventilator shortage looms - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump is pinning the blame on states for a shortage of ventilators that governors warn could effectively condemn coronavirus patients to death when the pandemic peaks.\nTrump on Thursday made the belated decision to invoke wartime powers to speed production of the lifesaving breathing machines by streamlining supply chains -- but the bulk of deliveries will not arrive until June.\nThat will be too late for states such as New York, Michigan and Massachusetts that are racing to the apex of their pandemics and have been battling to buy ventilators on the open market -- often competing against one another, the federal government and foreign nations.\nThe federal government has reduced its reserves of medical equipment to almost zero, and has handed out far fewer ventilators than states are projected to need.\nThe President defended his administration against criticism that it should have acted weeks ago to surge production of ventilators and other gear before the pandemic hit US shores.\n\"The states should have been building their stockpile. We have almost 10,000 in our stockpile and we've been building it,\" Trump said at the White House.\n\"We've been supplying it. But the states should be building. We're a backup. We're not an ordering clerk.\"\nTrump also appeared to question the financial wisdom of investing in mass production of the critical breathing machines, saying that in a few months they would only be worth $5 apiece.\nWeak spots exposed\nA pandemic on this scale is a once-in-a-lifetime challenge that is bound to expose weak spots in an administration's disaster preparedness.\nBut if ventilators do run short in large numbers, the situation risks becoming a metaphor for an inadequate White House effort to battle the coronavirus and to fulfill its basic duty in keeping Americans alive. And it will further expose an administration that spends as much time praising its own response in its task force briefings as delivering honest information about the fight against the virus.\nThursday's briefing inadvertently exposed the chaotic nature of the government effort to slow the pandemic. At one stage, the President's son-in-law Jared Kushner related an anecdote about one of Trump's friend's calling the President to request medical supplies for a New York hospital, and his own efforts to facilitate the delivery of N95 masks.\nWhile Kushner appeared to believe the story was an example of success, it instead hinted at dysfunction and the lack of a proper procurement process in the federal effort.\nMuch of Thursday's briefing came across as a barely veiled attempt by the White House to deflect blame for the ventilator crisis if the need for the machines becomes acute, and stories begin to emerge of patients who could have lived but for the shortage.\nThe President has spent much of the last three years suggesting his powers are all but absolute. But his odd refusal to use the full range of his authority in this pandemic is curious. He came to power saying that \"he alone could fix\" the problems ailing the nation. But in this crisis, he says he's only a \"back up.\"\nTrump has previously accused states like New York of hoarding ventilators. He also said he doubted the Empire State really needed the 40,000 machines that it requested.\nThe ventilator crunch is reaching critical levels in several states and cities as hospitals are hit by a tsunami of sick patients weeks before the expected peak of critically ill cases.\nPhysicians on the front line have warned that doctors could face agonizing choices over which patients live or die if there are not sufficient machines available.\nWhen the pandemic finally ends, investigations may well establish that both states and the federal government are to blame for the threadbare stockpiles of machines that may only have been needed in bulk during pandemics.\nBut Trump's weeks of denial about the gravity of the pandemic and reluctance to force firms to make the machines has wasted valuable time. Had he acted six weeks ago, new ventilators might must be coming on line. And waging a blame game ignores that one of the President's jobs at a time of extremism is to assess where the nation's federal system has created loopholes of authority and supply and to fill the gaps.\n'Several thousand ventilators'\nThe building controversy over ventilators came as it emerged that 20% of a federal reserve of ventilators were out of commission because their maintenance contract lapsed.\nHospitals in California and New York received machines from the stockpile but found them to need repair, according to the story first reported by The New York Times and CNN reporting . Federal officials have said they have sent 4,400 ventilators to New York -- by far the worst-hit US state -- from the national stockpile.\nEven the new ventilators will not be available to states that are in the heat of the coronavirus battle right now.\n\"We are online to receive several thousand ventilators in the month of April and several thousand more in the month of May ramping up to a big number in June,\" said Rear Adm. John Polowczyk who coordinates supply chain matters on the coronavirus task force.\nThe timing issue also featured in a cameo in the briefing by Peter Navarro, a top Trump official, who put on a show of flattery of the President remarkable even for this White House.\nNavarro said the President had ordered General Motors to manufacture ventilators in \"Trump time -- which is as fast as possible,\" even though the President rebuffed calls for weeks from critics to fully utilize the Defense Production Act to surge their manufacture. On Monday, the President said that Ford had agreed to repurpose production lines to build 50,000 ventilators in 100 days.\n\"Trump time\" is not going to be fast enough for New York Gov. Andrew Cuomo, who said on Thursday his state has about six days at the current \"burn rate\" of ventilators.\n\"It's very simple: A person comes into the ICU unit. They need the ventilator, or they die. It's that basic proposition,\" Cuomo said during a CNN town hall on the coronavirus.\nCuomo said the state had bought 17,000 ventilators but they have yet to be delivered because they are coming from China and 50 states and the federal government are competing for the equipment. New York has only 4,000 ventilators in the state, Cuomo said.\n\"Obviously, nobody would say that this was the best way to do it,\" Cuomo said, \"to have 50 states compete, but that's where we are.\"\nOn Wednesday night, Michigan Gov. Gretchen Whitmer told CNN her state lacked sufficient ventilators. New Jersey Gov. Phil Murphy said on CNN's \"The Situation Room\" on Thursday that an investigation was needed after the pandemic to find out why there is such a shortfall in of the vital equipment.\nMarylou Sudders, secretary of Health and Human Services in Massachusetts, which is experiencing a surge in coronavirus cases, said the commonwealth had requested 1,400 ventilators.\n\"We have repeatedly asked for ventilators from the federal government and increased our ask today,\" Judders said. \"We have not yet received any ventilators and of course any ventilators that come in will immediately go to hospitals to be tested before they are utilized.\"\nOn Tuesday, Connecticut Gov. Ned Lamont said the struggle to get sufficient ventilators was a source of \"enormous frustration.\"\nThe US Centers for Disease Control and Prevention has said that thousands of ventilators from a government stockpile have already been sent around the country.\nThe Department of Health and Human Services sent a letter to medical providers this week suggesting that ventilators could be shared between two patients in an \"absolute last resort\" crisis situation.", "url": "https://www.cnn.com/2020/04/02/politics/donald-trump-ventilators-leadership-coronavirus/index.html"}