{"authors": ["Meg Wagner"], "date_download": "2020-05-04 16:17:20", "date_modify": "2020-05-04 16:17:20", "date_publish": "2020-04-03 13:24:02", "description": "Should you or shouldn't you wear a face mask during the coronavirus pandemic? Here's what health organizations and top experts say.", "filename": "2020_04_03_us_face-masks-health-experts-guidance-trnd_index_1588609040.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200328031805-01-coronavirus-new-york-0327-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_us_face-masks-health-experts-guidance-trnd_index_1588609040.html", "title": "Face masks: What health experts say", "title_page": "Face masks: What health experts say - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Should you or shouldn't you wear a face mask during the coronavirus pandemic? Here's what health organizations and top experts say.\nThe US Centers for Disease Control and Prevention: The organization said Friday that new evidence about people who are not showing symptoms being able to spread the virus in close proximity has led it to recommend \"cloth face coverings in public settings where other social distancing measures are difficult to maintain (e.g., grocery stores and pharmacies) especially in areas of significant community-based transmission.\" The CDC said cloth face coverings made at home or low cost can be used as a voluntary health measure.\nThe World Health Organization: WHO is standing by : WHO is standing by its recommendation to only wear a mask if you are sick or caring for someone who is sick. \"Mask wearing by the general public is not among the WHO's recommendations,\" the organization said.\nDr. Anthony Fauci, the director of the National Institute of Allergy: He said masks should not be used as a substitute for social distancing, but rather can be used as a supplement. \"Because of some recent information that the virus can actually be spread even when people just speak as opposed to coughing and sneezing, the better part of valor is that when you're out and you can't maintain that six-foot distance to wear some sort of facial covering.\" has said that the White House Task Force : He said masks should not be used as a substitute for social distancing, but rather can be used as a supplement. \"Because of some recent information that the virus can actually be spread even when people just speak as opposed to coughing and sneezing, the better part of valor is that when you're out and you can't maintain that six-foot distance to wear some sort of facial covering.\" has said that the White House Task Force is actively discussing guidelines on masks.", "url": "https://www.cnn.com/2020/04/03/us/face-masks-health-experts-guidance-trnd/index.html"}