{"authors": ["Paris Marx", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "David Harvey", "Grace Blakeley", "Eoghan Gilmartin"], "date_download": "2020-05-04 19:59:51", "date_modify": "2020-05-04 19:59:51", "date_publish": "2020-03-23 00:00:00", "description": null, "filename": "2020_03_nationalize-airline-industry-coronavirus-climate-emissions_1588622391.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/23113854/GettyImages-1212692972.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_nationalize-airline-industry-coronavirus-climate-emissions_1588622391.html", "title": "Nationalize the Airlines", "title_page": "Nationalize the Airlines", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The rapid growth in the number of cases of the novel coronavirus, known as COVID-19, has quickly cratered air traffic as people cancel their holidays, postpone business travel, and avoid close contact with others to limit its spread. Airlines around the world are now facing severe financial pressures and are responding by cutting flights, laying off workers, and begging governments for financial assistance.\nIn the United Kingdom, IAG, which owns British Airways, has announced its flight capacity will be cut by 75 percent and Virgin Atlantic will cut 80 percent of its flights — with staff asked to take eight weeks of unpaid leave. Ryanair, EasyJet, and Norwegian are also cutting most of their flights and their workers face layoffs, pay cuts, and potentially even job losses. Similar announcements are being made by airlines throughout Europe, North America, and Australia and New Zealand as the Centre for Aviation estimates most airlines could be bankrupt by May without government assistance.\nAirline share prices are falling dramatically: British Airways down almost by half, Lufthansa down 41 percent, and Air-France/KLM down 56 percent. Even before the coronavirus, the airline industry was in a fragile position — with smaller airlines like Flybe and Wow Air hitting the wall and larger airlines often hopelessly over-leveraged. This crisis calls for a radical reassessment of the sector as a whole, and a means for governments to plan a way forward.\nEven in the face of the climate crisis, air travel remains an important part of the economy — but that does not mean it must continue in the same way it has in the past. Instead of simply bailing out the airlines so they can resume operations once the virus is cured, we need to rethink the role that airlines play in our transportation networks and take them into public ownership so they can be democratically planned to achieve social and environmental goals.\nMajor airlines used to be owned by national governments until a few decades ago and many continue to operate under public ownership, or at least with a significant stake owned by governments. In response to the coronavirus crisis, Italy has already renationalized Alitalia. It will be the first of many countries to make similar moves.\nClearly, action needs to be taken today to protect airline workers’ jobs — but it must be strategic. Handing over huge sums of public money to wealthy airline investors or celebrity billionaires like Richard Branson without securing additional powers for the state in terms of input into the future of the industry, improving conditions for workers, and meeting urgent climate targets would be a foolish mistake.\nIf airlines are truly poised to go under, they should be nationalized at a significant discount. If assistance is provided, it cannot be without strings, which must include an ownership stake along with a commitment to meeting public goals that would include integrated planning, a better passenger experience, and protections for workers.\n(Re)nationalized airlines should be planned as part of a broader transportation system, with the goal of reducing unnecessary air travel, particularly on short-haul routes, to achieve emissions reductions. Ideally, this would be in conjunction with a rail system that is also returned to public ownership, which would allow for improvements to reliability, frequency, and a reduction in ticket prices to encourage people to use trains instead of cars and planes. This would enable a public intercity transport authority to effectively plan for the public’s mobility needs by diverting more resources into the rail system, while eliminating short-haul flight routes where the same trip can be taken on a train in a reasonable time.\nIn practice, a focus on reducing emissions while keeping trips affordable and ensuring people can reach their destinations in a similar time frame as an entire air journey, including time to and from the airport and going through security, would allow for resources to be diverted from air to improving rail service throughout the United Kingdom and on many routes to the continent. Train services are already competitive with flights between major centers in the United Kingdom, and that will only improve with HS2 and High Speed North. A public rail system could also improve services to smaller cities and communities around the country.\nAlready, train services are time-competitive with flights to cities in France, Belgium, the Netherlands, and even parts of western Germany. However, reaching those destinations by train can often cost more than booking a discount flight. An intercity transport authority, in cooperation with partners on the continent, must work to change that by pricing in the externalities of air travel and reducing the price of train journeys in recognition of the broader social and economic benefits of increasing access to transport services and connections between peoples.\nBut there will be some routes that simply won’t be able to be serviced by trains because the distances are too long. For those routes, the air travel experience must improve with greater comfort and space for passengers, instead of making people feel like sardines packed into a metal tube, and fewer punitive fees for everything from a bag to a forgotten boarding pass. Private jets, which emit much more per passenger than a conventional flight, must also be banned, with the rich forced to fly in the same planes as everyone else.\nThousands of airline workers are being thrown to the wolves today, with mass layoffs already in Norwegian, Scandinavian Airlines, and KLM. To prevent the same in the United Kingdom, we need action today. That means government recognizing the particular problem the airline industry faces — not just today, but over the coming years in the context of the climate crisis — and its strategic importance to both the economy and society. Any such recognition would make the case for nationalization at substantially reduced cost clear.\nAirline workers have contributed to the incredible wealth of the executives and shareholders of major airlines, and if the companies themselves can’t afford to pay their workers without going bankrupt, the government must. But in exchange, they have to insist on airline executives and wealthy investors taking a very significant hit. Golden handshakes and vulture profiteering as thousands of workers lose jobs will rightly infuriate the public.\nAs concern about air travel emissions has grown in recent years, especially given they’re rising at a much faster rate than in other industries, those concerned with climate change have been wondering how air travel might be curbed in a sustainable future. The crisis brought on by COVID-19 is stark — but it offers an opportunity to break with the status quo. Policies which last week seemed impossible are now being implemented in countries around the world to combat the economic fallout.\nWith planes grounded around the world, it’s time to rethink the structure and incentives of our transportation networks — and for governments to take decisive action not only to protect workers today but to determine how people travel in the future.", "url": "https://www.jacobinmag.com/2020/03/nationalize-airline-industry-coronavirus-climate-emissions"}