{"authors": ["Matt Mcfarland", "Cnn Business"], "date_download": "2020-05-04 16:13:48", "date_modify": "2020-05-04 16:13:48", "date_publish": "2020-04-03 12:13:56", "description": "Less than a month ago, Mitch Patel's hotel business was booming.", "filename": "2020_04_03_economy_hotel-industry-coronavirus_index_1588608828.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331144543-jw-marriott-hotel-la-0327-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_economy_hotel-industry-coronavirus_index_1588608828.html", "title": "Hotel industry says it will struggle to get by even with government help", "title_page": "Hotel industry says it will struggle to get by even with government help - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "His company, Vision Hospitality Group, owns 37 hotels in six states and it had seen record business in January and February, according to Patel. Things were going so well, he was planning to open two more hotels this year, and seven next year.\nBut then, in early March, Patel met with executives from Marriott, the brand many of his hotels operate under, to discuss business. China came up. The hotel business there had plummeted amid the coronavirus outbreak.\n\"We were saying 'that is awful,' and 'thank God that that's not the situation -- or what we expect -- in this country,'\" Patel recalled. \"And then Friday the 13th came.\"\nThat was the Friday when President Donald Trump declared a national emergency in the fight against the coronavirus, which had already been designated a pandemic by the World Health Organization.\nCancellation reports from Patel's hotels started escalating and turned dire. For March, April and May, the projected occupancy sank below 10%.\nVision Hospitality Group CEO Mitch Patel has had to take drastic steps to help his hotels survive the coronavirus outbreak.\n\"We were in denial. We were in shock. It was almost surreal,\" he said.\nPatel has since had to furlough 1,100 of his 1,500 employees. \"That's really broken my heart. Every day I get up and I think about 'how can I bring my people back?'.\"\nA nightmare for hotels\nMarriott MAR The Intercontinental Hotels Group IHG hotel brands among others, said that demand for rooms is the lowest it's ever seen. Coronavirus has devastated the hospitality industry, forcing hotels to take drastic steps to survive.has said it's seen cancellations at historic highs, forcing the company to furlough thousands of workers. The, which owns the Holiday Inn and Crowne Plazahotel brands among others, said that demand for roomsis the lowest it's ever seen.\nHotel room occupancy rates for the week of March 24th to the 30th fell 67.5% when compared to the same week in 2019, according to the hospitality analytics firm Smith Travel Group.\nThere have been mass furloughs and layoffs across the industry. Many executives have given up their salaries or taken pay cuts. Some hotels have closed temporarily. Others, like Patel's, are staying open with a skeleton staff.\nChip Rogers, CEO of the American Hotel & Lodging Association, expects that over the next month about half of hotels in the US will shut down temporarily to weather the coronavirus outbreak, and half will remain open with small teams. An Oxford Economics study conducted for AHLA found that 44% of hotel employees are likely to lose their jobs.\nAnd while the $2 trillion financial stimulus package will help, Rogers said it's far from enough.\n\"It's a short-term preservation package that can carry the industry for a couple of months,\" Rogers said. \"But if you get to June and people aren't traveling again, then the problem we have today will be much worse.\"\nThe CARES Act limits loans to 250% of average monthly payroll, which will be enough only to meet payroll and debt obligations for four to eight weeks, according to Rogers. His group believes hotels need more financial support, and he said lobbying is ongoing for an additional stimulus package to help hotels with their debts.\nExactly how much is needed is unclear, and depends on how quickly revenue returns. Rogers also said a stimulus will be needed once the virus passes, to encourage people to get out and travel again.\nIn the meantime, he's encouraging hotels to talk to their mortgage lenders and adjust their payment schedules. Rogers said that banks have been good so far about offering flexibility on payments. Patel, for example, said that most banks are offering 90-day deferrals, and some 180 days.\ntraveling. But he doesn't expect business will return to 2019 levels for three or four years. Patel pointed to projections from Patel hopes to slowly ramp his businesses back up in 90 days, as travel restrictions hopefully lift and people become more comfortable withtraveling. But he doesn't expect business will return to 2019 levels for three or four years. Patel pointed to projections from Smith Travel Group , which expects 2020 revenue per room for the hotel industry to fall 50.6%. Those are deeper losses than what the industry faced after 9/11 and the 2008 recession.\nPatel expects that many hotels won't survive.\n\"When this has been lifted, please go out and travel and eat and let's be Americans again,\" Patel said. \"But only when it's safe.\"", "url": "https://www.cnn.com/2020/04/03/economy/hotel-industry-coronavirus/index.html"}