{"authors": ["Luke Mcgee"], "date_download": "2020-05-04 16:24:53", "date_modify": "2020-05-04 16:24:53", "date_publish": "2020-04-06 23:58:16", "description": "Before British Prime Minister Boris Johnson went into intensive care on Monday evening with worsening coronavirus-related symptoms, he asked his Foreign Secretary and First Secretary of State Dominic Raab to deputize for him \"where necessary.\"", "filename": "2020_04_06_world_dominic-raab-boris-johnson-coronavirus-intl_index_1588609493.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406131103-01-dominic-raab-0406-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_world_dominic-raab-boris-johnson-coronavirus-intl_index_1588609493.html", "title": "Who is Dominic Raab? The Brexiteer ex-lawyer deputizing for Boris Johnson", "title_page": "Who is Dominic Raab? The Brexiteer ex-lawyer deputizing for Boris Johnson - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN) Before British Prime Minister Boris Johnson went into intensive care on Monday evening with worsening coronavirus-related symptoms, he asked his Foreign Secretary and First Secretary of State Dominic Raab to deputize for him \"where necessary.\"\nWhile now is a time of great uncertainty for the British public, Johnson's handing over of some duties to Raab should be relatively seamless and is unlikely to affect any immediate government business.\nLess clear is what will happen if Johnson is incapacitated for more than a few days. There's no clear \"Plan B\" in Britain's constitution or in the Cabinet Manual -- which lays out the rules for running the government -- for who should take over if Johnson isn't able to lead the country, experts told Reuters.\nOne thing that should help in terms of continuity: Unlike in the United States, where a President might hail from a different party than leaders in Congress, the UK government is entirely comprised of members of Parliament from Johnson's party, which won the most seats in December's election -- meaning it operates as one entity.\nAn ardent Brexiteer\nRead More", "url": "https://www.cnn.com/2020/04/06/world/dominic-raab-boris-johnson-coronavirus-intl/index.html"}