{"authors": [], "date_download": "2020-05-04 20:07:48", "date_modify": "2020-05-04 20:07:48", "date_publish": "2020-04-16 17:45:31", "description": "DES MOINES, Iowa (AP) — Unemployment claims continued to surge last week in Iowa as more workers lost their jobs amid efforts to curb the spread of the coronavirus, but the numbers came in lower...", "filename": "_4a7666ea204e81ad56625a119c0824fe_1588622868.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4a7666ea204e81ad56625a119c0824fe_1588622868.html", "title": "Virus-driven surge in unemployment claims continues in Iowa", "title_page": "Virus-driven surge in unemployment claims continues in Iowa", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DES MOINES, Iowa (AP) — Unemployment claims continued to surge last week in Iowa as more workers lost their jobs amid efforts to curb the spread of the coronavirus, but the numbers came in lower than the previous week’s record high.\nThe U.S. Department of Labor reported Thursday that 46,356 people in Iowa filed for unemployment benefits in the week that ended April 11. While high, the number was a drop from the record 67,334 people who filed in the week that ended April 4 and the 58,000 who filed the week before that.\nBefore the virus hit Iowa’s job market, jobless claims typically were around 2,200 a week.\nNationally, another 5.2 million people sought benefits last week.\nThe largest number of Iowa claims last week were from workers in health care and social assistance, which saw 6,789 people seek benefits. That was followed by workers in manufacturing, with 6,002; workers in retail trade, with 5,813; and food service and lodging, at 4,292.\nIowa has now seen more than 128,800 unemployment claims in the last four weeks, the department said..\nLike governors across the country, Gov. Kim Reynolds has ordered the closure of many retail establishments and recommended the closure of schools.", "url": "https://apnews.com/4a7666ea204e81ad56625a119c0824fe"}