{"authors": ["Hope Yen", "Christopher Rugaber"], "date_download": "2020-05-04 20:31:51", "date_modify": "2020-05-04 20:31:51", "date_publish": "2020-04-07 18:16:49", "description": "WASHINGTON (AP) — Defending his administration’s response to the coronavirus, President Donald Trump falsely asserted that travelers at U.S. airports are being routinely tested for COVID-19, made...", "filename": "_9f7c772caa4b72f82f0ed54045af45c4_1588624311.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c8dc6cb4ac504ccab363c26b9cf733ec/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9f7c772caa4b72f82f0ed54045af45c4_1588624311.html", "title": "AP FACT CHECK: Trump myths on new jobs, airport virus tests", "title_page": "AP FACT CHECK: Trump myths on new jobs, airport virus tests", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Donald Trump speaks about the coronavirus in the James Brady Press Briefing Room of the White House, Monday, April 6, 2020, in Washington. (AP Photo/Alex Brandon)\nPresident Donald Trump speaks about the coronavirus in the James Brady Press Briefing Room of the White House, Monday, April 6, 2020, in Washington. (AP Photo/Alex Brandon)\nWASHINGTON (AP) — Defending his administration’s response to the coronavirus , President Donald Trump falsely asserted that travelers at U.S. airports are being routinely tested for COVID-19, made groundless accusations against a government watchdog and wrongly claimed the Obama administration did nothing during a flu pandemic.\nMeanwhile, with many businesses shuttered during the outbreak, Trump claimed his daughter Ivanka created over 15 million jobs for the U.S. That’s a complete illusion.\nA look at some of his claims:\nECONOMY\nTRUMP, with his daughter Ivanka in the Roosevelt Room of the White House: “She created over 15 million jobs.” — speaking Tuesday with bankers via video conference about virus aid for small businesses.\nTHE FACTS: That’s nowhere near reality. Before the coronavirus became widespread, less than half that many jobs were added to the entire U.S. workforce during Trump’s presidency, and his daughter was not responsible for them. Now, with nearly 10 million people seeking unemployment benefits in just the past two weeks, those jobs have all been lost. Most economists forecast the unemployment rate will jump to 10% or higher in early May.\nThe president is referring to a White House initiative led by Ivanka Trump that has garnered nonbinding commitments from companies to provide 14 million or so training opportunities in the years ahead. Training for a job is not working at a job for money.\nThere’s no telling how many workers were already going to be trained, absent the initiative. In many cases, the pledge simply confers a presidential seal of approval on what some companies are doing anyway. By having companies sign the pledge, the administration is relying on the private sector to take on more of the financial burden of training workers.\n___\nTRAVEL RESTRICTIONS\nTRUMP, explaining his hesitancy to suspend U.S. domestic flights to stem spread of the virus: “They’re generally very, very empty planes. ... There’s also testing done when people get onto those planes and also when people get off the planes.” — news briefing Monday.\nTHE FACTS: False. There’s no evidence to support his suggestion that travelers at U.S. airports are being regularly tested, let alone when they both get on and off the planes.\nThere are coronavirus screenings of some passengers arriving at 13 major U.S. airports on international flights, which involve temperature checks and questioning by U.S. agents about possible symptoms. Some states are also screening passengers who are arriving from hard-hit coronavirus areas in the U.S. and asking them to self-isolate. None of that is the same as getting a COVID-19 test, and there are plenty of gaps in containment.\nThe screenings, for instance, can miss people who don’t yet show symptoms of COVID-19; while symptoms often appear within five or six days of exposure, the incubation period is 14 days.\nThe checks on international travelers are primarily conducted for American citizens, legal permanent residents, and their immediate families who recently visited certain countries — many parts of Europe, as well as China and Iran.\nSome states including Florida and Texas also said they will screen airline passengers arriving from New York, New Jersey and Connecticut and ask them to self-quarantine for 14 days. Texas is also requiring screenings for people arriving from New Orleans.\n___\nTESTING\nTRUMP, on a report from the Health and Human Services Department’s watchdog that found hospitals faced severe shortages of coronavirus test supplies: “Did I hear the word inspector general? Really? It’s wrong. ... Could politics be entered into that?” — news briefing Monday.\nTRUMP: “You didn’t tell me also that this inspector general came out of the Obama administration.” — news briefing Monday.\nTHE FACTS: His claims are groundless. There is no evidence that the report was “wrong” or politically motivated. And it’s a politically expedient distortion to brand federal employees whose service spans administrations as creatures of the previous one.\nIt was based on a survey of 323 hospitals around the country in late March and reported described conditions. It did not make any judgments about the federal health department or the Trump administration.\nWith coronavirus cases rocketing toward their expected peak, the inspector general’s office reported that a shortage of tests and long waits for results were at the root of mounting problems faced by hospitals.\nOverseeing the report was Christi A. Grimm, who is acting as HHS inspector general. She is a career government manager who took over the position early this year in an interim capacity.\nGrimm began her career with the agency in 1999 and has served under both Republican and Democratic administrations.\n___\nTRUMP: “Nobody has done more testing ... If (other countries) did the kind of testing proportionally that we are doing, they’d have many more cases than us.” — news briefing Monday.\nTHE FACTS: That’s flat wrong. While more tests mean more known cases, the U.S. lags proportionally in testing its citizens. South Korea, for example, actually has a higher rate of testing. It also has fewer known cases, both in absolute terms and as a percentage of its population.\nOne test has been done for every 105 South Koreans, compared with one for every 165 Americans.\nAltogether, South Korea has conducted 477,000 tests; the U.S. has conducted 2 million. But South Korea’s population is six times smaller.\nThe U.S. only recently surpassed South Korea in the total number of tests, even though both countries reported their first confirmed cases on the same day in January.\nThe U.S. count of infections is now going up fast in part because the virus is spreading and in part because of a test shortage that lasted weeks, as well as a backlog in laboratories reporting results. U.S. testing continues to be constrained by shortages of key supplies, including sampling swabs, and backlogs of tens of thousands of unprocessed tests.\nDaily case counts are rapidly rising in the U.S. and are currently over 370,000. South Korea, which emphasized early widespread testing and strict containment, saw less of a spike in cases, and its curve has leveled off at 10,300. That would be close to 70,000 cases if its population were the same as the U.S.\n___\nGOVERNMENT RESPONSE\nTRUMP, saying his administration is doing a “great job” handling the coronavirus: “Take a look at the swine flu. That’s H1N1 ... It was a disaster. 17,000 people died. The other administration, they didn’t even know — it was like they didn’t even know it was here.” — news briefing Monday.\nTHE FACTS: His suggestion that the Obama administration was oblivious and did nothing during the 2009 H1N1 pandemic, initially called “swine flu,” is wrong.\nThen, the Centers for Disease Control and Prevention’s flu surveillance network actually sounded the alarm, spotting two children in California who were the first diagnosed cases of the new flu strain. About two weeks later, the U.S. declared a public health emergency and CDC began releasing anti-flu drugs from the national stockpile to help hospitals get ready. In contrast, Trump declared a state of emergency in early March, seven weeks after the first U.S. case of COVID-19 was announced.\nAs for thousands dying, it actually turned out that the new H1N1 strain was less deadly than average seasonal flu. But even that comparison is problematic, because regular flu years are deadliest for the elderly while H1N1 was riskiest for younger people.\n___\nAssociated Press writers Josh Boak, Colleen Long, Matthew Perrone, Ricardo Alonso-Zaldivar, Lauran Neergaard and Calvin Woodward contributed to this report.\n___\nEDITOR’S NOTE — A look at the veracity of claims by political figures.\n___\nFind AP Fact Checks at http://apne.ws/2kbx8bd\nFollow @APFactCheck on Twitter: https://twitter.com/APFactCheck", "url": "https://apnews.com/9f7c772caa4b72f82f0ed54045af45c4"}