{"authors": ["Opinion William Saunderson-Meyer"], "date_download": "2020-05-04 16:12:30", "date_modify": "2020-05-04 16:12:30", "date_publish": "2020-04-03 02:26:15", "description": "It was a rare moment of national unity in a country that in the past decade has become increasingly fractious and fraught with racial and ethnic tensions. But it did not last long.", "filename": "2020_04_02_opinions_south-a_454afc31e0f17d816693aa1c3e70e8ca_index_1588608750.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401133712-02-johannesburg-lockdown-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_opinions_south-a_454afc31e0f17d816693aa1c3e70e8ca_index_1588608750.html", "title": "In locked-down South Africa, unity is fleeting", "title_page": "South Africa coronavirus: Unity is fleeting under lockdown - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "William Saunderson-Meyer is a South African newspaper columnist. Follow him on Twitter @TheJaundicedEye . The opinions expressed here are his own. Read more opinion at CNN.\n(CNN) It was a rare moment of national unity in a country that in the past decade has become increasingly fractious and fraught with racial and ethnic tensions. But it did not last long.\nTo widespread local acclaim, South African president Cyril Ramaphosa last Monday announced that a 21-day national lockdown to combat the spread of the novel coronavirus would start at midnight that Thursday. The government's measures mean that the country's borders are now closed except for transportation of fuel and essential goods. Inter-provincial travel is banned. Public transport is restricted, and only business providing essential services can remain open. Solitary exercise is not permitted, and alcohol and cigarette sales have been stopped.\nRamaphosa's announcement came as the country had watched Covid-19 sweep the globe, overwhelming the health services of much wealthier and medically well-endowed nations. In Africa, the virus seemed to take a comparatively long time to establish itself, leading to a false sense of security among many, with some experts postulating that the hot African climate might be a factor in slowing transmission. In the crowded shantytowns and townships, more dangerously, some took it as evidence of black genetic immunity.\nSo Ramaphosa's attempt to \"flatten the curve,\" with South Africa on March 22 having registered a modest 400 or so cases without any deaths, was a bold, preemptive move. (By April 2, the number of infections had surpassed 1,400.)\nNevertheless, lockdown must have been a difficult decision. Ramaphosa took a calculated gamble that it would save a thinly stretched health system from being inundated, without destroying an extremely fragile economy already grappling with recession ; one of the world's worst unemployment rates and a \"junk\" credit rating status. Despite the risks, the lockdown announcement drew cross-party support and the president's performance was widely hailed on social media for his strong performance. \"Business Day,\" often critical of Ramaphosa's African National Congress (ANC) government, enthused : \"When the country needed leadership at a time of crisis, it had a president who was ready to provide it.\"\nBut the national unity and common purpose that Ramaphosa sought to encourage lasted less than 24 hours before old ethnic suspicions within the populace and authoritarian tendencies within government started to reassert themselves.\nAn immediate point of contention was the new Solidarity Fund that the president announced and charged with an array of ambitious goals: combating and tracking the spread of Covid-19, caring for the ill, and supporting small businesses and their employees. The structuring of the Fund was vintage Ramaphosa, a former union leader and one of the negotiators of South Africa's democratic transition, whose leadership style is to stress consensus and social compacts. Since the SA fiscus doesn't have the financial resources to pump billions of dollars into the system to ease the economic effect of the virus, the still overwhelmingly white-run private sector's buy-in was crucial. He also had to dispel the inevitable skepticism toward any government initiative, given the estimate of up to one trillion rand ($57bn) of state funds that was embezzled by a cabal clustered around his predecessor, Jacob Zuma.\nThree of the country's wealthiest families, both white and black , pledged a billion rand ($54 million each toward the fight against coronavirus. This promising cross-racial cooperation unraveled almost immediately. The day after the lockdown announcement, a leaked document from the ministry overseeing the disbursement of emergency assistance to small businesses proposed guidelines specifying that only companies with 51% black ownership would be eligible for aid.\nBusiness owners panicked as Small Business Development (SBD) Minister Khumbudzo Ntshavheni tried to dismiss the document as \"fake news\" and her department said it was simply a \"draft\" document\nAfter allegations of racism, came an announcement many interpreted as xenophobic. Minister Ntshavheni announced that only South African-owned and managed spaza shops -- the small grocery stores where most black township dwellers get their provisions -- would be allowed to operate during the lockdown. Subsequent attempts at damage control did little to reduce public skepticism -- or confusion. On the first day of the lockdown, police in the coastal city Port Elizabeth forcibly shut immigrant-owned shops in a Port Elizabeth neighborhood, pepper-spraying their customers. The station commanders, according to media reports, told the chairperson of a Somali community organization that the instructions had come directly from the Small Business Development minister.\nThe gap between the conciliatory Ramaphosa and his more confrontational security ministers is especially marked. \"This is not a moment for skop en donder. This is not a moment for skiet en donder,\" the president --- echoing the threatening \"kick, shoot and beat\" Afrikaans phrase popular among the securocrats of the apartheid regime -- told soldiers at a military base near Johannesburg before the lockdown.\nPolice and military didn't seem to get the message. On Saturday, security forces fired rubber bullets at shoppers queueing outside a Johannesburg supermarket for not maintaining the required safe distance between one another. On another occasion, they blasted shoppers with a water cannon. Unverified video footage shows soldiers emptying out alcohol and there are reports of assaults on travelers. Just four days into the lockdown, the Independent Police Investigative Directorate said it was investigating three cases of murder against officers who'd allegedly used excessive force.\nIn another show of muscle-flexing, Police Minister Bheki Cele seemingly arbitrarily overruled Health Minister Zweli Mkhize's earlier statement that people could exercise outside and walk their dogs once a day if they maintained social distance.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nNo government is immune to mixed messaging as ministers grapple with an existential crisis. Nevertheless, the scale and tone of the dissonance within the Ramaphosa administration seems to indicate that even after two years in power he has not yet been able to fully assert his authority over the Zuma-supporting remnants in his cabinet.", "url": "https://www.cnn.com/2020/04/02/opinions/south-africa-lockdown-coronavirus-william-saunderson-meyer-opinion/index.html"}