{"authors": ["Chandelis Duster"], "date_download": "2020-05-04 16:00:58", "date_modify": "2020-05-04 16:00:58", "date_publish": "2020-04-01 15:34:42", "description": "California Rep. Devin Nunes on Tuesday complained that his state's decision to close schools is \"way overkill\" and unnecessarily harms the economy despite experts' urgent calls to maintain social distancing to save lives during the coronavirus pandemic.", "filename": "2020_04_01_politics_devin-nunes-coronavirus-schools_index_1588608058.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191112112551-devin-nunes-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_devin-nunes-coronavirus-schools_index_1588608058.html", "title": "Nunes again questions need for social distancing as experts warn coronavirus worst is yet to come", "title_page": "Devin Nunes again questions need for social distancing as experts warn coronavirus worst is yet to come - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) California Rep. Devin Nunes on Tuesday complained that his state's decision to close schools is \"way overkill\" and unnecessarily harms the economy despite experts' urgent calls to maintain social distancing to save lives during the coronavirus pandemic .\nThe comments by the Republican congressman, who has repeatedly questioned experts' guidance, were made hours after President Donald Trump warned Americans that the coronavirus death toll could exceed 100,000 nationwide and as more states are issuing stay-at-home orders in an effort to prevent further spreading. Last month, California Gov. Gavin Newsom said schools were likely to be closed for the rest of the school year.\n\"The schools were just canceled out here in California, which is way overkill,\" Nunes said during an interview on Fox News. \"It's possible kids could have gone back to school in two weeks to four weeks, but they just canceled the rest of the schools.\"\nNunes said he was \"optimistic\" about the use of anti-malaria drugs to treat coronavirus. The Food and Drug Administration has issued emergency use authorizations for two such drugs, chloroquine and hydroxychloroquine, to be used on patients hospitalized with coronavirus, assuming the drugs come from the national stockpile.\nVersions of the drugs -- which been used to safely prevent and treat malaria, lupus and other conditions -- could already be prescribed off-label, but the authorizations signaled that the FDA believed the benefits of the drugs could outweigh their risks. Still, there is little scientific evidence thus far proving that they're effective for treating coronavirus.\n\"The vaccines are going to take a while, but look, we have this bill that we just passed last week, $2.2 trillion' worth , we have to focus on keeping people employed,\" Nunes said. \"I will tell you this: If we don't start to get people back to work in this country over the next week to two weeks, I don't believe we can wait until the end of April.\"\nHe continued, \"I just don't know of any economy that's ever survived or you unplug the entire economy and expect things to go back and be normal. So the more tests that are out there, the more people getting testing, let's learn about the treatments. Let's get good data as to who is being impacted and let's figure out a way to get back to work.\"\nThe United States has struggled to get a complete picture of the scope of the problem since the early days of the outbreak because of testing problems. While progress has been made, some Americans, even some on the front lines, report an inability to get tested, and some are resorting to self-diagnositic tools.\nEarlier Tuesday, Trump warned of a \"painful\" two weeks to come during a White House briefing, and he has extended social distancing guidelines to April 30 after previous 15-day guidelines were set to expire.\nNunes has previously disputed experts' guidance on limiting social contacts in order to stem the spread of coronavirus. Last month, the California Republican urged \"healthy\" Americans to visit bars and local restaurants during the pandemic, though many people who are infected don't immediately experience symptoms.\n\"If you're healthy, you and your family, it's a great time to go out and go to a local restaurant, likely you can get in easily,\" Nunes said during an interview on Fox News. \"Let's not hurt the working people in this country ... go to your local pub.\"", "url": "https://www.cnn.com/2020/04/01/politics/devin-nunes-coronavirus-schools/index.html"}