{"authors": ["Marshall Cohen"], "date_download": "2020-05-04 16:04:29", "date_modify": "2020-05-04 16:04:29", "date_publish": "2020-04-01 21:31:55", "description": "There is a glaring messaging gap between President Donald Trump and top public health officials regarding medicines being used to treat coronavirus. While Trump touts them as miracle drugs that are on the brink of saving lives, experts are cautiously waiting for scientific evidence.", "filename": "2020_04_01_politics_trump-c_cf0d87a5d91b0fb27f8af2c2c2cf9c65_index_1588608269.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200326235359-hydroxychloroquine-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_trump-c_cf0d87a5d91b0fb27f8af2c2c2cf9c65_index_1588608269.html", "title": "The dangerous disconnect between Trump's rhetoric and the reality for potential coronavirus treatments", "title_page": "The dangerous disconnect between Trump's rhetoric and the reality for potential coronavirus treatments - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) There is a glaring messaging gap between President Donald Trump and top public health officials regarding medicines being used to treat coronavirus. While Trump touts them as miracle drugs that are on the brink of saving lives, experts are cautiously waiting for scientific evidence.\nThis dynamic has played out over the past few weeks, and was on full display again during the White House briefing on Tuesday . Trump said the drugs might be a \"total game-changer\" and implied that good news from clinical trials was just days away, only to be corrected by the nation's top infectious disease expert, who steered clear of glowing superlatives and said the research will take months, \"at very best.\"\nThe medicines -- chloroquine and hydroxychloroquine -- have been used for decades to fight malaria. But this week, the Food and Drug Administration granted emergency authorization for doctors to use them to treat Covid-19 in hospitalized patients. This was the first step in getting millions of pills to the states, though hospitals have been using the drugs for coronavirus without explicit government approval for weeks.\nEven in making this landmark announcement , the Department of Health and Human Services simultaneously gave a tempered assessment of the potential benefits. A press release said, \"anecdotal reports suggest that these drugs may offer some benefit\" in coronavirus patients, but \"clinical trials are needed to provide scientific evidence that these treatments are effective.\"\nThat tone is entirely different from what the President has been saying at daily briefings. Millions of stuck-at-home Americans watched him claim that the drugs have \"tremendous promise\" and \"could be a game changer,\" and that they are \"very effective\" and \"can be taken safely.\"\nTrump went even further on Tuesday, falsely suggesting that the drugs have already been proven safe. \"Very powerful drug, but it's been out there for a long time,\" he said at the daily White House coronavirus briefing. \"So, it's tested in the sense that you know it doesn't kill you.\"\nDoctors say he's wrong, and that comments like these could have deadly consequences.\nA man in Arizona died after ingesting a form of chloroquine used to treat aquariums. There have been at least three overdoses in Nigeria as well. There are reports of hoarding by doctors and shortages, where people with lupus and other diseases who also use the drugs can't get them.\n\"As the dose of chloroquine goes up, it goes from being safe and effective to highly toxic, quickly,\" said Dr. Christopher Plowe, a renowned malaria expert at the Duke Global Health Institute. \"It's very easy to overdose on chloroquine. You get above the ceiling of safety pretty quickly. There are some very serious risks here. There's quite a bit to lose, including your life.\"\nExperts like Plowe who study these drugs, and doctors who are prescribing them, agree with the public health officials that clinical trials will tell whether Trump's optimism is well-placed.\nTesting is underway, including a large study in New York, the epicenter of the US outbreak with more than 75,000 cases, the most of any state in the country. New York public health authorities have obtained at least 1 million doses of hydroxychloroquine, which will be used for a large-scale clinical trial, an official at the New York State Department of Health told CNN.\nOther states, like Michigan , are still asking the Trump administration for their share of the drugs.\nThe pharmaceutical giant Novartis recently donated 30 million hydroxychloroquine tablets to the federal government as part of the new push to get the drug to patients who need it. Asked if the company agrees with Trump's view that the drugs might be the most significant breakthrough in modern medicine, a spokeswoman told CNN, \"We believe you need to follow the science.\"\nOptimism versus science\nFrench researchers published a small study on March 17, suggesting that hydroxychloroquine and chloroquine were effective against the coronavirus. The results were met with caution: Public health officials noted that the research was conducted by a controversial doctor , it only included 24 patients, didn't follow typical rules for randomized trials, and was not peer-reviewed.\nRegardless, within 48 hours, Trump sprang into action and began touting the study and the drugs, and has done so at least a dozen times in two weeks, according to a CNN analysis.\nThe medical community immediately noticed the disconnect between Trump's posture and the science. A stark headline from The New York Times read, \"Trump's Embrace of Unproven Drugs to Treat Coronavirus Defies Science.\" Science Magazine, a peer-reviewed academic journal, ran a similar piece quoting a leading Australian medical researcher who said, \"this is insane!\"\nSenior Trump administration officials and public health experts followed suit, partially walking back Trump's comments with their own tempered takes, often from the very same podium.\nWhen a journalist asked Dr. Anthony Fauci, the nation's top infectious disease expert, if these medicines could prevent Covid-19, Fauci gave a crystal-clear response: \"The answer is no.\"\nDr. Deborah Birx, the response coordinator for the White House's coronavirus task force, said, \"We're trying to figure out how many anecdotal reports equal real scientific breakthrough,\" when asked about the drugs.\nThe FDA Commissioner, Dr. Stephen Hahn, said a \"large, pragmatic clinical trial\" is still needed to \"actually gather that information and answer the question that needs to be answered,\" as to whether the drugs are effective and safe to use during the worsening coronavirus pandemic.\nlittle-noticed Pentagon report , written by military doctors and released amid Trump's barrage of optimism, said, \"(Bottom line up front): No high-quality evidence exists to support use at present.\" The 51-page report of best practices, which has been circulating among American physicians, warned that the drugs have toxic side effects and can lead to cardiac complications.\nThe report said more research is needed to corroborate the French study. If those early results are accurate, \"this would be the first time chloroquine or hydroxychloroquine was found to be effective for the clinical management of a viral infection,\" the report said, because previous clinical trials determined that the drugs had no impact on other viruses like influenza and HIV.\nBalancing benefits and risks\nSenior public health officials like Fauci and Hahn have said Trump wants to strike an optimistic tone to keep hope alive among Americans who are worried about their health and their paycheck. But there are risks, both to public health and in the presidential campaign unfolding in the background, in over-promising when it comes to things like drug treatments during an epidemic.\n\"Medical history has so many examples of treatments that people had good experiences with, and people got better, and they had great confidence in the treatment, and years later when a randomized trial was done, it turned out no better than placebo,\" said Plowe, the Duke expert.\nEven with that uncertainty, some doctors on the frontlines say there aren't many other options.\nFormer Kansas Gov. Jeff Colyer, now a surgeon in the Kansas City area who is treating patients with Covid-19, applauded the FDA's decision to let hospitals use the anti-malaria drugs, which he promoted in two columns in The Wall Street Journal and interviews with Fox News hosts.\n\"The FDA made a difficult decision, but they were right,\" Colyer told CNN. \"We won't have all the hard data we want for months. But at this point, this is one of the most promising treatments out there. We need to understand all these drugs better, but we're in a unique situation.\"\nBefore the pandemic, the Trump administration named Colyer chairman of the National Advisory Committee on Rural Health, within the Department of Health and Human Services. Colyer, a Republican, told CNN he is informally advising the Trump administration on the virus.\nRegardless of Trump's glowing rhetoric about the medicines, Colyer said the FDA \"made a finding after reviewing all the literature\" that is available, even though the research is limited.\n\"They've seen the plusses and the minuses and made a professional decision,\" he added.", "url": "https://www.cnn.com/2020/04/01/politics/trump-chloroquine-drugs-coronavirus-treatment/index.html"}