{"authors": ["Opinion Roxanne Jones"], "date_download": "2020-05-04 16:17:09", "date_modify": "2020-05-04 16:17:09", "date_publish": "2020-04-03 13:11:25", "description": "Roxanne Jones shares the transformative moment when she realized social media in the age of Covid-19 no longer the same toxic place it's always seemed -- when she reconnected via Facebook with a musician who gave her inspiration and strength many years earlier.", "filename": "2020_04_03_opinions_covid-19-angel-on-facebook-jones_index_1588609029.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402230233-roxanne-jones-opinion-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_opinions_covid-19-angel-on-facebook-jones_index_1588609029.html", "title": "God sent me an angel on Facebook (opinion)", "title_page": "God sent me an angel on Facebook (opinion)  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Roxanne Jones, a founding editor of ESPN Magazine and former vice president at ESPN, has been a producer, reporter and editor at the New York Daily News and The Philadelphia Inquirer. Jones is co-author of \"Say it Loud: An Illustrated History of the Black Athlete.\" She talks politics, sports and culture weekly on Philadelphia's 900AM WURD. The views expressed here are solely hers. Read more opinion on CNN.\nIt was a bad habit that I worried would eventually erase every ounce of hope I ever held for the world outside my door.\nWeekly, I'd challenge myself to waste fewer hours scrolling my Facebook and Instagram feeds -- enough already with the selfies and toxic political rants.\nI vowed to spend less time on Twitter, especially for anything not work-related. It had become a daily cesspool of hatred and division. I was done. Despite decades spent leaning in to every emerging technology available, I thought it was just about time to quit social media.\nThe world changed.\nAnd today, it feels like social media might just save my life -- indeed, save us all.\nIt has become my lifeline, the place I go to get potentially life-saving news and information about how to protect myself and others from the coronavirus -- along with virtual workouts and other ways to stay healthy.\nRight now, the cellphone and computer are my only connections to the world and my loved ones as I am -- like much of the nation -- living a cloistered life (sheltered-in with my sister, who has a chronic illness). Staying connected with other people has never felt more essential to my well-being and mental health.\nBut something else is afoot across social media. Suddenly it seems, a renewed sense of community is emerging.\nInstead of griping about politics 24/7 and using our feeds as a bully pulpit, more of us are finding positive ways to connect to our shared humanity. It feels to me like there's a cultural shift toward savoring life's smaller joys: deejays and music artists are sharing music and streaming pop-up parties, churches and people of all religions are streaming faith-based services and friends are hosting virtual happy hour parties and other family fun events.\nLast week, as continuous news updates told of rising US death tolls and warned of thousands more to come, my own transformative moment of social media connection happened: It was one woman, her guitar, and her beautiful voice who eased my mind and made me hopeful for better days to come -- when I saw her Facebook post\nJUST WATCHED Watch the Backstreet Boys perform remotely from their homes Replay More Videos ... MUST WATCH Watch the Backstreet Boys perform remotely from their homes 01:27\nHer name is Courtney Dowe and she was singing a soulful, folksy rendition of the Grammy-winning, wildly popular 2019 rap song: Old Town Road (by Lil Nas X featuring Billy Ray Cyrus).\n\"Lately, I feel a willingness to be more vulnerable as an artist,\" said Dowe, a single mother from Washington, DC, who works as a paralegal intern. Dowe told me she was nervous about sharing the music video but her fears around the pandemic have made her lean more on social media for a human connection.\n\"So much of the world is feeling more vulnerable right now and it's easy to be alone in that vulnerability because we are self-isolating now. But there's also an urgency to connect and share. I've been inspired by other artists across social media who are sharing their work in ways they never have before to inspire people and let them know they are not alone,\" said Dowe.\nTurns out, Courtney's sweet sound was just the refuge many were seeking. The Facebook video she posted, her most popular ever, has received thousands of views and comments from fans around the globe.\nJUST WATCHED Here's how Dolly Parton can help get your kids to sleep Replay More Videos ... MUST WATCH Here's how Dolly Parton can help get your kids to sleep 01:07\nI've never met Courtney, but Incredibly, this is also not the first time her music has soothed my soul.\nNearly 12 years ago, I was one of millions of New Yorkers commuting home from work when my train stopped at Atlantic Avenue in Brooklyn, where I had to wait for a connection. And there, sitting cross-legged on the platform was a black woman, wearing a colorful head wrap, playing an acoustic guitar. She was singing what sounded like a Negro spiritual and other folk songs.\nI was mesmerized.\nWe never truly understand what draws us to other human beings. Courtney and I were strangers, just two woman at a subway stop. I haven't seen her in person since that day. Yet, watching her sing then made me feel connected to generations of women who have used music to tell the stories of our lives, to survive immeasurable pain, and celebrate unimagined love.\nCourtney and I never spoke as I put money in her guitar case. But I wondered about the woman with the magical voice. Did she have a family? Was she homeless? Or, was she famous? She had a voice that reminded me of acclaimed singer Tracy Chapman, but I knew it wasn't her.\nAn hour later, and a few missed subway connections -- I headed for home to fix dinner for my son and settle in to my new life as a recently-divorced, single mom.\nThose were worrisome days for me. But I never forgot how inspired Courtney made me feel that day.\nYears later, Facebook connected me to Dowe again. By sheer chance, I'd seen a clip of her singing on Facebook and recognized her face. I messaged her and asked if she was the woman I'd heard in the subway. She was. It was then I learned her name and a little more about her, like she had a young son, was a community activist, and sometimes performed on the DC music scene.\nLast week, I sent Dowe a Facebook message after I saw her music video, telling her about that day in the subway.\n\"That was always the dream,\" said Dowe, adding that my story made her cry. She said she grew up in foster care and was adopted at 16. She planned to be a teacher but after one year of college, she found her calling and her voice, then spent more than a decade traveling the country as a street musician.\n\"I've gotten so much static over the years from friends and family for being a street musician, but my dream was to give comfort to someone in need of encouragement -- maybe after a hard day at work. I want my music to uplift people and give them hope,\" she told me.\nIt is said that God sends you angels just when you least expect it.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nAnd last week in the midst of all the chaos, I met one of mine on Facebook.", "url": "https://www.cnn.com/2020/04/03/opinions/covid-19-angel-on-facebook-jones/index.html"}