{"authors": [], "date_download": "2020-05-04 17:02:49", "date_modify": "2020-05-04 17:02:49", "date_publish": "2020-04-10 19:04:17", "description": "We've compiled everything you'll need to make your own delicious homemade pasta, according to professional chefs.", "filename": "2020_04_10_cnn-underscored_how-to-make-homemade-pasta_index_1588611769.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409112057-homemade-pasta-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_cnn-underscored_how-to-make-homemade-pasta_index_1588611769.html", "title": "How to make homemade pasta, according to chefs", "title_page": "How to make homemade pasta, according to chefs - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored has interviewed experts and found the best options to help you cope during this uncertain time. Find all our coronavirus-related coverage here, and let us know your thoughts here.\nMany of us have been isolating and socially distancing since mid-March, and the glut of puzzle and sourdough content on Instagram has showed us one thing: We're looking for ways to stay busy. If you're not quite ready to commit to making your own sourdough starter, there's another activity perfect for carb lovers: pasta making. While there are lots of accessories you can buy, like pasta makers and shapers, all you really need to get started is flour and eggs. It's technique, as much as ingredients, that matters here, making it a great activity to practice when you're stuck at home.\nWe've compiled everything you'll need to make your own delicious homemade pasta, according to professional chefs.\nThe basics\nThere are so many pastas you can make at home, from squid ink linguine to truffle ravioli. But most have the same base: a light egg-and-flour dough that has been rolled thin and cut into shapes. Fresh pastas are different from the shelf-stable kind you get in a box, which are made from just semolina flour and water. And while the world of pastas is infinite, you actually don't need that much to get started.\n\"It's totally possible to make pasta without any special equipment; many shapes can be made with just a rolling pin or even a wine bottle and a knife,\" says Clay Conley, chef at Grato in West Palm Beach, FL. If you're interested in upgrading, his \"nice to have\" accessories include a fluted pasta or pastry cutter, which would replace the knife, and a pasta maker, which can replace the rolling pin to make nice thin sheets of pasta..\nSince fresh pasta dough requires quite a bit of kneading, Robert Irvine, chef and host of \"Restaurant: Impossible,\" says that a KitchenAid mixer with a dough hook attachment is another useful accessory, but by no means required. A KitchenAid mixer can come in handy making pasta for another reason: You can get a pasta attachment set to go with it for rolling out and cutting the noodles.\nMany recipes will give flour amount in weight, not cups. That's because flour is notoriously hard to measure by volume. If you have a kitchen scale, it can help you be more precise.\nFinally, a note on flour. While many chefs will tell you that pasta is relatively simple to make even without fancy ingredients, they will strongly advise getting 00 flour, a kind of finely milled flour with a higher protein count. It can be hard to track down even in the best of times, so if you can't find it, all-purpose flour is the best easier-to-find alternative. You can also try asking a local pastaria if they will sell you some.\nThe essentials\nFrench-Style Rolling Pin ($11.99, bedbathandbeyond.com)\nFrench-Style Rolling Pin\nA French rolling pin gives you much more control as you roll out the dough.\nJ.A. Henckels 8\" International Forged Premio Chef's Knife ($39.99, target.com)\nJ.A. Henckels 8\" International Forged Premio Chef's Knife\nA quality chef's knife is indispensable for loads of kitchen projects. This is an under-$50 option that will last for years.\nNice to have\nBetty Crocker Pastry Crimper ($5.99, bedbathandbeyond.com)\nBetty Crocker Pastry Crimper\nWhile you can cut pasta with just a knife, a pastry cutter is faster and you won't have to worry about dulling your knife as you drag it along the cutting board. This tool also makes it easy to crimp ravioli or lasagna noodles and even make cute bow-tie pasta.\nGefu Pasta Maker ($80, food52.com)\nGefu Pasta Maker\nPasta makers like this one create extra-thin, even egg noodles with just a few cranks.\nKitchenAid 4.5-qt Tilt-Head Stand Mixer ($269.99, QVC.com; $279, amazon.com)\nKitchenAid 4.5-qt Tilt-Head Stand Mixer\nThe crown jewel of countertop appliances, KitchenAid stand mixers can power through mixing up everything from cookies to pasta. They all come with a dough hook attachment, which is excellent for kneading pasta dough and making homemade bread. The 2,000-plus 5-star reviews on Amazon are a testament to its utility. The sheer power of the KitchenAid lets you prep your pasta faster, particularly if you're cooking for a crowd.\nKitchenAid Stand Mixer Pasta Attachment Set ($199.95, surlatable.com)\nKitchenAid Stand Mixer Pasta Attachment Set\nIf you have a KitchenAid mixer, you can get this attachment set rather than a standalone pasta machine to crank out noodles. This is an editor favorite because the mixer's motor reduces the need for elbow grease.\nOxo Good Grips 5 Lb Food Scale with Pull-Out Display ($23.96, amazon.com)\nOXO Good Grips 5 Lb Food Scale with Pull-Out Display\nWeighing flour is a far more precise way to measure it than using a measuring cup, making it less likely that the dough will be too wet or too dry. A kitchen scale makes it easier to be a precision baker, and more than 850 5-star reviews on Amazon pretty much prove it.\nNow you're cooking\nChris Pandel, executive chef at Swift & Sons in Chicago, shared his basic recipe for egg pasta with us. No matter what pasta you're making, or what equipment you're using, fresh pasta starts the same way: With a mound of flour in the middle of the table. Create a well and pour in the lightly beaten eggs.\nThe general ratio is 1 scant cup (100 grams) of flour to one egg per serving. So if you're making pasta for four, you'll need 400 grams of flour and four eggs. Slowly mix with a fork until incorporated, then knead for about 10 minutes, either by hand or in a stand mixer, until smooth.\nAfter your dough is smooth, wrap it in plastic wrap and rest it for an hour. Roll it out to your desired thickness by hand or with a pasta maker. Once you have it as thin as you want it, slice it into ribbons and boil in salty water for about a minute. Because fresh pasta is so delicate, chefs tend to recommend a simple sauce that you don't always have to use a recipe for. Pandel recommends brown butter, sage and Parmesan. Conley has two favorites: One is a simple red sauce made with San Marzano canned tomatoes, and the other is cacio e pepe, which just uses cheese, butter, pasta water and pepper.\nThe basic recipe should give you a lot to work with. Once you've mastered kneading and rolling out the dough, you can cut the ribbons in smaller or wider shapes, or even make fresh lasagna sheets. Try making filled pasta, like ravioli, without special equipment, or use a ravioli stamp or mold to make perfect pasta pillows.\nCommon mistakes\nAll these instructions sound pretty simple, right? As with all simple things, however, precision is key. Here are a few things to watch out for:\nDough is too sticky or too dry\nEspecially if you are working without a scale, you may find that your dough is too dry or too sticky as you knead it and it's not coming together into a smooth ball. \"If you make fresh pasta and it turns out a little dry or crumbled, just add a touch more water. A little goes a long way,\" says Irvine. If it's too sticky, do the opposite: Add a little flour. In other words, you don't have to be too worried about getting the mixture perfect the first time you mix it — you can adjust as you go.\nNot kneading enough\nKneading the dough isn't just about getting it to come together in a ball — it actually helps the gluten develop as well, explains Pandel. You should knead until the ball is completely smooth, up to 10 minutes. If it's hard for you to knead that long, consider enlisting help or investing in a stand mixer with a dough hook attachment.\nNot salting the water enough\nSalting the water keeps the pasta from sticking, but it also flavors the pasta itself and, in the case of sauces like cacio e pepe, is used to flavor the sauce as well. So when it comes to salt, don't hold back. Conley says it should be \"like the ocean\" — in other words, use more salt than you probably think is necessary.\nFurther reading\nReady to dig in more? Here are some of the chefs' (and our own) favorite cookbooks for fresh pasta and Italian cooking.\n'Mastering Pasta' by Marc Vetri with David Joachim ($20.99; target.com)\n\"Mastering Pasta\" by Marc Vetri with David Joachim\nSnagging a reservation at one of Vetri's Philadelphia-area Italian restaurants is notoriously difficult even in the best of times. Bring his pasta-making secrets home instead with \"Mastering Pasta,\" recommended by both Pandel and Conley.\n'Cooking by Hand' by Paul Bertolli ($26.49; target.com)\n\"Cooking by Hand\" by Paul Bertolli\nPart meditation on food, part recipes, this book is an excellent deep dive into Italian cooking, recommended by Pandel.\n'Flour + Water: Pasta' by Thomas McNaughton ($35; amazon.com)\n\"Flour + Water: Pasta\" by Thomas McNaughton\nWhen you're ready to graduate to some advanced pasta-making, both Pandel and Conley suggest McNaughton's inventive recipes are a great source of inspiration.\n'Essentials of Classic Italian Cooking' by Marcella Hazan ($28.91; amazon.com)\n\"Essentials of Classic Italian Cooking\" by Marcella Hazan\nWhat Julia Child did for French cooking in America, Hazan did for Italian. This is an editor favorite and an indispensable cookbook for anyone who loves a good plate of pasta.\n'Pasta Grannies' by Vicky Bennison ($20.99; target.com)\n\"Pasta Grannies\" by Vicky Bennison\nConley recommends this book, which brings the \"Pasta Grannies\" YouTube channel (a personal favorite of his) to book form and features home cooks from around Italy, along with their pasta-making secrets.\nAt the end of the day, however, reading about pasta can only teach you so much — and it has the side effect of making you hungry as well. So roll up your sleeves, get kneading and see where this carb-filled journey takes you.\nNote: The prices above reflect the retailers' listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/10/cnn-underscored/how-to-make-homemade-pasta/index.html"}