{"authors": ["Meg Dunn"], "date_download": "2020-05-04 17:00:06", "date_modify": "2020-05-04 17:00:06", "date_publish": "2020-04-10 01:16:16", "description": "CNN Heroes are working overtime to meet their communities' needs. Whether it's distributing food and supplies, or fighting for sobriety through online workouts, they are getting the job done.", "filename": "2020_04_09_us_coronavirus-c_d13c8bd00899b7805f0ae52e46e0c84d_index_1588611606.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409145941-cnnheroes-bruno-serato-pasta-pandemic-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_us_coronavirus-c_d13c8bd00899b7805f0ae52e46e0c84d_index_1588611606.html", "title": "Cooking pasta by the ton is just one way these CNN Heroes are persevering during the pandemic", "title_page": "Cooking pasta by the ton is just one way these CNN Heroes are persevering during the pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Every day, CNN Heroes work tirelessly to help their communities, and that's never been more evident than during the Covid-19 pandemic.\nSome CNN Heroes now find their efforts are needed more than ever, and they're coming up with new ways to be there for their communities.\nScott Strode overcame his addiction to drugs and alcohol by becoming more physically active. He later started a nonprofit called The Phoenix that today provides free athletic activities and a sober support community to 26,000 people across the United States.\nWhen social distancing became the new normal and the group's gyms and in-person programs had to close, many participants found themselves without the community that helps them stay sober.\nScott Strode's group is making sure its sober support community stays connected.\n\"For somebody in recovery, social isolation is a really slippery slope,\" said Strode, a 2012 CNN Hero. 'It can often lead to the relapse. So, at The Phoenix, we think it's crucial to keep each other connected.\"\nRead More", "url": "https://www.cnn.com/2020/04/09/us/coronavirus-cnnheroes-food-donations-sober-workouts/index.html"}