{"authors": [], "date_download": "2020-05-04 20:19:03", "date_modify": "2020-05-04 20:19:03", "date_publish": "2020-04-28 12:24:46", "description": "\"Hand sanitizers are not proven to treat COVID-19, and like other products meant for external use, are not for ingestion, inhalation, or intravenous use.\"", "filename": "entry_fda-hand-sanitizer-coronavirus_n_5ea81d8cc5b60858257933f2_1588623543.html", "image_url": "https://img.huffingtonpost.com/asset/5ea820fc250000bb0feb07a5.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_fda-hand-sanitizer-coronavirus_n_5ea81d8cc5b60858257933f2_1588623543.html", "title": "FDA Warns Against Ingesting Hand Sanitizer", "title_page": "FDA Warns Against Ingesting Hand Sanitizer | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "April 27 (Reuters) - The U.S. Food and Drug Administration on Monday asked makers of hand sanitizers to add denatured alcohol to the products in order to make them less palatable in a bid to discourage people, especially children, from drinking the liquid.\nThe regulator’s advisory follows U.S. President Donald Trump’s recent comments on whether injecting disinfectants might treat COVID-19, which raised concerns that frightened people could poison themselves with untested treatments.\n“Hand sanitizers are not proven to treat COVID-19, and like other products meant for external use, are not for ingestion, inhalation, or intravenous use,” FDA Commissioner Stephen Hahn said in a statement.\nDemand for hand sanitizers has soared after the government and health agencies advised people to clean their hands thoroughly to discourage the spread of the new coronavirus, which has caused over 51,000 deaths in the United States.\nThe agency said adding denatured alcohol to hand sanitizers renders a bitter taste making the liquid less appealing for consumption.\nCalls to the National Poison Data System last month related to hand sanitizer increased by 79% compared to March 2019, and a majority of them were about unintentional exposure to children aged 5 and younger, the FDA said.\nThe agency recommended that the products carry child safety warnings and information to get medical help upon accidental consumption.\nThe FDA, which in March relaxed rules to allow pharmacists to supply alcohol-based hand sanitizers without prescriptions, also said it was taking measures to help ensure continued supply of the product.\nMore than 1,500 new makers of alcohol-based hand sanitizers have registered with the agency as it works to improve the safety and supply of the product amid the COVID-19 pandemic, the agency said.\n(Reporting by Manojna Maddipatla in Bengaluru; Editing by Shailesh Kuber)", "url": "https://www.huffpost.com/entry/fda-hand-sanitizer-coronavirus_n_5ea81d8cc5b60858257933f2"}