{"authors": ["Caroline Kelly"], "date_download": "2020-05-04 16:00:01", "date_modify": "2020-05-04 16:00:01", "date_publish": "2020-04-01 09:01:07", "description": "Dr. Anthony Fauci gave CNN's Dr. Sanjay Gupta some insight into his \"very different\" relationships with each of the presidents he's served under as the nation's top infectious disease expert.", "filename": "2020_04_01_politics_fauci-v_b65bb2b2523be4d60175f47985139de0_index_1588608001.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331124419-02-fauci-0327-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_fauci-v_b65bb2b2523be4d60175f47985139de0_index_1588608001.html", "title": "Dr. Anthony Fauci describes his 'very different' relationships with 5 presidents", "title_page": "Dr. Anthony Fauci describes his 'very different' relationships with 5 presidents - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Dr. Anthony Fauci gave CNN's Dr. Sanjay Gupta some insight into his \"very different\" relationships with each of the presidents he's served under as the nation's top infectious disease expert.\nFauci, who has served as the director of the National Institutes of Allergy and Infectious Diseases since 1984, has worked as a key adviser on national health crises under six administrations. In a new episode of Gupta's \"Coronavirus: Fact vs. Fiction\" released Wednesday , Fauci described how each administration brought a new relationship with the White House as each president faced unique health crises -- all the way up through his current relationship with President Donald Trump.\nWhen asked by Gupta to describe his interactions with each of the presidents under whom he's served, Fauci replied, \"You know, they're different with every president, Sanjay. And within a given presidency, it's different.\"\n\"I had no interaction with President Trump for the first three-plus years because there was not any reason to interact. We were doing our job. You know, he was doing what what he was doing,\" Fauci said.\nWith the coronavirus outreak, \"all of a sudden, now I'm in a situation where I spend like more than an hour every day with him,\" Fauci added. \"I mean, we go there, we brief him, we have a press conference, we debrief after the press conference.\"\n\"The answer to your question, a little bit long-winded, is that it's very different with each president and it's dictated almost completely by the circumstances that you're under,\" he said.\nFauci, who has been a pragmatic, data-driven presence during the White House coronavirus task force briefings, has frequently dissented with Trump's claims pertaining to the outbreak, having refuted the President to his face and spoken publicly about working to get Trump's professed falsehoods \" corrected for the next time .\"\nThe veteran doctor spoke in glowing terms about his relationships with earlier presidents. He highlighted his close relationship with President George H.W. Bush, noting that \"just by accident I developed a really close friendship with him because he came to the (National Institute of Health) in the late 80s when he was vice president and was thinking of running for president, and he sincerely wanted to learn about HIV.\"\n\"He was a very modest, unbelievable human being. And he came in, he says, 'I want to learn,'\" Fauci said, adding that he introduced Bush to patients at NIH and \"gave him a bit of a tutorial on HIV.\"\n\"And all of a sudden he decided he was going to be my friend, thank goodness, and he invited me to the White House ... we had a very warm, personal type relationship,\" Fauci added.\nHis relationship with President Bill Clinton \"was different,\" Fauci said.\n\"Clinton had all the right vibes about what to do. I had a good relationship with him, but it was quite formal, as you would have with respect to the presidency,\" he said.\nFauci said that he got to know President George W. Bush amid the crises of 9/11 and the 2001 anthrax attacks before he \"had the privilege of being close to him and developing PEPFAR,\" or the President's Emergency Plan for AIDS Relief.\nFauci considers Bush's PEPFAR -- an unprecedented, $3 billion-a-year program to help the world fight AIDS -- \"one of the most important things any American president has ever done,\" he said, noting that \"it saved millions of lives.\"\nPresident Barack Obama was \"a very easy person to get along with and a really good, good human being,\" Fauci said, highlighting the \"marathon\" of outbreaks at the time, including Ebola and Zika.\n\"He didn't joke about it because he was serious, but I remember once he walked into the into the Situation Room and we were sitting around and he just put his hand on his head,\" Fauci said.\n\"He said, 'I got children at the border, I got wars going on, and I'm spending all my time with these diseases. Would you guys please do something about this?' It was it was sort of like almost tongue in cheek, but it was serious,\" Fauci recalled.", "url": "https://www.cnn.com/2020/04/01/politics/fauci-very-different-relationships-presidents/index.html"}