{"authors": ["Clare Duffy", "Sherisse Pham", "Charles Riley", "Cnn Business"], "date_download": "2020-05-04 15:59:07", "date_modify": "2020-05-04 15:59:07", "date_publish": "2020-03-31 22:49:24", "description": "Global stocks and US futures declined Wednesday after the White House warned that up to 240,000 Americans could die as a result of the coronavirus pandemic and as the economic shockwaves continued to reverberate around the world.", "filename": "2020_03_31_investing_global-stocks_index_1588607947.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331233226-asian-stock-markets-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_investing_global-stocks_index_1588607947.html", "title": "Global stocks and US futures drop after Trump issues dire warning", "title_page": "Global stocks and US futures drop after Trump issues dire warning - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York/Hong Kong/London (CNN Business) Global stocks and US futures declined Wednesday after the White House warned that up to 240,000 Americans could die as a result of the coronavirus pandemic and as the economic shockwaves continued to reverberate around the world.\nPresident Donald Trump said another $2 trillion stimulus package may be necessary to support the US economy. Data in Asia revealed a widespread slowdown in manufacturing across the region.\nEuropean markets followed suit, with Germany'sand France'sshedding over 3% in early trading. Thedipped nearly 4% in London after major UK banks canceled dividend payments after regulators asked them to prioritize help for struggling businesses and households.\nThe coronavirus pandemic continues to cause massive volatility in financial markets as the virus spreads and governments react by imposing restrictions on work and public life. March was the worst month for the Dow and the S&P 500 since October 2008, and the worst for the Nasdaq since November of that year.\nS&P 500 SPX Nasdaq COMP Dow futures sank 672 points, or 3.1%, on Wednesday.futures fell 3% andfutures were down 2.7%.\nStock markets are reacting to \"a likely increase in the duration and breadth of coronavirus lockdowns in the US and elsewhere, which is pointing to a potentially deeper and longer-term hit to economic activity than was anticipated even a week ago,\" Stephen Innes, a strategist at AxiCorp, wrote in a research note.\nThe world's largest economy is quickly becoming the epicenter for the pandemic.\nEven with the nationwide adoption of stringent mitigation efforts, between 100,000 and 240,000 Americans could die in the coming weeks, the White House warned on Tuesday. Lawmakers have already approved three rescue packages, but Trump suggested another $2 trillion in spending on infrastructure could be needed to help support the economy.\nIn Asia, new data revealed the level of damage done to factories in March in countries including South Korea, Indonesia, Malaysia and Thailand. Analysts at Capital Economics said that output has plunged to levels not seen since 2009, and warned that \"things are likely to get a lot worse in the months ahead.\"\nA private survey meanwhile suggested that manufacturing activity in China expanded slightly in March after crashing the previous month. Economists said the data indicate the country's huge factory sector is stabilizing, but still operating well below its usual capacity.\nHSBC HSBC Standard Chartered SCBFF Steps taken by governments and regulators continue to have consequences for stocks. Shares ofplunged 8% in London andsank 6.8% after the UK banks canceled their dividends. They said they had received a request from British regulators to do so.\n— Laura He and Michelle Toh contributed to this report.", "url": "https://www.cnn.com/2020/03/31/investing/global-stocks/index.html"}