{"authors": ["Elizabeth Cohen", "John Bonifield", "Tina Matherson"], "date_download": "2020-05-04 16:13:41", "date_modify": "2020-05-04 16:13:41", "date_publish": "2020-04-03 11:50:04", "description": "A nurse who practices in two New York City hospitals says she worked for about a week while infected with coronavirus and had to pull a trick to finally get herself tested.", "filename": "2020_04_03_health_nurse-infected-coronavirus_index_1588608821.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401073859-new-york-infected-nurse-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_health_nurse-infected-coronavirus_index_1588608821.html", "title": "Nurse struggled to get tested and worked while infected with coronavirus", "title_page": "Nurse struggled to get tested and worked while infected with coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A nurse who practices in two New York City hospitals says she worked for about a week while infected with coronavirus and had to pull a trick to finally get herself tested.\nNow she fears she may have infected her colleagues and her family.\nThe nurse, who is 44 and has no underlying health conditions, asked to remain anonymous because she fears she'll be fired.\nFor the past several weeks, she's been working mainly with coronavirus patients. She says on March 8 she started to feel an achiness in her back. She thought it was menstrual pain, but now she looks back and wonders if it was the first sign of coronavirus.\nShe continued to work.\nThen on March 24, she felt chest pain and realized what it could be, especially because, the day before, she'd lost her sense of smell, which she knew might be associated with coronavirus.\n\"I was scared. I thought this is it. I definitely have the virus and I'm going to die,\" she said.\nShe gave her husband a book she'd made before the outbreak with information he'd need if she died, including financial accounts and her wishes for end-of-life medical care. She told him about her desire to be cremated, and what she wanted done with her wedding ring.\nShe wanted to get tested at one of the hospitals where she works, but colleagues told her the hospital wasn't testing staff members, and neither was the employee health clinic.\nShe came up with a plan: In the middle of the night, she called the emergency room to ask who was working. When she heard that a coworker she knew well, a physician assistant, was on duty, she headed over.\n\"She said, 'You have to go to employee health,' but I knew employee health doesn't test, so I said, please, just this one time, do it. I just want to make sure I don't have it. I don't want to spread anything, and she said 'OK' and she tested me,\" the nurse said. \"So my testing came under false pretenses.\"\nThe next day, the nurse called in sick, and for the next four days she wasn't scheduled to work.\nOn March 30 she was feeling well, and returned to work. Halfway through her shift she received her test results.\nShe was positive and went into isolation at home.\nScreening health care workers for coronavirus\nIn the United States, a shortage of tests means hospitals aren't screening their workers to spot those who, like this nurse, are mildly ill, or workers who are infected yet showing no symptoms at all.\nIn some other parts of the world, they are.\nAt Hadassah Medical Center in Jerusalem, health care workers are screened every five days, according to Dr. Yoram Weiss , the medical director of Hadassah's Ein-Karem Hospital.\nSo far, Hadassah has tested about 2,500 employees and 17 were positive and had no symptoms, Weiss said, adding that these tests were done with kits that were not needed for patient testing.\nIn addition, another 17 workers who did have symptoms also tested positive.\nWorkers who test positive -- with or without symptoms -- aren't allowed to work.\nWeiss said the screening is important because it identified employees who didn't even know they were sick and could be spreading the virus.\nOn Wednesday, they found that a nurse in the intensive care unit was positive. She felt fine.\n\"We have some patients that are immune suppressed, that are extremely vulnerable, and [this] is part of our efforts to protect patients, and at the same time protect our workers, which is extremely important in these times,\" he said.\n\"We would love to be able to do much broader testing to identify all those people who are positive and then make sure that we isolate them,\" said Pronovost, chief clinical transformation officer at University Hospitals in Cleveland.\nHe calls the New York nurse's situation \"horrible.\"\n\"The solution is to get more testing ability,\" he said. \"That's the real way that we're going to avoid those kinds of situations in the future.\"\n'It's so easy to get contaminated'\nBack in New York, the nurse continues to feel well. She spent Tuesday in isolation, and Tuesday night was told she can go back to work. It has been more than seven days since her symptoms first appeared, which is in accordance with guidelines from the US Centers for Disease Control and Prevention.\nShe thinks she became infected during one of many procedures where patients' respiratory secretions were released into the air, even though she wore a mask during these procedures.\n\"We have to suction patients who are congested and [they] can cough and spit up phlegm,\" she said. \"We're washing them, we're turning them, and when you turn them, secretions are constantly running out of the mouth and fly up. Things get in the air. You're touching stuff with your gloves on, and when you try to take your glove off, it's saturated with fluid. And you're exposed like that if you're not careful.\"\nShe says she knows some of those secretions got on her mask, which she wore all day, from patient to patient. She tried to be as careful as possible when removing the mask and putting it back on.\nWorry for her colleagues\n\"It's so easy to get contaminated when you have to put on something that already has virus on it,\" she said. \"I'm putting it back on, virus flies up in the air, and it goes right up in my nose.\"\nShe says she wore the same gown all day, too. She said doctors and nurses were instructed to hang their gowns touching each other on the same IV pole, and she fears their gowns could have contaminated each other.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nShe thinks about her colleagues who are still working at the hospital. She worries that they might not even know they should be tested because they have only mild symptoms, or none at all.\nShe fears that her colleagues who are still working might be infected and not even know it.\n\"They're all vectors traveling around with it,\" she said.", "url": "https://www.cnn.com/2020/04/03/health/nurse-infected-coronavirus/index.html"}