{"authors": [], "date_download": "2020-05-04 20:16:41", "date_modify": "2020-05-04 20:16:41", "date_publish": "2020-03-09 23:36:11", "description": "PRINCETON U. RESTRICTS GATHERINGS, OFFERS REMOTE CLASSES PRINCETON, N.J. (AP) — Princeton University says it is restricting large gatherings and urging students to remain home after spring...", "filename": "_9b987a9be0a641dfaac2148b4ac1b3f2_1588623401.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9b987a9be0a641dfaac2148b4ac1b3f2_1588623401.html", "title": "AM Prep-Cyber Corner", "title_page": "AM Prep-Cyber Corner", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PRINCETON U. RESTRICTS GATHERINGS, OFFERS REMOTE CLASSES\nPRINCETON, N.J. (AP) — Princeton University says it is restricting large gatherings and urging students to remain home after spring break and take classes online in the wake of the spread of the coronavirus. President Christopher Eisgruber says in a letter to the university community that the measures are necessary even though the school currently has no confirmed cases. All lectures and seminars will switch to online beginning March 23. The restrictions will remain in place until April 5, when university officials will conduct a review. The university also is restricting school-sponsored travel. For most people, the new coronavirus causes only mild or moderate symptoms, such as fever and cough.\nAS OUTBREAK SPREADS, SCHOOLS FACE DILEMMA IN GOING ONLINE\nPROVIDENCE, R.I. (AP) — Schools across the United States are preparing to move classes online if the new coronavirus forces their buildings to shut down, but it’s leading to concerns about students who don’t have access to the internet at home. Some schools have already instituted “virtual days” during closures caused by the virus. Others are cancelling classes entirely and treating it like a snow day. Districts around the country are making plans to shift online if the virus arrives, with some providing tablets and WiFi hotspots to students. Others plan to make up any canceled days at the end of the year. For most people, the new coronavirus causes only mild or moderate symptoms, such as fever and cough.\nMINOR CONVICTIONS FOR EX-CIA CODER IN HACKING TOOLS CASE\nNEW YORK (AP) - A former CIA software engineer accused of stealing a massive trove of the agency’s hacking tools and handing it over to WikiLeaks was convicted of only minor charges after a jury deadlocked on more serious espionage charges against him. Joshua Schulte, who worked as a coder at the agency’s headquarters in Virginia, was convicted Monday by a federal jury of contempt of court and making false statements after a four-week trial in Manhattan federal court. After deliberating since last week, the jury was unable to reach a verdict on the more significant charges. The trial offered an unusual window into the CIA’s digital sleuthing and the team that designs computer code to spy on foreign adversaries.\nNEW RULES AIMED AT BETTER ELECTRONIC HEALTH RECORDS\nWASHINGTON (AP) - Trump administration officials announced new health care tech rules on Monday. The rules aim to deliver on the unfulfilled promise of electronic medical records. The long-awaited but complex rules could take several years for consumers and patients to start seeing the practical effects. They are intended to get at one of the major problems with electronic health records: the systems of hospitals and doctors often don’t ‘talk’ to each other. Patients struggle to get their medical information digitally transmitted, defaulting to CDs and faxed paper records.", "url": "https://apnews.com/9b987a9be0a641dfaac2148b4ac1b3f2"}