{"authors": [], "date_download": "2020-05-04 20:23:57", "date_modify": "2020-05-04 20:23:57", "date_publish": "2020-04-04 21:56:34", "description": "CHARLOTTE, N.C. (AP) — Several protesters outside a North Carolina abortion clinic were arrested Saturday for refusing to comply with the state’s stay-at-home order for the coronavirus,...", "filename": "_1a8ac3210dd8c73f3fde0584d75a8325_1588623837.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1a8ac3210dd8c73f3fde0584d75a8325_1588623837.html", "title": "Arrests at N. Carolina abortion clinic for violating order", "title_page": "Arrests at N. Carolina abortion clinic for violating order", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHARLOTTE, N.C. (AP) — Several protesters outside a North Carolina abortion clinic were arrested Saturday for refusing to comply with the state’s stay-at-home order for the coronavirus, Charlotte-Mecklenburg police said.\nA dozen people among the roughly 50 protesters outside of A Preferred Women’s Health Center of Charlotte were issued citations for violating the emergency order when they refused to disperse as asked by officers, according to a police news release. Gov. Roy Cooper’s order prohibits mass gatherings of more than 10 people.\nOf the 12, eight who still refused to comply with the order were arrested and charged for the same violation, the news release said. The names of those arrested weren’t immediately released late Saturday. The charge is a low-grade misdemeanor, with no jail time for a first offense.\nCharlotte-Mecklenburg police said it would keep emphasizing voluntary compliance with the order, but the department will enforce violations “if voluntary cooperation is not gained.”\nSeven people were charged on March 30 with violating Guilford County’s stay-at-home order and resisting a public officer while protesting Monday outside a Greensboro abortion clinic.", "url": "https://apnews.com/1a8ac3210dd8c73f3fde0584d75a8325"}