{"authors": ["Paul French", "For Cnn"], "date_download": "2020-05-04 16:19:43", "date_modify": "2020-05-04 16:19:43", "date_publish": "2020-04-04 00:12:14", "description": "In 1918, America adopted mask wearing with a greater vengeance than anywhere else in the world. But a century later, it is Asian countries which have remembered the lessons the US learned.", "filename": "2020_04_03_americas_flu-america-1918-masks-intl-hnk_index_1588609183.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402154756-01-influenza-1918-masks-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_americas_flu-america-1918-masks-intl-hnk_index_1588609183.html", "title": "In the 1918 flu pandemic, not wearing a mask was illegal in some parts of America. What changed?", "title_page": "In the 1918 flu pandemic, not wearing a mask was illegal in some parts of America. What changed? - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) When the novel coronavirus pandemic hit Asia, people across the region were quick to wear masks, with some places like Taiwan and the Philippines even making them mandatory in certain scenarios.\nBut in the West, mask adoption has been far slower, with England's Chief Medical Officer Chris Whitty, for example, going so far as to claim mask-wearing is unnecessary\nYet it hasn't always been the case that mask-wearing is an Asian proclivity.\nIt certainly wasn't during the influenza pandemic of 1918, which lasted from January 1918 to December 1920, and infected one-third of the world's population, or about 500 million people , leading to about 50 million deaths -- about half a million of which were in the United States.\nThere are many parallels between the two pandemics.\nWhile origin theories about the 1918 virus still abound, it was assigned a country specific name: the Spanish Flu. Globalization facilitated its spread as soldiers fighting in World War I took the flu around the globe. Then as now, warehouses were repurposed into quarantine hospitals. And an ocean liner with infected patients became a talking point.\nBut one notable difference is that it was the United States which led the world in mask wearing.\nIn October 1918, as San Francisco received the pandemic's second wave, hospitals began reporting a rise in the number of infected patients.\nOn October 24, 1918, the city's elected legislative body, the Board of Supervisors of San Francisco, realizing that drastic action needed to be taken with over 4,000 cases recorded, unanimously passed the Influenza Mask Ordinance.\nThe wearing of face masks in public became mandatory on US soil for the first time.\nAdoption of masks\nAfter San Francisco made masks mandatory in public, an awareness campaign began.\nThe city's mayor, along with members of the Board of Health, endorsed a Red Cross publicity blitz which told the public: \"Wear a Mask and Save Your Life! A Mask is 99% Proof Against Influenza.\" Songs were written about mask wearing, including one ditty that featured the lyrics: \"Obey the laws, and wear the gauze. Protect your jaws from septic paws.\"\nWarehouses were converted to house the infected people quarantined.\nAnyone found outdoors without a mask could be fined or even imprisoned.\nThe campaign worked and other Californian cities followed suit, including Santa Cruz and Los Angeles, followed by states across the US.\nAnd it wasn't just America.\nOn the other side of the Atlantic similar steps were being taken -- the Committee of the Academie de Médicine of Paris recommended the wearing of face masks in the French captial in early November 1918. So did Dr. Niven, the medical officer of health for Manchester, in northern England.\nIn a case of history repeating itself, this week the mayor of Los Angeles asked people to wear masks when out in public shopping.\nAs mask use gained pace across Europe and North America the issue of supply became acute.\nThere were only a small number of specialist mask manufacturers, such as the Prophylacto Manufacturing Company of Chicago, and they could not meet the surge in demand.\nHome production was the answer. In parts of America, churches, community groups, and Red Cross chapters came together, acquiring as much gauze as they could find, and held mass mask-making sessions.\nAn American policeman wearing a \"flu mask\" to protect himself from the outbreak of Spanish Flu following World War I.\nNewspapers, and various state governments in the US, linked masks to the ongoing war on the battlefields of Europe in October 1918 -- \"Gas Masks in the Trenches; Influenza Masks at Home\" promised the Washington Times newspaper on September 26, 1918, reporting that 45,000 masks would be provided to US soldiers to ward off \"the Spanish Flu.\"\nWhen the First World War ended on November 11, gas-mask manufacturers fulfilling government contracts switched to influenza masks.\nPolicing mask wearing\nMask-wearing laws largely had public support and were mostly policed by consent.\nTucson, Arizona, issued a face mask ordinance on November 14, 1918, with exemptions for preachers, singers and actors in theatres and schoolteachers -- all thought to be far enough away from their audiences. Soon after, Police Chief Bailey told the Tucson Citizen not that he was threatening arrest to miscreants but rather that, in his opinion: \"No gatherings will be considered fashionable unless the attendees are attired in masks.\"\nSeattle policemen wear face masks during the influenza epidemic of 1918, which claimed millions of lives worldwide.\nBack on the West Coast, San Francisco was still ahead of the curve when it came to promoting face mask use. On October 25, 1918, the San Francisco Chronicle ran front page pictures of the city's top judges and leading politicians all wearing face masks.\nSoon there was no escaping wearing a mask. All trains arriving at west coast stations were to be met by mask encouragement committees, groups of female volunteers with masks for those who had not managed to procure one out of state.\nOf course, there were some who flouted the rules. At a boxing match in California, a photograph taken with a flashlight showed that 50% of the men in the audience weren't wearing masks. Police enlarged the picture and used it to identify the mask-less.\nEach man was warned to make a \"voluntary contribution\" to a charity for the men fighting overseas, or face prosecution.\nDid mask wearing work?\nDuring the 1918 flu pandemic, scientific research around mask use was still largely anecdotal -- and the compelling story of one ocean liner caught people's attention.\nIn early December 1918, the Times newspaper in London reported that it had been established, by doctors in the United States, that the influenza was \"contact-borne and consequently preventable.\"\nThe Times noted that in one London hospital all staff and patients had been issued with, and instructed to constantly wear, face masks. The newspaper cited the successes of face masks on one ship.\nThe ocean liner sailing between the United States and England had suffered a terrible infection rate coming from New York, the Times reported. When returning to the United States, the captain instituted a face-mask order for crew and passengers, after having read about their use in San Francisco.\nAn article in the San Francisco Chronicle on October 25, 1918.\nNo infections were reported on the return trip, despite high infection rates at the time in both Manhattan and Southampton, from where the ship departed. It was impossible to know if the rules on masks on the return voyage were responsible for the lack of infections, but that was how the press interpreted it.\nThere was some precedent behind the mask guidance.\nDuring the Great Manchurian Plague of 1910-1911, which saw Chinese, Russian, Mongolian and Japanese scientists come together to combat a widespread outbreak of bubonic plague in northern China, face masks had been deemed effective.\nScience journalist Laura Spinney, author of the 2017 book \"The Pale Rider: The Spanish Flu of 1918 and How it Changed the World,\" notes that after their experiences in Manchuria in 1911, the Japanese took swiftly to wearing masks in public in 1918.\nThe Japanese authorities argued that masks were a courteous gesture in protecting others from germs and had been effective in previous, more localized, outbreaks of disease in Japan.\nAnd mask wearing did seem to have a flattening effect on infection rates.\nBy late December, cities and states in America were feeling confident enough to lift the mask wearing ordinances, as new infections dwindled to single figures in most places.\n\"Today is the last time for the little gauze face pest,\" announced a Chicago newspaper on December 10, 1918.\nA New York Street cleaner wearing a mask to check the spread of the influenza epidemic. \"Better be ridiculous then dead,\" is the view of one official.\nA century later\nIn 1918, America adopted mask wearing with a vengeance.\nBut a century later, it is Asian countries which have remembered the lessons the US learned about the benefits of mask wearing in slowing the spread of infection.\nPerhaps that is because in the intervening years Asia has dealt with ongoing outbreaks of cholera, typhoid and other transmittable diseases, right up to SARS in 2003 and avian flu more recently.\nThose outbreaks have helped to maintain a mask-wearing culture.\nAmerica and Europe have not seen similar outbreaks with such regularity.\nSo, it seems, the notion of masks as a prophylactic measure has skipped the consciousness of several generations. The coronavirus might be about to change that.", "url": "https://www.cnn.com/2020/04/03/americas/flu-america-1918-masks-intl-hnk/index.html"}