{"authors": ["Raf Casert", "Angela Charlton"], "date_download": "2020-05-04 20:23:36", "date_modify": "2020-05-04 20:23:36", "date_publish": "2020-04-20 06:40:30", "description": "HALLE, Belgium (AP) — Belgian Prime Minister Sophie Wilmes just wanted to do the humane thing. After so many frail and elderly nursing home residents had been held in seclusion from their...", "filename": "_a6050b9bde6e776f8d0989812d9d74f0_1588623816.html", "image_url": "https://storage.googleapis.com/afs-prod/media/323915f027354b9ca212d245e1c3c019/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a6050b9bde6e776f8d0989812d9d74f0_1588623816.html", "title": "Nations seek to ease nursing home loneliness yet keep safe", "title_page": "Nations seek to ease nursing home loneliness yet keep safe", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this April 16, 2020, file photo, Richard Eberhardt walks along a corridor at a nursing home in Kaysesberg, France. Countries across Europe are struggling amid the coronavirus pandemic with the dilemma of leaving the elderly and others near death in enforced solitude or whether to allow some personal contact with relatives. At nursing homes, everything is done to keep out visitors who might be infected, and family members are almost always banned from coming to see their loved ones. (AP Photo/Jean-Francois Badias, File)\nFILE - In this April 16, 2020, file photo, Richard Eberhardt walks along a corridor at a nursing home in Kaysesberg, France. Countries across Europe are struggling amid the coronavirus pandemic with the dilemma of leaving the elderly and others near death in enforced solitude or whether to allow some personal contact with relatives. At nursing homes, everything is done to keep out visitors who might be infected, and family members are almost always banned from coming to see their loved ones. (AP Photo/Jean-Francois Badias, File)\nHALLE, Belgium (AP) — Belgian Prime Minister Sophie Wilmes just wanted to do the humane thing.\nAfter so many frail and elderly nursing home residents had been held in seclusion from their loved ones in the first weeks of the lockdown to contain the coronavirus pandemic, Wilmes said her government decided to allow one visitor — in good health — per person.\n“People can die of loneliness,” Wilmes told parliament on Thursday. “Sustained isolation has consequences.”\nShe soon reaped a whirlwind of criticism amid cries it would endanger lives, overburden the staff and use already short supplies of protective equipment for visitors instead of health care workers.\n“Literally opening the doors also means leaving them wide open for the virus. It means there will be more infections and and that more vulnerable elderly will die,” according to the Icaro care organization.\nHer initiative has been repealed in most of the country and new meetings have been called on the issue.\nBelgium is hardly alone in struggling with the emotional and ethical issue of whether to soften rigorous rules amid the overwhelming chaos in hospitals and nursing homes.\nIn the Netherlands, Dutch Health Minister Hugo de Jonge called it a “devil’s dilemma.”\nAs the virus raced through Europe, the hardest-hit countries — Italy, Spain, Britain, France — banned all nursing home visits to protect the vulnerable elderly, who were dying by the thousands from the coronavirus . From Belgium to Turkey, several other countries did the same.\nBut as the confinement drags on, some are rethinking that. In recent days, France, Britain and Belgium have proposed relaxing the rules to ease the pain of families, and their locked-away loved ones.\nIn the U.S., federal government guidelines recommend halting all visits except during end-of-life and other extraordinary situations, when visitors should be equipped with personal protective gear. The federal agency that regulates nursing homes urges them to designate separate facilities to keep COVID-19 residents away from those who have tested negative.\nBerlin allows nursing home patients to receive one visitor for up to one hour a day, and doesn’t restrict visits to palliative care facilities for those nearing the end. South Africa has begun to take precautionary measures at nursing homes, but in most of Africa — the world’s youngest continent, with a median age of just 19.7 years — concerns about aging populations have not loomed as large as they have in Europe, the world’s oldest continent.\nYet the question of dying alone doesn’t only affect the elderly.\n“Ismael, dying aged 13 without a parent at his bedside, made me weep,” U.K. Health Secretary Matt Hancock said in describing the death of one of the country’s youngest COVID-19 victims last month.\nThe issue has struck a chord, since few fears in life are more universal than being alone as one dies.\nOften, it is not just the lack of a hug or a smile from a grandchild; it’s knowing that a spouse or parent may be dying without anyone at their bedside.\nPope Francis last week called on the world to pray “for those who are isolated in care homes for the elderly. They are afraid, afraid of dying alone.”\nThe isolation might last through 2020, said EU Commission President Ursula von der Leyen.\n“Without a vaccine, contacts with the elderly must be restricted as much as possible. I realize it is difficult and that loneliness weighs heavy. But it’s about survival,” she said.\nFrance is trying to find a middle ground.\nLast week French President Emmanuel Macron ordered an exception to one of the world’s strictest lockdowns to allow families “to see the sick at the end of their lives, to be able to bid them adieu.” And on Monday, France will start allowing two family members to visit any loved ones in nursing homes, if adequate protection is ensured.\nSophie Santandrea of private French nursing home group Synerpa was cautious about allowing visits, saying “it will depend on the protocols that are put in place, and whether they are very clear and sufficient” to protect everyone from exposure to the virus from visitors.\nMarc Bourquin of the Hospital Federation of France, which oversees public nursing homes, said there needed to be a way for all elderly to have a visitor, especially if the situation lasts for months.\n“When workers see that a person is losing the taste for life because they can’t see their families, we have to find a way to progressively be able to allow a minimum of contact,” Bourquin said. “The risk of virus will not disappear as long as there is no vaccine. We cannot condemn these people to never see their loved ones again.”\nStaff safety also was raised in Britain amid shortages of personal protective equipment, or PPE.\n“As of this moment, I am very worried that we don’t have enough PPE for staff to protect themselves, let alone facilitate giving it to relatives to be able to see their loved ones during the end-of-life care,” said Donna Kinnair, chief executive of the Royal College of Nursing.\nIt leaves governments, as well as families, in a bind.\n“Everybody saw how inhuman the current situation is,” said Wilmes, the Belgian leader. “We have to do something about it.”\nFull Coverage: Life\n—-\nCharlton reported from Paris. Contributors include Jill Lawless in London, Mike Corder in The Hague, Matthew Perrone in Washington and Cara Anna in Johannesburg.\n___\nFollow AP coverage of the pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/a6050b9bde6e776f8d0989812d9d74f0"}