{"authors": [], "date_download": "2020-05-04 20:13:47", "date_modify": "2020-05-04 20:13:47", "date_publish": "2020-04-08 21:29:20", "description": "FARMINGTON, N.M. (AP) — New Mexico State Police are cracking down on businesses that aren’t abiding by the governor’s public health orders as new confirmed cases pushed the state’s total higher on...", "filename": "_f9285446251e2434b81d32dd755a5f93_1588623227.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ce1d97cc054949269048932666c9df44/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f9285446251e2434b81d32dd755a5f93_1588623227.html", "title": "New Mexico state police to crack down as virus cases go up", "title_page": "New Mexico state police to crack down as virus cases go up ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "New Mexico state police to crack down as virus cases go up\nClosed stores are shown at a central plaza and shopping district amid a public health order that has closed down most retail stores and suspended dine-in restaurant service in Santa Fe, N.M., Friday, March 27, 2020. New Mexico Cabinet Secretary for Tourism Jen Schroer says the state's tourism industry will continue to suffer amid COVID-19 restrictions and vowed the state will do what it can to help hotels, tourist spots, and businesses recover once restrictions are lifted. (AP Photo/Morgan Lee)\nClosed stores are shown at a central plaza and shopping district amid a public health order that has closed down most retail stores and suspended dine-in restaurant service in Santa Fe, N.M., Friday, March 27, 2020. New Mexico Cabinet Secretary for Tourism Jen Schroer says the state's tourism industry will continue to suffer amid COVID-19 restrictions and vowed the state will do what it can to help hotels, tourist spots, and businesses recover once restrictions are lifted. (AP Photo/Morgan Lee)\nFARMINGTON, N.M. (AP) — New Mexico State Police are cracking down on businesses that aren’t abiding by the governor’s public health orders as new confirmed cases pushed the state’s total higher on Wednesday.\nState health officials reported the number of confirmed COVID-19 cases now tops 865, with nearly five dozen patients hospitalized. The cases include two residents and seven employees at a Farmington nursing home. Numerous cases also have been reported at an Albuquerque long-term care facility.\nEvery resident at the Farmington nursing home has been tested now. Life Care Centers of America issued a statement saying the results are still pending, the Farmington Daily Times reported .\nThere are 19 rooms serving as isolation units with a designated staff for residents who test positive or are exhibiting symptoms, officials said.\n“Our primary concern is for the health and safety of our residents, nursing staff and other care providers. They are on the front line of this unprecedented outbreak. Our staff is trained in proper use of PPEs and are following all relevant guidelines in infection control,” Life Care Centers of America said in the statement.\nThe company said staff can help coordinate video chats and phone calls so family members can stay connected to loved ones who are inside the facility.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.\nA total of 16 people have died in New Mexico, state health officials said Wednesday.\nGov. Michelle Lujan Grisham earlier this week extended an emergency health order that aims to limit social contact to keep from spreading the virus. The order also includes restrictions for businesses, and state police are planning to crack down on those businesses that aren’t abiding by the rules.\nA written warning along with a cease and desist order will come first. On a second violation, the business will receive a citation. Subsequent violations could lead to a civil penalty of up to $5,000.\nOn the labor front, the state announced Wednesday it will offer a one-time stimulus payment of $750 for up to 2,000 eligible self-employed New Mexicans affected by the pandemic.", "url": "https://apnews.com/f9285446251e2434b81d32dd755a5f93"}