{"authors": [], "date_download": "2020-05-04 20:14:01", "date_modify": "2020-05-04 20:14:01", "date_publish": "2020-04-15 23:42:07", "description": "LONGMEADOW, Mass. (AP) — A World War II veteran and his wife of nearly eight decades who had tested positive for COVID-19 died together on the same day. David and Muriel Cohen died within...", "filename": "_8f2542e34732b25661dff2df40472787_1588623241.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8f2542e34732b25661dff2df40472787_1588623241.html", "title": "WWII veteran, wife of 78 years dies on same day, hours apart", "title_page": "WWII veteran, wife of 78 years dies on same day, hours apart", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WWII veteran, wife of 78 years dies on same day, hours apart\nLONGMEADOW, Mass. (AP) — A World War II veteran and his wife of nearly eight decades who had tested positive for COVID-19 died together on the same day.\nDavid and Muriel Cohen died within hours of each other at a Longmeadow nursing home on April 10.\nMuriel, 97, had tested positive for the virus and David, 102, had been sick but his test results came back negative.\nThe couple decided to remain together even as the Jewish Nursing Home tried to transfer residents who were infected to a separate unit.\nFran Grosnick, their daughter, gave the nursing home permission to let her parents stay together.\n“The only time they’d ever been separated was when my father served in World War II, and when my sister and I were born,” she told The Boston Globe . “Otherwise they were always together.”\nDavid Cohen served as a radio operator in the Army during World War II. He was also a liberator at the Ohrdruf concentration camp in Germany. Photos he took during the liberation are displayed at the United State Holocaust Museum in Washington D.C.\nWhen he returned to the U.S. after fufilling his service, David became a history teacher in Queens, New York, where he and Muriel raised their two daughters.\nThe couple moved to Longmeadow after retirement to be closer to their children and grandchildren.\nGrosnick said the last time she saw her parents in person was on March 12, when the facility halted visiting hours.\n“They did not suffer, and they were together,” she said. “I take comfort in that.”\nAbout 93 residents and 43 staff members at the Jewish Nursing Home have tested positive for the coronavirus as of last week. Of those positive cases, 21 residents have died.", "url": "https://apnews.com/8f2542e34732b25661dff2df40472787"}