{"authors": ["Reporter", "Work Life"], "date_download": "2020-05-04 20:26:19", "date_modify": "2020-05-04 20:26:19", "date_publish": "2020-04-28 20:19:16", "description": "What companies should do to promote workplace safety differs from what they are legally forced to do during COVID-19.", "filename": "entry_what-to-do-coworker-exposed-coronavirus_l_5ea71d17c5b649bb4f4c9847_1588623979.html", "image_url": "https://img.huffingtonpost.com/asset/5ea71f21220000d60b827bb0.jpeg?cache=7e9rCPdoQO&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_what-to-do-coworker-exposed-coronavirus_l_5ea71d17c5b649bb4f4c9847_1588623979.html", "title": "What To Do If Your Co-worker May Have Exposed You To Coronavirus", "title_page": "What To Do If Your Co-worker May Have Exposed You To Coronavirus | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Karn Dechphan via Getty Images What your company should do if you're exposed to the coronavirus at work isn't always what happens.\nAs several states begin to reopen businesses shut down by the coronavirus, people returning to their workplaces will be wondering how safe it will be for themselves and their co-workers.\nBusinesses should be following the CDC’s guidelines on disinfecting surfaces, increasing ventilation and keeping workers physically apart. But many workers believe their company is not keeping them safe, as demonstrated by employee walkouts at meat plants, Instacart and Amazon over a lack of safety measures.\nWorkers in such places as call centers, spas, grocery stores, pharmacies and airlines have alleged that their workplaces are unsanitary and that they have been forced to work with people who appear sick, according to more than 3,000 complaints filed to the Occupational Safety and Health Administration from January through early April that were obtained by The Washington Post.\nIf you believe you have been exposed or are at risk of catching coronavirus from someone at your job, what can you do? And what is your employer obligated to do?\nLegal experts explained there are recommendations for what companies should be doing to keep workers safe from COVID-19, but employers aren’t necessarily legally required to do any of it.\nWhat companies should do with coronavirus cases differs from what they are obligated to do.\nIf you work closely with someone who contracts COVID-19, your boss should tell you that you have been exposed to the disease.\nAs the Centers for Disease Control and Prevention states in its guidance for businesses and employers, “If an employee is confirmed to have COVID-19 infection, employers should inform fellow employees of their possible exposure to COVID-19 in the workplace but maintain confidentiality as required by the Americans with Disabilities Act.“\nIn other words, they shouldn’t tell you who exactly has the confirmed case at your job, but you should be informed of the risk.\nThe CDC also recommends that, if an employee gets sick with COVID-19, your employer follow cleaning and disinfection protocols that include closing off areas the person visited, opening outside doors and windows, and using ventilating fans.\nHowever, what the CDC advises employers to do is not necessarily required by law. “CDC has issued voluntary guidance that employers should notify. None of it is mandatory,” said Debbie Berkowitz, director of the National Employment Law Project’s worker safety and health program and a former senior policy adviser for OSHA.\n“OSHA has abdicated its responsibility to protect workers ― it is not enforcing CDC guidance, nor requiring it. Workers are on their own.” - Debbie Berkowitz, worker safety and health program director for the National Employment Law Project\nWhat can you do when your employer’s safety management response seems inadequate?\nUnder its General Duty Clause, OSHA requires employers to give each worker “employment and a place of employment which are free from recognized hazards that are causing or are likely to cause death or serious physical harm.”\nDonna Ballman, a Florida-based employment attorney, said that this general duty clause requires employers to disclose potential COVID-19 exposure to staff. “If you are going into what you think is a relatively safe office space, and you find you are being exposed to a lethal disease, you are not being informed of the level of danger that you have a right to know about,” Ballman said.\nIf you believe that your workplace is violating OSHA standards, you can file a complaint with the agency in person, by phone, online, or through fax or email.\nOSHA has faced criticism for its lack of workplace safety enforcement in this fast-moving pandemic. The agency has the power to issue emergency standard rules that employers would be required to follow, but so far it has not issued regulations for airborne infectious diseases like COVID-19.\nDavid Michaels, the former assistant secretary of labor for OSHA, wrote in The Atlantic last month that he is in favor of an emergency temporary standard. “An OSHA standard would provide much-needed guidance, and the prospect of inspections and civil penalties would no doubt motivate some employers to do the right thing,” he wrote. “Such a standard would, in essence, make following CDC guidance an enforceable requirement.“\nIn employer guidance for preparing workplaces for COVID-19, OSHA noted that its recommendations “created no new legal obligations” and were “advisory in nature.” The agency acknowledged that employees facing medium-to-low COVID-19 risk, like billing clerks, will not normally get an on-site inspection if they file complaints about COVID-19 exposure.\n“OSHA has abdicated its responsibility to protect workers. It is not enforcing CDC guidance, nor requiring it. Workers are on their own,” said Berkowitz.\nWhat actions can an individual employee take in these cases?\nEmployees can first bring their concerns up with their employer and see if they are entitled to new accommodations under law.\nPeople with underlying health conditions or with family members who have underlying conditions may qualify for job-protected unpaid leave through the Family and Medical Leave Act, or emergency paid sick leave through the new Families First Coronavirus Response Act, Ballman said. People with disabilities might also qualify for a reasonable accommodation under the ADA, which can include modified work schedules and job restructuring.\nYou can also try organizing with your colleagues to improve your working conditions, if concerted activity with co-workers is protected for you under the National Labor Relations Act. “Could you get together with co-workers, go to management as a group and say, ‘These are our concerns ... We’ve been exposed, or we know we’ve been exposed and you know that we’re still required to come in’? You can do that,” Ballman said.\nUntil CDC and OSHA’s recommendations are required by law, employees will keep facing these tough choices. “If you are out there going to any office or workplace, you may be in a situation where they’re hiding the fact that you’ve been exposed or that you are currently being exposed,” she said.\nBallman said there should be a law that specifically outlines what employers need to disclose to employees and customers around COVID-19 cases.", "url": "https://www.huffpost.com/entry/what-to-do-coworker-exposed-coronavirus_l_5ea71d17c5b649bb4f4c9847"}