{"authors": ["Gregory Krieg", "Tami Luhby"], "date_download": "2020-05-04 16:18:32", "date_modify": "2020-05-04 16:18:32", "date_publish": "2020-04-04 14:00:11", "description": "Even as the coronavirus pandemic rages, President Donald Trump and top Republicans are pressing forward with efforts to further undermine the nation's already compromised health care system.", "filename": "2020_04_04_politics_health-_80b7bd73c6e41c5aa22ebf214a059592_index_1588609112.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402174916-01-wh-coronavirus-task-force-briefing-0402-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_politics_health-_80b7bd73c6e41c5aa22ebf214a059592_index_1588609112.html", "title": "Trump's fight against Obamacare continues despite coronavirus crisis", "title_page": "Health care: Trump's fight against Obamacare continues despite coronavirus crisis - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Even as the coronavirus pandemic rages, President Donald Trump and top Republicans are pressing forward with efforts to further undermine the nation's already compromised health care system.\nThe rapid spread of Covid-19, the disease caused by the novel coronavirus , has put a new spotlight on the same frailties that Democrats successfully seized on in 2018 and are now moving to hammer away at again ahead of this fall's general election.\nTrump's continued support for a GOP lawsuit to dismantle Obamacare, with no replacement proposal in sight, is added fodder for Democrats making the case that current crisis is inextricably tied to pre-existing failures. Those holes in the system will be felt more acutely by millions of Americans over the coming weeks and months, as they lose jobs -- and the coverage attached to them.\nMany of them will find that the safety net is fraying or nonexistent -- in large part due to the actions, over a decade, of Republican officials. Some 14 states, all with either Republican governors or GOP-controlled state legislatures, have yet to take advantage of the Affordable Care Act provision expanding Medicaid to low-income adults, though at least two were reconsidering that stance prior to the pandemic.\nThe White House is now scrambling to patch over the most glaring gaps, including with a new plan to use stimulus funds to cover hospital expenses for uninsured coronavirus patients . But efforts along those lines to ease the pain of the current crisis, like the promise of free Covid-19 testing, have so far largely ignored the failures and inequities that made them necessary in the first place.\nObamacare back in the spotlight\nThe administration has also rejected calls to reopen enrollment on the Obamacare federal exchanges and allow uninsured Americans an opportunity to obtain coverage. The deadline to sign up for a 2020 policy was December 15 in most states. But advocates, insurers, Democrats and at least two Republican governors were hoping that, with hundreds of thousands already ill and the federal government taking extraordinary steps to aid a spiraling economy, the White House might relent.\nAt a briefing this week, Trump and Vice President Mike Pence were asked to explain the administration's \"rationale\" for not creating a special enrollment period.\nPence spoke for more than two minutes, touting some insurers' decisions to waive co-payments on Covid-19 tests and treatment , before pivoting to the government's mitigation efforts and a vague promise to help the afflicted \"deal\" with any subsequent financial crunch.\n\"I think it's one of the greatest answers I've ever heard, because Mike was able to speak for five minutes and not even touch your question,\" Trump said, applauding Pence's evasiveness.\nMassachusetts Sen. Elizabeth Warren took a different view. In a video posted online Friday, the Democrat warned that the current \"health crisis\" is quickly creating a concurrent \"health insurance crisis.\"\n\"It's time for the federal government to just step up and say, 'We're going to cover everyone who doesn't have health insurance,\" Warren said.\nTrump has been clear when questioned about his support for the lawsuit to end Obamacare, which the Supreme Court is expected to take up next term . During a coronavirus task force briefing at the White House on March 22, he rejected any suggestion that he would back off it in light of the growing public health and economic crises.\n\"We are running the bad health care (system) much better than it was ever run and we're making it better, but it could be much better than it is,\" Trump said of Obamacare, though his administration has yet to release a replacement plan. \"And so what we want to do is terminate it.\"\nDemocrats who organized to defend the law in 2017, and used the GOP's attempts to gut the law against it a year later, have already begun to pivot in an effort to connect the issue with the administration's coronavirus response.\n\"It's hard to imagine anything worse during the spread of a virus than taking away health care if people get sick. Republicans have never had a way of justifying their plans that take away health care but now that costs are, sadly, more real,\" Jesse Ferguson, a Democratic strategist, told CNN on Friday.\nMeanwhile, Protect Our Care, a group founded by a former Obama administration health official, has emerged from that fight as a leading liberal watchdog and rapid response group dedicated to tracking Republican attacks on Obamacare and other public health services. It has rebranded its newsletter as the \"Coronavirus War Room.\"\nA repeat winner for Democrats?\nPolling continues to show Democrats, up and down the ballot, with an advantage over Republicans on health care, which is now guaranteed to remain a point of sharp contention, likely at or near the top of voters' concerns, as the general election approaches this fall.\nThe intensity of concern over the issue -- and its potential to drive up enthusiasm among Democrats later this year -- was evident even before the coronavirus effectively paused the primary campaign.\nHealth care was top of mind for voters in the Democratic primaries held in February and March, outranking income inequality, race relations and climate by a wide margin in exit polls in most states.\nHealth was also the top issue for Democratic, independent and swing voters, according to a Kaiser Family Foundation poll from mid-February. For Republican voters, health care came lower down the list -- beaten out by the economy, immigration and foreign policy/national security.\nFor voters overall, 26% said health care was the most important issue in deciding their vote for president, narrowly beating the economy, at 23%. Concerns over the two are likely to overlap as the death toll from the coronavirus rises alongside jobless numbers.\nMeanwhile, the Affordable Care Act hit its highest favorability rating in the nearly 10 years that Kaiser has tracked opinions. Some 55% of the public viewed the law favorably and 37% held unfavorable views, the poll found.\nFormer Vice President Joe Biden, the likely Democratic presidential nominee, hammered Trump on Thursday over the administration's Obamacare policies.\n\"The President must change course and allow open enrollment in the Affordable Care Act, as even Republican governors have called on him to do,\" Biden said in a statement. \"He should also drop his support for a lawsuit that would undo the ACA, because it would cost almost 20 million Americans their care — the last thing we should pursue during a public health emergency.\"\nIn the absence of federal action to broaden coverage, the initiative has shifted to governors and other local leaders.\nEleven states that run their own Obamacare exchanges, along with the District of Columbia, have launched temporary special enrollment periods so their uninsured residents can obtain coverage outside the usual time frame. And while those who lose their job-based coverage are able to sign up for Obamacare policies, the President's action would have eliminated some paperwork requirements for those already facing major life changes amid the pandemic.\nThe future of the US health care system has dominated the 2020 Democratic primary , with moderate candidates pushing for the expansion of Obamacare and, in Biden's case, the opening of a public option to compete with private insurers, potentially driving down costs to individuals while covering millions more.\nBut Democrats have been divided about how far to push reforms. The party's left flank, led by Sen. Bernie Sanders, is pushing for \"Medicare for All,\" a program that would guarantee coverage to every American -- a promise, as Sanders' campaign has reminded voters over the last few weeks, that could have helped slow the initial spread of the coronavirus.\nDespite their differing scopes of their ambitions, Democratic leaders are broadly pushing in the same direction: toward expanding coverage through proactive public policy measures.\nThat same pledge was the key to the party's sweeping victories in the 2018 midterms.\nNancy Pelosi, who has won and lost her House speakerships amid squalls over Obamacare, pointed to the issue in the aftermath of that election.\n\"Health care was on the ballot,\" she said, \"and health care won.\"", "url": "https://www.cnn.com/2020/04/04/politics/health-care-covid-obamacare-republicans-trump-2020/index.html"}