{"authors": ["Anna-Maja Rappard"], "date_download": "2020-05-04 17:01:58", "date_modify": "2020-05-04 17:01:58", "date_publish": "2020-04-10 03:28:52", "description": "Ammon Bundy, the rancher who led an armed occupation of a federal wildlife refuge in Oregon, said he plans on holding an Easter gathering despite stay-at-home orders implemented during the coronavirus pandemic.", "filename": "2020_04_09_us_ammon-bundy-easter-gathering-idaho_index_1588611718.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/160127150133-ammon-bundy-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_us_ammon-bundy-easter-gathering-idaho_index_1588611718.html", "title": "Ammon Bundy vows to defy stay-at-home orders for Easter gathering", "title_page": "Ammon Bundy vows to defy stay-at-home orders for Easter gathering - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Ammon Bundy, the rancher who led an armed occupation of a federal wildlife refuge in Oregon, said he plans on holding an Easter gathering despite stay-at-home orders implemented during the coronavirus pandemic .\nBundy told CNN he wants to gather several hundred people in Idaho at a yet-to-be-announced location. He said he believes it's his constitutional right to assemble, even as state and local officials urge people to socially distance to avoid spreading the virus further.\n\"Our goal is to get enough people together and secure our rights... we are not trying to provoke, we want people to be able to worship,\" Bundy said in a phone interview.\nAmmon Bundy makes his way from the entrance of the Malheur National Wildlife Refuge Headquarters in Burns, Oregon on January 6, 2016. Rob Kerr/AFP/Getty Images\nIdaho is one of the 42 states that have implemented a stay-at-home order aimed at stopping the spread of coronavirus. Gov. Brad Little put the order into effect on March 25 and it is due to expire on April 15, although he said Thursday he's unlikely to lift it before the end of the month.\nAs of Thursday evening, Idaho had at least 1,354 confirmed coronavirus cases and 24 coronavirus-related deaths, according to data from John Hopkins University\nBundy, 44, didn't seem concerned about the possibility of catching or spreading the novel coronavirus.\n\"I actually want the virus,\" he said. \"I'm healthy, my family is healthy. I'd rather have it now so my body is immune to it.\"\nThis is not the first time the rancher has clashed with the government.\nIn 2016, Bundy led an armed occupation of federal land in Oregon. The takeover of a wildlife refuge lasted 41 days and captured the nation's attention. It ended in an intense standoff with police that left one dead. Bundy and 15 others were indicted by a federal grand jury. He was later acquitted.\nAmmon Bundy is the son of Nevada rancher Cliven Bundy, who in 2014 engaged in a protracted battle with the federal Bureau of Land Management over grazing rights for his cattle.\nDuring that time, the Bundys attracted national attention for refusing to pay the federal government more than $1 million in grazing fees.\nThe Boise Police Department confirmed that it is aware of Bundy's plans to organize, but said it does not have any additional information or details about the proposed event to pass along at this time.\n\"Boise Police has not issued any citations or charges due to the governor's order,\" Haley Williams, Boise Police Department spokeswoman, told CNN in a statement. \"Officers have been focused on gaining voluntary compliance. As a last resort, if we are unable to do that, then we would refer the report to the prosecutor's office for possible misdemeanor charges authorized by the governor's order.\"\nThe Boise Mayor's Office said it encourages community members to follow social distancing guidelines set by the US Centers for Disease Control and Prevention.\n\"It'll save lives and is why we took action early to pass social distancing orders,\" the mayor's office said in its statement. \"We appreciate that our residents have taken these orders and guidelines seriously and continue to ask everyone to stay the course.\"\nSome in Idaho feel officials aren't doing enough to mandate the stay-at-home order. In an editorial published on Thursday, the Idaho Statesman called on Gov. Little to crack down on gatherings, including Bundy's planned event.\n\"It's time for Little to use his bully pulpit and surround himself with thousands of his supporters around the state to make clear that the stay-home order is just that: an order,\" the editorial reads . \"It's not a suggestion. It's not a hope or a preference or a request. It's an order.\"\nThe governor's office did not immediately respond to CNN for comment.\nAccording to the Statesman, Bundy held a meeting last month in opposition to the stay-at-home order. He threatened to lead a march on the homes of Little and other local officials, including the director of the state's Department of Health and Welfare.\nBundy confirmed to CNN he has been holding anti-stay-at-home order meetings, and has another one scheduled for Thursday evening.\n\"We are prepared to politically, legally, and physically protect the people's rights,\" he said, noting that could mean protesting in front of the governor's house if necessary.\nResearchers say the virus' peak has yet to come, CNN reported Wednesday. The US will reach its highest daily number of deaths on or around Sunday, according to modeling by the Institute for Health Metrics and Evaluation at the University of Washington in Seattle\nDr. Anthony Fauci, the nation's top infectious disease expert, has repeatedly warned that anyone could get infected with potentially grave consequences. He said the level of immunity of a person who has recovered from the virus is still unclear.", "url": "https://www.cnn.com/2020/04/09/us/ammon-bundy-easter-gathering-idaho/index.html"}