{"authors": ["Stephanie Busari", "Barbara Wojazer"], "date_download": "2020-05-04 16:26:32", "date_modify": "2020-05-04 16:26:32", "date_publish": "2020-04-07 11:30:50", "description": "World Health Organization Director-General Tedros Adhanom Ghebreyesus has condemned controversial comments made by French doctors about testing a Covid-19 potential treatment in Africa, calling the remarks a \"hangover from a colonial mentality.\"", "filename": "2020_04_07_africa_french-doctors-africa-covid-19-intl_index_1588609592.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407033015-cochin-hospital-paris-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_africa_french-doctors-africa-covid-19-intl_index_1588609592.html", "title": "French doctors' proposal to test Covid-19 treatment in Africa slammed as 'colonial mentality'", "title_page": "French doctors' proposal to test Covid-19 treatment in Africa slammed as 'colonial mentality' - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Lagos, Nigeria (CNN) World Health Organization Director-General Tedros Adhanom Ghebreyesus has condemned controversial comments made by French doctors about testing a Covid-19 potential treatment in Africa , calling the remarks a \"hangover from a colonial mentality.\"\n\"To be honest, I was so appalled. And it was a time when I said when we needed solidarity -- this kind of racist remarks actually would not help, it goes against the solidarity,\" Tedros said during a WHO media briefing in Geneva on Monday.\nHe was referring to remarks made last week by Dr. Jean-Paul Mira, head of ICU services at the Cochin Hospital in Paris, and Camille Locht, research director for France's National Institute of Health and Medical Research (Inserm).\nWhat you need to know about coronavirus\nThe two doctors appeared last Wednesday on French TV network on LCI, where they discussed whether the BCG tuberculosis vaccine could be a potential treatment for Covid-19. The drug is undergoing clinical trials for that purpose in the Netherlands and Australia.\nThat's when Mira suggested Africa could be the ideal place to conduct a clinical trial.\n\"If I could be provocative,\" Mira prefaced the question, before adding, \"Should we not do this study in Africa, where there are no [face]masks, no treatments and no ICUs?\"\n\"A bit like it is done for some studies on AIDS, where with prostitutes, we try things because we know that they are highly exposed and they don't protect themselves,\" he added during a conversation.\n\"You are right,\" Loch replied. \"And we are in the process of thinking about a study in Africa in parallel to carry out the same type of approach with BCG, a placebo ...\"\n'Africa isn't a testing lab'\nOnce the conversation between the doctors surfaced on social media, the reaction was swift and angry.\nThe group Esprit D'Ebene, which works with marginalized young people of African descent in France, said on Facebook that \"this kind of proposal should never again be tolerated ... no matter where it is in the world.\"\n\"(African people) are not laboratory rats on which one can try out pharmaceutical products without any guarantee for their safety!\" the group posted.\nOne of the most prominent critical voices was retired Ivorian footballer Didier Drogba.\n\"Africa isn't a testing lab,\" Drogba wrote on Twitter. \"I would like to vividly denounce those demeaning, false and most of all deeply racist words.\"\nMira apologized in a statement released by Cochin Hospital on Friday, saying: \"I want to present all my apologies to those who were struck, shocked and felt insulted by the remarks that I clumsily expressed on LCI this week, as these remarks do not reflect at all what I am, and what I do every day, for almost 30 years now.\"\nInserm defended Locht in a press release, saying that the exchange was cropped from a much longer conversation and \"is the subject of erroneous interpretations on social media.\"\nIt later amended the statement, saying that \"Camille Locht understands the emotions caused since yesterday, linked to his lack of reaction to the proposals made by his interlocutor, on LCI television during a live show. The conditions that this interview were carried out in did not allow him to react correctly, he apologizes and noted that he did not utter any racist remarks.\"\n\"The only goal of his intervention was to confirm that the epidemic was of a global scale and that all countries should be able to benefit from the results of research,\" the institute said, as it attempted to clarify Locht's position.\n\"If there is indeed a reflection around a deployment in Africa, it would be done in parallel with these. Africa must not be forgotten or excluded from research because the pandemic is global,\" it added.\nAn association of lawyers in Morocco called Mira's comments \"racist, discriminatory and hateful,\" and said it would lodge a formal complaint with the French prosecutor, association spokesman and Vice President Mourad Elajouti told CNN.\nFrance's opposition Socialist Party also condemned his comments, saying in a statement \"with all due respect to these renowned researchers, Africa is not a lab for guinea pigs.\"\nFrench researcher Marianne Séverin told CNN the remarks \"tarnished the reputation\" of researchers working on the continent. \"This hurts the reputation of all French scientists who study Africa,\" she said. \"With just these two on TV, our reputation has been tarnished again.\"\nThis story has been updated to clarify that two countries are testing drug treatments.", "url": "https://www.cnn.com/2020/04/07/africa/french-doctors-africa-covid-19-intl/index.html"}