{"authors": [], "date_download": "2020-05-04 20:06:14", "date_modify": "2020-05-04 20:06:14", "date_publish": "2020-04-07 11:43:17", "description": "LINCOLN, Neb. (AP) — Nebraska officials are concerned the closure of schools, widespread job losses and social isolation could be driving an uptick in child abuse cases, the state's child welfare...", "filename": "_06675879ef0e395ee1533dec28744cb8_1588622774.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_06675879ef0e395ee1533dec28744cb8_1588622774.html", "title": "Nebraska officials fear pandemic could fuel more child abuse", "title_page": "Nebraska officials fear pandemic could fuel more child abuse", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LINCOLN, Neb. (AP) — Nebraska officials are concerned the closure of schools, widespread job losses and social isolation could be driving an uptick in child abuse cases, the state’s child welfare administrator said Tuesday.\nStephanie Beasley, director of Nebraska’s Child and Family Services Division, said the coronavirus pandemic is putting a major strain on the families her agency serves.\nBeasley said the pandemic is making it more difficult for children to get social services and for parents to get substance abuse treatment and counseling. Statewide school closures have also kept children at home and away from teachers, who are among the most likely to notice and report signs of abuse, she said.\n“These stressors can create a recipe for child abuse and neglect,” Beasley said at a press conference with Gov. Pete Ricketts.\nBeasley said the state’s child abuse hotline has seen a drop in calls, likely because fewer people are reporting abuse. She said the number of applications for the Supplemental Nutrition Assistance Program increased an unusual 35% in March compared to the previous month, suggesting that more people are seeking public benefits to deal with job losses.\nRicketts said Tuesday he signed an executive order that would allow Nebraska’s SNAP recipients to collect the benefit for an extra six months.\nMeanwhile, two remote Nebraska counties reported their first cases of coronavirus, state health officials reported. The statewide number of cases had risen to 447 as of Tuesday afternoon, with 10 confirmed deaths. More than 6,800 residents have tested negative.\nThe Nebraska Department of Health and Human Services said in a news release Monday night that Cheyenne County in the Nebraska Panhandle reported a woman in her 20s testing positive for COVID-19. The woman had been in close contact with another infected person.\nOn the opposite side of the state, in northeastern Nebraska’s Stanton County, a man in his 60s with no underlying health conditions has tested positive for the virus. Officials said his case originates from “community spread,” meaning health officials can’t trace the source of the infection.\nBoth counties are rural and sparsely populated, with about 10,000 people calling Cheyenne County home and little more that 6,000 people in Stanton County.\nFor most people, COVID-19, the disease caused by the coronavirus, causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. Older adults and people with existing health problems are among those particularly susceptible to more severe illnesses.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/06675879ef0e395ee1533dec28744cb8"}