{"authors": ["Nathan Wolfe For Cnn Business Perspectives", "Nathan Wolfe For"], "date_download": "2020-05-04 16:15:29", "date_modify": "2020-05-04 16:15:29", "date_publish": "2020-04-03 12:22:33", "description": "Sadly Covid-19 will not be the last epidemic we experience. But if we learn from it as we learned from 9/11 it may be the last one that taxpayers alone are on the hook for.", "filename": "2020_04_03_perspectives_pandemic-insurance_index_1588608929.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402142908-closed-business-la-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_perspectives_pandemic-insurance_index_1588608929.html", "title": "Taxpayers shouldn't have to pay for pandemics. Here's a solution", "title_page": "Taxpayers shouldn't have to pay for pandemics. Here's a solution (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Dr. Nathan Wolfe is an epidemiologist and founder of the epidemic data and analytics firm Metabiota. The opinions expressed in this commentary are his own.\nAs an epidemiologist, I spent the first 20 years of my career discovering unknown viruses that could cause pandemics, such as novel coronaviruses. I spent most of those years arguing that if the world didn't better prepare for pandemics, countless lives would be lost. Then, 10 years ago, I started looking at the financial fallout as well. I became convinced that if we don't prepare for pandemics, countless livelihoods will also be destroyed.\nCovid-19 has shown that waiting to respond to epidemics can prove catastrophic. It has proven that we need to prepare for the financial fallout of the next major pandemic. But how?\nThat's where the insurance industry can help.\nIt's easy to imagine that catastrophes like Covid-19 represent \"acts of god,\" meaning it's a catastrophe that can't be predicted or prevented and only the government can offer meaningful capacity to respond. Not so.\nIn a litany of other catastrophes, including hurricanes, earthquakes, cyberterror, floods and droughts, to name a few, companies get detailed industry-specific risk assessments and obtain insurance to protect against business losses.\nRead More", "url": "https://www.cnn.com/2020/04/03/perspectives/pandemic-insurance/index.html"}