{"authors": ["Jake Tapper", "Anchor", "Chief Washington Correspondent"], "date_download": "2020-05-04 16:03:16", "date_modify": "2020-05-04 16:03:16", "date_publish": "2020-04-01 20:09:15", "description": "The state of Illinois is desperate to receive medical supplies to fight the coronavirus outbreak but the Trump administration is barely providing the state with anything, a senior state official told CNN on Wednesday.", "filename": "2020_04_01_politics_illinoi_fcfa99740894c11d8df19ade46a16940_index_1588608196.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200322101056-j-b-pritzker-sotu-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_illinoi_fcfa99740894c11d8df19ade46a16940_index_1588608196.html", "title": "Illinois becoming desperate for federal government to send medical supplies to fight coronavirus", "title_page": "Illinois becoming desperate for federal government to send medical supplies to fight coronavirus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The state of Illinois is desperate to receive medical supplies to fight the coronavirus outbreak but the Trump administration is barely providing the state with anything, a senior state official told CNN on Wednesday.\nReferring to \"Project Airbridge\" -- an airlift of supplies provided by the federal government and private health care distributors and helmed by White House senior adviser and President Donald Trump's son-in-law Jared Kushner -- the official said that \"the Airbridge that Trump and (Vice President Mike) Pence talk about coming to Illinois -- all the goods went to other states. We got nothing.\"\nIllinois is one of several states struggling to obtain needed medical supplies to outfit health care workers on the front lines of the fight against the pandemic. Governors across the country have complained about having to bid against each other for medical supplies shipments and some, such as Michigan Democratic Gov. Gretchen Whitmer , have said contractors are canceling contracts in order to sell medical supplies to the federal government instead of the states.\nIllinois Gov. J.B. Pritzker, a Democrat, has been up front with his complaints about the process , telling CNN's Chris Cuomo on Tuesday that the state has \"gotten about 10% of what we asked for\" from the federal government.\nOn Tuesday, Pence noted that he spoke with Pritzker and said, \"In the last week and in the week ahead, more than 450 ventilators\" would be headed to Illinois.\nRead More", "url": "https://www.cnn.com/2020/04/01/politics/illinois-not-getting-needed-supplies-government/index.html"}