{"authors": [], "date_download": "2020-05-04 21:06:48", "date_modify": "2020-05-04 21:06:48", "date_publish": "2020-04-14 02:59:21", "description": "BANGKOK (AP) — Australia’s prime minister has described as “unfathomable” the World Health Organization’s support for the reopening of markets where live animals are butchered in Wuhan, the...", "filename": "_f65f3de7b9ffbb159bc4cd7419d8a638_1588626408.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e5a2baf7cbff44fbae1f063b7a646a99/2796.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f65f3de7b9ffbb159bc4cd7419d8a638_1588626408.html", "title": "Asia Today: China wet markets panned, India extends lockdown", "title_page": "Asia Today: China wet markets panned, India extends lockdown", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Kashmiri man wearing protective gear crosses a barricade in an area declared as red zone by the government during lockdown in Srinagar, Indian controlled Kashmir, Tuesday, April 14, 2020. Indian Prime Minister Narendra Modi on Tuesday extended the world's largest coronavirus lockdown to head off the epidemic's peak, with officials racing to make up for lost time. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Mukhtar Khan)\nA Kashmiri man wearing protective gear crosses a barricade in an area declared as red zone by the government during lockdown in Srinagar, Indian controlled Kashmir, Tuesday, April 14, 2020. Indian Prime Minister Narendra Modi on Tuesday extended the world's largest coronavirus lockdown to head off the epidemic's peak, with officials racing to make up for lost time. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Mukhtar Khan)\nBANGKOK (AP) — Australia’s prime minister has described as “unfathomable” the World Health Organization’s support for the reopening of markets where live animals are butchered in Wuhan, the Chinese city at the center of the coronavirus pandemic.\n“We need to protect the world against potential sources of outbreaks of these types of viruses. It’s happened too many times. I’m totally puzzled by this decision,” Prime Minister Scott Morrison told Nine Network television on Tuesday. “I think that’s unfathomable, frankly.”\nHealth Minister Greg Hunt said he was unsettled by the reopening of the “wet markets” in Wuhan, which has been under a months-long lockdown. Some scientists believe the virus came from wild animals at a wet market, where many kinds of live mammals, poultry, fish and reptiles are kept and then butchered when they are sold.\n“There is a very real likelihood that this disease arose from a wet market in Wuhan -- it’s clear that these are dangerous vectors,” Hunt told Australian Broadcasting Corp. “I would imagine that around the world, the vast majority of people would have a similar view.”\nWHO said in a statement that wet markets should not be allowed to sell illegal wildlife for food and authorities should enforce food safety and hygiene regulations. But it said “wet markets and other food markets do not need to be closed down.”\nChina temporarily shut wet markets after the outbreak and suspended the sale of some kinds of wildlife. Local media say the markets are being reopened to alleviate the economic difficulties of shopkeepers.\nIn other developments in the Asia-Pacific region:\n— INDIA’S LOCKDOWN EXTENDED: The world’s largest lockdown has been extended to May 3. Indian Prime Minister Narendra Modi said restrictions may be eased after one week to help daily wage earners and those working in agriculture. Modi said the lockdown will be eased only in areas where the virus situation doesn’t deteriorate. Hundreds of jobless migrant workers crowded a railway station in Mumbai to protest the decision and demand that they be allowed to return to their home villages. Police charged at the protesters with batons and forced them back to the nearby slums where they live.\n— ASEAN MEETS ON VIDEO: Southeast Asian leaders linked up by video to plot their moves against the virus that threatens their economies and binds millions of people to their homes under lockdowns. Vietnamese Prime Minister Nguyen Xuan Phuc said in an opening speech that containment efforts were working but warned against complacency.\n— NO OLYMPIC ‘PLAN B’: Tokyo organizers said they have no “Plan B” in case the Olympics needs to be postponed again because of the coronavirus. They said they are proceeding under the assumption the Olympics will open on July 23, 2021. The date was set last month by the International Olympic Committee and Japanese officials after the pandemic made it clear the Olympics could not be held as scheduled this summer.\n— JAPAN’S CASES RISE: Japan’s health ministry reported 390 new cases of the virus for a domestic total of 7,645. The country was put under a state of emergency last week, but many people were still seen queuing up at grocery stores and crowding shopping arcades in parts of downtown Tokyo to stock up on necessities.\n— INFECTIONS JUMP IN SINGAPORE: Singapore has reported its biggest daily jump in new coronavirus infections, most of them linked to foreign workers living in crowded dormitories. Foreigners account for over a third of Singapore’s workforce, many of them people from poorer Asian countries working in construction, shipping and maintenance jobs. Over 200,000 Asian migrant workers live in 43 registered dormitories that house up to 20 men per room. The 386 newly confirmed cases raise Singapore’s tally to 2,918. Health authorities also reported a ninth death.\n— DEATHS RISE IN INDONESIA: Indonesia reported 60 more deaths, its largest number in one day, for a 459 total, the most in Asia after China. President Joko Widodo declared the outbreak in the world’s fourth most populous country a “non-natural national disaster.” The decree opens the door to international cooperation and assistance. Indonesia recorded 282 new cases, bringing its total to 4,839.\n— NO TIME TO LET UP: Prime Minister Jacinda Ardern says New Zealand appears to be over the worst of its coronavirus outbreak but it is no time to let up on strict lockdown measures. The country recorded 17 new cases, bringing its total to 1,366. There were also four new deaths, the worst day yet on that measure, bringing the total to nine. New Zealand lawmakers will decide next week what will happen after an initial four-week lockdown ends April 22.\n— NEW ZEALAND ECONOMY HIT: The operators of New Zealand’s Burger King restaurants entered bankruptcy proceedings and one of the country’s largest media companies announced plans to shed 200 staff. New Zealand has been in a strict lockdown for nearly three weeks and all restaurants have been temporarily closed. NZME, which runs a number of radio stations and newspapers, said it is reducing its workforce by 15% through layoffs and by not filling vacant positions.\n— IMF CANCELS DEBT PAYMENTS: The International Monetary Fund approved $500 million to cancel six months of debt payments for 25 impoverished countries so they can tackle the pandemic. Afghanistan, Nepal, Solomon Islands and Tajikistan are among the countries that will see immediate debt relief.\n— DECLINES IN SOUTH KOREA, CHINA: South Korea reported 27 new cases as infections continued to wane in the worst-hit city of Daegu and nearby towns. South Korea’s totals are 10,564 infections and 222 virus-related deaths. China reported 89 new virus cases, 86 of them among travelers arriving from abroad, but no new deaths. It has confirmed 3,341 deaths out of 82,249 official cases of infections.\n— NEPAL EXTENDS LOCKDOWN: Nepal’s Cabinet decided to extend the country’s lockdown to April 27 in an effort to stop the spread of the coronavirus. Under the lockdown, which originally was to end Wednesday, flights and road travel have been halted, schools and businesses have been shut and people have been told to stay home. Nepal confirmed two new cases of the virus on Tuesday, bringing its total to 16.", "url": "https://apnews.com/f65f3de7b9ffbb159bc4cd7419d8a638"}