{"authors": ["Heather Hollingsworth"], "date_download": "2020-05-04 20:03:56", "date_modify": "2020-05-04 20:03:56", "date_publish": "2020-04-08 17:12:40", "description": "MISSION, Kan. (AP) — Gov. Laura Kelly’s executive order restricting the size of religious gatherings amid the coronavirus outbreak was overturned Wednesday after the state’s top prosecutor said it...", "filename": "_79490ae7c241fab1301bd66e87afd224_1588622636.html", "image_url": "https://storage.googleapis.com/afs-prod/media/db2b15ba583345179fb492d3d7d81915/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_79490ae7c241fab1301bd66e87afd224_1588622636.html", "title": "Lawmakers overturn religious worship size limits in Kansas", "title_page": "Lawmakers overturn religious worship size limits in Kansas", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "People wait for a bus in a deserted downtown Kansas City, Mo., on what would normally be a busy workday morning Wednesday, April 8, 2020. The city is under a stay-at-home order, asking everyone to stay inside and away from others as much as possible, in an effort to slow the spread of the new coronavirus. (AP Photo/Charlie Riedel)\nPeople wait for a bus in a deserted downtown Kansas City, Mo., on what would normally be a busy workday morning Wednesday, April 8, 2020. The city is under a stay-at-home order, asking everyone to stay inside and away from others as much as possible, in an effort to slow the spread of the new coronavirus. (AP Photo/Charlie Riedel)\nMISSION, Kan. (AP) — Gov. Laura Kelly’s executive order restricting the size of religious gatherings amid the coronavirus outbreak was overturned Wednesday after the state’s top prosecutor said it likely violates the state constitution.\nWith Easter just days away, the Legislative Coordinating Council voted 5-2 to undo the order that limited in-person religious services and funerals to 10 people. The now-overturned order had rescinded an earlier order that barred most gatherings with more than 10 people, with exceptions for religious gatherings and funerals, raising questions about whether large gatherings were now legally permitted. Kelly said legal staff is reviewing the matter.\n“This has created confusion,” Kelly, a Democrat, said at a news conference while blaming politics. “This has created chaos.”\nThe council’s vote came after Attorney General Derek Schmidt, a Republican, said that while the order was “sound public-health advice that Kansans should follow,” he was discouraging law enforcement agencies and prosecutors statewide from attempting to enforce the requirements. Violations of the order could have been prosecuted as a misdemeanor, punishable by a fine of up to $2,500 and 12 months in jail.\nSenate President Susan Wagle, a Wichita Republican, said her phone had been “ringing off the wall” since the order was passed Tuesday.\n“It appears to be out of line and extreme and clearly in violation, a blatant violation, of our fundamental rights,” said Wagle, an abortion opponent, who questioned why clinics were still being allowed to perform abortions while restrictions were being placed on churches.\nBut Kelly’s chief legal council, Clay Britton, had defended the order, saying there was a “compelling need to act” because health and emergency management officials had determined that the virus was being spread through church gatherings. The state has 12 COVID-19 clusters in which a combined 165 people have been sickened, with three of them connected to religious events, health officials say.\nLawmakers gave the council, the top seven legislators from both parties in both chambers, the right to review all of Kelly’s executive orders and to overturn many of them within days. Conservative Republicans were upset with an order from Kelly to close K-12 schools for the rest of the spring semester and wanted to block her from using sweeping gubernatorial powers granted to deal with short-term disasters.\nDr. Lee Norman, the state health department’s head, lamented the action lawmakers took, saying, “We do not want to lose ground.” The number of confirmed cases of COVID-19 in the state grew Wednesday to 1,046, up from 900 Tuesday, with 38 deaths.\nThe sickened include 56 patients and staff members at the Riverbend Post Acute Rehabilitation in Kansas City, Kansas. Six have died and seven are hospitalized, health officials with the Unified Government of Wyandotte County said Wednesday.\nPreviously that state’s largest outbreak had been at the Life Care Center of Burlington, where 41 residents and one staff member have tested positive. One resident at that facility has died.\nState health officials also are monitoring an outbreak at the Lansing Correctional Center as the number sickened grew to 11 staff members and 10 inmates.\nMost infected people develop mild or moderate symptoms that clear up within three weeks, such as fever and cough. But older adults and people with existing health problems are particularly susceptible to more severe illness, including pneumonia.", "url": "https://apnews.com/79490ae7c241fab1301bd66e87afd224"}