{"authors": ["Phil Mattingly", "Lauren Fox"], "date_download": "2020-05-04 16:52:04", "date_modify": "2020-05-04 16:52:04", "date_publish": "2020-04-08 13:39:33", "description": "The White House and congressional Republicans are working quickly to pass $251 billion in additional funds for an emergency small business loan program by the end of this week.", "filename": "2020_04_08_politics_congress-250-billion-stimulus-latest_index_1588611124.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191017010128-01-nancy-pelosi-1016-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_congress-250-billion-stimulus-latest_index_1588611124.html", "title": "Congress - CNNPolitics", "title_page": "Congress  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The White House and congressional Republicans are working quickly to pass $251 billion in additional funds for an emergency small business loan program by the end of this week.\nDemocrats are amenable to the new funding -- with conditions of their own.\nBottom line: Speaker Nancy Pelosi and Senate Democratic Leader Chuck Schumer of New York outlined their demands for any quick action on the small business funding. Republicans, aides tell CNN, aren't open to those additions now, seeing them instead as pieces of the next relief package.\nBuckle up, this could get ugly, quickly.\nWhy the request was made\nAt this point, $66 billion in loans have been committed, which is obviously well short of the $349 billion initially allocated. But the volume for requests has been enormous, according bank executives, and the glitches and technical difficulties with the program have created an extremely long and drawn out process. That has led to significant anxiety among small businesses who believe they will miss out on the funds. The additional money isn't just designed to refill the coffers once the initial funding runs out -- it's also an effort to ease and calm the application process and give assurance to those businesses who may need the money in a week or two, as opposed to immediately, that the money will be there.\nBookmark this reminder: Nothing happens without Democratic support. Democrats control the House, and Senate Republicans need Democratic votes to move legislation in that chamber. But it's particularly acute at this moment, when lawmakers aren't coming back to the Capitol for weeks and if anything is to move, it must move unanimously.\nWith that in mind: Administration officials on Tuesday made clear they expected Democrats to come back with additional asks. That it occurred is not a surprise. That the asks were as extensive, according to one official, is \"somewhat of a surprise.\"\nWhy this could get ugly: Republican leaders in both chambers were extremely quick to come out in support of the request for additional funding for the small business program. That's not a huge surprise -- it's a popular idea, it's an hugely important program, and the request came from the Republican White House.\nBut the National Republican Congressional Committee, the House GOP campaign arm, also weighed in very early to put pressure on Democrats to get on board with moving the additional funding quickly. Supporting small business is the epitome of the golden campaign position for both parties. Being on the opposite side of that is always a risky proposition -- something you can expect the Republican political arms to take action on very quickly if negotiations start to drag.\nSchumer and Pelosi statement: \"The heartbreaking acceleration of the coronavirus crisis demands bold, urgent and ongoing action from Congress to protect Americans' lives and livelihoods. As Democrats have said since Day One, Congress must provide additional relief for small businesses and families, building on the strong down-payment made in the bipartisan CARES Act.\"\nA quick test\nThis isn't set to be a long, drawn out negotiation. Senate Republicans plan to move forward on the funding addition on Thursday. At least at the moment, that's still the plan GOP aides say.\nWith senators still out of town, any legislative effort must move by unanimous consent, meaning any one senator can block the additional funding. As Democrats press for their demands, that's an option for Schumer when the Senate opens up on Thursday morning. But Republicans are already warning against the move, signaling a hardening of the battle lines amid an extremely tight timetable.\n\"If Schumer wants to come to the floor and block money for small businesses, that's on him,\" one GOP aide told CNN.\nThe negotiating battle lines\nRepublicans: The White House has requested $251 billion in additional funds for the emergency small business lending program -- money that would boost the program to a massive $600 billion. Republicans are open to structuring some type of conditions, possibly through administrative action, to the money to address Democratic concerns about underserved small businesses missing out. But other than that, they want the money to move through clean.\nDemocrats: Pelosi and Schumer, in a joint statement, laid out their position Wednesday morning:\n$250 billion in additional small business loan funds, with $125 billion channeled through community-based financial institutions that focus on underserved communities\n$100 billion for hospitals, health systems and community health centers\n$150 billion for states and local governments\nA 15% increase to the maximum benefit of the Supplemental Nutrition Assistance Program -- otherwise known as SNAP or food stamps\nAlso worth keeping in mind: The expectation there is a quick path forward for this money. But it's not just Democratic conditions that members are bringing up -- it's the issues with the small business loan program itself.\nSeveral members and aides tell CNN that handing over another $250 billion to a program that isn't running smoothly isn't exactly going over well. Yes, everyone wants small businesses to have the money they need, but some members are arguing that any legislation this week must include more changes to the underlying program and at the very least offer further guidance to lenders and small businesses about who is eligible.\n\"If you don't fix what is fundamentally wrong with the program, throwing more money after bad is not going to help small businesses,\" Rep. Stephanie Murphy, a moderate Democrat from Florida, told CNN Tuesday night.\n\"We have to try to make the changes be a condition of handing over another quarter of a trillion dollars.\"\nSen. Ron Johnson, a Wisconsin Republican, told CNN that he doesn't need legislative language to include fixes, but he does need Treasury to issue further guidance before agreeing to more money. And, he told leadership that by replying all to an email leadership sent out to all GOP Members on Tuesday.\nFrom 30,000 feet on the SBA program itself\nCongress, as soon as this week, may approve $250 billion more in funding for a small business program that, according to participants, is still riddled with hold ups and glitches\nThat in and of itself is a pretty amazing thing to think about.\nBut it underscores two points: first, the urgency and demand of the moment. This money, and this program, are desperately needed. Second, lawmakers believe the issues the program is having will be worked out. \"It's not a matter of if, but a matter of when,\" one House Republican told CNN.\nStill, despite what some administration officials say, things just aren't quite firing on all cylinders yet.\nIn the words of one banking industry source, \"we've maybe got a cylinder working right now. And even that one cylinder kind of depends on what time you're using the system.\"\nAbout the numbers\nThe volume of applications is stunning. Bank of America has received more than 250,000 applications. JPMorgan Chase has received more than 375,000 applications. That's thousands of applications an hour for tens of billion of dollars in loans. But that doesn't equal money out the door.\nIn fact, due to technical issues, the vast majority of the $66 billion in loans that have been committed to this point have not actually been distributed to small businesses due to issues lenders have had with completing the process, four industry officials tell CNN.\nMajor issues: The technical issues improved on Tuesday. The system lenders use to upload applicant information didn't completely crash like it did Monday. Each day more lenders are participating in the program amounting to more loan applications going out.\nThe Small Business Administration is expected to bring its portal for new lenders online Wednesday.\nBut, one industry source said they continued to hear about widespread frustration with the system working \"very slowly\" and banks \"being kicked out multiple times while processing individual applications.\"\nOne bank official told CNN it takes their loan officers on average 49 minutes to move an application through the process.\nNearly one-third of community banks still do not have access to the Small Business Administration system used to process the loans for the program.\nThe biggest outstanding issue, according to several bank sources, is the SBA still hasn't provided the loan note document necessary for banks to actually complete the loans. That is why committed money does not equal money out the door.\nAnother issue? Banks trying to get more of their employees manually uploading the information into the SBA portal say they aren't getting enough credentials from the SBA to get all their employees signed on.\nRubio's blunt talk\nSen. Marco Rubio, a Florida Republican and one of the lead drafters of the program itself, has been clear about the issues with the program, but he's also been clear that they can all be addressed over time.\nAs Rubio tweeted Wednesday morning:\n\"The rollout of #PPP has not been 'flawless' & the glitches have not been 'minor'. But they also aren't insurmountable. They have solutions. And @stevenmnuchin1 has been incredibly accessible & decisive. The goal is steady daily improvement in program.\"", "url": "https://www.cnn.com/2020/04/08/politics/congress-250-billion-stimulus-latest/index.html"}