{"authors": ["Sunlen Serfaty"], "date_download": "2020-05-04 16:27:49", "date_modify": "2020-05-04 16:27:49", "date_publish": "2020-04-07 18:57:00", "description": "In a change to Senate rules, senators will now be allowed to charter private planes -- using taxpayer money -- when and if they are summoned back to Washington, DC to vote in the middle of the coronavirus pandemic, a Senate aide tells CNN.", "filename": "2020_04_07_politics_senate-rule-change-charter-flights_index_1588609669.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/120301122623-roy-blunt-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_senate-rule-change-charter-flights_index_1588609669.html", "title": "Senate loosens rules on private charter flights", "title_page": "Senate loosens rules on private charter flights - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) In a change to Senate rules, senators will now be allowed to charter private planes -- using taxpayer money -- when and if they are summoned back to Washington, DC to vote in the middle of the coronavirus pandemic, a Senate aide tells CNN.\nSen. Roy Blunt, a Missouri Republican and the chairman of the Senate Rules Committee, made the change in light of the health concerns and the challenges of commercial travel.\nThe Rules Committee will now waive a specific section of the Senate's travel regulations, loosening it up so members would be able to use their office funds to pay for the flights. The change lifts the rule that the \"Charter of aircraft may be allowed notwithstanding the availability of commercial facilities, if such commercial facilities are not such that reasonable schedules may be kept.\"\nNow, if a senator needs to take a private flight, they will be able to use their office funds -- formally the Senator's Official Personnel and Office Expense Account, a discretionary pot of money that each member has to support their official and representational duties.\nThe move was prompted after the Senate's second-highest ranking Republican, Sen. John Thune of South Dakota, had to charter a flight from Washington, DC, to his home in Sioux Falls, last month, after he had fallen ill with a suspected case of coronavirus. The senator tested negative for the virus shortly after, but, according to his spokesperson, flew home on a charter jet with only himself and one member of his Capitol police security detail out of an abundance of caution.\nRead More", "url": "https://www.cnn.com/2020/04/07/politics/senate-rule-change-charter-flights/index.html"}