{"authors": [], "date_download": "2020-05-04 16:15:19", "date_modify": "2020-05-04 16:15:19", "date_publish": "2020-04-03 15:01:54", "description": "Check out these easy takes on restaurant-style brunch dishes you can prepare at home.", "filename": "2020_04_03_cnn-underscored_brunch-ideas-at-home_index_1588608919.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401115024-underscored-brunch-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored_brunch-ideas-at-home_index_1588608919.html", "title": "Brunch ideas at home: Recipes for eggs benedict, hash and more", "title_page": "Brunch ideas at home: Recipes for eggs benedict, hash and more - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Story highlights Try these recipes for everything from eggs Benedict to challah French toast.\nShop the kitchen essentials for cooking up restaurant-style brunch at home.\nCNN Underscored has interviewed experts to find the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nBrunch has a way of brightening up the weekend. And when eating out isn't an option, there are plenty of creative ways to whip up your brunch menu favorites at home.\n\"Now is a great opportunity to find pleasure in cooking,\" says Adam Roberts, the popular food writer behind The Amateur Gourmet blog and Instagram account. \"Think about the breakfast dish that you love to eat at a restaurant, or crave the most, but don't know how to make — you should start with that,\" he says.\nRoberts, who also hosts the \"Lunch Therapy\" podcast, is an expert at adapting fancy-tasting recipes for everyday cooks. His latest cookbook, \"Secrets of the Best Chefs: Recipes, Techniques, and Tricks from America's Greatest Cooks,\" does just that, with 150 dishes from America's best chefs. Roberts offers a few of his favorite brunch dishes below, plus we grab how-tos from expert chefs Sarabeth Levine and Jamie Oliver for tried-and-true classics. And scroll all the way down to see what tools you'll need in your kitchen to become a brunch-making pro.\nRecipes\nif you're wondering how or where to get the groceries for any of these recipes, try Instacart to shop at your local stores from home. Their shoppers will deliver everything on your list (or at least all the items that are available) right to your door.\nEggs Benedict, serves 4\nEggs Benedict\nNothing screams \"brunch classic\" quite like eggs Benedict. It may seem like a daunting dish to tackle at home, but this recipe from Sarabeth Levine of the award-winning Sarabeth restaurants is simple to execute with the right tools. All you need is a double boiler to make the hollandaise sauce and an egg-poaching pan for foolproof results.\nIngredients:\nHollandaise Sauce:\n3 large egg yolks, room temperature\n1 tablespoon plus 1 teaspoon fresh lemon juice\n8 ounces (2 sticks) unsalted butter, softened\n2 small pinches white pepper\nFine sea salt\nPoached Eggs:\nUnsalted butter or nonstick spray, for greasing cups\n8 eggs\n4 English muffins, split and toasted\n8 ounces of sliced smoked salmon, or 8 slices prosciutto (ham will do in a pinch)\n½ small red pepper, finely diced\n½ small yellow pepper, finely diced\n2 chives, finely chopped\nSee the full recipe for Sarabeth's Eggs Benedict at FoodNetwork.com.\n_______________________________________________________________________________\nSweet Potato and Brussels Sprout Hash, serves 2\nSweet Potato and Brussels Sprout Hash\nHash is a brunch-menu staple that's perfect to make at home with pretty much any leftovers you have on hand. \"Hash is so great because you can throw anything in there,\" Roberts says. It's also a real treat if you're not used to at-home frying. \"Hash uses a lot of oil, so you get that kind of greasy feel of a restaurant dish.\" Roberts uses Brussels sprouts in this version, but any leftover veggies or meats could work just as well.\nIngredients:\n½ cup vegetable oil\n2 sweet potatoes, cubed into ½-inch cubes\nKosher salt\n1 cup shredded Brussels sprouts\nOlive oil\n2 eggs\nGrated Parmesan\nDirections:\nStep 1: In a cast-iron skillet, heat the vegetable oil until very hot.\nStep 2: Add the sweet potato cubes, season with salt, and don't touch. When the potatoes start to take on color, stir around with a metal spatula. Because these are sweet potatoes (which have more sugar), they can burn more quickly, so keep an eye on them.\nStep 3: When the potatoes are good and crisp all over, add the shredded Brussels sprouts, a splash of olive oil (to wet the sprouts), salt and pepper and stir all around. Continue cooking until everything is golden brown.\nStep 4: Scoop onto plates and in the same skillet add a splash more olive oil, keep the heat on high, and add your eggs. Season with salt and pepper and fry until the whites are set and the yolks are still runny. Scoop onto the hash and dust with grated Parmesan. Eat right away.\n_______________________________________________________________________________\nChallah French Toast, serves 4\nChallah French Toast\n\"If you've been baking a lot of bread or stocking up, and it's starting to go a little stale, there's nothing better to do than to make French toast,\" Roberts says. The trick to taking this from everyday to restaurant style is starting with a whole loaf, so you can cut nice thick slices.\nIngredients:\nA loaf of challah bread\n2 cups whole milk\n3 eggs\n¼ cup sugar\nA pinch of salt\nA splash of vanilla\n4 tablespoons butter\nPowdered sugar for sprinkling\nCrème fraîche (or whipped cream) for serving\nBlueberries (optional)\nMaple syrup\nDirections:\nStep 1: Use a bread knife to cut 1-inch slices and set aside. (If you do this the night before, you can leave the bread out on a cookie sheet to dry out a bit.)\nStep 2: In a large bowl, whisk together the milk, eggs, sugar, salt and vanilla.\nStep 3: Dunk the bread into the liquid and let it saturate. You want it to be as infused with the batter as possible without falling apart.\nStep 4: Melt the butter in a large skillet on high heat. When the butter stops foaming and the pan is good and hot, lift out your bread pieces, let the batter drip off, and lay into the skillet. Don't crowd the pan (you may need to do this in batches, in which case you'll need more butter). Once it's in the skillet, don't touch the French toast. You'll know it's time to flip when it starts to smell good and caramelized and it looks golden brown when you peek underneath. Finish on the other side, another minute or so.\nStep 5: Lift the French toast onto plates and dust with powdered sugar. Put a dollop of crème fraîche (or whipped cream) on top and sprinkle with blueberries or any other berry that you like. Put on more powdered sugar and pour on the maple syrup.\n_______________________________________________________________________________\nPolenta Cakes With Mushrooms and Fried Eggs, serves 4\nPolenta Cakes With Mushrooms and Fried Eggs\nOne secret to easy and efficient restaurant-style cooking is to make big batches of versatile foods. \"The goal is to try to make more of what you need the first time around and then repurpose it for something else,\" Roberts says. In this case, serve a smooth and creamy polenta with dinner, then transform it into crispy brunch cakes the next morning. \"You get a totally different preparation with the exact same ingredients,\" Roberts says. Complete the overnight prep with porcelain ramekins from Sur La Table.\nIngredients:\n5 cups water\n1 cup polenta (not quick-cooking)\nKosher salt\n5 tablespoons butter\n½ cup of Parmesan cheese (plus more for sprinkling later)\nOlive oil\n2 cups sliced mushrooms, any kind (Roberts uses stemmed shiitakes)\n2 cloves garlic, sliced\nChopped parsley\n4 eggs\nDirections:\nStep 1: The night before you want to make this, serve polenta with your dinner. (It's great with sausages braised in tomato sauce.) Make the polenta by whisking the one cup of polenta into the 5 cups of boiling water; season well with salt (about a tablespoon). When the polenta starts to get thick and bubbly, lower the heat, stir with a wooden spoon, and cook like that for 45 minutes on low heat. Finish by stirring in 2 tablespoons of butter and the ½ cup of Parmesan.\nStep 2: Press leftover polenta into ramekins. Try to really pack it in there; the more compressed, the better.\nStep 3: The next morning, unmold the polenta with a knife. In a nonstick skillet, heat a tablespoon of butter with a splash of olive oil. Add your polenta cakes and don't touch them once in the pan. Just let them sputter and fry for a good three minutes at least until golden-brown. Flip and repeat on the opposite side.\nStep 4: Wipe out the skillet. Add the final tablespoon of butter and another splash of olive oil on high heat. Add your mushrooms and a pinch of salt and stir all around. The mushrooms should start to give off their liquid; if they don't, add ¼ cup of water to help draw out the moisture. Cook until the mushrooms start to shrink and the liquid has evaporated. Add the garlic and continue cooking until the mushrooms are golden brown all over and the garlic is just starting to color. Add a handful of chopped parsley, stir all around and place next to the polenta cakes.\nStep 5: Wipe out the skillet and add a glug of olive oil. Heat again and add as many eggs as you want to serve. Sprinkle with salt and pepper and let the eggs fry; if you put a lid on it, it'll help the tops set. Cook to your liking, serve next to the polenta cakes and mushrooms. Sprinkle everything with more Parmesan and parsley.\n_______________________________________________________________________________\nScrambled Eggs With Smoked Trout, Pickled Onions and Kale, serves 6\nScrambled Eggs With Smoked Trout, Pickled Onions and Kale\nThis scramble is another creative way to use ingredients you may have around for a restaurant-quality meal. \"The flavors in this are sort of similar to a Sunday morning bagel,\" Roberts says. \"Smoked fish is fantastic, it has so much flavor. You can stock up and it will keep for months.\" Consider this as a potential go-to for those mornings when you're craving something smoky and savory that goes beyond your standard bowl of cereal or plain egg.\nIngredients:\nOlive oil\n1 cup stemmed and shredded kale\nSalt\nFresh lemon juice\n6 eggs beaten with salt and pepper\n½ cup shredded smoked trout (Trader Joe's brand works great here)\n¼ cup chopped pickled onions (use Bon Appetit's recipe)\nDirections:\nStep 1: In a nonstick skillet, add a splash of olive oil. Heat it up and then add the kale. Season with salt and squeeze lemon all over it; when the kale is wilted and flavorful (taste here), lower the heat a little.\nStep 2: Add the eggs on medium-low heat. Using a heatproof silicone spatula, fold gently until large curds form. When it's halfway there, add the trout and chopped pickled onions.\nStep 3: While the eggs are still slightly wet, lift onto plates. They'll finish setting there. Eat right away.\n_______________________________________________________________________________\nHuevos Rancheros, serves 6\nHuevos Rancheros\nFor those who crave a spicy kick, huevos rancheros is another classic brunch dish that's simple to make at home. This recipe from British celebrity chef Jamie Oliver calls for tossing most of the ingredients in a single pan (nonstick with a lid is best).\nIngredients:\n1 onion\n2 cloves of garlic\n2 red bell peppers\n2 fresh red or orange chilli peppers\nOlive oil\n1 large dried chilli pepper\n3 fresh bay leaves\n2 cans (14-ounce) of quality plum tomatoes\n2 large ripe tomatoes\n6 large eggs\n6 tortillas\nCheddar cheese, to serve\nSee the full recipe at JamieOliver.com.\n_______________________________________________________________________________\nBrunch beverages\nBrunch Beverages\nFor a classic brunch cocktail or mocktail, Zing Zang Bloody Mary Mix is a favorite among bartenders for its balance of saltiness and spice. Doctor to taste with olives, celery, Worcestershire sauce, horseradish, hot sauce, pepper and other extras.\nAs for a flavor-packed cup of joe, Roberts agrees with fellow experts that the best coffee starts with whole beans. Roberts uses an at-home burr mill coffee grinder. \"Grinding the beans first makes a huge difference, because it brings out all the oils and makes for a more potent taste than if you just use preground coffee,\" Roberts says. Put it in a French press for a real restaurant experience. Whole beans also stay fresh longer than ground and can be stored in the cupboard or the freezer.\n_______________________________________________________________________________\nStock your kitchen with these essential brunch-making tools:\nSalt Stainless Steel Double Boiler ($29.99; bedbathandbeyond.com)\nSalt Stainless Steel Double Boiler\nDouble boilers come in handy when making delicate sauces like hollandaise and beurre blanc. They're also great to have around for melting chocolate for dipping.\n_______________________________________________________________________________\nDemeyere Stainless Egg Poaching Pan ($49.96, originally $82; surlatable.com)\nDemeyere Stainless Egg Poaching Pan\nPoached eggs are the centerpiece of loads of brunch recipes. These nonstick cups make it easy to poach and plate your eggs like a pro.\n_______________________________________________________________________________\nLodge 12-Inch Cast-Iron Skillet ($22.99; target.com)\nLodge 12-Inch Cast-Iron Skillet\nA cast-iron skillet will stay with you for life if you take care of it by not using soap to wash it and generously oiling it up with each use.\n_______________________________________________________________________________\nMicroplane Stainless Steel Paddle Grater ($15.99; target.com)\nMicroplane Stainless Steel Paddle Grater\nMicroplanes slice like nothing else on the market. This little guy will make you look like a pro chef when you shred Parmesan right onto the dish.\n_______________________________________________________________________________\nCalphalon Classic Forged 8-Inch Bread Knife ($29.99; bedbathandbeyond.com)\nCalphalon Classic Forged 8-Inch Bread Knife\nOnce you own one of these, you'll wonder how you lived without it. Bread knives make slicing anything from angel food cake to a baguette easier than you ever imagined possible.\n_______________________________________________________________________________\nTableCraft Dripless Glass Syrup Server ($9.99; bedbathandbeyond.com)\nTableCraft Dripless Glass Syrup Server\nIt's just more fun to pour your syrup out of one of these, isn't it?\n_______________________________________________________________________________\nSur La Table Porcelain Round Ramekins ($2 each; surlatable.com)\nSur La Table Porcelain Round Ramekins\nUse these to pack you polenta cakes and then use them again to make custards, baked eggs, soufflés and all sorts of single-serving dishes or dips.\n_______________________________________________________________________________\nCalphalon 10-Inch Hard-Anodized Nonstick Fry Pan ($31.99; target.com)\nCalphalon 10-Inch Hard-Anodized Nonstick Fry Pan\nA nonstick frying pan is a kitchen staple that will quickly earn its keep. This one is the perfect size for sizzling up omelets, frittatas, pancakes, chicken breasts or burgers.\n_______________________________________________________________________________\nSilicone Spatula 3-Piece Set ($7.99; bedbathandbeyond.com)\nSilicone Spatula 3-Piece Set\nSilicon spatulas are the way to go if you have nonstick or ceramic coated pots and pans, because they won't scratch the surface.\n_______________________________________________________________________________\nRSVP Glazed Tortilla Warmer ($25.99; bedbathandbeyond.com)\nRSVP Glazed Tortilla Warmer\nIf you love your tortillas, this will be worth the purchase. Whether you're having huevos rancheros or tacos, your tortillas (or even homemade pancakes) will stay warm in the oven in this stoneware container while you finish cooking the rest of the meal.\n_______________________________________________________________________________\nOxo Good Grips Potato Masher ($11.99; bedbathandbeyond.com)\nOxo Good Grips Potato Masher\nMashers are great for making a breakfast hash, but they're also perfect for mashing potatoes, guacamole, beans or just about anything you can think of.\n_______________________________________________________________________________\nZing Zang Bloody Mary Mix ($4.45; instacart.com)\nZing Zang Bloody Mary Mix\nThis bloody mary mix is a favorite of bartenders because of its balanced and flavorful combination of ingredients. It's even delicious on its own as a mocktail.\n_______________________________________________________________________________\nCuisinart Automatic Burr Mill Stainless Steel Coffee Grinder ($59.99; target.com)\nCuisinart Automatic Burr Mill Stainless Steel Coffee Grinder\nFreshly ground coffee beans make homemade coffee taste like it was made at a serious coffee shop. This grinder makes it easy to grind up your own beans before scooping them into your coffee maker of choice.\n_______________________________________________________________________________\n'Secrets of the Best Chefs: Recipes, Techniques, and Tricks from America's Greatest Cooks' ($17.60; amazon.com)\nThis cookbook features recipes from more than 150 chefs across the United States, including several that are featured above.\n\"Secrets of the Best Chefs: Recipes, Techniques, and Tricks from America's Greatest Cooks\"\nNote: The prices above reflect the retailers' listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/brunch-ideas-at-home/index.html"}