{"authors": ["Zeynep Bilginsoy"], "date_download": "2020-05-04 20:08:40", "date_modify": "2020-05-04 20:08:40", "date_publish": "2020-04-16 15:58:20", "description": "ISTANBUL (AP) — An organized crime boss serving a prison sentence in Turkey was set free Thursday as Turkish authorities continued releasing thousands of inmates to ease overcrowding during the...", "filename": "_8f0d2eb35797b21b447f0dfc48416f02_1588622920.html", "image_url": "https://storage.googleapis.com/afs-prod/media/90f15b19f51c4223a998de5646048c85/1506.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8f0d2eb35797b21b447f0dfc48416f02_1588622920.html", "title": "Turkey mob boss released while govt critics kept in prison", "title_page": "Turkey mob boss released while govt critics kept in prison", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this April 11, 2008 file photo, paramilitary police offices escort Alaattin Cakici before a trial in Istanbul. A notorious mafia boss has been set free on Thursday, April 16, 2020 as Turkish prisons continue releasing thousands of inmates to ease overcrowding in prisons amid the coronavirus pandemic but the new penal legislation is keeping government critics behind bars due to Turkey’s sweeping terror laws. (AP Photo, File)\nFILE - In this April 11, 2008 file photo, paramilitary police offices escort Alaattin Cakici before a trial in Istanbul. A notorious mafia boss has been set free on Thursday, April 16, 2020 as Turkish prisons continue releasing thousands of inmates to ease overcrowding in prisons amid the coronavirus pandemic but the new penal legislation is keeping government critics behind bars due to Turkey’s sweeping terror laws. (AP Photo, File)\nISTANBUL (AP) — An organized crime boss serving a prison sentence in Turkey was set free Thursday as Turkish authorities continued releasing thousands of inmates to ease overcrowding during the coronavirus pandemic while moving to keep government critics behind bars.\nFar-right mob boss Alaattin Cakici was released from an Ankara prison and planned to “sequester” at a friend’s hotel in western Turkey, defense lawyer Zeynep Ciftci tweeted. The private DHA and IHA news agencies filmed Cakici’s convoy leaving the prison.\nThe 67-year-old was imprisoned for convictions on charges that included instigating murder, armed attack, money laundering, leading an illegal organization and insulting the president. Cakici had served 16 years of his decades-long sentences before his release.\nAt the same time, scores of journalists, activists, and politicians and members from opposition parties are ineligible for early release under penal legislation that took effect this week. The updated law changes the conditions for prisoners to be released on probation and reduces the minimum time that must be served for some convictions.\nThe law, which was fast-tracked as Turkey responds to the pandemic, does not apply to people charged with or convicted of sex and drug crimes, murder in the first degree, or violating Turkey’s intelligence law. It also excludes inmates held on terror charges, a crime of which numerous government critics stand accused.\nFollowing a coup attempt in 2016, tens of thousands of people were arrested for alleged terror links to the network of Muslim cleric Fethullah Gulen and the outlawed Kurdish insurgency.\nOpposition parties and rights groups have slammed the legislation, charging Turkey’s broad terror laws are used to crack down on freedom of expression.\nAt least 85 journalists are behind bars, according to the Journalists’ Union of Turkey. The pro-Kurdish Peoples’ Democratic Party says more than 3,500 party members, including former party leaders and lawmakers, are imprisoned.\nThe main secular opposition Republican People’s Party said it would apply to the Constitutional Court to get the law repealed. The party’s deputy chairman, Engin Ozkoc, said the law unjustly frees prisoners “who hurt the public conscience” while keeping “the ones holding pens” behind bars.\nBefore signing the measure into law, Turkish President Recep Tayyip Erdogan said the legal changes were designed for the need to update the criminal justice system and also addressed the threat posed by the coronavirus.\n“Every precaution, from hygiene to quarantines, are being taken to prevent these people from catching this pandemic,” he added.\nTurkey has reported 69,392 virus cases and 1,518 deaths, according to the latest Health Ministry figures. The justice minister said earlier this week that 17 inmates in minimum-security prisons had tested positive for the new coronavirus and three had died.\nTurkey’s official Anadolu news agency said 15,000 inmates held in maximum and medium-security prisons and 30,000 inmates in minimum-security prisons are eligible for release under the new rules. Another 45,000 are to be allowed early supervised release under house arrest to address prison overcrowding. The legislation also releases to house arrest women with young children, the sick and some prisoners above age 65.\nTwo European Union lawmakers called the law “a great disappointment.”\n“Turkish ruling parties have decided to deliberately expose the lives of journalists, human rights defenders and those whom they deem to be political opponents to the risk of the deadly disease COVID-19,” the European Parliament’s standing rapporteur on Turkey, Nacho Sanchez Amor, and the chair of a parliamentary delegation to an EU-Turkey joint committee, Sergey Lagodinsky, said.\nCakici is close to a nationalist politician who is allied with the Turkish government. The politician, Devlet Bahceli, had demanded amnesty for him.\nCakici’s involvement in organized crime and the far-right in Turkey are well-documented. He was active in violence against leftist groups before a military coup in 1980, and continues to have devoted followers.", "url": "https://apnews.com/8f0d2eb35797b21b447f0dfc48416f02"}