{"authors": [], "date_download": "2020-05-04 16:16:55", "date_modify": "2020-05-04 16:16:55", "date_publish": "2020-04-03 21:26:56", "description": null, "filename": "2020_04_03_cnn-underscored__738a18caf2cbaf0c2fc7734d541ffd9a_index_1588609015.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200305154939-underscored-hand-washing-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored__738a18caf2cbaf0c2fc7734d541ffd9a_index_1588609015.html", "title": "These are your best bets for buying cleaning and sanitizing products", "title_page": "These are your best bets for buying cleaning and sanitizing products - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "We've interviewed experts and found the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nThe spread of coronavirus across the globe has led to shortages of everything from hand sanitizer and face masks and price gouging of these and similar products on sites like Amazon, as consumers try to prepare for the outbreak's escalation. So everyday hygiene using supplies recommended in the Center for Disease Control's guidelines on how to stay healthy has become more complicated than usual.\nHere, we've provided a few reasonably priced essentials to get you started if you're looking to stock up on supplies — and ensure you're not paying higher-than-normal prices. Of course, personal preference and availability may dictate that you opt for a different brand or formulation, because many of these items are in such high demand that the price and amount in stock is fluctuating often. At the moment, though, these items are all a solid value and still available.\nNote: This list contains suggested products for preventative routine cleaning of hands and households, which is recommended by the CDC. It is not intended for households with anyone who is suspected or confirmed to have COVID-19.\nHand soap\nHand soaps\nHand-washing is the first line of defense against the spread of germs. The CDC says it's especially important to wash after going to the bathroom; before eating; and after blowing your nose, coughing, or sneezing. Most hand soaps on Amazon are sold out, but we found many options in stock at Bed Bath and Beyond. But for certain products like hand soap, the store is putting a limit of 3 items per billing or shipping address (you can still buy multiple items, the restriction is only if you want to buy more than 3 of a single product). Target is limiting shipping on products or only shipping them with purchases of $25 or more. While some hand soaps are currently priced much higher than usual or completely sold out, these in-stock hand soaps are still at their usual price:\nEveryone 32 oz. 3-in-1 Botanical Soap in Lavender and Aloe ($10.99; bedbathandbeyond.com)\nSoftsoap 11.25 Lavender and Chamomile Liquid Hand Soap ($2.49; bedbathandbeyond.com)\nMrs. Meyer's Clean Day Therapeutic Lemon Verbena Cleaning Products ($3.99 to $9.99; bedbathandbeyond.com)\nBetter Life 12 fl. oz. Citrus Mint Hand and Body Soap ($3.99; bedbathandbeyond.com)\nMrs. Meyer's Lavender Liquid Hand Soap Refill - 33 fl oz ($6.99; target.com)\nMethod Foaming Hand Soap Sea Minerals - 10 fl oz ($2.99; target.com)\n33.5 oz. Unscented Liquid Hand Soap ($7.99; homedepot.com)\n128 oz. Free and Clear Liquid Hand Soap ($19.29; homedepot.com)\nHand sanitizer\nIt's almost impossible to find hand sanitizer in stock anywhere online, and what few options are available are much more expensive than usual. A few big box retailers and smaller, direct-to-consumer brands might still have hand sanitizer in stock, but your best bet may be to try searching for sanitizer on a grocery delivery site like Instacart or FreshDirect to see what's in stock at a store near you. If you happen to be in self-isolation due to illness, these services will deliver. Just be sure that any hand sanitizer you do purchase is alcohol-based and at least 60% alcohol, per the CDC.\nIt's also important to note that hand sanitizer is not a requirement. Washing your hands with regular soap and water just as effective when it comes to preventing the spread of germs.\nHousehold cleaners\nHousehold cleaners\nThe CDC also recommends that people use household cleaners for routine cleaning of commonly touched surfaces and objects in the home, including things like cell phones and doorknobs. It is important to note that the products below are not disinfectants recommended by the CDC for households with people suspected or confirmed to have COVID-19. Use this link for a list of those products.\nHousehold cleaners are in short supply at many retailers, but a few, including Target and Amazon, still have some options available at their normal prices:\nMrs. Meyer's Clean Day Multi-Surface Everyday Cleaner, Lemon Verbena, 16 ounces, pack of 3 ($11.67; amazon.com )\nMrs. Meyers Clean Day 32 oz. Multi-Surface Cleaner Concentrate with Honeysuckle Scent ($7.99; bedbathandbeyond.com )\nFIT Organic 32 oz. Multi-Surface Spray Cleaner and Degreaser ($6.99; bedbathandbeyond.com )\nMrs. Meyer's Clean Day 16 oz. Aromatherapeutic Multi-Surface Spray in Lavender ($3.99; bedbathandbeyond.com)\nPaper products\nPaper products\nTissues and other household paper products are still readily available, though you should be on the lookout for higher-than-usual markups. Below, find tissues for covering coughs and sneezes, paper towels for wiping down surfaces, and trash bags for disposing of said tissues and paper towels — all at normal prices on Amazon.\nKleenex 3-Ply Pocket Packs Facial Tissues, 8 packs ($6.99; amazon.com)\nSeventh Generation Facial 2-Ply Tissues - 175 Tissues per Box [Set of 2] ($15.96; amazon.com)\nPuffs Plus Lotion with Vicks Facial Tissues, 24 Cubes, 48 Tissues per Box (1152 Tissues Total) ($38.16; amazon.com)\nBrawny Tear-A-Square Paper Towels, Quarter Size Sheets, 16 Count ($30.99; amazon.com)\nSolimo Tall Kitchen Drawstring Trash Bags, 13 gallon, 45 count ($7.99; amazon.com)\nCorrection: An earlier version of this story mislabeled some household cleaning products as \"disinfectants.\"\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/best-hand-sanitizer-disinfectant-spray-cleaning-products-outbrain-2/index.html"}