{"authors": ["Elizabeth Cohen", "Minali Nigam"], "date_download": "2020-05-04 16:20:41", "date_modify": "2020-05-04 16:20:41", "date_publish": "2020-04-05 17:19:09", "description": "Regulatory changes by President Donald Trump's administration have made it easier for companies to flood the US market with \"crappy\" tests that are supposed to determine whether someone has recovered from coronavirus, according to the CEO of the Association of Public Health Laboratories.", "filename": "2020_04_05_health_coronavirus-infection-tests_index_1588609241.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405013646-01-coronavirus-0404-new-york-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_health_coronavirus-infection-tests_index_1588609241.html", "title": "'Crappy' tests to check for past coronavirus infection are flooding the US, lab association says", "title_page": "'Crappy' tests to check for past coronavirus infection are flooding the US, lab association says  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Regulatory changes by President Donald Trump's administration have made it easier for companies to flood the US market with \"crappy\" tests that are supposed to determine whether someone has recovered from coronavirus, according to the CEO of the Association of Public Health Laboratories.\n\"It's like the wild, wild West out there -- or wild East,\" said Scott Becker, a reference to the fact that at least half of the companies making these tests are in China.\nBecker's association represents 125 state, county and municipal public health labs in the US. These labs, along with private ones, are looking to test people to see if they have antibodies to coronavirus. If someone has antibodies, that indicates they've recovered from coronavirus and their body has built up immunity to it.\nIf someone does have antibodies, they might be allowed to return to work.\nBecker said his labs won't use the tests that are on the market because they're concerned about inaccurate results and people might mistakenly think they're immune to coronavirus and return to work or stop social distancing.\nRead More", "url": "https://www.cnn.com/2020/04/05/health/coronavirus-infection-tests/index.html"}