{"authors": ["Harmeet Kaur"], "date_download": "2020-05-04 15:59:40", "date_modify": "2020-05-04 15:59:40", "date_publish": "2020-04-01 11:45:15", "description": "Borjas spent decades serving transgender people, undocumented immigrants, sex workers and those living with HIV/AIDS, providing them with legal assistance and other services.", "filename": "2020_04_01_us_lorena-borjas_5cff5495cc301bc0e45b13c90be4925d_index_1588607980.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331125152-lorena-borjas-obit-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_us_lorena-borjas_5cff5495cc301bc0e45b13c90be4925d_index_1588607980.html", "title": "Lorena Borjas, a transgender Latina activist who fought for immigrants and sex workers, has died of Covid-19", "title_page": "Lorena Borjas, a transgender Latina activist who fought for immigrants and sex workers, has died of Covid-19 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Even as Lorena Borjas was feeling ill and waiting on Covid-19 test results, she was worried about how transgender immigrants would cope with the pandemic.\nThat, according to her friends and chosen family, was typical of Borjas, a transgender Latinx activist from Queens who spent decades advocating for people from marginalized communities. Despite numerous challenges and traumas she faced in her personal life, she never took a rest from fighting for transgender women, undocumented immigrants, sex workers and those living with HIV/AIDS.\nOn Monday around 5:22 a.m., Borjas, 59, died from complications due to Covid-19 at Coney Island Hospital, according to her close friend Cecilia Gentili.\nHer loss has inspired tributes from countless activists and leaders, including Rep. Alexandria Ocasio-Cortez , New York Attorney General Letitia James , New York City Council Speaker Corey Johnson and blogger Monica Roberts\n\"Lorena spent her life tirelessly fighting and supporting our trans sisters, making sure they were treated with dignity and respect they deserve,\" Make the Road New York, an organization that fights for immigrant and working class communities, said in a statement. \"We will truly miss her. May she rest in power and love.\"\nShe was a fighter and a leader\nBorjas was like a mother to Gentili, she said -- one of many people in Queens' transgender Latinx community who shared that sentiment.\n\"You could aspire to be like her but you clearly know you won't be like her because you are not as selfless as she is,\" Gentili told CNN.\nFor more than 25 years, Borjas spent her days serving people in marginalized communities in whatever ways she could.\n\"Lorena brought light to us when we were living through a very dark time here in New York,\" said Cristina Herrera, founder and CEO of Translatina Network and a friend of Borjas' since 1987. \"She brought us light when we were dealing with the crack epidemic, when we were dealing with the AIDS crisis, dealing with changes in immigration policies.\"\nBorjas walked up and down the streets in her neighborhood of Jackson Heights, handing out free condoms to sex workers. She set up syringe exchanges to protect transgender people who were undergoing hormone therapy. She set up an HIV testing clinic in her own home\nGentili recalled a time when she was tasked with connecting transgender patients to mental health services at a clinic she worked at. Borjas offered to introduce her to people in the community who could benefit from those services, asking Gentili to accompany her late one night while she was distributing condoms to sex workers.\n\"She wasn't expecting people to come to her,\" Gentili said. \"She was going to them.\"\nChase Strangio, deputy director for transgender justice at the LGBT & HIV Project of the American Civil Liberties Union, said he first met Borjas in 2009 and started working closely with her in 2010 through his role at the Sylvia Rivera Law Project, where he was working on immigration and criminal justice issues.\nBorjas supported transgender immigrants as they were dealing with arrests, convictions and court apperances.\nAt first, Borjas was a client, but \"quickly she became a colleague and co-conspirator,\" he said.\n\"She brought people into the office every week who needed legal support and made sure that I was paying attention to the crisis of policing and deportation facing her community,\" Strangio wrote in an email to CNN.\nThe two worked together to support transgender Latina immigrants and others who were dealing with arrests, convictions and court appearances, he said. Eventually, they co-founded the Lorena Borjas Community Fund, which helps transgender people and others pay for legal costs and bail.\nBianey Garcia, an activist at Make the Road New York, said she first met Borjas when she was 17 -- during a time when she lived \"a crazy life.\" One of her earliest memories of Borjas was when she invited her to a support group.\nLater, Garcia, who was previously a sex worker, said she was arrested and incarcerated at Rikers Island. Borjas visited her at the jail complex, listened to her fears about deportation over the phone and eventually found an immigration lawyer to fight for her release.\n\"I really appreciated her for everything that she did when I most needed,\" Garcia said.\nShe faced her own challenges\nBorjas came to the United States from Mexico in 1981 when she was 20, according to a short film called \"The Story of Lorena Borjas.\" She considered herself a gay man at the time and didn't see a future for herself in Mexico, Borjas says in the film. So she emigrated in order to transition -- and to find professionals who could help her do so under medical supervision.\nThough she successfully transitioned, she remained undocumented until 1986, when she was granted amnesty under a law enacted by President Ronald Reagan. She became a legal permanent resident in 1990. That same year, however, she was arrested on charges of prostitution and trafficking -- though she was a human trafficking victim herself.\nBorjas' subsequent convictions meant she could not renew her status as a permanent resident or become a US citizen. Despite her circumstances, she began her life as an activist in 1995, organizing a transgender march to protest \"police policies and systems\" and helping transgender women with HIV/AIDS.\nIn 2017, Borjas was granted a pardon by New York Gov. Andrew Cuomo, finally easing her long-held fears of deportation.\n\"Lorena has done more than anyone else I know to shine a light on the epidemic of trafficking in transgender communities and to help other trans women escape exploitation,\" Lynly Egyes, who represented Borjas on behalf of the Transgender Law Center, said at the time.\nShe wanted to people to share joy\nBorjas took care of people in ways big and small, friends said.\nAside from helping transgender immigrants navigate the legal system, she also made sure they had food to eat, a roof over their heads and a cell phone, according to Strangio.\nHerrera added that Borjas would provide new immigrants with Metrocards so they could use the subway. She stayed up late talking to people and helping them deal with their problems. She'd call people to remind them about medical appointments -- and follow up to see whether they had made it and how things went.\n\"She just wanted people to be OK,\" Herrera said.\nIt was important to Borjas that people not only survived, Strangio said, but thrived and shared joy with each other.\nIn May 2012, a few months before Strangio was expecting a child, Borjas threw his family a surprise baby shower and bought them a car seat and a stroller.\n\"We had so much more access and privilege and yet she found a way to demonstrate that she was going to provide love and support to our growing family,\" he said. \"This is what she did for everyone.\"\nMonday night, about 250 people gathered for a virtual vigil to honor Borjas' life and legacy.", "url": "https://www.cnn.com/2020/04/01/us/lorena-borjas-transgender-activist-covid19-death-trnd/index.html"}