{"authors": ["David Williams"], "date_download": "2020-05-04 16:00:35", "date_modify": "2020-05-04 16:00:35", "date_publish": "2020-04-01 15:02:38", "description": "Comedian Larry David says that the people going out and socializing during the coronavirus crisis aren't just putting people at risk, they're blowing an amazing opportunity.", "filename": "2020_04_01_entertainment_coronavirus-larry-david-psa-trnd_index_1588608035.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401151138-larry-david-coronavirus-advice-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_entertainment_coronavirus-larry-david-psa-trnd_index_1588608035.html", "title": "Larry David asks idiots to stay home and watch TV in crabby coronavirus PSA", "title_page": "Larry David asks idiots to stay home and watch TV in crabby coronavirus PSA - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Comedian Larry David says that the people going out and socializing during the coronavirus crisis aren't just putting people at risk, they're blowing an amazing opportunity.\nThe \" Curb Your Enthusiasm \" creator and star said he wanted to \"address the idiots out there\" in a video posted on Twitter by the California governor's office.\n\"You're hurting old people like me -- well not me, I have nothing to do with you. I'll never see you,\" he said. \"But you know, other, let's say other old people, who might be your relatives. Who the hell knows.\"\n\"You're hurting old people like me. Well, not me... I'll never see you.\" Larry David wants everyone to stay home to protect older Californians from #COVID19 ! He does not do these things. Listen to Larry. #StayHomeSaveLives https://t.co/snYe5v55Rw pic.twitter.com/C5cKOaAufE\nCalifornia is one of at least 30 states and the District of Columbia that have issued stay-at-home orders for its residents. More than 262 million people, or about 80% of the US population , have been ordered to stay at home, according to a CNN count. That count includes state, city and county orders.\nDavid didn't understand why people aren't heeding that advice.\n\"You're passing up a fantastic opportunity. A once-in-a-lifetime opportunity to stay in the house, sit on the couch and watch TV. I don't know how you're passing that up,\" he said from his armchair. \"Well, maybe cause you're not that bright.\"\nDavid said that anyone who's seen his show should know that nothing good ever comes from leaving the house.\n\"There's just trouble out there,\" he said. \"It's not a good place.\"\nHis advice was to stay on the couch, watch TV and avoid everyone.\nDavid did make an exception for plumbing emergencies, but he said to be sure to wipe everything down once the plumber leaves.", "url": "https://www.cnn.com/2020/04/01/entertainment/coronavirus-larry-david-psa-trnd/index.html"}