{"authors": [], "date_download": "2020-05-04 21:07:17", "date_modify": "2020-05-04 21:07:17", "date_publish": "2020-04-05 21:31:32", "description": "TORONTO (AP) — Shirley Douglas, the impassioned Canadian activist and veteran actress who was mother to actor Kiefer Sutherland and daughter of Canada medicare founder Tommy Douglas, died Sunday....", "filename": "_5db69d8fadb550969c0135e80b9362c1_1588626437.html", "image_url": "https://storage.googleapis.com/afs-prod/media/41819ea7472241f59331db0bfbdcb7ae/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5db69d8fadb550969c0135e80b9362c1_1588626437.html", "title": "Canadian actress and activist Shirley Douglas dies at age 86", "title_page": "Canadian actress and activist Shirley Douglas dies at age 86", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE -In a Feb. 23, 2013 file photo, Shirley Douglas poses with her children Kiefer Sutherland and Rachel Sutherland after she received the ACTRA Toronto Award of Excellence at the 11th annual ACTRA awards in Toronto. Shirley Douglas, the impassioned Canadian activist and veteran actress who was mother to actor Kiefer Sutherland and daughter of medicare founder Tommy Douglas, has died at age 86. Sutherland announced his mother’s death on Twitter Sunday, April 5, 2020, saying she succumbed to complications surrounding pneumonia. (Galit RodanThe Canadian Press via AP, File)\nFILE -In a Feb. 23, 2013 file photo, Shirley Douglas poses with her children Kiefer Sutherland and Rachel Sutherland after she received the ACTRA Toronto Award of Excellence at the 11th annual ACTRA awards in Toronto. Shirley Douglas, the impassioned Canadian activist and veteran actress who was mother to actor Kiefer Sutherland and daughter of medicare founder Tommy Douglas, has died at age 86. Sutherland announced his mother’s death on Twitter Sunday, April 5, 2020, saying she succumbed to complications surrounding pneumonia. (Galit RodanThe Canadian Press via AP, File)\nTORONTO (AP) — Shirley Douglas, the impassioned Canadian activist and veteran actress who was mother to actor Kiefer Sutherland and daughter of Canada medicare founder Tommy Douglas, died Sunday. She was 86.\nSutherland announced his mother’s death on Twitter, saying she succumbed to complications surrounding pneumonia. He said it was not related COVID-19.\n“My mother was an extraordinary woman who led an extraordinary life,” said Sutherland. “Sadly she had been battling for her health for quite some time and we, as a family, knew this day was coming.”\nA native of Weyburn, Saskatchewan, Douglas worked with directors including Stanley Kubrick (“Lolita”) and David Cronenberg (“Dead Ringers”), and she won a Gemini Award for her performance in the 1999 TV film “Shadow Lake.”\nShe tirelessly supported a variety of causes throughout her life, including the civil rights movement, the Black Panthers and the fight to save Canada’s public health care, pioneered by her politician father.\nIn 1965, Douglas married Canadian actor Donald Sutherland, with whom she had two children before they divorced — twins Rachel, a production manager, and Kiefer, who became a film and TV star in his own right.\nDouglas had another son, Thomas, from a previous marriage.\nBorn on April 2, 1934, Douglas showed an early interest in the arts as well as politics as she journeyed on the campaign trail with her father, who became premier of Saskatchewan, a national leader in the New Democratic Party and a socialist icon.\nShe attended the Banff School of Fine Arts and went on to study at the Royal Academy of Dramatic Art in England, where she acted in theater and TV and participated in anti-nuclear marches.\nIn the ’60s and ’70s, while living in California, Douglas campaigned against the Vietnam War and protested for various causes.\nShe helped to establish a fundraising group called Friends of the Black Panthers. Her support for the group brought controversy — she was refused a U.S. work permit and charged in 1969 with conspiracy to possess unregistered explosives. The courts eventually dismissed the case and exonerated her.\nShe also was a co-founder of the first chapter in Canada of the Performing Artists for Nuclear Disarmament.\nDouglas, though, was foremost a champion for Canada’s medicare system. She would speak of the importance of a universal health care system at virtually any opportunity and lobbied government officials.\nDouglas, who had lived in Toronto since 1977, was nominated for two other Canadian arts Geminis: in 1998 for her leading role in the series “Wind at My Back” and in 1993 for starring in the film “Passage of the Heart.” She was also an Officer of the Order of Canada, one of the country’s highest honors, and an inductee into Canada’s Walk of Fame.", "url": "https://apnews.com/5db69d8fadb550969c0135e80b9362c1"}