{"authors": ["Gregory Wallace"], "date_download": "2020-05-04 16:17:27", "date_modify": "2020-05-04 16:17:27", "date_publish": "2020-04-03 19:53:33", "description": "Federal officials on Friday ordered airlines to reimburse customers for canceled flights, saying a growing number of passengers are complaining amid the coronavirus pandemic that airlines are providing travel credits rather than refunds.", "filename": "2020_04_03_politics_airlines-canceled-flights-refunds_index_1588609047.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200312101649-02-airline-industry-coronavirus-impact-0306-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_airlines-canceled-flights-refunds_index_1588609047.html", "title": "Feds direct airlines to refund passengers for canceled flights", "title_page": "Feds direct airlines to refund passengers for canceled flights - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Federal officials on Friday ordered airlines to reimburse customers for canceled flights, saying a growing number of passengers are complaining amid the coronavirus pandemic that airlines are providing travel credits rather than refunds.\nThe US Department of Transportation did not say how many claims it has substantiated, but it did direct carriers in an enforcement notice \"that passengers should be refunded promptly when their scheduled flights are cancelled or significantly delayed.\"\nThe government said it would \"exercise its prosecutorial discretion\" and allow airlines time to contact customers, update policies and properly train staff.\n\"The Department is receiving an increasing number of complaints and inquiries from ticketed passengers, including many with non-refundable tickets, who describe having been denied refunds for flights that were cancelled or significantly delayed,\" the notice read.\nCustomers are allowed to receive a refund when airlines cancel or significantly delay flights. The requirements also apply when government restrictions prohibit flying, the notice said.\nRead More", "url": "https://www.cnn.com/2020/04/03/politics/airlines-canceled-flights-refunds/index.html"}