{"authors": ["Susan Haigh", "Chris Ehrmann"], "date_download": "2020-05-04 20:26:49", "date_modify": "2020-05-04 20:26:49", "date_publish": "2020-04-20 14:52:25", "description": "HARTFORD, Conn. (AP) — Connecticut has teamed up with a group of scientists from Massachusetts Institute of Technology, Harvard University and other research institutions who've created a new app...", "filename": "_996e07511b2b045d2b73a9501fc551b8_1588624009.html", "image_url": "https://storage.googleapis.com/afs-prod/media/455cae0e88dc4aa5a9da842754115cc4/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_996e07511b2b045d2b73a9501fc551b8_1588624009.html", "title": "Connecticut teams up with app designers to gauge COVID cases", "title_page": "Connecticut teams up with app designers to gauge COVID cases", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A protective face shield frame is created on a 3-D printer set up in the building previously occupied by Hop Knot craft beer and pretzel bar in Southington, Conn. Friday, April 17, 2020. (Dave Zajac/Record-Journal via AP)\nA protective face shield frame is created on a 3-D printer set up in the building previously occupied by Hop Knot craft beer and pretzel bar in Southington, Conn. Friday, April 17, 2020. (Dave Zajac/Record-Journal via AP)\nHARTFORD, Conn. (AP) — Connecticut has teamed up with a group of scientists from Massachusetts Institute of Technology, Harvard University and other research institutions who’ve created a new app that will provide more information about the spread of COVID-19 as officials prepare to eventually reopen the state.\nGov. Ned Lamont said Connecticut is the first state to officially partner with the developers of the HowWeFeel.org app, which enables residents to report daily about how they’re feeling and their symptoms. He encouraged people to download the app, noting it does not require logging in or sharing any personal information, such as name or email address.\nIt’s one of several ways the state plans to use technology to help inform officials on how and when to slowly restart parts of society. For example, Lamont said the state has received 3,500 “smart thermometers” that will upload data about residents’ temperatures to a cloud-based system.\n“So along with HowWeFeel, we’re going to have a temperature map about what’s going on in the state of Connecticut. We’ll see where those symptoms are maybe moving a little bit,” he said, adding how such information will help identify the next hot spots for the coronavirus in the state and across the U.S. Lamont said such information could be useful to determine whether the uptick of infections in the Boston area has spread to eastern Connecticut. Meanwhile, the state has also ordered tens of thousands of fever detectors to help employers determine if workers are healthy enough to return to their jobs.\nThe free HowWeFeel.org app was launched nationally two weeks ago and there are already 300,000 users, about 3,500 in Connecticut, said Feng Zhang, a professor of neuroscience at MIT who worked on the project.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness or death.\nIn other coronavirus developments around Connecticut:\n___\nLamont noted there was a two-day decrease in the number of people hospitalized with COVID-19 in Connecticut over the weekend, calling it a promising sign. But the Democrat said people still need to keep up social distancing and noted infections are still accelerating in the Hartford area.\nOn Monday, protesters drove more than 50 cars and trucks around the state Capitol building in Hartford to protest the governor’s stay-at-home orders. They waved American flags, banners supporting President Donald Trump and signs that read “security - freedom = prison” and “1127 dead but please don’t tread.”\nLamont said he understood people’s frustration, but suggested they consider the fact patients are struggling with the coronavirus in Connecticut’s intensive care units around the state and the “pain and hurt and fatalities that can result from this pandemic.”\nStatewide, more than 19,800 residents have tested positive for the virus and 1,331 have died. Lamont said the increase of 204 deaths since Sunday was largely attributed to changes in how the U.S. Centers for Disease Control has defined COVID-19-positive cases and fatalities.\n___\nWORKERS’ COMPENSATION\nLabor leaders, state legislators and workers on Monday urged Lamont to sign an executive order that automatically presumes an infected worker contracted COVID-19 on the job, making them eligible for workers’ compensation benefits quickly and preventing the employee from having to go through a protracted appeals process.\n“These essential workers have no other exposure to COVID-19 except on the job,” said Sal Luciano, president of the Connecticut AFL-CIO, during an online news conference. “Creating the presumption will streamline their access to vital benefits. These workers are literally risking their lives for their communities.”\nWorkers’ compensation benefits include medical expenses and replacements of lost wages.\nLamont said he will consider the idea.\nLabor leaders said more than a half dozen states have so far enacted “presumptive eligibility” rules for workers’ compensation benefits during the pandemic, through executive orders or legislative action.\nIn many of those states, the presumption remains in place during a governor’s order requiring only employees determined to be essential to go in to work.\nJoe Jarmie, a meat cutter at the Stop and Shop supermarket in East Haven, said he worries about contracting the virus, even though Lamont has signed an order requiring anyone to wear a face mask in a public place if they can’t maintain a safe social distance of about 6 feet.\n“I know if I get sick, I most likely contracted this COVID disease at work,” he said. “It’s not easy at work. People aren’t getting the social distancing part of this whole crisis.”\nJarmie said he often walks around the supermarket holding his breath, upon advice of his doctor, to help guard against possible infection from shoppers who don’t wear masks or who get too close.\n“Everyone is worried about getting sick,” he said of his co-workers. “But if we knew that workman’s comp will cover us, that would alleviate a lot of the financial worries for us.”\nJoy Avallone, general counsel for the Insurance Association of Connecticut, said the state’s workers’ compensation system is “well-equipped to process their claims in an expedient and appropriate manner.”\n__\nAssociated Press Writer Dave Collins contributed to this report.\nEhrmann is a corps member for Report for America, a nonprofit organization that supports local news coverage, in a partnership with The Associated Press for Connecticut. The AP is solely responsible for all content.", "url": "https://apnews.com/996e07511b2b045d2b73a9501fc551b8"}