{"authors": ["Marianne Garvey"], "date_download": "2020-05-04 16:23:38", "date_modify": "2020-05-04 16:23:38", "date_publish": "2020-04-06 15:52:56", "description": "\"The Dark Knight Rises\" actor Jay Benedict has died from the coronavirus, his management team announced.", "filename": "2020_04_06_entertainment_jay-benedict-coronavirus_index_1588609418.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406113356-jay-benedict-obit-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_entertainment_jay-benedict-coronavirus_index_1588609418.html", "title": "Jay Benedict, 'The Dark Knight Rises actor, dies from coronavirus", "title_page": "Jay Benedict, 'The Dark Knight Rises actor, dies from coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) \"The Dark Knight Rises\" actor Jay Benedict has died from the coronavirus, his management team announced.\n\"It is with great sadness that we announce the passing of our dear client Jay Benedict, who this afternoon lost his battle with COVID-19. Our thoughts are with his family,\" the company account tweeted Saturday.\nIt is with great sadness that we announce the passing of our dear client Jay Benedict, who this afternoon lost his battle with COVID-19. Our thoughts are with his family ❤️ — TCG ArtistManagement (@TCGArtist) April 4, 2020\nBenedict also acted in \"Aliens\" and the long-running UK series \"Emmerdale.\"\nHis \"Emmerdale\" co-star Vicki Michelle paid tribute in a tweet.\nShocked to hear one of our most brilliant actors and kind lovely man Jay Benedict has passed. Married to my lovely friend Phoebe Scholfield #AlloAllo My heart goes out to her and her family at this sad time #PhoebeScholfield @FreddieBenedict #LeoBenedict #SyncorSwim #COVID19 pic.twitter.com/YJ7nn25ftv — Vicki Michelle (@vickimichelle) April 5, 2020\n\"Shocked to hear one of our most brilliant actors and kind lovely man Jay Benedict has passed. Married to my lovely friend Phoebe Scholfield. My heart goes out to her and her family at this sad time,\" she tweeted.", "url": "https://www.cnn.com/2020/04/06/entertainment/jay-benedict-coronavirus/index.html"}