{"authors": ["Opinion John Avlon"], "date_download": "2020-05-04 16:01:56", "date_modify": "2020-05-04 16:01:56", "date_publish": "2020-04-01 17:20:24", "description": "Hype and hate won't stop this virus. Denial didn't work when the President tried it. And attacking Democratic governors won't help the country heal either, writes John Avlon", "filename": "2020_04_01_opinions_trump-c_cfcb8082fa1678a4ba44b58d8a118dfb_index_1588608116.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331203235-donald-trump-march-31-2020-01-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_opinions_trump-c_cfcb8082fa1678a4ba44b58d8a118dfb_index_1588608116.html", "title": "Trump says he's a cheerleader for USA. We need a quarterback", "title_page": "Trump says he's a cheerleader for USA. We need a quarterback (opinion)  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "John Avlon is a senior political analyst at CNN. The opinions expressed in this commentary are his own. View more opinion on CNN.\n(CNN) \"I'm a cheerleader for the country,\" President Donald Trump said in his final coronavirus press conference in March — a month in which the US death toll increased from two to more than 4,000 .\nIt was a rare moment of honesty in a press conference typically full of falsehoods . Trump has always been a cheerleader — a hype man, a master marketer of himself which he parlayed into hyperpartisan politics and the presidency.\nBut, with apologies to cheerleaders, Trump is confronting a crisis he can't hype his way out of. He is standing on the sidelines, out of his depth and now we're all paying the price.\nWhat we need in the presidency right now is a quarterback — someone who calmly calls strategic plays under intense pressure.\nInstead, we have Donald Trump. And his instincts are perfectly wrong for a pandemic.\nPandemics don't care about partisan politics. But Trump definitely does. And so we've seen a politicized and often petty response to the crisis from the President, despite having some of the best scientific experts, Dr. Anthony Fauci and Dr. Debbie Birx, on his team.\nWe've seen the President diss Democratic governors in the hardest-hit states — from New York to Washington to Michigan, saying \"when they disrespect me, they're disrespecting our government.\"\nSomeone should remind him that to get respect you've got to give respect.\nBut now we may be seeing that reflexive partisanship trickling down to the delivery of critical medical supplies at a time when body bags are building up around our hospitals.\nPresident Trump's adopted home of Florida — a critical swing state in the upcoming election with a Republican governor — has somehow speedily received 100% of its requested medical supplies like 430,000 surgical masks and 180,000 N95 respirators. That's great for Florida, which is scrambling amid rising cases after resisting social distancing efforts\nBut somehow Massachusetts has only received 17% of what it requested — according to an analysis by the Washington Post — while Illinois Gov. J. B. Pritzker told CNN's Chris Cuomo that his state has only received 10% of what it requested, which could cause serious shortages as soon as next week.\nThis is all coming as the administration is warning to expect deaths to rise sharply in the coming weeks, with President Trump even trying to spin fatalities under 100,000 as evidence they had done \" a very good job. \" Seriously.\nWe're going to have to come up with a better phrase than moving the \"goal posts,\" as the Washington Post called it , to cover such a ghoulish shift in position from a president who just weeks ago was assuring American's the coronavirus was totally \"under control\" and would \"miraculously\" disappear in April.\nWell, it's now April — and America has more cases of coronavirus than anywhere in the world. This is surely not what he meant by America first.\nThere is a grim, growing awareness — even acknowledged by the President — that things are going to get much, much worse in the coming weeks.\nStill, we've heard the President persist with his lies about readily available coronavirus tests against all evidence. He's repeatedly attacked the media for asking tough but totally fair questions about his handling of the crisis and bragged about his ratings . This isn't reality TV anymore, Mr. President: ratings don't matter; results do.\nLately he's taken to saying that no one knew that coronavirus would be so contagious. Everybody knew except, apparently, the President. But Trump's talking points filtered down through partisan media and became a deadly form of misinformation, leading to a stark partisan gap on how seriously people were taking coronavirus in mid-March.\nIt wasn't that long ago that we heard absurd attempts to rationalize the projected death toll from folks like Wisconsin Sen. Ron Johnson who told his home state paper, the Milwaukee Journal-Sentinel, that \"getting coronavirus is not a death sentence except for maybe no more than 3.4% of our population (and) I think probably far less\" and added, \"we don't shut down our economy because tens of thousands of people die on the highways.\"\nFor the record, 3.4% of the current US population is 11.2 million. That's almost twice the population of Wisconsin. Luckily, it does appear that the fatality rate for coronavirus is far less than 3.4% — but that doesn't mean we should dismiss the deaths that are coming as acceptable collateral damage.\nThe understandable impulse to protect the economy from total free fall has led the Trump administration to embrace multitrillion-dollar bailouts and stimulus of the kind that many on the right attacked during the Bush and Obama response to the financial crisis. According to an administration official cited by the Wall Street Journal , Trump wants to further politicize the bailout by putting his name on all the checks that will be sent out. But political self-interest seems to have trumped any alleged fiscal conservative principles in the Republican Party long ago. Deficits and debt won't be discussed until there is a Democratic president.\nBut they can't completely quit their impulse to own the libs by blaming the Obama administration for their testing and medical equipment fiascos while refusing to open Obamacare insurance exchanges for the rocketing number of new unemployed folks, according to new CNN reporting\nWe know that the Trump Justice Department is backing a lawsuit to destroy what's left of Obamacare (even though they'd rather wait for a final judgment until after the election) . Give the current crisis, blocking people from getting access to open enrollment health care exchanges is petty and cruel.\nBut with the gravity of the crisis taking hold inside Trumpland, it's the political impact of the pandemic that seems to be grabbing attention. According to the Los Angeles Times , \"One former White House official said Trump's reelection campaign advisers are terrified that the coronavirus outbreak, which so far has hit largely Democratic coastal cities hardest, will soon scythe across the rural areas that remain deeply loyal to Trump.\"\nThis is what happens to your brain on hyperpartisanship: Even pandemics are seen through a red state vs. blue state prism. It's a different kind of sickness that we don't have a cure for yet. But that doesn't mean we should think it's normal. It's not.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nHype and hate won't stop this virus. Denial didn't work when President Trump tried it. And attacking Democratic governors won't help the country heal either.\nThe coronavirus crisis reveals how stupid and self-defeating, hyperpartisan politics is when it comes to actually governing. If ever there was a time for nonideological problem solving and empathetic leadership, this is it. But we're in a crisis, stuck with the president we've got — and the costs will soon be clear to all of us.", "url": "https://www.cnn.com/2020/04/01/opinions/trump-coronavirus-hyper-partisan-opinion-avlon/index.html"}