{"authors": ["Senior Reporter", "Polling Editor"], "date_download": "2020-05-04 20:27:00", "date_modify": "2020-05-04 20:27:00", "date_publish": "2020-04-28 21:35:20", "description": "Most Republicans also think Trump supports stay-at-home orders, a new survey finds.", "filename": "entry_poll-partisanship-coronavirus-stay-at-home_n_5ea88432c5b6e50adaf4b8dc_1588624020.html", "image_url": "https://img.huffingtonpost.com/asset/5ea895fb2200008f0c827d1b.jpeg?cache=lsrv81yoq1&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_poll-partisanship-coronavirus-stay-at-home_n_5ea88432c5b6e50adaf4b8dc_1588624020.html", "title": "Democrats Think Republicans Oppose Stay-At-Home Orders. Most Republicans Don't.", "title_page": "Democrats Think Republicans Oppose Stay-At-Home Orders. Most Republicans Don't. | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Americans’ desire for a robust coronavirus response has, so far, managed to at least partially transcend political polarization. Although there are significant partisan divides, a majority of both Democrats and Republicans continue to support state-level “stay-at-home” orders.\nThat’s remained true over the past few weeks, even as President Donald Trump’s messages to the public have ricocheted between support for such orders and calls to “liberate” states with Democratic governors who have imposed them. In a new HuffPost/YouGov survey, 82% of Democrats and 69% of Republicans say it’s the right decision for state governments to tell residents to stay at home unless they have an essential reason for going out.\nMembers of the public often take cues about policy preferences from their party leaders. But in this case, the poll suggests, Republicans may have largely tuned out the president’s more inflammatory messaging. While Democrats believe Trump and his party are itching to open the country, most Republicans say they see support for continued coronavirus restrictions as the mainstream view of the GOP.\n“Overall, there seems to be a lot of projection going on,” said Shana Kushner Gadarian, a political scientist at Syracuse University who’s studied the intersection of partisanship and the response to the coronavirus. “Normally, I think that people take cues from the president but since his messaging has been relatively muddled ... people seem to be filling in their preferred position for his.”\nA 69% majority of Republicans, the survey finds, say they believe Trump thinks states with stay-at-home orders are making the right decision. Only about one-quarter of Democrats believe Trump favors such orders. (The poll, conducted last Thursday through Saturday, came prior to the news conference this week in which Trump continued to express support for some measures underway to reopen the country.)\nAriel Edwards-Levy/HuffPost Results of a HuffPost/YouGov poll on partisanship and coronavirus, taken April 23-25, 2020.\nAn overwhelming 85% of Republicans say that Trump is taking the coronavirus outbreak at least as seriously ― if not more seriously ― than they personally are. A more modest 55% say his message has been consistent, with one-third saying it’s changed at times. By contrast, 80% of Democrats say that Trump has changed his messaging on coronavirus, and only 19% say that the president is taking the outbreak as least as seriously as they are.\nThis mismatch in perception goes beyond the White House. Most Democrats believe that state stay-at-home orders have little GOP support. But a 64% majority of Republicans polled believe that most or almost all other Republicans support such orders.\nAriel Edwards-Levy/HuffPost Results of a HuffPost/YouGov poll on partisanship and coronavirus, taken April 23-25, 2020.\nSurveys like this one carry something of an innate chicken-or-the-egg factor. The results can’t tell us, for instance, whether Americans are more likely to support stay-at-home orders because they believe that position puts them in line with the rest of their party, or whether their own support for such measures instead makes them more apt to believe (or to tell pollsters they believe) that their political compatriots feel similarly. Either way, most Democrats and Republicans continue to think ― correctly ― that support for some restrictions remains the consensus view of their party.\nUse the widget below to further explore the results of the HuffPost/YouGov survey, using the menu at the top to select survey questions and the buttons at the bottom to filter the data by subgroups:\nThe HuffPost/YouGov poll consisted of 1,000 completed interviews conducted April 23-25 among U.S. adults, using a sample selected from YouGov’s opt-in online panel to match the demographics and other characteristics of the adult U.S. population.\nHuffPost has teamed up with YouGov to conduct daily opinion polls. You can learn more about this project and take part in YouGov’s nationally representative opinion polling. More details on the polls’ methodology are available here.\nMost surveys report a margin of error that represents some but not all potential survey errors. YouGov’s reports include a model-based margin of error, which rests on a specific set of statistical assumptions about the selected sample rather than the standard methodology for random probability sampling. If these assumptions are wrong, the model-based margin of error may also be inaccurate.\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/poll-partisanship-coronavirus-stay-at-home_n_5ea88432c5b6e50adaf4b8dc"}