{"authors": ["Caroline Kelly"], "date_download": "2020-05-04 16:24:08", "date_modify": "2020-05-04 16:24:08", "date_publish": "2020-04-06 21:51:51", "description": "An Oklahoma federal judge blocked a state executive order on Monday limiting abortion access during the ongoing coronavirus pandemic -- a win for abortion rights advocates who have challenged similar orders with mixed results.", "filename": "2020_04_06_politics_oklahoma-abortion-block-coronavirus_index_1588609448.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200305160614-11-week-in-photos-0306-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_oklahoma-abortion-block-coronavirus_index_1588609448.html", "title": "Oklahoma judge blocks state order restricting abortion during coronavirus outbreak", "title_page": "Oklahoma judge blocks state order restricting abortion during coronavirus outbreak - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) An Oklahoma federal judge blocked a state executive order on Monday limiting abortion access during the ongoing coronavirus pandemic -- a win for abortion rights advocates who have challenged similar orders with mixed results.\nUS District Judge Charles Goodwin wrote \"that while the current public health emergency allows the State of Oklahoma to impose some of the cited measures delaying abortion procedures, it has acted in an 'unreasonable,' 'arbitrary,' and 'oppressive' way -- and imposed an 'undue burden' on abortion access -- in imposing requirements that effectively deny a right of access to abortion.\"\nSeveral states' officials opted to include elective abortions in limiting medical procedures during the coronavirus outbreak, pointing to the need to conserve personal protective equipment, while abortion rights supporters have disparaged the move as politically motivated.\nMany of the court battles have a potentially long future ahead of them. Federal judges in Texas, Ohio and Alabama moved last week to block those states' orders limiting elective abortions. While an appeals court then reversed course and temporarily allowed the Texas order to go into effect , another appeals court on Monday affirmed the lower court's ruling blocking Ohio's order.\nIn Oklahoma, Republican Gov. Kevin Stitt issued an executive order in March that he later confirmed applied to \"any type of abortion services\" that are not a medical emergency or necessary to \"prevent serious health risks\" to the woman.\nRead More", "url": "https://www.cnn.com/2020/04/06/politics/oklahoma-abortion-block-coronavirus/index.html"}