{"authors": ["Maeve Reston"], "date_download": "2020-05-04 16:57:10", "date_modify": "2020-05-04 16:57:10", "date_publish": "2020-04-09 14:01:00", "description": "Los Angeles Schools Superintendent Austin Beutner faces a persistent new worry each day that the coronavirus pandemic drags on. In a school district where 80% of the children live in poverty, thousands of students have no access to the Internet or devices at home.", "filename": "2020_04_09_politics_digital-divide-education-coronavirus_index_1588611430.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409092910-online-school-0320-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_digital-divide-education-coronavirus_index_1588611430.html", "title": "Pandemic underscores digital divide facing students and educators", "title_page": "Pandemic underscores digital divide facing students and educators - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Los Angeles Schools Superintendent Austin Beutner faces a persistent new worry each day that the coronavirus pandemic drags on. In a school district where 80% of the children live in poverty, thousands of students have no access to the Internet or devices at home.\nSome of them have simply dropped off the map since schools closed on March 16 as their peers continue their studies through distance learning. The school district is now engaged in an intensive effort to get them all online at a time of social isolation when normal tools—like attendance walks—simply aren't available to district officials.\n\"We're not dealing with an affluent community in a private school, so the foundation wasn't laid over the last decade\" to get students online, said Beutner in an interview, estimating that about 68% of the district's students were connected on any normal day before the pandemic.\n\"It's like flying a plane at 30,000 feet while changing the seats and a bit of the wiring in the midst of a thunderstorm while you're low on fuel,\" he said.\nPoor attendance is one of the myriad of problems educators are facing across the country as they try to adjust to the reality that many K-12 schools are likely to be out of session for months. The disparity in connectivity between poor and wealthy households -- as well as rural vs. urban households -- has put a brighter spotlight on America's continuing digital divide more now than any time in recent history.\nSome congressional lawmakers are advocating for ramping up funding to help expand broadband in a future coronavirus stimulus package, but it is unclear whether that will happen or even when the next major aid package will move through Congress as Republicans and Democrats clash over the size and scope of the legislation\nMeanwhile, education experts worry that lower-income students with inadequate Internet access or without functional devices are already falling behind their peers, unable to connect virtually with their teachers, do research online or collaborate with their classmates on assignments. In this new world of social isolation, the effectiveness of transitioning from the classroom to distance learning varies widely from district to district across the country, and hinges on the amount of public funding available per student, how it is being spent as well as the availability of internet connections in rural areas.\nSome of the biggest gaps in connectivity exist in rural areas, and estimates vary widely about how many Americans lack a high-speed Internet connection. The Federal Communications Commission estimated that 21 million Americans lacked access to broadband in 2019 — the majority of them in rural areas. But a group of Microsoft researchers concluded in 2018 that about 162 million Americans were not using the Internet at broadband speeds.\nMany technology experts dispute the FCC's figures because the agency calculates its number by surveying broadband providers to determine whether they provide service within a given census block. Though the FCC has been working on improving its methodology, if one home on a given census block had service in 2019, the agency would categorize the entire census block as being \"served.\"\nThat meant that if one home had high-speed Internet on a given street, but the surrounding apartment buildings did not, the block would still be counted as having access to service. (Census blocks range from an area of that is one-tenth of a square mile to the largest in Alaska, which is more than 8,500 square miles).\nThe cost of installing fiber optic cable also remains an exorbitantly costly hurdle, particularly in rural areas. (The Boston Consulting Group estimated that it would cost between $8 billion and $12 billion to provide broadband access to all underserved rural Americans through a mix of technologies in a 2018 analysis).\nBeyond geography, economically-disadvantaged students face bigger hurdles in completing their assignments online. Last May, the Pew Research Center found that 44% of adults in households making less than $30,000 annually do not have a high-speed Internet connection\nThat lack of connectivity can have a huge impact on student achievement. Pew found that the \"homework gap\" -- the lack of a reliable Internet connection to do homework -- was more pronounced among black, Hispanic and lower-income families. Even before the coronavirus pandemic, about 17% of teens between the ages of 13 and 17 said they were often (or sometimes) unable to finish homework assignments because of the lack of a connection or a computer, according to a Pew survey.\nA recent study by Michigan State University's Quello Center, found that Michigan students without high-speed Internet access have lower overall grade point averages than their peers. They are less likely to spend time on homework; they perform worse on standardized tests; and are less likely to plan to attend college.\n\"The digital divide is not a new problem, but the pandemic is showing us how acute the digital divide is,\" said Kathryn de Wit, manager of the Broadband Research Initiative , which is part of the Pew Charitable Trusts. \"It's not just because everybody is doing their work at home and learning from home. It's because those community institutions—your schools, your libraries, your community centers that usually act as your second-best solution, as the stop gap for not having access at home—those are all closed. So what do you do when your backup just isn't available?\"\nFCC Chairman Ajit Pai recently announced that more than 650 broadband and telephone service providers agreed to take his \"Keep Americans Connected Pledge,\" promising not to cut off customers whose lives have been disrupted by the pandemic while opening their WiFi hotspots to anyone who needs them.\nDe Wit noted that that FCC, which gives E-Rate funding to schools and libraries to provide Internet access, also told those sites they could keep their Internet connection running during the pandemic for community members even if the physical buildings are closed.\n\"Mobile hotspots, WiFi on school buses where they're parked in parking lots—these are all temporary solutions. They are band-aids that are needed to make sure kids in particular can do their school work, but it doesn't actually solve that residential connectivity problem,\" de Wit said. \"That residential connectivity problem, it's going to take time to solve. So we need to be having that conversation now.\"\nTo try to serve students in these extraordinary times, Shirley Bloomfield, the CEO of NTCA-The Rural Broadband Association, noted that nearly half of the 850 independent community-based broadband providers that she represents, have taken the FCC's pledge\nSome rural providers, she said, are providing broadband in a box to households through the end of the school year, even if the parents have never signed up for service. Other small companies are increasing connection speed and creating new hotspots in rural communities so that parents can park their cars and allow their children to get connected in a socially-distanced setting.\n\"The sad thing is that there are kids across this country that have to do that anyway, even without a pandemic,\" Bloomfield said. \"But I've got tons of companies right now across the country that are amplifying those networks—whether it's outside the library, a community center or their own office. They're setting those up now so kids can go there and actually do their homework.\"\nBig Bend Telephone company in Alpine, Texas, for example, has worked with the local school district to essentially extend the district's network into students' homes using a temporary installation package.\nMGW Telephone company in Staunton, Virginia, has created \"drive-in\" parking spots where parents can pull into the space and help their children connect to the Internet. Rainbow Communications in Everest, Kansas, installed 30 community hotspots for students to access throughout their service area, according to NTCA.\nFinding the most disconnected students\nBut challenges exist even in densely populated areas like Los Angeles, the second-largest school district in the country with nearly 500,000 students who speak 99 languages. The Los Angeles Unified School District has made a $100 million investment to buy devices for students, improve distance-learning training for teachers and address the connectivity gap since it closed schools three weeks ago.\nEarly statistics were alarming. During the first two weeks of coronavirus school closures, Beutner said the district did not make an online connection with about 15,000 of its 120,000 high school students (some 40,000 students were not checking in daily with their teachers).\nBut there are signs of progress as the district races to get devices into the hands of students while working through a partnership with Verizon to provide hotspots to students without Internet at home.\nAbout 96% of high schoolers and 94% middle school students are now connected, according to district estimates. About 59% of the district's elementary students are online, and Beutner hopes to have all of them connected by May as \"devices arrive from supply lines around the world.\"\nBeutner noted that many of the 15,000 high school students who weren't initially connecting struggle with attendance even in ordinary times; among them are the students living in the deepest poverty or the foster care system. Roughly 70,000 students in LAUSD are experiencing some form of homelessness\n\"It's detective work,\" Beutner said, describing the district's efforts to find the students who haven't been signing in and completing their assignments. \"It's phone calls, working together with community organizations, sending a letter, good old snail mail to see if that works.\" Beutner said the district is also working with community and faith-based organizations to put out the message: \"Come back to school, please get connected—this is all available to you and it's free.\" he said.\nThe LA school district also partnered with PBS stations in Southern California before the schools closed to develop student-centered programming that now airs from 7 a.m. to 7 p.m. on weekdays. They invited other school districts to use the content , and officials say it is now being used by districts and PBS affiliates in more than 30 states.\nA scramble for digital devices\nBeyond connectivity, a huge challenge for many school districts is simply obtaining enough devices to lend to students who need them at home.\nNew York City public schools are lending 300,000 Internet-enabled iPads to students, which families can request through a form on the school district's website.\nNew York school district officials said the district is receiving 50,000 iPads per week from Apple, then handing them off to partners at IBM who connect them to the internet and install the necessary software before they are shipped to students.\nDuring the week of March 23, they focused the first shipment of iPads on students living in shelters. In the second week, district officials delivered iPads to students in temporary housing, emergency shelters and foster care, while beginning to increase deliveries to high school students.\nThey are now focused on getting devices out to high school students—who are more adept at independent learning than their younger peers—while prioritizing multilingual students, those with disabilities, and students living in public housing.\n\"We are getting the devices out as fast as we can, and are following processes to make sure our highest-need families get them first,\" district officials said in a statement on their website. (Officials did not return calls requesting information about how many students still lack an Internet connection).\nCalifornia, which was the first state in the nation to enforce a statewide stay-at-home order, has the advantage of being home to some of the largest tech companies in the nation, as partnerships with private companies become increasingly important for school districts to obtain devices.\nOperating on the assumption that schools are unlikely to reopen this year, Gov. Gavin Newsom recently announced a partnership with Google, which will provide 100,000 points of access to improve WiFi and broadband capacity in California for a minimum of three months.\n\"Those 100,000 points will help us substantially address the digital divide issues—the rural issues, the equity issues that are at play,\" Newsom said, adding that Google would also provide thousands of Chromebooks.\nBut, he added, \"We need more Googles.\"", "url": "https://www.cnn.com/2020/04/09/politics/digital-divide-education-coronavirus/index.html"}