{"authors": ["Kent Sepkowitz"], "date_download": "2020-05-04 16:03:30", "date_modify": "2020-05-04 16:03:30", "date_publish": "2020-04-01 11:43:05", "description": "It is now clear that the epidemic has found a foothold not just in coastal cities, but also in mid-sized cities and towns across the country, writes Kent Sepkowitz, where a system held together by ambulances, helicopters, airplanes, goodwill -- and the assumption that there will always be capacity at the next level hospital -- faces a brutal reality.", "filename": "2020_04_01_opinions_what-ha_d1301cb7be5778f2c3f3f8be887a391d_index_1588608210.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401000248-coronavirus-sepkowitz-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_opinions_what-ha_d1301cb7be5778f2c3f3f8be887a391d_index_1588608210.html", "title": "What happens in the 4th wave of the pandemic", "title_page": "What happens in the 4th wave of the Covid-19 pandemic (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Kent Sepkowitz is a CNN medical analyst and a physician and infection control expert at Memorial Sloan Kettering Cancer Center in New York City. The views expressed in this commentary are his own. View more opinion at CNN.\n(CNN) The Covid-19 pandemic is already in its third disruptive wave in the United States. First came a few cases on the West Coast, culminating in the tragic nursing-home outbreak in Washington state. Next, the ongoing health care calamity in New York City, where the shortage of diagnostic tests, protective equipment and ventilators has helped make the crisis almost unthinkably worse.\nThen last week, other large American cities, including Detroit, New Orleans, Chicago and Atlanta, saw the giant wave crash over them. The endless stream of new, very sick patients. The lack of tests, masks, gowns and ventilators.\nThe hope that the outbreak might be just an urban phenomenon seemed plausible for a brief moment. Indeed, last Monday plans for an Easter \"re-opening for business\" were floated, until reality dashed the plan on March 29.\nJUST WATCHED Louisiana officials fearful hospitals will be overwhelmed Replay More Videos ... MUST WATCH Louisiana officials fearful hospitals will be overwhelmed 02:54\nThat reality is the fourth wave of the US epidemic. It is now clear that the epidemic has found a foothold not just in coastal cities, but also in mid-sized cities and towns across the country. Albany, a town in the western part of Georgia, near nothing in particular, was the first to gain attention as the epidemic appeared, possibly spread by people at a funeral. To date, 462 people have been diagnosed in Dougherty County, where Albany is situated, and 18 have died.\nThe outbreak there revealed a likely problem for the next wave of affected areas. Unlike the large cities -- Seattle and New York City among them -- Albany has just one hospital network. It has strained to meet the challenge and marshaled forces from the region. Yet other cities and towns now feeling the early surge of cases may lack specialists, intensive care beds, a cadre of well-trained nurses and a full-time municipal government capable of coordinating a community-wide response.\nShreveport, Louisiana, also is battling an outbreak, as is Bossier City across the Red River. Shreveport has a branch of LSU medical school in the city of about 200,000 and thus far has been able to handle the crisis, though as cases mount, it too will be stretched.\nAcross the Mississippi River sits Jackson, Mississippi, a city of about 170,000 and the state capital.\nJUST WATCHED Watch Trump's evolution on coronavirus response Replay More Videos ... MUST WATCH Watch Trump's evolution on coronavirus response 04:19\nRural areas in states with previously modest infection rates have begun to see cases in unusual settings. In Arkansas, rural Cleburne County -- just 26,000 people in a few small towns -- has seen 61 people diagnosed, many possibly as the result of a church outing. A 25-bed hospital in the county seat of Heber Springs (population about 7,000) has no critical care beds (according to the hospital's website ) although it is part of Baptist Health, a large network of hospitals throughout the South.\nPawnee County, with a population of about 17,000 has a single accredited hospital with 14 beds, Cleveland Area Hospital, designated a critical access hospital. The area is also served by Pawnee Indian Health Center, which does not provide in-patient care, as well as a private, unaccredited hospital.\nThe appearance of so many cases in so many towns points to the next crisis for health care delivery. Hospitals in rural areas generally provide basic emergency and medical-surgical care, then refer more complex patients or those needing higher-tech care to a large city, often one with a medical school. If the large city finds itself overmatched by a certain problem, it will in turn arrange transfer to a regional super-specialty medical center.\nThis system is held together by ambulances, helicopters, airplanes, goodwill -- and the assumption that there will always be capacity at the next level hospital.\nThe Covid-19 pandemic has changed that. A hospital like Cleveland Area Hospital might soon reach out to a medical center in Oklahoma City or Tulsa to transfer a Covid-19 patient in need of ICU care. But the ICUs in those large medical centers will likely soon be full of patients with Covid-19 -- and their outreach to super-specialty institutions in Houston or Dallas will in short order produce the same problem of ICU gridlock.\nFollow CNN Opinion Join us on Twitter and Facebook\nThis may mean that medical personnel at small community hospitals with nowhere else to turn will be left managing critically ill patients using equipment they are not familiar with, all the while worrying that they might catch the infection from the patient.\nAs has been said, the pandemic is revealing the many strengths and weaknesses of the US health care system. It is a tragedy that major cities are overwhelmed -- treating too many patients with too little equipment and protection.\nYet the disruption of the well-established chain of care that goes from community hospital to local major medical center, then to regional super-specialty care may result in the largest tragedy of all.", "url": "https://www.cnn.com/2020/04/01/opinions/what-happens-in-the-4th-wave-of-the-pandemic-sepkowitz/index.html"}