{"authors": ["Liza Featherstone", "Mike Davis", "Peter Frase", "Seth Ackerman", "Terry Miller", "Christian Smalls", "Nicole Aschoff", "Richard Lachmann"], "date_download": "2020-05-04 19:59:44", "date_modify": "2020-05-04 19:59:44", "date_publish": "2020-04-03 00:00:00", "description": null, "filename": "2020_04_amazon-warehouse-workers-coronavirus-pandemic-crisis_1588622384.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/04/03104302/GettyImages-1215765250.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_04_amazon-warehouse-workers-coronavirus-pandemic-crisis_1588622384.html", "title": "How You Can Support Amazon Workers During COVID-19", "title_page": "How You Can Support Amazon Workers During COVID-19", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Like the bodies, Amazon packages just keep piling up all over town. Around a third of all Americans are Amazon Prime members, and coronavirus has rendered us even more dependent on the behemoth retailer. The New York Times reports that the volume of grocery orders through Amazon has been fifty times higher than usual during our coronavirus isolation. Amazon has been one of COVID-19’s major beneficiaries — along with Zoom, of course — as local retailers have either been ordered closed or have seemed increasingly unsafe.\nAs capital tends to do, Amazon has been reaping all the profits and allowing its employees to assume all the risk. Workers say that warehouses have been kept open even as workers test positive for the virus, and that with an extremely stingy sick-leave policy, many Amazon employees have been coming to work with symptoms. Christian Smalls, an assistant manager at an Amazon warehouse in Staten Island, who Meagan Day interviewed at length for Jacobin last week, told me on Sunday night that thirty of his coworkers there had tested positive for the coronavirus.\nHe has been leading his coworkers in walkouts and rallies at the warehouse, demanding that the facility be shut down and sanitized, and all the workers under paid quarantine for two weeks. The company fired Smalls, and a leaked memo of a meeting with Amazon officials revealed that instead of discussing what they were going to do to save workers’ lives, they plotted how to discredit Smalls. The company has repeatedly claimed to the media that Smalls was fired for violating safety measures. Meanwhile, as Smalls points out, more and more people are “at risk of death” due to the company’s inaction. New York state and city government are investigating Amazon’s retaliation against Smalls.\nThe company’s appalling response to coronavirus has led to protests and walkouts by Amazon workers all over the country, from Staten Island to Romulus, Michigan to Kent, Washington. Because American capitalism has taught us to identify so strongly as consumers, seeing this as our primary relationship to capital, our first instinct when we hear about these workers — the outrageous abuse they’re suffering, and their fight for justice — is to boycott the company. Lacking other effective avenues for building or exercising popular power, Americans tend to see shopping as the only leverage we have over Jeff Bezos. Yet our purchasing power over him is limited. It’s difficult to truly bring the pain to a company with such a monopoly, as Dania Rajendra of Athena, a coalition of progressive groups seeking to improve Amazon’s awful labor practices and economic impact, pointed out on Doug Henwood’s show on Jacobin Radio. The Amazon web server is ubiquitous; it’s used by Netflix, Zoom, and Slack, all of which many of us rely on particularly heavily right now. And that’s only one example: for many people, during this pandemic, Amazon is the only way to get necessities like food.\nStill, if you can stop ordering from Amazon, by all means do. “Definitely boycott it,” Christian Smalls told me. “They don’t deserve our money. Why would we give our money to these billionaires who don’t care about us? Absolutely stop shopping Amazon.” Even if your personal choices don’t make a dent in Amazon’s profits, the call to boycott from workers, amplified by customers on the internet, builds solidarity and may at least cause some discomfort at corporate headquarters.\nEven if you can’t boycott, says Rajendra, “don’t order things from Amazon that you don’t really need.” Boycotting nonessential items could help put pressure on Amazon to close nonessential operations. You could spare a few warehouse and delivery workers from possible exposure to COVID-19 by reading that book electronically. Wait until after the pandemic to upgrade your living-room stereo speakers. If you do need something from Amazon, Rajendra says, support your delivery workers: put up an appreciative sign, maybe leave wipes and hand sanitizer outside your door.\nBut our solidarity is bigger than ethical consumerism: we are more than shoppers. With that in mind, there are plenty of other things we can do.\nMost importantly, says Christian Smalls, “Join the fight!” If Amazon workers are holding a strike, walkout, or rally near you, he says, “join them.” Normally we would urge readers to do this by standing side by side on a picket line, holding a sign, or bringing pizza to the picketers. These excellent habits have been rendered impossible by COVID-19, but all is not lost. Says Rajendra, “it is an amazing time to get super creative about what solidarity looks like.” For example, in Chicago, members of the DSA and other community members organized and participated in a car picket, honking in support of Amazon workers rallying for better coronavirus protections. And if you can safely get to such a rally, you can always hold a supportive sign from across the street.\nIf you’re stuck in your home social distancing, as most of us are, Athena has also called for #solidarity selfies: posts on social media of you holding a sign in support of striking Amazon workers.\nAnd as Rajendra jokes, “Who doesn’t love an online petition?” Readers can sign this petition demanding that Amazon close facilities where workers have been exposed to COVID-19, and give all employees paid leave now. Amazon Prime members can also join a Facebook group called Prime Member Solidarity with Amazonians United, which has an open letter and petition making many excellent demands, among them, sick leave for all Amazon workers, hazard pay, and an end to retaliation against protesting workers.\nCOVID-19 offers an opportunity to think past the distinction between consumers and workers: right now, everyone’s health affects everyone else’s. As Dania Rajendra says, “We are really all in this together. And we are going to need this solidarity to fight for the society that we need.”\nWorkers can withdraw their labor. As Amazon spokesman Jay Carney told the New York Times — showing his understanding of how capitalism works, “none of this works without our employees.” Individual members of the public are more limited in our leverage over Amazon, but in addition to supporting the workers, we can pressure our elected officials. Athena has a petition to governors asking them to close Amazon warehouses that fail to protect worker and public health, citing the excellent example of Kentucky’s Democratic governor Andy Beshear, who closed down a nonessential Amazon warehouse while guaranteeing workers full pay. As the Athena statement notes, “other states need to follow his lead.”\nAdds Dania Rajendra: “And please, amazing Jacobin readers, come up with more ideas!”", "url": "https://www.jacobinmag.com/2020/04/amazon-warehouse-workers-coronavirus-pandemic-crisis"}