{"authors": ["Leah Asmelash", "Alisha Ebrahimji"], "date_download": "2020-05-04 17:03:39", "date_modify": "2020-05-04 17:03:39", "date_publish": "2020-04-10 23:15:49", "description": "Being in the hospital for coronavirus is scary enough. Then seeing your doctor or some other health care worker come in with a mask, glasses, hood and all the other protective gear? It can make a tough situation even harder.", "filename": "2020_04_10_us_healthcare-wo_e7be8ae7f69dc67f260ffa8f805d5264_index_1588611819.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410180617-02-healthcare-workers-wearing-photos-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_healthcare-wo_e7be8ae7f69dc67f260ffa8f805d5264_index_1588611819.html", "title": "Health care workers are wearing smiling photos of themselves to put coronavirus patients at ease", "title_page": "Health care workers are wearing smiling photos of themselves to put coronavirus patients at ease - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Being in the hospital for coronavirus is scary enough. Then seeing your doctor or some other health care worker come in with a mask, glasses, hood and all the other protective gear? It can make a tough situation even harder.\nThat's why Robertino Rodriguez, a respiratory therapist at Scripps Mercy Hospital in San Diego, put a laminated photo of his face along with his name on his PPE gear -- an effort to put his patients at ease. He shared his idea on Instagram and has more than 30,000 likes.\n\"Yesterday I felt bad for my patients in ER when I would come in the room with my face covered in PPE,\" Rodriguez wrote in the post. \"A reassuring smile makes a big difference to a scared patient. So today I made a giant laminated badge for my PPE. So my patients can see a reassuring and comforting smile.\"\nRodriguez's idea has inspired other healthcare workers, too.\nDerek DeVault, a nurse in Los Angeles, and some of his coworkers took a cue from Rodriguez. He called the idea \"amazing.\"\nRead More", "url": "https://www.cnn.com/2020/04/10/us/healthcare-workers-photos-smile-coronavirus-trnd/index.html"}