{"authors": [], "date_download": "2020-05-04 20:04:54", "date_modify": "2020-05-04 20:04:54", "date_publish": "2020-04-07 20:27:32", "description": "DURHAM, N.C. (AP) — Duke freshman Cassius Stanley is entering the NBA draft. Stanley announced his decision Tuesday after averaging 12.6 points and 4.9 rebounds for the Blue Devils,...", "filename": "_c172890fb84fa2d0a88709bf37110fc8_1588622694.html", "image_url": "https://storage.googleapis.com/afs-prod/media/a5ad531bc14e48f5a986544f147aae48/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c172890fb84fa2d0a88709bf37110fc8_1588622694.html", "title": "Duke freshman Cassius Stanley declares for NBA draft", "title_page": "Duke freshman Cassius Stanley declares for NBA draft", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "North Carolina State guard Markell Johnson (11) and Duke guard Cassius Stanley (2) chase the ball during the first half of an NCAA college basketball game in Durham, N.C., Monday, March 2, 2020. (AP Photo/Gerry Broome)\nNorth Carolina State guard Markell Johnson (11) and Duke guard Cassius Stanley (2) chase the ball during the first half of an NCAA college basketball game in Durham, N.C., Monday, March 2, 2020. (AP Photo/Gerry Broome)\nDURHAM, N.C. (AP) — Duke freshman Cassius Stanley is entering the NBA draft.\nStanley announced his decision Tuesday after averaging 12.6 points and 4.9 rebounds for the Blue Devils, highlighted by his high-flying athleticism . He had a season-high 24 points in a January loss to Louisville, while he finished strong with 19 points and six rebounds against rival North Carolina in what turned out to be the Blue Devils’ final game once the coronavirus pandemic led to the cancellation of postseason tournaments.\nIn a statement, the 6-foot-6 guard from Los Angeles said he believed the Blue Devils could have attained his goal of reaching the Final Four and contending for a national championship. He said there is a “burning desire” to make another run at a Final Four, but noted: “In evaluating players, the NBA values youth.”\nIn a statement, coach Mike Krzyzewski described Stanley as “an absolute joy to coach.”\n“I’ve seen Cassius grow both as a player and person here at Duke, and I can’t wait to see how his career develops at the next level,” Krzyzewski said.\nStanley joins sophomore point guard Tre Jones as early entrees to the NBA draft from Duke.\n___\nMore AP college basketball: http://apnews.com/Collegebasketball and http://www.twitter.com/AP_Top25", "url": "https://apnews.com/c172890fb84fa2d0a88709bf37110fc8"}