{"authors": ["Por Steve Reed"], "date_download": "2020-05-04 20:28:54", "date_modify": "2020-05-04 20:28:54", "date_publish": "2020-04-07 18:21:12", "description": "CHARLOTTE, Carolina del Norte, EE.UU. (AP) — Cam Newton se siente como un “pez fuera del agua” al entrar en la agencia libre por primera vez en sus nueve años de carrera en la NFL. Durante...", "filename": "_5028998c4af7419284bbc09db96c49ef_1588624134.html", "image_url": "https://storage.googleapis.com/afs-prod/media/84e696d99ea14f7db0ab869e32832c4a/2000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5028998c4af7419284bbc09db96c49ef_1588624134.html", "title": "Newton se siente como pez fuera del agua en la agencia libre", "title_page": "Newton se siente como pez fuera del agua en la agencia libre", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nCHARLOTTE, Carolina del Norte, EE.UU. (AP) — Cam Newton se siente como un “pez fuera del agua” al entrar en la agencia libre por primera vez en sus nueve años de carrera en la NFL.\nDurante una conversación en Instagram Live el lunes con el base del Thunder de Oklahoma City Chris Paul, el quarterback reconoció que quedó resentido tras ser descartado por los Panthers de Carolina.\nNewton no dio ninguna pista sobre el equipo con el que le gustaría firmar contrato.\nEl Jugador Más Valioso de 2015 apenas disputó dos partidos la campaña pasada tras someterse a una cirugía por una fractura de Lisfranc en el pie. También se operó antes de la temporada 2019 debido a un desgarre parcial en el manguito rotador en el hombro derecho.\nDebido a que los jugadores no tienen permitido acudir a las instalaciones de los equipos por la pandemia de coronavirus, el quarterback no ha podido visitar a equipos interesados y realizar pruebas para demostrar que está bien de salud.\n“Hay muchas posibilidades en este momento, pero el hecho de que haya pegado esta situación del coronavirus, no soy una que se queje o nada de eso”, dijo Newton. “Pero al mismo tiempo creo que me he visto afectado de muchas formas y es (desafortunado). Pero al final del día dejaré que las cosas ocurran como tengan que suceder”.\nLos Panthers reemplazaron a Newton con el agente libre Teddy Bridgewater.\nEl gerente general de Carolina Marty Hurney dijo una conferencia telefónica el lunes que dar de baja a Newton fue una decisión increíblemente difícil. Se trató de uno de los cambios que realizó Carolina como parte de una renovación de su plantilla.\n“Tienes que tomar decisiones muy complicadas cada año”, dijo Hurney. “Esta fue probablemente una de las más difíciles. Yo elegí a Newton en el draft. Todos sabemos que lo le dio a la organización dentro y fuera del campo, entonces fue muy difícil”.\nEn cuanto al quarterback de 30 años, ahora se empeña en encontrar un nuevo destino.\n“Nunca he conocido otra cosa que no sean los Panthers de Carolina y ahora es como que quiero que Dios dirija mi camino y me ponga en una posición en la que pueda prosperar y ser yo mismo”, dijo Newton.", "url": "https://apnews.com/5028998c4af7419284bbc09db96c49ef"}