{"authors": ["Melinda Deslatte"], "date_download": "2020-05-04 20:05:11", "date_modify": "2020-05-04 20:05:11", "date_publish": "2020-04-07 16:26:45", "description": "BATON ROUGE, La. (AP) — Louisiana is releasing more information about its coronavirus deaths, showing the virus's victims are disproportionately black and two-thirds of those who have died...", "filename": "_cde897293f88f788d3f3bfdb3d46c466_1588622711.html", "image_url": "https://storage.googleapis.com/afs-prod/media/42af05d5c09f4e7d823f907dcfbc25df/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cde897293f88f788d3f3bfdb3d46c466_1588622711.html", "title": "Louisiana data: Virus hits blacks, people with hypertension", "title_page": "Louisiana data: Virus hits blacks, people with hypertension", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Louisiana Gov. John Bel Edwards talks about a chart as Attorney General Jeff Landry listens, while addressing steps being taken to fight the coronavirus and the status of cases in the state during a press conference at the Governor's Office of Homeland Security & Emergency Management, Monday April 6, 2020, in Baton Rouge, La. (Bill Feig/The Advocate via AP, Pool)\nLouisiana Gov. John Bel Edwards talks about a chart as Attorney General Jeff Landry listens, while addressing steps being taken to fight the coronavirus and the status of cases in the state during a press conference at the Governor's Office of Homeland Security & Emergency Management, Monday April 6, 2020, in Baton Rouge, La. (Bill Feig/The Advocate via AP, Pool)\nBATON ROUGE, La. (AP) — Louisiana is releasing more information about its coronavirus deaths , showing the virus’s victims are disproportionately black and two-thirds of those who have died suffered from high blood pressure.\nThe new data released by Louisiana’s health department, which will be updated weekly, gives a glimpse of who is most at risk of dying from the COVID-19 disease caused by the virus in a state deemed one of the nation’s most unhealthy.\nAlthough African Americans account for one-third of Louisiana’s population, they represent more than 70% of the state’s deaths from COVID-19 caused by the virus, according to the data. Gov. John Bel Edwards called that racial disparity disturbing.\n“We are looking into this further and trying to figure out everything we can about that,” the Democratic governor said Tuesday. “We have a lot more questions than we have answers at this time.”\nDr. Alexander Billioux, assistant secretary of Louisiana’s Office of Public Health, said the disproportionate rate of deaths in the black community is tied to the state’s existing health gap between African Americans and white residents.\n“If you go from a situation as a state where you have significant health disparities and you put something like this on top of it, it’s sad, but it doesn’t surprise me that unfortunately we’re seeing that community be so dramatically affected,” Billioux said.\nEdwards also noted Louisiana’s earliest virus hot spots, particularly the New Orleans area, have a disproportionate number of African Americans living there compared with other parts of the state.\nMore than 16,000 people in Louisiana are confirmed to be infected with the coronavirus, about 12% of whom are hospitalized, according to health department data. The death toll climbed higher Tuesday to 582 people, with 70 new deaths attributed to COVID-19 in the largest single-day increase.\nHypertension is the leading underlying health condition for those who have died from COVID-19 in Louisiana, with more than 66% of the virus’s victims diagnosed with high blood pressure. Nearly 44% of the Louisiana residents who have died were diabetic, 25% had chronic kidney disease, 25% were obese and 23% had heart disease, according to the health department data.\nFor most people, the coronavirus causes symptoms such as high fever and a dry cough that resolve in several weeks. But some, especially older adults and people with existing health problems, can suffer severe symptoms and require respirators to survive.\nBecause Louisiana has higher rates of people with preexisting conditions, the state’s per capita death rate from the virus is one of the nation’s highest, Edwards said.\n“We’ve been reporting for decades, for generations, that we have more chronic health conditions per capita in Louisiana than most states,” Edwards said. “Those underlying health conditions are the very ones that make you most susceptible, most vulnerable to this virus. What you see playing out is something that’s very tragic.”\nHoping to hinder the virus’s spread, Edwards has ordered schools closed, limited restaurants to takeout and delivery and shuttered businesses deemed nonessential such as gyms, hair salons and bars through the end of April.\nThe governor has suggested those efforts to keep people away from others might be starting to decrease new infections in Louisiana. Louisiana’s modeling no longer includes the dire projection that the New Orleans region could run out of ventilators and hospital beds this week.\nThe number of virus patients statewide who needed ventilators fell Tuesday, representing about 26% of those hospitalized with COVID-19, according to the health department. Of the nearly 2,000 virus patients in hospitals, 519 were on ventilators, down from 552 a day earlier.\nBut Edwards cautioned the state’s residents should maintain their physical distancing and continue sheltering at home.\n“If we break out of what we’re doing right now, and too many people go back to living as they would want to and not following social distancing and so forth, I promise you our numbers are going to spike right back up,” the governor said.\nIn the virus’s continuing economic fallout, Winter Circle Productions canceled this year’s Buku Music + Arts Project festival in New Orleans. The event was projected to draw about 17,000 attendees on each of its two days.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/cde897293f88f788d3f3bfdb3d46c466"}