{"authors": ["Bob Christie"], "date_download": "2020-05-04 20:23:44", "date_modify": "2020-05-04 20:23:44", "date_publish": "2020-04-18 00:46:52", "description": "GLENDALE, Ariz. (AP) — A federal judge refused Friday to order Arizona to allow its existing electronic signature-gathering system to be used by backers of citizen initiatives as they try to...", "filename": "_33b712c1ff564db7db4f54c043bbb956_1588623824.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_33b712c1ff564db7db4f54c043bbb956_1588623824.html", "title": "Judge denies request to gather initiative signatures online", "title_page": "Judge denies request to gather initiative signatures online", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GLENDALE, Ariz. (AP) — A federal judge refused Friday to order Arizona to allow its existing electronic signature-gathering system to be used by backers of citizen initiatives as they try to qualify measures for the ballot.\nProponents of two initiatives had urged U.S. District Judge Dominic Lanza to allow them to use the system during the coronavirus outbreak that has made person-to-person signature gathering virtually impossible.\nElected officials can currently collect signatures they need to qualify a measure for the ballot using the secretary of state’s online “E-Qual” system. But initiatives backers are required to collect their qualifying signatures in-person.\nThey said they have been hamstrung by the virus outbreak in collecting signatures they need to get their measures on the November ballot.\nThe federal case was brought by backers of initiatives that would create automatic voter registration and curb big-money election donors and another aimed at ending unexpected medical bills,\nGranting access to the state system was opposed by Republican Attorney General Mark Brnovich and the GOP-controlled state Legislature. Lawyers for Brnovich told Lanza at a Tuesday hearing that 100-year-old Arizona law on initiatives require signatures to be gathered in-person.\nDemocratic Secretary of State Katie Hobbs had supported the request.\nLanza said initiative backers were asking him to overturn a provision in state law, but it’s the Arizona Constitution that directs that petitions must be signed in person, and he refused to do that. He also said they had not shown they had suffered a severe burden, since some initiatives already have enough signatures to qualify and others might if the virus lockdown ends.\n“Although plaintiffs are correct that the COVID-19 pandemic constitutes an ‘extraordinary circumstance’ that has resulted in ‘profound’ dislocations, it is also a profound thing for a federal court to rewrite state election laws that have been in place since the 1910s,” Lanza wrote.\nBrnovich said in a statement that he was defending state law and it is up to the Legislature to make a change if it is needed.\n“We all share a common concern for public safety during this pandemic, but you can’t use a health crisis to disregard our state constitution,” he said.\nBackers of four other initiatives have separately asked the state Supreme Court to order the use of the “E-Qual” system for initiatives. The court has set an expedited briefing schedule and could rule within weeks.\nThe proponents argue there’s no other safe and effective way for them to get their proposals on the ballot.\nThey also contend the requirement for initiative backers to collect signatures in person violates the state Constitution. They say the ability of voters to write their own laws through the initiative process is a fundamental right and the current emergency prevents them from doing that. They face a July 2 deadline to collect nearly 238,000 valid signatures from registered voters.\nBrnovich also is opposing that effort.\nThe four initiatives would legalize recreational marijuana, provide new school revenue by raising taxes on high-earning Arizonans, limit school vouchers and implement criminal justice reform.", "url": "https://apnews.com/33b712c1ff564db7db4f54c043bbb956"}