{"authors": [], "date_download": "2020-05-04 20:26:03", "date_modify": "2020-05-04 20:26:03", "date_publish": "2020-04-07 20:14:34", "description": "MANTEO, N.C. (AP) — This year's performance of the North Carolina-based play “The Lost Colony” has been canceled for the first time since the middle of World War II because of the coronavirus...", "filename": "_227dabf095954bb27b6c34f3f2912a37_1588623963.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_227dabf095954bb27b6c34f3f2912a37_1588623963.html", "title": "'The Lost Colony' canceled for summer due to COVID-19", "title_page": "'The Lost Colony' canceled for summer due to COVID-19", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MANTEO, N.C. (AP) — This year’s performance of the North Carolina-based play “The Lost Colony” has been canceled for the first time since the middle of World War II because of the coronavirus pandemic, the group that runs the play announced Tuesday.\nThe board of directors of the Roanoke Island Historical Association announced on the play’s Facebook page that the cancellation of the 83rd season of Paul Green’s play is the first since 1944.\nIn a March 27 statement on its webpage, play officials had said they were working toward an opening on May 29. But in announcing the cancellation, the board said the association didn’t want to risk the safety of ticket buyers, cast crew, staff and volunteers and determined that canceling the season was best for all involved.\n“These are difficult times and that creates an environment where difficult decisions are required,” RIHA Board Chair Kevin Bradley said in the statement posted to Facebook. “And this certainly was a difficult decision for our Board of Directors to make – but I believe the correct one in light of what our community is facing.”\nRefunds are available for tickets purchased for this year, or the tickets can be applied to 2021 when the play re-opens.", "url": "https://apnews.com/227dabf095954bb27b6c34f3f2912a37"}