{"authors": ["Ralph D. Russo"], "date_download": "2020-05-04 20:22:11", "date_modify": "2020-05-04 20:22:11", "date_publish": "2020-04-20 06:06:36", "description": "College sports programs are already being cut and more are likely on the chopping block. The coronavirus pandemic has triggered fears of an economic meltdown on campuses around the country....", "filename": "_5b8f45baa61d41c6e40508bd216ac267_1588623731.html", "image_url": "https://storage.googleapis.com/afs-prod/media/aed499e587b34945ad553b05faea6be8/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5b8f45baa61d41c6e40508bd216ac267_1588623731.html", "title": "If colleges cut sports programs, could new models emerge?", "title_page": "If colleges cut sports programs, could new models emerge?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this is an April 25, 2018, file photo, NCAA headquarters in Indianapolis is viewed. College sports programs are already being cut and more are likely on the chopping block. The coronavirus pandemic has triggered fears of an economic meltdown on campuses around the country. The cancellation of the NCAA men's basketball tournament cost schools $375 million and more losses are expected, especially if football season is disrupted in the fall. (AP Photo/Darron Cummings, File)\nFILE - In this is an April 25, 2018, file photo, NCAA headquarters in Indianapolis is viewed. College sports programs are already being cut and more are likely on the chopping block. The coronavirus pandemic has triggered fears of an economic meltdown on campuses around the country. The cancellation of the NCAA men's basketball tournament cost schools $375 million and more losses are expected, especially if football season is disrupted in the fall. (AP Photo/Darron Cummings, File)\nCollege sports programs are already being cut and more are likely on the chopping block.\nThe coronavirus pandemic has triggered fears of an economic meltdown on campuses around the country. The cancellation of the NCAA men’s basketball tournament cost schools $375 million and more losses are expected, especially if football season is disrupted in the fall.\nIn tough times, athletic administrators often drop sports programs to save money. In the past few weeks, Old Dominion said it will drop wrestling and Cincinnati will no longer have men’s soccer . Warnings of tough times ahead have come from all over college athletics, even some of the wealthiest Power Five schools.\n“To say it’s not going to have any economic impact — that, I would say, would be grossly naïve,” said Oklahoma athletic director Joe Castiglione, who oversees a program that had $148 million in operating revenue in 2017-18 and boasts of 20 straight years of balanced budgets.\n“We’re just hoping to minimize it,” he said.\nPaving the way for more cuts to come, the commissioners of five Bowl Subdivision conferences have asked the NCAA to waive over the next four years a slew of requirements for Division I membership, including the minimum number (16) of sports a school must sponsor.\nSome observers see the coming crisis as a chance for schools to consider radical changes to how athletic departments are run or for new development paths to emerge for young athletes.\n“Budgets reflect our values,” said Arne Duncan, a former U.S. education secretary and now co-chair of the Knight Commission on Intercollegiate Athletics. “I think we’ll see now whether in a time of cutbacks, what gets prioritized. Is it the interest of adults and unbelievably high salaries? Or is it the interest of student-athletes and preserving their chance to compete and to put academics first?”\nA.J. Maestas, founder of the sports analytics consulting firm Navigate Research, said “a couple hundred” sports programs were cut during the last economic downturn after the 2008 financial crisis. Most programs don’t break even and he expects more cuts this time, too.\n“If donors are unable to step up and endow the program or at least keep it above water there will be a number of programs that will be cut, especially if it’s a sustained economic downturn, which seems pretty realistic,” he said.\nNancy Zimpher, former chancellor of the State University of New York and a member of the Knight Commission, said cutting sports programs is short-sighted at a time when colleges could be facing a decrease in overall enrollment.\nHaving a large variety of sports programs “provides a great recruitment opportunity for the whole university,” she said.\nDavid Ridpath, a former NCAA compliance director and professor of sports business at Ohio University, said he fears schools will use the economic crisis as an excuse to make program cuts they had already been pondering. He also wonders if fewer opportunities for athletes in non-revenue college sports provides a catalyst to sever some of the ties between amateur athletics and higher education in the United States.\nIn his book, “Alternative Models of Sports Development in America,” Ridpath makes the case that the U.S. should move toward a European-style academy system. Elite young athletes develop their games and receive an education, but the two are not tethered the way they are in American colleges.\n“My argument has always been schools should not be a primary source of elite development,” Ridpath said. “We need to have other models for those elite athletes to be taken care of. So for me, it’s not throwing college athletics and high school athletics out the window. It’s reframing it and also making education-based sports more participatory.”\nFormer Big 12 Commissioner Dan Beebe has an even more radical idea: College athletics should be broken into spectator sports (ones that make money) and participation sports (ones that don’t). Schools would provide athletic scholarships in spectator sports, but not in participation sports.\nParticipation sports then would not be subject to NCAA scholarship limits, would not require highly paid, full-time coaches and would play regional opponents, keeping costs down.\nThe scholarship piece of Beebe’s plan might seem extreme, but other parts are very much in line with what Mountain West Commissioner Craig Thompson and others are already thinking.\n“Maybe an institution has sports sponsored in five different conferences, if that makes sense because of geography and other things,” Thompson said. “What we’re trying to do is throw everything at the wall and it might not be a one-size fits all for even the 12 institutions in the Mountain West.”\nBeebe, who now consults schools on crisis management, said he hears from athletic directors running programs with successful football and basketball teams who wonder if funding so many other sports that often lose money makes sense.\n“And the question they have is: There’s so much pressure for me to put so much resources into these sports to continue to sustain this level that it really makes me question why I’m spending half a million dollars or maybe a million dollars on a golf program or a tennis program,” Beebe said. “And that was before this crisis.”\n___\nFollow Ralph D. Russo at https://twitter.com/ralphDrussoAP and https://appodcasts.com/category/ap-top-25-college-football/\n___\nMore AP college football: https://apnews.com/APTop25CollegeFootballPoll and https://apnews.com/Collegefootball and https://twitter.com/AP_Top25", "url": "https://apnews.com/5b8f45baa61d41c6e40508bd216ac267"}