{"authors": ["Arlette Saenz", "Jessica Dean", "Sarah Mucha"], "date_download": "2020-05-04 16:59:16", "date_modify": "2020-05-04 16:59:16", "date_publish": "2020-04-09 13:28:22", "description": "Thirty-three years after launching his first presidential bid, Joe Biden will finally see his name at the top of the Democratic ticket.", "filename": "2020_04_09_politics_biden-campaign-general-election_index_1588611556.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327203603-joe-biden-town-hall-03272020-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_biden-campaign-general-election_index_1588611556.html", "title": "Biden campaign braces for general election: \"This is the beginning of a very difficult race\"", "title_page": "Biden campaign braces for general election: \"This is the beginning of a very difficult race\" - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Thirty-three years after launching his first presidential bid, Joe Biden will finally see his name at the top of the Democratic ticket.\n\"I think it's a great milestone in his life. The fact that he won the nomination is a great accomplishment,\" said former Delaware Sen. Ted Kaufman, a longtime Biden confidant. \"But I think it comes knowing that there are very, very difficult substantive problems and challenges ahead.\"\nAmong the general election tasks at hand for Biden and his team: selecting a running mate , setting up operations in battleground states and uniting the Democratic Party after a grueling primary process.\nThe early stages of the general election are now taking place against the backdrop of the coronavirus pandemic , which has altered life for millions of Americans and completely transformed campaigning. Sidelined from the campaign trail , Biden spends his days receiving briefings about the coronavirus from his public health and economic advisers strategizing with his campaign team over the phone, and broadcasting live from a studio in the basement of his Delaware home. His staff, which has celebrated their victories at campaign headquarters in Philadelphia, is scattered across the country.\n\"These are hard times and I certainly never imagined not being able to hug my teammates on the day we became the nominee,\" tweeted Kate Bedingfield, Biden's deputy campaign manager. \"But for just a second here I want to express pure gratitude to my beloved colleagues who make this journey a joy and an adventure. Onward to November.\"\nSome advisers to Biden expressed a sense of relief after Sanders ended his bid, saying the campaign can now turn its full attention and resources to the general election.\n\"It's a sense of we thought this could happen in June, not April. There's a sense of 'hey we did this,'\" one Biden ally said. \"This was along road. Think about where we were 40 days ago. That's remarkable if you really think about the context of this.\"\nBiden's comeback\nBiden's victory in the Democratic primary marks one of the greatest political comebacks in US history . After waging two failed White House runs during the 1988 and 2008 elections, Biden entered this year's race never having won a presidential primary contest. He then lost the first three states in the 2020 race, outcomes that made many believe his campaign was over.\nBut in late February, Biden started what became an unstoppable turnaround with a decisive victory in South Carolina fueled by his support among African American voters -- a moment that prompted many moderates to coalesce around the former vice president and led to a tidal wave of wins on Super Tuesday days later.\n\"I've been doing this for almost 50 years and I've never seen anything like this. But you know these are things that happen to him -- like the way he got elected in 1972,\" said Kaufman, who joined Biden's staff in his first year as a senator. \"He's had really difficult things happen to him, but he's also had some incredibly positive things happen to him.\"\nAt the age of 29, Biden won a long-shot bid for Delaware's Senate seat against the state's incumbent Republican Sen. Caleb Boggs. But weeks later, tragedy struck when he lost his wife and daughter in a car accident that also injured his two sons. Four decades later, one of those sons, Beau, passed away after a battle with brain cancer.\nDespite the personal tragedy, Biden worked in the US Senate for 36 years and served two terms as vice president with President Obama. He decided against a presidential bid in 2016 but moved forward with his third run for the White House one year ago.\nBracing for the general election\nThe 77-year-old Biden now faces the challenge of uniting the Democratic Party as he prepares for a general election fight against Trump.\nBiden refrained from publicly pressuring Sanders to leave the race, repeatedly saying it was a decision for the senator to make. But as the delegate math moved in his favor several weeks ago, Biden began making overtures to Sanders and his supporters, aware of the need to win over progressive voters to have a united front heading into the general election.\n\"Bernie has done something rare in politics. He hasn't just run a political campaign; he's created a movement. And make no mistake about it, I believe it's a movement that is as powerful today as it was yesterday,\" Biden wrote in a Medium post Wednesday. To Sanders supporters', Biden said, \"I see you, I hear you, and I understand the urgency of what it is we have to get done in this country. I hope you will join us. You are more than welcome. You're needed.\"\nSanders said he plans to remain on the primary ballot in order to amass \"as many delegates as possible,\" in the hopes of \"exerting significant influence over the party platform and other functions\" at the Democratic National Convention. Biden and Sanders most recently spoke on Wednesday, but top advisers for the two candidates, including Anita Dunn and Ron Klain on the Biden side and Faiz Shakir and Jeff Weaver from the Sanders camp, engaged in a series of conference call discussions over the past week, according to a source familiar with the conversations.\nAn adviser to Biden's campaign says the two teams plan to stay engaged on a \"range of topics that would build on Vice President Biden's existing policy proposals and further our shared goals to move the country forward.\"\nTwo substantive policy overtures came Thursday when Biden made commitments to lower the eligibility age for Medicare from 65 to 60 and to forgive student loan debt for low-income and middle-class borrowers who attended public colleges and universities, historically black colleges and universities, and other institutions geared towards students of color. Though the policies don't go as far as Sanders' plans for \"Medicare for All\" or forgiving all student debt, the shift marks a direct appeal to progressive voters.\n\"Senator Sanders and his supporters can take pride in their work in laying the groundwork for these ideas, and I'm proud to adopt them as part of my campaign at this critical moment in responding to the coronavirus crisis,\" Biden said in a statement Thursday.\nThe campaigns are working on a highly-choreographed rollout plan focused on trying to make Sanders supporters more comfortable with Biden, two people familiar with the plan told CNN. The next few days are aimed at this \"transition,\" a time Sanders and Biden advisers see as a critical step in starting to smooth over any lingering tensions between the two campaigns.\nAt some point, Biden is expected to bring aboard visible Sanders supporters in some capacity.\nThe Biden campaign is also working to bring progressive organizations into the fold with Biden advisers Cristóbal Alex, Stef Feldman and Symone Sanders running outreach to progressive groups and leaders.\nOn Wednesday, a coalition of leaders from millennial and generation Z-aligned groups sent an open letter to Biden urging him to embrace many of their platform positions and commit to specific personnel moves on his campaign in order to win support of young voters.\n\"With young people poised to play a critical role deciding the next President, you need to have more young people enthusiastically supporting and campaigning with you to defeat Trump,\" the letter from progressive groups, including Justice Democrats and the Sunrise Movement, says. \"This division must be reconciled so we can unite the party to defeat Trump.\"\nOne overt sign of party unity is likely to come when former President Barack Obama issues his expected endorsement of his former vice president. The timing and choreography of that endorsement is undetermined, but Obama could soon become an active player in the campaign to defeat his successor, President Trump, after waiting for the Democratic primary to settle.\nBiden is also on the brink of officially starting the vetting process for his vice presidential pick. As he works to assemble his team to run the operation, Biden has sought advice from President Obama, who counseled him to select a partner who can balance his traits.\n\"And so I'm going to need a woman vice president who has the capacity, has strengths where I have weaknesses,\" Biden recently told donors of his conversation with Obama.\nBiden has committed to selecting a woman as a running mate and said he wants a partner who is \"simpatico\" with him. He's floated several of his former rivals, including Sen. Kamala Harris of California, Sen. Amy Klobuchar of Minnesota, and Sen. Elizabeth Warren of Massachusetts as possible picks, as well as Gov. Gretchen Whitmer of Michigan and Stacey Abrams, a former Georgia state House minority leader.\nBiden told donors there has been a discussion within his campaign about announcing his VP pick before \"the usual time,\" suggesting he could do so well before his party's convention, which has been pushed back to August.\nFrom the outset of his campaign, Biden attempted to frame the race as a contest between himself and President Trump, describing the election as a \"battle for the soul of this nation.\" In the coming months, the Biden campaign plans to argue that Biden's experience coupled with his compassion and empathy make him best suited to serve as president, particularly as the country grapples with the coronavirus pandemic.\n\"Donald Trump lacks empathy and has demonstrated through this crisis that he lacks the competence and experience to lead,\" said TJ Ducklo, a spokesman for Biden. \"Joe Biden has built his career on connecting with Americans and has a proven track record of leadership in times of crisis. We will be clear in drawing this distinction for the next seven months.\"\nThough coronavirus has halted traditional campaigning, Biden is now readying for that new phase with his position at the top of the ticket settled and bracing for that final match-up between himself and Trump.\n\"Sometimes when a team has a really rough schedule and they win their conference championships and you see it on TV, they cut the nets down,\" Kaufman said, referencing college basketball. \"He is not cutting any nets down. He knows this is the beginning of a very difficult race.\"", "url": "https://www.cnn.com/2020/04/09/politics/biden-campaign-general-election/index.html"}