{"authors": ["Katelyn Polantz", "Kristen Holmes"], "date_download": "2020-05-04 16:20:11", "date_modify": "2020-05-04 16:20:11", "date_publish": "2020-04-05 12:23:14", "description": "The Department of Health and Human Services is looking to veterans from the Hurricane Katrina cleanup to help with coronavirus supply chain issues for the federal government, according to contracting records.", "filename": "2020_04_05_politics_hurrica_99bdcda00e2220532d067f47510bc808_index_1588609211.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327095946-01-medical-equipment-ventilator-new-york-javits-center-0323-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_hurrica_99bdcda00e2220532d067f47510bc808_index_1588609211.html", "title": "Hurricane Katrina cleanup specialists now helping Feds with state supply problems", "title_page": "Hurricane Katrina cleanup specialists now helping feds with state supply problems - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Department of Health and Human Services is looking to veterans from the Hurricane Katrina cleanup to help with coronavirus supply chain issues for the federal government, according to contracting records.\nHHS's Office of the Assistant Secretary for Preparedness this week hired J&M Global Solutions, a small Virginia-based consulting firm run by Bush-era Federal Emergency Management Agency alumni Michelle McQueeney McIntire and Gil Jamieson.\nThe HHS Preparedness Office -- which oversees the national stockpile of medical supplies -- has been under fire over the past several weeks as the Trump administration became bogged down by miscommunication within the federal government, criticism from state leaders who couldn't get supplies to health care workers and a nationwide run on suppliers. Hospitals still face shortages of face masks, protective gear and life-saving equipment.\nAccording to a government official familiar with arrangement with the consulting group, the company helped both with the evacuations of people from Wuhan, China, and from cruise ships, and is working on processing state requests for supplies and services.\nMcIntire and Jamieson previously had been top officials in FEMA's Gulf Coast recovery efforts after the 2005 hurricanes. Jamieson was the highest-ranking FEMA official in the Gulf from 2006 to 2008, stepping into the position after the agency's initially bungled response to the natural disaster. McIntire was chief of staff for the Gulf Coast recovery effort.\nRead More", "url": "https://www.cnn.com/2020/04/05/politics/hurricane-katrina-supply-chain-coronavirus/index.html"}