{"authors": ["Priscilla Alvarez"], "date_download": "2020-05-04 16:24:18", "date_modify": "2020-05-04 16:24:18", "date_publish": "2020-04-06 11:55:53", "description": "The nation's hospitals are dealing with \"severe\" and \"widespread\" shortages of needed medical supplies, hampering the ability to test and respond to the coronavirus pandemic adequately and protect medical staff, according to a new report from a government inspector general.", "filename": "2020_04_06_politics_departm_4f43f0bccbe37a2c3f1edf7a6331fae1_index_1588609458.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403005446-new-york-hospital-cardiac-arrest-patients-memo-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_departm_4f43f0bccbe37a2c3f1edf7a6331fae1_index_1588609458.html", "title": "Watchdog report finds severe shortages and significant challenges to hospitals' coronavirus responses", "title_page": "Watchdog report finds severe shortages and significant challenges to hospitals' coronavirus responses - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The nation's hospitals are dealing with \"severe\" and \"widespread\" shortages of needed medical supplies, hampering the ability to test and respond to the coronavirus pandemic adequately and protect medical staff, according to a new report from a government inspector general.\nThe findings by the inspector general for the Department of Health and Human Services describe a dire situation for front-line doctors and medical staff as cases mount in hospitals.\nThe assessment, the first internal government look at the response, was based on interviews from March 23-27 with administrators from more than 300 hospitals across 46 states, Washington, DC, and Puerto Rico.\n\"The emergence of Covid-19 created unprecedented challenges for the US hospital system,\" HHS Assistant Inspector General for Evaluation and Inspections, Ann Maxwell, told CNN. \"The role of this report is to provide a platform for these experiences in a point of time\" and help inform decisions.\nThe report provides an accounting of the shortages faced by hospitals nationwide in trying to obtain equipment for staff and patients, including the avenues some hospitals turned to to acquire those items, like online retailers and paint stores. It also details the challenges hospitals faced in trying to keep up with testing demands and the inconsistent guidance that caused confusion.\nRead More", "url": "https://www.cnn.com/2020/04/06/politics/department-of-health-and-human-services-shortages/index.html"}