{"authors": ["Steve Almasy", "Holly Yan", "Madeline Holcombe"], "date_download": "2020-05-04 16:25:08", "date_modify": "2020-05-04 16:25:08", "date_publish": "2020-04-06 09:06:58", "description": "In just six weeks, the US death toll from coronavirus went from zero to more than 10,000. Yet there are also signs of progress. More Americans are finding creative ways to help. And in the US epicenter of coronavirus, the worst might be over soon.", "filename": "2020_04_06_health_us-coronavirus-updates-monday_index_1588609508.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404195352-02-coronavirus-deaths-new-york-0404-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_health_us-coronavirus-updates-monday_index_1588609508.html", "title": "Coronavirus hitting some African American communities extremely hard", "title_page": "Coronavirus pandemic hitting some African-American communities extremely hard - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As the death toll from the novel coronavirus climbs, at least one city and a few states are looking at the data to see why African Americans make up a higher percentage of the victims.\nIn Chicago, 72% of the people who have died from Covid-19 are black, though they make up 30% of the population, officials said.\n\"This new data offers a deeply concerning glimpse into the spread of Covid-19 and is a stark reminder of the deep-seated issues which have long created disparate health impacts in communities across Chicago,\" said Mayor Lori Lightfoot.\nThe Lawyers' Committee for Civil Rights Under Law on Monday called for the federal government to release racial and ethnic data relating to the pandemic. The group says it wants to \"ensure that communities of color receive equitable health care and treatment during this crisis.\"\nIn Louisiana, where 32% of the population is African American, those residents account for about 70% of coronavirus deaths.\n\"We're going to try to figure out what that is attributable to and what we can do about that is as quickly as possible,\" Gov. John Bel Edwards said.\nThe state plans to release more detailed data on the coronavirus deaths in terms of ethnicity and underlying conditions as the information becomes available.\nIn Michigan, African Americans are 14% of the state's population and represent about 40% of the deaths. Many of the cases are in Detroit, where four out of five residents are black.\nNew Jersey Gov. Phil Murphy said his health officials will begin to study the racial makeup of Covid-19 patients. Preliminary data indicates 12% are black, but the race of 45% of the patients is unknown.\nStaggering increase\nThat grim milestone was reached Monday, shortly after officials warned this will be the toughest week yet in the pandemic.\nMichigan hospitals are three to six days away from running out of critical supplies, the governor said.\nMortuaries in New Orleans are already out of space, and the mayor said she needs help getting more refrigeration.\nAnd New York, New Jersey and Detroit will see peaks in hospitalizations and deaths this week, a US Health and Human Services assistant secretary said.\nOther US cities will experience their own peaks in the coming weeks, Dr. Brett Giroir told NBC's \"Today\" show. He said the peaks reflect infections that occurred two or three weeks ago.\n\"We may be seeing the worst upon us right now in terms of outcomes,\" Giroir said.\nYet there are also signs of progress. More Americans are finding creative ways to help. And in the US epicenter of coronavirus, New York City, the worst of the pandemic might be over soon.\nWhat hotspots across the country are grappling with\nAt hospitals in Michigan, \"we are running dangerously low on PPE,\" or personal protective equipment, Gov. Gretchen Whitmer said.\n\"At Beaumont hospital, we have less than three days before N95 masks run out. At Henry Ford health system, we have less than four days,\" Whitmer said.\nAt some hospitals, \"there are less than three days until face shields run out, and less than six days until surgical gowns run out,\" she said.\nIn New Orleans, the coroner's office and mortuaries have reached their limits, Mayor LaToya Cantrell said. She's asked the federal government for additional refrigeration.\nThe New Orleans convention center, which sheltered Hurricane Katrina evacuees 15 years ago, has now been converted into an emergency hospital.\nAcross Louisiana, more than 14,000 people have been infected with coronavirus and at least 512 have died. Gov. Edwards said his state could run out of ventilators by the end of the week if cases continue to surge.\nBut the hardest-hit state, New York, reported the number of deaths is not rising as sharply as it has been.\nThe total death toll there reached 4,758 on Monday, up from 4,159 on Sunday.\n\"While none of this is good news, the flattening -- possible flattening of the curve -- is better than the increases that we have seen,\" Gov. Andrew Cuomo said.\nHe said the rate of infection is going down, and that's because \"social distancing is working.\"\nBut Cuomo said New Yorkers must not be \"overconfident\" and ease up on distancing. He said other places have loosened social distancing rules too soon , only to face consequences.\n\"We're not going to make that mistake,\" he said.\nConnecticut Gov. Ned Lamont said the state's rate of increase in new cases is \"not going up quite as quickly.\"\n\"Our social distancing may be having a positive impact,\" he said.\nCDC to test more for coronavirus antibodies\nThe Centers for Disease Control and Prevention will test more people for antibodies from the novel coronavirus to see whether they have already had the virus, according to a statement.\nA set of blood-based tests -- serological essays -- will be able to detect antibodies that are specific to the virus, spokeswoman Kristen Nordlund said.\nThe tests have already been used to look at immune response in several coronavirus contact investigations.\n\"We are also preparing to deploy them to larger surveys within the coming weeks to further identify individuals who, due to mild infection, may have not known they were infected with SARS-CoV-2 and to monitor immunity in recovered individuals,\" Nordlund said.\nIf someone has antibodies that indicates they've recovered from coronavirus. In the past with other coronaviruses, that means their bodies have built up immunity.\nThe Food and Drug Administration last week issued its first emergency use authorization for a coronavirus test that looks for antibodies in the blood.\nBecause antibodies can take time to develop, the FDA has previously warned against using antibody tests to definitively diagnose coronavirus.\nScrambling for solutions\nWith no end to this pandemic in sight, more Americans are getting creative in helping fight the virus's spread.\nThe Department of Veterans Affairs will open more than 1,500 hospital beds for civilians in multiple states, VA Secretary Robert Wilkie said. The VA is helping in New York, New Jersey, Louisiana, Michigan and Massachusetts.\nThe surge in people wearing cloth masks in public came after the CDC said it could help prevent asymptomatic carriers of the virus from infecting others\nDoctors and nurses say any help is needed.\nIn one Brooklyn emergency room, it seems almost every patient -- no matter what they came in for -- is found to have coronavirus, Dr. Sneha Topgi said.\n\"I think we're still at the beginning, and I am scared,\" Topgi said. \"I'm scared for myself, and I'm scared for everyone in general.\"", "url": "https://www.cnn.com/2020/04/06/health/us-coronavirus-updates-monday/index.html"}