{"authors": ["Ronald Blum"], "date_download": "2020-05-04 20:23:39", "date_modify": "2020-05-04 20:23:39", "date_publish": "2020-04-20 20:24:29", "description": "NEW YORK (AP) — Baseball Commissioner Rob Manfred has made a move that allows teams to lay off or cut the pay of major and minor league managers, coaches, trainers and full-time scouts starting...", "filename": "_1c47dc3a86d943b7b6eb6f4b0cb6c5dd_1588623819.html", "image_url": "https://storage.googleapis.com/afs-prod/media/93dba352700c46b5a2781feab806c006/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1c47dc3a86d943b7b6eb6f4b0cb6c5dd_1588623819.html", "title": "MLB can cut pay, lay off managers, coaches starting May 1", "title_page": "MLB can cut pay, lay off managers, coaches starting May 1", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Nov. 21, 2019, file photo, baseball commissioner Rob Manfred speaks to the media at the owners meeting in Arlington, Texas. Major League Baseball is cutting the salary of senior staff by an average of 35% for this year and is guaranteeing paychecks to its full-time employees of its central office through May. Baseball Commissioner Rob Manfred made the announcement Tuesday, April 14, 2020. (AP Photo/LM Otero, File)\nFILE - In this Nov. 21, 2019, file photo, baseball commissioner Rob Manfred speaks to the media at the owners meeting in Arlington, Texas. Major League Baseball is cutting the salary of senior staff by an average of 35% for this year and is guaranteeing paychecks to its full-time employees of its central office through May. Baseball Commissioner Rob Manfred made the announcement Tuesday, April 14, 2020. (AP Photo/LM Otero, File)\nNEW YORK (AP) — Baseball Commissioner Rob Manfred has made a move that allows teams to lay off or cut the pay of major and minor league managers, coaches, trainers and full-time scouts starting May 1.\nManfred has suspended uniform employee contracts that cover about 9,000 people, including general managers on some teams. Manfred cited the inability to play games due to the national emergency caused by the new coronavirus pandemic.\n“Our clubs rely heavily on revenue from tickets/concessions, broadcasting/media, licensing and sponsorships to pay salaries,” Manfred wrote in an email Monday, a copy of which was obtained by The Associated Press. “In the absence of games, these revenue streams will be lost or substantially reduced, and clubs will not have sufficient funds to meet their financial obligations.”\n“The impact of the suspension of the UEC on your personal employment situation will be determined by your club,” Manfred said.\nManfred’s intention to suspend the contracts was first reported by The Athletic.\nSeveral teams have said they will pay their employees through May.\nMajor League Rule 3(i) requires that UECs must be signed by all managers, coaches, trainers and salaried scouts, and some teams include additional baseball operations staff.\n“Pursuant to the terms of the UEC, the club’s exclusive right to your services will remain in effect during the period of the suspension such that you will not be permitted to perform services for any other club,” Manfred wrote. “I fully recognize the hardship that this health crisis creates for all members of the baseball community. Central baseball and the clubs are doing everything possible to try to minimize this impact for as many employees as possible.”\nManfred said the Baseball Assistance Team charitable organization “is available to consider grant applications on an expedited basis for those facing significant and immediate financial hardship.”\n___\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports", "url": "https://apnews.com/1c47dc3a86d943b7b6eb6f4b0cb6c5dd"}