{"authors": ["Nathaniel Meyersohn", "Chris Isidore", "Cnn Business"], "date_download": "2020-05-04 16:27:08", "date_modify": "2020-05-04 16:27:08", "date_publish": "2020-04-07 16:06:35", "description": "They were once the giants of American retail, strong enough to survive wars, the Great Depression, the Great Recession and the rise of online shopping. But Sears, JCPenney and others may not be able to survive the coronavirus crisis.", "filename": "2020_04_07_business_jcpenne_a0c34d8f185a90e0ef78fc2ff4b30b2a_index_1588609628.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406163628-sears-store-closing-0326-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_business_jcpenne_a0c34d8f185a90e0ef78fc2ff4b30b2a_index_1588609628.html", "title": "Four famous stores that may not survive because of coronavirus", "title_page": "JCPenney, Sears, Nieman Marcus and JCrew could collapse from the coronavirus recession - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) They were once the giants of American retail, strong enough to survive wars, the Great Depression, the Great Recession and the rise of online shopping. But Sears, JCPenney and others may not be able to survive the coronavirus crisis.\n\"The retailers who were wandering around aimlessly pre-pandemic are going to be substantially less likely to muddle through than they were before,\" said Mark Cohen, director of retail studies at the Columbia Business School.\nDuring the pandemic, stores have been shuttered. Retailers have furloughed hundreds of thousands of employees and are losing most of their sales. And shoppers have cut back on most purchases other than groceries and daily essentials. Depending on how long consumer demand stalls, companies may be forced to lay off workers, close stores permanently or restructure.\n\"Store-based retail was already struggling with internet consumption trends before coronavirus, and now will be faced with accelerated demand shifts to the internet,\" Randal Konik, analyst at Jefferies, said in a note to clients last week.\nJCPenney JCP Sears,, Neiman Marcus and J. Crew were some of the most distressed companies prior to the outbreak, according to analysts. Many were forced to close stores in the face of declining sales even as unemployment reached a 50-year low.\nRead More", "url": "https://www.cnn.com/2020/04/07/business/jcpenney-sears-neiman-marcus-j-crew-retailers-coronavirus/index.html"}