{"authors": ["Christina Maxouris"], "date_download": "2020-05-04 17:01:03", "date_modify": "2020-05-04 17:01:03", "date_publish": "2020-04-10 10:21:14", "description": "California Gov. Gavin Newsom reassured residents Thursday the state has enough ventilators to meet its projected needs, after some questioned his decision to lend 500 machines to other states in crisis.", "filename": "2020_04_10_us_california-governor-counties-ventilators_index_1588611663.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200205114951-01-gavin-newsom-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_california-governor-counties-ventilators_index_1588611663.html", "title": "California's governor says state has enough ventilators after some raised concerns over his decision to lend machines to other states", "title_page": "California's governor says state has enough ventilators after some raised concerns over his decision to lend machines to other states  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) California Gov. Gavin Newsom reassured residents Thursday the state has enough ventilators to meet its projected needs, after some questioned his decision to lend 500 machines to other states in crisis.\n\"We think it was the right thing to do but I also want you to know it was the responsible thing to do ... to save lives,\" Newsom said.\nHe said the state's early aggressive measures to help slow the virus, earned California more time to prepare for a surge. He has said he expects the peak of coronavirus patients to be in May.\n\"When those ventilators are used to save lives in those other states, we have the firm commitment from those states to send them back to the state of California,\" he said Thursday.\n\"But we can't just sit on assets when we can save lives and help our fellow Americans.\"\nRead More", "url": "https://www.cnn.com/2020/04/10/us/california-governor-counties-ventilators/index.html"}