{"authors": ["Jim Vertuno"], "date_download": "2020-05-04 20:11:11", "date_modify": "2020-05-04 20:11:11", "date_publish": "2020-04-07 21:07:07", "description": "AUSTIN, Texas (AP) — A federal appeals court sided Tuesday with Texas in allowing it to ban most abortions while the state is under an emergency order that limits non-essential surgeries during...", "filename": "_41641572045e0bd30407172538fcf978_1588623071.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_41641572045e0bd30407172538fcf978_1588623071.html", "title": "Court allows Texas to ban most abortions during virus crisis", "title_page": "Court allows Texas to ban most abortions during virus crisis", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Court allows Texas to ban most abortions during virus crisis\nAUSTIN, Texas (AP) — A federal appeals court sided Tuesday with Texas in allowing it to ban most abortions while the state is under an emergency order that limits non-essential surgeries during the coronavirus pandemic.\nA panel of judges at the New Orleans-based Fifth Circuit Court of Appeals overturned a decision by a lower court that blocked the ban last week. The ruling allows the ban to stay in place pending further legal arguments.\nTexas Republican Gov. Greg Abbott last month ordered hospitals to cancel “non-essential” surgeries in order to free up hospital space and supplies that might be needed for coronavirus patients and doctors.\nRepublican Texas Attorney General Ken Paxton said the the order would cover any abortions except for those needed to protect the health and safety of the mother. Planned Parenthood and other abortion rights groups then sued to remove abortion from the procedures that should be delayed.\nU.S. District Judge Lee Yeakel ruled last week that the “Supreme Court has spoken clearly” on a woman’s right to terminate a pregnancy and ruled “there can be no outright ban on such a procedure.”\nTexas immediately appealed. The appeals court’s 2-1 ruling noted “the escalating spread of COVID-19, and the state’s critical interest in protecting the public health.”\nThe majority opinion written by U.S. Circuit Judge Kyle Duncan, an appointee of President Donald Trump, concluded that “when faced with a society-threatening epidemic, a state may implement emergency measures that curtail constitutional rights so long as the measures have at least some ‘real or substantial relation’ to the public health crisis.”\nAlexis McGill Johnson, acting president and chief executive officer of Planned Parenthood Federation of America, called the appeals court ruling “unconscionable.”\n“Abortion is essential, it’s time-sensitive, and it cannot wait for a pandemic to pass,” McGill Johnson said.\nTexas bans most abortions after 20 weeks. Abbott’s original March 22 order was to expire April 21 but can be extended.\nTexas was just one of several states facing the issue of abortion bans during the pandemic as similar legal fights are being waged in Alabama, Ohio, Oklahoma and Iowa.\nAbortion rights groups pledged to keep fighting the bans.\n“This is not the last word. We will take every legal action necessary to fight this abuse of emergency powers,” said Nancy Northup, president of the Center for Reproductive Rights.", "url": "https://apnews.com/41641572045e0bd30407172538fcf978"}