{"authors": ["Sandra Gonzalez"], "date_download": "2020-05-04 16:11:12", "date_modify": "2020-05-04 16:11:12", "date_publish": "2020-04-01 23:53:50", "description": "Adam Schlesinger, the co-founder of pop-rock band Fountains of Wayne and an Oscar-nominated songwriter, has died from complications related to coronavirus. He was 52.", "filename": "2020_04_01_entertainment_adam-schlesinger-dead_index_1588608672.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401163346-adam-schlesinger-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_entertainment_adam-schlesinger-dead_index_1588608672.html", "title": "Adam Schlesinger, Fountains of Wayne co-founder, dead at 52 from Covid-19", "title_page": "Adam Schlesinger, Fountains of Wayne co-founder, dead at 52 from Covid-19 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Adam Schlesinger, the co-founder of pop-rock band Fountains of Wayne and an Oscar-nominated songwriter, has died from complications related to coronavirus. He was 52.\n\"As many of you are aware, Adam had been hospitalized with Covid-19 and although he had been making some small improvements over the last few days, Adam's condition was critical and he was ultimately unable to recover from Covid-19 complications,\" read a statement from the band's attorney, provided to CNN. \"He was truly a prolific talent and even more so, a loving and devoted father, son and friend.\"\nIt added: \"We are terribly sorry to convey this loss.\"\nSchlesinger's band, which was co-founded with Chris Collingwood, was best known for its 2003 hit \"Stacy's Mom,\" a humorous track about a young boy who has a crush on his friend's mother. The song was nominated for a Grammy Award.\nBut Schlesinger had success before that as a songwriter. He co-wrote the title track to the 1996 Tom Hanks film \"That Thing You Do,\" and received Oscar and Golden Globe nominations for his work.\nRead More", "url": "https://www.cnn.com/2020/04/01/entertainment/adam-schlesinger-dead/index.html"}