{"authors": ["Lauren Lee"], "date_download": "2020-05-04 16:26:48", "date_modify": "2020-05-04 16:26:48", "date_publish": "2020-03-13 12:26:42", "description": "On any given day, the National School Lunch Program provides low-cost or free lunches to 29.7 million children. But the coronavirus pandemic is shutting down schools and parents are scrambling to find ways to feed their hungry kids.", "filename": "2020_03_13_us_iyw-how-to-he_4affb639f6997e8af50e26715c19d0d5_index_1588609608.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191113174831-02-minnesota-school-lunches-thrown-out-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_13_us_iyw-how-to-he_4affb639f6997e8af50e26715c19d0d5_index_1588609608.html", "title": "With coronavirus closing schools, here's how you can help food insecure children", "title_page": "With coronavirus closing schools, here's how you can help food insecure children - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) On any given day, the National School Lunch Program provides low-cost or free lunches to 29.7 million children. But the coronavirus pandemic is shutting down schools and parents are scrambling to find ways to feed their hungry kids.\nCharitable organizations are working to fill the gap, but they need your help. Here are a few organizations you can support:\nFeeding America runs a network of 200 food banks across the US. The organization set up a \"COVID-19 Response Fund\" to help food banks aid communities impacted by the pandemic.\nSave the Children and No Kid Hungry have teamed up with actresses Jennifer Garner and Amy Adams to launch #SAVEWITHSTORIES. The program provides children in America's poorest communities with nutritious meals, books and other learning resources during the outbreak.\nBlessings in a Backpack normally tries to ensure that free school lunch recipients have something to eat on weekends. During the pandemic, they've teamed up with school districts that have activated summer feeding programs.\nUnited Way is using their \"COVID-19 Community Response and Recovery Fund\" to stock food banks with essential staples to help feed children who rely on schools for meals.\nWorld Central Kitchen founder Chef José Andrés closed all of his Washington DC restaurants. But he kept some of his kitchens open to offer discounted meals and free to-go lunches for those who can't afford.\nLittle Free Pantry boxes are standing ready across the US, giving 24-hour neighborhood access to food and other basic necessities.\nGENYOUth has established the COVID-19 Emergency School Nutrition Fund. The fund will provide grants to school feeding sites for purchasing of supplies for meal distribution and delivery.\nIf you would like to donate to any of the organizations above or other groups making a difference in the coronavirus pandemic, click the button below.", "url": "https://www.cnn.com/2020/03/13/us/iyw-how-to-help-hungry-students-coronavirus-trnd/index.html"}