{"authors": ["Jeremy Herb", "Lauren Fox"], "date_download": "2020-05-04 16:33:57", "date_modify": "2020-05-04 16:33:57", "date_publish": "2020-04-07 22:06:47", "description": "The race is on for lawmakers looking to get their priorities included in the next coronavirus stimulus bill as Congress tries to sort out unintended consequences in real time stemming from the $2.2 trillion stimulus package passed last month.", "filename": "2020_04_07_politics_phase-four-wish-list_index_1588610037.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327142859-02-pelosi-signing-0327-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_phase-four-wish-list_index_1588610037.html", "title": "Lawmakers pitch pet priorities for next stimulus bill", "title_page": "Lawmakers pitch pet priorities for next stimulus bill - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The race is on for lawmakers looking to get their priorities included in the next coronavirus stimulus bill as Congress tries to sort out unintended consequences in real time stemming from the $2.2 trillion stimulus package passed last month.\nLawmakers are wasting no time pitching an entirely new set of programs for a \"phase four\" bill -- a reference to following three other Covid-19 response packages that Congress has passed -- with the impact of the coronavirus on constituents back home coming into clearer view. On Tuesday, Senate Minority Leader Chuck Schumer announced he wanted to make $25,000 in hazard pay available to workers still showing up for their jobs as coronavirus grips the country — and wouldn't shy away from putting it front and center in negotiations with Republicans in leadership.\n\"This is one of our very highest priorities,\" Schumer, a Democrat from New York, said on a conference call with reporters. \"They're risking their lives.\"\nIt's just one of numerous efforts being pushed by both Democrats and Republicans as congressional leaders gear up for the next spending package.\nThe mounting number of wish-list items underscores how coronavirus has disrupted every facet of the American economy, from gig workers to rural hospitals where canceled elective surgeries have left already-strapped facilities with little to no money coming in. Republicans in congressional leadership have been clear to their members and the public that additional funding likely won't flow until after the last stimulus is more fully implemented, but the calls are quickly amplifying to do more immediately.\nEffort to fix previous package gaining speed\nThe first fix needed for last month's $2.2 trillion stimulus package is already taking shape — and is moving at rapid speed.\nThe Treasury Department announced Tuesday it was asking Congress for an additional $250 billion for the Small Business Administration's new loan program after the $350 billion program experienced a rocky rollout. Leadership spent Tuesday trying to agree upon an expansion of that program. While most agree more money is fine, any changes to the program aren't likely to be included despite complaints from lenders and small business owners that there hasn't been adequate guidance so far on how the program is supposed to work.\n\"All we are going to ask for is an additional pot of money,\" one administration official told CNN. \"Anything else we do starts an inevitable chain of negotiations, and given the disagreements among what those 'technical changes look like,' we don't want to get into that business.\"\nSenate Majority Leader Mitch McConnell said he would push to pass the measure in the Senate on Thursday by unanimous consent — meaning senators wouldn't have to return to Washington to vote. And House Speaker Nancy Pelosi said in an interview with CNN's Anderson Cooper she supports an \"interim package\" to address the funding issue, but added she wanted to make sure it was \"administered in a way that does not solidify inequality.\"\nTreasury Secretary Steve Mnuchin said Tuesday that he hoped that the House would be able pass the measure on Friday.\nPelosi has said she's already working to craft a broader follow-up package to the $2.2 trillion Cares Act, which would focus on extending and expanding relief funding, including more money for state and local governments, provisions for personal protective equipment and more direct payments to individuals.\nShe called the Cares Act a \"giant first step\" but said it was \"clear that it would not be enough for our state and municipalities and hospitals and other health-serving institutions, that would not be enough for education and the rest.\"\nPelosi said Tuesday that Democratic infrastructure priorities, which members initially said they wanted to address in a potential fourth coronavirus response bill, are \"not off the table, but what is on the table is more funding for the immediate needs that people have.\"\nHurdles ahead\nThe next round of negotiations could prove tougher to agree on. House Democrats have numerous priorities they unveiled during the last round of spending negotiations that didn't make it into the final bill. And many rank-and-file Republicans are already warning against a fourth stimulus package until they are assured that hiccups from the third phase are actually worked out.\n\"I hope we can address these issues before we plus funding up,\" Sen. Ron Johnson, a Republican from Wisconsin, told CNN.\nThere's already one key issue bubbling up ahead of the next round of negotiations poised to spark a partisan fight: voting. In the wake of the fracas over Wisconsin's primary on Tuesday , Democratic leaders said it's an issue that must be addressed in the next coronavirus package.\n\"Making sure our elections can be conducted fully and fairly is a very high priority for us,\" Schumer said Tuesday.\n\"We want the resources to be there, and no obstacles to that voting to take place,\" Pelosi said. \"It's about our democracy in the time where it's even a physical challenge to vote. So we want to have more resources for vote-by-mail, for same-day registration, more states sending ballots to those who are qualified to vote. That will be part of our initiative.\"\nThe Republican National Committee responded to Pelosi's interview by accusing Democrats of \"attempting to use the coronavirus pandemic to achieve their far left electioneering goals.\"\nProposals flood in for next package\nStill, congressional leaders will have no shortage of options to choose from as they put together the next spending bill, with proposals coming from every corner of the country and ideological spectrum.\nDemocratic Reps. Joe Neguse of Colorado, Ben Ray Lujan of New Mexico, Andy Levin of Michigan and Tom Malinowski of New Jersey, for instance, introduced a bill on Tuesday to give small cities and towns access to $250 billion in direct relief funds, expanding on the $150 billion fund for state and local governments in the $2.2 trillion stimulus bill.\n\"A number of us felt that did not go far enough,\" Neguse said in an interview. \"A number of us believed the fund should be much larger -- in addition, the structure should be changed so that cities and counties under 500,000 people could access directly federal resources from the Treasury Department.\"\nAnother quartet of House Democrats — Reps. Jim McGovern of Massachusetts, Marcia Fudge of Ohio, Rosa DeLauro of Connecticut and Ayanna Pressley of Massachusetts — urged House and Senate leaders to boost funding for food stamps, pushing for an increase to both the maximum and minimum benefits available under the Supplemental Nutrition Assistance Program.\nAnd a bipartisan, bicameral group of lawmakers — Sens. Amy Klobuchar, a Minnesota Democrat, and Kevin Cramer, a North Dakota Republican, and Reps. Peter Welch, a Vermont Democrat, and Roger Marshall, a Kansas Republican — want congressional leaders to include funding in the next bill for small broadband providers to provide internet to low-income families.\nWhile many of the proposals would add or tweak the stimulus legislation passed last month , a group of House lawmakers wants to revise the 2017 Republican tax cuts to repeal the cap on state and local tax deductions that hit hardest in states like California and New York — now hotspots of the coronavirus pandemic.\n\"Now is a time when state and local governments are facing serious funding issues and relief from the cap would help not only individuals, but the state and local governments addressing the crisis we all face,\" wrote the dozen lawmakers, led by Democratic Rep. Tom Suozzi of New York.\nJohnson told CNN Tuesday he has had conversations with colleagues about whether it makes sense to offer a payroll tax holiday for workers on the frontlines, whether they are grocery store clerks or nurses at hospitals.\nThe legislative effort surrounding the coronavirus pandemic extends to its oversight, too: House Intelligence Chairman Adam Schiff of California and House Homeland Security Chairman Bennie Thompson of Mississippi have each introduced legislation to create a 9/11 Commission-style panel to examine the US response to the pandemic, and others have similar proposals.", "url": "https://www.cnn.com/2020/04/07/politics/phase-four-wish-list/index.html"}