{"authors": ["Amir Vera"], "date_download": "2020-05-04 17:03:50", "date_modify": "2020-05-04 17:03:50", "date_publish": "2020-04-11 00:29:48", "description": "With social distancing and shelter-in-place orders afoot, churches are finding unique ways to celebrate Good Friday.", "filename": "2020_04_10_us_good-friday-coronavirus-pandemic_index_1588611830.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410152832-03-good-friday-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_good-friday-coronavirus-pandemic_index_1588611830.html", "title": "Here's how churches observed Good Friday during the coronavirus pandemic", "title_page": "Here's how churches observed Good Friday during the coronavirus pandemic  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Churches across the nation and world are celebrating Good Friday differently this year.\nAs the coronavirus pandemic continues to spread around the world, churches are finding alternative ways to commemorate the day Jesus Christ was crucified.\nWorshipers in Germany attended service at a drive-in movie theater, with the actual service playing on the radio.\nCity dean pastor Frank Heidkamp talks to visitors of the service in the car at a Düsseldorf drive-in cinema.\nIn Indonesia, worshipers celebrated by live streaming a service.\nA family attends a prayer from their home during Good Friday service through live internet streaming on April 10, 2020, in Yogyakarta, Indonesia.\nIn Washington, DC, and London, church leaders held a service via live stream.\nRev. Patrick Mahoney, director of the Christian Defense Coalition, kneels in prayer as he livestreams a Good Friday service on the grounds of the U.S. Capitol on April 10, 2020, in Washington, DC.\nThe Very Reverend Andrew Nunn, Dean of Southwark Cathedral delivers the Good Friday morning Prayer via a live video broadcast on April 10, 2020, in London, England.\nRead More", "url": "https://www.cnn.com/2020/04/10/us/good-friday-coronavirus-pandemic/index.html"}