{"authors": ["Jeremy Harlan"], "date_download": "2020-05-04 16:21:48", "date_modify": "2020-05-04 16:21:48", "date_publish": "2020-04-06 01:38:42", "description": "With their sanctuary closed to visitors, the most excitement four male tigers got on a chilly but sunny April afternoon was the shattering sound of icicles falling from empty walkways high above their enclosure.", "filename": "2020_04_05_us_tiger-king-big-cats-trnd_index_1588609308.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200329125429-tiker-king-joe-exotic-netflix-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_us_tiger-king-big-cats-trnd_index_1588609308.html", "title": "What happened to the big cats of 'Tiger King'?", "title_page": "What happened to the big cats of 'Tiger King'? - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Keenesburg, Colorado (CNN) With their sanctuary closed to visitors, the most excitement four male tigers got on a chilly but sunny April afternoon was the shattering sound of icicles falling from empty walkways high above their enclosure.\nBecause of Colorado's mandated coronavirus precautions, the only people these tigers had seen in a week at the Wild Animal Sanctuary in Weld County were their caregivers and journalists wanting to learn of the felines' involvement in one of the most talked-about topics in the couch-ridden country.\nThey are four of the tigers once owned by Joseph Maldonado-Passage, popularly known as Joe Exotic, the central figure in the new Netflix documentary series \"Tiger King: Murder, Mayhem and Madness.\"\nBecca Miceli, chief science and animal welfare officer at the sanctuary, was initially reluctant to watch the documentary. Miceli finally tuned in, in part, to see if she could spot any of the tigers she helps take care of on the sprawling 789-acre property tucked in Colorado's rolling plains.\n\"I was pausing a lot and saying, 'Hey, I think that's ... \" she said.\"I wasn't really surprised by the documentary,\" said Miceli. \"I saw firsthand, myself.\"\nPoor living conditions\nIn November of 2017, Miceli said she was part of a team that traveled to Maldonado-Passage's private zoo, the Greater Wynnewood Exotic Animal Park, in Oklahoma to rescue the animals.\nA federal magistrate judge had granted a motion to transfer 19 tigers from the Oklahoma zoo to the Colorado sanctuary in connection with an earlier lawsuit brought by PETA against a now-shuttered Florida facility, Dade City Wild Things, and its owners. Documents filed in connection with that lawsuit stated that Dade City's owners had deliberately moved the tigers to Greater Wynnewood Exotic Animal Park in violation of a court order.\nThe Colorado team took possession of the 19 tigers and brought them back north to the sanctuary where it cares for more than 520 rescued animals including lions, bears, wolves, and hyenas.\nMiceli said the tigers endured poor living conditions in Oklahoma. She said she saw animals confined to small cages, which had been declawed.\n\"People think that doing things of that nature make them s​afe to work with. It's still a tiger. It's still a 400-pound predator at the end of the day.\"\nLess than a month after that first trip south, Miceli said sanctuary staff were back in Wynnewood, Oklahoma retrieving twe​nty more tigers and three black bears.\n\"The biggest takeaway that we hope people get from the documentary is that they see past the characters and see what the real problem is,\" said Miceli. \"These animals have no voice. They are constantly exploited, constantly bred. They don't get a choice. That's being forced upon them.\"\nTwo years removed from their time in Oklahoma, the tigers and bears now enjoy wide-open enclosures and get a formulated diet...quite a contrast to what was shown in the Netflix documentary.\nIn the documentary, Maldonado-Passage told filmmakers he fed his animals expired meat from a big-box grocery store. He also details in the documentary how he fed his tigers roadkill found by state workers. Miceli believes that diet led to growth deficiencies in the large felines.\n\"We just want our animals to have lifelong happiness in as much as a natural environment as possible,\" said Miceli.\nCoronavirus closures\nThat mission has now come under serious strain due to coronavirus restrictions. Lost admission and concession fees hurt the sanctuary's ability to pay its staff and care for the animals. Sanctuary officials say it must now rely heavily on private donations.\n\"The coronavirus doesn't make anything stop for the needs we have to provide as an organization,\" explained Miceli.\nOn March 25, the sanctuary said it transported six tigers back to Colorado from Dade City Wild Things. Two days earlier, in a final judgement issued in the PETA lawsuit against the Florida zoo, a federal district judge forced the property's owners to relinquish their tigers to various sanctuaries and prohibit them from ever owning tigers again. A recorded message on the zoo's main number says the park is closed due to \"our President's request.\"\nAccording to the International Fund for Animal Welfare, there are as many as 10,000 big cats in captivity in the US. But the patchwork of laws governing ownership of such animals makes it difficult to get exact numbers.\nCurrently there is no direct federal law prohibiting ownership of dangerous exotic animals. The Big Cat Public Safety Act , a bill introduced in the US House of Representatives in 2019, would restrict the possession, exhibition, and direct contact the public can have with big game cats.\nAt the Colorado sanctuary, visitors are not allowed to touch the animals. Miceli says breeding is also prohibited. Many of the animals are spayed and neutered after they arrive at the facility. Those that aren't, are separated by sex.\nMaldonado-Passage is currently serving a 22-year federal prison sentence for his role in a murder-for-hire plot. The Greater Wynnewood Exotic Animal Park is now owned and operated by his former business partner, Jeff Lowe. On March 29th, the park announced on its Facebook page that it wouldn't open the next morning because \"the crowds have been huge since the Netflix show and we have difficulty in controlling that much traffic at one time,\" noting that it was working with Oklahoma's governor to \"seek advice on remaining open yet somehow controlling crowds.\" The state had announced the closure of all non-essential businesses four days earlier. A recent Instagram post indicated the facility remained closed.\nMiceli worries the documentary's spotlight on tiger exploitation, coupled with the temporary closing of zoos, could cause a major displacement of large game animals currently living in private zoos or with individuals that consider the animals personal pets.\n\"With those zoos, their funding is going to change because people aren't going,\" said Miceli. If the zoos don't have enough money to feed and care for their animals, Miceli thinks they will look to get rid of them.\n\"Sadly, I do think that we're going to get a high influx of phone calls,\" said Miceli. \"The concern would be that there's going to be a huge surge of animals in need. You're talking hundreds and hundreds of animals.\"", "url": "https://www.cnn.com/2020/04/05/us/tiger-king-big-cats-trnd/index.html"}