{"authors": ["William J. Kole"], "date_download": "2020-05-04 20:11:27", "date_modify": "2020-05-04 20:11:27", "date_publish": "2020-03-26 16:44:50", "description": "BOSTON (AP) — Neil Diamond posts a fireside rendition of \"Sweet Caroline\" with its familiar lyrics tweaked to say, \"Hands ... washing hands.\" A news anchor asks when social distancing will end...", "filename": "_7d86ffc9a7737e8f7b98a0492f850589_1588623087.html", "image_url": "https://storage.googleapis.com/afs-prod/media/968b322dc0614d93b3fa6a5d0a101e7b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7d86ffc9a7737e8f7b98a0492f850589_1588623087.html", "title": "Coping with virus through humor", "title_page": "If you don't laugh, you cry: Coping with virus through humor", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "If you don’t laugh, you cry: Coping with virus through humor\nIn this March 24, 2020, photo, a man walks past the First Baptist Church in America in Providence, R.I. Americans are turning to humor in many forms, like the sign in front of the church, as they cope with the fear and anxiety the coronavirus pandemic has unleashed. (AP Photo/William J. Kole)\nIn this March 24, 2020, photo, a man walks past the First Baptist Church in America in Providence, R.I. Americans are turning to humor in many forms, like the sign in front of the church, as they cope with the fear and anxiety the coronavirus pandemic has unleashed. (AP Photo/William J. Kole)\nBOSTON (AP) — Neil Diamond posts a fireside rendition of “Sweet Caroline” with its familiar lyrics tweaked to say, “Hands ... washing hands.” A news anchor asks when social distancing will end because “my husband keeps trying to get into the house.” And a sign outside a neighborhood church reads: “Had not planned on giving up quite this much for Lent.”\nAre we allowed to chuckle yet? We’d better, psychologists and humorists say. Laughter can be the best medicine, they argue, so long as it’s within the bounds of good taste. And in a crisis, it can be a powerful coping mechanism.\n“It’s more than just medicine. It’s survival,” said Erica Rhodes, a Los Angeles comedian.\n“Even during the Holocaust, people told jokes,” Rhodes said in a telephone interview with The Associated Press. “Laughter is a symbol of hope, and it becomes one of our greatest needs of life, right up there with toilet paper. It’s a physical need people have. You can’t underestimate how it heals people and gives them hope.”\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.\nThose are scary words and scary prospects. But history has shown that its heaviest moments are often leavened by using humor and laughter as conscious choices — ways to cope when other things aren’t working as expected.\n“There’s so much fear and horror out there. All the hand washing in the world isn’t going to clear up your head,” said Loretta LaRoche, a suburban Boston stress management consultant who’s using humor to help people defuse the anxiety the pandemic has wrought.\n“Some people will say this is not a time for laughter. The bottom line is, there is always a time for laughter,” LaRoche said. “We have 60,000 thoughts a day and many of them are very disturbing. Laughter helps the brain relax.”\nThat explains why social media feeds are peppered with coronavirus-themed memes, cartoons and amusing personal anecdotes.\nHere’s Diamond posting a video of himself singing “Sweet Caroline” with the lyrics altered to say: “Hands ... washing hands ... don’t touch me ... I won’t touch you.”\nThere’s Fox News anchor Julie Banderas tweeting : “How long is this social distancing supposed to last? My husband keeps trying to get into the house.”\nHere’s Austin restaurant El Arroyo, still smarting economically from the outbreak-induced postponement of the South by Southwest music festival, turning its outdoor message board into a mock dating app : “Single man w/TP seeks single woman w/hand sanitizer for good clean fun.”\nAnd over here, see novelist Curtis Sittenfeld, sharing a photo of herself eating lunch in her wedding dress after her kids asked her to wear it “and I couldn’t think of a reason not to.”\nFor centuries, laughter in tough times has been cathartic, said Wayne Maxwell, a Canadian psychologist who has done extensive research on “gallows humor.” The term originated in medieval Britain, where hangings took place in parks near pubs and patrons told jokes at the victims’ expense.\n“Even in some of the writings of ancient Egypt, there are descriptions of military personnel returning from the front lines and using humor to cope,” said Maxwell, of Halifax, Nova Scotia.\nBut, he warns, there exists a kind of comedy continuum: While humor can helpfully lighten things up, too much laughter and flippancy can signal a person is trying to escape from reality.\nThere are also questions of taste. No one wants to poke fun at medical misery or death. Quarantining and social distancing, though, are fair game, and self-deprecating humor is almost always safe — though LaRoche cautions that humor, like beauty, is always in the eye of the beholder.\n“It all depends on how your brain functions,” she said. “Give yourself permission to find humor. It’s almost like a spiritual practice, finding ways to laugh at yourself.”\nFor those millions of parents struggling to work from home and teach their housebound children, she’s preaching to the choir. Witness this widely shared meme : a photo of an elderly, white-haired woman with the caption: “Here’s Sue. 31 years old, home schooling her kids for the last 5 days. Great job Sue. Keep it up.”\nMichael Knight, a 29-year-old musician and a caseworker for people with mental disabilities, has been breaking the tension by posting memes like: “They said a mask and gloves were enough to go to the grocery store. They lied. Everyone else had clothes on.”\n“It helps me decompress,” said Knight, of Plymouth, Massachusetts. “It kind of offsets the paralyzing effects of the bogeyman that is the pandemic.”\nRhodes, who’s out more than $30,000 after three festivals and her first taped special were canceled, is trying to see the humor in her own predicament.\nShe recently posted iPhone video of herself pretending to work a nonexistent crowd on an outdoor stage she happened upon during a walk. “How’s everyone not doing?” she cracks.\n“The best material comes from a place that’s very truthful and somewhat dark,” Rhodes said.\nHer prediction: When life eventually edges back to normal, “Saturday Night Live” and the latest Netflix standup specials will be powered by quarantine humor.\n“Just a month ago, who would have appreciated being given a roll of toilet paper?” she said. “I mean, the whole world is upside down.”\n___\nWilliam J. Kole is the New England editor for The Associated Press. Follow him on Twitter at http://twitter.com/billkole", "url": "https://apnews.com/7d86ffc9a7737e8f7b98a0492f850589"}