{"authors": ["Tom Davies"], "date_download": "2020-05-04 20:12:44", "date_modify": "2020-05-04 20:12:44", "date_publish": "2020-04-15 17:00:08", "description": "INDIANAPOLIS (AP) — Indiana’s health commissioner voiced some hopefulness Wednesday about the coronavirus outbreak spread throughout the state even as its death toll has grown by more than 300...", "filename": "_253a8321631f2fe9f9bcba684f93eaa9_1588623164.html", "image_url": "https://storage.googleapis.com/afs-prod/media/088a701d1fb649dd97bd2def36b98e04/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_253a8321631f2fe9f9bcba684f93eaa9_1588623164.html", "title": "Indiana health chief optimistic on state's coronavirus peak", "title_page": "Indiana health chief optimistic on state's coronavirus peak", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dr. Kristina Box, Indiana Health Commissioner, answers questions about COVID-19 infections and its impact on the state as Indiana Gov. Eric Holcomb listens during a briefing at the Statehouse in Indianapolis, Tuesday, March 24, 2020. Holcomb ordered state residents to remain in their homes except when they are at work or for permitted activities, such as taking care of others, obtaining necessary supplies, and for health and safety. The order is in effect from March 25 to April 7. (AP Photo/Michael Conroy)\nDr. Kristina Box, Indiana Health Commissioner, answers questions about COVID-19 infections and its impact on the state as Indiana Gov. Eric Holcomb listens during a briefing at the Statehouse in Indianapolis, Tuesday, March 24, 2020. Holcomb ordered state residents to remain in their homes except when they are at work or for permitted activities, such as taking care of others, obtaining necessary supplies, and for health and safety. The order is in effect from March 25 to April 7. (AP Photo/Michael Conroy)\nINDIANAPOLIS (AP) — Indiana’s health commissioner voiced some hopefulness Wednesday about the coronavirus outbreak spread throughout the state even as its death toll has grown by more than 300 people in the past two weeks.\nDr. Kristina Box also announced that 119 residents of long-term care facilities had died with COVID-19 illnesses, a steep jump from what state officials had previously reported.\nBox said she was “cautiously optimistic” that steps such as the statewide stay-at-home order have slowed down the growth of COVID-19 infections and allowed Indiana hospitals to maintain their capacity to treat seriously ill patients.\n“We may be seeing that peak flattened and that kind of plateauing effect,” Box said during the governor’s daily coronavirus briefing.\nBox said earlier this week she expected the coronavirus illness peak to arrive in late April for the Indianapolis area and the first weeks of May for rest of the state.\nIndiana’s death toll from the coronavirus outbreak has nearly quadrupled since the beginning of April. State health officials on Wednesday reported 49 additional deaths.\nThe new COVID-19 death reports occurred between March 28 and Tuesday, increasing the state’s total to 436 deaths, according to the Indiana State Department of Health. Agency statistics show that 111 coronavirus deaths had occurred through March 31.\nTests also confirmed 440 more COVID-19 illnesses, boosting Indiana’s total number of cases to nearly 9,000.\nAlmost 90% of Indiana’s deaths have been among people ages 60 and older as elderly people and those with serious health troubles living in nursing homes are among the most at-risk from COVID-19 infections.\nThe 119 deaths that Box said Wednesday were of people from long-term care and residential facilities represent 27% of the state’s fatalities.\nThe state health department said Monday that at least 46 residents of 12 long-term care facilities in Indiana had died with coronavirus infections, including 22 patients from an Anderson nursing home.\nThe larger death tally comes from updated information that health officials have received since last week, the agency said.\n“That’s heartbreaking but it’s unfortunately an expected disparity, knowing that these individuals in these facilities are our highest-risk population, based on their age and their chronic health conditions,” Box said.\nTesting has confirmed 681 residents with COVID-19 at 152 nursing homes around the state, along with 512 infected staff members and one employee death, Box said.\nGov. Eric Holcomb’s stay-at-home order that restricts which businesses may be open took effect March 25 and he has said he will announce Friday whether he’ll make any changes.\n“It would be a much different, much different picture today if Hoosiers weren’t all in this together playing by the rules,” Holcomb said Wednesday. “What we can’t do is pull up short.”", "url": "https://apnews.com/253a8321631f2fe9f9bcba684f93eaa9"}