{"authors": ["Maeve Reston"], "date_download": "2020-05-04 16:20:09", "date_modify": "2020-05-04 16:20:09", "date_publish": "2020-04-05 12:08:10", "description": "For more than a year on the campaign trail, Bernie Sanders, Elizabeth Warren and other Democratic presidential contenders spoke at nearly every event about the number of families in America who were living at the precipice, one paycheck away from losing everything -- even as the economy was booming.", "filename": "2020_04_05_politics_social-safety-net-coronavirus_index_1588609209.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403211428-03-almendarerz-family-photo-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_social-safety-net-coronavirus_index_1588609209.html", "title": "Laid-off workers struggle with no social safety net", "title_page": "Laid-off workers struggle with no social safety net - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Los Angeles (CNN) For more than a year on the campaign trail, Bernie Sanders , Elizabeth Warren and other Democratic presidential contenders spoke at nearly every event about the number of families in America who were living at the precipice, one paycheck away from losing everything -- even as the economy was booming.\nNow that scenario is playing out in real time across the country, exposing the threadbare social safety net in America for minimum-wage workers and amplifying the drumbeat from labor unions for policies that would do more to protect the working class.\nThe monumental job losses sweeping the country are already reshaping the presidential debate between Vice President Joe Biden and Sanders over universal health care coverage and how much more the government should be doing to help lower-wage workers.\nAs laid-off workers wait for unemployment checks and the promised relief from the stimulus bill passed by Congress, many are barely scratching out an existence. They're dipping into the last of their savings and counting on the patchwork of orders barring evictions of coronavirus-impacted families while facing the reality that these stay-at-home orders could last for another month or longer. The country lost 701,000 jobs in March , the Bureau of Labor Statistics reported on Friday. But the March jobs report does not capture the soaring jobless claims data from the past two weeks.\nThe cataclysmic effect of layoffs in the hospitality and tourism industries is especially pronounced in California, where a new Department of Labor report shows that 878,727 people filed for unemployment last week.\nA mid-March study for the American Hotel & Lodging Association by Oxford Economics predicted that California would have more hotel-related job losses (414,069) than any other state, followed by Florida, Texas and New York. (Overall, the American Hotel & Lodging Association estimates that as many as 44% of hotel employees have or will lose their jobs as a result of the coronavirus pandemic ).\nLabor leaders in California, who have been at the forefront in pressing for some of the most progressive policies in the nation hope the silver lining of this pandemic will be to convince more Americans that low-wage workers need more assistance. That includes the push for a national $15 dollar-an-hour minimum wage , a move supported by Biden and Sanders.\n'I'm very, very worried'\nAmong those teetering on the edge of financial disaster is Walter Almendarez, who worked for 23 years as a bellman in the elegant corridors of the famed Chateau Marmont, the landmark Los Angeles hotel where the likes of Charlize Theron and Marion Cotillard were routinely spotted on the patio.\nThe 43-year-old made enough on a salary of $15.45 an hour and tips to take care of his wife and his 7-month-old baby, while helping to support his 77-year-old father and 67-year-old mother, who both receive Social Security and live with Almendarez and his wife.\nThen coronavirus swept into California . In early March, Almendarez was asked to take a week's vacation, then a second. Finally on March 19, he was fired with no guarantee that he would be rehired after the crisis passed. For now, Almendarez and his wife are trying to make each pack of diapers last as long as possible.\nLast week, Almendarez was among 2,500 workers who drove to a mobile pantry distribution organized by the Los Angeles Federation of Labor to pick up a box filled with rice, pasta, powdered milk and plums, provided by the Los Angeles Regional Food Bank\nHe wasn't able to make the $1,500 payment due Wednesday on the family's rent-to-own house in Palmdale. And Tuesday brought a new anxiety for his wife: he said it was the last day the family had health insurance through his job.\nAs he waits in this excruciating period of uncertainty, Almendarez is joining forces with UNITE HERE Local 11, the union that represents many hotel and tourism workers in Los Angeles, to push for a city-wide law that would require hotel and tourism companies to hire back the workers they laid off first once the economy gets going again.\n\"I'm fighting. I'm fighting to help pass a law to give workers protections in the hopes that when the crisis is over I'll be able to get back to my job,\" Almendarez said. But, he added, \"I'm very, very worried. Honestly, we're really worried.... A baby not having health care ?\"\nUNITE HERE Local 11 and the Los Angeles Federation of Labor want to see worker recall laws implemented more broadly in Los Angeles and across the country. They believe they could be modeled on an ordinance that exists in Los Angeles for hotels in a certain geographical zone around LAX airport (which requires fired workers to be rehired if the hotel changes ownership), as well as a tourism employee recall law in Santa Monica that was passed after 9/11.\nThe Santa Monica ordinance \"worked great -- everyone got their job back after 9/11 and the Santa Monica tourism industry didn't miss a beat,\" said Kurt Petersen, a co-president of UNITE HERE Local 11. \"These ordinances are smart for industry,\" he said, adding that \"the smart companies\" are \"continuing to pay people, keeping them on payroll. Why? Because they're hoping this is going to turn around and they want to have their workers ready to go.\"\nPetersen noted that his union, which is a part of the LA Federation of Labor, represented more than 30,000 workers before the crisis. This month they will be down to 500 workers.\n\"Ninety-five percent of our membership is laid off,\" Petersen said. \"This makes 9/11 look like the good times. This is the worst, by far, catastrophe for the tourism industry that has ever happened, certainly in our modern times and I'm worried about how long it's going to take to come back.\"\nAs workers wait for help from the stimulus bill and hope the state can quickly process unemployment claims , several said in interviews they simply don't know yet how they will get by. They viewed the fact that the Trump administration agreed to enhanced unemployment benefits in the $2 trillion federal stimulus package as a positive sign there might be bipartisan collaboration on a phase-four relief package as the nation deals with the economic fallout of the coronavirus crisis.\nBeyond that, the presidential election in November and the change it could bring feels a long way off. Smaller incremental policy changes, like the one under consideration by the Los Angeles City Council, feel potentially more impactful to some in the short term.\nIn Sanders' proposal to deal with Covid-19 , the Vermont senator has argued that big hotel companies or airlines receiving government bailouts or loans as a result of Covid-19 must be required to protect and retain their workers. The Vermont senator would place conditions on the federal assistance to ensure any corporation receiving aid \"does not lay off workers, pays workers a livable wage, provides equity to the government, puts workers on corporate boards, and does not rip-off consumers.\"\nBiden's \"emergency action plan to save the economy\" advocated for expediting aid to businesses who commit to helping workers stay employed through the crisis and said he favored making \"Americans whole for lost hours and wages.\" The former vice president has also criticized President Trump for refusing to reopen the federal Affordable Care Act marketplace, which could help laid off workers find health insurance.\nAs fired hospitality workers strategize about how to get by in the near term, they are facing the fact that the job market has dried up while wondering whether it's safe to work at all in California, which is under a stay-at-home order for all but essential workers.\nAlmendarez considered picking up some extra cash by helping a neighbor move, but then was too worried that he would risk exposing everyone in his household to the coronavirus.\nFrancisco Gonzalez, a 39-year-old airport cargo driver at LAX, applied for unemployment after he was laid off on March 24. He considered looking for other work, but he still wants his old job back. And he doesn't feel that any industry is safe from the pandemic right now. Even after a brief trip to shop for groceries, he noticed that the latex gloves he was wearing were filthy after touching the cart.\n\"I thought, Oh my god, I better throw these away immediately as soon as I get home and wash my hands,\" Gonzalez said. \"I watch everything I bring into the house. I'm very worried still, because the coronavirus could be up in the air, not even where all the hands were touching. It's crazy. I'm concerned for everyone in my family, my mom, my brother, everybody in the community and especially my co-workers that are putting themselves at risk at the (airport) terminals.\"\nGonzalez, who was making $15.25 an hour, keeps checking online for clues as to when an unemployment check might arrive, but there are no signs of a deposit yet. His savings might get him by for a few months, he said, \"but with food, I'm going to run out eventually.\"\nHe heard about the food distribution organized by the LA Federation of Labor, but he had no transportation to get there.\n\"Every day I have to eat. But I limit myself,\" Gonzalez said. He bought a bag of potatoes, rice and beans, and some eggs to boil. \"Only two bags of tortillas -- that's how worried I am. When I run out, that's when I'm afraid. Because I don't know what kind of resources I am going to get.\"", "url": "https://www.cnn.com/2020/04/05/politics/social-safety-net-coronavirus/index.html"}