{"authors": ["Reporter"], "date_download": "2020-05-04 20:13:42", "date_modify": "2020-05-04 20:13:42", "date_publish": "2020-04-29 01:49:46", "description": "Tarana Burke, the activist behind the anti-sexual violence movement, did not outright denounce Joe Biden when weighing in on Tara Reade's accusations.", "filename": "entry_me-too-tarana-burke-biden-allegations_n_5ea8a4c1c5b61f8313363010_1588623222.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8ca1d220000960c827d31.jpeg?cache=7ovqw3xnci&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_me-too-tarana-burke-biden-allegations_n_5ea8a4c1c5b61f8313363010_1588623222.html", "title": "Me Too Founder: Biden Could Show 'What It Looks Like To Be Both Accountable And Electable'", "title_page": "Me Too Founder: Biden Could Show 'What It Looks Like To Be Both Accountable And Electable' | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "The founder of the Me Too movement spoke up on Tuesday to explain what she believes is an “inconvenient truth” about the sexual assault allegations against Joe Biden, the presumptive Democratic presidential nominee.\nTarana Burke, who founded Me Too in 2007, said former congressional aide Tara Reade’s accusations against Biden are being felt differently because of the 2020 election, which will now feature two men in powerful positions who have been accused of sexual assault.\nBut first, she made clear where she stands with any survivor of sexual assault in a series of tweets.\n“My stance has never wavered: survivors have a right to speak their truth and to be given the space to heal,” she wrote.\n“The inconvenient truth,” Burke added, “is that this story is impacting us differently because it hits at the heart of one of the most important elections of our lifetime. And I hate to disappoint you but I don’t really have easy answers.”\nThe inconvenient truth is that this story is impacting us differently because it hits at the heart of one of the most important elections of our lifetime. And I hate to disappoint you but I don’t really have easy answers.\n3/14 — Tarana (@TaranaBurke) April 28, 2020\nThere are no perfect survivors. And no one, especially a presidential candidate, is beyond reproach. So where does that leave us?\n4/14 — Tarana (@TaranaBurke) April 28, 2020\nReade is one of eight women who have come forward to accuse Biden of touching them inappropriately at various times in his political career.\nReade said then-Senator Biden assaulted her in 1993 while she was serving as an aide. In a podcast interview with Katie Halper in March, Reade said he kissed her and penetrated her with his fingers without her consent.\nReade told Halper that she pushed Biden away, which allegedly prompted him to say, “Come on, man! I heard you liked me.”\nThen, Reade said, Biden pointed at her and said, “You’re nothing to me.”\nThe accusations come as Biden recently became the last Democrat standing in the race for party’s presidential nomination. His campaign denied the claims against him in a statement to HuffPost in late March.\n“Women have a right to tell their story, and reporters have an obligation to rigorously vet those claims,” Biden spokesperson Kate Bedingfield said in a statement to HuffPost at that time. “We encourage them to do so, because these accusations are false.”\nThis is a story that @ReadeAlexandra has been trying to tell since it happened in 1993. It's a story about sexual assault, retaliation and silencing. #meToo https://t.co/yHz3iFi9a5 — Katie Halper (@kthalps) March 25, 2020\nOn Twitter, Burke said Reade, like other survivors, has had to rely on journalists and mainstream media to have her voice and accusations heard ― “precisely because the systems for survivors are not in place.”\nBurke then suggested that Biden could be both “accountable and electable” for Democrats in the 2020 election, adding that the former vice president faced a “learning curve” when it comes to respecting women’s boundaries.\n“The defense of Joe Biden shouldn’t rest on whether or not he’s a ‘good guy’ or ‘our only hope.’ Instead, he could demonstrate what it looks like to be both accountable and electable,” she wrote.\n“Meaning, at minimum, acknowledging that his demonstrated learning curve around boundaries with women, at the very least, left him open to the plausibility of these claims,” Burke continued. “No matter what you believe, we are allowed to expect more of the person running for U.S. President.”\nOn the one hand, Tara Reade has been afforded the opportunity to speak her truth through mainstream media reporting on her claims and ongoing investigative journalism.\n9/14 — Tarana (@TaranaBurke) April 28, 2020\nShe should have been able to come forward in a process where she was treated fairly, in a trusted system. Instead, like other public survivors before her, she had to rely on journalists in order to be heard - precisely because the systems for survivors are not in place.\n10/14 — Tarana (@TaranaBurke) April 28, 2020\nOn the other hand, the defense of Joe Biden shouldn’t rest on whether or not he's a “good guy” or “our only hope.” Instead, he could demonstrate what it looks like to be both accountable and electable.\n11/14 — Tarana (@TaranaBurke) April 28, 2020\nMeaning, at minimum, acknowledging that his demonstrated learning curve around boundaries with women, at the very least, left him open to the plausibility of these claims.\nNo matter what you believe, we are allowed to expect more of the person running for U.S. President.\n12/14 — Tarana (@TaranaBurke) April 28, 2020\nBurke also suggested that the current judicial system doesn’t allow for a “transformative approach to dealing with claims of sexual violence” that supports “both accountability and healing.”\nSome activists have criticized what they see as a lack of support for Reade ― and a failure to strongly condemn Biden ― in the weeks that followed her decision to describe the alleged assault in full detail.\nWhen Dr. Christine Blasey Ford was defending herself to Congress after alleging that then-Supreme Court nominee Brett Kavanaugh had assaulted her in the early 1980s, many members of the Me Too movement stood behind Ford and offered full-throated support.\nDays after Kavanaugh was confirmed as a justice, Burke wrote Ford a public letter, praising her heroism and ability to face “the patriarchy with no weapons other than her voice, her body, and the truth.”\nActress Rose McGowan, who emerged as an outspoken advocate for the Me Too movement in 2017, aired her concern on Twitter this weekend.\n“Where are the #SilenceBreakers? Where is Tarana Burke? Where is #MeToo,” she tweeted Sunday.\nIn her Twitter thread, Burke explained that she had taken some time off from her activism because she had family affected by the current coronavirus outbreak in the U.S.\nWhere are the #SilenceBreakers? Where is Tarana Burke? Where is #MeToo? — rose mcgowan (@rosemcgowan) April 26, 2020\nBurke also cast doubt on the intentions of those who have a heightened interest in Reade’s case, suggesting that they were actually more interested in Biden’s political demise.\n“Most people weighing in at the moment don’t actually care about transforming a culture of sexual violence,” she wrote. “Many of you are only interested in this story because you are entertained by the trauma of others or because it has the potential to be politically expedient ― with no real regard for the survivor.”\nTo that end, Burke said that survivors “deserve more than being used as a political football by disinterested parties.”\nThis is where we are. We don’t have a guidebook for this, in part because it would take a willingness from ALL of us to write it.\n13/14 — Tarana (@TaranaBurke) April 28, 2020\nSurvivors deserve more than being used as a political football by disinterested parties. And a culture of acknowledging harm can’t exist if we continue to view sexual violence as a catastrophic outlier rather than an embedded toxic element of our culture.\n14/14 — Tarana (@TaranaBurke) April 28, 2020\nRead Burke’s full thread here.\nThe headline of this article has been updated to clarify the context of Burke’s tweets.", "url": "https://www.huffpost.com/entry/me-too-tarana-burke-biden-allegations_n_5ea8a4c1c5b61f8313363010"}