{"authors": ["Michael Balsamo"], "date_download": "2020-05-04 20:26:13", "date_modify": "2020-05-04 20:26:13", "date_publish": "2020-04-17 04:27:09", "description": "WASHINGTON (AP) — President Donald Trump’s former lawyer and longtime fixer Michael Cohen will be released from federal prison to serve the remainder of his sentence in home confinement because of...", "filename": "_59c6d83d3ecde86375c2c97683887fde_1588623973.html", "image_url": "https://storage.googleapis.com/afs-prod/media/4bc8190cc57c4a27ad8202f107b89b94/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_59c6d83d3ecde86375c2c97683887fde_1588623973.html", "title": "Ex-Trump lawyer Cohen to serve out prison sentence at home", "title_page": "Ex-Trump lawyer Cohen to serve out prison sentence at home", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this May 6, 2019, file photo, Michael Cohen, former attorney to President Donald Trump, leaves his apartment building before beginning his prison term in New York. President Trump’s former lawyer and longtime fixer Cohen will be released from federal prison to serve the remainder of his sentence in home confinement amid the coronavirus pandemic, a person familiar with the matter told The Associated Press. (AP Photo/Kevin Hagen, File)\nFILE - In this May 6, 2019, file photo, Michael Cohen, former attorney to President Donald Trump, leaves his apartment building before beginning his prison term in New York. President Trump’s former lawyer and longtime fixer Cohen will be released from federal prison to serve the remainder of his sentence in home confinement amid the coronavirus pandemic, a person familiar with the matter told The Associated Press. (AP Photo/Kevin Hagen, File)\nWASHINGTON (AP) — President Donald Trump’s former lawyer and longtime fixer Michael Cohen will be released from federal prison to serve the remainder of his sentence in home confinement because of the coronavirus pandemic.\nCohen is currently locked up at FCI Otisville in New York after pleading guilty to numerous charges, including campaign finance fraud and lying to Congress. He will remain under quarantine for 14 days before he is released. Federal statistics show 14 inmates and seven staff members at the prison have tested positive for the coronavirus.\nAfter he is released, Cohen will serve the remainder of his sentence at home, according to a Justice Department official and another person familiar with the matter. They could not discuss Cohen’s release publicly and spoke to The Associated Press on condition of anonymity.\nPrison advocates and congressional leaders have been pressing the Justice Department for weeks to release at-risk inmates ahead of a potential outbreak, arguing that the public health guidance to stay 6 feet (1.8 meters) away from other people is nearly impossible behind bars.\nAttorney General William Barr ordered the Bureau of Prisons earlier this month to increase the use of home confinement and expedite the release of eligible high-risk inmates, beginning at three prisons identified as coronavirus hot spots. Otisville is not one of those facilities.\nAs of Thursday, 473 federal inmates and 279 Bureau of Prisons staff members had tested positive for the coronavirus at facilities across the U.S. Eighteen inmates have died since late March.\nMany federal inmates have been seeking home confinement as the number of coronavirus cases grows in the federal prison system, but advocates have accused the Bureau of Prisons of moving too slowly to release inmates. The Bureau of Prisons said it had moved more than 1,000 inmates to home confinement since March 26, when Barr first issued a directive to increase its use in late March. The agency said it is a “tremendous logistical lift that was accomplished through the marshaling of all of BOP’s resources.”\nThe Justice Department official said Barr had told senior officials at the Bureau of Prisons when he first issued his directives that they must scrupulously apply the same criteria to all inmates and not give anyone special treatment.\nOn Friday, the Bureau of Prisons said it was moving about 111 inmates — most of whom are likely to qualify for home confinement or furlough — from the prison camp at Otisville into the medium-security prison at the facility so they could begin a quarantine period, which would be required before they could be released, as their records are reviewed.\nA federal judge had denied Cohen’s attempt for an early release to home confinement after serving 10 months in prison and said in a ruling earlier this month that it “appears to be just another effort to inject himself into the news cycle.” But the Bureau of Prisons can take action to move him to home confinement without a judicial order.\nCohen, 53, began serving his sentence last May and was scheduled to be released from prison in November 2021.\nOther high-profile inmates have also been released as the number of coronavirus cases soars. Last week, a judge ordered Michael Avenatti — the attorney who rose to fame representing porn star Stormy Daniels in lawsuits against Trump — to be temporarily freed from a federal jail in New York City and stay at a friend’s house in Los Angeles. Avenatti had said he was at high risk of getting the coronavirus because he had a recent bout with pneumonia and his cellmate at the Metropolitan Correctional Center in Manhattan was removed due to flu-like symptoms.\nFull Coverage: Politics\nFormer New York state Senate leader Dean Skelos, 72, who was also serving a sentence at Otisville, is also expected to be released soon from prison to home confinement after testing positive for the coronavirus, prosecutors told a judge Wednesday.\nCNN first reported Cohen was being released to home confinement.\nA spokesman for the U.S. attorney’s office in Manhattan declined to comment.\nThe Bureau of Prisons said Friday the death of a case manager working at USP Atlanta is being considered the first potential coronavirus death of a federal prisons staff member. Robin Grubbs, who had worked at BOP since 2007, was found dead at her home Tuesday and posthumously tested positive for coronavirus, according to an agency spokesman. Officials said she had last worked at the Atlanta prison on April 10 and appeared to be asymptomatic. A cause of death is undetermined.\n___\nAssociated Press writer Larry Neumeister in New York contributed to this report.", "url": "https://apnews.com/59c6d83d3ecde86375c2c97683887fde"}