{"authors": ["Drew Kann"], "date_download": "2020-05-04 16:28:29", "date_modify": "2020-05-04 16:28:29", "date_publish": "2020-04-07 20:39:56", "description": "With the state of California under a stay-at-home order for the last several weeks because of the threat of coronavirus, Los Angeles' notoriously dirty air has dramatically improved.", "filename": "2020_04_07_us_los-angeles-p_4177cbf7eb01e93ff1574c88468d6384_index_1588609709.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407155507-04-los-angeles-smog-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_us_los-angeles-p_4177cbf7eb01e93ff1574c88468d6384_index_1588609709.html", "title": "Los Angeles has notoriously polluted air. But right now it has some of the cleanest of any major city", "title_page": "Los Angeles has notoriously polluted air. But right now it has some of the cleanest of any major city - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The mental image many people have of the Los Angeles skyline is one obscured by smog, with thick air pollution hanging over its downtown buildings.\nBut with the city -- and the entire state of California -- under stay-at-home orders to stem the deadly outbreak of coronavirus, something dramatic has happened to the air in LA.\nOn Tuesday, LA saw some of the cleanest air of any major city in the world , according to IQAir, a Swiss air quality technology company which also monitors pollution levels in cities around the globe.\nEPA data shows that in March of this year, the Los Angeles area experienced the longest stretch of \"good\" air quality since at least 1995.\nAnd beginning in early March of this year, EPA air quality data shows that the city of Angels experienced its longest stretch of \"good\" air quality since at least 1995.\nDr. Yifang Zhu, a professor of environmental health sciences at UCLA's Fielding School of Public Health, said that she and her colleagues identified a similar trend.", "url": "https://www.cnn.com/2020/04/07/us/los-angeles-pollution-clean-air-coronavirus-trnd/index.html"}