{"authors": ["Charles Riley", "Cnn Business"], "date_download": "2020-05-04 16:13:51", "date_modify": "2020-05-04 16:13:51", "date_publish": "2020-04-03 11:49:24", "description": "President Donald Trump set off a record spike for US crude futures on Thursday with a tweet saying he expected Russia and Saudi Arabia to cut production by as much as 15 million barrels per day.", "filename": "2020_04_03_investing_premarket-stocks_index_1588608831.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403100434-mbs-trump-file-2017-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_investing_premarket-stocks_index_1588608831.html", "title": "Coronavirus may be upending the rules of the global oil game", "title_page": "Premarket stocks: Coronavirus may be upending the rules of the global oil game - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here\nLondon (CNN Business) President Donald Trump set off a record spike for US crude futures on Thursday with a tweet saying he expected Russia and Saudi Arabia to cut production by as much as 15 million barrels per day.\nUS oil prices soared before closing with a record single-day record gain of 25%. Why such enthusiasm? Russia and Saudi Arabia are locked in a brutal price war, and coordinated production cuts could soak up excess supply and boost prices.\nTrump, who needs prices to rise significantly to prevent a wave of bankruptcies among US shale producers, got what he wanted. But there were reasons to question the veracity of what the president tweeted.\nProblem 1: Trump said he had just spoken to his friend, the crown prince of Saudi Arabia, who had spoken to Russian President Vladimir Putin. But the Kremlin denied that such a phone call had taken place.\nProblem 2: The American president said that he expects Russia and Saudi Arabia to cut production by as many as 10 million barrels per day, and potentially up to 15 million barrels per day. But the lower end of that range is equal to all of Saudi Arabia's production.\nThe big picture? Saudi Arabia and Russia have been locked in their price war since early March, flooding the oil market with cheap crude just as demand is cratering because of the coronavirus pandemic. Crude has crashed to 18-year lows, crushing American oil companies and energy stocks.\nMany analysts are skeptical that Russia and Saudi Arabia are ready to set aside their differences, especially with so many US shale producers under extreme pressure from low oil prices. But the coronavirus pandemic may be changing the rules of the game\n\"Russia's objective was to hurt US shale,\" said Stephen Innes, the chief global markets strategist at AxiCorp. \"Well, that's all fine and dandy when Covid-19 was thought to be a brief health scare, but now the virus's economic hit is morphing into the most significant ... since the 'Great Depression.'\"\nWhat happens next: OPEC will hold an emergency meeting Monday, called by Saudi Arabia, according to two senior sources at OPEC. Other producers who are not OPEC members will be invited to the meeting, the sources said.\nThe question is whether OPEC and allied producers will agree to resume production cuts, and if so, at what scale. Some analysts think Russia won't agree to cut without a similar commitment from the United States.\nUS participation in coordinated production cuts would be ... tricky. Doing so runs counter to the country's free market ethos, and it's not clear whether the president would have legal authority to order hundreds of producers to limit their output. Then again, coronavirus may be changing the rules of the game.\nSome US oil producers have urged officials in Texas to impose caps on the state's oil production. The Railroad Commission of Texas, which regulates the state's energy industry, hasn't exercised that power in more than 40 years.\nRyan Sitton, a commissioner at the regulator, said Thursday he had a \"great conversation\" with Russian Energy Minister Alexander Novak in which they discussed the need to remove 10 million barrels per day from global supply.\nPrices continued to advance Friday, recovering some of the massive plunge seen over the past month. Brent crude futures, the world's benchmark, were trading more than 6% higher at $31.56 a barrel.\nStay tuned: Trump is meeting with US oil producers on Friday. Putin is meeting the heads of major Russian energy companies.\nThe US jobs market is under huge pressure\nThe past three weeks have marked one of the most devastating periods in history for the American job market. The chart shown above is almost unbelievable — it shows that 6.6 million workers filed for unemployment benefits last week, double the previous record.\nOn Friday, new data showed the US economy shed 701,000 jobs in March. It was the first monthly jobs loss since September 2010, and much worse than analysts had expected. The unemployment rate moved up to 4.4%, from a near 50-year low of 3.5%.\nBig picture: The March report's drop in jobs \"will likely be dwarfed by job losses closer to 10 million in April, with the unemployment rate rising above 10%,\" economists at Citi said in a research note.\nThe next jobs report is due on May 8, and will be a far better measure of the pandemic's impact. James Bullard, president of the Federal Reserve of St. Louis, said the unemployment rate could soar as high as 30%.\n\"Sadly we're only at the start of this process. There are around 18 million jobs, mostly in the service sector, at risk from social distancing,\" said James McCann, senior global economist at Aberdeen Standard Investments.\nGet ready for wartime levels of national debt\nGovernments are launching one rescue package after another in hopes of preventing economic catastrophe as the coronavirus pandemic rampages around the world.\nIn most countries, political opposition to spending increases funded by borrowing has vanished in the face of a potential global depression. But the trillions of dollars in support promised to households and businesses will push up budget deficits to their highest levels since the global financial crisis.\nIn the United States, the wave of stimulus spending could push debt as a share of the economy to levels not seen since the end of the World War II.\nSpending increases and tax cuts have already pushed US government debt up to $17 trillion, doubling the country's debt to GDP ratio to nearly 80% since 2008. According to Commerzbank, the coronavirus relief packages approved so far will push that figure to 96% by 2022.\n\"Should Congress pass further aid packages and should the economic damage be greater than previously assumed, the previous record set in 1946 (106%) could be surpassed,\" Bernd Weidensteiner, one of the German bank's economists, wrote recently.\nUp next\nHappening today:", "url": "https://www.cnn.com/2020/04/03/investing/premarket-stocks/index.html"}