{"authors": [], "date_download": "2020-05-04 20:24:35", "date_modify": "2020-05-04 20:24:35", "date_publish": "2020-04-29 19:56:45", "description": "Officials say most children will only contract mild cases of the virus, but some have developed a rare inflammatory syndrome.", "filename": "entry_who-covid-19-cases-mild-children_n_5ea9d901c5b60db2c79dbff4_1588623875.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9da592500004611eb0942.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_who-covid-19-cases-mild-children_n_5ea9d901c5b60db2c79dbff4_1588623875.html", "title": "WHO Says 'Vast Majority' Of Kids With COVID-19 Will Recover Completely", "title_page": "WHO Says 'Vast Majority' Of Kids With COVID-19 Will Recover Completely | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "GENEVA (Reuters) - The “vast majority” of children with COVID-19 have mild cases and recover completely, but a small number in a few countries have developed a rare inflammatory syndrome, the World Health Organization (WHO) said on Wednesday.\nItalian and British medical experts are investigating a possible link between the coronavirus pandemic and clusters of severe inflammatory disease in infants who are arriving in hospital with high fever and swollen arteries.\nThree U.S. children infected with the virus are being treated for a rare inflammatory syndrome that appears similar to one that has raised concerns in Britain, Italy and Spain, a specialist treating them told Reuters on Tuesday.\n“I want to emphasize, for all the parents out there, the vast, vast majority of children who get COVID will have mild symptoms and recover completely,” Dr Mike Ryan, the WHO’s top emergencies expert, told a virtual news conference on Wednesday.\nRyan declined comment on reports that Gilead Science’s antiviral drug Remdesivir could help treat COVID-19, saying further data was needed from clinical trials already under way.\n“But we are hopeful this drug and others may prove to be helpful in treating COVID-19,” he said.\nMore than 3.11 million people have been reported to be infected by the novel coronavirus around the world, and more than 216,000 have died, according to a Reuters tally on Wednesday.\nCLINICIANS ON ALERT\nUntil now, children have largely escaped some of the more serious complications of COVID-19, which has hit older adults and those with chronic conditions hardest.\nThe WHO’s clinical network has discussed the report from Britain about a small number of children with an inflammatory response, WHO epidemiologist Dr. Maria van Kerkhove said.\n“There are some recent rare descriptions of children in some European countries that have had this inflammatory syndrome, which is similar to Kawasaki syndrome, but it seems to be very rare,” she said.\n“We have asked the global network of clinicians to be alert on this so they capture information systematically, so we can better understand and guide treatment.”\nRyan, asked about Sweden’s strategy of shunning lockdowns and allowing most schools and businesses to remain open, said: “If we are to reach a ‘new normal’, in many ways Sweden represents a future model.”\n“What it has done differently is that it really, really has trusted its own communities to implement that physical distancing,” he said, adding that Sweden had put in place a “very strong public health policy”.\nWHO Director-General Tedros Adhanom Ghebreyesus defended the agency’s record in handling the pandemic since the new virus emerged late last year in the central Chinese city of Wuhan.\nThe Geneva-based U.N. body has been heavily criticized in recent weeks, especially by its top donor, the United States, which has cut off funding.\nTedros presented a timeline of what the agency knew when in the lead-up to declaring COVID-19 a global emergency on Jan. 30.\n“From the beginning, the WHO has acted quickly and decisively to respond to warn the world,” he said. “We sounded the alarm early, and we sounded it often.”", "url": "https://www.huffpost.com/entry/who-covid-19-cases-mild-children_n_5ea9d901c5b60db2c79dbff4"}