{"authors": ["Veronica Stracqualursi"], "date_download": "2020-05-04 16:55:34", "date_modify": "2020-05-04 16:55:34", "date_publish": "2020-04-08 13:18:16", "description": "US intelligence officials were warning as far back as late November that the novel coronavirus was spreading through China's Wuhan region and posing a threat to its people and daily life, according to ABC News.", "filename": "2020_04_08_politics_us-intelligence-report-china-coronavirus_index_1588611334.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200213150327-pentagon-building-aerial-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_us-intelligence-report-china-coronavirus_index_1588611334.html", "title": "ABC News: US intelligence warned of China's spreading contagion in November", "title_page": "ABC News: US intelligence warned of China's spreading contagion in November - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) US intelligence officials were warning as far back as late November that the novel coronavirus was spreading through China's Wuhan region and posing a threat to its people and daily life, according to ABC News.\nThe US military's National Center for Medical Intelligence (NCMI) compiled a November intelligence report in which \"analysts concluded it could be a cataclysmic event,\" one of the sources of the NCMI's report told ABC News.\nThe source told ABC News that the intelligence report was then briefed \"multiple times\" to the Defense Intelligence Agency, the Pentagon's Joint Staff and the White House.\nRepeated briefings were held through December across the US government, including the National Security Council, culminating in a detailed outline of the threat in the President's Daily Brief in early January, according to ABC News, whose report cited four sources briefed on the matter.\nThe report, which CNN has not independently verified, raised concerns because of the disease's potential threat to US military forces in Asia, ABC News reported.", "url": "https://www.cnn.com/2020/04/08/politics/us-intelligence-report-china-coronavirus/index.html"}