{"authors": [], "date_download": "2020-05-04 20:05:08", "date_modify": "2020-05-04 20:05:08", "date_publish": "2020-04-07 17:12:47", "description": "SIOUX FALLS, S.D. (AP) — The Latest on the coronavirus outbreak in South Dakota (all times local): 7:30 p.m. A school employee on the Pine Ridge Reservation has a confirmed diagnosis...", "filename": "_ad9024925886838b1da5ec6bbc2870db_1588622708.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9756ec6119504dada766b624e73d2ed5/720.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ad9024925886838b1da5ec6bbc2870db_1588622708.html", "title": "The Latest: School employee on Pine Ridge has COVID-19", "title_page": "The Latest:  School employee on Pine Ridge has COVID-19", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Wednesday, March 18, 2020 file photo, South Dakota Gov. Kristi Noem, left, updates media on the COVID-19 pandemic during a press conference at Monument Health in Rapid City, S.D. Gov. Noem on Monday, April, 6, 2020, doubled down on her effort to allow non-essential businesses in South Dakota to stay open through the coronavirus crisis despite calls for more action.The Republican governor did dial up the pressure on businesses and people particularly at-risk of hospitalization to limit the spread of infections. (Jeff Easton/Rapid City Journal via AP, File)\nFILE - In this Wednesday, March 18, 2020 file photo, South Dakota Gov. Kristi Noem, left, updates media on the COVID-19 pandemic during a press conference at Monument Health in Rapid City, S.D. Gov. Noem on Monday, April, 6, 2020, doubled down on her effort to allow non-essential businesses in South Dakota to stay open through the coronavirus crisis despite calls for more action.The Republican governor did dial up the pressure on businesses and people particularly at-risk of hospitalization to limit the spread of infections. (Jeff Easton/Rapid City Journal via AP, File)\nSIOUX FALLS, S.D. (AP) — The Latest on the coronavirus outbreak in South Dakota (all times local):\n7:30 p.m.\nA school employee on the Pine Ridge Reservation has a confirmed diagnosis of COVID-19.\nThe president of Red Cloud Indian School posted on Facebook Tuesday that an employee of the Catholic school tested positive for the coronavirus.\nAccording to the post, an employee of Our Lady of Lourdes elementary school in Porcupine and spouse traveled to California for a medical procedure on March 26. The couple returned the next day to begin a precautionary 14-day quarantine at their home on the school campus. The couple had no contact with anyone during that time, with all groceries and other supplies left outside their front door.\nThe worker began feeling sick and went on April 3 to the Indian Health Service hospital in Pine Ridge, where staff told the couple to travel to another facility in Martin.\nThe Rapid City Journal reports the employee’s preliminary test came back as positive on Tuesday, the same time the person began to experience respiratory distress. The employee is now being treated at a hospital in Rapid City. The spouse is also staying in Rapid City and will only return to Porcupine once their risk of infection has been ruled out.\n___\n5 p.m.\nSouth Dakota health officials said on Tuesday that an employee of the Walmart pharmacy in Yankton has tested positive for the coronavirus and could have infected others.\nHealth officials said the person may have transmitted the coronavirus while working at the pharmacy on March 25 and 30. They advised that customers of the pharmacy monitor themselves for symptoms of the coronavirus if they visited from 10 a.m. to 7 p.m. on March 25 or from 10 a.m to 2 p.m. on March 30.\nWalmart did not immediately respond to a request for comment.\n___\n1:45 p.m.\nGov. Kristi Noem on Tuesday asked South Dakotans to turn to prayer this week as she reiterated stronger executive orders that she says are necessary to delay a surge in hospitalizations from the coronavirus.\nIn a daily briefing, the Republican governor stressed the importance of following her executive orders from Monday. The orders tell businesses to limit gatherings and orders people in the hardest-hit area of the state stay home if they are over 65 or have chronic health problems. Her stay-at-home order only applies to people in Minnehaha and Lincoln counties, which account for most of the confirmed cases in the state.\nShe is also proclaiming Wednesday a day of prayer, referencing its significance for Christian and Jewish faiths.\nHealth officials reported two new deaths from the coronavirus on Tuesday, along with 32 new confirmed cases. The number of people who have tested positive rose to 320, and six people in total have died.\n___\n12:15 p.m.\nSouth Dakota health officials reported two new deaths from the coronavirus on Tuesday, as well as 32 new confirmed cases.\nThe total number of people who have tested positive rose to 320 in the state, and six people in total have died. Two people in their 50s and one person in each of the 60s, 70s, 80s and 90s age ranges has died.\nMinnehaha County, which is the most populated area in the state, accounted for over half of the positive test results. About 30% of people who tested positive have recovered.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. Older adults and people with existing health problems are among those particularly susceptible to more severe illness, including pneumonia.", "url": "https://apnews.com/ad9024925886838b1da5ec6bbc2870db"}