{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:59:08", "date_modify": "2020-05-04 16:59:08", "date_publish": "2020-04-09 18:41:21", "description": "Thursday marks Joe Biden's first official day as the de facto 2020 Democratic presidential nominee.", "filename": "2020_04_09_politics_joe-biden-vp-vice-president-pick_index_1588611548.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200310075735-02-kamala-harris-joe-biden-endorsement-0309-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_joe-biden-vp-vice-president-pick_index_1588611548.html", "title": "The Top 10 women Joe Biden might choose as his VP", "title_page": "The top 10 women Joe Biden might choose as his VP - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(This is the second edition of our biweekly power rankings of politicians most likely to be chosen as Joe Biden's Democratic running mate in 2020.)\nAnd one of the first big decisions Biden has to make in that race is who he will pick as his vice presidential nominee -- a process that he has signaled is already underway.\n\"You have to start now deciding who you're going to have background checks done on as vice presidential candidates and it takes time,\" Biden said last week of the VP vetting process.\nWhile the veep pick always matters -- less in terms of the electoral map than for what it says about how the potential president goes about making big decisions -- there's little question that this choice for Biden is a hugely high-stakes move. Biden will be 78 years old if/when he is sworn in as president in January 2021 -- by far the oldest person who has ever been elected to a first term.\nTo his credit, Biden has been open about his age as a factor in the race and the importance it puts on VP pick.\n\"[O]ne of the ways to deal with age is to build a bench -- to build a bench of younger, really qualified people who haven't had the exposure that others have had but are fully capable of being the leaders of the next four, eight, 12,16 years to run the country,\" Biden said last week at a virtual fundraiser.\nSo, who will Biden pick? We know it will be a woman -- he pledged that at the last Democratic debate last month -- but which one? Below my rankings of the 10 female politicians most likely to be that pick as of right now. (You can see my initial VP rankings here .) Don't see your pick? Don't think your favorite is ranked high enough? Never fear! We do this every two weeks! Stay tuned!\nNew Mexico Gov. Michelle Lujan Grisham\n10. Michelle Lujan Grisham: The New Mexico governor isn't well-known nationally -- despite serving three terms in the House before being elected to her current job in 2018. She's on the list because she's one of the highest-ranking Latina elected officials in the country -- and she represents an area of the country (the Southwest) that is : The New Mexico governor isn't well-known nationally -- despite serving three terms in the House before being elected to her current job in 2018. She's on the list because she's one of the highest-ranking Latina elected officials in the country -- and she represents an area of the country (the Southwest) that is growing like crazy . (Previous ranking: 10)\nStacey Abrams\n9. Stacey Abrams: If political Twitter picked the VP nominee, Abrams, who nearly won the Georgia governorship in 2018, would be the overwhelming No. 1 choice. Her 2018 race made her a star and her work on voting rights issues since then has kept her in the national spotlight. The biggest problem for Abrams? Experience. The highest office she has ever held is the state House. And Biden has repeatedly said that experience matters a huge amount to him; \"You've got to be able to turn and say to your vice president, 'This is your responsibility.' Because the job is too big anymore for any one man or woman,\" : If political Twitter picked the VP nominee, Abrams, who nearly won the Georgia governorship in 2018, would be the overwhelming No. 1 choice. Her 2018 race made her a star and her work on voting rights issues since then has kept her in the national spotlight. The biggest problem for Abrams? Experience. The highest office she has ever held is the state House. And Biden has repeatedly said that experience matters a huge amount to him; \"You've got to be able to turn and say to your vice president, 'This is your responsibility.' Because the job is too big anymore for any one man or woman,\" said the former VP last August . (Previous ranking: 7)\nFlorida Rep. Val Demings\n8. Val Demings: The Florida House member barely missed my : The Florida House member barely missed my original Top 10 but the more I thought about her, the more I thought Demings deserved a spot on the list. Here's why: Prior to coming to Congress, Demings was the first female police chief in Orlando, Florida. In her relatively brief time in the House -- she was first elected to the 10th District in 2016 -- she has rapidly become a rising star. Demings was one of seven House Democrats chosen by House Speaker Nancy Pelosi (Calif.) to serve as managers during the Senate impeachment trial of Trump. (Previous ranking: Unranked)\nWisconsin Sen. Tammy Baldwin\n7. Tammy Baldwin: If you believe that Wisconsin is the Midwestern state that Trump must win in order to claim a second term, well then picking a popular senator from the state makes a lot of sense for Biden. (Baldwin won reelection with 55% in 2018.) Plus, Baldwin would be a historic pick: The first : If you believe that Wisconsin is the Midwestern state that Trump must win in order to claim a second term, well then picking a popular senator from the state makes a lot of sense for Biden. (Baldwin won reelection with 55% in 2018.) Plus, Baldwin would be a historic pick: The first gay vice presidential nominee for either major party. (Previous ranking: 8)\nIllinois Sen. Tammy Duckworth\n6. Tammy Duckworth: Duckworth is my dark horse candidate to make Biden's eventual final three. Why? She's from the Midwest (Illinois). She would be an historic pick as the first Asian American to appear on a national ticket for a major party. And her personal story -- the Blackhawk helicopter she was piloting during the Iraq war was hit by a rocket-propelled grenade and Duckworth lost both legs and the full use of her right arm in the incident -- is incredible. (Previous ranking: 6)\nMassachusetts Sen. Elizabeth Warren\n5. Elizabeth Warren: The Massachusetts senator drops two spots this week because she doesn't fit two of Biden's stated criteria for his second-in-command. One, at 70, Warren is younger than Biden but not exactly of a different generation. Second, Biden said in New Hampshire last month that he wanted a VP with \"some correlation between their views and mine,\" specifically mentioning support for \"Medicare for All\" as a non-starter. While Warren waffled somewhat in her support for Medicare for All, she was definitely a vocal supporter of a government-run program for much of her presidential bid. (Previous ranking: 3)\nNevada Sen. Catherine Cortez Masto\n4. Catherine Cortez Masto: The Nevada senator isn't getting nearly as much buzz as some of the three people ranked above her on this list, but that may wind up being a good thing since early buzz isn't always an indicator of future success. (Remember vice presidential nominee Julián Castro in 2016?) And Cortez Masto has a very powerful advocate in former Senate Majority Leader (and Biden longtime colleague) Harry Reid. The Nevada senator isn't getting nearly as much buzz as some of the three people ranked above her on this list, but that may wind up being a good thing since early buzz isn't always an indicator of future success. (Remember vice presidential nominee Julián Castro in 2016?) And Cortez Masto has a very powerful advocate in former Senate Majority Leader (and Biden longtime colleague) Harry Reid. According to Mediaite , Reid recently told Biden that Cortez Masto is his pick for VP and Biden responded that she was in his top three. (Previous ranking: 5)\nMinnesota Sen. Amy Klobuchar\n3. Amy Klobuchar: Klobuchar has been in the news a lot of late -- for reasons she'd rather not be: Her husband was diagnosed with coronavirus. Thankfully : Klobuchar has been in the news a lot of late -- for reasons she'd rather not be: Her husband was diagnosed with coronavirus. Thankfully he returned home from the hospital late last month and the Minnesota senator has spoken about her husband's battle the virus. Depending on how dominant coronavirus is an issue in November, that sort of personal experience might matter to voters (and hence to Biden). Klobuchar also still has her Midwestern roots, record of winning easily in a swing-ish state and centrist politics working in her favor. (Previous ranking: 2)\nMichigan Gov. Gretchen Whitmer\n2. Gretchen Whitmer: It was lost on absolutely no one that the Michigan governor was : It was lost on absolutely no one that the Michigan governor was one of the first guests on Biden's new podcast -- and that on it he praised her as an \"outstanding governor\" and \"one of the most talented people in the country in my view.\" Whitmer's pragmatic politics are a nice fit with Biden's and her age -- she's 48 -- would make a clear generational bridge for Biden. Plus, Whitmer's profile has soared of late as she battles coronavirus in her state, and attacks from Trump on the job she is doing. (Previous ranking: 4)\nCalifornia Sen. Kamala Harris", "url": "https://www.cnn.com/2020/04/09/politics/joe-biden-vp-vice-president-pick/index.html"}