{"authors": ["Paul R. La Monica", "Cnn Business"], "date_download": "2020-05-04 16:23:15", "date_modify": "2020-05-04 16:23:15", "date_publish": "2020-04-06 14:33:44", "description": "JPMorgan Chase CEO Jamie Dimon used his annual shareholder letter to detail just how bad he thinks the US economy can get from the coronavirus pandemic.", "filename": "2020_04_06_investing_jamie-_12f34f40e4602c9e7d65e9d754e783b0_index_1588609395.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190918110033-jamie-dimon-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_investing_jamie-_12f34f40e4602c9e7d65e9d754e783b0_index_1588609395.html", "title": "Jamie Dimon predicts a 'major recession' is on its way", "title_page": "Jamie Dimon predicts a 'bad recession' due to coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) JPMorgan Chase CEO Jamie Dimon used his annual shareholder letter to detail just how bad he thinks the US economy can get from the coronavirus pandemic.\nDimon expects a \"bad recession,\" he wrote in the letter released Monday, saying that in the most adverse scenario, gross domestic product could plunge at a 35% annual rate in the second quarter and that a downturn would last through the rest of the year. The unemployment rate would spike as high as 14% in this environment.\nBut Dimon added that \"this scenario is quite severe and, we hope, unlikely.\" And even if the worst case situation bears out, JPMorgan Chase -- the largest US bank by assets -- still plans to lend an additional $150 billion to its customers.\n\"Recognizing the extraordinary extension of new credit ... and knowing there will be a major recession mean that we are exposing ourselves to billions of dollars of additional credit losses as we help both consumer and business customers through these difficult times,\" Dimon said in the letter\nJPMorgan Chase JPM Dimon stressed that the bank is in solid shape and has a \"fortress\" balance sheet. That is allowingto step up lending to small businesses and consumers in this time of crisis.\nRead More", "url": "https://www.cnn.com/2020/04/06/investing/jamie-dimon-jpmorgan-chase-shareholder-letter/index.html"}