{"authors": ["Alex Rogers", "Lauren Fox", "Phil Mattingly"], "date_download": "2020-05-04 15:58:01", "date_modify": "2020-05-04 15:58:01", "date_publish": "2020-04-07 16:17:57", "description": "Senate Majority Leader Mitch McConnell announced that the Senate will push this week for additional funds for a small business loan program to keep workers on the payroll during the coronavirus pandemic.", "filename": "2020_04_07_politics_senate-vote-small-business-loan-boost_index_1588607881.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200205170734-02-mcconnell-0205-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_senate-vote-small-business-loan-boost_index_1588607881.html", "title": "McConnell: Senate to boost small business loan program with possible action on Thursday", "title_page": "Mitch McConnell: Senate to boost small business loan program with possible action on Thursday - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Senate Majority Leader Mitch McConnell announced that the Senate will push this week for additional funds for a small business loan program to keep workers on the payroll during the coronavirus pandemic.\nLast month, Congress gave about $349 billion for the Paycheck Protection Program. But Treasury Secretary Steven Mnuchin said on Tuesday that he would speak with congressional leaders to secure $250 billion more for the program.\n\"It is quickly becoming clear that Congress will need to provide more funding or this crucial program may run dry,\" McConnell said. \"That cannot happen. Nearly 10 million Americans filed for unemployment in just the last two weeks. This is already a record-shattering tragedy and every day counts.\"\nMcConnell said he would work with Senate Democratic Leader Chuck Schumer and Mnuchin to approve the boost in funding for the program.\nThe Office of Management and Budget, in a letter to congressional leaders on Tuesday night, officially requested an additional $251 billion for the Small Business Administration loan program loan program that directs forgivable loans to businesses with fewer than 500 employees on the grounds the money is used to pay salaries, payroll expenses and other costs like mortgages, rent or utilities.\nRead More", "url": "https://www.cnn.com/2020/04/07/politics/senate-vote-small-business-loan-boost/index.html"}