{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:03:22", "date_modify": "2020-05-04 20:03:22", "date_publish": "2020-05-04 18:34:23", "description": "The militiaman’s comments, one civil rights activist said, \"crossed a moral line.\"", "filename": "entry_ammon-bundy-holocaust-jews-anti-lockdown-rally-idaho_n_5eb0371ac5b684fc457a1389_1588622602.html", "image_url": "https://img.huffingtonpost.com/asset/5eb03807300000c314155656.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_ammon-bundy-holocaust-jews-anti-lockdown-rally-idaho_n_5eb0371ac5b684fc457a1389_1588622602.html", "title": "Ammon Bundy Blames Jews For The Holocaust At Idaho Anti-Lockdown Rally", "title_page": "Ammon Bundy Blames Jews For The Holocaust At Idaho Anti-Lockdown Rally | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Anti-government extremist Ammon Bundy, speaking on the steps of the state Capitol building in Boise, Idaho, on Saturday, compared government measures to slow the spread of the coronavirus to the Nazis’ genocide of Jews during World War II.\nBundy, a notorious militia leader who once organized an armed takeover of an Oregon wildlife refuge, made the absurd comparison while speaking at an “Idaho Is Open For Business” rally ― one of several anti-lockdown demonstrations held across the country demanding that governors allow businesses to reopen despite the urgent warnings of public health experts.\nThe Boise rally appears to have been organized, in part, by an anti-vaccination conspiracy group called Health Freedom Idaho, together with the Idaho Freedom Foundation, a powerful far-right libertarian organization in the state with ties to right-wing billionaire Charles Koch.\nIn a speech at Saturday’s rally, Bundy compared the temporary closure of nonessential businesses in America to the systematic torture and murder of 6 million Jews by the Nazis.\n“Just look at the pictures of the Holocaust,” Bundy told the crowd of hundreds, according to a video of the event posted to YouTube. “It always amazes me how you see pictures of men and women stripped completely naked, lined up and facing a mass grave, where they are shooting them in the back of the head and falling in the grave.”\n“Now the answer to that is not easy ― but it is this, and I have been there and I know for a fact that this is true,” Bundy continued. “When you have faced so much tyranny in your life, there is a point when you would rather line up naked and get shot in the head. And my friends, why we’re here today right now is to make sure that never happens!”\nBundy’s alleged experience of “tyranny” is nothing compared to what European Jews experienced in the 1930s and ’40s.\nA major figure in right-wing militia and anti-government extremist circles, Bundy was acquitted in 2016 of federal conspiracy and weapons charges for his role in leading the armed takeover of the Malheur National Wildlife Refuge in Oregon. A federal judge also dismissed charges against Bundy stemming from a separate armed standoff with law enforcement in Nevada in 2014.\nJustin Sullivan via Getty Images Ammon Bundy speaks to members of the media in front of the Malheur National Wildlife Refuge Headquarters on Jan. 6, 2016, near Burns, Oregon.\nBundy argued Saturday that Jews essentially let themselves be murdered by Nazis because “they thought that putting their head down and trying to not be noticed was the better way. They thought that compliance would get them through it, and it was just a period of time that they might just pass through and end up better on the other end.”\n“And that is a decision that we have to make right now,” Bundy said. “Are we better to just comply?”\nEric Ward, executive director at the Western States Center, a civil rights organization that monitors extremists, said Bundy “crossed a moral line” with his remarks.\n“It was egregious,” Ward told HuffPost. “I mean, it was historical revisionism. It wasn’t a denial of the Holocaust, but it utilized one of the talking points that is often used by Holocaust deniers, which is this idea that Jews were responsible for their own genocide, and that is effectively blaming Jews for their own deaths. It is disturbing and it is offensive that a major argument point from Holocaust revisionism would be utilized in this moment.”\nWard added that anti-lockdown protesters like Bundy, who have at times associated with white nationalists, have no “moral ground” to compare themselves to Jews during the Holocaust.\nJEFF KOWALSKY via Getty Images Protesters try to enter the Michigan House of Representatives chamber and are kept out by state police after the American Patriot Rally organized by Michigan United for Liberty in Lansing, Michigan, on April 30, 2020.\nThat Bundy was given a platform to speak at the Boise rally highlights how the anti-lockdown protests have been organized and attended largely by far-right extremists, including heavily armed militias, neo-fascist street gangs, anti-vaxxers, conspiracy theorists and neo-Nazis.\n“These aren’t protests, right?” Ward said. “These are calls for future violence. And I think we should all be very clear about what’s happening, and what Ammon Bundy is helping to support in this moment.”\nOver the past month, shocking footage has emerged from various state capitols showing hundreds of protesters flouting social distancing guidelines to demand that economies be reopened ― a decision that public health experts say would dramatically increase the death toll in the U.S.\nThe rallies — largely organized on Facebook and funded in part by dark money groups with ties to billionaire right-wing donors — often include participants carrying big guns and talking about the “boogaloo,” a far-right term for civil war. Last week in Lansing, Michigan, one such armed faction walked into the state Capitol and demanded to confront the legislature, which was set to vote on extending state quarantine orders.\nPolls show that a considerable majority of Americans support government measures to slow the spread of the coronavirus, which has already killed nearly 70,000 people in the U.S. But anti-lockdown protesters have received support from Fox News and the president of the United States, who last month tweeted that states needed to be liberated from shutdowns.\nBundy has spearheaded multiple anti-lockdown stunts during the pandemic. Last month he held a crowded Easter Sunday church service in Emmett, Idaho, in defiance of state orders against mass gatherings.\nHe also led a protest in Meridian, Idaho, outside the home of a police officer who earlier that day had arrested an anti-vaccination conspiracy theorist for trespassing in a public park closed for the pandemic.", "url": "https://www.huffpost.com/entry/ammon-bundy-holocaust-jews-anti-lockdown-rally-idaho_n_5eb0371ac5b684fc457a1389"}