{"authors": ["Marianne Garvey"], "date_download": "2020-05-04 15:56:32", "date_modify": "2020-05-04 15:56:32", "date_publish": "2020-04-15 17:30:17", "description": "Tig Notaro wants to party with you. Kind of.", "filename": "2020_04_15_entertainment_ti_96e6fb5f538e137ccc8a82d7fdee5a69_index_1588607792.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190702064752-tig-notaro-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_15_entertainment_ti_96e6fb5f538e137ccc8a82d7fdee5a69_index_1588607792.html", "title": "Tig Notaro will come to your Zoom party for five bucks", "title_page": "Tig Notaro will come to your Zoom party for five bucks  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Tig Notaro wants to party with you. Kind of.\nThe comedian is offering herself up to be a guest at your next Zoom party. For a five dollar donation, she'll send you a video you can include in your next virtual gathering, with all proceeds going to Meals on Wheels and Covid-19 relief.\nNotaro made a video appearance on \"Conan\" recently, where Conan O'Brien told her the idea was so good he'd buy stock in it if he could.\n\"I want to talk to you about 'Have Tig At Your Party' because this is something that you invented quite a while ago that I think is perfect for the time we're in right now,\" O'Brien said.\n\"It's basically me as the burning log on the TV screen,\" Notaro explains, saying she actually came up with the idea years ago while on the road touring. \"When I was touring years ago I was missing so many friends parties and I was pretty bummed out about that and I thought 'Oh it might be funny to send a video of myself just in my hotel room' and they can put it on the TV like I'm there and then I thought maybe that would be a good idea to sell to my fan base. And so it actually came out a decade ago, I think on my first album 'Good One.'\"\nRead More", "url": "https://www.cnn.com/2020/04/15/entertainment/tig-notaro-will-come-to-your-zoom-party/index.html"}