{"authors": ["Reporter"], "date_download": "2020-05-04 20:18:11", "date_modify": "2020-05-04 20:18:11", "date_publish": "2020-04-29 10:40:39", "description": "Dennis Prager described the safety measure as \"the greatest mistake in the history of humanity,\" sparking ridicule and scorn in equal measure.", "filename": "entry_dennis-prager-coronavirus-lockdown-statement-backlash_n_5ea95002c5b6123a1764e528_1588623491.html", "image_url": "https://img.huffingtonpost.com/asset/5ea953cb24000037018e9ee4.png?cache=mdn5cwmm2p&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_dennis-prager-coronavirus-lockdown-statement-backlash_n_5ea95002c5b6123a1764e528_1588623491.html", "title": "Conservative Pundit's Hot Take On Coronavirus Lockdown Gets The Slapdown It Deserves", "title_page": "Conservative Pundit's Hot Take On Coronavirus Lockdown Gets The Slapdown It Deserves | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Conservative pundit Dennis Prager made an outlandish statement against the coronavirus lockdown that came back to bite him, drawing considerable mockery and scorn on social media from both sides of the aisle.\nPragerU, a website that Prager himself founded, tweeted a quote card Tuesday featuring a quote from the controversial commentator: “The lockdown is the greatest mistake in the history of humanity.”\nCritics pounced on the claim by suggesting other historical events (some serious and others for comic effect) that could be more worthy of the title.\nLockdowns and social distancing measures implemented in other countries have been credited with slowing the spread of the virus that has killed almost 60,000 people in the United States alone.\nPrager, meanwhile, responded to some of the criticism under the PragerU Twitter thread.\n“For those who confuse ‘mistake’ with ‘evil,’ Dennis said over and over that the worldwide lockdown is not an evil,” he wrote, referring to himself in third person and citing an episode from his radio show. “It is a mistake. They are not synonyms.”\nDoes your “University” have a history dept.? — Antoine Fantoine (@theneedledrop) April 29, 2020\nNever mind the burning of the library at Alexandria, European colonialism, the 1914 alliances that provoked the Great War, the Weimar left and center failing to unite against Hitler and the Orioles trading Schilling, Harnish and Finley for Glenn Davis, https://t.co/CRtIjXzrt8 — David Simon (@AoDespair) April 28, 2020\nPragerU: Making Trump University look like Harvard. — Elad Nehorai (@PopChassid) April 28, 2020\nDude, it’s the 35th anniversary of New Coke, have some respect. https://t.co/H5SYfia2lA — tedfrank (wear a mask 😷 ) (@tedfrank) April 28, 2020\nHi @TwitterSupport,\nThis is COVID-19 disinformation, per your new policy.\nDo your thing, please. — Stay-at-Home Jedi (@JediCounselor) April 28, 2020\nGoogle \"history\". — Cody Johnston (@drmistercody) April 28, 2020\nYah those with no training in epidemiology know best about public health crises.\nIm sure the below would be cheered by you: Health experts in 1918 said \"CANCEL PARADE! DANGER!\"\nPrager types said \"PARADE! FREEDOM!\"\n40,000 of these folk died in a week -after infecting 1000s more. pic.twitter.com/hgM6626jAw — Kurt Eichenwald (@kurteichenwald) April 28, 2020\nI worked for the same conservative media co. @DennisPrager works for. Prager is no dummy. He can’t believe this. But this is what sucks about conservative media. You get rewarded for being outlandish, for enraging your audience. I did it at times too. It’s wrong. It’s dishonest. https://t.co/K2DBC9pOqj — Joe Walsh (@WalshFreedom) April 28, 2020\nI dunno - slavery seemed kind of bad. — Tim Fullerton (@TimFullerton) April 28, 2020\nIt is a right-wing death cult. https://t.co/jNQPNfrlZp — Matt Ortega (@MattOrtega) April 28, 2020\nAn awful, inconsiderate, and wrong take. — Autumn Johnson (@LegallyAutumn) April 28, 2020\nThank you, sir. After years of slamming my own head in a closet door for pleasure, I too believe history only began a few months ago. — Mike Drucker (@MikeDrucker) April 29, 2020\nNot slavery? Not the Holocaust? Not... anything else? https://t.co/9rYnEKZXbS — Katie Hill (@KatieHill4CA) April 29, 2020\nGalaxy Brain stuff from the University of Prager. https://t.co/YqSqeCNCG9 — Frank Luntz (@FrankLuntz) April 28, 2020\nbottle up the confidence it takes to put this take on a graphic and use it to propel your life https://t.co/NZ0QOnNWgQ — Steadman™ (@AsteadWesley) April 28, 2020\nWow, and I never thought there'd be a dumber university in human history than Trump University https://t.co/tl1vfEj7Od — Will Bunch Sign Up For My Newsletter (@Will_Bunch) April 28, 2020\nThe moral poverty of the people holding themselves out to be moral instructors has reached supercritical mass. https://t.co/fA8lxwGQHS — Tom Nichols (@RadioFreeTom) April 28, 2020\nimagine having this take when season 8 of game of thrones exists https://t.co/EMo1lmiQJA — Grace Segers (@Grace_Segers) April 28, 2020\nLet’s assume it’s a mistake. The biggest in human history? The reparations on Germany after WWI? Sending Lenin back to Russia? Carve out for slavery in the US Constitution? The Fire of Alexandria? Canceling Firefly? https://t.co/qGxbu0tUBu — Jonah Goldberg (@JonahDispatch) April 28, 2020", "url": "https://www.huffpost.com/entry/dennis-prager-coronavirus-lockdown-statement-backlash_n_5ea95002c5b6123a1764e528"}