{"authors": ["Bobcaina Calvan"], "date_download": "2020-05-04 20:25:22", "date_modify": "2020-05-04 20:25:22", "date_publish": "2020-04-20 16:35:31", "description": "TALLAHASSEE, Fla. (AP) — As unemployment surged during the early weeks of the coronavirus outbreak in the U.S., Florida ranked at or near the bottom of all states in its speed of processing those...", "filename": "_c181344142f2f47c34ff80bdbc68d596_1588623922.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c393dea91cb74b2ab8a1ea260116ab73/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c181344142f2f47c34ff80bdbc68d596_1588623922.html", "title": "Florida among slowest states to process unemployment claims", "title_page": "Florida among slowest states to process unemployment claims", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Friday, April 17, 2020 file photo, Hillborough County Library service worker Stephen Duran passes out reemployment forms to a motorist at the Jimmie B. Keel Regional Library in Tampa, Fla. Federal data shows that Florida has processed its hundreds of thousands of new unemployment claims more slowly than any other state. (AP Photo/Chris O'Meara, File)\nFILE - In this Friday, April 17, 2020 file photo, Hillborough County Library service worker Stephen Duran passes out reemployment forms to a motorist at the Jimmie B. Keel Regional Library in Tampa, Fla. Federal data shows that Florida has processed its hundreds of thousands of new unemployment claims more slowly than any other state. (AP Photo/Chris O'Meara, File)\nTALLAHASSEE, Fla. (AP) — As unemployment surged during the early weeks of the coronavirus outbreak in the U.S., Florida ranked at or near the bottom of all states in its speed of processing those claims, federal data shows.\nThe state is already among the most inhospitable places to be unemployed, and the economic downturn has only added to the misery. Now Florida finds itself frantically trying to catch up as it lags behind other large states and neighbors in the South.\nAccording to an Associated Press analysis of U.S. Department of Labor data, nearly 7 of every 8 Floridians who managed to file claims during the three weeks from mid-March until early April were waiting to have them processed — the worst rate in the country.\nIn comparison, California and Texas had about two-thirds of their claims backlogged, while New York, the country’s current coronavirus epicenter, had about 30% of its claims still waiting, according to the analysis that looked at claims data submitted to the federal government.\nAlthough the federal data does not produce definitive rankings, in the worst case scenario, Florida is the slowest-performing state. Even in the best-case scenario — in the unlikely event that all Floridians previously on unemployment were re-employed and dropped from the rolls in mid-March — the state would still rank among the four lowest.\n“If we had to predict before this crisis which states would struggle the most in their unemployment insurance systems and dealing with new claims, Florida absolutely would be at the top of everyone’s list,” said Indivar Dutta-Gupta, a co-executive director of Georgetown University’s Center on Poverty and Inequality.\nSince March 15, just days before Gov. Ron DeSantis curtailed service at restaurants and bars, about 650,000 Floridians have filed initial claims with the state’s Department of Economic Opportunity, which administers jobless benefits. Many thousands more appear to have been unable to submit applications.\nAn online dashboard the department unveiled Monday underscored how far behind Florida is. It showed that the state has paid barely 6% of claimants and processed claims from fewer than a quarter of those applying for benefits since March 15.\nWith frustration swelling in the state, officials have struggled to explain why it’s lagging behind.\n“Ultimately, we need to get people paid,” DeSantis said during a press briefing last week. “While we’ve made progress in recent days, we have an unprecedented amount of claims, and we have to work through them.”\nHe later said more than 33,600 unemployment checks had gone out to those who became unemployed in the coronavirus crisis.\n“Why is Florida in particular having such a difficult time now processing so many claims? It’s because it never intended to process so many,” said Susan Houseman, the director of research for the Michigan-based Upjohn Institute for Employment Research. “In fact, it was scaling back in recent years. So Florida is even less prepared to handle the onslaught than other states.”\nA spokeswoman for DeSantis had asserted that Florida’s woes are no more severe than those in other states. But federal data suggests otherwise.\nThe latest statistics from the Department of Labor, which covers the week ending April 4, showed Florida was paying unemployment claims for just 1.1% of its covered workforce, compared with California’s 6.2%, Texas’s 3.1%, New York’s 7.6% and Rhode Island’s 11.9%, the country’s highest. The analysis is based on the Labor Department’s insured unemployment rate — a snapshot of the number of people receiving jobless benefits.\nNeighboring Georgia’s insured unemployment rate was 8.2%, while North Carolina posted 5.6%. South Dakota had the country’s second-worst record at 1.8%, and Arizona was next at 2.2%.\nIn flush economic times, that statistic could reflect a strong workforce. But in times of economic distress, lower rates underscore the inability of the jobless to access an important safety net.\nAs it stands, claimants in Florida can currently get aid for 12 weeks -- tied with North Carolina for the shortest period of any state -- although the duration in Florida can be as long as 23 weeks depending on the unemployment rate. Most states provide benefits for as long as 26 weeks. The state’s $275 weekly cap on benefits also ranks among the country’s stingiest, with only Alabama, Arizona, Louisiana and Mississippi paying less.\nEven before the virus upended the lives of hundreds of thousands of Floridians — a number economists predict could swell to more than 1 million — the state’s unemployment system was plagued with problems.\nSoon after the online unemployment portal launched in October 2013, system crashes prevented people from claiming benefits. Some couldn’t log in to access the portal -- a common complaint in the ongoing problems. One state audit had identified numerous system failures, and a subsequent audit issued shortly after DeSantis assumed office last year said many of those deficiencies weren’t fixed.\n“The system was implemented in a way for it to be a total failure. Why? Because it would keep the politician looking good by pretending that less people are filing for unemployment when the reality is, even before the pandemic, people were having a really hard time not only applying but in getting benefits,” said state Sen. Annette Taddeo, a Miami Democrat who has been besieged with calls from constituents looking for relief.\nThe situation is desperate for many of the newly jobless, like Luis Perulero, a 35-year-old father of four and a ramp supervisor for airline services company Delta Global Services, or DGS, which recently rebranded as Unifi. Perulero was furloughed by the company last month and needs his unemployment check.\n“I have no idea where we’re at in the process, and we haven’t been able to get any answers,” Perulero said. His application remains pending and he has called hundreds of times to get it moving.\nWith trouble paying rent, they have reached out to their landlord. He and his wife also have to come up with the $500 monthly premium for the health insurance that covers their four children.\n“We’re trying to figure out how to plan so we have enough for groceries next month,” said his wife, Kaysa Rodrigues, whose earnings from her small payroll company has plunged because fewer businesses need her services.\nBefore the outbreak, Florida’s labor market was among the the country’s most vigorous, with an unemployment rate of 2.8% in February.\n“Unemployment insurance helps strengthen the labor market when times are good, but it’s now biting us in the behind, now that we’re going through this unprecedented recession,” said Sean Snaith, the director of the University of Central Florida’s Institute for Economic Forecasting.\n___\nThis story was first published on April 20, 2020. It was updated on April 23, 2020, to correct that Luis Perulero was furloughed by Delta Air Lines from his job as a ramp supervisor at Palm Beach International Airport. Until his employment was suspended, Perulero worked for airline service provider Delta Global Services, or DGS, which is partly owned by Delta and which recently rebranded as Unifi.\n___\nFollow Bobby Caina Calvan on Twitter at https://twitter.com/BobbyCalvan\n___\nFollow AP coverage of the pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/c181344142f2f47c34ff80bdbc68d596"}