{"authors": ["Arlette Saenz"], "date_download": "2020-05-04 16:25:39", "date_modify": "2020-05-04 16:25:39", "date_publish": "2020-04-07 09:42:27", "description": "Civil rights icon and Democratic Rep. John Lewis is endorsing Joe Biden, promising to campaign for the former vice president and saying that \"we need his leadership now more than ever before.\"", "filename": "2020_04_07_politics_john-lewis-endorses-joe-biden_index_1588609539.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200220181835-john-lewis-80th-birthday-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_john-lewis-endorses-joe-biden_index_1588609539.html", "title": "John Lewis endorses Joe Biden", "title_page": "John Lewis endorses Joe Biden\n - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Civil rights icon and Democratic Rep. John Lewis is endorsing Joe Biden , promising to campaign for the former vice president and saying that \"we need his leadership now more than ever before.\"\n\"He has been a friend, a dear friend. He's a man of courage, a man with a great conscience, a man of faith,\" Lewis said in a call with reporters. \"He will be a great president. He will lead our country to a better place. He would inspire another generation to stand up, to speak up and to speak out, to be brave and to be bold.\"\nLewis is among the most revered African American members of Congress and a leader of the civil rights movement. In 1965, he was among the demonstrators marching for voting rights from Selma to Montgomery, Alabama, a day that became known as \"Bloody Sunday. \" Lewis, 25 at the time, had his skull fractured by white police officers who beat marchers crossing the Edmund Pettus Bridge in Selma that day.\n\"Joe Biden would not be afraid to stand up and preach the way of peace, the way of love, will not be afraid to preach the fight that we must respect the dignity and the worth of every human being,\" he added. \"He can help us and will help us regain our way as a nation and as a people.\"\nIn his call with reporters, the 80-year-old Democratic congressman acknowledged his health troubles after being diagnosed with stage 4 pancreatic cancer last year but insisted he will actively campaign for the former vice president.\n\"I have a few health problems now, but they will not be with me forever. I plan to travel around America to support him and be able to speak up and speak out for him,\" he said. \"I know what it is to campaign hard and to work hard, and I will be out there working and campaigning for Joe Biden as president of the United States of America.\"\nThe endorsement from the influential African American leader comes as Biden leads in the delegate count over Sen. Bernie Sanders of Vermont. Lewis made the endorsement more than a month before his state's Democratic primary. Georgia's contest was initially scheduled for March 24 but was delayed until May 19 due to the coronavirus pandemic.\nLewis stressed the need for Americans to vote during these trying times, saying, \"We cannot find an excuse not to vote. We must make it easy, simple and convenient for all of our citizens to participate in the democratic process.\"\nLewis recounted the sacrifices he and many others made during the fight for civil rights as he urged young voters, particularly young African Americans, to make their voices heard in this election.\n\"My message would be very simple. Look around. We have a choice. We must decide. Get out there and vote like we've never ever voted before,\" he said. \"The vote is the most powerful non-violent instrument or tool that we have in a democratic society and we must use it.\"\n\"I gave a little blood on that bridge, almost died,\" he added. \"And I would say to young people that it's my hope that you will not be beaten or arrested or jailed. Let's go out and vote and help elect a man of conscience, a man who would look out for each and every one of us and help build a society where no one would be left out or left behind because of their race or their color of their skin or their gender.\"\nIn his endorsement, Lewis also weighed in on Biden's upcoming vice presidential search, urging him to select a woman who is reflective of the country as his running mate.\n\"It would be good to have a woman of color. It would be good to have a woman,\" he said. \"It would be good to have a woman look like the rest of America -- smart, gifted, a fighter, a warrior. And we have plenty of able women, some of black, white, Latino, Asian American, Native American. I think the time has long past of making the White House look like the whole of America.\"", "url": "https://www.cnn.com/2020/04/07/politics/john-lewis-endorses-joe-biden/index.html"}