{"authors": ["Barbara Starr", "Evan Perez", "Ryan Browne"], "date_download": "2020-05-04 16:24:58", "date_modify": "2020-05-04 16:24:58", "date_publish": "2020-04-06 14:36:08", "description": "Acting Secretary of the Navy Thomas Modly apologized Monday night for calling the now-ousted commander of the USS Theodore Roosevelt \"stupid\" in an address to the ship's crew Monday morning.", "filename": "2020_04_06_politics_uss-tr-crozier-modly_index_1588609498.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406104401-thomas-modly-file-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_uss-tr-crozier-modly_index_1588609498.html", "title": "Acting Navy secretary apologizes for calling ousted aircraft carrier captain 'stupid' in address to ship's crew", "title_page": "Thomas Modly: Acting Navy secretary apologizes for calling ousted aircraft carrier captain 'stupid' in address to ship's crew - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Acting Secretary of the Navy Thomas Modly apologized Monday night for calling the now-ousted commander of the USS Theodore Roosevelt \"stupid\" in an address to the ship's crew Monday morning.\nModly told the crew that their former commander, Capt. Brett Crozier, was either \"too naive or too stupid\" to be in command or that he intentionally leaked to the media a memo in which he warned about coronavirus spreading aboard the aircraft carrier and urged action to save his sailors, according to remarks obtained by CNN.\nThe acting secretary also accused Crozier of committing a \"betrayal\" and creating a \"big controversy\" in Washington by disseminating the warning so widely among Navy officials.\n\"It was a betrayal. And I can tell you one other thing: because he did that he put it in the public's forum and it is now a big controversy in Washington, DC,\" Modly said, according to a transcript of remarks Modly made to the crew, copies of which have been provided to CNN by multiple Navy officials.\nLater Monday evening, after top members of the House Armed Services Committee began calling for his resignation, Modly apologized to the Navy for his comment.\n\"Let me be clear, I do not think Captain Brett Crozier is naïve nor stupid. I think, and always believed him to be the opposite,\" Modly said in his statement. \"We pick our carrier commanding officers with great care. Captain Crozier is smart and passionate. I believe, precisely because he is not naive and stupid, that he sent his alarming email with the intention of getting it into the public domain in an effort to draw public attention to the situation on his ship. I apologize for any confusion this choice of words may have caused.\"\nModly also apologized directly to Crozier for \"any pain my remarks may have caused.\"\n\"(Crozier and his family), and the entire Navy, have my full commitment that I will continue to help get the TR back to full health and back to sea where we can move forward beyond this unfortunate situation,\" Modly said.\nCrozier had written to Navy leadership flagging his concerns about the Roosevelt's crew of more than 4,000, alerting them to the challenges of trying to contain the disease aboard the ship and urgently requesting that sailors be allowed to quarantine on land.\n\"We are not at war. Sailors do not need to die. If we do not act now, we are failing to properly take care of our most trusted asset: our Sailors,\" Crozier wrote in a memo that three US defense officials confirmed to CNN.\nWhen asked about the comments on Monday, President Donald Trump said he \"may just get involved.\"\n\"I haven't heard it exactly, I heard they heard,\" Trump said, referring to the crew of the USS Theodore Roosevelt. \"I heard they had a statement that was made, if that were the statement, it's a strong statement.\"\n\"The letters shouldn't have been sent, and certainly they shouldn't have been leaked,\" Trump added. \"This is a military operation. I must tell you I've heard very good things about the gentlemen. Both gentlemen, by the way, I will say this. About both gentlemen. And I may look into it from the standpoint of something should be resolved because I'm hearing good things about both people.\"\n'Too naive or too stupid'\nAs of Monday, 173 of the ship's crew have tested positive for coronavirus and 61% of the crew have been tested, according to a Navy official. Approximately 2,000 have been evacuated from the ship and moved ashore to Guam\nThe Navy had set a goal of moving 2,700 sailors ashore by Friday evening.\nIn an earlier statement about his remarks to the USS Theodore Roosevelt, Modly said he couldn't verify that transcripts of his remarks were accurate but added that \"the spoken words were from the heart.\"\n\"I stand by every word I said, even, regrettably any profanity that may have been used for emphasis,\" Modly's statement earlier Monday said. \"Anyone who has served on a Navy ship would understand. I ask, but don't expect, that people read them in their entirety.\"\nThe acting secretary's comments are coming to light at a time when multiple defense officials tell CNN that there is such growing dismay at the highest ranks of the uniformed Navy over how Crozier was relieved of duty that many senior officers feel they cannot candidly speak about their views.\nModly relieved Crozier of duty late last week, citing loss of confidence and failure to adhere to the chain of command. Officials at the Pentagon are split about whether Crozier should have been relieved, but most feel the situation was badly handled and is now causing additional problems at an already difficult time.\nIn remarks that were piped over the vessel's PA system, Modly suggested Crozier leaked the memo on purpose or was \"too naive or too stupid\" to be in command if he didn't think that sending it to over 20 people would not result in it getting out to the public.\n\"If he didn't think, in my opinion, that this information wasn't going to get out to the public, in this day and information age that we live in, then he was either A, too naïve or too stupid to be a commanding officer of a ship like this,\" Modly said. \"The alternative is that he did this on purpose.\"\nModly went on to say it was a \"betrayal of trust, with me, with his chain of command.\"\nPentagon officials privately acknowledge, however, that Crozier may have exercised questionable judgement in sending an emotional message. They also express concern about how the firing was handled, the impact on crew morale and potential political involvement by the White House.\nThe Washington Post's David Ignatius reported that Modly told him he had fired Crozier in part out of concern thatTrump might step into the case. \"I didn't want to get into a decision where the President would feel that he had to intervene because the Navy couldn't be decisive,\" Modly said, according to the Post.\nModly's use of the word \"betrayal\" is particularly loaded because saying an officer has betrayed the Navy is a court martial offense.\n'I don't know how he survives this day'\nOne US official tells CNN that Modly did not want to wait for an investigation into the matter to be completed before firing Crozier, even though the Chief of Naval Operations, Adm. Mike Gilday wanted to pause and opposed the quick firing. Defense Secretary Mark Esper deferred the decision to Modly, who overruled Gilday.\nGilday, who later publicly supported Modly in a brief statement, was expected to receive initial results Monday from the investigation into Crozier's alleged failure to notify his chain of command. But late Monday, a spokesman for the chief of naval operations announced that Gilday had approved an extension.\n\"This extension will allow additional time to gather facts and refine the inquiry's recommendations,\" Cmdr. Nate Christensen said. \"The inquiry remains in progress and is expected to be completed soon. It will take additional time for the inquiry's recommendations to be reviewed and endorsed by Adm. Gilday.\"\nLawmakers reacted quickly to the reports of Modly's tirade. Rep. Elaine Luria, a Virginia Democrat and Navy veteran, tweeted that Esper \"should immediately fire\" the acting secretary.\nVirginia Democratic Sen. Tim Kaine said in a statement that Modly's comments were \"completely inappropriate and beneath the office of the Secretary of the Navy....These dedicated sailors deserve better from their leadership.\"\nA defense official familiar with Modly's remarks also said that in his opinion, the acting secretary \"should be fired. I don't know how he survives this day.\"\nIn contrast to the acting secretary's anger, Crozier's popularity with the ship's crew was on display in videos that went viral and showed sailors giving him a warm and loud send-off, clapping and chanting his name as he left the ship for the final time.\nModly acknowledged Crozier's popularity with the crew in his remarks to the sailors. \"I cannot control or attempt to change whatever anger you have with me for relieving your beloved CO,\" Modly said, using the slang for commanding officer. \"I understand you may be angry with me for the rest of your lives.\"\nChallenges for the Navy\nThe acting secretary also appeared aggrieved by the warm send-off Crozer received, accusing the former commanding officer of creating a public firestorm in Washington and Guam.\n\"Think about that when you cheer the man off the ship who exposed you to that. I understand you love the guy. It's good that you love him. But you're not required to love him,\" Modly told the crew.\nDefense officials tell CNN that Trump, after being briefed, privately indicated to the Pentagon that he thought Crozier should be relieved of duty, but that he also supported doing an investigation.\nSpeaking to Jake Tapper on CNN's State of the Union on Sunday, Esper was asked if there should have been an investigation before Crozier was relieved of duty. The defense secretary said only that an investigation is ongoing and that Modly had lost trust and confidence in Crozier.\nOn Monday, a Pentagon spokesman told CNN that, \"Secretary Esper had made it clear he supported Modly's decision.\"\nModly's actions now pose several challenges for the Navy. First, firing Crozier before a completed investigation, while not unprecedented, is problematic. Modly said he lost confidence in Crozier in part because he did not go to his immediate superior in the traditional chain of command to voice his worries.\nBut Modly also told reporters that his own chief of staff had spoken to Crozier and encouraged him to contact their office directly if needed. As the civilian head of the Navy, Modly essentially okayed going outside the chain of command, one defense official with direct knowledge of the case told CNN.\n\"We are banging our heads against the wall over the chain of command issue and yet you give him a direct line to your office,\" the defense official said. The official also acknowledged Navy leadership did not anticipate the story would take on global proportions or that multiple videos taken by crew members would be circulated showing hundreds giving Crozier his rousing sendoff.\nThe crew's emotional send-off for their former captain puts the Navy leadership in the delicate position of making sure it doesn't publicly criticize the crew, the defense official said.\nModly also criticized Crozier for publicly detailing information about how the virus was impacting the ship. While he had previously acknowledged to reporters that he did not know if Croizer had leaked his memo to the media, Modly showed no such caution in his remarks to the crew.\nThe acting Navy secretary essentially accused Crozier of going straight to news organizations and of painting himself as a \"martyr CO, who wasn't getting the help he needed.\" He claimed he had no issue with the content of Crozier's memo, but with the fact that it became public.\n\"There is never a situation you should consider the media a part of your chain of command,\" Modly said. \"Imagine if every other CO also believed the media was a proper channel to air grievances with their Chain of Command under difficult circumstances.\"\nA key issue for the investigation, the official said, is Crozier's relationship with his direct superior, Rear Admiral Stuart Baker, who was on the carrier as a senior commander overseeing several ships.\nTop Navy military leadership has few options but to move ahead to project confident leadership to the rank and file after months of disarray at the most senior levels. Modly remains in an acting capacity and was not selected to be nominated to the position permanently.\nFormer Navy Secretary Richard Spencer was fired and the nominee to replace him permanently, Kenneth Braithwaite, has not been confirmed by the Senate. Gilday himself was quickly brought in as chief of naval operations after the admiral nominated to the job stepped aside in an ethics controversy.\nThis story and its headline have been updated with additional developments on Monday.", "url": "https://www.cnn.com/2020/04/06/politics/uss-tr-crozier-modly/index.html"}