{"authors": ["Cnn Staff"], "date_download": "2020-05-04 16:57:57", "date_modify": "2020-05-04 16:57:57", "date_publish": "2020-04-09 15:30:53", "description": "Janie Kasse already had full-time and part-time jobs, but after her mother's assisted living facility closed its doors to visitors amid the Covid-19 pandemic, she knew she needed a third job.", "filename": "2020_04_09_us_third-job-mother-nursing-home_index_1588611477.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409095011-janie-kasse-carol-chesser-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_us_third-job-mother-nursing-home_index_1588611477.html", "title": "Woman takes third job at assisted living facility to spend time with quarantined mother", "title_page": "Woman takes third job at assisted living facility to spend time with quarantined mother - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Janie Kasse already had full-time and part-time jobs, but after her mother's assisted living facility closed its doors to visitors amid the Covid-19 pandemic, she knew she needed a third job.\nAs a hospitality aide at the Jeffersonville, Indiana, facility housing her mother.\n\"My mom is so used to seeing me all the time, and she just doesn't understand why she can't come out of her room and why I can't take her shopping and out to eat. It's hard on her,\" Kasse told HLN.\nKasse's mom, Carol Chesser, has been at Windsor Ridge since being involved in a near-fatal car crash. According to the Courier-Journal newspaper , across the Ohio River in Louisville, Kentucky, Chesser suffered a traumatic brain injury during a New Year's Eve car crash in 1976.\nThe 65-year-old can't read, write or use the phone, Kasse said. If a staff member turns on her television, which is definitely not Chesser's favorite pastime, it remains on until another staffer turns it off, her daughter said.\nRead More", "url": "https://www.cnn.com/2020/04/09/us/third-job-mother-nursing-home/index.html"}