{"authors": [], "date_download": "2020-05-04 20:16:02", "date_modify": "2020-05-04 20:16:02", "date_publish": "2020-04-16 17:03:24", "description": "LITTLE ROCK, Ark. (AP) — Arkansas lawmakers approved the state's budget for the coming year and reauthorized the Medicaid expansion Thursday, wrapping up a session fast-tracked because of the...", "filename": "_db39facaeb58ff13142611dd9ba7dcca_1588623362.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_db39facaeb58ff13142611dd9ba7dcca_1588623362.html", "title": "Arkansas lawmakers OK budget, ending session amid pandemic", "title_page": "Arkansas lawmakers OK budget, ending session amid pandemic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LITTLE ROCK, Ark. (AP) — Arkansas lawmakers approved the state’s budget for the coming year and reauthorized the Medicaid expansion Thursday, wrapping up a session fast-tracked because of the coronavirus pandemic.\nThe House and Senate approved identical versions of the proposed $5.8 billion Revenue Stabilization law, which sets the state’s spending priorities for the coming fiscal year. Gov. Asa Hutchinson proposed his budget a week before the state had its first coronavirus case, and finance officials have since lowered their forecast of the state’s revenue by about $205 million.\nThe House also approved by a 90-0 vote the state’s Medicaid budget, which includes funding for Arkansas’ Medicaid expansion. The expansion plan has won narrow approval every year since it was created in 2013.\nLawmakers were spread across two locations for this year’s session, with the House meeting in a basketball arena because of coronavirus concerns. The Senate met at the Capitol, but with limits on how many members could be on the floor. Both chambers allowed lawmakers to vote remotely.\nThe Legislature plans to meet on April 24 to formally adjourn this year’s session.", "url": "https://apnews.com/db39facaeb58ff13142611dd9ba7dcca"}