{"authors": ["Sam Mcneil"], "date_download": "2020-05-04 20:10:41", "date_modify": "2020-05-04 20:10:41", "date_publish": "2020-04-07 13:24:56", "description": "BEIJING (AP) — The coronavirus came first in the depths of winter. As with so many places afterward, the change seeped in gradually. Cold winds drove ice and snow between skyscrapers as...", "filename": "_534fd824dd58af63f2445210d7170eca_1588623041.html", "image_url": "https://storage.googleapis.com/afs-prod/media/44b46682045243e89e486b580572884b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_534fd824dd58af63f2445210d7170eca_1588623041.html", "title": "VIRUS DIARY: In Beijing, finally, a tentative spring blooms", "title_page": "VIRUS DIARY:  In Beijing, finally, a tentative spring blooms", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this April 1, 2020, photo, Sam McNeil’s dog runs alongside the water during a walk on a spring morning in Beijing. (AP Photo/Sam McNeil)\nIn this April 1, 2020, photo, Sam McNeil’s dog runs alongside the water during a walk on a spring morning in Beijing. (AP Photo/Sam McNeil)\nBEIJING (AP) — The coronavirus came first in the depths of winter. As with so many places afterward, the change seeped in gradually.\nCold winds drove ice and snow between skyscrapers as Beijing’s people waddled out into a scarier and scarier world to buy the basics. Before the outbreak, residents in the city of 21.5 million already ran on ecommerce delivery, residents wore masks year-round for smog and surveillance ran rampant. To bundle up then and silently drift on an electric scooter across the frozen, empty streets was eerie.\nEveryone hired more security guards and equipped them with temperature guns. Initially, they were pointed at foreheads before someone figured out a wrist scan sufficed. Cinemas and shopping malls closed. Breweries and restaurants pivoted to delivery. Online pleas began circulating for pet adoption or fostering, because some foreigners who left had abandoned their pets. Remaining pet parents began enforcing canine social distancing: No playing at the dog park.\nNeighborhoods sealed themselves off with makeshift barriers. My apartment block issued identification cards. Staff at a nearby grocer donned goggles and rubber gloves over custom grey hazmat suits that were hooded, booted, and emblazoned with their corporate logo. Office buildings deployed thermal cameras so guards could monitor, in real time, every visitor’s temperature.\nAuthorities issued new orders, gradually limiting travel into and out of China. Then the Communist Party expelled more than a dozen American foreign correspondents , some of them my good friends. Flights were cancelled. Friends and colleagues began bolting for Africa and Europe; not being able to escape, it turns out, is deeply unsettling.\nThen, at some point, the sun shone through the grey. Spring slowly warmed the city.\nNow, everyone still wears masks, submits to constant temperature checks and frequently washes hands, door handles, laptops and hands. We’re all COVID-OCD now. Beijing has started granting “green cards” if applicants’ phone-location data shows they haven’t left the city in 14 days.\nTwo weekends ago, a former imperial garden called Fragrant Hills boasted a full parking lot, lines for the snack cart and a few tiny poodles smuggled through security in handbags. A lone monk walked the roof of a monastery above crowds hiking through blossoming cherry and almond trees. Couples whipped off their masks fleetingly for photos in front of an arresting view of Beijing’s skyline.\nBeijingers knew the government was watching before, but now there’s green-card proof. Beijingers wore masks before, but now it’s to protect from a deadly virus instead of the relatively slow agony of industrial particulates.\nWhile the pandemic ravages communities from Boston to Basra, family and friends have asked me if it’s “getting better over there.” It is — sort of. While the mortal fear has ebbed, the virus lingers in the form of a “new normal” of increased surveillance, economic woes, and travel restrictions.\nOld men still fly kites in the parks, but offices and apartments remain empty. Businesses have folded, the government has boosted data harvesting and the ubiquitous biosecurity checkpoints remain staffed.\nFull Coverage: Life\nCautiously, I have begun running along Beijing’s underrated canals. I’ve given wide berth while jogging past men on folded chairs fishing in turbid waters, children fighting with water pistols, elderly ping pong players crowding public tables and — once — a bespectacled man practicing vocal scales next to a dumpster. On weekends, families crowd the canals.\nYet it is empty enough for me to start teaching my young dog how to jog. And even he, I think, is starting to enjoy getting out of the house.\n___\n“Virus Diary,” an occasional feature, will showcase the coronavirus saga through the eyes of Associated Press journalists around the world. Sam McNeil is a Beijing-based journalist for the AP, on assignment this week in Wuhan. Follow him on Twitter at http://twitter.com/stmcneil", "url": "https://apnews.com/534fd824dd58af63f2445210d7170eca"}