{"authors": [], "date_download": "2020-05-04 20:05:50", "date_modify": "2020-05-04 20:05:50", "date_publish": "2020-04-07 12:17:51", "description": "KANSAS CITY, Mo. (AP) — Kansas City Public Schools has suspended its free meal distribution program for students after a food service worker helping with the effort tested positive for COVID-19,...", "filename": "_81e69a5b7cdd2d3d7443c5aaa5b0997d_1588622750.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_81e69a5b7cdd2d3d7443c5aaa5b0997d_1588622750.html", "title": "Kansas City Public Schools suspends free meals amid outbreak", "title_page": "Kansas City Public Schools suspends free meals amid outbreak", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "KANSAS CITY, Mo. (AP) — Kansas City Public Schools has suspended its free meal distribution program for students after a food service worker helping with the effort tested positive for COVID-19, district officials said.\nThe district announced the suspension Monday, the Kansas City Star reported . Officials gave no timeline for when the program might resume, but suggested families go to the Harvesters Community Food Network website to locate food pantries and mobile distribution sites.\n“This was not an easy decision,” district spokesman Ray Weikal said. “We understand that many of our families depend on school meals to help meet the nutritional needs of their children.”\nIt was the second case of coronavirus among the district’s food service workers. Weeks ago, a worker who was out of town at the time tested positive.\nMost school districts in the Kansas City area launched grab-and-go food pickup programs when the spread of coronavirus closed schools. The programs were meant to help ensure children in at-risk homes were getting enough to eat. But several of the free meal distribution programs have been interrupted as the spread of the virus has grown, including those at Tonganoxie, Kansas, and Raytown. Raytown resumed its service this week.\nKansas City school officials said they will update plans based on guidance from public health authorities.", "url": "https://apnews.com/81e69a5b7cdd2d3d7443c5aaa5b0997d"}