{"authors": ["Mindy Isser", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Christian Smalls", "Joe Allen"], "date_download": "2020-05-04 19:49:15", "date_modify": "2020-05-04 19:49:15", "date_publish": "2020-05-01 00:00:00", "description": null, "filename": "2020_05_strike-boycott-amazon-whole-foods-instacart-target-coronavirus_1588621755.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/05/01123043/GettyImages-1213286399.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_05_strike-boycott-amazon-whole-foods-instacart-target-coronavirus_1588621755.html", "title": "Workers at Amazon, Whole Foods, Instacart, and Target Are on Strike and Need Your Solidarity", "title_page": "Workers at Amazon, Whole Foods, Instacart, and Target Are on Strike and Need Your Solidarity", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "With the coronavirus pandemic turning from a health crisis into an economic crisis, workers in the United States are suffering more than they have in decades. Unemployment claims in recent weeks have hit 30 million — easily the highest on record. Lines at food banks are stretching on interminably. Businesses are shuttered — some, no doubt, indefinitely.\nBut some industries are doing just fine. Grocery stores, online retailers, and delivery services are booming. Since the pandemic reached the United States, Amazon announced it would hire nearly 200,000 new workers, and Instacart 550,000 new workers. And while these essential workers are lauded as “heroes,” the conditions at their workplaces show the profound lack of respect their employers actually have for them.\nToday, workers at Amazon, Whole Foods, and Target are walking off the job. Their demands include compensation for all unpaid time off since the beginning of the COVID-19 crisis, hazard pay or paid sick leave, personal protective equipment (PPE) and cleaning supplies, and transparency on the number of cases in each workplace. The coalition of workers is also asking customers to boycott Amazon, Instacart, Whole Foods, and Target today.\nSince the start of the crisis, multiple workplace actions have broken out at these big retailers — workers have gone on strike at Amazon distribution and fulfillment centers in Minnesota, Staten Island, and Detroit (among others); Whole Foods workers have staged a nationwide sick-out; and Target employees have spoken out publicly about their workplace conditions. But now, workers at these companies — along with employees at Instacart, FedEx, and Walmart — have united in a coalition with a shared set of demands. (Some Postmates, Trader Joe’s, and Shipt workers are also planning to join the strike today.)\nSo far, the businesses have reacted to workers’ actions with both carrots and sticks. In late March, Amazon announced temporary raises, and yesterday, after the coalition’s press release went out, Whole Foods said it would begin requesting that customers wear masks, even providing them for free. These are small gestures that don’t come close to meeting workers’ demands, but they show companies are watching workers’ actions — and responding to them. Then there are the sticks: last month, Amazon fired Chris Smalls, the organizer of the Staten Island walkout, and Trader Joe’s sent an anti-union memo after the Trader Joe’s Union Twitter account went live. Business Insider revealed the other week that Whole Foods is tracking all of its stores for unionization risks on a “heat map.”\nThe bosses of these companies, of course, are doing just fine. Jeff Bezos, CEO of Amazon and Whole Foods, is the richest man in the world. The other companies’ CEOs aren’t doing too badly, either: the CEO of Target, Brian Cornell, raked in $21.6 million last fiscal year, and the CEO of Walmart, Doug McMillon, brought home $22.1 million. The pay at all of these companies hovers between $10 and $20 an hour. And while some provide health insurance, it’s often too expensive for workers to actually use — an obvious problem during a global pandemic.\nOrganizing inside of these companies has always been a heavy lift: locations are spread out across the country, and workers cycle in and out of employment (Amazon has a 104.4 percent turnover rate). Both of these realities make it hard to find and identify worker leaders (crucial to any good organizing drive), and for worker leaders to stay in their jobs long enough to effectively organize. For delivery workers, it’s especially difficult: they don’t have a set workplace, and they are misclassified as independent contractors, barred from unionizing.\nBut the labor movement has no choice but to try to reach these workers. As more businesses close, more unemployed workers will get funneled into the grocery, online retail, and delivery industries — and these sectors will form economic choke points that could be used to win major concessions for all workers.\nAlthough it’s unclear how many workers will strike today, it’s crucial that they’re beginning to build ties with one another. The new coalition, along with Amazonians United and other nascent organizing committees, is a sign that things are shifting from one-off strikes and sick-outs to building organizations that can hopefully win long-term power for some of the most exploited workers in the country. No matter what happens today, it’s clear that workers’ consciousness is being raised — and that many are ready to struggle for what they deserve.", "url": "https://jacobinmag.com/2020/05/strike-boycott-amazon-whole-foods-instacart-target-coronavirus"}