{"authors": [], "date_download": "2020-05-04 20:14:43", "date_modify": "2020-05-04 20:14:43", "date_publish": "2020-04-15 17:21:11", "description": "TRENTON, N.J. (AP) — A decision on the status of New Jersey's schools is likely to come on Thursday, Gov. Phil Murphy said Wednesday. The state's more than 600 school districts are...", "filename": "_470a4a861503339bbf0b48084062cc95_1588623283.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_470a4a861503339bbf0b48084062cc95_1588623283.html", "title": "Decision on NJ schools likely on Thursday, Murphy says", "title_page": "Decision on NJ schools likely on Thursday, Murphy says", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Decision on NJ schools likely on Thursday, Murphy says\nTRENTON, N.J. (AP) — A decision on the status of New Jersey’s schools is likely to come on Thursday, Gov. Phil Murphy said Wednesday.\nThe state’s more than 600 school districts are currently closed, with educators teaching remotely, because of the coronavirus outbreak.\nMurphy suggested a reopening is not likely.\n“We’re trying to figure all that out,” he said. “I just don’t see — I take my cues from the health experts and I’ll continue to — I don’t see a normal, even if it were to take place, a normal gathering in the foreseeable future, and I would be the happiest guy on the planet if I’m wrong.”\nSchools have been closed since March 16.\nNeighboring Pennsylvania has closed schools through the rest of the year.\nA look at other developments.\n___\nTAX REVENUE\nNew Jersey’s March revenues were up 3.6% compared with 2019, but officials warned Wednesday that the economic effects of COVID-19 would have a significant effect on state finances next month and beyond.\nThe state collected $1.88 billion in March, up $66.3 million over March 2019, the Treasury Department said in a statement.\n“Treasury is closely monitoring factors such as the closure of businesses across New Jersey, the sharp increase in unemployment insurance claims, and the decline in the stock markets, which are expected to have a significant impact on tax revenue collections in the coming month,” the department said in an emailed statement.\nThe development came a day after Murphy, a Democrat, and the Democrat-led Legislature enacted a bill delaying the income tax filing deadline from Wednesday to July 15. The delay could hobble state revenues in the future, the department warned.\nRevenues were falling “off a cliff,” Murphy said Wednesday at a news conference, pointing to the need for states to get cash assistance from the federal government.\nThe governor and lawmakers also agreed to postpone the end of the fiscal year from June 30 to Sept. 30.\nA look at other developments:\n___\nTHE DATA\nThe death toll climbed to 3,156, up 351 since Tuesday. The jump didn’t reflect people who died in the previous 24 hours, but instead reflects the rate that officials can report deaths due to the virus, according to the governor. The total number of people with the virus is over 71,000, up about 2,600, Murphy said.\nState investigators have studied more than 1,400 of those deaths, and found the majority had one or more other health problems. About 60 percent had underlying cardiovascular issues, 37 percent diabetes and 30 percent other chronic diseases, often lung-related, state officials said at an afternoon news conference.\nResidents should not to “let their guard down” despite the frustrations of life under COVID-19 shutdowns, lest the numbers of infections and deaths soar, Murphy said.\n“We dodged one bullet,” Murphy said, referring to the lower-than-feared need for hospital beds. “My worst nightmare, other than the loss of life ... is that people get sloppy.” ___\nLONG-TERM CARE FACILITIES:\nNew Jersey officials said they were working to round up nursing aides and personal protective equipment as nursing homes battle continued shortages.\n“We’ve gone out to some of the nursing homes to help correct really daunting situations where staff has called in sick or abandoned the nursing homes,” said Judy Persichilli, the state’s health commissioner. “The staffing and the PPE continue to be a problem.”\nAuthorities meanwhile noted that two employees at psychiatric facilities in the state had died, while 237 of 4,800 staff members have been infected.\n___\nABOUT THE VIRUS\nFor most people, the virus causes mild or moderate symptoms that clear up in a couple of weeks. Older adults and people with existing health problems are at higher risk of more severe illness, including pneumonia, or death.", "url": "https://apnews.com/470a4a861503339bbf0b48084062cc95"}