{"authors": [], "date_download": "2020-05-04 21:06:47", "date_modify": "2020-05-04 21:06:47", "date_publish": "2020-04-13 04:44:27", "description": "TOKYO (AP) — A “stay home” message tweeted by Japanese Prime Minister Shinzo Abe has fueled anger and accusations that he is insensitive toward people who cannot remain at home because the...", "filename": "_510fd32354ee0820631a489807129314_1588626407.html", "image_url": "https://storage.googleapis.com/afs-prod/media/3a40c085583e4270a97ef0664bff0811/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_510fd32354ee0820631a489807129314_1588626407.html", "title": "Abe fuels anger; more recovered South Koreans test positive", "title_page": "Abe fuels anger; more recovered South Koreans test positive", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "People wearing face masks to help protect against the spread of the new coronavirus listen to a speech of the main opposition United Future Party's candidate Hwang Kyo-ahn during his campaign for the upcoming parliamentary elections in Seoul, South Korea, Monday, April 13, 2020. The elections will be held on April 15 about 14,300 polling stations at all over the nation to pick lawmakers. (AP Photo/Ahn Young-joon)\nPeople wearing face masks to help protect against the spread of the new coronavirus listen to a speech of the main opposition United Future Party's candidate Hwang Kyo-ahn during his campaign for the upcoming parliamentary elections in Seoul, South Korea, Monday, April 13, 2020. The elections will be held on April 15 about 14,300 polling stations at all over the nation to pick lawmakers. (AP Photo/Ahn Young-joon)\nTOKYO (AP) — A “stay home” message tweeted by Japanese Prime Minister Shinzo Abe has fueled anger and accusations that he is insensitive toward people who cannot remain at home because the government’s social distancing measures are voluntary and don’t provide compensation.\nSome people reacting to Abe’s video message said he acted like “an aristocrat.” The one-minute video released Sunday shows Abe sitting at home patting his dog, reading a book, sipping from a cup and clicking on a remote control. Entertainer Gen Hoshino, who plays the guitar in a split screen in the video, has said the clip was used without his permission.\nAbe declared a state of emergency in Tokyo and six other prefectures last Tuesday and broadened it nationwide on Saturday. He is asking people to stay home, but wants closures of non-essential businesses to wait until the effects of the stay-home request are evaluated.\nTokyo Gov. Yuriko Koike, however, went ahead and asked businesses such as hostess bars, movie theaters and schools to close until May 6, but most other prefectures have waited. Saitama, north of Tokyo, started non-essential business closures on Monday. Its governor, Motohiro Ono, said he plans to ask the central government for financial support to compensate businesses.\nMany Japanese companies have been slow to switch to remote work, and many people are still commuting to their jobs.\nJapan has 7,255 confirmed coronavirus cases and 114 deaths, according to figures released Monday.\nIn other developments around the Asia-Pacific region:\n— MORE RELEASED PATIENTS TESTING POSITIVE AGAIN: South Korea’s top infectious disease expert says the number of patients who tested positive for the coronavirus for a second time after their initial release from hospitals has increased to 116. Jeong Eun-kyeong, director of the country’s Centers for Disease Control and Prevention, said Monday that so far there haven’t been any confirmed transmissions from patients who tested positive for a second time.\n— DEBT RELIEF PLEA FOR POOR COUNTRIES: Pakistan Prime Minister Imran Khan has issued a plea to richer nations and international financial institutions to provide debt relief for poor countries whose economies have been devastated by the battle against the coronavirus. Pakistan has 5,374 confirmed cases of the coronavirus with 93 deaths, but testing has been slow.\n— BACK TO SCHOOL: Sri Lankan authorities have announced that schools will reopen on May 11, while universities will begin to function gradually from May 4. The island nation has been under curfew for the most part since March 20 to stop the spread of the coronavirus. The country has 210 confirmed cases, including seven deaths.\n— MAKING MASKS: Mask and disinfecting wipe producer Wuhan Zonsen says $50 million in orders from European countries and the United States will keep it at full production capacity until June. Chinese exporters are facing stricter quality inspections from regulators after complaints were made of substandard goods being sold abroad.\n— MORE TRAVELERS POSITIVE: China reported 108 new cases of coronavirus infection, 98 of them imported. Of the new domestic cases, seven were recorded in the province of Heilongjiang bordering Russia and three in the southern business hub of Guangzhou. China’s official totals are now 3,341 deaths among 82,160 people who’ve tested positive.\n— NURSING HOME DEATHS: New Zealand recorded its fifth death from COVID-19 and the third connected with a rest home in Christchurch where several residents and staff are infected. Nursing homes housing elderly and other people most vulnerable to the virus have been troubling hot spots of infection around the globe.\n— WIDODO PLEDGES TRANSPARENCY: Indonesian President Joko Widodo has pledged to be more transparent about the coronavirus as infections spike in the world’s fourth most populous country. Last month, he admitted that he deliberately held back information about the spread of the virus to prevent panic. Now, he said his view of data transparency has changed and asked Cabinet ministers on Monday to be more open. Indonesia has confirmed 4,557 cases with 399 deaths, the highest number of recorded fatalities in Asia after China.", "url": "https://apnews.com/510fd32354ee0820631a489807129314"}