{"authors": ["Eliza Mackintosh"], "date_download": "2020-05-04 16:25:58", "date_modify": "2020-05-04 16:25:58", "date_publish": "2020-04-07 12:07:09", "description": "As nations look to their leaders for guidance in this time of crisis, British Prime Minister Boris Johnson is waging his own personal fight against the virus from an intensive care bed. Here's what else you need to know for Tuesday.", "filename": "2020_04_07_world_coronavirus-newsletter-04-07-20-intl_index_1588609558.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_world_coronavirus-newsletter-04-07-20-intl_index_1588609558.html", "title": "What you need to know about coronavirus on Tuesday, April 7", "title_page": "What you need to know about coronavirus on Tuesday, April 7 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story appeared in the April 7 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every weekday\n(CNN) As nations look to their leaders for guidance in this time of crisis, Britain's Prime Minister Boris Johnson is waging his own personal fight with the coronavirus from a London hospital, where he has been moved to the intensive care unit and given oxygen after his symptoms worsened.\nJohnson's hospitalization has highlighted the lack of a formal line of succession in the UK government, which was accused of being slow off the mark to react to the pandemic. While Foreign Secretary Dominic Raab will deputize for Johnson \"where necessary,\" another key cabinet official sidestepped a question today about who held the \"nuclear codes.\nIn a rare moment of détente between political rivals, Democratic presidential front-runner Joe Biden spoke with Trump by phone yesterday to discuss the outbreak. It's easy to forget that America is in the midst of a presidential race, but after courts halted Democratic efforts to delay the Wisconsin primary , voters there today will face this stark choice: safeguard their health or go to the polls.\nYOU ASKED. WE ANSWERED\nQ: What is hydroxychloroquine and can it be used to treat coronavirus?\nA: Hydroxychloroquine is derived from quinine, which French chemists in 1820 isolated from the bark of the cinchona tree. In 1934, German scientists created the synthetic chloroquine as part of a class of anti-malarials. There have been indications that hydroxychloroquine is effective in treating or preventing Covid-19, but the tests haven't endured the due diligence of extensive clinical trials. Still, Trump is pushing it. Hydroxychloroquine is derived from quinine, which French chemists in 1820 isolated from the bark of the cinchona tree. In 1934, German scientists created the synthetic chloroquine as part of a class of anti-malarials. There have been indications that hydroxychloroquine is effective in treating or preventing Covid-19, but the tests haven't endured the due diligence of extensive clinical trials. Still, Trump is pushing it. Here's what you need to know about the drug.\nMore than 50,000 people have asked us questions about the outbreak. Send yours here . Are you a health care worker fighting Covid-19? Message us on WhatsApp about the challenges you're facing: +1 347-322-0415.\nWHAT'S IMPORTANT TODAY\n'The tip of the iceberg'\n\"If you die in my county, I will not know if you died of Covid-19.\" This is the reality for coroners around the US, who are increasingly concerned that test shortages will leave many coronavirus deaths uncounted.\nAs the official US death toll passes 10,000, health experts are warning that the count could be dramatically underestimated due to a lag in data and misclassifications. \"We really are just seeing the tip of the iceberg,\" one doctor told CNN.\nHow do you reopen the economy? Germany has a plan\nIt's a marathon, not a sprint. That's the approach recommended by a group of experts in Germany who envision a gradual revival of Europe's biggest economy that would allow specific industries and workers to resume their activities, while steps are taken to prevent a resurgence of the virus.\nVirus hunters zero in on culprit\nScientists are divided about the origins of the outbreak , but they agree on this: Anyone who claims to know the source of Covid-19 is guessing. Virus experts told CNN that there is zero evidence to back up various nationalist-tinged conspiracies, but they're at odds over the once widely accepted theory that the virus originated at a wet market in Wuhan, China. To date, one possible culprit does seem likely: Bats.\nState of emergency in Japan\nIn stark contrast to neighbors like Taiwan, which has brought the virus to heel, Japan has been criticized for its lax handling of the outbreak. Prime Minister Shinzo Abe has announced an unprecedented $989 billion economic stimulus package — 20% of Japan's GDP — and declared a state of emergency, but he says \"basic economic activity\" will continue.\nChina reports no new fatalities\nThe country where the pandemic began recorded no new deaths yesterday for the first time since January. There were also no locally transmitted infections found yesterday; all new cases were imported from abroad. And tomorrow, Wuhan will finally lift its lockdown after three months.\nON OUR RADAR\nTOP TIPS\nTODAY'S PODCAST\n\"The majority of Americans are used to abundance ... so telling someone: 'It may not be there for you. It may be that we have to ration.' That does not go over well.\" -- Arthur Caplan, Professor of Medical Ethics, NYU School of Medicine", "url": "https://www.cnn.com/2020/04/07/world/coronavirus-newsletter-04-07-20-intl/index.html"}