{"authors": ["Bue Rübner Hansen", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Sarah Lazare", "Adam Johnson", "Martine Orange", "Grace Blakeley", "Fredrik V. Sand"], "date_download": "2020-05-04 19:58:11", "date_modify": "2020-05-04 19:58:11", "date_publish": "2020-03-18 00:00:00", "description": null, "filename": "2020_03_coronavirus-denmark-social-democracy-layoffs_1588622291.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/18121643/GettyImages-1206357273.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_coronavirus-denmark-social-democracy-layoffs_1588622291.html", "title": "Social-Democratic Denmark Shows How to Respond to Coronavirus", "title_page": "Social-Democratic Denmark Shows How to Respond to Coronavirus", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nWhile Britain remains stubbornly open for business (and contagion), Denmark is preparing to deal with the economic fallout from the coronavirus recession. This Sunday, the Danish government struck a historical deal with trade unions and employers’ associations to stop mass layoffs during the quarantine. During the next three months, the state will cover 75 percent of the wages of workers threatened by job loss, up to $3,300. Companies will cover the remaining 25 percent, while workers will give up five days of paid vacation time — in other words, work five days for free. The deal covers companies who would have to lay off at least 30 percent of staff, or fifty staff or more. In return, companies commit to not lay off any staff for economic reasons while they’re receiving state compensation. Covering 75 percent of wages may seem like a huge investment for the state, but it is much smaller than it seems. Layoffs mean lost tax income and expenses to unemployment benefits. Instead of losing the money, subsidizing wages provides the state with an opportunity to spend it. Rather than a handout to companies, it’s an investment in maintaining economic confidence and an attempt to avoid a more costly economic crisis. Initially, money has been set aside to cover 2.5 percent of all non-public employees, but the Social Democratic government is willing to put the full financial power of the state behind the deal: “There is no ceiling,” finance minister Nicolai Wammen said as the deal was unveiled this Sunday.\nThe Danish Model This deal shows the resilience of the Danish model of tripartite employment relations, which has been declared dead on many occasions during the last decade. However, even though it gives a boost to Denmark’s social democratic version of corporatism, it remains under attack. Currently, collective bargaining agreements are being negotiated on unusually uneven grounds, as the coronavirus leaves unions without the threat of industrial action. Many unions demand a suspension of negotiations until after the quarantine, but the Social Democratic government has so far ignored them. The deal also shows some of the weaknesses of the Danish model: the self-employed, owner-managers, and people on casual and zero-hour contracts are not covered. They are already among the hardest hit, but poorly represented by interest organizations. Meanwhile, the quarantine drains the limited benefits of the unemployed. What will happen after three months remains an open question. Many employers, especially in the hospitality industry, expect a much longer downturn. Such employers would rather lay off workers than pay 25 percent for staff they don’t and won’t need. However, the resolute commitment of the government and the popularity of these measures may open the door for similar policies in the future. “The echo of what we are doing now will be heard into the future. Now we are laying the tracks for companies and employees to get well through the crisis,” said prime minister Mette Frederiksen.", "url": "https://www.jacobinmag.com/2020/03/coronavirus-denmark-social-democracy-layoffs"}