{"authors": ["On Assignment For Huffpost"], "date_download": "2020-05-04 20:28:07", "date_modify": "2020-05-04 20:28:07", "date_publish": "2020-04-30 09:45:03", "description": "The millennial-favorite cook and author offers an accessible way to pass the time while sheltering at home.", "filename": "entry_alison-roman-pandemic_l_5ea33ca3c5b669fd89249bab_1588624087.html", "image_url": "https://img.huffingtonpost.com/asset/5ea6f3323000002711154f7a.jpeg?cache=6ilip11DgJ&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_alison-roman-pandemic_l_5ea33ca3c5b669fd89249bab_1588624087.html", "title": "Why Alison Roman Has Become A North Star For Pandemic-Era Cooking", "title_page": "Why Alison Roman Has Become A North Star For Pandemic-Era Cooking | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "I caught myself “Julie & Julia”-ing Alison Roman recipes well before the coronavirus pandemic overtook our world. It was a way to fill the time, stepping away from my go-to weekly meals of tacos and penne pasta with overpriced Rao’s sauce. I was challenging myself, tracking down sumac in three different grocery stores and overcoming the anxiety of undercooking chicken and killing everyone in my household.\nI was sifting through her two New York Times best-selling cookbooks, “Dining In” and “Nothing Fancy,” on Sundays, preparing a grocery list that was unrecognizable: anchovies, full-fat coconut milk and harissa. I stepped back and realized Roman’s two cookbooks were spattered in oil, had water damage on certain pages and, to my chagrin, a Sharpie streak over one of my most visited pages (slow-roasted oregano chicken with buttered tomatoes, page 189). Unlike some of my other cookbooks, Roman’s went far beyond coffee table decor. They were actually being used.\nThe act of “Julie & Julia”-ing is derived from Julie Powell’s book “Julie & Julia: My Year of Cooking Dangerously” and subsequent movie adaptation directed by Nora Ephron. Powell cooked her way through Julia Child’s iconic cookbook, wherein she finds herself somewhere between poached eggs and boeuf bourguignon. Unbeknownst to me, I was doing the same but with a lot more chickpeas.\nBefore (when I could leave my apartment), I liked Roman for many reasons: Her witty remarks on NYTCooking videos and direct responses on Twitter made clear she’s not a celebrity chef living in a Malibu mansion. Roman is captivating because she’s living in a rental apartment without a dishwasher, piling up (and cleaning!) her dishes as she goes. Personality is a driving force in any YouTube video; Roman curses, she messes up, she pivots live. Here, we finally have someone who admits to burning the short ribs in a tutorial and addresses it head-on with a solution.\nAnd then there are her recipes, and how I felt after making them (like a culinary expert, one step away from my very own catchphrase). As a self-graded B-/B+ cook, I was initially drawn to her recipes unromantically ― simply put, they seemed easy. And after I tried a few and then cooked for other people (this was 2019, a different time), I realized they were actually good. Like, really good. The hype was real, and worth it.\nNBC via Getty Images Alison Roman during a cooking segment with late night host Seth Meyers on Oct. 22, 2019.\nNow that we’re all in the midst of a pandemic, it seems Roman has become a North Star in times of staying at home. The Cut says it best: “She has become the domestic goddess of the apocalypse.”\nNow more than ever, Roman’s recipes are keeping any glimmer of culinary interest intact. Furthermore, her motto surrounding the casualness of cooking is immensely appreciated, as is the fact that most recipes are “pantry staples,” making trips to the grocery store less necessary in a time when those trips can be scary.\nAnd Roman has upped her presence on social media. Between Instagram and Twitter, she’s connecting with her cooking cohorts and peppering cooks with substitutions, advice and guidance. She’s been answering questions on Twitter and participating in Q&As. I tuned into a Zoom meeting hosted by The Wing in which Roman taught people how to bake her lemony turmeric tea cake and seafood pasta from the comfort of her quarantined home. A few weeks ago, she was answering questions about her Passover dinner. If you want relatability, that is what you’ll get: a real woman, writing and cooking for the masses while taking away unnecessary pretension that has been embedded into cooking.\nHer unpretentiousness seems to have hit a chord with a younger generation of cooks in more ways than one. Hayley McGuirl, a marketing manager in Washington, D.C., claims Roman’s laid-back approach to cooking still feels fancy, despite the title of her second book.\n“Her ‘Hot Takes’ make me love her even more, such as: Don’t worry about wine pairings, drink whatever you want to drink,” McGuirl told HuffPost. “Roman claims that her recipes are ‘highly cookable,’ but to me, they’re still quite sophisticated and incorporate ingredients I’ve never used before, like hazelnuts, buckwheat and, of course, anchovies. Her demeanor makes me excited to experiment and try new things that I never would’ve thought to cook with.”\nThe recipes are just approachable enough for an inexperienced cook to try, but just special enough to add a little spark to our endlessly mundane lives of late.\n“We may be quarantined, but the recipes are all reminiscent of social gatherings and Sunday family dinners with friends,” McGuirl said. “I feel like I’m just perfecting my craft for when this is all over. ... My birthday is this month and in lieu of going out to eat or to a bar with friends, I’m most excited to make the lemony turmeric tea cake and share it with my roommates. She has such a strong social media presence, so of course her fans have been sharing [Roman’s] recipes they’ve made over the past few weeks at home, and it’s fun to try to get her attention and see her repost.”\nAnother favorite quality is Roman’s unfussiness, McGuirl said: “In one of my favorite moments of her NYT Cooking Thanksgiving video, she claims, ‘My rule is generally that I don’t set the table. I set out plates, I set out silverware, and people can help themselves. ... We’re probably gonna use paper towels for napkins. That’s just the way I live my life.’ The camera pans to a stack of mismatched plates and glasses of all different colors and sizes. I live with a lot of roommates and our kitchen is a hodgepodge of residents past and present, so as someone who also loves to host, I found this extremely refreshing.”", "url": "https://www.huffpost.com/entry/alison-roman-pandemic_l_5ea33ca3c5b669fd89249bab"}