{"authors": ["Ryan J. Foley"], "date_download": "2020-05-04 20:19:19", "date_modify": "2020-05-04 20:19:19", "date_publish": "2020-04-14 16:52:03", "description": "IOWA CITY, Iowa (AP) — Iowa reported its biggest daily increase in coronavirus cases Tuesday as the number of employees testing positive at a large pork plant grew to 166 and the number of...", "filename": "_cc4aa2686c5e1d6044ad0171cafee83d_1588623559.html", "image_url": "https://storage.googleapis.com/afs-prod/media/d570eebb612b486aa5c30ddb3e892006/2000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cc4aa2686c5e1d6044ad0171cafee83d_1588623559.html", "title": "COVID-19 cases surge in Iowa amid outbreaks in plants, homes", "title_page": "COVID-19 cases surge in Iowa amid outbreaks in plants, homes", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Iowa Gov. Kim Reynolds holds a news conference on COVID-19 at the State Emergency Operations Center on Tuesday, April 14, 2020, in Johnston. Reynolds announced there more positive tests and deaths related to COVID-19. (Brian Powers/The Des Moines Register via AP )\nIowa Gov. Kim Reynolds holds a news conference on COVID-19 at the State Emergency Operations Center on Tuesday, April 14, 2020, in Johnston. Reynolds announced there more positive tests and deaths related to COVID-19. (Brian Powers/The Des Moines Register via AP )\nIOWA CITY, Iowa (AP) — Iowa reported its biggest daily increase in coronavirus cases Tuesday as the number of employees testing positive at a large pork plant grew to 166 and the number of outbreaks at long-term care facilities doubled.\nGov. Kim Reynolds announced 189 new cases of COVID-19, the respiratory illness caused by the virus,taking the state’s total number of people infected to 1,899. The number of patients hospitalized with the virus in Iowa increased by 14% from Monday, to 163, and deaths grew by six to 49.\nThe latest data suggests some communities have been hit harder than others. While Latinos and Hispanics make up only 6% of the population, they account for 16.4% of confirmed cases. African Americans, who make up about 4% of the state’s population, account for 8.7% of Iowa’s cases.\nThe governor said 86 of the people newly infected are linked to the outbreak at the Tyson Foods plant in Columbus Junction, where workers have been prioritized for testing in recent days.\nTyson last week temporarily suspended production at the plant after acknowledging that more than two dozen of its 1,400 workers had the virus. The company said Monday that the temporary closure would continue this week.\nReynolds said the state made more tests available to Tyson employees as part of a plan to understand the scope of the outbreak and get the plant reopened. The governor praised Tyson’s handling of the situation and said the company, not the state, would decide when it’s safe to resume production.\n“They have really been very proactive in making sure what when they stand the plant back up, they are doing everything they can not just to protect the employees but to continue a really critical part of our food supply chain,” Reynolds said.\nFueled by the Tyson outbreak, more than 1% of the 11,000 residents of rural Louisa County have tested positive for coronavirus, the highest percentage in the state. But local officials said they have the situation under control.\n“Things are fine here in Columbus Junction,” Mayor Mark Huston said. “It would be nice to get the economy going again because the streets are pretty quiet.”\nReynolds said state officials were assisting other companies with reported cases. The Iowa Premium beef plant in Tama closed this week after several of its 850 employees tested positive.\nThe governor also confirmed that the number of long-term care facilities with outbreaks has doubled to six since last week.\nThe Iowa Department of Public Health defines an outbreak in a long-term care facility as one in which three residents test positive for COVID-19.\nThe new outbreaks included: 22 people infected at a rehabilitation center for the disabled in Ankeny; six at a Des Moines nursing home specializing in patients with Alzheimer’s Disease and other forms of dementia; and six at a Lutheran retirement home in Waverly.\nSeveral more of the state’s 440 long-term care facilities have reported coronavirus infections of residents and staff that do not reach the state’s threshold for an outbreak.\nFor instance, Linn County reported Monday that two residents at Linn Manor in Marion have died and three employees have been sickened after testing positive.\nA Linn County public health official, Heather Meador, said Monday that the county considers the situation an outbreak. The state, however, does not.\nThe state’s largest outbreak remains at Heritage Specialty Care in Cedar Rapids, where 102 residents and staff have tested positive. Seventeen residents had died as of Monday, Meador said.", "url": "https://apnews.com/cc4aa2686c5e1d6044ad0171cafee83d"}