{"authors": ["Ryan J. Foley"], "date_download": "2020-05-04 20:23:31", "date_modify": "2020-05-04 20:23:31", "date_publish": "2020-04-20 17:32:03", "description": "IOWA CITY, Iowa (AP) — Governors in the Midwest are working to keep large meatpacking plants operating despite coronavirus outbreaks that have sickened hundreds of workers and threaten to disrupt...", "filename": "_9fe445bacb2a4638e7bf88bbeb835cb7_1588623811.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e7377817c3a147f992df5075f94a0aec/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9fe445bacb2a4638e7bf88bbeb835cb7_1588623811.html", "title": "States work to keep meat plants open despite virus outbreaks", "title_page": "States work to keep meat plants open despite virus outbreaks", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Saturday, April 18, 2020, photo, medical workers administer drive-up COVID-19 tests outside the Sanford Worthington Clinic in Worthington, Minn. The state has sent a team to ensure safe conditions in the southwestern Minnesota city, where multiple people have tested positive at a meatpacking plant. (Aaron Lavinsky/Star Tribune via AP)\nIn this Saturday, April 18, 2020, photo, medical workers administer drive-up COVID-19 tests outside the Sanford Worthington Clinic in Worthington, Minn. The state has sent a team to ensure safe conditions in the southwestern Minnesota city, where multiple people have tested positive at a meatpacking plant. (Aaron Lavinsky/Star Tribune via AP)\nIOWA CITY, Iowa (AP) — Governors in the Midwest are working to keep large meatpacking plants operating despite coronavirus outbreaks that have sickened hundreds of workers and threaten to disrupt the nation’s supply of pork and beef .\nIn Kansas, Gov. Laura Kelly sent personal protective equipment and testing supplies to counties with meat processing plants. Gov. Kristi Noem said she didn’t think it would be difficult to fulfill federal requirements to reopen a shuttered facility in South Dakota. And Iowa Gov. Kim Reynolds warned of the dire cost of closing plants, even as she acknowledged the certainty of more clusters of infection at the facilities.\nJBS USA said Monday it was suspending operations at a large pork processing plant in southwestern Minnesota because of an outbreak of COVID-19 among workers — the latest facility to be closed in the public health crisis.\nMinnesota Health Commissioner Jan Malcolm said 33 JBS employees and six close relatives had tested positive as of Saturday.\nMeat processing workers are particularly susceptible to the virus because they typically stand shoulder-to-shoulder on the line and congregate in crowded locker rooms and cafeterias.\nThe JBS plant in Worthington employs more than 2,000 people and normally slaughters 20,000 hogs per day.\n“We don’t make this decision lightly,” Bob Krebs, president of Colorado-based JBS USA Pork, said in a statement. “We recognize JBS Worthington is critical to local hog producers, the U.S. food supply and the many businesses that support the facility.”\nIowa’s governor has also warned of the threat to food supply if authorities clamp down too hard on facilities with outbreaks, and has refused to shutter a sprawling Tyson Foods pork processing facility in Waterloo where dozens of workers are infected.\nReynolds said the state is working with meat companies to test workers and prevent outbreaks from growing too large, even as she acknowledged that more “clusters of positive cases” are certain.\n“These are also essential businesses and an essential workforce,” she said. “Without them, people’s lives and our food supply will be impacted. So we must do our part to keep them open in a safe and responsible way.”\nReynolds noted that Iowa produces about one-third of the nation’s pork. If hogs can’t be processed, farmers will have to euthanize them, the governor warned.\n“We’re not that far from it and it will be devastating, not only for the food supply but for the cost of food moving forward,” she said.\nAdvocates for workers said Reynolds has little regard for a vulnerable workforce that includes many refugees and immigrants.\n“It’s sickening,” said Democratic state Sen. Bill Dotzler of Waterloo, who has called for a temporary closure and stronger worker protections. Hospitals and medical clinics in his city reported a surge in patients Monday, and many of them were Tyson employees.\nA National Beef plant in Tama, Iowa, that had been closed for two weeks resumed production on Monday as scheduled. A day earlier, Reynolds announced that 177 workers out of more than 500 tested were positive for the coronavirus. The Kansas City, Missouri-based company didn’t return messages.\nCargill and National Beef have reported infections among employees at plants in southwest Kansas, prompting Gov. Kelly to direct an influx of federal tests and safety equipment to counties in that region. Tyson also has plants there but has not confirmed infections.\nControlling those outbreaks is crucial: Plants in southwest Kansas account for 25 to 30% of beef processing in the U.S.\n“It would be a disaster if we had to shut down, so we’re trying to do everything that we can to keep those plants online,” Kelly told The Associated Press.\nSouth Dakota’s governor said the temporary closure of a Smithfield Foods pork plant that produces about 5% of the U.S. pork supply has already been “devastating” for regional producers.\nCenters for Disease Control and Prevention recommendations for safely reopening the Sioux Falls plant will be made public soon, Noem said. Its report will call for improved social distancing, expanded use of face shields and other protective equipment, and better communication between the company and workers.\n“There’s nothing in this report that I think will be difficult to accomplish,” said Noem. She declined to say how soon it might reopen.\nSmithfield Foods has said the indefinite closure disrupted its supply chain, forcing the closure of a facility in Martin City, Missouri. Smithfield also shuttered a plant in Cudahy, Wisconsin, after employees tested positive for the virus.\nAlso in Wisconsin, a surge of infections has been linked to the JBS Packerland plant in Green Bay. Health officials said they didn’t have an exact number of infections connected to the plant, but infections spiked by more than 100 in the surrounding county over the weekend. The plant remains open.\nIn western Michigan, a JBS meat packing plant that was closed over the weekend reopened Monday. Sixty people there have tested positive for the coronavirus, Allegan County health spokeswoman Lindsay Maunz told WOOD-TV.\n___\nAssociated Press reporters Steve Karnowski in Minneapolis; Stephen Groves in Sioux Falls; and Heather Hollingsworth in Mission, Kansas, contributed to this story.", "url": "https://apnews.com/9fe445bacb2a4638e7bf88bbeb835cb7"}