{"authors": ["Hanna Ziady", "Michelle Toh"], "date_download": "2020-05-04 16:09:07", "date_modify": "2020-05-04 16:09:07", "date_publish": "2020-04-02 18:09:52", "description": "British Airways will furlough 30,000 of its employees with pay, as the coronavirus pandemic halts global travel.", "filename": "2020_04_02_business_british-airways-furlough-coronavirus_index_1588608547.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200317090553-grounded-british-airways-planes-heathrow-0306-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_business_british-airways-furlough-coronavirus_index_1588608547.html", "title": "British Airways furloughs 30,000 workers", "title_page": "British Airways furloughs 30,000 workers - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) British Airways will furlough 30,000 of its employees with pay, as the coronavirus pandemic halts global travel, forcing airlines to ground planes and slash costs.\nThe United Kingdom's flagship carrier, owned by, said in a statement Thursday that it is implementing a \"furlough scheme\" to minimize the financial impact of the coronavirus on staff.\nAfter talks with unions, British Airways agreed to provide workers with 80% of their regular pay, with no cap on earnings, according to the major UK union, Unite. The first £2,500 ($3,095) will be paid by the government , with BA making up the shortfall, Unite said in a statement. There will be no unpaid temporary layoffs and the measures will be in place until the end of May.\nThis is \"as good a deal as possible for our members,\" said Oliver Richardson, Unite's national officer for aviation. \"The deal protects the jobs of BA staff and, as far as possible, also protects their pay,\" he said in a statement.\nBritish Airways, which on Monday suspended flights from London's Gatwick airport, is the latest major European carrier to announce sweeping operational changes. On Monday, UK budget carrier grounded its entire fleet , furloughing 4,000 cabin crew. Europe's largest low-cost carrierwill ground more than 90% of its aircraft over the coming weeks, while Scotland-based Loganair plans to approach the government for financial aid.\nAirlines around the world have been brought to their knees as the pandemic worsens, particularly in Europe and North America, with flight bans and nationwide lockdowns threatening to shut down aviation altogether. Many carriers have slashed or suspended their short-term flight schedules, placed workers on unpaid leave and paused hiring. Several industry CEOs have stopped taking salaries\nBailouts ahead\nWhile US airlines will receive tens of billions of dollars in support as part of the country's $2 trillion stimulus package, governments in Europe have not promised bailouts to their carriers.\nThe UK government has said that airlines, like all companies, can make use of measures to help businesses hit by the coronavirus, including capital-raising programs and tax relief. \"We are continuing to work closely with the sector and are willing to consider the situation of individual firms, so long as all other government schemes have been explored and all commercial options exhausted, including raising capital from existing investors,\" a government spokesperson said.\nVirgin Atlantic on Thursday declined to comment on media reports that the airline is seeking financial assistance from the UK government. The company said that Richard Branson, its billionaire owner, is plowing $250 million into Virgin Group companies to protect jobs.\nLufthansa, which owns national carriers in Germany, Switzerland, Austria and Belgium, said in a statement Thursday that it is \"in close contact\" with the federal governments of its home markets to secure its liquidity.\nAirbus EADSF A spokesperson fortold CNN Business that the plane maker is \"strongly advocating government support for all airlines.\"\n\"[There is] no more 'normal' for aviation,\" analysts at CAPA Centre for Aviation, said in a report Thursday. \"The revenue reduction faced by airlines this year as a result of COVID-19 far exceeds the impact from previous crises. It has the dimensions of a world war,\" they noted.\nThe International Air Transport Association expects the crisis to cut industry revenues globally by $252 billion this year compared to 2019, with airlines burning through $61 billion in cash in the second quarter.\n-- Eoin McSweeney and Chris Liakos contributed to this report.", "url": "https://www.cnn.com/2020/04/02/business/british-airways-furlough-coronavirus/index.html"}