{"authors": ["Nicole Chavez", "Jason Hanna", "Madeline Holcombe"], "date_download": "2020-05-04 17:00:15", "date_modify": "2020-05-04 17:00:15", "date_publish": "2020-04-09 07:52:02", "description": "The number of coronavirus patients in New York and Connecticut is starting to rise at a slower rate and the nation's top infectious disease official says it's a sign that social distancing is working.", "filename": "2020_04_09_health_us-coronavirus-thursday_index_1588611615.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407194437-anthony-fauci-press-briefing-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_health_us-coronavirus-thursday_index_1588611615.html", "title": "Fauci says coronavirus hospitalizations are dropping because social distancing is working", "title_page": "US coronavirus: Fauci says hospitalizations are dropping because social distancing is working  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The number of coronavirus patients in New York and Connecticut is starting to rise at a slower rate and the nation's top infectious disease official says it's a sign that social distancing is working.\n\"At the same time as we're seeing the increase in deaths, we're seeing a rather dramatic decrease in the need for hospitalizations,\" Dr. Anthony Fauci told reporters at a White House briefing Thursday.\n\"That means that what we are doing is working and therefore we need to continue to do it,\" Fauci, the director of the National Institute of Allergy and Infectious Diseases, added.\nDr. Robert Redfield, director of the US Centers for Disease Control and Prevention, said the most powerful weapon against coronavirus is social distancing.\n\"We're not defenseless,\" Redfield said in CNN's coronavirus town hall Thursday. \"This virus has a very significant weakness, it can't swim 7 feet.\"\nEarlier Thursday, New York Gov. Andrew Cuomo announced the state had its lowest daily jump in hospitalizations \"since this nightmare started.\"\nNew York, the epicenter of the American coronavirus outbreak , has more than 161,000 confirmed cases of its own but had only about 200 new hospitalizations Wednesday, the governor said.\n\"You're not out of the woods,\" Cuomo said in a news conference Thursday. \"We've done some great things and we've saved lives because we've followed these policies (like staying at home).\"\nMore than 465,300 known coronavirus cases and at least 16,672 deaths have been reported in the United States. States across the country have issued stay-at-home orders, leaving many workers idle and health care workers scrambling to treat the increasing number of patients.\nBut Wednesday also was the state's deadliest day of the outbreak, with 799 deaths. Cuomo has said deaths are a lagging indicator, because those who die tend to have been hospitalized the longest.\nEmergency medical technicians wheel a patient into Elmhurst Hospital Center's emergency room in New York City.\nCuomo was among several governors who said they were encouraged by the impact that social distancing is having against the spread of the virus.\nConnecticut Gov. Ned Lamont said during a call with small business leaders that new hospitalizations dropped to their lowest point in two weeks. Meanwhile, Arkansas Gov. Asa Hutchinson said the state has the lowest number of hospitalizations per 100,000 people compared to other southern states.\nThe number of coronavirus-related deaths in Ohio continues to increase but Gov. Mike DeWine said \"things are not as bad as they might have been\" because the number of people impacted by the virus is lower than previously projected.\n\"So, is it time to celebrate? No,\" DeWine told reporters Thursday. \"The game is not over.\"\nOhio, Minnesota and New Mexico have extended their stay-at-home orders into May while national social distancing guidelines are currently running through at least April 30\nUS to reach highest daily number of deaths Sunday, experts say\nThe Trump administration and health officials are navigating potentially competing circumstances: Hard economic news, as workers stay home; and indications that social distancing is helping to keep coronavirus deaths down\nAnother 6.6 million people filed claims for unemployment benefits last week, data released Thursday show. This means more than 16.8 million Americans have sought unemployment aid since mid-March.\nPresident Donald Trump is preparing to announce a second coronavirus task force focused solely on reopening the economy, multiple sources told CNN.\nAnd over the past week, Trump's economic team advised him that even if the economy doesn't open all at once on May 1 -- a date some advisers want -- the administration should at least announce an estimated timeline.\nMiguel Diaz, who works for the Florida city of Hialeah, hands out unemployment applications to people in their vehicles in front of a library Wednesday.\nWhile maintaining social distancing measures appears to be holding down the spread in some areas, experts say the country is not ready to shift to a more normal life yet.\nEasing social distancing too soon risks \"a huge resurgence -- and much worse than what we've seen already,\" Crystal Watson, assistant professor at Johns Hopkins' public health school, told CNN on Thursday.\nWatson co-authored a report suggesting prerequisites for reopening the economy, including a sustained reduction in cases for 14 days, and improved abilities to test people and monitor and trace cases.\nThe United States is set to reach its highest daily number of deaths on or around Sunday, according to models by the Institute for Health Metrics and Evaluation at the University of Washington in Seattle.\nThe highest number of coronavirus deaths reported in a day came Wednesday with 1,922, according to data supplied by Johns Hopkins University.\nThe IHME estimated 60,415 in the US would die of coronavirus disease by August, assuming social-distancing policies continue through May. That projection is down from the figure that the model predicted earlier in the week : 82,000.\nThat decrease is thanks to the actions taken by Americans , White House coronavirus response coordinator Dr. Deborah Birx said.\n\"What has been so remarkable, I think, to those of us that have been in the science field for so long,\" Birx said, \"is how important behavioral change is, and how amazing Americans are at adapting to and following through on these behavioral changes.\"\nSome hospitals in hot spots such as Detroit and New York, however, still are straining to keep up with the weeks of influx in patients. Detroit's Sinai-Grace Hospital has been so overwhelmed, at least two people have died in its emergency room hallways before help can arrive, health care workers there told CNN.\nFauci speculates Americans could take summer vacations, but there are caveats\nAmericans have the potential to take summer vacations this year -- provided that the country continues aggressive mitigation efforts now and gets to a place where it can modify them, Fauci, the nation's top infectious disease official said Thursday.\nOn \"CBS This Morning\" Thursday, Fauci was asked whether he could envision a typical summer with vacations , baseball games, weddings and family reunions.\n\"It can be in the cards,\" Fauci told CBS.\nBut, he warned: \"When we pull back and try to open up the country ... we have to be prepared that when the infections start to rear their heads again,\" the country has a way to aggressively and effectively \"identify, isolate, contract trace and make sure we don't have those spikes we have now.\"\nMoving toward normalcy will be gradual, and could be different by region, he said.\n\"Hopefully, by the time we get to the summer, we will have taken many steps in that direction\" that would allow some normalization.\nFauci has consistently stressed social distancing should be maintained now, and that the virus, not people's wishes, \" makes the timeline \" about when measures could be relaxed.\nJudge rejects motion to release vulnerable Chicago inmates\nA federal judge has denied a motion to order the immediate release of medically vulnerable detainees at the Cook County Jail in Chicago, where more than 400 people have tested positive for Covid-19.\nUS District Judge Matthew Kennelly denied a request that two current detainees had filed but ordered Cook County Sheriff Thomas Dart to provide face masks to all detainees, enact additional sanitation guidelines and promptly test inmates who have Covid-19 symptoms.\nThe Cook County Sherriff's Department said that operating the facility has \"become exceedingly more challenging\" during the pandemic but noted that \"much of what the court is requiring today has been well underway for weeks and even months in some cases.\"\nThe jail in Chicago is the largest known source of coronavirus infections in the US outside of medical facilities, according to the Cook County Sheriff's Office.\nAt least 276 detainees and 172 staff members at the Cook County Jail have tested positive for the virus, the county sheriff's office said Thursday. At least 21 of the detainees remain hospitalized and 36 have been moved to a recovery facility.\nThe sheriff's department said Thursday that more than 1,247 detainees have been released since March 9 to reduce the spread of the virus. The jail complex currently houses 4,463 detainees.\n\"Jails in this country are petri dishes,\" said Toni Preckwinkle, Cook County Board president. \"It's very difficult in a jail to maintain social distancing.\"\nIn Washington state , violence erupted Wednesday after six inmates at Monroe Correctional Complex tested positive for coronavirus.\nIt started with 100 inmates demonstrating in the recreation yard, and some inmates eventually caused damage to two housing units before guards brought the situation under control, officials said.\n\"It is believed at this time that the incident was caused by recent positive test results of Covid-19 among six men within the Minimum Security Unit,\" the state Department of Corrections said.\nIn the California prison system, the number of inmates infected grew by more than seven times in a little more than a week and staff cases nearly tripled, the California Department of Corrections and Rehabilitation said Wednesday.\n\"You have people in Italy dying, people in Spain dying, people in America dying, people are panic buying, people are concerned and people are scared,\" Samuel Brown, an inmate at California State Prison, Los Angeles County told CNN. \"And the truth of the matter is prisoners are people. So we're also afraid.\"\n\"And there's a potential of us dying, too.\"\nPhiladelphia and DC expected to be new hot spots, official says\nPhiladelphia and Washington, DC, are expected to be new hot spots for the coronavirus pandemic, Birx said in a conference call with House Democrats Wednesday, according to a source on the call.\nBirx added that the Philadelphia metropolitan area is seeing 1,400 cases per day. Washington has had about 500 new cases per day, and Baltimore has had 200 new cases daily.\nWashington, DC Mayor Muriel Bowser said Thursday she has ordered grocery stores to post signs instructing shoppers to wear face masks, and to enter alone or with household members.", "url": "https://www.cnn.com/2020/04/09/health/us-coronavirus-thursday/index.html"}