{"authors": [], "date_download": "2020-05-04 16:57:00", "date_modify": "2020-05-04 16:57:00", "date_publish": "2020-04-06 15:58:45", "description": "Forced to rethink that big day you planned to perfection? You're far from alone. Here's some help for postponing it in style — and staying positive.", "filename": "2020_04_06_cnn-underscored_how-to-postpone-your-wedding_index_1588611420.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331121437-postpone-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_cnn-underscored_how-to-postpone-your-wedding_index_1588611420.html", "title": "Everything you need to properly postpone a wedding", "title_page": "How to postpone your wedding: Experts weigh in with tips  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored has interviewed experts and found the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nCouples tend to worry as their special day approaches. Is it going to rain? Will the cake show up on time? Will Aunt Diane be OK with Uncle Phil's new wife being there? But this season's betrothed couples are grappling with something they never could have seen coming: rescheduling at the last second due to a pandemic.\nThis is something anyone who had been planning any sort of event — a birthday celebration, an anniversary bash, a retirement party — has now had to deal with, so the following guidance can be applied to those special occasions as well.\nTo be sure, this kind of abrupt postponement is enough to rattle even the most organized bride-to-be, like Nicole Iorio of Glendale, NY. Her April 24 wedding to Chris Fesler, a New York City police officer, was to be the grand culmination of a decade-long courtship. The excitement among their families and friends was building as the happy day was finally in sight.\nHer venue has offered her the next available date — 14 months away. \"I've cried a few times so far,\" Iorio says. But their loved ones are helping her and Fesler stay positive. \"Everyone always checks in on us and asks how we're doing and whether we need anything,\" she says. \"Sometimes all you need is someone to chat with. That makes me remember that, no matter when or where, they will still be there to celebrate with us.\"\nProcess your disappointment\nIn an unprecedented crisis such as the coronavirus pandemic, couples may feel guilty that their big concern is wedding plans. But experts say that initial feelings of overwhelming disappointment are normal and understandable.\n\"It is completely natural for couples to feel sadness and anger when their wedding has to be postponed through no fault of their own,\" assures Tara Flynn, a licensed mental health counselor in Babylon, NY, who counsels couples. \"There are plane tickets purchased by relatives, a paid-up honeymoon, and the list goes on. Their feelings about their wedding and what is going on in the world are completely separate from one another.\"\nFlynn advises couples to go ahead and grieve their \"lost\" wedding — but then start making future plans. \"That gives you back some of the control you feel you lost,\" she explains.\nAnd for Nicole Iorio, it's all about having perspective. \"When all is said and done, I get to spend forever with my best friend,\" she says. \"Besides, I've already waited 10 years, so what's one more?\"\nIn order to save money, try to reschedule your wedding with the same venue and vendors.\nPostpone properly\nMarti Heard, a wedding planner in Cincinnati, observes that couples are almost universally postponing their big weddings, even if they have to wait a year or more, rather than simply getting married at the courthouse and bagging the reception.\n\"This is an emotional moment that brides have dreamed of for a long time,\" notes Heard. \"Nothing will stop them! The only cancellation I've had was because the groom is in the military and is called for active duty.\"\n\"It's still possible to have the celebration of your dreams,\" says Etsy trend expert Dayna Isom Johnson. Her top tip is to keep your vendors the same, if at all possible, rather than bringing in new companies. \"This will make the date change as seamless and cost-effective as possible,\" she says.\nShe also urges reviewing each vendor's contract to be sure of what their postponement policy is, then calling each one to discuss next steps. Then, once you finalize your new date, send an announcement to guests and update your wedding site, if you have one.\nFinally, \"celebrate your original date,\" says Isom Johnson. One idea is to host a virtual gathering of close family, and/or your wedding party. Consider sending them microwave popcorn cobs or a cinch-to-assemble fun dessert to make over video chat, and whip up and enjoy a mojito or another fun cocktail together. \"Honoring the day will bring closure, even if you just go on a hike together or bake a cake,\" says Isom Johnson.\nPick the right announcement\nYou'll find more \"change the date\" cards to pick from than you might expect, from understated and elegant to cheery and colorful. Downloadable designs can be a good choice. You can print them right then and there, and let guests know about the change in plans as soon as possible. And you can, of course, email them, spreading the word without leaving your home, a smart idea at the moment.\nIf you're wondering whether a funny announcement can be appropriate under the circumstances, the answer is yes. Trying to buoy your spirits — and those of your guests — can go a long way these days. \"The best way to handle the ups and downs of life is a sense of humor,\" Heard says. \"You can be funny while showing grace and tact. Your guests will understand and smile.\"\nHere are 10 postponement announcements we just love.\nChange of Plans by Foxwood Lane (digital download, $5; etsy.com)\nChange of Plans by Foxwood Lane\n_______________________________________________________________________________\nWedding Change the Date Card (100 cards, $109; papersource.com)\nWedding Change the Date Card\n_______________________________________________________________________________\nLemonade by Sarah Curran Designs (digital download, $6.75; etsy.com)\nLemonade by Sarah Curran Designs\n_______________________________________________________________________________\nBad Dancing by Amy Payne (100 cards, $154; minted.com)\nBad Dancing by Amy Payne\n_______________________________________________________________________________\nPostponed by Sweet Cloud Design (digital download, $5; etsy.com)\nPostponed by Sweet Cloud Design\n_______________________________________________________________________________\nChange the Date Announcement (100 cards, $120.81, foil additional; vistaprint.com)\nChange the Date Announcement\n_______________________________________________________________________________\nRoll with it Postcard by Palm Paperie DIY (digital download, $7; etsy.com)\nRoll with it Postcard by Palm Paperie DIY\n_______________________________________________________________________________\nBoho Postponed (digital download, $5; etsy.com)\nBoho Postponed\n_______________________________________________________________________________\nWe Still Do Announcement by Peachy Prints UK (100 cards, $104.68; etsy.com)\nWe Still Do Announcement by Peachy Prints UK\n_______________________________________________________________________________\nUpdate by iDesign Stationery (digital download, $2.45; etsy.com)\nUpdate by iDesign Stationery\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/06/cnn-underscored/how-to-postpone-your-wedding/index.html"}