{"authors": ["Josh Boak"], "date_download": "2020-05-04 20:16:04", "date_modify": "2020-05-04 20:16:04", "date_publish": "2020-04-16 12:50:22", "description": "WASHINGTON (AP) — U.S. home-building activity collapsed in March as the coronavirus spread, with housing starts tumbling 22.3% from a month ago. The Commerce Department said Thursday that...", "filename": "_87674db6641e46a1b7c50c3601de5e0e_1588623364.html", "image_url": "https://storage.googleapis.com/afs-prod/media/cbeb311113824bc99a4008555682f958/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_87674db6641e46a1b7c50c3601de5e0e_1588623364.html", "title": "US home construction collapsed 22.3% in March", "title_page": "US home construction collapsed 22.3% in March", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this March 18 ,2020 photo, construction continues at a housing plan in Zelienople, Pa. Spending on U.S. construction projects fell 1.3% in February with housing and nonresidential construction both showing weakness even before the coronavirus struck with force in the United States. The Commerce Department said the February decline followed a 2.8% rise in construction in January. (AP Photo/Keith Srakocic)\nIn this March 18 ,2020 photo, construction continues at a housing plan in Zelienople, Pa. Spending on U.S. construction projects fell 1.3% in February with housing and nonresidential construction both showing weakness even before the coronavirus struck with force in the United States. The Commerce Department said the February decline followed a 2.8% rise in construction in January. (AP Photo/Keith Srakocic)\nWASHINGTON (AP) — U.S. home-building activity collapsed in March as the coronavirus spread, with housing starts tumbling 22.3% from a month ago.\nThe Commerce Department said Thursday that ground breakings occurred last month at a seasonally adjusted annual rate of 1.2 million units, down from a 1.56 million pace in February. Construction of single-family houses fell 17.5%, while apartment and condo starts were off 32.1% from a month ago.\nAll of this paints a bleak outlook for housing as the lockdown to contain COVID-19 have led more than 20 million Americans to lose their jobs in the past four weeks.\nThere was a 6.1% decline in the completion of homes being constructed, which means many homes are being left half built. The drop was 15% of single-family houses, meaning that unless economic activity picks up soon there could be ghost towns half-built housing developments, an phenomenon last seen in the aftermath of the 2008 financial crisis.\nConstruction activity will likely continue to slow. There was also a 6.8% drop in permits to begin construction in March.\nHomebuilders have become fearful. A confidence index released Wednesday by The National Association of Home Builders and Wells Fargo plunged 42 points in April to a reading of 30, the largest single monthly change in the history of the index. Any reading below 50 signals a decline.", "url": "https://apnews.com/87674db6641e46a1b7c50c3601de5e0e"}