{"authors": ["Daniel Dale"], "date_download": "2020-05-04 16:28:11", "date_modify": "2020-05-04 16:28:11", "date_publish": "2020-04-07 20:03:21", "description": "President Donald Trump has falsely claimed four times since last week that he inherited a faulty coronavirus test -- which was, in reality, developed this year.", "filename": "2020_04_07_politics_fact-ch_710e62f346f730cc0782d63972ab71da_index_1588609691.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406175011-01-coronavirus-briefing-0406-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_fact-ch_710e62f346f730cc0782d63972ab71da_index_1588609691.html", "title": "Fact check: Trump falsely claims he 'inherited' the faulty coronavirus test. It was developed this year", "title_page": "Fact check: Trump falsely claims he 'inherited' the faulty coronavirus test. It was developed this year - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) President Donald Trump has falsely claimed four times since last week that he inherited a faulty coronavirus test -- which was, in reality, developed this year.\nIn March, Trump initially made a debatable claim that he had inherited a flawed testing \"system.\" By the final days of March and the first days of April, however, he was making a demonstrably inaccurate claim about inheriting the actual tests.\n\"Initially speaking, the tests were old, obsolete, and not really prepared,\" he said at the April 6 briefing.\nTrump's clear suggestion was that the flawed test had been left to him by President Barack Obama's administration.\nFacts First: The faulty initial test for the coronavirus was created during Trump's administration, in early 2020, by the Centers for Disease Control and Prevention. Since this is a new virus that was first identified this year, the tests couldn't possibly be \"old\" or \"obsolete.\"\n\"He is lying. He is lying 100%. He is lying because he is trying to shift blame to others, even if the attempt is totally nonsensical,\" said Gregg Gonsalves, an assistant professor in the Department of Epidemiology of Microbial Diseases at the Yale School of Public Health.\nThe claim \"doesn't make sense because it is false,\" said Tara Smith, an epidemiology professor at Kent State University. \"This a new virus.\"\nMichael Mina, assistant professor of epidemiology at Harvard T.H. Chan School of Public Health, called the claim \"absurd\" given that \"this virus did not exist in the prior administration.\"\nMina added: \"The technology used to test for this virus is technology that is routinely used in clinical microbiology laboratories. It is not faulty.\"\nA flawed CDC test -- in 2020\nJUST WATCHED Fact check: Trump misleads on coronavirus testing Replay More Videos ... MUST WATCH Fact check: Trump misleads on coronavirus testing 01:52\nSoon after that, there were reports that some of the test kits were not working properly. The CDC -- which has been led since 2018 by Dr. Robert Redfield , a Trump administration appointee -- admitted the problem on February 12. It announced on February 28 that it had manufactured brand new, functional test kits that addressed the problem , which had been caused by a flaw in one of the three components of the original test.\nShifting rhetoric\nTrump's claims about the test offer another example of how his rhetoric sometimes evolves over time to become more dishonest.\nOn March 21, Trump argued that he had inherited an \"obsolete, broken testing system.\" On March 29, he complained of an obsolete \"testing situation.\"\nTrump has had three years in office to fix any problems with the system, and his argument that the system was \"broken\" has been disputed. (Obama-era CDC director Dr. Tom Frieden told USA Today that the Trump administration \"inherited the system that has worked in every prior emergency.\") Regardless, this is a subjective matter of opinion.\nOn March 30, Trump shifted to the false claim about the tests themselves.", "url": "https://www.cnn.com/2020/04/07/politics/fact-check-trump-inherited-broken-obsolete-coronavirus-tests/index.html"}