{"authors": ["Alex Marquardt", "Zachary Cohen"], "date_download": "2020-05-04 16:08:17", "date_modify": "2020-05-04 16:08:17", "date_publish": "2020-04-02 16:02:36", "description": "President Donald Trump warned Wednesday that Iran or its proxies may be planning a \"sneak attack\" against US forces, but some lawmakers say they can't evaluate the intelligence behind that assertion because the coronavirus outbreak has limited their access to classified material.", "filename": "2020_04_02_politics_coronav_49a3ea9ffd4736ba32a4b86ba165271e_index_1588608497.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327155548-capitol-hill-0326-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_coronav_49a3ea9ffd4736ba32a4b86ba165271e_index_1588608497.html", "title": "How sensitive work in Congress is being impeded by the coronavirus pandemic", "title_page": "How sensitive work in Congress is being impeded by the coronavirus pandemic - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) President Donald Trump warned Wednesday that Iran or its proxies may be planning a \"sneak attack\" against US forces, but some lawmakers say they can't evaluate the intelligence behind that assertion because the coronavirus outbreak has limited their access to classified material.\nWith Congress all but shut down, the details of the potential Iranian threat are on a growing list of sensitive issues that members of Congress are not being informed about because the growing pandemic has made the communication of classified information much more difficult, if not impossible.\nSome lawmakers say the current situation has even hindered their ability to access classified information related to how foreign rivals are likely working to exploit the coronavirus outbreak to help achieve their own objectives, meaning they are having to rely on publicly available information and statements from administration officials.\n\"I haven't had access to or seen anything on the classified side,\" said Representative Mike Gallagher, a member of the House Armed Services Committee, told CNN Tuesday in a phone interview from his home in Wisconsin. \"It's just kind of what I've seen from my basement.\"\nGallagher, like so many other lawmakers and their staffs, have left Washington to ride out the pandemic at home. That makes it impossible for them to attend classified briefings or make secure calls in the Capitol's secure rooms known as Sensitive Compartmented Information Facility, or SCIFs. Making calls on less secure phone lines at home or elsewhere also means it's not possible to discuss topics that require a security clearance.\n\"There are serious concerns about escalation with Iran, war powers, and military actions that's happening in Iraq,\" a senior Senate aide said. \"We are setting up regular calls with [the State Department] on this but there's only so much we can do on open lines.\"\nConcern administration will take advantage\nThe slower workarounds and inability to brief and communicate classified information has meant that the committees' oversight role has been hindered, multiple aides told CNN. It has also led to concern among Democrats that the Trump administration will take advantage of a lack of accountability during the pandemic.\n\"We have learned not to trust this administration with anything,\" a congressional foreign policy aide said. \"The risk of that definitely increases as time goes on. It's just a continuing list of things, a backlog of issues small and large that we have yet to be briefed on that becomes more and more of a risk.\"\nThere are numerous SCIFs for both the House and Senate, with individual rooms for the Intelligence, Foreign Affairs and Armed Services committees in each chamber. They're operating on skeleton crews and the typical number of people in a briefing runs counter to social distancing guidelines.\nIntelligence officials maintain they are responding to specific requests from lawmakers but they need to be in a secure facility to receive them. Setting up a secure call in a SCIF is difficult with fewer staff since the calls usually involve numerous people who themselves all need to be on secure lines which most don't have when working from home.\nThe disruption to staff work for the Senate Intelligence Committee has been limited, said Rachel Cohen, a spokesperson for ranking member Mark Warner.\nLike the intelligence agencies they oversee like the CIA and NSA, committee staffers are working in shifts to keep the office staffed while reducing the number of people in the offices, Cohen said. Staff in the office do have access to the secure facilities while Warner and the chairman, Richard Burr, as the leadership, have access to classified communications wherever they are.\n'Challenges'\nBut, Cohen acknowledged, \"members themselves will have some challenges.\"\nThe House Intelligence Committee SCIF was deep cleaned after one of the staff was diagnosed with Covid-19, a committee official said. Chairman Adam Schiff has told staff to work at home but instructed them to go to the office if they need a classified briefing or to review classified information, a committee official said. Schiff himself went to the Capitol twice last week for a briefing and to review material.\n\"We're also in touch with the [intelligence community] to make sure that they're keeping us as up to date as possible, and to keep us informed as to when we need to go into the SCIF to view important updates,\" the official added.\nWhen the family of former FBI agent Robert Levinson announced last week that they had been told by administration officials that new information indicated he died after years in captivity in Iran, a classified briefing for lawmakers on that new intelligence lawmakers did not take place.\nThe circumstances around the death of the longest-held American in history is classified information that was not known before and would have been requested in a briefing, the foreign policy aide said. Now, however, committees can't summon State Department and intelligence officials to get the answers they want -- and would argue they need -- as part of their oversight responsibilities.\nThe foreign policy aide estimated that the new Levinson intelligence is one of around a dozen topics aren't getting the attention they deserve, including specifics about US embassy personnel drawdowns and the deployment of Patriot missile batteries to Iraq in light of the threat from neighboring Iran.\n\"We have totally been hampered and it has impacted our work quite negatively,\" the aide said.", "url": "https://www.cnn.com/2020/04/02/politics/coronavirus-outbreak-congress-classified-information/index.html"}