{"authors": ["Jennifer Hansler"], "date_download": "2020-05-04 16:28:14", "date_modify": "2020-05-04 16:28:14", "date_publish": "2020-04-07 20:36:12", "description": "The State Department had repatriated more than 45,000 Americans from around the world as of Tuesday morning, Secretary of State Mike Pompeo announced.", "filename": "2020_04_07_politics_state-department-repatriation_index_1588609694.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200120151243-01-pompeo-0120-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_state-department-repatriation_index_1588609694.html", "title": "Pompeo hails 'remarkable' State Department repatriation efforts", "title_page": "Pompeo hails 'remarkable' State Department repatriation efforts - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The State Department had repatriated more than 45,000 Americans from around the world as of Tuesday morning, Secretary of State Mike Pompeo announced.\nIn remarks at the State Department, the top US diplomat hailed the effort, which comes as the coronavirus pandemic has grounded commercial flights and shuttered borders.\n\"Nearly every day, incredible stories of our teams' speed and tenacity getting our people home hit my desk,\" Pompeo said. \"These stories could be pulled from a Hollywood script. They're remarkable.\"\nAccording to data from the State Department posted Monday afternoon, 374 flights from more than 75 countries had been completed since the end of January.\nThe State Department faced criticism for its initial response as those mounting global restrictions left tens of thousands of travelers stranded abroad. At the time, many of them told CNN of receiving little to no information from the US government or embassies about how they might get back to the US.\nRead More", "url": "https://www.cnn.com/2020/04/07/politics/state-department-repatriation/index.html"}