{"authors": ["Trends Reporter"], "date_download": "2020-05-04 21:09:58", "date_modify": "2020-05-04 21:09:58", "date_publish": "2020-05-01 04:10:18", "description": "Yet Republican lawmakers are pushing to indemnify businesses as workers too frightened to risk their lives face the loss of unemployment benefits.", "filename": "entry_iowa-sheriff-tyson-plant-covid-19_n_5eab6cd3c5b62da419eed3e5_1588626598.html", "image_url": "https://img.huffingtonpost.com/asset/5eab7c2c300000a1121553af.png?cache=kjn8ehbhrb&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_iowa-sheriff-tyson-plant-covid-19_n_5eab6cd3c5b62da419eed3e5_1588626598.html", "title": "'Incensed' Sheriff Slams 'Dysfunctional' Tyson For 900 COVID-19 Cases In Iowa Hot Spot", "title_page": "'Incensed' Sheriff Slams 'Dysfunctional' Tyson For 900 COVID-19 Cases In Iowa Hot Spot | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "A furious Iowa sheriff blasted the “inept” and “dysfunctional” Tyson Fresh Meats plant in his county where about 900 workers contracted COVID-19.\n“It incenses me,” Black Hawk County Sheriff Tony Thompson told Rachel Maddow Wednesday night on MSNBC.\nHe blasted a full-page ad that Tyson took out in The New York Times (and The Washington Post and the Arkansas Democrat-Gazette) on Monday that bemoaned the effect of COVID-19 on the meat business and warned that the “food supply chain is breaking.”\n“We know” that the Iowa coronavirus outbreak and threats to the food supply chain are “due to these inept, reactionary and dysfunctional responses” to what was happening in the Waterloo plant, which employs 2,800 workers, Thompson told Maddow.\n“It’s frustrating that my citizens ... are more at risk than any other county in the state,” he told Maddow.\nAs of Wednesday, Tyson workers were linked to about 90% of the 1,327 COVID-19 cases in Black Hawk County, which has the highest number of coronavirus in the state, USA Today reported.\nAdditionally, about 900 of the 2,200 employees at a Tyson pork processing plant in Logansport, Indiana, have also tested positive for the coronavirus, WISH-TV in Indianapolis reported Wednesday. Again, that’s the lion’s share of the 1,200 cases in Cass County, where the plant is located.\nTyson has closed both the Waterloo and Logansport plants and is working with county health officials to improve safety.\nDespite the shocking coronavirus rates at the Tyson meat plants and others, President Donald Trump signed an executive order Wednesday to keep the plants open.\nDespite the infection rates, Republicans in Washington are pushing to indemnify businesses to protect them from lawsuits from infected workers. At the same time, frightened workers who refuse to return to work because they fear for their lives face not qualifying for unemployment benefits.\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/iowa-sheriff-tyson-plant-covid-19_n_5eab6cd3c5b62da419eed3e5"}