{"authors": ["Kerry Flynn", "Cnn Business"], "date_download": "2020-05-04 16:59:45", "date_modify": "2020-05-04 16:59:45", "date_publish": "2020-04-09 22:36:41", "description": "McClatchy, owner of 30 US newspapers, announced on Thursday it will furlough 4.4% of its employees, lay off four executives and reduce some executive compensation to address the financial pressures from coronavirus.", "filename": "2020_04_09_media_mcclatchy-newspaper-furloughs-coronavirus_index_1588611585.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409162941-miami-herald-offices-0213-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_media_mcclatchy-newspaper-furloughs-coronavirus_index_1588611585.html", "title": "McClatchy furloughs about 115 employees to deal with the impact of coronavirus", "title_page": "McClatchy furloughs about 115 employees to deal with the impact of coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) McClatchy (MNIQQ), owner of 30 US newspapers, announced on Thursday it will furlough 4.4% of its employees, lay off four executives and reduce some executive compensation to address the financial pressures from coronavirus.\nThe company, whose newspapers include the Pulitzer Prize-winning Miami Herald, The Kansas City Star and The Sacramento Bee, employs about 2,700 people, so the plan translates to more than 115 temporary job losses. The reductions will mostly affect McClatchy's advertising department, while the editorial department will be spared, McClatchy Vice President of News Kristin Roberts told CNN Business in an interview on Thursday.\n\"We're taking some steps that helps us make sure that our expenses are aligned with our revenue,\" Roberts said. \"Everybody in the local news business and in the news business at large has seen their revenue pressured by the impact of the coronavirus. We have worked very carefully and quite precisely and that's allowed us to insulate our news team from these cost reductions.\"\nOver the last month, media companies across the country — alt-weeklies local newspapers and digital media outlets — have laid off or furloughed employees or instituted pay cuts to mitigate the loss of ad dollars as businesses shutter or end discretionary spending in the wake of coronavirus. Newspaper conglomerate Gannett, for example, furloughed the majority of employees , requiring them to take one week unpaid in April, May and June. Tribune Publishing, the third largest US newspaper owner after Gannett and McClatchy, announced on Thursday permanent pay cuts for non-unionized employees who make at least $67,000, according to an internal memo obtained by CNN Business.\nThese changes come as news organizations were already under financial stress. McClatchy filed for bankruptcy in February.\nRead More", "url": "https://www.cnn.com/2020/04/09/media/mcclatchy-newspaper-furloughs-coronavirus/index.html"}