{"authors": ["Opinion Amy Plasencia"], "date_download": "2020-05-04 16:17:00", "date_modify": "2020-05-04 16:17:00", "date_publish": "2020-04-03 20:27:34", "description": "Dr. Amy Plasencia, one of the many hospital residents fighting Covid-19 in New York City, says she and other residents, interns and fellows who are doctors on the front lines deserve better protections and a bill of rights to help keep them safe.", "filename": "2020_04_03_opinions_doctors_8923e63161ca270fb61fddb1a91aaf66_index_1588609020.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403104254-amy-plasencia-ppe-super-tease.jpeg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_opinions_doctors_8923e63161ca270fb61fddb1a91aaf66_index_1588609020.html", "title": "I'm a doctor in NYC. This is what I need to feel safe", "title_page": "I'm a doctor in NYC. This is what I need to feel safe (opinion)  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Dr. Amy Plasencia is the chief medical resident at Brookdale University Medical Center and executive vice president of the Committee of Interns and Residents, affiliated with the Service Employees International Union. The views expressed here are hers. Read more opinion on CNN.\n(CNN) Not long ago, my colleagues and I swore the Hippocratic Oath, which requires new physicians to uphold the highest ethical standards.\nNow during what is likely the most significant health crisis in American history in the Covid-19 pandemic, the Service Employees International Union's Committee of Interns and Residents (CIR), which represents more than 17,000 interns, residents, and fellows across the United States, is demanding a bill of rights for resident physicians\nAmy Plasencia\nIt would guarantee better working conditions, a living wage, and sick and family leave. We are also demanding no more than 80 working hours per week. If you think you read incorrectly, you did not. Many of us are currently working well beyond reasonable hours, and under grueling conditions.\nWith America now leading the world in the highest number of confirmed Covid-19 cases, we are facing the most critical medical challenge in a century. But the cohort of medical professionals who are the heartbeat of the US health care system — hospital interns, residents and fellows included — is under a massive assault as they fight the disease. In the absence of a vaccine, the best protection the nation has is the protection of frontline medical professionals. That's why we urgently need a resident physicians bill of rights.\nInterns are doctors who have recently completed medical school, are in their first year of post-medical school training and cannot practice medicine unsupervised. Residents can practice as general practitioners and receive further training to learn specialized skills. Resident physicians face numerous challenges in their work and are often exploited; they earn low wages, work extraordinarily long shifts and often experience burnout.\nRead More", "url": "https://www.cnn.com/2020/04/03/opinions/doctors-fighting-covid-19-need-bill-of-rights-plasencia/index.html"}