{"authors": ["Janie Har"], "date_download": "2020-05-04 20:06:30", "date_modify": "2020-05-04 20:06:30", "date_publish": "2020-04-09 21:45:14", "description": "SAN FRANCISCO (AP) — Gay rights pioneer Phyllis Lyon, who with her longtime partner was among the first same-sex couples to marry in California when it became legal to do so in 2008, has died at...", "filename": "_958445724d901a52e3484ec1353d261f_1588622790.html", "image_url": "https://storage.googleapis.com/afs-prod/media/d2e5f7287ee846b4b44931c33b552f11/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_958445724d901a52e3484ec1353d261f_1588622790.html", "title": "Civil rights pioneer and face of gay marriage dies at 95", "title_page": "Civil rights pioneer and face of gay marriage dies at 95", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this June 16, 2008, file photo, Del Martin, left, places a ring on her partner Phyllis Lyon, right, during their wedding ceremony officiated by then-San Francisco Mayor Gavin Newsom, center, at City Hall in San Francisco. Pioneering gay rights activist Lyon, who was among the first same-sex couples to marry in California when it became legal to do so, has died at her San Francisco home. Lyon died at age 95 of natural causes Thursday, April 9, 2020. (AP Photo/Marcio Jose Sanchez, File)\nFILE - In this June 16, 2008, file photo, Del Martin, left, places a ring on her partner Phyllis Lyon, right, during their wedding ceremony officiated by then-San Francisco Mayor Gavin Newsom, center, at City Hall in San Francisco. Pioneering gay rights activist Lyon, who was among the first same-sex couples to marry in California when it became legal to do so, has died at her San Francisco home. Lyon died at age 95 of natural causes Thursday, April 9, 2020. (AP Photo/Marcio Jose Sanchez, File)\nSAN FRANCISCO (AP) — Gay rights pioneer Phyllis Lyon, who with her longtime partner was among the first same-sex couples to marry in California when it became legal to do so in 2008, has died at her San Francisco home. She was 95.\nLyon lived life with “joy and wonder,” said Kate Kendell, a friend and former executive director of the National Center for Lesbian Rights. She said Lyon and her wife Del Martin were activists and mentors long before there was a movement or community.\n“Before cellphones they always had their phone number listed in the phone book in case any young or terrified LGBTQ person needed help or support,” she said. “And they fielded dozens of calls over the years.”\nLyon died Thursday of natural causes, Kendell said.\nLyon was a journalist who met her lifelong love, Martin, while working at a magazine in Seattle. The couple moved to San Francisco in 1953.\nThey co-founded with other lesbian couples the Daughters of Bilitis, a political and social organization for lesbians. They published a national monthly for lesbians and in 1972, a book called Lesbian/Woman.\nCalifornia Gov. Gavin Newsom referenced her death at his daily briefing on the coronavirus pandemic Thursday, calling her one of his heroes.\nNewsom was a newly elected mayor of San Francisco in 2004 when he decided to challenge California’s marriage laws by issuing licenses to same-sex couples. His advisers and gay rights advocates had the perfect couple in mind to be the public face of the movement.\nLyon and Martin, who had by then been together more than 50 years, were secretly swept into the clerk’s office. They exchanged vows before a tiny group of city staff members and friends, according to a 2008 Associated Press story. Afterward they went to lunch, just the two of them.\n“Of course, nobody down there knew, so we were left to be by ourselves like we wanted to be,” Martin said. “Then we came home.”\n“And watched TV,” added Lyon.\nA wedding portrait of the couple cradling each other in pastel-colored pantsuits with their foreheads touching drew worldwide attention.\nLater that year, the state Supreme Court voided the unions before overturning the state’s ban on gay marriage in 2008. They wed again, among the first couples to do so in the state. Del Martin died weeks after their second wedding at age 87.\n“I am devastated to lose Del, but I take some solace in knowing we were able to enjoy the ultimate rite of love and commitment before she passed,” Lyon said at the time.\nIn 2015, the U.S. Supreme Court legalized gay marriage.\nCalifornia’s biggest political leaders expressed their sorrow Thursday and thanked Lyon —and her late wife — for their tireless efforts to make the city a better place.\n“All those who were blessed to know Phyllis and Del remember the extraordinary love that they had for each other,” said U.S. House Speaker Nancy Pelosi, who is from San Francisco, in a statement. “As we mourn the loss of our dear Phyllis, we find peace in knowing that she and Del are together again.”\nLyon was born Nov. 10, 1924, in Tulsa, Oklahoma. She grew up in Sacramento, California, and graduated from the University of California, Berkeley, where she was editor of the heralded Daily Californian newspaper.\nLyon was a police reporter in Fresno and a reporter at the Chico Enterprise-Record during the 1940s, according to Kendell.\nFamily and friends are planning a celebration of her life.\n—-\nThis story has been corrected to accurately spell Kate Kendell.", "url": "https://apnews.com/958445724d901a52e3484ec1353d261f"}