{"authors": ["Chris James"], "date_download": "2020-05-04 16:19:02", "date_modify": "2020-05-04 16:19:02", "date_publish": "2020-03-31 21:28:51", "description": "When Dr. Calvin Sun gets back to his New York City apartment after a 12-hour shift treating critically ill coronavirus patients, he heads straight to the kitchen sink to wash his ski goggles and ski jacket.", "filename": "2020_03_31_us_coronavirus-medical-shortages-us_index_1588609142.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331165933-02-dr-calvin-sun-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_us_coronavirus-medical-shortages-us_index_1588609142.html", "title": "Covid-19 pandemic: ER doctor describes dire medical shortages in New York", "title_page": "Covid-19 pandemic: ER doctor describes dire medical shortages in New York - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN) When Dr. Calvin Sun gets back to his New York City apartment after a 12-hour shift treating critically ill coronavirus patients , he heads straight to the kitchen sink to wash his ski goggles and ski jacket.\nHe scrubs and wipes, then sprays them with Lysol before hanging them up to dry. The items are his personal protective equipment, or PPE -- improvised due to the severe shortage at hospitals across the city -- and he'll likely need to use them at work tomorrow.\nAs a per diem emergentologist who fills in shifts left empty by the increasing number of doctors calling out sick, Sun has the unique perspective of working in emergency rooms throughout the New York City area. Within the walls of each medical facility , he sees the same desperation.\nSun, a native New Yorker, documented his journey for CNN over the course of one week.\n\"We don't have enough N95 masks. Some have run out completely. Some don't even have gowns,\" he said. \"You can put me in the exact same ER and I would witness the exact same evolution of chaos.\"\nStatewide, 75,795 people had tested positive for Covid-19 through Wednesday morning, accounting for more than 40% of all US cases\nHealth care workers on the front lines, including thousands of New York's nurses , are especially vulnerable to infection.\n\"In my particular emergency department, we have an area cordoned off for the Covid-positive patients and the presumptive positive patients, but because of a lack of space, they're all housed together, which is a big problem for infection control,\" said Judy Sheridan-Gonzalez, president of the New York State Nurses Association.\nJUST WATCHED See doctors react to photo of nurses wearing trash bags Replay More Videos ... MUST WATCH See doctors react to photo of nurses wearing trash bags 02:56\nSun has been using social media to alert the public about the danger medical professionals face at New York City's hospitals. Throughout the crisis, he's been updating his Instagram story daily with dispatches from the trenches of this pandemic.\n\"I can speak on behalf of all my fellow colleagues in this fight that you're never really sure what's going to happen in the future, especially when it takes about five to eight days for you to catch it and develop symptoms,\" he said. \"And we can't really test unless you have symptoms, given the lack of testing kits and (PPE) provided for us by the higher-ups.\"\nFor weeks now, doctors across the nation have been emphasizing the importance of increased testing to understand the true scope of the spread of coronavirus. But Sun warns that showing up to the emergency room simply for a coronavirus test could be a potentially deadly move.\n\"Testing is so necessary to contain this spread. We need to screen everyone, but also, it's not about what you do but how you do it,\" Sun said. \"Because let's say you didn't have Covid-19. And then you come to the emergency room to get a test, and then we test you. It's gonna be negative, right.\n\"And then, a person sitting next to you coughs in your face because you're in the emergency room. And then two to three days later, you get a phone call on that test you got two or three days ago. It's negative. Then, you hug grandma, and then grandma gets Covid-19. And then two to three weeks later, I'm putting her on life support. That's on you, right? It doesn't make sense to come to an emergency room because of the risk of cross-contamination.\"\nOnly those who cannot speak a full sentence without losing their breath should head to the ER, Sun said. Otherwise, monitor symptoms from home.\nAfter finishing a 10-hour shift at 2 a.m. on March 27, an exhausted Sun caught a ride-share home and reflected upon another intense night.\n\"Today was just a sign that things are getting worse and worse. I had about three deaths in the span of the first six hours, he said. \"One was truly sad. (He) waited a few days for a bed, and it was too full upstairs so he stayed in the ER, and from Covid-19, he just lost his pulses. We worked on him for an hour, and then he died.\"\nDespite the tremendous obstacles ahead, Sun is committed to the oath he took as a physician to care for the sick.\n\"This is still New York, and the lights are still on,\" he said as he looked out the window on the ride home. \"That's a sign that things are going to keep on going, if we keep on fighting.\"", "url": "https://www.cnn.com/2020/03/31/us/coronavirus-medical-shortages-us/index.html"}