{"authors": ["Nicole Chavez", "Angela Barajas", "Dianne Gallagher"], "date_download": "2020-05-04 16:12:27", "date_modify": "2020-05-04 16:12:27", "date_publish": "2020-04-02 09:44:50", "description": "Albany, Georgia is no longer a coronavirus outlier. Instead, it serves as an example of how the virus can impact smaller, sprawling rural areas as much as it can larger cities.", "filename": "2020_04_02_us_albany-georgia-coronavirus_index_1588608747.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401214201-albany-coronavirus-funeral-home-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_us_albany-georgia-coronavirus_index_1588608747.html", "title": "How two funerals helped turn one small Georgia city into a hotspot for coronavirus", "title_page": "Two funerals and lack of social distancing: How coronavirus took over one small Georgia city - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Albany, Georgia (CNN) When a retired janitor suddenly died in southern Georgia, crowds of relatives and friends flocked to a local funeral home and mourned together. Within weeks, their city was overrun by coronavirus cases.\nThat cluster of coronavirus cases was linked to the funerals of 64-year-old Andrew J. Mitchell and another man, held in late February and early March, Dougherty County Council Chairman Chris Cohilas said. Albany, a city of roughly 75,000 people -- as well as Cohilas' county, where Albany is based -- is the latest example of how the virus has started disrupting smaller, more rural areas as much as the country's larger, urban cities.\nAs of Wednesday afternoon, there were at least 490 confirmed coronavirus cases reported in Dougherty County and at least 29 coronavirus-related deaths, the Georgia Department of Public Health said.\nAbout 20 people who attended at least one of the funerals contracted the virus, said Scott Steiner, the chief executive officer of Phoebe Putney Health System, which has its biggest hospital in Albany.\n\"It took one person, whoever that was, and there was no intent,\" Steiner told CNN. \"It shows this virus can quickly spread.\"\nA spokesperson for the Georgia Department of Health acknowledged the virus spread among \"individuals who attended a number of events in Albany\" but said it's unclear \"where or with whom it all started.\"\n'It was like a domino effect'\nEmell Murray discovered her long-time companion, Andrew J. Mitchell, unconscious in the living room of their home on February 24. The family said they suspect he had a heart attack and died.\nAfter his passing, their siblings, nephews, nieces and friends traveled to Albany to pay their respects at his funeral service, and later spent the afternoon at Murray and Mitchell's home.\nA couple of days later, Murray, 75, was hospitalized. She had a fever and her blood pressure skyrocketed.\n\"We didn't know what was wrong with her,\" Alice Bell, Murray's daughter, told CNN.\nMore than 100 people attended the funeral of Andrew J. Mitchell, a retired janitor, on February 29 in Albany.\nMurray spent much of March at the hospital. In between visits, doctors informed her she had tested positive for coronavirus.\nBut she wasn't the only one.\nSeveral of the couple's relatives contracted the virus, Bell said. The pastor who delivered Mitchell's eulogy, she said, has since died of coronavirus complications. Steiner, the hospital system CEO, confirmed that.\n\"It was like a domino effect,\" Bell said.\nThe Martin Luther King Memorial Chapel LLC, which hosted the respective funerals on February 29 and March 7, said health department officials notified them on March 13 about a potential exposure to the virus involving people who were present at the events.\nThe AJC first reported the funerals as the source of the city's outbreak.\n\"Although we have been identified as a common factor in the tracking of the Covid-19 in Albany, know that we are operating within all regulatory safety or health guidelines,\" the funeral home directors wrote in a Facebook post . \"We know that there is growing concern across the city. We are taking extra precautions to protect you, our staff and the communities we serve.\"\nThe funeral home did not respond to CNN's repeated attempts for comment.\nThe cluster of cases began emerging shortly after a 67-year-old man tested positive for the virus. The man traveled from Atlanta to attend one of the funerals and was hospitalized in Albany during his trip, said Steiner, the hospital system's CEO.\n\"The next day it's when we began seeing people coming to our emergency room who were sick,\" Steiner said. \"Two (people) the first day, six the next day, eight the next day, and it just began to cascade from that point.\"\nSome of those patients had attended the funerals, others were members of the same churches, Steiner said.\nLife changed quickly in Albany\nThe virus had been traveling through this close-knit community for several weeks by the time social distancing warnings came in.\nBefore the US Centers for Disease Control and Prevention issued guidelines limiting gatherings to 50 people in mid-March, hundreds of runners flooded the city's streets for the Snickers marathon and half-marathon -- one of the top 10 qualifiers for the Boston Marathon.\nThey enjoyed live music during a downtown festival and packed the local churches on Sundays.\nAs more people fell sick, Georgia Gov. Brian Kemp told reporters that he was concerned about the growing number of cases in Albany.\n\"This situation cannot be more serious,\" Kemp said on March 19 . \"Stay home if you are sick. If there's any doubt, stay home. We've had this happen in many places around the state, with sick individuals attending funerals which has created one of the hot spots we have around the state. I think it's a good example we can all learn from.\"\nLocal officials declared a state of emergency on the same day, banning community gatherings of more than 10 people after four coronavirus-related deaths were reported. A stay-at-home order followed a few days later.\nThe state sent its national guard to help\nThe epicenter of the pandemic for the coronavirus outbreak quickly changed from Washington to New York. As that happened, the virus' impact also became evident in Georgia.\nGeorgia has at least 4,748 confirmed coronavirus cases , and at least 154 deaths in the state. The highest number of cases has been reported in Fulton County -- which includes Atlanta, and has a population of about 1 million people. But Dougherty County -- which has a population of about 85,000 people, and where Albany is -- is a close second.\nEarlier this week, Dr. Deborah Birx, the White House's coronavirus response coordinator, urged rural communities in the US to prepare for the spread of Covid-19, \"even though you think it's not there.\"\nHealth care workers at Phoebe Putney Health System went through six months' worth of supplies in less than a week, Steiner said. Some health care workers are sleeping in their garages to protect their families and the intensive care units are quickly filling up.\nFriday, the Georgia National Guard deployed two medical teams to assist with COVID-19 response at Phoebe. A third team arrived on Saturday, bringing the total number of troops to 29.\nKemp deployed Georgia National Guard medical teams to Phoebe Putney Memorial Hospital, which has been the most inundated with patients. He's also deploying more than 100 Guard troops to long-term care facilities throughout the state that have seen coronavirus cases.\nHe said Wednesday that Georgia hospitals might reach peak hospital capacity on April 23.\nFor CaMia Hopson, an Albany state representative who lost a friend to coronavirus, life in the region feels like it will never be the same.\n\"We weathered tornadoes, hurricanes, everything ... but our entire world is dealing with something that we haven't seen in our lifetime,\" Hopson told CNN. \"People are grieving, we are really hurting right now. We are not New York, but we are still impacted.\"", "url": "https://www.cnn.com/2020/04/02/us/albany-georgia-coronavirus/index.html"}