{"authors": [], "date_download": "2020-05-04 20:23:39", "date_modify": "2020-05-04 20:23:39", "date_publish": "2020-04-21 02:47:17", "description": "WASHINGTON (AP) — President Donald Trump said Monday that he will sign an executive order “to temporarily suspend immigration into the United States” because of the coronavirus. “In light...", "filename": "_9da146b517bff374be31391c8537c739_1588623819.html", "image_url": "https://storage.googleapis.com/afs-prod/media/a310efd59bae4337833957e5b6c87250/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9da146b517bff374be31391c8537c739_1588623819.html", "title": "Trump says he'll 'suspend immigration,' offers no details", "title_page": "Trump says he'll 'suspend immigration,' offers no details ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Donald Trump speaks about the coronavirus in the James Brady Press Briefing Room of the White House, Monday, April 20, 2020, in Washington. (AP Photo/Alex Brandon)\nPresident Donald Trump speaks about the coronavirus in the James Brady Press Briefing Room of the White House, Monday, April 20, 2020, in Washington. (AP Photo/Alex Brandon)\nWASHINGTON (AP) — President Donald Trump said Monday that he will sign an executive order “to temporarily suspend immigration into the United States” because of the coronavirus.\n“In light of the attack from the Invisible Enemy, as well as the need to protect the jobs of our GREAT American Citizens, I will be signing an Executive Order to temporarily suspend immigration into the United States!” Trump tweeted.\nHe offered no details as to what immigration programs might be affected by the order. The White House did not immediately elaborate on Trump’s tweeted announcement.\nTrump has taken credit for his restrictions on travel to the U.S. from China and hard-hit European countries, arguing it contributed to slowing the spread of the virus in the U.S. But he has yet to extend those restrictions to other nations now experiencing virus outbreaks.\nDue to the pandemic, almost all visa processing by the State Department, including immigrant visas, has been suspended for weeks.\nMore than 750,000 Americans have come down with COVID-19 and more than 42,000 have died.", "url": "https://apnews.com/9da146b517bff374be31391c8537c739"}