{"authors": ["Daniel Dale"], "date_download": "2020-05-04 16:23:51", "date_modify": "2020-05-04 16:23:51", "date_publish": "2020-04-02 22:49:29", "description": "President Donald Trump falsely claimed Wednesday that airplane and train passengers are being given \"very strong tests\" for the coronavirus both before departure and after arrival.", "filename": "2020_04_02_politics_fact-ch_a193d1c1eb84b8c721f6f2c5ec4c61e7_index_1588609431.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401122733-plane-cleaning-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_fact-ch_a193d1c1eb84b8c721f6f2c5ec4c61e7_index_1588609431.html", "title": "Fact check: Trump falsely claims plane and train passengers are being tested for the coronavirus", "title_page": "Fact check: Trump falsely claims plane and train passengers are being tested for the coronavirus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) President Donald Trump falsely claimed Wednesday that airplane and train passengers are being given \"very strong tests\" for the coronavirus both before departure and after arrival.\nAsked at a White House briefing if he is considering a temporary ban on domestic flights and rail travel, Trump said he was thinking about how to handle flights to and from virus \"hot spots,\" but that it's \"a very tough thing\" to shut down \"entire transportation systems.\" He also claimed that there are safeguards already in place.\n\"They're doing tests on airlines -- very strong tests -- for getting on, getting off. They're doing tests on trains -- getting on, getting off,\" he said\nFacts First: There is no evidence plane and train passengers in the US are being tested for the coronavirus at all, let alone both when they get on and get off. Trump might have meant to refer to screening -- which involves questioning and sometimes temperature checks -- rather than actual testing, but major US airlines and rail company Amtrak are not doing screening, either. Some plane passengers are being subjected to government screening upon landing, but most passengers are not -- and this screening, unlike testing, cannot conclusively determine whether someone has the virus.", "url": "https://www.cnn.com/2020/04/02/politics/fact-check-trump-plane-and-train-passengers-tested-for-the-coronavirus/index.html"}