{"authors": ["Amanda Jackson"], "date_download": "2020-05-04 16:20:52", "date_modify": "2020-05-04 16:20:52", "date_publish": "2020-04-04 04:03:19", "description": "WrestleMania 36's big event starts Saturday night, but it'll be slightly different than what fans are used to. Here's how to watch and what to expect this weekend.", "filename": "2020_04_04_us_wrestlemania-36-how-to-watch-preview-trnd_index_1588609252.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403133603-wrestlemania-36-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_us_wrestlemania-36-how-to-watch-preview-trnd_index_1588609252.html", "title": "WrestleMania 36 is this weekend. Here's how to watch and what to expect", "title_page": "WrestleMania 36 is this weekend. Here's how to watch and what to expect - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) World Wrestling Entertainment's biggest event of the year, WrestleMania, starts Saturday night, but it'll be slightly different than what fans are used to.\nWhen headed out to the wrestling ring, WWE superstar Paul \"Triple H\" Levesque -- who also serves as WWE Executive Vice President, Global Talent Strategy & Development -- would normally walk into any arena and feed off of the energy of the crowd. He'd hear the cheers of the thousands of fans, feel the sweat drip down his brow, and hold his head high while walking down the ramp and toward the ring to square off with his opponent.\nNow, however, WWE superstars are entering the ring to the sound of silence.\nBecause of coronavirus, WWE -- like many other organizations -- has had to make all its events crowd free, meaning only available to stream.\nWhat to expect\nThis year, a big element of the sports entertainment event will be missing -- the live audience. The elaborate larger-than-life set designs and pyrotechnics blasting off to signal the beginning of the annual event will also be absent.\nFans are a huge part of the sports entertainment industry and one reason the event is still on.\n\"We believe that in this time, especially right now with all this uncertainty ... that there is a need for escapism and for people to be able to get away from all this and put it behind them,\" Levesque told CNN.\nPaul \"Triple H\" Levesque\n\"We feel an obligation in some way to try and continue to provide entertainment to people. It's our company mission to put smiles on people's faces, and we are continuing to try to do that.\"\nTens of thousands of passionate wrestling fans were expected to fill the Raymond James Stadium in Tampa, Florida. Now, the event will be held at closed sets at the WWE Performance Center in Orlando and other, unnamed, locations, with only essential personnel.\nAs the coronavirus pandemic has halted many sporting and entertainment events, WWE has been able to continue to produce new content for fans throughout the week with the use of their training facility in Florida.\nInside look of the WWE Performance Center.\nWrestleMania, which is considered the Super Bowl for wrestling, typically attracts fans from across the globe, some who plan their trip a year in advance to make it to the live show.\nFor the first time ever, the event was deemed too big for one night by the organization and will be held across two nights -- Saturday and Sunday.\nLast year, more than 82,000 fans from all 50 states and over 60 countries packed the stadium in New Jersey for WrestleMania 35, accoridng to WWE.\nWho will be attending\nWhile WrestleMania will be stripped down to a much smaller scale in terms of set, the matches are packed with some top superstars including; John Cena, Brock Lesnar, Seth Rollins, Undertaker, Charlotte Flair and Becky Lynch. A WWE Hall of Famer, Edge, recently made his debut back into the ring after nine years and is set to take on Randy Orton.\nThere is also a special addition to the lineup this year: three-time Super Bowl Champion Rob Gronkowski, who will be hosting.\nRob Gronkowski will host WrestleMania.\nWWE has consulted with the Centers for Disease Control and Prevention, local and state officials, as well as its own medical staff to set extra precautions to protect wrestlers and staff, Levesque said. The organization is making sure to continue to entertain people in the safest manner possible, he said\nTo ensure that, talent and staff will be staggered in their arrivals and then leave after their segment is over. Everyone will be required to undergo a medical screening upon entering the closed sets, according to WWE. This event is also voluntary for all involved and, so far, one notable name has decided to stay home.\nRoman Reigns, set to have a match against Goldberg, took to social media to announce he will not attend.\n\"To all my fans, I'm sorry I didn't get to compete this year and put on a show and entertain,\" said Reigns, whose real name is Joe Anoaʻi, said on Instagram this week. \"Sometimes things are more important and I had to make a choice for me and my family.\"\nOne of WWE's top wrestlers, Roman Reigns, will not be in attendance at WrestleMania this year.\nIn 2018, he stepped away from the ring to battle leukemia before making a triumphant return in 2019, stating he was in remission. In true WWE fashion, his story line with Goldberg is still set to play out during WrestleMania, but fans will have to tune in to see how that unfolds.\nHow to watch\nLevesque added that he hope fans enjoy the show.\n\"Everything that everyone has gone through to put this on will all be worth it if people are just entertained and can forget about the world around them for a few hours,\" he said. \"That is our intent, to put smiles on their faces, and hopefully we will do that this weekend.\"", "url": "https://www.cnn.com/2020/04/04/us/wrestlemania-36-how-to-watch-preview-trnd/index.html"}