{"authors": [], "date_download": "2020-05-04 20:11:22", "date_modify": "2020-05-04 20:11:22", "date_publish": "2020-04-09 13:29:55", "description": "TRENTON, N.J. (AP) — New Jersey's jobless claims spiked 32% last week, breaking a record set the week before, and Gov. Phil Murphy promised Thursday that no one owed jobless benefits will be...", "filename": "_4fd72625a00c41a90feaad87f2220802_1588623082.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4fd72625a00c41a90feaad87f2220802_1588623082.html", "title": "NJ unemployment claims climb 32%, breaking previous record", "title_page": "NJ unemployment claims climb 32%, breaking previous record ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "TRENTON, N.J. (AP) — New Jersey’s jobless claims spiked 32% last week, breaking a record set the week before, and Gov. Phil Murphy promised Thursday that no one owed jobless benefits will be denied despite delays because of the state’s old computer system.\nThe spike in claims to about 206,000 from 155,000 reflects the effects of the coronavirus outbreak on the state’s economy, according to the Labor Department.\nThe state’s unemployment website has been deluged with applicants, slowing it down and leading officials to ask people to try the site at off-peak times.\n“No one will be denied one penny of their benefits,” Murphy said Thursday.\nThe hardest-hit workers were from the food service industry, followed by those at doctors’ and dentists’ offices, the department said. Administrative workers were also hit hard.\nA $600 supplemental unemployment benefit for workers that stems from the federal relief bill is set to begin for laid-off workers next week. It will be issued separately from regular jobless payments.\nNew Jersey is among the states hit hardest by COVID-19.\nThe state’s death toll climbed by about 200 people to 1,700, Murphy said. The total number of positive cases topped 51,000, up from about 47,000.\nA look at other developments:\n‘LIGHT HERE’\nDespite New Jersey’s death toll roughly doubling the number of people from the state who died on 9/11, Murphy said the data are beginning to show “there’s light here.”\nHealth Commissioner Judy Persichilli pointed specifically to the time it takes hospitalizations to double. That figure went from 12.4 days to 14.6 days to 28.8 days this week, a sign that means it’s taking longer for the number of people in hospitals due to COVID-19 to double.\n___\nNEW DATA\nFor the first time Thursday, New Jersey reported detailed data on hospitalizations.\nMore than 7,000 people were in hospitals, with about 1,500 people on ventilators and another roughly 1,500 people in intensive care units. About 500 people have been discharged from hospitals, according to the governor.\n___\nGRACE PERIODS\nThe governor said he will sign an executive order to extend the grace period for paying insurance premiums.\nFor health and dental insurance, the grace period will be 60. Renters, home, auto and life insurance policies will have a 90-day grace period.\nInsurers can’t demand payment of premiums in a lump sum after grace period ends, but payments will have to be “smoothed out” over the life of your premium payments, according to the governor.\n___\nABOUT THE VIRUS\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, or death.", "url": "https://apnews.com/4fd72625a00c41a90feaad87f2220802"}