{"authors": ["Frank Pallotta", "Cnn Business"], "date_download": "2020-05-04 16:22:52", "date_modify": "2020-05-04 16:22:52", "date_publish": "2020-04-06 15:11:46", "description": "After months of hype and curiosity, Quibi has finally arrived.", "filename": "2020_04_06_media_quibi-streaming-service-guide_index_1588609372.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200305164215-quibi-meg-whitman-jeffrey-katzenberg-0108-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_media_quibi-streaming-service-guide_index_1588609372.html", "title": "Quibi: Here's what you need to know about the new streaming service", "title_page": "Quibi: Here's what you need to know about the new streaming service - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) After months of hype and curiosity, Quibi has finally arrived.\nThe new mobile-only streaming service launched on Monday in the United States and Canada and is yet another entrant into the streaming wars. However, the service differs a bit from the likes of Netflix and Disney+ thanks to an odd but unique pitch: It offers high quality videos and series that are 10 minutes or less in length\nQuibi will face significant competition and it's launching in the middle of a pandemic, which may or may not help its growth . But it has a lot of buzz --— and money — backing it up, not to mention two of the most famed executives in Hollywood and Silicon Valley running the company.\nHere's everything you need to know about Quibi:\nWhat is it?\nQuibi, which is short for \"quick bites,\" offers short-form content that's no more than a few minutes long. The content ranges from scripted, fictional series to news and sports highlights.\nHowever, unlike short-form videos on YouTube or Instagram, Quibi's content comes with high production budgets. The videos have also been filmed and edited to be viewed both horizontally and vertically.\nThe service's two veteran executives include Meg Whitman, the former CEO of eBay, and Jeffrey Katzenberg, a Disney alumnus and co-founder of DreamWorks. The two have raised nearly $2 billion from investors, according to the Wall Street Journal.\n\"What we're trying to do is bring together the best of Hollywood and the best of Silicon Valley to make viewing short-form content on your mobile extraordinary,\" Whitman told CNN Business last year. \"We've got Hollywood quality content with some really very innovative technology that makes viewing video on your mobile something quite different than what it is today.\"\nWhat content does it have?\nQuibi will launch with 50 shows with plans to release 175 original shows and \"8,500 quick bites of content\" in its first year.\nThe service offers an eclectic mix of content and has attracted A-list talent to star in and produce shows, including Jennifer Lopez, Steven Spielberg and Chance the Rapper.\nThe most notable (and arguably most audacious) series on the service is called \"Murder House Flip.\" It is billed as an \"unconventional new home renovation show\" which looks to flip houses where infamous murders took place.\nHow much does it cost?\nIt costs $4.99 a month with ads and $7.99 a month without ads. It also comes with a 90-day free trial.\nWill it work?\nCan its short-form, mobile-only selling point help Quibi stand out? That's the nearly $2 billion question for the new streaming venture.\nNetflix NFLX Spotify SPOT \"Consumers are looking at their budgets closer than ever. Many are paying for pay TV, HBO,, Hulu,and more already,\" Andrew Hare, a senior vice president of research at media consulting firm Magid, told CNN Business last year. \"It's really going to need to prove extraordinary value to consumers to drive subscription scale.\"\nAnother question mark for the service is how the coronavirus pandemic could affect the launch of the on-the-go service since millions are now stuck at home.\nKatzenberg believes that people forced to be inside could actually benefit the service.", "url": "https://www.cnn.com/2020/04/06/media/quibi-streaming-service-guide/index.html"}