{"authors": ["Analysis Hanna Ziady", "Cnn Business"], "date_download": "2020-05-04 16:09:22", "date_modify": "2020-05-04 16:09:22", "date_publish": "2020-04-01 13:00:17", "description": "The coronavirus pandemic has delivered a shock to tens of millions of people in rich countries around the world: Suddenly, they can't buy the food they want, when they want.", "filename": "2020_04_01_business_food-supply-chains-coronavirus_index_1588608562.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402151530-empty-shelves-groceries-london-supermarket-0320-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_business_food-supply-chains-coronavirus_index_1588608562.html", "title": "Can't find what you want in the grocery store? Here's why", "title_page": "Global food shortages: Here's why grocery stores don't have what you want  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) The coronavirus pandemic has delivered a shock to tens of millions of people in rich countries around the world: Suddenly, they can't buy the food they want, when they want.\nFood supply chains in developed economies are showing increased signs of strain as nationwide lockdowns designed to curb the spread of the coronavirus heap pressure on systems that had very little slack to begin with. The result is empty store shelves, and panicked buyers\nThe transportation links that move food around the globe are being tested in unprecedented ways. Shipowners are struggling to change crews and move goods between ports. Airlines have grounded thousands of planes, slashing air freight capacity.\nTravel restrictions also are clogging up road networks and making it difficult for farm workers to get where they are needed. And at the end of food supply chains, supermarkets that have come to rely on just-in-time deliveries have been upset by huge demand and panic buying.\nGlobal stocks of staple commodities such as wheat, corn and rice are at healthy levels, said Maximo Torero Cullen, chief economist at the United Nations Food and Agriculture Organization. But logistics bottlenecks need to be identified and resolved quickly to ensure goods can get to where they are needed, and protectionist policies avoided, he added.\nKazakhstan, a major wheat exporter, temporarily banned shipments of buckwheat, rye flour, sugar, carrots and potatoes earlier in March because the government was worried about domestic supply. While the restrictions have since been eased, similar moves by other countries could be problematic.\nThe food supply crunch is getting attention from top policymakers: Leaders from the Group of 20 major economies last week pledged to resolve disruptions to global supply chains and ensure the movement of vital medical supplies, critical agricultural products and other goods and services across borders.\nShipping on the front line\nA Maersk container ship docks in Fremantle, Australia on March 27, 2020.\nShipping would be a good place to start. The vast majority of the world's food supply is carried on ships, either in containers or on board bulk carriers.\nYet shipowners, already reeling from shutdowns of some of the world's busiest ports in China, are now having to contend with sweeping lockdowns all over the world, hindering access to ports and making crew changes all but impossible due to travel restrictions.\nMaersk AMKAF , the world's largest container shipping company, recently said it had suspended all crew changes for a month partly to minimize the risk of vessels being quarantined by port authorities and causing disruptions to customers' cargo.\nBut doing so puts the physical and mental health of seafarers at risk, as they remain on board ships for extended periods without a break, which could lead to crew shortages later on, the International Chamber of Shipping has warned.\nMore than 30 ports worldwide are either restricting entry to vessels or prohibiting crew changes, including in Australia, Vietnam, India, Greece, Portugal, Chile and Argentina, according to Wilhelmsen, a maritime industry conglomerate based in Norway.\nRules governing port access differ from country to country, and sometimes even within countries, making it very difficult for shipowners to plan routes, said Guy Platten, secretary general at the International Chamber of Shipping. This could snarl food supply chains, particularly for time-sensitive fresh produce, he added.\nDelays in transit from ports in China are likely to cause apple juice shortages in the United States, according to a March 13 report by commodities research firm Mintec. Two-thirds of the apple juice Americans drink comes from China.\nAir cargo restricted\nThe shutdown in commercial aviation caused by coronavirus has sharply reduced air cargo capacity , making it harder and more expensive to move perishable goods that need to be delivered at speed.\n\"Passenger operations have been reduced so drastically that there is just not the capacity in the system to meet even the reduced levels of air cargo,\" Alexandre de Juniac, CEO of the International Air Transport Association, said in a statement on Tuesday.\nShipments have been delayed as airlines struggle to arrange crews and get permission to fly because of travel restrictions, de Juniac said. \"Last week the European Commission published guidance which will help clear roadblocks in Europe. And we encourage other countries to follow suit,\" he added.\nHiten Dodhia, a director of Saturnalia UK, a company that imports high-value fresh produce from Africa and South America and sells it to supermarkets in Europe, said there has been a huge hike in the price of air freight due to the grounding of so many passenger planes.\nLockdowns and curfews in countries including Zimbabwe, South Africa, Guatemala and Peru are restricting the movement of workers and causing labor shortages on farms, which will obstruct planting, harvesting and packaging, he told CNN Business.\nThe biggest problems lie with vegetables that are planted, harvested and shipped over relatively short time frames, such as mangetout, sugar snaps, baby corn, beans and tenderstem broccoli, Dodhia said. He has told some farmers not to plant because it is unclear whether their goods can be moved to market in time.\nLabor and logistics\nA seasonal worker tends to raspberries ahead of the fruit picking season at a farm in England.\nLabor shortages in Europe and the United States also threaten to seriously disrupt supply chains, push food prices higher and make certain high-value commodities, such as fruit, vegetables, meat and fish, hard to find.\nBritain's National Farmers' Union has warned that travel restrictions could prevent migrant workers from getting into the country for the upcoming harvest, while a nationwide shutdown will hamper growers' ability to recruit the 80,000 seasonal workers needed this year.\n\"We are urging the British people, university students, anyone looking for work, to mobilize behind British growers in this time of national importance and pick for Britain,\" the union's vice president, Tom Bradshaw, said in a statement.\nLabor shortages in Europe are meanwhile likely to interrupt Britain's supply of imported fruit and vegetables in the coming months, according to the UK's Landworkers' Alliance, which represents more than 1,000 small British farms and is a member of the international smallholder farmers' movement La Via Campesina. \"Much of our produce comes from Southern Europe, where producers are already delaying and reducing spring plantings due to restrictions on movement of seasonal workers from Eastern Europe, illness, transport restrictions and cashflow,\" it said in a statement.\nThe price of apples from Poland and broccoli from Spain jumped by roughly 20% between February and March, as consumers hoarded fruit and vegetables, according to Mintec. \"Traffic chaos at the German-Polish border has made transporting apples and other fruits problematic,\" said Mintec.\nGovernments must resolve bottlenecks and ensure that perishable goods do not go to waste, said Torrero Cullen. Keeping labor-intensive packaging plants running at full capacity while still following social distancing guidelines will create an additional challenge, he added.\nNo slack in the system\nTrucks wait to be processed at the Polish-Ukrainian border.\nSupermarkets, which are working around the clock to keep shelves stocked amid panic buying, are facing logistics headaches of their own. And just-in-time supply chains mean there is very little slack in the system.\nRetailers generally hold between one to three weeks' worth of non-perishable items, such as pasta and rice, in stores and depots, with much lower quantities of fresh produce kept in storage, said Dave Howorth, executive director of Scala, an independent supply chain consultancy to the UK's food and drink sector.\n\"Suppliers generally deliver on a daily basis because there's so little stock in the system,\" he added. But if shipments are delayed because of restricted access to ports, or suppliers are held up at border crossings, daily deliveries may not be possible.\nPhotos of empty shelves and steps taken by retailers to ration purchases suggest that while there may be plenty of food out there, the systems that get it to where it's needed are being stretched.\nThis prompted the UK government to temporarily relax competition laws earlier in March to allow supermarkets to exchange data on stock levels, pool staff to meet demand, and share distribution depots and delivery vans.\nAnother factor driving demand at supermarkets: restrictions imposed by governments to reduce the spread of coronavirus mean that people are eating more at home, instead of in restaurants.\n\"It's a fundamental change. You've seen a significant switch in volumes, which has been overlaid with panic buying,\" said Howorth. Over the four weeks to March 21, UK shoppers made three additional trips to the grocery store compared to the same period last year, spending an extra £1.9 billion ($2.4 billion), according to Nielsen. An additional 1.2 million online orders were placed over the same period, the research firm said.", "url": "https://www.cnn.com/2020/04/01/business/food-supply-chains-coronavirus/index.html"}