{"authors": ["Terry Miller", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Christian Smalls", "Dave Kamper", "Richard Lachmann", "An Interview With"], "date_download": "2020-05-04 19:59:41", "date_modify": "2020-05-04 19:59:41", "date_publish": "2020-04-03 00:00:00", "description": null, "filename": "2020_04_chicago-amazon-warehouse-walkout-coronavirus-pandemic_1588622381.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/04/03154323/GettyImages-1193152017.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_04_chicago-amazon-warehouse-walkout-coronavirus-pandemic_1588622381.html", "title": "“They Don’t Think Our Lives Matter as Much as Theirs”", "title_page": "“They Don’t Think Our Lives Matter as Much as Theirs”", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "TM\nOver several months, we grew and escalated our organization. Each time we did a petition, we had more signatures. Each time we passed out newsletters, more people took them and read them. Our contact list of workers grew. We were doing weekly potlucks at lunch. We had social events outside before coronavirus lockdown. We had a variety of community-building events as well as organizing within the warehouse. In January and February, we were working on the paid time off (PTO) campaign. We went through a variety of actions that were successful from our perspective: we won a lot of coworkers over to the organization.\nWhen the coronavirus pandemic hit the United States, we knew it was a matter of time until a case would pop up in our warehouse. The first one was in DBK1 in New York City — workers there reacted quickly to shut it down — but we knew we needed to be ready.\nWe had developed the organization and some of the infrastructure for that, but some of us are sheltering in place and not going to work, so it was kind of chaotic. The moment we got confirmation from management about a case, we needed to respond right away. We had an emergency call with our organizing committee — the group of us that are most engaged in the organizing work — the next day and said, “We have a case of coronavirus. So far management has been not only shady about it but trying to cover it up or waiting for multiple shifts to come through before even informing people, putting people at risk. This is a crisis. We need to respond. What should we do?”\nThat’s when we formulated our plan: we need to immediately start a petition, we need a set of demands, we have to be really clear about what we want to change in this warehouse to protect ourselves from coronavirus. We developed our demands on that call and made a petition so we could get these demands out in front of all our coworkers, get everyone on the same page so we have unity. Then we have to build from there to a strike, because that’s the only way we’re going to get this shut down.\nThe confirmed case came on Friday, March 27. Monday night was our strike. We had forty-eight hours from the time that coronavirus hit to when we were planning to strike. We needed to react fast because the longer this warehouse is open, the more our coworkers are at risk. I have coworkers that are over seventy years old and we know that that fatality rate for them is higher. Imagine being seventy-two years old and working at a fucking Amazon warehouse because you can’t afford to retire. So, it is a fucking crisis.\nWe distributed the petition mostly electronically because we were either sheltering in place or, if we’re going to the warehouse, they have rules that we can’t stand within six feet from each other, so you can’t walk around with a clipboard and a petition.\nWe texted and emailed and used social media and we got signatures. Then we printed it out and had it ready on Monday to talk about with our coworkers. People set up a picket line before the night shift started, talked to everyone who was walking up, and explained what we’re doing and why we’re trying to shut the warehouse down.\nThat’s how we ended up with a majority strike on the night shift. The warehouse was unable to move the vast majority of its volume.\nIt’s worth noting the sadness of subjugation under capitalism, especially for working-class people of color. When it came to the people walking in, “breaking the picket line,” we didn’t have any hard feelings. It was just like, “Hey, you want to stand with us? We’re trying to shut this warehouse down with pay,” and they’d say, “I need this paycheck.” People would say, “I support you. I signed your petition, but I’ve got to get these hours.”\nAnd we were like, yeah, you gotta do what you gotta do. We would ask them, “Do you feel safe going in there?” They’d say no. “Do you think management is doing enough to protect us from coronavirus?” No. “What do you think needs to happen?” They would say, “I think they need to shut it down.” And we said that’s our first demand on our petition and why we’re on strike right now.” They’d say “Yeah, I agree with you, but I need these hours.”\nThat’s bondage under capitalism. Of the people who went inside the warehouse, most of them expressed support for our strike, but said they need the money.", "url": "https://www.jacobinmag.com/2020/04/chicago-amazon-warehouse-walkout-coronavirus-pandemic"}