{"authors": ["Christina Maxouris", "Dakin Andone"], "date_download": "2020-05-04 16:19:46", "date_modify": "2020-05-04 16:19:46", "date_publish": "2020-04-04 10:31:04", "description": "President Donald Trump on Saturday warned that \"there will be a lot of death\" in the coming weeks as the number of people who had died from the coronavirus in the United States surpassed 8,000.", "filename": "2020_04_04_health_us-coronavirus-saturday_index_1588609186.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404015225-coronavirus-mainbar-0404-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_health_us-coronavirus-saturday_index_1588609186.html", "title": "US coronavirus death toll tops 8,000 as Trump warns 'there will be a lot of death'", "title_page": "US coronavirus: Death toll tops 8,000 as Trump warns 'there will be a lot of death' - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump on Saturday warned that \"there will be a lot of death\" in the coming weeks as the number of people who had died from the coronavirus in the United States surpassed 8,000.\n\"This will be probably the toughest week between this week and next week,\" the President said in a White House briefing Saturday.\n\"And there will be a lot of death, unfortunately. But a lot less death than if this wasn't done,\" he said, referring to certain mitigation tactics.\nAt least 1,324 deaths were reported in the United States on Saturday, the most coronavirus deaths reported in a single day thus far. At least 8,476 people have died nationwide and at least 311,301 people have been infected, according to data compiled by Johns Hopkins University\nWhite House experts earlier this week predicted at least 100,000 Americans could die from the virus, assuming residents strictly abide by federal social distancing guidelines.\nHealth officials urged Americans to continue following social distancing guidelines, with Dr. Anthony Fauci of the National Institute for Allergy and Infectious Diseases calling it \"our most important tool.\" He pointed to Washington state, where social distancing measures appear to be paying off\n\"I want to actually just plea ... to the American public, you know, as sobering and as difficult as this is, what we are doing is making a difference,\" Fauci said. \"So we really need to continue to do that.\"\nDr. Deborah Birx, the White House coronavirus response coordinator, said the next two weeks will be crucial to flatten the curve.\n\"This is the moment to not be going to the grocery store, not going to the pharmacy, but doing everything you can to keep your family and your friends safe, and that means everybody doing the six-feet distancing, washing your hands,\" she said.\nAll but eight states have issued a form of stay-at-home orders though Fauci said earlier in the week he doesn't understand why all states haven't issued such an order.\nThe President has consistently said he would not issue a nationwide order. He reiterated Saturday he wouldn't force the hands of eight governors, saying, \"We have a thing called the Constitution.\nPresident Donald Trump speaks during a coronavirus task force briefing at the White House, Saturday, April 4, 2020, in Washington.\nStates don't have adequate supplies, leaders warn\nSeveral states have seen large jumps in their number of cases, including Louisiana, which reported 2,199 new cases Saturday, and New Jersey, which reported 4,331.\nBut along with the rise in cases, some state leaders have said they're still missing vitals tools to combat the virus and slow it's spread.\nNew York state, which has been desperately searching for ventilators, will receive 140 ventilators from Oregon, New York Gov. Andrew Cuomo said Saturday in a news conference.\n\"This was unsolicited, but the 140 ventilators will make a difference,\" Cuomo said, adding the gesture was both \"kind\" and \"smart.\"\n\"We're all in the same battle here,\" the governor said. \"And the battle is stopping the spread of the virus.\"\nChina is donating another 1,000 ventilators, Cuomo said. Those are expected to arrive Saturday.\nKentucky Gov. Andy Beshear has called on residents to donate equipment they may have.\n\"I will tell you that virtually every order that we, and then any other state is putting in, is either getting bought out by the federal government or being sent directly to one of the hot spots out there,\" he said in a Saturday news conference of trying to obtain ventilators and personal protective equipment, or PPE.\nIllinois Gov. J.B. Pritzker said his state doesn't even have enough tests to get a clear idea of the scale of the outbreak.\n\"Everything about the tests are very difficult to come by, and there's no federal plan for this, so every state is on their own,\" Pritzker said. \"As I've said, it's the Wild West out here.\"\nNorth Carolina Gov. Roy Cooper called on the federal government to ramp up efforts for more PPE, saying the state had received some but not all it had requested. He said the state is \"grateful\" for the supplies but had only received a third of what it asked for.\n\"This pandemic is a war,\" he said. \"And we need the armor to fight it.\"\n\"Governments at all levels, hospitals, law enforcement and others are competing against each other for a scarce amount of personal protective equipment,\" Cooper said.\nUS Strategic National Stockpile President Trump this week said theUS Strategic National Stockpile is nearly depleted\nWhite House announces new face cloth guidelines\nPeople are now advised to wear cloth face coverings when in public, the White House announced Friday upon recommendation of the US Centers for Disease Control and Prevention.\n\"It's really going to be a voluntary thing,\" Trump said. \"I'm not choosing to do it.\"\nThe President's announcement came days after a panel of experts advised the White House on new research that suggests coronavirus could be spread by talking and possibly even just breathing.\nStill, experts at the CDC said they felt \"pressured\" by the White House to draft the recommendations on face coverings , a senior federal health official involved in discussions said.\n\"The CDC would not have gone this direction if not for the White House,\" the official told CNN. \"We would have tried more to understand about asymptomatic transmission. We would have done more studies if we had more time.\"\nCDC experts were under \"intense pressure\" to draft the new guidelines quickly, the official said.\nNew York has not yet reached the apex\nSeveral states have reported jumps in cases, including Louisiana, where there were nearly 12,500 cases -- a 21% increase -- and more than 400 deaths on Saturday, according to the Louisiana Department of Health.\nTo deal with the influx of cases, officials are converting a New Orleans convention center into an emergency hospital.\n\"Look at the magnitude of this. We are still very much in this,\" Dr. Joseph Kanter, assistant state health officer for the department, said in a news conference. \"In fact we haven't even hit halfway.\"\nNew Orleans Mayor LaToya Cantrell said the city's coroner's office and mortuaries have reached their limit and she's asked the federal government for additional refrigeration.\nI've had to ask the federal government for additional refrigeration so we can take care of our people while they're resting in god's peace, but not resting well because they haven't been laid to rest as they deserve.\"\nNew York state has more than 113,000 cases, with more than 10,000 reported on Friday -- a \"new high\" -- Cuomo said Saturday. At least 3,565 people have died.\nThe state has yet to reach the peak of its curve, Cuomo told reporters, saying projections forecast the apex is between four and eight days away. At that point, New York's health care system will face its \"ultimate challenge,\" Cuomo said.\n\"But there's part of me that says it's good we're not at the apex because we're not yet ready for the apex either,\" he said. \"We're not yet ready for the high point. We're still working on the capacity of the system. The more time we have to improve the capacity of the system, the better.\"\nTo achieve that, the governor said he will sign an executive order to allow medical students who have yet to graduate to begin practicing. In all, the state has 85,000 medical volunteers, he said, including 22,000 from out of state.\nMeantime, an emergency hospital facility at the Javits Convention Center in Manhattan will provide 2,500 beds, treat Covid-19 patients and be staffed by the federal government, Cuomo said.\nThe US Navy said Saturday that a \"few patients\" brought to the USNS Comfort tested positive for Covid-19, though the ship is not meant to treat coronavirus patients.\nThey were isolated upon their arrival to the Comfort, which is docked in New York City, while they awaited test results. When those results came back positive, the patients were transferred to the Javits Center.\nThe US military is sending 1,000 Air Force and Navy medical providers to New York over the next three days to help augment medical personnel, according to a tweet from US Northern Command. About 300 of those personnel will head to the Javits Center and \"other locations.\"\nNurse says patients appear sicker than last week\nA New York hospital intensive care unit nurse says the patients she and her colleagues are treating this week appear sicker compared with last week. And it's not just the lungs, Kelley Bradshaw said. Patients' heart and kidneys are being affected as well.\n\"There's just a lot of unpredictability with these patients and it just feels like the longer someone battles this virus and the more critically ill they become, the harder our job gets,\" she said.\nThe ICU has expanded to handle more patients, Bradshaw said, and while health workers still have all the protective equipment they need, they're careful not to exhaust it in case they still have a lot of coronavirus patients three weeks from now.\n\"They do have to keep it very -- it is very regulated, meaning that we can't just blow through it, because we don't know what's coming next,\" she said.\nState officials in New York have planned to redirect ventilators and medical supplies from institutions that aren't using them to overwhelmed downstate medical facilities under an executive order by Gov. Andrew Cuomo.\nCuomo is asking upstate hospitals to loan up to 20% of their unused ventilators.\n\"Moreover, when the pandemic wave hits upstate New York, the governor will ask downstate hospitals for similar help,\" Rich Azzopardi, a senior adviser to the governor, said in a statement. \"We are not upstate or downstate we are one state and we act that way.\"", "url": "https://www.cnn.com/2020/04/04/health/us-coronavirus-saturday/index.html"}