{"authors": [], "date_download": "2020-05-04 20:24:11", "date_modify": "2020-05-04 20:24:11", "date_publish": "2020-04-16 23:15:58", "description": "The Latest on coronavirus outbreak in South Dakota (all times local): 6:15 p.m. A Sioux Falls nursing home has confirmed eight cases of COVID-19 among residents and employees.", "filename": "_34024bd7150de32e6d8b8dba267b2629_1588623851.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_34024bd7150de32e6d8b8dba267b2629_1588623851.html", "title": "The Latest: Sioux Falls nursing home confirms COVID-19 cases", "title_page": "The Latest: Sioux Falls nursing home confirms COVID-19 cases", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Latest on coronavirus outbreak in South Dakota (all times local):\n6:15 p.m.\nA Sioux Falls nursing home has confirmed eight cases of COVID-19 among residents and employees.\nThe Good Samaritan Village on Thursday said that five residents and two employees at its skilled nursing facility have tested positive for COVID-19 along with one employee in its assisted living facility. The Good Samaritan Society made the announcement after the Argus Leader received a tip about a possible confirmed case.\nA spokesman for Sanford Health said the organization is working closely with the South Dakota Department of Health to ensure its response plan “meets the needs of this rapidly changing situation.”\nThe Society has partnered with Sanford Health to test residents and staff who may have been exposed, and officials are taking extra precautions to monitor their health, Shawn Neisteadt said in an email.\n“The health and safety of our residents, employees and the community we serve during this unprecedented pandemic remains our highest priority,” Neisteadt said.\nThe Good Samaritan Village isn’t the only assisted living facility that has had positive cases of the coronavirus in Sioux Falls.\nThe Prince of Peace Retirement Community, run by Avera Health, announced earlier this month that a resident had died after contracting the coronavirus. At the time the resident was one of three residents infected.", "url": "https://apnews.com/34024bd7150de32e6d8b8dba267b2629"}