{"authors": ["Por Mike Stobbe"], "date_download": "2020-05-04 20:26:28", "date_modify": "2020-05-04 20:26:28", "date_publish": "2020-04-15 21:46:09", "description": "NUEVA YORK (AP) — Las cifras de casos y muertes por el nuevo coronavirus en Estados Unidos podrían aumentar pronto debido a que las autoridades federales de sanidad empezarán a contar infecciones...", "filename": "_de51cbd732b3471db10e59d8d54c92d8_1588623988.html", "image_url": "https://storage.googleapis.com/afs-prod/media/d1c2a352a5894e90853d1e83d629e774/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_de51cbd732b3471db10e59d8d54c92d8_1588623988.html", "title": "EEUU: Cifras de COVID incluirán casos probables sin pruebas", "title_page": "EEUU: Cifras de COVID incluirán casos probables sin pruebas", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nNUEVA YORK (AP) — Las cifras de casos y muertes por el nuevo coronavirus en Estados Unidos podrían aumentar pronto debido a que las autoridades federales de sanidad empezarán a contar infecciones que no han sido confirmadas por una prueba de laboratorio.\nLos Centros para el Control y la Prevención de Enfermedades (CDC por sus siglas en inglés) pidieron el martes a los estados incluir casos probables de COVID-19 en sus reportes enviados a la agencia. Anteriormente, la mayoría de los estados sólo reportaba los casos y decesos confirmados por pruebas de laboratorio.\nEl cambio no ha causado que las cifras del país aumenten mucho más rápido de lo habían subido, pero los funcionarios de algunos estados señalaron que apenas se estaban enterando del cambio. Pensilvania, por ejemplo, ha empezado a seguir la instrucción de los CDC y ampliar sus reportes, dijo el miércoles la doctora Rachel Levine, secretaria de Salud del estado, en una conferencia telefónica con reporteros.\nLos funcionarios de los CDC señalaron el miércoles en un comunicado que el cambio les daría “un mejor panorama de la carga del COVID-19 en Estados Unidos”.\nYa había un aumento grande en la ciudad de Nueva York, donde las autoridades comenzaron esta semana a contar a gente que no había dado positivo al coronavirus. Eso ocasionó que la cifra de muertos de la entidad aumentará en más de 3.700 el martes.\nLos estados pueden reportar tales enfermedades como quieran, pero los CDC brindan orientación. La agencia federal a menudo depende de una organización llamada Consejo de Epidemiólogos Estatales y Territoriales para ayudar a definir los casos.\nHace unas semanas, el consejo revisó su definición del COVID-19, para incluir padecimientos que no tienen resultados positivos en las pruebas, pero que en los que la evidencia apunta a la enfermedad. El consejo hizo el cambio en parte debido a la creciente evidencia de que algunas personas infectadas no presentaron síntomas y es posible que no se les haya realizado una prueba.", "url": "https://apnews.com/de51cbd732b3471db10e59d8d54c92d8"}