{"authors": ["Michael Casey And Alexandra Olson"], "date_download": "2020-05-04 20:22:28", "date_modify": "2020-05-04 20:22:28", "date_publish": "2020-04-09 01:51:20", "description": "BOSTON (AP) — When Rebeka McBride and her husband put their home in Washington state on the market in early March, the coronavirus outbreak was just taking hold in the United States. They managed...", "filename": "_52b6f5434c2688b8a36123a9c156c00a_1588623748.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b22b3ca7d7514215ab8a9131b59f80e7/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_52b6f5434c2688b8a36123a9c156c00a_1588623748.html", "title": "Virus casts a dark cloud over once-thriving home market", "title_page": "Virus casts a dark cloud over once-thriving home market", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Wednesday, April 1, 2020 photo, a \"For Sale\" sign stands in front of a home that is in the process of being sold in Monroe, Wash., outside of Seattle. Would-be home sellers and buyers in the United States as well as in Europe are caught in the grip of a pandemic that has upended the housing market just as it was entering the busy spring season. (AP Photo/Elaine Thompson)\nIn this Wednesday, April 1, 2020 photo, a \"For Sale\" sign stands in front of a home that is in the process of being sold in Monroe, Wash., outside of Seattle. Would-be home sellers and buyers in the United States as well as in Europe are caught in the grip of a pandemic that has upended the housing market just as it was entering the busy spring season. (AP Photo/Elaine Thompson)\nBOSTON (AP) — When Rebeka McBride and her husband put their home in Washington state on the market in early March, the coronavirus outbreak was just taking hold in the United States. They managed to hold two open houses and a smattering of private viewings before accepting an offer.\nBut with the U.S. economy now collapsing, the family is less confident about their move to a Minneapolis suburb, where McBride sees brighter job prospects in her field of medical device research. She had worried that their buyer would pull out before closing, but they finalized the sale Thursday. And for her own new home, she’s using virtual tours but isn’t inclined to make an offer without seeing a home in person. Worse, McBride is suddenly worried about job prospects amid mass layoffs, forcing a reassessment of what she and her husband can afford.\n“I’m nervous the layoffs and change in economy will cause the bottom to fall out,” said McBride, the mother of a 4-year-old.\nMcBride is among many sellers and buyers, in the United States as well as in Europe, caught in the grip of a pandemic that has upended the housing market just as it was entering the busy spring season.\nShutdown orders have halted open houses and complicated property viewings. Sellers are delaying listings or yanking their properties off the market. Prospective buyers are dropping out, some of them after losing jobs.\nAgents are turning to virtual tours, electronic signatures and “drive-through” closings, where paperwork is completed through car windows. Where it’s still allowed, buyers and agents are entering homes separately, armed with hand sanitizers and wipes.\nMortgage applications to buy a home fell 12% in the week that ended April 3 compared with the previous week — and were a stunning 33% lower than in the same week last year, the Mortgage Bankers Association reported. Home buying applications are at their lowest level since 2015, the MBA said.\nThe mortgage industry itself is reeling as hundreds of thousands of Americans have temporarily stopped paying their mortgages under the federal coronavirus relief bill. The MBA is among several housing industry groups that have called for federal aid for mortgage servicers, who handle paperwork for lenders.\nA collapse of sales could trigger a series of reactions that would further damage the economy. Further declines will mean fewer purchases at furniture and appliance stores. If construction stalls, 3 million homebuilding jobs are at risk. So are many brokers: Redfin plans to furlough 41% of its brokers. Zillow has suspended home buying in all 24 of it markets. Other brokerages have canceled open houses.\nListings of homes for sale were already near historic lows before the virus struck. Further squeezing supply, at least five states, including hard-hit New York, Michigan and Washington, have banned most construction of new properties as part of stay-at-home orders, according to the National Association of Home Builders. De-listings of homes for sale jumped 100% year-over-year for the week that ended April 3, according to Redfin.\n“People are losing their jobs,” said Taylor Marr, the company’s chief economist. “If they were looking for a home and they were working in a restaurant, that is probably no longer the case.”\nIn Britain, the latest monthly data have yet to be released, but anecdotal evidence suggests that the market has come to a standstill.\n“People are holding off, obviously, waiting for everything to pass,” said Simon Kyriacou, a London branch director for property agency EweMove.\nReal estate consultants Knight Frank have forecast that sales across the U.K. this year will fall 38% from 2019.\nIn the U.S., the long-term outlook is shrouded in uncertainty. A staggering rise in unemployment and the stock market decline is diminishing buying power. In Massachusetts, purchases had surged more than 25% as recently as February compared with a year earlier, according to Kurt Thompson of the Massachusetts Association of Realtors.\nThe biggest pullback is occurring among casual buyers and sellers, whose caution is exacerbating the predicament for people who feel compelled to move. Consider Marc Okicich, who’s been trying to move his wife and two daughters to San Diego, where he’s lived since November after a job transfer. The family put their Chicago-area house on the market in February. It finally fetched one offer last week. The two sides reached agreement Sunday for $8,000 below the asking price.\nIn New York City, where the virus has hit hardest, property visits have all but stopped. Michael J. Franco, an agent with Compass, said one of the only transactions he’s made the past two weeks occurred when the owners of an Manhattan apartment who’d been trying to sell it decided to rent it out instead.\nCara Ameer, an agent in northeast Florida, has been driving around to make video tours for several clients facing urgent moves. One must move from New Mexico because of a job change but has been forced the virus outbreak to postpone a house hunting trip. Another from Colorado made an offer on one of Ameer’s homes, sight unseen, deciding the video was good enough.\nBut for the majority of buyers, virtual tours aren’t enough, even if they can help narrow their options.\n“People need to touch, people need to smell the place, people need to see the neighborhood,” said Lawrence Yun, chief economist of the National Association of Realtors.\nClosings have grown more complicated. Equipped with gloves, sanitizer, masks and shopping bags for her feet for a private showing, real estate agent Michele Messina has had to innovate in the face of a stay-at-home order in New Jersey.\nShe did a recent closing in which the buyer visited a home alone, and the two communicated via Whatsapp for the walk-through. Messina also is starting to have clients bring their own pens to signings and requiring everyone to wait in their cars while a title company representative passes paperwork through the window of each vehicle — a drive-through closing, as she calls it.\n“We created it out of necessity,” she said. “You can’t have people sitting around the table.”\n___\nOlson reported from New York. AP Writer Kelvin Chan in London and Josh Boak in Washington contributed to this report.", "url": "https://apnews.com/52b6f5434c2688b8a36123a9c156c00a"}