{"authors": ["Mark Scolforo", "Michael Rubinkam", "Marc Levy"], "date_download": "2020-05-04 20:24:59", "date_modify": "2020-05-04 20:24:59", "date_publish": "2020-04-15 16:11:47", "description": "HARRISBURG, Pa. (AP) — Going to a Pennsylvania supermarket, home improvement center, pharmacy or other business that remains open during the pandemic? Be prepared to wear a mask. That goes for...", "filename": "_ff95fca6e1a4776acd45720cf147b2c8_1588623899.html", "image_url": "https://storage.googleapis.com/afs-prod/media/5a0e48ec6f044b4caef4b183c22f50db/2000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ff95fca6e1a4776acd45720cf147b2c8_1588623899.html", "title": "Wolf mandates masks as GOP seeks to relax business shutdown", "title_page": "Wolf mandates masks as GOP seeks to relax business shutdown ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Medical personnel transport a patient from the Jewish Home of Eastern Pennsylvania in Scranton, Pa. Tuesday, April 14, 2020. (Sean McKeag/The Citizens' Voice via AP)\nMedical personnel transport a patient from the Jewish Home of Eastern Pennsylvania in Scranton, Pa. Tuesday, April 14, 2020. (Sean McKeag/The Citizens' Voice via AP)\nHARRISBURG, Pa. (AP) — Going to a Pennsylvania supermarket, home improvement center, pharmacy or other business that remains open during the pandemic? Be prepared to wear a mask. That goes for workers, too.\nMany commercial buildings that serve the public will be required to make sure customers wear masks — and deny entry to anyone who refuses without a medically valid reason — under an order signed Wednesday by the state health secretary.\nEmployees will have to wear face coverings, too, including those who work in warehouses, manufacturing facilities and other places that remain in business but aren’t open to the public.\nThe mask mandate was included in a wide-ranging order that will govern many aspects of how a business operates — from how it arranges its break room to how many patrons it can allow inside at any one time — as the administration of Democratic Gov. Tom Wolf confronts a pandemic that has killed at least 647 in Pennsylvania and sickened thousands more.\nWolf said the latest order is meant to protect supermarket cashiers, power plant operators and other critical workers who can’t stay home and are at heightened risk of contracting the new coronavirus.\n“Our essential workers have stepped up to the plate and are keeping us safe, healthy, fed and sheltered during this time, and we all need to thank them (by) doing everything we can to prevent ourselves from spreading the virus to them,” he said at a video news conference.\nWolf is ratcheting up pressure on retailers, warehouses and other establishments to enforce social distancing guidelines and minimize the virus’s spread just as majority Republicans in the state Legislature seek to ease his administration’s shutdown of businesses it doesn’t consider “life sustaining.”\nWolf previously closed schools and nonessential businesses and ordered people to stay home.\nIn other coronavirus-related developments in Pennsylvania:\n___\nREOPENING BUSINESSES\nWolf’s office said he plans to veto legislation sent to him Wednesday by the GOP-controlled Legislature that would force him to allow some businesses to reopen.\nIn a statement, Wolf’s office said “irresponsibly going against the direction of the secretary of health and reopening businesses too early will only extend the length of the economic hardships created by the pandemic.”\nThe Senate approved the legislation on a party-line vote after two hours of floor debate.\nWolf’s health secretary, Dr. Rachel Levine, wrote to senators Wednesday to warn of the bill’s “devastating” impact on the administration’s ability to fight the virus.\nRepublicans accused Wolf of overseeing a haphazard and secretive process for determining which businesses must close, and which may remain open. Democrats, in turn, accused Republicans of ignoring health experts and risking lives. Republicans countered they were merely trying to force Wolf to adopt guidelines issued by the U.S. Centers for Disease Control and Prevention.\n___\nINMATE RELEASE\nThe state prison system is releasing inmates as part of its virus-containment strategy.\nEight inmates were in the first group slated for release Wednesday. Wolf had previously authorized the early release of as many as 1,800 inmates under his reprieve authority.\n“I’m a little slammed right now,” said Corrections Secretary John Wetzel, who is personally reviewing each inmate proposed for release.\nThe Department of Corrections posted the names of the inmates to be released and the counties they are going back to. Inmates will be confined to their homes or sent to halfway houses.\nUnder the Wolf administration’s plan, inmates serving time for nonviolent offenses and who are within months of their scheduled release are eligible for reprieve. The Corrections Department said it is seeking input from judges and prosecutors, and not all eligible inmates will be released.\nWetzel said it’s unclear how long the process will take.\nPennsylvania’s state prisons hold about 44,000 inmates. The department said 23 employees and 17 inmates have so far tested positive for the virus, with one death from COVID-19.\nThe dead inmate was identified as a client of the Pennsylvania Innocence Project, a legal group that works to exonerate people who say they were wrongly convicted.\nRudolph Sutton, 67, an inmate at Phoenix state prison in Montgomery County, died April 8. He was serving a life sentence for murder. He was among 14 inmates at Phoenix who contracted the virus, according to state officials.\n___\nCASES\nPennsylvania health officials reported 63 new deaths of people with COVID-19, raising the statewide toll to 647.\nMore than 1,100 additional people tested positive for the coronavirus, for a new statewide total of nearly 26,500, according to the Department of Health.\nThe state released new information Wednesday on the pandemic’s frightful toll on nursing homes and other long-term care facilities: More than 3,000 people in nearly 300 facilities have been diagnosed with COVID-19, and 324 have died — half the state’s total death count.\nFor most people, the virus causes mild or moderate symptoms that clear up in a couple of weeks. Older adults and people with existing health problems are at higher risk of more severe illness, including pneumonia, or death.\n___\nSTATE TAX RELIEF\nThe Wolf administration said it’s easing up on tax enforcement during the pandemic.\nThe Department of Revenue said it will pause payments on existing payment plans on request; offer flexible terms for new payment plans; suspend or reduce automatic enforcement of liens, wage garnishments and use of private collection agencies; and take other steps to offer relief to individual and business taxpayers.\nThe measures will last through at least July 15, the agency said Wednesday.\nThe Department of Revenue previously extended the deadline for taxpayers to file their 2019 Pennsylvania personal income tax returns from April 15 to July 15.\n___\nSHELL PLANT SHUTDOWN\nSeveral hundred workers are heading back to Shell’s massive manufacturing complex in western Pennsylvania.\nShell, under pressure from state and local officials, announced in mid-March that it was suspending construction at the soon-to-be-completed ethane cracker plant in Monaca that will turn the area’s vast natural gas deposits into plastics.\nFewer than 300 workers had remained on site to do maintenance work. Shell said Wednesday it will have about 500 people at the site by next week after receiving word from the state that the “repair, preservation and maintenance” work it has been doing didn’t require a waiver.\nThe company said it will adhere to state and federal social distancing guidelines.\n___\nAssociated Press writer Ron Todt in Philadelphia contributed to this story.\n___\nFollow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.", "url": "https://apnews.com/ff95fca6e1a4776acd45720cf147b2c8"}