{"authors": ["Todd Richmond"], "date_download": "2020-05-04 20:11:04", "date_modify": "2020-05-04 20:11:04", "date_publish": "2020-04-16 15:50:51", "description": "MADISON, Wis. (AP) — A University of Wisconsin System regents committee overwhelmingly approved imposing employee furloughs Thursday as campuses grapple with the coronavirus pandemic's economic...", "filename": "_538094a078d8f5a7a8c433aec68658eb_1588623064.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_538094a078d8f5a7a8c433aec68658eb_1588623064.html", "title": "Panel OKs furloughs for University of Wisconsin System", "title_page": "Panel OKs furloughs for University of Wisconsin System", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MADISON, Wis. (AP) — A University of Wisconsin System regents committee overwhelmingly approved imposing employee furloughs Thursday as campuses grapple with the coronavirus pandemic’s economic fallout.\nThe regents’ executive committee voted unanimously during a 20-minute teleconference to authorize system President Ray Cross to develop furlough plans for regional institutions and UW-Madison Chancellor Rebecca Blank to develop a specialized plan for the flagship campus. The plans are subject to review by the full Board of Regents but don’t need its approval.\n“This is an unprecedented time and we face unprecedented challenges,” Cross told the committee. “The COVID-19 pandemic has produced significantly challenges for us financially ... the likes of which most of us will have never seen.”\nCross told the committee moments after the vote that he has already drafted a plan for the system that will run from Friday though June 30.\nCross will have the authority to impose furloughs on system administration employees. Chancellors will have the authority to impose furloughs at their schools. They must report such plans to Cross before furloughs begin.\nFurloughs may be assigned for consecutive days or intermittently. The maximum consecutive-day furlough will be three months and intermittent furloughs can’t exceed one day every two weeks. Furloughed employees will be able to apply for unemployment checks if they lose more than eight hours in a 40-hour work week and earn less than $500 in that week.\nCross told the committee that UW-Madison’s plan will be coming “later.” Asked when UW-Madison may release its plan, university officials issued a statement saying they expect to announce “further HR guidance” by the end of the month.\nRegents President Andrew Petersen, who chairs the executive committee, told members that the furloughs likely will begin within the next few weeks.\n“This is the responsibility of our board to do the right thing and do it as efficiently as possible,” he said.\nThe system shut down in-person classes in March and students were asked to move back home. All spring sports have been canceled.\nThe system estimates the moves will result in a nearly $170 million loss just for the spring semester. The losses include the cost of issuing refunds for on-campus parking, dining and housing, technology purchases to move classes online, payments to student workers who lost their jobs and athletic ticket sales.\nUW-Madison stands to lose a projected $100 million during the semester, the most of any system school. UW-Milwaukee expects to lose $9.1 million.\nCross has said the system expects to receive about $94 million under the federal stimulus package, with about half of that going to grants for students and the rest going toward institutional support.\nSystem officials have asked legislators for an additional $59 million in emergency funding. Democrats tried to include the money in a pandemic relief bill the Legislature took up this week, but majority Republicans killed the proposal.\n___\nThis story has been updated to correct that the furlough plans require review by the full Board of Regents but not approval.\n___\nFollow Todd Richmond on Twitter at https:twitter.com/trichmond1", "url": "https://apnews.com/538094a078d8f5a7a8c433aec68658eb"}