{"authors": ["Opinion Kathleen Dunn"], "date_download": "2020-05-04 16:53:29", "date_modify": "2020-05-04 16:53:29", "date_publish": "2020-04-08 17:01:49", "description": "Kathleen Dunn writes that Wisconsin conservatives who pushed through an election Tuesday despite the coronavirus pandemic made an unimaginably cruel decision which will likely claim more lives.", "filename": "2020_04_08_opinions_wiscons_b992b2fd1d1a54b3dae419839b4d9b64_index_1588611209.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407122945-06-wisconsin-voting-lines-0407-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_opinions_wiscons_b992b2fd1d1a54b3dae419839b4d9b64_index_1588611209.html", "title": "Wisconsin conservatives made a cruel voting decision", "title_page": "Wisconsin conservatives made a cruel voting decision (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Kathleen Dunn is a longtime Milwaukee radio host who worked for 24 years at Wisconsin Public Radio and 18 years at WTMJ Radio. A member of the Milwaukee Press Club Hall of Fame, she is now retired and involved in volunteer work and moderating public-interest forums. The views expressed in this commentary are her own. View more opinion at CNN.\n(CNN) Upon hearing that the Wisconsin Supreme Court decided in-person voting for the spring election would proceed, I was filled with outrage.\nMessages from friends told me of their sleepless nights and tears. Wisconsin's Health Services Secretary, Andrea Palm, warned , \"In person voting would, without question, accelerate the transmission of Covid-19 and increase the number of cases. And an increase in the number of cases in Wisconsin would result in more deaths.\"\nLet me repeat -- \"more deaths.\"\nHave you no sense of human worth, Senate Majority Leader Scott Fitzgerald, Assembly Speaker Robin Voss and conservative members of the Wisconsin Supreme Court?\nThis is one of the most unimaginably cruel actions you've taken -- and one that likely has the outcome of suppressing the vote so you can maintain political power. In the midst of a global pandemic, is that more important than life itself?\n\"The Wisconsin Idea\" is a longtime vision in this state. In 1905, University of Wisconsin President Charles Van Hise said , \"I shall never be content until the beneficent influence of the University reaches every family of the state.\"\nHe was a classmate of progressive Wisconsin Gov. \"Fighting\" Bob LaFollette, and together they forged a close relationship between the university and state government, resulting in the nation's first workers' compensation legislation, tax reform and the public regulation of utilities.\nOver the course of the 20th century, the Wisconsin Idea became known as a commitment to public service. This was always my guiding light as a talk show host on Wisconsin Public Radio: to serve in the public interest.\nBut with Monday's reckless action by Republicans in the state legislature to allow in-person voting during a global pandemic, the conservative majority has strayed so far from this goal. The Wisconsin Idea has morphed into \"How to take voting rights away from those who don't like us.\" Wisconsin citizens have been doing what the governor and local officials have asked -- staying at home.\nLast week the Wisconsin Supreme Court ruled that it was not safe to convene jury panels for trials through Memorial Day. But it is okay to make Wisconsinites go to the polls to vote? While the National Guard was called in to help on Monday, there was not enough time to organize their placement.\nAs such, voters in predominantly Democratic counties like Milwaukee had to stand in long lines for hours at a mere five polling places , where there are normally 180. The decreased number of polling locations was due to a severe shortage of staff.\nAnd yet in less blue parts of the state, including suburbs like Brookfield and smaller towns like Waupaca, voting was disrupted to some degree but was not nearly as challenging or time intensive.\nSo, why are the poor in Milwaukee and Dane counties, already bearing the brunt of this terrible disease, supposed to get to the polls when there are complications in transportation, work and childcare? Are we willing to accept risking their health and even their deaths, even if they are Democrats?\nAre we naïve enough to believe that the Republican majority in this state is not acutely aware of these numbers?\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nMany friends have not yet received absentee ballots, which would have needed to have been postmarked by April 7 or dropped off by 8 p.m. that day, when polls closed. Post offices have been understaffed. Clerks have been overwhelmed with processing millions of requests.\nThose decent Americans will be disenfranchised due to a wrong-headed US Supreme Court decision that would not account for pandemic circumstances and allow voters a few extra days to return their ballots. Voting rights are being taken away at the very time Covid-19 is taking people's lives.\nWisconsin's reputation as a progressive state has been badly damaged.\nI voted absentee several weeks ago and am thankful I did. Personally, I wouldn't have wanted to risk my health. I'm not young anymore and have underlying health conditions.\nOn Tuesday, I watched thousands of Milwaukeeans voting in person. I see elements of bravery, but then again Americans have died for their right to vote. We should not be repeating that in 2020.", "url": "https://www.cnn.com/2020/04/08/opinions/wisconsin-primary-conservatives-cruel-decision-dunn/index.html"}