{"authors": ["Sherisse Pham", "Cnn Business"], "date_download": "2020-05-04 15:58:57", "date_modify": "2020-05-04 15:58:57", "date_publish": "2020-04-01 04:26:34", "description": "Carnival Corporation is seeking at least $6 billion to weather an unprecedented crisis that has decimated business, after coronavirus outbreaks aboard its cruise ships killed several passengers and sickened hundreds more.", "filename": "2020_04_01_business_carnival-cruise-debt-coronavirus_index_1588607937.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331233432-carnival-cruise-debt-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_business_carnival-cruise-debt-coronavirus_index_1588607937.html", "title": "Carnival seeks $6 billion as Covid-19 pandemic devastates cruise industry", "title_page": "Carnival seeks $6 billion as Covid-19 pandemic devastates cruise industry - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Hong Kong (CNN Business) Carnival Corporation is seeking at least $6 billion to weather an unprecedented crisis that has decimated business, after coronavirus outbreaks aboard its cruise ships killed several passengers and sickened hundreds more.\nThe cruise operator announced on Tuesday that it intends to raise $3 billion of secured notes and $1.75 billion of convertible notes — both due in three years — as well as $1.25 billion of new shares.\nWedbush analyst James Hardiman said in a note on Tuesday that Carnival is suffering \"a monthly cash burn of approximately $500 million\" and the fresh injection of cash should keep the company afloat for the next 12 to 13 months.\nCarnival CCL Shares infell 2% in after-hours trading. The stock is down 74% for the year.\nCarnival is the world's largest cruise operator. It runs flagship line Carnival Cruise, Costa Cruises, the Holland America Line and the Princess Cruises brand, whose fleet includes the Diamond Princess — a ship that became a floating quarantine zone off the coast of Yokohama in February. At least 705 people contracted the virus during the quarantine, four of whom died.\nRead More", "url": "https://www.cnn.com/2020/04/01/business/carnival-cruise-debt-coronavirus/index.html"}