{"authors": [], "date_download": "2020-05-04 21:06:52", "date_modify": "2020-05-04 21:06:52", "date_publish": "2020-04-20 14:05:56", "description": "ANCHORAGE, Alaska (AP) — Protesters in Anchorage have demanded that the mayor to shut down a homeless camp they say is contributing to crime and threatening public health during the coronavirus...", "filename": "_f078a638457ab926e072a93386380f73_1588626412.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f078a638457ab926e072a93386380f73_1588626412.html", "title": "Protesters demand closure of Anchorage homeless camp", "title_page": "Protesters demand closure of Anchorage homeless camp", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ANCHORAGE, Alaska (AP) — Protesters in Anchorage have demanded that the mayor to shut down a homeless camp they say is contributing to crime and threatening public health during the coronavirus pandemic.\nA group of 25 demonstrators gathered Friday across from the camp included people who live, work or own businesses nearby, The Anchorage Daily News reported Saturday.\nThe group called for Municipality of Anchorage Democratic Mayor Ethan Berkowitz to close the camp as part of the enforcement of a statewide order to remain in place to slow the spread of the COVID-19 virus.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.\nPeople camping outside are a “difficult population” to deal with, but police are stepping up patrols and Berkowitz said he is listening to the recommendations of frustrated residents.\n“We are doing what we can to reduce the number of people who are engaged in conduct that is criminal and if there is a crime that has been reported to (Anchorage Police Department),” Berkowitz said.\nProtester Tim Weeks, owner of beverage company Paragon Distributing, said officials “need to start enforcing the law” with homeless people.\n“The police are pulling people over for driving 60 miles an hour in a 55-mile-an-hour zone,” Weeks said.\nNancy Nolin said she no longer feels safe. Homeless people look in her windows and try to open her doors, she said.\nThe city spent large sums of money to safely house and feed hundreds of homeless residents in the Sullivan and Ben Boeke arenas, said Stephanie Rhoades, a retired judge.\nThe sports complex was converted into an emergency mass shelter in March capable of housing up to 480 people per night.\nAnchorage now has “more than sufficient shelter” for all of the city’s estimated 1,100 people experiencing homelessness, Rhoades said.\n“It really could not be clearer that some folks just want to live closely congregated and outdoors,” she said.", "url": "https://apnews.com/f078a638457ab926e072a93386380f73"}