{"authors": ["Jeffrey Collins"], "date_download": "2020-05-04 20:13:27", "date_modify": "2020-05-04 20:13:27", "date_publish": "2020-04-09 19:20:03", "description": "COLUMBIA, S.C. (AP) — The best estimate at the moment is South Carolina's budget will lose more than $1 billion estimated to be in next year's budget because of the coronavirus. Predictions...", "filename": "_20ec2785189de69cbbbeb3adad94540a_1588623207.html", "image_url": "https://storage.googleapis.com/afs-prod/media/98c4e33623dc40c7b15404db42ada3c6/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_20ec2785189de69cbbbeb3adad94540a_1588623207.html", "title": "Economists estimate SC to lose $1B in revenue from COVID-19", "title_page": "Economists estimate SC to lose $1B in revenue from COVID-19", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "House Ways and Means Committee Chairman Murrell Smith, center, answers a question from state Rep. Nancy Mace, right, on the House floor during a special, one-day session of the South Carolina Legislature on Wednesday, April 8, 2020, in Columbia, S.C. This year's session has been paused for several weeks amid the new coronavirus outbreak. (AP Photo/Meg Kinnard)\nHouse Ways and Means Committee Chairman Murrell Smith, center, answers a question from state Rep. Nancy Mace, right, on the House floor during a special, one-day session of the South Carolina Legislature on Wednesday, April 8, 2020, in Columbia, S.C. This year's session has been paused for several weeks amid the new coronavirus outbreak. (AP Photo/Meg Kinnard)\nCOLUMBIA, S.C. (AP) — The best estimate at the moment is South Carolina’s budget will lose more than $1 billion estimated to be in next year’s budget because of the coronavirus .\nPredictions in February were the state would have $1.9 billion extra in the spending plan starting July 1. That estimate of extra revenue is now reduced to about $700 million, state officials said Thursday.\nBut the economists warned the projections , which are at the best of times educated guesses, have even more uncertainty in the time of COVID-19.\nThere are few hard figures to put into the models — tax payments haven’t been reported and the estimate was based on a 20% drop in the U.S. economy over three months of social isolating. Also, exactly how much help the federal government sends to states isn’t known yet.\nIf the isolation period lasts longer or the downturn is worse or Congress approves a lower stimulus than expected, the estimates on how much money South Carolina will have to spend will likely go down too, said state Revenue and Fiscal Affairs Office Executive Director Frank Rainwater, whose agency is responsible for predicting how much money lawmakers will have to spend.\n“We’re kind of flying in the dark here,” Rainwater said.\nNearly 181,000 people who live or work in South Carolina have made unemployment claims in the past three weeks since the pandemic began shutting down restaurants, bars, manufacturers, dentist offices and a number of other businesses across the state. In January, South Carolina’s unemployment rate was 2.4% with 56,500 people looking for a job.\nOne sliver of good news is taxes and fees collected by the state for this budget year have constantly been above the projections of Rainwater’s team. That appears to mean the COVID-19 downturn won’t blow a hole in this year’s budget.\nBut the 2020-21 budget, already passed by the House , is predicted to lose nearly 60% of the additional money it had when first written.\nSo many plans will have to be altered. The House budget, backed by Gov. Henry McMaster, included $213 million to give every public school teacher in South Carolina a $3,000 raise, $100 million for repairs to rural highways, $100 million to improve safety at state prisons and $248 million in income tax relief and credits.\nLawmakers agree they can’t finish a new budget with this much uncertainty before the spending plans starts July 1. Rainwater pointed out delays in income tax filing deadlines mean the state may not know how much it will have to spend until the end of the summer.\nThe General Assembly currently plans to return in September and finish the budget. They failed on Wednesday to finalize a bill to allow the state government to keep spending at current levels after the current fiscal year ends June 30. Without that bill or a budget, state government would shut down.\nThe House and Senate passed different versions of the spending bill, differing on how to treat Santee Cooper as they debate the future of the state-owned utility.\nSome senators and leadership in the House appeared frustrated. One side will have to give in for the bill to pass, but neither set a date to return to session.\nThe last time South Carolina faced anything like this was the Great Recession of 2008, where the amount of money in the state budget controlled by lawmakers fell 25% from $7.4 billion to $5.5 billion in two years.\nThere were massive cuts, some done quickly in the middle of the budget year. Problems still hanging around South Carolina in 2020 like security issues at state prisons, the poor condition of South Carolina’s roads and the ballooning of class sizes can be traced back to those cuts, state agency leaders have said.\n___\nFollow Jeffrey Collins on Twitter at http//twitter.com/JSCollinsAP .", "url": "https://apnews.com/20ec2785189de69cbbbeb3adad94540a"}