{"authors": ["Opinion John Kirby", "Cnn National Security Analyst"], "date_download": "2020-05-04 16:17:04", "date_modify": "2020-05-04 16:17:04", "date_publish": "2020-04-03 22:19:49", "description": "John Kirby writes that when Thomas Modly, acting secretary of the Navy, removed Capt. Brett Crozier of the USS Theodore Roosevelt, it was unwarranted, reckless in its timing and petty in appearances. And Modly's decision could have a chilling effect on other commanding officers in similar circumstances.", "filename": "2020_04_03_opinions_uss-the_054d9df6c098c499bf6c5162dc9ddf52_index_1588609024.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327101147-uss-theodore-roosevelt-03182020-super-tease.jpeg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_opinions_uss-the_054d9df6c098c499bf6c5162dc9ddf52_index_1588609024.html", "title": "Removing the USS Theodore Roosevelt captain was reckless and foolish", "title_page": "Removing the USS Theodore Roosevelt captain was reckless and foolish (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN national security analyst John Kirby, a retired rear admiral in the US Navy, was a spokesman for both the State and Defense Departments in the Obama administration. The opinions expressed in this commentary are his own. View more opinion articles on CNN.\nOn Monday, Crozier sent an unclassified email to Navy officials, copying some 20 to 30 people, that detailed the actions he believed were necessary to stem the spread of coronavirus aboard his ship. More than 100 sailors aboard the nuclear-powered aircraft carrier have become ill , and Navy officials are desperately trying to remove most of the rest of the crew to hotels ashore in Guam, where the ship is now docked.\nCrozier's impassioned memo leaked to the San Francisco Chronicle on Tuesday and was soon circulating widely on social media.\nModly claimed Crozier was not being removed because of the leak, but rather for allowing \"the complexity of his challenge with the Covid breakout on the ship to overwhelm his ability to act professionally when acting professionally was what was needed the most at the time.\"\nBut the acting secretary of the Navy did little else to prove his case. It was an unwarranted firing, reckless in its timing and petty in appearances. And Modly's decision to dismiss Crozier could have a chilling effect on other commanding officers in similar circumstances, making them fearful of speaking up and thereby negatively impacting the Navy's ability to combat the deadly disease.\nTo be fair, while Modly took issue with the accuracy of some of concerns the captain outlined in his note, he admitted Crozier \"was absolutely correct in raising them.\" The acting secretary's chief complaint appears to be over Crozier's use of non-secure email to convey those concerns and that the email did not flow cleanly up the chain of command.\nAccording to Modly, Crozier failed to inform his immediate superior in the chain of command, the strike group commander, before sending along his note. (Crozier has not yet commented on his removal.)\nHe also copied too many people on it. \"He sent it out pretty broadly,\" Modly told reporters , and in sending it out broadly he did not take care to ensure that it couldn't be leaked, and that's part of his responsibility, in my opinion.\"\nFair enough. If Modly's version of events bears out, Crozier would certainly be guilty of a process foul. Typically, this kind of communication would be handled over a secure network, and the rear admiral embarked aboard the ship -- Crozier's boss -- would have been in the loop.\nBut we've seen no evidence that others in Crozier's chain of command were similarly bypassed or even surprised by its contents. We've seen no evidence that he sent a \"blast-out email\" to everyone he knows. And we've seen no public evidence that Crozier leaked the email to the media or was even aware that it had been provided to the San Francisco Chronicle.\nWe've seen none of this evidence, because either Modly would not share those details or because he does not possess them.\nThe Navy announced that it has launched an internal investigation into the matter. It would have been better for Modly to let that investigation take its course, while he and Crozier's chain of command focused on addressing the ship's needs and the health and welfare of the Theodore Roosevelt crew.\nIf information comes to light that Crozier encouraged or caused the public disclosure of what should have been a confidential exchange of information to his leadership, then Modly's lack of trust and confidence in Crozier's command ability would certainly be justified.\nBut dismissing a leader — whom even Modly acknowledged Crozier loves his crew and had them \"at the center of his heart and mind in every decision that he has made\" — right in the middle of a potentially deadly epidemic aboard his ship only risks escalating the fear and uncertainty those sailors and their families are enduring right now and potentially distracts Navy officials from what should be the overarching task at hand.\nIt also sends a horrible message to other commanding officers about the degree to which they can be candid about their efforts to stop the spread of coronavirus in their units.\nOn Wednesday of this week — just the day prior to Crozier's firing — both Modly and the Navy's top officer, Adm. Michael Gilday, stressed to reporters at the Pentagon that they wanted to maintain an open line of communication.\n\"We're not looking to shoot the messenger here,\" Gilday said. \"We want to get this right.\"\nI fear that what Navy leaders are now going to get is something much less than candid feedback and accurate information, and that is most assuredly not right.\nThe issue of trust and confidence lies at the very heart of naval leadership. When an officer loses the trust and confidence of a superior, that officer should have every expectation of either stepping aside or being pushed aside.\nBut Modly did nothing to convince anyone that his loss of trust and confidence in Crozier was merited by the facts as we — or even he — now knows them.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nAbsent a more complete understanding of the circumstances around Crozier's conduct in this matter, we are left to conclude that the captain may have been fired because of the embarrassment his email caused the Trump administration rather than for any real transgression or failing of leadership.\nWhen he disembarked the carrier on Thursday, Crozier's crew gave him a rousing and emotional send-off. Video of that send-off is going viral on social media, with its loud applause, cheers and chants of Crozier's name.\nThose sailors aren't just sending a message to their captain; they are sending a message to Modly. And if I were him, I'd be much more embarrassed about that.", "url": "https://www.cnn.com/2020/04/03/opinions/uss-theodore-roosevelt-captain-removal-reckless-kirby/index.html"}