{"authors": ["Breaking News Reporter"], "date_download": "2020-05-04 20:19:49", "date_modify": "2020-05-04 20:19:49", "date_publish": "2020-04-28 15:00:53", "description": "“She tried to do her job, and it killed her,” Dr. Lorna Breen's father said of her tireless work on the front lines of the pandemic.", "filename": "entry_nyc-doctor-lorna-breen-coronavirus_n_5ea81bf7c5b6085825792fb2_1588623589.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8483e240000eb008e9df9.jpeg?cache=vb6siu1kxm&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_nyc-doctor-lorna-breen-coronavirus_n_5ea81bf7c5b6085825792fb2_1588623589.html", "title": "ER Doctor Who Treated NYC Coronavirus Patients Dies By Suicide", "title_page": "ER Doctor Who Treated NYC Coronavirus Patients Dies By Suicide | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "A top New York City emergency room doctor who had been working on the front lines of the coronavirus pandemic has died by suicide, authorities said.\nDr. Lorna Breen, who served as the medical director of the emergency department at New York-Presbyterian Allen Hospital in Manhattan, died Sunday in Charlottesville, Virginia, where she was staying with family, her father told The New York Times﻿.\n“She tried to do her job, and it killed her,” her father, Dr. Philip C. Breen, told the Times.\nNewYork-Presbyterian/Columbia Dr. Lorna Breen served as the medical director of the emergency department at New York-Presbyterian Allen Hospital in Manhattan.\nThe elder Breen said his daughter, 49, had contracted the coronavirus and went back to work after about a week and a half of recovery. She was sent home again by the hospital and then her family intervened to bring her to Charlottesville.\nHe said she didn’t have a history of mental illness but that the last time they spoke she sounded detached as though something was wrong. This followed her recalling some of the challenges of her work in New York, which has seen more coronavirus cases than anywhere else in the country, including patients dying before they could be taken out of ambulances.\nHer father praised her as one of the pandemic’s heroes, as did her hospital.\n“Dr. Breen is a hero who brought the highest ideals of medicine to the challenging front lines of the emergency department,” a hospital spokesperson said in a statement. “Our focus today is to provide support to her family, friends, and colleagues as they cope with this news during what is already an extraordinarily difficult time.”\nCharlottesville police, which confirmed her death from self-inflicted injuries, emphasized the extreme toll that health care professionals and first responders are under amid the pandemic, which has killed more than 53,000 people so far in the U.S., according to the Centers for Disease Control and Prevention.\n“On a daily basis, these professionals operate under the most stressful of circumstances, and the Coronavirus has introduced additional stressors,” said Charlottesville Police Chief RaShall Brackney in a statement. “Personal Protective Equipment (PPE) can reduce the likelihood of being infected, but ... they cannot protect heroes like Dr. Lorna Breen, or our first responders against is the emotional and mental devastation caused by this disease.”\nIf you or someone you know needs help, call 1-800-273-8255 for the National Suicide Prevention Lifeline. You can also text HOME to 741-741 for free, 24-hour support from the Crisis Text Line. Outside of the U.S., please visit the International Association for Suicide Prevention for a database of resources.", "url": "https://www.huffpost.com/entry/nyc-doctor-lorna-breen-coronavirus_n_5ea81bf7c5b6085825792fb2"}