{"authors": ["Jonathan Lemire", "Marina Villeneuve", "Zeke Miller"], "date_download": "2020-05-04 20:28:15", "date_modify": "2020-05-04 20:28:15", "date_publish": "2020-04-20 13:49:47", "description": "WASHINGTON (AP) — Their back-and-forth during the coronavirus pandemic has included insults, sharply contrasting views on the role of the federal government and some moments of mutual admiration....", "filename": "_1ebcb6d67bb42879bf5ca2fbb7bc4a5d_1588624095.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8c3e2174bb7e42a9902584a3b83225f8/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1ebcb6d67bb42879bf5ca2fbb7bc4a5d_1588624095.html", "title": "Cuomo, Trump ready to meet after trading virus barbs, praise", "title_page": "Cuomo, Trump ready to meet after trading virus barbs, praise", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Vice President Mike Pence, right, and President Donald Trump watch a video of New York Gov. Andrew Cuomo speaking during a coronavirus task force briefing at the White House, Sunday, April 19, 2020, in Washington. (AP Photo/Patrick Semansky)\nVice President Mike Pence, right, and President Donald Trump watch a video of New York Gov. Andrew Cuomo speaking during a coronavirus task force briefing at the White House, Sunday, April 19, 2020, in Washington. (AP Photo/Patrick Semansky)\nWASHINGTON (AP) — Their back-and-forth during the coronavirus pandemic has included insults, sharply contrasting views on the role of the federal government and some moments of mutual admiration.\nNow President Donald Trump and New York Gov. Andrew Cuomo will meet face-to-face Tuesday for the first time since the global crisis began.\nAhead of their Oval Office meeting, Cuomo said he wanted to discuss the need for more federal help in increasing testing capacity — a persistent sticking point between the governors and Washington.\nCuomo said Trump is right in saying that “states should take the lead” on testing, but the federal government needs to manage the flow of supplies from abroad while governors are “trying to put together their testing protocol in their state.”\n“I think in many ways we’re talking past each other,” Cuomo said.\nDespite well-documented shortages of testing supplies, Trump and White House aides have insisted that states have enough test capacity to move ahead with the first phase of efforts to reopen their economies.\nThe hot-and-cold relationship between Trump and Cuomo has been on full display in their respective briefings and Twitter posts during the crisis. In recent days, Trump has admonished Cuomo to “do your job.” Cuomo, in turn, has questioned Trump’s grasp of the Constitution and suggested the president is trying to act like a “king.”\nFor all of that, though, Trump said Monday that “we, believe it or not, have — we get along. Okay?”\nHe added that Cuomo had been “very generous” with recent praise.\nThrough daily briefings and scores of media appearances, Cuomo has in many ways emerged as the Democratic face of the response to the pandemic. With the party’s likely presidential nominee, Joe Biden, largely sidelined at his Delaware home, Cuomo has become one of several governors thrust into the spotlight as the pandemic has forced a reordering of American life.\nAs Cuomo conducts briefings from New York, he has vacillated between being Trump’s foil and his unlikely ally. The two Queens natives — they grew up just a few neighborhoods apart — have traded barbs on Twitter but also consulted in late-night phone calls.\nAsked if he’s had to walk a “fine line” in dealing with the president, Cuomo said: “Life is a fine line.”\n“He has no problem telling me when he disagrees,” Cuomo told reporters Tuesday before departing for Washington. “And he tells me when he agrees. I have no problem telling him when I disagree and when I agree.”\nCuomo, according to aides, has deliberately used both the carrot and the stick in dealing with a president who is extremely sensitive about his media image and how governors respond to him.\nAt times, he has preemptively praised the president on cable news hits, trying to gently persuade him to do more. He has made a point of thanking Trump — resulting in video clips that the president has eagerly showed off in the White House briefing room in recent days.\nBut at other times, Cuomo has shown no hesitation to lace into the president, including during a recent monologue in which he urged Trump to stop watching television and to “get back to work” safeguarding American lives during the pandemic.\nFull Coverage: Virus Outbreak\nTrump often catches at least some of Cuomo’s daily briefings and has expressed annoyance to aides at the positive press that the governor has received, according to advisers. He has reveled in the bits of praise he has received from Cuomo — and other Democratic governors.\nCuomo and other governors are also pushing for $500 billion in unrestricted aid from the federal government for states to offset revenue shortfalls resulting from the outbreak.\nThe Senate is nearing agreement on a nearly $500 billion coronavirus aid package for small businesses, including additional help for hospitals and virus testing. Cuomo said he was disappointed it didn’t include direct aid for states.\n“I think it’s a terrible mistake not to provide funding for the states,” Cuomo said. “I get small businesses, I get airlines. How about police? How about fire? How about health care workers? How about teachers?”\n___\nLemire reported from New York and Villeneuve from Albany. Associated Press writer Aamer Madhani in Chicago contributed to this article.\n—-\nFollow AP coverage of the pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/1ebcb6d67bb42879bf5ca2fbb7bc4a5d"}