{"authors": ["Anneken Tappe", "Cnn Business"], "date_download": "2020-05-04 16:08:06", "date_modify": "2020-05-04 16:08:06", "date_publish": "2020-04-02 12:32:06", "description": "The last three weeks have marked one of the most devastating periods in history for the American job market, as first-time claims for unemployment benefits have surged more than 3,000% since early March.", "filename": "2020_04_02_economy_unemployment-benefits-coronavirus_index_1588608486.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402085921-empty-boardwalk-lower-manhattan-0328-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_economy_unemployment-benefits-coronavirus_index_1588608486.html", "title": "A 3,000% jump in jobless claims has devastated the US job market", "title_page": "Unemployment benefits: 6.6 million Americans filed initial jobless claims last week as coronavirus takes toll on job markets - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) The last three weeks have marked one of the most devastating periods in history for the American job market, as first-time claims for unemployment benefits have surged more than 3,000% since early March.\n6.6 million US workers filed for their first week of unemployment benefits in the week ending March 28, according to the Department of Labor — a new historic high.\nThat was far greater than economists had expected, and more than 3,000% the pre-pandemic levels. Unemployment claims at this level suggest a severe job market decline hardly any American alive has ever seen in their lifetimes.\nIncluding the prior week's 3.3 million initial claims , Americans have filed nearly 10 million jobless claims in the last two weeks alone.\nThat corresponds to roughly 6% of America's 165 million strong work force, which in turn implies a 9.5% unemployment rate, according to Citi economist Andrew Hollenhorst.\n\"Further job loss expected in coming weeks is very likely to push unemployment above 10%, even taking account of a potential steep decline in the labor force participation rate, as some displaced workers are neither furloughed nor looking for work,\" Hollenhorst wrote in a note.\nThe rules of who can file for unemployment benefits vary by state. But in the face of the coronavirus outbreak, the government has waived some restrictions. Independent contractors and self-employed people, for example, who don't usually qualify, can now temporarily receive benefits through a pandemic unemployment assistance program Congress created.\nWhether this week's massive claims number was the worst of it remains to be seen. Ahead of the coronavirus outbreak, weekly first-time claims had been hovering in the low 200,000s.\nThis \"tectonic shift\" in the US labor market \"implied a real-time unemployment rate of 10.1% at a minimum,\" said Joseph Brusuelas, chief economist at RSM.\nAs companies continue to close their doors and shed workers to limit the spread of coronavirus throughout the population, more workers will need government aid to make ends meet.\nBrusuelas said in his view, the Trump administration should work on a next-phase fiscal aid package to \"target plugging the holes that are being blown in state and local budgets, in addition to Federal Reserve purchases of state and municipal debt.\" The government passed the CARES Act to combat the effects from the coronavirus outbreak last week.\nThe March jobs report , which is due Friday at 8:30 am ET, is not expected to look quite as dire . The Refinitiv consensus estimate is for a loss of 100,000 jobs, with the unemployment rate inching up to 3.8%, from its historic low of 3.5%.\nThe March report will be more muted because the survey it is based on concludes around the middle of the month -- which was before millions of Americans filed for unemployment benefits for the first time.", "url": "https://www.cnn.com/2020/04/02/economy/unemployment-benefits-coronavirus/index.html"}