{"authors": [], "date_download": "2020-05-04 20:29:04", "date_modify": "2020-05-04 20:29:04", "date_publish": "2020-04-20 17:51:56", "description": "BOISE, Idaho (AP) — With students completing school work remotely during the coronavirus pandemic, officials say more youths are filling their days by doing farm labor and other agricultural jobs....", "filename": "_2d3e8925b7629fbd838598e008fb1e36_1588624144.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2d3e8925b7629fbd838598e008fb1e36_1588624144.html", "title": "With schools closed, more Idaho students start farm jobs", "title_page": "With schools closed, more Idaho students start farm jobs", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BOISE, Idaho (AP) — With students completing school work remotely during the coronavirus pandemic, officials say more youths are filling their days by doing farm labor and other agricultural jobs.\nEducators and farm-worker advocates are worried that could take a toll on students’ education and health, the Idaho Statesman and Idaho Ed News reports.\nEstimates from child advocacy groups and the Child Agricultural Injury Survey say about 500,000 kids under 18 were working in U.S. agriculture jobs, based on data taken before the pandemic. The majority of child work-related fatalities occur in agricultural jobs, according to a 2018 U.S. Government Accountability Office report, as kids can encounter pesticide exposure, dangerous equipment or extreme temperatures.\n“This is definitely a concern,” said Sarah Seamount, migrant education coordinator for the Idaho State Department of Education. “Although these students are not at school, they are still in school and are expected to continue their education during this soft closure, just like all Idaho public school students.”\nAmerican Falls High School senior Edwin Hernandez brings his Chromebook laptop with him to the fields when he goes to his rock-picking job. He and two 17-year-old friends, Rafael Villa and Edwin Soltero, picked up the jobs pulling heavy rocks out of fields to clear the way for farming after Idaho school officials announced that school buildings would be closed.\n“Rafael called me and said: ’Do you want to pick up some rocks?”” Soltero said. “Of course I said yes, because I’ve got nothing else to do.”\nHernandez sits in the cab of a work truck when he logs into his classes. Most of his classmates log in from living rooms or bedrooms.\n“It makes me smile when kids are literally on their lunch break, making an effort to join the conversation,” Hernandez’ government teacher Caroline Wight said. “You just don’t know if you can push and ask ‘should you really be working?’ or not. It’s a family, a student’s choice. With some kids, I know that this is really necessary for their family.”\nThe American Falls teens have mixed experiences with their new class schedules. Villa says he doesn’t have too much homework and rarely has to stay up late to get it done. Soltero tries to save his for the weekends. Hernandez often works into the night, occasionally turning assignments in late.\n“I feel like I’m not learning anything,” Hernandez said. “It’s way different having a teacher in front of you than having meetings online and learning by yourself.”\nStill he doesn’t plan to give up his agriculture job. The $10.50 an hour will help pay for college expenses when he enrolls at Idaho State University next fall, he said.\n“Work can get in my way, but also I need the money,” he said. “I can handle it.”\nHarold Nevill, administrator for the Canyon-Owyhee School Service Agency, estimates that 30 to 50 percent of his students are working. Some are mechanics or working in health care. But most of his students are in the hop fields.\n“These are not insignificant numbers,” Nevill said. “And we are not alone.”\nMigrant education coordinators report that young people are sorting onions, cutting potato seed or at home taking care of younger siblings while their parents work these essential jobs.\nOfficials worry that students as young as 12 or 13 may start joining their families in the fields as childcare gets scarce and economic hardship increases. Federal labor laws make it legal for them to do so, as long as they have a parent with them or written permission. Older teens have fewer restrictions.\nEstimates from child advocacy groups and the Child Agricultural Injury Survey say about 500,000 children under 18 are working in U.S. agriculture jobs.\nIrma Morin, CEO of the Community Council of Idaho, said she’s worried that migrant parents will struggle to find childcare if Migrant and Seasonal Head Start centers remain closed. Liaisons in the state migrant education program say some students are going to work in agriculture with their parents because nobody can stay home with them.", "url": "https://apnews.com/2d3e8925b7629fbd838598e008fb1e36"}