{"authors": ["Jeremy Diamond", "Kevin Liptak"], "date_download": "2020-05-04 15:57:38", "date_modify": "2020-05-04 15:57:38", "date_publish": "2020-04-07 19:46:24", "description": "When President Donald Trump's hawkish trade adviser Peter Navarro warned in a late January internal memo that an outbreak of coronavirus in China could become a \"full-blown pandemic,\" many top White House officials dismissed Navarro's warnings as alarmist. The President, for his part, continued to minimize the threat.", "filename": "2020_04_07_politics_peter-n_bdf46ed62f26a35ecaebf051d630bdf9_index_1588607858.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407004919-peter-navarro-march-27-01-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_peter-n_bdf46ed62f26a35ecaebf051d630bdf9_index_1588607858.html", "title": "How Peter Navarro went from an anti-China 'gadfly' to trusted Trump coronavirus adviser", "title_page": "How Peter Navarro went from an anti-China 'gadfly' to trusted Trump coronavirus adviser - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "More than two months later, Navarro finds himself with a prominent role helping Trump speed the delivery of critical medical supplies and an influential perch at his side to tout an unproven treatment for the disease, picking a fight with the nation's top infectious disease expert, Dr. Anthony Fauci . This time, Trump is on the same page as Navarro, ardently championing the drug, hydroxychloroquine, before clinical trials can prove or disprove its merits for treating coronavirus.\nNavarro is just one player in the whole-of-government response to the coronavirus pandemic, but his ascent is emblematic of Trump's constantly shifting response to the crisis and the extent to which Trump is embracing a wide array of voices -- and the infighting that inevitably ensues -- as he lurches from one view of this pandemic to the next. Internal divisions, competing interests and presidential indecision have all been hallmarks of Trump's West Wing culture since its beginning, but never have they carried such life-or-death consequences.\nNavarro, a prominent China hawk whose protectionist views and abrasive demeanor have earned him a full slate of enemies, now finds himself more empowered than at any time in his three-year White House tenure. While he still remains on the fringes of the President's economic team, the caustic trade adviser faces fewer roadblocks to influencing policy discussions and more top officials willing to give him a seat at the table. And with the stroke of Trump's pen, he has been empowered with legal authority as the Defense Production Act coordinator.\n\"Two or three years ago he was totally excluded, totally kept in a box,\" one administration official said, comparing him to a \"gadfly.\" \"Now, he's in the Oval all the time, he's on the podium at press briefings.\"\nWhen Navarro fired off his internal flare in late January, other White House officials dismissed his memo -- which focused exclusively on banning travel from China as a remedy -- as the latest anti-China musings of a man who considers almost every issue through that ideological lens. And while his worst-case scenario warning may now appear prescient -- trillions of dollars in economic losses and millions of Americans infected -- the trade adviser relied on only a few data points and no public health expertise to make his case.\nLess than a month later, as Trump continued to downplay the threat, Navarro warned that the risk of a pandemic was rising and urged the White House's coronavirus task force to secure billions in supplemental spending, according to two sources familiar with the second memo, one of whom provided a copy to CNN.\nTrump said Tuesday that he didn't see Navarro's coronavirus warning memos until a \"day or two\" ago but that he hadn't sought them out.\nAsked why he initially downplayed the coronavirus even as his adviser was warning of potential devastation, Trump said during his daily coronavirus briefing that he wasn't interested in causing panic.\n\"I'm not going to go out and start screaming, this could happen,\" Trump said. \"I'm a cheerleader for this country. I don't want to create havoc and shock.\"\nAsked about the memos on Tuesday, another Trump economic adviser, National Economic Council chairman Larry Kudlow, said he hadn't read them.\n\"Look, there are a lot of voices in the administration, some more urgent than others,\" he said.\nNot the only voice\nNavarro was not the only White House official firing off early warnings and many public health experts were voicing concerns at the time of both memos. But the memos are the latest piece of evidence that undercuts Trump's insistence at the time that the administration had the situation under control and his more recent claims that the pandemic the US now faces was \"unforeseen.\"\nThat in and of itself presents a risk for Navarro's status with Trump, a voracious TV news consumer who bridles at being contradicted or undermined by his aides.\nWhile Trump's increasingly sober response (in fits and starts) was largely driven by a combination of stock market nosedives, models predicting grim death tolls and political polling, Trump's views on hydroxychloroquine have been shaped by a kitchen cabinet of friends and advisers -- many of them devoid of any medical expertise -- who have touted the drug's benefits.\nDespite the public and private words of caution from Fauci, the top infectious disease expert, Trump continues to promote hydroxychloroquine as treatment for coronavirus, buoyed by the views of television personalities such as Dr. Mehmet Oz and of outside advisers such as his personal attorney Rudy Giuliani, according to people familiar with the matter.\nAnd despite lacking a medical background , Navarro has also become a forceful advocate for the treatment, pushing the drug in public and behind the scenes -- including during a heated disagreement in the Situation Room over the weekend in which Navarro feuded with Fauci, accusing him of not having supported the initial China travel restrictions even though Fauci has since publicly credited the decision as a helpful step.\nAsked Monday on CNN what qualifies him to weigh in on the medicine and challenge Fauci, Navarro -- who has a Ph.D. in economics -- noted that he is a \"social scientist\" who understands \"how to read statistical studies, whether it's the medicine, the law, economics or whatever.\"\nWhile the senior medical scientists brought into the White House push for decisions such as extending social distancing guidelines during spirited Situation Room meetings, Trump's political and economic advisers continue to wield their own influence in smaller Oval Office huddles, where ideas sometimes form quickly without the knowledge of the larger team.\nSome officials said the loose organization has allowed for quicker decision-making and action, including through a parallel effort headed by Trump's son-in-law Jared Kushner to leverage the private sector to procure more supplies.\nBroadening orbit\nBut other ideas, such as a potential mandatory quarantine for New York, New Jersey and Connecticut that Trump floated last weekend, seem to pop up at random without the input of the task force. Trump raised the idea after speaking with Florida's governor but was warned against the move by the medical professionals and eventually backed down.\nWith wide swaths of the White House workforce operating remotely and the number of outside visitors limited, Trump has accelerated his phone calls with an extended orbit of advisers and friends, not all of which are tracked by his aides. Trump has grasped at small glimmers of hope in an otherwise dire worldwide crisis, seeking to offer optimism even when the prognosis is unclear at best.\nIn his daily briefings, which have essentially replaced political rallies or engagements with reporters on the South Lawn, Trump has offered confusing public messaging that often upends what his task force has planned or what his officials have agreed upon behind the scenes. People familiar with the matter said it reflects the constant set of official and unofficial inputs, where Trump can chose what sounds best at any given moment.\nDuring a briefing Sunday, Trump resisted when a reporter asked Fauci to offer his opinion on the drug after Trump again recommended its use.\n\"You know how many times he's answered that question? Maybe 15 times,\" Trump said, refusing to allow Fauci to answer the question.\nThe moment served only to highlight the gap between the two men -- one a top doctor, the other a layman -- on the science behind the drug's effectiveness. Fauci has made his views known that hydroxychloroquine remains unproven to treat coronavirus, a public rebuttal of Trump that has caused some tension between the men.\nAs the White House once again begins to take on the Wild West feel of the early months of Trump's presidency, former North Carolina Rep. Mark Meadows has begun to settle into his role as chief of staff.\nMeadows, who officially arrived in the job last week, has so far not sought to cut down on the flow of information to the President, a tactic adopted by Trump's second chief of staff John Kelly but abandoned by his third, Mick Mulvaney. And he's not resisted Trump's desire to act as the official front-man for the federal response. Nor has he sought to challenge the first-among-equals status of Kushner and his wife Ivanka Trump, the President's daughter.\nMeadows was warned by multiple figures in Trump's orbit that Kushner and Ivanka Trump were a force to be reckoned with for any senior official in the White House, a former senior White House official said. Several congressional and White House sources told CNN that Meadows and Kushner get along well.\nA White House official said Meadows plans to strike a balance between Kelly -- who closely guarded Trump's schedule and the flow of information to him -- and Mulvaney, who embraced the chaos and \"Let Trump be Trump\" mantra.\nUnlike previous chiefs of staff in the Trump White House, administration officials said Meadows has not sought to block Navarro's access to Trump or his participation in key meetings. Kelly, meanwhile, worked with other officials to block Navarro from influencing trade discussions and demanded that Navarro copy him on all of his outgoing emails.\nKushner, arguably the most influential West Wing aide, has also embraced Navarro in his role leading medical supply chain efforts, according to three officials. Kushner has deployed Navarro as the \"bad cop\" in the sometimes contentious efforts to get medical supply companies to ramp up their production and supply of critical equipment.\nsenior administration official compared Navarro to a \"missile,\" saying \"like a missile, you just gotta make sure the missile is well-guided.\"\nHe has also found an ally in national security adviser Robert O'Brien, who shares some of Navarro's mistrust of China and who \"encourages Peter to play a larger role,\" according to an administration official -- a sharp contrast from how previous national security advisers treated Navarro.\n\"He finally has a constellation of people who are not just not openly hostile to him, but are friendly to him,\" the official said.", "url": "https://www.cnn.com/2020/04/07/politics/peter-navarro-coronavirus-white-house-china/index.html"}