{"authors": ["Kyle Hightower"], "date_download": "2020-05-04 20:17:42", "date_modify": "2020-05-04 20:17:42", "date_publish": "2020-04-06 15:30:27", "description": "With NBA games indefinitely on hold there has been a lot of discussion about postseason possibilities — including by coaches around the league. They're preparing for what a resumption of the...", "filename": "_b838f75062bd9042f02c9decec8a3a1a_1588623462.html", "image_url": "https://storage.googleapis.com/afs-prod/media/18099b7140a0400eaaf6cf6989b57f71/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b838f75062bd9042f02c9decec8a3a1a_1588623462.html", "title": "NBA coaches prepare for possible intriguing playoff matchups", "title_page": "NBA coaches prepare for possible intriguing playoff matchups", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Boston Celtics center Enes Kanter wears shoes with \"wash hands\" written on them during the second half of the team's NBA basketball game against the Indiana Pacers in Indianapolis, Tuesday, March 10, 2020. The Celtics won 114-111. (AP Photo/AJ Mast)\nBoston Celtics center Enes Kanter wears shoes with \"wash hands\" written on them during the second half of the team's NBA basketball game against the Indiana Pacers in Indianapolis, Tuesday, March 10, 2020. The Celtics won 114-111. (AP Photo/AJ Mast)\nWith NBA games indefinitely on hold there has been a lot of discussion about postseason possibilities — including by coaches around the league.\nThey’re preparing for what a resumption of the season that was shut down March 11 could look like in the wake of the coronavirus pandemic.\nToronto coach Nick Nurse said he’s trying to prepare for every possibility that would allow the Raptors a chance to defend their title.\nNBA coaches prepare for potential playoff matchups with season on hold.\nStory by @khightower >> https://t.co/p9fnaiVXDx\nWhat the matchups might look like >> https://t.co/DoLUTyjfbI pic.twitter.com/BJYLqnpR76 — AP Sports (@AP_Sports) April 7, 2020\n“We’re ready for whatever is thrown at us,” Nurse said recently during a conference call with reporters. “I don’t think it really matters. What matters is that we attack the title in whatever format it’s going to be presented in and we go for it.”\nNo one knows what will be thrown at the NBA or the rest of the sports world. Looking at guidelines from the Centers for Disease Control and Prevention, if NBA games do resume this season the calendar will play a major factor in how the league proceeds.\nThe ideas are many, from a shortened version of the remaining schedule played without fans to the very real possibility of jumping straight to the playoffs to ensure a season is completed before the end of summer.\nMilwaukee coach Mike Budenholzer said he has spent part of this hiatus studying the Orlando Magic and Brooklyn Nets — the Bucks’ two most likely first-round playoff foes — as well as other Eastern Conference teams.\nNurse had already begun thinking postseason before the season was suspended.\n“When we hit March 1, we’ve got a kind of playoff prepping plan thing that kicks in,” the Raptors coach said. “We spread the teams around our staff members and they prepare a pretty detailed couple of hour video sessions.\n“They would normally come into my office and start showing that to me one-on-one. It’s a two-hour video that we go through probably in about three hours on certain teams in the East and then a handful of them in the West as well.\n“The coaches were started in on that already and they’ll continue on that. The only difference is there’s no real one-one-one time with me yet. They’ll probably just have to send me their edit and then I’ll just have to watch them and talk to them on the phone.”\nThere would be several intriguing matchups if the NBA resumes the season with the start of the postseason . Nurse and Toronto would be the No. 2 seed in the East and would host No. 7 Brooklyn. Other matchups would be: No. 1 Milwaukee vs. No. 8 Orlando; No. 3 Boston vs No. 6 Philadelphia; No. 4 Miami vs No. 5 Indiana.\nIn the West: No. 1 LA Lakers vs No. 8 Memphis; No. 2 LA Clippers vs No. 7 Dallas, No. 3 Denver vs No. 6 Houston; No. 4 Utah vs No. 5 Oklahoma City.\nAs good as the matchups look on paper there could be some sloppy postseason basketball.\nCeltics center Enes Kanter estimates it would take a minimum two to three weeks for players to get their bodies in game shape. Part of the reason, he said, is the shear time players have had away from the court.\nKanter believes a second training camp-like period would probably be needed.\n“You can’t just say ‘OK, we’re going to play the games a week later.’ Some players are doing some things. Some players are in their apartments not doing anything,” Kanter said during a conference call. “We need to make sure everybody is doing their stuff and is in good shape to go out there and compete if we jump straight into playoffs.”\nKanter said a training camp setting would also help players refocus. He said while he’s staying in shape, he’s also taken up other endeavors to avoid going stir crazy such as reading, watching documentaries and teaching himself to cook and play the piano.\nIt is clear time is not the NBA’s friend.\nMonday marked the 26th day of the shutdown, a stoppage that has already cost the league more than 100 games. And the CDC is recommending that all in-person events involving 10 or more people be extended through the end of April as the U.S. fights the spread of the pandemic. That extends beyond the 30-day shutdown the NBA put in place March 11.\nKanter said if a decision is made to jump straight to the postseason, he hopes the length of the series won’t be affected.\n“We’re competitors, man. We want to go out there and push through and finish the season,” he said. “It’s crazy because we have a really good chance to go out there and get a championship. So, it’s like for sure you want to go out there and compete.”\n___\nAP correspondent Ian Harrison contributed to this report.\n___\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP_Sports", "url": "https://apnews.com/b838f75062bd9042f02c9decec8a3a1a"}