{"authors": ["Sherisse Pham", "Cnn Business"], "date_download": "2020-05-04 16:34:27", "date_modify": "2020-05-04 16:34:27", "date_publish": "2020-04-08 06:23:03", "description": "WeWork is suing SoftBank for abandoning a $3 billion share buyout, accusing the Japanese company of inventing reasons to back out of the plan, as financial losses mount and the Covid-19 pandemic worsens.", "filename": "2020_04_08_tech_wework-softbank-lawsuit_index_1588610067.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407214615-wework-softbank-lawsuit-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_tech_wework-softbank-lawsuit_index_1588610067.html", "title": "WeWork sues SoftBank for bailing on $3 billion share buyout agreed to in October", "title_page": "WeWork sues SoftBank for bailing on $3 billion share buyout agreed to in October - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Hong Kong (CNN Business) WeWork is suing SoftBank for abandoning a $3 billion share buyout and accusing the Japanese company of inventing reasons to back out of the plan, as financial pressure mounts and the Covid-19 pandemic worsens.\nThe tender offer was part of a rescue package agreed to late last year, when WeWork's botched IPO left it teetering on the edge of insolvency — until SoftBank stepped in with the bailout, worth roughly $10 billion at the time.\nSoftBank SFTBF In a lawsuit filed in the Delaware Court of Chancery on Tuesday, the special committee of WeWork's board saidand CEO Masayoshi Son are now suffering from \"buyer's remorse.\"\nIn a statement on Wednesday, SoftBank called the lawsuit \"a desperate and misguided attempt\" to rewrite last year's agreement, emphasizing again that the share purchase was subject to certain conditions.\nLast week, SoftBank listed several ways that WeWork failed to fulfill conditions required to complete the tender offer, including the existence of pending criminal and civil investigations into the office sharing company, global restrictions related to Covid-19 that are affecting WeWork's operations and the failure to restructure a joint venture in China.\nRead More", "url": "https://www.cnn.com/2020/04/08/tech/wework-softbank-lawsuit/index.html"}