{"authors": [], "date_download": "2020-05-04 20:18:19", "date_modify": "2020-05-04 20:18:19", "date_publish": "2020-04-15 15:50:32", "description": "LINCOLN, Neb. (AP) — Nebraska state government had better-than-expected tax collections in March despite a surge in unemployment and widespread hardship caused by the new coronavirus, according to...", "filename": "_bcb8740808f5de834c1c5d3c78920376_1588623499.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bcb8740808f5de834c1c5d3c78920376_1588623499.html", "title": "Nebraska tax collections up in March despite virus shutdowns", "title_page": "Nebraska tax collections up in March despite virus shutdowns", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LINCOLN, Neb. (AP) — Nebraska state government had better-than-expected tax collections in March despite a surge in unemployment and widespread hardship caused by the new coronavirus, according to a report released Wednesday.\nThe Nebraska Department of Revenue reported net tax collections of $380 million, which is about 12% higher than the projected forecast of $339 million.\nThe department said net individual and corporate income taxes, net sales-and-use taxes and net miscellaneous taxes were all higher than projected in March.\nNet tax collections are also higher than expected in the current fiscal year, which ends June 30. The state has received $3.656 billion so far, up nearly 9% from the certified forecast of $3.359 billion.\nDepartment of Revenue spokeswoman Lydia Brasch said the March numbers “are indicative of the state economy pre-COVID-19,” and next month’s report will likely show a different picture.\n“Those numbers will certainly change as a result of what’s happened across the state,” Brasch said.\nMembers of the Nebraska Economic Forecasting Advisory Board voiced concerns about the virus’ impact on the state at their last meeting in February. The board’s estimates help determine how much tax revenue state lawmakers and the governor have at their disposal.", "url": "https://apnews.com/bcb8740808f5de834c1c5d3c78920376"}