{"authors": ["David Pitt", "Ryan J. Foley"], "date_download": "2020-05-04 20:03:46", "date_modify": "2020-05-04 20:03:46", "date_publish": "2020-04-07 19:37:55", "description": "DES MOINES, Iowa (AP) — As the number of new coronavirus cases surged in Iowa, Gov. Kim Reynolds on Tuesday defended her use of a tool to help guide the state's response to the outbreak that...", "filename": "_320e323238a16e8214f94db81063ea22_1588622626.html", "image_url": "https://storage.googleapis.com/afs-prod/media/90faa8e569fa4798baa1c12a9527f56e/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_320e323238a16e8214f94db81063ea22_1588622626.html", "title": "Iowa governor defends outbreak tool attacked as arbitrary", "title_page": "Iowa governor defends outbreak tool attacked as arbitrary", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DES MOINES, Iowa (AP) — As the number of new coronavirus cases surged in Iowa, Gov. Kim Reynolds on Tuesday defended her use of a tool to help guide the state’s response to the outbreak that critics have called arbitrary and unscientific.\nThe matrix developed by the Iowa Department of Public Health looks at four data points in six regions of the state. If any one region hits 10 on a 12-point scale, the matrix calls for the potential implementation of a shelter-in-place order, a step Reynolds has resisted.\nCritics, including a top infectious disease researcher and other medical experts, argue that the data points are backward-looking rather than preventive because they trigger stricter interventions only after more people are infected and hospitalized.\nThe data points include the number of nursing homes with at least three residents who have tested positive, the percentage of cases requiring hospitalization, and the rate of cases per 100,000 people over the last two weeks.\nCritics say the point system seems arbitrarily devised and that it makes little sense to divide the state into six regions when the virus spreads easily and many people live and work in different zones. Making matters more confusing, the state has not released all of the underlying statistics that the points are based on, calling them confidential.\nAt her news conference Tuesday, Reynolds released some data on the state’s two hot zones for the virus: the northeast Iowa region that includes Cedar Rapids and the southeast region that includes Iowa City.\nThe two cities are 25 miles apart and make up an area known locally as the “corridor.” They are in different regions under the state’s tool, which is based on patterns of hospital use. Mayors and supervisors in both regions asked the governor to impose a shelter-in-place order.\nThe Cedar Rapids region has 50 patients hospitalized, including 27 in intensive care and 17 on ventilators, and included the only new death reported in the state Tuesday. By contrast, the Iowa City region had 20 patients hospitalized and three on ventilators.\nNonetheless, the Iowa City region had 9 points on the tool Tuesday while Cedar Rapids had 8, officials said. It wasn’t immediately clear why because the scoring wasn’t released.\nReynolds, a Republican, also did not say what steps she would order when a region hits 10 points, saying: “We are working on what that looks like.” She has argued that the school and business closures she has already ordered are the equivalent of a shelter-in-place order.\nReynolds said the tool was based on guidance from the Centers for Disease Control and developed by the state epidemiologist with input from other experts.\n“I believe this data. I believe in this strategy, I believe it’s the right way to move forward,” Reynolds said.\nThe governor said the tool showed that both regions have adequate numbers of hospital beds and ventilators available for patients.\nState Auditor Rob Sand said in a video posted online Tuesday that the governor hasn’t responded to his request for information about data underlying the tool’s use.\n“Relying on bad data or wrong data can be dangerous,” Sand, a Democrat, said. “This tool is being used to guide life and death decisions. Life and death decisions deserve answers, good ones. Instead, you the public have no answers to these questions.”\nReynolds reported that Iowa had 102 new cases of the virus, a single-day record increase that brought the total to 1,048. The illness has hospitalized 104 and resulted in another death for a total of 26.", "url": "https://apnews.com/320e323238a16e8214f94db81063ea22"}