{"authors": ["Dan Sewell"], "date_download": "2020-05-04 20:19:16", "date_modify": "2020-05-04 20:19:16", "date_publish": "2020-04-07 20:03:33", "description": "CINCINNATI (AP) — Ohio’s most prominent Democrat on Tuesday endorsed former Vice President Joe Biden for president, with his state’s extended primary three weeks away. U.S. Sen. Sherrod...", "filename": "_9101ea7bb9bd14cb6203e444ba6b3cad_1588623556.html", "image_url": "https://storage.googleapis.com/afs-prod/media/2b1c03575286493d88f2cfe02d67dd8d/2000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9101ea7bb9bd14cb6203e444ba6b3cad_1588623556.html", "title": "Prominent Ohio Democrat Brown endorses Biden for president", "title_page": "Prominent Ohio Democrat Brown endorses Biden for president", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE – In this Sept. 5, 2011 file photo, Vice President Joe Biden, left, speaks with Sen. Sherrod Brown, D-Ohio, at an AFL-CIO Labor Day picnic at Coney Island in Cincinnati. Brown, Ohio's most prominent Democrat, endorsed Biden for president on Tuesday, April 7, 2020, with his state's extended primary three weeks away. (AP Photo/Al Behrman, File)\nFILE – In this Sept. 5, 2011 file photo, Vice President Joe Biden, left, speaks with Sen. Sherrod Brown, D-Ohio, at an AFL-CIO Labor Day picnic at Coney Island in Cincinnati. Brown, Ohio's most prominent Democrat, endorsed Biden for president on Tuesday, April 7, 2020, with his state's extended primary three weeks away. (AP Photo/Al Behrman, File)\nCINCINNATI (AP) — Ohio’s most prominent Democrat on Tuesday endorsed former Vice President Joe Biden for president, with his state’s extended primary three weeks away.\nU.S. Sen. Sherrod Brown said in a statement that Biden fights for Americans who are working hard but struggling to achieve better lives, supporting what Brown calls the “dignity of work.”\n“And as we face both a public health crisis and an economy in turmoil, we need a steady hand more than ever,” Brown said.\nVermont Sen. Bernie Sanders’ campaign declined to comment. While Sanders and Brown have often been aligned in Washington, Brown also endorsed Hillary Clinton over Sanders in the 2016 presidential race.\nOhio’s public health director stepped in hours before the original March 17 primary date to stop the voting because of the coronavirus threat. After legal and political battles, the primary is continuing, nearly all by mail, through April 28.\nRepublicans have dominated statewide races in recent years in Ohio, which Republican President Donald Trump won by an 8-point margin in 2016.\nBrown, 67, has been the Democratic exception statewide, winning a third term in 2018 with 53% of the vote. He first won the seat by ousting GOP Sen. Mike DeWine in the 2006 elections. DeWine was elected governor in 2018.\nBrown, of Cleveland, considered running for the Democratic nomination himself before deciding against it.\n___\nFollow Dan Sewell at https://www.twitter.com/dansewell", "url": "https://apnews.com/9101ea7bb9bd14cb6203e444ba6b3cad"}