{"authors": ["Analysis Helen Regan"], "date_download": "2020-05-04 16:51:52", "date_modify": "2020-05-04 16:51:52", "date_publish": "2020-03-19 00:36:21", "description": "While the coronavirus pandemic and climate change are inherently different issues, they share two important characteristics: both are global crises that threaten the lives of millions of people.", "filename": "2020_03_18_world_coronaviru_0b77c62e1dae81a065a5c65fa5bd96df_index_1588611112.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200319082514-climate-crisis-01-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_18_world_coronaviru_0b77c62e1dae81a065a5c65fa5bd96df_index_1588611112.html", "title": "The world is coming together to fight coronavirus. It can do the same for the climate crisis", "title_page": "The world is coming together to fight coronavirus. It can do the same for the climate crisis - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "This story was originally published on March 18 and has been updated to reflect the latest numbers on confirmed coronavirus cases and deaths from Johns Hopkins University's Coronavirus Resource Center.\n(CNN) While the coronavirus pandemic and climate change are inherently different issues, they share two important characteristics: both are global crises that threaten the lives of millions of people.\nYet only one crisis has inspired widespread, drastic action from countries across the globe.\nAs Covid-19 the disease caused by the virus, spreads, governments, businesses and individuals around the world have undertaken unprecedented measures akin to wartime efforts.\nCountrieshave been put into lockdown, schools closed, events canceled, factories shuttered, millionstold to work from home and emergency funds released. No economic cost has been too big to stem the spread of the disease.\nCoronavirus is proving that it is possible to make dramatic changes and economic sacrifices to save lives.\nFor decades, scientists have been demanding that climate crisis be taken this seriously. But despite numerous international agreements, governments have been slow to take action to reduce carbon emissions\n\"It actually hurts because it shows that at the national, or international level, if we need to take action we can. So why haven't we for climate? And not with words, with real actions,\" said Donna Green, associate professor at University of New South Wales's Climate Change Research Centre.\nHeat-trapping emissions from human activity keep rising air pollution continues to choke cities, and the world is on track to warm by 3°C above pre-industrial levels.\nSo why haven't governments done more to protect their citizens from the impact of climate change?\nClimate change is a global health crisis\nThe climate crisis is also a global health emergency.\nAir pollution kills 7 million people every year, according to the World Health Organization. A recent study found toxic air shortens lives worldwide by nearly three years on average. And the life of every child born today will be profoundly affected by climate change, according to another report\nThe novel coronavirus, discovered in China in mid-December, has so far killed more than 24,000 people, and infected more than 550,000 in 176 countries, according to the Johns Hopkins University , which is tracking cases reported by the WHO and additional sources.\nThe impact of the virus has been sudden and dramatic.\nThe toll of climate change is slow and steady -- but no less deadly.\nPart of the difference in the response to the two crises is that, for many people, the virus is more of an immediate, tangible threat. The virus is infecting people now and is the undisputed source of their illness.\n\"You can put a virus particle down a microscope and draw a picture of it, it looks scary. You can explain how in medical science, you can deal with that particular virus, develop a vaccine and take steps to respond,\" said Green.\nClimate crisis is not a virus. The illnesses it causes and dangers it poses come through a third party -- pollution, a flood, a drought -- giving climate crisis deniers an opportunity to argue they were caused by other factors.\nAnd for many people not on the front lines, climate crisis feels like a future problem.\n\"In terms of their lives, and this being an existential crisis, and a threat, I don't think that comes off as immediately as something like a pandemic,\" said Miro Korenha, co-founder of Our Daily Planet, a Washington DC-based environmental news platform. \"They hear climate change is something that might be off in the future, maybe it won't hit their community.\"\nActing quickly\nSouth Korea, for example, has one of the worst outbreaks outside of China but it moved fast to conduct widespread testing , and in recent weeks its caseloads have stabilized.\nThere are concerns that other countries, including the United States and United Kingdom, have been slow to act. A recent study by UK epidemiologists predicts that attempts to slow -- rather than actively halt, or suppress -- the novel coronavirus could overwhelm the number of intensive care hospital beds available and lead to about 250,000 deaths in the UK and more than one million in the US.\nThat lesson of preparedness applies to the climate crisis.\nCountries need to act quickly to mitigate against future worst-case climate scenarios, rather than waiting for the disaster to peak before acting.\nThey can do this by reducing emissions, developing green technology and implementing effective climate policies.\nWe know what must be done -- both to stop the spread of coronavirus and to fight climate change -- but many countries that produce the most heat-trapping gases are waiting until it is too late.\nJust as in some places, people have been slow to adopt the social distancing doctors are advising to fight the spread of the virus, not enough countries, especially those that produce the most heat-trapping gases, are taking significant action to slash emissions.\nWe have the tools\nOne of the unintended consequences of the drastic measures enforced by China during the coronavirus outbreak was a sharp drop in emissions.\nChina's air pollutant levels fell by about 20-30% in February as a result of the restrictions on industry and traffic, according to the Copernicus Atmosphere Monitoring Service.\nItaly, which has the largest outbreak outside of China and has enacted widespread shutdowns, has also seen a big decline in air pollution, specifically nitrogen dioxide emissions, according to the European Space Agency.\nTravel bans have grounded flights and removed the ability to travel -- a big contributor to heat-trapping emissions. And working from home experiments are showing that not everyone needs to travel to the office.\nsuddenly closing all factories and banning cars from roads is not a sustainable way to tackle climate change. Governments have expressed concerns about the impact of closures and restrictions of movement on their economies, and on Tuesday, credit-rating agency Most agree, however, thatsuddenly closing all factories and banning cars from roadsis not a sustainable way to tackle climate change.Governments have expressed concerns about the impact of closures and restrictions of movement on their economies, and on Tuesday, credit-rating agency S&P Global said that the virus has plunged the world into a global recession\nBut climate scientists say that adapting to climate change does not require radical shutdowns -- the technology needed to reduce emissions already exists. Renewable energy sources are a cost-effective alternative to fossil fuels, and making the switch makes economic sense.\n\"It's absolutely possible to completely transform our country and world economies in a way that's sustainable, in a way that would mitigate the risk,\" Green said.\nGetting political\nSo if we have the tools, what's stopping action?\nScientists say politics plays a bit part in decision making.\nHis administration has scrubbed references to climate change, renewable energy and similar topics on websites across the federal government. There is also a powerful fossil fuel lobby in the US.\nThis ignorance or denial of the science is hampering the response to both the climate crisis and coronavirus.\nIn the US, Trump and officials in his administration have been at odds with what health experts are saying about the virus. Trump claimed the coronavirus death rate is lower than 3.4% based on a \"hunch,\" undermining the World Health Organization's figures. He said that the number of coronavirus cases in the US would \"going very substantially down, not up,\" when the US Centers for Disease Control and Prevention said to expect more cases. And the President was contradicted by a health expert when he said a vaccine would be ready within a few months -- in reality, a vaccine could take a year or longer to develop.\n\"If the President can say something that's contrary to what the government's top scientists are saying, that's a really difficult and dangerous predicament,\" said Our Daily Planet's Korenha. \"The real danger here is that people stop trusting information [from] government scientists.\"\nThe need for government transparency and readily available public information is vital in stopping the coronavirus from overrunning countries.\nThe media also plays a big part in making sure the public gets the information it needs in a way that's easy to understand.\nThe coronavirus pandemic has taken over the 24-hour news cycle, with broadcast media running almost non-stop coverage in many countries. Viewers and readers are hungry for up-to-date coronavirus information to make informed decisions about their lives.\nThe demand for climate change information, however, hasn't been as urgent and big climate headlines have not garnered similar rolling coverage. A study by Media Matters found that the major US broadcast networks aired just 238 minutes of climate coverage last year, making up only 0.7% of overall output.\n\"If climate even got one tenth of (coronavirus) coverage, how that might change public perception, how people might realize that this is a threat to them?\" Korenha said.\nPivoting to the future\nCoronavirus has been a stress test for countries around the world, that has put devastating strains on economies and health systems\nAirlines are losing billions of dollars, thousands could lose their jobs, a global recession is around the corner and social isolation is upending daily life.\nBut this won't last forever. The emergency measures are short term -- until outbreaks are managed or a vaccine is developed.\nThe fight against the climate crisis is a long-term problem that requires completely rethinking many of our industries and ways of life. But the not responding will lead to a far worse alternative.\nClimate crisis will seriously disrupt economies , reduce food security and place greater strain on health services, as a warmer world means more disease, famine, deaths from natural disasters and pollution, as well as mental health problems.\nCoronavirus has shown that in order to avert the worst impacts of a global crisis, world leaders need to come together to make bold change. That means enacting policies, investing in innovative green technology, switching to clean energy and getting the public to change their daily habits.\nThe world has been given a trial run in global crisis management. It shouldn't waste it.", "url": "https://www.cnn.com/2020/03/18/world/coronavirus-and-climate-crisis-response-intl-hnk/index.html"}