{"authors": ["Hadas Gold", "Cnn Business"], "date_download": "2020-05-04 16:07:10", "date_modify": "2020-05-04 16:07:10", "date_publish": "2020-04-02 13:32:29", "description": "Some of the UK government's biggest cheerleaders are now tearing into it over its response to the coronavirus pandemic, slamming confusing and conflicting messaging from senior members of Boris Johnson's cabinet.", "filename": "2020_04_02_media_coronavirus-uk-media-briefings_index_1588608430.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402080722-downing-street-media-briefing-0104-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_media_coronavirus-uk-media-briefings_index_1588608430.html", "title": "Coronavirus UK government briefings slammed by media", "title_page": "Coronavirus UK government briefings slammed by media - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) Prime Minister Boris Johnson's government can typically find a safe space in the digital and print editions of many of the most popular British newspapers.\nBut some of the UK government's biggest cheerleaders are now tearing into it over its response to the coronavirus pandemic, slamming confusing and conflicting messaging from senior members of Johnson's cabinet.\nIn the crosshairs: The government's daily press conferences and the lack of a clearly articulated plan for boosting coronavirus testing capabilities. Only 2,000 frontline health care workers have so far been tested.\nWhile the daily Downing Street briefings were initially conducted with reporters in person, they've been held virtually for more than a week because of strict social-distancing rules. Reporters have to take part via video chat, making it harder for them to interrupt or challenge government ministers with followup questions.\nMost striking is ferocious criticism from The Telegraph, a supporter of the Conservative Party, Johnson's former employer and the one newspaper he could normally rely on to boost his government no matter the situation.", "url": "https://www.cnn.com/2020/04/02/media/coronavirus-uk-media-briefings/index.html"}