{"authors": ["Breaking News Reporter"], "date_download": "2020-05-04 20:31:58", "date_modify": "2020-05-04 20:31:58", "date_publish": "2020-04-30 16:52:05", "description": "\"I believe that it altered her brain and then she went back to the most horrific, unimaginable conditions,\" said Dr. Lorna Breen’s sister.", "filename": "entry_lorna-breen-family-on-covid-19-death_n_5eaad3e7c5b634687cb42e4a_1588624318.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8483e240000eb008e9df9.jpeg?cache=vb6siu1kxm&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_lorna-breen-family-on-covid-19-death_n_5eaad3e7c5b634687cb42e4a_1588624318.html", "title": "Family Of ER Doctor Who Died By Suicide Says COVID-19 Changed Her", "title_page": "Family Of ER Doctor Who Died By Suicide Says COVID-19 Changed Her | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "The family of a top New York City emergency room doctor who recently died by suicide is speaking out about the mental struggle health care workers are facing amid the coronavirus pandemic as well as the possibility that the virus may have “altered her brain” after she became infected herself.\nDr. Lorna Breen, who served as the medical director of the emergency department at New York-Presbyterian Allen Hospital in Manhattan, saw patients dying before they could be admitted and felt helpless over her inability to do more to help, her sister, Jennifer Feist, told NBC’s “Today.”\n“She said it was like Armageddon,” Feist recalled her sister’s description of the hospital located in the epicenter of the nation’s outbreak.\nNewYork-Presbyterian/Columbia Dr. Lorna M. Breen died on Sunday after working on the frontlines of the coronavirus at New York-Presbyterian Allen Hospital in Manhattan.\nBreen, 49, was working grueling 12-hour shifts that saw patient after patient die from COVID-19, the disease caused by the virus, when she contracted the disease herself, her sister said.\nBreen was sent home for a week and a half to recover. She then hurried back to help but was sent home again by the hospital, her father, Dr. Phiip C. Breen, previously told The New York Times.\n“She tried to do her job, and it killed her,” the elder Breen said.\nFeist said her sister eventually called her in distress, saying she couldn’t move from her chair, prompting family friends to help her travel from New York to Virginia where she was admitted to a hospital and then sent to Feist’s Charlottesville home to rest.\nFeist said she believes stress played a significant role in her sister’s self-destruction but that the disease may have done something to her physically as well.\n“I believe that it altered her brain and then she went back to the most horrific, unimaginable conditions,” she told NBC News.\nA recent study of 214 COVID-19 patients in Wuhan, China, found that one-third of them had neurological manifestations, including impaired consciousness and muscle injury. Similar symptoms and impairments, including strokes, have been reported in the U.S.\nIf you have a colleague or a friend who you think is suffering they probably are and you should reach out to that person. Jennifer Feist\nFeist said her sister’s brain will be studied for possible effects from the disease. In the meantime, the family hopes her death brings awareness to the serious mental health issues that health care workers are under and that such workers feel encouraged to seek help if it’s needed.\n“There’s a stigma. And I know my sister felt that she couldn’t sit down, she couldn’t stop working, and she certainly couldn’t tell anyone that she was struggling,” Feist said. “If you have a colleague or a friend who you think is suffering, they probably are, and you should reach out to that person.”\nIn Breen’s memory, her family has established a fundraiser to help provide mental health support to health care workers. Donations can be made to the Dr. Lorna Breen Heroes’ Fund by going to DrLornaBreen.com.\nIf you or someone you know needs help, call 1-800-273-8255 for the National Suicide Prevention Lifeline. You can also text HOME to 741-741 for free, 24-hour support from the Crisis Text Line. Outside of the U.S., please visit the International Association for Suicide Prevention for a database of resources.", "url": "https://www.huffpost.com/entry/lorna-breen-family-on-covid-19-death_n_5eaad3e7c5b634687cb42e4a"}