{"authors": ["Ben Westcott", "Nectar Gan"], "date_download": "2020-05-04 17:00:33", "date_modify": "2020-05-04 17:00:33", "date_publish": "2020-04-10 01:41:47", "description": "Every day, student Xiong Yanfei sits at her desk in her parent's small apartment in Wuhan, studying for the gaokao exam that could change the course of her life in the midst of the coronavirus pandemic.", "filename": "2020_04_09_asia_coronavirus-china-gaokao-student-intl-hnk_index_1588611633.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409184856-gaokao-2013-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_asia_coronavirus-china-gaokao-student-intl-hnk_index_1588611633.html", "title": "China's SARS generations now face the gaokao exam in a new pandemic", "title_page": "China's SARS generations now face the gaokao exam in a new pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Hong Kong (CNN) Every day, student Xiong Yanfei sits at her desk in her parent's small apartment in Wuhan, studying for an exam that could change the course of her life.\nShe starts at 8 a.m. and finishes at 11 p.m. Normally, at school she'd get little breaks between classes during the day, before coming home to revise. But for the past two months her city was on coronavirus lockdown, so she studied all day in front of her laptop until her eyes hurt.\n\"I'm quite anxious. The gaokao is really too important a turning point. A person's education background is really important. There are very few successful people who are not highly educated,\" Xiong said.\nEvery year, millions of high school students and vocational trainees across China sit the college entrance exam , known colloquially as the \" gaokao .\"\nStudents walk out from a schoolyard after finishing the first subject of the 2013 university entrance exam in Hefei, north China's Anhui province.\noverload them with work. Huge pressure is put on students to succeed, so much so that, in 2019, the Chinese government ordered parents and teachers to not\nOriginally scheduled for June, the Chinese government has delayed the exam by at least a month.\nAcross China, students and teachers are speculating on whether the deferral will help or hinder their grades. But for some the prospect of another month of study is already causing extreme anxiety.\n\"After the gaokao was postponed, I had more anxiety,\" Xiong wrote in a viral post on her Weibo account. \"But this is a psychological battle and I have to win, and I must win.\"\nSenior high school students studying at night to prepare for the 2016 gaokao at a high school in Lianyungang, east China's Jiangsu province.\nMake or break\nThe exam will now be administered between July 7 and 8, apart from in Beijing and Hubei province, the original epicenter of the virus, which have yet to announce their dates.\nThe postponement is designed to account for the disruption to students' education caused by the virus\nWhile high school seniors in more than a dozen provinces have returned to school, students in many other places, such as Beijing, Shanghai, Guangdong and Hubei, are still waiting to go back and studying online, according to state news agency Xinhua.\nStudents in Shanghai and Guangdong in their last years of school will return to classes on April 27.\nBut the delay of the gaokao has divided students. While some celebrated the chance to get more study in before the exam, others were horrified at the prospect of another month of stress.\nTo prepare for the gaokao, it is not uncommon for students to spend more than 14 hours a day at school, leaving late in the evening after mandatory self-studying sessions.\nThe gaokao is a nine-hour exam which takes place over two days and covers four subjects: Chinese, math, English, and either the sciences (physics, chemistry and biology) or liberal arts (politics, history and geography).\nStudents' results on the test are the sole criteria for admission to university in China, unlike the SAT in the US, where students can take the exam several times. Most Chinese students only get one shot.\nAfter the announcement, one viral meme showed a cartoon character setting up a 100-day countdown to the exam, only to check a month later and see there were now still 98 days to go.\nGuangzhou student Sharon Li was relieved to hear about the deferment. She has been studying from home for the gaokao for weeks, hitting the books every day from 7.30 a.m. until 6 p.m., after which she does extra homework.\nLi said when she began studying from home, she put herself under huge pressure to compete with other students. She recalled one of her teacher's warnings about slacking off.\n\"He said because we couldn't compare how hard we were studying with each other now, some students wouldn't feel the pressure, and once we return to school and take exams, we would realize how far we had fallen behind,\" she said.\nShe began to stay up late, studying sometimes until 2 a.m., but both her mental health and her grades suffered. Now with an extra month to study, Li hopes to adopt a more relaxed study program.\n\"I can use the extra month to strengthen my weak points. Maybe I can even create some miracles -- it might be possible,\" she said.\nBut Li Yongjun, whose daughter Ruoran is currently studying for the exam in Beijing, said the postponement meant another \"month of torment\" for the millions of parents like him.\n\"We're all tired,\" he said. \"It's hard on everyone. We all hope the exams can be done earlier, the sooner the better. It tires everyone out if it drags on.\"\nStudents take a simulated college entrance exam in Handan in China's northern Hebei province on June 6, 2017.\n'Chosen by God'\nIn a twist of fate, many of the teenagers taking the exam this year were born in 2003 -- when severe acute respiratory syndrome (SARS) gripped China. A coronavirus dominated the year they were born, now it will scar their final year at school.\nThis pandemic is making life far more difficult than SARS, during which most schools stayed open despite the virus infecting 8,098 people and killing 744.\nGuangzhou high school student Li said the fact that she was born just months before the SARS epidemic and was now studying for the gaokao during another outbreak makes her feel like her generation was \"chosen by God.\" \"It's like a drama,\" she said. \"We're really witnessing history.\"\nOther students felt they had grown up more in the past three months than in the rest of their lives. Wuhan vocational student Xiong wrote in her Weibo post that she and her sister had stopped thinking about \"celebrities and food\" and were now deciding what to do with their lives.\n\"In no time we've turned from two carefree kids into two young women who worry about their future ... I don't see where the path lies ahead,\" she said.", "url": "https://www.cnn.com/2020/04/09/asia/coronavirus-china-gaokao-student-intl-hnk/index.html"}