{"authors": ["Giovanna Dell Orto"], "date_download": "2020-05-04 20:15:50", "date_modify": "2020-05-04 20:15:50", "date_publish": "2020-04-07 20:27:11", "description": "BALDWIN, Wisc. (AP) — As the morning sun melts the last traces of snow in the surrounding farmland, the faithful, gathered to celebrate Christianity’s holiest week, cheerfully honk out their...", "filename": "_d66936bdb43ae6f28bf001684446b68b_1588623350.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e166549ab9da48d69c3a94917ba99946/2071.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d66936bdb43ae6f28bf001684446b68b_1588623350.html", "title": "Drive-in churches an option for faithful who want closeness", "title_page": "Drive-in churches an option for faithful who want closeness", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this April 5, 2020 photo, Pastor John Hanson stands atop a truck as members of his congregation arrive for Sunday morning \"drive-in worship\" at Peace Lutheran Church in Baldwin, Wis. Palm branches were on display to commemorate Palm Sunday, the beginning of Christianity's holiest week of the year. (AP Photo/Giovanna Dell'Orto)\nIn this April 5, 2020 photo, Pastor John Hanson stands atop a truck as members of his congregation arrive for Sunday morning \"drive-in worship\" at Peace Lutheran Church in Baldwin, Wis. Palm branches were on display to commemorate Palm Sunday, the beginning of Christianity's holiest week of the year. (AP Photo/Giovanna Dell'Orto)\nBALDWIN, Wisc. (AP) — As the morning sun melts the last traces of snow in the surrounding farmland, the faithful, gathered to celebrate Christianity’s holiest week, cheerfully honk out their hallelujahs and peace greetings.\nIt’s Sunday morning drive-in worship at Peace Lutheran Church. More than 80 cars, minivans and pickups fan out around Pastor John Hanson, who’s preaching and singing perched on a dump truck in the parking lot.\nWith coronavirus prevention measures shuttering houses of worship, Hanson and other pastors across the country are using that ultimate tool of social distancing — cars — to safely bring their communities closer together. It is a closeness their congregations desire like never before.\n“People really enjoyed seeing each other from their little bubbles, fellowshipping a bit,” said Hanson, 60, a third-generation Midwestern pastor who’s led this congregation for 28 years. He got the truck for height and hooked up the sound to transmit to car radios, so people can stay inside their vehicles to follow — and sing — along.\n“Some of the silly songs we sing, waving at each other or sending a smooch to another car (as sign of peace), the reason we’re doing that is because we need them to say, ‘Oh, I see you there and you’re still OK and we care about you,’” Hanson said.\nPhysical presence is no gimmick, but rather embodies the strength that communities of worshippers draw from one another, gatherings central to Christianity and other faiths. That’s why Hanson and other religious leaders are devising creative (and law-abiding) ways to make socially distanced worship possible, in addition to offering online services.\nSome faith leaders have drawn their own lines against observances that are too distant. Archbishop Leonard Blair of Hartford, Conn., who chairs the U.S. Catholic bishops’ committee on liturgy, wrote a March 27 memo to bishops that ruled out the delivery of the sacrament of penance via cell phone.\nIn addition to drive-in worship, drive-through sites have been set up in at least a dozen states to administer communion or confession, according to local reports. Other major faiths contending with coronavirus disruption, including Jews and Muslims, have turned primarily to online connections to replace in-person worship.”\n“A lot of people had taken for granted what it means to get together for worship, it can become a routine. But when it’s taken away, you realize, it’s a really important part of my faith,” said Pastor Chris Griggs, 52, of Denver Baptist Church in North Carolina.\nMore than 200 cars gathered at Denver Baptist for the second week of Sunday parking-lot service; to be visible, Griggs raised himself above the vehicles with a scissor lift. “I’ve never had a Sunday where people were so genuinely excited to be at church.”\nIn Spokane, Washington, Pastor Steven Lympus held one drive-in service at Shadle Park Presbyterian Church before more stringent stay-at-home orders kicked in. He had feared an awkward “drive-through Jesus like at Taco Bell”; instead, there was a profound joyfulness.\n“It was almost emotional to see people waving through the windshields,” Lympus said. “It’s in our DNA to be relational, otherwise why church?”\nAt Peace Lutheran, the atmosphere was eerily emotional under the baby-blue Wisconsin sky. Bursts of honking broke over the quiet buzz of engines idling and birds chirping. The faithful waved palm branches through barely cracked windows and sunroofs, recalling the procession welcoming Jesus into Jerusalem just before his crucifixion that’s celebrated on Palm Sunday.\nA gloved volunteer had distributed the branches as cars drove into the parking lot, the line snaking across still barren fields. Less than an hour’s drive away, Catholic priests from the historic Cathedral of St. Paul, Minnesota, were similarly passing out Ziploc bags with branches to waiting vehicles.\nCars are ideal for social distancing; “We’ve got glass and steel between us,” Lympus quipped.\nThat makes it safe to attend services even for those most vulnerable to the virus, like Wisconsinite Jane Ruenger, 95. She drove alone from a nearby care facility, where she said she stays 6 feet away even from other residents, and she sat beaming in the front row outside Peace Lutheran.\nKids loved the car worshipping, too. One got to chat, from separate cars, with a teacher, while John Vrieze’s grandson was able to attend church in his pajamas. The retired dairy farmer and 20-year member of the congregation participated from his own car, keeping up his regular churchgoing (he estimates he normally attends church nine in 10 Sundays).\n“I’ve watched some ministries on TV, but for some reason in person is more important to me,” Vrieze said. “I kinda feel like I need a tune-up every week, and the tune-up comes better in person than it does remotely.”\n___\nAssociated Press reporter Elana Schor contributed from New York.\n___\nAssociated Press religion coverage receives support from the Lilly Endowment through the Religion News Foundation. The AP is solely responsible for this content.\n___", "url": "https://apnews.com/d66936bdb43ae6f28bf001684446b68b"}