{"authors": ["Clare Foran", "Lauren Fox", "Manu Raju"], "date_download": "2020-05-04 16:59:39", "date_modify": "2020-05-04 16:59:39", "date_publish": "2020-04-09 10:03:17", "description": "The Senate is at an impasse over approving additional Covid-19 aid after Republicans and Democrats blocked competing proposals on Thursday, creating uncertainty over whether and when there will be bipartisan agreement to approve further relief measures amid the ongoing crisis.", "filename": "2020_04_09_politics_small-business-loan-program-senate-vote_index_1588611579.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200322233657-mitch-mcconnell-0321-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_small-business-loan-program-senate-vote_index_1588611579.html", "title": "Senate at stalemate over more COVID-19 aid after Republicans and Democrats block competing proposals", "title_page": "Senate at stalemate over more COVID-19 aid after Republicans and Democrats block competing proposals  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The Senate is at an impasse over approving additional Covid-19 aid after Republicans and Democrats blocked competing proposals on Thursday, creating uncertainty over whether and when there will be bipartisan agreement to approve further relief measures amid the ongoing crisis.\nDemocrats blocked an effort by Senate Republicans to approve by unanimous consent an increase in funding for a small business loan program set up to deliver relief amid the coronavirus crisis, citing demands for additional funding for hospitals and state and local governments. And Republicans blocked an alternative proposal put forward by Democrats, arguing that it is urgent to approve the increase in funding for the program immediately and that other issues can be addressed later.\nSenate Majority Leader Mitch McConnell, who offered up the GOP proposal, said on the Senate floor, \"we need more funding and we need it fast,\" adding, \"I want to add more money to the only part of our bipartisan bill that could run out of money.\"\n\"My colleagues must not treat working Americans like political hostages,\" McConnell said, \"We must not fail them.\"\nMaryland Democratic Sen. Chris Van Hollen said that Democrats recognize that more money is needed for the program, but argued that further action is needed beyond just boosting the funding. \"All of these requests are urgent,\" the senator said, adding that he believes they could be dealt with on \"a bipartisan basis.\"\n\"Let's get it done and let's get it done right,\" he said, asking that the Senate pass an amended version of the bill that would include the Democratic demands. McConnell voiced an objection, however, blocking the request, while Democrats blocked the majority leader's initial request to pass a clean funding increase.\nPresident Donald Trump said Thursday evening he does not believe additional funding for hospitals and states should be attached to a proposed influx of cash to the small business loan program.\nAsked at the White House coronavirus task force briefing whether he supports sending additional funds to states and hospitals that need the money, Trump said, \"I do, but I support it for the next phase.\"\nAfter launching the program less than a week ago, the Treasury Department asked Congress on Tuesday for another $250 billion for the Paycheck Protection Program, a federally-backed loan program intended to help business owners keep their enterprises afloat amid the global pandemic. The rollout has been far from smooth, and with so many applications coming in, Treasury is asking for more money now in an effort to assure business owners waiting in line that the money will be there.\nBut Senate Democrats -- who unanimously backed the program when it passed last month -- argue any legislation to increase funding for Small Business Administration loans must include other provisions as well, including money for hospitals on the frontlines of combating coronavirus and $150 billion in funding for states and local governments. Democrats have also asked that half of the money for SBA -- $125 billion -- be steered to community lenders to ensure underserved communities are getting loans.\nNegotiators from both parties are now expected to discuss how to proceed as congressional leaders have said they would most likely want to pass any legislation without requiring the majority of lawmakers to return to Washington, meaning both sides would likely need to be in agreement about the process before proceeding.\nMcConnell, leaving the Senate floor, said he expected more talks with Democratic leaders now that the chamber is at an impasse over how to provide money for small businesses.\n\"Clearly with everyone out of town, with the President saying he's not prepared to sign additional legislation, what we were trying to do was get a result,\" he said. \"There will be additional discussion.\"\nAsked if he would have to give into what the Democrats are asking for, namely money for state and local governments and hospitals, McConnell said, \"No one is necessarily against additional assistance ... much of the rest of the money has not gone out yet. It's hard to measure the effect it's had and the additional need. This is the one program that was running out of money, needed assistance now and all my proposed amendment would do at the request of the administration was simply change one number.\"\nMcConnell didn't answer a question about how quickly he thought a deal could be reached.\nSen. Ben Cardin, also a Maryland Democrat in the chamber Thursday, told reporters that he believes a bipartisan deal could be reached quickly on the small business aspect of the package. But he said a negotiation would have to occur between the top four leaders of Congress: McConnell, Senate Minority Leader Chuck Schumer, House Minority Leader Kevin McCarthy and House Speaker Nancy Pelosi.\n\"I think at this level .. you have to have a total buy-in by Majority Leader McConnell, Leader Pelosi and Leader McCarthy,\" Cardin said.\nLawmakers are back in their home states on recess as the pandemic sweeps across the country and, as a result, any effort to greenlight additional funding for the loan program would need to take place by unanimous consent, which can be blocked if any senator objects, or by a voice vote, which would not require all members to be present.\nIn one indication of continued disagreement between Senate Republicans and Democrats, Sen. Marco Rubio, a GOP senator from Florida and the chairman of the Small Business Committee, issued a statement rejecting the idea of guaranteeing money would go to specific lenders.\nFor Democrats, there's pressure to back the Small Business Administration program that, despite a rough start, has seen widespread participation. In a call with Republicans, Mnuchin touted that $90 billion in loan applications had been approved and another $100 billion was being processed.\nBut Democrats are not the only ones with concerns. Republicans and Democrats alike have voiced frustrations with the program's glitches including the fact that many lenders were waiting days to get final guidance on how to disburse the loans. On Monday, the portal lenders use to upload loan application information to the SBA crashed. And several members have reported frustrations from small business owners who struggled to find a lender willing to offer them a loan if they were not already an existing customer.\n\"If you don't fix what is fundamentally wrong with the program, throwing more money after bad is not going to help small businesses,\" Rep. Stephanie Murphy, a moderate Democrat from Florida, told CNN about frustrations she's been hearing from constituents. \"We have to try to make the changes be a condition of handing over another quarter of a trillion dollars.\"\nIf the Senate is able to pass an increase in funding, the measure would next need to go to the Democrat-controlled House.\nRep. Thomas Massie, a Kentucky Republican, indicated on Wednesday that he would oppose any attempt to pass new funding for small business loans through the House by unanimous consent or voice vote, a threat that follows his previous objection to quick passage of a $2 trillion stimulus deal and that could complicate any efforts to move a funding increase through the House -- even if a bipartisan deal is reached.\nThis story has been updated with additional developments Thursday.", "url": "https://www.cnn.com/2020/04/09/politics/small-business-loan-program-senate-vote/index.html"}