{"authors": ["Bobcaina Calvan", "Terry Spencer"], "date_download": "2020-05-04 20:28:07", "date_modify": "2020-05-04 20:28:07", "date_publish": "2020-04-13 20:58:47", "description": "TALLAHASSEE, Fla. (AP) — Florida Gov. Ron DeSantis said Monday the state will more aggressively inspect nursing homes to detect patients and staff who are infected with the coronavirus while...", "filename": "_e10c9150c1b9986567af66875806bdb6_1588624087.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e10c9150c1b9986567af66875806bdb6_1588624087.html", "title": "Florida to aggressively test nursing home patients, staff", "title_page": "Florida to aggressively test nursing home patients, staff", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "TALLAHASSEE, Fla. (AP) — Florida Gov. Ron DeSantis said Monday the state will more aggressively inspect nursing homes to detect patients and staff who are infected with the coronavirus while officials said it appears the disease’s expansion in the state may be reaching a plateau.\nDeSantis said he has ordered the Florida National Guard to create 10 teams that will visit long-term care facilities to test employees and residents for the virus, with a focus on hard-hit Miami-Dade, Broward and Palm Beach counties. They will supplement 30 paramedics who have already been conducting such tests.\nDeSantis said the virus has caused known infections at 94 of the state’s 4,000 homes. In Clay County, in the Jacksonville area, 49 cases have been reported at long-term care facilities, and 51 cases among residents and staff have been reported at a nursing home in Suwannee County, located halfway between Jacksonville and Tallahassee. Statewide, there were almost 840 coronavirus cases in residents and staff at long-term care facilities, as of Saturday.\n“It is critical to identify people who test positive as early as possible,” DeSantis said. He said it is particularly important to identify staff members who are infected with no symptoms, but they unknowingly pass the disease on to patients and colleagues. “You need to have a strike team going in and aggressively testing to try to preempt that.”\nFlorida’s confirmed cases reached more than 21,000 Monday evening with 498 deaths and more than 2,800 hospitalizations.\nDr. Scott Rivkees, Florida’s surgeon general, said that the disease’s expansion may have hit a plateau with about 11% of tests coming back positive daily for the past week with the number of patients hospitalized and in intensive care seeming to be stabilizing.\nStill, Rivkees said he expects social distancing guidelines such as keeping gatherings to 10 or less, staying six feet apart and wearing masks in public to be in place until a vaccine is created, which could take a year.\n“I cannot emphasize enough that we cannot let our guard down,” he said.\n___\nSpencer reported from Fort Lauderdale.", "url": "https://apnews.com/e10c9150c1b9986567af66875806bdb6"}