{"authors": [], "date_download": "2020-05-04 20:32:01", "date_modify": "2020-05-04 20:32:01", "date_publish": "2020-04-21 00:10:17", "description": "CORPUS CHRISTI, Texas, EE.UU. (AP) — Un médico de emergencias del sur de Texas eligió un sitio novedoso para auto aislarse mientras atiende a pacientes contagiados con el coronavirus. El...", "filename": "_a6b031b54d66be95b711a593bb53c857_1588624321.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a6b031b54d66be95b711a593bb53c857_1588624321.html", "title": "Médico de Texas se aísla en casita del árbol de sus hijos", "title_page": "Médico de Texas se aísla en casita del árbol de sus hijos", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nCORPUS CHRISTI, Texas, EE.UU. (AP) — Un médico de emergencias del sur de Texas eligió un sitio novedoso para auto aislarse mientras atiende a pacientes contagiados con el coronavirus.\nEl doctor Jason Barnes hizo su hogar temporal en la casita del árbol de sus hijos en el jardín trasero de la vivienda de la familia en Corpus Christi, Texas. Es uno de muchos trabajadores de salud que han abandonado sus casas o están tomando otras medidas de precaución para proteger a sus familias tras haber estado expuestos al virus.\nEn la mayoría de la gente, el coronavirus causa síntomas leves o moderados, como tos y fiebre que desaparecen de dos a tres semanas. Pero en algunas, sobre todo en adultos mayores y personas con enfermedades preexistentes, puede provocar afecciones más graves, incluyendo neumonía, o incluso la muerte.\nBarnes, un médico de 39 años en el Christus Spohn Hospital Beeville y en el Christus Spohn Hospital South en Corpus Christi, lleva casi tres semanas en la casita del árbol y a menudo les grita a sus hijos si necesita algo, o a veces camina hacia la ventana de la puerta trasera de su casa para hacer su solicitud.\n“Escuchan mis gritos desde aquí”, dijo Barnes al diario Corpus Christi Caller-Times. “Pero puedo gritar o ir a la ventana. Saben que no deben abrir la puerta y arriesgarse a contagiarse de algo”.\nPor supuesto, su auto aislamiento significa que sus dos hijos, de 6 y 9 años, se quedaron sin su casita del árbol.\n“Aman esa cosa, pero lo entienden, así que no extrañan la casita como tal”, comentó. “Una vez al día me dicen que me extrañan”.", "url": "https://apnews.com/a6b031b54d66be95b711a593bb53c857"}