{"authors": ["Thomas Lake"], "date_download": "2020-05-04 16:17:31", "date_modify": "2020-05-04 16:17:31", "date_publish": "2020-04-04 01:05:39", "description": "You never know what will break you in a time like this, with your bones feeling hollow and your heart beating fast. It happened to me on a Sunday afternoon, when I heard Joe Diffie was dead, writes Thomas Lake. The country singer succumbed to coronavirus.", "filename": "2020_04_03_opinions_joe-diffie-coronavirus-lake_index_1588609051.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200329161628-joe-diffie-obit-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_opinions_joe-diffie-coronavirus-lake_index_1588609051.html", "title": "Joe Diffie is gone, but Billy Bob will always love Charlene", "title_page": "Joe Diffie is gone, but Billy Bob will always love Charlene (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "In a series of essays called The Distance, Thomas Lake is telling the stories of Americans living through the pandemic. Email thomas.lake@cnn.com if you have a story to share.\n(CNN) You never know what will break you in a time like this, with your bones feeling hollow and your heart beating fast. It happened to me on a Sunday afternoon, when I heard Joe Diffie was dead.\nI never met him, but his was the first coronavirus death that felt personal to me. He was a country singer who had several big hits in the '90s. One was about pickup trucks . One was about his childhood home . And one, well --\nTHE DISTANCE Americans living apart and together in the age of pandemic\nIt's the story of two high school sweethearts in farm country. One summer night the boy takes some green paint, climbs the water tower, and paints a 10-foot heart, along with an indelible message: BILLY BOB LOVES CHARLENE. The last three lines of the chorus keep playing in my mind:\nAnd the whole town said that he should have used red\nBut it looked good to Charlene\nIn John Deere green\nBilly Bob and Charlene were created by the great Nashville songwriter Dennis Linde, who also wrote Burning Love for Elvis and Goodbye Earl for the Dixie Chicks. Linde was a recluse who sat alone in cafés, listening for authentic dialogue. He used a police radio scanner to gather the raw details of human desperation that might inspire his next song. Did a man named Bubba ever shoot a jukebox because it played a song that made him cry? He might as well have. \"It sounded like it could be true,\" Linde once said in an interview . \"And it probably is, somewhere.\"\nYou can see it: the small town, the water tower, the 80 acres where Billy Bob and Charlene settle down. They plant corn and tomatoes, raise their children, grow old together. They stand in the front yard, probably holding hands, looking into the distance at the confession that Billy Bob wrote in three-foot letters all those years ago. Dennis Linde died in 2006, but he did not die, because Billy Bob and Charlene are still here.\nThomas Lake\n\"Oh,\" Linde's son Will said, when I asked him what the song was about. \"Just undying love.\"\nThere was a baby who came home from the hospital and wouldn't stop crying until his grandmother put on a Johnny Cash record. Then he calmed down and fell asleep. At age 4 he could already sing in harmony. He picked up a guitar and went out into the world. His name was Joe Diffie. His mother, Flora Diffie, told me all this in a phone interview. One day he played a song for her, a new song he'd thought about recording. She didn't like it, because it sounded too much like rock and roll. \"Trust me,\" he told her, and she did. That song was John Deere Green.\nIt was not his biggest hit. Pickup Man and Third Rock from the Sun went higher on the charts. But as the years went by, it was the song his fans wanted most. His sister Meg Prestidge managed him for a concert series in Branson, Missouri, in 2008, and she heard them calling for John Deere Green the whole time. \"I'm gonna get to that song,\" he told them, and played it at the very end.\nJoe Diffie was 61, a diabetic, and on March 27 he announced that he'd tested positive for Covid-19. One of the virus's many cruelties is the way it separates people. His wife, Tara, was not allowed to be with him at the hospital. He texted his sister in Oklahoma and said he was about to go on a ventilator.\nWhat a strange time to live or die. I heard the news a few minutes before a virtual talent show my sister had organized. About 20 relatives and friends would meet on video chat to sing songs and tell stories. I'd chosen a song already, but when I heard about Joe I changed the plan.\nI picked up my guitar and ran through the chords. I printed out the lyrics and taped them to a door frame. My wife sang harmony. I made it through the first verse, and there was Billy Bob, standing on the rail, painting that heart. I made it through the second verse, and he and Charlene were in the front yard, looking toward the water tower. Second chorus, and then the bridge:\nNow more than once the town has discovered\nPainting over it ain't no use\nThere ain't no paint in the world that'll cover it\nThe heart keeps showing through\nOn the last line, the words caught in my throat.\nAnother story about two lovers in a small town. This one is absolutely true. Joe gets sick and dies without Tara in the hospital. They can't have a proper funeral. And so, in Nolensville, Tennessee, they have a parade. People stay in their vehicles, trying not to breathe on each other. They drive through Joe and Tara's neighborhood in the twilight. She watches them go by. At least four John Deere tractors. Almost everyone wearing green.", "url": "https://www.cnn.com/2020/04/03/opinions/joe-diffie-coronavirus-lake/index.html"}