{"authors": ["Gisela Crespo"], "date_download": "2020-05-04 16:28:45", "date_modify": "2020-05-04 16:28:45", "date_publish": "2020-04-07 11:39:30", "description": "A doctor in New York asked for help to alleviate the shortage of personal protective equipment for health care workers on the front lines of the coronavirus fight.", "filename": "2020_04_07_health_librarian-3d-printing-coronavirus-trnd_index_1588609725.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401135920-01-3d-printed-protective-face-shields-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_health_librarian-3d-printing-coronavirus-trnd_index_1588609725.html", "title": "This librarian is using 3D printing to fight coronavirus", "title_page": "This librarian is using 3D printing to fight coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A doctor in New York asked for help to alleviate the shortage of personal protective equipment for health care workers on the front lines of the coronavirus fight.\nA librarian stepped in to help.\nNow Madiha Choksi, a research technologist at the Columbia University Libraries, is a key member of a group of partners and volunteers that have made over 7,500 protective face shields to distribute to New York City-area hospitals.\nMadiha Choksi wears one of the face shields 3D printed for health care workers in New York.\nShe received an email from Dr. Pierre Elias, a fellow at Columbia, telling her about the lack of adequate PPE for health care workers at New York Presbyterian Hospital. Elias shared a few links with open source files to 3D print face shields.\n\"I think early on in this crisis we wanted to be prepared,\" Elias told CNN. \"And what we were realizing is with the rate of patients that were coming to the hospitals and the supplies that we had, we were really concerned about if supply could meet demand.\"\nElias said 3D printing is helpful in the short term because \"it allows for rapid prototyping, and you're not dependent on supply chains.\"\nThe librarian started to work right away. She spent all night researching various models, and got permission from her bosses to bring two 3D printers from the library back to her apartment, since the campus had already closed and she was working remotely.\nChoksi made a few changes to an open source face shield model from 3D printing company Budmen Industries, including making the file about 8% smaller to reduce the printing time of the visor, which is the only 3D-printed component of the face shield, to around an hour. An elastic band, foam band, and sheet of transparent plastic complete the face shield.\nTwo days after the initial help request, Choksi presented Elias with five reusable face shields. The next day Elias asked her if she could do about a thousand of them.\nElias said Choksi \"really took up\" the call to help health care workers.\n\"The amount of care that she has for health workers in New York City is immense. She just has a deep passion for trying to help,\" Elias added.\nVolunteering while social distancing\nChoksi said she used social media to spread the word about her effort, and soon after, she landed the help of two 3D printing companies, MakerBot and Tangible Creative, to print the visors. The partnership also includes Columbia Libraries, which is helping with the rest of the materials. Her library colleagues and volunteers started to assemble the face shields.\nChoksi at the assembly line volunteers created to make the face shields.\nThe group was in Choksi's apartment up until March 25. \"I was receiving about 150 and 200 of [visors] a day and trying to put them together at home. And I realized, you know, this isn't sustainable.\"\nThrough a friend, Choksi found a space at 92nd Street Y in Manhattan, and very quickly an assembly line was formed -- it takes only a couple minutes to assemble the face shield -- that has helped them make over 7,500 face shields since they started at Choksi's apartment. The shields have all been donated to hospitals.\n\"I feel a responsibility to do all that I can as someone who is a technologist,\" Choksi said. \"We have to do all we can for the true heroes on the front lines, our medical professionals.\"\nColumbia librarians created the website Covid Maker Response , where hospitals can request face shields.\nWhy face shields are important\nThe reusable face shield is meant for health care workers to use as an extra layer of protection over N95 masks. It covers the forehead and eyes, going ear to ear and all the way down to the bottom of the neck.\nElias said a face shield is especially helpful when a patient is producing aerosolizing particles.\n\"If you were intubating a patient, if you're doing chest compressions on the patient, or if you know, the patient was breathing very hard or very difficult for a reason that all of that is producing droplets into the air ... that's very, very high risk,\" Elias said.\nDr. Pierre Elias holds the first face shields donated to his colleagues.\nElias has distributed around 1,400 face shields among his colleagues, and said the best part of this effort \"is seeing people's faces light up.\"\n\"I came with a box full of them,\" Elias recalled of one of the times he was distributing the face shields. \"I was talking with a nurse who I've known for years and I asked her how's morale and she said 'better now' when she looked at the box ... that made me feel pretty good.\"\n3D printing on the front lines\nnot enough protective gear for health care workers to remain safe while taking care of patients in the Covid-19 pandemic. Across the US, people have taken the do-it-yourself approach to help with the PPE shortage. From printing businesses to schools to doctors , all have responded to the urgent call from hospitals and care centers that there isnot enough protective gear for health care workers to remain safe while taking care of patients in the Covid-19 pandemic.\nEngineering and technology experts at Duke University used the school's 3D-printing lab to test over 100 face shield prototypes. With the help of students and medical professionals who tested them, the team chose a 3D-printed headband to produce a reusable face shield when attached to a laser-cut piece of plastic with high-impact resistance.\nThe Duke team has been working on producing 1,000 3D-printed headbands with the school's 65 printers and the face shields will go to health care workers at Duke and UNC hospitals.\nThe National Institutes of Health created a website to help keep track of 3D-printing technologies to produce PPE. The Budmen Industries model that Choksi optimized is now recommended for use after it was reviewed in a clinical trial \"when fabricated as instructed,\" according to the NIH website.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nChoksi said she and the rest of her librarian colleagues and other volunteers know that what they're doing is not a long-term solution to the PPE supply problem, but she hopes that medically approved PPE can be produced soon at the scale needed to meet the demand.\n\"But until that happens, we're moving full speed ahead.\" Choksi said.", "url": "https://www.cnn.com/2020/04/07/health/librarian-3d-printing-coronavirus-trnd/index.html"}