{"authors": ["Gonzalo Solano"], "date_download": "2020-05-04 20:14:27", "date_modify": "2020-05-04 20:14:27", "date_publish": "2020-04-07 17:48:13", "description": "QUITO, Ecuador (AP) — An Ecuadorian court found former President Rafael Correa guilty of corruption Tuesday and sentenced him to eight years in prison, further sullying the legacy of one of the...", "filename": "_9b3e36da5af0c74a27bbaf9aefedb3fe_1588623267.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e418d9e9984045a4af0e10b1dc1f34ae/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9b3e36da5af0c74a27bbaf9aefedb3fe_1588623267.html", "title": "Court finds ex-Ecuador president guilty of corruption", "title_page": "Court finds ex-Ecuador president guilty of corruption", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A man wearing a mask amid the spread of the new coronavirus walks by a sign in favor of Ecuador's former President Rafael Correa returning, in Quito, Ecuador, Tuesday, April 7, 2020. On Tuesday, an Ecuadorian court found Correa guilty of corruption and sentenced him to eight years in prison, further sullying the legacy of one of the nation's most enduring and polemic political leaders. (AP Photo/Dolores Ochoa)\nA man wearing a mask amid the spread of the new coronavirus walks by a sign in favor of Ecuador's former President Rafael Correa returning, in Quito, Ecuador, Tuesday, April 7, 2020. On Tuesday, an Ecuadorian court found Correa guilty of corruption and sentenced him to eight years in prison, further sullying the legacy of one of the nation's most enduring and polemic political leaders. (AP Photo/Dolores Ochoa)\nQUITO, Ecuador (AP) — An Ecuadorian court found former President Rafael Correa guilty of corruption Tuesday and sentenced him to eight years in prison, further sullying the legacy of one of the nation’s most enduring and polemic political leaders.\nJudge Iván León said prosecutors had successfully proved the existence of a “structure of corruption” led by Correa and 19 other high-profile politicians and business leaders accused of participating in the bribery scheme.\nThe decision could effectively end any aspirations by Correa to return to politics, as the sentence bars him from running for office for 25 years.\n“So much money can’t be hidden easily,” said León, who read the sentence in the closed door, two-hour long sentencing in which judges wore masks and protective gloves as a precaution against the spread of the coronavirus.\nCorrea has denied the charges against him, calling them a political witch hunt.\n“For sure we will win at the international level,” he said on Twitter immediately after the sentencing. “Because this is all a monstrosity.”\nThe 57-year-old former head of state has been living in his wife’s native Belgium since 2017. Though Ecuadorian authorities have demanded his arrest and extradition previously, thus far he has been allowed to stay in Belgium.\nEcuadorian officials are not expected to request his immediate extradition until the case has made its way through the anticipated appeals process.\nProsecutors state the former president oversaw a plot in which foreign and local businesses made cash payments to his PAIS Alliance political party in exchange for lucrative public works contracts. The payments were allegedly made between 2012 and 2016, years that overlap with Correa’s time in the presidency.\nCorrea led the country until 2017, a period of economic stability and growth driven by an oil boom and loans from China that allowed him to expand social programs, build roads, schools and other projects that transformed Ecuador.\nBut he governed with an iron fist – silencing or punishing critics in the press, opposition and judiciary – and his legacy has grown increasingly tarnished.\nIn reading the sentence, León said there was compelling evidence showing that Correa had knowledge of the illegal payments totaling $7.5 million and aimed at promoting his political party’s campaigns.\nHis vice president, Jorge Glas, already jailed in a separate corruption case, and 16 others were also found guilty of bribery and sentenced to eight years behind bars. Two others received lesser sentences in exchange for their collaboration.", "url": "https://apnews.com/9b3e36da5af0c74a27bbaf9aefedb3fe"}