{"authors": ["Lisa Drayer"], "date_download": "2020-05-04 16:14:32", "date_modify": "2020-05-04 16:14:32", "date_publish": "2020-03-21 04:23:58", "description": "With the intensity of the coronavirus situation increasing each day, people who have regularly dined out or consistently relied on takeout food are facing a new challenge: How to make healthy, home-cooked meals.", "filename": "2020_03_21_health_how-to-co_0b802c8033fcecfa83e1f3ed7c7daf20_index_1588608872.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200319162747-family-cooking-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_21_health_how-to-co_0b802c8033fcecfa83e1f3ed7c7daf20_index_1588608872.html", "title": "First time cooking from home? What you need to know", "title_page": "First time cooking from home? What you need to know - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) With the intensity of the coronavirus situation increasing each day, getting food in the hands of so many who can't leave home presents a critical health challenge .\nAnd though they may be more mobile, a new challenge has simultaneously emerged for many young people, who have regularly dined out or consistently relied on takeout food: How to cook meals beyond microwaving oatmeal or boiling pasta.\nMy niece is one of them.\n\"When you eat out, you don't need to put much thought into what ends up on your plate. We're struggling to figure out how to come up with well-balanced meals,\" said Allison Strumeyer, a 24-year-old single girl who resides in New York City and has chosen to isolate herself from her parents who often cook at home.\n\"We've been forced to learn things out of necessity, like that you can freeze fish and meat for months at a time, or the difference between broiling and baking,\" said Ben Rosenbaum, another New York City millennial. \"Knowing that we may need to stay inside for weeks, we're worried about getting sick of the same one or two dishes we know how to cook.\"\nIf you're sharing these same sentiments, here's a primer on what you'll need to start expanding your repertoire of healthy, home-cooked meals.\nLearning the basics\nCulinary nutritionists recommend the following resources to learn cooking basics:\nOnline resources. The Internet can be a great resource, particularly for cooking videos, said Debbie Petitpain, a registered dietitian who teaches a culinary class to medical students at the Medical University of South Carolina. \"You're not just reading, but watching someone else. It's a great way to learn.\"\nOn Facebook and IGTV, \"you can follow your favorite chef or nutritionist and see if they post how-to videos,\" said Kristy Del Coro, registered dietitian and culinary nutritionist, and co-founder of the Culinary Nutrition Conference for dietitians.\nWebsites can also be helpful. At SuperCook.com , for example, you can simply enter in the ingredients that you have on hand and it will give you recipes that include those ingredients, explained Petitpain, who is also spokesperson for the Academy of Nutrition and Dietetics.\nMagazines. \"Magazines typically offer short recipes, and there are usually pictures, so you can visualize what looks appealing,\" Petitpain said. \"Oftentimes the recipes are fairly simple to follow, and don't require fancy kitchen tools.\"\nPetitpain likes Vegetarian Times -- not only because many of us lack vegetables in our diets, but because the magazine offers creative options beyond microwaved broccoli. The magazine also has an \"Under 30 minutes\" section, \"which is one of my favorite go-tos,\" Petitpain said.\nAnd Cooking Light tends to have recipes for traditional fare that they've lightened up, \"so they are not as heavy from a calorie perspective,\" Petitpain added.\nBooks. Cookbooks are available online as well. You can search Amazon.com for cookbooks that appeal to you, though it's wise to read the reviews before purchasing.\nEssential tools\nFor basic cooking equipment, culinary nutritionist Jackie Newgent recommends the following essentials: a large cutting board, a sharp chef's knife, a large saucepan with a lid, a silicone spatula and cooking spoon, and a large stick-resistant skillet.\nOther tools that Petitpain recommends to her cooking students include a paring knife, a serrated slicer (for cutting things like bread), a vegetable peeler, zester or micro planer, and tongs.\nAnd in addition to the tools already mentioned, Del Coro likes having the following items handy: a can opener, a basic set of mixing bowls or prep bowls, measuring spoons and cups, a colander or mesh strainer, a sheet tray (\"a must for any kind of oven roasting!\"), and a food thermometer for those frequently cooking meat.\nA note about saucepans: A large soup-sized 8-quart stock pot is useful, even if you're not cooking for more than one, advised Mills, who is also a spokesperson for the Academy of Nutrition and Dietetics. \"This size gives plenty of room for stirring smaller batches of soups, stews and chilies and plenty of room for growing as your skills grow.\"\nAside from Amazon.com, consider purchasing cooking tools at surlatable.com , advised Del Coro. \" Crateandbarrel.com usually has less expensive stuff,\" and for really good deals, check out webstaurantstore.com ,\" Del Coro added.\nPantry staples\nIn terms of cooking pantry staples, three basics include salt, pepper and extra virgin olive oil, according to Newgent. She also recommends canned beans, whole grains, nuts, dried fruit and vinegars, which add flavor when cooking\nDried herbs and spices, especially dried garlic and onion, are key, according to Del Coro, as well as a low sodium vegetable or chicken stock, and plain breadcrumbs. Peitipain likes smoked paprika, cumin and coriander, as well as herbes de provence, which you can put \"on almost anything and it tastes delicious.\"\nIf you wish to cook with fresh produce, long-lasting picks include cauliflower, onions, potatoes, sweet potatoes, beets, garlic, carrots, winter squash, apples, oranges and lemons, according to Newgent.\nFor other basic food staples to have handy, particularly during a lockdown, check out our list of groceries to purchase\nAnd for sweet indulgences, Del Coro recommends stocking baking essentials like all purpose flour, sugar, baking soda, baking powder, vanilla extract and butter.\nGetting started\nRemember, when selecting your first dish, a simple recipe can be just as delicious and impressive as a complicated one, according to Newgent, who recommends starting with a basic omelet, a grilled-cheese sandwich and a basic spaghetti dish.\nA stir-fry is a good idea too, as stir-frying doesn't require any specific equipment and is forgiving with ingredient swaps, according to Petitpain.\nMills suggests mastering a basic chili or soup. Below is the recipe for her Cannellini Kale Soup, an easy dish that's packed with protein and nutrients, and great for freezing.\nCannellini Kale Soup\nTotal time: 20 minutes\n1 tablespoon canola oil\n1 small onion, diced\n3 cloves garlic, chopped\n3 cups low-sodium vegetable or chicken broth\n1 14.5 ounce can diced tomatoes including liquid\n2 15-ounce cans cannellini beans, drained and rinsed\n1 1/2 teaspoons Italian dried herbs\n1/2 teaspoon Kosher salt\nFresh cracked black pepper, several turns\n2 cups baby kale\n1/4 cup Parmesan cheese\nIn a large soup pot, heat the oil over medium heat. Add onion and garlic and stir to prevent burning about 2 to 3 minutes. The onions will become translucent and soft.\nAdd in the broth, tomatoes, beans, Italian herbs, salt and pepper. Bring to a boil then reduce heat to low and simmer for 5 minutes.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nStir in the kale and let simmer and additional 2 minutes until the kale is wilted.\nTake off heat. Serve immediately topped with a sprinkle of Parmesan cheese.\nNote: Try adding red pepper flakes the second time around for variation.", "url": "https://www.cnn.com/2020/03/21/health/how-to-cook-from-home-coronavirus-drayer-wellness/index.html"}