{"authors": ["Money", "Home", "Living Reporter"], "date_download": "2020-05-04 20:28:22", "date_modify": "2020-05-04 20:28:22", "date_publish": "2020-04-30 09:45:03", "description": "No fancy supplies or complicated instructions required.", "filename": "entry_easy-home-improvement-project-ideas_l_5ea9f81ec5b6dac085f52cee_1588624102.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9f9c83000009512155269.jpeg?cache=nXd3LGbcMK&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_easy-home-improvement-project-ideas_l_5ea9f81ec5b6dac085f52cee_1588624102.html", "title": "9 Easy Home Improvement Projects To Keep You Busy While Quarantined", "title_page": "9 Easy Home Improvement Projects To Keep You Busy While Quarantined | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "We’re spending way more time at home these days, which means it’s more important than ever for our living spaces to bring us joy and comfort. But if you’re like me, you’ve begun to notice ― maybe even fixate on ― imperfections like run down furniture and outdated wallpaper.\nSince you’re stuck at home anyway, now might be a good opportunity to work on a project or two that will spruce up your home and take your mind off the coronavirus pandemic. Most major hardware stores are offering online ordering with curbside pickup, so getting supplies should be a breeze. And as long as you’re handy with a few basic tools and paintbrush, you can tackle these easy home improvement projects.\n1. Add an accent wall\nasbe via Getty Images\nA fresh coat of paint can transform a space. But if you don’t have the patience or energy to repaint an entire room, consider creating an accent wall instead.\n“A quick and easy solution to make a large impact in a room is by throwing a pop of color or a fun pattern on one feature wall,” said Bo Keuleers, interior designer at MVA Home. She recommends going with a darker color or fun vibrant color to add contrast to the room. If you want to get slightly more advanced, use a few complementary colors and painter’s tape to incorporate color blocking or other geometric designs.\nIntimidated by paint? No problem. Another alternative is putting up patterned wallpaper. “During the stay at home order, it may be difficult to find someone to install wallpaper ... it isn’t the easiest task to execute yourself,” Keuleers said. “Luckily, there are many alternatives, such as removable wallpaper or a paperless wallpaper option (stickers for the walls to create the illusion of wallpaper) that you can easily do yourself.”\nAnd don’t overlook the ceiling. “It’s a blank canvas waiting to be used and an easy way to make an eye-catching impact, forcing the eye to draw upward to an otherwise overlooked area,” Keuleers said.\n2. Give your furniture a facelift\nKathrin Ziegler via Getty Images\nDo you have furniture sitting in your garage that needs a bit of TLC before it can be used again? Are there items in your home that you wish looked a little less lived-in? All you need are a few basic tools to make old, drab furniture look amazing again, according to Marty Basher, designer and home improvement expert with Modular Closets.\nFor a new paint job, you’ll need sandpaper, cleaning solutions like rubbing alcohol, a good quality primer and the paint of your choice. “You can add new drawer pulls, knobs, etc. to further upgrade the look,” Basher said. “It’s a relatively inexpensive project that packs a big punch.” And you can probably revamp a table or dresser in one afternoon. Here’s some inspiration to get you started.\n3. Start an urban garden\nAleksandarNakic via Getty Images\nThere’s a reason millennials are obsessed with houseplants these days. Adding some greenery to your home can improve your mood, detoxify the air and bring nature to you when you can’t go outdoors.\nThe team at Garden Safe suggested putting together an “urban garden” with different lettuce varieties, veggies and herbs. Try selecting a creative location and containers to house your plants ― just make sure there’s adequate drainage to prevent too much moisture from building up, which can cause your plants to drown or develop disease. You’ll also want to consider water and sunlight: “Container-grown plants have different needs than in-ground counterparts; wind and sun dry out soil much faster in containers because they’re more exposed to the elements,” according to Garden Safe.\n4. Create a gallery wall\nSara Monika via Getty Images\nIf you have old photographs, picture frames and artwork stashed around your house, you can put it all on display with a trendy gallery wall.\nStart by arranging your pieces on the floor, said Susan Jamieson, founder and principal of Bridget Beari Designs. “If you’d like a frame of reference, measure out the wall size onto your floor with painter’s tape or string to outline your dimensions,” she suggested.\nTry out a few different compositions and take pictures so you can compare layouts (check Pinterest for ideas). “One general rule of thumb for displaying artwork is to hang at eye level, so keep this in mind when creating your gallery layout,” Jamieson said.\nOnce you come up with an arrangement you like, hang the centerpiece first; it’s easier to keep your design balanced and space out accordingly this way. And if you’re short on pieces to incorporate, Jamieson said you can add in some framed fabric, wallpaper or wrapping paper to jazz up the mix.\n5. Repaint your front door\nDebraLee Wiseberg via Getty Images\nApplying a fresh coat of paint to your front door is one of the easiest and fastest ways to boost your home’s curb appeal, according to Eamon Lynch, director of warranty service at Power Home Remodeling. “With just a paint roller, drop cloth and a can of your desired color, you can update your entryway in a matter of hours,” he said. “I also find it helpful to use strips of painter’s tape along the edges of the door to make sure paint doesn’t accidentally end up on the door frame where you don’t want it.”\n6. Upgrade interior doors\nAButterflyHouse.com\nIf you want to take your door design skills to the next level, Lindsay Fay, a DIY and home improvement writer at A Butterfly House, suggests an easy project.\nUsing paint and some trim, you can upgrade a basic closet door into a faux french-style door. Fay said the project only takes about three hours of active work time, though you should allow for one to two days between coats of paint so it dries completely. And her biggest tip: “Don’t skip the primer! It’s the key to ensuring your paint adheres.”\n7. Paint your countertops\nAlessandro De Carli / EyeEm via Getty Images\nIf you’re sick of your plain or outdated countertops, you don’t have to invest in new ones. An easy, fast and cheap project that makes a huge difference is to simply paint them, said Kaylee Strozyk, the blogger behind Mama and More. “All you need is a little bit of primer, a few $1 acrylic paints, a sea sponge and sealer,” she said.\nBy following her tutorial, your counters will look just like granite. “Using a sea sponge makes it almost impossible to mess up … and since the acrylic paint is so cheap, you can choose exactly the right colors and pattern for your kitchen,” she said. Although you have to keep things taped overnight for the primer to dry, the process is quite fast. “Depending on the way you choose to seal it, it will probably take a maximum of a few hours,” Strozyk added, noting that this project, from start to finish, could take less than 24 hours.\n8. Swap out the hardware on your cabinets\nGrace Cary via Getty Images\nRepainting cabinets can be a time consuming project. But one quick and easy way to upgrade their look is by changing out the hardware. You can also do this for bedroom nightstands and dressers.\nToday, there are so many stylish finishes for hardware, such as brushed gold, matte black and champagne bronze. “Lots of websites have great hardware choices, with quick delivery, and at a variety of price points,” said interior designer Alena Capra. She suggested checking out sites like Home Depot, Wayfair, Amazon and Lowes.\nAs far as tools, Capra said that you will need the appropriate screwdriver for your hardware, and if there are handles on your cabinets, a tape measure (measure the distance from the center of the screws, center to center, to know what size hardware to order).\n9. Update your flooring\nTuomas Lehtinen via Getty Images\nWhether you want to refresh an outdated bathroom or completely redo the flooring throughout your home, peel and stick tiles can be a stylish yet durable option that are easy to install.\nLaying peel and stick tile requires a few simple household items, including scissors and a measuring tape, said Lauren Noel, founder of home improvement and decor website Love Remodeled.\nDepending on the type of flooring you have in place, you may need to strip it down to the subfloor first. However, you can lay peel and stick tile down directly on top of existing vinyl flooring ― just be sure the surface is free of debris and wax.", "url": "https://www.huffpost.com/entry/easy-home-improvement-project-ideas_l_5ea9f81ec5b6dac085f52cee"}