{"authors": ["Chauncey Alcorn", "Cnn Business Video Jeffrey Kopp"], "date_download": "2020-05-04 16:22:56", "date_modify": "2020-05-04 16:22:56", "date_publish": "2020-04-06 13:54:04", "description": "Doctors and nurses on the front lines of the coronavirus pandemic are in desperate need of face shields. So tech companies are stepping up to help.", "filename": "2020_04_06_business_face-shields-3d-printer_index_1588609376.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403143404-nurse-drive-thru-testing-coronavirus-face-shield-0313-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_business_face-shields-3d-printer_index_1588609376.html", "title": "3D printer companies step in to fill hospitals' desperate need for face shields", "title_page": "3D printer companies step in to fill hospitals' desperate need for face shields - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Doctors and nurses on the front lines of the coronavirus pandemic are in desperate need of face shields, crucial equipment to prevent the spread of the virus. But they're in extreme short supply. That's why tech companies are stepping up to help.\nThe transparent, plastic headgear resembling a welding mask protects medical professionals from infection while they're treating patients suffering from the deadly and highly-contagious disease. Hospital administrators responsible for acquiring personal protective equipment (PPE) for their staff say proper face shields are even harder to find these days than the surgical masks being horded by panic-buying consumers.\nFor weeks, government leaders and health officials have been talking about the nation's limited supply of N95 masks and other PPE, such as latex gloves and medical gowns. But the face-shield shortage has been under-covered, argues Dr. Kranthi Achanta, liaison officer for the Washington Township Medical Foundation in Fremont, California.\n\"If you have an N95 mask and you don't have a face shield, you don't have any protection,\" Achanta told CNN Business on Thursday.\n3D printer makers like Carbon, Prusa Research and Formlabs 3D Systems, have recently ramped up production to help meet face shield demand.\n\"Our production will go from 7,500 [face shields] this week to 15,000 next week,\" Carbon President and CEO Ellen Kullman told CNN Business on Wednesday. \"Between us and our partners, we'll have close to 18,000 face shields out. I think this number is going to grow considerably.\"\nFor years, Carbon and its competitors have been selling 3D printers that design and produce plastic parts more efficiently to leaders in manufacturing, aerospace, industrial production, tech, and the medical industry.\nFord Motor Company FPRC Adidas ADDDF Johnson & Johnson JNJ Carbon has 40 certified production network partners, including Fast Radius, The Technology House, Resolution Medical and Paragon, according to a company spokesperson. Each of those partners has a subscription to use Carbon's 3D printers and produces parts for customer companies, such as, and\nSince the coronavirus began spreading throughout the United States, Carbon and some of its customers have been adapting 3D printers to mass-produce face shields. Ford recently said that face shields made with its Carbon 3D printers were being tested at Detroit-area hospitals. The automaker said it initially plans to make 1,000 face shields per month, but wants to increase production as quickly as possible.\nIf the face shield shortage continues, Carbon can produce more than 50,000 face shields per week across its global network, a company spokesperson said.\nCarbon said its face shields vary in price depending on the volume it sells to each medical client. Hospitals and care providers can submit requests for equipment on Carbon's website\nWhy are face shields so important?\nA doctor from SOMOS Community Care prepares to test a patient at a drive-thru testing center for coronavirus at Lehman College on March 28, 2020 in the Bronx, New York City.\nA third of hospitalized coronavirus patients, those suffering from the most severe symptoms, need a medical tube inserted in their mouths and down their throats to help them breathe, a process called intubation, Dr. Achanta said. Intubated patients often cough and gag during the high-risk procedure, propelling spit and other bodily fluids onto the faces of medical staffers.\nNormally goggles and N95 masks would be enough to protect medical personnel from catching serious illnesses like HIV, according to Dr. Achanta, but since coronavirus is so contagious, most staffers prefer wearing face shields.\n\"We have two doctors and three nurses who have contracted the illness [Covid-19],\" Dr. Achanta said. \"One of them has been admitted to the hospital. ... A mask and goggles is not adequate for Covid-19. There are gaps all around the goggles that expose the eyes and elsewhere.\"\nIn recent weeks, Achanta said major PPE providers have focused their attention on coronavirus hotspots like New York and New Jersey, leaving his relatively smaller hospital network near the San Francisco Bay Area to fend for itself. So Washington Township Medical Foundation's administrative team has been forced to find alternative PPE providers for its staff members who treat an average of 12 to 15 coronavirus patients per day, he said.\n\"We were down to single digits of PPE and supplies,\" Dr. Achanta said. \"We reached out to Silicon Valley. Right now, without them we would be left with literally no face shields.\"\nChristian Lawson, director of emergency services at UNC Health Care in Chapel Hill, North Carolina, said he recently ordered 107,000 face shields for his 11 hospital network, which he said has more than 30,000 healthcare employees.\n\"[Face shields] are in limited supply across the country,\" Lawson told CNN Business. \"Some places don't even have them anymore. We're burning through those at a pretty quick clip.\"\nTraditional face shields cost about $15 apiece, according to Lawson, who said those units must be disposed of after each use. Individual medical staffers in his network usually run through 30 disposable face shields per day.\nLawson said the kind of face shields Carbon makes can be reused multiple times after being sterilized, reducing the rate of usage to two units per day.\n\"A PPE change of 30 a day, that's just burning through it,\" Lawson continued. \"[With reusable face shields] you go through one or two a shift with two nurses. From 30 to two, that's a drastic savings.\"\nLawson and Achanta said coronavirus has created a major business opportunity for 3D printer makers or their clients to permanently fill a void in PPE supply needs in the medical industry. Carbon's head of communications, Iska Hain Saric, said the company is just focused on relief efforts at the moment.\n\"Right now our focus is on providing these critical medical supplies to help healthcare workers on the front lines,\" she said.", "url": "https://www.cnn.com/2020/04/06/business/face-shields-3d-printer/index.html"}