{"authors": [], "date_download": "2020-05-04 20:27:37", "date_modify": "2020-05-04 20:27:37", "date_publish": "2020-04-17 20:36:28", "description": "FREMONT, Neb. (AP) — Two more workers have tested positive for coronavirus at a Nebraska plant that processes out chickens for Costco. That brings to three the number of confirmed...", "filename": "_3dadf1f751466d70fe459a969c2f7575_1588624057.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3dadf1f751466d70fe459a969c2f7575_1588624057.html", "title": "Nebraska chicken plant says 2 more workers have coronavirus", "title_page": "Nebraska chicken plant says 2 more workers have coronavirus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FREMONT, Neb. (AP) —\nTwo more workers have tested positive for coronavirus at a Nebraska plant that processes out chickens for Costco.\nThat brings to three the number of confirmed cases at the Fremont plant, the Omaha World-Herald reports . It said it got its first COVID-19 case on Monday.\nLincoln Premium Poultry supplies Costco with millions of rotisserie chickens and other cuts. The plant, which opened last September, employs roughly 1,100 people.\nThe two new employees who tested positive worked the day and night shift in the second processing part of the plant.\n“Once we learned these team members were demonstrating symptoms, we advocated for testing and also removed additional employees known to be in close contact with these individuals,” said spokeswoman Jessica Kolterman. “All employees are self-isolating at home with pay.”\nThe company has limited visitors to the plant, installed dividers in the cafeteria and deep-cleaned areas at night. The company gave masks to workers and is checking their temperatures before shifts start, she said. Workers also have been getting a $2 hourly raise since March.", "url": "https://apnews.com/3dadf1f751466d70fe459a969c2f7575"}