{"authors": ["Alan Suderman", "Sarah Rankin"], "date_download": "2020-05-04 20:14:32", "date_modify": "2020-05-04 20:14:32", "date_publish": "2020-04-07 16:39:24", "description": "RICHMOND, Va. (AP) — Virginia Gov. Ralph Northam plans to delay some long-sought Democratic priorities until more is known about the pandemic's affect on the economy, pushing back decisions on...", "filename": "_6853d11fccf2d1d0b5ad7f79f7e8f01f_1588623272.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8619aaf80bdb47a58b5c6905133cecbd/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6853d11fccf2d1d0b5ad7f79f7e8f01f_1588623272.html", "title": "Northam to postpone action on teacher raises, tuition freeze", "title_page": "Northam to postpone action on teacher raises, tuition freeze", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Traffic is sparse as it winds around the statue of Confederate General Robert E. Lee on Monument Ave near downtown Tuesday April 7, 2020, in Richmond, Va. Virginia Gov. Ralph Northam has instituted a stay at home order until June 10th for the entire state. (AP Photo/Steve Helber)\nTraffic is sparse as it winds around the statue of Confederate General Robert E. Lee on Monument Ave near downtown Tuesday April 7, 2020, in Richmond, Va. Virginia Gov. Ralph Northam has instituted a stay at home order until June 10th for the entire state. (AP Photo/Steve Helber)\nRICHMOND, Va. (AP) — Virginia Gov. Ralph Northam plans to delay some long-sought Democratic priorities until more is known about the pandemic’s affect on the economy, pushing back decisions on whether to give teachers and state workers raises, freeze in-state college tuition, and implement other new spending in budget recently passed by lawmakers.\nClark Mercer, the governor’s chief of staff, said Tuesday that too little is known about the impact of the coronavirus outbreak on state revenues to move ahead now with billions of dollars in new spending, much of which would carry over into future years.\n“We’ve got to wait for the fog to lift to make budget decisions informed by facts and data,” Mercer said.\nHe said the governor, a Democrat, is likely to request a budget reforecast this summer before calling lawmakers back into a special session to adjust spending priorities based on new numbers.\nThe pandemic is pounding state governments nationwide with a one-two punch, costing them millions in containment efforts just as businesses shut down and tax revenue collapses. The federal stimulus package should soften the blows with $150 billion in direct aid to states, but the long-term impact remains unclear.\nNortham, who ordered many businesses closed to reduce the spread of the coronavirus, has instituted a hiring freeze of state employees and directed agency heads to find ways to cut spending.\nVirginia’s coronavirus tally jumped by around 450 cases in one day to more than 3,300 people, with at least 63 dead, according to Tuesday’s figures from the Department of Health. Both totals are likely undercounts due to a lack of widespread testing, and the likelihood that many people without symptoms could be spreading the highly contagious virus.\nAmong the deaths are more than two dozen at the Canterbury Rehabilitation and Healthcare Center in Henrico County. Four more residents with COVID-19 have died, the facility’s administrator said in a statement Tuesday, bringing the death toll to 32. Forty-nine others have symptoms ranging from severe to mild, according to the statement.\nOnly a month has passed since the Virginia General Assembly, led by Democrats for the first time in more than two decades and buoyed by a stronger-than-expected economy and record-low unemployment, passed a $135 billion, two-year state budget plan. It is heavy on new spending on public education, social services and other areas.\nThe pandemic has cast in doubt many of the Democrats’ long-sought priorities, such as raises for teachers and state employees, a tuition freeze at public universities, new money to provide dental coverage for adults on Medicaid, and extra money for early education and vocational training.\nNortham has until Saturday to amend, sign or veto most legislation passed during this year’s legislative session, including the budget. Lawmakers are scheduled to take up the governor’s vetoes and amendments during a one-day session later this month.\nOther closely watched measures the governor hasn’t yet signed include labor and employment bills that advocates say would help low-income workers but the business community warns would hurt the state’s economy. Lawmakers approved hiking the minimum wage and, in a historic shift, passed a bill to allow limited public sector collective bargaining, previously banned.\nBusiness interests have continued to lobby the governor seeking to delay the bills’ implementation.\n“The negative impact these bills will have on our members’ livelihood is even more critical considering the economic devastation many of our members are facing,” business groups wrote in a letter to Northam.\nUnions and others workers’ advocates say the economic fallout makes signing the new legislation even more critical.\nDurann Thompson, a third grade teacher in Fairfax County Public Schools, called the opposition to collective bargaining bill “profoundly insulting.”\nThompson said teachers have risen to the challenge of educating students online after Northam closed schools the rest of the academic year, even while many are caring for their own children at home.\n“This pandemic is being used by anti-worker forces as an excuse to continue to deny teachers the opportunity to sit at the table and be heard,” she said in a conference call organized by a coalition of unions.\nThe Northam administration hasn’t said yet what it will do, but has indicated a willingness to delay some of the measures.\n“We are sensitive to when they go into effect,” Mercer said.\n_____\nFollow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/6853d11fccf2d1d0b5ad7f79f7e8f01f"}