{"authors": ["Luke Savage", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Branko Marcetic", "Connor Kilpatrick"], "date_download": "2020-05-04 19:49:17", "date_modify": "2020-05-04 19:49:17", "date_publish": "2020-05-01 00:00:00", "description": null, "filename": "2020_05_joe-biden-larry-summers-democrats-wall-street_1588621757.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/05/01162753/GettyImages-91339276.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_05_joe-biden-larry-summers-democrats-wall-street_1588621757.html", "title": "The Committee to Save the Rich", "title_page": "The Committee to Save the Rich", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Earlier this month, a coalition of progressive groups published an open letter to Joe Biden concerned with how he might earn young people’s support.\nThe letter’s authors were probably under no illusions that a politician like Biden would actually embrace many of their demands — which included adopting the broad framework of the Green New Deal, backing Medicare for All, and enacting sweeping reforms to America’s immigration and criminal justice systems. Nevertheless, in the context of a moment when Biden would be actively seeking to win over the younger and more progressive-minded voters he’d struggled so badly with during this year’s primary election, it was reasonable to think he might at least throw them a bone or two.\nAmong the most concrete (and easily realizable) demands the groups offered had to do with staffing — specifically a pledge they hoped Biden would make to “appoint zero current or former Wall Street executives or corporate lobbyists, or people affiliated with the fossil fuel, health insurance, or private prison corporations” to his transition team, advisory roles, or to cabinet.\nBarely two weeks later, Biden as good as replied when it emerged he’d appointed none other than Larry Summers to advise him on economic policy — specifically on plans to revive the American economy after the coronavirus. Though Summers has a fairly well-established reputation as a right-leaning liberal, many probably won’t grasp the significance of the former Obama/Clinton staffer and Harvard president’s appointment. Coming when it does, the Biden campaign’s embrace of Summers stands in direct contravention to much of its official messaging around policy and party unity, the candidate himself recently promising to be “the most progressive president” since Franklin Delano Roosevelt. No less than Bloomberg seemed to recognize this obvious contradiction when it noted in its reporting on the appointment:\nSummers’s involvement in Biden’s campaign . . . offered some reassurance [to] Wall Street that Biden is not moving too far to the left from the centrist positions that earned him his establishment support.\nIn the short term at least, this is an accurate assessment of Team Biden’s affiliation with Summers: an on-the-record fan of Milton Friedman whose image is practically synonymous with deregulatory policies and deference to Wall Street. Having worked to reduce the scale of infrastructure investment during the early days of the Obama presidency, Summers originally cut his teeth in government under Clinton, where he pushed to repeal Glass–Steagall — a move some have argued was a significant catalyst for the global economic collapse of 2008 — and advocated for a zealous privatization policy in the former USSR that ultimately had horrendous consequences. During the earliest days of the Obama administration, when activist governance was supposedly back in vogue and popular hostility to organized wealth was cresting, Summers would remark: “One of the reasons that inequality has probably gone up in our society is that people are being treated closer to the way that they’re supposed to be treated.” Last year, he came out strongly against a wealth tax on the grounds that it might discourage the billionaire class from “investing [their] money in the ways they think are most productive” since, after all, they’d been “smart enough to accumulate it in the first place.”\nThere are certainly other, less ideological reasons to be angry about Summers’s appointment. Just as the Biden campaign evidently has no regrets about hiring Harvey Weinstein’s PR flunky Anita Dunn, it apparently doesn’t think Summers’s track record of misogyny or dubious connections are any kind of liability (or, perhaps, just plain doesn’t care). As president of Harvard, Summers cultivated a close personal and professional relationship with now-deceased sex criminal Jeffrey Epstein — a relationship that continued after Epstein’s initial conviction for soliciting sex from a minor. He was eventually forced to resign the presidency at Harvard amid a controversy prompted by remarks about female aptitude in math and science.", "url": "https://jacobinmag.com/2020/05/joe-biden-larry-summers-democrats-wall-street"}