{"authors": ["Leah Asmelash"], "date_download": "2020-05-04 17:00:42", "date_modify": "2020-05-04 17:00:42", "date_publish": "2020-04-10 06:58:52", "description": "A new study backs up what has already been documented anecdotally in the last few months: The coronavirus pandemic has coincided with a surge in Sinophobic, or anti-Chinese, sentiments -- especially online.", "filename": "2020_04_10_us_sinophobic-ra_e9d0957d41b4552ae87e8cf468747fce_index_1588611642.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407155858-wuhan-crowds-train-station-0408-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_sinophobic-ra_e9d0957d41b4552ae87e8cf468747fce_index_1588611642.html", "title": "With the spread of coronavirus came a surge in anti-Asian racism online, new research says", "title_page": "With the spread of coronavirus came a surge in anti-Asian racism online, new research says - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A new study backs up what has already been documented anecdotally in the last few months: The coronavirus pandemic has coincided with a surge in Sinophobic, or anti-Chinese, sentiments -- especially online.\nResearchers at the Network Contagion Research Institute, an independent third party that tracks misinformation and hate across social media channels, released a report Wednesday that looked at the spread of hate online toward Asians in congruence with the pandemic.\naccording to the \"As a conjoined threat, outbreaks of hate and disinformation on social media comprise unparalleled dangers to society in the face of actual viral pandemics, such as Covid-19,\"according to the study , which is titled \"Weaponized Information Outbreak: A Case Study on Covid-19, Bioweapon Myths, and the Asian Conspiracy Meme.\"\n\"NCRI's research indicates that hateful communities may serve as sources of spread for disinformation and propaganda during politically volatile events for purposes of hate.\"\nThe group of researchers first looked at 4chan, an online bulletin board that frequently features offensive posts, and found a rise in derogatory terms for Chinese people around February of this year. Other terms and slurs toward minority groups decreased or flatlined in relation to topics surrounding the virus, research found.", "url": "https://www.cnn.com/2020/04/10/us/sinophobic-racism-rise-coronavirus-research-trnd/index.html"}