{"authors": ["Por Dánica Coto"], "date_download": "2020-05-04 20:15:53", "date_modify": "2020-05-04 20:15:53", "date_publish": "2020-04-08 20:16:02", "description": "SAN JUAN (AP) — Puerto Rico anunció el miércoles que ampliará su clasificación de muertes por COVID-19 para incluir casos sospechosos que nunca fueron confirmados, abordando un problema que ha...", "filename": "_51133833f9044529b236b83aad8f4f6e_1588623353.html", "image_url": "https://storage.googleapis.com/afs-prod/media/18569f7387804813903a333a43461883/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_51133833f9044529b236b83aad8f4f6e_1588623353.html", "title": "Puerto Rico amplía criterio para conteo de muertes por COVID", "title_page": "Puerto Rico amplía criterio para conteo de muertes por COVID", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nSAN JUAN (AP) — Puerto Rico anunció el miércoles que ampliará su clasificación de muertes por COVID-19 para incluir casos sospechosos que nunca fueron confirmados, abordando un problema que ha afectado los conteos en todo el mundo.\nLa isla ha enfrentado fuertes críticas por no hacer pruebas de detección de coronavirus de manera más amplia y por apoyarse en información limitada para implementar un toque de queda y para producir estimados de cuándo pudiera alcanzarse el ápice del brote.\nEl secretario de Salud Lorenzo González dijo que los médicos pueden clasificar una muerte como relacionada con el COVID-19 sin tener que esperar los resultados de laboratorio.\n“De igual forma, mantenemos uniformidad con el resto de los estados de Estados Unidos... lo que nos brindará un panorama más claro de cómo vamos en comparación con toda la nación”, dijo en un comunicado.\nEl portavoz Eric Perlloni le dijo a The Associated Press que las muertes previas serían revisadas, pero no proveyó detalles, incluyendo quién estaría a cargo de revisar esos casos ni cuán atrás examinarían.\nLas autoridades de varios países han reconocido que los conteos oficiales de muertes por COVID-19 han estado por debajo de la cifra real por fata de pruebas de detección, un problema que ha sido notado especialmente en las muertes en asilos de ancianos en Europa. El asunto es delicado en Puerto Rico, donde las autoridades admitieron eventualmente que un estimado de 2.975 personas habían muerto a causa del huracán María, muchos más que los centenares inicialmente reportados.\nEl gobierno de Puerto Rico tampoco ha compartido información sobre cuántos pacientes se han recuperado, ni cuántos profesionales de la salud han resultado infectados. En total, Puerto Rico ha reportado 24 muertes y más de 600 casos confirmados, y apenas 6.000 personas sometidas a pruebas en una isla de 3,2 millones de habitantes.\nEl anuncio fue hecho horas después de que la gobernadora Wanda Vázquez dijo que les había pedido a funcionarios federales que prohibiesen todos los vuelos desde ciudades estadounidenses con un alto número de casos de coronavirus para ayudar a prevenir contagios en la isla.\nEl pedido a la Administración Federal de Aviación fue hecho luego de que las autoridades acusaron a algunos visitantes de tomar medicamentos para bajar la fiebre para evitar ser colocados en cuarentena por las tropas de la Guardia Nacional que examinan a los pasajeros en el principal aeropuerto de Puerto Rico.\nAl menos dos pasajeros procedentes de Nueva York que bajaron sus temperaturas con medicamentos están hospitalizados ahora en la isla con COVID-19, dijo el teniente coronel Paul Dahlen, portavoz de la Guardia Nacional.\n“Ellos mismos lo admitieron”, señaló, y agregó que ambas personas llamaron a las autoridades cuando su condición se deterioró y que una de ellas está conectada a un respirador artificial.", "url": "https://apnews.com/51133833f9044529b236b83aad8f4f6e"}