{"authors": ["Kevin Liptak"], "date_download": "2020-05-04 16:11:19", "date_modify": "2020-05-04 16:11:19", "date_publish": "2020-04-03 00:17:17", "description": "It's the piece of advice long-timers offer nearly every new arrival to President Donald Trump's ranks: bring visual aids. Luckily for Drs. Anthony Fauci and Deborah Birx, charts are their thing.", "filename": "2020_04_02_politics_anthony_afb120bb7ebfb12b5154a165b4a441f2_index_1588608679.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402160556-01-dr-birx-trump-chart-0331-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_anthony_afb120bb7ebfb12b5154a165b4a441f2_index_1588608679.html", "title": "How Fauci and Birx got Trump to listen to science", "title_page": "How Fauci and Birx got Trump to listen to science - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) It's the piece of advice long-timers offer nearly every new arrival to President Donald Trump's ranks: bring visual aids. Luckily for Drs. Anthony Fauci and Deborah Birx , charts are their thing.\nSummoned to the Oval Office last weekend to state their case for keeping the country closed , Fauci and Birx arrived armed with tangled multicolored lines, stippled mountains of various heights and one ominous inky blue bell curve showing American deaths from coronavirus rising to 2.2 million if social distancing efforts were abandoned\nThe graphics were weaponry in a pitched battle with some of Trump's economic advisers -- and at times with Trump himself -- who argued continued restrictions against large gatherings were ravaging the American economy. Evidence of that was delivered Thursday when the federal government announced jobless claims skyrocketed to 6.6 million last week.\nStill, the charts -- printed in color and blown up for effect -- seemed to work, even as some of Trump's advisers now question their accuracy. Trump announced hours later he was extending his coronavirus guidelines another 30 days, despite a strong inclination to open the nation for business.\nAs the pandemic rages and Trump's response comes under withering scrutiny, Fauci and Birx -- the two top medical experts on the White House coronavirus task force -- have emerged as central figures advising Trump and fixations for a nation grappling with a generation-defining crisis.\nThey haven't been able to salvage an administration response pocked with early missteps, shifting public messaging and persistent delays in necessary testing and supplies. And they have found themselves repeatedly at odds with some of Trump's political and economic advisers, who have privately questioned the accuracy of their models and grumbled about their outsized influence.\nBut in myriad ways, Fauci and Birx have succeeded where so many in Trump's ever-rotating cast of aides have not: convincing the President to abandon his instincts, quietly contradicting him in public and remaining -- for now -- in his good graces. At a post-impeachment moment when the White House appeared intent on elevating loyalists while sidelining careerists, the longtime government officials entered Trump's orbit and managed to out-argue those with years of experience managing a mercurial boss.\nThere have been some signs of strain. At Thursday's task force briefing, Trump seemed alarmed when Birx suggested some Americans weren't following the distancing guidelines, causing the line of contagion to inch upward. He stepped in after she spoke, insisting certain states were doing well and saying he didn't want headlines that his recommendations were being ignored.\nBut he was soon back to praising his advisers' expertise, recalling hearing from Fauci and Birx that he \"may need have close it up\" to prevent further spread.\n\"Close what up?\" he remembered asking. \"What's that all about?\"\nSome officials working with the task force have wondered whether Fauci and Birx -- who have known each other for decades and have what each describe as a mentor-mentee relationship -- are actively calibrating their tactics into a \"good cop, bad cop\" approach. Others who are familiar with the dynamic say each is merely operating as a public health professional and presidential adviser amid the highest-stakes crisis of either of their careers.\nA rapt 'student'\nTrump, who is known for following his gut in most matters, has described himself as a \"student\" of Fauci and Birx's expertise, rapt by the virus wreaking havoc on the nation and his presidency. It's an accomplishment that hasn't gone unnoticed among Trump's allies, some of whom view the achievement with something like awe.\n\"He listens to everything they say. No one else has come in and grabbed his attention like that,\" said one White House official who declined to be named, adding it was anybody's guess how long the current situation would last.\nOther Trump allies have voiced more skepticism. After models were presented this week showing as many as 240,000 Americans could die even with strict social distancing measures in place, some Trump aides claimed privately that Fauci and Birx were being overly dire in their predictions and were not taking into account economic or political concerns. The underlying data for the models remains unknown, though Birx said she used the work of several modelers to make the projections.\nTrump was adamant on Thursday that he made the right call, lending support to Fauci and Birx and suggesting he is unbothered by questions about the models' accuracy.\n\"Here's the thing: they were right,\" he said. \"Everybody questioned it for a while. A good portion questioned it. They said let's keep it open, let's ride it. If we did that -- you saw the other graph. And whether it's true or almost true or maybe not true enough, the number was 2.2 million people would have died.\"\nFauci addressed the decision earlier in the week.\n\"We are scientists, physicians, public health officials. We're not economists,\" he said on CNN's \"New Day.\" \"We're sensitive to the idea that the economy could suffer, but it was patently obvious looking at the data, that at the end of the day if we try to push back prematurely, not only would we lose lives, but it probably would even hurt the economy.\"\nStill, the stunningly bad weekly jobless claims report on Thursday , while expected, only underscored for some inside the White House that the economic argument for reopening parts of the country had lost out to the health concerns heralded by Birx and Fauci. And officials continue to raise questions internally about the staggering death projections presented earlier this week.\nIn meetings of the coronavirus task force, which Trump sometimes arrives to unplanned, the two immunologists have adopted somewhat different approaches, according to people familiar with the dynamic. Both bring an \"adult in the room\" level of credibility that officials say is usually well-received.\nDiffering approaches\nJUST WATCHED Dr. Fauci: Trump 'got it right away' when he saw the data Replay More Videos ... MUST WATCH Dr. Fauci: Trump 'got it right away' when he saw the data 02:25\nAs in public briefings, Fauci isn't hesitant to offer unvarnished thoughts or analysis even when it seems to contradict the President. He's warned the speed of developing a coronavirus vaccine isn't nearly where Trump has suggested it could be and he's cautioned that the possible treatments Trump touts in public haven't yet proved effective.\nFrank public disagreements between Trump and a top official are virtually unprecedented in his administration. Earlier in the crisis, Trump grew enraged when an official with the Centers for Disease Control and Prevention suggested the situation would worsen badly in the United States, believing her assessment overly fatalistic.\nBlunt candor hasn't always endeared Fauci to Trump either; the President has complained in private when it seems he's being contradicted by the nation's top infectious disease specialist. But Trump has also said he prefers the direct approach and would rather his aides be more forthcoming (something few of them actually believe).\nBirx, who was detailed from the State Department to act as the White House coronavirus response coordinator, has chosen a somewhat different approach. Aides describe her as patient in meetings with the President, even when he is offering lengthy medical opinions or theories that have little basis in science. Instead of interjecting or cutting Trump off, she has waited for him to finish before laying out more reality-based ideas.\nShe has found key areas where she is able to use her apolitical credibility to bolster Trump's proposals, including his call to limit travel from China and Europe. She was an early supporter of those steps, which Trump now cites repeatedly as evidence of his handling of the crisis, even as other areas have fallen badly short.\nAnd she has arrived to nearly every meeting laden with folders stuffed with tables and charts, the data on which she relies to inform Trump of how the virus is spreading. While she has generally acted as a reassuring presence at daily White House briefings, it fell to Birx this week to deliver the grim models showing hundreds of thousands of potential US deaths.\nBefore the crisis, Trump was familiar only from afar with Fauci, who had been a regular television presence during disease outbreaks for the past three decades. However, they hadn't interacted during the first three years of Trump's term.\nThough Birx was not personally close to the President, she was able to develop a close relationship with this White House in part because Trump campaign official Matt Mowers served as her chief of staff for nearly two years, according to a source familiar with her situation.\nPersonal rapport\nJUST WATCHED Trump jokes with health official after she mentions low fever Replay More Videos ... MUST WATCH Trump jokes with health official after she mentions low fever 02:04\nNow, after untold hours of meetings, both have developed a rapport with Trump, who has praised them as \"great geniuses.\" During Wednesday's briefing, Trump recalled Fauci's basketball prowess as a high school player in the 1950s. Birx has used personal anecdotes to relay the importance of social distancing both to Americans at large and to Trump himself. When she told reporters last month she had self-quarantined after detecting a mild fever, Trump backed away in mock horror.\nBoth are regular presences in the West Wing as the coronavirus response consumes the White House. Birx was given West Wing office space in mid-March and Fauci is in the building nearly every day for meetings.\n\"All of a sudden, now I'm in a situation where I spend like more than an hour every day with him,\" Fauci told CNN's Sanjay Gupta in an interview this week. \"I mean, we go there, we brief him, we have a press conference, we debrief after the press conference.\"\nTheir efforts have earned equal amounts of scorn and praise from the political left and right, all complicated by the fact each worked under previous presidents, a trait Trump has sometimes viewed skeptically.\nWhen Fauci was seen rubbing his forehead after Trump made an aside about the \"deep state\" in a briefing last week, online critics pounced, claiming he was insulting the President. The threats against Fauci by online conspiracy theorists and some on the far right have become so vitriolic that he is receiving enhanced security from the US Marshals Service, a request that was signed off by the Justice Department on Wednesday.\nBirx has come under fire from the other side, with some of Trump's critics questioning her independence after she dismissed reports of ventilator and hospital bed shortages, despite concerns loudly voiced by hospital workers and governors. Comments she made about Trump's working style were also lambasted as overly obsequious by some on the left.\n\"He has been so attentive to the details and the data, and his ability to analyze and integrate data has been a real benefit during these discussions about medical issues,\" she told the Christian Broadcasting Network in an interview last week.\nBoth have also been headliners in an administration response hobbled by testing failures and delays in distributing badly needed supplies, not to mention the two months Trump spent downplaying the risk of contagion to the US. Whatever success they have had in convincing the President to do more to prevent the disease's spread will inevitably be viewed alongside the larger failures in the response.\nSo far, however, their presence inside the White House has provided some reassurance to Americans worried at how the federal government is handling the pandemic. And -- for now at least -- they are holding their ground.\n\"We argued strongly with the President that he not withdraw those guidelines after 15 days but that he extend them, and he did listen,\" Fauci said on CNN this week. \"Dr. Debbie Birx and I went into together in the Oval Office and leaned over the desk and said, here are the data, take a look. He looked at them, he understood them, and he just shook his head and said, 'I guess we've got to do it.' \"", "url": "https://www.cnn.com/2020/04/02/politics/anthony-fauci-deborah-birx-coronavirus-trump/index.html"}