{"authors": ["Susan Haigh", "Dave Collins"], "date_download": "2020-05-04 20:09:02", "date_modify": "2020-05-04 20:09:02", "date_publish": "2020-04-16 15:25:20", "description": "HARTFORD, Conn. (AP) — The coronavirus outbreak has killed 10 or more residents in eight nursing homes across Connecticut, according to state figures released on Thursday. Nursing home...", "filename": "_87f1fc32aea27e30f8c32dc2c955a159_1588622942.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8e6a5d59aef14476b24a809dff9f02df/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_87f1fc32aea27e30f8c32dc2c955a159_1588622942.html", "title": "Many Connecticut nursing homes have had over 10 virus deaths", "title_page": "Many Connecticut nursing homes have had over 10 virus deaths", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Connecticut National Guard reserve soldiers remove old office equipment from storage while setting up more than 30 beds for recovering COVID-19 patients at Quinnipiac Valley Center, Wed., Apr. 15, 2020. The center is sixth on the state's list of facilities being designated for COVID-19 patient recovery. (Dave Zajac/Record-Journal via AP)\nConnecticut National Guard reserve soldiers remove old office equipment from storage while setting up more than 30 beds for recovering COVID-19 patients at Quinnipiac Valley Center, Wed., Apr. 15, 2020. The center is sixth on the state's list of facilities being designated for COVID-19 patient recovery. (Dave Zajac/Record-Journal via AP)\nHARTFORD, Conn. (AP) — The coronavirus outbreak has killed 10 or more residents in eight nursing homes across Connecticut, according to state figures released on Thursday.\nNursing home residents account for 375 of the 971 people in Connecticut to die from the virus, which has spread quickly through nursing homes around the country.\nTwo Connecticut nursing homes have had 15 deaths — the Gardner Heights Health Care Center in Shelton and the Abbott Terrace Health Center in Waterbury, according to state officials.\nAthena, however, which owns Abbott Terrace, said Thursday night in a written statement that its internal count of deaths is six.\nThe state’s tally appears to include residents who were already receiving hospice services prior to contracting COVID-19, the company said.\n“We are not confident that the numbers in the report are an accurate depiction of our centers,” the company said. “Several of our centers have accepted COVID-19 positive residents from area assisted livings and other nursing homes who were unable to be cared for in those settings.”\nPhone and email messages seeking comment Thursday night from a representative of Gardner Heights were not immediately returned.\nJosh Geballe, the chief operating officer for Gov. Ned Lamont, said at a news conference Thursday that the deaths represent about 2% of the beds inside state nursing homes that have reported infections.\n“So I think it’s a real testament to our nursing homes, to the nurses and the staff there and the work they’ve been doing to put in place the right infection control procedures,” Geballe said. “We know that this is a highly at-risk population. We’ve seen that across the nation, across the world, and the teams are doing great work within the nursing homes to really protect the residents.”\nNursing home residents account for 1,713 confirmed cases of the virus in the state, out of a statewide total of 15,884, according to the state’s numbers.\nIn other coronavirus developments around Connecticut:\nCONDITIONS FOR REOPENING\nA two-week decline in hospitalization rates, data from mass testing and contact tracing, and an adequate amount of available protective gear, are some of the metrics that will ultimately help decide when and how Connecticut begins to reopen after the coronavirus pandemic has mostly subsided, Lamont said Thursday.\nA newly formed state advisory committee, which includes a top epidemiologist from Yale University, has been charged with considering things like which businesses and industries should reopen first and with what kinds of protections. It also will look into whether social distancing measures should be relaxed in some parts of the state before others and for certain groups of people.\n“The first criteria is that we have to have a decline in cases and hospitalizations,” said Dr. Albert Ko, a professor of epidemiology and medicine and a department chair at the Yale School of Public Health. “This is not only important in terms of controlling outbreak, but we need to make sure that we’re out of this surge and that we protect our hospitals.”\nAs of Thursday, there were 1,926 people hospitalized in Connecticut with COVID-19, an increase of 18 from Wednesday, while 971 people have died from COVID-related causes, an increase of 103 from Wednesday.\nLamont has set May 20 as the date to reassess when or if the state should begin lifting restrictions on individuals, schools and businesses.\nConnecticut’s multi-pronged approach appeared to mostly gel with guidelines released Thursday by the White House on ways states, individuals and employers can gradually revive activity and ease up on social distancing in areas where COVID-19 cases are on the decline.\nIn other coronavirus developments around Connecticut:\n___\nMILITARY MEDICAL STAFF BEGIN CARE\nSoldiers with the Connecticut National Guard and U.S. Army Reserve have begun caring for COVID-19 patients at Stamford Hospital as part of a military effort to support medical staff across the country during the coronavirus outbreak, officials said Thursday.\nThe soldiers are working in a recently reopened building on the campus of the 305-bed hospital, said Capt. David Pytlik, a spokesman for the Connecticut National Guard. The medical crews include 85 Army reservists and nine state guardsmen, he said.\nThere were four patients being treated by the military units in the new area Thursday, hospital spokeswoman Andie Jodko said.\nThe Army has deployed about 15 medical units to help with patient care nationwide.\nBridgeport Hospital has begun moving COVID-19 patients into a 32-bed mobile field hospital and it is nearing capacity, a hospital spokesman said Thursday. The tent is being used to treat patients with less acute cases, but it is equipped with ventilators if needed, spokesman John Cappiello said.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness or death.\nNEW UNEMPLOYMENT NUMBERS\nNewly released unemployment data for Connecticut show the state lost 7,600 jobs in March, statistics state labor officials noted do not reflect the full impact of the COVID-19 pandemic on the state’s jobless picture. The data from the U.S. Bureau of Labor Statistics, released Thursday, stem from the second week of March.\n“We know from unemployment insurance claims that the leisure and hospitality, health care and retail sectors were severely impacted by furloughs and closures,” said Andy Condon, director of the Connecticut Department of Labor’s Office of Research, in a written statement. A more accurate picture is expected next month.\nDon Klepper-Smith, chief economist and director of research at DataCore Partners LLC, said the 7,600 job losses mark the largest monthly drop in Connecticut since January 2010.\n___\nAssociated Press Writer Pat Eaton Robb contributed to this report.\n___\nThis story has been corrected to show that the Stamford Hospital building where the military units are now treating patients was not scheduled for demolition.", "url": "https://apnews.com/87f1fc32aea27e30f8c32dc2c955a159"}