{"authors": [], "date_download": "2020-05-04 20:17:11", "date_modify": "2020-05-04 20:17:11", "date_publish": "2020-04-15 13:33:06", "description": "PROVIDENCE, R.I. (AP) — Rhode Island is creating a network of college dorm rooms and cut-price hotel rooms for people who need to remain quarantined during the coronavirus pandemic, Gov. Gina...", "filename": "_f2f736783c1fde95dbea008bc5a1936f_1588623431.html", "image_url": "https://storage.googleapis.com/afs-prod/media/67f3d90b0f5749d1b248848e0016c292/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f2f736783c1fde95dbea008bc5a1936f_1588623431.html", "title": "State creating quarantine sites; nursing home worker testing", "title_page": "State creating quarantine sites; nursing home worker testing", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Passers-by, right, wear masks out of concern for the coronavirus while walking past dresses on display in the window of an Anthropologie store, in Cranston, R.I., Wednesday, April 15, 2020. The first U.S. economic indicators to capture the devastation brought on by the pandemic have begun to arrive, showing a plunge in retail sales exceeding what happened during the economic crisis a decade ago. (AP Photo/Steven Senne)\nPassers-by, right, wear masks out of concern for the coronavirus while walking past dresses on display in the window of an Anthropologie store, in Cranston, R.I., Wednesday, April 15, 2020. The first U.S. economic indicators to capture the devastation brought on by the pandemic have begun to arrive, showing a plunge in retail sales exceeding what happened during the economic crisis a decade ago. (AP Photo/Steven Senne)\nPROVIDENCE, R.I. (AP) — Rhode Island is creating a network of college dorm rooms and cut-price hotel rooms for people who need to remain quarantined during the coronavirus pandemic, Gov. Gina Raimondo said Wednesday.\nThe dorm rooms at the state colleges will be for health care workers and first responders who, while not necessarily infected with the disease, don’t want to risk the health of family or roommates by staying at home, the Democrat said at her daily news conference.\nThe state has also worked with the hospitality industry to create RIHavens.com, which offers hotel rooms for as little as $25 per night for people who need a place to quarantine.\nMore than 6,000 people are currently in quarantine in the state and a network of volunteers is providing them with daily prepared meals and grocery deliveries so they don’t have to leave their homes, she said.\nMore developments in Rhode Island:\nNURSING HOME WORKERS\nRhode Island has also partnered with CVS Health for fast-track testing of nursing home workers at the CVS testing site at the Twin River Casino in Lincoln, Raimondo said.\nNursing home workers can be tested at the site without an appointment. Results are usually available within minutes, rather than days.\nResidents of nursing homes and assisted living facilities are particularly susceptible to COVID-19.\n___\nSEVEN MORE DEATHS\nRhode Island reported seven more COVID-19 fatalities on Wednesday, bringing the state death total to 87, state Department of Health Director Nicole Alexander-Scott said at a news conference.\nOf the seven new deaths, four people were in their 80s, two were in their 90s and one was a centenarian. Six of them lived in nursing homes, she said.\nAn additional 278 people have tested positive for the disease, bringing the state total to more than 3,500.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and the infirm, it can cause more severe illness, including pneumonia, or death.\n___\nPOLICE OFFICERS SICKENED\nNine Providence police officers and one city firefighter have tested positive for COVID-19, the city’s public safety commissioner said Wednesday.\nOf the nine officers, two have recovered and returned to work, Commissioner Steven Pare told The Providence Journal.\nThe others who have tested positive and one other officer are in quarantine.\nIn addition to the one firefighter who has tested positive, another is quarantined for potential exposure, he said.\n“For nearly 900 police and fire, that’s a pretty good number,” Pare said.\n___\nMASK PURCHASE COLLABORATION\nThe city of Providence and the city’s firefighters’ union have collaborated to buy 34,000 N95 face masks for first responders and front-line city staff dealing directly with the public to protect them from exposure to the coronavirus.\nAbout 8,000 masks have already been distributed, and the others are on the way, according to the office of Mayor Jorge Elorza.\n“We have closely been monitoring our staff needs during this time and I am glad that we are able to provide these critical employees with the tools necessary to protect themselves and others during this time,” Elorza said.\nFirefighters are already required to wear masks and gloves when responding to calls.\n___\nSCAM WARNING\nThe Rhode Island State Police Financial Crimes Unit is warning residents to be extra vigilant of scammers trying to take of advantage of the coronavirus pandemic.\nThe unit said it is aware of “an exponential increase” in COVID-19-related fraud.\nThe scams include people posing as government agencies and representatives to get personal information from consumers, and fraudulent online sales and offers of coronavirus equipment or treatments. Anyone who thinks they have been targeted by scammers should contact law enforcement.", "url": "https://apnews.com/f2f736783c1fde95dbea008bc5a1936f"}