{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:15:20", "date_modify": "2020-05-04 20:15:20", "date_publish": "2020-04-28 00:12:07", "description": "“Now it’s time to set a new course,\" Republican Gov. Greg Abbott said.", "filename": "entry_texas-stay-at-home-order-businesses-coronavirus_n_5ea76acdc5b6a30004e6f85c_1588623320.html", "image_url": "https://img.huffingtonpost.com/asset/5ea76fb93000002c11154ffc.jpeg?cache=ckaralje1j&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_texas-stay-at-home-order-businesses-coronavirus_n_5ea76acdc5b6a30004e6f85c_1588623320.html", "title": "Texas Will Allow Stay-At-Home Order To Expire Thursday, Letting Some Businesses Reopen", "title_page": "Texas Will Allow Stay-At-Home Order To Expire Thursday, Letting Some Businesses Reopen | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Texas Gov. Greg Abbott (R) said Monday he would let the state’s stay-at-home order expire as planned on Thursday and let some businesses begin to reopen in phases amid ongoing concerns over the spread of the coronavirus.\n“Now it’s time to set a new course, a course that responsibly opens up business in Texas,” Abbott said at a news conference. “Just as we united as one state to slow COVID-19, we must also come together to begin rebuilding the lives and the livelihoods of our fellow Texans.”\nHis decision supersedes all local orders, he added.\nThe state will allow locations to open in phases. Businesses including retail stores, movie theaters and restaurants will be able to open beginning Friday as long as they limit capacity to 25%, as will libraries and museums. The governor will consider a second phase as early as May 18, which would allow capacity to increase to 50%, but only if there is no resurgence in cases of the virus.\nTexas, the nation’s second-most populous state, behind California, has had a stay-at-home order in place for just under four weeks, among the shortest in the country. But Abbott said it had “done its job to slow the growth of COVID-19.”\nMany of the nation’s top medical officials remain concerned that cases of the coronavirus could rebound if parts of the country reopen too soon. Dr. Anthony Fauci, the country’s top infectious disease expert, said last week that if governors jump the gun on reopenings, it could “backfire,” warning that any type of economic recovery couldn’t happen “unless we get the virus under control.”\nFauci repeatedly has urged caution and has noted he’s convinced the coronavirus will continue to circulate until at least the fall.\nDemocrats in Texas opposed Abbott’s move to let the stay-at-home order expire, saying the country was still woefully behind in its testing capabilities. The University of Texas at Austin also released a model showing the state had not reached its peak in COVID-19 deaths yet. More than 25,000 people have been infected in the state and nearly 700 have died.\n“Today is a dark day in the Lone Star State. Abbott’s decision to let Texas’ stay-at-home order expire is reckless, irresponsible, and puts all of us at risk,” Manny Garcia, the executive director of the Texas Democratic Party, said in a statement. “From day one, Trump and Abbott have constantly downplayed the coronavirus threat and didn’t take it seriously enough ― now we are paying the price.”\nHouston Mayor Sylvester Turner (D) said Abbott’s decision effectively takes cities’ ability to issue their own stay-at-home orders and enforcement measures “out of our hands.” Turner said he hoped the plan works but cautioned residents that cases of COVID-19 had “not disappeared from our city.”\nWe are letting Houstonians know that #COVID19 has not disappeared from our city.\nTesting is important and we have to ease in to opening and rely on the science and facts we have been presented. — Sylvester Turner (@SylvesterTurner) April 27, 2020\nAbbott on Monday still urged Texans to abide by social distancing practices even as the stay-at-home orders lift, saying further phases of the reopening process could only take place if there are no flare-ups and vulnerable populations were protected.\n“That is exactly why now, more than ever, Texans must continue safe-distancing practices,” he said. “If we do that, we will be able to expand into Phase 2, opening up our economy even more.”", "url": "https://www.huffpost.com/entry/texas-stay-at-home-order-businesses-coronavirus_n_5ea76acdc5b6a30004e6f85c"}