{"authors": ["David Mckenzie", "Brent Swails"], "date_download": "2020-05-04 16:05:56", "date_modify": "2020-05-04 16:05:56", "date_publish": "2020-04-02 07:07:31", "description": "So far more than 1,300 people have been confirmed with the disease in South Africa, but authorities are bracing for the worst.", "filename": "2020_04_02_africa_homeless-_0842bab47829c9ef65848ce2271f4019_index_1588608356.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402080410-mckenzie-grab-5-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_africa_homeless-_0842bab47829c9ef65848ce2271f4019_index_1588608356.html", "title": "South Africa coronavirus: homeless people gathered into sports stadium as pandemic divides rich from poor", "title_page": "South Africa coronavirus: homeless people gathered into sports stadium as pandemic divides rich from poor - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Johannesburg, South Africa (CNN) The policeman raised his bullhorn to shout instructions, backed up by a group of soldiers piling out of an armored personnel carrier.\n\"Go home. Get your stuff and go,\" he yelled. It was an impossible instruction to a group of homeless people stirring from under their cardboard boxes and sleeping bags.\nThe streams of mostly young men appeared in alleyways and from under store-front awnings in downtown Johannesburg, some carrying satchels, others holding black plastic trash bags with all of their possessions.\nTwo South African soldiers sit on top of their armored personnel carrier in Johannesburg city center.\n\"We are going to have a tough time with this,\" said Philip Janjtie, a young homeless man who had traveled to the city to find work.\nOn day one of the coronavirus , or Covid-19, lockdown in South Africa last Friday, the stark divide in the world's most unequal society was immediately laid bare. So far more than 1,300 people have been confirmed with the disease in South Africa, but authorities are bracing for the worst.\nIn affluent suburbs, people woke up to the inconvenient reality of three weeks isolated in their homes. Only essential movement is allowed and parks are closed. But many have gardens for their children to play in.\nIn informal settlements and city centers across the country, however, South Africans have limited choices to keep themselves safe from the virus.\nAcross this continent, social distancing is a refuge for the privileged and ingrained inequality is the reality everywhere. In Lagos, Nigeria -- where the informal economy is the lifeblood and lifeline for millions -- the markets are now shuttered. In Kenya, police have enforced a curfew with batons and teargas\nLines of homeless South Africans await police transport to temporary shelters in downtown Johannesburg.\nHomeless South Africans in Johannesburg are loaded on the back of a police truck where they were told they would be taken to a shelter to stay during the lockdown.\nSouth African President Cyril Ramaphosa wants the military here to be a force for good.\nBut sprawling townships and many thousands of homeless are an extraordinary challenge for his government during this pandemic.\nOn Monday, day four of the lockdown, at least 1,000 homeless men were rounded up and crammed into a rusted soccer stadium in Pretoria, the nation's capital.\nA long line of them squat on the concrete floor. The line snaked out of the grounds and onto the street where they set up a makeshift methadone clinic.\n\"The goal here is to keep Covid out of this community,\" says Sasha Lalla, a leader at COSUP, a city-supported substance abuse program. He worries that the thousands of homeless in Pretoria could be hardest hit if the virus spreads.\n\"I think then we will be seeing a situation where people with compromised immune systems are not just at risk of Covid-19, they are at risk of death. We have a responsibility to keep our most vulnerable safe,\" he said.\nInside the stadium, many of the men were too scared to sleep in the few dozen green army tents on the field, fearing the virus. A few syringes lay in the grass next to one entrance.\nThe tents should sleep two or, at most, three at night to enforce social distancing. But authorities admit that there are more than 10 to a tent.\nInstead, many of the men slept in the stands. Even though they say that out in the open, they risk getting robbed.\n\"They put us here and now we are close to one another. This is why we will be vulnerable to catching Corona. Our government has failed us,\" says Simon. He says he would feel safer on the street.\n\"Two weeks and we are carrying out dead bodies here. Two weeks!\" predicts Dennis, resting on a crutch in the middle of one tent.\n\"I would rather pack my things and go live there out there in the street. Or in the bush somewhere alone, rather than risk my life from something that somebody promises you,\" he added.\nThey put us here and now we are close to one another. This is why we will be vulnerable to catching Corona. Our government has failed us. Simon\nLalla says that all it would take is one case of the respiratory virus in the stadium to spark a disaster.\n\"It would be like wildfire,\" he said.\n\"We are really hoping that we don't have anyone right now who has contracted the disease. And if that is the case, we will be moving then to some of our quarantine facilities,\" said Omogolo Taunyane, a city spokesperson.\nSo far, they haven't tested anyone. But they say they plan to when they move into shelters.\nSchools, churches and parking lots are all being converted into shelters in a desperate rush to combat the virus amongst the most vulnerable. City officials hope to put many of these men into those shelters.\nBut Lalla says that more radical approaches are needed, especially in a country with such a chasm between the rich and the poor.\n\"Many times, they are forgotten people and we don't realize how vulnerable they are and how in need they are,\" he says. Lalla hopes that now-empty hotels will help with the crush of humanity that must get off the street.\nDay six and already authorities are hinting that this lockdown could last longer than 21 days. South Africa is mobilizing 10,000 health workers to do house-to-house testing.\nIn middle-class neighborhoods, the sidewalks are empty and there are no cars on the street. The restaurants, tattoo parlors, bars and coffee shops are all closed on Johannesburg's famous Seventh Street in the Melville neighborhood. A lone truck idles as it delivers bread to a local corner grocery store.\nEveryone is sacrificing because of this virus; the rich and the poor.\nBut in downtown Johannesburg people are lining up to get food -- they can't afford to stockpile. This is their daily routine. Taxis are running; touts are still hustling. It's quieter than usual. But life in this nation of two lockdowns goes on.", "url": "https://www.cnn.com/2020/04/02/africa/homeless-community-south-africa-coronavirus-intl/index.html"}