{"authors": ["Dana Bash", "Bridget Nolan", "Cassie Spodak"], "date_download": "2020-05-04 16:08:47", "date_modify": "2020-05-04 16:08:47", "date_publish": "2020-04-02 10:00:58", "description": "Topeka, Kansas, Mayor Michelle De La Isla has a mission: Convince the residents of her medium-sized, Midwestern city who have not been touched by the coronavirus pandemic that this is their fight too.", "filename": "2020_04_02_politics_kansas-coronavirus_index_1588608527.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401201300-dana-bash-michelle-de-la-isla-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_kansas-coronavirus_index_1588608527.html", "title": "This Midwestern mayor is fighting to get her residents to take coronavirus seriously", "title_page": "Kansas coronavirus: This Midwestern mayor is fighting to get her residents to take pandemic seriously - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Topeka, Kansas, Mayor Michelle De La Isla has a mission: Convince the residents of her medium-sized, Midwestern city who have not been touched by the coronavirus pandemic that this is their fight too.\nDuring news conferences she posts online, she pleads with people to listen to the facts and to understand what could be coming their way. But Topeka, home to some 125,000 people, is not experiencing the worst of the crisis that has rocked major population centers and the coastal areas of the United States. Kansas had only 482 confirmed cases of Covid-19 out of the more than 200,000 cases in the nation, as of Wednesday evening.\nThe disparity has put De La Isla, a single mom and the first Latina mayor of Topeka, in the position that many other local officials are in around the country: Implementing and enforcing the same strict distancing guidelines seen in the most impacted parts of the country on populations who haven't come face-to-face with the disease, all to try to slow and stop the spread of the virus.\nKansas Gov. Laura Kelly, a Democrat, issued stay-at-home instructions earlier this week, but as mayor of the state's capital city, implementing that falls largely to De La Isla, also a Democrat, and the local officials she works with.\n\"One of the biggest challenges that we're having is that because we don't have the numbers that the coast has, we are challenged by people not understanding the gravity of the situation. So we're having to tell people, and tell people again, about social distancing, and encouraging people to make sure that they follow the order of the ordinance that we put out, so that we can protect people,\" De La Isla told CNN in a virtual interview.\n\"We are two weeks behind the virus on a regular basis,\" she added. \"We're trying as much as we can, but again the numbers here don't seem to faze people the way that they should.\"\nDe La Isla spoke to CNN from Topeka's emergency operations center, where she and other city leaders like Dusty Nichols, the Director of Emergency Management, work together daily with a battle rhythm. For the mayor, suddenly thrust into confronting a worldwide pandemic at home, the pace of her days can be overwhelming.\nFormerly homeless herself, focusing on those in need\nBorn in New York City, De La Isla grew up largely in Puerto Rico. She experienced homelessness during her childhood and became a teenage mother but was able to go to college and graduate from Wichita State University, eventually moving to Topeka. She worked in public advocacy, including for Habitat for Humanity, before winning a seat on the City Council in 2013 and narrowly winning her mayoral race in 2017.\nDe La Isla still calls the homeless \"my people\" and is now working overtime to try to find a place for those who go to shelters to be properly separated, because right now, she told CNN, \"there is not enough space for social distancing for this group of people that need our help.\"\nShe reads to children live on Facebook to help Topeka's parents who are \"going crazy trying to figure out how to keep their kids entertained.\" She posts videos of herself bike riding to show how to safely exercise outside.\n\"If you let the whirlwind take you, you are going to just go all directions, especially in crisis time,\" she said.\nWhat grounds her, De La Isla said, is a morning meeting with her team.\n\"We know that at 8:00 in the morning, this team meets,\" she said. \"Every single day, we have a touch point in which we will meet with our group and delegate,\" she added.\nOne of those delegated tasks in these times: a new \"Rumor Control Group\" to combat bad information. For example, people saying the city is under martial law, or that someone who had tested positive for coronavirus went into a certain business place, which was not accurate.\n\"When we hear a rumor, we all talk about it in the (public information officers') meeting in the morning, and then we say, 'Okay, here's how we're going to disseminate this,' and then based on some of the contact that we have from the community, we create PSAs, so that the message that we want to stick, sticks,\" she explained.\nFocusing on mental health\nDe La Isla puts a premium on tending to the mental health of her city's rattled residents. Her team set up what they call a \"warm line\" (instead of a \"hotline\") for people in distress.\n\"The whole idea is figuring out how to pair volunteers in the community that are looking for something to do because they care and they want to do something positive, but also, providing an avenue for the people that are at home, struggling with anxiety, feeling lonely and needing somebody to call in and check in on them,\" said the mayor.\nFor students who are now learning in homes without proper wireless internet, she and the city's school superintendent are converting school buses into portable hotspots so that children can do their homework. She and her team are working with churches and other non-profit groups to make sure that children who rely on free or reduced-price lunch maintain access to food.\nDe La Isla has two teenage daughters at home. Like families all across the country, they are trying to make it all work with kids suddenly home. Her daughters babysit her nephew so that both she and her sister, a bank teller, can get to work.\nDe La Isla says what keeps her up at night is whether doctors will have enough equipment if the virus hits Topeka hard, and whether the city's two hospitals, which serve surrounding counties as well, have enough beds.\n\"Like all the hospitals across the nation, (we) need PPE (personal protective equipment).\n\"If at any point in time any of our senior centers gets impacted, we have the potential of, just in Topeka, with a few senior centers, to take over all of those beds and all of those ventilators,\" De La Isla said.\nCongressional campaign on hold\nBefore the coronavirus crisis, De La Isla, was laser focused on her campaign for Congress -- hoping to unseat Republican Rep. Steve Watkins.\nShe says that although she touches base with her campaign staff after hours, it is effectively on hold.\n\"My message to everybody has been if I am not a great mayor at this time, I don't deserve to be your congresswoman,\" she said.\nIn a statement to CNN, the GOP incumbent said right now, they are working together.\n\"Mayor De La Isla and I will battle on the ballot in November, but right now we are all at war with a common enemy, Covid-19,\" Watkins, a freshman, said.\nDe La Isla is singing from the same nonpartisan song sheet.\n\"I want to make sure that our community understands that they are loved. I use the word often because I see the city as my family, my community, and I absolutely love all of my citizens. Even when we don't agree,\" she said.", "url": "https://www.cnn.com/2020/04/02/politics/kansas-coronavirus/index.html"}