{"authors": ["Russ Bynum"], "date_download": "2020-05-04 20:11:03", "date_modify": "2020-05-04 20:11:03", "date_publish": "2020-04-07 19:41:32", "description": "SAVANNAH, Ga. (AP) — Georgia's governor is “considering new options” after being criticized by local officials for his order that reversed beach closures and other restrictions imposed by cities...", "filename": "_3f9a162c3fbf028f1add173b3cfd4678_1588623063.html", "image_url": "https://storage.googleapis.com/afs-prod/media/49d5a448ba3b4439b01e0b7fcf560eb2/2738.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3f9a162c3fbf028f1add173b3cfd4678_1588623063.html", "title": "Georgia governor weighs `new options' amid virus backlash", "title_page": "Georgia governor weighs `new options' amid virus backlash", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Wednesday, April 1, 2020 file photo, Georgia Gov. Brian Kemp speaks during a news conference at Liberty Plaza across the street from the Georgia state Capitol building in downtown Atlanta. Kemp is in a very public battle with Shirley Sessions, who was sworn in barely three months ago as mayor of Tybee Island, a small coastal community that thrives on beach tourism, after he reversed the city's painful decision to close its own beach to slow the coronavirus. (Alyssa Pointer/Atlanta Journal-Constitution via AP, File)\nFILE - In this Wednesday, April 1, 2020 file photo, Georgia Gov. Brian Kemp speaks during a news conference at Liberty Plaza across the street from the Georgia state Capitol building in downtown Atlanta. Kemp is in a very public battle with Shirley Sessions, who was sworn in barely three months ago as mayor of Tybee Island, a small coastal community that thrives on beach tourism, after he reversed the city's painful decision to close its own beach to slow the coronavirus. (Alyssa Pointer/Atlanta Journal-Constitution via AP, File)\nSAVANNAH, Ga. (AP) — Georgia’s governor is “considering new options” after being criticized by local officials for his order that reversed beach closures and other restrictions imposed by cities and counties to battle the coronavirus , the governor’s spokeswoman said Tuesday.\nGov. Brian Kemp’s executive order last week requiring Georgia residents to shelter at home, except under prescribed exceptions, drew an outcry. Some city and county leaders said a provision rolled back any tougher restrictions already imposed by local governments. Those nullified restrictions included local decisions to close public beaches on the 100-mile (160 kilometer) Georgia coast.\nTybee Island Mayor Shirley Sessions over the weekend blasted Kemp’s action as a “reckless mandate” that encouraged tourism as infections and deaths keep rising in Georgia. In Glynn County, where the state had reopened the beach on St. Simons Island, elected county Chairman Michael Browning sent Kemp a letter Monday saying: “This is the time to be tightening restrictions that combat the spread of this disease, not loosening them.”\nThe Republican governor’s order expires April 14, though he could choose to extend it. Kemp’s spokeswoman, Candice Broce, said Tuesday that complaints from local officials have not been ignored.\n“We hear their concerns, and we are considering new options to help those communities,” Broce said in an email to The Associated Press. “We are in unprecedented times, and the data changes hourly. We are constantly getting input from federal, state, and local leaders in public health, emergency management, and government to do what’s right for Georgia.”\nIt wasn’t immediately clear if Broce was referring to beach communities or the concerns of local governments in general. She gave no further details as to what options Kemp’s office was weighing.\nBrowning said Tuesday afternoon he’d received no response from Kemp’s office to his letter.\n“Just on the face of it, I am encouraged that he is hearing us,” Browning said of the statement. “And I’m hopeful that some positive things will be done to help put a check back on the spread of this virus. That’s what it’s all about.”\nBefore issuing his executive order Thursday, Kemp had given local officials broad leeway in deciding how best to restrict freedoms to keep the virus from spreading. As of Tuesday, the new virus was blamed for 348 deaths and more than 9,100 infections statewide.\nSince Kemp’s order took effect Friday, Georgia state troopers and officers from the state Department of Natural Resources have patrolled beaches to enforce social distancing requirements. In addition, people have been prohibited from bringing lounge chairs, umbrellas, and other gear to the beaches, which Kemp has said were opened for fresh air and exercise.\nBrowning said he was especially baffled by Kemp’s decision to reopen the beaches because two weeks earlier the governor’s office seemed to encourage Glynn County to close the beach at St. Simons Island.\nOn March 20, Browning said, he received a phone call Nicholas Buford, the governor’s deputy chief operating officer. He said Buford asked him: “Are you all going to close the beaches?” When Browning replied the county didn’t have enough law enforcement officers to enforce a beach closure, he said, Buford volunteered to send send help from state authorities.\nGlynn County commissioners voted that night to close the beach.\n“It certainly made it easier to do that,” Browning said of the phone call from Kemp’s office. “We had the backing of the governor. They called us, we didn’t call them.”\nThe Georgia State Patrol sent troopers to help enforce the beach closure, Browning said, and the state Department of Transportation placed electronic signs on Interstate 95 and other routes to St. Simons Island saying the beach was closed.\nBroce said in her email that Kemp’s office reached out to coastal Georgia communities to offer assistance last month after beaches began closing in Florida, raising concerns that Georgia beaches might see a surge of spring break crowds. She said the beaches were reopened when state officials had a plan to prohibit beach gear and enforce social distancing requirements.\n___\nFollow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/3f9a162c3fbf028f1add173b3cfd4678"}