{"authors": [], "date_download": "2020-05-04 20:11:20", "date_modify": "2020-05-04 20:11:20", "date_publish": "2020-04-16 22:32:08", "description": "OKLAHOMA CITY (AP) — Oklahoma's governor signed over 450 commutations, but a news release inaccurately stated that 404 of those inmates would be released Thursday. Gov. Kevin Stitt’s granted...", "filename": "_8745a45423bb32f601531b41d292ca02_1588623080.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8745a45423bb32f601531b41d292ca02_1588623080.html", "title": "Gov. Stitt's office incorrectly counts inmates to be freed", "title_page": "Gov. Stitt's office incorrectly counts inmates to be freed", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "OKLAHOMA CITY (AP) — Oklahoma’s governor signed over 450 commutations, but a news release inaccurately stated that 404 of those inmates would be released Thursday.\nGov. Kevin Stitt’s granted commutations last week amid coronavirus outbreak, The Oklahoman reported. But Baylee Lakey, the governor’s office spokesperson, said the number of inmates being released Thursday was a communication error.\nSteve Bickley, director of the state’s Pardon and Parole Board, said he couldn’t provide the exact number of inmates being released Thursday. But some have mentioned that it would be about 100 people.\nMost of the inmates whose sentences were commuted had other sentences that the Pardon and Parole Board did not commute.\n“Every single person is absolutely going to get out sooner,” Bickley said. “It’s just not everyone is getting out on the 16th of April.”\nThe governor’s decision to commute sentences shows that he has an “understanding of how critical it is to be a leader in taking necessary action to lower the number of people in custody in the face of COVID-19, “said Nicole McAfee, director of policy and advocacy for the ACLU Oklahoma chapter.\nConcerned groups have requested that Still amend his executive order to give Oklahoma’s Department of Corrections guidance on how to handle the pandemic.\nMcAfee said medical and “compassionate release” dockets are needed, encouraging special meetings for the parole board and speeding up the commutation recommendations.\nThe department confirmed last week that six people had tested positive for the virus, including one inmate and five prison staff members.\nIn response to the virus, the parole board has reviewed more cases.\n“The governor took every action he could based on the information before him, and our office has been and continues to work in close coordination with the Pardon and Parole Board and the Department of Corrections to find ways to responsibly reduce Oklahoma’s prison population,” Lakey said in a statement.", "url": "https://apnews.com/8745a45423bb32f601531b41d292ca02"}