{"authors": ["Alicia Lee"], "date_download": "2020-05-04 16:51:45", "date_modify": "2020-05-04 16:51:45", "date_publish": "2020-04-07 22:58:35", "description": "Like most churches this Easter, the historic Duomo Cathedral in Milay, Italy, will be closed to the public. But over the empty pews, the voice of famed opera singer Andrea Bocelli will echo through the cathedral Sunday as he performs a special concert that will be streamed live around the world.", "filename": "2020_04_07_entertainment_an_c393cc48bbae8ea915722a0d9499025b_index_1588611105.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407162510-andrea-bocelli-easter-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_entertainment_an_c393cc48bbae8ea915722a0d9499025b_index_1588611105.html", "title": "Andrea Bocelli will perform live on Easter from Italy's empty Duomo Cathedral", "title_page": "Andrea Bocelli will perform live on Easter from Italy's empty Duomo Cathedral  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Like most churches this Easter, the historic Duomo Cathedral in Milan, Italy, will be closed to the public due to the coronavirus pandemic.\nBut over the empty pews on Sunday, the voice of famed opera singer Andrea Bocelli will echo through the cathedral during a special audience-free concert, which will be livestreamed.\nOn Easter Sunday at 6PM UK, by invitation of the City and of the Duomo Cathedral of Milan, Italian global music icon Andrea Bocelli will give a solo performance representing a message of love, healing and hope to Italy and the world.\nset your reminder: https://t.co/bAZZGFpKKF pic.twitter.com/v1PgZ0wPZE — info@andreabocelli.com (@AndreaBocelli) April 7, 2020\nThe concert, titled \"Bocelli: Music for Hope,\" will stream on Bocelli's YouTube channel at 7 p.m. in Italy, which in the US is 1 p.m. ET and 10 a.m. PT.\nThe Italian tenor will be accompanied only by the cathedral organist, Emanuele Vianelli. He is scheduled to perform sacred pieces such as \"Ave Maria\" and \"Sancta Maria,\" Universal Music Group said in a news release.\nUniversal Music Group is working with the City of Milan, the Veneranda Fabbrica del Duomo, Sugar Music and YouTube to put on the virtual concert.\nRead More", "url": "https://www.cnn.com/2020/04/07/entertainment/andrea-bocelli-easter-duomo-cathedral-trnd/index.html"}