{"authors": ["Steve Karnowski"], "date_download": "2020-05-04 20:05:07", "date_modify": "2020-05-04 20:05:07", "date_publish": "2020-04-08 14:33:50", "description": "MINNEAPOLIS (AP) — Gov. Tim Walz on Wednesday extended Minnesota’s stay-at-home order until May 4, saying his original order has bought the state valuable time to slow the spread of the...", "filename": "_4638268d7d8ca62743ecfb3095524a1e_1588622707.html", "image_url": "https://storage.googleapis.com/afs-prod/media/bc799e7d9e514f3d9d5ca1a6c4b8c75b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4638268d7d8ca62743ecfb3095524a1e_1588622707.html", "title": "Walz says stay-at-home is working; extends order to May 4", "title_page": "Walz says stay-at-home is working; extends order to May 4", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Minnesota Gov. Tim Walz provides an update on the state's next steps to respond to COVID-19 during a news conference on Wednesday, April 8, 2020 in St. Paul, Minn. Walz is extending Minnesota’s stay-at-home order until May 4 as the number of COVID-19 deaths in the state continues to rise. The original order was scheduled to end Friday. Walz said Wednesday that the order has bought Minnesota needed time to slow the spread of the coronavirus but must continue. (Glen Stubbe/Star Tribune via AP, Pool)\nMinnesota Gov. Tim Walz provides an update on the state's next steps to respond to COVID-19 during a news conference on Wednesday, April 8, 2020 in St. Paul, Minn. Walz is extending Minnesota’s stay-at-home order until May 4 as the number of COVID-19 deaths in the state continues to rise. The original order was scheduled to end Friday. Walz said Wednesday that the order has bought Minnesota needed time to slow the spread of the coronavirus but must continue. (Glen Stubbe/Star Tribune via AP, Pool)\nMINNEAPOLIS (AP) — Gov. Tim Walz on Wednesday extended Minnesota’s stay-at-home order until May 4, saying his original order has bought the state valuable time to slow the spread of the coronavirus and should continue.\nWalz said Minnesotans have responded well to the order, which was due to expire Friday, but cases of COVID-19 are increasing and community spread is rising.\n“We cannot rest easy,” he said. “This thing can explode overnight if you don’t take the proper precautions.”\nMinnesota reported 85 new cases Wednesday, raising the state’s total to 1,154, and five new deaths for a total of 39. The department said 135 patients were hospitalized Wednesday, up 15, while 64 were in intensive care, unchanged.\nThe governor’s new order also extends the closure of bars, restaurants and other public accommodations until May 4. But it adds a long list of exemptions to allow workers who had been staying home to return with proper social distancing, including people who work outdoors such as landscapers. Walz said his agency heads will develop protocols over the next three weeks to get even more people back to work. But he said it’s unlikely schools will reopen May 4.\nWalz said the strategy is projected to delay the peak in cases until late-May through July. Meanwhile, the state is working to increase hospital capacity, including intensive care beds. It’s also pursuing additional supplies of ventilators and personal protective equipment such as masks, and hopes to sharply expand testing to clear people to return to work sooner.\nLegislative leaders and the Minnesota Hospital Association said the strategy is buying time to prepare.\n“If the surge (in cases) is significant, that would definitely overwhelm the health care system. If it’s prolonged, that would also be devastating to the health care system, financially,” said Dr. Rahul Koranne, the association’s president and CEO. “The bottom line is, we don’t have to look at a different continent to know how bad this is and how much of a disaster this could be.”\nEarlier Wednesday, Democratic Secretary of State Steve Simon asked a Minnesota House elections subcommittee for temporary authority to ensure the safe conduct of the August primary and November general elections. He said his proposal focuses on minimizing exposure to the coronavirus at polling places and maximizing voting by mail.\nThe “ugly scene” of Tuesday’s chaotic election in Wisconsin — with long lines exposing voters to the virus at a sharply reduced number of available polling stations — provided a glimpse of what could happen in Minnesota, Simon told the committee, which met via videoconference.\nBut Republicans opposed Simon’s proposal in its current form. Rep. Jim Nash, of Waconia, said it would open the door to fraud and electioneering. Nash also said the state’s laws allowing citizens to cast early absentee ballots by mail or in person may be sufficient. Simon said current rules would still result in too many voters crowding into polling places.\nThe subcommittee did not vote. Its chairman, Democratic Rep. Raymond Dehn, of Minneapolis, said talks would continue.\n___\nAssociated Press writer Jeff Baenen contributed to this story.", "url": "https://apnews.com/4638268d7d8ca62743ecfb3095524a1e"}