{"authors": ["Rishi Iyengar", "Cnn Business"], "date_download": "2020-05-04 16:59:43", "date_modify": "2020-05-04 16:59:43", "date_publish": "2020-04-09 23:47:41", "description": "Microsoft is giving its workers an additional three months of paid parental leave to deal with extended school closures due to the coronavirus outbreak.", "filename": "2020_04_09_tech_microsoft-12-weeks-parental-leave_index_1588611583.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409190338-microsoft-paid-leave-file-0320-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_tech_microsoft-12-weeks-parental-leave_index_1588611583.html", "title": "Microsoft is giving workers 12 weeks of paid parental leave because of school disruptions", "title_page": "Microsoft is giving workers 12 weeks of paid parental leave because of school disruptions - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "San Francisco (CNN Business) Microsoft is giving its workers an additional three months of paid parental leave to deal with extended school closures due to the coronavirus outbreak.\nMicrosoft MSFT Parents who work for can choose how and when to use the leave — whether it's a three-month stretch or a few days a week — a company spokesperson told CNN Business. The company is calling the program \"12-Week Paid Pandemic School and Childcare Closure Leave.\"\nThe news was first reported by Business Insider\nThe policy is meant to \"give our employees greater flexibility and time off as they face extended school closures,\" the spokesperson added.\nThe coronavirus has forced schools around the world to shut, with UNESCO estimating that school closures across 188 countries are impacting more than 91% of the world's student population — around 1.6 billion children and young adults. Several US states have extended school closures , with some governors already announcing schools will remain shut for the rest of the academic year. That includes Washington, where Microsoft is headquartered.", "url": "https://www.cnn.com/2020/04/09/tech/microsoft-12-weeks-parental-leave/index.html"}