{"authors": ["Trends Reporter"], "date_download": "2020-05-04 20:17:10", "date_modify": "2020-05-04 20:17:10", "date_publish": "2020-04-28 11:46:44", "description": "Jill Karofsky, who won a state Supreme Court seat, accused Republicans of endangering voters during the coronavirus pandemic.", "filename": "entry_jill-karofsky-wisconsin-covid-19-vote-suppression_n_5ea7b551c5b6a30004e7883a_1588623430.html", "image_url": "https://img.huffingtonpost.com/asset/5ea7bad53000000a11155029.jpeg?cache=fh2sybym1o&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_jill-karofsky-wisconsin-covid-19-vote-suppression_n_5ea7b551c5b6a30004e7883a_1588623430.html", "title": "Wisconsin Election Winner Lashes 'Unconscionable' GOP For Forcing Vote", "title_page": "Wisconsin Election Winner Lashes 'Unconscionable' GOP For Forcing Vote | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "A Democrat who won a hotly contested Wisconsin state Supreme Court judgeship called her election victory “bittersweet” because of rising COVID-19 cases linked to in-person voting forced by state Republicans.\n“I find it unconscionable that Wisconsin voters were forced to choose between their safety and having their voices heard in our democracy,” wrote Wisconsin Supreme Court Justice-elect Jill Karofsky in an op-ed in The New York Times Monday.\nThe GOP won court battles to scuttle Gov. Tony Evers’ bid for more time for mail-in ballots so people wouldn’t have to risk COVID-19 contagion to vote. Forty new cases of COVID-19 in Milwaukee County alone have now been linked to the April 7 election.\nShe noted that Wisconsin judges backing the Republicans all voted early, so they personally risked nothing, even as they sent other voters into danger. To protect themselves, the judges didn’t meet face to face to hear the case. Yet citizens, in order to exercise their right to vote, had to endure hours on lines where they risked contagion, Karofsky pointed out.\n“The right to vote is fundamental to the American creed,” Karofsky wrote. “Courts making partisan decisions, sending people out to vote in the middle of a global pandemic, is exactly what’s wrong with a judiciary that has become too political.”\nShe said she believes the GOP battle was a “deliberate attempt to suppress the vote in Wisconsin.”\nIt was “unacceptable to hold an election under circumstances in which people were forced to choose between their safety and voting,” Karofsky declared. “It disenfranchised countless people and raised serious concerns for the future of our democracy.” “It can never happen again.” Check out Karofsky’s op-ed here.\nDo you have information you want to share with HuffPost? Here’s how.", "url": "https://www.huffpost.com/entry/jill-karofsky-wisconsin-covid-19-vote-suppression_n_5ea7b551c5b6a30004e7883a"}