{"authors": ["Pete Iacobelli"], "date_download": "2020-05-04 20:13:28", "date_modify": "2020-05-04 20:13:28", "date_publish": "2020-04-09 20:30:18", "description": "COLUMBIA, S.C. (AP) — South Carolina coach Dawn Staley believes her top-ranked Gamecocks are the women's basketball national champions, even without an NCAA Tournament trophy to put in their...", "filename": "_8b5abe93c48b0bfdc21b4bbc4ab1213f_1588623208.html", "image_url": "https://storage.googleapis.com/afs-prod/media/5a54a13b230d477a82937ce295864280/2307.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8b5abe93c48b0bfdc21b4bbc4ab1213f_1588623208.html", "title": "Staley thinks No. 1 South Carolina is national champs", "title_page": "Staley thinks No. 1 South Carolina is national champs", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Jan. 2, 2020, file photo, South Carolina coach Dawn Staley disputes a call during the second half of an NCAA college basketball game against Kentucky in Columbia, S.C. Staley was announced as The Associated Press women's basketball coach of the year Monday, March 23, 2020. (Tracy Glantz/The State via AP, File)\nFILE - In this Jan. 2, 2020, file photo, South Carolina coach Dawn Staley disputes a call during the second half of an NCAA college basketball game against Kentucky in Columbia, S.C. Staley was announced as The Associated Press women's basketball coach of the year Monday, March 23, 2020. (Tracy Glantz/The State via AP, File)\nCOLUMBIA, S.C. (AP) — South Carolina coach Dawn Staley believes her top-ranked Gamecocks are the women’s basketball national champions, even without an NCAA Tournament trophy to put in their display case due to the pandemic-shortened season.\n“Why not?” she asked Thursday. “A national championship trophy was made. It’s sitting somewhere.”\nThe NCAA decided against officially crowning champions after its signature tournaments were called off due to the coronavirus pandemic that has sent much of the world into lock down. Staley spoke from her home where she’s spent the past month managing her program and ensuring her players don’t linger too much on what they missed.\nStill, Staley said there’s plenty of evidence to back up her belief the Gamecocks should be recognized as the best this season. They finished 32-1, winning 26 straight games since their lone loss to then-17th-ranked Indiana in November.\nSouth Carolina finished 16-0 to win the Southeastern Conference regular season, then followed it up by rolling to the tournament title winning the three games last month by an average margin of victory of 24 points.\nThe Gamecocks expected to be the tournament’s No. 1 overall seed and have a path in the tournament that would not have required them to leave their home state; the regional was scheduled for Greenville where South Carolina won its SEC Tournament crown — until the Final Four.\nBut that’s when the global pandemic hit the United States, shuttering all college sports including the NCAAs..\n“Us not being able to play in the NCAA Tournament when it’s all said and done which was the end of the season, then, yes, I do think we should be national champions,” she said.\nStaley accepts many won’t agree. “We’re going to write our own narrative,” she said.\nKansas coach Bill Self, whose Jayhawks finished No. 1 in the men’s ranking, said he’d accept the national championship trophy, although he acknowledged it would not feel the same.\nStaley recently had a team meeting — by video conference — during which she allowed her players to express their frustrations and disappointments over not getting the opportunity to complete their championship quest.\nThe focus, she found from her young lineup, was one continuing that journey next season.\n“All I heard about from them was, ‘When can I get back to campus?’” Staley said with a laugh.\nNo one can answer that question at the moment.\nStaley, the U.S. national women’s team coach, was happy about the postponement of the Tokyo Games until 2021. She said she returned home from the Rio Games four years ago with an illness and was uneasy about competing this summer.\nShe said her attention is on next season, attempting to fill out a roster with five available scholarships and keeping the championship edge her team showed this past season.\n“They have an insatiable desire to get better, compete and to win,” Staley said. “And when you have that in young people, the sky’s the limit.”", "url": "https://apnews.com/8b5abe93c48b0bfdc21b4bbc4ab1213f"}