{"authors": [], "date_download": "2020-05-04 17:02:21", "date_modify": "2020-05-04 17:02:21", "date_publish": "2020-04-10 17:41:43", "description": "Spend your weekend saving money when you shop these stellar deals. You'll find discounts on everything from AirPods at their all-time low price, marked-down Casper mattresses and sales on some of your favorite activewear brands like Adidas, New Balance and Under Armour.", "filename": "2020_04_10_cnn-underscored_weekend-sales-deals_index_1588611741.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410133542-weekend-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_cnn-underscored_weekend-sales-deals_index_1588611741.html", "title": "The best sales to shop this weekend: AirPods, Casper, Toms and more", "title_page": "The best sales to shop this weekend: AirPods, Casper, Toms and more - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Spend your weekend saving money when you shop these stellar deals. You'll find discounts on everything from AirPods at their all-time low price, marked-down Casper mattresses and sales on some of your favorite activewear brands like Adidas, New Balance and Under Armour. See below for the must-see savings events happening over the next few days.\nTech and gaming\nSatechi\nUpgrade your work from home setup with savings from Satechi. Now through April 12, take 15% off sitewide at the electronics retailer with promo code SPRING15. It's the perfect time to pick up gadgets including chargers, peripherals, computer mounts, audio and more, plus Satechi donate 5% of all sales to Project C.U.R.E., an organization that's providing critical supplies and resources to hospitals and heroes fighting the spread of covid-19..\nXbox\nIf you're gaming to pass the time these days, invest in a three-month subscription to Xbox Ultimate Game Pass, and get another three months free. Upon purchasing, you'll receive a digital code to activate your membership and receive your extra three months. Just note, the code is only valid through July 15.\nPhilips Hue\nTake advantage of Philips Hue's Mix and Match deal to brighten up your home with some new smart lights. You'll save 10% when you buy four items, 15% when you buy five, and 20% when you buy six, so stock up today.\nFire TV Stick\nTwo Fire TV Stick bundles are currently on sale at Amazon: Now, for under $70, you can pair the streaming device with a third generation Echo Dot, or bring home a Fire TV Stick 4K with a Fire TV Recast and an HD Antenna for just under $250, down from $300.\nAirPods\nMake your next conference call more enjoyable with a pair of second generation AirPods, on sale at eBay for just $122.99 — its lowest price ever. They come with a charging case, which means you can enjoy up to 24 hours of battery life.\nHome and health\nCasper\nIf you're looking to get a better night's sleep, Casper is currently running the deal of your dreams. Now through April 14, take 10% off any order that includes a mattress (sorry, dog mattresses don't count). That means you can fill your cart with tons of Casper products, like bedding, pillows, bed frames and more, and they'll be marked down as long as you're also purchasing a mattress. Plus, Casper is offering no-contact delivery in the wake of covid-19.\nOmaha Steaks\nIn the mood for meat? Omaha Steaks is marking down its Freezer Filler Favorites box ($175, originally $390.83; omahasteaks.com), so you can ensure you have enough protein to eat during quarantine. Not to mention, plenty of other collections are about half off now.\nBarnes & Noble\nStock up on books to read while you're at home. Right now, hundreds of reads from Barnes & Noble are buy one, get one 50% off. That includes novels and bestsellers, along with collectables, puzzle books, books for kids and more. Orders over $35 ship for free, or you can get your books in-person with free curbside pickup.\nKirkland's Home\nTons of discounted decor, kitchenware, bedding, bathroom accessories and much more is up for grabs at Kirkland's Home. In honor of the holiday weekend, the retailer is taking 15% off your entire regular-priced purchase with promo code EASTER, plus shipping on orders over $99 is free.\nFashion and beauty\nAdidas\nGet your kicks at Adidas' latest sale. Right now, the brand is marking down its most iconic footwear styles, including Ultraboost, Stan Smith, Superstar and more. Through April 13, save up to 40% on select sneakers with promo code ADIFAVS.\nFrank and Oak\nUpdate your closet with new styles from Frank and Oak's Easter Sale. Wearable basics from the brand are 30% off with promo code EASTER30. This sitewide sale will last through April 14.\nNew Balance\nHundreds of styles are 25% off now at New Balance. Score new sneakers, sweats, activewear and more, all at a discount through April 12. Plus, when you spend $50 or more, you'll receive free shipping on your order.\nPuma\nPuma is bringing people together at its Friends and Family Sale, where your entire purchase is 40% off when you use promo code PUMAFAM at checkout, so you can pick up new sneakers, loungewear, activewear and more. Just note: This sale seems to appear on site as a 30%-off deal, but if you use the above promo code, you should still see the 40% discount in your cart.\nNeiman Marcus\nScore big discounts on designer goods from Neiman Marcus. At the Dollar Off Event, you can enjoy $30 off purchases of $150 or more, $100 off orders $400 or more, $300 off orders of $1,000 or $650 off purchases over $2,000 with promo code UPLIFT.\nToms\nToms makes some of the most stylish slip-ons around, and through Saturday, you can save on those classic shoes and more. Use promo code TOMS25 to take 25% off sitewide, plus you'll receive a free Toms tote with your purchase while supplies last.\nLevi's\nLevi's makes some of the most iconic denim around, and now you can buy that and other classic styles for less. Snag 40% off sitewide through April 20 at the Silver Lining Sale with promo code SILVER40.\nUrban Outfitters\nFor a limited time, all women's clothing, accessories and intimates are up to 40% off at Urban Outfitters. Among the retailer's discounted stylish offerings are plenty of sweats, cozy sweaters, spring-y shorts, cool sneakers and more. There are nearly 4,000 items included in this promotion, so start browsing now.\nUnder Armour\nWhether you're committed to at-home workouts or you're just lounging around, apparel from Under Armour will serve you well. Right now, take 25% off sitewide with code WFH25, and bring home tons of new activewear (or activewear that will double as loungewear).\nFor more great deals, check out CNN Coupons.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/10/cnn-underscored/weekend-sales-deals/index.html"}