{"authors": ["Overnight Editor"], "date_download": "2020-05-04 20:16:20", "date_modify": "2020-05-04 20:16:20", "date_publish": "2020-04-28 08:39:41", "description": "Richard Donner was so surprised the cast thought he was having a coronary.", "filename": "entry_steven-spielberg-goonies-prank_n_5ea7dc30c5b6dd3f908a4c92_1588623380.html", "image_url": "https://img.huffingtonpost.com/asset/5ea7dfc13000004a10155047.jpeg?cache=fsybkbtgm8&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_steven-spielberg-goonies-prank_n_5ea7dc30c5b6dd3f908a4c92_1588623380.html", "title": "Steven Spielberg Reveals 'Goonies' Prank That Turned The Director 'White As A Sheet'", "title_page": "Steven Spielberg Reveals 'Goonies' Prank That Turned The Director 'White As A Sheet' | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Not every bit of “Goonies” hijinks was caught on camera.\nDuring a “Goonies” reunion on Josh Gad’s “Reunited Apart” YouTube channel, Steven Spielberg, who was executive producer of the iconic film, said he pulled a prank on director Richard Donner after filming was complete.\nSpielberg mentioned that Donner had been looking forward to a break from the “high energy” youth cast.\n“Richard kept saying, ‘Oh, my God, I got two weeks to go, and I can’t wait to finish and I’m going to go to my house in Hawaii, and I’m gonna get away from all of this noise. It’s extraordinary and I love ’em to pieces, but I can’t stand it anymore,’” Spielberg recalled.\nSo when filming was finished, Spielberg secretly sent the entire cast to Hawaii ― and right to Donner’s house.\n“Before Dick ever landed, they all showed up in his living room,” he said.\nMartha Plimpton, who played Stef in the 1985 film, remembered the moment Donner spotted them.\n“He dropped to his knees,” she said. “He went white as a sheet. We thought we’d given him a coronary.”\nAlong with Spielberg, Donner and Plimpton, Gad reunited Sean Astin, Josh Brolin, Corey Feldman, Ke Huy Quan, Jeff Cohen, Robert Davi, Joe Pantoliano, Chris Columbus and Cyndi Lauper in a fundraiser for The Center for Disaster Philanthropy.\nCheck out the full “Goonies” reunion below (and find out why a sequel still hasn’t happened):", "url": "https://www.huffpost.com/entry/steven-spielberg-goonies-prank_n_5ea7dc30c5b6dd3f908a4c92"}