{"authors": ["Por Schuyler Dixon"], "date_download": "2020-05-04 20:24:42", "date_modify": "2020-05-04 20:24:42", "date_publish": "2020-04-20 23:30:22", "description": "Ante la clara posibilidad de reanudar el deporte profesional en estadios vacíos, un sondeo reciente reveló que la mayoría de los aficionados en Estados Unidos no se sentiría seguro de acudir a...", "filename": "_d479993d10d744aaa86bce1237b29642_1588623882.html", "image_url": "https://storage.googleapis.com/afs-prod/media/1351ab09fdad4a5e828c06df82e1a00b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d479993d10d744aaa86bce1237b29642_1588623882.html", "title": "Sondeo: Aficionados no se sentirían seguros sin vacunas", "title_page": "Sondeo: Aficionados no se sentirían seguros sin vacunas", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nSondeo: Aficionados no se sentirían seguros sin vacunas\nAnte la clara posibilidad de reanudar el deporte profesional en estadios vacíos, un sondeo reciente reveló que la mayoría de los aficionados en Estados Unidos no se sentiría seguro de acudir a partidos sin que exista una vacuna contra el COVID-19.\nSegún un sondeo de Seton Hall Sports, el 72% de los estadounidenses dijo que no se sentiría seguro de asistir a un estadio sin una vacuna, aunque la cifra se redujo a 61% entre las personas que se identificaron como aficionados al deporte. Casi la mitad de los participantes en la encuesta, que tuvo un margen de error de 3,6 puntos porcentuales, dijo que no seguían de cerca el mundo deportivo o no estaban interesados en los deportes.\nAsí que incluso si se permite el regreso de los aficionados a los estadios y arenas, muchos podrían no asistir. Y, de ser el caso, las pérdidas financieras serían significativas sin los ingresos provenientes de entradas, concesiones, mercancía y otros aspectos, incluso si hay capital entrante de los lucrativos acuerdos de transmisión.\nSi la NBA y la NHL tienen que cancelar el resto de sus temporadas y Grandes Ligas y la MLS juegan sólo la mitad de sus calendarios regulares, las pérdidas en ingresos relacionados con los aficionados podrían alcanzar los 3.000 millones de dólares, según Patrick Rishe, director del programa de comercio deportivo en la Universidad Washington de San Luis.\n“Esas pérdidas que mencioné, tanto en boletos como en gastos relacionados con el día de partido como alimentos, bebidas, estacionamiento, mercancía, lo que me digas, es dinero perdido”, dijo Rishe. “Incluso si el dinero de las entradas se toma en cuenta para la siguiente temporada, sigue siendo una oportunidad perdida”.\nDavid Carter, profesor en la facultad de comercio deportivo en la Universidad del Sur de California, dijo que existe una diferencia entre un aficionado al deporte y un consumidor de deportes. Es más posible que éste último vuelva una vez que se permita el ingreso de asistentes a los estadios.\n“No puedo imaginarme que los consumidores de deportes, o como les llaman los aficionados comprometidos o aficionados empedernidos, que se mantengan alejados durante todo un año”, dijo Carter.\nEl acuerdo de televisión de Grandes Ligas promedia alrededor de 1.500 millones de dólares al año y expira el próximo año, y la NBA está a mitad de un pacto por nueve años que paga alrededor de 2.600 millones anuales. El acuerdo de derechos de la NHL es de apenas 2.000 millones por 10 años, o 200 millones por temporada.", "url": "https://apnews.com/d479993d10d744aaa86bce1237b29642"}