{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:16:38", "date_modify": "2020-05-04 20:16:38", "date_publish": "2020-04-28 09:22:13", "description": "New York Attorney General Letitia James said Amazon may also be guilty of providing \"inadequate\" protections to workers during the COVID-19 pandemic.", "filename": "entry_amazon-new-york-attorney-general-christian-smalls_n_5ea7d13ac5b6085825786c4a_1588623398.html", "image_url": "https://img.huffingtonpost.com/asset/5ea7f4a33000002c1115506a.jpeg?cache=fewzfrjl3p&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_amazon-new-york-attorney-general-christian-smalls_n_5ea7d13ac5b6085825786c4a_1588623398.html", "title": "Amazon May Have Acted Illegally In Firing Of Warehouse Worker, New York AG Says", "title_page": "Amazon May Have Acted Illegally In Firing Of Warehouse Worker, New York AG Says | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Amazon may have broken New York’s whistleblower law when it fired one of its warehouse workers who’d protested the company’s response to the COVID-19 pandemic, according to state Attorney General Letitia James.\nIn a letter last week to the e-commerce giant obtained by NPR and The New York Times, James said her office was probing Amazon’s firing of Christian Smalls, who helped organize a walkout at the company’s Staten Island warehouse last month. The protesters had demanded the facility be temporarily closed and sanitized following the positive coronavirus diagnosis for at least one worker there. Smalls said at the time that Amazon had not done enough to protect its workers from the virus.\nAmazon claimed it had fired Smalls for “violating social distancing guidelines,” and for flouting a company quarantine order when he attended the protest.\nJames said, however, that a preliminary investigation into the company’s actions “raise serious concern that Amazon may have discharged [Smalls] in order to silence his complaints and send a threatening message to other employees that they should also keep quiet about any health and safety concerns,” NPR reported.\nThe attorney general said she was also investigating “other cases of potential illegal retaliation” by Amazon.\nThe New York attorney general's office says Amazon's coronavirus health and safety measures are \"so inadequate that they may violate several provisions of the Occupational Safety and Health Act.\"https://t.co/BkyFyFjvdw — NPR (@NPR) April 28, 2020\nIn her letter, James also raised concerns that Amazon had provided “inadequate” protections to employees amid the ongoing pandemic — in possible violation of federal and state worker safety laws.\nAmazon has yet to respond publicly to the letter, but said in a statement to NPR that while it respects workers’ rights to demonstrate, “these rights do not provide blanket immunity against bad actions, particularly those that endanger the health, well-being or safety of their colleagues.”\nA spokeswoman also pointed to the measures that Amazon has introduced to ensure workers’ health and safety during the pandemic including “masks, temperature checks, hand sanitizer, social distancing measures, increased time off, increased pay, and more.”\nAmazon’s decision to fire Smalls following the protest has been heavily scrutinized.\nEarlier this month, a group of Democratic senators including former presidential contenders Cory Booker of New Jersey and Kirsten Gillibrand of New York wrote a letter to the company expressing concern about the motivations behind Smalls’ dismissal.\nIn their letter, the senators said they were particularly disturbed by a leaked internal memo that revealed the apparent intention of Amazon’s top brass to launch a smear campaign against Smalls.\n“He’s not smart, or articulate, and to the extent the press wants to focus on us versus him, we will be in a much stronger PR position than simply explaining for the umpteenth time how we’re trying to protect workers,” Amazon General Counsel David Zapolsky said of Smalls, according to the memo.\nZapolsky later apologized for the remarks, and said he’d “let my emotions draft my words and get the better of me.”", "url": "https://www.huffpost.com/entry/amazon-new-york-attorney-general-christian-smalls_n_5ea7d13ac5b6085825786c4a"}