{"authors": ["Kristen Holmes", "Cnn White House Correspondent"], "date_download": "2020-05-04 16:04:13", "date_modify": "2020-05-04 16:04:13", "date_publish": "2020-04-01 21:46:12", "description": "The Strategic National Stockpile is deploying the last round of shipments in its inventory, depleting the bulk of its protective gear, according to a source familiar with the matter.", "filename": "2020_04_01_politics_national-stockpile-shipments_index_1588608253.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330095012-09-new-york-medical-supplies-0328-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_national-stockpile-shipments_index_1588608253.html", "title": "Last rounds of protective gear in national stockpile being shipped", "title_page": "Last rounds of protective gear in national stockpile being shipped - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Strategic National Stockpile is deploying the last round of shipments in its inventory, depleting the bulk of its protective gear, according to a source familiar with the matter.\nThe official added that the stockpile was never meant to serve as the only source of protective gear for the entire coronavirus response and said the states would need to get more supply from the private market. The official stressed that the stockpile, which is managed by the Department of Health and Human Services, will never be completely depleted as they always retain a small percentage for the most critical needs.\nOn Wednesday, President Donald Trump acknowledged that the stockpile is nearly depleted.\n\"It is. We are sending it directly to hospitals,\" Trump said.\nHe added, \"We have asked states where they have large manufacturers of different types of equipment to use those local factories, local plants, and have it made directly, ship it right into the hospitals.\"\nRead More", "url": "https://www.cnn.com/2020/04/01/politics/national-stockpile-shipments/index.html"}