{"authors": ["Reporter"], "date_download": "2020-05-04 20:27:33", "date_modify": "2020-05-04 20:27:33", "date_publish": "2020-04-30 07:08:58", "description": "The actor's latest artwork makes a mockery of the president's coronavirus comments.", "filename": "entry_jim-carrey-donald-trump-coronavirus-cure-cartoon_n_5eaa6fe0c5b62eaf043f0618_1588624053.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa711024000010028e9fbe.jpeg?cache=r7htulklhd&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_jim-carrey-donald-trump-coronavirus-cure-cartoon_n_5eaa6fe0c5b62eaf043f0618_1588624053.html", "title": "Jim Carrey Predicts Donald Trump's 'Next Medical Breakthrough' With Political Cartoon", "title_page": "Jim Carrey Predicts Donald Trump's 'Next Medical Breakthrough' With Political Cartoon | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "President Donald Trump’s penchant for hyping unproven ― and sometimes downright dangerous ― treatments for the coronavirus gave actor Jim Carrey the inspiration for his latest critical cartoon.\nLast week, Trump pondered injecting people with disinfectant during a White House coronavirus task force briefing. He later walked back the comments, claiming he was just being sarcastic.\nThat didn’t stop Carrey from unleashing this taunting piece of artwork on Wednesday, which he called “Trump’s next medical breakthrough.”\nTrump’s next medical breakthrough: “Want COVID out? SHOUT IT OUT!” pic.twitter.com/GQPpl5qpmS — Jim Carrey (@JimCarrey) April 29, 2020\nUpward of 61,000 people in the United States have now died from COVID-19, the disease caused by the virus, and the country has more confirmed cases — as of Thursday morning, more than 1 million — than any other in the world. The Trump administration has come under increasing fire for its sloppy response to the public health crisis.\nCarrey often uses his art to take aim at the president. At the start of the year, he insisted his days of artistically mocking Trump were over, but the pandemic inspired him to get painting once again.\nIn March, he roasted Trump for being “willing to risk countless lives to save his economic record” with this “Jaws”-inspired image:\nTrump is willing to risk countless lives to save his economic record. He has fully become the mayor from Jaws. pic.twitter.com/ZggJClEaXG — Jim Carrey (@JimCarrey) March 27, 2020\nHe also unleashed this NSFW coronavirus-themed depiction of the president:\nAs cases of COVID-19 double every three days in NYC, the President reassures Wall Street that he can handle the important tissues. pic.twitter.com/DZcULploo1 — Jim Carrey (@JimCarrey) March 24, 2020\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/jim-carrey-donald-trump-coronavirus-cure-cartoon_n_5eaa6fe0c5b62eaf043f0618"}