{"authors": ["Jennifer Agiesta", "Cnn Polling Director"], "date_download": "2020-05-04 16:52:25", "date_modify": "2020-05-04 16:52:25", "date_publish": "2020-04-08 10:03:33", "description": "A majority of Americans -- 55% -- now say the federal government has done a poor job preventing the spread of coronavirus in the United States, up eight points in about a week, according to a new CNN poll conducted by SSRS as the nationwide death toll from the virus rose above 12,000.", "filename": "2020_04_08_politics_cnn-poll-coronavirus-april-8_index_1588611145.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407193623-04-coronavirus-briefing-0407-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_cnn-poll-coronavirus-april-8_index_1588611145.html", "title": "CNN Poll: Majority of Americans now say the federal government has done a poor job of preventing coronavirus spread", "title_page": "CNN Poll: Majority of Americans now say the federal government has done a poor job of preventing coronavirus spread - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A majority of Americans -- 55% -- now say the federal government has done a poor job preventing the spread of coronavirus in the United States, up eight points in about a week, according to a new CNN poll conducted by SSRS as the nationwide death toll from the virus rose above 12,000.\nEighty percent feel the worst of the outbreak is yet to come, most (55%) feel President Donald Trump could be doing more to fight the outbreak, and 37% say they have grown more concerned about coronavirus in the last few days, far outpacing the 5% who say their fears have eased recently.\nAbout 1 in 5 (22%) say they personally know someone who has been diagnosed with the virus, a figure that is double the share who said so in a Washington Post/ABC News poll conducted just two weeks ago.\nJust under half (46%) say it is at least somewhat likely that they or someone in their family will contract the coronavirus, and there are deep disparities by socio-economic status and partisanship in Americans' level of confidence that they will be able to get treatment should they become ill with the virus.\nRating the government\nA majority, 52%, say they disapprove of the way Trump is handling the coronavirus outbreak, and 45% approve. Both figures have risen since early March, when 41% approved, 48% disapproved and 11% weren't sure how they felt about the President's handling of the viral outbreak.\nStill, just 43% say the President is doing everything he could to fight the outbreak, while 55% say he could be doing more -- including 17% among those who approve of his handling of it so far and 18% of Republicans.\nThe President's overall approval rating stands at 44% approve to 51% disapprove, little changed from a 43% approve to 53% disapprove reading in each of the previous three CNN polls. On handling health care policy, his ratings stand at 42% approve to 52% disapprove, his best approval rating on that topic since 2017.\nBut ratings of the federal government's performance in preventing the virus' spread are clearly worsening, with disapproval rising 12 points in a month.\nPerceptions about the federal government's handling of coronavirus are deeply divided by party, with 80% of Republicans saying the federal government has done a good job preventing its spread and 85% of Democrats saying the government has done a poor job. This polarization has only widened in the last few weeks. While the share of Democrats who say the government has done a poor job rose 18 points since a late March poll, the percentage of Republicans who feel the same way has slid four points.\nWith the health care system straining from the growing number of coronavirus cases, 69% say the government ought to be doing more to address the shortage of personal protective equipment and medical devices used in the treatment of coronavirus.\nThe partisan gap on this question is smaller than the divide over other questions about the government response, with 87% of Democrats, 72% of independents and 42% of Republicans in agreement that the federal government should be doing more to address those shortages.\nThere is partisan agreement, however, that the worst is yet to come in the outbreak. Among Republicans, 70% feel that way, as do 81% of independents and 89% of Democrats.\nSocial distancing\nMore than 9 in 10 say they understand the social distancing guidelines that have been put in place where they live, but far fewer have faith in their neighbors' implementation of the guidelines. Overall, 74% say people in their community are following the rules at least somewhat well, but just 28% think their neighbors are doing \"very well\" following the rules.\nThere is a regional divide, with respondents in the South least likely to give their neighbors high marks for adhering to the rules: 68% in the South say people in their communities are doing very or somewhat well following the guidelines vs. 75% in the Midwest, 77% in the West and 82% in the Northeast.\nMany Americans, 83%, reported leaving home in the last seven days to buy groceries or other necessities. Seniors (71%) were less apt to have left home for groceries or other necessities than were those under age 64 (87%).\nMany with jobs, 57%, said they left the house in the last week to go to work. Those venturing out for work are more likely to be male (71% of employed men say they left the house for work in the last week compared with 42% of women), or to be without a college degree (65% without degrees said they went out to go to work compared with 44% who do have degrees).\nLess than half of adults, however, say they have left their homes in the last week to exercise (43%), visit friends, family or neighbors (22%) or to seek medical care (13%).\nLooking ahead, 60% of Americans say they would feel uncomfortable returning to their regular routines if social distancing guidelines were lifted after April 30. Republicans (53%) are more likely to say they would feel comfortable returning to their routines at that time than are independents (37%) or Democrats (23%), and men are more apt to say they would be comfortable with it (46%) than were women (28%).\nDealing with the virus\nWhile about half of Americans say a case of coronavirus in their family is at least somewhat likely, those numbers are divided by party and by age. Among Republicans, 40% say it is at least somewhat likely, compared with 52% of Democrats. And perhaps paradoxically given the infection patterns seen so far, seniors (38% at least somewhat likely) are far less likely to think the virus will touch their families than are Americans under age 35 (53%).\nMost Americans say they feel at least somewhat prepared to handle a coronavirus infection should it happen in their family (71% say so, down slightly from 76% in late March).\nOnly about a third, however, say they are \"very confident\" in their ability to get medical treatment for coronavirus, and there are broad differences by race, income and partisanship within those findings.\nAmong whites, 40% say they are very confident they could get medical care in the next week for coronavirus. That drops to 28% among people of color. By income, those with annual incomes of $50,000 or more are far more confident than those earning less than that (43% among the higher income group, 28% in the lower one). And among Republicans, 51% say they feel confident in their ability to get care in the next week for the virus vs. 34% of independents and 23% of Democrats.\nThe CNN Poll was conducted by SSRS April 3 through 6 among a random national sample of 1,002 adults reached on landlines or cellphones by a live interviewer. Results for the full sample have a margin of sampling error of plus or minus 3.7 percentage points.", "url": "https://www.cnn.com/2020/04/08/politics/cnn-poll-coronavirus-april-8/index.html"}