{"authors": ["Kelly Mena", "Jeremy Herb"], "date_download": "2020-05-04 17:03:35", "date_modify": "2020-05-04 17:03:35", "date_publish": "2020-04-10 22:16:41", "description": "The United States postal service said Friday it is investigating potential issues with absentee ballots in Wisconsin, which held a highly controversial primary on Tuesday in the middle of the coronavirus pandemic.", "filename": "2020_04_10_politics_absente_917e4b2b8df92363dda01f98fc3342c4_index_1588611815.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407122940-05-wisconsin-voting-lines-0407-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_absente_917e4b2b8df92363dda01f98fc3342c4_index_1588611815.html", "title": "Postal Service looking into absentee ballot delivery irregularities in Wisconsin", "title_page": "Absentee ballots: Postal Service looking into delivery irregularities in Wisconsin  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington, DC (CNN) The United States postal service said Friday it is investigating potential issues with absentee ballots in Wisconsin, which held a highly controversial primary on Tuesday in the middle of the coronavirus pandemic.\nThe probe comes just one day after Wisconsin's US Senators, Republican Ron Johnson and Democrat Tammy Baldwin, sent a letter to the Inspector General of the US Postal Service, urging for an investigation into reports of absentee ballots that were not delivered to voters and the discovery of absentee ballots at a USPS processing center.\nThe letter cites three issues with Milwaukee County absentee ballots, saying in part that \"three tubs of absentee ballots from Appleton and Oshkosh were discovered in USPS's Milwaukee processing center after polls closed on Tuesday\" and that batches of absentee ballots requested on March 22 and 23 failed to be delivered to voters.\nThe third instance cited in the letter involves the village of Fox Point, which is located within Milwaukee County, that reported \"that USPS returned to them multiple batches of unsent absentee ballots and they were unable to obtain an explanation from their local post office as to why they were not delivered to the voters who requested them. \"\n\"We are concerned there may be more examples, and request that you promptly open an investigation to determine the cause of these failures, which appear to have disenfranchised many Wisconsin voters,\" said the senators in the letter.\nRead More", "url": "https://www.cnn.com/2020/04/10/politics/absentee-ballots-postal-service-wisconsin/index.html"}