{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:54:31", "date_modify": "2020-05-04 16:54:31", "date_publish": "2020-04-08 18:05:41", "description": "Bernie Sanders bowed to the inevitable, and math, on Wednesday as he announced the end of his 2020 Democratic presidential campaign.", "filename": "2020_04_08_politics_sanders-2020-joe-biden-president_index_1588611271.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200310222024-02-bernie-sanders-0306-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_sanders-2020-joe-biden-president_index_1588611271.html", "title": "Bernie Sanders didn't win. Here's what he did do.", "title_page": "Democratic primary 2020: What Bernie Sanders proved by running for president - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Bernie Sanders bowed to the inevitable, and math, on Wednesday as he announced the end of his 2020 Democratic presidential campaign.\n\"While we are winning the ideological battle and while we are winning the support of so many young people and working people throughout the country, I have concluded that this battle for the Democratic nomination will not be successful,\" the Vermont senator told supporters on a live-streamed call. \"And so today I am announcing the suspension of my campaign.\"\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!\nThat announcement ends a five-year run that encompassed two presidential campaigns for Sanders. He finished second in both races -- losing a protracted delegate fight to Hillary Clinton in 2016 and again watching as the Democratic establishment pick, former Vice President Joe Biden, again surpassed him in 2020.\nSo, what then did Sanders prove over the last half-decade of seeking national office? And what did he not?\nLet's take the first question first.\nWhen Sanders began running for president on April 30, 2015, he was widely regarded as the longest of long shots -- a liberal's liberal who, while he had a demonstrated record of success in Vermont, would present very few problems for Clinton's coronation as the Democratic nominee. So lightly regarded was Sanders that many \"experts\" believed that former Maryland Gov. Martin O'Malley would pose a more serious threat to Clinton's chances than Sanders.\nWhat Sanders understood long before Clinton, the Democratic establishment and much of the media, was that the base of the party was far more liberal than its top leaders in Washington. And had been for some time. And that base was sick to death of having their priorities ignored or shelved in pursuit of so-called \"pragmatic\" solutions.\nSanders channeled that frustration and alienation in two critical ways.\nFirst, he unapologetically embraced longtime liberal policy totems like single-payer health care (\"Medicare for All\" as Sanders dubbed it), a $15 minimum wage and putting the threat of climate change front and center in the national debate.\nSecond, Sanders was, oddly, the perfect messenger for not only those liberal policies but for liberal voters too. His unkempt appearance, his wrinkled suits, the volume -- loud! -- at which he spoke all fit the un-politician that so many Democrats were looking for.\nHis age -- Sanders was 73 when he first began running for president -- also played a role -- in a positive way. This was a man who, in the eyes of Democrats thirsty for someone who actually had long-held principles, had been saying the same stuff for decades. He was no recent convert to being a liberal. He had been waiting for people to come to seeing the world he did for lots of years.\nWhile Sanders wound up losing the delegate battle to Clinton in that first race -- his side would say superdelegates being factored into the count led to the unfair perception that he could never beat her -- there's no question that he vastly outperformed expectations and, in so doing, installed himself as a mover and shaker within the party on both the policy and political fronts.\nBy 2017, for example, Sanders' \"Medicare for All\" legislation, which had been largely dismissed by the Democratic establishment prior to the 2016 primary, was suddenly all the rage -- with virtually every would-be 2020 aspirant signing on as a co-sponsor . (Biden was a notable exception.)\nThe following year, in one of the biggest upsets in modern political history, an unknown New York City bartender named Alexandria Ocasio-Cortez beat Rep. Joe Crowley, a member of the Democratic leadership in Washington, in a House primary. Ocasio-Cortez ran, like Sanders, as an avowed democratic socialist and cited Sanders as her inspiration.\n\"The only reason that I had any hope in launching a long-shot campaign for Congress is because Bernie Sanders proved that you can run a grassroots campaign and win in an America where we almost thought it was impossible,\" she said\nCombine Sanders' surprise showing in 2016 with AOC's earth-shaking upset in 2018 and it seemed clear that liberalism -- and anti-Washington establishment sentiment -- was on the march within the Democratic Party.\nAnd so, when Sanders got into the 2020 race he did so as a front-runner -- or co-front-runner alongside Biden, the clear establishment favorite.\nSanders faced questions about whether he could repeat his 2016 performance with a much-larger field and with lots of other candidates trying to occupy his space on the far left of the party. For a time in the summer of 2019, Massachusetts Sen. Elizabeth Warren appeared to have wrestled the mantle of liberals' favorite liberal away from Sanders as she soared to the top of polling in early states and nationally.\nBut Sanders persisted. And the army of supporters that he had built in the 2016 race -- and carefully cultivated in between the races -- never abandoned him, producing tens of millions in campaign contributions and an incredible grassroots organizing base.\nHe came within a whisker of winning the Iowa caucuses. He won the New Hampshire primary. And then he won the Nevada caucuses, at which point it appeared as though Sanders was going to be the Democratic nominee, with only Biden in South Carolina in his way.\nBut not only did Biden win South Carolina's primary on February 29 but he did so in such an overwhelming manner -- and with such strong support from African American voters -- that the former VP suddenly found himself riding a swell of momentum that neither Sanders nor any other Democrat could stop. When Biden rolled to a series of victories on Super Tuesday (March 3), the race was as good as over.\nWhich brings me to what Sanders' two presidential campaigns didn't prove: That a liberal's liberal could win a majority of the Democratic presidential primary vote and be chosen as the party's nominee over a more centrist candidate with establishment backing.\nWhat Sanders had was a hugely enthusiastic base of supporters that included young people, liberals and Hispanics. What Biden had was overwhelming support among African American voters and solid backing from moderate and conservative Democrats.\nAs was the case in 2016 -- when Clinton had the majority of non-white voters within the party -- the Sanders coalition was simply not as big as his opponent's. And -- and this is critical -- Sanders was never really able to convince those skeptical of him that he could and would represent their interests as the nominee. Too many Democrats viewed a vote for Sanders as a risk rather than as an opportunity. And it doomed him.\nIt's possible that come 2024 or 2028 someone in the Sanders' mold -- Ocasio-Cortez turns 35 and could serve as president in October 2024 -- will find a way to solve the problem that the Vermont democratic socialist couldn't over the past five years.\nBut that's a debate for the future.\nIn the present, what Sanders proved is that while there is a significant bloc of voters in favor his liberal solutions to America's problems, there still aren't enough to elect someone like him as the Democratic presidential nominee.", "url": "https://www.cnn.com/2020/04/08/politics/sanders-2020-joe-biden-president/index.html"}