{"authors": ["James Anderson"], "date_download": "2020-05-04 20:17:36", "date_modify": "2020-05-04 20:17:36", "date_publish": "2020-04-15 15:23:45", "description": "DENVER (AP) — Colorado Gov. Jared Polis urged residents Wednesday to prepare for social distancing as a fixture of life even after restrictions on business activities are eased — at least until a...", "filename": "_efe5212a0fb1eacfb851a16b12b56529_1588623456.html", "image_url": "https://storage.googleapis.com/afs-prod/media/2fefa13761244988a3b0e26a81080c22/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_efe5212a0fb1eacfb851a16b12b56529_1588623456.html", "title": "Colorado governor: Without cure, social distancing to stay", "title_page": "Colorado governor: Without cure, social distancing to stay", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Colorado Governor Jared Polis makes a point during a news conference to outline efforts to stem the spread of the new coronavirus Wednesday, April 15, 2020, in Denver. Polis urged residents Wednesday to prepare for social distancing as a fixture of life even after restrictions on business activities are eased - at least until a vaccine or cure is found for the coronavirus. (AP Photo/David Zalubowski)\nColorado Governor Jared Polis makes a point during a news conference to outline efforts to stem the spread of the new coronavirus Wednesday, April 15, 2020, in Denver. Polis urged residents Wednesday to prepare for social distancing as a fixture of life even after restrictions on business activities are eased - at least until a vaccine or cure is found for the coronavirus. (AP Photo/David Zalubowski)\nDENVER (AP) — Colorado Gov. Jared Polis urged residents Wednesday to prepare for social distancing as a fixture of life even after restrictions on business activities are eased — at least until a vaccine or cure is found for the coronavirus.\nIn addition, any easing of stay-at-home orders, crowd gathering bans, business closures and other measures will be gradual, Polis said at a news briefing.\nTo prepare, businesses should consider continued telecommuting where possible, staggered work shifts, barriers between work stations and other ways to contain the virus, he said.\nBefore any rollbacks occur, Polis stressed that more data is needed to determine how effective social distancing has been in Colorado, where at least 357 people have died.\nLacking a vaccine — which experts say could take 12 to 18 months to develop — there is no going back to life-as-normal in pre-pandemic times, the governor said.\n“We do not have that magic wand,” he said. “We do have science, and science will get us there.”\nPolis also emphasized, however, that current restrictions on people’s movements can’t be sustained economically, socially or psychologically.\nThe governor reacted emotionally when asked by a reporter about social media criticisms of shelter-in-place and other orders as totalitarian.\n“We act to save lives,” he said.\nThe governor said the state is publishing new statistics on COVID-19 victims by race and data on outbreaks at independent and assisted living sites, nursing homes and long-term care facilities, as well as state prisons and local jails.\nPolis also thanked the government of Taiwan for donating 100,000 medical masks to Colorado.\nFor most people, the coronavirus causes mild or moderate symptoms that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.\n— Vice President Mike Pence will attend Saturday’s scaled-down Air Force Academy commencement ceremony in Colorado Springs to address graduating cadets in person, not by video as originally planned.\nThe event usually attracts a big crowd to Falcon Stadium and ends with a traditional demonstration by the Air Force Thunderbirds. The pandemic forced the academy to close the event to visitors and limit it to 30 minutes.\nCadets will march 6 feet (1.8 meters) apart and sit 8 feet (2.4 meters) apart during the event, The Gazette reported.", "url": "https://apnews.com/efe5212a0fb1eacfb851a16b12b56529"}