{"authors": ["Jacqueline Howard"], "date_download": "2020-05-04 17:00:50", "date_modify": "2020-05-04 17:00:50", "date_publish": "2020-04-10 07:19:14", "description": "The annual rate of newly reported hepatitis C infections in the United States has increased threefold, according to the US Centers for Disease Control and Prevention.", "filename": "2020_04_10_health_hepatitis-c-infection-rate-rises_index_1588611650.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410011904-hepatitis-c-virus-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_health_hepatitis-c-infection-rate-rises_index_1588611650.html", "title": "Rate of new US hepatitis C infections rises threefold in the past decade, new report finds", "title_page": "Rate of new US hep C infections rises three-fold in past decade, CDC now says all adults should be screened at least once - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The annual rate of newly reported hepatitis C infections in the United States has increased threefold, according to the US Centers for Disease Control and Prevention.\nA new CDC report finds that the annual rate rose from a rate of 0.3 cases per 100,000 people in 2009 to a rate of 1.2 per 100,000 people in 2018. That report also makes new recommendations for all adults to get screened for hepatitis C at least once in their lifetimes.\nThe new Vital Signs report included data on confirmed acute hepatitis C cases between 2009 and 2018 from the CDC's National Notifiable Diseases Surveillance System. Hepatitis C is the most commonly reported bloodborne infection in the United States.\nThe report, published in the CDC's Morbidity and Mortality Weekly Report on Thursday, finds that the highest rate of new hepatitis C cases in 2018 was among younger adults ages 20 to 39.\nAmong adults ages 20 to 29, rates increased about 300% from 0.7 per 100,000 in 2009 to 3.1 per 100,000 in 2018. Among adults ages 30 to 39, rates increased about 400%, from 0.5 per 100,000 in 2009 to 2.6 per 100,000 in 2018, according to the report.\nAccording to the CDC, hepatitis C previously was seen as a concern primarily for baby boomers and people with risk factors, such as injection drug use, but the new data finds that in 2018:\nMillennials, or those born during 1981 to 1996, accounted for 36.5% of newly reported chronic hepatitis C infections.\nBaby boomers accounted for 36.3% of newly reported chronic infections.\nGeneration X, born during 1966 to 1980, accounted for 23.1% of newly reported chronic infections.\n\"Following a decade of sharp increases in acute hepatitis C infections, particularly among young adults, the rates of newly reported chronic infections among baby boomers and millennials are now equal, demonstrating that even younger generations are at risk,\" the researchers wrote in the new report.\nThey wrote that diagnosing hepatitis C infection \"is a necessary first step to linking persons to cure to prevent life-threatening consequences of long-term chronic infections and transmission to others.\"\nThe CDC announced in the report that \"new CDC hepatitis C testing recommendations advise screening all adults and pregnant women,\" so that adults 18 and older are screened at least once in their lifetime and women are screened during each pregnancy. Previously, the agency recommended testing only for adults born from 1945 through 1965, and for people with certain risk factors, regardless of age.\nNow with the new data, \"these findings highlight the need for immediate implementation of the new CDC universal hepatitis C screening recommendations for all adults and pregnant women,\" the researchers wrote in the report.\nThe new CDC recommendations are similar to updated recommendations made in March by the US Preventive Services Task Force, which recommended screening for hepatitis C infection in all adults ages 18 to 79 without known liver disease, regardless of their risk -- expanding its previous recommendation to screen only adults born between 1945 and 1965, and others at high risk.\nYet differing from the new CDC recommendations, the USPSTF recommendations include an upper age limit and do not recommend screening during every pregnancy.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nLauren Canary, an epidemiologist and director of the National Viral Hepatitis Roundtable , applauded the CDC's new recommendations in an email on Wednesday, ahead of their release.\n\"All U.S. adults should be screened at least once for hepatitis C. Pregnant persons should be screened with every pregnancy just as they are for other infectious diseases, and those at continued risk for hepatitis C should be screened regularly as recommended by their primary care providers,\" Canary said in the email.\n\"The universal screening for hepatitis C is critical at this time as those with underlying health conditions, especially liver disease, are at an increased risk for COVID-19,\" Canary said. \"However, 40% of Americans with hepatitis C don't even know that they have it. The CDC recommendations will help direct the public health response to this ongoing infectious disease epidemic as cases continue increasing.\"", "url": "https://www.cnn.com/2020/04/10/health/hepatitis-c-infection-rate-rises/index.html"}