{"authors": [], "date_download": "2020-05-04 20:18:39", "date_modify": "2020-05-04 20:18:39", "date_publish": "2020-04-29 13:04:59", "description": "The documents were released following a court case brought by The Associated Press and other media organizations.", "filename": "entry_fbi-documents-communication-between-roger-stone-julian-assange_n_5ea975bec5b6fb98a2b5ceb6_1588623519.html", "image_url": "https://img.huffingtonpost.com/asset/5ea978642500008c10eb08db.jpeg?cache=35b0iclc9n&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_fbi-documents-communication-between-roger-stone-julian-assange_n_5ea975bec5b6fb98a2b5ceb6_1588623519.html", "title": "FBI Documents Reveal Communication Between Roger Stone, Julian Assange", "title_page": "FBI Documents Reveal Communication Between Roger Stone, Julian Assange | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "WASHINGTON (AP) — Weeks after Robert Mueller was appointed special counsel in the Russia investigation, Roger Stone, a confidant of President Donald Trump, reassured WikiLeaks founder Julian Assange in a Twitter message that if prosecutors came after him, “I will bring down the entire house of cards,” according to FBI documents made public Tuesday.\nThe records reveal the extent of communications between Stone and Assange, whose anti-secrecy website published Democratic emails hacked by Russians during the 2016 presidential election, and underscore efforts by Trump allies to gain insight about the release of information they expected would embarrass Democratic opponent Hillary Clinton.\nThe documents — FBI affidavits submitted to obtain search warrants in the criminal investigation into Stone — were released following a court case brought by The Associated Press and other media organizations.\nThey were made public as Stone, convicted last year in Mueller’s investigation into ties between Russia and the Trump campaign, awaits a date to surrender to a federal prison system that has grappled with outbreaks of the coronavirus.\nIn a June 2017 Twitter direct message cited in the records, Stone reassured Assange that the issue was “still nonsense” and said “as a journalist it doesn’t matter where you get information only that it is accurate and authentic.”\nHe cited as an example the 1971 Supreme Court ruling that facilitated the publishing by newspapers of the Pentagon Papers, classified government documents about the Vietnam War.\n“If the US government moves on you I will bring down the entire house of cards,” Stone wrote, according to a transcript of the message cited in the search warrant affidavit. “With the trumped-up sexual assault charges dropped I don’t know of any crime you need to be pardoned for — best regards. R.”\nStone was likely referring to a sexual assault investigation dropped by Swedish authorities. Assange, who at the time was holed up in the Ecuadorian Embassy in London, was charged last year with a series of crimes by the U.S. Justice Department, including Espionage Act violations for allegedly directing former Army intelligence analyst Chelsea Manning in one of the largest compromises of classified information in U.S. history.\nAccording to the documents, Assange, who is imprisoned in London and is fighting his extradition to the United States, responded to Stone’s 2017 Twitter message by saying: “Between CIA and DoJ they’re doing quite a lot. On the DoJ side that’s coming most strongly from those obsessed with taking down Trump trying to squeeze us into a deal.”\nStone replied that he was doing everything possible to “address the issues at the highest level of Government.”\nASSOCIATED PRESS Wikileaks founder Julian Assange leaves in a prison van after appearing at Westminster Magistrates Court, for an administrative hearing in London, Monday, Jan. 13, 2020. (Dominic Lipinski/PA Wire via AP)\nThe records illustrate the Trump campaign’s curiosity about what information WikiLeaks was going to make public. Former White House adviser Steve Bannon told Mueller’s team under questioning that he had asked Stone about WikiLeaks because he had heard that Stone had a channel to Assange, and he was hoping for more releases of damaging information.\nMueller’s investigation identified significant contact during the 2016 campaign between Trump associates and Russians, but did not allege a criminal conspiracy to tip the outcome of the presidential election.\nIn a statement Tuesday, Stone acknowledged that the search warrant affidavits contain private communication, but insisted that they “prove no crimes.”\n“I have no trepidation about their release as they confirm there was no illegal activity and certainly no Russian collusion by me during the 2016 Election,” Stone said. “There is, to this day, no evidence that I had or knew about the source or content of the Wikileaks disclosures prior to their public release.”\nStone was among six associates of Trump charged in Mueller’s investigation. He was convicted last year of lying to House lawmakers, tampering with a witness and obstructing Congress’ own Russia probe.\nA judge in February sentenced Stone to 40 months in prison in a case that exposed fissures inside the Justice Department — the entire trial team quit the case amid a dispute over the recommended punishment — and between Trump and Attorney General William Barr, who said the president’s tweets about ongoing cases made his job “impossible.”\n____\nAssociated Press writer Jill Colvin in Washington contributed to this report.", "url": "https://www.huffpost.com/entry/fbi-documents-communication-between-roger-stone-julian-assange_n_5ea975bec5b6fb98a2b5ceb6"}