{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:18:06", "date_modify": "2020-05-04 20:18:06", "date_publish": "2020-04-29 11:00:00", "description": "The system is in danger of collapse, warn Sens. Elizabeth Warren and Tina Smith in a letter signed by 28 other lawmakers.", "filename": "entry_senate-democrats-childcare-stimulus_n_5ea8e951c5b6fb98a2b4b945_1588623486.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8e9b82500007210eb086e.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_senate-democrats-childcare-stimulus_n_5ea8e951c5b6fb98a2b4b945_1588623486.html", "title": "Senate Democrats Press For $50 Billion Child Care Bailout In Next Stimulus", "title_page": "Senate Democrats Press For $50 Billion Child Care Bailout In Next Stimulus | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Senate Democrats led by Elizabeth Warren (D-Mass.) and Tina Smith (D-Minn.) are pushing for a $50 billion bailout to keep an essential industry afloat: the child care system.\nDay care centers and in-home child care providers who educate and care for very young children while their parents are at work are absolutely crucial to millions of working families. But the whole industry is in danger of going under as the economic fallout from the coronavirus pandemic deepens. Without a bailout, half of the nation’s providers might fail, according to one recent analysis.\nIn a letter to Senate Majority Leader Mitch McConnell (R-Ky.) and Minority Leader Chuck Schumer (D-N.Y.) sent Wednesday morning, the senators ask that the $50 billion be a part of the next stimulus package that Congress passes to deal with the rolling economic and public health crisis sparked by COVID-19. The other senators who signed the letter include Cory Booker (D-N.J.), Kirsten Gillibrand (D-N.Y.), Doug Jones (D-Ala.), and Bernie Sanders (I-Vt.).\n“We have only two options as a country: we can either do what is needed to stabilize the childcare system, or we can watch childcare providers collapse, one by one in our communities, leaving children, families, and childcare workers with no system to return to and hamstringing our economic recovery,” the senators wrote.\nThis letter is one of several sent by Warren, who is also pressing for essential worker protections in the next stimulus.\nThe child care system, chronically neglected by policymakers, was already on shaky footing going into this crisis. Centers operate on razor-thin margins, and child care providers are among some of the lowest-paid workers in the country. In many areas of the U.S., there was already a shortage of licensed providers.\nNow, in the wake of coronavirus closures, many child care workers have already been furloughed or laid off. Some centers say they may not be able to reopen if they don’t get more help to float expenses. Those that are still open to take in the children of essential workers are struggling with lower revenues and increased costs to operate safely during the health crisis.\nWe’re worried about parents going back into the workforce and their child care isn’t there. Are they going to get laid off? Nina Perez, early childhood national campaign director at MomsRising\nSmith and Warren first sent a similar letter to Senate leadership ahead of the passage of the CARES ACT, the $2 trillion stimulus passed in late March. That legislation included $3.5 billion for child care providers ― far less than what experts believe is needed.\nAccording to a report released last week from the Center for Law and Social Policy, it would cost $9.6 billion a month to sustain providers through the pandemic.\nSmith and Warren published a Medium post about their plan for a $50 billion child care bailout on April 15.\nThe senators want to use the money to fund the child care centers that are open now to serve the children of essential workers. These operations are struggling because fewer kids are coming for care, and because it costs more to implement the proper safety precautions necessary to handle coronavirus concerns ― think masks, temperature checks, longer operating hours and more intensive cleaning procedures.\nThey also call for paid leave and hazard pay for teachers who are risking their own health to work during the crisis.\nThe child care centers that are closed also need money to cover business expenses and keep workers on payroll. While some providers were able to get relief from the small business loan program that was part of the CARES Act, many were shut out.\nThe senators are calling for the next stimulus to include provisions to make those small business loans more accessible to providers. They point out that it will be difficult to come back from the economic collapse caused by the pandemic if parents can’t send their children to child care.\n“When the economy can safely start to come back, millions of parents will not be able to return to work or reopen their own small businesses if they cannot find safe, affordable, and reliable care for their children,” they write.\nThe child care system is particularly crucial for working mothers, and its collapse would have tremendous financial consequences for parents who can’t get back to work if their kids’ day care is out of business.\nThis could lead to further discrimination against working parents, and even a widening of the gender pay gap.\n“We’re worried about parents going back into the workforce and their child care isn’t there,” Nina Perez, the early childhood national campaign director at the advocacy group MomsRising, told HuffPost. “Are they going to get laid off?”\nThe next stimulus package would be the fourth Congress passes to deal with the consequences of the coronavirus. Republicans and Democrats are already fighting over who will get bailed out next time, with Democrats pressing for protections for workers and aid to cash-strapped states. Meanwhile, the White House is looking for more tax cuts. And McConnell is looking to protect employers from COVID-related lawsuits.\nDemocrats and progressives are also pushing for hazard pay for essential workers and other protections for those still working during this public health crisis. Most of their policy demands face long odds in the Republican-led Senate, but Democrats will have some leverage in the House to get their priorities passed.\nRead the letter below.", "url": "https://www.huffpost.com/entry/senate-democrats-childcare-stimulus_n_5ea8e951c5b6fb98a2b4b945"}