{"authors": [], "date_download": "2020-05-04 16:53:06", "date_modify": "2020-05-04 16:53:06", "date_publish": "2020-04-08 16:05:55", "description": "The next time you fill up your online grocery cart, think about throwing in a few of these treats.", "filename": "2020_04_08_cnn-underscored_best-snacks-online_index_1588611186.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407121350-snacking-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_cnn-underscored_best-snacks-online_index_1588611186.html", "title": "15 best junk-food snacks online", "title_page": "15 best junk-food snacks online - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored has interviewed experts to find the best options to help you cope during this uncertain time. Find all our coronavirus-related coverage here, and let us know your thoughts here.\nIn times of stress, comfort food can quickly transport you to your happy place. Studies have shown that certain sweet or salty snacks can activate the brain's reward system and generate feelings of well-being when consumed in moderation (i.e., enjoying a taste of nostalgia can be fun, but downing a whole cake in one sitting is probably not the healthiest choice).\nThe benefits of feel-good foods in times of uncertainty can be easy to overlook when you're piling your cart full of essentials. But adding a few indulgent snacks to your list can lead to a much-needed temporary mood boost. According to a 2013 study reprinted by the National Center for Biotechnology Information, people and other animals reach for sugary and fatty snacks in times of stress.\nNostalgic foods and treats associated with special memories are among the comfort foods that people reach for when stressed. A 2016 Harris Poll of America's favorite comfort foods revealed a few clear winners including pizza, chocolate and ice cream — no surprises there. The next time you fill up your grocery cart, think about throwing in a few of these treats. They're all a click away from being on their way to your taste buds.\nSweet\nGiant Gummy Bear ($29; amazon.com)\nGiant Gummy Bear\nFew things are more comforting than a teddy bear, especially one that's oversize, edible and cherry-flavored.\nDuncan Hines Red Velvet Cake Mix ($1.49; target.com)\nDuncan Hines Red Velvet Cake Mix\nYou don't need a special occasion to whip up the good memories a cake will conjure. Since baking can be therapeutic, making a cake and eating it too (in moderation, of course) counts as a double reward.\nEntenmann's Mini Rich Frosted Donuts (prices vary; instacart.com)\nEntenmann's Mini Rich Frosted Donuts\nBiting through that thin layer of chocolate around an Entenmann's frosted doughnut is a one-of-a-kind indulgence.\nReese's Peanut Butter Eggs ($3.59; target.com)\nReese's Peanut Butter Eggs\nEaster is around the corner, which means it's prime time for seasonal candy. Many people agree that peanut butter with chocolate is a match made in comfort-food heaven. Science backs it up with a theory called dynamic sensory contrast.\nFlipz Milk Chocolate Covered Pretzels (prices vary; instacart.com)\nFlipz Milk Chocolate Covered Pretzels\nSalty-sweet with a gratifying crunch, classic chocolate-covered pretzels are hard to beat.\nSavory\nRuffles All Dressed Chips (prices vary; instacart.com)\nRuffles All Dressed Chips\nCan't decide between barbecue, salt and vinegar or ketchup flavor? You don't have to with the inexplicably satisfying combo of All Dressed chips.\nKraft Macaroni & Cheese, 5-count ($4.69; target.com)\nKraft Macaroni & Cheese, 5-count\nYou may not be surprised to learn that mac and cheese also ranked high in that poll of America's favorite comfort foods. A box of Kraft's is perfect for snacktime sharing.\nPop Secret Movie Theater Butter Popcorn ($4.99; target.com)\nPop Secret Movie Theater Butter Popcorn\nRecreate the movie-going experience at home with Pop Secret movie theater-style popcorn. You won't have to worry about finding a good seat, and refills are up to you.\nCheetos Flamin' Hot Puffs ($3.79; target.com)\nCheetos Flamin' Hot Puffs\nA favorite among those with a taste for spice, Cheetos Flamin' Hot Puffs also make for a satisfying at-home movie snack.\nMini Babybel Original Semisoft Cheeses, 14-count ($6.39; target.com)\nMini Babybel Original Semisoft Cheeses, 14-count\nThe only thing more pleasing than Babybel's creamy single-serve cheese is releasing it from the signature wax casing.\nNostalgic\nTotino's Pizza Rolls (prices vary; instacart.com)\nTotino's Pizza Rolls\nAccording to that Harris Poll, pizza topped the list of most-craved junk foods in America. You could grab a pie from your local pizza place or a frozen version from Instacart. You could also get a little more nostalgic and grab some Totino's Pizza Rolls and pop them in the microwave or toaster.\nOre-Ida Tater Tots (prices vary; instacart.com)\nOre-Ida Tater Tots\nIf you've ever drooled over tater tots on kids-only menus, now's a perfect time to bring home these crisp childhood classics.\nSlim Jims Original Smoked Snack Sticks, 26-count ($5.29; target.com)\nSlim Jims Original Smoked Snack Sticks, 26-count\nIf it's excitement you crave, the snap and spice of a Slim Jim always delivers.\nDehydrated Cereal Marshmallows ($14.99; amazon.com)\nDehydrated Cereal Marshmallows\nThere's no need to go digging for treasure when you can cut straight to the good stuff. Pairing these dehydrated, colorful marshmallows with milk is optional, but it may be worth slurping the sweet soup that's left over in the bowl.\nAstronaut Neapolitan Ice Cream Sandwich, 6-count ($25.99; amazon.com)\nAstronaut Neapolitan Ice Cream Sandwich, 6-count\nThough it may not resemble any ice cream that actually made it into space, the freeze-dried crumble of chocolate, strawberry and vanilla is still among the great comfort food marvels of the universe.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/08/cnn-underscored/best-snacks-online/index.html"}