{"authors": ["Grant Schulte"], "date_download": "2020-05-04 20:17:13", "date_modify": "2020-05-04 20:17:13", "date_publish": "2020-04-15 16:43:30", "description": "LINCOLN, Neb. (AP) — Nebraska state officials and business groups on Wednesday asked companies and nonprofits to outline what can be done to help them recover financially after the coronavirus...", "filename": "_d3cf196c215f1ccef42603bb8e85652d_1588623433.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d3cf196c215f1ccef42603bb8e85652d_1588623433.html", "title": "Nebraska officials seek business input for virus recovery", "title_page": "Nebraska officials seek business input for virus recovery", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LINCOLN, Neb. (AP) — Nebraska state officials and business groups on Wednesday asked companies and nonprofits to outline what can be done to help them recover financially after the coronavirus pandemic subsides.\nThe Department of Economic Development, the University of Nebraska and the Nebraska Chamber of Commerce & Industry released a survey that asks business owners and nonprofits whether they plan to cut staff, what their top concerns are and whether they plan to seek federal assistance, among other questions.\n“This is an opportunity for Nebraska businesses to have their voices heard and to be able to share with us what’s going on as we think about how we plan for future growth,” Gov. Pete Ricketts said at a news conference.\nUniversity of Nebraska President Ted Carter said the university will start compiling the answers as soon as they’re received.\n“We’re very hopeful that people will start filling out those surveys to help bring businesses back to life,” he said.\nNebraska had 901 confirmed coronavirus cases and 20 deaths as of Tuesday evening, according to data compiled by the state Department of Health and Human Services. More than 10,800 people have tested negative. Nebraska reported 34 new cases on Tuesday, down from 64 the day before.\nAlso Wednesday, the Nebraska state employees’ union delivered more than 1,600 petitions to Gov. Pete Ricketts’ office demanding that he give all state workers the option to work from home if their jobs allow it.\nThe petitions also call for an extra $2 an hour in “hazard pay” for those who have to work in-person during the coronavirus pandemic. The petition was a follow-up to a letter the union sent to Ricketts earlier this month with the same demands.\n“State employees are concerned and they are anxious,” said Justin Hubly, executive director of the Nebraska Association of Public Employees. “We need the governor to take action to ensure their safety.”\nHubly said the only safeguard in some state offices is a bottle of hand sanitizer. The union has also questioned why call-center employees aren’t allowed to do their jobs from home.\nRicketts, a Republican, has said it isn’t possible for all state employees to work from home because the state still has to provide essential services. He has said employees with concerns about their work environment should talk to their managers.\n“We’ve got a lot of people who are working very, very hard in very trying circumstances,” Ricketts said Wednesday when asked about the petitions. “These folks are doing their part, and we’ve got to do our part.”\n___\nFollow Grant Schulte on Twitter: https://twitter.com/GrantSchulte", "url": "https://apnews.com/d3cf196c215f1ccef42603bb8e85652d"}