{"authors": [], "date_download": "2020-05-04 20:19:23", "date_modify": "2020-05-04 20:19:23", "date_publish": "2020-04-16 20:37:19", "description": "MADISON, Wis. (AP) — A 16-year-old high school sophomore alleged in a federal lawsuit against a Wisconsin sheriff on Thursday that she was threatened with jail if she didn’t remove social media...", "filename": "_f48c3435663d4a06bb2ac31fefd3298e_1588623563.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f48c3435663d4a06bb2ac31fefd3298e_1588623563.html", "title": "Suit alleges teen threatened with jail over COVID-19 posts", "title_page": "Suit alleges teen threatened with jail over COVID-19 posts", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MADISON, Wis. (AP) — A 16-year-old high school sophomore alleged in a federal lawsuit against a Wisconsin sheriff on Thursday that she was threatened with jail if she didn’t remove social media posts saying she had COVID-19.\nThe Wisconsin Institute for Liberty and Law filed the lawsuit against Marquette County Sheriff Joseph Konrath and a patrol sergeant. The lawsuit alleges that the sergeant went to the home of Amyiah Cohoon of Oxford, Wisconsin, last month and demanded that her Instagram posts be deleted or she and her parents would face arrest.\nNo one was threatened with arrest, and an “aggressive defense” is planned, said Samuel Hall, attorney for the sheriff and the Marquette County Sheriff’s Department. Hall said the girl’s messages “caused distress and panic within the school system and law enforcement acted at the request of school health officials in a good faith effort to avoid unfounded panic.”\nCohoon, a sophomore in the Westfield School District in Marquette County, suffered a severe respiratory illness with symptoms matching those of COVID-19 during a spring break trip to Florida, the lawsuit said. She tested negative for the disease, but her attorney said that doctors told the girl’s family that she likely had the virus but missed the window for testing positive", "url": "https://apnews.com/f48c3435663d4a06bb2ac31fefd3298e"}