{"authors": ["Por Gonzalo Solano"], "date_download": "2020-05-04 20:10:35", "date_modify": "2020-05-04 20:10:35", "date_publish": "2020-04-16 20:40:01", "description": "QUITO (AP) — El repartidor de comida David Almachi observa la pantalla de su teléfono celular. En el mapa de Quito puntos luminosos marcan los sectores de la ciudad con mayor concentración de...", "filename": "_516d5ddc49e3436c8681356a640c6a46_1588623035.html", "image_url": "https://storage.googleapis.com/afs-prod/media/adc2021187d04862956a7fc62a328bad/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_516d5ddc49e3436c8681356a640c6a46_1588623035.html", "title": "Ecuador usa la tecnología para luchar contra el COVID-19", "title_page": "Ecuador usa la tecnología para luchar contra el COVID-19", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "QUITO (AP) — El repartidor de comida David Almachi observa la pantalla de su teléfono celular. En el mapa de Quito puntos luminosos marcan los sectores de la ciudad con mayor concentración de casos de COVID-19.\n“Uno no se imaginaba que la tecnología podía estar a ese nivel, saber dónde está el peligro en tiempo real. La cosa está brava, pero no queda más que seguir trabajando”, dijo a The Associated Press el joven de 23 años.\nAdemás del riguroso aislamiento -que ya lleva un mes- y el combate sanitario, los ecuatorianos empezaron a utilizar esta semana una novedosa aplicación llamada SaludEc que también entrega información sobre los contagiados, permite verificar que cumplan la cuarentena obligatoria, sirve para agendar citas médicas y provee un cuadro de los síntomas de la enfermedad.\nEl ministro de Telecomunicaciones, Andrés Michelena, explicó a AP que a través de esta herramienta gratuita y de fácil acceso se pudo verificar que un “65% de la población acata la orden de cuarentena, mientras que el resto se mueve y se pone en riesgo de contagio”.\nLa información sobre los contagiados se alimenta con los datos proporcionados por las propias personas con COVID-19 y el ministro aseguró que ningún nombre, dirección o número de teléfono es revelado y que mediante un algoritmo se detecta el movimiento del celular entre antenas.\nPrecisó que en Quito y Guayaquil hay al menos cinco sectores en cada ciudad donde se registra la mayor concentración de casos, aunque la aplicación entrega información detallada de cualquier parte del país.\nGran Bretaña, Alemania e Italia están considerado el uso de esas herramientas, aunque ello ha alarmado a los defensores de la privacidad que temen que un espionaje colectivo de tal magnitud pudiera prestarse a un uso abusivo si no es estrictamente vigilado y que las libertades civiles podrían terminar severamente coartadas.\nPero esta aplicación no ha generado controversias en el país andino que tiene a Guayaquil, la ciudad ecuatoriana más duramente golpeada por la pandemia y donde se registraron escenas desgarradoras de cadáveres sin retirar durante cerca de una semana que se acumulaban en los hogares, hospitales y hasta las calles.\nHasta el jueves, en el país se han reportado 402 fallecidos y 8.225 infectados.\nCuando alguien da positivo a la prueba de coronavirus debe permanecer en aislamiento domiciliario u hospitalario, de acuerdo con la gravedad del caso. Además debe autorizar el uso de sus datos personales -incluido su número de celular- a las autoridades que, mediante la plataforma SaludEC, pueden detectar si ese teléfono permanece inmóvil o está en movimiento.\nMichelena explicó que además de contar con el consentimiento personal, el gobierno realizó una consulta al Tribunal de Garantías Constitucionales para evitar dudas sobre el respeto a la privacidad de los datos personales que utiliza la aplicación.\nAplicaciones como esta han permitido en Europa rastrear los desplazamientos de gente pero en base a datos colectivos. La policía italiana incluso ha comenzado a usar drones para hacer cumplir las restricciones a la movilidad.\nPero aun así hay un argumento a favor del espionaje aun cuando podría atentar contra la privacidad: ha sido empleado por varios gobiernos asiáticos que han tenido éxito en contener la pandemia como China, Taiwán, Hong Kong, Corea del Sur y Singapur.\nEl uso de esta tecnología ha tenido poca repercusión en Latinoamérica.\nEl ministro de Obras Públicas de Bolivia, Iván Arias, indicó que en La Paz los contagiados deben usar pulseras y tobilleras de geolocalización para conocer su ubicación y si están respetando la cuarentena. Pero el país andino no tiene una ley de protección de datos personales, lo que impediría el mal uso de la información individual.\nEn la Ciudad de México el gobierno pidió acceso a las antenas de las empresas telefónicas para monitorear el movimiento y contacto entre las personas con el objetivo de identificar si cumplen el aislamiento y así reducir los contagios.\nMientras, en Argentina, se utiliza este tipo de tecnología para vigilar que quienes llegan del exterior cumplan una cuarentena obligatoria de 14 días en hoteles destinados para ese uso. Tras ese período, deben adoptar de forma obligatoria la geolocalización.\nTanto México como Argentina disponen de leyes de protección de datos personales.\nPablo Solines, presidente de la Asociación Ecuatoriana de Protección de Datos, dijo que “una cosa es que el Estado obtenga esta información por interés púbico (para luchar contra la pandemia) ... y otra es que esta información se haga pública”. Quienes bajan la aplicación tienen la posibilidad de no continuar con el proceso negándose a dar sus datos.\nSegún Michelena, Colombia pidió esta semana a Ecuador información para trabajar en una plataforma similar.\n“De ahora en adelante estaré más atento para ver en mi celular los sitios de mayor riesgo porque no me quiero morir”, dijo Almachi, que reparte los alimentos con mascarilla y guantes.\n---------\nLos periodistas de AP Débora Rey, en Argentina; María Verza, en México, y Carlos Valdez, en Bolivia, contribuyeron en esta nota.", "url": "https://apnews.com/516d5ddc49e3436c8681356a640c6a46"}