{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:23:43", "date_modify": "2020-05-04 16:23:43", "date_publish": "2020-04-06 17:16:29", "description": "Over the weekend, President Donald Trump's coronavirus task force found itself at an impasse over how aggressively to push an anti-malarial drug as a possible treatment for coronavirus.", "filename": "2020_04_06_politics_anthony_a84c7f5b608da87adeb4c532281fb1a2_index_1588609423.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406125044-navarro-fauci-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_anthony_a84c7f5b608da87adeb4c532281fb1a2_index_1588609423.html", "title": "Peter Navarro: Should Donald Trump listen to him or Dr. Anthony Fauci?", "title_page": "Peter Navarro: Should Donald Trump listen to him or Dr. Anthony Fauci? - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Over the weekend, President Donald Trump's coronavirus task force found itself at an impasse over how aggressively to push an anti-malarial drug as a possible treatment for coronavirus.\nOn one side was Peter Navarro, Trump's top trade adviser, who was pushing alleged evidence that hydroxychloroquine was an effective way in which to treat the virus.\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!\nOn the other side was, among others, Dr. Anthony Fauci, the head of the National Institute of Allergy and Infectious Diseases , who was resistant to call hydroxychloroquine effective given the relative lack of statistically significant data from patients treated with it.\nThis, on paper, isn't a fair fight.\nFauci is not only a medical doctor but has been at the work of tracking and dealing with infectious diseases for decades. He has been an adviser to six(!) presidents on \"HIV/AIDS and many other domestic and global health issues,\" according to his biography.\nNavarro is the director of the Office of Trade and Manufacturing Policy at the White House. According to his bio on the White House website , he has a \"Ph.D. in economics from Harvard University and is a professor emeritus of economics and public policy at the University of California, Irvine.\"\nWhich is an impressive resume! I don't have a Ph.D! Nor did I go to Harvard!\nBut Navarro's expertise is the economy. Not infectious disease. Or epidemiology. Or, you know, medicine.\nSeeking to justify his challenging of Fauci on the efficacy of hydroxychloroquine, Navarro told CNN's John Berman this on Monday morning\n\"Doctors disagree about things all the time. My qualifications in terms of looking at the science is that I'm a social scientist. I have a Ph.D. And I understand how to read statistical studies, whether it's in medicine, the law, economics or whatever.\"\nUh, what?\nJust to be clear here: Navarro has a doctorate in economics. Fauci is a medical doctor. It's not the same thing. At all. And for Navarro to couch it as \"doctors disagree about things all the time\" is, at best disingenuous.\nNow, all of that is not great. A trade adviser feeling as though he stands on equal ground with one of the world's foremost medical experts in terms of how to treat patients suffering with coronavirus is concerning enough. Even behind closed doors.\nBut here's what should really worry you: Trump appears to have sided with Navarro!\nIn the Sunday evening coronavirus task force press briefing, Trump said this about the use of hydroxychloroquine:\n\"Now we have purchased and we have stockpiled 29 million pills of the hydroxychloroquine. 29 million. A lot of drugstores have them by prescription and also -- and they're not expensive. Also we are sending them to various labs, our military, we're sending them to the hospitals, we're sending them all over.\n\"I just think it's something -- you know, the expression, I've used it for certain reasons: 'What do you have to lose?' What do you have to lose? And a lot of people are saying that when -- and are taking it, if you're a doctor, a nurse, a first responders, a medical person going into hospitals, they say taking it before the fact is good. But what do you have to lose? They say take it. I'm not looking at it one way or the other. But we want to get out at this.\"\nOn the question of, \"What you have to lose?\" Dr. Patrice Harris, the president of The American Medical Association, told CNN: \"You could lose your life. It's unproven. ... At this point, we just don't have the data.\"\nLater in the press conference, Trump was asked about concerns about the drug among the medical community. \"I want them to try it, and it may work and it may not work,\" he responded. \"But if it doesn't work, it's nothing lost by doing it. Nothing. ... Because we know long term what I want, I want to save lives. And I don't want to be in a lab for the next year and a half as people are dying all over the place.\"\nAt the close of the briefing, CNN's Jeremy Diamond tried to ask Fauci about hydroxychloroquine. Trump stepped in and said \"Can I have a chance to answer that question?\" He then insisted that Fauci had already \"answered that question 15 times.\" (He had not.)\nAnd THAT is what should really worry you: A President who sides with a guy with an economics Ph.D. over a medical doctor with a long background in infectious disease solely because the former is in line with what Trump himself thinks.", "url": "https://www.cnn.com/2020/04/06/politics/anthony-fauci-peter-navarro-coronavirus-donald-trump/index.html"}