{"authors": ["Kathy Gannon"], "date_download": "2020-05-04 20:19:46", "date_modify": "2020-05-04 20:19:46", "date_publish": "2020-04-14 18:15:47", "description": "ISLAMABAD (AP) — Washington peace envoy Zalmay Khalilzad met with Pakistan’s military chief Tuesday, a day after discussing the lagging U.S.-Taliban peace deal in Afghanistan with the chief...", "filename": "_8fe1fd112fbda74d181976cd00d6bee8_1588623586.html", "image_url": "https://storage.googleapis.com/afs-prod/media/762f96a0fa894a75852585109c180b80/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8fe1fd112fbda74d181976cd00d6bee8_1588623586.html", "title": "Taliban say US bombing insurgents at home contrary to deal", "title_page": "Taliban say US bombing insurgents at home contrary to deal", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Afghan National Army soldiers stands guard at a checkpoint near the Bagram base in northern Kabul, Afghanistan, Wednesday, April 8, 2020. An Afghan official said Wednesday that the country has released 100 Taliban prisoners from Bagram, claiming they are part of 5,000 detainees who are to be freed under a deal between insurgents and U.S. But the Taliban says they have yet to verify those released were on the list they had handed over to Washington during negotiations. (AP Photo/Rahmat Gul)\nAfghan National Army soldiers stands guard at a checkpoint near the Bagram base in northern Kabul, Afghanistan, Wednesday, April 8, 2020. An Afghan official said Wednesday that the country has released 100 Taliban prisoners from Bagram, claiming they are part of 5,000 detainees who are to be freed under a deal between insurgents and U.S. But the Taliban says they have yet to verify those released were on the list they had handed over to Washington during negotiations. (AP Photo/Rahmat Gul)\nISLAMABAD (AP) — Washington peace envoy Zalmay Khalilzad met with Pakistan’s military chief Tuesday, a day after discussing the lagging U.S.-Taliban peace deal in Afghanistan with the chief negotiator for the insurgent movement.\nThe meetings included Gen. Scott Miller, head of U.S. forces in Afghanistan. Statements from the U.S. Embassy in Islamabad and the U.S. military in Kabul said Washington was engaged in “ongoing efforts” to find a sustainable peace after decades of relentless war but the U.S. officials released no details.\nTaliban political spokesman Suhail Shaheen said the insurgent group’s chief negotiator, Mullah Abdul Ghani Baradar, used Monday’s meeting at the Taliban’s political office in Qatar to protest attacks against Taliban fighters in their homes, contrary to provisions of the Feb. 29 agreement.\n“Our men have been targeted in their residential areas while there is no room for such attacks in the agreement, either by the U.S. or their internal (Afghan) supporters,” he said, a reference to Afghan National Security Forces.\nThe U.S. military has refused to address the Taliban’s specific complaint but has said that it is abiding by the agreement and will continue to come to the aid of the Afghan military.\nAt the meeting with Pakistan’s Chief of Army Staff Gen. Qamar Javed Bajwa, Pakistan’s military leaders reaffirmed their support for U.S. efforts and renewed their “commitment to act to advance a political settlement to the conflict,” according to a statement released by the U.S. Embassy in the Pakistani capital.\nAt the heart of most of the talks, say Taliban and U.S. officials, is the demand for a reduction of violence. The Taliban have not been attacking U.S. and NATO troops since the agreement was signed, instead attacking Afghan forces in outlying areas. Washington wants a reduction to those attacks.\nShaheen said the Taliban are ready to negotiate a countrywide cease-fire but only during intra-Afghan negotiations, the next critical step of the deal. However, getting to intra-Afghan negotiations, which Washington had hoped would begin weeks earlier, has mostly been held up by political turmoil in Kabul as dueling presidents fight over who is the real winner in last year’s presidential elections and the government squabbles over the deal’s call for the release of 5,000 Taliban prisoners and 1,000 government prisoners.\n“The Kabul regime is creating hurdles in the way of intra-Afghan negotiation by not releasing our prisoners as it is a prerequisite for commencement of intra Afghan negotiations,” Shaheen told The AP.\nThe government has freed 300 men they say are Taliban but who have yet to be verified by the insurgents and the Taliban have freed 20 government employees.\nThe call for a reduction in violence has taken on greater importance as the coronavirus pandemic threatens to overwhelm Afghanistan’s beleaguered and war-ravaged health care system.\nThe U.N. secretary-general has asked for a cease-fire to conflicts around the world to focus resources on fighting the pandemic. Afghanistan has more than 700 confirmed cases and 23 deaths, but testing is limited and more than 200,000 Afghans have returned home in recent months from neighboring Iran, where the virus has infected nearly 75,000 and killed more than 4,600.", "url": "https://apnews.com/8fe1fd112fbda74d181976cd00d6bee8"}