{"authors": ["Shannon Liao", "Cnn Business"], "date_download": "2020-05-04 16:18:58", "date_modify": "2020-05-04 16:18:58", "date_publish": "2020-04-04 16:00:42", "description": "Walmart on Saturday began limiting the number of customers who can be in its stores at once because of the coronavirus pandemic.", "filename": "2020_04_04_business_walmart-limits-customers-covid-19_index_1588609138.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404095437-01-walmart-coronavirus-new-york-0403-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_business_walmart-limits-customers-covid-19_index_1588609138.html", "title": "Walmart is limiting how many customers who can shop at once in stores due to Covid-19", "title_page": "Walmart is limiting how many customers who can shop at once in stores due to Covid-19 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Walmart on Saturday began limiting the number of customers who can be in its stores at once because of the coronavirus pandemic.\n\"We have been concerned to still see some behaviors in our stores that put undue risk on our people,\" Walmart's executive vice president and chief operating officer Dacona Smith wrote in a Friday blog post . \"We want to encourage customers to bring the fewest number of people per family necessary to shop.\"\nNo more than five customers are allowed per 1,000 square feet in the store at any given time, the retail giant announced in the blog post. Once a store reaches that capacity, a customer can't enter until another exits.\nWalmart is using floor markers, asking people to move in one direction in each aisle and avoid close contact with others. Customers will be directed to use a different door to exit than the one they entered.\n\"We know that in ordinary times a store is a gathering place for members of a community to connect and socialize. We look forward to the time when that is again the case,\" Smith wrote.\nRead More", "url": "https://www.cnn.com/2020/04/04/business/walmart-limits-customers-covid-19/index.html"}