{"authors": ["Brian Slodysko", "Bill Barrow"], "date_download": "2020-05-04 20:26:05", "date_modify": "2020-05-04 20:26:05", "date_publish": "2020-04-21 00:04:03", "description": "WASHINGTON (AP) — Well-to-do donors gathered last August at the sprawling Charlotte, North Carolina, home of Erskine Bowles, a former chief of staff to President Bill Clinton, where they nibbled...", "filename": "_abed7abb8704ccd71676fd4abff903da_1588623965.html", "image_url": "https://storage.googleapis.com/afs-prod/media/70d5e5c5cdd347329a03160515f7572e/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_abed7abb8704ccd71676fd4abff903da_1588623965.html", "title": "Pandemic squeezes finances of Democratic grassroots donors", "title_page": "Pandemic squeezes finances of Democratic grassroots donors", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Feb. 25, 2020, file photo Democratic presidential candidate former Vice President Joe Biden, speaks during a Democratic presidential primary debate at the Gaillard Center in Charleston, S.C., co-hosted by CBS News and the Congressional Black Caucus Institute. The Congressional Black Caucus PAC is endorsing Joe Biden’s presidential bid, further cementing his support among the nation’s influential black political leadership. Black voters have long anchored the former vice president’s White House bid with decisive wins in South Carolina and on Super Tuesday. The chairman of the Congressional Black Caucus political action committee is New York congressman Gregory Meeks, who tells The Associated Press there’s “no question” Biden is the right person to lead the country. (AP Photo/Patrick Semansky, File)\nFILE - In this Feb. 25, 2020, file photo Democratic presidential candidate former Vice President Joe Biden, speaks during a Democratic presidential primary debate at the Gaillard Center in Charleston, S.C., co-hosted by CBS News and the Congressional Black Caucus Institute. The Congressional Black Caucus PAC is endorsing Joe Biden’s presidential bid, further cementing his support among the nation’s influential black political leadership. Black voters have long anchored the former vice president’s White House bid with decisive wins in South Carolina and on Super Tuesday. The chairman of the Congressional Black Caucus political action committee is New York congressman Gregory Meeks, who tells The Associated Press there’s “no question” Biden is the right person to lead the country. (AP Photo/Patrick Semansky, File)\nWASHINGTON (AP) — Well-to-do donors gathered last August at the sprawling Charlotte, North Carolina, home of Erskine Bowles, a former chief of staff to President Bill Clinton, where they nibbled finger food, sipped wine and listened to Joe Biden.\nLast week they again joined Bowles and his wife, Crandall. But this time it was for a far less intimate affair: a fundraiser held by video conference that Biden, the presumptive Democratic presidential nominee , joined from the makeshift studio in the basement of his Delaware home .\nThe coronavirus shutdown has forced Democratic donors to forgo the opulent fundraisers that allow them to rub shoulders with powerful elected leaders and candidates.\nDuring the Democratic primary , progressive candidates and activists condemned big-dollar affairs. But they have become a practical necessity for Biden that is sure to rankle progressives, who point to an army of grassroots donors contributing small amounts online as the antidote to big money in politics.\nAs the coronavirus punishes the economy and swamps the health care system, the poor and middle class are among the hardest hit, all but ensuring that Democrats’ wealthiest donors will have to bear the cost of the party’s effort against President Donald Trump in November.\nBowles said that the pandemic has delivered “economic hits ... to everybody, regardless of their station” but that the Democratic donor class remains engaged.\n“When I say raising this money was easy, it really was,” he said of the virtual event.\nSome deep-pocketed Democrats embrace the turnabout.\n“There’s nobody more patriotic than Democratic donors who write large checks, because they are giving against their own self-interest,” said Kirk Wagar, a Democratic donor, former ambassador and fundraiser who was Florida finance chair for Barack Obama’s campaign.\nThe role money will play in the presidential campaign is complicated and may not be the arms race that it has been in previous contests. But just how much of it will be needed in an abbreviated campaign that has been ground to a halt by the virus is not clear, especially in a contest between a president who dominates the news media landscape and a former vice president with near universal name recognition.\nWealthy donors were always going to play a major role financing the general election. But Biden did a poor job raising money during the primary and was running perilously low on funds before his big victory in the South Carolina primary upended the race.\nHe’s now up against Trump and a Republican National Committee that have already stockpiled $240 million as of the end of March. Biden reported Monday that he took in $46.6 million in March, though less than half of it came from small-dollar donors who gave $200 or less. And according to figures previously released by the campaign, most of that, $33 million, was raised in the first half of the month before financial markets plummeted and much of the country went into lock down.\nHe’s since enjoyed a surge in online fundraising, with the campaign saying it raised more than $5 million in the days surrounding endorsements from former President Barack Obama and progressive former rivals Bernie Sanders and Elizabeth Warren . But Biden’s financial concerns are enough that he’s yet to announce any significant staff hires across many key battleground states.\nAnd the campaign hasn’t trumpeted months’ worth of television or digital ad buys ahead of the fall campaign.\n“Trump is raising hundreds of millions of dollars, and we’re definitely going to need the help of big-dollar donors to beat him — it’s just the reality,” said Marc Stanley, a Democratic donor and trial attorney from Dallas.\nWhile Trump’s handling of the virus appears to have lowered his approval rating, some Democrats are worried that his ubiquitous presence leading daily press conferences is overshadowing Biden. That increases the need for advertising that offers counterprogramming to the nightly story line emerging from the White House.\n“Trump is in people’s living rooms for more than an hour every day. Biden is less visible, and there’s a lot of deep concern about where we end up,” said David Brock, co-founder of the Democratic group American Bridge, which launched a $15 million ad campaign last week targeting Trump’s handling of the virus.\n“The question mark is the small-dollar donors,” Brock continued. “It stands to reason that that pool will shrink as you have rising unemployment, their hours cut and young people going into the job market facing lower prospects.”\nNot everyone is convinced that the fallout from the pandemic will depress fundraising, both low dollar and high.\n“Look, I would love to tell you that large donors are going to come and save the day,” said Steve Westly, a Silicon Valley venture capitalist who is raising money for Biden’s campaign.\n“I think you are going to see a lot of people coming behind Joe Biden in this race. The reason is they are pissed off. They are pissed off at the president’s handling of the coronavirus. Not only might they be losing their loved ones, or getting sick themselves, but the economy is in turmoil.”\nOne remaining question is the extent to which former New York Mayor Mike Bloomberg invests his $60 billion fortune in the race. Bloomberg, who spent $1 billion on his own failed attempt at the Democratic nomination , previously committed to running an outside group that would take on Trump. He shelved those plans but donated $18 million in remaining campaign funds to the Democratic National Committee.\nWestly said the question for Bloomberg, 77, is how he wants to be remembered.\n“I think everybody of that stature cares about his legacy,” said Westly. “Does he want the narrative to be ’I unsuccessfully spent $1 billion on my own campaign’? Or would he rather have it be ‘I spent $2 billion and stopped Donald Trump from winning’?”\n___\nBarrow reported from Atlanta.\n___\nCatch up on the 2020 election campaign with AP experts on our weekly politics podcast, “Ground Game.”", "url": "https://apnews.com/abed7abb8704ccd71676fd4abff903da"}