{"authors": ["Gary D. Robertson"], "date_download": "2020-05-04 20:31:41", "date_modify": "2020-05-04 20:31:41", "date_publish": "2020-04-15 22:10:13", "description": "RALEIGH, N.C. (AP) — North Carolina will need more widespread COVID-19 testing, extensive efforts to track down people in contact with the sick and slowed case and hospital rates before movement...", "filename": "_27d09f305ffbed1c95a3c0ac88cc079a_1588624301.html", "image_url": "https://storage.googleapis.com/afs-prod/media/a33c7110793c4dc39b7bd15043c9622b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_27d09f305ffbed1c95a3c0ac88cc079a_1588624301.html", "title": "Cooper sets route to ease restrictions, warns of new normal", "title_page": "Cooper sets route to ease restrictions, warns of new normal", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "RALEIGH, N.C. (AP) — North Carolina will need more widespread COVID-19 testing, extensive efforts to track down people in contact with the sick and slowed case and hospital rates before movement and commerce restrictions can ease, Gov. Roy Cooper said on Wednesday.\nCooper, who must decide soon what to do with a stay-at-home order that expires April 29, also warned that any improvements for businesses and the public will be incremental, and could be turned on and off like a dimmer switch, depending on the data.\n“I know the changes that we’ve all made in our lives seem to have happened very quickly,” Cooper said at a media briefing, but “undoing those changes won’t happen as fast. To protect our health and long-term economic prosperity, we have to act with care, rather than haste.”\nThe governor said any “new normal” could include partially-full restaurants and concerts and sporting events without audiences in the name of social distancing and safety. And residents most vulnerable to the new coronavirus still must be protected until a vaccine or effective treatment is available.\nCooper and Department of Health and Human Services Secretary Mandy Cohen didn’t give many specifics on what would equate to meeting testing, tracing and statistical goals. But Cohen said there were good developments on testing access, and the case count shows the stay-at-home order is working.\nState DHHS data shows there were over 5,100 positive COVID-19 cases as of Wednesday morning, which was only a 1% increase compared to Tuesday. The number of COVID-19-related deaths grew by nine to 117, while current hospitalizations increased slightly to about 430.\nCohen said efforts were underway to expand the workforce to join local health workers who already track down people in contact with those testing positive in order to control the virus’ spread. For most people, the coronavirus causes mild or moderate symptoms, and the vast majority survive. But for others, especially older adults and people with existing health problems, it can cause pneumonia or death.\nCooper released his parameters on reopening the day after dozens of protesters unhappy with the stay-at-home order stood together near their cars in a parking lot within sight of the Executive Mansion. One person was arrested who refused to leave after Raleigh police told the crowd repeatedly that they were violating Cooper’s executive order requiring social distancing.\nThe order and an earlier ban on dine-in service at restaurants and bars, like those in other states, have contributed to a massive economic setback. Nearly 600,000 initial unemployment benefit claims have been filed with the state in the last four weeks.\nSeveral Republican lawmakers, in particular Senate leader Phil Berger, have urged more widespread testing to better determine the extent of the virus within the population.\nThe General Assembly’s decision to spend $100,000 to help jump-start an effort by Wake Forest University to collect data on people who have developed immunity to the virus is part of that effort. The money will be used to purchase and send 1,000 at-home antibody kits to a sample of state residents.\n“Without hard data to back up the opinions that are being expressed, people are increasingly going to be reluctant to comply with government-mandated shutdowns,” Berger told reporters on Wednesday. The data also may show that the spread of COVID-19 is not as great as leaders have feared, he said.\nCohen said she wasn’t aware of the Wake Forest activity until it was announced earlier this week. She emphasized collaboration with the state and researchers to share data on various components of the virus for maximum benefit to the public.\nDeaths continue to accumulate in North Carolina nursing homes. Franklin County health officials said Wednesday that three more residents at the Louisburg Nursing Center have died, bringing the total of resident deaths to five. Six residents at the Springbrook Rehabilitation & Nursing Center in Johnston County have also died, officials said.\nFour prisoners who tested positive for COVID-19 at the medium-security federal correctional institution in Butner have died, the U.S. Bureau of Prisons said. Forty-six inmates and 27 staff members there have tested positive there so far.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/27d09f305ffbed1c95a3c0ac88cc079a"}