{"authors": ["Opinion Jack Gray"], "date_download": "2020-05-04 16:23:40", "date_modify": "2020-05-04 16:23:40", "date_publish": "2020-04-06 18:41:22", "description": "Jack Gray writes about the conversations he's had with his grandparents and says that with everything that's going on with Covid-19, if you're fortunate enough to have any of your grandparents still alive, give them a call.", "filename": "2020_04_06_opinions_call-your-grandparents-coronavirus-gray_index_1588609420.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406125928-elderly-man-smartphone-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_opinions_call-your-grandparents-coronavirus-gray_index_1588609420.html", "title": "Call your grandparents", "title_page": "Call your grandparents (Opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Jack Gray is supervising producer for CNN's \"Anderson Cooper 360\" and author of \"Pigeon in a Crosswalk: Tales of Anxiety and Accidental Glamour.\" The opinions expressed in this commentary are his own. View more opinion at CNN.\n(CNN) On his three-season porch in suburban Boston, my 90-year-old grandfather takes a break from watching the news. He sits in a worn green-cushioned chair, smoking his pipe and rereading a Lee Child novel. Jack Reacher, he reminds me over the phone, is big and tall; Tom Cruise was all wrong for the movies.\nIn the living room, my grandmother, also 90, plays solitaire in between chapters of Agatha Christie. When Bumpy -- no one can remember why we call him that -- is done with his pipe, he'll go inside and interrupt Grammie's card game. She'll tell him he reeks of smoke and he'll pretend not to hear, a variation of a conversation they've been having for 68 years.\nI'm 39 and all four of my grandparents are still living. As rare as that is, rarer still is that I'm equally close to each of them. Not one is a distant specter or mere name on a birthday card. Between them, they taught me how to drive, fish, dispute a restaurant check and drink wine during the day. They're four of my favorite people on Earth.\nNow, the coronavirus is here and 90 suddenly seems even older than it did when I last saw my family at Christmas. Phone calls with my grandparents have shifted from lobster pie vs. lobster stew to cloth masks vs. latex gloves. My phone rings not to see if I can order my grandmother a book on Amazon, but rather if I know when Dr. Sanjay Gupta will next be on CNN.\nThey are, of course, among the lucky ones in their age group of ultra-senior citizens. They live in their own homes with family nearby. Business closures interfere not with their livelihoods but simply their lunch schedules. Still, I worry. Germs on groceries or a rogue visitor are improbable, but not impossible. The whole thing feels like dominoes on a rickety table.\nRead More", "url": "https://www.cnn.com/2020/04/06/opinions/call-your-grandparents-coronavirus-gray/index.html"}