{"authors": ["Devan Cole"], "date_download": "2020-05-04 16:21:54", "date_modify": "2020-05-04 16:21:54", "date_publish": "2020-04-05 17:27:59", "description": "The Navy captain removed from command of the USS Theodore Roosevelt last week after warning that action was needed to save the lives of his crew from a coronavirus outbreak has tested positive for the virus, according to The New York Times on Sunday.", "filename": "2020_04_05_politics_brett-crozier-coronavirus-navy_index_1588609314.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401090526-02-uss-theodore-roosevelt-guam-grab-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_brett-crozier-coronavirus-navy_index_1588609314.html", "title": "New York Times: Ex-Navy commander who sounded alarm over coronavirus outbreak tests positive for virus", "title_page": "Brett Crozier: Ex-Navy commander who sounded alarm over coronavirus outbreak on ship tests positive for virus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The Navy captain removed from command of the USS Theodore Roosevelt last week after warning that action was needed to save the lives of his crew from a coronavirus outbreak has tested positive for the virus, according to The New York Times on Sunday.\nCapt. Brett Crozier began exhibiting symptoms before he was removed from the warship on Thursday, the Times reported, citing two Naval Academy classmates of Crozier's who are close to him and his family.\nCNN has reached out to the Navy for comment. A Navy spokesman declined to comment to the Times on Crozier's status.\nCrozier was relieved of his command last week by acting US Navy Secretary Thomas Modly, for what Modly called \"poor judgment,\" going outside the chain of command and too widely disseminating a memo over an unsecured system.\nIn a memo sent earlier last week, Crozier pleaded with Navy leaders that \"decisive action is required\" to remove a majority of the ship's personnel and isolate them for two weeks. The letter was published in the San Francisco Chronicle on Tuesday.\nRead More", "url": "https://www.cnn.com/2020/04/05/politics/brett-crozier-coronavirus-navy/index.html"}