{"authors": ["Trends Reporter"], "date_download": "2020-05-04 20:14:25", "date_modify": "2020-05-04 20:14:25", "date_publish": "2020-04-29 05:56:25", "description": "The creators of \"Orange Is The New Black\" plan to put together \"Social Distance\" in isolation.", "filename": "entry_social-distance-netflix_n_5ea8fc9cc5b6fb98a2b4c81b_1588623265.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8ff863000000912155184.jpeg?cache=gxqo2zrkbv&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_social-distance-netflix_n_5ea8fc9cc5b6fb98a2b4c81b_1588623265.html", "title": "New Netflix Show About Life In Quarantine Will Be Created Remotely", "title_page": "New Netflix Show About Life In Quarantine Will Be Created Remotely | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "In an effort to keep everyone safe and healthy, the production of movies and TV shows has been suspended during the coronavirus pandemic. Now, Netflix is putting some filmmakers back to work to capture this bizarre new reality ― while, of course, keeping their social distance.\n“Social Distance” will be a scripted anthology series about the experience of living in isolation.\n“Orange Is The New Black” creator Jenji Kohan and her production team are bringing the new show to the streaming service, Netflix announced Tuesday. The actors will film themselves from home, Diego Valasco will direct the series remotely and showrunner Hilary Weisman Graham will run production from her living room.\nThe creative team behind Orange Is the New Black have created Social Distance, a new anthology series about the experience of living in social distance. The series will be scripted and shot with crews working remotely and talent will film themselves.\nA note from the EP’s pic.twitter.com/w5LYPEGtRa — See What's Next (@seewhatsnext) April 28, 2020\nThe “OITNB” team ― Kohan, Tara Herrman, Blake McCormick and Graham ― will all serve as executive producers for the series.\n“Our job as storytellers is to reflect reality, and in this new, bizarre, bewildering reality we are all experiencing, we feel passionate about finding connection as we all remain at a distance,” the EPs said in a joint statement.\nThey also said they were inspired to create the series that reflects the “unique, personal, deeply human stories that illustrate how we are living apart, together.”\n“The experience of social distancing is currently universal, but no individual story is the same,” the team stated. “Through a broad spectrum of tales and moments, some seismic and some mundane, we hope to capture a moment in time.”\nThe series is yet another adaptation in the pandemic-era entertainment industry. Many of the late-night talk shows have resumed production remotely, and other programs, such as “Saturday Night Live” and “American Idol,” are moving forward with shows that participants film from home.", "url": "https://www.huffpost.com/entry/social-distance-netflix_n_5ea8fc9cc5b6fb98a2b4c81b"}