{"authors": [], "date_download": "2020-05-04 20:26:00", "date_modify": "2020-05-04 20:26:00", "date_publish": "2020-04-07 20:18:37", "description": "NEW YORK (AP) — Stocks that moved heavily or traded substantially on Tuesday: Exxon Mobil Corp., up 77 cents to $41.24 The energy giant its slashing its spending plans due to weak...", "filename": "_c17743cf9300702f58a9819cc4bd38ec_1588623960.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c17743cf9300702f58a9819cc4bd38ec_1588623960.html", "title": "Macy's, Kraft Heinz rise; Alcon, NXP Semiconductor fall", "title_page": "Macy's, Kraft Heinz rise; Alcon, NXP Semiconductor fall", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NEW YORK (AP) — Stocks that moved heavily or traded substantially on Tuesday:\nExxon Mobil Corp., up 77 cents to $41.24\nThe energy giant its slashing its spending plans due to weak demand and a market flooded with an oversupply of oil.\nKraft Heinz Co., up 70 cents to $26.61\nThe food maker said it’s seeing “very strong consumer demand” for its products.\nAlcon Inc., down 82 cents to $51.50\nThe maker of eye care products withrew its financial forecasts for this year and will delay a decision on paying a dividend until next year.\nV.F. Corp., up $1.67 to $56.34\nThe maker of Vans and North Face products suspended its stock buyback program but will keep paying dividends.\nLuminex Corp., up $1.41 to $28.49\nThe maker of testing systems for biotechnology companies reported first-quarter revenue that beat its own forecasts.\nMacy’s Inc., up 28 cents to $5.91\nThe retailer said its chief financial officer would leave at the end of May.\nNXP Semiconductors N.V., down $2.66 to $84.28\nThe chipmaker said the impact from COVID-19 on its first-quarter results would be worse than it had forecast on March 2.\nContinental Resources Inc., up 96 cents to $10.45\nThe energy company said it would cut production in response to dropping demand and suspend its dividend.", "url": "https://apnews.com/c17743cf9300702f58a9819cc4bd38ec"}