{"authors": ["Jim Salter"], "date_download": "2020-05-04 20:18:42", "date_modify": "2020-05-04 20:18:42", "date_publish": "2020-04-15 15:20:15", "description": "O'FALLON, Mo. (AP) — Missouri Gov. Mike Parson said Wednesday that he's close to deciding when to reopen the state economy, which has been largely frozen to slow the spread of the...", "filename": "_b49415533ebce0771066972c7b34d48c_1588623522.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9cfabcf65f7d462daf18c4f079044436/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b49415533ebce0771066972c7b34d48c_1588623522.html", "title": "Governor to decide soon on reopening Missouri businesses", "title_page": "Governor to decide soon on reopening Missouri businesses", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "People wait for a bus in a mostly deserted downtown Kansas City, Mo. Tuesday, April 14, 2020 as stay-at-home orders continue in much of the country in an effort to stem the spread of the new coronavirus. (AP Photo/Charlie Riedel)\nPeople wait for a bus in a mostly deserted downtown Kansas City, Mo. Tuesday, April 14, 2020 as stay-at-home orders continue in much of the country in an effort to stem the spread of the new coronavirus. (AP Photo/Charlie Riedel)\nO’FALLON, Mo. (AP) — Missouri Gov. Mike Parson said Wednesday that he’s close to deciding when to reopen the state economy, which has been largely frozen to slow the spread of the coronavirus.\nThe Republican governor was among the last to impose a statewide stay-at-home order. It went into effect April 6 and runs through April 24. Parson said during his news conference Wednesday that his decision on the future of the order is imminent.\n“I think we’re all going to move forward with this as soon as we can and we’re preparing for that day, to be able to move the economy forward,” Parson said. “We’ll be able to say more on that in the near future.”\nEven if the statewide order is allowed to expire, stay-at-home orders could remain in place in and around the state’s two biggest cities, where leaders say regional decisions could come this week.\nKansas City, St. Louis and their suburbs invoked stay-at-home orders several days before Parson’s statewide order. St. Louis County Executive Sam Page said St. Louis regional leaders and medical experts have been in talks.\n“I would expect from those discussions that the stay-at-home order will be extended into May, but I’m not prepared to give you a specific date,” said Page, a Democrat.\nSt. Louis County, the state’s most populous county with 1 million residents, has been hit harder by the coronavirus than anyplace else in Missouri. The county has reported 1,811 confirmed cases of COVID-19, including 58 deaths from the disease caused by the virus.\nKansas City’s health director, Dr. Rex Archer, told KCUR that public health and elected officials will gather this week to recommend a plan for when to allow nonessential businesses to reopen.\nArcher and Page agree that access to more testing is vital before restrictions can be eased. Archer also cited a need to ensure that there is adequate personal protective equipment for health care providers.\nBut the top official in one county near St. Louis expressed a desire to get businesses up and running again. Franklin County Presiding Commissioner Tim Brinker said his county has a re-entry plan that calls for restaurants and personal care businesses to open as soon as April 25 if the statewide order is lifted.\nMost infected people develop mild or moderate coronavirus symptoms that clear up within three weeks, such as fever and cough. But older adults and people with existing health problems are particularly susceptible to more severe illness, including pneumonia.\nMissouri’s death toll from COVID-19, the disease caused by the coronavirus, went up by 16 on Wednesday, for a total of 153, according to data Wednesday from Johns Hopkins University’s Center for Systems Science and Engineering, which has been tracking cases worldwide. Johns Hopkins also cited 4,784 cases in Missouri, which was 253 more than the 4,531 cases reported Tuesday.\nState officials announced that Missouri would be getting more than $360 million in federal stimulus money.\nParson said Missouri will receive $152.4 million for 75 airports. Lambert Airport in St. Louis will get $60 million of that, and Kansas City International will receive $43.3 million. Airports in the Springfield-Branson area, Cape Girardeau, Columbia, and Joplin also are receiving more than $1 million each.\nThe state’s education commissioner, Margie Vandeven, said Missouri will receive $208 million in federal funds to help grades K-12. The money will be used to “address the digital divide” and challenges caused by school closures.\n___\nCheck out more of the AP’s coronavirus coverage at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/b49415533ebce0771066972c7b34d48c"}