{"authors": ["Doug Feinberg"], "date_download": "2020-05-04 20:17:44", "date_modify": "2020-05-04 20:17:44", "date_publish": "2020-04-08 06:30:03", "description": "NEW YORK (AP) — Arella Guirantes is headed back to Rutgers instead of choosing to enter the WNBA draft. She was one of about a half-dozen high profile juniors who could have foregone their...", "filename": "_cb62644174414d258bdd1ee4d28a2716_1588623464.html", "image_url": "https://storage.googleapis.com/afs-prod/media/73edadba5d1044d49bb1cfe57f070157/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cb62644174414d258bdd1ee4d28a2716_1588623464.html", "title": "Guirantes headed back to Rutgers instead of WNBA draft", "title_page": "Guirantes headed back to Rutgers instead of WNBA draft", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Friday, Dec. 28, 2018, file photo, Rutgers guard Arella Guirantes handles the ball against Northwestern during an NCAA college basketball game, in Piscataway, N.J. Guirantes is headed back to Rutgers instead of choosing to enter the WNBA draft, which is scheduled to be held April 17, 2020. (AP Photo/Adam Hunger, File)\nFILE - In this Friday, Dec. 28, 2018, file photo, Rutgers guard Arella Guirantes handles the ball against Northwestern during an NCAA college basketball game, in Piscataway, N.J. Guirantes is headed back to Rutgers instead of choosing to enter the WNBA draft, which is scheduled to be held April 17, 2020. (AP Photo/Adam Hunger, File)\nNEW YORK (AP) — Arella Guirantes is headed back to Rutgers instead of choosing to enter the WNBA draft.\nShe was one of about a half-dozen high profile juniors who could have foregone their last season of eligibility to enter the WNBA draft. Oregon’s Satou Sabally, Texas A&M’s Chennedy Carter and UConn’s Megan Walker have submitted their paperwork to enter the draft. Arizona guard Aari McDonald chose to return to school for her senior year.\nWhile its been common place for years for underclassmen to enter the NBA draft early, the WNBA has seen more eligible underclassmen players do it over the past few seasons, including last season’s No. 1 pick, Jackie Young.\nAll were projected to be high picks in the upcoming WNBA draft that’s set for April 17 and will be done virtually because of the coronavirus pandemic. The league postponed the start of its season on Friday for an undetermined amount of time.\nThe NCAA said it is monitoring implications if the WNBA doesn’t end up having a season and the players decided to go back to school. In the past, once a player is drafted, they lost their remaining eligibility.\nGuirantes doesn’t have to worry about what the NCAA decides. She is going back to play for Hall of Fame coach C. Vivian Stringer. The redshirt junior guard averaged 20.6 points and 6.0 rebounds this season.\n“I have my goals written down, and I didn’t write them down for nothing,” Guirantes said. “This morning I read my bible and started reflecting. I was feeling overwhelmed and feeling anxious to get it over with. This verse stuck out to me and reminded me the process is part of the journey.\n“I was going to make a decision to get it over with, but this decision is what I’m supposed to be going through. What I needed to do was be faithful toward my goals. I want to be the Big Ten Player of the Year, a first team All-American and win a championship with Rutgers basketball. This is what I’m supposed to go through to be prepared for those moment.”\nWhile Guirantes is returning to school, highly touted freshman Maori Davenport has entered the transfer portal according to a person familiar with the player’s decision. The person spoke to the AP on condition of anonymity because Davenport had not publicly announced her move.\n___\nFollow Doug Feinberg on Twitter at http://www.twitter.com/dougfeinberg\n.", "url": "https://apnews.com/cb62644174414d258bdd1ee4d28a2716"}