{"authors": ["Cnn Staff"], "date_download": "2020-05-04 16:52:54", "date_modify": "2020-05-04 16:52:54", "date_publish": "2020-04-08 15:43:20", "description": "In a time when we're all anxious about our health and safety, some people are preying on that fear. CNN's Chief Medical Correspondent Dr. Sanjay Gupta examines coronavirus \"miracle cures\" and other scams, offering tips on how best to protect yourself.", "filename": "2020_04_08_health_sanjay-gupta-podcast-april-8-wellness_index_1588611174.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402114757-gupta-coronavirus-podcast-top-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_health_sanjay-gupta-podcast-april-8-wellness_index_1588611174.html", "title": "Profiting from a pandemic: Dr. Gupta's podcast 4/8", "title_page": "Profiting from a pandemic: Dr. Gupta's podcast 4/8 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) In a time when we're all anxious about our health and safety, some people are preying on that fear. CNN's Chief Medical Correspondent Dr. Sanjay Gupta talks you through coronavirus \"miracle cures\" and other scams, offering tips on how best to protect yourself.\nRobocall speaker: Thank you for calling Coronavirus Hotline.\nRobocall speaker: If you are diabetic and using insulin, we can qualify you to get a free diabetic monitor and a complimentary testing kit for coronavirus.\nRobocall speaker: The free at-home test will be just for you or for you and your spouse.\nDr. Gupta: This is a time when we're all anxious about our health and safety -- but some people out there are preying on that, taking advantage.\nAs cases of coronavirus have spread across the world there's been an influx of scams, fake products, and robocalls.\nThese things are already illegal but some criminals are using this pandemic to try to make a profit. In this episode, I'll talk you through some of the biggest scams I've seen and how you can protect yourself against them.\nI'm Dr. Sanjay Gupta, CNN's Chief Medical Correspondent. And this is \"Coronavirus: Fact vs, Fiction.\"\nRobocall speaker: The Families First Coronavirus Response Act has made coronavirus testing more accessible immediately. If you want to receive a free testing kit delivered overnight to your home, press 1.\nGupta: Don't fall for this. This is an example of a robocall that the Federal Communications Commission has already deemed a scam.\nThe US Food and Drug Administration has not authorized any tests for Covid-19 that you can buy yourself or do at home. Right now, testing is being done through labs and are ordered by medical professionals.\nIf you do press 1 on this call, an operator impersonates the federal government and tries to take your credit card information. This is dangerous because not only might you lose your money, you could also get a fake test kit that could give you a false result.\nSome scammers have been impersonating the authorities we're looking to for information.\nRobocall speaker: Greetings! This is an automated message alert from the Worldwide Health Organization to inform you about the EPA's Emerging Viral Pathogen Program for the coronavirus protection.\nGupta: Aside from calls, there are also scam emails or texts claiming to be from the World Health Organization that ask for direct donations or login information.\nThe World Health Organization says that it does not and will never ask for any login information. They won't charge you money to apply for a job or go to a conference. And the only call for donations they have is for the Covid-19 Solidarity Response Fund.\nI've also gotten a lot of emails about a long post that's been going around the internet. It says it's from the Stanford Hospital Board, and one of its false claims is that people can find out whether they have Covid-19 by simply holding their breath for more than ten seconds. And if they can do that without coughing, it says they don't have the virus.\nThat is completely false. Stanford Health Care told CNN that the post is not affiliated with Stanford Medicine and that it contains inaccurate information.\nThere are also so many scams for Covid-19 treatments or cures. They include teas, essential oils or drugs.\nKeith Middlebrook: This is the cure right here going into mass production, and this is gonna save and change the world.\nGupta: That was Keith Middlebrook allegedly selling a fake cure to his 2.4 million Instagram followers. He was arrested when he delivered pills to an undercover FBI agent and charged with one count of attempted wire fraud.\nIt's the first criminal fraud case the US Justice Department is prosecuting in the coronavirus pandemic.\nRemember that, right now, there is no cure for Covid-19. There are vaccines and treatments that are in clinical trials, but none have yet been proven effective by the FDA.\nBecause there is so much that we still don't know about this virus, some of the lack of information can be filled easily with bad information.\nSo many of these products could be dangerous to you and your family. The ingredients in them could cause adverse effects and even interfere with any medications you currently take.\nNow there are also a lot of other scams out there. And those ones aren't necessarily just about your health.\nThey'll be about your mortgage.\nRobocall speaker: Hello! Due to the coronavirus, mortgage interest rates have dropped to an all-time low.\nGupta: Or your Social Security.\nRobocall speaker: This is a call from the Social Security Administration. During these difficult times of the coronavirus, we regret to inform you that we have got an order to suspend your socials immediately within 24 hours.\nGupta: The federal government is also warning people not to fall for anyone who asks for personal or financial information in order to get their $1,200 stimulus check.\nThe IRS says that you don't need to sign up or call to get your payment. In fact, if you file your taxes electronically, you'll get it through direct deposit.\nSo how can you protect yourself from these scams?\nWell, number one -- be suspicious of any product that claims to have a quick fix. As you've always heard, if it's too good to be true, it probably is.\nNumber two -- and I can't say this enough: Don't share your personal information to anyone on the phone or online. The Federal Communications Commission says that government agencies will never call you asking for money or personal information.\nIn fact, when you answer the phone and hear a recorded message instead of a live person, that's a robocall. And it's most likely a scam or even illegal. The Federal Trade Commission has a very simple recommendation: hang up.\nNumber three -- do your homework. Trust official sources like the CDC, the World Health Organization, or your local state or city health department.\nIn a pandemic, where public health is dependent on each one of us, these scams are dangerous. And even more dangerous if you pass them on.\nRemember, you're not powerless against the spread of misinformation and fraud. Being careful and arming yourself with facts are the most effective ways to make sure that you and your family don't fall for these scams.\nIf you have questions, please record them as a voice memo and email them to asksanjay@cnn.com -- we might even include them in the next podcast.\nWe'll be back tomorrow. Thanks for listening.\nYou can also head to cnn.com/coronavirus and sign up for our daily newsletter, which features the latest updates on this fast-moving story from CNN journalists around the globe.", "url": "https://www.cnn.com/2020/04/08/health/sanjay-gupta-podcast-april-8-wellness/index.html"}