{"authors": ["Andrew Selsky"], "date_download": "2020-05-04 20:09:08", "date_modify": "2020-05-04 20:09:08", "date_publish": "2020-04-09 15:35:05", "description": "SALEM, Ore. (AP) — Rural community hospitals in Oregon are seeing revenue plunge and resorting to laying off and firing employees to cope with a ban on elective surgeries while health officials...", "filename": "_1c5b7c3ae0ba10297c234e2c05731951_1588622948.html", "image_url": "https://storage.googleapis.com/afs-prod/media/15ac557a9e2946e0a6c3474ea919159e/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1c5b7c3ae0ba10297c234e2c05731951_1588622948.html", "title": "Oregon rural hospitals losing revenue, laying off workers", "title_page": "Oregon rural hospitals losing revenue, laying off workers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Health care workers wheel a gurney into Salem Hospital's emergency room on Thursday, April 9, 2020, in Salem, Ore. Hospitals in Oregon are seeing revenue plunge and resorting to laying off and firing employees to cope with a ban on elective surgeries while health officials battle the coronavirus outbreak. Some hospitals have seen revenue decline as much as 60% in a month. Projections indicate that hospitals in the state have enough capacity to handle an expected peak in virus cases later this month, but the Oregon Association of Hospitals and Health Systems says it's too early to relax the restrictions. (AP Photo/Andrew Selsky)\nHealth care workers wheel a gurney into Salem Hospital's emergency room on Thursday, April 9, 2020, in Salem, Ore. Hospitals in Oregon are seeing revenue plunge and resorting to laying off and firing employees to cope with a ban on elective surgeries while health officials battle the coronavirus outbreak. Some hospitals have seen revenue decline as much as 60% in a month. Projections indicate that hospitals in the state have enough capacity to handle an expected peak in virus cases later this month, but the Oregon Association of Hospitals and Health Systems says it's too early to relax the restrictions. (AP Photo/Andrew Selsky)\nSALEM, Ore. (AP) — Rural community hospitals in Oregon are seeing revenue plunge and resorting to laying off and firing employees to cope with a ban on elective surgeries while health officials battle the coronavirus outbreak.\nSome hospitals have seen revenue decline as much as 60% in a month, said Becky Hultberg, CEO of the Oregon Association of Hospitals and Health Systems.\n“Staffing is one of the hospital’s most significant costs. So as revenue declines, some hospitals have been forced to furlough or lay off staff,” she said.\nHospitals in the state have enough capacity to handle an expected peak in virus cases later this month, according to projections, but the association says it’s too early to relax the restrictions.\nHospitals in other states are also losing revenue. On Wednesday, 19 U.S. senators — Democrat and Republican — warned that “without intervention, COVID-19 will close hundreds of rural hospitals across the country, and tens of thousands of rural patients will lose access to their nearest emergency room.”\nThe senators, including Democrat Jeff Merkley of Oregon, told U.S. Department of Health and Human Services Secretary Alex Azar that a $100 billion federal relief fund for health care providers should prioritize rural facilities, with 20% directed to the operations.\nOregon Gov. Kate Brown on March 17 ordered that all elective and non-urgent medical procedures be cancelled or rescheduled until at least June 15 to preserve masks and other protective equipment for the state’s COVID-19 response.\nSome hospitals also lost revenue because fewer people visited emergency rooms, opting instead for virtual visits with a medical professional, fearing an ER could expose them to the virus.\nClaims for unemployment insurance reflect the scope of the job losses. In the past week, the Oregon Employment Department received 8,800 unemployment claims from workers in health care and social assistance fields, up from 396 three weeks earlier. Only accommodation-food services workers filed more claims.\nIn Oregon’s remote southwest corner along the Pacific Ocean, Curry Health Network has laid off, furloughed or cut back the hours of 192 employees. That’s more than half of the staff who work in the network’s hospital in Gold Beach and several medical clinics. Managers, meanwhile, took a 20% reduction in pay.\n“We work on a very small margin,” said Cheryl McDermott, a spokeswoman for Curry Health Network. “If we can’t do elective procedures, patient volume is dropping and it has a very strong financial impact. Additional funding is definitely needed for us and other hospitals throughout the United States.”\nSara Dickerson, a family nurse practitioner, was laid off by the network on Tuesday.\n“What is most upsetting to me was the treatment of my medical assistant, who was terminated on March 31,” Dickerson told the Curry Coastal Pilot newspaper. She said the assistant now has no medical insurance.\nThe Oregon Association of Hospitals and Health Systems has asked the governor for $200 million in new state funding to be allocated directly to hospitals to address urgent needs and keep providing services.\nThe state, however, is also expected to have less money because the newly unemployed are no longer paying income taxes.\nHultberg said her group recognizes that significant budget challenges lie ahead but added: “People count on hospitals in a crisis.”\nU.S. Rep. Greg Walden, a Republican representing a wide swath of eastern and central Oregon, has also urged that rural hospitals be prioritized for money approved by Congress.\n“Our rural community hospitals are struggling financially right now in large part because the governor shut down any elective procedures,” Walden said.\nOregon is not expected to see a big spike in COVID-19 cases as long as people keep staying home and maintain social distancing when out on urgent errands, state health officer Dean Sidelinger said.\n“We know it comes at a huge sacrifice,” Sidelinger said about the manageable number of cases. “People have lost their jobs. Our small and large businesses are suffering.”\nThe peak of the outbreak is expected around April 22 in Oregon, according to a projection by the Institute for Health Metrics and Evaluation, noting there should be more than enough hospital beds and ICU beds available.\nHultberg, however, is not advocating that restrictions on elective procedures be relaxed.\n“I would rather be having the conversation today about hospital sustainability than the conversation about mortuary capacity,” Hultberg said. “It is too early to talk about changing course.”\n___\nAndrew Selsky is on Twitter at https://twitter.com/andrewselsky", "url": "https://apnews.com/1c5b7c3ae0ba10297c234e2c05731951"}