{"authors": [], "date_download": "2020-05-04 20:04:26", "date_modify": "2020-05-04 20:04:26", "date_publish": "2020-04-07 14:42:27", "description": "INDIANAPOLIS (AP) — Indiana reported 34 new coronavirus deaths Tuesday, marking the largest single-day jump in the state's death toll, and health officials warned that the worst is yet to...", "filename": "_7772dc12496feb95585ed52cf48bfd3f_1588622666.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7772dc12496feb95585ed52cf48bfd3f_1588622666.html", "title": "Indiana, awaiting virus peak, sees biggest 1-day death toll", "title_page": "Indiana, awaiting virus peak, sees biggest 1-day death toll", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "INDIANAPOLIS (AP) — Indiana reported 34 new coronavirus deaths Tuesday, marking the largest single-day jump in the state’s death toll, and health officials warned that the worst is yet to come.\nThe Indiana State Department of Health reported an additional 568 cases, increasing the state’s total number of people infected to 5,507. It said 173 people have died.\nDr. Kristina Box, the state health commissioner, said Indiana’s coronavirus deaths have not peaked. She compared the virus deaths that have happened just since March 10 to the average number of people who die of flu in Indiana every year — about 150 over a seven-month period.\nGov. Eric Holcomb said residents must follow the statewide stay-at-home order, which will continue through at least April 20 under a two-week extension he signed Monday.\n“We just reported on 34 fatalities today,” Holcomb said during Tuesday’s briefing from the governor’s office. “Make a list of your 34 best friends, and then imagine putting a line through them. That’s how serious this is.”\nIndiana’s coronavirus deaths include 11 residents of the Bethany Pointe Health Campus in Anderson. Box said Tuesday that four deaths had occurred at another Madison County long-term care facility, along with four at a facility in Johnson County near Indianapolis and three at one in southern Indiana’s Lawrence County.\nThe health department is sending teams to nursing homes around the state in an attempt to stem further outbreaks and has sent additional testing kits to Bethany Pointe, Box said.\nBox has projected that Indiana’s peak of coronavirus illnesses could last into mid-May. The high percentage of smokers and elderly residents in Indiana means the state has a higher risk than elsewhere.\nIndiana’s latest reported deaths ranged in ages from 37 to 97 and most occurred between Saturday and Monday, she said.\n“I want to brace you to see them increase as we get closer to the peak of this disease,” Box said.\nMarion County, which includes Indianapolis, had the most new COVID-19 cases, at 193, raising its total to 2,141 — or about 39% of Indiana’s total. Northwestern Indiana’s Lake County had 52 new cases, followed by central Indiana’s Madison County, with 34 new cases, and 27 new cases in Hendricks County, just west of Indianapolis.\nIndianapolis officials announced tests have confirmed 11 more city emergency workers as ill with COVID-19 over the past four days, bringing the total to 48. Those include 20 police officers, 21 firefighters and seven emergency medical service staffers, with eight of those first responders having been cleared to return to work.", "url": "https://apnews.com/7772dc12496feb95585ed52cf48bfd3f"}