{"authors": [], "date_download": "2020-05-04 20:28:58", "date_modify": "2020-05-04 20:28:58", "date_publish": "2020-04-13 14:25:39", "description": "TAMA, Iowa (AP) — A meat processing plant in one of Iowa's coronavirus hot spots suspended production after several workers became infected, and another said Monday its earlier suspension would...", "filename": "_4c362bb58321de926d1bdbe49491cdc2_1588624138.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4c362bb58321de926d1bdbe49491cdc2_1588624138.html", "title": "Iowa beef plant suspends production after workers get virus", "title_page": "Iowa beef plant suspends production after workers get virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "TAMA, Iowa (AP) — A meat processing plant in one of Iowa’s coronavirus hot spots suspended production after several workers became infected, and another said Monday its earlier suspension would continue.\nNational Beef announced that its Iowa Premium plant in Tama will be idled until April 20, saying numerous employees had contracted COVID-19.\nTyson Foods stopped production at its Columbus Junction pork plant last week after more than two dozen workers tested positive. The company said Monday the suspension would continue this week and workers will continue to be paid during the pause.\nBoth plants are located in rural counties that have been hard hit by the pandemic in Iowa. Tama County’s cases jumped to 101 on Monday while Louisa County’s increased to 79.\nNational Beef, based in Kansas City, purchased the Tama plant last year. At the time, it had about 850 employees. The plant processes corn-fed beef raised on farms in Iowa and neighboring states, boxing products for domestic and international markets.\nThe company said that it was taking steps to stop the spread of the virus and keep employees safe. Those include daily sanitizing and disinfection, temperature screenings, increased social distancing in common areas, and voluntary use of disposable face masks.", "url": "https://apnews.com/4c362bb58321de926d1bdbe49491cdc2"}