{"authors": ["Sandee Lamotte"], "date_download": "2020-05-04 17:01:15", "date_modify": "2020-05-04 17:01:15", "date_publish": "2020-04-10 10:24:39", "description": "You may think that an occasional hit of weed during the coronavirus pandemic isn't an issue, but even that could make it more difficult for doctors to diagnose you with Covid-19. And more frequent use puts you at risk for severe complications.", "filename": "2020_04_10_health_smoking-weed-coronavirus-wellness_index_1588611675.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191224132943-cannabis-smoking---stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_health_smoking-weed-coronavirus-wellness_index_1588611675.html", "title": "Smoking weed and coronavirus: Even occasional use raises risk of Covid-19 complications", "title_page": "Smoking weed and coronavirus: Even occasional use raises risk of Covid-19 complications - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) If you're smoking weed to ease your stress during the coronavirus pandemic, experts say it's time to think twice.\nSmoking marijuana, even occasionally, can increase your risk for more severe complications from Covid-19, the disease caused by the novel coronavirus.\n\"What happens to your airways when you smoke cannabis is that it causes some degree of inflammation, very similar to bronchitis, very similar to the type of inflammation that cigarette smoking can cause,\" said pulmonologist Dr. Albert Rizzo, chief medical officer for the American Lung Association . \"Now you have some airway inflammation and you get an infection on top of it. So, yes, your chance of getting more complications is there.\"\nHey wait, you might say, I've only just started and I'm not smoking much -- so what's the harm?\nThe problem, said Dr. Mitchell Glass, a pulmonologist and spokesperson for the American Lung Association, is that the last thing you want during a pandemic is to make it more difficult for a doctor to diagnose your symptoms.\n\"Covid-19 is a pulmonary disease,\" Glass said. \"Do you really want to have a confounding variable if you need to see a doctor or a healthcare worker by saying, 'Oh, and by the way, I'm not a regular user of cannabis, but I decided to use cannabis to calm myself down.'\n\"You don't want to do anything that's going to confound the ability of healthcare workers to make a rapid, accurate assessment of what's going on with you,\" he added.\nIs that cough from smoking or coronavirus?\n\"Chronic\" marijuana smoking, defined as daily use, damages the lungs over a period of time. The end result \"looks a lot like chronic bronchitis, which is of course one of the terms we use for chronic obstructive lung disease, or COPD,\" Glass said.\nSmokers, people with COPD and other chronic lung diseases, as well as people with moderate to severe asthma are among those at high risk for severe illness from Covid-19, including the worst-case scenario of being placed on a ventilator in order to continue breathing.\nSigns of lung damage from smoking even just a few cigarettes can show up in a matter of days. While a hit or two of marijuana doesn't compare, there are some unique properties to a joint of weed that are definitely problematic for the lungs even if you're a new smoker, Glass said.\nThink of what happens to a cigarette when lit and left in an ashtray -- it will burn quickly all the way down to the filter, with nothing left but ash.\n\"It's surrounded by paper. It's completely dried out. It is made to burn at a very high temperature,\" Glass said.\nNow think of how a joint burns -- there's always some weed left, the \"roach,\" as it is called.\n\"Marijuana burns at a much, much lower temperature than a commercially made cigarette,\" said Glass. \"Because of that, the person is inhaling a certain amount of unburnt plant material.\"\nThat irritates the lungs in the same manner as ragweed, birch and oak pollen does for those allergic to them, he said.\n\"So right off the bat there are those patients who would be increasingly susceptible to having a bronchospasm or cough because they have a more sensitive airway.\"\nAnd since a dry cough is a key sign of Covid-19, any cough caused by smoking a joint of weed could easily mimic that symptom, making diagnosis more difficult.\nThe need for a clear head\nThere's another factor as well. As we all know, weed not only calms you down, but it messes with your ability to function -- and that does you no favors if you find yourself having a medical emergency during a pandemic.\n\"You're reducing anxiety, but that is still a change in your thinking, a change in the way you are handling facts, how you're grasping situations,\" Glass said.\n\"Now there's a healthcare worker who is gowned, gloved, possibly in a hazmat suit trying to get through to you. These are people who are trying to decide if you should be going home, coming into the emergency room, or worst case scenario, that you need to be put on a ventilator,\" he continued.\n\"They want the person who's agreeing and giving informed consent to be completely in control of their thought processes.\"\nMore Americans are using weed\nthe In 2018, more than 43 million Americans aged 12 or older reported using marijuana in the past year, according tothe 2018 National Survey on Drug Use and Health (PDF).\nAround four million of those are people with \"marijuana use disorder, meaning that this has escalated to the point where it's a problem in their lives,\" said Jessica Hulsey, founder of the Addiction Policy Forum , which advocates on behalf of patients and families struggling with substance use disorder and addiction.\n\"Experts at the National Institutes of Health released some guidance for our patients and our families. saying marijuana use disorder could be a risk factor for complications from Covid-19,\" Hulsey said.\n\"Because it attacks the lungs, the coronavirus that causes Covid-19 could be an especially serious threat to those who smoke tobacco or marijuana or who vape,\" t he NIH said in its announcement.\n\"We need to make sure that these users are aware that marijuana is in essence an underlying health condition,\" Hulsey added. \"They should take extra precautions by minimizing use to the extent that is possible, and even start virtual treatment and a recovery journey while everyone's stuck at home.\"\nThe national drug survey also found more than a third of young adults aged 18 to 25 said they used marijuana during 2018, along with more than 13% of adults aged 26 or older.\nBut it's not just the young. Earlier this year, a study found use by older adults is rising sharply. In 2006, only 0.4% of people over 65 reported using marijuana products in the past year. By 2018, over 4% of those same aged seniors say they are now using, the study found.\n\"Marijuana use among seniors is not bouncing up and down like with other drugs. It's a straight line up,\" said study co-author Joseph Palamar, an associate professor of population health at New York University's Grossman School of Medicine, in an interview in February.\nAre even more Americans turning to weed during this time of crisis?\nSimply put, no one knows. Each state handles reporting differently, Glass says, and sales estimates often combine both THC, the main psychoactive compound in marijuana that produces the \"high,\" and CBD, the medicinal compound that is now sold over the counter.\n\"I made a few phone calls and the numbers ranged quite literally from a million to 30 million. So who knows how many people are getting their hands on cannabis to relieve their anxiety during this time,\" Glass said.\nWhat to do?\nIf you're not a regular smoker of marijuana, don't start, experts say.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\n\"Don't confound your caregivers with trying to sort out whether your dry cough and change in behavior is due to the fact that you're a novice with marijuana or it's associated with Covid-19,\" Glass said.\n\"If you do need to see a caregiver, be sure you're very honest with them about when you last used, and how often you use,\" Glass said, \"so they can get a good, clear story on what the impact of inhaling marijuana is on you.\"\nRemember the bottom line when it comes to smoking and Covid-19, Rizzo said.\n\"It's common sense that anything you inhale that has been combusted and contains particles or chemicals can inflame your airways,\" he said. \"So you're already making your body fight off foreign particles before it even has to fight off the infection.\"", "url": "https://www.cnn.com/2020/04/10/health/smoking-weed-coronavirus-wellness/index.html"}