{"authors": [], "date_download": "2020-05-04 20:06:30", "date_modify": "2020-05-04 20:06:30", "date_publish": "2020-04-09 14:30:39", "description": "INDIANAPOLIS (AP) — Gov. Eric Holcomb on Thursday urged Indiana churches, synagogues and other faith venues to remain closed and adhere to social distancing guidelines during services and...", "filename": "_c14b6da1bf37c3eee7ecb6a41217dc26_1588622790.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c14b6da1bf37c3eee7ecb6a41217dc26_1588622790.html", "title": "Indiana governor urges churches to stay closed amid pandemic", "title_page": "Indiana governor urges churches to stay closed amid pandemic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "INDIANAPOLIS (AP) — Gov. Eric Holcomb on Thursday urged Indiana churches, synagogues and other faith venues to remain closed and adhere to social distancing guidelines during services and observances for Passover and Easter to slow the spread of the COVID-19 virus.\n“Get the word and get home,” Holcomb told reporters during a daily update on Indiana’s response to the coronavirus pandemic. “This is about worship and we can follow the rules.”\nAs of Thursday, Indiana had 6,351 confirmed cases following corrections to the previous day’s total and 245 deaths due to complications from the COVID-19 virus.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.\nHolcomb has issued a stay-at-home order for all but essential workers. He also has said Indiana residents should follow social distancing guidelines, something that’s difficult during typical religious services.\nServices should be held online, and any staff or volunteers present who are not speaking should wear masks over their noses and mouths, according to guidance from Holcomb’s office.\nFor churches holding drive-up services, people should remain in their vehicles and have no physical interaction with others.\n“Communion should be brought from your own homes,” said Dr. Kristina Box, Indiana health commissioner. “Please don’t pass things out.”\nThe week leading up to Easter is considered the holiest time of year for many Christians, leaving churches to wrestle with how to hold services amid the coronavirus outbreak. In some cases, it has set up showdowns with local governments over restrictions that forbid large gatherings.\nMany churches are offering parishioners livestreaming options so they can observe Good Friday and Easter on TVs, smartphones and computers. Others are holding services at drive-in movie theaters.\nBIG JUMP\nThe reported deaths of 42 more Indiana residents from COVID-19 from Wednesday to Thursday marks the largest single-day jump in the state’s death toll during the pandemic. Indiana State Department of Health reported 34 deaths Tuesday.\nThe state agency, which has said that the additional deaths it reports each day occurred over multiple days, said an additional 430 residents had confirmed cases of COVID-19 — the respiratory disease caused by the virus.\nMarion County, the home of Indianapolis, again had the most new cases, at 127, raising its total to 2,415 — or about 38% of Indiana’s total. Northwestern Indiana’s Lake County had 64 new cases, and nine other Indiana counties had 10 or more new confirmed cases.\nThe department said 32,133 Indiana residents had been tested for the coronavirus as of late Wednesday.", "url": "https://apnews.com/c14b6da1bf37c3eee7ecb6a41217dc26"}