{"authors": ["Elizabeth Cohen", "John Bonifield", "Minali Nigam"], "date_download": "2020-05-04 17:01:34", "date_modify": "2020-05-04 17:01:34", "date_publish": "2020-03-28 04:17:10", "description": "Despite President Donald Trump's enthusiasm for the drug hydroxychloroquine to treat coronavirus, the federal funding powerhouse led by Dr. Anthony Fauci isn't spending any money on it, and clinical trials for it are lagging behind other drug studies, according to a CNN investigation.", "filename": "2020_03_28_health_coronavirus-hydroxychloroquine-trial_index_1588611694.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200323224325-medicina-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_28_health_coronavirus-hydroxychloroquine-trial_index_1588611694.html", "title": "Trump says this drug has 'tremendous promise,' but Fauci's not spending money on it", "title_page": "Hydroxychloroquine: Trump says this drug has 'tremendous promise,' but Fauci's not spending money on it   - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Despite President Donald Trump's enthusiasm for the drug hydroxychloroquine to treat coronavirus, the federal funding powerhouse led by Dr. Anthony Fauci isn't spending any money on it, and clinical trials for it are lagging behind other drug studies, according to a CNN investigation.\nAt a White House briefing last week, Trump said hydroxychloroquine, which is used to treat malaria, lupus, and rheumatoid arthritis, shows \"tremendous promise\" of working against coronavirus as well.\n\"I think it's going to be great,\" he said. \"We're quickly studying this drug.\"\nBut the National Institute of Allergy and Infectious Diseases isn't sponsoring any studies on hydroxychloroquine, according to a statement from the agency, which added that the agency is \"considering\" trials that examine the drug or its analogue chloroquine as a potential treatment for Covid-19. studies.\nThe Biomedical Advanced Research and Development Authority , another federal agency, also lists its coronavirus measures on its website, but hydroxychloroquine is not among them.\nHydroxychloroquine clinical trials\nLast month, a Chinese study theorized that hydroxychloroquine might work against coronavirus by preventing it from binding to human cells.\nTrump was so positive about the drug that doctors started hoarding it, causing several states to implement strict regulations around prescribing the drug.\nDespite this enthusiasm, a federal government registry for clinical trials shows only two trials in the US for hydroxychloroquine to fight coronavirus, and only one of those is up and running.\nBoulware said he had to get funding from Silicon Valley tycoon David Baszucki for one part of his study, which looks at hydroxychloroquine to prevent development of the disease, and he still doesn't have funding for the other part, which studies the drug as a treatment for infection.\n\"With all the money being spent on coronavirus, we should spend funds on medical research on how best to treat people and prevent new infections,\" Boulware said.\nThe second study , at Columbia University Irving Medical Center, is expected to begin enrollment this week and is currently not funded, according to a hospital spokeswoman.\nThe Gates Foundation is expected to announce soon that it will be funding hydroxychloroquine research for coronavirus at the University of Washington and New York University, according to multiple sources.\nFederal funding for other coronavirus treatments\nOther treatments are getting federal funding, and their trials are underway at multiple sites.\nDoctors at 11 sites have enrolled between 60 and 70 patients in a study of a sarimulab, according to George Yancopoulos, chief scientific officer for Regeneron, which makes the drug.\nIn the fight against coronavirus, doctors are studying sarimulab and other antibody treatments that can alter a body's inflammatory response to a virus.\nThe sarimulab study is getting support from the Biomedical Advanced Research and Development Authority, a division of the US Department of Health and Human Services.\nAt least four sites are already enrolling patients to study the effects of another drug called remdesivir, which is designed to keep viruses from replicating: Northwell Health and Montefiore Medical Center, both in New York City; Duke University Medical Center in North Carolina; and the University of Nebraska Medical Center.\nNIAID, the institute lead by Fauci, is sponsoring the trials of remdesivir, which is made by the pharmaceutical company Gilead.\nAt the White House press briefing last week, Fauci tamped down Trump's enthusiasm for hydroxychloroquine when he was asked if there was any evidence to suggest the drug could be used to prevent coronavirus\n\"No. The answer is no,\" Fauci said, adding that there was only anecdotal evidence that hydroxychloroquine could be an effective therapy for people with coronavirus.\nThe day after discussing hydroxychloroquine, Fauci made a pointed comment about coronavirus treatments.\n\"I don't want anybody to forget that simultaneously with our doing that, we're also doing randomized clinical trials on a number of candidates,\" he said. \"We're talking about remdesivir, other drugs, immune sera, convalescent serum, monoclonal antibodies, all of these are in the pipeline now queuing up to be able to go into clinical trial,\" he said.\nResearchers credit the advanced stages of the remdesivir and sarimulab trials to the fact that pharmaceutical companies have exclusive rights to these drugs and have an incentive to get studies moving.\nHydroxychloroquine, on the other hand, is an inexpensive generic drug made by several companies, so no one company stands to make much money off it.\n\"There are financial drivers in this system,\" said Dr. Kevin Tracey , president of the Feinstein Institutes for Medical Research at Northwell. \"I think that's just the reality, frankly.\"\nNon-pharmaceutical treatments for coronavirus\nThere are also non-pharmaceutical approaches being researched to treat coronavirus.\nOn Tuesday the US Food and Drug Administration said it was expediting the use of a blood plasma treatment for patients seriously ill with coronavirus.\nThe process, known as convalescent serum, involves taking the blood from someone who has recovered from coronavirus and giving some of the blood products to a patient who is suffering from coronavirus.\nThe hope is that the antibodies in the recovered person's blood will help the patient.\nTwo universities are trying to refine the process even further.\nRockefeller University scientists are looking to reproduce antibodies of recovered patients.\n\"We fish out the really effective antibodies and clone them and make them in big batches like in a huge container you make beer in, and then give it to people,\" said Jill Horowitz, executive director of strategic operations at Rockefeller's laboratory of molecular immunology.\nJUST WATCHED Doctor exposed to Covid-19 joins fight for possible treatment drug Replay More Videos ... MUST WATCH Doctor exposed to Covid-19 joins fight for possible treatment drug 02:36\nOne advantage of this approach is it uses the strongest antibodies, Horowitz said. Another advantage is that while there's a limited supply of blood from recovered patients, the antibodies can be replicated in large quantities.\nScientists at Baylor College of Medicine plan to recruit people who recovered easily from coronavirus and also those who ended up being hospitalized with it. The doctors would then see if there is a difference in their T-cells, a component of the immune system, and manufacture the components that seemed to aid in an easy recovery.\n\"We want to learn from people who naturally took control of the virus on their own and see what part of the immune system enabled them to fight the disease,\" said Ann Leen , a professor in the department of pediatrics at Baylor.\nThese tailored approaches would likely take some time to develop and couldn't be used on coronavirus patients as quickly as drugs like hydroxychloroquine and sarimulab, which are already on the market for other diseases.\nEven so, Art Caplan , a bioethicist at NYU Langone Health, said he had more faith in the Rockefeller and Baylor approaches, since they'll be tailored specifically to coronavirus.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nHe noted that many drugs that once held hope for Ebola didn't work out, and neither did convalescent serum, according to a study published in the New England Journal of Medicine.\n\"I wouldn't be so optimistic about these approaches, and I know that's sad news,\" Caplan said.\nBut Tracey, the researcher at the Feinstein Institutes, said it was worth the fight.\n\"We'll win this war. We just have to survive the battle,\" he said. =", "url": "https://www.cnn.com/2020/03/28/health/coronavirus-hydroxychloroquine-trial/index.html"}