{"authors": ["Barbara Starr", "Devan Cole", "Ryan Browne"], "date_download": "2020-05-04 16:21:01", "date_modify": "2020-05-04 16:21:01", "date_publish": "2020-04-05 15:48:40", "description": "Defense Secretary Mark Esper said Sunday that all individuals operating on department property worldwide should \"wear cloth face coverings\" when they can't practice proper social distancing in an effort to prevent the spread of coronavirus.", "filename": "2020_04_05_politics_pentago_0f7846aa19b50cdcd9c41b7bf5d4b6fb_index_1588609261.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200309092630-02-us-military-uniform-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_pentago_0f7846aa19b50cdcd9c41b7bf5d4b6fb_index_1588609261.html", "title": "Esper directs individuals on Defense property to wear 'cloth face coverings' when they can't practice social distancing", "title_page": "Esper directs individuals on Defense property to wear 'cloth face coverings' when they can't practice social distancing - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Defense Secretary Mark Esper said Sunday that all individuals operating on department property worldwide should \"wear cloth face coverings\" when they can't practice proper social distancing in an effort to prevent the spread of coronavirus.\nIn a memo sent to Defense Department staff and obtained by CNN, Esper said individuals should wear cloth face coverings \"when they cannot maintain six feet of social distance in public areas or work centers,\" effective immediately. The memo said the directive would not apply to a service member's personal residence on a military installation.\nThe directive applies to all military personnel, department contractors, civilian employees at the department, family members and \"all other individuals on DoD property, installations, and facilities.\"\n\"Exceptions to this requirement may be approved by local commanders or supervisors, and then submitted up the chain of command for situational awareness. Security checkpoints may require the lowering of face covers to verify identification,\" the memo said.\nCNN reported earlier Sunday that some Pentagon employees had received emails from their office administrators over the weekend directing them to come to work Monday with at least one face covering to prevent the spread of coronavirus , according to an official who received one of the messages.", "url": "https://www.cnn.com/2020/04/05/politics/pentagon-face-masks-esper-coronavirus-military/index.html"}