{"authors": ["Tara Subramaniam", "David Wright", "Matthew Philips"], "date_download": "2020-05-04 16:58:25", "date_modify": "2020-05-04 16:58:25", "date_publish": "2020-04-09 01:36:48", "description": "Over the past few weeks, President Donald Trump's coronavirus briefings have become a daily occurrence at the White House. They've also become regular venues for falsehoods, misleading information, revisionist history and outright lies.", "filename": "2020_04_08_politics_fact-ch_ea6fc7ffe4768ebf6bdc8ddd4e100d61_index_1588611505.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408175542-01-coronavirus-briefing-0408-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_fact-ch_ea6fc7ffe4768ebf6bdc8ddd4e100d61_index_1588611505.html", "title": "Trump offers two dangerous falsehoods in coronavirus briefing: fact check", "title_page": "Trump offers two dangerous falsehoods in coronavirus briefing: fact check - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Over the past few weeks, President Donald Trump's coronavirus briefings have become a daily occurrence at the White House. They've also become regular venues for falsehoods, misleading information, revisionist history and outright lies.\nBy CNN's rough estimate, over the past three weeks Trump has made at least 50 false or misleading claims at these briefings, which in many ways have become a substitute for the political rallies he can no longer hold due to the coronavirus outbreak\nThat's what made Wednesday night's briefing so noteworthy. By our preliminary count, Trump made just two false claims. This isn't to minimize those falsehoods. In fact both claims, pertaining to the President's false assertion that voter fraud is rampant in this country, are particularly dangerous, especially given the problems the coronavirus outbreak presents to voting\nBut compared to past briefings, including the one last night , Wednesday's was rather factual.\nHere's a look at what we found.\nTrump falsely claims voter fraud is rampant in the US\nIn light of the effect the coronavirus is having on state primaries and issues of voting in general, Trump was asked on Wednesday night about his previous statements that mail-in voting is susceptible to fraud. While many experts have suggested mail-in ballots could be an effective solution to dealing with the virus, Trump again attacked them as corrupt, despite having voted that way himself, and, more broadly, falsely claimed that voter fraud was rampant throughout the country.\n\"There's a lot of fraudulent voting going on in this country,\" Trump said.\nFacts First: Multiple Multiple studies over the years have confirmed that there is no widespread voter fraud in this country. Additionally, Democratic and Republican state officials routinely oversee elections where millions of people vote-by-mail without systematic problems.\nIn response to the initial question from CNN's Jim Acosta, Trump also implied that mail-in voting was politically biased, claiming that states where all residents vote by mail are won by Democrats. That's also incorrect. Five states in the US vote by mail: Utah, Colorado, Hawaii, Washington and Oregon. Both of Utah's US senators and its governor are Republicans, and Colorado also has Republican US senator, Cory Gardner.\nFalse claims of voter fraud in California\nIn an effort to support his claims of pervasive voter fraud, Trump cited a lawsuit in California involving conservative legal activist group Judicial Watch.\n\"There's evidence that's being compiled just like its being compiled in the state of California, where they settled with Judicial Watch saying that a million people should not have been voting,\" Trump said.\nFacts First: That's false. There is no evidence for Trump's repeated suggestion of widespread voter fraud by non-citizens in California. Trump also incorrectly described California's legal settlement with Judicial Watch. The state made no admission of any voter fraud in its settlement.\nThis is a claim Trump has made previously, and which we have fact-checked before\nHere's the back story:\nIn January 2019, Judicial Watch announced that it had settled its 2017 lawsuit against the state of California and the county of Los Angeles. The settlement required the county to remove the names of inactive voters from its voter lists, and it required the state to direct other counties to remove inactive voters from their own lists.\nTrump got the \"1 million\" figure from Judicial Watch: the group said that as many as 1.5 million registrations would have to be removed in Los Angeles County as a result of the settlement.\nBut there was no evidence that any of these inactive people voted illegally; Judicial Watch itself said most of them are simply \"voters who have moved to another county or state or have passed away.\" And California did not admit any wrongdoing as part of the settlement.\n\"The Judicial Watch settlement provided no evidence of fraud whatsoever,\" said Rick Hasen, an expert in elections law and a professor of law and political science at the University of California, Irvine.", "url": "https://www.cnn.com/2020/04/08/politics/fact-check-trump-coronavirus-briefing-april-8/index.html"}