{"authors": ["Eliza Mackintosh", "Ivana Kottasová"], "date_download": "2020-05-04 16:51:34", "date_modify": "2020-05-04 16:51:34", "date_publish": "2020-04-08 12:13:29", "description": "As nations look to their leaders for guidance in this time of crisis, British Prime Minister Boris Johnson is waging his own personal fight against the virus from an intensive care bed. Here's what else you need to know for Tuesday.", "filename": "2020_04_08_world_coronavirus-newsletter-04-08-20-intl_index_1588611094.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_world_coronavirus-newsletter-04-08-20-intl_index_1588611094.html", "title": "What you need to know about coronavirus on Wednesday, April 8", "title_page": "What you need to know about coronavirus on Wednesday, April 8 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story appeared in the April 8 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every weekday\n(CNN) On the most tragic day yet of the pandemic in America, chaos and confusion roiled the White House. As coronavirus deaths topped 1,800 nationwide yesterday, President Donald Trump delivered a wild performance that did little to put minds at ease, Stephen Collinson writes.\nAt an unchained news conference , Trump said he would freeze funding for the World Health Organization -- which he falsely accused of downplaying the pandemic -- then denied saying it minutes later. Trump also denied seeing January memos from a top adviser warning about the gruesome toll the virus could exact on the country, and ousted the top watchdog overseeing a $2 trillion relief package.\nAdding to the sense of farce: The White House Press Secretary was replaced — without ever delivering a press briefing — by a high-profile Republican communicator who has repeatedly dismissed the threat of the virus, and claimed Democrats were rooting for it to take hold. Meanwhile, Trump's acting Navy Secretary quit after calling the captain of a virus-stricken aircraft carrier \"stupid.\"\nWhile the virus continues to spread rapidly in the US and elsewhere, there is a ray of hope in China where it was first detected. Wuhan has lifted its lockdown after more than two months, an encouraging sign that Covid-19 can be defeated, and there are signs that some countries in Europe are already plotting to follow China's lead. But even as Wuhan reopens its borders , some restrictions will remain in place, and officials warn that the threat is far from over.\nYOU ASKED. WE ANSWERED\nQ: When will students be allowed to return to school?\nA: Top US coronavirus expert Dr. Anthony Fauci says he's optimistic that schools Top US coronavirus expert Dr. Anthony Fauci says he's optimistic that schools will be able to reopen by the fall . But because the virus won't disappear entirely, he cautions: \"it's going to be different.\" Communities will need to be able to identify the virus, isolate patients and contact trace infections. As for summer camps, he's less certain.\nNew research has suggested that school closures alone may only have a small effect on stopping coronavirus — preventing 2% to 4% of deaths, far fewer than other social distancing interventions. But some experts have warned against jumping to conclusions based on one study.\nMore than 50,000 people have asked us questions about the outbreak. Send yours here . Are you a health care worker fighting Covid-19? Message us on WhatsApp about the challenges you're facing: +1 347-322-0415.\nWHAT'S IMPORTANT TODAY\nCoronavirus warship row\nActing Navy Secretary Thomas Modly resigned yesterday , after a leaked recording revealed he called the ousted commander of a virus-stricken aircraft carrier \"stupid\" in front of thousands of sailors who had given their former captain a standing ovation when he left the ship just days before.\nHis resignation is the latest escalation in a spat over the decision by Capt. Brett Crozier, the then-commanding officer of the warship, to send a memo warning of coronavirus spreading among the sailors on the aircraft carrier. Modly removed Crozier from command after the memo leaked. Now he's out too.\nUK gripped as PM remains in intensive care\nBoris Johnson has spent a second night in an intensive care unit in a London hospital. His spokesperson said yesterday he was stable, was receiving the \"standard oxygen treatment,\" and was not on a ventilator.\nThe Prime Minister's hospitalization comes at a terrible time for the United Kingdom. The government needs to make a decision soon on whether to extend its lockdown, originally scheduled to be in place until April 13. And while official statistics say more than 6,000 people have died of the virus in the UK, new data suggest the death toll could be much higher.\nQR code is ticket out of Wuhan\nAfter more than two months under lockdown, people can finally travel out of the Chinese city of Wuhan starting today. Trains and flights are resuming, except to and from the capital Beijing.\nTo travel, people will still need to flash their all-important QR code on their phone . If it's green, they've been assessed as healthy or low-risk and they can leave the city.\nON OUR RADAR\nTOP TIPS\nTODAY'S PODCAST\n\"Number one: Be suspicious of any product that claims to have a quick fix. As you've always heard, if it's too good to be true, it probably is.\" -- CNN's Chief Medical Correspondent Dr. Sanjay Gupta", "url": "https://www.cnn.com/2020/04/08/world/coronavirus-newsletter-04-08-20-intl/index.html"}