{"authors": ["Katie Lobosco"], "date_download": "2020-05-04 16:04:59", "date_modify": "2020-05-04 16:04:59", "date_publish": "2020-04-02 02:49:38", "description": "The Treasury Department, clearing up confusion, has announced Social Security recipients will not have to file a tax return in order to receive the economic stimulus payments the government is preparing to send out amid the coronavirus pandemic.", "filename": "2020_04_01_politics_social-security-stimulus-payments_index_1588608299.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200326100042-steven-mnuchin-0326-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_social-security-stimulus-payments_index_1588608299.html", "title": "Social Security recipients will automatically receive stimulus pay", "title_page": "Social Security recipients will automatically receive stimulus pay - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The Treasury Department, clearing up confusion, has announced Social Security recipients will not have to file a tax return in order to receive the economic stimulus payments the government is preparing to send out amid the coronavirus pandemic.\nIt was unclear in guidance posted earlier this week whether Social Security recipients who don't normally file taxes would have to in order to receive the money. But the Treasury Department said Wednesday that those beneficiaries will automatically receive the money. The IRS will use the information that the Social Security Administration has on file.\nSocial Security recipients won't have to take any action.\nThose who normally receive their benefits directly in their bank account will receive the stimulus money in the same way. Others will receive a check in the mail -- though it will likely take longer to receive the payment than those who use direct deposit.\nThe change came after Democratic lawmakers sent a letter Wednesday urging the Treasury Department to send the payments automatically to Social Security recipients -- something the law gives the IRS the power to do. Republican Sen. Josh Hawley of Missouri also criticized the IRS guidance, calling it \"ridiculous\" and saying the \"IRS should follow the law that Congress passed.\"", "url": "https://www.cnn.com/2020/04/01/politics/social-security-stimulus-payments/index.html"}