{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:04:25", "date_modify": "2020-05-04 16:04:25", "date_publish": "2020-04-01 22:33:39", "description": "Vice President Mike Pence said something truly unbelievable in an interview with CNN's Wolf Blitzer on Wednesday.", "filename": "2020_04_01_politics_donald-trump-coronavirus-mike-pence_index_1588608265.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331203235-donald-trump-march-31-2020-01-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_donald-trump-coronavirus-mike-pence_index_1588608265.html", "title": "11 times Donald Trump has 'belittled' coronavirus", "title_page": "11 times Donald Trump has 'belittled' coronavirus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Vice President Mike Pence said something truly unbelievable in an interview with CNN's Wolf Blitzer on Wednesday.\n\"I don't believe the President has ever belittled the threat of the coronavirus,\" the vice president told Wolf . Which, even by Pence standards -- the VP is an unstinting, 100% supporter of President Donald Trump -- is pretty bad.\nSo, as a public service, here are 11 times where Trump \"belittled\" or otherwise downplayed the threat posed by coronavirus.\n1. \"We have it totally under control. It's one person coming in from China, and we have it under control. It's going to be just fine.\" ( January 22\n2. \"We pretty much shut it down coming in from China.\" ( February 2\n3. \"The Coronavirus is very much under control in the USA. We are in contact with everyone and all relevant countries. CDC & World Health have been working hard and very smart. Stock Market starting to look very good to me!\" ( February 22\n4. \"We're going very substantially down, not up. ... We have it so well under control. I mean, we really have done a very good job.\" ( February 26\n5. \"This is a flu. This is like a flu. ... It's a little like the regular flu that we have flu shots for. And we'll essentially have a flu shot for this in a fairly quick manner.\" ( February 26\n6. \"It's going to disappear. One day —it's like a miracle — it will disappear. And from our shores, we — you know, it could get worse before it gets better. It could maybe go away. We'll see what happens. Nobody really knows.\" ( February 27\n7. \"No, I'm not concerned at all. No, I'm not. No, we've done a great job.\" ( March 8\n8. \"So last year 37,000 Americans died from the common Flu. It averages between 27,000 and 70,000 per year. Nothing is shut down, life & the economy go on. At this moment there are 546 confirmed cases of CoronaVirus, with 22 death. Think about that!\" ( March 9\n9. \"This is a very contagious virus. It's incredible. But it's something we have tremendous control of.\" ( March 15\n10. \"I don't believe you need 40,000 or 30,000 ventilators. You know, you're going to major hospitals sometimes, they'll have two ventilators. And now, all of a sudden, they're saying, can we order 30,000 ventilators?\" ( March 27\n11. \"You call it germ, you can call it a flu. You can call it a virus. You can call it many different names. I'm not sure anybody knows what it is.\" ( March 27", "url": "https://www.cnn.com/2020/04/01/politics/donald-trump-coronavirus-mike-pence/index.html"}