{"authors": ["Maegan Vazquez", "Betsy Klein"], "date_download": "2020-05-04 17:00:08", "date_modify": "2020-05-04 17:00:08", "date_publish": "2020-04-09 23:17:10", "description": "President Donald Trump said Thursday that there have been more than two million coronavirus tests completed in the United States but suggested that mass testing is not going to happen.", "filename": "2020_04_09_politics_trump-coronavirus-tests_index_1588611608.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409183814-01-coronavirus-briefing-0409-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_trump-coronavirus-tests_index_1588611608.html", "title": "Trump says more than 2 million coronavirus tests have been done in the US, and claims mass testing not needed", "title_page": "Trump says more than 2 million coronavirus tests have been done in the US, and claims mass testing not needed - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) President Donald Trump said Thursday that there have been more than two million coronavirus tests completed in the United States but suggested that mass testing is not going to happen.\n\"I'm reporting today that we passed two million tests completed in the United States,\" Trump said during the White House coronavirus task force's news briefing, adding that the tests are \"highly sophisticated and highly accurate.\"\nThe President has been celebrating the growing number of coronavirus tests conducted in the US as a victory since the US surpassed South Korea last month as the country with the highest number of tests administered. However, compared to South Korea, the US has conducted far fewer tests per capita given the US population is more than six times larger than South Korea's.\n\"I think the important clarification is that we should be considering the number of cases per 1 million population and considering a rate of people tested and not the absolute numbers,\" said Jennifer Horney, founding director of the University of Delaware's epidemiology program. \"The absolute number of tests is not very meaningful.\"\nThe Trump administration has faced widespread criticism for the lack of a testing system across the country to identify coronavirus patients and track the spread of the outbreak. While testing has ramped up in recent weeks, the lack of an aggressive testing regimen early in the outbreak led to accusations that the government missed a chance to reduce the speed and scale of the pandemic in the US. The US now leads the world in the number of reported cases.\nAnd though the number of tests administered has continued to increase, not all labs evaluating those tests have been able to keep up.\nQuest Diagnostics, one of the nation's largest commercial labs, has faced a backlog of coronavirus tests which has ballooned in the last two weeks and has delayed results up to 10 days. In late March, the lab had about 160,000 coronavirus test orders waiting to be processed, amounting to about half of the 320,000 orders for tests the company had received up to that date.\nAs many people with symptoms consistent with coronavirus struggle to get tested -- including health care workers such as nurses -- it's still not clear how the country will emerge from its current state. Many states are operating under stay-at-home orders and the federal government is recommending strict social distancing guidelines in order to limit the spread of the novel coronavirus.\nDuring Thursday's briefing, the President was asked by CNN's Jim Acosta whether the US would return to normal without instituting an adequate testing system, potentially through nationwide testing and monitoring. Trump appeared to interpret the question as asking whether the entire American population would be tested for coronavirus.\n\"We want to have it and we're going to see if we have it. Do you need it? No. Is it a nice thing to do? Yes. We're talking about 325 million people and that's not gonna happen, as you can imagine, and it would never happen with anyone else, either,\" the President said. \"Other countries do it, but they do it in a limited form. We'll probably be the leader of the pack.\"\nTrump also suggested there would be \"massive testing\" in \"certain areas\" of the country.\nLater on in the briefing, Vice President Mike Pence would not say if there are enough coronavirus tests available right now to reopen the country.\nWhen asked by Acosta if the US had the testing capacity to make Americans feel comfortable about returning to work, Pence largely sidestepped the question, but when pressed, the vice president said, \"We are moving every day toward meeting that moment.\"\nHe went on to say that a decision on reopening the country will be made through a combination of factors.\n\"First would be that we are at the end of the coronavirus for most major communities,\" Pence said. \"Another piece of that is that we have therapeutics for Americans to take medicines if they contract the disease. Another piece of that is guidance from the CDC to public institutions, to businesses large and small about how to conduct themselves in a safe and a responsible way. And testing is also a piece of that.\"\nPence added that testing is being scaled up across the country daily and there is work being done on surveillance testing in addition to diagnostic testing.", "url": "https://www.cnn.com/2020/04/09/politics/trump-coronavirus-tests/index.html"}