{"authors": ["Senior Justice Reporter"], "date_download": "2020-05-04 21:06:50", "date_modify": "2020-05-04 21:06:50", "date_publish": "2020-04-30 20:29:47", "description": "The COVID-19 pandemic is hitting the Federal Bureau of Prisons, and inmate releases aren't happening as fast as advocates hoped.", "filename": "entry_federal-bureau-of-prisons-coronavirus_n_5eab128ec5b6c06f13105216_1588626410.html", "image_url": "https://img.huffingtonpost.com/asset/5eab14c824000010028ea0a3.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_federal-bureau-of-prisons-coronavirus_n_5eab128ec5b6c06f13105216_1588626410.html", "title": "Scarce Testing, Tight Quarters, Limited Gear: Federal Prisons Hammered By Coronavirus", "title_page": "Scarce Testing, Tight Quarters, Limited Gear: Federal Prisons Hammered By Coronavirus | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Earlier this year, Andrea Circle Bear was sentenced to 26 months in prison on a drug charge. She went into federal custody on March 20, at a time when a number of states had already issued stay-at-home orders and there were at least 19,300 coronavirus cases in the United States. On March 31, she was placed on a ventilator. The next day, her baby was born by cesarean section. She tested positive for COVID-19 on April 4. The 30-year-old Native American from South Dakota died on April 28. She’d been in the custody of the Federal Bureau of Prisons for just over a month.\nHer story, which has drawn attention from members of Congress, is just one of many examples of how the federal prison system is struggling to prevent further COVID-19 outbreaks in its facilities. Prisons give the coronavirus an ideal environment to spread.\n“Why the hell did they transfer that Circle Bear girl?” one BOP employee asked in a conversation with HuffPost this week. “You took her from a place where there were no exposures to a place where you put her to death. You guys pretty much sentenced her to death. For a two-year drug charge.”\nThe Bureau of Prisons, the largest prison system in the world’s most incarcerated nation, had a number of deep-rooted problems long before COVID-19 and recently came under national scrutiny over the death of multimillionaire sexual predator Jeffrey Epstein. The pandemic has highlighted how unprepared BOP was for such a health care crisis.\nAt least 33 inmates in the federal system have died of the coronavirus. As of Thursday, nearly 1,700 inmates and 349 BOP staffers had confirmed cases ― although those numbers likely represent only a fraction of the true number of infections because of limited testing. For the most part, BOP is only testing suspected cases. Seventy-one percent of tests have come back positive, BOP officials told The Wall Street Journal. Tests aren’t even available to all staff members: In a video message released Wednesday, BOP Director Michael Carvajal said the “scarcity of available testing resources” had prevented testing of all BOP employees.\nAt the federal Terminal Island facility in San Pedro, California, 600 inmates ― more than half the facility’s total population ― have tested positive. BOP’s medical center in Fort Worth, Texas, has 336 positive cases, while 207 inmates tested positive at the prison in Butner, North Carolina.\nThe Elkton facility in Lisbon, Ohio, has seen the highest number of confirmed positive tests of BOP staffers ― 48 employees so far. Seven inmates there have died. On Thursday, BOP released a list of 837 inmates at Elkton who should be released or transferred after a federal judge ruled that plaintiffs were likely to succeed in their argument that BOP had failed to protect the inmates from “cruel and unusual punishment.”\nCOVID-19 deaths have piled up in the month since Attorney General William Barr told BOP to prioritize home confinement in an effort to protect inmates who might be particularly vulnerable to the coronavirus.\nYet relatively few federal prisoners have been sent to home confinement. More than a month after Barr’s first memo, BOP has placed just 1,871 of its more than 140,000 inmates in home confinement. Some prisoners have even been told they were eligible for release and moved to quarantine in preparation for release, only to be told they were no longer considered eligible.\nYou took her from a place where there were no exposures to a place where you put her to death. You guys pretty much sentenced her to death. For a two-year drug charge. A Federal Bureau of Prisons employee\nAs a system-wide lockdown extends past a month, a BOP officer told HuffPost that inmates were going “stir crazy” and “getting cabin fever” being confined to their cells for as much as 23 hours a day. “The walls are closing in on them,” the officer said. “Human beings are naturally sociable creatures.”\nStaffers and inmates at that officer’s facility, which has a number of confirmed coronavirus cases, have been provided with surgical masks, which they have to reuse. Gloves aren’t available, according to the officer. Staffers now have hand sanitizer, but it’s still considered contraband for inmates because of its alcohol content. While BOP is supposed to be sanitizing cells, the officer said that wasn’t happening.\n“How are you going to sit there and tell a terrorist who might have a death penalty coming ... or El Chapo, you know, ‘Make sure you clean your cell?’” the officer asked.\nFamilies of inmates have been hesitant to attach their names to any criticism of BOP’s handling of the coronavirus pandemic, fearing blowback on their relatives in federal custody. They don’t want to do anything that could risk their loved one’s potential early release. But family members who were originally told their loved one was getting out have been incensed by the way they were treated by the federal prison system.\nOne family member of an inmate who was given a release date only to see it taken back said that the family felt “terrified, hopeless and disenfranchised” and felt that BOP sent them on an “emotional rollercoaster ride.”\n“My dad has watched people around him get sick and die. He is scared and now he is hopeless. And our family spends all day, every day, worried sick. We can’t get our minds off of it. And nobody at the BOP will listen,” the family member told HuffPost.\nThe husband of one female inmate, who was placed into quarantine ahead of her expected release only to be taken out, said that he’s glad he hadn’t told their children about their mother’s potential release. He said it’s been tougher to contact his wife since the lockdown went into place, as she has very limited time for emails and phone calls. “They’re pretty much being cut off from their family,” the husband said.\nThe man’s wife, who is behind bars for a nonviolent crime, hasn’t yet served 50% of her sentence ― a metric that BOP had temporarily used to evaluate which inmates were good candidates for home confinement. He said he didn’t understand why length of time served should matter for nonviolent inmates like his wife if BOP’s goal was to curb the spread of COVID-19.\n“That is what is baffling to me. I don’t understand if you’re trying to slow the spread and you’re trying to protect individuals, whether they have served 25% or 50%, how that makes any difference in your decision-making,” he said. “What is the end goal here?”\nCircle Bear’s death will likely draw more attention to the federal prison system’s handling of the pandemic — and raise the issue of whether low-level offenders like her should be let go to help reduce the population at BOP facilities.\n“In what world should a pregnant woman be incarcerated, especially in the middle of a virus outbreak, for a rarely prosecuted technical violation?” asked the Justice Action Network, which called for Barr and Carvajal to answer for Circle Bear’s death. “Why was this pregnant woman with underlying health issues not transferred or released during the COVID-19 pandemic?”", "url": "https://www.huffpost.com/entry/federal-bureau-of-prisons-coronavirus_n_5eab128ec5b6c06f13105216"}