{"authors": ["Alicia Wallace", "Cnn Business"], "date_download": "2020-05-04 16:04:37", "date_modify": "2020-05-04 16:04:37", "date_publish": "2020-04-02 00:22:28", "description": "In Covid-19's upheaval of the American economy, supply-and-demand patterns were swiftly knocked out of whack.", "filename": "2020_04_01_business_coronav_1af8e833dc6ba37a7ac4759f344c76ff_index_1588608277.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401192623-01-coronavirus-labor-cross-industry-hiring-employee-sharing-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_business_coronav_1af8e833dc6ba37a7ac4759f344c76ff_index_1588608277.html", "title": "How Covid-19 could redefine labor in America", "title_page": "How Covid-19 could redefine labor in America - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "San Francisco (CNN Business) In Covid-19's upheaval of the American economy, supply-and-demand patterns were swiftly knocked out of whack.\nAlmost overnight, entire industries were crippled, sidelining workers and putting millions of people on the unemployment rolls.\nSeeking to ease the pain and balance out volatility in the labor market, corporations now are forging unlikely alliances and striking cross-industry agreements to redeploy their furloughed workers.\nThe biggest names in hotels and retail are hoping to funnel their underemployed personnel to grocery chains, pharmacies, delivery services and others in desperate need of employees.\nAlbertsons created a \"hiring partner program\" with other large hospitality, restaurants and retail firms. Hilton created a job portal to 28 companies — among them, Walgreens, Stop & Shop and The Home Depot — promising expedited hiring to its affected employees . On a smaller scale, Sedano's, a Miami-based Hispanic grocery chain, offered temporary employment to workers at two local restaurant chains.\nThe idea of workers transitioning from checking guests into hotel rooms to running grocery checkouts is intended to be a short-term fix for an acute and immediate problem. But labor and public policy experts say it could signal a long-term shift in how work is done in America.\n\"It could open up some eyes or a different way of thinking about employment,\" said Ravi Anupindi, professor of technology and operations and faculty director for the Center for Value Chain Innovation at the University of Michigan's Ross School of Business.\nThe needs of now\nIt didn't take long for pain points to emerge at the companies experiencing severe spikes in demand.\n\"Our workers are pretty much at the max,\" said Marc Perrone, president of the United Food and Commercial Workers International Union, which represents more than 1.3 million workers in places such as grocery stores, meat-packing plants, chemical facilities and cannabis shops.\n\"They're working six days a week, eight to 12 hours a day,\" he said. \"Ours are going to break at some point. It's a long time to be working that long of a shift on concrete all day. \"\nPerrone, who said favors employee-sharing arrangements, noted that UFCW opened a hiring portal of its own\nWorking with companies like Albertsons and CVS in this capacity is completely new for such companies as Hilton and Kohl's.\n\"We are in an unprecedented situation with hotels nearing zero occupancy,\" Alison Menon, a Hilton spokesperson, wrote in an email to CNN Business. \"This is creating challenges for all 4.7 million people working in the US hospitality industry. Helping our team members find alternative work at this time is one of the best ways to support their financial health and ensure that Hilton is able to welcome the them back when travel resumes.\"\nKohl's, which announced store closures with plans to pay employees for up to 14 days, has partnered with Albertsons to find temporary work for affected employees, said Jen Johnson, the department store chain's senior vice president of communications.\n\"We will welcome our associates back to Kohl's whenever we are able to reopen our stores,\" she said via email. \"We want our associates to do what's best for them and their families, which could mean seeking additional employment while our stores are temporarily closed.\"\nShifts in labor — especially at this scale — are usually time-intensive and costly, said Andrew Challenger, senior vice president of Challenger, Gray and Christmas, a global outplacement firm.\n\"I love this idea of being able to seamlessly shift workers from an industry that has seen an enormous demand shock on the downside to an industry that has seen an enormous demand shock on the upside,\" he said.\nIf companies can agree on the back end of the arrangement, this shift could not only address their emergency needs but also protect the labor market whenever the nation emerges from this crisis, he said.\n\"If this method facilitates a way to keep people marginally attached to a position until demand returns, it helps us recover and prevent so much pain for people in the long run,\" he said.\nThis addresses labor market frictions and eliminates elements that make it harder or more costly for employers to find workers, said economist Harry J. Holzer, a professor at Georgetown University's McCourt School of Public Policy.\nThen again, it does give a leg up to an insider and could result in someone else — perhaps a person in a disadvantaged economic position — missing out on a job, he said, adding that another concern could be the potential for collusion on aspects such as wages and benefits.\n\"One can imagine that if both sides of both firms like it, that they might want to continue some kind of arrangement like that,\" he said. \"And there again you can see the benefits to each side ... but I worry about that collusion issue.\"\nWhat the future could bring\nEmployee-sharing is hardly a new concept, but it's never been done to this scale, Anupindi said.\nThe practice has a longer history in Europe, he said, referencing studies by Cornell University's Industrial and Labor Relations School. In countries such as Belgium and France, companies establish an \"employer group\" and coordinate assignments to a shared group of workers who would have full-time employment but utilize their skills at several different companies.\nAlthough the concept remains a \"marginal labor market phenomenon,\" the Cornell studies found that they benefit workers and employers by providing stability, job security and growth in job skills. Alternatively, the efforts run the risk of overworking individuals as well as isolating them from an organizational structure.\nRegardless, such moves require strong planning, mutual trust and a predictable pattern of employment needs.\n\"For the employee-sharing at a large-scale level to work, there has to be a counter-cyclicality,\" Anupindi said. Without that he added,\"this isn't going to happen.\"\nHe uses as an example how a lawn mowing service whose workers are busy in summer could see value in sharing workforces with a business that specializes in snow removal in the wintertime.\nBut Covid-19 has been anything but predictable or expected.\n\"What you're seeing here is what I would classify as unpredictable seasonality — a shock to the system,\" he said.\nAlibaba BABA Although it's doubtful that large companies will continue to run these services in a consistent manner, a look at China since the outbreak may offer some clues.and JD.com launched employee-sharing programs in February. To what extent such arrangements continue could provide insights for other multinational companies.\n\"This is, in my mind, the largest, global natural experiment\" of the future of work, Anupindi said.", "url": "https://www.cnn.com/2020/04/01/business/coronavirus-labor-cross-industry-hiring-employee-sharing/index.html"}