{"authors": ["Nathaniel Meyersohn", "Cnn Business"], "date_download": "2020-05-04 16:27:41", "date_modify": "2020-05-04 16:27:41", "date_publish": "2020-04-07 14:47:58", "description": "Local grocers and big chains alike are deploying robots to clean floors, stock shelves and deliver groceries to shoppers during the coronavirus.", "filename": "2020_04_07_business_grocery-stores-robots-automation_index_1588609661.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191024123342-02-walmart-robot-scanner-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_business_grocery-stores-robots-automation_index_1588609661.html", "title": "Grocery stores turn to robots during the coronavirus", "title_page": "Grocery stores turn to robots during the coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Local grocers and big chains alike are deploying robots to clean floors, stock shelves and deliver groceries to shoppers during the coronavirus.\nGrocers are searching for ways to reduce pressure on store workers and increase efficiency amid a surge of shoppers visiting stores and ordering online during the crisis. They believe robots and AI offer solutions that can help them bring down costs and improve store operations.\n\"There's strong interest in moving rapidly in this direction because everyone knows they need to raise their game to stay competitive and it's ultimately more cost effective to automate than staff up, especially in today's labor market,\" said Bill Bishop, co-founder of retail and grocery consulting firm Brick Meets Click.\nExperts say the crisis may speed up grocers' use of robots in stores.\n\"I strongly believe that the current health crisis will accelerate the adoption of robots in retail,\" said Steven Keith Platt, research director for the Retail Analytics Council and adjunct professor at Northwestern University. \"Short-term, this is to address health concerns\" of workers and customers, he said. In the long term, robots in stores will stock shelves and prepare food.\nRead More", "url": "https://www.cnn.com/2020/04/07/business/grocery-stores-robots-automation/index.html"}