{"authors": ["Ann Colwell"], "date_download": "2020-05-04 16:11:52", "date_modify": "2020-05-04 16:11:52", "date_publish": "2020-04-03 03:48:46", "description": "A longtime math teacher says he has 50 years' worth of equipment and supplies tucked away in his classroom storage. Buried in the detritus: long-outdated technology that could possibly save lives in the fight against the coronavirus in Northeast Iowa.", "filename": "2020_04_02_us_iowa-medical-supplies-coronavirus_index_1588608712.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402220927-iowa-community-rallies-around-its-hospitals-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_us_iowa-medical-supplies-coronavirus_index_1588608712.html", "title": "Iowa community rallies to find hard-to-find medical supplies for local hospitals", "title_page": "Iowa community rallies to find hard-to-find medical supplies for local hospitals - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Dave Will's classroom storage is the butt of many jokes at Columbus High School in Waterloo, Iowa. The longtime math teacher says he has 50 years' worth of equipment and supplies tucked away.\nBuried in the detritus: long-outdated technology that could possibly save lives in the fight against the coronavirus in Northeast Iowa.\n\"I'm kind of a pack rat. I never, ever throw anything away,\" Will said. \"People around here make fun of me for that. I finally get to say I told you so.\"\nHis school's principal received an email this week looking for old projector rolls, those clear reams of acetate used by educators for decades. A group of local entrepreneurs had locally sourced a way to 3D print face shields, a key piece of personal protective equipment -- widely known as PPE. They needed acetate for the clear piece that protects the face.\nWill says most teachers threw away their old rolls a long time ago -- but not him. He'd been hanging on to his old overhead projector and supplies, \"just in case.\" He unearthed more than a dozen acetate rolls, plus a stockpile of single sheets. He estimates he donated more than 1,000 feet of acetate in all.\n\"Hopefully they will help in the cause,\" he said. \"We're all in this together.\"\n'It gets me teary-eyed'\nHealthcare providers across the country are bracing for a surge in coronavirus cases in their communities. Outbreaks in major population centers like New York and Seattle have drawn much of the national spotlight, but smaller cities like Waterloo are racing to get ready, too.\nIowa has recorded at least 614 cases of Covid-19 and at least 11 deaths, according to figures from Johns Hopkins University. Black Hawk county -- home to about 135,000 people -- has just eight of the confirmed cases so far, according to the county's public health director, Dr. Nafissa Cisse Egbuonye.\nIowa is one of a handful of states that has not issued a statewide stay-at-home order , but Dr. Cisse Egbuonye says the community is taking preventive measures seriously. Based on available data, she anticipates a peak in cases in the next two to three weeks.\nHospitals in Waterloo are proactively looking for what they need -- fully aware their own supply needs are currently dwarfed by cities with far more cases. And they're finding entirely new supply channels in the process.\nAnesa Kajtazovic, the Development Director for the Allen Hospital Foundation, spoke to CNN in between supply runs for the hospital, an affiliate of UnityPoint Health. She says the hospital was hitting dead ends as they looked for in-demand items like N95 masks, procedure gowns, and face shields.\n\"Obviously, we ordered things like everybody else, but it's either taking a while or it's not available in the quantities we need,\" Kajtazovic said. She says she reached out to her network in the community, and word spread quickly. \"The response has been tremendous. It gets me teary-eyed. It's just so kind of people.\"\nKajtazovic started calling schools, retailers, and local businesses to let them know what the hospital needed. She quickly found Will and his supply closet. The Waterloo Community School District called soon after to say it found 20,000 sheets of projector sheets.\nKajtazovic called a local Menards -- a chain of home improvement stores in the Midwest -- asking them to alert her if they received any shipments of N95 masks. An assistant manager called soon after, saying only one box came in. He personally paid for it and donated it.\n\"I think health care touches all of us, so this has become very personal to people,\" Kajtazovic said. \"Who is going to be there to take care of our loved ones? Our nurses, doctors, first responders. That's why so many in our communities are stepping up to help in any capacity they can.\"\nSome people donated money. Others sewed face masks and isolation gowns. A farmer dropped off a box of N95 masks and gloves. John Deere sent over safety glasses from their local plants. The University of Northern Iowa sent over boxes of supplies. The Waterloo Career Center nursing program donated boxes of gloves, hand sanitizer, masks, surgical caps, and shoe coverings. A local distillery started producing its own hand sanitizer. And the school district and local YMCA joined forces to provide daycare to healthcare workers with children.\n'The community is wrapping its arms around us'\nAs of Thursday morning, one major data projection predicted that nearly 1,500 Iowans could die as a result of Covid-19 by early August. That model assumes Iowans will practice social distancing -- but it also factors in the lack of a statewide mandate ordering residents to stay home.\nAllen Hospital's CEO Pam Delagardelle says her staff has been watching the pandemic closely, and she says they're ready.\n\"This is something you train for. You always know it's a possibility,\" Delagardelle said. \"It will be challenging to get some of the equipment we need, but it's very exciting to see the innovation coming about to produce some of these supplies.\"\nJack Dusenbery, CEO of Waterloo's MercyOne Medical Center, says his hospital has been preparing for a worst-case scenario. Both MercyOne and Allen are working to cross-train staff, increase ventilator capacity, prioritize services, and build out detailed surge plans. Both hospitals have also opened satellite clinics for respiratory patients with symptoms of Covid-19.\n\"We're trying to be ready for what could come,\" Dusenbery said. \"I hope it doesn't happen, but if it does, we want to be the best hospital system we can be when the community needs us.\"\nIn the meantime, the community has been trying to return the favor.\n\"I've got friends of friends texting me in the evening, saying, 'Can I help out? Can I make meals?' Dusenbery said. \"It's nice to see other people coming forward, saying, 'How can I assist? I'm not a caregiver, but I'm here for you.\"\nDusenbery ticks off more examples of the community stepping up: The hospital has received more than 1,000 hand-sewn masks. A local developer with connections in China is helping secure needed equipment. Connections at John Deere are offering their 3D printers to make shields and masks. Local hotels have reached out to offer their mostly vacant rooms to medical staff who need to isolate themselves from their families, if they end up treating patients with Covid-19.\nBoth Dusenbery and Delagardelle dismiss the idea that they might be at a disadvantage compared to larger metro areas like New York when it comes to sourcing supplies.\n\"I really feel like the community is wrapping its arms around us. We're actually at an advantage being in a community like Waterloo,\" Delagardelle said. \"I'm sleeping better at night knowing that we can keep our employees safe.\"", "url": "https://www.cnn.com/2020/04/02/us/iowa-medical-supplies-coronavirus/index.html"}