{"authors": ["Joshua Berlinger"], "date_download": "2020-05-04 16:05:32", "date_modify": "2020-05-04 16:05:32", "date_publish": "2020-04-02 06:41:24", "description": "The Malaysian government was forced to apologize after its Women's Development Department published a series of sexist \"tips\" to help deal with the ongoing coronavirus lockdown, including advising women to continue to wear makeup and to \"avoid nagging.\"", "filename": "2020_04_02_asia_malaysia-wo_8bb98a4051c2f0509bf1da4734503679_index_1588608332.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402020920-coronavirus-malaysia-0318-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_asia_malaysia-wo_8bb98a4051c2f0509bf1da4734503679_index_1588608332.html", "title": "Malaysian government apologizes after advising wives to avoid 'nagging' during coronavirus lockdown", "title_page": "Malaysian government apologizes after advising wives to avoid 'nagging' during coronavirus lockdown - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Malaysian government was forced to apologize after its Women's Development Department published a series of sexist \"tips\" to help deal with the ongoing coronavirus lockdown, including advising women to continue to wear makeup and to \"avoid nagging.\"\nThe campaign was met with fierce backlash online, and the posts have since been deleted from the department's social media account.\nAs of Thursday afternoon in Malaysia, more than 2,900 coronavirus cases had been confirmed inside the country, killing 45 people, according to a tally by Johns Hopkins University.\nPrime Minister Tan Sri Muhyiddin Yassin enacted a series of far-reaching measures last month intended to stem infections of Covid-19, the disease caused by coronavirus, including strict nationwide controls locking down all travel in or out of the country and heavily restricting movement within the country\nOne of the biggest criticisms against the government body charged with supporting women appeared to be that it was ignoring concerns about a rise in domestic violence that may accompany stay-at-home orders, and instead focusing on things like how women should dress.\nRead More", "url": "https://www.cnn.com/2020/04/02/asia/malaysia-womens-advice-controversy-coronavirus-intl-scli-hnk/index.html"}