{"authors": ["Manu Raju", "Lauren Fox", "Betsy Klein"], "date_download": "2020-05-04 16:10:16", "date_modify": "2020-05-04 16:10:16", "date_publish": "2020-04-02 16:51:35", "description": "Americans likely won't begin to see direct payments from the coronavirus stimulus bill until at least April 13 and it could take 20 weeks for all the checks to be mailed, Trump administration officials told lawmakers, according to a House Democratic memo obtained by CNN.", "filename": "2020_04_02_politics_stimulus-20-weeks-irs_index_1588608616.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190905130549-dollar-bills--stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_stimulus-20-weeks-irs_index_1588608616.html", "title": "Some Americans could wait 20 weeks to receive stimulus checks, IRS tells House Democrats", "title_page": "Some Americans could wait 20 weeks to receive stimulus checks, IRS tells House Democrats - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Americans likely won't begin to see direct payments from the coronavirus stimulus bill until at least April 13 and it could take 20 weeks for all the checks to be mailed, Trump administration officials told lawmakers, according to a House Democratic memo obtained by CNN.\nThe timeline means tens of millions of Americans will have to wait to get badly needed assistance, despite repeated earlier suggestions from Treasury Secretary Steven Mnuchin that the money would go out as soon as April 6.\nMnuchin said at Thursday's White House coronavirus briefing that payments would go out within two weeks to people whose direct deposit details are on file with the government, echoing comments he made this past Sunday after passage of the $2.2 trillion stimulus bill that payments would not go out until mid-April.\nHe added that a web portal would be established for people to supply their details and that checks would be sent to anyone else, but did not specify a timeline.\n\"I am assuring the American public, they need the money now,\" he said.\nRead More", "url": "https://www.cnn.com/2020/04/02/politics/stimulus-20-weeks-irs/index.html"}