{"authors": ["Kerry Flynn", "Cnn Business"], "date_download": "2020-05-04 16:17:38", "date_modify": "2020-05-04 16:17:38", "date_publish": "2020-04-03 19:55:01", "description": "In a video shot from her hospital bed where she is recovering from Covid-19, Austin American-Statesman photojournalist Lola Gomez described the predicament that photographers like herself face as they cover the pandemic.", "filename": "2020_04_03_media_photojournalists-coronavirus_index_1588609058.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403134656-photographer-john-moore-coronavirus-ppe-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_media_photojournalists-coronavirus_index_1588609058.html", "title": "Photojournalists are risking their lives to capture the pandemic", "title_page": "Photojournalists are risking their lives to capture the pandemic  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) In a video shot from her hospital bed where she is recovering from Covid-19, Austin American-Statesman photojournalist Lola Gomez described the predicament that photographers like herself face as they cover the pandemic.\n\"Even though the reporters are working from home, photographers can't work from home,\" Gomez said in the video posted to Facebook on April 1. \"We, my team, is working out there, to report the community everything that is happening now, risking their lives, literally, so be kind with them when you see them out there.\"\nNewsrooms across the US have closed their offices in the wake of coronavirus outbreak to create the social distancing needed to slow the spread of the deadly illness. But while many journalists can do their jobs remotely — through phone calls, video calls and Slack messages — photographers continue to put themselves in harm's way to capture the pandemic from the front lines.\nLast month, freelance photographer Whitney Curtis went inside the home of two medical professionals for a Washington Post story about health care workers who are fearful of infecting their families. Curtis told CNN Business that she used hand sanitizer and put on an N95 mask before entering their home. She called to be let in, instead of knocking on the door. She washed her hands again once she was inside. She brought with her limited equipment — just a belt pack around her waist — and didn't set anything down on the ground or other surfaces. When she got home, she changed her clothes, disinfected her gear and took a shower.\nKatie Patel holds her 3-month old daughter, Lucy, as she reads to her son Parker, 3, and daughter, Isla, 1, before bedtime at their home in Creve Coeur, Missouri, on March 17, 2020. (Photo by Whitney Curtis for The Washington Post/Getty Images)\n\"My biggest fear is I'm an asymptomatic carrier of the virus,\" Curtis said. \"That's the difficult thing with this story. Photojournalists, we're used to putting ourselves in precarious and potentially harmful situations, but in those situations, we're the ones at risk. We're not putting other ones at risk.\"\nA week later, Moore flew back to New York and began to document life in suburbs such as Westchester County, Long Island and Stamford, Connecticut, where he is based.\n\"Like many of us, I have photographed at drive-through testing centers, but I've also tried to concentrate on families who are isolated at home,\" Moore said. \"I photographed two undocumented families from Honduras who rented a house together in Long Island. One person in the group came down sick and the rest quickly followed and then self-isolated at home for two weeks.\"\nGetty Images staff photographer John Moore photographs while wearing personal protective equipment on March 30, 2020 in Mineola, New York. He was photographing undocumented immigrants in isolation at home for possible COVID-19.\nWhen photographing the sick families, Moore said he wore a Tyvek suit, boot covers, two layers of latex gloves and a full face respirator.\n\"I had spoken with one of them ahead of time, so they would know what to expect and not be so taken aback when I showed up at the front door looking like I was wearing a space suit,\" Moore said.\nAn undocumented Honduran immigrant reads her Bible during self-quarantine with her family for possible COVID-19 on March 30, 2020 in New York. (Photo by John Moore/Getty Images)\nThis week, Moore went on ride-alongs with EMT units wearing an N95 mask, gloves and an apron.\nBenjamin Norman , a New York-based freelance photographer, was in Florida last month to cover the annual golf tournament, The Players Championship. But when that got canceled, he flew back to New York and began covering the pandemic's effects on the city.\n\"I'm just as scared as everybody else,\" Norman said. \"The only way I've continued with this job is because this landed in my backyard. I'm local. I pride myself in being a local photojournalist and all of a sudden this happened in my backyard.\"\nFor the New York Times, Norman has photographed the city's empty streets . For Time magazine, he went inside Maimonides Medical Center in Brooklyn where he captured health care workers on the job. Inside the emergency room, he said he took the same precautions as the doctors and nurses, wearing a mask, gloves and goggles. He said he practiced \"extreme social distancing\" and did not put his gear down on any surface.\n\"Reporters have been doing such a good job of getting the data and the scale of this thing. Now it's the job of photojournalists to put a face to the data,\" Norman said. \"To me, that's in a hospital where people are in literal life or death moments.\"\nPaul Gillespie , photographer at the Capital Gazette in Annapolis, Maryland, said covering the pandemic reminded him a bit of photographing the aftermath of 9/11. But an even more comparable experience was working during the DC sniper attacks in October 2002, when two domestic terrorists killed 10 people over three weeks.\n\"You can get this virus anywhere just like the sniper could shoot you anywhere,\" Gillespie said.\nBut despite the fear, Gillespie has been documenting the pandemic for his local paper, where he's worked for almost 20 years. When he doesn't have a specific assignment, he drives around looking for moments to capture. Last week, he spotted stuffed animals lined up along fences and was told the neighborhood was having a \"safari\" for the children.\nIn February, Associated Press photojournalist Ted Warren took photos of sports games, a Bernie Sanders rally, Boeing airplanes and a new Amazon grocery store. But since March, his sole focus has been on the coronavirus.\nA pharmacist gives Jennifer Haller, left, the first shot in the first-stage safety study clinical trial of a potential vaccine for COVID-19, the disease caused by the new coronavirus, Monday, March 16, 2020, at the Kaiser Permanente Washington Health Research Institute in Seattle. (Photo by Ted S. Warren/Associated Press)\nWarren said his first coronavirus assignment was a January 22 press conference with Washington state health officials about the response to the first case in the US. He took photos of medical personnel inside a hospital in Everett, Washington, the next day.\n\"As I covered the Seattle Sounders home opener on March 1 — with a particular emphasis on the stadium's new hand sanitizing stations — the COVID-19 story broke wide open, and coronavirus has been nearly 100% of what I've done since,\" Warren said.\n\"I think my first non-virus assignment is scheduled for Sunday or next week,\" Warren added.\nAs Warren continues to document the pandemic, he said he is looking forward to taking photos when social distancing restrictions are lifted.\n\"Hugging people, shaking hands, playing city-park baseball and enjoying normal and healthy life again,\" Warren said. \"That's going to be a great day.\"\nAmerican Statesman photojournalist Lola Gomez contracted the coronavirus and has been hospitalized at St. David's South Medical Center since Tuesday. (Photo by Lola Gomez/Austin American-Statesman)\nThe Statesman's executive editor John Bridges issued a statement to CNN Business on Friday to express his gratitude to Gomez and the journalists and photographers covering the pandemic.\n\"Many people don't appreciate the dangers that journalists, especially photographers, often face in trying to tell the story or capture the moment,\" he said. \"That's especially true when the danger is an invisible one. We likely will never know where Lola came to be infected by the virus, whether it was while doing her job or just in the routine course of everyday life. Regardless, her commitment to documenting the crisis in Austin — and the commitment of journalists and photographers everywhere — deserves our appreciation and thanks.\"\nAlso on Friday, the Statesman published Gomez's first-person account of the days leading up to her illness. She said she had to dictate her story to a colleague from her hospital bed.\n\"I wanted to share my story as a journalist and a human to show no one is exempt from this,\" she said. \"If they don't believe the news, they should at least believe the people who are telling their own stories of suffering with this vicious illness.\"", "url": "https://www.cnn.com/2020/04/03/media/photojournalists-coronavirus/index.html"}