{"authors": ["David Koenig"], "date_download": "2020-05-04 20:28:30", "date_modify": "2020-05-04 20:28:30", "date_publish": "2020-04-14 21:37:45", "description": "The nation’s biggest airlines have tentatively agreed to terms for $25 billion in government aid to pay workers and avoid massive layoffs in an industry that has been slammed by the coronavirus...", "filename": "_f5d598e3acb808ad3c2db2b5dfe30738_1588624110.html", "image_url": "https://storage.googleapis.com/afs-prod/media/5d3b558165d04b8a9b187eb2a34129e5/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f5d598e3acb808ad3c2db2b5dfe30738_1588624110.html", "title": "Major airlines line up to split $25 billion in payroll aid", "title_page": "Major airlines line up to split $25 billion in payroll aid", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Tuesday, April 7, 2020, file photo, Delta flight is shown taking off from Salt Lake City International Airport, in Salt Lake City. Treasury Secretary Steven Mnuchin said Tuesday, April 14, 2020, that the nation's major airlines have tentatively agreed to terms for $25 billion in federal aid to pay workers and keep them employed through September. The deals aren't final, but the assistance is almost certain to be a mix of cash and loans, and the government could take a small ownership stake in the leading airlines. (AP Photo/Rick Bowmer, File)\nFILE - In this Tuesday, April 7, 2020, file photo, Delta flight is shown taking off from Salt Lake City International Airport, in Salt Lake City. Treasury Secretary Steven Mnuchin said Tuesday, April 14, 2020, that the nation's major airlines have tentatively agreed to terms for $25 billion in federal aid to pay workers and keep them employed through September. The deals aren't final, but the assistance is almost certain to be a mix of cash and loans, and the government could take a small ownership stake in the leading airlines. (AP Photo/Rick Bowmer, File)\nThe nation’s biggest airlines have tentatively agreed to terms for $25 billion in government aid to pay workers and avoid massive layoffs in an industry that has been slammed by the coronavirus pandemic.\nThe assistance will include a mix of cash and loans, with the government getting warrants that can be converted into small ownership stakes in the leading airlines.\nTen airlines — including Delta, American, United and Southwest – fell in line after objecting to some of the Treasury Department’s demands. Treasury Secretary Steven Mnuchin said Tuesday that the department would work to finalize the deals and hand over the money as quickly as possible. He said talks were continuing with other carriers.\nThe airlines entered 2020 riding a decade-long hot streak in which together they earned tens of billions of dollars due to strong travel demand. They bought new planes, enriched shareholders, and hired thousands more workers.\nThat streak came to a crashing end in just a few weeks, as governments restricted travel to slow the spread of the new coronavirus, and people feared contracting the illness on a plane. Air travel ground to a near complete halt. Airlines cut thousands of flights, and those that remain often carry just a few passengers.\nWith the payroll grants, airlines and their workers got special treatment in last month’s $2.2 trillion measure designed to help businesses and workers get through the pandemic, which has hit every sector of the economy.\nPresident Donald Trump — perhaps mindful of criticism that the government was bailing out a previously profitable industry — said the deals will support airline workers and protect taxpayers.\n“Our airlines are now in good shape, and they will get over a very tough period of time that was not caused by them,” Trump said.\nThe payroll aid is roughly based on each airline’s spending on wages and benefits from April through September 2019.\nAmerican Airlines said Treasury approved $5.8 billion for the airline — a $4.1 billion grant and a $1.7 billion low-interest loan. CEO Doug Parker called it “fantastic news,” and “we now believe we have the financial resources necessary to help us withstand this crisis.”\nDelta Air Lines said it reached agreement with Treasury for $5.4 billion — a $3.8 billion grant and a $1.6 billion loan. CEO Ed Bastian said that the aid, along with cutting 80% of its schedule and having 35,000 employees agree to voluntary leave, will let Delta operate a minimal schedule for people who must travel.\nAnalysts expected United Airlines to also be eligible for more than $5 billion. United said it expected to complete a final deal with Treasury “in the next few days,” but gave no figures.\nSouthwest Airlines said it expects to get $3.2 billion, including more than $2.3 billion in cash and the balance in an unsecured loan.\nThe airlines had expected to begin receiving federal aid — entirely in cash that didn’t have to be repaid — from the government by April 6, the deadline set by Congress. Instead, they found themselves locked in several days of tense negotiations with the Treasury Department, which insisted that only 70% of the aid should be in cash, with the rest in loans that airlines must repay.\nIn addition, Treasury demanded that to compensate taxpayers, the largest airlines turn over warrants equal to 10% of the loan amounts. They can be exercised at each airline’s closing stock price on April 9. The airlines did not want to give up equity, but they had little leverage in negotiations with Treasury — they desperately wanted the aid.\nDelta said the government will get warrants for about 1% of its stock, and Southwest put Treasury’s warrants at less than 1% of its shares. Others gave no details.\nLast month’s economic-relief package also includes a separate $25 billion program to provide loans to airlines. Analysts expect fewer airlines to take part because they can tap private credit markets. But American said it plans to seek a $4.75 billion government loan, and Alaska Airlines indicated it too will apply under the separate program.\nEven with the federal aid, airlines are likely to emerge slowly and smaller when the pandemic recedes.\n“I don’t think air travel will snap right back to where it was here this year, maybe it will come back next year,” said Southwest CEO Gary Kelly. “If this is a real recession and a bad recession, it could take four or five years.”", "url": "https://apnews.com/f5d598e3acb808ad3c2db2b5dfe30738"}