{"authors": ["Giulia Mcdonnell Nieto Del Rio", "Theresa Waldrop"], "date_download": "2020-05-04 16:11:15", "date_modify": "2020-05-04 16:11:15", "date_publish": "2020-04-03 01:11:39", "description": "A 99-year-old man and nine others were charged in New Jersey with violating the state's ban on gatherings aimed at stemming the spread of coronavirus, officials said.", "filename": "2020_04_02_us_99-year-old-charged-new-jersey-coronavirus_index_1588608675.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402194627-lakewood-new-jersey-police-car-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_us_99-year-old-charged-new-jersey-coronavirus_index_1588608675.html", "title": "99-year-old charged after attending engagement party despite state ban on gatherings", "title_page": "99-year-old charged after attending engagement party despite state ban on gatherings - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A 99-year-old man and nine others were charged in New Jersey with violating the state's ban on gatherings aimed at stemming the spread of coronavirus, officials said.\nThe group was celebrating an engagement in Lakewood, New Jersey, on Tuesday, Ocean County Prosecutor Bradley D. Billhimer and police Chief Gregory Meyer said in a news release\nThe couple hosting the party was also charged with six counts of child endangerment, one count for each of their six minor children who were at the celebration, the prosecutor's office said.\nNew Jersey Gov. Phil Murphy announced a statewide \"stay at home\" order March 21 that prohibits all gatherings, such as celebrations.\n\"Can't believe I have to say this at all, let alone for the second time,\" the governor wrote on Twitter last weekend. \"But here we are. NO CORONA PARTIES. They're illegal, dangerous, and stupid. We will crash your party. You will pay a big fine. And we will name & shame you until EVERYONE gets this message into their heads.\"", "url": "https://www.cnn.com/2020/04/02/us/99-year-old-charged-new-jersey-coronavirus/index.html"}