{"authors": ["Nicole Chavez", "Dakin Andone", "Christina Maxouris"], "date_download": "2020-05-04 16:17:46", "date_modify": "2020-05-04 16:17:46", "date_publish": "2020-04-03 08:00:04", "description": "The US Centers for Disease Control and Prevention is recommending people wear face coverings in public and health officials just reported the most deaths in a single day.", "filename": "2020_04_03_health_us-coronavirus-friday_index_1588609066.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403033822-coronavirus-masks-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_health_us-coronavirus-friday_index_1588609066.html", "title": "US coronavirus: CDC recommends Americans wear face masks voluntarily in public", "title_page": "US coronavirus: CDC recommends Americans wear face masks voluntarily in public - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The US Centers for Disease Control and Prevention is recommending people wear face coverings in public and health officials just reported the most deaths in a single day.\nPresident Donald Trump announced the new guidelines Friday, saying it's a voluntary measure and people should not wear surgical or medical masks.\n\"It's really going to be a voluntary thing,\" he said. \"I'm not choosing to do it.\"\nBut some public health experts at the CDC said they felt \"pressured\" by the White House to draft recommendations and were under \"intense pressure\" to do it quickly, according to a senior federal health official involved in discussions.\n\"The CDC would not have gone this direction if not for the White House,\" the senior official told CNN. \"We would have tried more to understand about asymptomatic transmission. We would have done more studies if we had more time.\"\nUS Surgeon General Jerome Adams told reporters on Friday that officials were not recommending the use of masks to the public because their potential to slow down the spread of the virus was unclear.\nAdams says that now face coverings should be worn especially when distancing protocols can be difficult to maintain.\nEarlier this week, a panel of experts told the White House that research shows coronavirus can be spread not just by sneezes and coughs but also by talking and possibly breathing.\nThe new guidelines are the latest effort by the federal government to counteract the pandemic.\nThe US marked another grim milestone on Friday when health officials reported more than 1,400 deaths in a single day -- the highest daily death toll so far.\nAt least 277,828 people in the US have been infected, and more than 7,400 have died, according to a tally by Johns Hopkins University . Every state but Wyoming has reported deaths.\nTrump won't issue national stay-at-home order\nNearly all Americans are under orders to stay at home Friday after most states have implemented their own in one form or another\nThe federal government has not issued a mandate and Trump continues signaling his resistance to do so.\n\"I leave it up to the governors,\" Trump said.\n\"I don't understand why that's not happening,\" Fauci said during a CNN town hall Thursday. \"If you look at what's going on in this country, I just don't understand why we're not doing that.\"\nNew York will redistribute medical supplies to hospitals in need\nNew York Gov. Andrew Cuomo will sign an executive order allowing the state to take ventilators and medical supplies from institutions that are not using them to relieve medical equipment shortages.\nThe governor is asking upstate hospitals to loan 20% of their unused ventilators to downstate medical facilities struggling to treat the surge of coronavirus patients.\n\"Moreover, when the pandemic wave hits upstate New York, the Governor will ask downstate hospitals for similar help,\" Rich Azzopardi, a senior adviser to the governor, said in a statement. \"We are not upstate or downstate we are one state and we act that way.\"\nThe need for ventilators has grown as the number of coronavirus cases climbs, with more than 102,000 cases and 2,935 deaths in New York as of Friday morning, the governor said. Of those deaths, 562 people died in the last 24 hours -- the biggest single-day increase in deaths.\n\"I'm not going to be in a position where people are dying and we have several hundred ventilators in our own state somewhere else,\" Cuomo said.\nA day earlier, Cuomo said the state has about six days left before it runs out of ventilators.\n\"It's like watching a slow-moving hurricane across the country, where you know the path that it's taking,\" the governor said Thursday. \"Why not deploy the national resources and just stay ahead of the hurricane?\"\nCDC sets advice for returning to normal\nThe US Centers for Disease Control and Prevention recommends communities be evaluated for four consecutive weeks and demonstrate three achievements before starting to return to normal life, according to a senior federal health official who has seen the guidelines submitted to the White House coronavirus task force.\nThose recommendations require communities demonstrate a decrease in cases and deaths; a decrease in Covid-19 associated hospitalizations while keeping the capacity to care for the sick; and the public health capacity to investigate and control the virus.\nJUST WATCHED Here's how the novel coronavirus outbreak unfolded Replay More Videos ... MUST WATCH Here's how the novel coronavirus outbreak unfolded 02:39\nIt's unclear if the White House task force has approved those recommendations or when the measuring of those benchmarks would begin. But they appear to be in line with Trump's announcement this week to extend federal social distancing measures for 30 days.\nCNN has reached out to the CDC about the recommendations multiple times but has not received a response.\nAdditionally, other guidelines submitted to the task force by public health experts include \"no new cases for 14 days\" and \"the ability to detect new clusters\" for certain parts of community life to resume, according to the source.\nThe World Health Organization on Friday warned countries need to be wary of lifting widespread lockdown orders too quickly without a good transition strategy.\n\"We don't want to end up in a cycle of lockdown, followed by release, followed by another lockdown, followed by release,\" said Dr. Mike Ryan, executive director of the WHO's health emergencies program. \"That's not the way forward. And the way to avoid that is we need a transition strategy that gets us back into more control of the virus.\"\nVirus can be spread through breathing, experts say\nColorado Gov. Jared Polis and Pennsylvania Gov. Tom Wolf asked residents of their states to wear masks any time they leave home for essential needs.\n\"Having that as part of our culture here in Colorado and in the United States of America is a really important part of reducing the spread of the virus to save lives and return to a functional economy where people can go to work sooner rather than later,\" Polis told reporters Friday.\nPolis said residents should wear non-medical, cloth face masks or scarves and it should be \"part of everybody's personal hygiene practices.\"\nMasks should not, however, replace social distancing, Fauci said on Fox News' \"Fox & Friends\" Friday.\n\"Because of some recent information that the virus can actually be spread even when people just speak as opposed to coughing and sneezing, the better part of valor is that when you're out and you can't maintain that 6-foot distance to wear some sort of facial covering,\" Fauci said.\n\"So, this is an addendum and an addition to the physical separation,\" he added, \"not a substitute for it.\"\nThe WHO on Friday stood by its recommendation that only individuals who are sick or caring for someone who is sick should wear masks. But Ryan said the organization would support individual countries making their own recommendations.\n\"But that doesn't negate the need for hand-washing. It doesn't negate the need for physical distancing. It doesn't negate the need for people to stay at home if there is a stay-at-home order in place,\" he said.\nNew York City's EMTs face tough decisions\nIn New York, the hardest-hit part of the country, an influx of emergency medical facilities has been aimed at relieving an overwhelmed health system.\nThose include the USNS Comfort , a Navy hospital ship that docked in New York Harbor to treat non-Covid-19 patients. But on Thursday night, reports emerged only 20 patients were on the ship, despite its 1,000-bed capacity. That number grew by two on Friday, a Navy official said.\nAs of Friday, the ship will take patients that are not showing symptoms of Covid-19 and do not have to have been tested, according to a FEMA fact sheet.\nPreviously patients had to have a negative test from their discharging hospital before being brought aboard.\nMayor Bill de Blasio told CNN's John Berman on Friday morning he had spoken to the Navy about the reports and said there was \"no question\" that the number would grow.\n\"I don't have a doubt in my mind, the Comfort's going to be filled up soon,\" the mayor said.\nMeantime, a medical facility set up at Manhattan's Javits Convention Center will now treat Covid-19 patients -- a reversal from its initial purpose of treating non-coronavirus patients.\n\"As it turned out, we don't have non-Covid people to any great extent in the hospitals,\" Cuomo said. \"Hospitals have now turned into, effectively, ICU hospitals for Covid patients, so we wanted to convert Javits from non-Covid to Covid.\"\nMeantime, new guidance offers a grim glimpse into New York City's dire circumstances.\nNew York City Emergency Medical Service (EMS) teams that cannot find or restart a pulse while administering CPR on adult cardiac arrest patients are instructed not to bring those patients to hospitals, according to a memo obtained by CNN and the chair of the regional emergency medical advisory committee familiar with the edict.\nThe new guidance, issued as a temporary change in response to the pandemic, is in place to help prevent the spread of the virus to EMS workers.\n\"In the event a resuscitation is terminated, and the body is in public view, the body can be left in the custody of NYPD,\" the memo states.\nThe city's hospitals, struggling to respond to patients constantly streaming in, have said a shortage of personal protective equipment is putting the medical workers on the front lines at risk of contracting the virus.\nOne third-year resident there said she goes to work feeling \"like a sheep going to slaughter.\"\n\"My colleagues and I are writing our last will and testament. I'm 28 years old,\" Dr. Laura Ucik said. \"We fear that we may not survive this pandemic and yet we show up every day to this hospital to take care of our community. We're running out of (personal protective equipment), we're running out of pain medicine, we're running out of sedatives, we're running out of oxygen masks.\"", "url": "https://www.cnn.com/2020/04/03/health/us-coronavirus-friday/index.html"}