{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:20:56", "date_modify": "2020-05-04 20:20:56", "date_publish": "2020-04-07 21:23:36", "description": "___ Wall Street’s rally fizzles as oil prices suddenly plunge NEW YORK (AP) — A big rally on Wall Street suddenly vanished Tuesday after it got undercut by another plunge in the price...", "filename": "_90458fc6c001f4074b5275471e01615c_1588623656.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_90458fc6c001f4074b5275471e01615c_1588623656.html", "title": "Business Highlights", "title_page": "Business Highlights", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "___\nWall Street’s rally fizzles as oil prices suddenly plunge\nNEW YORK (AP) — A big rally on Wall Street suddenly vanished Tuesday after it got undercut by another plunge in the price of oil. The S&P 500 erased a surge of 3.5% to end the day down 0.2%. The gains faded as the price of U.S. crude oil abruptly flipped from a gain to a steep loss of more than 9%. It dampened what had been an ebullient day for markets worldwide. European and Asian stocks rallied on encouraging signs that the coronavirus pandemic may be close to leveling off in some of the hardest-hit areas of the world.\n___\nComputer issues at SBA said to hold up small business loans\nNEW YORK (AP) — Small business owners hoping for quick help from the government’s emergency $349 billion lending program were still waiting Tuesday amid reports of computer problems at the Small Business Administration. A trade group for community bankers and the CEO of an online lending marketplace say the SBA’s loan processing system stopped working Monday, making it impossible for loans to be processed. It was not known if the system was working Tuesday. The SBA did not respond to requests for an update. Thousands of small businesses are at risk of failure without a cash infusion.\n___\nOnline grocery services struggle to meet spike in demand\nLONDON (AP) — A pandemic forcing everyone to stay home could be the perfect moment for online grocery services. In practice, they’ve been struggling to keep up with a surge in orders, highlighting their limited ability to respond to an unprecedented onslaught of demand. After panic buying left store shelves stripped, many shoppers quickly found online grocery delivery slots almost impossible to come by, too. The problem for many delivery services is ramping up staff to pick goods in shops and deliver. But for Britain’s Ocado, which relies on warehouse robots, significantly increasing deliveries would mean a big investment in new machinery and warehouses that’s too late to catch the demand spike.\n___\nWuhan farmers struggle as crops wither from travel limits\nHUANGPI, China (AP) — Chinese authorities are easing travel controls after declaring victory over the coronavirus, but flowers and some other crops that are deemed nonessential are withering while farmers wait for permission to move them to markets. Despite a campaign by the communist leadership to revive the economy, the bleak situation in Huangpi, in the outskirts of Wuhan, highlights the damage to farmers struggling to keep afloat after the country shut down for two months. Most transportation in and around Wuhan, a city of 11 million people in central China’s Hubei province, was suspended Jan. 23 to fight the coronavirus.\n___\nEarl Graves Sr., founder of Black Enterprise magazine, dies\nNEW YORK (AP) — Earl Graves Sr., who championed black businesses as the founder of the first African American-owned magazine focusing on black entrepreneurs, has died. He was 85. His son said Graves died Monday after a long battle with Alzheimer’s disease. Graves launched his magazine, Black Enterprise, in 1970. He later said his aim was to educate, inspire and uplift his readers, while showing them how to thrive professionally and economically. After gaining an economics degree from Morgan State University, Graves held jobs in law enforcement and real estate before working on Sen. Robert F. Kennedy’s staff. He served on the boards of several major corporations.\n___\nVirus crisis cuts off billions sent to poor around the world\nMIAMI (AP) — The devastation wrought by COVID-19 across the developed world in cutting into the financial lifelines for people in Latin America, Africa and Asia. The World Bank estimates that a record $529 billion was transferred to developing countries through official channels in 2018. Billions more moved unrecorded in cash. Many of those remittances are sent home by people who work in jobs worst affected by the global downtown. With coronavirus shutting down industries, many earners can no longer afford to send their monthly $50, $100 or $200 to Honduras, Somalia or India. The shock waves are pushing their relatives to desperation.\n___\nHackers’ new target during pandemic: video conference calls\nWASHINGTON (AP) — As businesses, schools, churches and others turn to video conference platforms to stay connected amid the global coronavirus pandemic, many have reported being attacked by uninvited guests. The disruptions, dubbed “Zoom-bombing,” have included racist, homophobic and anti-Semitic messages and have drawn the scrutiny of the FBI and other law enforcement agencies. Experts say some of the Zoom-bombing incidents can be attributed to internet trolls who operate without malicious intent. However, extremists have already seized on the coronavirus pandemic as a vehicle to spread their hate and conspiracies.” In response to criticism, Zoom has clarified its privacy policy. But some say the company isn’t doing enough to protect users’ safety.\n___\nThe S&P 500 fell 4.27 points, or 0.2%, to 2,659.41. The Dow Jones Industrial Average slipped 26.13 points, or 0.1%, to 22,653.86. The Nasdaq composite dropped 25.98, or 0.3%, to 7,887.26. The Russell 2000 index of smaller-company stocks rose 0.39 of a point to 1,139.17.", "url": "https://apnews.com/90458fc6c001f4074b5275471e01615c"}