{"authors": ["David Sharp"], "date_download": "2020-05-04 20:11:52", "date_modify": "2020-05-04 20:11:52", "date_publish": "2020-04-16 14:38:00", "description": "PORTLAND, Maine (AP) — Gov. Janet Mills took several actions Thursday aimed at limiting evictions during the conoravirus pandemic that has roiled the economy and left tens of thousands of Mainers...", "filename": "_b26f1319837571eb56f630484bd9e5ca_1588623112.html", "image_url": "https://storage.googleapis.com/afs-prod/media/0ae69f5a87294faa817b3e5bc011fff7/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b26f1319837571eb56f630484bd9e5ca_1588623112.html", "title": "Governor seeks to prevent evictions; jobless claims grow", "title_page": "Governor seeks to prevent evictions; jobless claims grow", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A sign announces a coronavirus closure at a restaurant in Livermore Falls, Maine, Thursday, April 16, 2020. A massive explosion at a paper mill in the neighboring town of Jay, Maine on Wednesday threatens to add further unemployment to a region already hurt by coronavirus-related job losses. (AP Photo/Robert F. Bukaty)\nA sign announces a coronavirus closure at a restaurant in Livermore Falls, Maine, Thursday, April 16, 2020. A massive explosion at a paper mill in the neighboring town of Jay, Maine on Wednesday threatens to add further unemployment to a region already hurt by coronavirus-related job losses. (AP Photo/Robert F. Bukaty)\nPORTLAND, Maine (AP) — Gov. Janet Mills took several actions Thursday aimed at limiting evictions during the conoravirus pandemic that has roiled the economy and left tens of thousands of Mainers jobless.\nAn executive order signed, combined with a previous order by the court system, will prevent the immediate eviction of tenants except those who engage in dangerous conduct, she said.\nIn partnership with MaineHousing, Mills also announced a $5 million relief program for Mainers who cannot pay their rent. The rent relief program allows households that meet certain criteria to receive a one-time payment of $500 paid directly to a landlord, she said.\n“It is my hope that these actions that we’ve taken today will provide some sense of relief, both financially and emotionally, to Maine people struggling to make ends meet. These actions will also help mitigate the spread of the virus by allowing Maine people to stay healthy at home,” she said.\nIn addition, Mills said she sent letters to financial institutions urging them to pause foreclosure proceedings and urged them not to initiate other residential and commercial foreclosures during the pandemic.\nSenate President Troy Jackson praised the governor’s actions. “Making sure that Mainers are able to stay safe in their homes is key to stopping the spread of this virus and saving lives,” he said.\n___\nUNEMPLOYMENT\nUnemployment claims dropped to over 13,400 last week in Maine, roughly half the number from the week before, state officials said.\nAbout 89,500 Mainers have filed for unemployment benefits since the week ending March 15, more than double initial claims for all of 2019, according to the Maine Department of Labor.\nThe coronavirus has caused significant economic hardship for Maine people and job losses across the state.\nAll told, about 13% of Maine workers have claimed benefits in the past month. State officials anticipate another spike when Maine’s unemployment office expands eligibility to include contractors and the self-employed.\n___\nLATEST NUMBERS\nThree more people died from COVID-19, bringing the total to 27, and the number of people who’ve tested positive for the coronavirus approached 800, according to the Maine Center for Disease Control.\nThe increase comes as the state deals with outbreaks at long-term care facilities in Augusta, Scarborough, Belfast, Falmouth and Portland.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and those with other health problems, it can cause more severe illness, including pneumonia, or death.\n___\nPRESCRIPTION WARNING\nTwo licensing boards that govern Maine doctors are warning that prescribing drugs touted by President Donald Trump for themselves or for family members is considered “unprofessional conduct.”\nThe boards also warned that the combination of one of two malaria drugs, chloroquine and hydroxychloroquine, along with the antibiotic azithromycin, should not be prescribed as a preventative measure.\nFor weeks, Trump and others have touted the benefits of the drugs to treat symptoms of COVID-19, the disease caused by the new coronavirus. There have been anecdotal reports that the drugs are helpful, but there are also serious side effects, officials say.", "url": "https://apnews.com/b26f1319837571eb56f630484bd9e5ca"}