{"authors": ["Sara Spary", "Cnn Business"], "date_download": "2020-05-04 16:58:28", "date_modify": "2020-05-04 16:58:28", "date_publish": "2020-04-09 11:40:22", "description": "Emily Maitlis, host of BBC current affairs program Newsnight, criticized UK government officials on Wednesday for their language surrounding the coronavirus.", "filename": "2020_04_09_media_emily-maitlis-bbc-coronavirus-scli-intl-gbr_index_1588611508.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409103353-01-emily-maitlis-grab-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_media_emily-maitlis-bbc-coronavirus-scli-intl-gbr_index_1588611508.html", "title": "BBC's Emily Maitlis slams politicians for saying 'fighters' can survive Covid-19", "title_page": "BBC's Emily Maitlis slams politicians for saying 'fighters' can survive Covid-19 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) Emily Maitlis, host of BBC current affairs program Newsnight, criticized UK government officials on Wednesday for their language surrounding the coronavirus.\nIn a clip that has since been widely shared on social media, Maitlis opened Newsnight on Wednesday by rebuking politicians for implying that those with a \"fighter\" attitude could survive the virus.\nMaitlis said: \"The language around Covid-19 has sometimes felt trite and misleading. You do not survive the illness through fortitude and strength of character, whatever the prime minister's colleagues will tell us.\"\nreferring to language used by UK Foreign Secretary Dominic Raab, who suggested that Prime Minister Boris Johnson — She was likelyreferring to language used by UK Foreign Secretary Dominic Raab, who suggested that Prime Minister Boris Johnson — who is currently being treated in intensive care for Covid-19 — would beat the virus because he is a \"fighter.\"\nMaitlis, who won plaudits for her tough interview last year with Prince Andrew, went on to say the idea the disease was a \"leveler\" between rich and poor was a \"myth.\"\n\"This is a health issue with huge ramifications for social welfare, and it's a welfare issue with huge ramifications for public health.\"\nICYMI: #Newsnight reported on #coronavirus and how the pandemic is widening social and economic divisions\nWATCH 👉 https://t.co/8XTlYwTiSk pic.twitter.com/l167CK8JZV — BBC Newsnight (@BBCNewsnight) April 9, 2020", "url": "https://www.cnn.com/2020/04/09/media/emily-maitlis-bbc-coronavirus-scli-intl-gbr/index.html"}