{"authors": ["Ivana Kottasová"], "date_download": "2020-05-04 15:57:14", "date_modify": "2020-05-04 15:57:14", "date_publish": "2020-04-12 11:00:18", "description": null, "filename": "2020_04_12_world_coronavirus-newsletter-04-12-20-intl_index_1588607834.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_12_world_coronavirus-newsletter-04-12-20-intl_index_1588607834.html", "title": "What you need to know about coronavirus on Sunday, April 12", "title_page": "What you need to know about coronavirus on Sunday, April 12 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story appeared in the April 12 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every weekday\n(CNN) The United States reached a grim milestone yesterday, with more than 20,000 Americans succumbing to Covid-19 . That's more reported deaths than any country in the world.\nAs the toll rises, many are asking what went wrong.\nNew York state has been especially hard hit, recording 8,650 deaths and 181,825 cases, more than any country in the world. The likeliest explanation for the high rates? The inadequate health care provided to New York City's minorities and poor. It's a reality mirrored throughout the country, Kent Sepkowitz writes\nFor the first time in US history, every state is under a federal disaster declaration . And many more Americans will likely die of the virus, but experts say the country should soon start turning the corner. Dr. Chris Murray, director of the Institute for Health Metrics and Evaluation at the University of Washington, says the US likely witnessed a peak in its daily death toll on Friday\nMurray and his team developed a coronavirus model the White House is using to gauge peak levels of cases. There is a caveat, though: The model is based on the assumption that the US maintains social distancing measures through May. If states start lifting restrictions sooner, the numbers \"don't look good,\" Murray said.\nYOU ASKED. WE ANSWERED\nQ: After recovering from Covid-19, do people have long-term immunity to the virus?\nA: It's too early to know for sure. But other coronaviruses, like ones that cause the common cold, might offer clues. With \"common cold coronaviruses, you don't actually have immunity that lasts for very long, and so we don't know the answer with this specific coronavirus,\" said Dr. Celine Gounder, a professor of infectious diseases at the New York University School of Medicine. \"That's actually going to be one of the challenges with designing a vaccine — how do you actually cause the immunity to last long enough to protect you?\"\nMore than 50,000 people have asked us questions about the outbreak. Send yours here . Are you a health care worker fighting Covid-19? Message us on WhatsApp about the challenges you're facing: +1 347-322-0415.\nWHAT'S IMPORTANT TODAY\nA very different Easter Sunday\n\"Do not be afraid, do not yield to fear,\" Pope Francis told followers today , as the world's 1.2 billion Roman Catholics prepare to celebrate Easter Sunday in a very different way.\nReligious leaders are offering messages of hope to mark the holiday . In the United Kingdom, Queen Elizabeth II , the head of the Church of England, reminded people that Easter is a time of \"light overcoming darkness.\"\nPublic health experts have urged people to stay home on Sunday, pointing to the encouraging signs attained through social distancing. But some churches have vowed to defy the orders, forcing officials to take extraordinary measures.\nItalian police have increased lockdown checks during the weekend. In the US, anyone attending a gathering today in Kentucky will be required to quarantine for 14 days. And in a late night decision yesterday, the Kansas Supreme Court banned mass gatherings of 10 or more people.\n'I woke up and couldn't taste or smell'\nLondoner Holly Bourne has not experienced widely recognized coronavirus symptoms like fever, a cough, and shortness of breath. But after she lost her sense of smell , combined with \"weird head rushes,\" headaches and exhaustion, her doctor diagnosed her with Covid-19 over the phone, Sarah Dean reports\nAbsent robust studies, doctors have reported anecdotally that losing the ability to smell may be among the virus's symptoms . But it remains unclear how widespread that symptom is and how long it lasts.\nIRS deposits first wave of stimulus checks\nThe Internal Revenue Service issued an initial wave of stimulus checks yesterday, part of the $2.2 trillion economic relief package that Congress approved in March.\nI'm the quarantine buffer among three generations of my family, all in one house\n\"My mind is either always racing or responding: Do we have milk, does she have a fever, the dog needs a walk, where's Papa's will, is ours updated, time for a team meeting, maybe my throat hurts, Trump's speaking in the Rose Garden, charades on Zoom sound cool, Mama? Mama? Mama??!!\"\nON OUR RADAR\nSoccer star Carli Lloyd says she's had the best training of her career during the pandemic. There's nothing on her schedule, nothing to distract her from the goal of improving.\nLockdowns are boring, exhibit 1,987: To enliven their self-isolation, people around the world are dressing up to take their trash out.\nLaid-off flight attendants in Europe are retraining to help hospitals amid the coronavirus crisis. Airlines say cabin crews' medical emergency training makes them a good fit for clinical support roles.\nWuhan, China is finally emerging from its coronavirus lockdown. For many residents, that means they are finally allowed to bury their dead.\nTOP TIPS", "url": "https://www.cnn.com/2020/04/12/world/coronavirus-newsletter-04-12-20-intl/index.html"}