{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:22:34", "date_modify": "2020-05-04 20:22:34", "date_publish": "2020-04-28 19:08:27", "description": "The renowned medical center said in a since-deleted tweet that it informed the vice president of the masking policy prior to his visit.", "filename": "entry_pence-face-mask-mayo-clinic_n_5ea875c7c5b6550571e96927_1588623754.html", "image_url": "https://img.huffingtonpost.com/asset/5ea87c052200008f0c827cff.png?cache=kj0vdsnxeg&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_pence-face-mask-mayo-clinic_n_5ea875c7c5b6550571e96927_1588623754.html", "title": "Mike Pence Bucks Mayo Clinic's Mandatory Mask Policy During Visit", "title_page": "Mike Pence Bucks Mayo Clinic's Mandatory Mask Policy During Visit | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Vice President Mike Pence on Tuesday opted not to wear a face mask during a visit to the Mayo Clinic’s campus in Minnesota, bucking the organization’s mandatory masking policy amid the pandemic.\nVideo showed Pence, whose face was fully exposed, surrounded by masked staff members and a masked patient while touring the clinic. It wasn’t immediately clear whether the patient was infected with the coronavirus.\nThe Mayo Clinic informed Pence of the masking policy prior to his visit, the organization tweeted Tuesday. The tweet has since been deleted, but the clinic confirmed to HuffPost that it shared the masking policy with the vice president’s office.\nTwitter\nWall Street Journal reporter Gordon Lubold, who was present for the vice president’s visit, tweeted that the clinic made it clear that everyone should wear a mask.\nThe clinic’s website states that all patients, visitors and staff are required to wear a mask on campus in an effort to curb the contagion.\n“Please bring your own face mask or covering to wear,” the website states.\nPence’s office did not respond to HuffPost’s requests for comment.\nPENCE flouts Mayo Clinic policy that everyone on campus wear a mask, even as he meets with staff and a patient. pic.twitter.com/kfo64KQDhU — Dan Diamond (@ddiamond) April 28, 2020\nPence defended his choice, however, while speaking to White House pool reporters Tuesday afternoon.\n“As vice president of the United States, I’m tested for the coronavirus on a regular basis, and everyone who is around me is tested for the coronavirus,” Pence said.\n“And since I don’t have the coronavirus, I thought it’d be a good opportunity for me to be here, to be able to speak to these researchers these incredible health care personnel and look them in the eye and say thank you.”\nBut the masks worn by staff members and patients inside the clinic covered their mouths and noses, not their eyes. What’s more, by not wearing a mask, Pence made himself vulnerable to contracting the virus if anyone around him during the visit was infected with it.\nThe Mayo Clinic tweeted later Tuesday that it was grateful for Pence’s visit.\n“We look forward to continued collaboration to develop essential testing and treatment for our patients and communities,” the clinic said.\nPresident Donald Trump earlier this month announced guidelines from the Centers for Disease Control and Prevention that recommended people wear cloth face masks in public settings where social distancing may be difficult to maintain.\nTrump, however, said that he did not plan to follow the guidance.\n“I don’t think I’m going to be doing it,” Trump said during a news briefing at the White House on April 3. “Wearing a face mask as I greet presidents, prime ministers, dictators, kings, queens — I just don’t see it.”\nDuring an interview Tuesday night on Fox News, White House press secretary Kayleigh McEnany bashed the media for focusing on “mask palace intrigue.”\n“It’s ridiculous. We are all routinely tested for coronavirus in the White House,” McEnany said. “The media obsession with Mike Pence wearing a mask is really just ridiculous.”\nSara Boboltz contributed reporting.", "url": "https://www.huffpost.com/entry/pence-face-mask-mayo-clinic_n_5ea875c7c5b6550571e96927"}