{"authors": ["Mike Householder", "Ed White"], "date_download": "2020-05-04 20:28:41", "date_modify": "2020-05-04 20:28:41", "date_publish": "2020-04-15 15:51:48", "description": "LANSING, Mich. (AP) — Thousands of flag-waving, honking protesters drove past the Michigan Capitol on Wednesday to show their displeasure with Gov. Gretchen Whitmer’s orders to keep people at home...", "filename": "_c968b6cbacce3f0294cacb09e9b64890_1588624121.html", "image_url": "https://storage.googleapis.com/afs-prod/media/69a33adcc25c433d9d908fd9f8815297/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c968b6cbacce3f0294cacb09e9b64890_1588624121.html", "title": "Thousands roil Capitol over Whitmer orders", "title_page": "'Sick and Tired': Thousands roil Capitol over Whitmer orders", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Christopher Merrill protests at the State Capitol in Lansing, Mich., Wednesday, April 15, 2020. Flag-waving, honking protesters drove past the Michigan Capitol on Wednesday to show their displeasure with Gov. Gretchen Whitmer's orders to keep people at home and businesses locked during the new coronavirus COVID-19 outbreak. (AP Photo/Paul Sancya)\nChristopher Merrill protests at the State Capitol in Lansing, Mich., Wednesday, April 15, 2020. Flag-waving, honking protesters drove past the Michigan Capitol on Wednesday to show their displeasure with Gov. Gretchen Whitmer's orders to keep people at home and businesses locked during the new coronavirus COVID-19 outbreak. (AP Photo/Paul Sancya)\nLANSING, Mich. (AP) — Thousands of flag-waving, honking protesters drove past the Michigan Capitol on Wednesday to show their displeasure with Gov. Gretchen Whitmer’s orders to keep people at home and businesses locked during the coronavirus outbreak.\nAs snow fell, others got out of their vehicles and raised signs with messages such as “Gov. Whitmer We Are Not Prisoners” and “Michigander Against Gretchens Abuses.”\nHours later, Whitmer shot back, telling reporters that the rally put health at risk.\nThe “Operation Gridlock” protest was organized by the Michigan Conservative Coalition. The ripples were widely felt: Traffic was barely moving for miles in some areas of Lansing.\n“This arbitrary blanket spread of shutting down businesses, about putting all of these workers out of business, is just a disaster. It’s an economic disaster for Michigan,” coalition member Meshawn Maddock said. “And people are sick and tired of it.”\nWhitmer, a Democrat, extended a stay-home order through April 30 and has shut down schools and businesses deemed non-essential. The governor acknowledged the pain but said the restrictions were necessary to stop the spread of the coronavirus, which causes a respiratory illness that has killed more than 1,900 Michigan residents.\nState police estimated the protest drew 3,000 to 4,000 people, about 150 of whom demonstrated on the Capitol steps or main lawn. No tickets were issued for violations of Whitmer’s orders. Police spokeswoman Shanon Banner said most people on foot were “practicing social distancing.”\nBut Whitmer said she was “really disappointed” to see protesters close together without masks.\n“I saw someone handing out candy to little kids barehanded,” the governor told reporters. “People are flying the Confederate flag, and untold numbers who gassed up on the way here or grabbed a bite on the way home. We know that this rally endangered people. This kind of activity will put more people at risk and, sadly, it could prolong the amount of time we have to be in this posture.”\nDuring the rally, Republican House Speaker Lee Chatfield, who has urged Whitmer to amend her orders, waved an American flag from a window at his Capitol office.\nSeparately, four sheriffs in the northwestern Lower Peninsula called Whitmer’s orders a “vague framework of emergency laws” that are frustrating citizens. Leelanau County Sheriff Mike Borkovich said people don’t understand why they can’t take a child fishing in a motorboat but can use a kayak.\n“We’re trying to keep the peace with people. ... The economy is coming apart in northern Michigan. People are upset,” Borkovich told The Associated Press. “People are frantic to get back to work. They have been very edgy.”\nLATEST NUMBERS\nMichigan’s confirmed cases of the coronavirus rose about 4% to 28,059, the state health department said Wednesday. Deaths from COVID-19, the respiratory illness caused by the virus, increased by 153, or 8%, to 1,921. Both grew at a lower rate than on Tuesday.\nHenry Ford Health System and Beaumont Health, both in southeastern Michigan, reported another drop in COVID-19 patients.\n“The number of patients are down, and the number of patients on ventilators are down significantly,” Detroit Mayor Mike Duggan said of area hospitals.\nDetroit Medical Center said it was laying off 480 workers due to a statewide halt in elective medical procedures and other factors.\nZOOM JUSTICE\nThe Michigan Supreme Court broke new ground by hearing cases by Zoom video conferencing. Justice Brian Zahra was at home with what looked like an Easter basket behind him. Justice David Viviano was the only judge in his regular seat in court.\nJustice Richard Bernstein, perhaps the most loquacious member, had questions for the lawyers as time for a case was winding down in a corner of the screen.\n“Even on Zoom he finds a way” to run out the clock, Chief Justice Bridget McCormack joked.\nCUT AWAY\nSome Detroit-area communities won’t enforce the governor’s ban on private lawn services, The Detroit News reported. Officials see a loophole: The state made an exception to maintain safety and or sanitation.\n“It’s not safe to have rodents. It’s not safe to have blight, which leads to crime,” Warren Mayor Jim Fouts said.\n___\nWhite reported from Detroit. AP reporter David Eggert in Lansing contributed to this story.", "url": "https://apnews.com/c968b6cbacce3f0294cacb09e9b64890"}