{"authors": ["Russ Bynum"], "date_download": "2020-05-04 20:27:40", "date_modify": "2020-05-04 20:27:40", "date_publish": "2020-04-05 21:59:30", "description": "SAVANNAH, Ga. (AP) — A small coastal city in Georgia that thrives on tourism closed its beach, fearing carefree crowds of teenagers and college students posed too great a risk for spreading the...", "filename": "_feecf34f9f49a2436246ef9451a683dc_1588624060.html", "image_url": "https://storage.googleapis.com/afs-prod/media/0d67990e9788417b980fc47e1f1b6fab/2820.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_feecf34f9f49a2436246ef9451a683dc_1588624060.html", "title": "Island mayor battles Georgia governor over virus limitations", "title_page": "Island mayor battles Georgia governor over virus limitations", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Georgia Department of Natural Resources Law Enforcement Division Corporal Barry Britt, right, enforces Gov. Bryan Kemp's order to open the beaches on Tybee Island, Ga., Saturday, April 4, 2020, allowing people to exercise outside, with social distancing of at least six feet because of the coronavirus outbreak. (Stephen B. Morton/Atlanta Journal-Constitution via AP)\nGeorgia Department of Natural Resources Law Enforcement Division Corporal Barry Britt, right, enforces Gov. Bryan Kemp's order to open the beaches on Tybee Island, Ga., Saturday, April 4, 2020, allowing people to exercise outside, with social distancing of at least six feet because of the coronavirus outbreak. (Stephen B. Morton/Atlanta Journal-Constitution via AP)\nSAVANNAH, Ga. (AP) — A small coastal city in Georgia that thrives on tourism closed its beach, fearing carefree crowds of teenagers and college students posed too great a risk for spreading the new coronavirus. Two weeks later, the state’s governor has reversed that decision, saying people weathering the outbreak need fresh air and exercise.\nThe clash has thrust tiny Tybee Island, east of Savannah, into a thorny debate that keeps cropping up during the coronavirus pandemic: How much can officials curtail freedoms during the crisis? And should those calls be made at the federal, state or local level ?\nTybee Island Mayor Shirley Sessions, sworn in barely three months ago, has taken on Gov. Brian Kemp after state officials on Friday reopened the beach in this community of 3,100 people. The beach typically operates with city-funded lifeguards, police patrols and trash cleanup.\nThe change resulted from the Republican governor’s order that people statewide should “shelter in place” — that is, they should stay home unless working jobs deemed essential, seeking medical care, shopping for groceries, or other exceptions including exercising outdoors. It also invalidated any restrictions already imposed by local governments if they went beyond the governor’s limits.\nThat meant a unanimous decision by Tybee Island’s city council to close its beach was suddenly overridden, and Sessions said the governor’s office declined to reconsider when asked. Her blunt, public rebuttal to what she called the governor’s “reckless mandate” drew attention far beyond her small coastal home.\n“As the Pentagon ordered 100,000 body bags to store the corpses of Americans killed by the coronavirus, Governor Brian Kemp dictated that Georgia beaches must reopen,” Sessions said in a statement posted Saturday on the city’s website that was quickly spread on social media and quoted in news stories. Tybee Island mayors are elected in nonpartisan races, and Sessions doesn’t identify as Democrat or Republican.\nKemp noted Sunday on Twitter that state law enforcement officers were monitoring beaches at Tybee Island and elsewhere to ensure crowds weren’t gathering, and that beach traffic appeared sparse. Kemp said “beach gear and parties are prohibited.”\n“Patrols are vigilant so people can get fresh air and exercise while following social distancing rules,” the governor tweeted.\nThe back-and-forth reflects the broader debate in the U.S. about whether severe limitations on people’s movement are necessary, causing unacceptable disruption or even constitutional. Some faith leaders, for instance, have argued that bans on gatherings that applied to services violated religious freedom protections. The American Civil Liberties Union is asking a court to block part of Puerto Rico’s strict curfew, expressing concern about overreach. The Los Angeles County sheriff reversed his decision to shut down firearms dealers after he was sued by gun-rights groups.\nOn Sunday, there were no lifeguards were on duty on Tybee’s beaches, and local officials left in place plywood signs blocking boardwalks and wooden barricades to keep cars out of beachfront parking lots.\n“I would say we’re going to leave them up until somebody takes them down,” Sessions said in a phone interview.\nThe mayor said she doesn’t understand why the state would assert control during the pandemic.\nKemp’s office did not immediately respond to an email Sunday seeking further comment on the governor’s rationale. Kemp’s spokeswoman, Candice Broce, said in a statement Saturday that governor’s staff was in contact with Sessions and would provide resources as needed to enforce social distancing.\nSessions said she’s thinks few people ventured to the beach over the weekend because they weren’t sure whether it was open or closed. She’s concerned that could change. The city moved to shut down the beach after thousands of young people swarmed to the sand and surf as schools and colleges canceled classes.\nLocal officials worried that carefree crowds posed too great a risk for spreading the virus. Still, it was a painful decision for a city that’s typically hungry for spring tourists after the economically lean winter.\n“We are a very high-risk community. We have an older population and two nursing homes. We don’t have a medical facility,” Sessions said. “The sooner we take these actions, the sooner we’ll be able to get back to some type of normalcy.”\nFor most people, the new coronavirus causes mild or moderate symptoms, but for some, especially older adults and people with existing health problems, it can cause more severe illness and lead to death.\nOn Sunday, the Georgia Department of Public Health reported more than 6,600 confirmed infections statewide and 211 deaths. Chatham County, which includes Tybee Island and neighboring Savannah, had more than 80 cases and three deaths.\nAt least one Tybee Island resident is among those infected, Sessions said, as is an officer on the community’s small police force.\nKemp’s order that reopened the beach also lifted a temporary ban Tybee Island had imposed on people checking into vacation rental homes. Sessions said she spotted license plates from New York, New Jersey and other states reeling from the pandemic as she walked the island over the weekend.\nAnd she fears many more visitors will show up for the upcoming Easter weekend.\n“I tell people it’s such a small sacrifice,” said Sessions, who’s still urging people to stay off the beach. “The beach is going to be there in two months. But will we be there to enjoy it?”", "url": "https://apnews.com/feecf34f9f49a2436246ef9451a683dc"}