{"authors": [], "date_download": "2020-05-04 20:12:59", "date_modify": "2020-05-04 20:12:59", "date_publish": "2020-04-15 19:16:49", "description": "CEDAR RAPIDS, Iowa (AP) — Four teenagers linked to a large fight that ended in a shooting at a Cedar Rapids park have been charged with violating Iowa's social distancing rules. The Cedar...", "filename": "_4d1052cc091adf4a33602b219df5a107_1588623179.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4d1052cc091adf4a33602b219df5a107_1588623179.html", "title": "After shooting, 4 cited for violating Iowa ban on gatherings", "title_page": "After shooting, 4 cited for violating Iowa ban on gatherings", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CEDAR RAPIDS, Iowa (AP) — Four teenagers linked to a large fight that ended in a shooting at a Cedar Rapids park have been charged with violating Iowa’s social distancing rules.\nThe Cedar Rapids Police Department said Wednesday that three adult teens and one juvenile were cited for violating the state’s temporary ban on social gatherings larger than 10.\nGov. Kim Reynolds imposed the ban March 17 to stop the spread of the coronavirus.\nThe four are charged with a simple misdemeanor for failing to follow a public health order. Such crimes usually involve a fine of up to $625.\nPolice say the suspects were part of a 20-person fight involving teenagers on the afternoon of April 8 at Bever Park. Police officers responded after several gunshots were fired and found an 18-year-old who had been shot with non-life threatening injuries.\nCedar Rapids police say additional arrests linked to the fight and shooting are expected.\nTwo days before the incident, the governor announced that local police would begin enforcing the ban on social gatherings.\nThe charges in Cedar Rapids could be the first in the state. A spokesman for the Iowa attorney general’s office said his office and the Department of Public Safety weren’t aware of others and aren’t tracking them.", "url": "https://apnews.com/4d1052cc091adf4a33602b219df5a107"}