{"authors": ["Aj Willingham"], "date_download": "2020-05-04 16:25:46", "date_modify": "2020-05-04 16:25:46", "date_publish": "2020-04-07 10:33:10", "description": "Here's what else you need to know to Get Up to Speed and Out the Door.", "filename": "2020_04_07_us_five-things-april-7-trnd_index_1588609546.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200326123140-04-coronavirus-ventilators-wisconsin-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_us_five-things-april-7-trnd_index_1588609546.html", "title": "5 things to know for April 7: Coronavirus, elections, health, terrorism, Pell case", "title_page": "5 things to know for April 7: Coronavirus, elections, health, terrorism, Pell case - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "If your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' newsletter.\nIn case there wasn't enough to deal with in the world right now, radiation levels near the Chernobyl nuclear disaster site have spiked as wildfires rage in the region . Here's what else you need to know to\n(You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily. Sign up here .)\n1. Coronavirus\nUK Prime Minister Boris Johnson is in intensive care after being admitted to the hospital with worsening coronavirus symptoms . The 55-year-old PM has deputized Foreign Secretary Dominic Raab to fill in for leadership duties when necessary. Across the world, most of Japan has entered a state of emergency today , which will last for a month. Prime Minister Shinzo Abe has advised people stay home and practice social distancing. However, Abe is also facing criticism for not activating such measures earlier, as the full global weight of the crisis became clear. Even the tiny South Pacific island nation of Vanuatu is not immune to social complications from coronavirus. The country was just hit by a tropical cyclone, one of the strongest ever on record to reach the island, which has forced the government to lift social distancing measures for those affected\n2. Election 2020\nJUST WATCHED Wisconsin moves forward with voting despite Covid-19 Replay More Videos ... MUST WATCH Wisconsin moves forward with voting despite Covid-19 02:48\nToday's Wisconsin primary will go on after a game of tug-o-war between the state's Gov. Tony Evers, Republican leaders and the state Supreme Court. Evers issued an 11th-hour executive order to delay the election until June, but the state Supreme Court blocked it . The US Supreme Court then reversed a lower court ruling brought into question by Republican leaders that had given voters six more days to turn in their absentee ballots. So, in short, Wisconsin voters without absentee ballots have to go to the polls today, regardless of social distancing orders. Voters with absentee ballots need to send them out today, or their votes won't count. The Supreme Court's decision draws a controversial line in the sand when it comes to other voting disputes , and may make it harder for other states and other elections to give voters options as the pandemic rages on.\n3. Health\nJUST WATCHED The answer to the mask debate may come from Asia Replay More Videos ... MUST WATCH The answer to the mask debate may come from Asia 03:10\n4. White supremacy\nFor the first time in history, the US State Department has named a white supremacist organization as Specially Designated Global Terrorists . The group in question is the Russian Imperial Movement (RIM), which the department describes as \"a terrorist group that provides paramilitary-style training to neo-Nazis and white supremacists.\" The State Department doesn't have the authority to apply such a designation to groups with strong US ties, but said the decision was made to help prevent the group from spreading its ideology and tactics in the country. Officials have warned that the threat of white supremacist terror is on the rise at home and abroad, with several violent incidents making headlines across the world in recent years.\n5. The Vatican\nJUST WATCHED Cardinal George Pell freed after conviction overturned Replay More Videos ... MUST WATCH Cardinal George Pell freed after conviction overturned 01:52\nCardinal George Pell has been freed from prison after Australia's High Court unanimously overturned his conviction on five counts of historical child sex abuse . The decision ends a five-year battle that began when an adult man told police Pell had abused him when he was a child in the 1990s. At the time, Pell was Vatican Treasurer and the highest ranking Catholic official to ever be publicly accused of child sex offenses. Advocates say the decision will be a blow to survivors whose faith in the legal system's response to abuse was bolstered by the verdict. The President of the Australian Catholic Bishops Conference, Archbishop Mark Coleridge also acknowledged that the ruling could be devastating for some.\nBREAKFAST BROWSE\nTwo pandas who hadn't mated for ten years finally did it when their zoo shut down\nAll they wanted as a little privacy and now they're national news\n\"The Fastest Shedder\" is a reality show fighting obesity in Nigeria\nA UK and Irish delivery service is offering \"Seder to Go\" kits for Passover\nDon't worry, you can't get coronavirus from tigers (or any other cat), experts say.\nAt 90, she said her final goodbyes preparing to die from Covid-19. Then, she lived.\nTODAY'S NUMBER\n$800 million\nThat's how much two auto insurers -- Allstate and American Family Insurance -- said they were giving back to their customers because people are driving far less during the coronavirus crisis.\nTODAY'S QUOTE\n\"You'll be pleased to know that we consider both the Tooth Fairy and the Easter Bunny to be essential workers. But as you can imagine, at this time, of course, they're going to be potentially quite busy at home with their family as well and their own bunnies.\"\nNew Zealand Prime Minister Jacinda Ardern, reassuring children that two of their favorite characters could still possibly make their seasonal rounds.\nTODAY'S WEATHER\nJUST WATCHED Severe storms to form from the Great Lakes to Mid-Atlantic Replay More Videos ... MUST WATCH Severe storms to form from the Great Lakes to Mid-Atlantic 01:50\nAND FINALLY\nAlways meet your heroes", "url": "https://www.cnn.com/2020/04/07/us/five-things-april-7-trnd/index.html"}