{"authors": ["Steve Megargee"], "date_download": "2020-05-04 20:29:02", "date_modify": "2020-05-04 20:29:02", "date_publish": "2020-04-20 23:45:03", "description": "The potential challenges inherent in the NFL draft’s virtual format became apparent Monday as Green Bay Packers general manager Brian Gutekunst conducted a conference call with...", "filename": "_6b26561540e0fced1e3f0333d20e8995_1588624142.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b9c020ecef644a95b61c7359208c90f4/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6b26561540e0fced1e3f0333d20e8995_1588624142.html", "title": "Packers GM hopes unique draft doesn't limit trade talk", "title_page": "Packers GM hopes unique draft doesn't limit trade talk", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Feb. 27, 2019, file photo, Green Bay Packers general manager Brian Gutekunst speaks during a press conference at the NFL football scouting combine in Indianapolis. The potential challenges inherent in the NFL draft’s virtual format became apparent Monday, April 20, 2020, as Gutekunst conducted a conference call with reporters. Gutekunst was about to answer a question when a technical issue caused him to get dropped from the call for about a minute. (AP Photo/Michael Conroy, File)\nFILE - In this Feb. 27, 2019, file photo, Green Bay Packers general manager Brian Gutekunst speaks during a press conference at the NFL football scouting combine in Indianapolis. The potential challenges inherent in the NFL draft’s virtual format became apparent Monday, April 20, 2020, as Gutekunst conducted a conference call with reporters. Gutekunst was about to answer a question when a technical issue caused him to get dropped from the call for about a minute. (AP Photo/Michael Conroy, File)\nThe potential challenges inherent in the NFL draft’s virtual format became apparent Monday as Green Bay Packers general manager Brian Gutekunst conducted a conference call with reporters.\nGutekunst was about to answer a question when a technical issue caused him to get dropped from the call for about a minute.\n“Let’s hope that doesn’t happen on Thursday,” Gutekunst quipped.\nGutekunst, who has developed a reputation for his willingness to make draft deals, remains confident the unusual nature of this year’s event will still allow for plenty of trade talk.\nIt just won’t be quite as convenient as usual now that Gutekunst will be working the draft from his home as part of the fallout from the coronavirus pandemic. The draft starts Thursday and runs through Saturday.\n“I don’t think there’s going to be too much of an issue, certainly not from our end,” Gutekunst said.\nDuring Monday’s conference call, Gutekunst broke down how the virtual format could impact any of the Packers’ potential trade negotiations.\nGutekunst said he normally has four or five Packers officials sitting to his right and working the phones throughout the draft. Gutekunst will still be talking to those same people this week, but they won’t be right next to him anymore.\n“I’ll just hear their voices,” Gutekunst said. “I won’t see their facial expressions. Sometimes just hearing their phones ringing and then picking it up, knowing that, hey there’s something there, it’s helpful. Not being able to see that is really the only difference. I’ll have to kind of wait for them to say, ‘Hey, by the way, we’ve got this out there (and) this out there,’ instead of just being able to see the phone ring, seeing them pick it up and knowing something’s going on, on the other end of the line.”\nGutekunst has a history of being active early in a draft.\nHe started the 2018 draft with the No. 14 pick, traded down to No. 27 and then moved back up to the No. 18 spot and took Louisville cornerback Jaire Alexander. Moving down enabled the Packers to get a second first-round pick last year.\nThe Packers had the No. 12 and No. 30 overall selections last year. But after they took Michigan outside linebacker Rashan Gary at No. 12, the Packers moved up nine spots to select Maryland safety Darnell Savage at No. 21 with their second first-round pick. The Packers traded two fourth-round picks to move up to 21.\nGreen Bay has the 30th overall pick in this year’s draft after going 13-3, winning the NFC North and losing to the San Francisco 49ers in the NFC championship game last season. The Packers have at least one pick in each round, including three selections in the sixth and two in the seventh, giving them plenty of flexibility this week.\n“I think we’ll be able to be as aggressive as we need be,” Gutekunst said.\nGutekunst didn’t go into details on how the Packers plan to deal with the logistical issues of this draft but noted he is permitted to have one person with him to handle security and another to handle potential technological issues. Gutekunst said the league’s decision to hold a practice draft Monday helped him prepare for any issues he might face during the actual event.\nHe also noted one potential benefit to come from working a draft at home.\n“It will be neat for my family to be basically in the draft room and be able to hear me,” Gutekunst said. “They’ve rarely seen that or been a part of that. I’m excited for them to kind of see what Dad does, part of what he does anyway. That will be a positive that comes out of this, I think.”\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/6b26561540e0fced1e3f0333d20e8995"}