{"authors": ["Analysis Oliver Darcy", "Cnn Business"], "date_download": "2020-05-04 16:34:13", "date_modify": "2020-05-04 16:34:13", "date_publish": "2020-04-08 03:41:34", "description": "Some of the biggest names in right-wing media are questioning the official Covid-19 death toll. Indeed, they're suggesting the numbers might be inflated in an effort to paint President Trump and/or the crisis in the worst possible light.", "filename": "2020_04_07_media_right-wing_b77b6486a01633be21d724ec164a293b_index_1588610053.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407233354-rush-limbaugh-191221-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_media_right-wing_b77b6486a01633be21d724ec164a293b_index_1588610053.html", "title": "Right-wing media suggests coronavirus death toll is inflated, despite experts saying the opposite", "title_page": "Right-wing media suggests coronavirus death toll is inflated, despite experts saying the opposite - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) A version of this article first appeared in the \"Reliable Sources\" newsletter. You can sign up for free right here.\nSome of the biggest names in right-wing media are questioning the official Covid-19 death toll. Indeed, they're suggesting the numbers might be inflated in an effort to paint President Trump and/or the crisis in the worst possible light. In recent days, a version of this theory has been floated by personalities such as Rush Limbaugh, Mark Levin, Tucker Carlson, Brit Hume, and \"Diamond & Silk.\"\nHume, who previously tweeted that New York's \"fatality numbers are inflated,\" tweeted on Tuesday evening, \"Well Dr. [Deborah] Birx just said it. Anyone in U.S. who dies with Covid-19, regardless of what else may be wrong, is now being recorded as a Covid-19 death.\" (This is not quite what Birx said. She explained that if someone who goes into the hospital to be treated for the virus also \"had a pre-existing condition\" that eventually caused the individual to die, that would be counted as a Covid-19 death.)\nHume later appeared on Carlson's show and offered the same message he did in his tweet. \"There may be reasons people seek an inaccurate death count,\" Carlson replied. The Fox News prime time host added, \"When journalists work with numbers, there sometimes is an agenda.\"\nHume and Carlson are not alone. Levin tweeted Tuesday evening that he has \"suspected this for weeks.\" And Limbaugh, who initially dismissed the coronavirus as the \"common cold,\" said recently, \"It's admittedly speculation, but ... what if we are recording a bunch of deaths to coronavirus which really should not be chalked up to coronavirus?\"\nRead More", "url": "https://www.cnn.com/2020/04/07/media/right-wing-media-coronavirus-death-toll-reliable-sources/index.html"}