{"authors": ["Elizabeth Cohen"], "date_download": "2020-05-04 17:00:17", "date_modify": "2020-05-04 17:00:17", "date_publish": "2020-04-09 00:21:46", "description": "A prestigious scientific panel told the White House Tuesday that it doesn't look like coronavirus will go away once the weather warms up. President Trump has claimed that \"when it gets a little warmer [the virus] miraculously goes away.\"", "filename": "2020_04_08_health_coronavirus-stays-warmer-weather_index_1588611617.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406144729-coronavirus-mask-california-0318-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_health_coronavirus-stays-warmer-weather_index_1588611617.html", "title": "Prestigious scientific panel tells Trump coronavirus won't go away with warmer weather", "title_page": "Prestigious scientific panel tells Trump coronavirus won't go away with warmer weather   - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A prestigious scientific panel told the White House Tuesday that it doesn't look like coronavirus will go away once the weather warms up. President Trump has claimed that \"when it gets a little warmer [the virus] miraculously goes away.\"\nIn their letter to the White House, members of a National Academy of Sciences committee said data is mixed on whether coronavirus spreads as easily in warm weather as it does in cold weather, but that it might not matter much given that so few people in the world are immune to coronavirus.\n\"There is some evidence to suggest that [coronavirus] may transmit less efficiently in environments with higher ambient temperature and humidity; however, given the lack of host immunity globally, this reduction in transmission efficiency may not lead to a significant reduction in disease spread without the concomitant adoption of major public health interventions,\" according to the letter.\nThe letter noted, for example, that a study of the outbreak in China showed that even under maximum temperature and humidity conditions, the virus spread \"exponentially,\" with every infected person spreading it to nearly two other people on average.\nDr. William Schaffner, an infectious disease specialist at Vanderbilt University Medical Center, who is not a member of the NAS committee, said, \"Although we can hope weather will make some contribution to the reduction in transmission, we can't rely on it alone. We have to continue to employ social distancing and other measures to reduce transmission.\"", "url": "https://www.cnn.com/2020/04/08/health/coronavirus-stays-warmer-weather/index.html"}