{"authors": ["On Assignment For Huffpost"], "date_download": "2020-05-04 20:17:37", "date_modify": "2020-05-04 20:17:37", "date_publish": "2020-04-29 09:45:19", "description": "This is what goes into creating a COVID-19 shot that can give us immunity against the virus. (Hint: It's a lot.)", "filename": "entry_why-coronavirus-vaccine-takes-so-long_l_5ea868fbc5b66a3cfefa2a36_1588623457.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8a167250000bb0feb0841.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_why-coronavirus-vaccine-takes-so-long_l_5ea868fbc5b66a3cfefa2a36_1588623457.html", "title": "Why It Takes So Long To Make A Coronavirus Vaccine", "title_page": "Why It Takes So Long To Make A Coronavirus Vaccine | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "As of the end of April, the World Health Organization was tracking 71 coronavirus vaccines in preclinical trials, with five additional candidates already in clinical trials. Given how recently the COVID-19 pandemic began spreading, it might seem promising that there’s already a lot of activity on the immunization front.\nWith so many potential vaccines in testing, you also may wonder why medical experts say it will take at least 12 to 18 months before one is ready to go. If a coronavirus vaccine did make it to market on such a timetable, it would actually be the fastest turnaround in history. Currently, that record belongs to the mumps vaccine, which was approved for use in just four years back in the 1960s. For Ebola, a vaccine took five years to develop.\nMore commonly, the development of a vaccine takes eight to 10 years. Can a COVID-19 vaccine be created any faster? There’s certainly hope, but no certainty.\n“I’d say the 12 to 18 months that’s been bandied about by some experts is realistic, but it’s [also] optimistic,” said James Cutrell, director of the infectious disease fellowship program at the University of Texas Southwestern Medical Center in Dallas. “It is based on the assumption that each phase of trials goes according to plan, with an optimistic time frame at each of those stages.”\nHere’s what goes into each phase of developing a vaccine.\nA vaccine must be rigorously tested before the public gets it.\nWe often think of vaccines as treatments for illness, but they’re not exactly that, said Kelvin Lee, a professor of chemical and biomolecular engineering at the University of Delaware and director of the National Institute for Innovation in Manufacturing Biopharmaceuticals. Vaccines are given to people who are well to keep them from getting sick.\n“It’s very different from developing medicine where someone is ill and you are trying to make them better. In a healthy population, you don’t want the vaccine to have negative consequences,” he said.\nFirst, Lee said, researchers will study the virus and attempt to determine which type of vaccine may work best.\nThere are several kinds of vaccines. Some have a tiny, weakened bit of live virus, which triggers a protective immune response in your body but does not cause the actual illness. Some contain inactive virus that creates a similar response in the body. And some utilize genetically engineered RNA or DNA, which carries “directions” to make the type of protein that can prevent the virus from binding to our cells and making us ill.\nOnce researchers decide which vaccine route they think will work best, they get to testing.\n“This is where time really comes into play,” Lee said. “Even after you do lab tests to make sure it works in the proverbial petri dish, in many cases vaccines will undergo tests in animals to ensure that it’s going to be safe for humans and has the desired response. And then, where it really starts to take time is in the human clinical trials.”\n“It’s very different from developing medicine where someone is ill and you are trying to make them better. In a healthy population, you don’t want the vaccine to have negative consequences.” - Kelvin Lee, director of the National Institute for Innovation in Manufacturing Biopharmaceuticals\nTo roll out a vaccine requires a lot of safety testing. During Phase 1, researchers take a small number of healthy volunteers and test the vaccine for serious side effects, Cutrell explained.\nPhase 2 involves smaller studies looking at efficacy, he said. This includes figuring out the best dosage of the vaccine, the scheduling of dosages if you need multiple ones, and more. Scientists will consider whether the vaccine still appears safe enough and whether the immune response or antibody buildup is great enough to warrant moving on to additional clinical studies.\nIn Phase 3, you will see larger field studies.\n“You would take a susceptible population, vaccinate some while having a control group, and monitor the effect over time and see if there’s any difficulty,” Cutrell said.\nHere, researchers may look for common, short-term side effects and at what dosages those side effects pop up.\n“All that has to be done first, and then if Phase 3 shows the vaccine is safe and effective, that’s when you’d look at licensing,” Cutrell said.\nEven after you have a working vaccine approved by the Food and Drug Administration, it still takes time to mass-produce and distribute it across the country.\nThe goal is to vaccinate huge numbers of people, “so you then develop immunity in the community that would protect against larger outbreaks,” Cutrell said.\nTesting and monitoring ― essentially Phase 4 ― continue even after the vaccine is generally available because it takes time to ensure safety, Lee said. “You don’t know if something bad is going to happen a month later, two months later, a year later.”\nCommon side effects of vaccines include redness and pain at the site of injection and maybe a low-grade fever; side effects like seizures or allergic reactions are extremely rare. But the bottom line is that scientists and doctors aim to develop a vaccine where the protective benefits far outweigh the risks.\nYulia Reznikov via Getty Images\nScientists might be able to create a COVID-19 vaccine faster than normal.\nWhile it’s hard to say when researchers will have a viable vaccine, there are a few factors that could speed up the timeline for this coronavirus vaccine.\nTraditional approaches to creating vaccines ― like the use of chicken eggs ― are proven but not necessarily speedy.\n“You have some newer technologies that some companies are trying to leverage, where they were already prepared to respond to a pandemic,” said Lee. “You can shorten some of that discovery and early development timeline.”\nNewer biotechnology-based methods, sometimes called “cell culture methods,” could make for more rapid development, he said.\nAdditionally, with a pandemic circling the world, American researchers are hardly alone. There’s a global effort to find a viable vaccine.\n“You’ve got private companies and scientists trying to work together on the vaccine. That collaboration can certainly help accelerate the timeline,” Lee said.\nScientists will still want to minimize risks and ensure the safest possible rollout of a vaccine. “But given the outbreak globally and the impact it’s having, I can imagine there are ways to design trials to accelerate testing,” Lee said.\nThere could also be an unconventional study design for the coronavirus vaccine, according to a new report published in the Journal of Infectious Diseases. In place of traditional Phase 3 trials, volunteers at low risk of developing a severe form of COVID-19 ― healthy people without chronic conditions in their 20s, for instance ― might opt in for a “human challenge study.” They could be exposed to the coronavirus, monitored closely and given the best care.\nThis type of study would involve fewer participants and could be done in less time than a traditional Phase 3. Of course, the idea would need to be rigorously discussed beforehand as ethics rules generally forbid deliberately infecting human beings with a serious disease.\nPossible coronavirus treatments are also being developed.\nBesides vaccine trials, researchers are testing potential treatments for COVID-19. Instead of preventing the disease, these aim to make sick people well again.\n“One of the treatments that has gotten a lot of attention is remdesivir, but the data available so far is fairly limited,” Cutrell said. No trials comparing use of the antiviral drug against a control group have been published so far. That said, studies are coming, including a National Institutes of Health clinical trial comparing remdesivir against a placebo.\nThere are also drugs that could potentially address the immune system’s response to the virus.\n“A lot of times patients with this virus get sicker in the second week of their illness ― and it’s not the virus, but the immune system that makes them get quite sick,” Cutrell said. “They experience an exaggerated state of inflammation or ‘cytokine storm.’”\nSome drugs that might dampen the immune system’s effects are currently in clinical trials.\nThen there’s the now-controversial drug hydroxychloroquine, which has “long been used for malaria or inflammatory conditions like rheumatoid arthritis or lupus,” Cutrell said.\nAlthough the drug received a lot of early attention, the studies showing potential benefits for COVID-19 patients have been mostly anecdotal with no control groups to compare against.\n“There are also concerns about safety, including cardiac issues and arrhythmias that give doctors pause,” Cutrell said, noting that the FDA recently advised Americans not to use hydroxychloroquine outside of a hospital setting.\nFinally, COVID-19 might be treatable with convalescent plasma.\n“This is where people who have had the disease and recovered donate plasma, and that plasma is given to someone with an active stage of disease,” Cutrell explained.\nThe antibodies and proteins in that plasma could potentially help someone with COVID-19 recover. (You may be able to donate plasma if you have recovered from the coronavirus.)\n“Before we have effective treatment or vaccine, we will have to behave similarly to South Korea, Singapore or Hong Kong, with widespread access to testing, contact tracing and isolation, quarantining people in cases of potential contact.” - James Cutrell, director of the infectious disease fellowship program at the University of Texas Southwestern Medical Center\nUntil we have a vaccine or meaningful treatment, we need to proceed with caution, ramp up testing and isolate the sick quickly if we hope to get back to some “semblance of normalcy,” Cutrell said.\n“In my opinion, before we have effective treatment or vaccine, we will have to behave similarly to South Korea, Singapore or Hong Kong, with widespread access to testing, contact tracing and isolation, quarantining people in cases of potential contact,” he said. “In doing this, they’ve been able to stave off having large scale epidemics in their country and are allowed to be a little more open than other places where those things are not in place.”\nOf course, those countries have still seen second waves of the virus.\n“That approach requires constant vigilance,” Cutrell acknowledged. But even as scientists and doctors work to develop effective treatments and a vaccine, he said “thoughtful and incremental” strategies can help us move forward to “a period of more normal activities.”", "url": "https://www.huffpost.com/entry/why-coronavirus-vaccine-takes-so-long_l_5ea868fbc5b66a3cfefa2a36"}