{"authors": ["James Griffiths", "Jackie Castillo"], "date_download": "2020-05-04 16:51:36", "date_modify": "2020-05-04 16:51:36", "date_publish": "2020-04-08 03:05:39", "description": "Australian and New Zealand passengers will be evacuated from a stricken Antarctic cruise ship Thursday, after almost 60% of those on board tested positive for the coronavirus.", "filename": "2020_04_07_americas_greg-mo_96ec5b083b677da022ecdee45c130305_index_1588611096.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408102935-greg-mortimer-uruguay-0407-01-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_americas_greg-mo_96ec5b083b677da022ecdee45c130305_index_1588611096.html", "title": "Greg Mortimer cruise ship passengers to be evacuated after almost 60% test positive for coronavirus", "title_page": "Greg Mortimer cruise ship passengers to be evacuated after almost 60% test positive for coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Australian and New Zealand passengers will be evacuated from a stricken Antarctic cruise ship Thursday, after almost 60% of those on board tested positive for the coronavirus.\nThe Greg Mortimer , a cruise liner operated by Australia's Aurora Expeditions, departed March 15 on a voyage to Antarctica and South Georgia. Since the beginning of April , however, the ship has been stuck off the coast of Uruguay , after authorities refused to allow passengers to disembark due to the risk of coronavirus.\nOf the 217 people on board, 128 passengers and crew have now tested positive for the virus.\nSix passengers requiring specialized care have been transferred to medical facilities in Montevideo -- a video posted online by the Uruguayan navy showed them being transferred from ship to ship wearing full protective gear.\nPassengers from Europe and America who have tested positive for coronavirus, however, will have to remain on board until they have a negative test result, after which they may be able to depart via Brazil, Aurora said.\nAll passengers will be retested every two or three days, according to the company's website.\n🔴AHORA: Tercer pasajera británica con síntomas de COVID-19 es embarcada en Lancha \"Isla de Flores\" ⚓️🇺🇾 pic.twitter.com/Rzgl5Q3Xbo — Armada Uruguay (@Armada_Uruguay) April 4, 2020\nIn a statement earlier this month, Aurora said that the ship's doctor had developed a fever, and \"we are organizing a back-up volunteer medic.\" The cruise operator added it had \"formally escalated our request\" to the Uruguayan authorities to allow the ship to dock and passengers to disembark, but it had so far been denied.\nLate Tuesday, the Uruguayan government said it had authorized a medical flight evacuation of New Zealand and Australian passengers aboard the Greg Mortimer for later this week. The passengers will fly to Melbourne on Thursday on a plane chartered by Aurora, where they will undergo a mandated 14-day quarantine before proceeding to their final destinations.\n\"We have been working on charters and flights for all onboard with the aim of disembarking our passengers as soon as possible,\" Aurora said in a statement\n\"While our preferred plan had been to disembark all passengers simultaneously, the nature of the situation and the difficultly in securing flights has meant it is likely that the Australian and New Zealand passengers will leave the vessel before our European (UK included) and North American passengers.\"\nAurora said the chartered Airbus A340 will be specially fitted with medical and quarantine facilities in order to \"ensure the health and safety of all on board.\" The company estimated the cost per passenger of at least $9,300, and said it was in discussions with the Australian government \"for support with this cost as we know that it is not viable for many people.\"\nIan Duddy, the UK's ambassador to Uruguay, said on Twitter that \"we remain in close contact with the Uruguayan government, the cruise operator (and) UK passengers on board the Greg Mortimer.\"\n\"Several passengers have tested positive for Covid-19. We continue to explore ways for passengers to disembark while respecting all health protocols,\" he added.\nThe Uruguayan government did not comment on when or whether passengers would be able to disembark this week.\nA 75-year-old Australian passenger suffering from pneumonia is seen being evacuated from the Greg Mortimer cruise liner to an ambulance in Montevideo on April 3, 2020.\nCruise ships stuck\nMore than a dozen cruise ships have been effectively trapped at sea due to the coronavirus pandemic , as countries refused to allow those carrying infected passengers to dock.\nAustralia's Department of Foreign Affairs and Trade said this month it was in direct contact with 10 cruise ships with around 600 Australian passengers on board.\n\"In most cases, disembarkation cannot occur unless passengers have onward flight arrangements and are able to travel directly to the airport via a so-called sanitary corridor, put in place by host countries,\" DFAT said in a statement.\nThe situation on board the ships rapidly transformed from holiday to misery for passengers, many of whom booked and paid for the journeys long before the virus began spreading late last year.\nJUST WATCHED Big efforts to keep travelers safe from coronavirus Replay More Videos ... MUST WATCH Big efforts to keep travelers safe from coronavirus 03:33\nJay Martinez, a passenger on board the South Pacific cruise liner Norwegian Jewel, told CNN this week that he and his wife had \"hesitations\" about boarding the ship and looked into amending their plans but were told they were locked in.\n\"Up until the day that we left, that was not an option,\" Martinez said. \"And with us having so much money invested into our honeymoon, we had no other choice but to board the ship.\"\nLast month, the Cruise Lines International Association (CLIA), an industry group whose members make up more than 95% of global cruise capacity, suspended operations from US ports for 30 days\nIn a statement, CLIA said about 14% of its fleet, some 30 or so ships, were still at sea. \"Our members are focused on bringing these ships safely back to port as soon as they can,\" it added.", "url": "https://www.cnn.com/2020/04/07/americas/greg-mortimer-cruise-ship-coronavirus-intl-hnk/index.html"}