{"authors": ["Ryan Browne"], "date_download": "2020-05-04 16:17:07", "date_modify": "2020-05-04 16:17:07", "date_publish": "2020-04-03 20:56:53", "description": "The US military is preparing to deploy additional forces to support the coronavirus response, including 15 Army task forces designed to support urban area hospitals dealing with the pandemic, a US defense official told CNN.", "filename": "2020_04_03_politics_us-mili_a6abc43b77dd47b84191703b631e23f3_index_1588609027.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200323021638-02-us-national-guard-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_us-mili_a6abc43b77dd47b84191703b631e23f3_index_1588609027.html", "title": "US military preparing to deploy additional forces to support coronavirus response", "title_page": "US military preparing to deploy additional forces to support coronavirus response - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The US military is preparing to deploy additional forces to support the coronavirus response, including 15 Army task forces designed to support urban area hospitals dealing with the pandemic, a US defense official told CNN.\nThe Navy has placed two additional Navy Expeditionary Medical Treatment Facilities, one active duty and the other drawn from the reserves on \"prepare to deploy orders.\" The Navy earlier sent two of these units to New Orleans and Dallas. They consist of about 450 personnel, including 150 doctors.\nThe location of where the units are being sent has yet to be determined and that decision will be made by FEMA. The official said the units should be ready to deploy in about 72 hours. While the official said that they are expected to go to New York, FEMA will make that decision.\nThe Pentagon later confirmed the deployment of additional forces during a news conference on Friday.\n\"Additional medical capabilities are on the way with upcoming deployments of the US Navy expeditionary medical facilities and US Army Urban Area Medical Task forces,\" Chief Pentagon Spokesman Jonathan Hoffman told reporters.\nRead More", "url": "https://www.cnn.com/2020/04/03/politics/us-military-additional-forces-coronavirus/index.html"}