{"authors": ["Reporter"], "date_download": "2020-05-04 21:10:12", "date_modify": "2020-05-04 21:10:12", "date_publish": "2020-05-01 07:57:45", "description": "\"Hypocrisy must be contagious because it has reached pandemic proportions in the Republican ranks,\" wrote Max Boot in The Washington Post.", "filename": "entry_max-boot-donald-trump-obama-coronavirus_n_5eabcec6c5b6995f13ff09b8_1588626612.html", "image_url": "https://img.huffingtonpost.com/asset/5eabcfae24000099028ea10d.jpeg?cache=tdshnmrgiz&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_max-boot-donald-trump-obama-coronavirus_n_5eabcec6c5b6995f13ff09b8_1588626612.html", "title": "Conservative Columnist Nails GOP With Coronavirus Analogy About Donald Trump", "title_page": "Conservative Columnist Nails GOP With Coronavirus Analogy About Donald Trump | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Conservative columnist Max Boot used an analogy about the coronavirus pandemic to highlight the hypocrisy of President Donald Trump and the GOP in his latest opinion piece for The Washington Post published Thursday.\nBoot contrasted conservatives’ silence on Trump’s boast this week about building “the greatest economy in the history of the world” with their anger over a “far milder” comment that former President Barack Obama made in 2012 about businesses.\nBoot noted how there was “of course, not the faintest flicker of outrage from the right” following Trump’s latest brag:\nThis is, by now, an old story. When you play this game — “What if Obama had done it?” — you quickly realize that most Republican talking heads and politicians are cynical hypocrites who will say anything for partisan advantage. They express no reservations about Trump doing on a much greater scale so many of the things that they bitterly denounced under Obama.\nBoot, who quit the GOP following Trump’s 2016 election victory, suggested that “hypocrisy must be contagious because it has reached pandemic proportions in the Republican ranks.”\n“Trump didn’t start the outbreak, but he is a super-spreader with a viral load of shamelessness,” the columnist concluded. “We need to run further clinical trials but, so far, not even repeated exposure to sunlight has cured this malady. Is there some disinfectant that Republicans can inject?”", "url": "https://www.huffpost.com/entry/max-boot-donald-trump-obama-coronavirus_n_5eabcec6c5b6995f13ff09b8"}