{"authors": [], "date_download": "2020-05-04 20:09:08", "date_modify": "2020-05-04 20:09:08", "date_publish": "2020-04-09 18:39:49", "description": "PORTLAND, Ore. (AP) — Initial unemployment claims in Oregon have spiked to more than a quarter-million in the past three weeks due to the coronavirus, state officials said Thursday. The...", "filename": "_c103b8fd22dff9cb2772ecd2fd6a380e_1588622948.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c103b8fd22dff9cb2772ecd2fd6a380e_1588622948.html", "title": "OSU delays graduation; state jobless claims soar amid COVID", "title_page": "OSU delays graduation; state jobless claims soar amid COVID", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Ore. (AP) — Initial unemployment claims in Oregon have spiked to more than a quarter-million in the past three weeks due to the coronavirus, state officials said Thursday.\nThe Oregon Employment Department has received 269,000 initial claims for jobless benefits. For comparison, net job losses in Oregon totaled 147,800 for the duration of the Great Recession.\nThe agency paid $28 million in benefits to Oregonians the week of March 29. The leisure and hospitality sector, which includes hotels and restaurants, continued to see the greatest number of initial claims for unemployment benefits.\nAmid the economic turmoil, Oregon State University said Thursday that it will postpone its commencement ceremonies at its Corvallis and Bend campuses for the first time in its history.\nThe university surveyed graduating students and staff and there was overwhelming support for a postponement, possibly until the fall, OSU said in a statement.\n“This was not an easy decision to make,” OSU President Ed Ray said. “Postponing commencement to a healthier time is the right choice and is strongly supported by our students. And this decision acknowledges that OSU has never cancelled commencement in its history.”\nThe Oregon Health Authority on Thursday reported six more deaths from COVID-19, raising the state’s death toll to 44. The agency also reported 83 new cases, bringing the state total to 1,321.", "url": "https://apnews.com/c103b8fd22dff9cb2772ecd2fd6a380e"}