{"authors": ["Mauricio Savarese"], "date_download": "2020-05-04 21:09:23", "date_modify": "2020-05-04 21:09:23", "date_publish": "2020-04-20 17:50:27", "description": "SAO PAULO (AP) — Four days after firing his health minister amid the coronavirus pandemic, Brazilian President Jair Bolsonaro said Monday he wants social isolation policies to end nationwide this...", "filename": "_87ccd8d3322bd1e779cf17e93e8e50b6_1588626563.html", "image_url": "https://storage.googleapis.com/afs-prod/media/d56c02cd1970423598db3bf7339b6ebf/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_87ccd8d3322bd1e779cf17e93e8e50b6_1588626563.html", "title": "Brazil's Bolsonaro seeks end to social isolation measures", "title_page": "Brazil's Bolsonaro seeks end to social isolation measures", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Brazil's President Jair Bolsonaro speaks to supporters during a protest in front the army's headquarters during the Army day, amid the new coronavirus pandemic, in Brasilia, Brazil, Sunday, April 19, 2020. Bolsonaro came out in support of a small protest Sunday that defended military intervention, infringing his own ministry's recommendations to maintain social distancing and prompting fierce critics. (AP Photo/Andre Borges)\nBrazil's President Jair Bolsonaro speaks to supporters during a protest in front the army's headquarters during the Army day, amid the new coronavirus pandemic, in Brasilia, Brazil, Sunday, April 19, 2020. Bolsonaro came out in support of a small protest Sunday that defended military intervention, infringing his own ministry's recommendations to maintain social distancing and prompting fierce critics. (AP Photo/Andre Borges)\nSAO PAULO (AP) — Four days after firing his health minister amid the coronavirus pandemic, Brazilian President Jair Bolsonaro said Monday he wants social isolation policies to end nationwide this week despite commitments by many states to maintain such policies.\nNearly all Brazilian states have stay-at-home measures in place, some slated to extend until the middle of May. The country’s top court has already ruled governors and mayors can decide on social isolation measures regardless of the federal government’s position. Bolsonaro, meanwhile, wants a quick reopening to stop the deterioration of Brazil’s faltering economy.\n“Everything done in excess ends up bringing problems. These measures did not reach their goal in some states,” Bolsonaro told journalists in front of the presidential residence in Brasilia. “I hope this is the last week of this quarantine, of this way of fighting the virus.”\nThe Brazilian president favors a less restrictive model in which only those in high-risk groups would be quarantined at home until the end of the outbreak.\nAfter Bolsonaro replaced critic Luiz Henrique Mandetta with Nelson Teich as health minister, several governors and mayors said they were considering even stricter isolation measures in an effort to curb the spread of the new coronavirus.\nTeich previously published an article defending quarantine policies, but he has not spoken to the press since a vague introduction speech on Friday and it is unclear what he will do on the job.\nOn Monday evening, Brazil’s health ministry shared a video in which Teich says there will be “a progressive, structured and planned exit from social isolation.” He also promised to raise the country’s capacity of testing from promised 24 million in the next weeks to up to 46 million.\nBrazil confirmed 113 deaths of COVID-19 in the last 24 hours, putting the country’s total at 2,575. More than 40,000 people have contracted the disease in the South American nation, the highest figure in Latin America.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.\nBolsonaro’s comments came one day after he met outdoors with dozens of supporters who want the closing of the country’s congress and supreme court. His presence in such demonstration is drawing widespread repudiation in a nation that endured a military dictatorship between 1964 and 1985.\nThe Brazilian president denied he was attacking the country’s democracy at the protest, but said: “I am actually the constitution.”", "url": "https://apnews.com/87ccd8d3322bd1e779cf17e93e8e50b6"}