{"authors": [], "date_download": "2020-05-04 20:19:23", "date_modify": "2020-05-04 20:19:23", "date_publish": "2020-04-17 22:44:03", "description": "EVANSVILLE, Ind. (AP) — A southwestern Indiana hospital began fitting newborns with tiny plastic face shields to protect them from the coronavirus. Berry Global, the Evansville-based plastic...", "filename": "_62b58bb8c3811ba2ac9db8d3b79350b4_1588623563.html", "image_url": "https://storage.googleapis.com/afs-prod/media/59031226a085418ea5b735970a7c2422/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_62b58bb8c3811ba2ac9db8d3b79350b4_1588623563.html", "title": "Indiana hospital gets baby face shields for virus protection", "title_page": "Indiana hospital gets baby face shields for virus protection", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this April 14, 2020, photograph provided by Deaconess Women's Hospital, in Evansville, Ind., an infant recently delivered at the hospital and identified only as \"Baby Brooklyn\" by hospital officials, wears a plastic face shield as a protection against COVID-19. The scaled-down face shields are being produced by Evansville-based plastic packaging manufacturer Berry Global to protect infants from the coronavirus. As of Wednesday, April 15, 2020, the hospital said it had begun using about 10 of the shields on infants. (Lindsey Johnson/Deaconess Women's Hospital via AP) In this April 14, 2020, photograph provided by Deaconess Women's Hospital, in Evansville, Ind., an infant recently delivered at the hospital and identified only as \"Baby Brooklyn\" by hospital officials, wears a plastic face shield as a protection against COVID-19. The scaled-down face shields are being produced by Evansville-based plastic packaging manufacturer Berry Global to protect infants from the coronavirus. As of Wednesday, April 15, 2020, the hospital said it had begun using about 10 of the shields on infants. (Lindsey Johnson/Deaconess Women's Hospital via AP)\nEVANSVILLE, Ind. (AP) — A southwestern Indiana hospital began fitting newborns with tiny plastic face shields to protect them from the coronavirus.\nBerry Global, the Evansville-based plastic packaging company, delivered a working prototype to Deaconess Women’s Hospital on Tuesday. The next day the hospital begun using the shields. They expect to have around 100 on hand.\n“I can’t believe how fast they picked up on the idea and had something for us to try,” CEO Chris Ryan told the Evansville Courier & Press .\nRyan explained they are doing anything possible to shield babies from exposure to the virus, given that newborns are susceptible to airborne germs when they travel around the hospital in an open bassinet for routine postnatal procedures.\n“We’d rather err on the side of being more cautious than not,” she said.\nBerry has also adapted the shield design to fit toddlers and younger children.\n“We have a few different sizes now based on the child’s age,” Ryan said. “Sometimes the younger kids will have difficulty keeping the masks on, so this gives us that extra layer of protection.”\nPrior to the request for baby and child-sized shields, Berry had ramped up production of adult-sized shields to about 150,000 per week. They now have started fulfilling requests from the Tri-State and are starting to distribute outside the local area.", "url": "https://apnews.com/62b58bb8c3811ba2ac9db8d3b79350b4"}