{"authors": ["Reporter"], "date_download": "2020-05-04 20:04:05", "date_modify": "2020-05-04 20:04:05", "date_publish": "2020-05-04 19:52:01", "description": "Its ships, which were a notable breeding ground for COVID-19, could head to sea just days after the CDC \"no sail\" order expires.", "filename": "entry_carnival-cruises-resume-us-trips-summer_n_5eb05679c5b614b5c49b8f14_1588622645.html", "image_url": "https://img.huffingtonpost.com/asset/5eb060ce250000de13eb0d88.jpeg?cache=yasbtqox1h&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_carnival-cruises-resume-us-trips-summer_n_5eb05679c5b614b5c49b8f14_1588622645.html", "title": "Carnival Says It Plans To Resume U.S. Cruises By Midsummer", "title_page": "Carnival Says It Plans To Resume U.S. Cruises By Midsummer | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Carnival Cruise Line, one of the world’s largest cruise companies, announced Monday that it plans to resume North American trips in midsummer with a very limited fleet.\nStarting Aug. 1, the company is preparing to end its freeze on trips during the coronavirus pandemic, with eight ships embarking on cruises out of Miami, Port Canaveral in central Florida and Galveston, Texas.\n“We are committed to supporting all public health efforts to manage the COVID-19 situation,” Carnival, which is incorporated offshore in Panama, said in a statement. “We are taking a measured approach, focusing our return to service on a select number of homeports where we have more significant operations that are easily accessible by car for the majority of our guests.”\nThe planned date to resume cruises falls just a week after the Centers for Disease Control and Prevention’s “no sail” order expires on July 24. However, the expiration date has been extended before, so there’s no guarantee that Carnival’s ships will actually be able to sail on Aug. 1.\nImportant update regarding our sailings: You can also view the latest list of impacted sailings here: https://t.co/ZNUqjhnYhq pic.twitter.com/qi13s72uie — Carnival Cruise Line (@CarnivalCruise) May 4, 2020\nCruise ships and their close quarters have proven to be a significant breeding ground for the coronavirus. A Carnival-owned Diamond Princess cruise ship that was quarantined at a port in Japan for weeks saw more than 700 confirmed COVID-19 cases and as many as 14 deaths. It was the first significant outbreak of the virus outside China.\nCarnival has come under intense scrutiny for not acting fast enough to curtail the virus’s spread. But President Donald Trump is a close friend of Carnival chairman Micky Arison, whose company was a key sponsor of the Trump reality show “The Apprentice.” Even though the company is based in Panama and pays almost no U.S. federal income taxes, Trump named Arison to his back-to-work advisory council last month.\nTravel experts are divided on whether cruise ships will ever be able to resume business as usual given the stigma of the coronavirus. While some note cruising’s extremely loyal customer base, others say that won’t be enough.\n“Cruises won’t go away, but they will never return to normal,” Konrad Waliszewski, co-founder and CEO of the travel app TripScout, told HuffPost last month. “You can’t have the world commonly refer to you as ‘a floating cesspool’ and ever think you’ll thrive in a post-pandemic world. Destinations were already starting to push back on cruises because of overtourism, and this will only accelerate that.”\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/carnival-cruises-resume-us-trips-summer_n_5eb05679c5b614b5c49b8f14"}