{"authors": ["Dave Kolpack"], "date_download": "2020-05-04 20:05:59", "date_modify": "2020-05-04 20:05:59", "date_publish": "2020-04-06 16:38:04", "description": "FARGO, N.D. (AP) — North Dakota Gov. Doug Burgum issued an order Monday calling for tighter quarantine measures, after announcing the state's fourth death due to the coronavirus. The victim...", "filename": "_0fe2e807aab5d275b28f2561bb526faf_1588622759.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0fe2e807aab5d275b28f2561bb526faf_1588622759.html", "title": "North Dakota reports 4th COVID-19 death; cases up to 225", "title_page": "North Dakota reports 4th COVID-19 death; cases up to 225", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FARGO, N.D. (AP) — North Dakota Gov. Doug Burgum issued an order Monday calling for tighter quarantine measures, after announcing the state’s fourth death due to the coronavirus.\nThe victim was a man in his 70s from Emmons County who had underlying health conditions. He contracted the virus through community spread, Burgum. The death was not included in Monday’s update showing the case count at 225, up 18 from the previous day.\nBurgum’s directive calls for anyone who tests positive for COVID-19 to self-isolate for no less than 14 days. It also requires anyone who lives with someone who tests positive to self-quarantine for two weeks. People who violate the order could be charged with a Class B misdemeanor and face a $1,500 fine.\nBurgum has not issued a statewide stay-at-home order. He said the current “state managed, locally executed, federally supported” plan is the best approach right now, rather than a mandate. He has shut down bars, restaurants, health clubs, movie theaters and beauty salons.\nA second order signed Monday suspends visitation and non-essential services to long-term care facilities.\n“We do this because we’re trying to save lives,” Burgum said. “There are many other states that have had deadly outbreaks in nursing homes. So far we’ve been very fortunate here.”\nAlthough Burgum said the state is currently well-positioned with hospital beds, he noted that the U.S. Army Corps of Engineers has identified 10 potential sites for temporary hospitals if needed.\n“It’s our job to prepare for the worst so we will keep doing that as well,” the governor said.\nThe testing count went over 7,000 on Sunday. Burgum said that nearly 800 people were screened during a pilot project for drive-through testing on Saturday at two small western North Dakota towns.\nWhile officials have encouraged residents to enjoy the outdoors as long as they’re taking social distancing measures, the virus has impacted one of the state’s favorite activities The North Dakota Game and Fish Department on Monday postponed all fishing tournaments for April and May and could extend the order through October depending on COVID-19 conditions.\nThe department announced earlier it was canceling the paddlefish snagging harvest season. Paddlefish snaggers typically concentrate in large numbers in a small area, officials said.", "url": "https://apnews.com/0fe2e807aab5d275b28f2561bb526faf"}