{"authors": ["Jeremy Diamond", "Chandelis Duster"], "date_download": "2020-05-04 16:26:35", "date_modify": "2020-05-04 16:26:35", "date_publish": "2020-04-07 11:40:40", "description": "President Donald Trump's trade adviser Peter Navarro fired off an internal flare at the White House in late January, warning in a memo that the coronavirus could become a \"full-blown pandemic,\" risking trillions of dollars in economic losses and the health of millions, a source familiar with the memo confirmed to CNN.", "filename": "2020_04_07_politics_peter-n_4ebe295f07c50d11cbc35264f873e12d_index_1588609595.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191024090436-peter-navarro-0924-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_peter-n_4ebe295f07c50d11cbc35264f873e12d_index_1588609595.html", "title": "Navarro warned White House in late-January memo that coronavirus could become 'full-blown pandemic'", "title_page": "Peter Navarro warned White House in late-January memo that coronavirus could become 'full-blown pandemic' - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) President Donald Trump's trade adviser Peter Navarro fired off an internal flare at the White House in late January, warning in a memo that the coronavirus could become a \"full-blown pandemic,\" risking trillions of dollars in economic losses and the health of millions, a source familiar with the memo confirmed to CNN.\nIn the late January memo, Navarro pushed for a travel ban on China -- something he and other officials had begun lobbying for weeks earlier -- and \"aggressive\" containment efforts.\nLess than a month later, as Trump continued to downplay the threat, Navarro wrote a second memo and warned that the risk of a pandemic was rising and urged the White House's coronavirus task force to secure billions in supplemental spending, according to two sources familiar with the second memo. The sources confirmed the authenticity of both memos, which were first reported by The New York Times and Axios\nIn the first memo, Navarro warned of a worst-case scenario in which a half-million Americans could die. In the second, he warned the risk was growing to imperil the loss of 1.2 million lives.\nNavarro was not the only White House official firing off early warnings and many public health experts were voicing concerns at the time of both memos.\nRead More", "url": "https://www.cnn.com/2020/04/07/politics/peter-navarro-warned-white-house-coronavirus-nyt/index.html"}