{"authors": ["Regina Garcia Cano"], "date_download": "2020-05-04 20:16:55", "date_modify": "2020-05-04 20:16:55", "date_publish": "2020-04-07 14:08:46", "description": "A Baltimore police sergeant is under investigation after a video shared on social media appears to show him coughing toward a woman at a public housing complex amid the coronavirus pandemic, ...", "filename": "_c6e9e4998c49b3aa274558d3ddffb70f_1588623415.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c6e9e4998c49b3aa274558d3ddffb70f_1588623415.html", "title": "Baltimore police sergeant investigated for coughing video", "title_page": "Baltimore police sergeant investigated for coughing video", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Baltimore police sergeant is under investigation after a video shared on social media appears to show him coughing toward a woman at a public housing complex amid the coronavirus pandemic, officials said Tuesday.\nThe profanity-laced video shows the sergeant coughing without covering his mouth as he passes the woman recording it and at least two other people. The woman calls out the officer, who is white, and others begin to yell.\n“After watching the full video, it its entirety, it is not only disturbing, but incomprehensible, especially considering the high-level of strong and clear guidance that we have provided from the beginning, regarding COVID-19,” Baltimore Police Commissioner Michael Harrison said in a statement. “Members are always expected to be sensitive and professional to the community, but what we saw in the video is alarming because this pandemic is affecting lives not only nationally, worldwide, but right here in our own police department.”\nThe department’s bureau of public integrity is conducting the investigation and has reviewed the video and footage from the camera worn by the sergeant.\nThe video surfaced a day after a Baltimore police station reopened after it was sanitized because an officer tested positive for the new coronavirus, with more than 90 officers there cleared to return to work.\nThe Southwest District station and all of its cars were sanitized over the weekend after police learned that one of their own was infected.\nThe confirmed case is one of 10 among Baltimore police employees, including eight officers and two civilians; across the department, 120 other officers remained self-quarantined as of Monday, according to a police statement .\nThe department tested all Southwest District employees and had them isolate pending results. Forty of them were still waiting for test results or medical evaluations on Monday, the department said.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough, and the vast majority survive. But for others, especially older adults and people with existing health problems, it can be more severe, causing even pneumonia or death.\n__\nFollow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/c6e9e4998c49b3aa274558d3ddffb70f"}