{"authors": ["Reporter"], "date_download": "2020-05-04 20:26:01", "date_modify": "2020-05-04 20:26:01", "date_publish": "2020-04-29 23:36:23", "description": "The conservative commenter said Wednesday that an 81-year-old dying of the coronavirus \"is not the same thing\" as a younger person dying from it.", "filename": "entry_ben-shapiro-coronavirus-death-panel_n_5ea9f706c5b6dac085f52a6f_1588623961.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9f8013000005d12155267.jpeg?cache=8dt9l5tehr&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_ben-shapiro-coronavirus-death-panel_n_5ea9f706c5b6dac085f52a6f_1588623961.html", "title": "Ben Shapiro Suggests Older People Dying Of COVID-19 Is 'Tragic,' But Also Not So Bad", "title_page": "Ben Shapiro Suggests Older People Dying Of COVID-19 Is 'Tragic,' But Also Not So Bad | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Conservative commentator and abortion opponent Ben Shapiro once said he wouldn’t even consider aborting Baby Hitler if he had the chance.\nBut based on an interview Shapiro had on Tuesday with political commentator Dave Rubin, maybe your grandma’s life isn’t that worthy of saving.\nShapiro noted that one of the effects of lifting stay-at-home orders in different states is that more people will get COVID-19, but “nobody just wants to say the obvious truth.”\nAccording to Shapiro, that “obvious truth” is that everyone is making “actuarial deductions about what are the costs” in human lives of lifting lockdown orders.\n“If somebody who is 81 dies of COVID-19, that is not the same thing as somebody who is 30 dying of COVID-19,” Shapiro said (ignoring the fact that 30-year-olds can and do die from the virus as well). “If this were killing children, everyone would be in lockdown forever. That’s the reality.”\nMeanwhile, “If grandma dies in a nursing home at age 81, that’s tragic and it’s terrible; also, the life expectancy in the United States is 80,” Shapiro said.\nYou can see his comments here.\nBen Shapiro: \"If somebody who is 81 dies of COVID-19, that is not the same thing as somebody who is 30 dying of COVID-19...If grandma dies in a nursing home at age 81, that's tragic and it's terrible, also the life expectancy in the United States is 80\" pic.twitter.com/L2UJi95OUN — Jason Campbell (@JasonSCampbell) April 29, 2020\nHuffPost reached out to Shapiro, but no one immediately responded.\nHowever, Twitter users noticed that Shapiro’s comment seemed to contradict his previous statements about the value of human life.\nRepro advocates: Pregnant folks should be able to make their own choices.\nBen Shapiro: MURDERERS!!!\nPeople: We need to take steps to help older folks who are vulnerable in this crisis.\nBen Shapiro: Listen, there's a calculus for valuing \"life\". In this essay, I will... — Charlotte Clymer 🏳️‍🌈 (@cmclymer) April 29, 2020\nBen Shapiro, 2017: \"A first-trimester fetus has moral value... more value than just a cluster of cells. If left to its natural processes, it will grow into a baby. The real question is, where do you draw the line?\"\nBen Shapiro, 2020: Your grandmother should be dead already. https://t.co/kRs9EbiCqu — Steve Silberman (@stevesilberman) April 29, 2020\nRemember when Ben Shapiro said he was so pro-life he wouldn't kill baby Hitler? https://t.co/vvN6os6fDk — Public Citizen (@Public_Citizen) April 29, 2020\nthe idea that bureaucrats were going to be making decisions about the value of human life based on actuarial tables, in the form of \"death panels,\" is something that ben shapiro was very, very against not that long ago https://t.co/SaJar159nO — Christopher Hooks (@cd_hooks) April 29, 2020\nSome people were surprised it took Shapiro so long to get to this opinion.\nI have to admit I thought it would take longer than a month for the right to reach the point of “the useless old people must die to give the young Übermenschen elbow room.” https://t.co/Eed8T4IOue — Charles Johnson (@Green_Footballs) April 29, 2020\nOthers? Not so much.\nRemember this next time they claim \"All Lives Matter\" or that they are \"Pro Life.\"\nThey never believed that. Now they're just saying the quiet part loud.#COVID19 https://t.co/f2e2lhfbkv — Qasim Rashid for Congress (@QasimRashid) April 29, 2020\nPeople like this love to use words like \"tragic\" and \"terrible\" hastily, and only while on their way to a different destination, as if they're glancing briefly at actual human feeling while speeding past it in a limo with the windows rolled up. https://t.co/dw5T4MAzEn — Mark Harris (@MarkHarrisNYC) April 29, 2020\nSome people tried to gently suggest that it might actually be possible to give COVID-19 patients decent medical treatment.\nWhat if I told you that it didn’t need to be a choice and in South Korea they can save both the 80year olds and the 30 year olds — Molly Jong-Fast🏡 (@MollyJongFast) April 29, 2020", "url": "https://www.huffpost.com/entry/ben-shapiro-coronavirus-death-panel_n_5ea9f706c5b6dac085f52a6f"}