{"authors": ["Dakin Andone", "Gregory Lemos"], "date_download": "2020-05-04 16:10:30", "date_modify": "2020-05-04 16:10:30", "date_publish": "2020-04-02 17:39:43", "description": "Tekashi 6ix9ine was released from federal prison Thursday after his attorney said the rapper's asthma made him vulnerable to the novel coronavirus.", "filename": "2020_04_02_us_tekashi-6ix9ine-coronavirus-release-trnd_index_1588608630.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402110037-tekashi-6ix9ine-file-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_us_tekashi-6ix9ine-coronavirus-release-trnd_index_1588608630.html", "title": "Tekashi 6ix9ine will serve the rest of his sentence at home because of coronavirus risk", "title_page": "Tekashi 6ix9ine will serve the rest of his prison sentence at home because of coronavirus risk - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Tekashi 6ix9ine was released from federal prison Thursday after his attorney said the rapper's asthma made him vulnerable to the novel coronavirus.\nThe rapper, whose real name is Daniel Hernandez, will serve the rest of his sentence at home, his defense attorney Lance Lazzaro told CNN.\nHis release comes about four months before Hernandez would have completed his 2-year sentence. He was sentenced late last year on charges related to gang activity in New York, but received a reduced sentence after cooperating with federal investigators and informing on his former gang associates.\nThe rapper is not the only inmate to be released amid the coronavirus pandemic.\nIn recent weeks, there's been a national push for the release of at-risk inmates as the number of coronavirus cases grows inside correctional facilities. US Attorney General William Barr directed leaders of the federal prison system late last month to increase home confinement for some inmates\nRead More", "url": "https://www.cnn.com/2020/04/02/us/tekashi-6ix9ine-coronavirus-release-trnd/index.html"}