{"authors": ["Opinion Julia Hobsbawm"], "date_download": "2020-05-04 17:03:54", "date_modify": "2020-05-04 17:03:54", "date_publish": "2020-04-10 21:59:23", "description": "Controversial as he is, the British people have united in concern for their Prime Minister's health during his hospitalization with Covid-19, writes Julia Hobsbawm", "filename": "2020_04_10_opinions_uks-con_2378a87d64a661a56f4503eeb67d34a3_index_1588611834.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407115220-boris-johnson-support-message-0407-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_opinions_uks-con_2378a87d64a661a56f4503eeb67d34a3_index_1588611834.html", "title": "UK's concern for Boris Johnson overrides politics", "title_page": "UK's concern for Boris Johnson overrides politics   - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Julia Hobsbawm is a social philosopher and author specializing in addressing connected behaviour in the digital age. She has been consulted by the World Health Organisation, the OECD and the European Union on her ideas on Social Health and is Honorary Visiting Professor in Workplace Social Health at Cass Business School, City, University of London. Her latest book, \"The Simplicity Principle: Six Steps Towards Clarity in a Complex Age,\" will be published this month. The opinions in this commentary are her own. View more opinion at CNN.\n(CNN) Something extraordinary is happening in the middle of this extraordinary crisis. While the physical health of the world is in peril, a new kind of health is emerging in which the emotional connections between people start to strengthen along new, fresh lines. I call this social health.\nThis can be seen most clearly in the world of politics where old borders and enmities are dissolving. For evidence of this, look no further than my home country, Britain, and the response to the hospitalization due to complications from coronavirus of Prime Minister Boris Johnson.\nJulia Hobsbawm\nI have known Boris for 30 years, from when he was editor of The Spectator, the famous conservative magazine. I was briefly in charge of high-value donor fundraising for the Labour Party and am the daughter of a man so left wing that Bernie Sanders flew over to the UK to give the \"Eric Hobsbawm\" lecture at the famous Hay Festival.\nBoris doesn't do boundaries. If he likes you, he likes you. If you are not of his political persuasion, no matter. This underscores both his popularity with the public -- he won a landslide in the general election in December -- and the response to his medical predicament.\nWhen \"Boris\" (we refer to our leader by his first name, unlike Americans, who seem to refer to theirs by his surname) was taken into St. Thomas' Hospital opposite the Houses of Parliament last Sunday evening and then moved on Monday night into intensive care, you could almost hear the collective gasp of grief and concern.\nRead More", "url": "https://www.cnn.com/2020/04/10/opinions/uks-concern-for-boris-johnson-overrides-politics/index.html"}