{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:58:30", "date_modify": "2020-05-04 16:58:30", "date_publish": "2020-04-09 15:45:03", "description": "President Donald Trump is, at heart, a provocateur. One of his favorite tools to stir up trouble is by embracing of conspiracy theories -- and sometimes even starting ones of his own.", "filename": "2020_04_09_politics_barack-obama-joe-biden-donald-trump_index_1588611510.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190804000425-obama-and-biden-in-2012-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_barack-obama-joe-biden-donald-trump_index_1588611510.html", "title": "Donald Trump's secret theory about Barack Obama's endorsement", "title_page": "Donald Trump's secret theory about Barack Obama's endorsement - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump is, at heart, a provocateur. One of his favorite tools to stir up trouble is by embracing of conspiracy theories -- and sometimes even starting ones of his own.\nWhich is exactly what Trump did during the daily coronavirus briefing from the White House on Wednesday. Asked about Vermont Sen. Bernie Sanders dropping out of the Democratic presidential race , leaving former Vice President Joe Biden as the de facto Democratic nominee, Trump said this (bolding is mine):\n\"You know what? I'll tell you, it does amaze me that President Obama hasn't supported Sleepy Joe. It just hasn't happened. When is it going to happen? When is it going to happen? Why isn't he? He knows something that you don't know, that I think I know, but you don't know. So it'll be interesting.\"\nSo, according to Trump, former President Barack Obama has held off on endorsing his vice president for president because \"he knows something that you don't know, that I think I know, but you don't know.\"\nWhich is, of course, patently ridiculous. The idea that Trump possesses some sort of secret knowledge about Obama's reasons for staying out of the 2020 Democratic presidential race to date assumes that Obama -- or someone close to the former president -- has confided this \"secret\" to Trump or someone close to him. There's a 0% chance that happened.\nRead More", "url": "https://www.cnn.com/2020/04/09/politics/barack-obama-joe-biden-donald-trump/index.html"}