{"authors": ["Nikki Carvajal", "Veronica Stracqualursi"], "date_download": "2020-05-04 16:26:01", "date_modify": "2020-05-04 16:26:01", "date_publish": "2020-04-07 12:36:12", "description": "Dr. Deborah Birx said Monday that she personally understands how difficult the strict social distancing guidelines can be amid the coronavirus pandemic, revealing that she could not treat her 10-month-old granddaughter who had a high fever this weekend.", "filename": "2020_04_07_politics_deborah-birx-granddaughter-fever_index_1588609561.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404205309-04-coronavirus-briefing-0404-birx-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_deborah-birx-granddaughter-fever_index_1588609561.html", "title": "Birx says she did not see sick granddaughter because of high risks", "title_page": "Dr. Deborah Birx says she did not see sick granddaughter because of high risks - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Dr. Deborah Birx said Monday that she personally understands how difficult the strict social distancing guidelines can be amid the coronavirus pandemic, revealing that she could not treat her 10-month-old granddaughter who had a high fever this weekend.\n\"We need to take care of each other now as Americans and do everything that's in those guidelines. And I know they are tough. I know incredibly how tough they are. My grandchild of 10 months got a fever of 105 this weekend. I'm the doctor. And I couldn't get there,\" Birx, the White House coronavirus response coordinator, told reporters during the task force's daily briefing.\nPresident Donald Trump , who was standing feet away from Birx in the White House briefing room, then cut in and asked her, \"But you did not get there, you did not get there?\"\n\"I did not go there,\" Birx replied.\n\"Good, I'm very happy about that,\" Trump said.\nRead More", "url": "https://www.cnn.com/2020/04/07/politics/deborah-birx-granddaughter-fever/index.html"}