{"authors": ["Opinion Holly Thomas"], "date_download": "2020-05-04 16:53:50", "date_modify": "2020-05-04 16:53:50", "date_publish": "2020-04-08 17:49:56", "description": "In the face of threats like the coronavirus, leaders are resorting to familiar analogies to war, says Holly Thomas, but that rhetoric is dangerous and problematic in the hands of world leaders like Donald Trump and others. It is possible to appeal to collective memory of struggle with a focus on shared empathy instead, Thomas writes, as Queen Elizabeth did recently.", "filename": "2020_04_08_opinions_queen-e_52bf98ca9e3c88ba8fde2ea3a74e20d0_index_1588611230.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406072620-queen-address-phone-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_opinions_queen-e_52bf98ca9e3c88ba8fde2ea3a74e20d0_index_1588611230.html", "title": "The Queen's master class in fighting with compassion", "title_page": "The Queen's master class in fighting with compassion (opinion)  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Holly Thomas is a writer and editor based in London. She tweets @HolstaT. The opinions expressed in this commentary are solely those of the author. View more opinion articles on CNN.\n(CNN) On Sunday, Queen Elizabeth gave a rare address, broadcast on the BBC, in light of the coronavirus pandemic. The British monarch drew on what she called the \"fellow feeling\" which an empathetic approach to dealing with a common struggle can foster. She praised \"heartwarming\" stories of care from around the world, and expressed a hope that \"in the years to come, everyone will be able to take pride in how they responded to this challenge.\"\nHolly Thomas\nHer words marked a rare contrast to the nation-focused battle-talk which has characterized the much of the response to the pandemic so far. Though she as a figurehead has the luxury of expressing support rather than addressing practical enforcement or policy, by promoting a spirit of compassion, the Queen also sidestepped the problematic habit of many world leaders who have relied on -- and sometimes abused -- war-like language.\nJust hours before the Queen's address, for instance, the US Surgeon General warned that the upcoming phase of the coronavirus pandemic in America was going to be its \"hardest and saddest.\"\n\"This is going to be our 9/11 moment, our Pearl Harbor moment,\" Vice Admiral Jerome Adams said in an interview on Fox News.\nAdams' invocation of Pearl Harbor followed a trend set by so many world leaders during the Covid-19 pandemic. President Donald Trump has referred to himself as a \"wartime president,\" promising \"total victory\" against the \"invisible enemy.\" French President Emmanuel Macron told his country \"we are at war,\" as he announced the closure of its borders. In mid-March, attempting to persuade the British public of the seriousness of the coronavirus' threat, Prime Minister Boris Johnson -- himself now in intensive care in stable condition battling the disease -- said it was necessary to act like a \"wartime government,\" in order \"win the fight\" against a \"deadly enemy.\"\nRead More", "url": "https://www.cnn.com/2020/04/08/opinions/queen-elizabeth-speech-and-trump-war-rhetoric-thomas/index.html"}