{"authors": ["Cristina Alesci", "Shannon Liao", "Cnn Business"], "date_download": "2020-05-04 16:19:22", "date_modify": "2020-05-04 16:19:22", "date_publish": "2020-04-04 21:15:00", "description": "Joe Tsai, the billionaire co-founder of Chinese ecommerce giant Alibaba, and his wife Clara Wu Tsai, have donated 2.6 million masks, 170,000 goggles and 2000 ventilators to New York — the US epicenter of the coronavirus pandemic.", "filename": "2020_04_04_tech_joe-tsai-cl_5d0e0888f17fbd82f86bf1a37e2ed963_index_1588609162.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404160534-01-tsai-family-ppe-donation-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_tech_joe-tsai-cl_5d0e0888f17fbd82f86bf1a37e2ed963_index_1588609162.html", "title": "Billionaire Brooklyn Nets owner Joe Tsai donates ventilators and masks to New York", "title_page": "Alibaba billionaire and Brooklyn Nets owner Joe Tsai donates millions of supplies to New York - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Joe Tsai, the billionaire co-founder of Chinese ecommerce giant Alibaba, and his wife Clara Wu Tsai, have donated 2.6 million masks, 170,000 goggles and 2000 ventilators to New York — the US epicenter of the coronavirus pandemic.\nThe supplies were split into two shipments. The first arrived on Thursday at Newark Liberty International Airport, while the second arrived on Saturday at John F. Kennedy International Airport.\n\"We kept hearing cries for (personal protective equipment) from our community and wanted to help,\" Clara Tsai told CNN in an interview. The state will allocate the second shipment but \"it's our intention to help the most underserved institutions.\"\nShe cited Jacobi Medical Center and Lincoln Medical Center in the Bronx, and Elmhurst Hospital in Queens as the institutions she and her husband thought might need the supplies the most.\nNew York Governor Andrew Cuomo referenced the donations during a daily coronavirus briefing.\nRead More", "url": "https://www.cnn.com/2020/04/04/tech/joe-tsai-clara-donate-masks-ventilators-new-york/index.html"}