{"authors": ["Bruce Schreiner", "Dylan Lovan"], "date_download": "2020-05-04 20:13:38", "date_modify": "2020-05-04 20:13:38", "date_publish": "2020-04-16 06:47:36", "description": "FRANKFORT, Ky. (AP) — Nearly 400,000 Kentucky residents have filed for unemployment benefits in the past four weeks as the coronavirus caused another round of massive layoffs in the state's...", "filename": "_170acc8decc2e2ec4d4331eafa7b60b5_1588623218.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_170acc8decc2e2ec4d4331eafa7b60b5_1588623218.html", "title": "Unemployment claims mount in Kentucky due to coronavirus", "title_page": "Unemployment claims mount in Kentucky due to coronavirus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FRANKFORT, Ky. (AP) — Nearly 400,000 Kentucky residents have filed for unemployment benefits in the past four weeks as the coronavirus caused another round of massive layoffs in the state’s battered economy.\nA total of 115,763 Kentuckians filed unemployment claims last week, the U.S. Labor Department reported Thursday. That was down slightly from the prior week.\nBut in the past month, about 20% of the Bluegrass State’s workforce has filed for unemployment.\nNationwide, roughly 22 million have sought jobless benefits in the past month — easily the worst stretch of U.S. job losses on record.\nLike elsewhere around the country, Kentucky’s unemployment benefit enrollment system has been overwhelmed by the skyrocketing numbers of applicants. Kentucky dramatically increased the number of employees handling unemployment insurance claims.\n“We are processing more claims than ever before and sending out more payments than ever before,” Gov. Andy Beshear said this week. “But I know that many of you out there still haven’t gotten the service that you need. That is our fault and we are working through it.”\nAfter getting an infusion of federal funding, Kentucky recently started distributing an additional $600 per week for people receiving unemployment aid.\nAbout 100 protesters bunched up outside the state Capitol on Wednesday to push back against Beshear’s orders that closed a cross-section of businesses deemed nonessential in an effort to contain the virus’s spread. The protesters could be heard chanting as the governor gave his daily update on the state’s fight against the virus.\n“I understand a couple dozen people who wanted to drown us out yesterday, but I think there are a whole lot of people out there who wanted the information we provided yesterday,” Beshear said Thursday evening. “And for the families that we had to announce the loss of their loved ones, you know, screaming to drown that out isn’t right. It just isn’t right.”\nBeshear says his restrictions are working, noting that coronavirus cases in Kentucky are rising at a slower rate than most other states, even when adjusted for population size. The governor reported nearly 160 new coronavirus cases statewide Thursday and seven more virus-related deaths. The youngest new coronavirus patient was a 10-day-old baby in Lincoln County, Beshear said.\nBeshear cautioned at his daily briefing Thursday that plans to reopen the economy will unfold in phases, and that “the new normal is going to be different than our old normal.”\n“We’re going to be able to start coming out of this in ways that I know all of us have wanted to, but let’s remember that until there’s a vaccine we’re still going to be doing some things very, very differently,” he said. “And even in a phased approach, our seniors, the vulnerable populations are still going to be very, very at risk for this virus.”\nMost people who contract COVID-19 have mild or moderate symptoms, which can include fever and cough but also milder cases of pneumonia, sometimes requiring hospitalization. The risk of death is greater for older adults and people with other health problems.\nIn Bowling Green, a plant that makes laundry products was forced to temporarily shut down by the state Labor Cabinet after some employees tested positive for COVID-19, the Daily News reported. The company said Thursday that it has been given the go-ahead from the state to restart production Friday.\nBeshear announced that four more coronavirus drive-thru testing sites will open for part of next week in partnership with Kroger as the state continues efforts to ramp up testing. Testing sites in Madisonville, Paducah, Somerset and Pikeville will be open Tuesday through Thursday next week.\nMeanwhile, a donation fund run by the state that offers help during the coronavirus outbreak has raised nearly $2 million, with more than half coming from an Kentucky Colonels contribution.\nThe Team Kentucky Fund has received funding from about 7,000 donors, Beshear said Wednesday. The fund offers financial aid for people adversely affected by the pandemic.\nThe Honorable Order of Kentucky Colonels’ commanding general, Hal Sullivan, said the group’s board of trustees approved an immediate $1 million contribution to the fund this week.\n“Just think how many that’s going to help,” Beshear said in announcing the gift this week.\nThe Colonels are a charitable giving group.\n“Demands are great and the time is now to step forward,” Sullivan said in a release.\nThe Team Kentucky Fund has a website for donations.\n___\nFollow AP coverage of the pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/170acc8decc2e2ec4d4331eafa7b60b5"}