{"authors": ["Arielle Dreher"], "date_download": "2020-05-04 20:03:43", "date_modify": "2020-05-04 20:03:43", "date_publish": "2020-04-07 00:00:00", "description": "State health officials plan to direct new testing materials and supplies to counties outside of the Puget Sound area this week, as they acknowledged that COVID-19 case numbers are increasing...", "filename": "_4430c2d3b38d4809a59141b926ba68f2_1588622623.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4430c2d3b38d4809a59141b926ba68f2_1588622623.html", "title": "‘This virus could easily spring back’: Officials remain vigilant about virus, push resources outside Puget Sound", "title_page": "‘This virus could easily spring back’: Officials remain vigilant about virus, push resources outside Puget Sound", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "State health officials plan to direct new testing materials and supplies to counties outside of the Puget Sound area this week, as they acknowledged that COVID-19 case numbers are increasing beyond the Seattle metro area.\nJohn Wiesman, State Secretary of Health, said that in coordination with the Washington State Hospital Association, he asked local elected officials, hospitals and health districts to drive home the message to communities outside of the Seattle area to follow the “Stay Home, Stay Healthy” order, after receiving several calls in the past week about residents not taking mitigation efforts seriously.\n“We’re concerned that folks outside the Puget Sound area weren’t taking this as seriously,” Wiesman said, adding that the delay in the number of cases rising in other counties does not mean that increases are not already occurring.\nWiesman said the state is in an unsatisfactory position in terms of test kits and that there needs to be a dramatic increase in the ability to analyze the samples going forward.\nThis week, however, state health officials found tens of thousands of test kits.\n“We are going to be deploying a lot of these test kits to our local health jurisdictions,” Kathy Lofy, state health officer, told reporters Tuesday.\nThose test kits will be targeted to long-term care facilities with confirmed cases, as well as facilities with residents who have symptoms.\nIdeally, Lofy said, testing everyone in these facilities will enable care providers to see how widespread the virus is in a facility. Outbreaks in nursing homes and assisted living facilities continue to concern state health officials, and 126 long-term care facilities include residents infected with COVID-19, Lofy said.\nThe amount of testing in Washington state has remained stable over the last two weeks, with about 4,000 to 5,000 tests done daily during the week and 4,000 over the weekends. Lofy said health care providers statewide would like to do more testing, but challenges persist.\n“They (health care systems) would like to do even more testing, and they are having difficulty getting some of the material for collections,” Lofy said.\nThe Centers for Disease Control and Prevention has recommended people wear masks when in public spaces. Personal protective equipment for health care workers in hospitals and long-term care facilities is still a priority of state leaders.\n“We are very concerned, too, about the community transmission that’s happening and health care providers, perhaps, unintentionally taking the virus into long-term care facilities,” Wiesman said. “And we are learning that for folks that develop symptoms, there can be shedding of the virus one to three days before developing symptoms, so a worker can be going to a facility and shed this virus.”\nThe state has received more than 1.4 million surgical masks and 947,000 N95 respirators, which officials intend to distribute to hospitals and long-term care facilities this week too. Personal protective supplies are still running in short supply, however, and the Department of Health continues to request supplies from donors, the federal stockpile and through procurement.\nWhile models of statewide hospital capacity and resource usage appear optimistic, state officials warned that relaxing any mitigation strategies is not wise.\n“We are nowhere near out of the woods here and this virus could easily spring back,” Wiesman said.\nHealth officials will not know if Washington state has crested its peak of cases and deaths until those numbers have declined for two to three weeks. State leaders believe the hospital capacity and statewide stock of ventilators are in adequate condition and supply.\nVice Admiral Raquel Bono, who is leading statewide health system responses to COVID-19, said there are contingency plans in place to turn ambulatory centers into intensive care unit beds if necessary.\n“We recognize that in the Eastern region, we have slightly different capacity for care,” she said.\nState health officials are also looking at the potential to open up field hospitals in certain regions to alleviate capacity if the need arises.\nSpokane County has 227 confirmed cases of COVID-19, with 13 deaths, Spokane County Health Officer Dr. Bob Lutz said Tuesday.\nThe increase of five new cases was smaller than those of recent days and made Lutz “a little encouraged,” although he cautioned that social distancing will remain important.\n“I am encouraged by the fact that numbers have been lessened than what we saw last week, but nonetheless we are still seeing increases,” Lutz said.\nOf the 227 confirmed cases in Spokane County, 15 people are receiving treatment in local hospitals. Nearly 200 people with the virus are recovering at home in isolation or have recovered already, although the Spokane Regional Health District does not have the manpower to follow up with everyone who tested positive to see if they have fully recovered.\nThe CDC recommends that people who have COVID-19 may come out of isolation when they have had no fever for 72 hours without the use of medicine, other symptoms like cough and shortness of breath have improved, and it has been a full week since the first onset of symptoms.\nWashington state had 8,682 confirmed cases of COVID-19, up 300 cases from the day before, with 394 deaths. All counties but one in Eastern Washington have confirmed cases, and counties in southeastern Washington have high percentages positive test results.\nIn Benton County, where 16.6% of people tested have the respiratory virus, there are more than 100 cases in six long-term care or retirement communities. In Yakima County, 17.2% of people tested have COVID-19, and less than 2,000 people have been tested.\nIn the Idaho Panhandle, one new case of COVID-19 was confirmed Monday in Bonner County, for a total of 45 local cases, according to the Panhandle Health District. Forty-two cases were reported in Kootenai County and three were in Bonner County as of Tuesday afternoon.\nTwo people in the Idaho Panhandle were hospitalized with the disease Tuesday, according to the health district.\nShoshone, Benewah and Boundary counties remained without confirmed cases as of Tuesday.\nLatah County, home of Moscow and the University of Idaho, reported two cases as of Monday afternoon, according to the Idaho North Central District. Nez Perce County reported 13 cases and two deaths, while Idaho County had three cases.\nStatewide, Idaho reported 1,170 confirmed cases Monday afternoon, an increase of 69 cases, along with 13 deaths, according to the state health department.\nSpokesman-Review reporter Jared Brown contributed to this report.", "url": "https://apnews.com/4430c2d3b38d4809a59141b926ba68f2"}