{"authors": ["Bruce Schreiner"], "date_download": "2020-05-04 20:24:34", "date_modify": "2020-05-04 20:24:34", "date_publish": "2020-04-07 15:43:43", "description": "FRANKFORT, Ky. (AP) — U.S. Sen. Rand Paul said Tuesday that he has recovered from the coronavirus and has started volunteering at a hospital in his Kentucky hometown. The Republican...", "filename": "_efaa57ce9bf848dc0df2e47059138260_1588623874.html", "image_url": "https://storage.googleapis.com/afs-prod/media/af83e1af7e4c4a8182e763f30b6faf2d/1970.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_efaa57ce9bf848dc0df2e47059138260_1588623874.html", "title": "Paul recovered from coronavirus; volunteering at hospital", "title_page": "Paul recovered from coronavirus; volunteering at hospital", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this March 5, 2019, file photo, Sen. Rand Paul, R-Ky., speaks during a Senate Committee on Health, Education, Labor, and Pensions hearing on Capitol Hill in Washington. Paul said Tuesday, April 7, 2020, that he has recovered from the coronavirus and has started volunteering at a hospital in his Kentucky hometown. The Republican lawmaker tested positive for the virus in March, becoming the first case of COVID-19 in the Senate. (AP Photo/Carolyn Kaster, File)\nFILE - In this March 5, 2019, file photo, Sen. Rand Paul, R-Ky., speaks during a Senate Committee on Health, Education, Labor, and Pensions hearing on Capitol Hill in Washington. Paul said Tuesday, April 7, 2020, that he has recovered from the coronavirus and has started volunteering at a hospital in his Kentucky hometown. The Republican lawmaker tested positive for the virus in March, becoming the first case of COVID-19 in the Senate. (AP Photo/Carolyn Kaster, File)\nFRANKFORT, Ky. (AP) — U.S. Sen. Rand Paul said Tuesday that he has recovered from the coronavirus and has started volunteering at a hospital in his Kentucky hometown.\nThe Republican lawmaker tested positive for the virus in March, becoming the first case of COVID-19 in the Senate.\n“I appreciate all the best wishes I have received,” Paul said Tuesday. “I have been retested and I am negative. I have started volunteering at a local hospital to assist those in my community who are in need of medical help, including coronavirus patients. Together we will overcome this.”\nPaul, an eye surgeon, is volunteering at TriStar Greenview Regional Hospital in Bowling Green while the Senate is on a break amid the coronavirus outbreak. Paul worked in emergency rooms early in his career as a physician, his office said.\nThe hospital’s CEO, Mike Sherrod, said Tuesday that the senator is “lifting the spirits of patients and our colleagues” by volunteering.\n“We appreciate Senator Paul and his support in recognizing our healthcare workers and providers at TriStar Greenview for their unwavering response to the COVID-19 pandemic,” he said in a statement.\nPaul went into quarantine after learning his initial test results in March. He later said he had been tested the prior week but continued working at the Capitol because he had no symptoms of the illness and believed it was “highly unlikely” he was sick. Paul also said he did not have direct contact with anyone who tested positive for the virus or was sick.\nPaul’s refusal to self-quarantine after being tested drew harsh criticism from some of his colleagues.\nPaul said last month that he took the initial test because of his extensive travel prior to the start of social-distancing practices and because he’s at a higher risk for serious complications from the virus. The senator had part of a lung removed last year in a procedure he says stemmed from injuries he suffered when a neighbor tackled him outside his Kentucky home in 2017.\nDr. Ezekiel Emanuel, a former health policy adviser to President Barack Obama, said recently that Paul “did just about everything wrong” by not self-quarantining in the days before his test results came back.\nIn defending his actions, Paul said at the time: “For those who want to criticize me for lack of quarantine, realize that if the rules on testing had been followed to a tee, I would never have been tested and would still be walking around the halls of the Capitol. The current guidelines would not have called for me to get tested nor quarantined. It was my extra precaution, out of concern for my damaged lung, that led me to get tested.”\nMost people who contract COVID-19 have mild or moderate symptoms, which can include fever and cough but also milder cases of pneumonia, sometimes requiring hospitalization. The risk of death is greater for older adults and people with other health problems.\n___\nFollow AP news coverage of the coronavirus pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/efaa57ce9bf848dc0df2e47059138260"}