{"authors": ["John Hanna"], "date_download": "2020-05-04 21:06:50", "date_modify": "2020-05-04 21:06:50", "date_publish": "2020-04-20 20:53:14", "description": "TOPEKA, Kan. (AP) — Kansas is facing a projected 8.1% shortfall in its next state budget after a new fiscal forecast issued Monday slashed projections for expected tax collections over the next 15...", "filename": "_66bc36a2cf33d0b60df265bdd0b70a70_1588626410.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9ef2b0069d6d47de8c827f331dec9de5/2158.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_66bc36a2cf33d0b60df265bdd0b70a70_1588626410.html", "title": "Kansas faces $653M shortfall after tax projections slashed", "title_page": "Kansas faces $653M shortfall after tax projections slashed", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this image made in Topeka, Kan., through Zoom video conferencing, J.G. Scott, director of the Kansas Legislative Research Department, discusses a new fiscal forecast during a news conference conducted online Monday, April 20, 2020. Kansas is facing a projected 8.1% shortfall in its next state budget after a new fiscal forecast issued Monday slashed projections for expected tax collections over the next 15 months by nearly $1.37 billion to reflect the economic damage associated with the coronavirus pandemic. (AP Photo/John Hanna)\nIn this image made in Topeka, Kan., through Zoom video conferencing, J.G. Scott, director of the Kansas Legislative Research Department, discusses a new fiscal forecast during a news conference conducted online Monday, April 20, 2020. Kansas is facing a projected 8.1% shortfall in its next state budget after a new fiscal forecast issued Monday slashed projections for expected tax collections over the next 15 months by nearly $1.37 billion to reflect the economic damage associated with the coronavirus pandemic. (AP Photo/John Hanna)\nTOPEKA, Kan. (AP) — Kansas is facing a projected 8.1% shortfall in its next state budget after a new fiscal forecast issued Monday slashed projections for expected tax collections over the next 15 months by nearly $1.37 billion to reflect the economic damage associated with the coronavirus pandemic.\nDemocratic Gov. Laura Kelly announced even before the new forecast was public that she has directed state agencies to avoid filling open positions not essential to dealing with the novel coronavirus and to eliminate discretionary spending.\nBut those steps aren’t likely going to be enough to put the state back in the black for the 2021 budget year that begins in July. The loss of tax collections — projected to be lower in both years than they were in the 2019 budget year — would burn through the state’s cash reserves and leave it with a shortfall of $653 million at the end of June 2021. The Kansas Constitution prohibits a deficit, so the state would have to make adjustments.\n“The unprecedented revenue collapse turned Kansas finances upside down overnight — it is the rainy day we feared could come,” Kelly said in a statement.\nThe new fiscal forecast issued by state officials, legislative researches and university economists is far more pessimistic than one issued in November and used by Kelly and the Republican-controlled Legislature to craft the next annual state budget.\n“We now have a collapsing labor market,” J.G. Scott, director of the Kansas Legislative Research Department and one of the forecasters, said during a news conference on Zoom. “We have an economic free-fall.”\nThe new forecast predicts that Kansas will collect less than $6.9 billion in tax revenues during the budget year ending June 30. That’s nearly $816 million or 10.6% lower than the previous projection made in November of $7.7 billion.\nFor the 2021 budget year that begins in July, the new prediction is that the state will collect less than $7.4 billion in taxes. That is $549 million or 6.9% less than the $7.9 billion previously predicted.\nKelly issued a stay-at-home order for all of the state’s 2.9 million residents that took effect March 30, and Kansas has seen a surge in claims for unemployment benefits from jobless workers since mid-March.\nThe Democratic governor and Republican-controlled Legislature expected those moves to cut into state revenues. Kelly also delayed this year’s income tax filing deadline three months, to July 15, and that pushed roughly $600 million in tax collections from the current budget year into the next one.\nKelly has faced increasing pressure from Republican legislators to announce a plan for reopening the state’s economy.\n“Every day we wait to plan is another day Kansans can’t work,” said House Speaker Ron Ryckman Jr., an Olathe Republican.\nKelly has said she is working on one, but it won’t be possible until the state can do enough testing for the virus that causes COVID-19 to know how many people who are infected don’t have symptoms. And her top public health administrator, Dr. Lee Norman, has suggested the reopening might not start until mid-May.\nSenate President Susan Wagle, a Wichita Republican, said lost jobs and the projected budget shortfall represent “a call for action.”\n“We need a plan to safely get our economy moving again, and we need it soon,” said Wagle, a U.S. Senate candidate and frequent Kelly critic. “We need a productive Kansas to fund our schools, roads and public safety.”\nKelly said Monday that besides directing agencies to hold positions open and end discretionary spending, she directed them to avoid expanding non-essential programs and to avoid proposing pay increases for employees. She said agencies will begin this week to develop detailed budget plans.\nState finances had been in relatively good shape going into the pandemic. The state previously expected to have $927 million in cash reserves on June 30, and tax collections were running 3.2% ahead of expectations for the current budget year.\nBut under the new fiscal forecast, those cash reserves would be only $205 million on June 30, not enough to prevent a big shortfall the next budget year.\nAnd, Scott said, the forecasters are hoping the economy will recover by next spring, but, “We’re not exactly sure where the bottom’s going to be.”\n___\nFollow John Hanna on Twitter: https://twitter.com/apjdhanna", "url": "https://apnews.com/66bc36a2cf33d0b60df265bdd0b70a70"}