{"authors": ["Brian Lowry"], "date_download": "2020-05-04 16:10:07", "date_modify": "2020-05-04 16:10:07", "date_publish": "2020-04-02 20:46:55", "description": "In advance of the launch of streaming service HBO Max, HBO will seek to ease the act of social distancing by making 500 hours of programming available free for a limited time, under the heading #StayHomeBoxOffice.", "filename": "2020_04_02_entertainment_hbo-free-streaming_index_1588608607.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191013162304-succession-season-2-finale-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_entertainment_hbo-free-streaming_index_1588608607.html", "title": "HBO makes programming available free as part of #StayHomeBoxOffice", "title_page": "HBO makes programming available free as part of #StayHomeBoxOffice - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) In advance of the launch of streaming service HBO Max, HBO will seek to ease the act of social distancing by making 500 hours of programming available free for a limited time, under the heading #StayHomeBoxOffice.\nThe promotion kicks off April 3, and will include free streaming of such series as \"The Sopranos,\" \"The Wire\" and \"Veep,\" as well as HBO documentaries and an assortment of Warner Bros. movies. Many of the films are aimed at kids or a family audience, such as \"Pokemon Detective Pikachu,\" \"Smallfoot\" and \"The Lego Movie 2: The Second Part.\"\nThe programming will be available to stream without a subscription on HBO Now and HBO Go. Other series included in the promotion are \"Succession,\" \"Barry,\" \"Silcon Valley\" and \"Ballers,\" as well as the older titles \"True Blood\" and \"Six Feet Under.\"\nHBO Max, the company's streaming venture, is scheduled to launch in May . HBO, Warner Bros. and CNN are all units of WarnerMedia.\nSeveral entertainment companies have juggled release dates to serve the vast audience hunting for something to watch while living through shelter-at-home orders due to coronavirus.\nRead More", "url": "https://www.cnn.com/2020/04/02/entertainment/hbo-free-streaming/index.html"}