{"authors": ["Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Kate Aronoff", "Alyssa Battistoni", "Daniel Aldana Cohen", "Thea Riofrancos", "Luke Thibault", "Jedediah Britton-Purdy"], "date_download": "2020-05-04 19:57:08", "date_modify": "2020-05-04 19:57:08", "date_publish": "2020-03-14 00:00:00", "description": null, "filename": "2020_03_mike-davis-coronavirus-outbreak-capitalism-left-international-solidarity_1588622228.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/14170507/GettyImages-1206945121.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_mike-davis-coronavirus-outbreak-capitalism-left-international-solidarity_1588622228.html", "title": "Mike Davis on Coronavirus: “In a Plague Year”", "title_page": "Mike Davis on Coronavirus: “In a Plague Year”", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Coronavirus is the old movie that we’ve been watching over and over again since Richard Preston’s 1994 book The Hot Zone introduced us to the exterminating demon, born in a mysterious bat cave in Central Africa, known as Ebola. It was only the first in a succession of new diseases erupting in the “virgin field” (that’s the proper term) of humanity’s inexperienced immune systems. Ebola was soon to be followed by avian influenza, which jumped to humans in 1997, and SARS which emerged at the end of 2002: in both cases appearing first in Guangdong, the world’s manufacturing hub. Hollywood, of course, lustfully embraced these outbreaks and produced a score of films to titillate and scare us. (Steven Soderbergh’s Contagion , released in 2011, stands out for its accurate science and eerie anticipation of the current chaos.) In addition to the films and the innumerable lurid novels, hundreds of serious books and thousands of scientific articles have responded to each outbreak, many emphasizing the appalling state of global preparedness to detect and respond to such novel diseases.\nChaos of Numbers So coronavirus walks through the front door as a familiar monster. Sequencing its genome (very similar to its well-studied sister SARS) was a piece of cake, yet the most vital bits of information are still missing. As researchers work night and day to characterize the outbreak, they are faced with three huge challenges. First, the continuing shortage of test kits, especially in the United States and Africa, has prevented accurate estimates of key parameters such as reproduction rate, size of infected population, and number of benign infections. The result has been a chaos of numbers. Second, like annual influenzas, this virus is mutating as it courses through populations with different age compositions and health conditions. The variety that Americans are most likely to get is already slightly different from that of the original outbreak in Wuhan. Further mutation could be benign or could alter the current distribution of virulence, which now spikes sharply after age fifty. Trump’s “corona flu” is at minimum a mortal danger to the quarter of Americans who are elderly, have weak immune systems, or chronic respiratory problems. Third, even if the virus remains stable and little mutated, its impact on younger age cohorts could differ radically in poor countries and among high-poverty groups. Consider the global experience of the Spanish flu in 1918–19, which is estimated to have killed 1 to 2 percent of humanity. In the United States and Western Europe, the original H1N1 was most deadly to young adults. This has usually been explained as a result of their relatively stronger immune systems which overreacted to the infection by attacking lung cells, leading to viral pneumonia and septic shock. More recently, however, some epidemiologists have theorized that older adults may have had “immune memory” from an earlier outbreak in the 1890s that gave them protection. In any event, the influenza found a favored niche in army camps and battlefield trenches where it scythed down young soldiers by the tens of thousands. This became a major factor in the battle of empires. The collapse of the great German Spring Offensive of 1918, and thus the outcome of the war, has been attributed to the fact that the Allies, in contrast to their enemy, could replenish their sick armies with newly arrived American troops. But the Spanish flu in poorer countries had a different profile. It’s rarely appreciated that almost 60 percent of global mortality (that’s at least twenty million deaths) occurred in the Punjab, Bombay, and other parts of western India, where grain exports to Britain and brutal requisitioning practices coincided with a major drought. Resultant food shortages drove millions of poor people to the edge of starvation. They became victims of a sinister synergy between malnutrition — which suppressed their immune response to infection — and rampant bacterial, as well as viral, pneumonia. In a similar case in British-occupied Iran, several years of drought, cholera, and food shortages, followed by a widespread malaria outbreak, preconditioned the death of an estimated one-fifth of the population. This history — especially the unknown consequences of interactions with malnutrition and existing infections — should warn us that COVID-19 might take a different and more deadly path in the dense, sickly slums of Africa and South Asia. With cases now appearing in Lagos, Kigali, Addis Ababa, and Kinshasa, no one knows (and won’t know for a long time because of the absence of testing) how it may synergize with local health conditions and diseases. Some have claimed that because the urban population of Africa is the world’s youngest, the pandemic will only have a mild impact. In light of the 1918 experience, this is a foolish extrapolation, as is the assumption that the pandemic, like seasonal flu, will recede with warmer weather. (Tom Hanks just got the virus in Australia where it’s still summer.)\nA Medical Katrina A year from now we may look back in admiration at China’s success in containing the pandemic but in horror at the United States’ failure. (I’m making the heroic assumption that China’s declaration of rapidly declining transmission is more or less accurate.) The inability of our institutions to keep Pandora’s box closed, of course, is hardly a surprise. Since 2000 we’ve repeatedly seen breakdowns in frontline health care. Both the 2009 and 2018 flu seasons, for instance, overwhelmed hospitals across the country, exposing the shocking shortage of hospital beds after years of profit-driven cutbacks of in-patient capacity. The crisis dates back to the corporate offensive that brought Reagan to power and converted leading Democrats into its neoliberal mouthpieces. According to the American Hospital Association, the number of in-patient hospital beds declined by an extraordinary 39 percent between 1981 and 1999. The purpose was to raise profits by increasing “census” (the number of occupied beds). But management’s goal of 90 percent occupancy meant that hospitals no longer had the capacity to absorb patient influx during epidemics and medical emergencies. In the new century, emergency medicine has continued to be downsized in the private sector by the “shareholder value” imperative of increasing short-term dividends and profits, and in the public sector by fiscal austerity and cutbacks in state and federal preparedness budgets. As a result, there are only 45,000 ICU beds available to deal with the projected flood of serious and critical coronavirus cases. (By comparison, South Koreans have available more than three times more beds relative to population than Americans.) According to an investigation by USA Today, “only eight states would have enough hospital beds to treat the 1 million Americans 60 and over who could become ill with COVID-19.” We are in the early stages of a medical Katrina. Disinvesting in emergency medical preparedness at the same time that all expert opinion has recommended a major expansion of capacity, we lack elementary supplies as well as emergency beds. National and regional stockpiles have been maintained at levels far below what is indicated by epidemic models. Thus the test kit debacle has coincided with a critical shortage of basic protective equipment for health workers. Militant nurses, our national social conscience, are making sure that we all understand the grave dangers created by inadequate stockpiles of protective supplies like N95 face masks. They also remind us that hospitals have become greenhouses for antibiotic-resistant superbugs such as C. difficile, which may become major secondary killers in overcrowded hospital wards.\nThe Social Divide The outbreak has instantly exposed the stark class divide in health care that Our Revolution has put on the national agenda. In sum, those with good health plans who can also work or teach from home are comfortably isolated provided they follow prudent safeguards. Public employees and other groups of unionized workers with decent coverage will have to make difficult choices between income and protection. Meanwhile, millions of low-wage service workers, farm employees, the unemployed, and the homeless are being thrown to the wolves. As we all know, universal coverage in any meaningful sense requires universal provision for paid sick days. Forty-five percent of the workforce is currently denied that right and are thus virtually compelled to transmit the infection or set an empty plate. Likewise, fourteen Republican states have refused to enact the provision of the Affordable Care Act that expands Medicaid to the working poor. That’s why one in four Texans, for example, lacks coverage and has only the emergency room at the county hospital to seek treatment. The deadly contradictions of private health care in a time of plague are exposed most starkly in the for-profit nursing home industry, which warehouses 2.5 million elderly Americans, most of them on Medicare. It is a highly competitive industry capitalized on low wages, understaffing, and illegal cost-cutting. Tens of thousands die every year from facilities’ neglect of basic infection-control procedures, and from governments’ failure to hold management accountable for what can only be described as deliberate manslaughter. Many homes — particularly in Southern states — find it cheaper to pay fines for sanitary violations than to hire additional staff and provide them with proper training. It’s not surprising that the first epicenter of community transmission in the United States was the Life Care Center, a nursing home in the Seattle suburb of Kirkland. I spoke to Jim Straub, an old friend who is a union organizer in Seattle-area nursing homes, and currently writing an article about them for the Nation. He characterized the facility as “one of the worst staffed in the state” and the entire Washington nursing home system “as the most underfunded in the country — an absurd oasis of austere suffering in a sea of tech money.” Moreover, he pointed out that public health officials were overlooking the crucial factor that explains the rapid transmission of the disease from Life Care Center to ten other nearby nursing homes: “Nursing-home workers in the priciest rental market in America universally work multiple jobs, usually at multiple nursing homes.” He says that authorities failed to find out the names and locations of these second jobs and thus lost all control over the spread of COVID-19. And no one is yet proposing to compensate exposed workers for staying at home. Across the country, dozens, probably hundreds more, of nursing homes will become coronavirus hot spots. Many workers will eventually choose the food bank over working under such conditions and stay home. In this case, the system could collapse, and we shouldn’t expect the National Guard to empty bedpans.", "url": "https://www.jacobinmag.com/2020/03/mike-davis-coronavirus-outbreak-capitalism-left-international-solidarity"}