{"authors": ["Andrew Kaczynski", "Em Steck"], "date_download": "2020-05-04 16:17:25", "date_modify": "2020-05-04 16:17:25", "date_publish": "2020-04-03 16:00:38", "description": "Two top administration officials last year listed the threat of a pandemic as an issue that greatly worried them, undercutting President Donald Trump's repeated claims that the coronavirus pandemic was an unforeseen problem.", "filename": "2020_04_03_politics_kfile-o_0f821501b01f5532868f14c1dcf71db8_index_1588609045.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/180111081740-alex-azar-1-9-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_kfile-o_0f821501b01f5532868f14c1dcf71db8_index_1588609045.html", "title": "Top administration officials said last year threat of pandemic kept them up at night", "title_page": "Top administration officials said last year threat of pandemic kept them up at night - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Two top administration officials last year listed the threat of a pandemic as an issue that greatly worried them, undercutting President Donald Trump's repeated claims that the coronavirus pandemic was an unforeseen problem.\nHealth and Human Services Secretary Alex Azar and Tim Morrison, then a special assistant to the President and senior director for weapons of mass destruction and biodefense on the National Security Council, made the comments at the BioDefense Summit in April 2019.\n\"Of course, the thing that people ask: 'What keeps you most up at night in the biodefense world?' Pandemic flu, of course. I think everyone in this room probably shares that concern,\" Azar said, before listing off efforts to mitigate the impact of flu outbreaks.\nThe Trump administration is facing scrutiny over its preparations for the coronavirus pandemic and its slow response to provide states and cities assistance in testing kits and personal protective equipment. The 2019 summit, hosted by the assistant secretary for preparedness and response in the Department of Health and Human Services to \"discuss and solicit input on implementing the National Biodefense Strategy, \" offers insights into early awareness of the potential for a pandemic threat.\nTranscripts of Azar's and Morrison's comments at the summit, which have not been previously reported on, are available on the HHS website\nPresident Donald Trump has repeatedly said no one predicted a pandemic crisis like the one caused by coronavirus.\nThe White House defended the President's comments in a statement, saying he had shown a \"great commitment\" to global health security.\n\"It is not inconsistent to acknowledge the threat posed by pandemics and posture the government to respond, and also acknowledge that this is a new or never seen before virus that came out of nowhere and was initially covered up by the Chinese Communist Party,\" a senior administration official told CNN.\nHealth and Human Services did not respond to a request for comment on Azar's remarks.\nAt Friday's White House coronavirus task force news briefing, Trump said he \"always knew that pandemics are one of the worst things that could happen\" but did not believe Azar was speaking specifically about the Covid-19 outbreak during the earlier summit. Trump said Azar meant the \"concept\" of a pandemic kept him up at night.\n\"I've heard about this for a long time, pandemics. You don't want pandemics,\" Trump said in response to a question from CNN's Jim Acosta about the KFile reporting. \"I don't think he was talking about a specific pandemic, he was talking about the threat of a pandemic could happen. And it could happen. Most people thought it wouldn't, and most people didn't understand the severity of it.\"\nAzar added that the government has been working for years to prepare for a pandemic.\n\"We knew about SARS, we knew about MERS, which were earlier modifications of the coronavirus, none of those achieved anything like what we are seeing today,\" Azar told Acosta at the briefing, \"but that is why four successive presidencies, including the leadership of President Trump, there has been a great focus on pandemic preparedness.\"\nAt the 2019 summit, Azar also said, \"It's a cardinal rule of leadership that you have to have accountability, which means picking a leader, and that's a leadership lesson well understood by President Trump, who has a particular interest not just in our national security, but in preparedness for biodefense in particular.\"\nMorrison said during his speech that he prepared for his appearance at the conference by turning to the \" The Great Influenza ,\" a book on the \"Spanish Flu\" pandemic of 1918.\n\"When people ask me what am I really worried about, it's always the thing we're not thinking about,\" Morrison said. \"The thing we're not prepared for that we should be. And when we were working on the Biodefense Strategy, we started thinking a little bit about what would we likely confront, what's likely to come next?\"\nMorrison then described the impact of the 1918 pandemic, noting in raw numbers it killed \"more people than any other outbreak of disease in human history.\"\n\"So when people ask me what keeps me up at night, it's issues like that,\" he added.\nA national security presidential memorandum ordered in September 2018 placed the HHS secretary in charge of coordinating the National Biodefense Strategy across the administration, including the White House's National Security Council. At the end of January 2020, the White House created the coronavirus task force to be led by HHS Secretary Azar. Nearly a month later, the President appointed Vice President Mike Pence to become the new leader of the task force.\nMorrison, a longtime Republican staffer, left the Trump administration in October 2019. He notably testified in the impeachment inquiry of Trump last fall, telling House impeachment investigators that he was told Trump wanted a top Ukrainian official to announce an investigation that would help the President politically before US security aid to Ukraine would be released.\nHe is currently a senior fellow at the Hudson Institute, a conservative think tank.\nIn an email to CNN, Morrison defended the Trump administration's preparations for a pandemic, and heavily criticized China's handling of the coronavirus outbreak.\nMorrison wrote the Trump administration was \"highly active in drafting the strategy\" to prepare for pandemics and \"already very engaged in dealing with the epidemic of Ebola in the Democratic Republic of Congo (which was ultimately defeated).\"\nMorrison also blamed the Chinese Communist Party \"work[ing] so hard to conceal from the Chinese people and the world the origins of the virus and the extent of its spread, costing the rest of the world months of response time, and compromising the independence of the WHO. We expected the CCP would have learned from its mistakes in 2003 during the outbreak of SARS. Even now, no one believes the numbers being released by the CCP.\"\nUPDATE: This story has been updated to include comments from President Donald Trump and HHS Secretary Alex Azar during the Friday briefing following initial publication of the story.", "url": "https://www.cnn.com/2020/04/03/politics/kfile-officials-worried-over-pandemic-last-year/index.html"}