{"authors": ["Daniel Burke", "Cnn Religion Editor"], "date_download": "2020-05-04 16:19:53", "date_modify": "2020-05-04 16:19:53", "date_publish": "2020-04-05 07:01:06", "description": "For many Catholics in 2020, there's less silly stuff about giving up social media and chocolates. This Lent requires real sacrifice and real isolation -- and it won't end by Easter.", "filename": "2020_04_05_world_lent-catholics-coronavirus-sacrifice_index_1588609193.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190306113755-01-lent-stamp-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_world_lent-catholics-coronavirus-sacrifice_index_1588609193.html", "title": "Quarantine life is starting to feel like a real Lent", "title_page": "Quarantine life is starting to feel like a real Lent - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Monsignor Sam Sirianni tried to pray, but he couldn't help thinking about the day ahead, when he would preside over a funeral for four members of the same family.\nThe Fusco family has been devastated by Covid-19 , the disease caused by the novel coronavirus. Besides the four who died, two other relatives are hospitalized.\nThe large Italian Catholic family are devout members of their parish in Freehold, New Jersey, said Sirianni. He remembers the 11 Fusco children flocking around Grace, the matriarch, who died on March 18, at age 73.\nGrace Fusco with her 11 children. Four members of the Fusco family died within days of each other last month.\nSirianni's parish, the Co-Cathedral of St. Robert Bellarmine, has been shuttered for three weeks and counting.\nAs Holy Week begins, Christians around the world are preparing to celebrate Easter on April 12.\nBut with a pandemic sweeping across the world and many Easter services cancelled or curtailed, it feels like the church calendar has been stuck on Ash Wednesday, when Christians are reminded of their dusty mortality.\n\"The real struggle is that Lent is supposed to end with Easter,\" Sirianni said after presiding over the Fuscos' funeral via Zoom on Thursday. \"But in a certain sense we are not going to have that. We're going to continue to be in this Lent.\"\nWe're trying to find meaning in sacrifice\nObserved by Catholics and some Protestants, Lent is a season of penitence and self-denial, the goal of which is to prepare one's soul for Easter, the holiest day on the Christian calendar. It may be best known, these days, for the small sacrifices people make, like giving up chocolate or Twitter.\nBut this Lent, Christians and non-Christians alike have been forced to surrender a lot more than sweets.\n\"I didn't expect to give up everything for Lent this year,\" goes one grim joke.\nLent, which began on Ash Wednesday and ends this Thursday, commemorates the 40 days Jesus spent fasting in the wilderness, alone and tempted by the devil. Some early Christians called the site of his desert struggle Mount Quarantine.\nQuarantine means something different to us now. Many of us are living through Lent-like experiences, cloistered like monks in our homes, forced to sacrifice our daily routines, thrown back on our own resources.\nEerily empty public squares are a stark mirror of the bare spaces in our lives, once filled by community and communion.\n\"Future generations will look back on this as the long Lent of 2020, a time when disease and death suddenly darkened the whole earth,\" said Archbishop José H. Gomez of Los Angeles, president of the US Conference of Catholic Bishops in a statement this week.\nSome Christians, such as Sirianni, are leaning deeper into their faith, using contemplative prayers to stay centered throughout difficult and death-filled days.\nOthers are turning to monks and other experts in cloistered life. As many have noted , in a sense we are all monks now.\nSusan B. Reynolds, a Catholic theologian, says she's noticed renewed interest in Lent among the Methodists she teaches at Candler School of Theology in Atlanta. Her students are looking to make sense of the self-denial our quarantined lives require.\n\"We are sacrificing our hugs and high fives and parties and income and the regular ordinary lives we used to take for granted,\" she says.\n\"Nobody chose this, but sometimes the sacrifices imposed on us have the most meaning.\"\nWe're using this time for spiritual reflection\nBrother Paul Quenon has been a monk for 62 years at the Abbey of Gethsemani in Kentucky, where the famous monk Thomas Merton was his novice master. An accomplished writer, Quenon is the abbey's answerer of emails sent by strangers.\nQuenon says he's received a number in recent weeks from people joking about how their homes have become virtual monasteries. A more serious email came from a young man in Cincinnati who said he finds it difficult to stay home.\n\"Being stuck at home is what we do by profession here,\" says Quenon, who has a sly sense of humor. \"You can say you're living like a monk for a while.\"\nOver time, monks learn the discipline of structuring their day, Quenon says. It makes the slow and quiet passage of time more tolerable.\nSometimes he sits in Merton's hermitage and watches the shadows lengthen across the grass.\n\"In all this apparent emptiness there is the sense of presence of what cannot be spoken,\" says Quenon, who is 79. \"I am never less alone than when I am alone. Call it faith if you will, or not. If you let it happen, it will happen.\"\nIn North Carolina, J. Dana Trent, a writer and a professor of world religion, is getting tips on living like a monk from her husband, who spent five years as a Hindu monastic. Though no longer a monk, he continues to wake at 5:30 to begin his day with spiritual practice.\nAn ordained Baptist, Trent says she meditates, too, and is using this time for spiritual reflection -- even as she and many others are itching for Easter to arrive.\n\"Right now we are in the midst of wilderness and darkness, and we will need to sit in this space for quite a bit longer,\" she says. \"This disease, Covid-19, forces us to fast from physical touch, from connecting with the things we want to do. It is an invitation to go deeper.\"\nPerhaps our lives now more closely resemble ancient anchorites, religious recluses who lived alone in rooms adjoining churches, said Cathleen Kaveny, a Catholic theologian at Boston College.\nThe anchorites' room had three holes: one for food, one for light, and one to view the Mass next door.\n\"We are all reluctant anchorites by necessity now, with virtual windows on the world,\" Kaveny says.\nThis is a time to choose what matters\nFor many Catholics, one image sums up this Lent: Pope Francis, in an emptied and rainy St. Peter's Square on March 27, his white robes gleaming under dark clouds, praying for an end to the pandemic.\n\"That is Lent,\" says Anthea Butler, a Catholic and scholar of religion at the University of Pennsylvania. \"Pope Francis out there in the square with nobody. That is forty days in the desert, man.\"\nReynolds, the Catholic theologian, says she cries every time she hears the first lines from the Pope's blessing that day.\n\"For weeks now it has been evening,\" the Pope said. \"Thick darkness has gathered over our squares, our streets and our cities. It has taken over our lives, filling everything with a deafening silence and a distressing void.\"\nAppearing alone in St. Peter's Square, the Pope expressed our collective despair and isolation, says Reynolds.\n\"There is a profoud loneliness that creeps in, and by praying alone in the rain the Pope allowed himself to become a symbol of the loneliness and fear we feel all around us.\"\nThis is a time of judgment, Francis said -- not God's, but ours: \"A time to choose what matters and what passes away.\"\nAt home with her husband and their three children, Reynolds says the Lenten lockdown has forced the family to slow down and take stock of their lives.\n\"In a way, it's been the reorientation that Lent's supposed to be. We become a little more patient, a little more kind, a little more human.\"\nLike Quenon, Reynolds says our present situation presents a paradox: By remaining isolated, we show our solidarity with our neighbors and friends.\nEaster can bring the hope of new life\nBack in New Jersey, Monsignor Sirianni is trying to hold his parish together.\nHe calls people on the phone, waves at the nurses praying in the church parking lot before starting their shifts and celebrates Mass at services livestreamed online. His own younger brother has contracted Covid-19, Sirianni says.\nAt times, he feels the gloom evoked by Francis.\n\"I feel that darkness when I look at my church and it's bare,\" he says, \"when we celebrate the Mass and the pews are empty. Something is missing.\"\nA man of faith, the monsignor says Easter will bring the hope of new life, of resurrection after our earthly end. But our fasting, our sacrifices and our isolation will continue.\nThis year, our time in the wilderness will last longer than 40 days.", "url": "https://www.cnn.com/2020/04/05/world/lent-catholics-coronavirus-sacrifice/index.html"}