{"authors": ["Devan Cole"], "date_download": "2020-05-04 16:53:00", "date_modify": "2020-05-04 16:53:00", "date_publish": "2020-04-08 15:52:48", "description": "Former President Barack Obama on Wednesday said it would not be feasible to relax current measures to combat the spread of coronavirus without a \"robust system of testing and monitoring — something we have yet to put in place nationwide.\"", "filename": "2020_04_08_politics_barack-_162b60ed586d2f268b1f04574ca1a969_index_1588611180.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/181102185538-01-barack-obama-1102-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_barack-_162b60ed586d2f268b1f04574ca1a969_index_1588611180.html", "title": "Obama suggests a 'robust system of testing and monitoring' is needed before US can ease current coronavirus measures", "title_page": "Obama suggests a 'robust system of testing and monitoring' is needed before US can ease current coronavirus measures - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Former President Barack Obama on Wednesday said it would not be feasible to relax current measures to combat the spread of coronavirus without a \"robust system of testing and monitoring — something we have yet to put in place nationwide.\"\nThe tweet presents a notable contrast in tone compared to the views of President Donald Trump , who on Wednesday morning tweeted that the country's economy must reopen \"sooner rather than later\" and that the pandemic \"must be quickly forgotten\" for those who haven't lost a loved one. But coronavirus testing is still not widely available, limiting the ability to relax current social distancing guidelines to prevent a resurgence of the virus.\n\"Social distancing bends the curve and relieves some pressure on our heroic medical professionals. But in order to shift off current policies, the key will be a robust system of testing and monitoring -- something we have yet to put in place nationwide,\" Obama wrote in a tweet Wednesday morning.\nGuidelines from the US Centers for Disease Control and Prevention note that \"decisions about testing are at the discretion of state and local health departments and/or individual clinicians,\" and Trump has not floated the idea of a national system for testing and monitoring people stricken with the virus, like China and South Korea are doing.\nThere are nearly 400,000 confirmed cases of coronavirus in the United States, and nearly 13,000 Americans have died, according to a tally from Johns Hopkins University.", "url": "https://www.cnn.com/2020/04/08/politics/barack-obama-coronavirus-nationwide-testing-monitoring/index.html"}