{"authors": ["Wilson Ring"], "date_download": "2020-05-04 20:24:38", "date_modify": "2020-05-04 20:24:38", "date_publish": "2020-04-20 12:33:23", "description": "More than 8,300 checks for $1,200 were sent Monday to people whose unemployment claims were delayed due to a variety of administrative issues, the Vermont Department of Labor said. The...", "filename": "_720c1f4ba68a19b7c88fd40341dede93_1588623878.html", "image_url": "https://storage.googleapis.com/afs-prod/media/aa2970fd6b9a4b34a01aeefbe6e36b6c/2400.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_720c1f4ba68a19b7c88fd40341dede93_1588623878.html", "title": "Unemployment checks mailed to 8,300 to resolve bottleneck", "title_page": "Unemployment checks mailed to 8,300 to resolve bottleneck", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A long line of vehicles parade through downtown Montpelier, Vt., honking, waving and holding signs for more than an hour Monday, April 20, 2020, to protest a proposed plan to shutter three campuses in the Vermont state college system due to coronavirus. (Jeb Wallace-Brodeur/The Times Argus via AP)\nA long line of vehicles parade through downtown Montpelier, Vt., honking, waving and holding signs for more than an hour Monday, April 20, 2020, to protest a proposed plan to shutter three campuses in the Vermont state college system due to coronavirus. (Jeb Wallace-Brodeur/The Times Argus via AP)\nMore than 8,300 checks for $1,200 were sent Monday to people whose unemployment claims were delayed due to a variety of administrative issues, the Vermont Department of Labor said.\nThe checks were prepared over the weekend after officials were unable to resolve stringent federal requirements that kept those people from receiving regular unemployment payments.\nThe money for the checks comes from the state treasury, and they provide two weeks of federal benefits approved to help people affected by COVID-19-related layoffs. The checks likely do not provide the full amount owed but serve as an initial installment, according to the department.\nLate last week, the state had identified more than 34,000 unemployment claims that combined had more than 50,000 stop-payment issues. By Saturday afternoon, officials had resolved more than 20,000 claims.\n“I personally brought them to the mail center this morning,” Gov. Phil Scott said of the checks during his press briefing. “We did this to get money to those in need.”\nOther developments in Vermont:\n___\nREOPENING THE ECONOMY\nVermont began Monday to gradually reopen the state’s economy, allowing single person-businesses with little contact with others and businesses that use crews up to two people who work outside to resume activity if the workers stay at least 6 feet apart.\nJim Smith, a partner in the Stowe property management company Yankee Home Solutions, said his business brought back five people Monday to do spring maintenance work, such as lawn raking.\nEach employee had his own truck and tools, and the company provided masks and bulk sanitizer. The employees were also instructed to keep their distance, Smith said.\nAt the beginning of March, the company employed a total of 15 people, including Smith and his business partner. As COVID-19 expanded and the restrictions grew, they laid off all but two of the employees, but they also began to order emergency supplies such as hand sanitizer and face masks.\nThe two employees who remained were performing vital duties, such as trash collection and emergency home repairs.\n“We are back up and running, so to speak, we are halfway there to going back to work,” said Smith, who estimated the business has been down 85% over the last month.\nThey plan to reopen slowly, based on demand but focused on the safety of the workers, Smith said.\n“We understand the gravity of the situation,” Smith said.\n____\nNUMBERS\nOn Monday, the Vermont Health Department reported the number of new coronavirus cases in the state had increased by four to 816. There have been 38 deaths.\nAfter the first Vermont case was detected in early March, the number of new cases increased to 30 to 40 a day and reached a high of 70 one day earlier this month, Health Commissioner Dr. Mark Levine said Monday. But over the last week, the number of new cases has generally been less than 10 a day.\n“I don’t think it’s a stretch to say that the slope of the curve has clearly changed,” Levine said.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and the infirm, it can cause more severe illness, including pneumonia, or death.\n____\nTESTING\nVermont officials say the key to reopening the state’s economy will be the ability to test people who could have the virus and to trace the contacts of those patients to find others who may have been exposed.\nVermont officials say they have adequate testing capacity for several months at the current level of testing.\nOfficials said they built up the supply through coordination and cooperation so they now have the supplies needed to conduct the tests and have the system in place to test the samples. The state has also benefited because Vermont is experiencing fewer cases than feared.\nAt one point the state was down to two days of testing supplies, Scott said. During a call, Scott told Vice President Mike Pence of Vermont’s predicament.\n“They delivered us tests to get over the hump,” said Scott, a Republican. “So, again, as much as I sometimes criticize the administration, I want to give credit when it’s due as well. They helped us out in our time of need.”", "url": "https://apnews.com/720c1f4ba68a19b7c88fd40341dede93"}