{"authors": ["Bruce Schreiner", "Dylan Lovan"], "date_download": "2020-05-04 20:04:03", "date_modify": "2020-05-04 20:04:03", "date_publish": "2020-04-07 06:43:14", "description": "FRANKFORT, Ky. (AP) — Gov. Andy Beshear reported 147 new coronavirus cases in Kentucky on Tuesday, the largest single-day number since the outbreak began, along with seven more virus-related...", "filename": "_5a335c48bb546443d3686d0c0d9ecc20_1588622643.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5a335c48bb546443d3686d0c0d9ecc20_1588622643.html", "title": "Beshear reports highest single-day number of virus cases", "title_page": "Beshear reports highest single-day number of virus cases", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FRANKFORT, Ky. (AP) — Gov. Andy Beshear reported 147 new coronavirus cases in Kentucky on Tuesday, the largest single-day number since the outbreak began, along with seven more virus-related deaths.\nThe spike in cases followed more modest case numbers the previous two days, which Beshear said appeared to be “artificially low” due to the timing of reporting from some labs.\n“While this is a large number, and it is, we still don’t see the numbers going the same way in Kentucky as in so many other places,” he said of the newest cases.\nThe three-day statewide average for new cases was about 80, which was lower than the prior three days, the governor said during his daily briefing.\nWith the seven latest deaths, Kentucky’s death toll from the virus rose to 65 amid the global pandemic.\nMeanwhile, the governor expressed concerns about coronavirus cases being reported in nursing homes, prisons and a state-operated psychiatric hospital.\nFifty-five residents in 21 nursing homes or other long-term care facilities have tested positive for the virus in Kentucky, he said. Test results from 55 more residents are pending. Eleven residents have died statewide, he said. Twenty-two employees at such facilities also have tested positive, and test results are pending for 41 more employees, he said.\nSafeguards being taken include encouraging the use of face masks, canceling communal dining and social activities and banning visitors except for end-of-life situations, the governor said.\n“We’ve got to make sure that we prevent the coronavirus from getting in as many of these facilities as possible, and then we need to react quickly ... when it does happen,” he said.\nMeanwhile, nine inmates and five staff workers at Green River Correctional Complex at Central City have tested positive for the virus, Beshear said.\n“We are doing everything we can to quarantine and move those that have tested positive or been in close contact with those that have tested positive to other areas,” he said.\nAt Western State Hospital, nine patients and four staff have tested positive, he said. Western State is an acute care, adult psychiatric facility operated by the state.\nWith the approach of Easter this Sunday, the governor continued to urge churches to avoid in-person worship services to help contain the virus’s spread. He acknowledged that it’s hard for his family and for other Kentuckians, but warned such gatherings could ignite more virus cases.\n“I’d like to think that the lessons that we can learn from our faiths tell us that we ought to be committed to protecting one another, to loving our neighbor as ourself, and to not want to put any of our neighbors anywhere in this state in harm’s way,” he said. “And where folks are intentionally putting people in harm’s way, we’re going to start taking action.”\nBeshear also expressed some continued frustration with the effort to bring in more personal protective equipment for medical workers, as states have been forced to bid against each other for dwindled supplies. It’s a topic he has touched on most days in his briefings.\n“Buying PPE right now, virtually nobody has orders that are actually coming in and it’s concerning,” Beshear said. But the governor suggested that it also shows Kentucky doesn’t have hot spots where cases are rapidly rising.\n“One of the the reasons more is not coming to Kentucky is honestly we’re doing a better job flattening our curve,” Beshear said.\nMost people who contract COVID-19 have mild or moderate symptoms, which can include fever and cough but also milder cases of pneumonia, sometimes requiring hospitalization. The risk of death is greater for older adults and people with other health problems.\n___\nFollow AP news coverage of the coronavirus pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.", "url": "https://apnews.com/5a335c48bb546443d3686d0c0d9ecc20"}