{"authors": ["Scott Decamp"], "date_download": "2020-05-04 20:05:21", "date_modify": "2020-05-04 20:05:21", "date_publish": "2020-04-08 22:59:59", "description": "Carlos “Scooby” Johnson longed for the opportunity to add another state championship to his already glittering resume as a four-year Benton Harbor basketball standout. But when the Michigan...", "filename": "_62b4b169586057953598b5f15f4094f7_1588622721.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_62b4b169586057953598b5f15f4094f7_1588622721.html", "title": "Benton Harbor's Johnson adds AP POY to impressive award haul", "title_page": "Benton Harbor's Johnson adds AP POY to impressive award haul", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Carlos “Scooby” Johnson longed for the opportunity to add another state championship to his already glittering resume as a four-year Benton Harbor basketball standout.\nBut when the Michigan High School Athletic Association announced it was canceling the remainder of the 2019-20 sports seasons amid the coronavirus pandemic, it spelled the end of his dream and his sparkling Tigers career.\nIf it’s any consolation to the Butler-bound, 6-foot-6 power forward, he did haul in another noteworthy individual honor on his way out. Johnson has been named The Associated Press Division 2 Player of the Year, adding to the Michigan Mr. Basketball award he received on March 23.\n“I was kind of thinking about it all day, kind of a little depressed,” he said about top-ranked Benton Harbor’s 20-2 season ending several steps short of the Breslin Center, where two years ago his game-winning 3-pointer in overtime led the Tigers to their first state title in 53 years.\n“The district (semifinal) was my last game playing, so it was kind of hard for me to take it in. … We were clicking on all cylinders.”\nJohnson averaged 25 points and 11 rebounds per contest this season. A four-time selection to the All-State first team, he averaged a double-double in his Tigers career. He finishes as Benton Harbor’s career leader with 1,940 points.\nJohnson is the third Mr. Basketball award winner for perennial power Benton Harbor, joining Wilson Chandler (2005) and Anthony “Pig” Miller (1990).\nBenton Harbor coach Corey Sterling said that Johnson is the type of player who can control a game without scoring a point. He does what it takes to win and carries his teammates with him, evidenced by the Tigers’ 91-9 overall record during his career.\n“Just the ultimate winner, you know. I say Carlos is the best player to ever play here at Benton Harbor as far as on paper,” Sterling said. “No other player has Mr. Basketball and a state championship. There’s not too much you can say after that.”\nJohnson was joined on the AP Division 2 All-State first team by Benton Harbor teammate Quindarius Davis. Other first-teamers included Detroit Douglass’ Pierre Brooks, Grand Rapids Christian’s Kobe Bufkin, Houghton’s Brad Simonsen, Muskegon Orchard View’s Ke’Ontae Barnes, Williamston’s Mason Docks, Ferndale’s Colin Golson, Goodrich’s Tyson Davis and Otsego’s Charlie Woodhams.\n“I look at it as a blessing to accomplish all of these accolades and goals that I’ve had as a basketball player,” Johnson said.\n“It means that a lot of my hard work is paying off right now. I’m getting my name out there now and the great awards that are coming my way — it just means a lot to me now.”\nGoodrich’s Gary Barns, who completed his 29th season as head coach and 41st year with the program, was voted AP Division 2 Coach of the Year after leading the Martians to a 21-1 record and No. 2 state ranking.\n___\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports", "url": "https://apnews.com/62b4b169586057953598b5f15f4094f7"}