{"authors": ["Catherine E. Shoichet"], "date_download": "2020-05-04 15:58:55", "date_modify": "2020-05-04 15:58:55", "date_publish": "2020-03-31 21:59:03", "description": "The results of the 2020 census will impact the lives of people around the country. But already the coronavirus pandemic is complicating the count.", "filename": "2020_03_31_us_census-2020-things-to-know_index_1588607935.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200311103024-01-us-census-2020-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_us_census-2020-things-to-know_index_1588607935.html", "title": "Census 2020: What you need to know", "title_page": "Census 2020: What you need to know - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "This is an updated version of a story that was originally published March 12.\n(CNN) Households across the United States have been receiving invitations to complete the 2020 census for weeks. But another milestone in the count is here.\nApril 1 is known as Census Day.\nAnd around the country, local officials are encouraging residents to complete census questionnaires this week.\n\"Lots of people are home right now, as you should be. But the truth is, it's also a great time to fill out your census,\" Michigan Gov. Gretchen Whitmer said in a video message\nThe results of the 2020 census will impact the lives of people around the country. And everyone living in the US plays a role in shaping them.\nHere are some key things you need to know:\nThe census is a big deal.\nThe census, which happens every 10 years, determines how many representatives each state gets in Congress, and how billions of dollars in federal funding gets spent. Schools, roads, and other important things in your community will gain -- or lose -- funding over the next 10 years depending on this official population tally.\nThis is something the Census Bureau has been emphasizing in a $500 million outreach campaign featuring more than 1,000 ads that have been hitting the airwaves for months. Why? Because, according to experts, when people learn why the census is important, they're more likely to respond.\nIt's required by law.\nThe census is required by the Constitution.\nAnd on the envelopes en route to mailboxes across America, the message is clear -- printed in bold letters on the outside of the envelope: \"YOUR RESPONSE IS REQUIRED BY LAW.\"\nWhat if you refuse to respond or want to skip a question? You can be fined , according federal statutes.\nThis year there's a significant change to how people are being counted.\nIt's the first time all households in the United States will have the chance to respond online\nThe coronavirus pandemic is having an impact.\nCensus mailings started going out to homes across the country earlier this month, just as the coronavirus pandemic was beginning to heat up in the United States.\nCurrently, those operations are suspended until April 15 while the Census Bureau evaluates the situation.\nLawmakers have said they're worried about the timing.\nSen. Tina Smith, who along with several Democratic colleagues sent a letter to the Census Bureau earlier this month asking about coronavirus plans, said she's worried in the wake of coronavirus officials may rely too much on internet responses, something she fears could result in undercounting communities.\n\"It's a great concern,\" she said.\nCensus spokesman Michael Cook told CNN the agency has plans in place for people, households and communities that \"don't have high connectivity to the internet.\" And officials say the way the census is designed -- giving people multiple ways to respond -- will allow local operations to adapt if necessary.\n\"If we need to delay or discontinue nonresponse follow-up visits in a particular community, we will adapt our operation to ensure we get a complete and accurate count,\" the Census Bureau has said\nA citizenship question isn't on the census.\nEveryone living in the United States is supposed to be counted by the census, whether they're citizens or not.\nThe Supreme Court blocked the Trump administration from putting a citizenship question on the census . But even though that question isn't in the mix, there are still concerns about whether the months-long debate over it will influence response rates.\nWorried some people will be scared to respond to the census, advocates who work with immigrant communities have been doubling down on their outreach efforts in recent months.\nFielding questions at a recent event in Washington, Census officials stressed that Title 13 of the U.S. Code guarantees that personal information provided for the census is confidential.\n\"I can assure you that not only does the law require us to do our job professionally and protect confidential information, but we have all the systems in place -- the most sophisticated systems available -- to protect the information,\" Director Steven Dillingham said.\nThe first 2020 census mailings you get might include a written questionnaire -- or they might not.\nThe US Census Bureau has been sending different mailings to different households, depending on a variety of factors\nAbout three of every four households will receive an invitation to complete the census online or on the phone. The invitation will be in English and Spanish \"in areas where 20% or more of households need Spanish assistance,\" the Census Bureau says.\nIn areas of the country where officials feel residents are less likely to respond online, a written questionnaire will come in the initial mailing, too.\nOfficials have released sample images showing all of the mailings , which began arriving March 12, to help members of the public avoid potential scams.\nAccording to the Census Bureau, households that haven't yet responded to the census will receive a written questionnaire in April.\nUp to half a million temporary workers could be hired to help with this count.\nOfficials estimate that about 60% of people will reply to questionnaires in the mail, on the phone or online. Census-takers will need to go door-to-door to get responses from the rest -- and they don't have much time to do it.\nBut major efforts to go door-to-door and follow up with households that haven't responded yet to the census aren't scheduled to start for a few months.\nAccording to the official schedule for the 2020 census , that will largely happen from May to July. By December 31, 2020, the US Census Bureau is required by law to report population counts from the new census to the President.\nSome people have already been counted in this year's census.\nWhile this week's rollout marks a milestone for the 2020 census, technically the census already started months ago.\nThe 2020 census began Jan. 21 in Toksook Bay, Alaska. The census has started in rural Alaska ever since the U.S. purchased the territory from Russia in 1867.\nIt's a tradition for the census to start earlier in remote parts of Alaska, where large portions of the state aren't connected by roads and can have spotty mail service.\nDillingham, the census director, rode into town on a snowmobile and knocked on a door himself to officially begin the count.", "url": "https://www.cnn.com/2020/03/31/us/census-2020-things-to-know/index.html"}