{"authors": ["Jeremy Herb", "Manu Raju"], "date_download": "2020-05-04 16:59:57", "date_modify": "2020-05-04 16:59:57", "date_publish": "2020-04-09 21:40:42", "description": "Congressional Republicans are toughening their stance against Democrats' efforts to provide states more funding for mail-in voting in the next stimulus package to address the coronavirus pandemic as President Donald Trump rails against the proposal on Twitter and at his daily press briefings.", "filename": "2020_04_09_politics_mail-vote-fight-congress_index_1588611597.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409005522-donald-trump-april-8-2020-01-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_mail-vote-fight-congress_index_1588611597.html", "title": "GOP aligns with Trump in vote-by-mail clash looming over next relief package", "title_page": "GOP aligns with Trump in vote-by-mail clash looming over next relief package - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Congressional Republicans are toughening their stance against Democrats' efforts to provide states more funding for mail-in voting in the next stimulus package to address the coronavirus pandemic as President Donald Trump rails against the proposal on Twitter and at his daily press briefings.\nThe dispute could lead to a major stand-off as Congress begins negotiations for the next massive funding bill to try to prop up the economy and get states the resources they need.\nHouse Speaker Nancy Pelosi and Senate Minority Leader Chuck Schumer say funding for elections is essential for the next stimulus package in order to address the dangers voters face going to the polls in the midst of a pandemic.\nDemocrats want to expand vote by mail and early voting for all states, as well as allow for same-day voter registration across the country.\nTrump and Republican congressional leaders have rejected the notion of expanding vote by mail, accusing Democrats of seizing on a public health crisis to push their voting agenda. Trump has already weighed in repeatedly on Twitter, dismissing the notion of a nationwide vote-by-mail system and falsely claiming that mail-in voting is the source of widespread voter fraud\n\"Republicans should fight very hard when it comes to state wide mail-in voting. Democrats are clamoring for it,\" Trump tweeted Wednesday.\nThe dispute doesn't appear likely to stop the interim funding package currently being debated, which is running into other partisan issues after competing Republican and Democratic Senate proposal were blocked Thursday . But the election fight is shaping up to be the biggest battle-line between the two parties as they look to hammer out a larger, fourth coronavirus stimulus bill.\nIt's an extension of a long-running partisan feud over voting that's been waged over allegations of voter fraud, requiring identification and culling voter rolls -- and the coronavirus pandemic doesn't appear to be slowing the fight.\nRepublican House Minority Leader Kevin McCarthy said he warned fellow Californian Pelosi in Senate Majority Leader Mitch McConnell's office during the last stimulus negotiations that she should not hold up the bill to push for Democratic election priorities.\n\"I said, 'I'm not holding a bill up because you want to change the election law,'\" McCarthy said in a conference call with reporters Thursday. \"Let's focus on the virus, let's cure the problem of what's in front of us, let's get our economy back on its feet. And then we can debate about the election.\"\nTuesday's primary in Wisconsin -- which took place despite the coronavirus pandemic after state Republicans challenged Democratic Gov. Tony Evers' attempt to delay the election until June and the state Supreme Court blocked his executive order -- has only galvanized Democrats' push to include election provisions in the next stimulus package.\n\"We have a different value system about what voting means for a democracy. Clearly, we want to remove all obstacles to participation,\" Pelosi said Thursday when asked to respond to McCarthy's criticisms.\n\"We do want to have vote by mail because we think again it removes obstacles to participation, but it's also healthier at this time,\" she added. \"Some people may prefer to go to the polls, but the lower that number is, the healthier for everyone.\"\nDemocrats charge that Trump and congressional Republicans are making false claims about voter fraud to try to muddy the waters on the issue. Virginia Sen. Mark Warner, the top Democrat on the Senate Intelligence Committee, said Trump and his allies were \"undermining public trust in our election system during a crisis by against misrepresenting the threat of voter fraud.\"\n\"There's been no allegations of fraud in the areas that use only absentee ballots,\" said House Administration Chair Zoe Lofgren, a California Democrat whose committee has put forward the House's election proposals.\nDemocrats seek more funding, expanded mail voting\nSchumer, a New York Democrat, told reporters earlier this week it was of \"a very high priority\" for Senate Democrats. House Majority Whip Jim Clyburn of South Carolina, a key advocate driving the effort, told House Democrats on a conference call Wednesday that the next stimulus package should include as much as $4 billion in voting assistance for states, according to sources on the call.\nPelosi has told her colleagues and reiterated Thursday there needs to be a minimum of $2 billion in the next package.\nThe $2.2 trillion stimulus package that was signed into law last month included $400 million for states to use to prepare for the 2020 election, short of the $4 billion that House Democrats have proposed. The bill also included provisions on the funding for states to match some funds and reporting requirements that Democrats are now pushing to remove. The Senate Democratic amendment that was proposed Thursday included \"technical fixes\" to address those concerns.\nStill, the larger fight is over the expansion of vote-by-mail provisions that Democrats say are necessary in the face of the pandemic.\nWhen the House unveiled its own bill during negotiations for the $2 trillion stimulus package, it included a number of election-related provisions. The Democrats' measure included a new nationwide standard so every voter could vote by mail, required states to develop contingency plans for voting during emergencies like pandemics, set a nationwide minimums of 15 days of early voting prior to a federal election and required same-day voter registration on the day of a federal election.\nThose provisions did not make it into the final $2.2 trillion bill, which passed the Senate 96-0 and was approved by voice vote in the House last month.\nDemocratic aides and lawmakers say those measures are likely to form the basis of the House's election legislation that will go into the next stimulus bill.\nBut Republicans are lining up against the proposal. Rep. Rodney Davis of Illinois, the top Republican on the House Administration Committee, said the measures Pelosi put forward during the last round of stimulus talks were \"last-minute efforts by the speaker and Democrats to insert provisions that they've been trying to turn into law on a partisan basis this entire Congress.\"\n\"It's just another attempt by the Democrats in Washington to try to nationalize and federalize our election process,\" Davis said in an interview.\nSenate debate also falls along partisan lines\nSimilar election legislation has been introduced in the Senate by Democratic Sens. Amy Klobuchar of Minnesota and Ron Wyden of Oregon. The senators proposed a bill last month that would give all voters the option to vote by mail and expand early voting to 20 days in all states.\nKlobuchar pointed to Wisconsin's primary as reason to adopt the new rules and provide states additional election funding, holding a conference call with secretaries of state from both parties to advocate for the effort.\n\"To see those voters lining up risking their own lives just to exercise their right to vote, brought home to everyone ... how we have to prepare so that people don't lose their right to vote in November,\" Klobuchar said.\nWyden said Democrats weren't trying to \"reinvent the wheel,\" and were simply \"up-scaling what's already taking place.\"\nBut Senate Republicans also appear resistant to passing new election legislation. Even before the coronavirus crisis, House Democrats clashed with McConnell, as the Kentucky Republican dismissed the voting rights legislation passed by the House last year as an attempt by Democrats to tilt elections their direction.\nSenate Rules Chairman Roy Blunt touted the election funding provided in the third stimulus bill for state and local governments, saying the issue should be about addressing their needs.\n\"We will not let Democrats exploit this public health emergency to expand the reach of the federal government into state and local elections as they have tried and failed to do for years,\" the Missouri Republican said in a statement.\nSen. Chris Coons, a Delaware Democrat, argued the proposals weren't \"about a federal takeover of elections.\"\n\"It's about the federal government providing the resources and the framework for improving how American exercise the right to vote without jeopardizing their health,\" Coons said.", "url": "https://www.cnn.com/2020/04/09/politics/mail-vote-fight-congress/index.html"}