{"authors": ["Russ Bynum"], "date_download": "2020-05-04 20:24:45", "date_modify": "2020-05-04 20:24:45", "date_publish": "2020-04-14 18:24:23", "description": "SAVANNAH, Ga. (AP) — Coronavirus deaths topped 500 Tuesday in Georgia, where the governor has taken action to ensure the wearing of protective masks at grocery stores and other public places...", "filename": "_2ef6615981f16ee75eabbe8c8f676da7_1588623885.html", "image_url": "https://storage.googleapis.com/afs-prod/media/3a72250831df4b03bfa2127027848ba9/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2ef6615981f16ee75eabbe8c8f676da7_1588623885.html", "title": "Georgia virus deaths top 500; mask law targeting Klan waived", "title_page": "Georgia virus deaths top 500; mask law targeting Klan waived", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A group of masked individuals left the Georgia World Congress Center on Monday April 13, 2020 after Gov. Brian Kemp announced Easter Sunday that the state will convert part of the sprawling Georgia World Congress Center into a 200-bed hospital for coronavirus patients, as Christians observed the holiest day for the faith by largely abiding by the governor's pleas to stay home and watch services online.(John Spink/Atlanta Journal-Constitution via AP)\nA group of masked individuals left the Georgia World Congress Center on Monday April 13, 2020 after Gov. Brian Kemp announced Easter Sunday that the state will convert part of the sprawling Georgia World Congress Center into a 200-bed hospital for coronavirus patients, as Christians observed the holiest day for the faith by largely abiding by the governor's pleas to stay home and watch services online.(John Spink/Atlanta Journal-Constitution via AP)\nSAVANNAH, Ga. (AP) — Coronavirus deaths topped 500 Tuesday in Georgia, where the governor has taken action to ensure the wearing of protective masks at grocery stores and other public places doesn’t violate a law passed decades ago to unmask the Ku Klux Klan.\nThe Georgia Department of Public health reported 524 deaths linked to the coronavirus statewide, while confirmed infections rose above 14,500. Infection rates remain highest in mostly rural southwest Georgia, where Dougherty County leads the state with 78 deaths. Statewide, more than half of of deaths where race is known are among blacks, who make up roughly a third of the population.\nThe dead include an administrator at a Georgia prison. The state Department of Corrections said in a statement Tuesday that Roger Hodge, deputy warden for security at Calhoun State Prison in southwest Georgia, had died from “complications related to COVID-19.”\nOn Monday, Republican Gov. Brian Kemp declared a pandemic exemption from a 1951 state law that prohibits wearing masks in public after some black officials warned that some African Americans, fearing harassment by police, might not cover their faces for protection.\nThe anti-mask law makes it a misdemeanor to wear “a mask, hood” or other face covering to “conceal the identity of the wearer” on public property. Georgia passed the law to prevent Klan members from wearing hoods during public rallies and marches.\nWith the federal Centers for Disease Control now encouraging Americans to wear masks that cover the mouth and nose in public, Kemp signed an order Monday that says the anti-mask law can’t be enforced against people covering their faces as protection against the virus.\nKemp told a news conference he wanted to ensure that “people can follow the guidance of public health officials without fear of prosecution” amid the global pandemic.\nKemp thanked Atlanta Mayor Keisha Lance Bottoms for raising concerns about the anti-mask law. Last week, Bottoms ordered Atlanta police to suspend enforcement of the law\nState Sen. Nikema Williams of Atlanta, who heads the Georgia Democratic Party, had also urged Kemp to take action. In a letter Friday, Williams told Kemp she feared racial profiling by police “will only get worse for people of color who wear homemade cloth coverings.”\nEven if Kemp hadn’t taken action, it would have been illegal for police to bring charges against anyone peacefully wearing a mask for protection. Georgia courts have long interpreted the anti-mask law to apply only to people concealing their faces for purposes of intimidation.\nIn 1990, the Georgia Supreme Court rejected a Klan member’s argument in a lawsuit that the law “criminalizes a substantial amount of innocent behavior.” The court ruled the law applied “only to mask-wearing conduct” that “provokes a reasonable apprehension of intimidation, threats or violence.”\nThe Georgia Department of Public Health released a list Tuesday saying 138 long-term care facilities such as nursing homes and assisted living centers were reporting infections, up from 80 last week. The department counted more than 800 infected residents and staff members. No updated total was given for deaths, which last week were listed as 81. The list includes six nursing homes with more than 30 infections, topped by PruittHealth Palmyra in Albany with 70 infections.\nMeanwhile, the chief executive of one of Georgia’s largest hospitals said coronavirus cases have leveled off after weeks of daily growth. Grady Memorial Hospital in Atlanta has held steady over the past week with about 100 patients who have either tested positive for the virus or are under evaluation for COVID-19, CEO John Haupert said in an interview Tuesday.\nWhile some are predicting that Georgia will see infections peak by the end of April, Haupert noted the timing has already been pushed back several times.\n“To be honest, part of what wears me out is the second guessing we have to do about what’s around the next corner because it is unknown,” he said.\nFor most people, the new coronavirus causes mild or moderate symptoms that usually clear up within weeks. For some, especially older adults and those with existing health problems, it can cause severe illness and be life-threatening.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak\n___\nAP writers Sudhin Thanawala, Jeff Amy and Ben Nadler in Atlanta contributed to this report.", "url": "https://apnews.com/2ef6615981f16ee75eabbe8c8f676da7"}