{"authors": ["Aj Willingham"], "date_download": "2020-05-04 16:12:59", "date_modify": "2020-05-04 16:12:59", "date_publish": "2020-04-03 10:08:47", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "filename": "2020_04_03_us_five-things-april-3-trnd_index_1588608779.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403033822-coronavirus-masks-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_us_five-things-april-3-trnd_index_1588608779.html", "title": "5 things to know for April 3: Coronavirus, health, economy, election, Zoom", "title_page": "5 things to know for April 3: Coronavirus, health, economy, election, Zoom - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "If your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' newsletter.\n(CNN) The March jobs report comes out later today. It's the first time we'll see what the coronavirus crisis has done to the labor market . But, experts warn, we won't know the full effects until next month.\nHere's what you need to know to Get Up to Speed and On with Your Day.\n(You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily. Sign up here .)\n1. Coronavirus\nJUST WATCHED Louisiana coronavirus cases spike Replay More Videos ... MUST WATCH Louisiana coronavirus cases spike 02:33\n2. Health\nJUST WATCHED Confused on whether you need a mask or not? Gupta has the answer Replay More Videos ... MUST WATCH Confused on whether you need a mask or not? Gupta has the answer 02:07\n3. World economy\nThe European Commission has proposed a new $109 billion relief initiative to support the millions of Europeans left without a job because of the coronavirus crisis. The program would encourage employers in member states to reduce employees' hours instead of laying them off. The EU's 27 members still need to vote on the measure. EU countries already have contributed billions of dollars to buoy business and workers, and Europe's central bank has promised hundreds of billions more. Meanwhile, oil prices, which have been at historic lows, spiked as President Trump suggested massive production cuts and Saudi Arabia called for an emergency OPEC meeting to stabilize the market. That meeting will happen Monday and could signal a truce in the brutal oil price war between Saudi Arabia and Russia that's dragged down the market.\nJUST WATCHED The economy is crumbling. What will a recovery look like? Replay More Videos ... MUST WATCH The economy is crumbling. What will a recovery look like? 01:43\n4. Election 2020\nJUST WATCHED Democratic National Convention postponed until August Replay More Videos ... MUST WATCH Democratic National Convention postponed until August 01:46\n5. Zoom\nJUST WATCHED Coronavirus worries are giving Zoom a boost Replay More Videos ... MUST WATCH Coronavirus worries are giving Zoom a boost 01:57\nBREAKFAST BROWSE\nAustralia's National Rugby League wants to fly its players to a remote tropical island to continue the season and get games back on TV\nIs this a new reality show? Because it sounds like a new reality show\nHow the film 'Contagion' compares with a real pandemic\nThis also feels like a reality show now, and we don't like it at all\nA restaurant in NYC is offering a $600 doomsday dinner, delivered to your door by bunnies\nStephen Colbert's dog Benny is the new star of the 'Late Show'\n4 major hurricanes are predicted as part of an above-normal Atlantic hurricane season\nJUST WATCHED Why hurricanes are so hard to predict Replay More Videos ... MUST WATCH Why hurricanes are so hard to predict 01:07\nFOR YOUR SNACK BREAK\nHere's everything we've learned this week about our ancient ancestors\nA multitude of studies have revealed intriguing new details and silenced debates about ancient humans. These revelations don't just illuminate the past, they also strengthen its connection to the present.\nTODAY'S NUMBER\n582\nThat's how many passengers air carrier Cathay Pacific says it flew in an entire day . For reference, its flights usually carry around 100,000 people a day. The lack of demand has caused Cathay Pacific, along with many others, to slash its schedule.\nJUST WATCHED Coronavirus is hitting the travel industry hard Replay More Videos ... MUST WATCH Coronavirus is hitting the travel industry hard 03:06\nTODAY'S QUOTE\n\"The seeds of this crisis certainly can be laid at the feet of the Chinese government, but then there's the Chinese people, who suffered some of the same things that we're suffering.\"\nAndrew Yang, talking about the Former Democratic presidential candidate, talking about the racial abuse that Asian Americans have suffered because of the coronavirus pandemic\nJUST WATCHED Yang: Seeds of virus on Chinese government but not its people Replay More Videos ... MUST WATCH Yang: Seeds of virus on Chinese government but not its people 05:35\nTODAY'S WEATHER\nJUST WATCHED Storm system brings snow to Midwest and severe storms to Texas Replay More Videos ... MUST WATCH Storm system brings snow to Midwest and severe storms to Texas 01:56\nAND FINALLY\nMaking music with bees", "url": "https://www.cnn.com/2020/04/03/us/five-things-april-3-trnd/index.html"}