{"authors": ["Foreign Affairs Reporter"], "date_download": "2020-05-04 20:21:23", "date_modify": "2020-05-04 20:21:23", "date_publish": "2020-04-29 18:29:14", "description": "Over 1 million displaced Rohingya and the Bangladeshi community hosting them are vulnerable, and humanitarian groups helping the refugees face increasing...", "filename": "entry_rohingya-coronavirus-bangladesh-aid-workers-oxfam_n_5ea997b7c5b6123a1765a2eb_1588623683.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9b29b2200001d0d827df4.jpeg?cache=ijcsk039ws&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_rohingya-coronavirus-bangladesh-aid-workers-oxfam_n_5ea997b7c5b6123a1765a2eb_1588623683.html", "title": "How Aid Workers Are Preparing The World's Biggest Refugee Camp For Coronavirus", "title_page": "How Aid Workers Are Preparing The World's Biggest Refugee Camp For Coronavirus | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "For millions of people worldwide, no longer going in to work is a way to limit the spread of the coronavirus. For aid workers who serve the world’s largest refugee camp, staying home could mean making the outbreak worse.\nMoury Rahman, a senior public health officer for the charity Oxfam, has spent nearly three years working with refugees in Kutupalong, a settlement in Bangladesh, and other nearby camps, which together host over a million Rohingya, a minority group from neighboring Myanmar. In the summer of 2017, many Rohingya fled to Bangladesh after a government-backed assault on their population that bordered on genocide.\nThose refugees, the aid workers who help them, and the country hosting them are now all vulnerable to the new threat of COVID-19, the disease caused by the coronavirus. To combat the pandemic, they have to balance a broad national shutdown with the reality that, in order to ensure people are staying safe, aid workers “need face-to-face visits” with the refugees, Rahman told HuffPost.\nRahman and other Oxfam workers need to visit refugee camps to monitor whether limits on public life have had worrying knock-on effects like increased domestic violence; to combat rumors and misinformation that could have life-and-death consequences; and to learn about urgent problems as soon as they arise — like broken fixtures in bathroom facilities. They have to check if families have enough soap, a key defense against the new virus. They need to sustain relationships with the dozens of Rohingya volunteers who are essential to keeping the camps running, and talk with community leaders like clerics and traditional healers who will be vital to helping people recognize symptoms and change their behavior to lessen the impact of coronavirus.\n“We really need to understand what people in the community understand,” Rahman said.\nInternational experts believe encampments like Kutupalong, where social distancing is difficult and residents’ immunity is already depleted, could become infection hotspots. Bangladesh already has more than 7,000 confirmed cases of coronavirus; none have been reported among the Rohingya, who are being tested at low rates.\nHumanitarian organizations like Oxfam have had to adjust quickly as the years-long crisis they’ve been trying to manage has become more complicated.\nOn April 9, Bangladeshi authorities ended travel to and from Cox’s Bazar, the southern district home to Kutupalong and other camps. The government has also deployed security forces to limit movement into and within the crowded facilities of the refugee camps.\nThese refugees were already partially cut off from the broader country. In September, Bangladesh cracked down on mobile services for the Rohingya, stopping them from buying SIM cards and confiscating thousands that they had already bought, and limiting internet coverage in the areas where they live. The controversial policy, which authorities said was needed because of security concerns, now hinders aid workers’ knowledge of the situation and refugees’ access to coronavirus-related information and emergency hotlines, 50 human rights groups said in a letter to the government earlier this month.\nOxfam is still going to the camps, but it can’t serve them the way it used to. Where it once regularly sent 100 aid workers in, it’s now sending 10 to 15, according to Dipankar Datta, the organization’s country director, and doing so twice a week at most.\n“We are respecting the government’s regulatory framework … Our regular program is affected, but if it saves human lives, that’s more important,” Datta added, noting that education services and most outreach to combat gender discrimination are on hold.\nAmid the sudden jolt to humanitarian operations and the challenge of COVID-19, aid workers say they are freshly reminded of the importance of being guided by the communities they serve: It’s Rohingya refugees themselves, not outsiders, who will determine how the camps fare.\n“It’s our approach that we set up two-and-a-half years ago that’s now giving us the benefit: What we have done is we have placed the community in the leadership,” Datta said. “Imams are encouraging the community ― ‘OK, don’t come to the mosque’ ― or mothers are telling their children, ‘Don’t go out.’”\nAppreciating the Rohingya’s own priorities and sensitivities helped Rahman and her team in the early stages of their work ― for example, figuring out how to design a latrine that people, especially women wary of shared spaces, would actually use. Now they’re bringing that knowledge to the coronavirus response, advising other groups on how to design clinics so refugees feel comfortable coming to them, and talking to community leaders about ways to ensure infected people or households aren’t shunned.\nIt helps that the Rohingya aren’t doubting the seriousness of the new threat.\n“I find refugees are more responsible than us,” said Datta, who’s worked in other similar contexts, most recently in South Sudan. “They have gone through a traumatic situation, they understand the great danger that they have and the level of vulnerability. They are more responsive to messages than we are … They are good listeners and they try to put it into practice.”\nWhile following new coronavirus prevention measures, it’s a different pace of work: Rahman and other field workers aren’t offering people information in large groups anymore, instead sticking to household consultations or one-on-one interactions. But that isn’t always stressful: While managing queues at a distribution center for soap during a recent visit, Rahman turned the precaution into a game, asking people to gather in a wide circle marked out with chalk to demonstrate appropriate distance. “They were laughing, they were in a jolly mood; they said, ‘We feel really safe now,’” she recalled.\nAid workers are urging international organizations and donors to make sure the coronavirus strategy for the camps doesn’t neglect the native community in the region, which is now less than one-third of the refugee population. A response only focused on the refugees wouldn’t adequately limit the spread of the virus given the way the two groups of residents are now enmeshed, and it could risk animosity towards the Rohingya.\nMalaysia has stopped accepting boats filled with desperate Rohingya, citing coronavirus worries. Earlier this month, Bangladesh rescued a group of nearly 400 people who were left adrift because of the policy, but has since said it will not accept refugees in similar situations, prompting international criticism. The nation’s increasing wariness of the Rohingya has worried some refugees and aid workers.\n“If we do not provide adequate support to the host community, you have the potential to prop up tension,” Datta said.\nCOVID-19 is just one challenge the Rohingya and the area’s longtime inhabitants share, noted Rahman, who lives in Cox’s Bazar. Cyclone season is setting in too ― and that requires its own set of precautions for both communities.\n“We are all in the same boat,” Rahman said.\nOxfam officials are also trying to account for their aid workers’ health, including their peace of mind amid a crisis that could affect them and their families. Datta realized the importance of keeping up morale after speaking with Oxfam colleagues who worked on the Ebola outbreak. He encouraged those normally at his headquarters to work from home weeks ago, and has pushed local United Nations officials to develop personal protective equipment and treatment plans for the thousands of humanitarian staff that are in Bangladesh to help the Rohingya.\nThroughout the little ecosystem that has developed in response to the Rohingya’s plight, the rise of the virus has made solidarity more important.\n“I talk to my team members, and I ask them, ‘Are you not afraid?’ Datta said. “The reply is, ‘They are now my relatives, I care about them — and this is the time they need us most.’”", "url": "https://www.huffpost.com/entry/rohingya-coronavirus-bangladesh-aid-workers-oxfam_n_5ea997b7c5b6123a1765a2eb"}