{"authors": ["Samuel Petrequin"], "date_download": "2020-05-04 20:26:54", "date_modify": "2020-05-04 20:26:54", "date_publish": "2020-04-28 21:28:41", "description": "Belgium's potato industry could lose millions if hundreds of tons of surplus spuds don’t move this year.", "filename": "entry_belgians-eat-more-fries-please_l_5ea89e30c5b61b5fd93e6f06_1588624014.html", "image_url": "https://img.huffingtonpost.com/asset/5ea89ef2250000bb0feb083e.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_belgians-eat-more-fries-please_l_5ea89e30c5b61b5fd93e6f06_1588624014.html", "title": "Belgian Officials Urging Citizens To Double Their Intake Of Fries", "title_page": "Belgian Officials Urging Citizens To Double Their Intake Of Fries | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "BRUSSELS (AP) — In a country that claims to be the real birthplace of the finger food that Americans have the temerity to call French fries, rescuing the potato industry might easily be a matter of Belgian national pride.\nSo while a coronavirus lockdown keeps restaurants, bars and many of Belgium’s 5,000 frites stands closed, the trade association for the national potato industry is calling on the population at large to do its part by keeping deep fryers fired up on the home front.\n“Traditionally, Belgians eat fries once a week, and it’s always a festive moment,” Romain Cools, the Belgapom secretary general, said in a phone interview on Tuesday. “Now, we are asking them to eat frozen fries twice a week at home.”\nThe demand for frozen potatoes has nosedived in recent weeks, and the Belgian industry faces a possible loss of 125 million euros ($135.5 million), if hundreds of tons of surplus potatoes don’t move this year, Cools said.\n“This is the first time in my 30-year career that I need to call on authorities for help,” he said. “The potato sector is so important. It should be helped because it’s a flagship for our whole industry.”\nAs the immediate future remains gloomy, the industry wants to find new ways to move its surplus stock and avoid aste. In partnership with the Dutch-speaking Flemish region of Belgium, Belgapom has set up a program to deliver 25 tons of potatoes a week to food banks. Businesses are working to export some of their supplies to Central Europe and Africa, where the demand remains high.\nThe industry is also looking at ways to work with starch factories to find other uses for excess potato stocks, such as feeding livestock or producing green electricity.\nBoth France and Belgium claim to have invented fried string potatoes as a side dish. But the ’pomme frites” culture is stronger in Belgium, where people share a taste for beer with the chip-eaters in Britain.\nBelgians eat 38 kilograms (about 84 pounds) of fresh potatoes and 6-7 kilograms (13-15 pounds) of processed potatoes at home every year, according to Belgium’s National Union of Fry-makers. But even if consumers unite in upping per capita consumption of fries, the potato sector won’t emerge from the pandemic unscathed.\nBefore the coronavirus reached Europe, the 2020 prospects looked bright for Belgium’s potato industry, the world’s largest exporter, following a 7.5% rise last year in the production of frozen fries. But the virus outbreak halted exports to China, then triggered a slowdown of potato sales across Europe as lockdown measures were implemented.\nAfter supermarkets saw shoppers grab all the potatoes they could hoard, demand quickly plummeted and kept falling with the closure of fast-food chains, according to Belgapom.\nAlthough Belgium is set to lift the home confinement order for most the country’s 11.5 million people as soon as Saturday, no date has been set for restaurants to reopen.\nThe outside shacks known as “fritkoten” where Belgians queue up day in and day out in normal times to buy their beloved fries, were allowed to remain open for takeaway orders during the national lockdown, but an estimated 80% stayed closed anyway after local authorities offered compensation for shuttered businesses.\nPascal Vandersteegen, the manager at Chez Clementine, a popular fritkot in the south of Brussels, says he has witnessed a l30% loss in revenue because of retrictions imposed to address the virus.\n“Now, we have to close at 10 p.m. every day” he said. “We used to finish work at 1.30 a.m., and 6 a.m. on Fridays. But we are an institution. It’s been 30 years that we are here. If everybody closes, there won’t be anything left.”\n___", "url": "https://www.huffpost.com/entry/belgians-eat-more-fries-please_l_5ea89e30c5b61b5fd93e6f06"}