{"authors": ["John Hanna", "Heather Hollingsworth"], "date_download": "2020-05-04 21:06:06", "date_modify": "2020-05-04 21:06:06", "date_publish": "2020-04-20 16:06:50", "description": "TOPEKA, Kan. (AP) — Kansas has received 7,000 more COVID-19 testing kits from the federal government to use for testing people with ties to the meat-packing industry, which is battling an...", "filename": "_8c5145956432b1583d53fb98225d38a5_1588626366.html", "image_url": "https://storage.googleapis.com/afs-prod/media/1cb2ea8a152c4f86b4de1ab80aee3d4f/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8c5145956432b1583d53fb98225d38a5_1588626366.html", "title": "Kansas gets COVID-19 testing kits for meat processing towns", "title_page": "Kansas gets COVID-19 testing kits for meat processing towns", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Signs of support are posted at Perry-Lecompton High School during the coronavirus pandemic in Perry, Kan., Sunday, April 19, 2020. (AP Photo/Orlin Wagner)\nSigns of support are posted at Perry-Lecompton High School during the coronavirus pandemic in Perry, Kan., Sunday, April 19, 2020. (AP Photo/Orlin Wagner)\nTOPEKA, Kan. (AP) — Kansas has received 7,000 more COVID-19 testing kits from the federal government to use for testing people with ties to the meat-packing industry, which is battling an undisclosed number of cases.\nGov. Laura Kelly announced that the tests, along with personal protective equipment, will go to Finney, Ford and Seward counties in southwest Kansas and Lyon County in the east-central part of the state.\nControlling the outbreaks is crucial: Plants in southwest Kansas account for 25% to 30% of beef processing in the country.\nAs of Monday, 336 people in the four counties were infected with the coronavirus out of 1,986 statewide.\nDr. Lee Norman, the state’s top public health administrator, said Kansas has had 39 coronavirus clusters responsible for 32% of the state’s cases, or 634, but 56 of the 100 deaths. He said 15 clusters are in private businesses but didn’t specify whether any of the businesses were meat processors.\nCargill, Tyson Fresh Meats and National Beef have said employees at their processing plants tested positive, but they haven’t provided details. Kansas Department of Health and Environment is working with the U.S. Centers for Disease Control and Prevention to track clusters connected to the processing plants.\n“You can see what’s happened in other states. I mean, you’ve got South Dakota and Iowa and I believe others,” Kelly told the Associated Press. “It would be a disaster if we had to shut down, so we’re trying to do everything that we can to keep those plants online.”\nThe facilities also have taken steps to improve safety, including health screenings, extra cleaning and social distancing.\nDr. Drew Miller, a family physician in Lakin in southwest Kansas, acknowledged those efforts, but added that an increase in cases in the region is tied for now to the industry.\n“Meat-packing plants are essential, so people still have to go to work there,” said Miller, who also is part of a four-person COVID-19 medical team at a rural hospital. “There’s a lot of people working in a relatively confined area.”\nREOPENING THE ECONOMY\nAs Kelly prepares to announce a plan for reopening the economy, the Kansas Chamber of Commerce released its own plan over the weekend. It calls for allowing nonessential businesses to open if they are able to do things such as boost cleaning of common areas.\n“We will just have to alter our behavior and our practices as we’re reopening the economy and maintain different kinds of health strategies until that vaccine is discovered, manufactured and distributed,” said Kelly, whose plan is expected later this week.\nRELIGIOUS GATHERINGS\nAt least three churches had in-person services Sunday with more than 10 people as a legal battle continues over whether religious gatherings should be excluded from Kelly’s executive order limiting mass gatherings.\nA temporary restraining order that a federal judge issued Saturday specifically prevents the enforcement of Kelly’s 10-person limit against one church in Junction City and another in Dodge City.\nA third church, Heritage Baptist Church in the Lawrence area, also held services in which the Rev. Scott Hanks said that “absolutely” more than 10 people were in attendance. A spokeswoman for the Douglas County District Attorney’s Office said no one has been cited.\n“Probably 99% of our faith leaders are abiding by the 10 or fewer and doing everything virtually or in drive-up services,” Kelly said. “I think they understand why we did that, and we appreciate that.”\n____\nHollingsworth reported from Mission, Kansas.", "url": "https://apnews.com/8c5145956432b1583d53fb98225d38a5"}