{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:02:32", "date_modify": "2020-05-04 16:02:32", "date_publish": "2020-04-01 16:02:56", "description": "On the same day that President Donald Trump acknowledged that somewhere between 100,000 and 200,000 Americans were likely to die because of the coronavirus, California Republican Rep. Devin Nunes went on Fox News to offer a very, uh, different perspective.", "filename": "2020_04_01_politics_devin-nunes-coronavirus-laura-ingraham_index_1588608152.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191112112551-devin-nunes-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_devin-nunes-coronavirus-laura-ingraham_index_1588608152.html", "title": "Devin Nunes needs to stop talking about the coronavirus. Like, immediately.", "title_page": "Devin Nunes needs to stop talking about the coronavirus. Like, immediately. - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) On the same day that President Donald Trump acknowledged that somewhere between 100,000 and 200,000 Americans were likely to die because of the coronavirus, California Republican Rep. Devin Nunes went on Fox News to offer a very, uh, different perspective.\n\"Let's stop looking at the death counters and let's talk about how we can keep as many people employed as possible,\" Nunes told Fox anchor Laura Ingraham. \"That's the key right now, Laura, because if you don't, what you said earlier is correct. When you have people staying at home, not taking care of themselves, you will end up with a hell of a lot more people dying by other causes than you will by the coronavirus.\"\nWhich is bad enough! But Nunes wasn't done! Far from it! (Also, shout-out to my producer Alli Gordon for transcribing this whole interview!)\n\"I mean, look, the schools were just canceled out here in California which is way overkill,\" he added. \"It's possible kids could've went back to school in two weeks to four weeks but they just canceled the rest of the schools.\"\nAnd then there was this: \"If we don't start to get people back to work in this country over the next week to two weeks, I don't believe we can wait until the end of April. I just don't know of any economy that's ever survived where you unplug the entire economy and expect things to go back and be normal.\"\nRead More", "url": "https://www.cnn.com/2020/04/01/politics/devin-nunes-coronavirus-laura-ingraham/index.html"}