{"authors": ["Photographs", "Words Xyza Cruz Bacani"], "date_download": "2020-05-04 16:19:33", "date_modify": "2020-05-04 16:19:33", "date_publish": "2020-04-01 23:15:44", "description": "Every day, Filipina nurse April Abrias walks six miles to monitor 30 patients who are suspected to have the novel coronavirus in a rural province north of the Philippines' capital, Manila.", "filename": "2020_04_01_homepage2_philippines-nurse-intl-hnk_index_1588609173.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401103501-13-philippines-nurse-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_homepage2_philippines-nurse-intl-hnk_index_1588609173.html", "title": "Philippines coronavirus: Nurses sent underprotected are now dying", "title_page": "Philippines coronavirus: Nurses sent underprotected are now dying - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Every day, Filipina nurse April Abrias walks six miles to monitor 30 patients who are suspected to have the novel coronavirus in a rural province north of the Philippines' capital, Manila.\nThe 29-year-old midwife doesn't have a surgical mask to cover her face -- instead, she wears a cloth mask that provides insufficient protection from the virus, which has killed more than 46,000 people worldwide, according to figures from Johns Hopkins University.\n\"I'm ready but not well-equipped (but) it's my duty to help in this time of pandemic.\"April Abrias\nAt least 17 frontline coronavirus medics have already died in the Philippines, and more than 600 have been in quarantine, according to CNN Philippines.\nAbrias not only worries for her profession. As she makes her daily calls, there is little to stop her from spreading the virus.\nOne of her patients lives in a fruit and vegetable market, which as an essential service isn't subject to the same lockdown rules that have silenced busy streets across the island of Luzon since March 17.\nAbrias said the patient had a fever and body aches, so she told him to self-quarantine in his shop and avoid interacting with other people. He hasn't been tested for the coronavirus, she said, because there are no testing kits.\nAbrias has to assume that he has the infectious disease, and that's what makes it so scary.\nApril Abrias writes her assessment of Joan Santos, a nurse from the United States who is under home quarantine.\n\"Doctors and other health care workers (here) work under conditions of a desperate lack of personal protective equipment, as do others in many other countries,\" said Esperanza Cabral, a Filipino cardiologist and clinical pharmacologist, who once served as the Secretary of the Philippines Health Department.\nThe World Health Organization says 96 people have died from the coronavirus in the Philippines, a country of 105 million people, and medical officers are warning of an impending crisis if help doesn't come soon.\nCovid-19 in the Philippines\nMore than 50 million people are now living under lockdown rules imposed by President Rodrigo Duterte, who last week secured powers to unlock billions of dollars of emergency funds. Schools and shopping malls have closed, mass gathering are banned and people across Luzon have been told to stay home.\nThe rules don't apply to Anthony Cortez and his team of 40 rural health workers who cover Bambang, a city of around 53,000 people, an eight-hour drive north of the capital Manila, in Nueva Vizcaya province.\nDr. Anthony Cortez shows the temporary face protection equipment he has made. He said medics are hoping for the new personal protective equipment. Some medics are using helmets designed for use on construction sites. Nurses use tissue paper to add layers of protection to their cloth face masks, which they reuse after washing.\nRural workers are the first line of defense. Before being admitted to a hospital, a patient will first be assessed and monitored by one of Cortez's team, mostly midwives who are now dealing with Covid-19 patients due to a lack of staff. He isn't confident of his team's ability to deal with the contagious coronavirus with so little personal protective equipment (PPE).\nAccording to World Health Organization guidelines, medical staff treating coronavirus patients should wear gloves, medical masks, goggles or a face shield, and body-covering gowns.\nCortez's team has none of this. So they are making their own.\n\"We resorted to innovations, so that we have some protection. The cloth mask ideally is not acceptable in the scientific field but rather than wearing nothing, without any protection, I would rather have this,\" he said.\nApril Abrias' facemasks are hung out to dry after being washed so they can be reused.\nDr. Gloria Balboa, of the Department of Health, said: \"Unfortunately, there is a shortage of the needed logistics like PPEs not only in the Philippines but globally.\"\nLast weekend, in a radio interview, Health Secretary Dr. Francisco Duque III said that the government had acquired 1 million PPEs worth 1.8 billion pesos ($35 million) and is still awaiting their delivery.\nExodus of health care workers\nRosalie Natividad had studied nursing with hopes of landing a job overseas and sending money home to support her family, like many other Filipino health care workers do.\nThat's because many nurses in the Philippines are required to do unpaid volunteer work, often described as a \"training program,\" until they can secure a contract. Their workload is similar to that of a paid nurse, and they work in hospital wards and health centers. Due to the lack of employment opportunities in the Philippines, nurses are often faced with no option but to comply.\n\"It's expensive to study to become a nurse and I do not think it's fair that we need to volunteer without pay.\"Rosalie Natividad\nNatividad applied for a nursing job in Saudi Arabia, despite being afraid of the Middle Eastern country's strict laws. The starting salary for a nurse in Saudi Arabia is 4,100 Riyals ($1,089) per month -- more than double what she could earn at home, says Natividad. But she didn't get the job because she lacked experience, and so became an insurance agent.\nLast year, however, Natividad returned to the profession during a Department of Health hiring program for nurses in rural areas.\nRosalie Natividad administers a vaccine to a baby in a clinic. Rosalie Natividad uses a thermometer to check the temperature of Joan Santos, who is under home quarantine. Rosalie Natividad shares her alcohol spray with an old lady at the market.\nHer six-month contract ends in June, but she is more worried about what the months ahead will bring as the coronavirus spreads through the Philippines.\n\"I'm worried about the virus. I'm the breadwinner and if I get sick, who will help my family? We don't see the enemy, and the health workers are the first ones that will be infected,\" she said.\nReigner Antiquera, president of the Alliance of Young Nurse Leaders and Advocates, an organization that advocates nurses rights and welfare, said nurses were taking huge personal risks to treat patients.\nRosalie Natividad wears a makeshift mask as she carries eggs to local families.\n\"Nurses are the most at risk of contracting the Covid-19 if the government will continue to disregard the plea of the nurses and other health workers in providing adequate personal protective equipment and other security measures,\" he said in a statement.\n'Hugging is not allowed'\nWhen the pandemic began, it was difficult for Abrias to explain to her children that hugging is not allowed anymore when she comes home each night.\nEvery day, before entering their home, her son waits while she disinfects herself. Her biggest fear is catching the coronavirus and passing it to her children.\nApril Abrias hugs her son, Yohan, inside their home after she has disinfected and changed her clothes.\nAbrias has not been trained as a frontline health worker. She is a midwife, still expected to deliver babies and give immunizations, and employed on a short-term contract, which pays her 17,000 Philippine pesos ($334) per month. For her new duties on the frontline, she receives 500 Philippine pesos ($9.83) per month in hazard pay, but no transportation allowance.\nThat's why she walks.\n\"I walked from house to house and sometimes, people blame me for doing my job and it hurts. I wish they will cooperate instead,\" she said. People know that Abrias monitors potential coronavirus patients and are worried she will carry the virus from village to village.\nOne of April's patients is Joan Santos, a Filipina nurse who recently returned home from Orange County, California. As a recent returnee from the US, she was ordered to spend 14 days in home quarantine to avoid spreading the virus, supervised by Abrias, who visits every day to check her temperature.\nBoth women are healthworkers, but one has more safety equipment than the other.\nSantos brought home from the US a supply of medical-grade N95 masks for herself and her family.\nShe wears it to protect herself from possible contagion -- from her nurse.", "url": "https://www.cnn.com/2020/04/01/homepage2/philippines-nurse-intl-hnk/index.html"}