{"authors": ["Grant Schulte"], "date_download": "2020-05-04 20:32:04", "date_modify": "2020-05-04 20:32:04", "date_publish": "2020-04-20 20:27:11", "description": "LINCOLN, Neb. (AP) — Nebraska will take a first step toward relaxing its statewide coronavirus restrictions on May 4 by allowing hospitals to resume elective surgeries if they meet certain...", "filename": "_1471121a9bb5b14f7a9c5adf026ca1f1_1588624324.html", "image_url": "https://storage.googleapis.com/afs-prod/media/53d769c9a3ba40468eafa01e4cfca5ce/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1471121a9bb5b14f7a9c5adf026ca1f1_1588624324.html", "title": "Ricketts to relax 1st coronavirus restriction on surgeries", "title_page": "Ricketts to relax 1st coronavirus restriction on surgeries", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Neb. Gov. Pete Ricketts, rear, listens as Scott Frakes, director of the Nebraska Department of Correctional Services, speaks during a news conference in Lincoln, Neb., Friday, April 10, 2020, on developments in the struggle against the coronavirus. (AP Photo/Nati Harnik)\nNeb. Gov. Pete Ricketts, rear, listens as Scott Frakes, director of the Nebraska Department of Correctional Services, speaks during a news conference in Lincoln, Neb., Friday, April 10, 2020, on developments in the struggle against the coronavirus. (AP Photo/Nati Harnik)\nLINCOLN, Neb. (AP) — Nebraska will take a first step toward relaxing its statewide coronavirus restrictions on May 4 by allowing hospitals to resume elective surgeries if they meet certain conditions, Gov. Pete Ricketts announced Monday.\nRicketts said he will lift the state’s ban on elective surgeries for hospitals that have at least 30% of their beds, intensive-care unit space and ventilators available. Hospitals must also have at least two weeks worth of personal protective equipment in stock for employees before can resume surgeries.\nThe order also applies to veterinary and dental services, Ricketts said at his weekday coronavirus news conference. Elective surgeries are procedures that are planned in advance, such as knee or hip replacements, as opposed to emergency surgeries that need to be done right away.\n“We want to open these back up to be able to allow those folks who need to have those surgeries to be able to start scheduling those and start having those surgeries performed,” Ricketts said. “It’s also an important source or revenue for many hospitals, so in order to help sustain our hospitals and make sure they’re available to take help care of our coronavirus patients, we want them to have a revenue source to be able to stay in business.”\nRicketts ordered a halt to all elective surgeries last month to try to keep the virus from spreading and overloading hospitals at a time when they needed to focus on treating new confirmed cases. The restrictions include a ban on gatherings larger than 10 people and a mandate for restaurants and bars to close their public dining areas.\nNebraska is among a small handful of states without formal stay-home orders in place, although its restrictions are very similar and in some cases more strict than what other states have. Ricketts imposed the restrictions regionally before expanding them statewide, and the first ones that were put in place in the Omaha area are scheduled to expire April 30, but could be renewed.\nThe decision was based on the large amount of available bed space and equipment in many of the state’s hospitals, Ricketts said. In Omaha, for instance, hospitals still have 75% of all their ventilators and about half of their beds available, he said. Statewide, Nebraska currently has about 190 people hospitalized with the virus.\n“We’re not seeing that it’s being overwhelmed, and so we believe we have the ability to start loosening the restrictions with those caveats,” Ricketts said.\nIt’s not clear whether all hospitals will be able to resume those surgeries by May 4.\nSome hospitals in Hall County, in central Nebraska, have seen much larger proportion of coronavirus patients relative to their size because the area is considered a hotspot . Hall County has the largest number of known cases statewide largely because of its meatpacking and food-processing plants and its assisted living homes for the elderly.\nMany hospitals rely on elective procedures to stay afloat financially, especially in rural areas that don’t see many emergency patients, said Andy Hale, a lobbyist for the Nebraska Hospital Association. Hale said more than half of Nebraska’s hospitals were considered “financially stressed” before the pandemic, with operating margins of less than 2%, and the virus has likely made the problems worse.\n“When you look around at different parts of the country, it’s the small hospitals that weren’t doing well to begin with,” he said.\nHale said the association doesn’t yet know which hospitals will resume surgeries on May 4 because some of them may be worried about a sudden, unexpected spike in coronavirus cases. He said individual hospitals will make the decisions for themselves, based on what’s happening in their areas.\n“I think a lot of our hospitals, unless they’re in one of those hot spot areas, are going to go ahead and start back up,” he said.\n___\nFollow Grant Schulte on Twitter: https://twitter.com/GrantSchulte", "url": "https://apnews.com/1471121a9bb5b14f7a9c5adf026ca1f1"}