{"authors": [], "date_download": "2020-05-04 20:25:24", "date_modify": "2020-05-04 20:25:24", "date_publish": "2020-04-20 05:06:30", "description": "BANGKOK (AP) — India and Singapore announced their biggest single-day spikes in new coronavirus cases on Monday, as the crisis intensifies in parts of Asia. India's spike came after the...", "filename": "_80fb1ba1f0486d5a9e334dae15bd2ca4_1588623924.html", "image_url": "https://storage.googleapis.com/afs-prod/media/395052115ae14eab86001b55002ec130/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_80fb1ba1f0486d5a9e334dae15bd2ca4_1588623924.html", "title": "Asia Today: India, Singapore see record numbers of new cases", "title_page": "Asia Today: India, Singapore see record numbers of new cases", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A woman stands near the barbed wire outside a locked down building during the movement control order in Kuala Lumpur, Malaysia, Monday, April 20, 2020. The Malaysian government issued a restricted movement order to the public till April 28, to help curb the spread of the new coronavirus. (AP Photo/Vincent Thian)\nA woman stands near the barbed wire outside a locked down building during the movement control order in Kuala Lumpur, Malaysia, Monday, April 20, 2020. The Malaysian government issued a restricted movement order to the public till April 28, to help curb the spread of the new coronavirus. (AP Photo/Vincent Thian)\nBANGKOK (AP) — India and Singapore announced their biggest single-day spikes in new coronavirus cases on Monday, as the crisis intensifies in parts of Asia.\nIndia’s spike came after the government eased one of the world’s strictest lockdowns to allow some manufacturing and agricultural activity to resume.\nAn additional 1,553 cases were reported over 24 hours in India, raising its total past 17,000. At least 543 people have died in the country, and epidemiologists forecast the peak may not be reached before June.\nIndia’s shelter-in-place orders imposed on March 24 halted all but essential services, sparking an exodus of migrant workers and daily laborers out of India’s cities to their home villages.\nStarting Monday, limited industry and farming are allowed to resume where employers can meet social distancing and hygiene standards, and migrant workers are allowed to travel within states to factories, farms and other work sites.\nSingapore’s confirmed cases shot to 8,014 after 1,426 new infections were reported Monday, a single-day high for the tiny Southeast Asian city-state.\nSingapore now has the highest number of cases in Southeast Asia, a massive surge from just 200 on March 15. Authorities say most of the new cases were again linked to foreign workers.\nMore than 200,000 low-wage workers from Asia live in tightly packed dormitories that became virus hotspots after they were overlooked earlier by the government. Officials have said that cases are expected to rise as testing at the dorms continues, but are hoping that a partial lockdown until May 4, mandatory wearing of masks and strict social distancing will help curb the virus.\nIn other developments in the Asia-Pacific region:\n— NO NEW CASES IN HONG KONG: Hong Kong reported no new cases on Monday for the first time in nearly seven weeks. Prior to Monday, the city had eight consecutive days of single-digit infections, dwindling from a surge in March as overseas residents flocked home amid outbreaks in the U.S. and Europe. Hong Kong’s current tally is 1,026 cases, including four deaths.\n— SRI LANKA PARTIALLY LIFTS CURFEW: Sri Lanka’s government has partially lifted a monthlong curfew, with the top health official declaring that the virus is “under control.” Sri Lanka had been under a 24-hour curfew since March 20. It was lifted during daytime hours in more than two-thirds of the country on Monday and will continue in the remaining districts including the capital, Colombo, until Wednesday. The curfew will remain in effect from 8 p.m. until 5 a.m. until further notice. Sri Lanka had confirmed 271 cases and seven deaths as of Sunday.\n— NEW ZEALAND’S LOCKDOWN EXTENDED: Prime Minister Jacinda Ardern announced that New Zealand’s lockdown will last another week. For nearly four weeks, nonessential workers have been able to leave their homes only to buy groceries or to exercise. Starting next week, construction and manufacturing can resume, and some schools will reopen, although home-learning will be encouraged.\n— SOUTH KOREA’S INFECTIONS WANE: South Korea reported 13 new virus cases Monday as infections continue to wane in the hardest-hit city of Daegu. The new figure brought the national total to 10,674 cases and 236 deaths. With its caseload slowing, South Korea has relaxed some of its social distancing guidelines, including administrative orders that advised churches, gyms and bars to close.\n— JAPANESE EXPORTS SINK: Japanese exports sank 11.7% in March as the pandemic slammed auto shipments to the U.S. The Finance Ministry said exports to the U.S. fell 16.5%, while those to China declined 8.7%. Trade has slowed precipitously, and the International Monetary Fund forecasts that the world economy is heading into its worst slowdown since the Great Depression in the 1930s.\n— JAPAN TULIPS RAZED: Tens of thousands of tulips in full bloom were razed at a Japanese park to prevent crowds from gathering. The flowers were the centerpiece of a popular annual festival in Sakura city, east of Tokyo, that was canceled this year. People still gathered to admire the flowers, however, making social distancing difficult. “We, of course, wish for many people to see our flowers, but this situation is now about human life. It was a heart-wrenching decision, but we had to do it,” said Takahiro Kogo, a city official overseeing the park.\n— BANGKOK EXTENDS ALCOHOL BAN: Thailand’s capital, Bangkok, has extended a ban on the sale of alcoholic beverages to the end of April as efforts continue to contain the coronavirus. The ban was originally imposed for April 10-20, when Thais would normally celebrate the Songkran New Year festival with drink-fueled merrymaking at large public gatherings. Celebrations of the holiday were also postponed. Alcohol sales bans were separately ordered in all 76 of Thailand’s provinces, which are also likely to be extended. A Bangkok official said people with alcohol dependency problems could receive free treatment at the city’s medical facilities.\n— AUSTRALIAN SOAP OPERA RESUMES: The long-running Australian soap opera “Neighbours” returned from a three-week production break on Monday and plans to resume full production next week with new coronavirus safeguards. “Neighbours” production company Fremantle Australia said it is one of the few TV dramas in the English-speaking world to resume production during the pandemic. “Neighbours” first screened in 1985. It has been sold to more than 60 countries and has a larger following in Britain than Australia. Its Melbourne studio will be separated into three scene areas with no crews allowed to cross between the areas, Fremantle said.\n___\nThis story corrects the total number of Singapore cases to 8,014.", "url": "https://apnews.com/80fb1ba1f0486d5a9e334dae15bd2ca4"}