{"authors": ["Stephanie Murphy"], "date_download": "2020-05-04 17:03:52", "date_modify": "2020-05-04 17:03:52", "date_publish": "2020-04-11 01:30:44", "description": "As Covid-19 sweeps across the United States like wildfire, my fellow members of Congress and I are working to douse the flames. We need to use far more water—a fact some of my colleagues haven't come to terms with yet, writes Rep. Stephanie Murphy.", "filename": "2020_04_10_opinions_congres_85b25a29f47fa83173f448faedd1b515_index_1588611832.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409171450-33-week-in-photos-0409-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_opinions_congres_85b25a29f47fa83173f448faedd1b515_index_1588611832.html", "title": "Congress is facing the ultimate test of leadership", "title_page": "Congress is facing the ultimate test of leadership (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Stephanie Murphy, a Democrat, represents Florida's 7th Congressional District in the House of Representatives. The views expressed here are hers. Read more opinion at CNN.\n(CNN) As Covid-19 sweeps across the United States like wildfire, my fellow members of Congress and I are working to douse the flames. We need to use far more water -- a fact some of my colleagues haven't come to terms with yet.\nWhen the virus first emerged, it caused me to reflect on my experience at the Pentagon during the administration of President George W. Bush. In 2005, I was part of an interagency team that prepared for the potential arrival of another virus, H5N1, commonly known as the bird flu, which had made the jump from birds to humans in other countries with deadly consequences.\nNo threat I analyzed at the Pentagon alarmed me more than the prospect of a pandemic in America. In the case of H5N1, our nation had a near-miss . Now we are taking a direct hit.\nOur government bears no blame for the fact that Covid-19 started, but it could have done more to protect the public from this peril. In time, we should examine what errors have been made and determine how to avoid repeating them. With Republican Congressman John Katko of New York, I filed legislation to create a bipartisan commission in 2021 that would identify lessons learned and recommend concrete steps the US should take to better prepare for and respond to a future pandemic.\nBut now is not the moment to dwell on the past or fret about the distant future.\nInstead, leaders must concentrate on the current calamity. While one common narrative is that Congress and the executive branch have risen to the challenge, the actual story is more complex and less charitable.\nIt's true we negotiated and approved three bills in the span of three weeks to address Covid-19, including the $2.3 trillion CARES Act . We can take pride in that achievement , which wasn't preordained or easy to accomplish.\nBut we shouldn't pat ourselves on the back too much. The reality is that American families and businesses are getting some help, but not the support they truly need to endure this crucible. That's because some of my Republican colleagues, in concert with the Trump administration, whittled down key parts of these bills. Notably, my fellow Democrats didn't always cover themselves in glory either, pushing partisan priorities that had little connection to the crisis.\nTwo examples illustrate the point.\nAs we crafted the second Covid-19 package , I fought to include a bill I had filed to give millions of American workers access to up to 10 weeks of paid family and medical leave during the pandemic. I wasn't just trying to be altruistic, but rather to promote public safety. Sick people without paid leave are more likely to report to work and infect others -- not because they don't care about their fellow Americans, but because staying home could mean economic ruin.\nRepublicans, who typically oppose government-directed paid leave seemed not to fully grasp that we aren't living in typical times. They would agree only to a narrower, clunkier version of my proposal. It would require businesses, not the federal government, to administer the benefit -- as if employers aren't busy enough right now trying to keep their businesses afloat.\nWorse, while it extends up to 10 weeks of paid leave for parents who stay home to care for a child whose school has closed, eligible workers who are sick themselves or must care for a sick family member are not afforded the same benefit. The final provision is better than nothing, but weaker than warranted.\nLikewise, I was the first member of Congress to propose that an \"employee retention tax credit\" be included in the CARES Act, similar to provisions we have enacted in the wake of hurricanes and other natural disasters.\nThe purpose of this credit is to encourage businesses to keep their workers on payroll, so they can continue to receive health coverage and at least some portion of their previous salary or wages. Although we managed to get my proposal into the bill , Republicans -- again -- shaved down the provision until it was a shadow of its former self. The low value of the wage subsidy -- a maximum of $5,000 per worker -- is disconnected from the reality so many Americans are facing.\nI realize that, in divided government, compromise is the currency of the realm. I also recognize that Republicans did assent, however grudgingly, to so-called big government policies in these recent bills that they never would have accepted in less troubled times. It's as if they wriggled one arm out of their ideological straitjacket but won't try to extricate the rest of their body.\nIn a crisis of this magnitude, when our constituents' very lives and livelihoods are on the line, Republicans don't deserve points for partial progress. Big, bold action is required. Timid and tentative steps won't cut it.\nIn Congress, we've begun work on additional legislation to combat the fallout from the Covid-19 pandemic. It should fill out the half-measures in earlier bills, starting by expanding paid leave and rounding out the employee retention credit.\nBeyond that, our work should be guided by two broad principles. First, Covid-19 is, above all, a threat to public health -- and will only be defeated through science and medicine. We must spare no expense to expand testing, develop anti-viral treatments, create a vaccine, assist hospitals, protect our doctors, nurses and other frontline workers and rapidly manufacture and distribute critical equipment like ventilators.\nSecond, because necessary measures taken to slow the spread of Covid-19 have spawned an economic crisis, we should do everything possible to support American workers and businesses of all sizes. They are being buffeted by forces beyond their control, through no fault of their own.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nWhen contemplating how best to provide relief, Congress's mantra should be \"swift, simple and sufficient.\" Wherever possible, direct payments to individuals and businesses should be preferred to complicated funding arrangements that involve too many steps, too many participants and too much red tape. Otherwise, federal aid may arrive a dollar short and a day late. Time is not on our side.\nHow Congress responds over the coming months will be the ultimate test of our leadership. History will judge us on whether our actions were effective, not whether our intentions were noble. Only results matter. To save the country we love, we must fight this fire with everything we've got.", "url": "https://www.cnn.com/2020/04/10/opinions/congress-is-facing-the-ultimate-test-of-leadership-murphy/index.html"}