{"authors": [], "date_download": "2020-05-04 16:16:07", "date_modify": "2020-05-04 16:16:07", "date_publish": "2020-04-03 17:05:07", "description": "Throwing a remote birthday party might seem confusing, but we're here to help. We chatted with party experts about the best ways to virtually celebrate another trip around the sun.", "filename": "2020_04_03_cnn-underscored_virtual-birthday-party-ideas_index_1588608967.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403130207-underscored-virtual-bday-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored_virtual-birthday-party-ideas_index_1588608967.html", "title": "Virtual birthday party ideas: Games, gifts and more", "title_page": "Virtual birthday party ideas: Games, gifts and more - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored has interviewed experts to find the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nSocial distancing is the new normal for the foreseeable future, meaning all the Aries and Tauruses out there will be stuck celebrating their birthdays at home. But a socially distanced birthday doesn't have to be a bummer.\nLots of people are starting to throw virtual parties for kids young and old. And, honestly, there are some pretty great upsides to remote celebrations: You don't have to drive anywhere, and there's way less cleanup when all is said and done.\nThrowing a remote birthday party might seem confusing, but we're here to help. We chatted with party experts about the best ways to virtually celebrate another trip around the sun.\nInvitations\nFrench Bull Birthday Cake Birthday Invitations\nThe first step for any party, of course, is to invite people. Seri Kertzner, chief party officer at Little Miss Party Planner, loves to use Paperless Post for her invites \"because the site is so user-friendly and has amazing designs.\" Evite also has a specific category devoted entirely to virtual event invitations.\nIf your party isn't for a few weeks, though, why not consider good old-fashioned snail mail? Experts say the likelihood of the virus traveling through mail is unlikely, and receiving a physical invitation would probably feel really special right now.\nTo that end, Paper Source has a huge selection of cute birthday invitations for both adults and children, most of which can be personalized. The site is also offering free shipping on orders of $50 or more, so toss in some fun party decorations while you're at it. Target has a great selection of affordable party invitations as well.\nKertnzer says there are a few must-include details in your invites, including clear timing for when guests should plan to log on, the meeting ID/link for the party, and of course, \"details on activities you want people to participate in\" (including a time you plan to sing \"Happy Birthday!\").\nChrissy Horton, whose website inspiredfashionfinds.com is devoted to \"helping busy moms create Pinterest worthy looks in home, fashion and party decor,\" recently threw a virtual party for her son and has some great tips of her own. \"When it comes to very young kids,\" she says, it's also a good idea to dedicate \"a specific time to each child's friend and family member rather than hosting a huge virtual group hangout. Video chats with several split screens will make it difficult for your child to understand what is going on, who to direct their attention to, and depending on their age, it may be sensory overload.\"\nStreaming Tech\nStream with webcams and ring lights\nBoth Kertzner and Horton are big fans of the video conferencing software Zoom, though Horton also gives a plug to Google Hangouts: \"Many already have Gmail and this option easily allows those who are not as internet savvy to join the party! While Zoom is great for large parties,\" she adds, \"Google Hangouts works well for smaller groups.\" She also says it's a good idea \"to add a password to your Zoom party to prevent uninvited guests.\"\nWhen it's time to stream, many laptops have built-in webcams. Quality varies widely, though, and a dedicated webcam can help you better see your friends' smiling faces. Check out the highly rated and affordable Logitech C310 HD Webcam ($49.99; bhphotovideo.com) or the Logitech StreamCam Plus ($169.99; bhphotovideo.com). For professional and flattering lighting, try a webcam ring light that clips right onto your built-in or external webcam like the super popular QIAYA Selfie Ring Light for $19.99 that has more than 4,500 4-star reviews on Amazon.\nWhat to Wear\nDress to impress with clothes from stores like Nordstrom\nDressing up will help the party feel more like a special occasion for everyone involved, so take a break from the sweats you've been wearing for a week straight and show off a cute party outfit.\nNordstrom has plenty of celebration-worthy dresses, men's dress shirts, and adorable outfits for kids. Encourage guests to dress to the nines for a fun change from loungewear, or to stick to a theme like the Roaring Twenties (1920s or 2020s), or a favorite show. Keep in mind that, depending on the positioning of your webcam, you may only need to think about your outfit from the waist up. Hats, necklaces, shirts and accessories will probably make the biggest splash.\nThemes and Decorations\nCheck out Target for some decoration ideas\nWhen it comes to decor, the bolder the better. You want your guests to actually be able see everything through their screens. Colorful banners and backdrops, fairy lights, and balloons will all make your space feel more festive. Horton says it's also a good idea to \"ask participants to pull out some party decor if they have any and decorate the area where they will be taking the call.\"\nPartyCity has a huge selection of theme-specific party decor and accessories, with options for everything from a cute tea party to a luau. Target and HalloweenCostumes.com have tons of props and decorations for a variety of themes as well. Kertzner's company even offers various \"Parties in a Box\" that come with everything you need for a theme party if you don't have the time or creativity to source it all yourself. Etsy also has creative printable party supplies if you're in a pinch.\n\"If [guests] don't have any party decor lying around,\" Horton continues, another option is to email everyone \"some photos they can print of your child's favorite character. This way, the child will see that despite the distance, everyone in their circle is still celebrating them on their special day!\"\nVirtual Games and Activities\nCard games and even virtual karaoke are great entertainment\nFor adult birthdays, Kertzner suggests creating a special cocktail or mocktail for a group cheers — just be sure to include the timing and recipe (if necessary) in your invite! We've got a roundup of some essential bar supplies for your party needs here. You can also send some cupcakes to the guest of honor for a birthday toast. Support local businesses by calling nearby bakeries to see if they're still making deliveries.\nPlenty of group games are easy to play virtually too. Says Horton, \"Depending on [guests'] age you can do Never Have I Ever ($24.99; target.com), Two Truths and a Lie or Ellen DeGeneres's Heads Up game ($20; amazon.com).\" Note that, for kids' parties, there's also a Never Have I Ever Family Edition ($24.99; target.com) or good old-fashioned charades. Scavenger hunts are a fun activity that everyone can do at their own home and still enjoy a little healthy competition. Etsy has tons of scavenger hunt ideas worth checking out. We put together a guide with even more puzzles and games for the whole family, too.\nVirtual dance parties are another festive way to pass the time. Kertzner says that her own son \"has been playing freeze dance for his parties, stopping the music and having people freeze on Zoom.\" Another tip is to do \"dances that everyone knows and can do together (i.e., the \"Cha Cha Slide,\" \"Macarena\" or \"YMCA\").\" You can even turn your living room into a dance club with a device like the ION Audio Party Rocker Express Bluetooth Speaker with Light Show and Microphone ($69.99; bhphotovideo.com). Or, host a digital karaoke night with an app like Kara Fun and a BlueFire Wireless 4 in 1 Bluetooth Karaoke Microphone ($25.99; amazon.com).\n\"Another fun activity,\" Kertzner suggests, \"is to have everyone make a sign (on a regular piece of paper, that can be decorated with markers, stickers, etc.) with a word that best describes the birthday person. When you sing happy birthday, have everyone hold up their sign into the screen and make sure to take a screenshot!\" If you're low on supplies, Michaels is still shipping out its huge inventory of crafting staples.\nFor little kids, visits from their favorite characters aren't necessarily on hold. \"Although Spiderman or Elsa may not be able to make a physical appearance at your child's birthday party,\" Horton says, \"you can find a company that provides these services and ask if their characters would mind sending your child a video message instead.\"\nGifts\nScavenger hunts make for an interactive gift\nShould you even be giving gifts for virtual parties? According to the experts, it really depends. \"If the birthday is for a child or teen, I would encourage guests to still give a gift,\" Horton says, though she adds that this doesn't have to be anything traditional. She recommends creating at-home scavenger hunts for kids. For example, \"If your child is into pirates, you can create a treasure map for them to find their presents. Get creative with it and make it a fun game for them!\"\nIf you don't have the energy to make a game yourself you can buy one, like this Briarpatch Scavenger Hunt ($17.99, originally $19.99; kohls.com). We've also rounded up a long list of non-Amazon retailers that are still delivering products throughout the country so you can find a gift in any category.\nOf course, it's also entirely understandable to not give gifts at all. Kertzner says, \"I think what's on everyone's mind right now, of course aside from staying healthy, is the economy.\" To that end, she adds that, \"For those still comfortable spending money, they are putting it towards helping others. I would suggest choosing a charity that you love or a foundation that is getting hospitals the supplies that they need or a food bank or even a local restaurant or caterer that you want to help keep in business and ask your guests (on the digital invite you send) to make a donation in lieu of a gift.\" Or, see our gift ideas for men, women, teens, kids and babies for some traditional gift inspiration.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/virtual-birthday-party-ideas/index.html"}