{"authors": ["Delano Massey", "Devan Cole"], "date_download": "2020-05-04 16:51:39", "date_modify": "2020-05-04 16:51:39", "date_publish": "2020-04-08 12:30:55", "description": "The Department of Health and Human Services on Wednesday announced a nearly $500 million contract with General Motors under the Defense Production Act to produce 30,000 ventilators that will be delivered to the national stockpile to help treat coronavirus patients.", "filename": "2020_04_08_politics_general_bc366e4c9491053d3f39dff5f412bd17_index_1588611099.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405221114-ventilators-inside-the-er-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_general_bc366e4c9491053d3f39dff5f412bd17_index_1588611099.html", "title": "HHS to work with GM under Defense Production Act to produce 30,000 ventilators for national stockpile", "title_page": "HHS to work with GM under Defense Production Act to produce 30,000 ventilators for national stockpile - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The Department of Health and Human Services on Wednesday announced a nearly $500 million contract with General Motors under the Defense Production Act to produce 30,000 ventilators that will be delivered to the national stockpile to help treat coronavirus patients.\nThe ventilators would be delivered to the Strategic National Stockpile by the end of August with a production schedule allowing for the delivery of 6,132 ventilators by June 1, according to a statement from HHS, which said the price of the contract was $489.4 million.\nThe department says the move follows President Donald Trump's direction to Secretary Alex Azar late last month to invoke the Defense Production Act with regard to GM's production of ventilators. The 1950's piece of legislation allows the President to compel companies to produce much-needed supplies during emergencies.\nHospitals around the country have been struggling for weeks to secure much-needed ventilators that are used for critical coronavirus patients. State and local officials had been urging the President to invoke the act as they scrambled to procure more ventilators as the number of coronavirus cases increased in recent weeks.\nThe orders from the President last month came after talks between the administration, GM and Ventec Life Systems to produce thousands of ventilators had been put on hold amid internal concerns over the timeline and price tag of the agreement.\nBy using the act, Azar said HHS is \"helping manufacturers like GM get the supplies they need to produce ventilators as quickly as possible, while also ensuring that these ventilators are routed through the Strategic National Stockpile to where they're needed most.\"\n\"The Trump Administration has deployed thousands of ventilators from the Strategic National Stockpile that have helped save lives in hotspots such as New York so far,\" he said in a statement. \"We're grateful to the GM team for working with the federal government to expand our nation's supply of ventilators as the pandemic evolves.\"", "url": "https://www.cnn.com/2020/04/08/politics/general-motors-ventilators-defense-production-act-coronavirus/index.html"}