{"authors": ["Senior Culture Reporter"], "date_download": "2020-05-04 21:06:58", "date_modify": "2020-05-04 21:06:58", "date_publish": "2020-04-30 20:42:22", "description": "Wednesday's episode of \"The Daily Show\" featured a mock PSA using Americans to \"stuff your faces like your lives and your country depend on it.\"", "filename": "entry_daily-show-trevor-noah-coronavirus-meat-processing_n_5eab1ad6c5b60d2b3b727807_1588626418.html", "image_url": "https://img.huffingtonpost.com/asset/5eab281e220000690d827f4c.png?cache=zetxtgq8ex&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_daily-show-trevor-noah-coronavirus-meat-processing_n_5eab1ad6c5b60d2b3b727807_1588626418.html", "title": "Trevor Noah Offers Cheeky Solution For Food Supply Woes Amid Coronavirus Crisis", "title_page": "Trevor Noah Offers Cheeky Solution For Food Supply Woes Amid Coronavirus Crisis | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Trevor Noah offered a tongue-in-cheek solution to the food industry’s recent woes this week, suggesting that Americans take a super-sized approach to meal consumption during the coronavirus crisis.\nOn Wednesday’s installment of “The Daily Show,” Noah pointed to recent reports that found a spike in food waste across the U.S. With school cafeterias, restaurants and hotels closed, some suppliers have had to destroy or dispose of eggs, fresh vegetables and even alcohol as demand from their usual buyers has plummeted.\nBelgium has proposed an unusual solution to limit such waste. Specifically, residents are being urged to consume more French fries to help support the local potato industry.\nJoking that being asked to eat more French fries would be a “dream come true,” Noah suggested that Americans to “step up” and do their part. At that point, the segment gave way to a mock PSA in which “Daily Show” correspondent Roy Wood Jr. quipped that America had been “training for this crisis our entire lives.”\n“We’re the country that invented supersizing, hot dog eating contests and fighting to the death over a fried chicken sandwich,” Wood said. “So America, I need you to join with me and stuff your faces like your lives and your country depend on it. Because it does.”\nWatch the full “Daily Show” segment:\nOn the flip side, many Americans have expressed concerns over possible meat shortages as the pandemic upsets supply chains. Earlier this week, Tyson Foods chairman John H. Tyson published a blog post outlining challenges his company faced as meatpacking plants across the country had shuttered in an effort to curb the spread of COVID-19, the disease caused by the coronavirus.\nTwo days after Tyson’s blog was published, President Donald Trump signed an executive order to compel meatpacking plants to remain in business amid the pandemic. But the move angered food industry workers, many of whom say they fear contracting the coronavirus as an increase in employee protections had not been mandated under the order.\n“It’s really sad that these workers are being forced to keep the food chain going, but no one’s being forced to protect them while they do it,” Noah said Wednesday. “If you eat meat, you especially should want these workers to be treated right because without them, the only way you’re getting bacon is if you fight the pig yourself.”", "url": "https://www.huffpost.com/entry/daily-show-trevor-noah-coronavirus-meat-processing_n_5eab1ad6c5b60d2b3b727807"}