{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 17:03:28", "date_modify": "2020-05-04 17:03:28", "date_publish": "2020-04-10 22:55:09", "description": "It's been close to a month of our new shared reality: Social distancing and stay-at-home orders to combat the spread of the coronavirus.", "filename": "2020_04_10_politics_10-leaders-coronavirus-response_index_1588611808.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409183814-01-coronavirus-briefing-0409-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_10-leaders-coronavirus-response_index_1588611808.html", "title": "10 leaders who mattered most on coronavirus response this week", "title_page": "10 leaders who mattered most on coronavirus response this week - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) It's been close to a month of our new shared reality: Social distancing and stay-at-home orders to combat the spread of the coronavirus.\nEvery week during the pandemic, I am looking at the 10 leaders -- mostly politicians, but not only politicians -- whose voices and actions mattered this week in the ongoing fight against coronavirus. (You can see last week's list here .)\nWorth noting: This is not organized by who is doing the best job when it comes to leading. \"Leadership\" tends to be a hard thing to agree on, especially in these moments. Rather, it's simply a look at whose voices are the most influential and affecting the national conversation around the virus right now.\n: The President pushed himself back to center stage this week by headlining a series of marathon coronavirus task force daily news briefings -- in which he spent most of the time bantering with reporters and claiming that the fight against the virus was going better than anyone ever thought. ( Many of Trump's Republican colleagues wish he spoke a little less .)\n: Andrew, the governor of New York, and Chris, CNN anchor, remained two of the most prominent faces in the coronavirus battle this week. Andrew Cuomo's daily press briefing continues to be the anti-Trump press briefing: Low on attacks, high on information. And Chris's videos -- watch here and here -- documenting his struggle with coronavirus are being seen by millions.\n3. Larry Kudlow: The President's top economic adviser has been a : The President's top economic adviser has been a voice to begin re-opening society sooner rather than later in hopes of reviving the cratering economy. This week, Kudlow -- and other economic types in Washington and on Wall Street -- seemed to be winning the presidential persuasion war as Trump talked more and more about the need to get things started again.\n4. Deborah Birx/Anthony Fauci: The two highest-profile doctors in the country remain members of Trump's coronavirus task force -- and have been able, so far, to talk him down from his desire to end the coronavirus quarantine ASAP. But how much longer can they hold Trump off? On Friday, Trump said only he would : The two highest-profile doctors in the country remain members of Trump's coronavirus task force -- and have been able, so far, to talk him down from his desire to end the coronavirus quarantine ASAP. But how much longer can they hold Trump off? On Friday, Trump said only he would \"certainly listen\" to the doctors if they said May 1 was too soon to re-open things -- before adding there are \"two sides\" to every argument.\n5. Gretchen Whitmer: With Trump and Andrew Cuomo, generally, saying nice things about one another, it's the governor of Michigan who, in many ways, has emerged as Trump's foil in the fight between state and federal responsibilities on the coronavirus. And with : With Trump and Andrew Cuomo, generally, saying nice things about one another, it's the governor of Michigan who, in many ways, has emerged as Trump's foil in the fight between state and federal responsibilities on the coronavirus. And with Detroit now a major Covid-19 hotspot , all eyes nationally are on how Whitmer handles it.\n6. Nancy Pelosi: The speaker of the House is a critical linchpin in what the next round of coronavirus relief provided by Congress will look like -- and she has indicated in recent days that : The speaker of the House is a critical linchpin in what the next round of coronavirus relief provided by Congress will look like -- and she has indicated in recent days that she would be willing to postpone Democrats' long-desired infrastructure spending into a later bill in order to get more help to people who need it sooner. It remains to be seen if Pelosi can bring House Democrats along with her on such a compromise.\n7. Mike Pence: As Trump has seized more and more control over the coronavirus daily briefings, the vice president's role -- so high-profile a month ago -- has receded significantly. At Friday's daily briefing, Pence largely loomed at the fringes of the camera shot as Trump talked and talked and talked.\n8. Steve Mnuchin: The Treasury secretary's big promise to : The Treasury secretary's big promise to deliver -- via direct deposit -- stimulus check to millions of Americans comes due next week. Mnuchin has been adamant that all is going according to plan and that most Americans who qualify for the checks will see them sooner rather than later. Keeping that pledge (or not) will be a big part of his legacy in the job.\n9. Peter Navarro: The top trade adviser to Trump has suddenly burst into the national coronavirus conversation this week when it was revealed that he had written : The top trade adviser to Trump has suddenly burst into the national coronavirus conversation this week when it was revealed that he had written two memos -- one in January, one in February -- warning the President of the potential impact of the virus. (Even while he was writing those memos, Navarro was saying publicly everything would be fine .) And, Navarro appears to have won a fight with the doctors on the task force over pushing the widespread use of hydroxychloroquine.", "url": "https://www.cnn.com/2020/04/10/politics/10-leaders-coronavirus-response/index.html"}