{"authors": ["Analysis Oliver Darcy", "Cnn Business"], "date_download": "2020-05-04 16:55:45", "date_modify": "2020-05-04 16:55:45", "date_publish": "2020-04-09 03:37:37", "description": "A seemingly small act from a pair of online personalities Wednesday spoke volumes about cable news' highest-rated network and its supposed commitment to accurately informing the public amid this pandemic.", "filename": "2020_04_08_media_fox-news-diamond-and-silk-reliable-sources_index_1588611345.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408232940-diamond-and-silk-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_media_fox-news-diamond-and-silk-reliable-sources_index_1588611345.html", "title": "What Fox News' silence about 'Diamond & Silk' says about the network", "title_page": "What Fox News' silence about 'Diamond & Silk' says about the network - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) A version of this article first appeared in the \"Reliable Sources\" newsletter. You can sign up for free right here.\nA seemingly small act from a pair of online personalities Wednesday spoke volumes about cable news' highest-rated network and its supposed commitment to accurately informing the public amid this pandemic.\nFox News might be working hard to whitewash its past coverage and convince the public that it is taking the coronavirus pandemic with the upmost seriousness, but its actions — or apparent lack of action, in this case — speak louder than its words.\n\"Diamond & Silk\" might not seem like a duo worth your attention, but the pro-Trump sisters command a sizable audience that includes the President of the United States. They are also paid by Fox, where the two have a Fox Nation show. And they appear on the network's programming.\nOver the last few weeks, the duo has advanced all sorts of misinformation and conspiracy theories about the coronavirus. They've questioned the death toll. They've questioned whether the virus is being \"deliberately spread.\" They've suggested the \"Deep State\" is working \"behind the scenes\" and that it is \"engineered.\" On and on and on it goes.\nRead More", "url": "https://www.cnn.com/2020/04/08/media/fox-news-diamond-and-silk-reliable-sources/index.html"}