{"authors": ["Kathleen Ronayne"], "date_download": "2020-05-04 20:04:48", "date_modify": "2020-05-04 20:04:48", "date_publish": "2020-04-09 23:14:34", "description": "SACRAMENTO, Calif. (AP) — California lawmakers want a fuller accounting of Gov. Gavin Newsom's plan to buy 500 million protective masks, with a top budget official on Thursday seeking details on...", "filename": "_70299d14ebe2f7506474e5b8d0179468_1588622688.html", "image_url": "https://storage.googleapis.com/afs-prod/media/4a6c6b9b91a340f1b7e8c213465262ca/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_70299d14ebe2f7506474e5b8d0179468_1588622688.html", "title": "California lawmakers want details on Newsom's big mask buy", "title_page": "California lawmakers want details on Newsom's big mask buy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this March 12, 2020, file photo, health care personnel test a person in the passenger seat of a car for coronavirus at a Kaiser Permanente medical center parking lot in San Francisco. California lawmakers, on Thursday, April 9, 2020 asked Gov. Gavin Newsom's administration for more details on its plans to buy 500 more protective masks to help fight the coronavirus, but are asking for more details on its plan to buy 500 million more protective masks for health care and other workers as the state fights the coronavirus. (AP Photo/Jeff Chiu, File)\nFILE - In this March 12, 2020, file photo, health care personnel test a person in the passenger seat of a car for coronavirus at a Kaiser Permanente medical center parking lot in San Francisco. California lawmakers, on Thursday, April 9, 2020 asked Gov. Gavin Newsom's administration for more details on its plans to buy 500 more protective masks to help fight the coronavirus, but are asking for more details on its plan to buy 500 million more protective masks for health care and other workers as the state fights the coronavirus. (AP Photo/Jeff Chiu, File)\nSACRAMENTO, Calif. (AP) — California lawmakers want a fuller accounting of Gov. Gavin Newsom’s plan to buy 500 million protective masks, with a top budget official on Thursday seeking details on how the state will distribute the masks and ensure they are good quality.\nIn a letter to Newsom’s finance director, state Sen. Holly Mitchell asked for details on the contract Newsom is executing to buy 200 million masks per month through an American subsidiary of a Chinese company. Newsom announced the deal Tuesday and asked lawmakers for authority to quickly spend some of the money needed to purchase the masks.\nIn total, Newsom expects to spend nearly $1 billion on the masks. The state plans for the first shipment to arrive in early May, and the initial contract will last 2 1/2 months, said Brian Ferguson, spokesman for the Office of Emergency Services.\nLawmakers gave Newsom approval to spend more state money in response to the new coronavirus last month before halting their session over concerns about spreading the virus. He’s using that authority and tapping other disaster preparedness funds to increase the state’s supply of personal protective equipment desperately needed by health care workers.\nBut Mitchell, chair of the Joint Legislative Budget Committee, said Newsom needs to be more transparent with lawmakers about the spending. She asked for details such as what performance standards would be used for the manufacturer of the masks, the price per mask, and production and delivery timelines. Lawmakers also announced plans to hold oversight hearings on coronavirus spending.\n“Under normal circumstances, the Legislature would have had more time to deliberate an expenditure of this magnitude and would have been allowed to thoroughly vet the details of the contract before proceeding,” Mitchell wrote to Newsom’s finance director.\nLawmakers have yet to see a copy of the contract that Newsom’s office signed with BYD North America, the Los Angeles-based subsidiary of a Chinese company. The administration has not provided a copy of the contract to The Associated Press.\nThe deal Newsom announced Tuesday is a massive ramp up in California’s mask supply. So far, the state has distributed roughly 41 million masks. Of the 200 million masks expected to come in monthly, about 150 million will be N-95 masks and another 50 million will be surgical masks.\nNewsom projects California will hit its peak of coronavirus cases in mid-May. They will first go to health workers in hospitals and nursing homes and first responders. But they could also be shared with workers deemed essential, such as grocery store clerks, Newsom said Thursday.\nMitchell asked Newsom’s administration to tell lawmakers how it would decide where to send the masks. If the administration wants to give the masks to other states, Mitchell also asked for details.\nShe also urged the establishment of a regularly updated website with details on the state’s inventory on personal protective equipment, including masks, gloves and gowns, as well as where it’s being shipped.\nNewsom told lawmakers in a Tuesday letter that he’s spent $1.4 billion already on such equipment. The AP has repeatedly asked the administration for a breakdown of spending on different types of PPE, but the request has not been fulfilled.\nNewsom suggested in a Tuesday interview on Rachel Maddow’s MSNBC show that California could distribute some of the 200 million masks to other Western states. California recently loaned 500 ventilators to states in need.\nBut Ferguson, the OES spokesman, said no formal effort is underway to turn California into a multi-state distributor of masks. Discussions about sharing with other states is more informal, he said.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.\n__\nAssociated Press journalist Adam Beam contributed to this report.", "url": "https://apnews.com/70299d14ebe2f7506474e5b8d0179468"}