{"authors": ["Carley Petesch"], "date_download": "2020-05-04 20:11:53", "date_modify": "2020-05-04 20:11:53", "date_publish": "2020-04-07 10:13:50", "description": "DAKAR, Senegal (AP) — Former Chadian dictator Hissene Habre has been granted 60 days of home arrest by Senegal’s justice ministry because of the threat of COVID-19 in the prison where he is...", "filename": "_7e70484668c02b44f3e26d3ebba2c279_1588623113.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7e70484668c02b44f3e26d3ebba2c279_1588623113.html", "title": "Chad's ex-dictator granted home arrest amid virus threat", "title_page": "Chad's ex-dictator granted home arrest amid virus threat", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DAKAR, Senegal (AP) — Former Chadian dictator Hissene Habre has been granted 60 days of home arrest by Senegal’s justice ministry because of the threat of COVID-19 in the prison where he is serving a life sentence.\nHabre, 78, is at greater risk because of the large number of arrested people taken to Cap Manuel prison, the ministry said.\n“Habre was not released. Hissene Habre is still in prison, it is simply the place of detention that has changed,” Justice Minister Malick Sall said in the announcement late Monday. He emphasized this is not a pardon.\n“Habre is an international political prisoner who has been entrusted to us by the international community … his security is the responsibility of the state of Senegal.”\nThe former leader of Chad will be held at his home in Dakar and will not be able to leave until his return to prison.\nHabre was sentenced on appeal to life imprisonment in 2017 by the Extraordinary African Chambers for war crimes and crimes against humanity committed during his time in power from 1982 to 1990. The Extraordinary African Chambers was created by the African Union and Senegal to try Habre in a landmark case pursued by his victims for more than 15 years.\nHis conviction was the first of a former head of state by an African court for crimes against humanity. It was also the first time a former dictator was found personally guilty of rape by an international court.\nThe court also ordered him to pay tens of millions of dollars in compensation to victims.\n“Hissene Habre was convicted of mass murder, torture and rape, and his premature release would violate not only the rules of the African court which convicted him but also Senegal’s obligation to adequately punish those crimes, as the United Nations Committee against Torture has made clear,” said international human rights lawyer Reed Brody, who has worked with Habre’s victims since 1999. “We can only take the government at its word that this is a temporary measure to protect Habre’s health.”\nThe victims, he said, are still awaiting payment of the reparations.\n___\nBabacar Dione in Dakar, Senegal contributed.", "url": "https://apnews.com/7e70484668c02b44f3e26d3ebba2c279"}