{"authors": ["Ray Sanchez", "Rosa Flores", "Sara Weisfeldt"], "date_download": "2020-05-04 16:05:28", "date_modify": "2020-05-04 16:05:28", "date_publish": "2020-04-01 19:24:55", "description": "A pair of cruise ships carrying more than 200 guests and crew with flu-like symptoms, including eight passengers who tested positive for Covid-19, were expected off Florida's coast early Thursday.", "filename": "2020_04_01_us_holland-america-zaandam-cruise-ship-florida_index_1588608328.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200328211531-03-zaandam-cruise-ship-0327-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_us_holland-america-zaandam-cruise-ship-florida_index_1588608328.html", "title": "Cruise ships with hundreds of sick passengers to arrive off Florida coast early Thursday", "title_page": "Zaandam and Rotterdam cruise ships to arrive off Florida coast early Thursday with hundreds of sick passengers  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A pair of cruise ships carrying more than 200 guests and crew with flu-like symptoms, including eight passengers who tested positive for Covid-19 , were expected off Florida's coast early Thursday.\nBut whether passengers will be allowed to disembark remained unclear.\nCalling the plight of those on board a \"humanitarian situation,\" Holland America ON Wednesday evening made a last-ditch appeal to federal and local authorities to allow the Zaandam and Rotterdam cruise ships to disembark in Fort Lauderdale's Port of Everglades.\n\"We appreciate the support of President Trump in resolving the humanitarian plight of our guests,\" the British-American cruise line said in a statement. \"Holland America Line calls for compassion and reason in the review and approval of our disembarkation plan by Florida officials.\"\nThe appeal came hours after Gov. Ron DeSantis said his state was willing to accept Floridians on board the cruise ships.\n\"My concern is that we have worked so hard to make sure we have adequate hospital space in the event of a Covid-19 surge, we wouldn't want those valuable beds to be taken because of the cruise ship,\" DeSantis said.\nThere are 808 guests and 583 crew on the Rotterdam and 442 guests and 603 crew on the Zaandam, according to Holland America. There are 311 American citizens, including 52 Floridians.\nDeSantis expressed concerns about taking in others given the state's limited hospital beds.\n\"We are going to be willing to accept Floridians on board,\" he told reporters. \"My understanding is most of the passengers are foreign nationals.\"\nThe cruise line said 97 guests and 136 crew on the ships have flu-like symptoms. The ill passengers would stay isolated on board until they recover.\nHolland America said it had secured a local health system to treat the fewer than 10 people in need of immediate critical care onshore.\n\"This small number is the only group that will require any support from medical resources in Broward County and is necessary to prevent further harm to their health,\" the cruise line statement said.\nNearly 1,200 guests are fit to travel home, per CDC guidelines, according to the cruise line, which suggested those travelers could catch flights home after disembarking. The guests would be transported in sanitized coaches with limited person-to-person contact and masks.\nThe governor has said there is about 30% hospital bed availability in Florida, where two field hospitals have been set up in Miami-Dade and Broward counties.\nTrump on Tuesday night said he had planned to discuss the situation with DeSantis.\n\"People are dying on the ship, or at least very sick, but they are dying on the ship,\" Trump said. \"So, I'm going to do what is right.\"\nFort Lauderdale's mayor said he planned to meet Wednesday with Holland America's CEO to discuss a possible solution.\n\"We want these ill people to find immediate medical assistance,\" Mayor Dean Trantalis told CNN. \"We have to be comfortable knowing that they're being quarantined in such a way they don't infect the rest of the community.\"\nHolland America's Zaandam cruise ship, with sick passengers and crew members on board, seeks a port to dock.\n\"We were not against the ships docking in our community,\" Trantalis said. \"The problem is that no protocol has been established yet to allow these folks to come off the ship. We are in a midst of a humanitarian crisis here.\"\nUS Coast Guard says foreign vessels were straining medical resources\nUS Sen. Rick Scott of Florida has said every Zaandam passenger must be quarantined for 14 days.\n\"We have to ensure the sick are getting properly treated, but we can't take any chances,\" he said in a statement this week.\nThe Zaandam began transiting the Panama Canal late Sunday after being docked off Panama for several days. The boat and its occupants have been in limbo for weeks awaiting permission to disembark after several South American ports denied the ship's entry.\n\"We have to be able to allow people to step off the ship and be able to return to families, whether in Florida, anywhere in this country or anywhere around the world,\" Trantalis said Wednesday. \"But we cannot do it willy-nilly. We have to be sure we're taking precautions.\"\nThe US Coast Guard, in a marine safety information bulletin issued Sunday, said an increase in foreign passenger vessels requiring medical evacuations was straining local medical resources.\nPassengers have \"better access to comfortable surroundings and medical staff on board the foreign passenger vessel where care is already being provided,\" according to the bulletin.\n\"This is necessary as shore-side medical facilities may reach full capacity and lose the ability to accept and effectively treat additional critically-ill patients,\" the bulletin said.\nJennifer Allan said her mother, Gloria Weed, 70, and father, Bill Weed, 75, have been quarantined in their cabin aboard the Zaandam in what she described as \"solitary confinement.\"\n\"My dad has developed pneumonia,\" she told CNN this week. \"He's getting worse. They need to get to land. They need to get medical attention sooner rather than later.\"\nAllan said her parents, who live in Sarasota, Florida, came down with a fever about 10 days ago. She described the efforts of the Zaandam crew members to care for passengers as \"extraordinary\" even though many are themselves sick.\nNo one has left the ship since it stopped in Punta Arenas, Chile, on March 14. Guests were originally told they could disembark in Chile for flights, but ultimately that was forbidden.\nHolland America deployed the Rotterdam to offer relief. Rotterdam met Zaandam off Panama on March 26 to \"provide extra supplies, staff, Covid-19 test kits and other support as needed.\"\nPreviously, the ship had no coronavirus test kits on board.\nHolland America transferred healthy Zaandam guests to Rotterdam, which is also is looking for a port. Wednesday afternoon, both vessels were off the western tip of Cuba, according to the ship tracking website MarineTraffic.\nThe president of Holland America Line, Orlando Ashford, wrote an op-ed printed in the South Florida Sun Sentinel on Monday asking for compassion for the Zaandam's guests.\n\"And we need confirmation from a port that is willing to extend the same compassion and grace that Panama did, and allow us to come in so our guests can go straight to the airport for flights home. It's tempting to speculate about the illnesses that may have been avoided or lives saved if we'd gotten the assistance we sought weeks ago,\" he wrote as the ship seeks a place to dock.", "url": "https://www.cnn.com/2020/04/01/us/holland-america-zaandam-cruise-ship-florida/index.html"}