{"authors": ["Summer Ballentine", "Margaret Stafford"], "date_download": "2020-05-04 20:07:13", "date_modify": "2020-05-04 20:07:13", "date_publish": "2020-04-09 15:21:39", "description": "COLUMBIA, Mo. (AP) — An additional 91,000 Missouri residents applied for unemployment last week as the economic toll from the coronavirus grew, while Gov. Mike Parson on Thursday ordered public...", "filename": "_cd02c958270086ccbafcd147b3928314_1588622833.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cd02c958270086ccbafcd147b3928314_1588622833.html", "title": "91,000 more people file for unemployment in Missouri", "title_page": "91,000 more people file for unemployment in Missouri", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "COLUMBIA, Mo. (AP) — An additional 91,000 Missouri residents applied for unemployment last week as the economic toll from the coronavirus grew, while Gov. Mike Parson on Thursday ordered public schools to stay closed for the rest of the year.\nThe number of new unemployment claims for the week that ended Tuesday is more than eight times higher than in all of April 2019, when close to 10,700 claims were filed, according to data from the state’s labor department. The previous week, more than 104,000 new claims were filed.\nThe state has been overwhelmed with calls about filing for unemployment and is encouraging people to file claims online.\nNearly 238,000 people filed new unemployment benefit claims in Missouri in the first three weeks after the coronavirus crisis began hitting the economy. That’s more than 1 in 12 eligible workers.\nThe state’s social services agency says food banks will start handing out 25-pound food packages this week at mobile and drive-thru sites.\nParson directed K-12 public schools to stay closed for the rest of the academic year to prevent spread of the virus, but he said remote learning should continue through the end of the semester.\nThe Republican governor added that he doesn’t support changing state law to allow widespread mail-in and early voting to prevent crowding at polls. He discouraged making “drastic changes out of fear.” Missouri has already held its presidential primary, but municipal elections are scheduled for June and a primary for other offices is set for August.\nJohns Hopkins University on Thursday said the state had 3,432 cases and 93 deaths. State health officials reported 3,539 cases of COVID-19 and 77 deaths as of Thursday afternoon. Missouri’s health director says the state takes time to vet each reported death before adding it to its official count.\nDr. Frederick Echols, head of the St. Louis Health Department, issued a plea Thursday to African Americans to take precautions against the disease.\nEchols said in an editorial published in the St. Louis American, a newspaper that covers the city’s black community, that all 12 victims in St. Louis as of Wednesday were black. Blacks make up about 46% of the city’s population, according to census figures.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. But Echols noted black people are already disproportionately affected by some preexisting conditions that make the coronavirus more dangerous, such as heart conditions and diabetes.\nSt. Louis has not published a racial breakdown of those who have tested positive for the virus, but city officials plan to release more data this week, said mayoral spokesman Jacob Long.\nMissouri hadn’t previously released racial data about patients who become ill or die from the coronavirus because about 40% of medical providers were not reporting that information, the state health director said Wednesday.\nData released Thursday showed about 33% of reported Missouri coronavirus patients were white, 25% were black, and the race was unknown in 36% of cases. About 47% of patients who have died were white, 18% were black and race was unknown in 31% of cases. Missouri’s population was about 83% white and 12% black based on 2010 census data.\nAn AP analysis of U.S. data found that about 42% of the victims whose demographic information was publicly shared by officials were black. African Americans made up roughly 21% of the total population in the areas covered the analysis.\n_____\nStafford reported from Liberty, Mo.", "url": "https://apnews.com/cd02c958270086ccbafcd147b3928314"}