{"authors": ["Jeff Zeleny", "Dan Merica"], "date_download": "2020-05-04 15:57:34", "date_modify": "2020-05-04 15:57:34", "date_publish": "2020-04-07 19:20:01", "description": "As voters arrived at the polls in Wisconsin on Tuesday in the midst of a pandemic, the images of snaking lines, mask-clad citizens and apprehensive poll workers reinforced by National Guard troops provided an early glimpse into the fight over voting rights that could surround November's critical general election.", "filename": "2020_04_07_politics_general_b8efa7bf4d22fb72c2050d2df2b09063_index_1588607854.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407144457-09-wisconsin-voting-lines-0407-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_general_b8efa7bf4d22fb72c2050d2df2b09063_index_1588607854.html", "title": "A pandemic primary in Wisconsin offers glimpse into voting rights fight ahead", "title_page": "A pandemic primary in Wisconsin offers glimpse into voting rights fight ahead - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As voters arrived at the polls in Wisconsin on Tuesday in the midst of a pandemic , the images of snaking lines, mask-clad citizens and apprehensive poll workers reinforced by National Guard troops provided an early glimpse into the fight over voting rights that could surround November's critical general election.\nThe prelude to the Wisconsin primary on Tuesday was utter chaos , punctuated by two late-night legal decisions -- one from the Wisconsin Supreme Court, another by the United States Supreme Court -- that gave the final green light to voting just hours before polling places opened in the state.\nRepublicans, after the courts stopped Democratic Gov. Tony Evers' bid to postpone the election and halted a lower court's ruling that would have given voters an extra six days to return their mail-in ballots, cheered that voting would continue as scheduled. They argued Democrats were looking to rewrite voting laws and opportunistically using the deadly outbreak to do so.\nWhile Democrats and voting rights advocates are resigned to the disarray that led Wisconsin to holding its primary, many see it as a proof point the party and its allies must do more before November to prevent the battleground state from becoming a foreboding sign about the partisan rancor and confusion that could play out nationwide.\n\"The pictures coming out of Wisconsin are troubling. This is unnecessary and harmful,\" said Eric Holder, the former attorney general under the Obama administration who now runs National Democratic Redistricting Committee, a voting rights organization. \"If we do not enact electoral procedures that are health sensitive, we will be putting the well-being of all Americans -- no matter their political preference -- at risk.\"\nThe outbreak of the novel coronavirus has already upended primary contests from coast-to-coast, but it also threatens to fundamentally change the way Americans vote in the general election, with safety and security at neighborhood polling places suddenly becoming a pressing concern.\nYet long before the fears of Covid-19, both parties were gearing up for an epic clash over voting rights, likely the most extensive fight since the one that led to the Voting Rights Act more than a half century ago. Even now, six months before Election Day in November, at least 20 lawsuits are unfolding in 14 states across the country.\n\"What Covid has done is poured gasoline onto an otherwise set of hot coals,\" said Marc Elias, the Democratic Party's leading election lawyer. \"We've gone from a low-level burn to a much higher raging fire.\"\nAn early chapter of the fight was playing out Tuesday across Wisconsin, which will be among the most closely watched battleground states leading up to November. Voters were not only casting ballots in the lingering Democratic primary contest between former Vice President Joe Biden and Vermont Sen. Bernie Sanders, but also in a critical race for the Wisconsin Supreme Court, which is expected to hear voting-rights cases this year.\nThe state, by not moving the election, has now earned an infamous reputation: Wisconsin is the only state with an election scheduled for April to avoid postponing in-person voting or move entirely to mail-in balloting because of the coronavirus outbreak.\nVote-by-mail\nWhile vote-by-mail has gradually become routine in several parts of the country, primarily in the West, other states have resisted efforts to simplify casting ballots. Republicans have worked to tighten restrictions on absentee and early voting in several states, with GOP-controlled legislatures arguing voter identification rules should be strengthened to prevent abuse or fraud.\nA leading example is in Wisconsin, which has steadily moved to stricter voter ID requirements, including uploading a photo when requesting an absentee ballot. The state, which President Donald Trump won in 2016, was already emerging as ground zero for the voting rights fight of 2020.\n\"Wisconsin's election offers a nightmare vision of what the whole country could see in the fall,\" said Ben Wikler, chairman of the Wisconsin Democratic Party. \"A fight in which Democrats struggle to balance democracy with public health, and the GOP remorselessly weaponizes courts, election laws, and coronavirus itself to disenfranchise the voters who stand in its way.\"\nThe President has repeatedly, without presenting evidence, incorrectly suggested rampant voter fraud prevented him from winning the popular voter over Hillary Clinton four years ago. He has now taken up the fight against the expansion of vote-by-mail in the age of coronavirus, which was a provision of the congressional aid package passed last month.\nThe law signed by the President included $400 million to help pay for voting measures, which was far short of the $2 billion that Democrats say is required to prepare states to expand vote-by-mail and make other accommodations for helping citizens vote in the fall.\n\"Mail ballots are very dangerous things for this country,\" Trump said during the White House coronavirus task force briefing on Tuesday, offering no proof for his assertion against Democratic rivals. \"They go and collect them. They are fraudulent in many cases. You got to vote. They should have voter ID, by the way, if you want to do it right.\"\nThe President has repeatedly promoted the conspiratorial argument that the rise of voting-by-mail would give the Democratic Party an unfair advantage at the ballot box, with minorities and younger voters who may favor Democratic candidates being able to cast their ballots with fewer impediments.\n\"If you ever agreed to it, you'd never have a Republican elected in this country again,\" Trump said in a late March interview on Fox News' \"Fox and Friends.\"\nTrump, earlier this month and without evidence, said that he believes \"a lot of people cheat with mail-in voting.\"\nThe President's unproven allegations, once relegated to fringe conspiracy theorists, have now become a central argument among party leaders, including the Republican National Committee chairwoman, Ronna McDaniel, who suggested Democrats were \"already plotting their next attempt to use the pandemic for political gain.\"\n\"The Democrats' all-mail ballots proposal is a ruse to legalize ballot harvesting nationwide,\" McDaniel wrote in an opinion piece this week for Fox News. \"Any person would be allowed to return an unlimited number of absentee ballots for voters, opening the door for political operatives to deliver ballots in bulk.\"\n'We have to prepare'\nVoting rights advocates -- like Michael Waldman, president of the Brennan Center for Justice -- see warning signs in the fact that Republicans have turned vote-by-mail, an issue that wasn't the center of partisan fighting over voting rights before the virus, into a partisan hot button.\nWaldman, whose organization has pushed the federal government to spend $2 billion to prepare states to administer the November election during the pandemic, said one of his biggest concerns is that some epidemiologists believe the virus could be seasonal and return in the fall.\n\"Unless we want to operate under the assumption that this will all go away, we have to prepare,\" Waldman said. \"If we as a country don't take action, there could be 50 Wisconsins in November. ... What Wisconsin shows is if we don't act, it will be very hard to have an election where everyone can participate in November.\"\nAs states scramble to change how ballots will be cast in the country -- gearing up for November, but also primaries that have been pushed back until June in Pennsylvania, New York and more than a dozen states -- Democratic lawyers also argue that safe accommodations must be made for Americans who prefer to vote in person.\n\"We have to anticipate today if we want to be ready in November,\" Stacey Abrams, a former Georgia gubernatorial candidate who founded the voting rights group Fair Fight after access to the ballot box became central to her 2018 loss, said during a recent online fundraiser about the possibility that what voters experience today could be amplified in November.\nBiden, whose rise in the Democratic primary has been facilitated by those same minority voters who prefer voting in person, voiced his trepidation about the limitation of voting-by-mail during an interview with NBC on Tuesday.\nWhile Biden has a nearly-insurmountable delegate lead over Sanders, their primary race continues. Local contests were also driving voters to the polls Tuesday across Wisconsin, where in Milwaukee only five voting centers were open to cast a ballot in person, compared to 180 locations on a typical Election Day\n\"We have to make our democracy, as well as dealing with the disease, function. We can do both,\" Biden said.\nThe former vice president raised the prospect of expanding vote-by-mail across the country, but then added, \"I'd much prefer to have in-person voting, but it depends.\"\nIt was clear on Tuesday, though, that even voters were fed up with the uncertainty.\nStanding in a line outside Washington High School on Tuesday, Jennifer Taff of Milwaukee was photographed in the online edition of the Milwaukee Journal Sentinel. She wore a blue mask and held a cardboard sign that declared: \"This is ridiculous.\"", "url": "https://www.cnn.com/2020/04/07/politics/general-election-wisconsin-primary-coronavirus/index.html"}