{"authors": [], "date_download": "2020-05-04 20:08:12", "date_modify": "2020-05-04 20:08:12", "date_publish": "2020-04-17 02:09:52", "description": "DALLAS (AP) — The number of deaths in Texas caused by the new coronavirus has topped 400 and confirmed cases are approaching 17,000, according to statistics compiled Thursday evening at Johns...", "filename": "_ad7d08e2a6c5fcb4ea797434cd5a32ef_1588622892.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ad7d08e2a6c5fcb4ea797434cd5a32ef_1588622892.html", "title": "Texas COVID-19 deaths top 400; cases approaching 17,000", "title_page": "Texas COVID-19 deaths top 400; cases approaching 17,000", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DALLAS (AP) — The number of deaths in Texas caused by the new coronavirus has topped 400 and confirmed cases are approaching 17,000, according to statistics compiled Thursday evening at Johns Hopkins University.\nTexas has reported 414 deaths to COVID-19, the illness caused by the coronavirus, an increase of 39 deaths in one day, according to a Thursday night update by the university’s Center for Systems Science and Engineering.\nConfirmed cases in Texas had reached 16,876 by Thursday night, up by 972 cases in one day.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death. The vast majority of people recover.\nThe new coronavirus has caused a global pandemic that has sickened at least 2.1 million, killed more than 144,000 worldwide, crippled economies and forced restrictions on the movement of millions of people in an effort to stop the virus from spreading further and overwhelming health care systems.\nIn Texas, Harris County has reported the most cases with 4,306 and the most deaths with 63. Dallas County ranks second with 2,066 cases and 50 deaths.", "url": "https://apnews.com/ad7d08e2a6c5fcb4ea797434cd5a32ef"}