{"authors": ["Cal Winslow", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Joshua Freeman"], "date_download": "2020-05-04 19:49:14", "date_modify": "2020-05-04 19:49:14", "date_publish": "2020-05-01 00:00:00", "description": null, "filename": "2020_05_seattle-general-strike-1918-spanish-flu_1588621754.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/05/01102901/ftpcake-5.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_05_seattle-general-strike-1918-spanish-flu_1588621754.html", "title": "When the Seattle General Strike and the 1918 Flu Collided", "title_page": "When the Seattle General Strike and the 1918 Flu Collided", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "November 11, 1918. The war was finished. There were wild celebrations everywhere — everywhere, that is, in France, Britain, and the United States. Spontaneous demonstrations of relief and happiness erupted, and millions took to the streets of Paris, London, and New York. In Seattle, the Star pronounced, “War is Over!” The city learned of the armistice on Sunday night, November 10; at once, people took to the streets. In the morning, the mayor was awakened to find the streets filled, his planned proclamation of a holiday irrelevant; his wish for a proper, orderly, patriotic manifestation was superseded. Revelers celebrated not just the end of the war, but also what they thought to be the end of the so-called Spanish flu. Over the course of that day, makeshift bands appeared, with people banging garbage-can lids and lunch buckets, car horns blasting. Workers abandoned the shipyards, longshoremen quit the waterfront, and the city center was gridlocked. The city’s health authorities, too, were taken aback. There were no masks to be seen; social distancing was defiantly disregarded. They had their own plans in the works, perhaps with some recklessness, to withdraw their edicts, their restrictions on crowds and mandatory masking, and to triumphantly pronounce the influenza beaten. Sailors, first carriers of the influenza and also its first victims, were ordered into the crowds to ensure that the celebration was official and properly patriotic. The November celebrations were also suggestive of a level of underlying discontent, a prelude to another war coming, to a return of “normalcy” in the nation’s most class-divided, strike-prone city — above all to the great “Seattle Strike.” “The war to end all wars,” the papers repeated without a blush. Yet 10 million had been lost in the slaughter on the Western Front; millions more were maimed, emotionally as well as physically. In Central and Eastern Europe, there were vast swaths of devastation, the heart of the continent was in ruins, and there were new armies, this time of scavengers and homeless, creatures without hope. The Seattle Star featured a half-page, triumphant Jesus, captioned “Peace on Earth.” Then came the mindless boastings of victory, of “sacred unions,” “homes for heroes,” “democracy at full tilt.” “We won the war!” The workers of Seattle, however, had never really supported this war, unless one reduced it to “supporting the troops,” the mantra in all wars. Still, they celebrated; especially if it meant an end to long hours, short pay, conscription; to “sedition” charges and “criminal syndicalism” laws; to the red squads, raids, and prison sentences. The killing — nearly 5 million Americans served in World War I, and 53,000 were killed in action — was not restricted to the trenches. On the home front, the influenza killed 675,000, and more than 1,500 deaths were recorded in Seattle.\nThe Flu Comes to Seattle In the winter of 1918, much of the city — the schools, and most public places — was still reopening. It remained unclear if the epidemic was, in fact, finished, with a second spike just before Christmas. The heavy rains had begun. The first loggers were drifting back; they joined others — wandering, homeless men on the city’s mean streets, waiting for spring and work to resume. This was ordinary in Seattle in winter. Now, however, newcomers appeared, some still in uniform, wanting work. Some were sick. The Union Record , the city’s union-owned daily newspaper, reported that “peace” abroad was bringing hunger at home. One man, a union representative from the Metal Trades Council (MTC), told reporters that he had been approached “by 15 soldiers in one night, all for bed and board.” It had taken time for the influenza to reach Seattle. This city of three hundred thousand, situated in the far northwestern corner of the nation, was two mountain ranges and several long days from Chicago by train; it was weeks from the East Coast by the Panama Canal, and still much longer around the Strait of Magellan. Seattle was, in this sense, isolated, yet by war’s end, it had become the center of trade with Asia, two days closer to Vladivostok than its rival to the south, San Francisco. It was the gateway to Alaska and its fisheries. Wheat from the great fields of the Palouse was shipped from its docks. Seattle had become an imperial outpost. The Puget Sound country bristled with warship building and armed encampments. Camp Lewis, just south of Tacoma, was the largest such base in the West. Bremerton, across the bay, was home port for the navy’s North Pacific fleet. Sailors trained there; warships, meant for the Asian “theater,” were built in its yards. The real war, of course, was an ocean away in the other direction. In spite of this, Seattle’s shipyards — the city’s “basic industry” — produced more ships for the war (ninety in total, steel hulled) than any other shipyard in the country. The yards were “the life” of the city, “pulsing through every [other] industry, affecting all workers.” These yards employed some thirty five thousand men; fifteen thousand more worked in Tacoma’s shipyards. The influenza, despite its name, originated not in Spain but in Kansas in 1917, settling in Camp Riley. It was well traveled by the following summer’s end. It had first spread eastward, moving from camp to camp, reaching Europe with the arriving American Expeditionary Forces. It swept across Europe, adding a new dimension of horror to the trenches of the Western Front. Then home again to the United States, it returned with soldiers and sailors, killing ferociously. Public health officers in Seattle certainly knew about it and expected it, yet, as elsewhere, they were caught off guard when it actually appeared. It came in late September, by way of infected sailors in Boston dispatched to Philadelphia, then with the 334 of these who set sail from Philadelphia for Puget Sound. On arrival, many were desperately ill. “In the event the disease appears here,” announced Seattle’s commissioner of health, Dr J.S. McBride, on September 28, “and it is not unlikely that it will, we will endeavor to isolate the first cases and thus try to prevent it becoming an epidemic.” Isolation would begin with places of amusement, theaters, sporting events, restaurants, and saloons. It was also presented as an opportunity to shut down the city’s notorious Skid Row, with its flophouses, saloons, brothels, and various other places of unsavory amusement, including the headquarters of the Industrial Workers of the World (IWW, or Wobblies). Industry, however, would carry on, indeed be encouraged — the city’s “interests” were anxious to remain open, free of wartime restrictions, determined to reestablish the “open shop.” McBride and his staff watched for the first signs of the influenza; these came initially in the Navy’s facilities in Bremerton, then in Camp Lewis with, suddenly, reports of hundreds of cases of a severe influenza. These, the authorities initially insisted, were simply the flu, though noting that, in some cases, this flu quickly became pneumonia. Bremerton reported fourteen deaths. Sailors were ordered to avoid large gatherings. Visitors were banned. Camp Lewis was placed under quarantine. Still, in Seattle, McBride and staff looked in the wrong places, even when hundreds of cadets at the Naval Training Station at the University of Washington were reported to be suffering from a mild flu. For some reason, they saw the university as set apart. Their demesne was the city; McBride continued to pronounce Seattle influenza-free. Then, on October 4, one cadet was reported dead, hundreds more ill, and four hundred hospitalized. Precious time had been wasted. That night, two influenza cases were reported in the city — each resulting in death. The next morning, McBride met with the mayor, Ole Hanson, a real estate broker; together they announced to the public that the influenza had found its way to Seattle. McBride ordered all private and public dances prohibited, declared that streetcars and theaters had to be well ventilated, and ordered police to strictly enforce the anti-spitting ordinance. He appealed to the public to practice a voluntary quarantine. Over the next days, however, closings were ordered — first church services, then places of entertainment, then the public schools. The suddenness of the closures took the public by surprise and sparked some resistance. The superintendent of schools, Frank Cooper, believed them to be unwise: “I consider it more dangerous to have children running around the streets loose than to have them in school where they will be under strict medical supervision.” Crowds of people continued to congregate in the city’s theater district, large numbers of sailors mixing with them, despite police efforts to keep amusements closed. The police organized an “Influenza Squad” to enforce the orders, but results were mixed. Those who could began leaving the city, some to mountain retreats, others further afield. The writer Mary McCarthy’s parents evacuated to Chicago, where they each were stricken, dying before the year’s end, leaving their children orphans. McCarthy was returned to Seattle and put in the care of an aging aunt. Seattle’s officials singled out the shipyards for attention, though more in keeping with wartime patriotism than with concern for the health of the workers. The yards, after all, far from healthy places, were well known as rough-and-tumble work sites where “men came out covered in soot and red paint, exhausted from wielding thundering riveting guns. Every day or so some unlucky shipyard worker would be carried out in the dead wagon.” Influenza added to this toll. Still, McBride wanted to keep these workers on the job. He believed he could, especially as many of these workers toiled outside, where they were thought to be less susceptible to the disease than other factory workers. Nevertheless, he sought to inoculate the entire workforce with one of the sera that had been developed. “Let no question of money or men interfere with your work.” When requests came from others, he responded, “Seattle needs all the serum we can grow, and we will share with nobody until our shipyard workers and other citizens have been properly inoculated.” Workers were skeptical; war, the virus, and the brutality of work had produced widespread fatalism, a realism in the face of calamity in all quarters. The numbers of the sick and the dead rose, and by mid-October, four thousand cases had been reported; no evidence ever appeared to suggest the sera had been of use. Hanson and McBride were stubbornly confident that isolation and closures would work. Hanson maintained to the end that the influenza was really just a form of the flu, a “grippe.” He believed that it would last no more than a week. They were wrong. In no large American city was the influenza contained quickly. Within days, the flu reached all sections of Seattle, though “south of Yesler” and the Rainier Valley, home to Seattle’s slums and the cheap housing of the workers, suffered most. Frustrated, the authorities blamed a noncompliant public for the influenza’s persistence. They continued to work to see that the closure orders were widened and enforced. On October 28, McBride issued new orders, including mandatory wearing of flu masks. These were worn reluctantly; they came to be the symbols of Seattle besieged. Streetcar conductors were ordered to bar people not donning a face covering. Hanson told commuters that they had better find a mask and wear it, “or tomorrow morning they will walk to work.” In late October, however, the numbers of new cases of infection leveled off and then began to fall.\nStrike Town Seattle’s shipyard workers believed they had sacrificed unreasonably for the sake of the war. Their hours had been long, their work grueling. Hulet Wells, the onetime socialist president of the Seattle Central Labor Council (CLC), also president of the state’s Socialist Party, while awaiting sentencing for opposing conscription, found work at Skinner & Eddy, the largest of the yards. There he encountered a howling bedlam . . . a wilderness of strange machines, whirling belts and belching fires . . . The human ant heap boiled with all the specialists that fit into the modern shipyard. Everywhere there was deafening noise, boilers rang, planers screamed, long white-hot rods were smashed into bolt machines. Here was the angle-bending floor where black men beat a tattoo with heavy sledges, and here a steam hammer thumped its measured blows . . . [as well as] the wrenching scenes of the injured, the sirens of the ambulances, and the dying or dead being carted off into the chaos of the waterfront roadways. In 1917 and 1918, the city’s unions increasingly felt pressure from the federal government and its shipping board. The shipyard workers had worked with standards set nationally by labor boards in Washington, DC, even when believing themselves punished by these standards. It was indisputable that prices were higher on the West Coast — above all in Seattle — than in the East. The unions were especially intent on raising the wages of the unskilled and semiskilled, an immediate necessity in breaking down divisions in the shops. However, wage demands were repeatedly rejected. Seattle’s workers, inheritors of a decade of intense conflict, by the war’s end, believed themselves betrayed by the government. They had been lied to, they believed, by the president, the shipping board, and the city’s health officials. They were bitter, angry, and itching for a fight. They voted to strike in December. The January strike was inevitable. The men walked out on the morning of January 21, 1919. There were women scattered through their ranks, as well as black workers, though they were few and their union status unclear. Virtually all the AFL’s international unions in these trades barred women and blacks. A. E. Miller, the chairman of the MTC, announced the strike “absolutely clean,” meaning that thirty-five thousand workers struck en masse, and none came to take their places. They showed “splendid solidarity and great enthusiasm,” undaunted by the winter rain. Tacoma and Aberdeen quickly followed. Speaking on behalf of the workers, John McKelvey defied the owners. The “shipyard millionaires have been getting all the credit for the ships we have built. Oh yes, they’re ship builders. If they think they can build ships let ’em go ahead and build them!” The Union Record brought news of the strikers’ plight to its fifty thousand subscribers, supporting the strike without qualification. Next to its front-page lead on January 2, “45,000 Men Out in Sound Cities,” it ran an article titled, “Tremendous Profits Made by Seattle Shipbuilding Firms,” revealing the businesses’ costs, sales, and profits. The day’s editorial, “A Great Strike,” explained: “The whole question of wages is bound up in the tremendous increase in the cost of living in Seattle.” The strike, however, was not just a symptom — real enough in itself — but an indication as well of deeper frustrations and dissatisfactions. The strike wave of the war years — “an epidemic of strikes” — was both national and international, inspired in part by syndicalism. Seattle was both a strike center and a radical center, a stronghold of working-class socialism; its unions’ commitment to workers’ control ran deep, and support for the Russian Revolution was widespread. Kate Sadler, the workers’ “Joan of Arc,” had led Seattle’s delegation to the Mooney conference. Crystal Eastman in the Liberator reported that Sadler led her city’s “wild ones,” who insisted on a general strike no later than May Day to free the framed San Francisco union man. “Russia Did It!” would be the lead of a leaflet penned by the young Harvey O’Connor (illustrated with a brawny worker and a fat capitalist in a coffin — twenty thousand were distributed). At the same time, Seattle was filling up with unemployed, homeless, demobilized young men, and it was still not entirely free from the flu. In response, the MTC packed the Hippodrome with thousands to announce the formation of a “Soldiers, Sailors and Workers Council.” The meeting went forward despite the authorities, who surrounded the hall with military police. Thousands gathered in Tacoma as well, with Camp Lewis soldiers, no longer under quarantine, in attendance. It was increasingly clear that unions did not know with whom they were to negotiate: the national board or the local employers. In either case, the employers refused to budge, as did the eastern board members, the shippers, and their allies in the national AFL unions. The MTC thus turned to Seattle’s Central Labor Council (CLC), the federation of 110 local unions — the organization that, in defiance of the AFL, was built from the bottom up, that championed industrial unions, supported sympathy strikes, cooperated with the IWW, and was led by socialists — with a request for the strike. “The idea of a general strike swept the ranks of organized labor like a gale,” wrote O’Connor. On January 22, in an assembly of the CLC, in the Labor Temple, the metal workers made their case, requesting that Seattle’s workers join them in a general strike. The aim would be not only to win their demands but also to present a show of force in the face of the employers’ renewed open-shop campaign. They believed that the fate of the organized labor movement itself was at stake. Representatives of the city’s local trade unions and rank-and-file militants packed the Labor Temple. According to O’Connor, “Every reference to the general strike was cheered to the echo; the cautions of the conservatives . . . were hooted down” or interrupted by shouting, clapping, and singing. The CLC proposed a referendum on the strike, which passed unanimously. The enthusiasm that evening brought with it high rhetoric, emotion, even tears. Then came a cornucopia of demands; appetites grew, delegates revealing their own grievances and aspirations, hopeful that these, too, might be addressed. The metal workers, however, insisted that the strike’s demands be limited to those of the shipyard workers already out — what they wanted was a “clean-cut demonstration of the economic power of organized labor.” The meeting ended in an uproar when delegate Fred Nelson unfurled a banner showing a soldier and a sailor in uniform with a worker in overalls and the slogan “Together We Will Win.” This was followed by “a storm of applause which lasted several minutes,” abating only when delegate Ben King of the Painters, just returned from the Mooney Congress in Chicago, recounted “sleeping between soldiers and sailors and they are all with us.” The applause “broke out afresh.”\nAmerica’s First General Strike On February 6, 1919, Seattle’s workers — all of them — struck. In doing so, they literally took control of the city. They brought the city to a halt — a strange silence settled on the normally bustling streets, and on the waterfront, where “nothing moved but the tide.” The CLC’s Union Record reported sixty-five thousand union members on strike. It was a general strike, the first of its kind in the United States. Perhaps as many as one hundred thousand working people participated — the strikers were joined by workers not in unions, unemployed workers, and family members. The city’s authorities were rendered powerless — there was indeed no power that could challenge the workers. There were soldiers in the city and many more at nearby Camp Lewis, not to mention thousands of newly enlisted armed deputies, but to unleash these on a peaceful city? The regular police were reduced to onlookers; the generals hesitated. Rank-and-file workers, union by union, elected the strike leadership, a strike committee. The strike committee elected an executive committee. Meeting virtually nonstop, they ensured the health, welfare, and safety of the city. Garbage was collected, the hospitals were supplied, babies got milk, and the people were fed, including some thirty thousand a day at the strikers’ kitchens. The streets were safe, rarely safer, patrolled by an unarmed labor guard of workers. It was reported that crime abated. Nevertheless, the rich, those who could not or would not escape to Portland or California, armed themselves. The Seattle Star asked, “Under which flag?” — the red, white, and blue, or the red. The mayor, Hanson, claimed the latter and warned that a revolution was underway. The AFL piled on, denouncing the strikers and sending emissaries by the hundreds. The general strike was not a revolution. It was a coordinated action in support of the city’s shipyard workers. Still, there had never been anything quite like it. The strikers left their jobs amid the great strike wave of the First World War years and an international crisis that was, in fact, revolutionary in some places — a crisis evolving in the shadow of revolution in Russia. It was no wonder, then, that revolution was in the air — terrifying some, inspiring others. Then, too, no one knew for certain just how far this strike might go. The strike was simple and straightforward for many, a powerful statement of solidarity and nothing more. But others did indeed want more: all-out victory for the shipyard workers, for example. Some wanted much more, but surely no one could know, not on that cold February morning, not with any certainty, just what lay ahead. Hence the Union Record ’s February 6 editorial, written by Anna Louise Strong: ON THURSDAY AT 10 A.M. There will be many cheering and there will be some who fear. Both of these emotions are useful, but not too much of either. We are undertaking the most tremendous move ever made by LABOR in this country, a move which will lead — NO ONE KNOWS WHERE! We do not need hysteria. We need the iron march of labor. Seattle’s streets were quiet, and some thought this a problem. “Seattle Strikers Too Polite,” led the Appeal to Reason , the Midwestern Socialist newspaper. But this missed the point. The strikers feared provocation and had good reason to — it had been used time and again in the war against the Wobblies. Where the workers gathered, however, in the “feeding stations,” the union halls, the co-op markets, or the neighborhoods where workers and their families lived, it was another story. The “feeding stations” were showcases of self-organization. They may have been authorized by the strike committees; on the ground, they depended on the creativity of ordinary people. Thousands of volunteers took on the strike’s tasks, including running the kitchens, organizing milk distribution, and policing the city. The process of handing out milk was elaborate. “The dairies supplied by the milk dealers were only eleven in number, [and] so located that it would have been impossible for the mothers of Seattle to secure milk unless they owned automobiles.” The milk wagon drivers therefore “chose 35 locations spaced throughout the city, secured the use of space in stores, and proceeded to set up neighborhood milk stations.” Strong asked if the kitchens ever gave away meals. “Lots of them,” was the response. “We don’t refuse anyone, union or non-union if they can’t pay.” The strike may well have been the only occasion, before or since, when no one in Seattle went hungry. On Saturday night, the strikers held a dance, and as late as Monday, they organized massive strike rallies. In the Georgetown neighborhood, the crowd was so large that the building sank somewhat and had to be evacuated. The meeting reconvened, and with great enthusiasm . . . it was decided to make the meetings a regular weekly event . . . it was unanimous that the strike should continue until a living wage had been obtained by the shipyard workers. . . . Many of those present expressed the opinion that the scope of the meetings should be enlarged to include the wives and daughters of the workers, and to make them real community gatherings for the discussion of questions in which all are concerned. In all these places, the strike was the topic. It was analyzed, criticized, extolled, and debated, and when the workers’ representatives packed the rowdy, emotion-filled strike committee meetings, they came prepared; they were making history, and they knew it. The general strike served notice that Seattle’s workers had become a class “for themselves” — class conscious and “there at the creation,” as the late historian E. P. Thompson put it. “Consciousness of class arises in the same way in different times and places, but never just the same way,” he wrote in The Making of the English Working Class .\nStopping Short Alas, “The exhilaration from the marvelous display of solidarity experienced Thursday and Friday began to give way to apprehension,” wrote O’Connor. By the third day of the strike, they realized that the Seattle labor movement stood alone. The strike had not spread down the coast to California, nor was there support from across the nation. There was little, O’Connor observed, “to give aid and comfort, even verbally, to the labor movements of Seattle and Tacoma. Seattle, unfortunately, was all too unique in its militancy.” And, against them, the response of the authorities was unrelenting, especially the fearmongers. They frantically forecast a terrible future at hand: Bolshevism, anarchy. Hanson, egged on by the papers, denounced the strike as “un-American” and refused to negotiate. The Post-Intelligencer observed: “The big fact that stands out from the temporary confusion of business is that Seattle, given a brief time for readjustment, would be well off, if not better than before, if the whole of its striking population [were] suddenly withdrawn from the city.” Hanson threatened martial law if the strike were not ended by 10 a.m. on Saturday. The “interests” in New York and Washington, DC, joined the chorus. The AFL denounced the strike, with the Teamsters Joint Council ordering the strikers back to work. There were telephone calls and telegrams, and a deluge of intimidation, threats, and vilification from the international offices. The AFL censored the Central Labor Council and would later take credit for defeating its “strike.” Then the international officers arrived in person, threatening to rescind charters, seize union properties, and fire staff. Meanwhile, the shipyards in the East and California carried on as usual. The risk of the owners permanently shutting down the Seattle yards now seemed only too real — deliberative, political deindustrialization. On Saturday, February 8, several unions returned, though this was by no means a stampede. The Executive Committee voted eleven to two to end the strike. They chose Jimmy Duncan, president of the CLC, not a delegate, to speak to the strike committee for them. He tried to convince those in attendance that continuing the walkout was futile. He failed. The strike committee, infuriated by Hanson’s threats and still committed to victory, overwhelmingly voted to continue the strike, as did the longshoremen and the Metal Trades unions. The divide increasingly became one between the rank and file, on the one hand, and the executive committee, on the other. Then on Monday, with more unions yielding, Duncan returned to the strike committee. He recommended ending the strike on Tuesday at noon. He requested that those unions that had returned to their jobs come back out so that the strikers could return united; as they had left on Thursday, they would return on Tuesday. The shipyard strikers remained out one month longer.", "url": "https://jacobinmag.com/2020/05/seattle-general-strike-1918-spanish-flu"}