{"authors": ["Tali Arbel"], "date_download": "2020-05-04 20:11:38", "date_modify": "2020-05-04 20:11:38", "date_publish": "2020-03-13 16:41:35", "description": "NEW YORK (AP) — You're washing your hands countless times a day to try to ward off the coronavirus. You should also wash that extension of your hand and breeding ground for germs — your...", "filename": "_7c2fbc713028308ba6b69be3d6e4b6b9_1588623098.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9453ea96afe940bcbc6558b5a3595b30/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7c2fbc713028308ba6b69be3d6e4b6b9_1588623098.html", "title": "How to clean the bundle of germs that is your phone", "title_page": "How to clean the bundle of germs that is your phone", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "How to clean the bundle of germs that is your phone\nPedestrian uses her phone while wearing a face mask in Herald Square, Thursday, March 12, 2020, in New York. New York City Mayor Bill de Blasio said Thursday he will announce new restrictions on gatherings to halt the spread of the new coronavirus in the coming days, but he hopes to avoid closing all public events such as Broadway shows. For most people, the new coronavirus causes only mild or moderate symptoms. For some it can cause more severe illness. (AP Photo/John Minchillo)\nPedestrian uses her phone while wearing a face mask in Herald Square, Thursday, March 12, 2020, in New York. New York City Mayor Bill de Blasio said Thursday he will announce new restrictions on gatherings to halt the spread of the new coronavirus in the coming days, but he hopes to avoid closing all public events such as Broadway shows. For most people, the new coronavirus causes only mild or moderate symptoms. For some it can cause more severe illness. (AP Photo/John Minchillo)\nNEW YORK (AP) — You’re washing your hands countless times a day to try to ward off the coronavirus.\nYou should also wash that extension of your hand and breeding ground for germs — your phone. Tests done by scientists show that the virus can live for two to three days on plastic and stainless steel. The Centers for Disease Control and Prevention recommends cleaning all “high-touch” surfaces daily, including phones, keyboards and tablet computers.\nBut cleaning your phone improperly can damage it. You want to avoid getting moisture inside it or scratching the surface. Don’t spray cleaners directly on the phone, don’t dunk it in cleaning solutions, don’t spray it with compressed-air devices used to clean keyboards and avoid rubbing it with abrasive materials.\nInstead, start by turning off the phone and unplugging all cables. Your phone shouldn’t be charging as you clean.\nYou can use Clorox wipes or wipes with 70% alcohol, which you can get at the drugstore, to wipe down your phone. Apple, which has cautioned against using household cleaners on its phones, says to do that “gently.” AT&T has further recommended wringing out disinfectant wipes before using them on a phone.\nYou can also use soft cloths to clean the phone, like a microfiber cleaning cloth or the cloths used to clean camera lenses or your glasses. Google says you can dip the cloth in soap and water, as long as you’re careful not to get moisture in the phone. AT&T says paper towels work, too. You can spray them with disinfectant. Again, don’t spray the phone itself.\nSamsung, the world’s biggest phone manufacturer, says it’s offering a free phone-sanitizing service involving UV light inside U.S. Samsung stores and service centers. It will expand to other countries in the next few weeks.\nThe phone-cleaning step is one of many measures public-health authorities are recommending to try to slow the spread of the virus, which has infected 137,000 people worldwide. More than 5,000 have died. Most patients have only mild or moderate symptoms, but the elderly and people with existing health conditions are particularly vulnerable.", "url": "https://apnews.com/7c2fbc713028308ba6b69be3d6e4b6b9"}