{"authors": ["Analysis Stephen Collinson"], "date_download": "2020-05-04 16:58:37", "date_modify": "2020-05-04 16:58:37", "date_publish": "2020-04-09 04:26:34", "description": "Staggering new data showing horrific job losses sparked by coronavirus shutdowns and projections of a lower-than-expected death toll are sharpening the agonizing dilemma confronting President Donald Trump.", "filename": "2020_04_09_politics_donald-_2d4336e1bb1c212e6983c51733327787_index_1588611517.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403082550-donald-trump-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_donald-_2d4336e1bb1c212e6983c51733327787_index_1588611517.html", "title": "Disastrous jobs data sharpens Trump's dilemma over closed economy", "title_page": "Disastrous jobs data sharpens Trump's dilemma over closed economy - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "How does he find the balance between keeping the economy shut -- to squelch the murderous pandemic -- and allowing a resumption of normal life in order to ease the deprivation now threatening many millions of Americans?\nThe President and officials around the country must answer if they are willing to exchange a return to the routines on which tens of millions of people depend for a likely consequent rise in the rate of infection.\nThe question also has an increasingly acute political dimension for Trump. Former Vice President Joe Biden is now confirmed as his Democratic rival just as the President is deprived of a crucial political asset -- a roaring economic engine -- on which he banked his hopes for a second term.\nFresh evidence of economic carnage is also likely to heap new pressure on Congress as lawmakers consider a new economic stimulus package.\nNew Labor Department figures on Thursday showed that 6.6 million Americans made initial unemployment claims last week, bringing the three-week cumulative total to more than 14 million. The unemployment rate had been running at historic 50-year lows but when the next monthly figures are calculated, some economists warn that it could be as high as 15%.\nThe jobless rate peaked at 24.9% in the 1930s while unemployment hit 10% in October 2009 as a result of the Great Recession.\nThe latest job losses are certain to spark fresh calls for Trump to get the economy moving again to avoid permanent damage to the jobs market, especially on conservative media which has a strong influence on his thinking.\nThe risk is that lifting the deep freeze too early could give the virus a chance to make a comeback. Coronanvirus task force member Dr. Deborah Birx made clear on Wednesday that the reason why models have been revised downward is because of the aggressive social distancing. But those models are also based on the assumption that social distancing measures remain in place for months to come.\nEarlier this month, Birx and Dr. Anthony Fauci used models showing between 100,000 and 240,000 Americans could die from Covid-19 even with comprehensive stay-at-home efforts. In recent days, the estimate has been revised downward to 60,000. While that total represents grave human misery -- it will add fuel to those who warn the \"cure is worse than the disease.\"\nFauci said Thursday on \"CBS This Morning\" that the economy could not just be switched on like a light, and that it was imperative to keep up the pressure of stay-at-home orders to suppress the virus.\n\"We've got to continue in many respects to redouble our efforts at the mitigation of physical separation in order to keep those numbers down,\" Fauci said.\nAmerica on Wednesday experienced another tragic day with more than 1,800 deaths reported from Covid-19. Despite hopes that the pandemic is reaching its apex soon in hotspots such as New York, other regions of the country are on a slower timetable as the virus spreads, complicating any decision on an economic reboot.\nTrump cannot afford to get this one wrong -- for many reasons\nWhite House incumbents who campaign for reelection with the economy in reverse almost always lose. Trump is in a unique spot. No other American president has deliberately closed down a soaring economy in an election year. It would be a bitter irony if the economy and stock market he spent three years celebrating cannot escape the mire and dooms of a political career effectively ended by his own hand.\nGiven the huge pressures, the President -- who just a few weeks ago predicted he could get the economy raring by Easter -- was unusually circumspect at his daily briefing on Wednesday.\n\"I can't tell you in terms of the date. We don't want to go down and then start going up if we aren't careful, so we have to be careful,\" Trump said.\nThe President soberly promised to take counsel from \"the professionals\" and \"the experts\" ahead of any decision to step back from social distancing and stay-at-home recommendations that are now confining more than 90% of Americans.\nTrump has long predicted that the economy will go back up like a \"rocket\" when it emerges from its suspended state. CNN reported Wednesday that aides are preparing plans for the \"big bang\" opening that he wants to see.\nBut it is uncertain whether the President will be able to find medical justification for such a swift restart or even whether he has the power to light things back up -- given that stay-at-home orders and restaurant and shop closures are in the purview of various state governors.\n\"We can say we have to be on that downside of that slope,\" the President said Wednesday, referring to the currently rising incidence of coronavirus infections, which are now approaching half a million.\n\"We can do it in phases, go to some areas where -- you know, some areas are much less affected than others,\" he said. \"But it would be nice to be able to open with a big bang and open up our country, or certainly most of our country.\"\nIs time running short for Fauci and Birx?\nThe President, influenced by dark projections of coronavirus models and the advice of top public health officials Fauci and Birx, is committed to keeping countrywide self-distancing recommendations in place until April 30.\nAfter that, there is going to be enormous pressure on the medical advisers -- presumably from the President -- but also his economic team, to permit a rapid reopening of the economy. Trump has been putting enormous stock in the idea that after two terrible weeks, the worst of the pandemic may have been passed. His reaction could be explosive if he's told he needs to keep the nation shuttered for another month.\nTrump doesn't have time to waste. It may take many months for the economy to regain anything like its normal luster. And political science suggests that voters often solidify their choices for President months before the election, so his fate could begin to be sealed either way fairly soon.\nWeeks more of economic blight could harden Biden's arguments that Trump ignored the coronavirus threat and so made the subsequent economic shutdown longer and deeper than it needed to be.\nAnd it could give fuel to Democratic charges that Trump lacks the leadership skills to get America out of the hole and should hand it over to Biden -- a man who helped author the rebound from the Great Recession by overseeing President Barack Obama's massive economic recovery law.\nA new CNN/SSRS poll published on Wednesday suggests Trump's exposure on the issue. Six-in-10 Americans say the economy is in poor shape -- up 30 points since last month in the steepest worsening of public option on the economy in polling dating back to 1997.\nIn March, 54% said they approved of Trump's handling of the economy. Now that number is 48%. It's the first time that figure has fallen below 50% since September. Still, there is some hope for Trump, given that two-thirds of those asked believe the economy will be in good shape a year from now. The question for the President is whether the bounce-back comes soon enough.\nHow far and how fast?\nThe biggest intangible going forward is the pace of the opening.\nThe US still lacks sufficient testing capabilities to accurately assess how deeply the virus has penetrated outside current hotspots.\nThe experience of other nations also suggests the path back to full economic health could be more of a gentle ascent than the rocket launch Trump needs before November.\nChina -- the origin of the virus -- has started to carefully open its economy. Although manufacturing has been expanding, it is well short of where it was before the crisis. Attempts to open movie theaters in some areas have been reversed.\nSingapore has introduced a new lock down, after its initial victory over the virus was undercut by a second wave of infections. Both the city state and the rising super power have seen new infections by returning travelers, suggesting that it could be months before global air travel -- which greases global commerce -- can resume.\nAnd ultimately, the President's hopes of a roaring economic rebound might rest with the very American people who are being credited with making sacrifices to check the virus' spread.\nWeeks of confinement could unleash an outburst of exuberance once freedom is restored -- that could give the President an October surprise polling bounce.\nBut the experience of South Korea, which did a good job of containing the virus and is starting to open its economy, suggests that people may be initially reticent to cram back into bars, restaurants and public transport. So millions of public service jobs -- not to mention the public confidence that is vital to a sense of national well-being and prosperity -- could be months from returning.\nThis story has been updated to reflect the more recent unemployment claims filings.", "url": "https://www.cnn.com/2020/04/09/politics/donald-trump-economy-joe-biden-coronavirus/index.html"}