{"authors": ["Betsy Klein", "Kaitlan Collins"], "date_download": "2020-05-04 16:23:21", "date_modify": "2020-05-04 16:23:21", "date_publish": "2020-04-06 17:48:48", "description": "This week, Trump campaign supporters can settle in around their computer or phone and choose from a wide-ranging menu of live stream options to stay at home but stay engaged: \"Black Voices for Trump Online!\" or a \"Women for Trump Empower Hour\" or the \"American Heroes Series,\" to name a few.", "filename": "2020_04_06_politics_trump-campaign-coronavirus_index_1588609401.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190930132347-02-trump-0926-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_trump-campaign-coronavirus_index_1588609401.html", "title": "How the Trump campaign is adjusting in the time of coronavirus", "title_page": "How the Trump campaign is adjusting in the time of coronavirus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) This week, Trump campaign supporters can settle in around their computer or phone and choose from a wide-ranging menu of live stream options to stay at home but stay engaged: \"Black Voices for Trump Online!\" or a \"Women for Trump Empower Hour\" or the \"American Heroes Series,\" to name a few.\nThough all in-person campaign events have ground to an abrupt halt, the campaign never really stopped. The coronavirus pandemic has fundamentally reshaped the 2020 election, and campaigns on both sides of the aisle are shifting their messages and means of communication as the nation has shifted its attention.\nBefore the outbreak, President Donald Trump's reelection effort staked much of its messaging on a booming economy and record low unemployment numbers. Regardless of what was happening in Washington, aides felt they could rely on an economic message to see them through until November. Those aides are now dealing with a new reality, one that includes a stock market that has essentially erased its Trump-era gains, a record 6.6 million unemployment claims last week and dire financial conditions that many Americans now found themselves in.\nAmid this unprecedented public health and economic crisis, the campaign can no longer ask voters whether they are better off now than they were four years ago. Instead, it is shifting to pegging the President's success to his handling of the pandemic.\nThe crisis has impacted every facet of the Trump's campaign's strategy as aides and advisers now work to navigate virtual organizing and fundraising -- all while working from home, like many Americans, as its glossy Virginia headquarters and field offices across the country are now shuttered.\nThe outbreak has also played a role in how the campaign operates for the time being. Instead of being focused on growing its ground game in states that will be critical to Trump's election win in November, as officials had planned on doing at this time, they are now mainly focused on the digital effort. The Trump campaign's digital team currently employs over 100 people.\nMessaging\nBehind that strategic shift in messaging is the understanding that Americans are closely following the administration's response and the campaign's key job now is to ensure voters perceive Trump's response is effective.\nFormer New Jersey Gov. Chris Christie claimed the campaign is now fundamentally about how Americans believe Trump handled the crisis.\n\"Whatever their campaign promises were or weren't, when you hit a major crisis -- with me it was Hurricane Sandy, with the President it's this pandemic now -- in my view, politically, nothing else matters,\" Christie, a key Trump ally, said on ABC's \"This Week\" on Sunday. \"And, in fact, I've never seen a time when the opponent is more irrelevant. And that's not an insult to Vice President Biden.\"\n\"But in the end, the American people are going to decide: Has the President of the United States stood up to this crisis and done right by them and protected their lives and their property, or hasn't he?\" Christie said. \"It's almost as if now the selection as his position is going to be a referendum of President Trump rather than a binary choice between the Vice President (Biden) and the President.\"\nAs the administration ramped up Trump's response to the outbreak, so did his campaign with the polling. Polling that showed the country favored keeping stricter social distancing measures in place played a key role in Trump's decision to extend it 30 days this week, three people said.\nTrump saw some of his highest approval numbers in the month since the outbreak spread across the US. Forty-seven percent approve and 48% disapprove rating of his handling of the presidency, according to CNN's Poll of Polls . The Poll of Polls is an average of recent national phone polling conducted among adults or registered voters. Trump's handling of the coronavirus outbreak averages higher approval, standing at 52%, while disapproval stands at 45%.\n\"The campaign remains the same in focus, which is the President is leading on what we're talking about and we're echoing what he talks about -- that's always been the strategy and stance of the campaign. He's leading the country through a national crisis right now,\" Trump campaign spokeswoman Erin Perrine told CNN.\nThe campaign will talk about the work Trump is doing, as well as continue to push back against what it describes as \"false narratives\" from Democratic rivals and the media alike, Perrine said.\nFor now, the campaign has sought to highlight Trump's action through its social media channels. And top surrogates have touted a historic stimulus deal passed by Congress as a sign of Trump's leadership.\nThe campaign has also gone after rivals, including the left-leaning super PAC Priorities USA Action Fund, which is currently airing an attack ad hitting the President's coronavirus response, repeating Trump's own words as the virus progressed alongside the rising cases.\nThe campaign recently sent a cease-and-desist letter to television stations running the ad in key swing states of Florida, Michigan, Wisconsin and Pennsylvania, because it \"contains the false assertion that President Trump called the coronavirus a 'hoax,' when in fact he was referring to Democrat criticisms and politicization of the federal response to the public health crisis.\"\nIn response, Priorities USA continued to air the ad and expanded it to Arizona. It also launched the ad digitally in Spanish.\nThe campaign's rapid response team has also gone after Joe Biden, including last week, accusing the former vice president of using the crisis \"as an opportunity to cram the Green New Deal down Americans' throats,\" per a statement from communications director Tim Murtaugh, after comments Biden made about the next round of stimulus funding. And on Thursday, Murtaugh issued a statement reacting to Biden's statement slamming the administration on record unemployment claims, saying Biden is \"ineffectively sniping from the sidelines.\"\nBriefing is the new rally\nJUST WATCHED Victor Blackwell fact-checks Trump on medical stockpiles Replay More Videos ... MUST WATCH Victor Blackwell fact-checks Trump on medical stockpiles 05:26\nThe most visible change to the campaign's strategy is the indefinite pause on rallies -- a critical tool for capturing voter data -- as the administration encourages social distancing practices.\nLast Thursday marked one month since Trump was in his comfort zone, surrounded by thousands of chanting supporters in the enclave of the Bojangles Coliseum in Charlotte, North Carolina.\nFor now, the campaign will continue to follow White House and US Centers for Disease Control and Prevention guidelines on crowd sizes. The campaign had previously been scheduling rallies to closely mirror and counter-program the Democratic primary: Des Moines the day before the Iowa caucuses, Manchester before the first in the nation New Hampshire primary, Las Vegas, Charleston, and Charlotte before their respective contests.\nIn lieu of rallies, the President has taken his wide-ranging, often lengthy speeches to the briefing room. Since the vice president was tapped to lead the task force February 26, Trump has led 21 press briefings. Much like his \"Keep America Great\" campaign rallies, the average length is 76 minutes, with the longest clocking in at 110 minutes.\nEngagement alternatives\nJUST WATCHED Stelter: Trump is talking more than his experts. That's a problem Replay More Videos ... MUST WATCH Stelter: Trump is talking more than his experts. That's a problem 03:48\nIn the absence of rallies, the campaign is working to engage supporters who may be staying home through digital channels.\nLast week, Lara Trump, national press secretary Kayleigh McEnany and political director Chris Carr held a \"Women for Trump\" livestream across social media platforms.\nThe event reflected some of the challenges experienced by Americans working from home and learning to teleconference. At one point, McEnany's connection went out, a red question mark on the screen where her feed had dropped as Trump and Carr continued to chat. And then, the audio went out for a few minutes, the hosts seemingly unaware of the technical difficulties.\nThe Trump campaign held a \"Women For Trump\" livestream for supporters this evening. Like many Americans adjusting to teleconferences, the audio cut out for a few minutes halfway through and one of the hosts lost her connection pic.twitter.com/Y4Wz3EWY3c — Betsy Klein (@betsy_klein) March 27, 2020\nOn Tuesday evening, the \"Latinos for Trump\" coalition held its own online broadcast. The campaign said in a press release that those broadcasts have now reached over a million viewers across all platforms and there are daily plans for additional live streams this week.\nThe campaign has created a website , \"Army For Trump,\" encouraging supporters to become \"digital activists,\" with step-by-step videos from staffers explaining topics like following Team Trump on Instagram and \"getting started on Facebook.\"\nAn online tool called \"Trump Talk\" lets supporters register for an online training session and make calls to voters from their own homes via computers.\nThe campaign continues to make fundraising appeals via email and text, now touting the need for Trump's leadership \"more than ever\" amid the crisis. It remains unclear how the campaign's fundraising juggernaut will be impacted by a severe economic downturn.", "url": "https://www.cnn.com/2020/04/06/politics/trump-campaign-coronavirus/index.html"}