{"authors": ["Dan Merica", "Kate Sullivan"], "date_download": "2020-05-04 16:18:36", "date_modify": "2020-05-04 16:18:36", "date_publish": "2020-04-02 16:11:47", "description": "The Democratic National Convention has been pushed back to the week of August 17 in the wake of the coronavirus pandemic, the committee tasked with planning the event announced on Thursday.", "filename": "2020_04_02_politics_dnc-postponed-coronavirus_index_1588609116.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402130748-02-dnc-2016-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_dnc-postponed-coronavirus_index_1588609116.html", "title": "Democratic National Convention pushed back to August", "title_page": "Democratic National Convention pushed back to August  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The Democratic National Convention has been pushed back to the week of August 17 in the wake of the coronavirus pandemic, the committee tasked with planning the event announced on Thursday.\nThe change represents a dramatic shift for the party, which has worked for months to host a convention in Milwaukee in mid-July. While officials began planning for contingencies in the face of the spreading coronavirus, many had remained hopeful that the virus would abate and allow Democrats to host the supremely important event.\nRepresentatives for former Vice President Joe Biden and Vermont Sen. Bernie Sanders' campaigns were consulted on the decision to move the Democratic National Convention from July to August, two Democratic officials tell CNN. Biden currently holds a significant lead over Sanders in the nomination fight and is the party's frontrunner.\nDemocrats had initially picked the mid-July date as a way to hold their convention before the 2020 Summer Olympics in Tokyo. But when the Olympics were delayed by a year due to the coronavirus, the three weeks spanning July and August were open for what Democrats hope will be a major media moment.\nPolitics in the United States has been forced to make wholesale changes due to the spread of the coronavirus, including multiple states postponing primaries and a virtual halt of all in-person campaigning.\nThe Democratic convention will now happen the week immediately before the Republican convention in Charlotte.\n\"In our current climate of uncertainty, we believe the smartest approach is to take additional time to monitor how this situation unfolds so we can best position our party for a safe and successful convention,\" Joe Solmonese, CEO of the convention, said Thursday. \"During this critical time, when the scope and scale of the pandemic and its impact remain unknown, we will continue to monitor the situation and follow the advice of health care professionals and emergency responders.\"\nTop Democrats began actively considering a range of contingency plans for the party's convention last month, including changing the date, shortening the in-person portion of the gathering or going entirely digital.\nThose efforts sped up in recent days as former Vice President Joe Biden, who is leading in the delegate count, began to publicly call for changes to the convention planning, including saying on Wednesday that he thinks the convention will \"have to move into August.\"\n\"I doubt whether the Democratic Convention is going to be able to be held in mid-July or early July. I think it's going to have to move into August,\" the former vice president told Jimmy Fallon on \"The Tonight Show\" Wednesday night. \"We just have to be prepared for the alternative and the alternative, we don't know what it's going to be unless we have a better sense of whether this curve is going to move down or up.\"\nThe change does create a series of problems for the planning committee, which has already locked in the convention venue and needed hotels for the influx of visitors.\nConvention planners said on Thursday that the venue, the Fiserv Forum, and hotel accommodations in area are all still available in August.\nPressure was mounting on organizers as similar summer events, like the Olympics, began to be postponed or canceled. There was also an acknowledgment that conventions are not nimble organizations and any significant changes would take at least four weeks for organizers to fully implement.\nThe delay in the convention also puts off any consideration of changing the convention rules to allow delegates to cast their votes remotely. Current convention rules dictate that delegates have to appear in person to nominate a candidate, so a rule change would be needed in order to allow votes to be cast digitally.\nBiden and Sanders' campaigns were notified of the plan to move the convention date on Thursday morning, a Democratic official tells CNN.\n\"The convention team has been contingency planning in light of the developing health crisis for the past couple of weeks. We notified both campaigns this morning of our decision to move,\" the official said.\nThe same official tells CNN that both Biden and Sanders' campaigns supported the decision to move the convention.\n\"They agreed it was the best decision in light of the health crisis facing the country,\" the official said.\nOne key issue in moving the convention was the venue -- the Fiserv Forum, the new home of the NBA's Milwaukee Bucks. Alex Lasry, senior vice president for the Bucks and chair of the Milwaukee's bid for the convention, tells CNN that the arena is available for the week.\n\"This is the right decision for the safety of those involved in the convention and for Milwaukee,\" Lasry said. \"An August convention will provide a much-needed economic boost for Milwaukee and Wisconsin as we come out of this unprecedented time.\"\nMembers of the party's powerful Rules & Bylaws Committee had begun to look at possible contingency plans, but had not actively begun talking about rules changes.\n\"Are we talking about rule changes right now? No, we are not. Will be two months from now? Maybe,\" Maria Cardona, a longtime Democratic operative and member of the committee, told CNN last week. \"Are we looking for possible contingency plans about what something like that will look like? Yes, there are people looking at what that would entail.\"\nRepublicans, too, have been under pressure to consider changes to their convention, but benefited from the fact that they had initially picked late August for their meeting.\n\"The RNC is working closely with state parties, ensuring that they have the resources needed to get their presidential nomination processes done, and offering incredible flexibility in these circumstances,\" Mandi Merritt, a spokeswoman for the Republican National Committee, said on Thursday. \"We are fully committed to holding the Republican convention in Charlotte as planned and re-nominating President Trump.\"\nThis story has been updated with additional information.", "url": "https://www.cnn.com/2020/04/02/politics/dnc-postponed-coronavirus/index.html"}