{"authors": ["On Assignment For Huffpost"], "date_download": "2020-05-04 20:21:16", "date_modify": "2020-05-04 20:21:16", "date_publish": "2020-04-29 16:47:16", "description": "More people have experienced blood clots — which cause swollen toes, strokes and more — as a result of COVID-19.", "filename": "entry_coronavirus-blood-clots-dovid-19-stroke-heart-attack_l_5ea9765ac5b6123a17653c93_1588623676.html", "image_url": "https://img.huffingtonpost.com/asset/5ea997fc220000960c827dd2.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_coronavirus-blood-clots-dovid-19-stroke-heart-attack_l_5ea9765ac5b6123a17653c93_1588623676.html", "title": "Everything You Need To Know About Coronavirus Causing Blood Clots", "title_page": "Everything You Need To Know About Coronavirus Causing Blood Clots | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Doctors around the world are trying to make sense of the wide range of effects that COVID-19 — the disease caused by the novel coronavirus — can have on the body.\nMost people associate the infection with respiratory symptoms — fever, cough, fatigue. But many patients who contract the virus experience neurological symptoms such as headache and dizziness, as well as heart issues, kidney complications and, most recently, blood clotting (also called coagulation).\nThe clots have taken various shapes and forms in different patients. In milder cases, the clots — which appear to be scattered throughout the body — have been linked to rashes or swollen, red toes (recently deemed “COVID toes”). In more severe cases, the clots can block an artery and cause a pulmonary embolism or trigger a heart attack or stroke.\nIt’s unclear why so many patients admitted to the hospital with COVID-19 are developing clots. One study found that nearly a third of COVID-19 patients in intensive care had clotting.\nWe’ve seen clotting with other severe respiratory infections before, so doctors have a few theories as to what’s going on. Here’s what we know about COVID-19 and blood clotting.\nThe Clots Are Often Tiny And Everywhere\nOne of the bizarre findings about the clotting observed in coronavirus patients is how minuscule and widespread the clots are.\nWhen we typically talk about blood clots, we’re looking at one or two major clots that block off blood supply to the brain and heart (and therefore cause a stroke or heart attack). But with COVID-19, rather than one or two big clots, doctors are seeing tons of tiny clots forming all over the place — in the lungs, mostly, but also in the legs, feet and just below the surface of the skin (which may be causing those COVID toes).\n“We’ve seen big clots in legs and big clots in the large vessels of the lungs as well [with COVID-19], but it seems like with COVID-19 patients, you have this additional micro-thrombotic [small clotting] effect going on,” Matthew Heinz, a hospitalist and internist at the Tucson Medical Center, told HuffPost.\nYou may think itty bitty clots would be less harmful. But Heinz said they may actually be an indication that a much more severe illness is brewing. Just because the clots tend to be smaller and evenly distributed doesn’t mean that they can’t be life-threatening.\n“They can indicate that clotting cascade — those clotting derangements — has now begun, and they could start to form everywhere, and you could end up with little clots forming in the coronary arteries — that would give you a heart attack. And in the small arteries of the brain, that could give you focal strokes,” Heinz said.\nThis is probably why we’re seeing coronavirus patients in their 30s and 40s — who don’t have any other risk factors — develop strokes, Heinz added.\nOther Coronaviruses Have Been Linked To Clotting Issues\nHyung Chun, a Yale Medicine cardiologist, said other coronaviruses known to cause severe respiratory disease (such as MERS and SARS) are also associated with blood clots.\nThe SARS coronavirus damages the inner lining of the arteries and veins (known as the vascular endothelium), which prevents blood from reaching the lungs, triggering a pulmonary infarction ― in which lung tissue essentially dies ― in some patients. Another analysis of SARS found that about 49% of patients developed thrombocytosis, a condition that causes blood clots to spontaneously appear.\nWith MERS, it was estimated that about 36% of patients developed a coagulation or blood clot disorder. Additionally, MERS patients who got the sickest often experienced a complication called disseminated intravascular coagulation, in which small blood clots form throughout the bloodstream and block the flow of small blood vessels.\nGiven the similarity between the viruses that cause SARS, MERS and COVID-19, researchers expect to see similar blood clotting complications. (Side note: we also see clotting with severe influenza and viral pneumonias, according to Chun, but that seems to be rarer.)\nScience Photo Library via Getty Images\nThe Clots Could Be Due To Inflammation Or Blood Vessel Injury\nThough data is limited, one prominent theory behind the clots is that they’re triggered by the wave of inflammation COVID-19 triggers.\nYou may have heard about the “cytokine storm” that some people with COVID-19 experience. This occurs when the immune system overreacts, and instead of fighting the virus, cells start to kill themselves.\n“This is a profound, body-wide systemic inflammatory response due to the viral infection,” Heinz said. “In highly infected, inflamed states, you can become hypercoagulable, or more likely to form clots everywhere.”\nAnother possible explanation for the clots is that the coronavirus directly injures the blood vessels. If this is the case, it would mean that the coronavirus is infecting the cells in our blood vessels. The body then views that infection as an injury and causes the blood to clot around it.\nPatients Stuck On Bed Rest Have Risk Factors\nThere’s also the problem with very sick people being on bed rest, which allows blood to pool in the body. Asher Marks, a Yale Medicine pediatric hematologist, said COVID-19 patients in the ICU may experience stasis, or a “lack of flow of blood, often seen when patients are stuck in bed.”\nPlus, most people who get extremely sick from COVID-19 already have risk factors that increase their chances of clotting. Many of these conditions — such as high blood pressure, diabetes and heart disease — already put wear and tear on the blood vessels, and COVID-19 may make things worse.\n“While we don’t know all the details as to who is at greater risk for developing blood clots, we see this most often in those patients who are critically ill due to COVID-19,” Chun said.\nBasically, there’s a whole lot going on in the body — the inflammation, injury of the blood vessels and bed rest — that, together, cause a perfect storm for clots, Heinz said.\nA clearer picture is starting to come together, but researchers agree that they need more data to connect the dots and determine how and why the coronavirus causes major clotting problems.\nUnderstanding what causes the blood clots will likely answer some of the key questions about COVID-19, such as why underlying heart issues are more of a risk factor than lung problems or why so many infected patients seem to improve, then suddenly go into cardiac arrest or organ failure, according to Marks. This will give us the clues we need to better treat the infection and help more people in the ICU recover.\n“It offers a potential new avenue for treatment,” Marks said. “Something that is sorely needed.”\nExperts are still learning about the novel coronavirus. The information in this story is what was known or available as of press time, but it’s possible that guidance around COVID-19 could change as scientists discover more about the virus. Please check the Centers for Disease Control and Prevention for the most updated recommendations.", "url": "https://www.huffpost.com/entry/coronavirus-blood-clots-dovid-19-stroke-heart-attack_l_5ea9765ac5b6123a17653c93"}