{"authors": ["Chris Isidore", "Cnn Business"], "date_download": "2020-05-04 16:52:01", "date_modify": "2020-05-04 16:52:01", "date_publish": "2020-04-08 13:34:44", "description": "This month, fewer cars will be built in the United States than at any time since World War II. Auto production has ground to a near total halt because of the coronavirus outbreak.", "filename": "2020_04_08_business_auto-industry-coronavirus-impact_index_1588611121.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408073656-01-car-dealership-0405-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_business_auto-industry-coronavirus-impact_index_1588611121.html", "title": "GM, Ford and Chrysler are in survival mode", "title_page": "GM, Ford and Chrysler are in survival mode - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) This month, fewer cars will be built in the United States than at any time since World War II. Auto production has ground to a near total halt because of the coronavirus outbreak.\nThat's only half of the auto industry's problem: Customers aren't buying nearly as many new cars , despite attractive offers from automakers, such as interest-free seven-year loans and six months of no payments.\n\"First and foremost, the shelter-in-place orders have created an environment where there are going to be very few sales going on in much of April, and into May,\" said John Murphy, auto analyst at Bank of America-Merrill Lynch. \"Consumer confidence has been so shell shocked, that any discretionary purchases will be delayed.\"\nForecasts of biggest sales drop on record\nGeneral Motors GM A 50% decline in sales would be the biggest drop on record in more than 40 years of auto sales data collection. The current record plunge is the 38% decline in sales in the first quarter of 2009 -- during the depths of the Great Recession, asand Chrysler prepared for bankruptcy and possible closure.\nUS sales have topped 17 million vehicles for the last five years, an unprecedented run of success for the industry, which has produced strong profits. But Murphy's current forecast is for sales to fall to 14.6 million this year. He admits it could be significantly lower than that, depending on the length of the stay-at-home orders.\nThe coronavirus pandemic is proving to be one of the greatest crises in the history of the auto industry.\n\"The automakers said they could break even with US sales as low as 10 million to 12 million. But those estimates depended on continued operations, which they don't have,\" said Kristin Dziczek, vice president of research at the Center for Automotive Research, a Michigan think tank. \"It's the stop and the restart that is going to suck capital. And if we have to do it more than once, that is going to be terrible.\"\nThe problems with restarting auto production\nThe industry will confront three massive challenges in getting things back on track, said Dziczek.\nFirst, automakers will have to ensure their suppliers have been able to weather the shutdowns that started in mid-March and are prepared to restart business and shipping the necessary parts.\n\"Right now they're being paid for work they did 30 to 60 days ago. If we go beyond 60 days those suppliers could be in a real crunch,\" she said.\nAutomakers continued to build cars through other crises, like during strikes and the industry crisis of 2008 and 2009. Although some automakers stopped buying from suppliers then, others were making cars and buying parts, Dziczek said. \"Now no one is.\"\nSecond, manufacturers will have to determine how to get auto assembly plants reopened and operating safely with workers able to stay a safe distance from each other. Most of the hourly workers at closed factories have been furloughed, but those at GM, Ford and Fiat Chrysler's US plants get a supplement from the companies to their state's jobless benefits that provides them with total compensation close to their normal salary.\n\"How do you bring back 1,500 workers per shift to work on assembly lines designed for them to work together when there is no vaccine?\" she said.\n\"There's no question there will have be changes, with the way plants operate, but it'll be risky. You've got a large number of people in one place,\" said Jeff Schuster, president of global vehicle forecasts for auto research firm LMC.\nThe difficulty restarting new car sales\nFinally, automakers will have to figure out how to kickstart consumer demand at a time when millions of Americans will have lost jobs temporarily or permanently.\n\"Even as we crawl out of this, the consumer will stay reasonably conservative in their purchases,\" said Murphy. \"The consumer shock will linger until a few years out.\"\nAs travel plunges, purchases by rental car companies are at a standstill. Those purchases normally account for more than 10% of annual US car sales. If the rental car companies start dumping cars out of their existing fleets into the used car market, as many experts expect them to do, it will be another blow for new car sales.\nThat will offer potential buyers a selection of low-mileage late model used cars as an alternative to a new car purchase. And it will put downward pressure on used car prices, which will reduce the value of trade-ins and make the cost of leasing more expensive, since lease prices are calculated using estimates for used car values.\nThe good news is that the industry is in far better financial shape heading into this crisis than it was heading into the Great Recession. The Big Three US automakers entered into the pandemic with relatively strong balance sheets. Murphy estimates the automakers have five to seven months of cash and borrowing available to them to weather the crisis.\nNeed to invest for long-term hasn't vanished\nBut they also needed those resources to see them through a period of unprecedented change in the industry , a plan to develop, build and sell a new generation of electric and self-driving cars. It's a challenge that will cost billions of dollars and was already prompting mergers and alliances to reshape the industry.\nDropping those plans because of the short-term crisis would be incredibly risky, said Murphy.\n\"The prudent strategy is to invest in your product and future technology, so you'll be competitive three to seven years out,\" he said. \"If you don't you risk your future success. Turning a blind eye to that long-term investment is a recipe for long-term disaster.\"\nBut the competition for cash within each company will be extreme due to the current crisis, said Dziczek and Schuster.\n\"I think in the near term, this is survival mode,\" said Schuster. \"I don't think those investments go along as previously planned.\"", "url": "https://www.cnn.com/2020/04/08/business/auto-industry-coronavirus-impact/index.html"}