{"authors": ["David Eggert"], "date_download": "2020-05-04 20:11:16", "date_modify": "2020-05-04 20:11:16", "date_publish": "2020-04-07 11:52:48", "description": "LANSING, Mich. (AP) — The Republican-led Michigan Legislature on Tuesday lengthened Democratic Gov. Gretchen Whitmer’s coronavirus emergency declaration by 23 days, through April, rather than...", "filename": "_e04061db71694595c1c498ea68a03435_1588623076.html", "image_url": "https://storage.googleapis.com/afs-prod/media/4ce8050c5faa4cfdbd90eed67fe6dd72/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e04061db71694595c1c498ea68a03435_1588623076.html", "title": "Michigan lawmakers extend emergency declaration in pandemic", "title_page": "Michigan lawmakers extend emergency declaration in pandemic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Lt. Gov. Garlin Gilchrist ends the senate session after voting to extend the state of emergency to a 23-day extension at the State Capitol in Lansing, Mich., Tuesday, April 7, 2020. The legislature held a highly unusual session Tuesday to vote whether to extend Gov. Gretchen Whitmer's state of emergency. (Clarence Tabb, Jr./The Detroit News via AP)\nLt. Gov. Garlin Gilchrist ends the senate session after voting to extend the state of emergency to a 23-day extension at the State Capitol in Lansing, Mich., Tuesday, April 7, 2020. The legislature held a highly unusual session Tuesday to vote whether to extend Gov. Gretchen Whitmer's state of emergency. (Clarence Tabb, Jr./The Detroit News via AP)\nLANSING, Mich. (AP) — The Republican-led Michigan Legislature on Tuesday lengthened Democratic Gov. Gretchen Whitmer’s coronavirus emergency declaration by 23 days, through April, rather than adopt the 70-day extension that she had sought.\nAt their first session in three weeks, mask-wearing lawmakers kept distance from each other as they approved the shorter extension by voice vote, after undergoing screening steps to enter the Senate and House chambers. Lt. Gov. Garlin Gilchrist II, who presides over the Senate, wore an “Everybody Vs COVID-19” shirt.\nSenate leaders later announced a bipartisan work group that will recommend to Whitmer how to reopen parts of the economy as long as proper social-distancing procedures are followed. She is expected to extend her stay-at-home order beyond April 13 soon.\nWhitmer’s original emergency declaration is the basis for roughly 30 executive orders, including those closing businesses and prohibiting large gatherings. Michigan had nearly 19,000 confirmed COVID-19 cases as of Tuesday with 845 deaths.\nRepublicans said they had to act Tuesday or else Whitmer’s emergency declaration would expire under the terms of a 1976 law requiring legislative authorization to continue governor-issued emergencies or disasters. Whitmer did not disagree, at least as it relates to ensuring health care workers and first responders are protected from legal liability during the virus outbreak.\nBut she noted that a 1945 law, also cited in her declarations and orders, gives a governor broad emergency powers without any legislative oversight. Democrats, who accused the GOP of “political posturing,” said legislators did not need to vote until April 29 because Whitmer issued a new order last week that also includes a disaster declaration.\nWhitmer said she disagreed with Republicans’ refusal to extend the emergency beyond April but “that’s their decision. They can come back as much as they want to, even though it’s contrary to all of the best practices that our medical professionals and epidemiologists are telling them. I do worry about their safety.”\nTwo lawmakers have tested positive for COVID-19, the disease caused by the virus, while a third has died of suspected COVID-19.\nSenate Majority Leader Mike Shirkey, a Clarklake Republican, said it was unnecessary to extend the emergency by 70 days into June, noting that legislators could later decide to continue it for longer. He also said agreeing to a 70-day extension of the emergency declaration could have inadvertently left the public with the impression that the stay-home order would also last into June.\n“Doing it in a stepped, incremental way makes more sense,” Shirkey said.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, or death.\nBy April 17, senators from both parties will make recommendations to the governor on transitioning people back to work. Republicans told reporters there is evidence that employees can be just as safe on the job as at home, and some businesses — like lawn-service companies — can operate safely with no risk, while other operations, such as a rock concert, must remain a no-no for now.\n“I believe we will identify businesses and commercial activities even as early as next week that with very little change and very little effort, they can be deemed safe and begin to slowly ramp up economic activity in Michigan and do it in a safe way,” Shirkey said.\nAlso Tuesday, House Democratic Leader Christine Greig of Farmington Hills urged GOP leaders to let members meet remotely and electronically for session and committee hearings.\n“This is the time for the Legislature to lead, not shut down because we’re not using the communication tools designed just for this purpose,” she said.\n___\nFollow Eggert on Twitter: https://twitter.com/DavidEggert00", "url": "https://apnews.com/e04061db71694595c1c498ea68a03435"}