{"authors": ["Marcelo De Sousa", "David Biller"], "date_download": "2020-05-04 20:23:36", "date_modify": "2020-05-04 20:23:36", "date_publish": "2020-04-20 15:29:22", "description": "RIO DE JANEIRO (AP) — After more than a week suffering a cough and fever — potential signs of COVID-19 — Maria do Espírito Santo went to a hospital in Manaus, Brazil’s biggest city in the Amazon...", "filename": "_a61651d11c7c3e009a62cea08020b6fd_1588623816.html", "image_url": "https://storage.googleapis.com/afs-prod/media/5b782490397a48749a67cf5cfad5882a/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a61651d11c7c3e009a62cea08020b6fd_1588623816.html", "title": "Virus crisis ravages Brazilian Amazon city's health system", "title_page": "Virus crisis ravages Brazilian Amazon city's health system ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this April 16, 2020 photo, a patient suspected of suffering from COVID-19 disease. leaves the 28 de Agosto hospital after waiting hours for medical attention in Manaus, Amazonas state, Brazil. The man left with the help of his son, after giving up on waiting for medical attention. (AP Photo/Edmar Barros)\nIn this April 16, 2020 photo, a patient suspected of suffering from COVID-19 disease. leaves the 28 de Agosto hospital after waiting hours for medical attention in Manaus, Amazonas state, Brazil. The man left with the help of his son, after giving up on waiting for medical attention. (AP Photo/Edmar Barros)\nRIO DE JANEIRO (AP) — After more than a week suffering a cough and fever — potential signs of COVID-19 — Maria do Espírito Santo went to a hospital in Manaus, Brazil’s biggest city in the Amazon rain forest. There were no beds available, just a plastic chair, so her family took her home.\nThe next day they brought her to an urgent care unit, where she was admitted and put on a gurney, said Isabelle Noronha, a 32-year-old relative, who waited outside for hours along with other patients’ anxious loved ones milling about in the darkness.\nBy then, the 67-year-old woman was in serious condition and waiting for an intensive-care unit bed to free up. After 11 hours, an ambulance transferred her late Friday to a hospital, but she was put in its infirmary rather than its ICU. On Sunday, she remained in serious condition, breathing with the help of oxygen through a tube. She has been tested for COVID-19 and is awaiting the results.\nManaus’ health care system, already strained before the coronavirus crisis, is buckling under the current onslaught of coronavirus patients. Ventilators are in critically short supply, doctors bemoan a lack of protective gear, and gravediggers increasingly have their hands full.\nAmazonas state had more than 2,000 confirmed COVID-19 cases as of Sunday, the vast majority in Manaus — the only city in the state with intensive care units. The city of 2.2 million has one of the highest rates of infection in Brazil, where more than 38,600 cases have been confirmed, though experts say the total greatly under-represents the true number of infections.\nA video shot inside the city’s João Lúcio Hospital and circulated on social media this week showed body bags on gurneys in the hallway as well as on beds alongside patients undergoing treatment. A refrigerated container was installed next to the hospital Friday morning, and workers began loading it with corpses. Amazonas’ health secretariat confirmed 19 coronavirus deaths in the hospital between Wednesday night and Friday.\nThe concern is that Manaus could provide a grim glimpse of what lies ahead for Brazil, particularly as President Jair Bolsonaro flouts health experts’ recommendations for people to stay home to contain the virus’ spread, and instead tells citizens to get back to work. In cities like Manaus that have a dearth of equipment and ICU beds, lack of compliance with measures for social distancing is pushing the health care system to its breaking point.\nBolsonaro has repeatedly referred to COVID-19 as just a “little flu” and called for confining only “high-risk” Brazilians because broader restrictions would cause too much economic damage. On Friday, he replaced his health minister with an oncologist who has made a career on the business side of health care.\nIt’s unclear how Manaus became one of Brazil’s coronavirus hot spots; its first reported case was a 39-year-old woman who returned from London on March 11. But its health care system giving way was a crisis foretold, says Mario Viana, president of the Amazonas Doctors’ Union: Before the crisis, hospitals were already operating near capacity due to lack of investment, and low salaries have long spurred health professionals to leave the city.\n“With the pandemic, all this couldn’t result in anything other than a situation of chaos and collapse,” Viana said.\nA survey by the doctors’ union, which represents some 3,000 physicians, found more than 120 health care professionals have contracted the virus, five of whom have died.\nAn intensive-care doctor in the midst of a 10-day shift earlier this week said he was on his own in the ICU, because three of his colleagues had been infected with the virus.\n“Unfortunately there aren’t people to work,” he said by phone, declining to give his name or that of the hospital for fear of getting fired. “This is a sickness that requires specialized attention. Ventilation is an art in a patient with acute respiratory syndrome.”\nDr. Geraldo Barbosa, a gynecologist who has attended to multiple pregnant women with COVID-19, said the local government hasn’t been able to test him or his wife, also a doctor, to see whether they’ve contracted the illness.\n“All health professionals here are certain we will be contaminated. We just hope not to die,” Barbosa said by phone from the Balbina Mestrinho maternity hospital after removing his mask — one of many he’s purchased with his own money. He also hasn’t been provided with disposable gowns. “A lot of times we doctors are called superheroes, but not even then are we a priority,” he said.\nAmazonas’ health secretariat told The Associated Press in an email that it has instructed “rational use” of protective equipment to avoid blowing through supply.\nDespite efforts to purchase protective gear and other critical supplies, that “can’t be done overnight,” Amazonas Gov. Wilson Miranda Lima told the Globo television station Friday.\nFederal authorities have recognized Manaus’ critical shortages, and have dispatched a few dozen ventilators, as well as 15 doctors and intensive care specialists from other states. They also pledged to add ICU beds— there are only 264 in the entire state — and build a field hospital specifically for treating indigenous people.\n“If we don’t take measures, the number of cases will exceed capacity and people will have neither beds nor ventilators and go unattended,” the health ministry’s executive secretary João Gabbardo told a news conference last weekend.\nAt Manaus’ Parque Tarumã cemetery, one woman broadcast a live feed Thursday of her husband’s burial so family members could see it. He’d been a health professional and died of COVID-19. Gravediggers buried 60 people that day, about triple the pre-virus average, according to a cemetery official.\nAmazonas has closed schools, prohibited gatherings of more than 100 people and ordered the closure of non-essential businesses, but many people still walk Manaus’ streets. Mayor Arthur Virgílio Neto issued a decree recommending face masks, set up a field hospital with 18 ICU beds and is working to open another.\nNoting Bolsonaro’s call to ignore confinement measures, Virgílio Neto said: “It is very hard to row this boat with the president on the other side, saying life should go back to normal.”\nMeanwhile, evidence of the health care crisis can be seen outside the city’s hospitals.\nBeside one facility’s entrance, patients suspected of having coronavirus sat on plastic chairs last week waiting to be admitted. An older man, accompanied by his son, sat for several hours until finally in frustration the son wrapped his father’s arm around his shoulder and the two staggered off, heading home.\n—— Associated Press writer Maricio Savarese contributed from Sao Paulo and AP photographer Edmar Barros contributed from Manaus.\n___\nFollow AP coverage of the pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/a61651d11c7c3e009a62cea08020b6fd"}