{"authors": ["Julia Hollingsworth"], "date_download": "2020-05-04 16:56:14", "date_modify": "2020-05-04 16:56:14", "date_publish": "2020-04-09 08:45:47", "description": "New Zealand has managed to do something that many countries wish they could achieve: for four straight days, it has reported a decline in new coronavirus cases.", "filename": "2020_04_09_asia_new-zealand-lessons-intl-hnk_index_1588611374.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409011202-02-new-zealand-lessons-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_asia_new-zealand-lessons-intl-hnk_index_1588611374.html", "title": "New Zealand has recorded 1 death from coronavirus. Here's how they did it", "title_page": "New Zealand has recorded 1 death from coronavirus. Here's how they did it - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Wellington, New Zealand (CNN) New Zealand has managed to do something that many countries wish they could achieve: for four straight days, it has reported a decline in new coronavirus cases.\nOn Thursday, the country reported 29 new confirmed and probable cases, bringing New Zealand's total to 1,239 -- including only one death. Of those cases, only 14 are in hospital -- and 317 have recovered.\nNew Zealand, a small island country with a population of just under 5 million, is halfway through a month-long lockdown aimed at not only containing the virus, but eliminating it.\nAnd so far, the approach appears to be successful.\n\"We are turning a corner,\" Prime Minister Jacinda Ardern said in a speech Thursday. \"And your commitment means our plan is working.\"\nFor other countries, those positive signs might be a reason to lift restrictions. Denmark, which has at least 5,597 cases and 218 deaths, announced it will begin to lift its lockdown next week if cases remain stable.\nInstead, Ardern said Thursday she was tightening border restrictions, meaning all those who arrive in the country will be required to spend two weeks quarantined in an approved facility, rather than self-isolating at home. The rule only applies to New Zealanders -- foreign nationals have been banned from entering the country since March 20.\n\"At the halfway mark, I have no hesitation in saying that what New Zealanders have done over the last two weeks is huge,\" Ardern said at a press conference Thursday that many Kiwis listened to live. \"You made the decision that together, we could protect one other. And you have. You have saved lives.\"\n\"But as I've said, this is going to be a marathon.\"\nA house fence has been chalked up with messages relating to the Covid-19 lockdown on April 3, 2020 in Auckland, New Zealand.\nNew Zealand's head-start\nIn the fight against coronavirus, New Zealand had two key advantages: geography and time.\nOn February 28, New Zealand confirmed its first case of coronavirus , well over a month after the United States confirmed its first case. And on March 29, the country confirmed its first -- and so far, only -- death.\n\"I think we had a little bit more time to think about it, and we could learn from the experience of China,\" said Professor Michael Baker, from Otago University's Public Health Department, who helped advise the government on its response.\nNew Zealand also had the advantage of being an island far from most other countries, with fewer flights than many other places, said Auckland University microbiologist Siouxsie Wiles.\nThat's something Ardern has pointed out. On Thursday, she noted that being an island was a \"distinct advantage in our ability to eliminate the virus.\"\nA nurse tests a member of the public at a Covid-19 drive through testing centre in Northcross on the North Shore on April 2, 2020 in Auckland, New Zealand.\nBut the real lesson from New Zealand has been the combination of good science and leadership, said Baker. That's meant widespread testing. To date, New Zealand has carried out 51,165 tests . Earlier this week, the United Kingdom -- a country with around 13 times more people than New Zealand -- said it had tested 208,837 people.\nBaker said he had been \"really disappointed\" that countries like the US and the UK which had some of the world's top science resources had not fared better than countries like New Zealand which have comparatively limited resources. \"We have the same access to the same knowledge as you do -- the whole world has seen this coming, it's like a slow-moving tsunami, it hasn't changed its characteristics at all, and the virus is very stable.\"\nWhile UK Prime Minister Boris Johnson warned citizens that they should prepare to lose loved ones before their time, Ardern was clear that she would value people not just the economy, and responded to the threat fast, said Wiles.\nWhen Ardern announced on March 14 that anyone entering the country would need to self isolate for two weeks, it was among the toughest border restrictions in the world. At the time, the country had six cases.\nWhen, on March 19, Ardern banned foreigners from entering the country, there were 28 confirmed cases. And on March 23 , when Ardern announced that the country was going into lockdown, there were 102 confirmed cases -- and no deaths.\n\"Here in New Zealand, we don't have a lot of intensive care beds compared to some other countries. That's why (Ardern) acted really fast,\" Wiles said.\nWhy New Zealand only has one death\nAnother thing New Zealand has that is working to its advantage is the relative youth of those who have been infected with coronavirus.\nPeople aged 20 to 29 make up just under 25% of New Zealand's confirmed and probable cases, while those aged 30 to 39 make up 15%.\nBy comparison, a report issued by the US Centers for Disease Control and Prevention that analyzed the cases of 2,500 patients in the US whose ages were known, found that 29% were aged 20 to 44.\nCountries around the world have consistently seen a much higher Covid-19 mortality rate among elderly patients than younger patients.\nThe reason why young Kiwis may have a higher rate of coronavirus is travel. Just over 40% of New Zealand's cases are still connected with overseas travel. Many young people hurried back to New Zealand after Ardern announced border restrictions.\nBaker said that was the \"healthy traveler effect.\"\n\"People who go traveling are generally in better health than most people. We know that the mortality risk is so much higher in older populations and people with chronic conditions and they tend to travel less,\" he said. \"The very good outcomes so far in New Zealand is because the cases have been in younger age groups and they have been relatively healthy.\"\nCan New Zealand succeed in stamping out the coronavirus?\nThere's certainly reason to be cautiously optimistic that New Zealand's plan is working -- but both Wiles and Baker agree that it is too early to celebrate.\nArdern has said she has no plans to lift the month-long lockdown early, and may need to extend it still.\n\"If we move too early, we will go backwards,\" she said Thursday.\nWhile plan A remains \"stamping\" the coronavirus out, there is a plan B, Baker said. That involves preparing the health system for large numbers of severely ill people, he said.\nAnd even if plan A works, New Zealand will still have to remain an island, so to speak, for some time yet.\n\"We'll be in the same boat as most countries that are doing the suppression approach -- we'll be waiting for good vaccines and good anti-virals,\" said Baker. \"Much of Europe is saying we will be locked down for months, so we're all in the same boat.\"", "url": "https://www.cnn.com/2020/04/09/asia/new-zealand-lessons-intl-hnk/index.html"}