{"authors": ["Matt Egan", "Cnn Business", "Greg Valliere", "Chief Us Policy Strategist At Agf Investments"], "date_download": "2020-05-04 16:15:59", "date_modify": "2020-05-04 16:15:59", "date_publish": "2020-04-03 17:11:18", "description": "President Donald Trump has long cast OPEC as an evil force ripping Americans off by not pumping enough oil. Now he's pleading with Saudi Arabia and Russia to stop pumping so much oil.", "filename": "2020_04_03_business_oil-prices-trump-opec_index_1588608959.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403112357-oil-storage-tank-russia-0322-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_business_oil-prices-trump-opec_index_1588608959.html", "title": "Trump's incredible 180 on OPEC, oil and free markets", "title_page": "Trump's incredible 180 on OPEC, oil and free markets  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) President Donald Trump has long cast OPEC as an evil force ripping Americans off by not pumping enough oil. Now he's pleading with Saudi Arabia and Russia to stop pumping so much oil.\nIn the past, Trump has called OPEC a \"monopoly\" ( it's not ) that must be broken up. \"They are robbing our country blind,\" he tweeted in November 2012.\nSince winning the presidency, Trump has repeatedly hammered OPEC for engineering higher oil prices to hurt American drivers.\nDonald Trump cannot win reelection without Texas. It's as simple as that.\"\n\"OPEC, please relax and take it easy. World cannot take a price hike -- fragile!\" the president tweeted in February 2019.\nFlash forward to 2020: Instead of slamming OPEC for artificially restraining production, Trump is urging the cartel to do just that.\n-- one that threatens to set off a And rather than calling for OPEC to be broken up, Trump is elevating the group's status by encouraging it to stop the oil crashone that threatens to set off a surge of bankruptcies and job losses in Texas and throughout America's oil industry.\nTrump is even attempting to broker an agreement between Saudi Arabia and Russia to end their devastating price war by massively cutting production. The president's tweets on the subject Thursday helped US oil prices to spike 25% -- their biggest one-day gain in history\n\"It's amazing to have Trump get in the middle of this,\" Helima Croft, head of global commodity strategy at RBC Capital Markets, told CNN Business. \"Think about the 180: For years, Trump hated collusion among the producers and wanted to get rid of OPEC.\"\nTexas is a huge prize in 2020\nThat reversal reflects shifting political realities. The coronavirus pandemic is causing millions of job losses ahead of the November presidential election. A prolonged downturn in the US oil industry would only amplify the economic pain, especially in Republican-leaning states.\n\"What has changed is the political equation: Donald Trump cannot win reelection without Texas. It's as simple as that,\" said Greg Valliere, chief US policy strategist at AGF Investments.\nNot only is Texas the second-biggest electoral prize (after California), it's also by far the nation's largest oil producer. In fact, Texas pumps more oil than every OPEC nation not named Saudi Arabia.\nBut Texas is getting crushed by cheap oil. Russia, seeking to blunt the rise of US shale oil producers , refused last month to cut oil production. Saudi Arabia responded by surging output and slashing prices.\nExxonMobil XOM Reflecting the urgency of the moment, Trump is meeting with the CEOs of, Chevron and other leading US oil companies Friday to discuss the crisis facing the industry.\nNavigating this situation is a delicate balance. The White House doesn't want oil bankruptcies and job losses on its hands. But Trump doesn't want to be seen helping oil CEOs and Saudi Arabia at the expense of average Americans who want cheap gas prices.\n'I would always raise hell with OPEC'\nThe president has acknowledged his evolving views.\n\"You always get a little torn,\" Trump said on March 20. \"Until we became the leading producer, I was always for the person driving the car and filling up the tank of gas...If (prices were too high, I would always raise hell with OPEC.\"\nthe oil crash is setting off real turmoil in the energy industry. Whiting Petroleum WLL Nowthe oil crash is setting off real turmoil in the energy industry., a former rising star in the shale industry, this week became the first of what will surely be a wave of US oil companies to file for bankruptcy during this crisis.\nNearly 100 US oil and gas producers could file for Chapter 11 over the next year, Buddy Clark, co-chair of the energy practice at Houston law firm Haynes and Boone, told CNN Business.\nAnd that may be the optimistic view.\nRystad Energy warned this week that 140 US oil producers could file for bankruptcy this year if oil stays at $20 a barrel, followed by another 400 in 2021.\n\"We have a great oil industry, and the oil industry is being ravaged,\" Trump said Wednesday during a press briefing. \"We don't want to lose our great oil companies.\"\nWill Texas cap output?\nhow the United States Now there is a debate playing out over whether and evenhow the United States should intervene in the oil war.\nSome independent oil producers are pushing Texas to -- for the first time in more than 40 years -- limit the state's output.\nRyan Sitton, a commissioner on the Railroad Commission of Texas, the state's energy regulator, even held a call Thursday with Russia's energy minister to discuss options.\n\"While we normally compete,\" Sitton said in a tweet, \"we agreed that #COVID19 requires unprecedented levels of int'l cooperation.\" He added that he will speak to Saudi Arabia's energy minister soon.\nShale pioneer Harold Hamm and others are pushing for Trump, the self-proclaimed \"Tariff Man,\" to sanction OPEC by enacting tariffs that would punish Russia and Saudi Arabia for their ruinous oil war. But the American Petroleum Institute, the nation's largest oil lobby, is urging Trump to avoid intervening in free markets.\nTrump has so far taken modest steps, including instructing the Energy Department to take advantage of cheap prices by filling up the nation's emergency stockpile of crude.\nDebate over free markets\nOPEC has signaled it isn't willing to keep cutting production -- unless other countries join in and do so, too.\nThe cartel will meet via video conference Monday with Russia and other countries outside the alliance, two sources at the OPEC secretariat told CNN Business. Although the final list of invitees has not yet been set, the United States, Canada and Mexico could reportedly be invited.\nBut it's not clear how the United States would enact its own production cuts. US output is controlled by thousands of different companies across the nation who all have their own competing interests.\nThe irony calling on OPEC to come to the rescue is that Trump and others for years have complained that OPEC distorts free markets.\nAnd Now that Saudi Arabia and Russia have stopped artificially restraining their production, they're being urged to step back in to calm markets.\n\"This is the free market. We are living in the world of NOPEC right now,\" RBC's Croft said. \"OPEC's cuts gave US producers a vital lifeline. Now that the lifeline has been withdrawn, you have figures in Washington wanting sanctions against OPEC.\"", "url": "https://www.cnn.com/2020/04/03/business/oil-prices-trump-opec/index.html"}