{"authors": ["Por Adam Geller"], "date_download": "2020-05-04 20:04:59", "date_modify": "2020-05-04 20:04:59", "date_publish": "2020-04-09 14:33:38", "description": "NUEVA YORK (AP) — Brooklyn está a oscuras el lunes, excepto por las luces de la calle, cuando suena el despertador de Carla Brown a las cinco y cuarto de la mañana, más temprano que de costumbre....", "filename": "_3e6c49f6164c4d9888f48eb48f73e9b7_1588622699.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e71e3e1e7ba94cc5aeaf7345d2b70ec6/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3e6c49f6164c4d9888f48eb48f73e9b7_1588622699.html", "title": "24 horas en la vida, y la muerte, de NY, durante pandemia", "title_page": "24 horas en la vida, y la muerte, de NY, durante pandemia", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NUEVA YORK (AP) — Brooklyn está a oscuras el lunes, excepto por las luces de la calle, cuando suena el despertador de Carla Brown a las cinco y cuarto de la mañana, más temprano que de costumbre. Pero con el coronavirus al acecho de Nueva York, no es un día ordinario.\nBrown dirige un programa de entrega de alimentos a los ancianos en medio de una pandemia que se ha ensañado con su atribulada ciudad. Desde hace dos semanas trabaja 14 horas diarias, encargándose de las rutas de choferes enfermos o que no se presentan. Hoy tiene que encontrar la forma de hacer más de 100 entregas.\nSe pone sus jeans, toma su máscara y se encamina a la estación del subway (tren subterráneo) Grand Army Plaza, luciendo una camiseta con el nombre de Muhammad Ali en la parte delantera.\n“Es uno de mis ídolos”, explica. “Y me siento como si estuviese lista para una pelea hoy”.\n¿Tiene otra alternativa?\nAntes de que comenzase la pandemia, la ciudad más grande y bulliciosa de Estados Unidos hacía honor a su fama. El coronavirus la paralizó, causando muertes desde el Bronx hasta la zona del Battery y más allá. Ahora lo único que rompe el silencio, tanto a la medianoche como al mediodía, son las sirenas de las ambulancias. Las calles que se decía estaban cubiertas de oro se ven llenas de guantes desechables.\nEn las 24 horas siguientes, un chofer de taxi recorrerá calles desoladas, en busca de los pocos trabajadores que siguen desempeñando sus tareas. El dueño de una bodega hará una promesa que espera no tener que cumplir. Un médico de una sala de emergencias y un paramédico se esforzarán por reducir la cantidad de muertos.\nPara ellos y otros 8,5 millones de neoyorquinos, este no será un lunes normal. Porque mucho antes de que saliese el sol, el reloj ya estaba contando los minutos de un nuevo round en la batalla por Nueva York.\n___\nA las 03.00 de la mañana, después de 18 horas de trabajo, Jesús Pujols está abrumado por la cantidad de cadáveres.\nDuerme de a ratos al volante de su camioneta entre viajes inacabables para recoger cuerpos en viviendas y morgues de hospitales. “Prácticamente vivimos en nuestras camionetas”, dice Pujols, quien trabaja para varias casas funerarias, la mayoría de ellas en Brooklyn.\nAlrededor de las dos de la mañana --la falta de sueño hace que resulte difícil saber en qué hora vive-- Pujols entabla una discusión con un individuo que detuvo su auto en medio de la calle para observarlo mientras sacaba un cadáver de una casa. A Pujols, de 23 años, le pareció una enorme falta de respeto hacia el difunto y su familia.\n“Hoy por hoy, el dinero no vale nada. Dejaría mi trabajo si consiguiese uno normal. Preferiría estar en cuarentena en estos momentos”, expresó.\nPujols se acuesta finalmente a las 04.30. Se despertará en unas pocas horas para cumplir una promesa: Debe recoger el cadáver de un pariente de un amigo.\nLa ciudad, mientras tanto, empieza a agitarse.\nCuando el doctor Joseph Habboushe se despierta en su departamento del Greenwich Village a las 06.15, se da cuenta de que la adrenalina que ha sentido todas las mañanas desde hace un mes empieza a diluirse. Hasta ahora sentía que todo lo que estaba viviendo parecía una pesadilla. Ahora se da cuenta de que es real.\nMientras se afeita bien al ras para asegurarse de que su máscara encaja bien, este médico de una sala de emergencia piensa que el brote parece una guerra y que los trabajadores del campo de la salud están en la primera línea de batalla.\n“Asusta pensar que uno va a trabajar y es posible que se contagie. Nadie sabe qué pasa, no conocemos a nuestro enemigo”, manifestó.\nLa batalla se libra en varios frentes. En el Van Cortland Park del Bronx, un equipo del Cuerpo de Ingenieros del Ejército erige un hospital temporal de 200 camas en una cancha de fútbol. Enfermeras protestan frente al Harlem Hospital, criticando el racionamiento de respiradores.\nY Carla Brown, la guerrera de los neoyorquinos de cabello gris, se sube al tren número 4.\nCuando el subway llega a Wall Street, en Manhattan, decenas de personas se suben. La Autoridad Metropolitana de Transporte le dice a la gente que permanezca en sus casas. Pero en una ciudad que se considera esencial, estos son los pocos que son catalogados como realmente indispensables, que deben seguir trabajando.\nEl servicio de trenes se ha reducido y la gente debe amontonarse. Imposible el distanciamiento social.\n“Fue una locura”, dijo Brown. “Nos mirábamos los unos a los otros, como diciendo esto es absurdo”.\n___\nPoco antes de las 07.00, Alex Batista abre Deli-licious, la bodega que él y su hermano Eudis tienen en Glendale, barrio de clase media de Queens.\nNormalmente a esta hora hay mucho movimiento de gente que va a lavar la ropa en el local de al lado, a la gasolinera del frente o a trabajar, que para en su negocio para comprar un café, leche y sándwiches para el desayuno.\n“Hoy es una ciudad fantasma”, dijo Batista. Los clientes más habituales hoy son los empleados de una casa funeraria.\nBatista dice que en la primera semana de encierro, la actividad mermó un 60% en su negocio. Ahora se recuperó un poco con entregas a domicilio. Pero si hay otros tres o cuatro meses como el último, probablemente se vean obligados a cerrar, para pesar de un cliente de 85 años que dice que es el único sitio abierto donde puede comprar comida.\n“¿Sabes algo?”, le dice Eudis Batista al hombre. “Incluso si cerramos, voy a mi casa y cocino para ti. No hay problema”.\nNueva York ha pasado duras pruebas, incluidos los ataques terroristas del 11 de septiembre del 2011 y las inundaciones y los apagones ocasionados por la tormenta Sandy. Pero nunca vivió nada como esto.\nSharon Kleinbaum recuerda la crisis del SIDA de 1992, cuando fue la primera rabina de Beit Simchat Torah, la sinagoga para gays y lesbianas más grande del país. Pero ni esa experiencia la preparó para su misión de hoy: llevar consuelo a la gente a la distancia.\nEn el pasado, recuerda, al menos pudo tomarles la mano a las personas agonizantes, acompañar a sus seres queridos.\n“No poder hacerlo ahora es muy duro. No puedo describir lo duro que es”, expresó.\nKleinbaum llama a una congregante que se dirige al funeral de su madre.\n“Le digo que no está sola”, comentó. “Tenemos que hacernos presentes como podamos y estar en los sitios donde hay gente que sufre”.\nConectada por la internet con congregantes desde su departamento del Alto Manhattan, esperando que comience una clase sobre los salmos, la gente se pone a hablar de cortes de pelo, ahora que las peluquerías cerraron. Kleinbaum recuerda que durante la Pascua Judía, según la tradición, la gente no se puede cortar el cabello por 33 días.\n“No se preocupen por sus cabellos”, bromea. “Es un buen momento para no cortárselo”.\n___\nA las 07.45, Habboushe llega a la sala de emergencia de Manhattan donde trabaja, llevando consigo un nuevo protector para la cara. Antes usaba protectores ocasionalmente, ahora todo el tiempo. Y se cambia de guantes después de ver a un paciente.\n“Hay que hacerlo. Da miedo entrar a la sala de emergencias sabiendo que puedes contagiarte el COVID, y con toda la locura del personal que se te acerca usando máscaras, delantales y protectores”.\nEsta mañana verán entre 10 y 15 pacientes, menos que de costumbre. Pero algunos están muy enfermos. Una mujer ya está usando un respirador. Hay que estabilizarlos a todos hasta que los lleven a una habitación. Y hay más pacientes en camino.\nEn el South Bronx, Travis Kessel inicia su turno de 12 horas en la Emergency Medical Station 18. Luego de una charla en la que los jefes les dicen a los empelados lo mucho que aprecian el trabajo que hacen bajo tanto estrés, el paramédico de 28 años se monta en su ambulancia y se conecta al sistema de emergencias.\nQuince segundos después recibe la primera llamada.\nNadie responde en la dirección a la que fue enviado. “Pensé que nuestro primer caso era un paro cardíaco”, comenta. Resultó que la mujer de la casa estaba bien, solo que no tenía a mano su aparato auditivo. Un raro momento liviano.\nQue no dura mucho. La siguiente llamada --y la siguiente, y la siguiente-- terminan con un paciente que fallece en su casa o al llegar al hospital.\nKessel trabaja en esto desde que tenía 16 años, pero nunca vivió algo como lo que está viviendo ahora. Normalmente recibía cinco o seis llamadas por turno. Ahora el doble, si no el triple.\n“No tienes respiro”, afirma. “No puedes descansar un momento”.\n____\nA esta altura del día, Sara Haines ya habría salido de su departamento en el barrio de Williamsburg, en Brooklyn, y se estaría encaminando a su trabajo como conductora de un programa televisivo matutino. Su esposo, el abogado Max Shifrin, generalmente se ocupa de las tareas de la casa a esta hora. Pero el programa fue interrumpido para informar acerca de la pandemia y ella ya no sale de la casa.\nEsta mañana Haines es despertada por su hija a las 04.30. Les da de comer a sus tres hijos antes de prepararse para salir en vivo desde su casa en reemplazo de una conductora de “The View”.\nYa trató de instalar un estudio cerca de la habitación de su bebé, pero la pared negra detrás suyo no se ve bien en las cámaras. Hoy se instala en la sala de estar para su presentación de las 11.00, mientras sus hijos juegan fuera de las cámaras.\n“Hay gente muy asustada que nos mira desde sus casas. La gente se está muriendo”, dice Haines. Cuando sales en cámara desde tu sofá, “no quieres ser interrumpida por un niñito”.\n___\nEl legendario tráfico de la ciudad es un recuerdo lejano.\nNicolae Hent conduce su taxi por el puente de la calle 59 desde Queens. Pasa una hora antes de conseguir su primer cliente. Pero sabe dónde buscarlos: en el Mount Sinai Hospital.\n“Allí están los clientes hoy por hoy”, dice Hent, de 63 años y quien maneja taxis desde 1988. Ya antes de la pandemia la actividad había mermado por la competencia de servicios como el de Uber. Pero de todos modos podía sacar 300 dólares en un día. Ahora que no hay gente en las oficinas ni multitudes que regresan a casa después de ver un partido de béisbol, con suerte saca 100 dólares, generalmente de médicos y enfermeras.\n“Siento que tengo una obligación de transportar a los trabajadores de los hospitales”, dice Hent.\nCarla Brown y su personal de entrega de comidas, mientras tanto, tienen mucho trabajo. Hasta hace unas semanas, la Charles A. Walburg Multiservice Organization con la que trabaja hacía unas 700 entregas de comida a ancianos del Harlem y de Washington Heights. Hoy tienen 912 pedidos.\nLlueven las llamadas de personas mayores, que corren más riesgos de contraer el virus y están encerradas en sus casas. A algunos de ellos normalmente los asisten sus hijos adultos, pero ahora deben guardar distancia. Brown los entiende. Cuando ella visita a sus padres, ambos de 77 años, no pasa de la puerta.\nBrown cuenta que reanudó sus entregas dos días después del ataque del 11 de septiembre. Y que tuvo que hacer largas colas para cargar gasolina luego de Sandy. Pero esto es distinto.\n“Se sabía que eso iba a pasar. Era cuestión de esperar un poco”, expresa. “Esto de ahora se pone más extraño con cada día que pasa. No sabes cuándo terminará. Y no puedes planificar nada”.\n___\nVarado en su departamento del Bronx, el actor de Broadway E. Clayton Cornelious piensa lo mismo.\nCuando la pandemia obligó a suspender el musical de Broadway “Ain’t Too Proud -- The Life and Times of the Temptations” en el que trabajaba, lo vivió como una vacación en su casa. Pero ahora se preocupa por su familia, sus actores amigos y la audiencia que asiste a los teatros.\n“¿Cuándo volverán a las salas”, se pregunta. “¿Cuándo querrán sentarse nuevamente uno al lado del otro en una sala pequeña como la nuestra?”.\nTrata de mantenerse ocupado, publica cosas en sus cuentas de las redes sociales y se manda mensajes con su familia. Desde su balcón disfruta de las vistas del río Hudson. Eso lo calma y le permite pensar en el fututo.\n“Será algo muy especial cuando podamos volver a reunirnos”, dice Cornelious. “Creo que todos seremos mucho más agradecidos”.\n___\nEn el hospital, los altoparlantes anuncian que se necesita todo el personal disponible. Habboushe corre hacia una camilla donde un hombre tiene problemas para respirar.\nSu nivel de oxígeno es del 50%, lo que pone en peligro su vida. Hay un respirador disponible. Pero algunos médicos dicen que hay pacientes que responden mejor con oxígeno, sin ser sedados ni entubados. Cuando eso no funciona, dan vuelta al paciente y lo posan boca abajo, otra estrategia que ayuda a respirar.\nMinutos después, el nivel de oxígeno de la sangre es del 95%. Un momento alentador.\nHabboushe lo disfruta al máximo. Al terminar su jornada habrá visto unos 25 pacientes. Y cuando se va, todos estaban vivos.\n___\nDespués de tres semanas de batallar contra el virus, Nueva York empieza a conocer a su enemigo. Habboushe siente que las estrategias de batalla están funcionando. Pero todavía hay muchas cosas que los médicos no saben.\n“A veces querría escapar y poder sentirme totalmente abrumado por las muertes y las cosas terribles que todavía nos esperan”, dice el médico.\nAl finalizar la jornada, los paramédicos de Nueva York respondieron a 5.639 llamadas pidiendo asistencia médica de emergencia. A título de comparación, el 11 de septiembre hubo 3.500.\nEn las 24 horas que terminaron a las 17.00 (5 pm), la ciudad habrá registrado otras 266 muertes, elevando el total a más de 2.700. Horas después, se supera la cantidad de muertos en los ataques a las Torres Gemelas. Pero es posible que las cifras reales sean más altas, según admiten las autoridades.\nNueva York le hace frente a la calamidad de la única forma que sabe hacerlo: No en una oficina, con hojas de cálculo, sino en la calle.\nAntes de la pandemia, el paramédico Kessel y su esposa, una enfermera de una sala de emergencia, disfrutaban hablando de los pacientes que habían ayudado. Veían un partido de béisbol o compraban algo para comer en alguno de los 27.000 restaurantes de la ciudad.\nAhora Nueva York es una sombra de sí misma.\n“Pasé momentos malos. No cuando atendía a alguien, sino entre llamadas. Cuando vuelvo a casa. O escucho un tema en la radio”, cuenta Kessel. Mientras habla, se escucha el sonido de sirenas y derrama una lágrima.\n“No se ve el final de esto, no hay alivio a la vista”, se lamenta. “Lo único que hacemos hoy es preguntarnos qué tanto peor se pondrán las cosas mañana”.\n___\nLa mayoría de los asientos están desocupados en el autobús que va de Staten Island a Manhattan. Pero Joe DeLuca, listo para cubrir su turno vespertino como conserje del CitySpire, un edificio en torre de 72 pisos, se cuida mucho.\n“Llevo la máscara. Mi desinfectante de manos. Mis guantes. No toco nada. Me distraigo con el teléfono y llevo la cabeza baja”, dijo DeLuca.\nCuando llega al edificio, una prestigiosa dirección detrás del Carnegie Hall, una acera habitualmente muy transitada está desierta. Lo que sí hay es muchos paquetes. Los residentes hacen pedidos por la internet ahora que los negocios están cerrados y casi nadie se atreve a salir. DeLuca y sus compañeros entran las cajas y las rocían con desinfectante. Cuando se secan, las hacen llegar a los destinatarios.\n“Tengo una familia en casa y esta es mi segunda familia”, dice el conserje. “Así son las cosas. En algún momento todo mejorará”.\nA media hora del ocaso, comienza un nuevo ritual de la ciudad. El ruido es tenue en esta zona de oficinas, negocios y teatros inactivos. Pero a pocos minutos hay un gran barullo: Son los gritos de aliento y los cacerolazos con los que los neoyorquinos rinden homenaje a médicos, enfermeras y demás personas que arriesgan sus vidas durante la pandemia.\nEl aliento de la gente alegra a Habboushe, el médico del servicio de emergencia, que camina por la calle 10 con su novia. Su rostro denota el cansancio y tiene las marcas de la máscara que usó todo el día.\nLas expresiones de apoyo se extienden por el Bronx, Queens, Staten Island y Brooklyn, donde Sara Heines y sus hijos salen al balcón. Dónde están los médicos, preguntan los pequeños.\n“No, no los pueden ver. Pero aplaudan”, les dice la madre. “Hay tanto ruido que parece el 4 de Julio”, el día de la independencia.\n___\nEste despacho fue preparado por periodistas de la Associated Press que trabajaron de medianoche a medianoche el lunes 6 de abril. Colaboraron David Crary, Adam Geller, Deepti Hajela, Brian Mahoney, Jennifer Peltz, David Porter, Jake Seiner y Michael Sisak, así como los videoperiodistas Robert Bumsted, David Martin, Marshall Ritzel y Ted Shaffrey.", "url": "https://apnews.com/3e6c49f6164c4d9888f48eb48f73e9b7"}