{"authors": ["Kristen Rogers"], "date_download": "2020-05-04 16:58:34", "date_modify": "2020-05-04 16:58:34", "date_publish": "2020-04-06 16:22:22", "description": "If there's anything families around the world are demonstrating as we approach spring holidays, it's the English proverb, \"Necessity is the mother of invention.\" Here are several ways your family can celebrate Easter and Passover together but apart.", "filename": "2020_04_06_health_how-to-ce_0e32ba6a581f7a331987aa008de1523d_index_1588611514.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403105414-passover-seder-2019-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_health_how-to-ce_0e32ba6a581f7a331987aa008de1523d_index_1588611514.html", "title": "How to celebrate Easter and Passover during a pandemic", "title_page": "How to celebrate Easter and Passover during a pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) If there's anything families around the world are demonstrating as we approach Passover and Easter, it's the English proverb, \"Necessity is the mother of invention.\"\nWith people under various restrictions on movement , including stay-at-home orders and self-isolation, families are devising alternative ways to observe the spring holidays. They include streaming online Easter church services, hosting virtual Passover Seder dinners, holding family-only egg hunts in the backyard and more.\nThe goal is to comply with social distancing guidelines by celebrating together -- but apart -- to prevent further spread of the coronavirus . However, some families may still be planning to celebrate the holidays with extended family as they usually would -- something experts say should not happen.\n\"Many people have a powerful need and desire to be with family during the holidays. This is both for the companionship and to provide support,\" said Joshua Coleman, a psychologist in private practice in Oakland, California and senior fellow with the Council on Contemporary Families.\n\"That reality may short out their capacity to appropriately weigh that desire against the risk of contagion. In addition, we're used to associating contagious diseases with the demonstration of obvious symptoms or distress. So the absence of those may also cause people to ignore the very real dangers of potential infection,\" he said.\nThe virus can be transmitted by people who aren't yet showing symptoms, according to the US Centers for Disease Control and Prevention\n\"We're all better off staying at home and we're helping each other more by just embracing the technology,\" said Melissa Sorrentino of Lynnfield, Massachusetts. She's hosting a virtual Easter celebration this year.\nHere are some ways you can celebrate Easter or Passover this year and create fond memories in the middle of all the chaos.\nHow to celebrate Easter\nA central theme across planning for religious holidays this year is to do it virtually.\n\"We are speaking of downloading a multi-video chat app for Easter,\" said Steven McCoy, a journalist and founder of Spoken Entertainment from Newark, New Jersey. \"Easter has always been big in our family so we wanted to ensure we still celebrate it.\"\nThe McCoy family's plan is to get together with extended family via video chat all day, and paint Easter eggs over a web cam. They'll do what McCoy called an \"Easter Quarantine Egg Hunt\" by hiding the eggs within their camera-framed space and giving each player three chances to guess where the egg might be.\n\"I find that it is imperative to always have alternative ideas. I look at it as a first aid kit celebration,\" McCoy said. \"Finding a way to celebrate the holidays with your family is so important. [I'm] so grateful for technology!\"\nwill set up a tripod so they can still take a family Easter photo even without a photographer. Families don't have to hold back on dressing up this year. Sorrentino and her family plan to mimic the Front Steps Project , where photographers (from a distance) take portraits of families posed near their front steps. Her daughterswill set up a tripod so they can still take a family Easter photo even without a photographer.\n\"It is a way to get dressed instead of staying in your pajamas all day and being depressed that you're not seeing family,\" Sorrentino said.\nHer family's evening activities are made possible by Zoom. This way, the extended families can still have dinner, coffee and dessert together; play charades and other games; and allow the kids to see their cousins.\n\"Even though we can't physically be next to each other, we still can be with each other. We can still have all the same conversations and enjoy each other's company,\" Sorrentino said.\nIf you're concerned about missing church on Easter Sunday, you can attend an online service or search for a drive-in service in your area. Maybe participate in a virtual egg decorating contest\nSome people are organizing Easter egg hunts in their neighborhoods . It sounds counterintuitive to social distancing guidelines, but it works by families hanging pictures of Easter eggs on their front door or windows.\nParents can then take turns walking their kids around the block to find which homes have eggs. The eggs will have a number next to them so children can keep track of how many they find without picking them up.\nAn adult in the neighborhood can also organize a social distancing visit from the Easter Bunny by donning a costume and waving to little ones from afar.\n\"Both of these activities sound reasonable and pose no risk so long as people maintain appropriate distancing, and the kids don't pick up the eggs,\" said Dr. Daniel Kuritzkes, chief of the Division of Infectious Diseases at Brigham and Women's Hospital in Boston.\n\"People who have been diagnosed with Covid-19 should not participate (stay inside!), nor should they be preparing eggs to hide on their lawns or porches, in case young children impulsively rush to pick them up.\"\nEaster means a lot to the McCoy family.\n\"My family and I are disappointed that we can't be together on Easter this year, especially after so many absences throughout the year due to everyone's work schedules. Easter means a lot to us as it is the celebration of the resurrection of Jesus Christ,\" McCoy said.\n\"However, we are so grateful that everyone is alive and well as we plan to get through this pandemic together -- even if it means we have to be creative during our time separated.\"\nHonoring the Passover Seder\nA virtual Passover Seder is the way to go this year, but it can be complicated because it's more than \"just the communal family dinner,\" said Rachelle Feldman of Princeton, New Jersey.\n\"It is taking part from beginning to end in the actual service, the Seder of how we remember each step, and how we left Egypt, and how we were led to Israel and everything in the middle of that journey,\" she said.\nTypically, extended families and guests come together for the Seder. This year, Feldman will celebrate the Seder via Zoom with her immediate family members who are all in different states: her husband is in Florida, while her daughter is in New York and her son is in Pennsylvania.\nFeldman has already ordered the symbolic foods that are must-haves on the Seder plate: maror (bitter herbs) and chazeret (horseradish and onions); charoset; matzoh; and more.\nIf you're having trouble locating Seder plate ingredients, there are lists of acceptable substitutions\nFamilies hosting virtual Seders can still organize who will take on which roles, including the readers of the Haggadah and which children or young adults will read the four questions.\nWhen the time comes for a piece of matzoh to be hidden and then found after the meal, each family can do so in their individual home, said Katie Bieber Ogg of Brooklyn, New York. Ogg will participate in a virtual Seder.\nFamilies can still tell stories together, say blessings and sing songs of praise during the dinner.\nCentral to the Seder is inviting guests who are less fortunate or without family. Some people are dropping off Seder boxes at others' doors, so they're not left behind.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nHaving a virtual Seder is about more than continuing a tradition, Feldman said.\n\"It's not just maintaining normalcy in a time where people don't have any,\" Feldman said.\n\"It's sustaining who we are as a people, and this is so important to us, that we recognize the significance of this particular holiday, that we have a stronger obligation to keep it, maintain it, to share it and not forget.\"", "url": "https://www.cnn.com/2020/04/06/health/how-to-celebrate-easter-passover-ideas-coronavirus-wellness/index.html"}