{"authors": [], "date_download": "2020-05-04 20:11:45", "date_modify": "2020-05-04 20:11:45", "date_publish": "2020-04-07 13:51:33", "description": "ANCHORAGE, Alaska (AP) — An Alaska official trying to promote participation in the national census has urged residents to file their forms online and by phone as the state falls behind the...", "filename": "_308ed11ab6da8b9b0036fc7440ba76a1_1588623105.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_308ed11ab6da8b9b0036fc7440ba76a1_1588623105.html", "title": "Alaska residents urged to complete census online, by phone", "title_page": "Alaska residents urged to complete census online, by phone", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ANCHORAGE, Alaska (AP) — An Alaska official trying to promote participation in the national census has urged residents to file their forms online and by phone as the state falls behind the national response average.\nThe push for remote filing comes as efforts by the U.S. Census Bureau to collect residency data have been been hampered by the cornoavirus pandemic, Alaska Public Media reported Monday.\nThe outbreak prompted the agency to close field offices and delay door-to-door interviews.\nThe national response rate stands at nearly 43%, but less than 27% of Alaska households have completed the form.\nMany Alaska residents who have been waiting for visits from census takers are unaware they can file without the visits, Cook Inlet Housing Authority Chief Operating Officer Gabe Layman said.\n“People in remote Alaska were not notified that they could respond online, because it was anticipated that a census-taker would be going to every single household,” said Layman, who is part of the nonprofit census education campaign Alaska Counts.\nCensus packets mailed to homes include personal codes for the online forms, but the codes are not necessary for filing, Layman said.\n“You can simply go to the site, indicate that you want to fill out your census form online, and there’s a little prompt to enter the code,” he said. “But there is a box that you can check that just says ‘I don’t have my code’ and it’s not a problem.”\nPhone calls to report census data takes minutes and there are no penalties for households that accidentally report more than once, Layman said.\n“There are a lot of folks on the front lines helping battle the spread of COVID-19. One thing that we can all do from the comfort of our homes is to hop online or to pick up a phone and complete our census,” Layman said.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.", "url": "https://apnews.com/308ed11ab6da8b9b0036fc7440ba76a1"}