{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:22:47", "date_modify": "2020-05-04 16:22:47", "date_publish": "2020-04-05 22:01:50", "description": "With just 212 days until the November election, 2020 is in full swing -- even in the midst of the coronavirus crisis. Every Sunday, I outline the top storylines you need to know to understand the upcoming week on the campaign trail. And they're ranked, so the No. 1 story is the most important of the coming week.", "filename": "2020_04_05_politics_us-election-2020-week-ahead_index_1588609367.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404162559-01-coronavirus-briefing-0404-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_us-election-2020-week-ahead_index_1588609367.html", "title": "Can Donald Trump wait out the coronavirus?", "title_page": "US election 2020: Can Donald Trump wait out the coronavirus? - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) With just 212 days until the November election, 2020 is in full swing -- even in the midst of the coronavirus crisis . Every Sunday, I outline the top storylines you need to know to understand the upcoming week on the campaign trail. And they're ranked, so the No. 1 story is the most important of the coming week.\nVirtually any attempt to get President Donald Trump to the 270 electoral votes he needs to win a second term this fall requires that he win Florida and its 29 electoral votes\nWhich is what makes the current situation in Florida in regard to the state's response to the coronavirus very, very important.\nFlorida Republican Gov. Ron DeSantis has come under heavy criticism for his unwillingness to issue a stay-at-home order earlier -- spring breakers packed the Florida beaches last month -- and for delegating decisions about public safety to local officials rather than issuing more robust statewide directives. (DeSantis finally issued a stay-at-home order on April 1.)\nAnd the state is seen as a potential hotbed for the virus due to its elderly population, according to an analysis done by the Kaiser Family Foundation.\nWhich brings us back to DeSantis -- and Trump. The President endorsed the then-House member in a contested GOP primary for governor in 2018 and campaigned for him vigorously in the general election. DeSantis ran ads painting himself as a mini-Trump . The connection between the two men -- in most voters' minds -- is very, very close.\nKeep watch on the situation in Florida. If it worsens significantly, the blame will likely fall on DeSantis. And that could spell trouble in the state this fall for Trump too.\nThat won't stop the question from being asked -- especially once the pandemic lessens in both New York state and nationally.\nCuomo, at 62, would be far younger than Vermont Sen. Bernie Sanders, former Vice President Joe Biden and Massachusetts Sen. Elizabeth Warren are right now if he ran in 2024. And he'd be only 70 -- almost a decade younger than Biden and Sanders! -- if he ran for president in 2028.\n(Sidebar: For people suggesting Cuomo could be the nominee in 2020, that's not going to happen.)\nCuomo is able to put off any questions about his political future -- which almost certainly includes a run for a fourth term in 2022 -- at the moment due to the fact that he is dealing with a massive crisis with an uncertain end date.\nBut he and his political team will, at some point in the future, figure out whether his answer will (or should) change on whether he ever wants to run for president.\nEpisodes like this -- a battle against a global pandemic -- have ways of changing long-held views and re-orienting life goals. For all of us, and for politicians, too.\n3. Wither conventions?: In the space of the last week, In the space of the last week, Democrats have delayed their national convention to August and then watched as their near-certain presidential nominee has suggested an in-person convention might not happen at all.\n\"We may have to do a virtual convention,\" Biden said Sunday morning on ABC's \"This Week.\" \"I think we should be thinking about that right now. The idea of holding the convention is going to be necessary. We may not be able to put 10, 20, 30,000 people in one place.\"\nHe's right. Even if the spread of the coronavirus is largely limited by mid-summer, does anyone think it's a good idea to gather tens of thousands of people in close quarters anytime soon?\nIt's hard to imagine the Democratic National Committee will have much choice in the matter if the de facto nominee is on the record suggesting that an in-person convention is problematic.\nOf course, Trump continues to insist that the Republican National Convention -- set to begin August 24 in Charlotte, North Carolina -- is full speed ahead.\n\"We have no contingency plan,\" Trump said on Saturday. \"We're having the convention at the end of August, and we think by the end of August, we'll be in good shape. We have no contingen- -- you know, it's going to be in North Carolina, as you know, in Charlotte. And I think we're going to have a great convention.\"\nRiiiiight.\nKeep an eye on both parties as they try to navigate the balance between holding a massive, quadrennial party and lingering public health concerns.\n2. The Biden VP search: Biden's presidential campaign has been effectively ground to a halt by the coronavirus as the former vice president has been forced to stay home and do virtual fundraisers and rallies.\nBut there's one key element of the coming general election campaign that coronavirus doesn't have much impact on: The search for a vice presidential nominee.\n\"I am in the process and I've actually had this discussion with Bernie because he's a friend -- we're competitors, he's a friend,\" Biden told participants in a virtual fundraiser on Friday of the VP vetting process , adding: \"You have to start now deciding who you're going to have background checks done on as vice presidential candidates and it takes time.\"\nBiden said he plans to form a formal VP search committee sometime in the next month and has talked with former President Barack Obama about the best way to go about it. (Biden surely likes Obama's process since it would up picking him as the nominee.)\nWhile the VP selection is always a critical choice -- less in terms of its impact on the Electoral College than what it says about how a potential president sees his strengths and weaknesses -- that's especially true in the case of Biden's pick due to the fact that he is 77 years old. (Biden would be the oldest person ever elected to a first term as president if he wins this fall; he turns 78 on November 20.)\n\"[O]ne of the ways to deal with age is to build a bench -- to build a bench of younger, really qualified people who haven't had the exposure that others have had but are fully capable of being the leaders of the next four, eight, 12, 16 years to run the country,\" Biden said Friday\nBiden has already narrowed the field of potential picks by pledging -- in a debate last month -- to pick a female VP, which was, politically speaking a very smart thing to do.\nI've gone through the 10 women most likely to be Biden's nominee -- SPOILER ALERT: Kamala Harris is currently No. 1 -- and will be out with a new Top 10 later this week. Stay tuned!\n1. The impatience of Trump: The President is not a patient man. Like many Americans, he wants what he wants when he wants it. Which is, almost always, right now.\nEnter coronavirus -- and the recommendations from virtually every medical expert that the only way to stop its deadly spread is to stay at home -- a move that effectively grinds the economy to a halt.\nTrump has bristled at that order before, spending the days leading up to his announcement of a 30-day stay-at-home order for April insisting the cure can't be worse than the disease itself.\nWell, he's doing it again. Here's Trump in the daily coronavirus briefing on Saturday:\n\"We have to open our country. You know, I had an expression, 'The cure can't be worse than the problem itself,' right? I started by saying that, and I continue to say it. The cure cannot be worse than the problem itself. We got to get our country open.\"\nThere's a reason for Trump's impatience. Jobless claims reached almost 10 million nationwide in the first two weeks of the stay-at-home orders. The stock market tumbled. Economists warned of a major recession.\nIf by the end of this month, the virus remains a major public health threat and the economy continues to slide, ask yourself this: How long will Trump be willing to heed the advice of the medical community? How patient can he be -- and what will the consequences be if he isn't?\n\"I can't tell you -- I can't tell you a date, but I think it's going to be sooner rather than later,\" Trump predicted Saturday.", "url": "https://www.cnn.com/2020/04/05/politics/us-election-2020-week-ahead/index.html"}