{"authors": ["David Pitt", "Ryan J. Foley"], "date_download": "2020-05-04 20:12:58", "date_modify": "2020-05-04 20:12:58", "date_publish": "2020-04-15 15:14:24", "description": "DES MOINES, Iowa (AP) — Two employees have died following a coronavirus outbreak that has sickened scores of Tyson Foods workers at a large pork plant in southeastern Iowa, the company said...", "filename": "_fa83d2dd514c8e8d02f8fb1fc0ba315a_1588623178.html", "image_url": "https://storage.googleapis.com/afs-prod/media/109fb7fc51584145b80807485f409406/2000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fa83d2dd514c8e8d02f8fb1fc0ba315a_1588623178.html", "title": "Tyson Foods says 2 dead after virus outbreak at Iowa plant", "title_page": "Tyson Foods says 2 dead after virus outbreak at Iowa plant", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Kelly Garcia, Director of Iowa Department of Human Services speaks during a news conference on COVID-19 at the State Emergency Operations Center, Wednesday, April 15, 2020, in Johnston, Iowa. (Brian Powers/The Des Moines Register via AP)\nKelly Garcia, Director of Iowa Department of Human Services speaks during a news conference on COVID-19 at the State Emergency Operations Center, Wednesday, April 15, 2020, in Johnston, Iowa. (Brian Powers/The Des Moines Register via AP)\nDES MOINES, Iowa (AP) — Two employees have died following a coronavirus outbreak that has sickened scores of Tyson Foods workers at a large pork plant in southeastern Iowa, the company said Wednesday.\nThe deaths of the workers at Tyson plant in Columbus Junction are the first known to be linked to an outbreak at a meatpacking plant in Iowa.\nThe company said that it was “deeply saddened by the loss of two team members” and that their families were in its thoughts and prayers.\nThe plant has been idled since April 6, when Tyson announced that more than two dozen workers were infected. The company said Monday that it would continue the plant’s suspension this week after more workers tested positive.\nLouisa County, a rural area of 11,000 residents, announced Wednesday that Tyson workers account for 148 of 166 coronavirus cases in the county. An Iowa Department of Public Health spokesperson had earlier put the number of Tyson workers infected at 166.\nGov. Kim Reynolds said testing of the plant’s 1,400 workers was continuing this week. The state sent a rapid-testing machine to the county and enough materials to test 900 more employees and others with whom they had contact, she said.\nThe goal is to understand the scope of the outbreak as Tyson works to reopen the plant as early as next week, Reynolds said.\nThe governor said she was working with federal officials and business leaders to prevent additional outbreaks at Iowa food processing plants.\nThe Iowa Premium beef plant in Tama has also suspended production this week after several of its 850 workers tested positive.\nReynolds said she was calling the leaders of 18 major food plants to assess how the pandemic is affecting their workplaces and how the state can help.\nShe also had a call scheduled with U.S. Agriculture Secretary Sonny Perdue and was inquiring with the U.S. Centers for Disease Control “to see if they can provide some assistance.”\nReynolds said she wanted to help the plants identify infected employees “before it starts to become significant and really problematic for the facility to keep up and running.” She noted that the plants represent a critical part of the nation’s food supply.\n“We’re doing all of the above to make sure that we can continue to protect all of our employees but also make sure that we can protect this critical essential infrastructure as well,” Reynolds said.\nReynolds said state agencies were in “constant contact” with the plants and helping to ensure they are implementing worker safety protections.\nIowa State University economists predicted Wednesday that the pandemic will have a “massive” impact on Iowa’s agriculture industry, causing billions of dollars in losses. Hardest hit could be ethanol and hog farming as fuel demand drops, packing plants close and restaurants lose business, they warned.\nIowa reported an additional 96 residents testing positive for COVID-19, the respiratory illness caused by the virus, for a total of 1,995 since the first case was reported. The state confirmed a seventh outbreak at a long-term care facility, a retirement home in Wilton.\nAn additional four reported deaths increased Iowa’s death toll to 53, and current hospitalizations ticked up to 171.\nThe state’s largest hospital, University of Iowa Hospitals and Clinics in Iowa City, implemented new rules barring visitors for adult patients with very limited exceptions. Children, including two being treated for COVID-19, can have one visitor per day.\nHospital Chief Medical Officer Theresa Brennan said imposing the restrictions was a difficult but necessary call to protect workers and patients. She said the hospital was already hearing from smaller regional hospitals that were almost full and may soon need help treating patients.\nInfections at food manufacturing plants have contributed to the racial and ethnic disparities among Iowa residents testing positive for COVID-19, said Department of Public Health deputy director Sarah Reisetter. The plants employ a large number of Latinos and immigrants.\nHispanics and Latinos account for 17.4% of Iowa’s confirmed cases compared with about 6.2% of the state population. Blacks are more than 9% of those infected compared with 4% of the population.\nReisetter cited underlying health conditions and housing density as contributing to those rates.\n“We also know we have larger numbers of these populations that work in businesses that have not been ordered to close,” she said.", "url": "https://apnews.com/fa83d2dd514c8e8d02f8fb1fc0ba315a"}