{"authors": ["Opinion Dawn Siff"], "date_download": "2020-05-04 16:55:32", "date_modify": "2020-05-04 16:55:32", "date_publish": "2020-04-09 01:15:20", "description": "Dawn Siff writes that when she thinks about the time she spent canvassing her Queens, New York, community, collecting signatures to get on the ballot as a candidate for district leader, the importance of diversity, speaking out and showing up for one another really comes into focus during this pandemic.", "filename": "2020_04_08_opinions_passove_71b2697baeb1862086b55a26201580b2_index_1588611332.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200328031805-01-coronavirus-new-york-0327-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_opinions_passove_71b2697baeb1862086b55a26201580b2_index_1588611332.html", "title": "My Passover hope for one of the most diverse neighborhoods in America", "title_page": "My Passover hope for one of the most diverse neighborhoods in America (Opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Dawn Siff is an activist and writer who lives in Jackson Heights, New York with her family. She is a Democrat running for District Leader for Assembly District 34, Part A. The opinions expressed in this commentary are her own; view more opinion articles on CNN.\n(CNN) I don't know how many doors I knocked on in the weeks before Covid-19 shut down my Queens, New York, community. A thousand? Two thousand? I was collecting signatures to get on the ballot as a candidate for district leader, a volunteer position, in the New York State Democratic Party. According to state law, I needed 500 to appear on the ballot in June; according to unwritten local political law, I needed two or three times that, or a challenger would try to knock me off the ballot.\nWhen you canvass that many homes, you spend a lot of time staring at closed doors. I noted the Christmas decorations that were still up (in February) and the sassy doormat messages (\"Beware Attack Cat\").\nI tried to knock on doors with local guides; a friend from that building or block. Not only are people more likely to open the door for their neighbor, but I considered it a sign of respect. It was also an entree into other people's worlds, such as when an elderly couple invited me and my friend Anita inside and greeted her in Hindi.\nMy district, the eastern half of Assembly District 34 in Queens, includes parts of Elmhurst, East Elmhurst, a sliver of Corona — and Jackson Heights, where I live. Our community is 60% immigrant, one of the most diverse in America. Our grocery stores and restaurants are a tour through Latin America, Southeast Asia and points beyond. Our kids attend the local public schools, where written handouts are translated into at least three languages. When I think back on the time I spent canvassing, the importance of diversity, speaking out and showing up for one another really comes into focus.\nOne Sunday morning, my friend Steve and I worked our way through a mostly Spanish-speaking building. Almost every door had a mezuzah, or evidence of a mezuzah, buried under layers and layers of paint — decades, maybe even a century's worth.\nI pointed them out to Steve. \"Jewish homes almost always have a mezuzah, it's like a way of saying 'Bless this house; there's a prayer inside,'\" I explained. I told him how when I was a kid, the rabbi came to our new house, said a blessing, and helped us put up our mezuzah.\nAs we made our way through the building, Steve helped me refine my pitch in Spanish, checking our list of registered voters as we went. At one door, he read the last name to me, it ended in \"stein.\"\n\"Ohhhh, my people. I've got this one,\" I said. We both laughed.\nA slight woman opened the door a crack and peered out, she was wearing a nightgown. \"I'm sorry I'm not dressed,\" she said. Reading the cues, Steve stepped back. She invited me in. We sat at her small table while she signed my petition.\n\"How long have you lived here?\" I asked.\n\"Sixty years. I raised my family here,\" she told me.\n\"Can I ask you something?\" I said. \"I'm Jewish and I noticed all these painted-over mezuzahs on the doors. Did this used to be a very Jewish building?\"\n\"Oh, yes. They're all gone now. Now it's Hispanic.\" She leaned in, and I held my breath, afraid of what she might say next. \"The most wonderful people,\" she said in a loud whisper, nodding her head. \"They check in on me all the time. They ask me if I need anything. My son wants me to move out to New Jersey with him,\" she waved her hand away. \"But I love it here. This is home.\"\nWe chatted a little more, about synagogues in the neighborhood and what had replaced them.\nA few minutes later, I walked back out to the hallway where Steve was waiting. As we worked our way through the building, I started taking pictures of the mezuzahs.\n\"Does it offend you, that they're up there like that?\" Steve asked.\nI paused for a minute, tilted my head and scrunched my face.\n\"Yes, a little. I mean, it's a religious object,\" I answered. \"I wish someone had thought to remove them before they painted. They could have donated them to a synagogue or given them to a Jewish friend. Or, I wish the former occupants had taken them with them.\"\nBut maybe they were in a hurry when they left. After all, the mezuzah can be traced to the Passover story; the Jewish people were commanded to mark the doorposts of their houses with lamb's blood to signal a Jewish home, so the Angel of Death would \"pass over\" their house in the time of the plagues.\nTwo weeks later, the petitioning period ended. I was part of a group of candidates that lobbied the state to halt petitioning , in the wake of the coronavirus. In our neighborhood, Elmhurst Hospital became \"the epicenter of the epicenter\" of the pandemic, as our city councilman, Daniel Dromm, put it to The Washington Post. Dromm cited our large immigrant population, filled with hospital and health care workers who help run New York City and are now bearing the brunt of this pandemic.\nWe retreated into our homes, and looked for ways to help our neighbors — friends raised money for Elmhurst hospital, opened emergency childcare centers, phone banked to check on seniors, and created networks to help one another. I delivered Passover foods to homebound Jewish seniors. I thought of the Jewish woman I met with my friend Steve. I couldn't find her phone number, but I sent her a letter. I haven't heard from her. I hope she's safe with her son in New Jersey, or at her home, being looked after by her neighbors.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook", "url": "https://www.cnn.com/2020/04/08/opinions/passover-hope-for-queens-ny-diverse-neighborhoods-siff/index.html"}