{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:57:39", "date_modify": "2020-05-04 16:57:39", "date_publish": "2020-04-09 14:30:54", "description": "In an interview Wednesday night, Dr. Anthony Fauci made a recommendation for post-coronavirus pandemic America.", "filename": "2020_04_09_politics_shaking-hands-coronavirus-2020_index_1588611459.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190504132159-trump-putin-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_shaking-hands-coronavirus-2020_index_1588611459.html", "title": "How coronavirus may finally end the handshake in politics", "title_page": "How coronavirus may finally end the handshake in politics  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "\"As a society, just forget about shaking hands, we don't need to shake hands,\" the director of the National Institute on Allergy and Infectious Disease said. \"We've gotta break that custom, because as a matter of fact that is really one of the major ways you can transmit a respiratory-borne illness.\"\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!\nWhich, at first glance, might not seem like that big a deal. After all, we've spent the better part of the last month staying at home and not getting within six feet of anyone we're not directly related to! What's a handshake after all that?\nBut at least in the realm of politics, shaking hands is seen as fundamental to how elected officials signal their connection to the average Joe.\"What the handshake is saying is, `I'm really with you and here for you. You can trust me,\"' handshake expert Robert E. Brown told the Chicago Tribune in 2005\n\"I love the people of this country, and you can't be a politician and not shake hands,\" President Donald Trump said at a Fox town hall in early March . \"And I'll be shaking hands with people -- and they want to say hello and hug you and kiss you -- I don't care.\"\n(That's a flip-flop from Trump's past views on handshaking. \"I am not a big fan of the handshake,\" he said in 1999 . \"I think it's barbaric. ... Shaking hands, you catch colds, you catch the flu, you catch it, you catch all sorts of things. Who knows what you don't catch?\")\nVice President Mike Pence echoed Trump's newfound pro-handshake sentiment. \"As the President has said, in our line of work, you shake hands when someone wants to shake your hand, and I expect the President will continue to do that, I'll continue to do it,\" he said at a coronavirus task force briefing on March 10.\n(Both men have since stopped shaking hands at the recommendation of doctors and infectious disease experts.)\nSo, to imagine a political campaign, which we will have this fall, without handshakes is, well, weird. And it got me thinking about other established traditions of the campaign trail that the coronavirus may stop -- or radically alter -- forever.\n* Kissing babies: Honestly, this one was always dumb. It apparently goes all the way back to the 1830s when President Andrew Jackson, while campaigning in New Jersey, : Honestly, this one was always dumb. It apparently goes all the way back to the 1830s when President Andrew Jackson, while campaigning in New Jersey, kissed a baby in the crowd and pronounced the baby \"a fine specimen of young American childhood. ... Note the brightness of that eye, the great strength of those limbs, and the sweetness of those lips.\"\nIt's been a thing ever since although Geraldine Ferraro, the 1984 Democratic vice presidential nominee, had it right when she told The New York Times' Maureen Dowd this in October 1984\n\"As a mother, my instinctive reaction is how do you give your baby to someone who's a total stranger to kiss, especially with so many colds going around? And especially when the woman is wearing lipstick? I mean, I find that amazing that someone would do that?\"\nCan you imagine -- in the age of coronavirus -- a mother or father handing their kid over to a politician for a smooch? Or the politician obliging? I can't.\n* Big campaign rallies: One of the hallmarks of alleged excitement in a campaign is the size of a candidate's crowds. While this is -- obviously -- a purely anecdotal measurement, lots and lots of politicians put a lot of stock in how many people turn out to hear them speak.\nDuring the 2012 presidential campaign, GOP strategis t Ed Rollins predicted to Politico that Mitt Romney would beat Barack Obama because of crowd size. \"Crowd sizes are a vital part of any close campaign,\" said Rollins. \"They come out because the campaign is better organized and puts the resources into getting out supporters,\" he said. \"Crowds also grow as the enthusiasm for the candidate grows. Romney is now in a position to win. His supporters want to be a part of that victory.\" (Swing and a miss on that one, Ed!)\nAnd the current occupant of the White House is uniquely focused on crowd size. \"No matter where we go, we have these massive crowds,\" Trump said at a rally in the fall of 2016 . \"We just left one that was 11,000. ... It's been amazing, the receptivity. There's never been anything like this in this country.\" At virtually every campaign speech he has given since -- and there have been many of them -- Trump remarks at the size of the crowd -- it is, in his imagining, always record breaking and the biggest ever -- and declares it as an indicator of how real people love him and what he is doing in the White House.\nGiven the federal guidelines about the dangers posed by big -- or even smallish -- crowds, will people be willing to risk the possibility of getting sick to attend a rally this summer or fall?\n* National party conventions: At one point in history, the quadrennial conventions were absolutely essential. A nominee would often not be chosen until all of the delegates gathered in a chosen city to be cajoled, wrangled and, in some cases, paid off to line up behind a certain candidate. Nowadays? Not so much.\nIt's early April and we already know that Trump will be the Republican nominee and Joe Biden will be the Democratic nominee. Why then would either national party take the risk of gathering tens of thousands of people together for an event that, when you get right down to it, isn't necessary? (Biden and Trump could easily be nominated by acclamation or by some sort of virtual vote.)\nBiden, for his part, has already floated the idea of a virtual convention. \"We may have to do a virtual convention,\" the former VP said in an interview on ABC over the weekend. \"I think we should be thinking about that right now. The idea of holding the convention is going to be necessary. We may not be able to put 10, 20, 30,000 people in one place.\"\n\"We're not going to cancel,\" Trump continues to insist it's all systems go for the GOP convention in late August. \"\"We're not going to cancel,\" Trump said in an interview with Fox News late last month. \"I think we're going to be in great shape long before then.\"\nMaybe! But will people flock to the national conventions -- even if they are held -- given the coronavirus cloud still looming in some way, shape or form?", "url": "https://www.cnn.com/2020/04/09/politics/shaking-hands-coronavirus-2020/index.html"}