{"authors": [], "date_download": "2020-05-04 20:19:29", "date_modify": "2020-05-04 20:19:29", "date_publish": "2020-04-09 18:16:29", "description": "CINCINNATI (AP) — An Ohio prosecutor will ask a grand jury to have an aggravated murder charge carry the death penalty for a man accused of killing a police officer by crashing into her during a...", "filename": "_39b80b2cc61c48089141e49487de865f_1588623569.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_39b80b2cc61c48089141e49487de865f_1588623569.html", "title": "Man charged with murder for crash into Ohio police officer", "title_page": "Man charged with murder for crash into Ohio police officer", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CINCINNATI (AP) — An Ohio prosecutor will ask a grand jury to have an aggravated murder charge carry the death penalty for a man accused of killing a police officer by crashing into her during a chase.\nHamilton County authorities said the grand jury isn’t meeting now because of the coronavirus precautions. Prosecutor Joe Deters was joined in Cincinnati on Wednesday by Attorney General David Yost to announce the charge against Larry Blankenship, 42, and the plans to seek a death specification from a grand jury.\nSpringdale officer Kaia Grant, 33, was killed March 21 after she was struck while Blankenship was allegedly fleeing police. No attorney was listed Thursday in court records for Blankenship, who remains hospitalized. Deters said Blankenship survived a self-inflicted gunshot to the head.\nGrant was killed after Blankenship fled police who were trying to arrest him on a felony warrant from Blanchester, Ohio. When the chase entered the Springdale city limits on Interstate 275, Grant and Sgt. Andrew Davis were trying to deploy stop sticks when Blankenship allegedly crashed into the pair. Davis was treated for injuries and survived.\nGrant was flown to a hospital, where she was pronounced dead soon afterward. She had been with Springdale force for eight years. Authorities said she was the first police fatality in the line of duty in the northern Cincinnati suburb’s history.", "url": "https://apnews.com/39b80b2cc61c48089141e49487de865f"}