{"authors": ["Assistant Political Editor", "Huffpost Uk"], "date_download": "2020-05-04 20:14:46", "date_modify": "2020-05-04 20:14:46", "date_publish": "2020-04-29 09:05:32", "description": "Both mother and baby are doing very well, their spokesman said.", "filename": "entry_boris-johnson-carrie-symonds-announce-birth-of-baby-boy_n_5ea94268c5b6fb98a2b54464_1588623286.html", "image_url": "https://img.huffingtonpost.com/asset/5ea942622500008c10eb08a9.jpeg?cache=2bnam5uy2a&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_boris-johnson-carrie-symonds-announce-birth-of-baby-boy_n_5ea94268c5b6fb98a2b54464_1588623286.html", "title": "UK Prime Minister Boris Johnson And Fiancée Carrie Symonds Announce Birth Of Baby Boy", "title_page": "UK Prime Minister Boris Johnson And Fiancée Carrie Symonds Announce Birth Of Baby Boy | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "UK Prime Minister Boris Johnson and fiancée Carrie Symonds have announced the birth of a “healthy baby boy” at a London hospital on Wednesday.\n“The prime minister and Ms. Symonds are thrilled to announce the birth of a healthy baby boy at a London hospital earlier this morning. Both mother and baby are doing very well,” their spokesman said.\n“The PM and Ms. Symonds would like to thank the fantastic NHS maternity team.”\nJohnson returned to No.10 Downing Street on Sunday evening take charge of the government’s response to the coronavirus crisis.\nHe had been recuperating at the Chequers country estate following his discharge from hospital, where he had spent three nights in intensive care.\nSymonds sent Johnson daily updates, including images of their unborn child, as he struggled with coronavirus at St Thomas’ Hospital in central London.\nSymonds had also suffered from coronavirus symptoms while pregnant.\nFollowing the birth of their child, Johnson will not be taking part in the prime minister’s questions session at the House of Commons today.\nDominic Raab, the foreign secretary, will stand in for Johnson and face Labour leader Keir Starmer in the Commons.", "url": "https://www.huffpost.com/entry/boris-johnson-carrie-symonds-announce-birth-of-baby-boy_n_5ea94268c5b6fb98a2b54464"}