{"authors": ["Religion Reporter"], "date_download": "2020-05-04 20:13:48", "date_modify": "2020-05-04 20:13:48", "date_publish": "2020-04-29 02:01:45", "description": "Roughly one-third of states haven’t imposed size restrictions on religious gatherings, a new analysis from the Pew Research Center suggests.", "filename": "entry_religious-exemptions-coronavirus-pew_n_5ea895bfc5b696a08243c48a_1588623228.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8d5183000009a11155171.jpeg?cache=jkgecghuud&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_religious-exemptions-coronavirus-pew_n_5ea895bfc5b696a08243c48a_1588623228.html", "title": "Most States Are Exempting Houses Of Worship From Social Distancing Orders", "title_page": "Most States Are Exempting Houses Of Worship From Social Distancing Orders | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "A new Pew Research Center analysis is offering a clearer picture of where state governments have drawn the line between protecting public health and ensuring religious freedom during the coronavirus pandemic.\nMost houses of worship in the U.S. have been shuttered since mid-March to combat the spread of COVID-19, the disease caused by the novel coronavirus. But in some places, the closures have sparked showdowns between pastors and their local and state governments over whether houses of worship should be exempted from the stay-at-home orders that have brought many other aspects of American life to a halt.\nMost states have built these religious exemptions into the guidelines they’ve issued on the coronavirus, according to a Pew Research Center analysis published Monday.\nAbout one-third of states haven’t imposed size restrictions on religious gatherings, fully exempting houses of worship from state regulations on social distancing, according to Pew. Some of these states ― places like Florida, South Carolina and Tennessee ― have deemed religious gatherings to be “essential,” lumping houses of worship together with health care facilities and grocery stores.\nDavid Santiago/Miami Herald/Tribune News Service via Getty Images A parishioner holds a rosary while she prays wearing a mask and protective gloves at Saint Jude Melkite Greek Catholic Church on April 12, 2020, in Miami.\nIn Florida late last month, evangelical pastor Rodney Howard-Browne of Tampa’s River megachurch was arrested for defying a local order limiting public gatherings. Two days later, Florida Gov. Ron DeSantis (R) announced that attending religious services is an “essential” activity permitted in his state, overruling the local ban.\nMichigan’s Democratic Gov. Gretchen Whitmer has also exempted places of worship from being penalized for holding gatherings of any size. Whitmer has said that she was pressured by her state’s Republican-controlled legislature to create an exemption for churches.\nOn the other end of the spectrum, nine states have outright banned all in-person religious gatherings, Pew reports. Six of those states are led by Democratic governors, while three are led by Republican governors. Some are states that have been heavily hit by the pandemic ― including New York, New Jersey, Illinois and California. In New York City, over 16,000 deaths have been attributed to the virus.\nMost states have taken a middle route, Pew reported ― allowing religious gatherings to take place with limits on how many people can meet.\nPew Research Center A Pew Research Center graphic shows how states have restricted religious practices during the coronavirus pandemic. The graph reflects executive orders in effect on April 24, 2020.\nThese regulations are changing swiftly as some states look toward reopening. Pew’s map reflects executive orders that were in effect on April 24. Montana initially prohibited all religious gatherings, but as of April 26, the state is allowing houses of worship to resume operations while limiting gatherings to groups of less than 10 in buildings where physical distancing isn’t possible. The governor’s new guidelines don’t overturn more restrictive local regulations.\nThe Centers for Disease Control and Prevention is still urging faith groups to limit events and meetings that require close contact and to cancel large meetings or events in areas where minimal or moderate spread is happening in the community.\nNevertheless, the ability to practice religion as one sees fit is a right that has strong legal protections in the U.S. The Religious Freedom Restoration Act of 1993 (along with similar measures passed by states) ensures that authorities can’t substantially infringe on Americans’ religious practices without proving they are using the least restrictive means of fulfilling a compelling government interest. Subsequent Supreme Court decisions have further established that the government can create exemptions to generally applicable laws just for religious objectors.\nRFRA initially had bipartisan support, but in recent years, the religious right has latched on to the law as a way to secure exemptions for conservative beliefs about abortion and LGBTQ rights.\nLaw firms working within the Christian legal movement have extensive experience using RFRA to further conservative causes ― and these are the firms behind many of the lawsuits currently challenging governors’ stay-at-home orders.\nCHANDAN KHANNA via Getty Images Worshippers offer prayers inside the \"Smallest Church In America\" in Townsend, Georgia, during the novel coronavirus pandemic on April 26, 2020.\nMost Americans (77%) say that places of worship shouldn’t get religious exemptions to stay-at-home orders, according to a Public Religion Research Institute study from mid-April. White evangelical Protestants were more likely than other religious groups to support such exemptions.\nRegardless of whether or not their state has carved religious exemptions into stay-at-home orders, most Americans of faith don’t appear to be attending services. According to PRRI, only 3% of regular churchgoers reported that they planned to attend in-person services for Easter ― typically the most well-attended Sunday of the year.", "url": "https://www.huffpost.com/entry/religious-exemptions-coronavirus-pew_n_5ea895bfc5b696a08243c48a"}