{"authors": ["Lauren Del Valle"], "date_download": "2020-05-04 16:04:21", "date_modify": "2020-05-04 16:04:21", "date_publish": "2020-03-31 08:14:18", "description": "A March 28 email from the NYU Langone Health Department of Emergency Medicine Chair told physicians to \"think more critically about who we intubate,\" according to a report from The Wall Street Journal.", "filename": "2020_03_31_us_nyu-langone-emergency-doctors-intubation_index_1588608261.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331020536-nyu-langone-hospital-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_us_nyu-langone-emergency-doctors-intubation_index_1588608261.html", "title": "NYU Langone tells emergency doctors to consider who gets intubated, WSJ reports", "title_page": "NYU Langone tells emergency doctors to consider who gets intubated, WSJ reports  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A March 28 email from the NYU Langone Health Department of Emergency Medicine Chair told physicians to \"think more critically about who we intubate,\" according to a report from The Wall Street Journal.\n\"In Emergency Medicine, we do not have the luxury of time, data, or committees to help with our critical triage decisions. Senior hospital leadership recognizes this and supports us to use our best clinical judgment,\" the email from Dr. Robert Femia said, according to The Journal.\n\"For those patients who you feel intubation will not change their ultimate clinical outcome (for example cardiac arrests, some chronic disease patients at end of life, etc) you will have support in your decision making at the department and institutional level to withhold futile intubations,\" the email continued.\nThe hospital system is not yet in the position to make those difficult ethical decisions, according to an NYU Langone Health spokesperson.\n\"The guidelines that were outlined in this e-mail have been in place well before the coronavirus crisis . However, given the present environment, we felt it was important to re-emphasize to our emergency medicine staff what these guidelines explicitly say, and to assure them that the decisions that they make at the bedside will be supported,\" the spokesperson said in a statement to CNN.\nRead More", "url": "https://www.cnn.com/2020/03/31/us/nyu-langone-emergency-doctors-intubation/index.html"}