{"authors": [], "date_download": "2020-05-04 16:01:05", "date_modify": "2020-05-04 16:01:05", "date_publish": "2020-04-01 15:58:44", "description": "As working out from home becomes more prevalent than ever, we spoke with yoga teachers about their favorite mats to use at home.", "filename": "2020_04_01_cnn-underscored_best-yoga-mat_index_1588608065.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331155026-yogamatlead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_cnn-underscored_best-yoga-mat_index_1588608065.html", "title": "The best yoga mats, according to experts", "title_page": "Best yoga mat: Professional yogis recommend their favorite yoga mats - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored has interviewed experts to find the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nThere's no denying the multiple benefits of yoga. From its ability to alleviate stress and anxiety to reducing inflammation and chronic pain, this ancient practice helps many people improve their overall quality of life.\nEspecially at a time when many of us are staying home to help stop the spread of coronavirus, and our gyms are closed for the same reason, it's become an essential at-home workout and stress reliever for many.\nSo it's a good time to invest in a mat of your own to always have at home — or to upgrade from that bargain mat you bought when you first started practicing. When you start to browse, however, you'll wonder if you should go thick or thin in a mat, and whether you need a yoga towel for support. What about yoga blocks? And how do you know if your feet are at the right angles?\nHere, a guide — straight from yoga teachers — to what to look for when shopping for a yoga mat, to improve your journey to the best pose of all, savasana.\nBest yoga mats\nGaiam SB 6mm Yoga Mat in Purist Blue/Gray ($29.99; target.com)\nGaiam SB 6mm Yoga Mat in Purist Blue/Gray\nWhen author and yoga teacher Sara DiVello shops for a mat, she looks for something that will feel extra-cushy. She's been practicing yoga for 20 years and teaching for 12, specializing in super-gentle, ultra-pampering therapeutic flows.\nWith this bargain-priced toxic-free mat with 6mm cushion, DiVello says, you'll feel supported through each move. Especially for those with sensitive knees, this is a great option. \"While we're all at home practicing safe social distancing, it's nice to see the beautiful turquoise and mentally transport yourself to a tropical beach,\" she adds.\n_______________________________________________________________________________\nAlo Yoga Warrior Mat ($100; aloyoga.com)\nAlo Yoga Warrior Mat\nFor the past 10 years, Rebekah Grace Rivera has taught yoga classes, trained, mentored and led retreats around the world. When selecting a mat, she looks for grip and thickness. After all, you want to be able to hold your stance comfortably.\n\"The eco-friendly mat checks every box,\" she says. \"It is the perfect thickness to support your joints. It stays in place on the floor while you transition between shapes and its nonslip surface draws moisture away, so you're not sliding around on your mat as you perspire. And it cleans up with a quick wipe and is antibacterial.\"\n_______________________________________________________________________________\nManduka eKO Lite 68\" Mat ($72; dicksportinggoods.com)\nManduka eKO Lite 68\" Mat\nThe first time Samantha Attard used this mat, she nearly cried because it was so much better than anything she had practiced on before. And that speaks volumes, since she's been a yogi for 15 years, and taught for five of them. Today, she's the founder of Spiro Collective, and she loves this mat because of its thin top layer that is nonslip and firm. And as a bonus, the bottom layer provides some support.\n\"The combination of these two layers means there's enough cushion so you don't feel like you're practicing directly on the floor, while preventing the wrist pain that can happen with overly thick or squishy mats,\" she adds.\n_______________________________________________________________________________\nJadeYoga 368BK Harmony Mat ($73.99; overstock.com)\nJadeYoga 368BK Harmony Mat\nFor Colleen Quaid, yoga has been an almost 10-year journey. She started practicing in 2011, earned her teaching certification in 2015 and purchased Mirepoix Wellness Studio in Chicago in 2018. When looking for the right yoga mat, she appreciates one like this, that requires no break-in time. In fact, she says, it has the best grip of any yoga mat she's ever used.\n\"Many of our students have been converted to using a JadeYoga mat for their home practice because of the positive experience they have had with the mats while practicing at our studio,\" she says. \"As an added bonus, JadeYoga mats are made from trees and for every mat and block sold, another tree is planted in its place.\"\n_______________________________________________________________________________\nJadeYoga Level 1 Yoga Mat ($39.95; rei.com)\nJadeYoga Level 1 Yoga Mat\nThough Lindsay Herr has only been certified as a yoga teacher for two years, she's been practicing for 13. And for six of those, she's owned her JadeYoga mat — which she says has never let her down and is just as sturdy as it was on the day she bought it. Not only does it provide traction and cushioning, but she says it feels almost nurturing while she's transitioning through different postures.\n\"It has not shown much wear and tear over the years,\" she says. \"I would rather have a mat that becomes my dependable friend, rather than one I need to keep replacing, especially for anyone who practices daily and plans to put it to good use.\"\n_______________________________________________________________________________\nAlo Yoga Travel Mat ($80; aloyoga.com)\nAlo Yoga Travel Mat\nSince the age of 13, Noah Mazé has made yoga part of his daily life. He turned this nearly lifelong passion into his career, co-founding The Mazé Method Yoga School, where he's been teaching full-time for 21 years and counting.\nIt may be surprising, but his go-to mat is this travel-sized option, whether he's on the road or at home. If you're stuck in a small apartment or have very little storage, this could be the right option for you. \"It's lightweight, compact and has a foldable design,\" he says. \"It is still plenty durable and offers enough cushion on our hard surface floors, but easy to bring anywhere at any time.\"\n_______________________________________________________________________________\nManduka 71\" eKO Lite Yoga Mat ($78; dicksportingoods.com)\nManduka 71\" eKO Lite Yoga Mat\nTravis Eliot, who's been teaching yoga for 15 years and co-created the online yoga platform Inner Dimension TV, says his favorite mat is this one from Manduka, which he says provides the grip he needs during power yoga sessions.\n\"There is nothing worse than sliding all over the place when the sweat starts to flow. When practicing Yin Yoga and meditation, the eKO Lite also provides just the right amount of cushion without the mat feeling too heavy — making it travel friendly, too,\" he says.\n_______________________________________________________________________________\nGaiam Performance Dry-Grip Yoga Mat ($69.98; gaiam.com)\nGaiam Performance Dry-Grip Yoga Mat\nWhen you're deciding whether to buy a mat and which to choose, Laurel Kuzins, a yoga instructor for the past five years, suggests covering these four bases: support, grip, weight and material. The one that meets all of her must-haves is this find from Gaiam.\nNot only does it provide traction to keep her in place, but it's great for the environment, too. \"Splurge a little on this mat and you will have a quality product that will last through all of your workouts for years to come,\" she says.\n_______________________________________________________________________________\nDuck Duck Dog Yoga Mat for Kids ($47.50; etsy.com)\nDuck Duck Dog Yoga Mat for Kids\nJoanie Plake, the founder and CEO of Breathe & Learn Yoga, has combined her 13-year passion for yoga and her elementary classroom teaching experience into a company that supports parents and their kiddos. That's why she recommends this child-friendly mat from Duck Duck Dog.\n\"The cute characters and bright colors encourage imagination so that kids can do yoga in their own unique way,\" she says. \"It's perfect for preschool and elementary school students; both the eco-soft mat and the standard mat are lightweight and easy to clean.\"\n_______________________________________________________________________________\nManduka Pro Yoga Mat in Purple ($146; dickssportinggoods.com)\nManduka Pro Yoga Mat in Purple (Black Magic)\nReiki master and yoga teacher Kelsey Patel started practicing yoga 20 years ago, when she was just 19. Eight years ago, she took it to another level and became a teacher. She likes this mat because she can take it pretty much anywhere she goes, and it rolls up easily to store in a closet.\n\"I've tried ones that are thinner and they're too thin to place my knees on for certain positions. I've tried ones that are thicker and they're too bulky and heavy to easily take with me or to store,\" she explains. \"This is by far my favorite mat, and I'll even roll it up and sit on it cross-legged for some of my morning meditation practices as well. It's just easy and versatile.\"\n_______________________________________________________________________________\nMysolmat Avocado Yoga Mat ($67; etsy.com)\nMysolmat Avocado Yoga Mat\nMelody Butler, a yoga teacher for five years, was initially drawn to this colorful and fun mat because it's from a Texas-based, female-led company. But what kept her attention was the quality. She calls this mat super-durable and flexible, which allows her to move without worry.\n\"It is really difficult to find a mat that is lightweight, nonslip, and gentle on your joints, and I think these mats hit that balance very well,\" she says. \"These yoga mats stand out in such a fun way — the patterns are so fun, bright, and unique — I always receive so many compliments on mine, and the kids in my youth yoga classes love them.\"\n_______________________________________________________________________________\nAlo Yoga Chakra Yoga Mat ($120; aloyoga.com)\nAlo Yoga Chakra Yoga Mat\nJennifer Ursillo is an alignment-based yoga teacher, which makes her appreciate this guided mat that much more. It features an asana-guiding grid, creating an easy way to know where your feet and hands should go for each pose.\n\"The grip of this mat is amazing, even during sweaty practices, and the thickness of this mat provides the perfect amount of cushion and comfort,\" she says. And if you think it's too pricey, think again — Ursillo says a mat should be seen as an investment that's with you throughout your journey.\n_______________________________________________________________________________\nManduka eKO Superlite Mat ($44; manduka.com)\nManduka eKO Superlite Mat\nEven if you're not traveling these days, those road trips will return at some point, and if you choose to flow at the hotel gym, this lightweight option is ideal. It only weighs 2.2 pounds, so it won't add much to your carry-on, and it's perfect for strapping to your backpack for easy airport security.\n_______________________________________________________________________________\nGaiam Restore Self-Guided Fitness Mat ($29.99; gaiam.com)\nGaiam Restore Self-Guided Fitness Mat\nThis mat is made of thicker material than more advanced mats, so you'll have extra stability, and includes a picture guide to some common floor moves that turn up in yoga as well as other exercise routines. These visuals will help your confidence while you perfect your form.\n_______________________________________________________________________________\nSivan Health Fitness 6-Piece Yoga Kit ($39.99; qvc.com)\nSivan Health Fitness 6-Piece Yoga Kit\nWhen you're still getting the hang of yoga and you aren't practicing one-leg balance moves yet, a thick yoga mat is ideal. How come? The depth will allow you to fall comfortably — and it challenges you to engage your core for stability. This set also features yoga blocks for relaxing into a pose and towels for even more grip.\n_______________________________________________________________________________\nYoga Design Lab 2-in-One ($78; anthropologie.com)\nYoga Design Lab 2-in-One\nAs they progress in their practice, many yogis tend to prefer a thin mat. These provide extra grip for your toes when you're tackling difficult postures. This one also features yoga-towel materials, which means you never have to worry about slippery sweat droplets interrupting your vinyasa.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/01/cnn-underscored/best-yoga-mat/index.html"}