{"authors": [], "date_download": "2020-05-04 20:26:07", "date_modify": "2020-05-04 20:26:07", "date_publish": "2020-04-28 20:00:04", "description": "\"It’s something that you shouldn’t dismiss,” said Saffery, who appears in the Netflix series as a tiger attack victim at Joe Exotic’s zoo.", "filename": "entry_tiger-king-kelci-saff-saffery-lgbtq-identity_n_5ea8286ac5b654e4714a13aa_1588623967.html", "image_url": "https://img.huffingtonpost.com/asset/5ea88a1f2200006f0c827d0c.png?cache=ctah1w7xdp&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_tiger-king-kelci-saff-saffery-lgbtq-identity_n_5ea8286ac5b654e4714a13aa_1588623967.html", "title": "Saff Saffery Of 'Tiger King' Hopes Being Misgendered As 'She' Aids Pronoun Debate", "title_page": "Saff Saffery Of 'Tiger King' Hopes Being Misgendered As 'She' Aids Pronoun Debate | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "LONDON, April 28 (Thomson Reuters Foundation) - After finding fame as the mauled zoo keeper in the hit Netflix documentary “Tiger King,” Kelci “Saff” Saffery has also found himself in another spotlight - a row over gender pronouns.\nSaffery appears in the series as the victim of a tiger attack at Joe Exotic’s zoo in Oklahoma who opts for amputation rather than two years of reconstructive surgery after the accident, and is back at work days after leaving hospital.\nThroughout the series the good-natured keeper is referred to as “she” despite identifying as male since childhood.\nSaffery, 34, said he didn’t mind being called “she” in the series but the anger this misuse of pronouns had provoked online towards had been an eye-opener for him.\n“I don’t think they intended to be cruel in any way, but dismissive or not, it still made a very, very loud statement about the way they feel about the (LGBT+) community,” Saffery told the Thomson Reuters Foundation.\n“Personally it doesn’t bother me ... (but) these titles and these pronouns, they matter just as much as calling someone by the wrong name. It’s something that you shouldn’t dismiss.”\nNetflix did not respond to a request for comment.\nNetflix recently collaborated with LGBT+ advocacy group GLAAD on the #FirstTimeISawMe campaign to raise transgender visibility in the media. GLAAD found 38 transgender characters on television in 2019 which was up from 26 a year earlier.\nBut the misgendering of Saffery was a sore point for many.\n“They practically erased Saff as a trans man,” said a blog by LGBT+ business network MyGWork, while news site LGBTQ Nation said Saffery was shown “as a lesbian without any context.”\nSaffery said, however, he did not identify as transgender as he had not had any gender reassignment surgery or taken cross-sex hormones, but he lived as a man and used the pronoun he.\n“My children call me dad, they do not call me mom,” said Saffery, who has three children, aged from nearly one to 11, with his longterm female partner.\n“I can’t remember a time when I knew (anything) different... I just think it was obvious, what I wanted, the way I wanted to live and my family immediately supported that,” he added in a phone interview from his new California home.\nMURDER, MYSTERY AND MAYHEM\nAbout 64 million households watched “Tiger King” in the four weeks after its March 20 premiere, according to a projection in an April 21 Netflix letter to shareholders, making it the smash viewing hit of the global coronavirus lockdown.\nThe documentary sparked a list of controversies as it followed the life of the now-imprisoned Joseph Maldonado-Passage, aka Joe Exotic, a gay, polygamous exotic animal owner, along with past and present employees.\nThe seven-part series - which was even raised at a press conference with U.S. President Donald Trump - also focused onJoe Exotic’s feuds with other big cat zoo owners in the UnitedStates, including his arch rival Carole Baskin.\nBut it was the keeper at the Greater Wynnewood Exotic AnimalPark who won many viewers’ sympathy, when his arm was mauled after he put it into a tiger’s cage and for his good nature.\nSaffery blamed himself for the accident in 2013 and was back at work a week later with his arm amputated below the elbow, a decision he insists was his and not due to pressure from Exotic.\n“I had done that same routine with that same tiger 100 times before and I broke protocol. I broke routine, I got complacent, and my mistake led to that tiger being a tiger,” he said.\nSaffery said he had wanted to work with tigers since he wasa child but still had no “clear answer” on whether tigers andother big cats should be kept in captivity.\nHe joined Exotic’s zoo in 2010 after finding it via a Google search when he left the U.S. army, having served for six years as a female soldier in missile defense system and bomb disposal units, including twice overseas in Iraq and then Afghanistan.\nHowever Saffery left the zoo industry in 2018 after becoming disillusioned with those in charge, and was working in a warehouse before the series aired and the coronavirus pandemic.\n“Guys that I looked up to in this industry ... you see them destroying each other,” he said.\nWhile in lockdown, Saffery has been relishing spending more time with his children and making money from his new-found fame by sending video messages to 250 plus paying fans online.\n“I’m thoroughly enjoying every second of it,” Saffery said. “It’s a nice second chance and I won’t take it for granted.”\n(Reporting by Rachel Savage @rachelmsavage; Editing by Belinda Goldsmith Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers the lives of people around the world who struggle to live freely or fairly. Visit http://news.trust.org)", "url": "https://www.huffpost.com/entry/tiger-king-kelci-saff-saffery-lgbtq-identity_n_5ea8286ac5b654e4714a13aa"}