{"authors": ["Kathleen Ronayne"], "date_download": "2020-05-04 20:10:49", "date_modify": "2020-05-04 20:10:49", "date_publish": "2020-04-16 05:03:59", "description": "SACRAMENTO, Calif. (AP) — California is still dealing with “hot spots\" of the coronavirus around the state, Gov. Gavin Newsom said Thursday as officials considered evacuating residents of a...", "filename": "_49e0e83dcecc742e95c3878535e7c41e_1588623049.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c96ad9e4bcc74d9a8bc7b9c112277169/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_49e0e83dcecc742e95c3878535e7c41e_1588623049.html", "title": "Virus hot spots at California nursing home, grocery facility", "title_page": "Virus hot spots at California nursing home, grocery facility", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This April 1, 2020 photo shows Redwood Springs Healthcare Center in Visalia, Calif. As of Thursday, April 16, 2020, the California nursing home has 154 coronavirus cases and eight residents have died in an outbreak that has prompted authorities to prepare to evacuate residents if adequate staffing can't be maintained. (Ron Holman/Visalia Times-Delta via AP)\nThis April 1, 2020 photo shows Redwood Springs Healthcare Center in Visalia, Calif. As of Thursday, April 16, 2020, the California nursing home has 154 coronavirus cases and eight residents have died in an outbreak that has prompted authorities to prepare to evacuate residents if adequate staffing can't be maintained. (Ron Holman/Visalia Times-Delta via AP)\nSACRAMENTO, Calif. (AP) — California is still dealing with “hot spots” of the coronavirus around the state, Gov. Gavin Newsom said Thursday as officials considered evacuating residents of a California nursing home with 156 infections and 10 deaths and the state inspected a Central Valley Safeway warehouse facing an outbreak.\n“We’re still seeing hot spots throughout the state,” Newsom said at his daily briefing, calling for continued vigilance even as California considers when it will ease virus-related restrictions.\nHe cited the nursing home in Visalia, where at least 156 people tested positive and 10 died, and the distribution center in Tracy, where he said 51 people were infected and one died.\nTeamsters Local 439, which represents workers at the Safeway facility, said Pedro Zuniga, a long-time employee, died.\nNorthern California Safeway spokeswoman Wendy Gutshall said about 3% of the 1,700 workers at the Tracy facility have tested positive for the virus and enhanced safety measures are in place. It provides groceries to about 300 stores throughout Northern California, Nevada and Hawaii.\n“We continue to reinforce with all associates the importance of social distancing as the most effective tool we have to combat the spread of COVID-19,” Gutshall said in a statement. She said all common areas are closed and workers are encouraged to take breaks by themselves.\nMore than 950 people have died from the virus in California, according to Johns Hopkins University. Los Angeles County, which has nearly half the statewide deaths, on Thursday reported 55 new deaths, its highest daily death toll by far.\nThe outbreak at the Redwood Springs Healthcare Center in Visalia, where 106 residents and 50 staff members tested positive and 10 have died, is the largest reported outbreak at a California nursing home. The California Department of Public Health on Thursday didn’t provide the total number of outbreaks at nursing facilities across the state.\nAll patients and staff were being tested and the 176-bed facility in the agricultural Central Valley is receiving staffing support from the county, state and hospitals, said administrator Anita Hubbard. The county could evacuate the home as an “absolute worst-case scenario,” Tim Lutz, director of the Tulare County Health and Human Services Agency, told the Visalia Times Delta.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness or death.\nAt the Safeway facility, the first positive test for the virus came two or three weeks ago, said Rome Aloise, the Teamsters West Region International vice president.\n“People work in close quarters in these warehouses and we’re not sure at the beginning people were taking the proper precautions,” he said. “We are sure they didn’t have the proper PPE for everybody,” he added, referring to personal protective equipment like masks.\nWhen the pandemic began, Safeway was first offering wipes and hand sanitizer to workers, he said.\nGutshall said in her statement that “sourced masks to be worn by all associates” are now among the precautions being taken there.\nThe California Division of Occupational Safety and Health visited the facility on Thursday, a day after it released statewide coronavirus guidelines for grocery stores.\nNewsom signed an executive order Thursday requiring large agricultural businesses, grocery chains and other food businesses to provide two weeks of paid sick leave to full-time workers who are considered essential during the virus, on top of whatever leave they already have.\n“We don’t want you going to work if you’re sick,” Newsom said.\nMeanwhile, U.S. health officials are under increasing pressure to publicly track coronavirus infections and deaths in nursing homes amid criticism they have not been transparent about the scope of outbreaks across the country.\nAn Associated Press tally from media reports and state health departments indicates at least 5,346 deaths have been linked to coronavirus in nursing homes and long-term care facilities nationwide as of Thursday.\nElsewhere in California, 13 people died in an outbreak that infected nearly 70 residents and staff at Gateway Care and Rehabilitation Center in Hayward in the San Francisco Bay Area. The Alameda County district attorney launched a criminal investigation into patient deaths at the facility, which was previously cited by state regulators for insufficient staff.\nAfter virus cases were discovered at Magnolia Rehabilitation & Nursing Center in Riverside, so many staff members failed to show up for work that county officials evacuated residents. In Los Angeles County at least 133 people who lived in nursing homes or skilled nursing facilities have died from the virus.\nNewsom previously said the state would train and deploy 600 nurses to support compliance with COVID-19 guidance at the state’s nearly 8,700 skilled nursing and residential care facilities. Visits to the facilities already have been sharply restricted.\nStill, Newsom said California is seeing signs of improvement.\n“You have successfully bent, and arguably flattened, the curve in the state of California,” he said. But, “we continue to need to maintain our vigilance.”\n___\nAssociated Press writers Amy Taxin in Santa Ana and John Antczak in Los Angeles contributed to this story.", "url": "https://apnews.com/49e0e83dcecc742e95c3878535e7c41e"}