{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:20:12", "date_modify": "2020-05-04 20:20:12", "date_publish": "2020-04-28 16:04:36", "description": "“Lawmakers planning future relief packages can’t forget about the women trapped at home with their abusers,” said one advocate.", "filename": "entry_domestic-violence-victims-covid-19-bill_n_5ea8414cc5b6b347a3889f47_1588623612.html", "image_url": "https://img.huffingtonpost.com/asset/5ea86a863000009a11155101.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_domestic-violence-victims-covid-19-bill_n_5ea8414cc5b6b347a3889f47_1588623612.html", "title": "Congress Urged To Protect Domestic Violence Victims In Next COVID-19 Bill", "title_page": "Congress Urged To Protect Domestic Violence Victims In Next COVID-19 Bill | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "The National Coalition Against Domestic Violence and Everytown for Gun Safety are calling on Congress to include protections for domestic violence victims in the next coronavirus relief bill.\nFor over a month, governors in most states have advised the public to remain at home to curb the spread of the virus and stay safe. But for those in abusive relationships, home presents its own dangers. About four women a day are killed by intimate partners, most often using a gun.\nWhile it is notoriously hard to measure domestic abuse rates due to underreporting, experts warn that this kind of violence has likely increased during the pandemic as victims are isolated with their abusers and support services are impaired. Many expect to see a rise in reported cases once stay-at-home orders are lifted and victims can seek help more easily.\nOn Tuesday, the two advocacy organizations released a slew of recommendations for the next coronavirus relief legislation, which Congress is drafting now. Chief on the list of demands is emergency funding for local hotlines and shelters providing direct services to victims.\n“Lawmakers planning future relief packages can’t forget about the women trapped at home with their abusers as stress levels continue to rise,” said Ruth Glenn, CEO of the National Coalition Against Domestic Violence. “I think when restrictions are relaxed, to whatever degree, we will begin to see those survivors who have been cloistered begin to report.”\nASSOCIATED PRESS Advocates warn that domestic violence is increasing as the nation is stuck at home. (AP Photo/Mark Tenally)\nShelters are already overwhelmed by the challenge of housing victims while adhering to social distancing protocols, she said. Some have had to reduce occupancy and put up victims in hotel rooms. At the same time, they’ve faced the additional costs of buying protective equipment for staff.\nCongress has passed four relief bills since the outbreak began. The CARES Act, a roughly $2 trillion emergency aid package, included funding for the National Domestic Violence Hotline and $45 million for programs that provide emergency housing and shelter to domestic violence victims. But advocates say much more is needed to support victims safely.\n“The local hotlines are often the first stop for survivors, and those folks are truly overwhelmed,” Glenn said.\nThe groups also requested emergency funding for courts across the country to ensure that victims can obtain or renew protective orders via telephone or videoconference. Since the crisis began, many courthouses have shuttered or postponed in-person hearings. While most courts are continuing to issue protective orders, the process has been delayed by limited staffing and social distancing policies, Glenn said.\nAdditional funding can also help local courts in executing firearm surrender orders, she said, which can save lives. In some states, a person subject to a domestic violence protective order is not allowed to own guns, but the courts must order them removed.\nGun sales have surged during the pandemic, raising public health concerns. According to a New York Times analysis, Americans bought about two million guns in March. In many states, gun stores have been deemed “essential” services.\nFirearms and domestic violence are a toxic mix. Research has found that an abuser with access to a firearm is five times more likely to kill their victim. Guns are also a potent and effective form of control, used to intimidate and threaten family members.\n“Right now, we’re seeing two frightening trends that ― when combined ― create a recipe for disaster for domestic violence victims,” said Shannon Watts, founder of Moms Demand Action. “The surge of gun sales nationwide could mean more convicted domestic abusers have easy access to guns. Sadly, the Senate and too many state legislatures have failed to pass legislation that disarms stalkers and dating partners. At the same time, shelter-in-place orders are keeping victims quarantined with few places to go for help.”\nEverytown for Gun Safety and the National Coalition Against Domestic Violence recommended that Congress close the so-called Charleston loophole, which allows licensed gun dealers to complete some gun sales before required background checks have been done. Under current federal law, people who buy a gun from a licensed dealer have to go through a background check. The FBI has three days to process this check. But if it doesn’t finish in time, gun dealers can sell the firearm anyway.\n“Background checks involving domestic violence convictions often take the longest of any prohibiting category,” Watts said. “Our concern is that law enforcement agencies won’t be able to complete each background check and then guns will get transferred to convicted domestic abusers.”\nThe demands from Everytown for Gun Safety and the National Coalition Against Domestic Violence echo recommendations made by over 100 victim services organizations in a letter to House and Senate leadership sent earlier in April.\n“We’re at this unique moment in time where the economic stress is hitting everyone and it’s hitting our most vulnerable citizens, as you would expect, the worst,” said Deborah Vagins, president and CEO of the National Network to End Domestic Violence. “Congress needs to make sure that they are protecting survivors of domestic violence and sexual assault, consciously and intentionally in the next COVID bill.”\nNeed help? In the U.S., call 1-800-799-SAFE (7233) for the National Domestic Violence Hotline or text LOVEIS to 22522.", "url": "https://www.huffpost.com/entry/domestic-violence-victims-covid-19-bill_n_5ea8414cc5b6b347a3889f47"}