{"authors": [], "date_download": "2020-05-04 20:16:03", "date_modify": "2020-05-04 20:16:03", "date_publish": "2020-04-16 16:18:25", "description": "LITTLE ROCK, Ark. (AP) — Republican state Sen. Jimmy Hickey was elected Thursday as the next leader of the the Arkansas Senate. The majority-Republican Senate elected the Texarkana lawmaker...", "filename": "_fcd1b63b73fc1e4348e523eac72dd220_1588623363.html", "image_url": "https://storage.googleapis.com/afs-prod/media/32db01dac8f344bf9ca1a5fadcc7bf65/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fcd1b63b73fc1e4348e523eac72dd220_1588623363.html", "title": "GOP Sen. Jimmy Hickey elected next leader of Arkansas Senate", "title_page": "GOP Sen. Jimmy Hickey elected next leader of Arkansas Senate", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Feb. 10, 2015, file photo Sen. Jimmy Hickey, R-Texarkana, appears at the Arkansas state Capitol in Little Rock, Ark. Sen. Hickey has been elected to serve as the next leader of the Arkansas Senate, Thursday, April 16, 2020. (AP Photo/Danny Johnston File)\nFILE - In this Feb. 10, 2015, file photo Sen. Jimmy Hickey, R-Texarkana, appears at the Arkansas state Capitol in Little Rock, Ark. Sen. Hickey has been elected to serve as the next leader of the Arkansas Senate, Thursday, April 16, 2020. (AP Photo/Danny Johnston File)\nLITTLE ROCK, Ark. (AP) — Republican state Sen. Jimmy Hickey was elected Thursday as the next leader of the the Arkansas Senate.\nThe majority-Republican Senate elected the Texarkana lawmaker to serve as its president pro tempore starting in 2021. Hickey will succeed current Senate President Jim Hendren, who has served since 2019.\nHickey ran against Republican Sen. Bart Hester for the post. Hickey was elected by secret ballot and the number of votes he won in the 35-member Senate was not announced.\nHickey represents District 11, which includes Texarkana, and has served in the state Senate since 2013. He was elected as lawmakers wrapped up a session focused on the state’s budget amid the coronavirus outbreak.", "url": "https://apnews.com/fcd1b63b73fc1e4348e523eac72dd220"}