{"authors": ["Evan Perez", "David Shortell"], "date_download": "2020-05-04 16:11:45", "date_modify": "2020-05-04 16:11:45", "date_publish": "2020-04-03 02:17:40", "description": "The Health and Human Services Department said Thursday it had distributed some 192,000 N95 respirator masks and a large haul of other scarce medical supplies that the FBI had seized during the arrest of a Brooklyn man.", "filename": "2020_04_02_politics_hhs-red_f7762ca9565707374c9d774e59c0747c_index_1588608705.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200323114255-3m-n95-mask--stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_hhs-red_f7762ca9565707374c9d774e59c0747c_index_1588608705.html", "title": "HHS redistributes medical supplies seized from seller suspected of hoarding", "title_page": "HHS redistributes medical supplies seized from seller suspected of hoarding - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Health and Human Services Department said Thursday it had distributed some 192,000 N95 respirator masks and a large haul of other scarce medical supplies that the FBI had seized during the arrest of a Brooklyn man.\nBaruch Feldheim, 43, was arrested Monday after he allegedly coughed on FBI agents and told them he had the coronavirus. Prosecutors alleged in court documents that Feldheim sold the N95 masks to doctors and nurses at inflated prices; in one instance at as much as a 700% markup.\nThey're now being distributed to health care workers in New York and New Jersey. The department used its authority under the Defense Production Act to make the move.\nJustice Department prosecutors in Newark charged Feldheim with assaulting federal officers and making false statements to law enforcement.\nCNN has reached out to Feldheim's attorney for comment.\nFeldheim kept the items in a repair shop in Irvington, New Jersey, which contained enough materials to outfit an entire hospital, a doctor who purchased masks from Feldheim told authorities, according to court documents.\nFBI agents, as part of the Justice Department's Covid-19 Hoarding and Price Gouging Task Force, seized the items. In addition to the N95 masks, the haul included 598,000 medical-grade gloves, 130,000 surgical and other masks, surgical gowns, disinfectant towels, particulate filters and bottles of hand sanitizer and spray disinfectants, the Justice Department and HHS said in a press release.\nThe release on Thursday doesn't identify Feldheim but law enforcement officials briefed on the investigation confirmed his identity.\n\"It's the most un-American thing I can think of right now, in a time of crisis, for anybody to take materials that they know are needed on the front line and take them out of the supply chain, hide them and try to sell them at a markup,\" said Craig Carpenito, the top federal prosecutor in New Jersey, who was tapped by the attorney general last week to lead the task force, in an interview.\nOfficials in Washington and representatives from each of the 93 US attorneys offices across the country compose the task force, which is taking in leads daily and building new investigations, Carpenito said.\nMembers of the task force have had to study the market for personal protective equipment and the Defense Production Act, the Korean War-era law that was invoked by the President last month and gave the Justice Department new authorities to investigate people believed to be hoarding scarce supplies that had been specially designated by the Trump administration.\n\"They have been told to move with due course,\" Carpenito said. \"Speed is a big thing here because we know that the material that is being hoarded is something that is desperately needed.\"\nTheir first case was sparked by an interview a New Jersey doctor gave to NBC News last month, describing how he'd had to resort to buying protective equipment on the black market at an exorbitant price.\nInvestigators immediately approached the doctor, who connected them with another witness and a WhatsApp group where the sales were being facilitated, Carpenito said.\nThe seized supplies are described in court documents: dozens of pallets of medical supplies stacked in a New Jersey auto repair shop.\nWhen FBI agents approached Feldheim at his home on Sunday, the Justice Department alleges, he lied about owning large quantities of the supplies and selling them directly. He also allegedly coughed on the agents and later told them that he had coronavirus, according to a criminal complaint.\nWhile Feldheim faces only the assault and lying charges, Carpenito said prosecutors are still investigating and considering charges of hoarding and price gouging under the Defense Production Act.\nHHS said it used its Defense Production Act authority to take possession of the items for the US government and will pay Feldheim the market value. HHS said it is redistributing the seized supplies to state health agencies in New York and New Jersey, where officials have pleaded for help to secure critical medical supplies amid the pandemic.\n\"This is the first of many such investigations that are underway,\" Peter Navarro, DPA policy coordinator and assistant to the President, said in a statement.", "url": "https://www.cnn.com/2020/04/02/politics/hhs-redistributing-seized-medical-supplies/index.html"}