{"authors": ["Nicole Chavez", "Rosa Flores", "Sara Weisfeldt"], "date_download": "2020-05-04 16:55:36", "date_modify": "2020-05-04 16:55:36", "date_publish": "2020-04-09 02:18:07", "description": "A former passenger of the Costa Luminosa is suing the ship's operator, claiming the company put more than 2,000 people at risk by failing to warn them about a potential coronavirus exposure.", "filename": "2020_04_08_us_costa-cruises-coronavirus-lawsuit_index_1588611336.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408182518-costa-luminosa-cruise-ship-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_us_costa-cruises-coronavirus-lawsuit_index_1588611336.html", "title": "Costa Cruises passenger sues company over alleged mishandling of coronavirus response", "title_page": "Costa Cruises passenger sues company over alleged mishandling of coronavirus response - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A former passenger of the Costa Luminosa is suing the ship's operator, claiming the company put more than 2,000 people at risk by failing to warn them about a potential coronavirus exposure.\nPaul Turner of Wisconsin filed a federal class action lawsuit on Tuesday against Costa Cruises, a cruise line owned by Carnival Corporation, in the United States District Court for the Southern District of Florida in Miami.\nTurner was among thousands of passengers and crew members aboard the cruise during separate journeys in late February and March.\nAt least three passengers have died after contracting coronavirus and numerous others, including crew members, have tested positive, according to the cruise line's previous statements and CNN reporting.\nTurner boarded the ship in Fort Lauderdale, Florida, on March 5. He did not test positive for the novel coronavirus, his attorney said.\nRead More", "url": "https://www.cnn.com/2020/04/08/us/costa-cruises-coronavirus-lawsuit/index.html"}