{"authors": ["Diarlei Rodrigues", "David Biller"], "date_download": "2020-05-04 20:19:56", "date_modify": "2020-05-04 20:19:56", "date_publish": "2020-04-08 04:00:40", "description": "RIO DE JANEIRO (AP) — Rio de Janeiro’s samba schools usually spend the year furiously sewing costumes for the city's blowout Carnival celebration. Now, nimble fingers are working to protect lives...", "filename": "_5dcf410c87e4e599082340573a8a0a02_1588623596.html", "image_url": "https://storage.googleapis.com/afs-prod/media/54e1bb497c5a4a0b855476e06deeff34/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5dcf410c87e4e599082340573a8a0a02_1588623596.html", "title": "Rio samba schools start sewing scrubs in coronavirus effort", "title_page": "Rio samba schools start sewing scrubs in coronavirus effort", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Workers from the Vila Isabel samba school make scrubs, for medical workers to wear during the new coronavirus pandemic in Rio de Janeiro, Brazil, Tuesday, April 7, 2020. Samba schools that a spend all year making Carnival costumes have turned their sewing machines to a different purpose, making scrubs and face masks for medical workers. (AP Photo/Silvia Izquierdo)\nWorkers from the Vila Isabel samba school make scrubs, for medical workers to wear during the new coronavirus pandemic in Rio de Janeiro, Brazil, Tuesday, April 7, 2020. Samba schools that a spend all year making Carnival costumes have turned their sewing machines to a different purpose, making scrubs and face masks for medical workers. (AP Photo/Silvia Izquierdo)\nRIO DE JANEIRO (AP) — Rio de Janeiro’s samba schools usually spend the year furiously sewing costumes for the city’s blowout Carnival celebration. Now, nimble fingers are working to protect lives instead, making medical outfits for hospital workers who face a surge of coronavirus patients.\nDr. Wille Baracho on Tuesday carried rolls of fabric into the Unidos de Padre Miguel samba school’s workshop in the Vila Vintem favela. Inside, seamstresses perched on plastic chairs busily transformed beige and pale yellow fabric into medical wear.\nThe initiative started with Baracho and one of his colleagues at a nearby hospital emergency room where they have seen a shortage of materials. Both happen to sit on Padre Miguel’s board and saw a chance to redirect labor. The city joined in, donating thousands of yards of fabric, and the seamstresses set to work Friday.\n“We have some friends who died already, some who are on leave or sick with the disease,” Baracho said, adding that he has found it more fulfilling to produce medical garb than the normal glittery costumes. “I think everyone here would say that. Carnival is a different happiness: fun, a pleasure. This is a mission.”\nThe Unidos da Vila Isabel samba school joined the effort Tuesday, with two seamstresses getting to work in a warehouse. Behind them, huge blue and green feather headdresses sat on the floor.\nMore will start sewing soon, both from Vila Isabel and elsewhere as top samba schools across the city are expected to sign on, said Eneida Reis, executive director of assistance at RioSaude, a public company that manages municipal health units.\nEvery willing hand is welcome. At just a single municipal hospital treating COVID-19 patients, doctors and nurses can go through 2,000 sets of scrubs every day, according to city officials.\nIt’s not Rio’s first move to channel Carnival spirit toward combating the coronavirus. The parade grounds where samba schools compete, known as the Sambadrome, has started sheltering homeless people who are considered especially vulnerable during the outbreak.\nRio has Brazil’s second-biggest cluster of COVID-19 patients, with 1,250 cases, plus a few hundred more in the surrounding metropolitan area, the state health secretariat says.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. But it can result in far more severe illness, including pneumonia and death, for some, especially older adults and people with existing health problems.\nAt the Padre Miguel workshop, Jucelia Abreu and her fellow seamstresses feed fabric through their machines and snip at threads. Others from the samba school are doing the same at home. Together, the team churns out some 450 medical outfits each day.\n“The directors asked us if we would be willing to volunteer, and I accepted, because it’s very gratifying to help the people,” Abreu said through a face mask. “We have to help.”", "url": "https://apnews.com/5dcf410c87e4e599082340573a8a0a02"}