{"authors": ["Yuras Karmanau"], "date_download": "2020-05-04 20:25:21", "date_modify": "2020-05-04 20:25:21", "date_publish": "2020-04-20 13:50:01", "description": "MINSK, Belarus (AP) — Schools reopened Monday in Belarus following an extended spring break, but authorities allowed parents to keep their children at home even though the government has steered...", "filename": "_3e53f7e4d840375c70f62847f968ad43_1588623921.html", "image_url": "https://storage.googleapis.com/afs-prod/media/dd1c3a559afc485fa85bcc5b3b71e3d8/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3e53f7e4d840375c70f62847f968ad43_1588623921.html", "title": "Belarus reopens schools as leader rejects 'coronapsychosis'", "title_page": "Belarus reopens schools as leader rejects 'coronapsychosis' ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this photo taken Sunday, April 19, 2020, Belarusian President Alexander Lukashenko, centre, with his son Nikolai, right, talks with believers during the Orthodox Easter service at a church in the village of Malye Lyady outskirts Minsk, Belarus. Schools reopened Monday in Belarus following an extended spring break, but authorities allowed parents to keep their children at home even though the country specifically steered clear of closures and restrictions on public movement during the coronavirus pandemic. (Nikolai Petrov/Pool Photo via AP)\nIn this photo taken Sunday, April 19, 2020, Belarusian President Alexander Lukashenko, centre, with his son Nikolai, right, talks with believers during the Orthodox Easter service at a church in the village of Malye Lyady outskirts Minsk, Belarus. Schools reopened Monday in Belarus following an extended spring break, but authorities allowed parents to keep their children at home even though the country specifically steered clear of closures and restrictions on public movement during the coronavirus pandemic. (Nikolai Petrov/Pool Photo via AP)\nMINSK, Belarus (AP) — Schools reopened Monday in Belarus following an extended spring break, but authorities allowed parents to keep their children at home even though the government has steered clear of closures and restrictions on public movement amid the country’s expanding coronavirus outbreak.\nBelarusian President Alexander Lukashenko, who has ruled the ex-Soviet nation with an iron hand for more than a quarter century, ordered classes to resume at the nation’s 3,067 schools after the regular one-week break was prolonged by two additional weeks.\nLukashenko has consistently dismissed concerns about the new virus and lockdowns imposed elsewhere in Europe as “coronapsychosis.” Factories, stores and restaurants in Belarus conduct business as usual, and spectators fill the stands at sports events.\nHundreds of thousands of Orthodox believers flocked to churches in Belarus on Sunday to celebrate Easter, a sharp contrast with reserved Orthodox Easter observances in other countries that banned public services. Lukashenko himself attended the services, accompanied by his 15-year-old son.\nThe number of people known to be infected in the nation of 10 million surged by nearly one-third to 6,264 since Friday, including 51 deaths. Belarus now has more confirmed virus cases than neighboring Ukraine, which has four times as many people.\nMinsk resident Olga Naumenko said she would keep her daughter and son at home for at least the next two weeks.\n“If the government doesn’t think about us, I must take care of my children myself,” she said. “I won’t shut my eyes to that and risk my children after people crowded at Easter services attended by the president. We fear a surge in infections.”\nOfficials did not explicitly cite public health as the reason schools stayed closed for three weeks, although it was understood. Lukashenko said he opposed keeping schools shut but favored giving parents freedom to decide what is best for their children.\nEducation Minister Igor Karpenko said only 40% percent of Belarus’ 960,000 schoolchildren were expected to show up at school in coming days. “We aren’t going to force anyone,” he said, adding that students could continue their studies remotely.\nOnly 7 of 28 first graders attended classes at School No. 3 in Minsk on Monday.\n“We asked parents to give children antiseptics and bottles with water and asked them to come to collect them earlier,” teacher Natalia Nadolskaya said.\nFor Saturday, the government of Belarus announced a mass community clean-up event in keeping with a Soviet-era tradition that will be attended by hundreds of thousands of state employees despite the growing coronavirus outbreak.", "url": "https://apnews.com/3e53f7e4d840375c70f62847f968ad43"}