{"authors": ["Brian Melley"], "date_download": "2020-05-04 20:22:15", "date_modify": "2020-05-04 20:22:15", "date_publish": "2020-04-15 01:14:48", "description": "LOS ANGELES (AP) — Gov. Gavin Newsom’s plan to eventually ease stay-at-home restrictions across California depends on widespread coronavirus testing that is still ramping up across the state and...", "filename": "_fa590e25eafe683eeade36168a7f951e_1588623735.html", "image_url": "https://storage.googleapis.com/afs-prod/media/6ecc4503d301467bbaeae7f175107b57/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fa590e25eafe683eeade36168a7f951e_1588623735.html", "title": "Ramped-up coronavirus testing key to reopening California", "title_page": "Ramped-up coronavirus testing key to reopening California", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "People wearing masks walk past a mural depicting a coronavirus theme during the COVID-19 pandemic Tuesday, April 14, 2020, in Los Angeles. California Gov. Gavin Newsom on Tuesday unveiled an outline for what it will take to lift coronavirus restrictions in the nation's most populous state, asking more questions than answering them as he seeks to temper the expectations of a restless, isolating public. (AP Photo/Marcio Jose Sanchez)\nPeople wearing masks walk past a mural depicting a coronavirus theme during the COVID-19 pandemic Tuesday, April 14, 2020, in Los Angeles. California Gov. Gavin Newsom on Tuesday unveiled an outline for what it will take to lift coronavirus restrictions in the nation's most populous state, asking more questions than answering them as he seeks to temper the expectations of a restless, isolating public. (AP Photo/Marcio Jose Sanchez)\nLOS ANGELES (AP) — Gov. Gavin Newsom’s plan to eventually ease stay-at-home restrictions across California depends on widespread coronavirus testing that is still ramping up across the state and has been hampered by supply shortages, long waits for results and even a lack of data.\nWithout giving a timetable for when the state might begin a crawl back toward normal, Newsom unveiled the outlines of a plan Tuesday contingent on testing everyone with symptoms of the virus and being able to contact family members and friends they may have exposed.\nThat may be a tall order in a state that has lagged in getting a robust testing system in place, never mind having public health officials track down all those they may have infected and ordering those people to keep away from others for up to two weeks.\n“I think counties are probably overwhelmed,” said Dr. Yvonne Maldonado, an epidemiologist and infectious disease specialist at Stanford Medicine. “That’s why we need to get to a point where this epidemic is under control. It’s very hard to do contact tracing with this number of infected people.”\nTesting has been problematic across the U.S. — with a lack of swabs needed to collect specimens, chemicals needed to produce laboratory results and the protective masks, gloves and other clothing worn by people who administer the tests. California has faced additional challenges due to a backlog of test results and a lack of data from some labs that weren’t initially reporting negative results, leaving public health officials in the dark about how many had been tested.\nFaced with testing problems and a backlog that equaled two-thirds of all tests conducted at one point, Newsom named a special task force to help expand and speed up testing across the state and make sure everyone can get tested regardless of their location.\nDr. Mark Ghaly, secretary of California Health and Human Services, said the goal is to be able to test tens of thousands of people per day across the state — not just the sickest — by the end of April.\n“Once we hit that level and we know that individuals who have symptoms can get tested and the results available rapidly, we’ll be able to think about modifying these orders,” Ghaly said. “So, yes, testing becomes a very focal point, something we improve as we go along.”\nIn order to ease restrictions, the number of people testing positive should drop and new hospitalizations should fall, said Dr. George Rutherford, a professor of epidemiology at the University of California, San Francisco. Nursing homes, jails and homeless shelters should screen aggressively for the virus and isolate the infectious together.\nPeople might be able to return to work sooner after testing negative for the virus or testing positive for the antibodies to the virus, which would indicate they were previously infected and are likely immune. Workers in more sensitive occupations could be required to pass both tests, Rutherford said.\nPaula Cannon, a professor of immunology at the University of Southern California school of medicine, said testing is a “massive logistical problem” worldwide, but thinks California can meet its needs if it can overcome the shortage of testing supplies in high demand everywhere.\nShe said a larger challenge will be getting Americans, famous for valuing their freedom and privacy, to willingly show up for testing and if found to have the virus, agree to self-quarantine and offer the names of family and friends they had contact with.\nThe state also needs to figure out how to test people without insurance and how to get compliance with quarantine orders if they’re afraid they’ll lose their job while staying home.\nCannon said she hoped Newsom was being advised by psychologists, as well as scientists, about what measures would be acceptable to Californians.\n“How do we bring people to that process with trust and also kind of understanding that there isn’t a magic wand here? We can’t go back to normal straight away, there’s still going to be quite a high cost going forward,” Cannon said. “This is kind of the best we can do and ultimately it’s going to suck.”", "url": "https://apnews.com/fa590e25eafe683eeade36168a7f951e"}