{"authors": ["Por Beth Harris"], "date_download": "2020-05-04 20:24:58", "date_modify": "2020-05-04 20:24:58", "date_publish": "2020-04-09 18:36:37", "description": "LOS ÁNGELES (AP) — Los Clippers de Los Ángeles siguen reuniéndose para entrenar juntos mientras continúa la suspensión de partidos de la NBA, y lo hacen a través de videoconferencias. Hasta...", "filename": "_079dfcc52b0f4155b9fb3ed5a3a14651_1588623898.html", "image_url": "https://storage.googleapis.com/afs-prod/media/5c97c6479a8a4122ae77d78c5be69da5/2728.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_079dfcc52b0f4155b9fb3ed5a3a14651_1588623898.html", "title": "Los Clippers entrenan juntos, por videoconferencias", "title_page": "Los Clippers entrenan juntos, por videoconferencias", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nLOS ÁNGELES (AP) — Los Clippers de Los Ángeles siguen reuniéndose para entrenar juntos mientras continúa la suspensión de partidos de la NBA, y lo hacen a través de videoconferencias.\nHasta 10 jugadores a la vez se presentan para realizar ejercicios con el personal del equipo de rendimiento desde que la liga ordenó el cierre de las instalaciones de entrenamiento debido a la pandemia de coronavirus.\nTambién han estado usando equipo de ejercicio adaptado a las necesidades de cada jugador y que suministró el equipo.\n“Se están desafiando unos a otros, muchas habladurías”, dijo el entrenador Doc Rivers en una conferencia telefónica con reporteros. “Cuando salgamos de esto tendremos muchas historias graciosas sobre observarse entrenando unos a otros”.\nRivers cree que cuando la liga eventualmente vuelva habrá un gran nivel de competencia como resultado de la pausa que le ha permitido a jugadores como Kawhi Leonard y Paul George a entrenar en un nivel que no pudieron durante la pretemporada cuando tuvieron que lidiar con lesiones.\n“Si volvemos y mantenemos el ritmo, ya no tendrán dolores y estarán saludables”, dijo Rivers. “Si podemos volver y los chicos recuperan el ritmo a tiempo, eso será la clave. Podría ser la mejor postemporada en la historia”.\nLos Clippers habían ganado ganar nueve de sus últimos 10 juegos, para quedar con foja de 44-20, cuando la temporada fue interrumpida, después que Rudy Gobert del Jazz de Utah diera positivo por el nuevo coronavirus.\n“Los últimos 10 encuentros no estábamos convirtiendo en los Clippers”, dijo Rivers. “Estábamos jugando de una forma impecable con Kawhi y PG y no se veía forzado. Realmente creía que íbamos a tener una racha increíble al final y desafortunadamente todo se detuvo”.\nRivers indicó que se mantiene en contacto con su personal y con tres o cuatro jugadores todos los días, normalmente por teléfono o videollamadas. Le ha advertido al equipo que si la temporada se reanuda no será una situación normal.\n“He intentado hacerle entender a los muchachos dos cosas, que nuestra meta no ha cambiado y que no podemos usar lo que sea que ocurra cuando volvamos como una excusa para no ganar”, dijo.\nLawrence Frank, presidente de operaciones del equipo, se encuentra en aislamiento en Nueva Jersey con su esposa e hijos. Su madre y sus suegros están cerca.\n“Hay mucha animosidad y ansiedad”, dijo en la llamada.\nFrank indicó que en lugar de mensajes de texto hay más llamadas telefónicas y videollamadas, “pues estamos buscando una conexión”.", "url": "https://apnews.com/079dfcc52b0f4155b9fb3ed5a3a14651"}