{"authors": ["Mallory Simon", "Melissa Dunst Lipman"], "date_download": "2020-05-04 16:59:06", "date_modify": "2020-05-04 16:59:06", "date_publish": "2020-04-09 00:13:59", "description": "Charlotte Figi, a child with a catastrophic type of epilepsy who went on to inspire a CBD movement, passed away Tuesday at age 13.", "filename": "2020_04_08_health_charlotte-figi-cbd-marijuana-dies_index_1588611546.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408124033-01-charlotte-figi-facebook-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_health_charlotte-figi-cbd-marijuana-dies_index_1588611546.html", "title": "Charlotte Figi, the girl who inspired a CBD movement, has died at age 13", "title_page": "Charlotte Figi, the girl who inspired a CBD movement, has died at age 13 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Charlotte Figi, a child with a catastrophic type of epilepsy who went on to inspire a CBD movement, passed away Tuesday at age 13.\nCharlotte had recently been hospitalized due to pneumonia, breathing problems and seizures. She was treated as a likely case of Covid-19, her mother, Paige Figi, said Wednesday, although she tested negative for the virus.\n\"Charlotte is no longer suffering. She is seizure-free forever,\" a family friend wrote on Paige Figi's Facebook page, announcing Charlotte's death. \"Thank you so much for all of your love.\"\nCharlotte became a symbol of the possibilities of CBD after CNN Chief Medical Correspondent Dr. Sanjay Gupta told her story in the documentary \"Weed.\" In the film, Charlotte was shown to be a playful child who was overcome by horrific seizures, which were quelled with Charlotte's Web, a marijuana strain named in her honor.\nCharlotte had Dravet syndrome, a rare form of epilepsy which was not controlled by medication. The Stanley brothers, marijuana growers in Colorado, were crossbreeding a strain of marijuana high in CBD and low in THC, its psychoactive ingredient. After Charlotte began taking the CBD oil, there was a sharp decline in seizures. She began to play, eat and make connections like she hadn't before.\nRead More", "url": "https://www.cnn.com/2020/04/08/health/charlotte-figi-cbd-marijuana-dies/index.html"}