{"authors": ["Thomas Beaumont"], "date_download": "2020-05-04 20:32:02", "date_modify": "2020-05-04 20:32:02", "date_publish": "2020-04-20 19:22:42", "description": "DES MOINES, Iowa (AP) — Door-knocking? Over. Local party activity? Some Facebook traffic, if that. Across an arc of vital swing states, the coronavirus has put politics on an uneasy...", "filename": "_40dab7b2ecb82ee9ca5e1f54878c7bd1_1588624322.html", "image_url": "https://storage.googleapis.com/afs-prod/media/2551f27d834a4dd98e168f37e6d10a8f/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_40dab7b2ecb82ee9ca5e1f54878c7bd1_1588624322.html", "title": "Battleground power plays rage as everyday politics go quiet", "title_page": "Battleground power plays rage as everyday politics go quiet", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Jan. 29, 2020, file photo Michigan Gov. Gretchen Whitmer delivers her State of the State address to a joint session of the House and Senate at the state Capitol in Lansing, Mich. Across an arc of vital swing states, the coronavirus has put politics on an uneasy pause. The tension is most pronounced in Michigan, where the outbreak is far worse than in any of the other northern political battlegrounds. (AP Photo/Al Goldis, File)\nFILE - In this Jan. 29, 2020, file photo Michigan Gov. Gretchen Whitmer delivers her State of the State address to a joint session of the House and Senate at the state Capitol in Lansing, Mich. Across an arc of vital swing states, the coronavirus has put politics on an uneasy pause. The tension is most pronounced in Michigan, where the outbreak is far worse than in any of the other northern political battlegrounds. (AP Photo/Al Goldis, File)\nDES MOINES, Iowa (AP) — Door-knocking? Over.\nLocal party activity? Some Facebook traffic, if that.\nAcross an arc of vital swing states, the coronavirus has put politics on an uneasy pause.\nInstead, political fights among state leaders from Iowa to Pennsylvania over the handling of the pandemic’s impact are raging as it spreads over this electoral heartland.\nProtecting public health versus restarting the economy, along with arguments over the limits of executive authority, have taken the place of the national political debate typical of presidential campaigns at this point.\nThey reflect, unlike the political armistice that followed the 2001 terrorist attacks, a willingness to politicize this crisis. It’s one more clear measure of a polarized era.\n“Yes, politicos and pols will always have November on their mind,” said Iowa GOP strategist John Stineman. “But, in my mind, what we are seeing right now is more about each base criticizing the other side for being wrong, a product of the political environment we have allowed to take root.”\nIowa, Michigan, Pennsylvania and Wisconsin, where Democratic nominees had won regularly for more than 30 years, tipped to Trump in 2016, sealing his victory with their combined 52 electoral votes.\nWhile politics have slipped to an afterthought for most Americans behind a toll of mounting coronavirus deaths, lost wages and closed schools, the campaign buzz of a little more than a month ago has silenced.\nIn swing-voting Bay County, Michigan, Democratic activity had been humming, as it was statewide before the March 10 presidential primary, when participation jumped by 32% over 2016.\nA week later, Bay City’s St. Patrick’s Day parade — the state’s largest and a Democratic tradition — was canceled. So was the county’s Democratic fundraising dinner, which was set to feature Gov. Gretchen Whitmer.\n“I see chatter on social media. But as far as activity, it’s pretty much down to nothing,” said Bay County Democratic Chairwoman Karen Tighe.\nIowa canceled Democratic conventions in its 99 counties, a setback after 2018 Statehouse and congressional gains and a yearlong parade of presidential candidates vying for support in the February caucuses.\nRepublican Ron Forsell canceled plans for his fundraiser in Dallas County, Iowa, an emerging suburban battlefront.\n“Politics is going to be there again,” he said. “But raising money now just doesn’t feel right.”\nDemocratic organizer Angela Lang’s door-to-door canvassing in struggling north Milwaukee had to shut down in late March, hurting her ability to reach this pivotal African American bloc before Wisconsin’s April 7 primary.\n“I think for most Americans, politics is taking a major back seat to survival for some and the adjustment to this new normal for most of us,” said former Iowa Gov. Tom Vilsack, a Democrat.\nEven as the virus raged in Pennsylvania, Republicans in Harrisburg pushed through legislation aimed at reversing the shutdown edicts of Democratic Gov. Tom Wolf, painting him as unconcerned with struggling families.\nDuring debate last week, Republican state Sen. John DiSanto said Wolf had forced “1.3 million Pennsylvanians out of work so far, put businesses at risk of permanent closure and imperiled the long-term health of Pennsylvania residents and our economy.”\nDemocrats said that Republicans were trying to throw workers back into the pandemic’s path.\n“Let the world know whose lives are we willing to sacrifice,” Democratic Rep. Jordan Harris of Philadelphia said.\nIn Iowa, Democratic State Auditor Rob Sand has questioned the data Republican Gov. Kim Reynolds is using to justify allowing more freedom of movement than in neighboring states. Reynolds’ aides were quick to point out public affirmation from Dr. Anthony Fauci after the federal government’s top infectious-disease expert praised Reynolds’ actions during a White House event this month.\nThe tension is most pronounced in Michigan, where the outbreak is far worse than in any of the other northern political battlegrounds.\nTwo weeks ago, Republicans sharply trimmed the emergency order Whitmer hoped to extend to June.\n“Michigan’s recovery will take much longer and its economic impact will be much more devastating than it needed to be,” Republican House Speaker Lee Chatfield said.\nDemocrats accused Republicans of racial bias for floating plans to open regions outside the predominantly African American Detroit area.\n“It’s an us-versus-them thing with the rest of the state versus Detroit,” said Amy Chapman, an informal Whitmer adviser. “That’s another dog whistle of sorts.”\nMore than 1,900 people had died in Wayne, Macomb and Oakland counties, the heart of metro Detroit, as of Friday, according to Johns Hopkins University.\nWhitmer’s criticism of the federal response in Michigan devolved into a public tiff with President Donald Trump, who responded by suggesting Vice President Mike Pence, his coronavirus task force leader, not call “the woman from Michigan.” Michigan Democrats echoed Whitmer’s criticism of the federal response to Detroit’s crisis, while GOP figures urged Trump to deescalate tension with the swing-state governor.\nMeanwhile, presumptive Democratic presidential nominee Joe Biden has built little campaign structure across the region. Trump is relying on state GOP headquarters for his operations, though they, too, have been largely empty.\nPro- and anti-Trump groups unaffiliated with the candidates have carried what little presidential campaigning has gone on here. Democrat-backed groups Priorities USA and American Bridge have aired millions of dollars in advertising savaging Trump’s handling of the crisis.\n“Only the die-hards are paying attention to election politics,” Vilsack said. “However, opinions have formed and will continue to form on politics of how the administration is handling the situation.”\n___\nAssociated Press writers Marc Levy in Harrisburg, Pa., and Zeke Miller in Washington contributed to this report.\n___\nThis story was first published on April 19, 2020. It was updated on April 20, 2020, to correct the timing of Whitmer’s declaration. She responded before GOP action, not afterward. It also corrects the timing of Republicans’ trimming the emergency order in Michigan. Republicans trimmed the emergency order two weeks ago, not last week.", "url": "https://apnews.com/40dab7b2ecb82ee9ca5e1f54878c7bd1"}