{"authors": ["Barbara Starr", "Ryan Browne"], "date_download": "2020-05-04 15:59:25", "date_modify": "2020-05-04 15:59:25", "date_publish": "2020-03-31 15:40:17", "description": "The commander of the USS Theodore Roosevelt, a US Navy aircraft carrier where an outbreak of the coronavirus has spread to at least 70 sailors, has warned Navy leadership that decisive action is required to save the lives of the ship's crew.", "filename": "2020_03_31_politics_aircraft-carrier-coronavirus-outbreak_index_1588607965.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327101147-uss-theodore-roosevelt-03182020-super-tease.jpeg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_politics_aircraft-carrier-coronavirus-outbreak_index_1588607965.html", "title": "Commander of aircraft carrier hit by coronavirus outbreak warns Navy 'decisive action' is needed", "title_page": "USS Theodore Roosevelt: Commander of aircraft carrier hit by coronavirus outbreak warns Navy 'decisive action' is needed - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The commander of the USS Theodore Roosevelt, a US Navy aircraft carrier where an outbreak of the coronavirus has spread to at least 70 sailors, has warned Navy leadership that decisive action is required to save the lives of the ship's crew.\n\"We are not at war. Sailors do not need to die. If we do not act now, we are failing to properly take care of our most trusted asset — our Sailors,\" Capt. Brett Crozier wrote in a memo to the Navy's Pacific Fleet, three US defense officials have confirmed to CNN.\n\"The spread of the disease is ongoing and accelerating,\" he added.\n\"Decisive action is required. Removing the majority of personnel from a deployed US nuclear aircraft carrier and isolating them for two weeks may seem like an extraordinary measure,\" he wrote in the memo. \"This is a necessary risk. It will enable the carrier and air wing to get back underway as quickly as possible while ensuring the health and safety of our Sailors. Keeping over 4,000 young men and women on board the TR is an unnecessary risk and breaks faith with those Sailors entrusted to our care.\"\nThe San Francisco Chronicle was first to report on the commander's request for assistance.\nThe commander of US Pacific Fleet declined to say how many sailors aboard the nuclear-powered aircraft carrier had tested positive for the coronavirus , but said that no one had been hospitalized.\n\"What I will tell you is I have no sailors hospitalized, I have no sailors on ventilators, I have no sailors in critical condition, no sailors in an ICU status on the Theodore Roosevelt,\" Adm. John Aquilino told reporters.\nAsked about Crozier's letter, Aquilino said, \"We're welcoming feedback. ... We want to make sure we understand exactly what the leader on the ground needs.\"\n\"We are on the same sheet of music and I am really trying to make it happen more quickly but there are some constraints we are operating around,\" Aquilino said, saying that the ship's captain wanted to see a faster pace than what was currently taking place.\nOne issue delaying the process is the lack of capacity to house, isolate and quarantine sailors in Guam where the ship is currently in port, something the admiral said the Navy was working to mitigate.\nAsked about the letter, Secretary of Defense Mark Esper told CBS Tuesday, \"Well, I have not had a chance to read that letter, read it in detail. Again I'm going to rely on the Navy chain of command to go out there to assess the situation and make sure they provide the captain and the crew all the support they need to get the sailors healthy and the ship back at sea.\"\n\"The commanding officer of the Theodore Roosevelt alerted leadership in the Pacific Fleet on Sunday evening of continuing challenges in isolating the virus,\" a US Navy official told CNN.\n\"The ship's commanding officer advocated for housing more members of the crew in facilities that allow for better isolation,\" the official added.\nA second Navy official said that the number of coronavirus cases on board the aircraft carrier had surpassed 70 as of Tuesday morning, added that the Navy expected that figure to increase.\nThe outbreak seems to be escalating rapidly. A week ago the Pentagon confirmed three sailors on the Roosevelt had tested positive and that number had risen to 25 two days later. Since then the number of cases has almost tripled. On Monday, a US defense official told CNN that a second US aircraft carrier, the USS Ronald Reagan, is also facing a \"handful\" of positive cases.\nActing Navy Secretary Thomas Modly told CNN's John King Tuesday that he was aware of the letter and that the Navy was working to get the sailors off the ship.\n\"I heard about the letter from Capt. Crozier this morning, I know that our command organization has been aware or this for about 24 hours and we have been working actually the last seven days to move those sailors off the ship and get them into accommodations in Guam. The problem is that Guam doesn't have enough beds right now and were having to talk to the government there to see if we can get some hotel space, create tent-type facilities,\" Modly said.\n\"We don't disagree with the (Commanding Officer) on that ship and we're doing it in a very methodical way because it's not the same as a cruise ship, that ship has armaments on it, it has aircraft on it, we have to be able to fight fires if there are fires on board the ship, we have to run a nuclear power plant, so there's a lot of things that we have to do on that ship that make it a little bit different and unique but we're managing it and we're working through it,\" he added.\n\"We're very engaged in this, we're very concerned about it and we're taking all the appropriate steps,\" Modly said.\nHowever, despite the large number of cases aboard, senior US military officials have insisted that the ship is capable of performing its missions.\n\"If that ship had to sail today for combat it's ready to sail right now if it was needed,\" Maj. Gen. Jeff Taliaferro, the vice director for operations for the Joint Staff, told reporters Monday.\n\"The appropriate measures are being taken for folks who have tested positive,\" he added.\nThe carrier is in port on a visit to Guam that the military has said was previously scheduled.\nCrozier struck a more optimistic tone in a post on the ship's Facebook page on Monday, saying the \"Sailors are in good spirits and are facing this new challenge with a level of professionalism that I have come to expect from such an amazing and resilient team.\"", "url": "https://www.cnn.com/2020/03/31/politics/aircraft-carrier-coronavirus-outbreak/index.html"}