{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:17:39", "date_modify": "2020-05-04 20:17:39", "date_publish": "2020-04-29 09:55:10", "description": "The timeline would be more than two months after President Trump first assured the public “anybody” could get tested.", "filename": "entry_fauci-test-may-june_n_5ea91bcfc5b6106b8ecf5e45_1588623459.html", "image_url": "https://img.huffingtonpost.com/asset/5ea91c442200006f0c827d5a.jpeg?cache=m8emcuqrc0&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_fauci-test-may-june_n_5ea91bcfc5b6106b8ecf5e45_1588623459.html", "title": "Dr. Fauci Says U.S. Should ‘Hopefully’ Be Able To Test All Who Need One By June", "title_page": "Dr. Fauci Says U.S. Should ‘Hopefully’ Be Able To Test All Who Need One By June | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Dr. Anthony Fauci, the nation’s top infectious disease expert, said Tuesday the U.S. would hopefully have the capacity to test anyone thought to have the coronavirus “toward the end of May” or the beginning of June, more than two months after President Donald Trump first assured the public “anybody” could get tested.\n“Everyone who needs a test, according to the way we’re approaching the identification, isolation, contact tracing, keeping the country safe and healthy, hopefully we should see that as we get towards the end of May, the beginning of June,” Fauci told CNN’s Jake Tapper. “That’s what I’m being told by the people who are responsible for the testing. I take them for their word.”\n\"Everyone who needs a test, according to the way we're approaching the identification, isolation, contact tracing, keeping the country safe and healthy, that hopefully we should see that as we get towards the end of May, the beginning of June,\" Dr. Anthony Fauci says. pic.twitter.com/R6YJqFTJup — The Lead CNN (@TheLeadCNN) April 28, 2020\nThe U.S. has continuously struggled to test people for the virus since the pandemic first reached the U.S. Trump first told reporters on March 6 that “anybody that wants a test can get a test,” but those assurances were far from true.\nDoctors and hospitals around the country said for weeks they couldn’t get authorization to test patients presenting with symptoms associated with COVID-19 under strict federal guidelines, and medical professionals have continued to report shortages of swabs and reagents needed to conduct them. Governors have also said they lack adequate testing to determine if they can safely move past social distancing or stay-at-home measures.\nFauci said Tuesday that those reports were accurate, noting there had been difficulty in “tests getting to the people who need them,” although he stressed that states and the federal government would need to work in conjunction to fix the issues.\n“If that’s not happening, if we’re not connecting those dots, we need to help them do that,” he said. “We can’t just leave them on their own on the one hand, and the federal government can’t do it by itself on the other hand.”\nMore than 1 million people have tested positive for the virus and more than 58,000 have died. But experts warn those numbers are likely far lower than reality. The Centers for Disease Control and Prevention said Tuesday there were thousands of more deaths in seven states hit hardest by the outbreak than usual, suggesting actual death tolls were much higher than officially reported thus far.\nDespite the statistics, the White House has pushed some parts of the country to reopen and kickstart their economies. Trump once again assured the public Monday that the nation had adequate testing capabilities, saying the government planned to give states enough tests to sample more than 2% of their populations each month (a majority of states are already doing this, according to The Associated Press).\n“Testing is not going to be a problem at all,” Trump said Monday in the Rose Garden.\nResearchers at Harvard estimate the country should be able to test at least 500,000 people per day, or about 15 million a month. Fauci himself has said the U.S. should aim to do 3 million to 4 million per week.\nOn Tuesday, Trump said the U.S. would have the capacity to conduct 5 million tests per day “very soon.” The country currently tests around 200,000 each day.", "url": "https://www.huffpost.com/entry/fauci-test-may-june_n_5ea91bcfc5b6106b8ecf5e45"}