{"authors": ["Charles Riley", "Cnn Business"], "date_download": "2020-05-04 16:51:47", "date_modify": "2020-05-04 16:51:47", "date_publish": "2020-04-08 10:17:27", "description": "Europe's top two economies are contracting at their fastest pace in decades, according to forecasts published Wednesday, underscoring the urgent need for EU officials to agree new measures to support workers and businesses affected by the coronavirus pandemic.", "filename": "2020_04_08_business_germany-france-recession-eurogroup_index_1588611107.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408033506-03-eu-economy-france-germany-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_business_germany-france-recession-eurogroup_index_1588611107.html", "title": "Europe's deep recession piles pressure on EU to agree new relief package", "title_page": "Europe's deep recession piles pressure on EU to agree new relief package  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) Europe's top two economies are contracting at their fastest pace in decades, according to forecasts published Wednesday, underscoring the urgent need for EU officials to agree new measures to support workers and businesses affected by the coronavirus pandemic.\nGermany's top economic research institutes said Wednesday that Europe's biggest economy is likely to shrink by 4.2% this year. It expects a contraction of 1.9% in the first three months of this year, and 9.8% in the current quarter. That would be the sharpest decline since record keeping began in 1970 and more than twice as steep as the most damaging quarter during the global financial crisis\nThe dire prediction came as France's central bank estimated the country's economy shrank by around 6% in the first three months of the year. The central bank said the last contraction of a similar magnitude came in the second quarter of 1968, when weeks of demonstrations and general strikes sharply curtailed economic output.\nEvidence of a severe recession in Germany and France is more bad news for other European countries such as Italy and Spain that have been hardest hit by the pandemic and are suffering even greater economic fallout.\nFinance ministers representing the 19 countries that use the euro currency are struggling to agree new ways to provide support. They suspended negotiations on a new rescue package after 16 hours of talks conducted via video conference, saying they would reconvene on Thursday.\nRead More", "url": "https://www.cnn.com/2020/04/08/business/germany-france-recession-eurogroup/index.html"}