{"authors": ["Krishan Francis"], "date_download": "2020-05-04 20:25:23", "date_modify": "2020-05-04 20:25:23", "date_publish": "2020-04-20 10:03:22", "description": "COLOMBO, Sri Lanka (AP) — Sri Lanka’s election commission on Monday set the country's Parliament elections for June 20, invoking a hitherto unused legal provision to avoid a possible...", "filename": "_25c30d17b34866550dc7578eae39c4e0_1588623923.html", "image_url": "https://storage.googleapis.com/afs-prod/media/2f922d97a0ba479eb4cd7b9bd739c1f1/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_25c30d17b34866550dc7578eae39c4e0_1588623923.html", "title": "Sri Lanka election set for June 20, ending possible crisis", "title_page": "Sri Lanka election set for June 20, ending possible crisis", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Sri Lankan police officer sprays disinfectant on a homeless man before transporting him to an isolation center as a measure to prevent the spread of the new coronavirus during a lockdown in Colombo, Sri Lanka, Friday, April 17, 2020. Sri Lankan authorities claim they have largely managed to prevent community spreading through proper identification and isolation of people who came into contact with COVID-19 patients. (AP Photo/Eranga Jayawardena)\nA Sri Lankan police officer sprays disinfectant on a homeless man before transporting him to an isolation center as a measure to prevent the spread of the new coronavirus during a lockdown in Colombo, Sri Lanka, Friday, April 17, 2020. Sri Lankan authorities claim they have largely managed to prevent community spreading through proper identification and isolation of people who came into contact with COVID-19 patients. (AP Photo/Eranga Jayawardena)\nCOLOMBO, Sri Lanka (AP) — Sri Lanka’s election commission on Monday set the country’s Parliament elections for June 20, invoking a hitherto unused legal provision to avoid a possible constitutional crisis if the country failed to hold the vote because of the coronavirus.\nThe commission had to decide whether to open the polls, which could expose more people to the virus, or let the country plunge into its second constitutional crisis in less than two years.\nRatnajeevan Hoole, one of the three commission members told The Associated Press after the meeting that the commission decided to invoke a section in the Parliamentary Elections Act that allows the panel to issue necessary directions to manage any special or unforeseen circumstances.\nHoole said the date was set considering an increasing coronavirus threat and the inability to organize an election with a limited number of staff allowed to work to maintain social distancing.\nThe commission could postpone the election further if needed, he said.\nSri Lanka reported 33 new infections on Monday, its most in a single day. It now has at least 304 cases, with seven deaths and 98 recoveries.\nThe government on Monday lifted a daytime curfew in many areas of the country, except ones identified as high risk, to restart the economy.\nIn 2018, Sri Lanka came to a standstill for 52 days after then President Maithripala Sirisena sacked his prime minister. The crisis was ended by a Supreme Court decision that restored the prime minister.\nLast month, President Gotabaya Rajapaksa dissolved the opposition-controlled Parliament six months early, hoping his party could win a majority in new elections.\nHe has complained that a 2015 constitutional change curtailed presidential powers and wants a constitutional amendment to strengthen his office, which would require the support of two-thirds of Parliament.\nRajapaksa had announced elections for April 25, but the election commission postponed the vote indefinitely after the coronavirus spread and the government declared an island-wide curfew.\nThe constitution stipulates that a dissolved Parliament must be replaced within three months. The deadline had been June 2.\nRajapaksa previously rejected the election commission’s suggestion that the Supreme Court be asked to help find a solution.\nPrime Minister Mahinda Rajapaksa, the president’s brother, said the commission could not ignore its legal duty to schedule a new election because of “imaginary situations that may or may not come in the coming weeks or months.”\nThe government also rejected suggestions by the opposition that presidential powers be used to recall the dissolved Parliament.\nOpposition parties said an election during the pandemic poses too much risk since candidates typically rely upon large public rallies and door-to-door campaigning.\nHealth authorities say they have managed to keep the spread of the virus under control, limiting its spread within the community through identification and isolation of patients and their contacts.\nAnil Jasinghe, a top health official, said 12 of the country’s 25 districts have not reported any patients and the lockdown could be gradually eased.\n___\nAssociated Press writer Bharatha Mallawarachi contributed to this report.", "url": "https://apnews.com/25c30d17b34866550dc7578eae39c4e0"}