{"authors": ["Mary Clare Jalonick", "Matthew Daly"], "date_download": "2020-05-04 20:26:59", "date_modify": "2020-05-04 20:26:59", "date_publish": "2020-03-27 04:38:26", "description": "WASHINGTON (AP) — President Donald Trump declared that \"I'll be the oversight\" as lawmakers were in the final days of drafting what became a $2.2 trillion rescue plan for American businesses. In...", "filename": "_91bbb26d8557c7d697f757b931089611_1588624019.html", "image_url": "https://storage.googleapis.com/afs-prod/media/3384793984db4fa7933268f57f3398d8/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_91bbb26d8557c7d697f757b931089611_1588624019.html", "title": "Congress locks Trump oversight into $2.2 trillion package", "title_page": "Congress locks Trump oversight into $2.2 trillion package", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "House Speaker Nancy Pelosi of Calif., accompanied by House Minority Leader Kevin McCarthy of Calif., left, House Majority Leader Steny Hoyer of Md., right, and other bipartisan legislators, signs the Coronavirus Aid, Relief, and Economic Security (CARES) Act after it passed in the House on Capitol Hill, Friday, March 27, 2020, in Washington. The $2.2 trillion package will head to head to President Donald Trump for his signature. (AP Photo/Andrew Harnik)\nHouse Speaker Nancy Pelosi of Calif., accompanied by House Minority Leader Kevin McCarthy of Calif., left, House Majority Leader Steny Hoyer of Md., right, and other bipartisan legislators, signs the Coronavirus Aid, Relief, and Economic Security (CARES) Act after it passed in the House on Capitol Hill, Friday, March 27, 2020, in Washington. The $2.2 trillion package will head to head to President Donald Trump for his signature. (AP Photo/Andrew Harnik)\nWASHINGTON (AP) — President Donald Trump declared that “I’ll be the oversight” as lawmakers were in the final days of drafting what became a $2.2 trillion rescue plan for American businesses. In the end, Congress ensured that won’t be the case.\nThe legislation, designed in part to help businesses and corporations hammered by closures due to the coronavirus pandemic, creates multiple layers of accountability for the billions of dollars in loans, grants and direct cash that will soon flow from the federal government. The House passed the bill by voice vote on Friday and Trump immediately signed it.\nThe new oversight system will test the relationship between the White House and Congress, which frayed after Democrats won the House and deteriorated severely during Trump’s impeachment as officials flouted requests for witnesses and documents.\nTrump immediately threw the oversight provisions into question, writing in a signing statement Friday night that the new law contains “several provisions that raise constitutional concerns.″ Trump said a new inspector general intended to monitor spending under the law would not be bound by requirements to report to the Congress ”without delay.”\nHis administration “will continue the practice of treating provisions like these as advisory and non-binding.,” Trump said.\nTrump’s assertion of responsibility for the coronavirus funds came Monday evening as his Treasury secretary, Steven Mnuchin, was on Capitol Hill crafting the package in late-night meetings with Senate Democratic leader Chuck Schumer of New York. Senate Majority Leader Mitch McConnell, R-Ky., and House Speaker Nancy Pelosi, D-Calif., had each introduced their own proposals, and Democrats said the Republican bill wasn’t strong enough, arguing that it would create a “slush fund” for corporations.\nIn the end, the bipartisan final package incorporated much of what Democrats wanted, creating a trio of watchdogs, plus other checks, to try to ensure the money isn’t misused. It establishes an oversight board made up of inspectors general, called the Pandemic Response Accountability Committee, stands up a separate dedicated inspector general position at the Treasury Department and creates a new committee of experts that reports to Congress.\nOther accountability measures include more money for watchdogs in multiple federal agencies and requirements that the administration file detailed reports that analyze the flow of cash as it happens.\n“Whenever you are appropriating over $2 trillion it’s important to ensure the money is spent the way it’s intended,” said Michigan Sen. Gary Peters, the top Democrat on the Senate Homeland Security and Governmental Affairs Committee. Peters helped negotiate the oversight provisions with Schumer and the GOP chairman of the panel, Wisconsin Sen. Ron Johnson.\n“This needs to be outside of politics, that’s the only way it has any credibility,” Peters said.\nBoth Peters and House Oversight and Reform Chairwoman Carolyn Maloney, D-N.Y., suggested lawmakers could consider additional oversight provisions when Congress takes up more legislation to deal with the pandemic.\nMaloney praised the economic relief bill, but said Democrats “think it could go even further to protect American taxpayers, and we are continuing to examine additional options.”\nWatchdog groups that track government spending and oversight said the bill wasn’t perfect, but provides essential resources. Sean Moulton, a senior policy analyst at Project On Government Oversight, said his group is encouraged that there is “more than one lens of accountability” for the businesses that will be receiving the money.\n“We’re pleased that they aren’t putting all of their oversight eggs in one basket,” Moulton said.\nLisa Gilbert, vice president of legislative affairs for the consumer advocacy group Public Citizen, said she believed that Trump’s declaration that he could personally oversee the process likely ensured that stronger provisions were included. “It showed his hand,” Gilbert said.\nThe bedrock of the new oversight is the Pandemic Response Accountability Committee, which will be made up of independent inspectors general. Modeled after a similar board created to monitor the 2008 Troubled Asset Relief Program that rescued banks, the panel will have the ability to obtain documents, coordinate audits and identify waste and abuse. The board will report what they find on a central website.\nFull Coverage: Virus Outbreak\nSeparately, Trump will appoint a special inspector general inside the Treasury Department who will be able to inspect records and review how the money is doled out. That position will be confirmed by the Senate — a process that could take weeks if the chamber stays out until April 20, when senators are currently scheduled to return.\nDemocrats also secured the creation of a congressional oversight commission that will oversee the Treasury Department. Experts on the panel will be appointed by House and Senate leaders. Maloney said “the ideal makeup” of the panel would be a diverse set of experts “to complement the other oversight bodies established under the bill.”\nThe legislation also includes a provision ensuring that bailout funds are not given to companies where a federal official, including the president, has at least a 20% interest. Language directed at airlines would block stock buy-backs and limit executive compensation.\nOversight groups fret that the legislation doesn’t give the inspector generals panel subpoena power. They also note that Trump will be the one to appoint Treasury’s inspector general, a potential wild card.\n“It’s all very personality driven,” said Scott Ellis of the group Taxpayers for Common Sense. “(Inspectors general) can be very effective and not so effective.”\nNegotiations on the bill churned until the end, with Democrats complaining in the hours before the vote that bipartisan language requiring the government to publish weekly lists of companies and entities that gain financing through the bailout funds was left out. Without this language, this information could have been kept secret from the public, the Democrats argued. The language ended up in the final version.\nAnd though the end product was bipartisan — the Senate vote was 96-0 — the two parties had sharp disagreement. Republican Sen. James Lankford, R-Okla., said during Senate debate that Democrats “wanted to make sure there was great transparency because they didn’t trust the Trump administration. So they built in an inspector general and additional people to watch the Treasury through the process.″\nOhio Sen. Sherrod Brown, senior Democrat on the Senate Banking Committee, said Democrats pushed for the provisions to put workers first.\nLawmakers need to “make sure money actually ends up in the pockets of workers, not CEOs,” Brown said.", "url": "https://apnews.com/91bbb26d8557c7d697f757b931089611"}