{"authors": ["Jedediah Britton-Purdy", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Peter Gowan", "David Broder", "Dawn Foster", "Grace Blakeley"], "date_download": "2020-05-04 19:54:38", "date_modify": "2020-05-04 19:54:38", "date_publish": "2020-03-13 00:00:00", "description": null, "filename": "2020_03_coronavirus-donald-trump-solidarity-profits_1588622078.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/13103440/GettyImages-1206923201.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_coronavirus-donald-trump-solidarity-profits_1588622078.html", "title": "The Only Treatment for Coronavirus Is Solidarity", "title_page": "The Only Treatment for Coronavirus Is Solidarity", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "A pandemic makes the slogan of solidarity literal: an injury to one is an injury to all. That’s why a pandemic also heightens the frantic wish to withdraw oneself from the web of interdependence and ride it out alone.\nThe new coronavirus makes vivid the logic of a world that combines a material reality of intense interdependence with moral and political systems that leave people to look out for themselves. Because we are linked — at work, on the bus and subway, at school, at the grocery store, with the Fresh Direct delivery system — we are contagious, and vulnerable. Because we are morally isolated, told to look out for ourselves and our own, we are becoming survivalists house by house, apartment by apartment, stocking enough that’s canned and frozen, grabbing enough cold meds and disinfectant, to cut ties and go out on our own.\nThe scramble reveals a class system in which a mark of relative status is the power to withdraw. If you have wealth or a salary from an institution that values you, and enough space at home, you might be able to pull off the essentially absurd trick of isolating yourself for a few months by drawing down the global web of commodities on display at Costco and Trader Joe’s. But for the 50 percent of the country that has no savings and lives paycheck to paycheck, or in small apartments with little food storage, or has to hustle every day to find work, this is simply impossible. People will be out every day, on the subways, at the gas stations, choosing between epidemiological prudence and economic survival, because they have no choice but to make that choice.\nAnd as long as this is true — as long as many of us are out there every day, mixing it up to get by — there is reason to think very few of us will be safe. Extrapolating from the little we know about the virus, the number of carriers will continue to grow. As long as our moral and political isolation drives us back into the marketplace, our material interdependence makes nearly everyone vulnerable.\n“Wash your hands” is good advice but also a poignant reminder that this is not the sort of problem that personal responsibility can solve. Epidemiology is a political problem. It’s not hard to sketch the steps that would ease our cruel situation: a work stoppage, massive income support (unemployment payments with some universal basic income in the mix), a moratorium on mortgage foreclosures and evictions. Treatment for coronavirus and potentially related symptoms should be free and comprehensive, no questions asked (about immigration status, for instance), so that no one goes untreated because of fear or poverty. This is all, in the most straightforward sense, good for everyone. It is also how people look out for one another’s vulnerability and need when they see one another’s problems as their own.\nSurvivalism is so palpably desperate and elite-only that a pandemic also makes clear that we need the state if we are going to survive. Trump’s clumsy cycling through his repertoire — Everything’s fine! It’s foreign! We are taking strong action! — shows once again that he has no real idea of how to use the state, except as a showman’s platform and a bank account for grift. His class of late-capitalist oligarchs are too decadent, too thoroughly the products of their own stupid and selfish ethos, to have any instinct for what to do in a crisis like this one. But sharper minds will have plenty of ideas, many of them bad for many people.\nThere are three basic scenarios for this crisis and future, deadlier ones. First is the current US trend, which is more or less privatist, with some public-health involvement in testing and behavior guidelines. The wealthy withdraw, the middle and professional classes self-isolate as much as they can but remain vulnerable, and working and poor people get sick and die.\nEven in our often-cruel society, this is a recipe for political backlash, issuing in the second possibility, disaster nationalism. Coronavirus resembles an accelerated version of the climate crisis in that, by highlighting our vulnerability and interdependence, it gives a political advantage to those who can take care of us — enough of us, anyway, or certain of us. If not in this epidemic, then in the next one, Trump’s “foreign virus” may find a successor in nationalism that takes real material steps to protect “our” people while excluding, shipping out, or otherwise getting rid of the rest. Something like this is probably the default setting of politics in an unstable, threatening world where most state power works on the national level, posing a constant invitation to ethno-nationalism.\nThe third direction is solidaristic. An injury to one actually is an injury to all; it doesn’t just sound good to say so. Even national-level responses to global ecological and epidemiological crises are stopgap mitigation. In this world, every country needs every other country to have a green energy system and infrastructure, an economy focused on health and social reproduction rather than precarious racing for the next gig. We need standing armies of green infrastructure workers and nurses more than we need the standing armies we have; and we need everyone to have them. The lesson of the climate crisis, that we can afford public abundance but the effort to have universal private abundance will kill us all, carries over to pandemic: we can afford truly public health, but if everyone is driven to try to stay healthy alone, it won’t work, and trying will kill a lot of us.\nIs it impossible, too much to ask? It’s worth remembering that our alone-together world of individualist ethics and material interdependence didn’t just happen. It takes a vast and intricate infrastructure to keep us all running in one another’s service, and in the ultimate service of return to capital: from highways to credit markets to the global trade regime. The fact that these interwoven systems are tanking financial markets around the world at the prospect that people might need to spend a few months sitting at home rather than hurrying around exchanging money shows how finely calibrated they are to profit, and how totally lacking in resilience to shifts in human need.\nThe hands and minds that built up this order are not powerless to make one that puts health first, at every level: of individuals, communities, the land, and the globe. That is a different, deeper resilience, though to get there requires a political fight over the value of life itself, whether we are here to make profits or to help one another live.", "url": "https://www.jacobinmag.com/2020/03/coronavirus-donald-trump-solidarity-profits"}