{"authors": ["Eoin Mcsweeney", "Cnn Business"], "date_download": "2020-05-04 16:00:40", "date_modify": "2020-05-04 16:00:40", "date_publish": "2020-04-01 15:22:11", "description": "More than 1.1 million autoworkers have been forced to stay home in Europe as the coronavirus pandemic closes plants and brings production in the region to a standstill.", "filename": "2020_04_01_business_auto-workers-europe_index_1588608040.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401085314-psa-vauxhall-factory-parked-cars-0316-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_business_auto-workers-europe_index_1588608040.html", "title": "1.1 million autoworkers are off the job in Europe", "title_page": "1.1 million autoworkers are off the job in Europe - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) More than 1.1 million autoworkers have been forced to stay home in Europe as the coronavirus pandemic closes plants and brings production in the region to a standstill.\nThe European Automobile Manufacturers' Association said that factory closures have so far affected roughly 40% of workers directly employed in vehicle manufacturing in Europe. The work stoppage has already reduced regional production by 1.2 million units, it added.\n\"Right now, the primary concern ... is to manage the immediate crisis facing the auto industry, which has essentially come to an abrupt halt — something the sector has never experienced before,\" said Eric-Mark Huitema, director general of the association.\nVolkswagen VLKAF BMW BMWYY Daimler DDAIF Honda HMC Fiat Chrysler FCAU PSA Group PUGOY Carmakers includingand Peugeot ownerhave closed factories as Italy, France, Germany and the United Kingdom impose restrictions on work and public life in order to prevent the virus from spreading.\nThe automotive sector, which has already endured more than two years of a sales recession , now faces its biggest crisis since the 2008 global financial crisis, according to GlobalData, an analytics company.\nRead More", "url": "https://www.cnn.com/2020/04/01/business/auto-workers-europe/index.html"}