{"authors": ["Bobcaina Calvan"], "date_download": "2020-05-04 20:07:28", "date_modify": "2020-05-04 20:07:28", "date_publish": "2020-04-08 21:05:47", "description": "TALLAHASSEE, Fla. (AP) — As if hurricanes and cyberthreats weren’t enough, Florida elections officials are now also contending with a viral pandemic as they prepare for elections in August and...", "filename": "_fb43f1165f8549381664ad559313a27a_1588622848.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8d651cf3cf2245b49114fcb60606ef42/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fb43f1165f8549381664ad559313a27a_1588622848.html", "title": "Hurricanes, cyber risks _ and virus _ imperil Florida vote", "title_page": "Hurricanes, cyber risks _ and virus _ imperil Florida vote", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Broward County Supervisor of Elections Peter Antonacci looks over the overseas ballots during the Florida Primary elections Tuesday, March 17, 2020, in Lauderhill, Fla. (AP Photo/Brynn Anderson)\nBroward County Supervisor of Elections Peter Antonacci looks over the overseas ballots during the Florida Primary elections Tuesday, March 17, 2020, in Lauderhill, Fla. (AP Photo/Brynn Anderson)\nTALLAHASSEE, Fla. (AP) — As if hurricanes and cyberthreats weren’t enough, Florida elections officials are now also contending with a viral pandemic as they prepare for elections in August and November’s crucial presidential contest.\nElections supervisors from across the state are asking Gov. Ron DeSantis for an executive order that would loosen some election rules so local officials can have more flexibility in where they put polling places and when people can vote.\n“It’s going to be a different election from any other. We’ve done so much to prepare for cybersecurity and hurricanes,” said Tammy Jones, the chief elections officer for Lee County and the head of the Florida Supervisors of Elections, a group of elections officers encompassing the state’s 67 counties.\n“This is a new thing for us — for all states across the country who are facing the same problems we are facing today,” she said. “We are trying to do our best to keep voters safe.”\nWith staffing an issue because of continuing worries over the coronavirus outbreak, elections officials say they will be pushing more Floridians to vote by mail, even as they acknowledge that the state is not prepared to conduct upcoming elections entirely through the postal service.\nIn a letter emailed to DeSantis late Tuesday, Jones and her colleagues asked the governor to allow elections officials to open early voting sooner and to provide more options in selecting polling places. They are also asking for an additional day to send vote-by-mail ballots to those who request them.\nFlorida officials have already had a taste of what’s to come: During the March 17 presidential preference primary, some polling places were thrown into disarray because some workers did not show up amid worries over the coronavirus. Some polling places lacked sufficient hand sanitizers and other health supplies.\nElection Day challenges also were evident during Wisconsin’s primary Tuesday, when elections workers and voters had to balance their health concerns with their civic duty. The chaotic primary was marked by long lines at polls as voters attempted to practice Election Day social distancing. Legal disputes also erupted, with the U.S. Supreme Court halting efforts to delay the election.\nBy most accounts, Florida, now the home state of President Donald Trump, will again play a crucial role in the battle over the White House. And its history of close races and vote-counting glitches — as well as concerns over cybersecurity — will again place the state under national scrutiny.\nFlorida Democrats generally welcomed the move by elections supervisors, but expressed concern about limiting polling places, including the groups’ request to lift rules that require a polling place in every precinct.\n“Unprecedented times call for great measures to protect our democracy,” Florida Democratic Party Chairwoman Terrie Rizzo said in a statement. “We still believe that statewide vote-by-mail is achievable, and the best way to ensure the principles of our democracy are upheld.”\nShe called on the governor to expand that option by requiring that all voters be automatically sent mail-in ballots.\nThe chair of the state’s Republican Party was not immediately available to comment, nor was a spokesperson for the governor.\nJones said neither party was consulted as her group drafted its letter to DeSantis.\n“We’re going to anticipate significant statewide shortages of poll workers for the 2020 election, and a shortage of polling places available,” she said. “It is going to be a challenge. I wouldn’t call it pressure, but I would call it uncertainty.”\n___\nFollow AP news coverage of the coronavirus pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/fb43f1165f8549381664ad559313a27a"}