{"authors": ["Sandee Lamotte"], "date_download": "2020-05-04 16:56:02", "date_modify": "2020-05-04 16:56:02", "date_publish": "2020-04-09 08:03:28", "description": "It's allergy season in the age of coronavirus. Experts say there are things to do now to keep your lungs healthy in case you are exposed to Covid-19.", "filename": "2020_04_09_health_allergies-coronavirus-wellness_index_1588611362.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/160113091039-allergies-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_health_allergies-coronavirus-wellness_index_1588611362.html", "title": "Allergies and coronavirus: What you need to do now to protect your lungs", "title_page": "Allergies and coronavirus: What you need to do now to protect your lungs - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "At the same time a deadly disease is terrorizing the world, allergy season is beginning or already in full swing across many parts of the UK, Europe and the United States.\nExperts say allergies may impact your respiratory system and make it more fragile, thus possibly making it easier to catch the novel coronavirus, or worsening any Covid-19 symptoms once you did.\n\"When you have allergies, there's inflammation,\" said Dr. Lakiea Wright, who specializes in allergies and immunology at Brigham and Women's Hospital in Boston.\n\"You inhale your allergen, say pollen, through your nose. And that's why you have nasal itching, runny nose and watery, itchy eyes,\" she said. \"That creates a lot of inflammation that can weaken your body's barriers, and it might be easier for viruses to come in.\"\n\"Anything we can do to make less mucus and less inflammation will help your body be better able to deal with some other event, such as a viral illness, that would also create inflammation,\" said pediatrician Dr. Matt Dougherty, who treats children with allergies and asthma at Esse Health in St. Louis, Missouri.\nAct before your symptoms occur\nIf you typically suffer through the flowering of spring, experts say you should be taking precautions now to keep your lungs as healthy as possible.\n\"If you have a history of allergies, make sure you start your medication that's controlled those symptoms in the past,\" said Dougherty.\n\"Get on those medicines now, and drive those symptoms down as much as you can, so you're dealing with less inflammation, less mucus production,\" he added.\nWright agrees: \"Start taking your medications, like antihistamines and nasal steroids, early, before the season, to help control those symptoms. That will help you to be at a better baseline.\"\n\"Know your allergy triggers, and try to minimize your exposure to your triggers,\" Wright said. This should be \"in addition to practicing good hygiene, washing hands and social distancing, because we want to make sure we're minimizing our exposure to viruses as well.\"\nNot sure if it's allergies? Here's what to do\nWhile the three most typical signs of coronavirus are cough, shortness of breath and fever, people have been reporting everything from severe body aches that might resemble the flu to pink eye and fatigue that can signify an allergic reaction.\nWhat if you're not sure your symptoms are allergies? Or even worse, what if your symptoms are like allergies but you've never had a reaction to pollen in the past?\nResearch has shown that it's actually common for allergies to suddenly appear later in life , possibly due to chronically high levels of air pollution that leaves our lungs in a constant state of inflammation. As we age, our immune system function also declines, making us more susceptible.\nAt this time, of course, we're being asked to say home and reach out to our doctors via phone calls or telehealth visits. You can get the most out of that consult if you prepare in advance, experts say, by recording all of your symptoms for a few days before your virtual visit.\nThat information will help your doctor decide if your symptoms might warrant an allergy test or a diagnosis of Covid-19, the disease caused by coronavirus.\n\"A fever is not a typical environmental allergy symptom,\" she said. \"Body aches, sore throat are not common allergy symptoms. So do something like taking your temperature several times a day and recording that with other symptoms. Then, when you're talking to your doctors, you would have that sort of objective evidence.\"\nThere are additional questions you can ask yourself and have the answers ready for your doctor:\nAre these my classic allergy symptoms?\nDo I get these symptoms around the same time every year?\nAm I taking my allergy medications regularly?\nAre they working in preventing or reducing my symptoms?\nOf course, some allergic reactions, like a cough from post-nasal drip, can be a sign of the common cold, the flu and coronavirus.\n\"With cold symptoms, you would typically have those maybe seven to 10 days,\" Wright said. \"With an allergy, symptoms can last throughout the season.\"\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nBut Wright says that people should not obsess over their symptoms to a point of anxiety.\n\"I don't want them to document symptoms in such a way that it's going to cause a lot of anxiety,\" she said. \"I have allergies myself, so I can really empathize and sympathize with my patients. Every time I sneeze, I'm like, 'Oh my goodness, is it something more?'\n\"But I have to be very objective and ask 'Do I have a sore throat? Do I have a fever?' I take my temperature to outline exactly what's going on because it can be very confusing.\"", "url": "https://www.cnn.com/2020/04/09/health/allergies-coronavirus-wellness/index.html"}