{"authors": ["Reporter"], "date_download": "2020-05-04 20:18:55", "date_modify": "2020-05-04 20:18:55", "date_publish": "2020-04-29 13:30:03", "description": "Sen. Elizabeth Warren and her colleagues want increased support for people with disabilities in the next stimulus package.", "filename": "entry_elizabeth-warren-senators-disabilities-coronavirus_n_5ea8db15c5b6123a176406fd_1588623535.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8dd86240000eb008e9e82.jpeg?cache=vi8vdbzvrh&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_elizabeth-warren-senators-disabilities-coronavirus_n_5ea8db15c5b6123a176406fd_1588623535.html", "title": "Democratic Senators Urge Congress To Prioritize Disabled People Amid Outbreak", "title_page": "Democratic Senators Urge Congress To Prioritize Disabled People Amid Outbreak | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Sen. Elizabeth Warren (D-Mass.) and a group of her fellow Senate Democrats wrote to congressional leadership on Wednesday morning to encourage the inclusion of people with disabilities in the next iteration of the coronavirus stimulus package.\nSens. Bob Casey (D-Pa.), Kirsten Gillibrand (D-N.Y.), Sherrod Brown (D-Ohio), Maggie Hassan (D-N.H.), and Tammy Duckworth (D-Ill.) joined Warren in drafting the letter, which calls for significant increases in funding programs to support people with disabilities through the coronavirus crisis. The CARES Act, which President Donald Trump signed on March 27, allocated funding for people with disabilities, but many in the community said it did not go far enough.\nIn their letter, the senators propose a $50 billion increase in funding for Medicaid Home and Community-Based Services (HCBS) programs, paid sick leave for people with disabilities and their caregivers, a boost in Medicaid funding, and emergency income relief. They sent the letter to Senate Majority and Minority Leaders Mitch McConnell (R-Ky.) and Chuck Schumer (D-N.Y.), House Speaker Nancy Pelosi (D-Calif.) and House Minority Leader Kevin McCarthy (R-Calif.).\nThe 61 million people living with disabilities in the United States are twice as likely to experience poverty as their non-disabled counterparts, and, similarly, people experiencing homelessness are also twice as likely to have a disability, thus making this population particularly vulnerable to COVID-19 ― but without the resources in place to get the care they need.\n“This unprecedented public health emergency has exposed the pre-existing scarcity of medical treatment, equipment, and other resources available to the disability community,” the senators wrote. “It is essential that Congress use this upcoming package as an opportunity to mitigate these disparities.”\nHCBS programs ― including in-home skilled nursing care, physical or occupational therapy, dietary management, special medical equipment, and so on ― are especially important, since nursing homes and other care facilities have become hotbeds for the spread of the virus.\nFunding these programs is crucial to ensuring people with disabilities aren’t overlooked during the pandemic. The senators have specified that the $50 billion boost should include “increases in pay for direct support professionals, home health workers, and personal care attendants to recruit, retain and reward them for their critical work.” (In-home care providers are notoriously underpaid.)\nThe senators are also calling for expanded access to personal protective equipment for people with disabilities and their caregivers and health care providers, as well as access to medication and food, and the protection of civil rights for the disabled community ― including a requirement that the CDC make public any information about the number of people with disabilities being tested, treated and dying from COVID-19.\nSens. Warren and Casey called on Congress earlier this month to protect elderly and disabled COVID-19 patients from health care discrimination.\nRead the senators’ full letter below.", "url": "https://www.huffpost.com/entry/elizabeth-warren-senators-disabilities-coronavirus_n_5ea8db15c5b6123a176406fd"}