{"authors": ["Producer", "Huffpost Live"], "date_download": "2020-05-04 20:24:17", "date_modify": "2020-05-04 20:24:17", "date_publish": "2020-04-29 19:43:54", "description": "The playwright taps the cast of The Apple Family Plays for \"What Do We Need To Talk About?\"", "filename": "entry_richard-nelson-apple-family-zoom_n_5ea9c627c5b63115cec2bb77_1588623857.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9c82a220000700d827e03.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_richard-nelson-apple-family-zoom_n_5ea9c627c5b63115cec2bb77_1588623857.html", "title": "Richard Nelson On Crafting A Play On Zoom And The Future of New York Theater", "title_page": "Richard Nelson On Crafting A Play On Zoom And The Future of New York Theater | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Watching one of Richard Nelson’s “Rhinebeck Panorama” plays is a bit like getting caught in a small, but soon all-encompassing wave. They are radically naturalistic, to the point that a new sound design had to be created to capture the actors’ performances. Microphones dangle from the ceiling to pick up the conversation. The actors are directed to speak as though they are in a real dining room, not on a stage.\nBut, slowly, over the course of a Nelson play, universal themes start to reveal themselves through the mundane aspects of life, and that small wave starts to swell, and you find yourself crushed by the overwhelming depth of the experience.\nWhat separates Nelson from other dramatists seeking to mine political events for story is his singular focus on the personal. While the national moment is the backdrop, the family dynamics and personal lives are the events of the play.\nThe “Rhinebeck Panorama” plays, all staged at The Public Theater in New York City, began with the four Apple plays, which ran from 2010 to 2013, followed by the Gabriels trilogy, which ran over the course of 2016, tracking that year’s election, and then the first Michaels play, which premiered last fall. “Women of a Certain Age” took place from 5 p.m. to 7 p.m. on election night 2016 and opened that very evening. The first of the Apple plays, “That Hopey Changey Thing,” took place during the 2010 midterms and was staged then as well.\nGiven the settings for those past shows, it makes sense Nelson has been productive during the coronavirus pandemic. For the first time since 2013, he is returning to the Apple family — via Zoom.\n“What Do We Need To Talk About? Conversations on Zoom” brings the original Apple family cast back together for a new story. The Public Theater is presenting the show live on Wednesday at 7:30 p.m. Eastern on YouTube, where it will be viewable for the following four days.\nI spoke to Nelson this morning by phone since the rehearsals have made him tired of Zooming.\nThank you so much for taking the time. What made you want to return to the Apple family?\nLike everybody else during this pandemic, you just get that feeling, as a writer, that you have to somehow express yourself. I needed to feel like I was doing something related to it [the pandemic] and to this world.\nInitially, I thought I would organize an international reading of “The Decameron,” and I would get different actors from around the world that I knew and have them read a different story, but I realized that wasn’t really my feeling. That was more like waiting something out, passing the time. Whereas I was feeling more the need to navigate something, and that’s what my friends and family were feeling as well.\nThe play I wrote cannot be done onstage. It’s meant to be done on Zoom. Richard Nelson\nSo, I discarded that and started to think about the second Michaels play; I did the first one last year, and I thought that the Michaels are going through the same thing we’re going through, so I started to change and outline the original script because of what’s going on and that got me thinking of the other families and what they’re going through, like the Apples.\nThe Apples interested me because they would all be living in Rhinebeck, and in fact, would be living only a block or two from each other and wouldn’t be seeing each other, and so that had a very good feeling for what I wanted to explore. That’s how I got back to the Apples. Before I wrote anything, I emailed all the other original actors to see if they’d be interested and they all got back within an hour to say they were. And Oskar Eustice, artistic director of The Public, was also on board.\nHow did Zoom change your approach to telling this story?\nWe’ve all watched readings on Zoom, but this is a different thing I’m trying to do. Zoom is a participant. In the Apples, every play was a meal. They sat around a dining room table and talked. In this case, Zoom is the dining room table they’re talking over. It’s not like a film or TV show where the camera is a fly on the wall. Zoom is not just an observer. And so that’s an exciting and very interesting idea and one I explored as a writer and we explored as director and actors. It’s a different form. The play I wrote cannot be done onstage. It’s meant to be done on Zoom.\nCourtesy of The Public Theater Clockwise from top left: Jay O. Sanders, Maryann Plunkett, Sally Murphy, Laila Robins, and Stephen Kunken in the livestreamed world premiere of the play \"What Do We Need To Talk About?\" written and directed by Richard Nelson.\nDo you cut to actors in close-up or keep everyone in gallery view?\nGallery view from beginning to end. Everybody on, all the time — no cut. We started playing around in the beginning, and I had a shooting script of individual cuts and changes and every time we did it, it seemed wrong. It seemed like we were trying to ignore the form. Oskar was very thoughtful about it, and he said one of the joys he always had watching the Gabriels, the Michaels and Apples was being able to see everyone’s reaction to each other onstage. And that is very true of these plays, again, over the dining room table. So, we only have four locations; it’s not 20 tiny people. Four big pictures that you watch all the time.\nHow do you focus on the personal lives of the characters when the medium itself that you’re using is for historical/external reasons?\nThis is a somewhat different animal than the other four. Those were all written to open on the day they were set, so I constantly wrote and rewrote up to the opening night. I did that because the outside world was just a thread through the family situations. To make it so specific in time and place was important, but the major events of the plays were family issues.\nThis is different because the pandemic is at the very heart of this story we’re telling. They are on Zoom because of the pandemic. Because of that, I chose not to set it on a particular day but rather it’s “April 2020.” If I had tried to do too specific a day, it started to feel like journalism and not what I was after.\nHow hard was it to make sure it’s within the pandemic, but still universal and not a discussion of the moment-to-moment, shocking aspects of the virus and the government’s handling of it?\nWell, that never happened with any of the plays. Hardly ever in any of the plays, even the ones that opened on Election Day, did the characters spend their energies that way. Everything is brought to and entwined into a personal situation which is there.\nThe play is an hour. Is that what you initially wrote, or what you found sustainable in the medium?\nI didn’t know how long it would be when I started, but it felt right given the medium and the play itself.\nHow did you find you were rewriting for the medium?\nNot much at all with this play. Mostly just textual stuff to make connections from A to B. Basically, I did very little in terms of substantive rewrites.\nJoan Marcus Jay O. Sanders, Laila Robins, and Sally Murphy in the 2012 production of \"Sorry,\" written and directed by Richard Nelson, at The Public Theater.\nCan you talk about what’s lost in terms of connection with Zoom?\nThere’s a sense of loneliness within the play. When you isolate people, especially if you isolate people who are family members who are very close, and they’re only a block or two from each other, they just can’t go out and see each other. Or if they do, they’re 10 to 20 feet away from each other. Trying to overcome loneliness, as best as one can, is a wonderful and important human urge. Wanting to come together, wanting to listen and talk to each other, is just very keen and central to who we are as human beings.\nAll of your work is about how we connect. Did you see Zoom and this particular moment in time as a greater means to explore that?\nIt’s just a fascinating bridge. There’s no nearness or touch, and when one realizes that, there’s going to be loneliness. For a while, we can forget about it if we’re talking and enjoying each other, but always underneath there’s a loneliness.\nFreelance artists have lived in a world where our shows could close tomorrow, and we could be out of work with nothing to do. And we’ve learned to live and sometimes have a sense of humor about it. We’re pretty darn strong. Richard Nelson\nA lot of theater groups can’t afford rent right now. A lot of shows are closing. Do you have any thoughts on the future of theater in New York?\nIt will come back. I believe the theater is more than just an industry or business. It’s something we’ve had in Western civilization for 2,500 years. It’s always been a place people could come together and be in the same room and experience the same thing at the same time. That is a human need that will not vanish, it cannot vanish. Otherwise, we lose something essential to being a human being. I’m certainly confident that theater in that sense will come back.\nIn business terms, that is going to be a long road, without question, and people in this business have very often given much of their professional lives to something they love and want to share and something that is not necessarily going to make them wealthy or famous — it’s a hard time right now, but we’re a resilient group. Freelance artists have lived in a world where our shows could close tomorrow and we could be out of work with nothing to do. And we’ve learned to live and sometimes have a sense of humor about it. We’re pretty darn strong.\nDo you have any words of encouragement for theater students across the country who aren’t going to be able to put on their spring shows this year?\nThat is so hard. We talk about this in the play, but to be young right now — just finishing or just starting school, looking forward — must be very difficult right now. To go out into the world in any case, any year, but at this time, really, must be very frightening. But, hang in there. Good things can come from basic changes.\nThe nonprofit theater movement I grew up in, as well as the off-Broadway movement in the ’60s and ’70s, those theaters were created because commercial theater wasn’t working out. Whenever there is an upheaval like this, there is also an opportunity. I would urge young people, what kind of opportunity, what kind of void they can fill?\nThe Public Theater presents Richard Nelson’s “What Do We Need To Talk About? Conversations on Zoom” beginning at 7:30 p.m. April 29, on YouTube and available for four days following.", "url": "https://www.huffpost.com/entry/richard-nelson-apple-family-zoom_n_5ea9c627c5b63115cec2bb77"}