{"authors": [], "date_download": "2020-05-04 20:26:51", "date_modify": "2020-05-04 20:26:51", "date_publish": "2020-04-14 04:03:14", "description": "ALBUQUERQUE, N.M. (AP) — The parent company of New Mexico’s largest electric provider is reporting a first-quarter loss of more than $15 million. PNM Resources said Monday it posted a loss...", "filename": "_cf85b94d583d56c74421f63b0bb34d4f_1588624011.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cf85b94d583d56c74421f63b0bb34d4f_1588624011.html", "title": "New Mexico utility's parent company reports 1st quarter loss", "title_page": "New Mexico utility's parent company reports 1st quarter loss", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ALBUQUERQUE, N.M. (AP) — The parent company of New Mexico’s largest electric provider is reporting a first-quarter loss of more than $15 million.\nPNM Resources said Monday it posted a loss of 19 cents per share but that revenues for the quarter topped $333 million. For the year, the company is expecting earnings in the range of $2.16 to $2.26 per share.\nThe first-quarter results include the early stages of the effects of the coronavirus outbreak, the Albuquerque Journal reported . PNM officials expect increases in residential electric use and decreases in commercial use primarily as a result of stay-at-home orders in New Mexico.\nThe first quarter also reflected the significant market downturns at the end of March.\n“This is a challenging time for our customers and communities, and our priority is to ensure our employees are safe and that we are able to safely maintain critical electricity service,” Pat Vincent-Collawn, PNM Resources’ chair, president and CEO, said in a statement.\nShe said the company will continue to monitor any changes and communicate any effects on the PNM Resources’ overall financial projections.", "url": "https://apnews.com/cf85b94d583d56c74421f63b0bb34d4f"}