{"authors": [], "date_download": "2020-05-04 20:11:20", "date_modify": "2020-05-04 20:11:20", "date_publish": "2020-04-16 17:24:40", "description": "OKLAHOMA CITY (AP) — Eight additional deaths due to COVID-19 and nearly 100 additional cases of the coronavirus were reported in Oklahoma Thursday by the state's Department of Health. Deaths...", "filename": "_dce1b86a1b2f8adbf249c2f530c496b7_1588623080.html", "image_url": "https://storage.googleapis.com/afs-prod/media/56addfa42a31413297996fa332897518/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dce1b86a1b2f8adbf249c2f530c496b7_1588623080.html", "title": "Oklahoma coronavirus cases up to 2,357 with 131 now dead", "title_page": "Oklahoma coronavirus cases up to 2,357 with 131 now dead", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Registered nurse Brooke Pruitt hands a mask into a person to be tested at a mobile testing site for COVID-19 at the Murray County Expo Center in Sulphur, Okla., Tuesday, April 14, 2020. The testing was performed by staff from District Eight of the Oklahoma State Department of Health. (AP Photo/Sue Ogrocki)\nRegistered nurse Brooke Pruitt hands a mask into a person to be tested at a mobile testing site for COVID-19 at the Murray County Expo Center in Sulphur, Okla., Tuesday, April 14, 2020. The testing was performed by staff from District Eight of the Oklahoma State Department of Health. (AP Photo/Sue Ogrocki)\nOKLAHOMA CITY (AP) — Eight additional deaths due to COVID-19 and nearly 100 additional cases of the coronavirus were reported in Oklahoma Thursday by the state’s Department of Health.\nDeaths now total 131 in the state with at least 2,357 cases, the department said, an increase from 123 deaths and 2,263 cases reported Wednesday.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia.\nFigures provided by the department show at least one case in 64 of the state’s 77 counties and deaths in 29 counties.\nEach of the eight latest deaths, and 108 total, are among people 65-or older.\nAlso Thursday, Gov. Kevin Stitt announced the activation of 175 members of the Oklahoma Army and Air National Guard this week to support the state response to the spread of the virus.\nThe soldiers and airmen will provide and restock personal protective equipment and tests as part of their duties, according to a news release from the governor’s office. Another 35 Guard members are currently working at the state’s Strategic National Stockpile where the equipment is stored.", "url": "https://apnews.com/dce1b86a1b2f8adbf249c2f530c496b7"}