{"authors": ["Jim Acosta", "Kaitlan Collins"], "date_download": "2020-05-04 16:26:37", "date_modify": "2020-05-04 16:26:37", "date_publish": "2020-04-06 02:51:35", "description": "There was a heated disagreement in the Situation Room this weekend over the efficacy of the anti-malaria drug hydroxychloroquine -- but multiple sources say it was mostly one-sided, as President Donald Trump's top trade adviser Peter Navarro feuded with other officials over the drug's unproven effectiveness to treat coronavirus.", "filename": "2020_04_05_politics_white-h_adc3fd5eaa8fb9f68111710b99ad4ce6_index_1588609597.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406011118-coronavirus-press-briefing-0309-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_white-h_adc3fd5eaa8fb9f68111710b99ad4ce6_index_1588609597.html", "title": "Hydroxychloroquine disagreement breaks out in Situation Room", "title_page": "Hydroxychloroquine disagreement breaks out in Situation Room - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) There was a heated disagreement in the Situation Room this weekend over the efficacy of the anti-malaria drug hydroxychloroquine -- but multiple sources say it was mostly one-sided, as President Donald Trump's top trade adviser Peter Navarro feuded with other officials over the drug's unproven effectiveness to treat coronavirus .\nThe debate is not a new one inside the coronavirus task force -- and medical experts have repeatedly explained to the President that there is a risk in enthusiastically touting hydroxychloroquine in case the drug doesn't ultimately work to combat the virus. But other aides and outside advisers have sided with Trump, including Navarro, who is still not a formal part of the task force but has wedged himself into the meetings.\nWhile discussing the latest on hydroxychloroquine this weekend, an exasperated Navarro lashed out at Dr. Anthony Fauci , one of the advisers who has urged caution about the drug, a person familiar with the meeting told CNN.\nNavarro had brought a stack of paperwork with him into the Situation Room on the drug, arguing it was proof that it could work to treat coronavirus, which Fauci, the nation's top infectious disease expert, disagreed with because it was not data.\n\"What are you talking about?\" Fauci asked -- a question that set Navarro off. He became indignant, and at one point, accused Fauci of opposing Trump's travel restrictions on China, which confused many in the room, given Fauci was one of the initial few to agree with Trump on the move, the source said.\nA source close to the task force said Fauci is not backing off his belief that hydroxychloroquine is not a proven treatment for coronavirus. When CNN's Jeremy Diamond asked Fauci to comment on the matter Sunday night, Trump stepped in and didn't allow Fauci to answer. But a source said the doctor has already offered his opinion on the drug in other venues and would continue to do so.\nSeveral aides later said they were unfazed by Navarro's outburst, given he has them regularly. But the argument highlights how deep the divide runs over the task force's response to the coronavirus pandemic\nAnother source told CNN that despite the disagreement in the Situation Room between Fauci and Navarro, Fauci continues to have a good relationship with Trump and Pence, though some staffers have shown irritation when his opinions differ.\n\"Doctors disagree about things all the time. My qualifications in terms of looking at the science is that I'm a social scientist,\" Navarro said. \"I have a Ph. D. And I understand how to read statistical studies, whether it's in medicine, the law, economics or whatever.\"\nTrump in recent days has pointed to hydroxychloroquine as a treatment despite scant scientific evidence of the drug's effectiveness.\nWithout citing evidence , Trump said at Sunday's briefing that hydroxychloroquine is a \"great\" and \"powerful\" anti-malaria drug \"and there are signs that it works on this, some very strong signs.\"\nFor people without heart problems, Trump recommended combining hydroxychloroquine with azithromycin, a common antibiotic. He said azithromycin \"will kill certain things that you don't want living within your body.\"\nYet there is little reliable evidence that the drugs -- either alone or in combination -- are effective at treating the novel coronavirus.\nStill, Trump said: \"What do you have to lose? What do you have to lose?\"\nFor doctors, nurses and first responders, Trump suggested the drugs could be taken as a preventative. \"They say taking it before the fact is good, but what do you have to lose?\"\nExperts do not suggest taking hydroxychloroquine as a preventive for Covid-19 because there is no evidence yet to suggest it protects against contracting the virus.\n\"They say take it,\" said Trump, without citing any experts or sources. \"I'm not looking at it one way or the other, but we want to get out of this. If it does work, it would be a shame if we didn't do it early. But we have some very good signs.\"\nTrump also said the US Food and Drug Administration gave hydroxychloroquine \"rapid approval,\" but in fact, the FDA has not approved it for the treatment of Covid-19.", "url": "https://www.cnn.com/2020/04/05/politics/white-house-malaria-drug-hydroxychloroquine-disagreement/index.html"}