{"authors": ["Veronica Stracqualursi"], "date_download": "2020-05-04 16:03:58", "date_modify": "2020-05-04 16:03:58", "date_publish": "2020-04-01 14:46:26", "description": null, "filename": "2020_04_01_politics_ruth-bader-ginsburg-workout-coronavirus_index_1588608238.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/180822083552-ruth-bader-ginsburg-workout-video-2-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_ruth-bader-ginsburg-workout-coronavirus_index_1588608238.html", "title": "RBG continues to work out at Supreme Court private gym, her trainer says", "title_page": "RBG continues to work out at Supreme Court private gym, her trainer says - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Justice Ruth Bader Ginsburg is continuing her workouts at the Supreme Court gym amid the coronavirus pandemic , according to her longtime personal trainer.\nBryant Johnson, Ginsburg's trainer, told the news outlet Law360 on Tuesday that Ginsburg, 87 and a four-time cancer survivor, does not want to stop her sessions.\n\"Everybody's been shut down. The only reason why I didn't shut the justice down is because, hey, she ain't having it,\" Johnson said.\nWashington, DC has implemented a stay-at-home order and closed all public gyms due to the pandemic.\nWhat you need to know about coronavirus\nSupreme Court spokeswoman Kathy Arberg said Ginsburg has her own exercise spot.\n\"At Justice Ginsburg's request, the Court has set aside the limited private space next to its health facility for Justice Ginsburg to exercise. Her doctors share her view that the training sessions are essential to her well-being,\" Arberg told CNN.\n\"The space is being used exclusively by the justice,\" Arberg added. \"No other justices are using the space, and the employee gym is closed to all users.\"\nJohnson has not returned CNN's requests for comment.\nJohnson told Law360 that he has canceled his appointments with other clients and has only been working with Ginsburg. The court building has been closed to the public but staffers continue to visit the offices for official business.\nJohnson said he is taking extra precautions and keeping a safe distance between him and Ginsburg during their sessions.\nHe said he wipes \"every piece of equipment\" he thinks Ginsburg will come in contact with and washes his hands after.\n\"Her choice is, she doesn't make excuses not to do it,\" Johnson told Law360. \"So we find ways to do it.\"\nJohnson, an Army reservist, has been working with the liberal legal icon since 1999 after she underwent surgery for colorectal cancer.\nThe city's \" stay-at-home order \" from April 1 through April 24 says all residents should remain in their homes except for \"essential activities,\" like buying groceries.\nResidents can also \"engage in allowable recreational activities\" outdoors with household members, such as walking, hiking, dog-walking, biking and other activities where there is no person-to-person contact.\nDC requirements for social distancing, as recommended by health experts, is to maintain 6 feet of distance from other individuals.\nThe court indefinitely postponed a slate of 11 cases that were to be heard in March -- but has yet to announce alternatives for regular oral arguments scheduled for April.\nThe justices have been working from home and conducting internal meetings by telephone, and the court expanded remote working capabilities to reduce the number of employees in the building. Decisions are being issued online, rather than in the courtroom.\nGinsburg and a majority of her colleagues on the high court qualify as \"older adults\" at higher risk of getting sick from Covid-19, according to the Centers for Disease Control and Prevention.\n\"She has that grandfather status to me and if she wants to train, that's the least that I can do,\" Johnson said.\nUPDATE: This story has been update with comment from the Supreme Court.", "url": "https://www.cnn.com/2020/04/01/politics/ruth-bader-ginsburg-workout-coronavirus/index.html"}