{"authors": ["Paul P. Murphy", "Theresa Waldrop"], "date_download": "2020-05-04 16:58:01", "date_modify": "2020-05-04 16:58:01", "date_publish": "2020-04-09 08:00:12", "description": "A Detroit hospital has been so overwhelmed by the influx of Covid-19 patients that at least 2 people have died in its emergency room hallways before help can arrive, health care workers there told CNN.", "filename": "2020_04_09_us_detroit-hospi_d87d431705de449bb15b5528721aaf60_index_1588611481.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407175534-detroit-sinai-grace-hospital-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_us_detroit-hospi_d87d431705de449bb15b5528721aaf60_index_1588611481.html", "title": "Detroit hospital workers describe working conditions during Covid-19 crisis", "title_page": "Detroit hospital workers describe working conditions during Covid-19 crisis - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A Detroit hospital has been so overwhelmed by the influx of Covid-19 patients that at least 2 people have died in its emergency room hallways before help can arrive, health care workers there told CNN.\nCNN spoke with five hospital workers at Sinai-Grace Hospital, part of the Detroit Medical Center system, who said staff members feel they don't have enough coworkers or supplies to deal with the crisis.\nMany of the patients in the ER are presumed Covid-19 positive because they have viral symptoms, but their test results take days to process, hospital workers said.\nConditions are so drastic at Sinai-Grace that on Sunday night, all of the emergency room's night shift nursing staff --seven in total -- staged a sit-in, where they refused to work and demanded that more nurses be sent in to help.\nPatients at Sinai-Grace aren't just two-to-a-room -- they have been lining many of the hallways in the emergency room, according to the four health care workers. Two workers said critically ill patients, including ventilated patients, have been at times kept in the hallways.\nAt least two patients in the ER have died in hallway beds, according to a physician at the facility. Health care workers at the hospital, including the physician, spoke to CNN on the condition of anonymity out of concern for their jobs.\n\"We've had patients die in hallway beds because the nurse didn't find they didn't have a pulse until it was too late,\" the physician said. \"Each nurse has so many patients that by the time they come to check on their next one, there is a chance that patient may not have a pulse anymore.\"\nAnother patient's breathing tube disconnected from the ventilator, and the patient died before staff could respond, two ER workers told CNN.\nMichigan has the third-largest number of Covid-19 cases in the US, behind New York and New Jersey, according to Johns Hopkins University. Cases have skyrocketed from 300 less than a month ago to over 20,000 as of Wednesday afternoon.\nA number of hospitals around the country are nearing or have reached capacity because of the surge in Covid-19 patients.\nA vulnerable population\nOut of respect for the privacy of the patient and family members, Brian Taylor, Detroit Medical Center communications and media relations director said the medical center would not be providing or commenting on any details regarding the care of any particular patient.\n\"It's important to understand that everyday emergency rooms all over the country face dynamic situational challenges and even more so now in the midst of the COVID-19 crisis,\" he said.\nAlthough Detroit Medical Center did not address the specific situations raised by the hospital workers, they provided CNN with a lengthy statement explaining the difficult situation it is in.\n\"Like many hospital systems, the demand to care for the ever-increasing number of patients is putting a strain on our resources and staff,\" Taylor told CNN in a statement. \"Surge plans are in place at our hospital to handle the increase in patient volumes to ensure we provide the safest and most appropriate care for our patients.\"\nThe Sinai-Grace emergency room has more traffic than any other hospital in metro Detroit and it's the only hospital in Northwest Detroit, Taylor said. There are also a large number of nursing homes in its vicinity, so the hospital is receiving more critically ill patients, Taylor said.\nSinai-Grace's patient population has, \"extremely high rates of underlying medical conditions such as hypertension and diabetes, which puts people at higher risk for COVID-19,\" Taylor said.\nThe hospital has been using all available space, Taylor said, including converted operating rooms, outpatient areas and recovery rooms, to handle the surge. It's also working to move patients from hospital to hospital within their system, or to other hospitals in the region.\n\"We are safely and appropriately using the necessary supplies and equipment, including monitors and ventilators, to care for our patients and are continually sourcing around the world for additional supplies as the number of COVID-19 patients needing care continues to grow,\" he said in his statement.\nHard decisions\nWorkers at Sinai-Grace, though, said that with the increase in patients, the hospital at times hasn't had enough of the cardiac monitors that sound an alarm when a patient's vital signs change, according to three of the health care workers.\nStaff members have also had to make hard decisions about who even gets monitors.\n\"We've done our best with monitors,\" one ER worker said. \"But we have patients that we know are going to pass so we take them off a monitor and give [it] to someone else that needs [it].\"\nAccording to that worker, one patient without a monitor died in the ER hallway. The patient was showing signs of rigor mortis by the time staff members were aware that the patient had died.\n'We do our best to be next to them when they pass'\nEven if a patient is on a monitor and alarms begin to go off, staff isn't always able to respond in time, two ER employees said.\nIn at least two instances, even though monitor alarms had gone off, the hospital was so busy that by the time nurses were able to get there, the patients had died, the ER employees said.\n\"(The nurses) walked up to them and they had no pulses,\" one ER worker said. \"They were on the monitor, but it was too much to watch everyone safely.\"\nFor patients, specifically elderly ones with high risk factors for Covid-19, two ER workers told CNN that staff at Sinai-Grace are calling the families of elderly patients and, \"encouraging them to make patient DNR (do-not-resuscitate)/DNI (do-not-intubate).\"\nThat means that if a patient goes into respiratory or cardiac arrest, staff says they do not attempt to intervene and let the patient pass.\nDuring their shifts, hospital employees are not working to resuscitate some patients that have, or are presumed to have, Covid-19, according to three members of the ER staff. Performing CPR or restarting a patient's heart would mean employees would be exposed to Covid-19, said one worker.\nCNN specifically asked about the ER staff's policies of calling patient families, and not resuscitating presumed Covid-19 patients, but Taylor did not respond directly to that.\nThere is no hospital-wide do-not-resuscitate policy, DMC's Taylor told CNN.\n\"As for decisions on whether a patient receives CPR, these decisions are made on a case by case basis by physicians and the medical care team,\" Taylor said. \"If a patient requires CPR of course the patient will receive CPR.\"\n\"We do our best to be next to them when they pass,\" another ER worker said, \"But oftentimes all of the nurses are busy with other patients.\"\nWhen patients do die, staff members have to quickly move them to temporary refrigerated storage that's been brought in, two hospital workers said.\n\"We have to put people next to each other and on top of each other, because it's been non-stop,\" one said. \"I do my best to close their eyes and say a little prayer.\"\nTubes, cords, even ventilators crowd the ER hallways\nVentilated Covid-19 patients are normally kept in an isolated room because the ventilator can aerosolize the virus -- especially if the ventilator tube disconnects -- spreading it through the air, according to multiple healthcare workers across the US that CNN has spoken with.\nThere are so many patients in stretchers in the hallways that electrical cords and even oxygen tubes are littering them, two health care workers said, describing the extraordinary measures they are taking to handle the situation. They have to keep the cords and tubes in the hallways, they said, because they are all necessary supplies that keep the patients -- some who are critically ill -- alive.\nThe hospital is still treating walk-ins and ambulance arrivals, including non-Covid-19 patients, according to four health care workers.\n\"There's times walking into that hospital it looks like a third world country in a war zone,\" one Detroit emergency medical technician, who has transported patients to Sinai-Grace, told CNN.\n\"Walking through is an eerie feeling,\" the EMT said. \"Nurses, physicians and respiratory therapists running around, everyone is on a vent, every vent is beeping, patients are on multiple IV drips. You would've thought it was a military hospital in a war zone.\"\nCorrection: An earlier caption for a photo in this story incorrectly identified conditions inside the hospital.", "url": "https://www.cnn.com/2020/04/09/us/detroit-hospital-workers-sinai-grace-coronavirus/index.html"}