{"authors": ["Hollie Silverman"], "date_download": "2020-05-04 16:25:22", "date_modify": "2020-05-04 16:25:22", "date_publish": "2020-04-07 05:46:54", "description": "The Ferguson-Florissant school district in Missouri has suspended the home delivery of meals to students following the deaths of two school bus drivers.", "filename": "2020_04_07_us_missouri-scho_8d01ab6705ae4d8355ad45341a94f5bd_index_1588609522.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407010403-missouri-school-employees-die-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_us_missouri-scho_8d01ab6705ae4d8355ad45341a94f5bd_index_1588609522.html", "title": "A Missouri school district has suspended meal delivery after two employees died", "title_page": "A Missouri school district has suspended meal delivery after two employees died  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Ferguson-Florissant school district in Missouri has suspended the home delivery of meals to students following the deaths of two school bus drivers.\nA second driver died after a prolonged illness unrelated to coronavirus but had symptoms of the virus before death, according to the statement. The driver supported food distribution from Cross Keys Middle School , also in Florissant, before spring break started on March 23.\nA third staff member who also works at McCluer North High School has also tested positive for the virus, Davis said.\nWhile none of the employees have worked since spring break, which began more than 14 days ago, the district has decided to suspend food distribution for the week of April 6 through April 10.\nThe suspension of food service is to keep students, families and the employees of the district safe, the statement said.\nThe district is looking into alternatives for food distribution to support the community. The state of Missouri is under a stay at home order through April 24.\n\"These are incredibly difficult times especially as we are more isolated from one another,\" Davis said in the letter. \"Even though we are apart physically, I know that together we will get through this crisis.\"", "url": "https://www.cnn.com/2020/04/07/us/missouri-school-employees-die-coronavirus-meals/index.html"}