{"authors": ["Chauncey Alcorn", "Cnn Business"], "date_download": "2020-05-04 16:27:52", "date_modify": "2020-05-04 16:27:52", "date_publish": "2020-04-07 19:13:44", "description": "At least five Barnes & Noble employees at a distribution center in Monroe, New Jersey, have been diagnosed with coronavirus.", "filename": "2020_04_07_business_coronavirus-barnes--noble_index_1588609672.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407132502-barnes--noble-distribution-center-monroe-nj-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_business_coronavirus-barnes--noble_index_1588609672.html", "title": "Five Barnes & Noble workers were diagnosed with coronavirus in New Jersey", "title_page": "Five Barnes & Noble workers were diagnosed with coronavirus in New Jersey - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Raleigh, North Carolina (CNN Business) At least five Barnes & Noble employees at a distribution center in Monroe, New Jersey, have been diagnosed with coronavirus.\nEmployees at the facility received a letter from management Tuesday morning telling them as many as nine of their coworkers are currently suffering from Covid-19 symptoms, according to a spokesman for the Laundry Distribution and Food Service joint board union, which helped organize a planned protest by Barnes & Noble workers Tuesday. Only five of the nine alleged Covid-19 cases have been confirmed by doctors, Barnes & Noble director of communications Alex Ortolani told CNN Business.\n\"The other [four] cases are employees with reported symptoms,\" Ortolani told CNN Business.\nThe company said it has been working with the Centers for Disease Control and Prevention on the matter, noting that the Monroe facility is cleaned daily and will receive an additional \"deep cleaning\" when it closes for Good Friday. Until then, the facility will remain open for business, Barnes & Noble said.\n\"We have been working with employees at our Monroe, New Jersey, facility to keep everyone safe during this difficult time,\" the company said in a statement \"We prioritize keeping our working environment as safe as possible and, on learning of the positive cases and those suffering symptoms, we closed the facility and had conducted a thorough clean. ... We appreciate all the hard work and efforts of our staff, and will continue to listen to their concerns and work with them to make a safe and secure work environment.\"\nRead More", "url": "https://www.cnn.com/2020/04/07/business/coronavirus-barnes--noble/index.html"}