{"authors": ["Trends Reporter"], "date_download": "2020-05-04 20:15:15", "date_modify": "2020-05-04 20:15:15", "date_publish": "2020-04-28 03:13:14", "description": "New York and other blue states are already pitching in to prop up red states, not the other way around, points out an irritated Cuomo.", "filename": "entry_red-state-takers-blue-state-bailout-trump-cuomo-coronavirus_n_5ea75b5cc5b6dd3f908969df_1588623315.html", "image_url": "https://img.huffingtonpost.com/asset/5ea77ac7250000340feb0702.png?cache=rvuw705ye2&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_red-state-takers-blue-state-bailout-trump-cuomo-coronavirus_n_5ea75b5cc5b6dd3f908969df_1588623315.html", "title": "Gov. Cuomo Schools Trump On Red State 'Takers' After Tweet About Blue State Bailouts", "title_page": "Gov. Cuomo Schools Trump On Red State 'Takers' After Tweet About Blue State Bailouts | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "New York Gov. Andrew Cuomo slammed back at President Donald Trump Monday, informing him that it’s Republican red states — not New York and other blue states — that are sucking up more national resources than they’re contributing.\nThe Democratic governor was responding to a tweet by Trump complaining that the nation shouldn’t have to bail out “poorly run states.” In “all cases,” Trump claimed, they are “Democrat run and managed.” He specifically named Illinois, headed by a fierce Trump critic, Gov. J.B. Pritzker (D).\n“If you want to go to who’s getting bailed out and who paid what, nobody would be bailing out New York state,” Cuomo said at his daily press briefing, calling New York the “number one giver.” The state has been “bailing” out red states for decades, Cuomo said.\nIn fact, the top six of eight states that pay more to the nation than they get back from the federal government are blue states. Illinois gives as much as it gets, according to an analysis by the Rockefeller Institute of Government. Three of the four biggest “taker” states in the nation, which collect at least twice what they contribute, are Republican-led states.\nWhy should the people and taxpayers of America be bailing out poorly run states (like Illinois, as example) and cities, in all cases Democrat run and managed, when most of the other states are not looking for bailout help? I am open to discussing anything, but just asking? — Donald J. Trump (@realDonaldTrump) April 27, 2020\n“Nobody puts more into the pot than the state of New York,” Cuomo said, noting that the state has paid out $116 billion more than it received in federal spending since 2015, he said. The governor named New Jersey, Massachusetts and Connecticut as additional “giver states.”\n“Who are the taker states?” Cuomo asked, and he named Kentucky and pointed to states in the “southeast part of the country.” Alabama, Arkansas, Florida, Georgia, Tennessee, Louisiana, Mississippi, Missouri, Oklahoma and West Virginia, among other red states, all take more in federals funds than they contribute.\nSenate Majority Leader Mitch McConnell (R-Ky.), who has said he’s opposed to “blue-state bailouts,” suggested last week that states should simply go bankrupt if they’re running out of money amid the COVID-19 crisis. His state already gets more bang for every buck it pays to the federal government. Kentucky collects $2.41 for every dollar it sends to the national coffers, according to data analyzed by the Rockefeller Institute.\nAn annoyed Cuomo insisted that it’s divisive and “repugnant” to reduce what the nation is going through now with COVID-19 to a very partisan balance sheet.\n“This is not the time to be talking about dollars and cents among members of a community who are trying to be mutually supportive and help each other,” he said. “This is not the time to be saying, ‘Well, you put in a dollar more than I did,’ or ‘I put in $5 more than you did.’”\nBut, he added, “If you want to call for an accounting, you lose.”", "url": "https://www.huffpost.com/entry/red-state-takers-blue-state-bailout-trump-cuomo-coronavirus_n_5ea75b5cc5b6dd3f908969df"}