{"authors": ["Kristina Sgueglia", "Aaron Cooper", "Jason Carroll", "Steve Almasy"], "date_download": "2020-05-04 16:11:17", "date_modify": "2020-05-04 16:11:17", "date_publish": "2020-04-03 01:13:51", "description": "Officials in Massachusetts on Thursday announced more deaths at a veterans nursing home where at least 12 people have died from the novel coronavirus.", "filename": "2020_04_02_us_massachusetts-veteran-home-coronavirus-deaths_index_1588608677.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331011226-veterans-home-coronavirus-deaths-massachusetts-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_us_massachusetts-veteran-home-coronavirus-deaths_index_1588608677.html", "title": "Massachusetts veterans home with coronavirus outbreak sees more deaths", "title_page": "Massachusetts coronavirus: 11 veterans at a home for soldiers died, 5 tested positive for the virus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Officials in Massachusetts on Thursday announced more deaths at a veterans nursing home where at least 12 people have died from the novel coronavirus.\nAn official said 18 veterans who lived at the Holyoke Soldiers' Home had died, 12 of whom tested positive for Covid-19. Three tests are pending, one result was \"unknown\" and two were negative.\nGov. Charlie Baker hired former federal prosecutor Mark Pearlstein to investigate the state-managed home, which has 233 residents.\nAll residents have been tested for Covid-19, Brooke Karanovich, a spokeswoman for the state's Executive Office of Health and Human Services, said.\n\"This is a critical health situation for our veterans, and the commonwealth will continue to make all resources available to the leadership of the Holyoke and Chelsea Soldiers' Homes to contain the spread of the virus,\" she said, referring to another veterans home where two people have died from the coronavirus.\nAt least 23 residents and seven staff members at the Holyoke home have already had positive tests, an official said.\nThe facility's superintendent, Bennett Walsh, is on paid administrative leave, according to a statement earlier this week from Dan Tsai, Health and Human Services deputy secretary.\nHolyoke Mayor Alex Morse told CNN on Monday that his office had received anonymous complaints over the weekend of worsening conditions at the facility. When Morse reached out to about the reports, Walsh spoke with \"a complete lack of urgency,\" Morse said.\nWalsh told the mayor there had been a spate of resident deaths and that a number of them had tested positive for Covid-19.\n\"Like a lot of folks, I'm shocked and devastated at the same time,\" Morse said. \"There was a complete breakdown in communications in the Soldiers' Home reaching out to the city and the state.\"\nPatricia Cowden, whose husband Richard, a veteran, died of coronavirus at the home told CNN on Thursday that Walsh had been careful when the flu was going around and made everyone who had not gotten a flu shot wear a mask.\n\"So he was being careful then. He may have been listening to broadcasts saying that there was nothing to (coronavirus), you know, that there was nothing to worry about, that it would just go away,\" she wondered. \"He's a military person. The commander in chief was saying it was nothing, you know.\"\nShe also told CNN that about the time people began getting sick \"nobody really knew what was going on\" with the virus.\nCowden said her husband was in the Merchant Marines and went to Vietnam. He later worked as a broadcaster.\nShe was able to hold his hand when he died. She wore two masks, a face shield, gloves and a gown.\n\"(Being with him) helped me very much,\" she said. \"The idea of him dying alone was one of the things that was bothering me the most.\"\nWalsh has not responded to CNN's requests for comment.\nHe told MassLive that he and other officials based decisions on guidelines from the US Centers for Disease Control and Prevention and the state Department of Health.\n\"I am filled with grief and sorrow for all the veterans who have died, and I extend my sincere sympathies to their families,\" he said, according to MassLive.\nWorker says superiors had lapse in judgment\nA worker at the home said he is angry with his superiors for what he calls a lapse in judgment in how the outbreak was handled.\nThe worker said he was reprimanded for wearing personal protective equipment (PPE) on March 18.\nAccording to a letter obtained from a spokesperson for Service Employees International Union Local 888, of which the worker is a member, the employee donned the equipment \"without permission or need.\"\nCNN is not naming the employee nor the individual who sent it, but it is on letterhead from the Executive Office of Health and Human Services Soldiers' Home.\nThe worker -- a caregiver who has been at the facility for 20 years -- said he first came into contact with a veteran with symptoms consistent with Covid-19, who was not isolated, but rather walking around and coughing.\nThen, while working on a different floor at the facility March 17, he observed a second veteran displaying symptoms.\n\"According to the CDC guidelines I tried to protect myself and protect the veterans,\" which is when the worker says he put on PPE, including a gown and a mask.\nIt is unclear whether the equipment was personal or belonged to the facility.\nThe letter -- which came shortly after the worker decided to put on the PPE -- called the employee's actions \"disruptive\" and \"extremely inappropriate\" that purportedly \"alarmed staff.\"\nThe letter says the employee disagreed with safety procedures and put on the PPE on March 18 without authorization.\nIt says the employee's actions \"caused unnecessary resources to be deployed that may be needed in the future.\"\n\"CARE WITH HONOR AND DIGNITY\" is written on the stationary.\nCNN didn't receive a response from the Massachusetts Executive Office of Health and Human Services about the worker's statements.\nIt's unclear whether either of the veterans the worker mentioned tested positive.", "url": "https://www.cnn.com/2020/04/02/us/massachusetts-veteran-home-coronavirus-deaths/index.html"}