{"authors": ["Lisa Respers France"], "date_download": "2020-05-04 16:16:56", "date_modify": "2020-05-04 16:16:56", "date_publish": "2020-04-03 15:57:16", "description": "Bill Withers, the singer-songwriter whose soulful hits \"Lean On Me,\" Ain't No Sunshine\" and \"Lovely Day\" became part of the soundtrack for a generation, has died.", "filename": "2020_04_03_entertainment_bill-withers-obit_index_1588609016.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403103628-01-bill-withers-lead-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_entertainment_bill-withers-obit_index_1588609016.html", "title": "Bill Withers, 'Lean On Me' and 'Lovely Day' singer, has died at 81", "title_page": "Bill Withers, 'Lean On Me' and 'Lovely Day' singer, has died at 81 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Bill Withers, the singer-songwriter whose soulful hits \"Lean On Me,\" Ain't No Sunshine\" and \"Lovely Day\" became part of the soundtrack for a generation, has died.\nHe was 81.\nWithers died Monday in Los Angeles of heart complications, according to his family.\n\"We are devastated by the loss of our beloved, devoted husband and father. A solitary man with a heart driven to connect to the world at large, with his poetry and music, he spoke honestly to people and connected them to each other,\" his family said in a statement obtained by CNN. \"As private a life as he lived close to intimate family and friends, his music forever belongs to the world. In this difficult time, we pray his music offers comfort and entertainment as fans hold tight to loved ones.\"\nHis songs have been considered timeless and \"Lean On Me\" has experienced a resurgence during the coronavirus pandemic because of its uplifting message of community support.\n\"Bill Withers is the closest thing black people have to a Bruce Springsteen,\" musician Quest Love told Rolling Stone in 2015.\nWithers passing was mourned Friday across musical genres and walks of life on Twitter.\nRest in power Bill Withers. Your voice, songs, and total expression gave us love, hope, and strength. My soul always has & always will be full of your music. Your humility displayed & depth of your power as you carried us all to a better place. You're still & always will be Bill. pic.twitter.com/mkpcSBfuZv — Lenny Kravitz (@LennyKravitz) April 3, 2020\nI'm very sad to hear about Bill Withers passing. Bill was a \"songwriter's songwriter\" and wrote so many great songs like \"Ain't No Sunshine\" and \"Lean On Me.\" A real loss. Love & Mercy to Bill's family. -- Brian pic.twitter.com/dUGAre6Bjt — Brian Wilson (@BrianWilsonLive) April 3, 2020\nRest In Peace, maestro Bill Withers.\nWhat a legacy.https://t.co/GBImqLRdPh — Lin-Manuel Miranda (@Lin_Manuel) April 3, 2020\nBill Withers, one of the absolute all-time greats has passed.\nThere is no more appropriate time to reflect on his words than now as we lean on each other. https://t.co/AMtWudUQv7 — Ivanka Trump (@IvankaTrump) April 3, 2020\n\"Rest in power Bill Withers. Your voice, songs, and total expression gave us love, hope, and strength,\" rocker Lenny Kravitz tweeted. \"My soul always has & always will be full of your music. Your humility displayed & depth of your power as you carried us all to a better place. You're still & always will be Bill.\"\nBorn in Slab Fork, West Virginia, Withers overcame a stutter as a child and joined the Navy as a teen.\nAfter a nine year stint in the military, Withers moved to Los Angeles in 1967 to pursue a career in music, taking a job at the Boeing aircraft company where he made toilet seats during the day.\nAt night Withers cut demos and eventually met the head of Sussex Records, the now famed music impresario Clarence Avant.\nWither's first album, \"Just As I Am,\" was released in 1971 and included the singles \"Ain't No Sunshine\" and \"Grandma's Hands.\"\n\"Ain't No Sunshine\" was a hit and in 1972 Withers took home a Grammy for the single.\nThat same year, \"Lean On Me,\" a song Withers wrote after being inspired by his childhood growing up in West Virginia, went to No. 1 on the R&B chart.\nThe hit has since been covered by several other artists, including Club Nouveau. Their version won Withers a Grammy in 1987 as the songwriter.\nThe song is also the theme for the 1989 Morgan Freeman film of the same name and was performed at the inaugurations for both President Bill Clinton and President Barack Obama.\nHis 1972 album, \"Still Bill,\" launched another hit with \"Use Me.\"\nA legal battle with Sussex led to him signing with Columbia Records where he recorded \"Lovely Day\" as part of the 1977 album, \"Menagerie.\" Withers co-wrote the 1980 hit \"Just The Two of Us,\" which he recorded with saxophonist Grover Washington, Jr. The tune won him his second best R&B song Grammy in 1981.\nWithers was inducted into the Rock and Roll Hall of Fame in 2015.\nHis songwriting ability was as hailed as his singing.\n\"We lost a giant of songwriting today,\" Paul Williams, president and chairman of the American Society of Composers, Authors and Publishers said in a statement. \"Bill Withers' songs are among the most treasured and profound in the American songbook -- universal in the way they touch people all over the world, transcending genre and generation. \"\n\"He was a beautiful man with a stunning sense of humor and a gift for truth,\" Williams added. \"I will miss him personally as will the entire ASCAP family. We love you, Bill. Our hearts go out to his family.\"\nIn 1973 Withers made headlines when he married \"Room 222\" actress Denise Nicholas but the couple divorced a year later.\nHe married Marcia Johnson in 1976 and is survived by her and their son and daughter, Todd and Kori.", "url": "https://www.cnn.com/2020/04/03/entertainment/bill-withers-obit/index.html"}