{"authors": ["Veronica Stracqualursi"], "date_download": "2020-05-04 16:07:05", "date_modify": "2020-05-04 16:07:05", "date_publish": "2020-04-02 13:27:54", "description": "More than 2,000 ventilators, a key piece of equipment to treat coronavirus patients, in the federal stockpile are unavailable to be deployed because the Trump administration failed to maintain the devices as they were in storage, according to The New York Times.", "filename": "2020_04_02_politics_trump-ventilators-stockpile-coronavirus_index_1588608425.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402092413-ventilator-nyc-0324-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_trump-ventilators-stockpile-coronavirus_index_1588608425.html", "title": "New York Times: 2,000 ventilators in federal stockpile don't work because of a maintenance lapse", "title_page": "New York Times: 2,000 ventilators in federal stockpile don't work because of a maintenance lapse - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) More than 2,000 ventilators, a key piece of equipment to treat coronavirus patients, in the federal stockpile are unavailable to be deployed because the Trump administration failed to maintain the devices as they were in storage, according to The New York Times.\nPresident Donald Trump said Tuesday that the federal government is withholding 10,000 ventilators from distribution because of an anticipated surge in Covid-19 cases. But an additional 2,109 ventilators are out of commission because maintenance of the devices was halted during a contracting dispute, the Times reported Wednesday.\nStates are scrambling for ventilators and requesting thousands of the devices from the federal government, only to receive a few hundred. Trump has insisted that states are requesting more ventilators than they need.\nWhen its contract with Vyaire Medical to maintain some of the stockpile ventilators expired at the end of August, the government awarded a broader contract to Agiliti, according to the Times.\nThat led Vyaire Medical to protest the decision and the contract dispute was not resolved until January, the Times reported.\nRead More", "url": "https://www.cnn.com/2020/04/02/politics/trump-ventilators-stockpile-coronavirus/index.html"}