{"authors": ["Mark Sherman"], "date_download": "2020-05-04 20:24:39", "date_modify": "2020-05-04 20:24:39", "date_publish": "2020-04-20 14:10:23", "description": "WASHINGTON (AP) — The Supreme Court ruled Monday that juries in state criminal trials must be unanimous to convict a defendant, settling a quirk of constitutional law that had allowed divided...", "filename": "_a4f065037299491913827b7d8eda9023_1588623879.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b4bbc2d94be0486185dabcaa626918a4/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a4f065037299491913827b7d8eda9023_1588623879.html", "title": "Supreme Court: Criminal juries must be unanimous to convict", "title_page": "Supreme Court: Criminal juries must be unanimous to convict", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - This is a Jan. 27, 2020 file photo of The Supreme Court in Washington. The Supreme Court has ruled that juries in state criminal trials must be unanimous to convict a defendant, settling a quirk of constitutional law that had allowed divided votes to result in convictions in Louisiana and Oregon. The justices’ vote Monday overturned the conviction of a Louisiana man who is serving a life sentence for killing a woman after a jury voted 10-2 to convict him. (AP Photo/Mark Tenally)\nFILE - This is a Jan. 27, 2020 file photo of The Supreme Court in Washington. The Supreme Court has ruled that juries in state criminal trials must be unanimous to convict a defendant, settling a quirk of constitutional law that had allowed divided votes to result in convictions in Louisiana and Oregon. The justices’ vote Monday overturned the conviction of a Louisiana man who is serving a life sentence for killing a woman after a jury voted 10-2 to convict him. (AP Photo/Mark Tenally)\nWASHINGTON (AP) — The Supreme Court ruled Monday that juries in state criminal trials must be unanimous to convict a defendant, settling a quirk of constitutional law that had allowed divided votes to result in convictions in Louisiana and Oregon.\nJustice Neil Gorsuch wrote for the court that the practice is inconsistent with the Constitution’s right to a jury trial and that it should be discarded as a vestige of Jim Crow laws in Louisiana and racial, ethnic and religious bigotry that led to its adoption in Oregon in the 1930s.\n“In fact, no one before us contests any of this; courts in both Louisiana and Oregon have frankly acknowledged that race was a motivating factor in the adoption of their States’ respective nonunanimity rules,” Gorsuch wrote.\nThe justices’ 6-3 vote overturned the conviction of Evangelisto Ramos . He is serving a life sentence in Louisiana for killing a woman after a jury voted 10-2 to convict him in 2016. Oregon is the only other state that allows for non-unanimous convictions for some crimes.\nLouisiana voters changed the law for crimes committed beginning in 2019.\nNow the same rules will apply in all 50 states and in the federal system: Juries must vote unanimously for conviction.\n“We are heartened that the Court has held, once and for all, that the promise of the Sixth Amendment fully applies in Louisiana, rejecting any concept of second-class justice,” Ramos’ lawyer, Ben Cohen, said in a statement. “In light of the COVID-19 crisis , it is essential that prisoners who are wrongfully incarcerated be given the chance for release as soon as possible.”\nThe Oregon District Attorneys’ Association said in a statement “that a change to unanimous verdicts could make criminal convictions more difficult. However, it is a hallmark of our justice system that it should be difficult to take someone’s liberty. “\nThe outcome will affect defendants who are still appealing their convictions. But for defendants whose cases are final, it will take another round of lawsuits to figure out whether the high court ruling applies to them.\nThe Supreme Court last took up the issue in 1972, when it ruled that nothing in the Constitution bars states from allowing some convictions by non-unanimous verdicts, even as it said that the Sixth Amendment requires unanimous verdicts in federal criminal cases. The case turned on the vote of Justice Lewis Powell.\nThe 1972 decision left the jury trial right as one of the few rights guaranteed by the first 10 amendments to the Constitution that does not apply uniformly to the states as well as the federal government. Last year, the court held that the Constitution’s ban on excessive fines applies to the states and the federal government alike.\n“There can be no question either that the Sixth Amendment’s unanimity requirement applies to state and federal criminal trials equally,” Gorsuch wrote Monday.\nThe decision produced an unusual lineup of justices, with liberals Stephen Breyer, Ruth Bader Ginsburg and Sonia Sotomayor and conservatives Brett Kavanaugh, Clarence Thomas and Gorsuch supporting Ramos.\nChief Justice John Roberts and Justice Samuel Alito, two conservatives, were in dissent along with liberal Justice Elena Kagan.\nThat’s because a key part of the case was whether to jettison the 1972 decision, and overturning precedent is a fraught issue on the current court, principally because the additions of Gorsuch and Kavanaugh have made the court more conservative and, perhaps, more likely to undermine landmark abortion rights rulings.\nGorsuch, Sotomayor, Kavanaugh, Thomas and Alito addressed the issue of precedent in majority, dissenting and concurring opinions. Kavanaugh has said that prior decisions must be not just wrong but egregiously so. The 1972 decision, he wrote Monday, “is egregiously wrong.”\nSotomayor said the old case was wrong both on the Sixth Amendment and in its ignorance of the bigoted roots of allowing non-unanimous verdicts. The case, she wrote, represents a “universe of one — an opinion uniquely irreconcilable with not just one, but two, strands of constitutional precedent well established both before and after the decision.”\nAlito, however, noted that some justices in Monday’s majority might find it more difficult to complain about abandoning other precedents. “I assume that those in the majority will apply the same standard in future cases,” he wrote.\n___\nAssociated Press writer Andrew Selsky contributed to this report from Salem, Oregon.", "url": "https://apnews.com/a4f065037299491913827b7d8eda9023"}