{"authors": ["Nicole Gaouette", "Ryan Browne"], "date_download": "2020-05-04 16:04:43", "date_modify": "2020-05-04 16:04:43", "date_publish": "2020-04-01 23:47:10", "description": "On a day when more than 800 Americans died of the coronavirus, President Donald Trump used his daily briefing on the pandemic to unveil seemingly unrelated counternarcotics operations that senior officials said would hurt embattled Venezuelan leader Nicolas Maduro.", "filename": "2020_04_01_politics_trump-coronavirus-military-drugs_index_1588608283.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401181557-operaciones-contra-narco-carteles-venezuela-acciones-washington-pandemia-sot-donald-trump-brk-00002925-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_trump-coronavirus-military-drugs_index_1588608283.html", "title": "Trump uses coronavirus briefing to unveil new military counternarcotics mission", "title_page": "Trump uses coronavirus briefing to unveil new military counternarcotics mission  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) On a day when more than 800 Americans died of the coronavirus , President Donald Trump used his daily briefing on the pandemic to unveil seemingly unrelated counternarcotics operations that senior officials said would hurt embattled Venezuelan leader Nicolas Maduro.\n\"Today the United States is launching enhanced counternarcotics operations in the Western Hemisphere to protect the American people from the deadly scourge of illegal narcotics,\" Trump said.\nThe announcement coincides with a renewed Trump administration push to oust Maduro, an effort that began in January 2019 and has yet to yield results. It also came on a day when the US registered the most deaths from the coronavirus in a single day, with at least 869 reported on Wednesday, bringing the total to 4,703.\nThe day before, Trump had delivered the starkest estimate of the pandemic's toll in the US, telling Americans that even if recommended distancing measures are followed closely, up to 240,000 Americans could die. The next two weeks, he added, will likely be \"painful\" and \"tough.\"\n'A record pace'\nSpeaking at the White House podium flanked by security officials, the President said Wednesday that \"in cooperation with the 22 partner operations, the US Southern Command will increase surveillance, seizures of drug shipments, and provide additional support for eradication efforts that are going on right now at a record pace.\"\nOperations will take place in the eastern Pacific Ocean and Caribbean Sea.\nThe military itself has been struggling to deal with the pandemic. The commander of the USS Theodore Roosevelt , a US Navy aircraft carrier where an outbreak of the coronavirus has spread to at least 70 sailors, warned in a dramatic memo Tuesday that decisive action was required to save the lives of the ship's crew.\n\"We are not at war. Sailors do not need to die,\" Capt. Brett Crozier wrote to the Navy's Pacific Fleet, three US defense officials have confirmed to CNN. \"The spread of the disease is ongoing and accelerating,\" he added.\nAs of Wednesday morning, 814 US service members have tested positive for the virus, while the first military death was announced Monday.\nSecretary of Defense Mark Esper drew a link between the pandemic and the new military operation, saying that criminal organizations are trying to capitalize on the fact that governments are distracted by the outbreak. \"Transnational criminal organizations continue to threaten our security\" and \"destroy lives,\" he said.\nEsper went on to say that this operation would hurt Maduro's grip on power in Venezuela.\n\"Furthermore, corrupt actors like the illegitimate Maduro regime in Venezuela rely on the profits derived from the sale of narcotics to maintain their oppressive hold on power. The Venezuelan people continue to suffer due to Maduro's criminal control of the country,\" Esper said.\nUS operations would focus on the \"eastern Pacific Ocean and the Caribbean Sea,\" Esper said, and would involve an array of military assets.\n\"Included in the force package are Navy destroyers and combat ships, Coast Guard cutters, P-8 patrol aircraft and elements of an Army Security Force Assistance Brigade. These additional forces will nearly double our capacity to conduct counternarcotics operations in the region,\" Esper said.\nWarships were focused on Beijing and Moscow\nDespite Esper's repeated insistence that the Pentagon is most focused on countering threats posed by China and Russia, the additional warships will be drawn from Indo-Pacific Command and European Command, the military commands focused on Beijing and Moscow.\n\"We came upon some intelligence some time ago that the drug cartels as a result of Covid-19 were going to try and take advantage of the situation and try to infiltrate additional drugs into our country,\" the chairman of the Joint Chiefs of Staff, Gen. Mark Milley, said Wednesday.\n\"We're at war with Covid-19, we're at war with terrorists and we are at war with the drug cartels as well,\" Milley said, adding, \"We will marshal whatever assets are required to prevent your entry into this country to kill Americans.\"\nThe Trump administration launched its latest effort to oust Maduro on Tuesday, leveraging the coronavirus pandemic to apply additional pressure.\n\"The United States has long been committed to finding a solution to the man-made crisis in Venezuela,\" Secretary of State Mike Pompeo said in a statement. \"The urgency for this has become all the more serious in light of the Maduro regime's failure to adequately prepare for and address the global COVID-19 pandemic.\"\nSpeaking at the State Department, Pompeo outlined a plan to establish a transitional government and, \"if the conditions of the framework are met,\" lift sanctions on Venezuela. The Maduro government rejected it almost immediately.\nThe US hopes its newly proposed framework will facilitate a democratic transition in Venezuela, more than a year after initial attempts to force Maduro from power. Those conditions include \"the departure of foreign security forces and elections deemed free and fair by international observers,\" Pompeo said.", "url": "https://www.cnn.com/2020/04/01/politics/trump-coronavirus-military-drugs/index.html"}