{"authors": ["Frank Pallotta", "Cnn Business"], "date_download": "2020-05-04 16:53:03", "date_modify": "2020-05-04 16:53:03", "date_publish": "2020-04-08 15:54:57", "description": "Netflix's \"Tiger King: Murder, Mayhem and Madness\" has been the talk of the pop culture world since the coronavirus outbreak forced people to stay inside. Now, we have an idea of how many people watched the wild documentary while stuck at home.", "filename": "2020_04_08_media_netflix-tiger-king-ratings_index_1588611183.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200316160850-tiger-king-netflix-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_media_netflix-tiger-king-ratings_index_1588611183.html", "title": "Here's how many people watched 'Tiger King' on Netflix", "title_page": "Here's how many people watched 'Tiger King' on Netflix - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Netflix's \"Tiger King: Murder, Mayhem and Madness\" has been the talk of the pop culture world since the coronavirus outbreak forced people to stay inside. Now, we have an idea of how many people watched the wild documentary while stuck at home.\nRoughly 34 million unique viewers watched the series over the first ten days of its release, according to measurement company Nielsen. This number does not include viewers outside of the United States, and it doesn't include viewing that happened exclusively on mobile, tablet or laptops. The series debuted on March 20.\nNetflix NFLX That's a big number for, but the show still lags behind the third season of \"Stranger Things,\" which brought in about 36 million viewers in the US in its first 10 days over the summer, according to Nielsen.\n\"Tiger King\" may not have set a record, at least by Nielsen's counting, but its viewership is still impressive.\nRead More", "url": "https://www.cnn.com/2020/04/08/media/netflix-tiger-king-ratings/index.html"}