{"authors": ["Heather Hollingsworth"], "date_download": "2020-05-04 20:26:57", "date_modify": "2020-05-04 20:26:57", "date_publish": "2020-04-10 13:52:49", "description": "MISSION, Kan. (AP) — The Kansas Supreme Court is set to convene Saturday for the first time ever via video conference to hear arguments on Gov. Laura Kelly’s lawsuit against legislative leaders...", "filename": "_cdcd1506ebec186039776191f91ddd9f_1588624017.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ea4a6b4544e64781b6ba29a5ab72452f/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cdcd1506ebec186039776191f91ddd9f_1588624017.html", "title": "Kansas Supreme Court will hear coronavirus case Saturday", "title_page": "Kansas Supreme Court will hear coronavirus case Saturday", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this March 25, 2020 file photo, Kansas Gov. Laura Kelly answers questions in her office at the Statehouse in Topeka, Kan. Gov. Kelly on Thursday, April, 9, 2020 filed suit after a legislative panel overturned her executive order that was aimed at stopping religious and funeral gatherings of more than 10 people. Kelly has asked the Kansas Supreme Court to expedite the case in hopes of getting clarity by Sunday, which is Easter. (AP Photo/John Hanna File)\nFILE - In this March 25, 2020 file photo, Kansas Gov. Laura Kelly answers questions in her office at the Statehouse in Topeka, Kan. Gov. Kelly on Thursday, April, 9, 2020 filed suit after a legislative panel overturned her executive order that was aimed at stopping religious and funeral gatherings of more than 10 people. Kelly has asked the Kansas Supreme Court to expedite the case in hopes of getting clarity by Sunday, which is Easter. (AP Photo/John Hanna File)\nMISSION, Kan. (AP) — The Kansas Supreme Court is set to convene Saturday for the first time ever via video conference to hear arguments on Gov. Laura Kelly’s lawsuit against legislative leaders who overturned her executive order banning religious and funeral services of more than 10 attendees during the coronavirus pandemic.\nThe Democratic governor filed the lawsuit Thursday after a Republican-dominated legislative panel overturned her order.\nKelly and the panel generally agree that worshipers should avoid gathering in large groups during the pandemic, but they disagree on whether the state has the constitutional authority to order it. Many churches have been conducting services online for weeks, and none have publicly announced plans to meet in person.\nRepublican Senate President Susan Wagle noted that Attorney General Derek Schmidt, also a Republican, said that although Kelly’s order was “sound public-health advice,” he was discouraging law enforcement agencies and prosecutors from attempting to enforce the requirements, citing the constitutional concerns.\n“Governor Kelly is playing politics with this lawsuit,” said Wagle, who also is a candidate for the U.S. Senate seat Republican Pat Roberts is vacating.\nAnd the lawmaker’s attorney wrote in a motion Friday that religious institutions were “abruptly targeted during Holy Week for harsh treatment.”\nLike Wagle, Kelly also blamed politics, tweeting Friday, “We must put aside political games and do what’s necessary to save lives.” Her attorneys argued that the state and country face “an unprecedented and immediate threat to public health” and that the legislature “unconstitutionally” sought to delegate its authority to the panel that overturned her order.\nThe arguments will be broadcast over YouTube. Besides being the first hearing conducted completely via video conference, it also may be the court’s first-ever Saturday hearing, said Kansas Supreme Court spokeswoman Lisa Taylor.\nThe number of confirmed cases of COVID-19 in the state grew Friday by 60 to 1,166. Kansas reported eight more deaths, bringing the total to 50. Kelly said at a news conference that she anticipated that the statewide stay-at-home order, which had been set to expire April 19, would be extended. She said she more details would be released next week.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia.\nIn instituting the now-overturned order earlier this week, Kelly initially said three religious gatherings had led to outbreaks of COVID-19, the disease caused by the coronavirus. Lee Norman, secretary of the Kansas Department of Health and Environment, announced Friday that a fourth church outbreak had since been identified. Three have died.\nHe said two of the religious outbreaks were in Wyandotte County, with one stemming from a ministers’ conference last month. The county has issued a new order discouraging gatherings of any size, but requiring that during in-person religious gatherings, individuals must remain in their vehicles and that materials, such as communion, should not be passed around or shared, The Kansas City Star reported.\nNorman said two others occurred in Sedgwick County. Because of the legal fight over the statewide order, the county has reinstated a local order limiting the size of public gatherings to groups of 10 or fewer, with no exemption for churches, synagogues, mosques, temples or other religious institutions.\nNorman urged people everywhere to stay home, noting that new research shows the virus is more easily transmissible than initially believed. He said that Johnson County, which is the site of 22% of the state’s cases, was starting more testing to determine how widespread the virus is in the population.\n“We cannot blink,” Norman said. “We have to keep pushing on this.”", "url": "https://apnews.com/cdcd1506ebec186039776191f91ddd9f"}