{"authors": [], "date_download": "2020-05-04 20:24:12", "date_modify": "2020-05-04 20:24:12", "date_publish": "2020-03-05 00:30:11", "description": "VIRUS COULD WEIGH ON TOY SHOPPING STARTING THIS SUMMER NEW YORK (AP) -From Baby Yoda to eco-friendly stacking rings, toymakers displayed an array of goods last week that they hope will be on...", "filename": "_6b4950aa9b6b4dd6952ab0315c7f3267_1588623852.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6b4950aa9b6b4dd6952ab0315c7f3267_1588623852.html", "title": "AM Prep-Cooler Copy", "title_page": "AM Prep-Cooler Copy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "VIRUS COULD WEIGH ON TOY SHOPPING STARTING THIS SUMMER\nNEW YORK (AP) -From Baby Yoda to eco-friendly stacking rings, toymakers displayed an array of goods last week that they hope will be on kids’ wish lists for the holiday 2020 season. The four-day Toy Fair comes as the U.S. toy industry has been whipsawed by a number of obstacles. The liquidation of Toys R Us in 2018 hurt impulse buying of toys. Then the U.S.‘s escalating trade war with China added costs to manufacturers’ supply network. And now, a spreading new virus is threatening to delay product launches and result in some shortages of seasonal toys starting in May. Still, parents will have plenty of toy choices.\nCAMPAIGN COVERAGE RESTRICTIONS END AT BLOOMBERG NEWS\nNEW YORK (AP) - It’s back to normal for political reporters at Bloomberg News. The service announced the end of restrictions on campaign coverage Wednesday with company founder Mike Bloomberg dropping out as a presidential candidate. When Bloomberg announced his candidacy in November, the news service responded by saying its political reporters would cover him but not do investigations into his wealth or record. To be fair, the same rules were applied to all Democratic candidates, but not to President Donald Trump since the Republican was the incumbent office-holder. Trump responded by banning Bloomberg reporters from campaign rallies. Bloomberg editor-in-chief John Micklethwait told his staff in a memo Wednesday that the same coverage rules would now apply to all of the remaining candidates.\nFIRST LADY HELPS HONOR WOMEN FROM 12 COUNTRIES FOR COURAGE\nWASHINGTON (AP) - Melania Trump is drawing parallels between her youth welfare initiative and a group of women from around the world whom the State Department has recognized for acts of courage. The first lady’s “Be Best” initiative is geared toward children. But Mrs. Trump says it “ties nicely” into the accomplishments of a dozen women with whom she shared the stage at a State Department ceremony on Wednesday. Mrs. Trump says children need positive support and guidance to grow up possessing the same empathy and strength shown by the recipients of the 2020 International Women of Courage Award.\nDOCTORS TRY 1ST CRISPR EDITING IN THE BODY FOR BLINDNESS\nScientists say they have used the gene editing tool CRISPR inside someone’s body for the first time. It’s a new frontier for efforts to operate on DNA, the chemical code of life, to treat diseases. The company that makes the treatment said a patient recently underwent the treatment at the Casey Eye Institute at Oregon Health & Science University for an inherited form of blindness. It may take up to a month to see if it worked. The treatment uses CRISPR to delete a mutation that is preventing a gene from making a protein that’s needed for sight.\nPOLICE: ‘PRANK’ LEADS TO ROAD RAGE, ATTACK ON PEDESTRIANS\nBURLINGAME, Calif. (AP) — Police in Northern California say two teenagers were seriously injured when a driver enraged by damage done to his car during a “prank” struck an innocent group of pedestrians he wrongly believed were responsible. Burlingame Police Lt. Laura Terada says two other teenagers had moderate injuries after the attack Saturday. She says the 18-year-old driver, Omeed Adibi, of San Mateo, has been arrested. She says Adibi believed that the four teens had tampered with his car and wanted to get back at them. But she says it was actually his own friends who damaged his car in a prank.\nJAPAN OPENS PART OF LAST TOWN OFF-LIMITS SINCE NUCLEAR LEAKS\nTOKYO (AP) - Japan’s government has opened part of the last town that had been off-limits due to radiation since the Fukushima (foo-koo-SHEE’-mah) nuclear disaster nine years ago. The move allows unrestricted access to a small part of Futaba but is an effort by the central government to show the region’s recovery ahead of the Tokyo Olympics. The town’s entire population of 7,000 was forced to evacuate when three reactors at a nearby nuclear plant melted down after being damaged by a massive earthquake and tsunami. Few people are expected to return since many have found new jobs and have settled in new places.", "url": "https://apnews.com/6b4950aa9b6b4dd6952ab0315c7f3267"}