{"authors": ["Karen Matthews", "Marina Villeneuve", "Michael Hill"], "date_download": "2020-05-04 20:07:50", "date_modify": "2020-05-04 20:07:50", "date_publish": "2020-04-16 15:07:10", "description": "NEW YORK (AP) — New York planned for a long fight against the coronavirus outbreak amid hopeful hospitalization trends. Gov. Andrew Cuomo extended stay-at-home restrictions Thursday through...", "filename": "_a16f00e18fbf7f39c9e8cc19b2c89f7c_1588622870.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9151ab3e157044feac436e6fa144645a/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a16f00e18fbf7f39c9e8cc19b2c89f7c_1588622870.html", "title": "Home restrictions on New Yorkers extended another month", "title_page": "Home restrictions on New Yorkers extended another month   ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A medical worker reacts as police officers and pedestrians cheer medical workers outside NYU Medical Center Thursday, April 16, 2020, in New York. (AP Photo/Frank Franklin II)\nA medical worker reacts as police officers and pedestrians cheer medical workers outside NYU Medical Center Thursday, April 16, 2020, in New York. (AP Photo/Frank Franklin II)\nNEW YORK (AP) — New York planned for a long fight against the coronavirus outbreak amid hopeful hospitalization trends. Gov. Andrew Cuomo extended stay-at-home restrictions Thursday through mid-May and New York City is getting ready to use 11,000 empty hotel rooms for coronavirus quarantines. Meanwhile, Mayor Bill de Blasio said the city is grappling with a projected $7.4 billion loss in tax revenue because of the crisis.\nHere are the latest coronavirus developments in New York:\nRESTRICTIONS EXTENDED\nNew York state will extend its stay-at-home restrictions at least through May 15 amid signs the initial wave of the coronavirus outbreak has stopped getting worse.\nCuomo said Thursday that virus transmission rates still need to be tamed as he prolonged rules that have left many New Yorkers working from home, or out of a job entirely, and unable to gather in public since March 22. The governor said the extension was made in consultation with other Northeast states and will be re-evaluated next month.\nThe number of people hospitalized statewide has ticked down to under 18,000, far below initial projections. But there are still close to 2,000 newly diagnosed people coming into hospitals daily, Cuomo said.\nNew York recorded 606 COVID-19-related deaths Wednesday, the lowest daily number in more than a week. More than 12,000 people have died statewide in just over a month.\n“This is still continuing at a really tragic, tragic rate,” Cuomo said at a press briefing.\nThough disruptive, Jeff Fila of suburban Albany said he understands the need for continuing the restrictions. The tech support specialist and his wife have been working from home and watching their 16-year-old boy and 13-year-old girl.\n“Considering all the challenges other people have, this is nothing. So I can deal with it,” Fila said. ”Other people have to go to work or have lost their jobs. I feel for them.”\nThe governor also said he’s expanding the requirement starting Friday night that all residents wear face coverings when they’re out in public and within 6 feet of other people. He said that in addition to being required on subways and buses, coverings must be worn by drivers and passengers in for-hire vehicles.\n____\nNEW PLAN FOR HOTEL ROOMS\nAfter initially lining up hotels to become temporary hospitals, the city is now planning to use the rooms as quarantine sites for some people in crowded apartments, for some homeless shelter residents and for health care workers who don’t want to risk infecting family members, de Blasio said.\nIn some communities where infection rates are high, some people are living in cramped multi-generational households, the mayor noted.\n“If there is a threat that someone might get infected in the home and it might spread amongst the members of that family, we have to guard against that,” he said.\nDe Blasio said the city will work with community health centers to identify who needs the service and will start moving people into hotel rooms April 22.\nInitially, “our projections told us we might have to use a vast number of hotels, dozens and dozens, to be able to accommodate all the medical needs,” he said. “So far, thank God, that has not been the case.”\nThe COVID-19 virus causes mild or moderate symptoms for most people. For some, especially older adults and people with existing health problems, it can cause more severe illness or death.\n___\nBUDGET CRUNCH\nNew York City may take a $7.4 billion budget hit over the next 15 months because of the coronavirus, de Blasio said Thursday as he detailed planned cuts and appealed to President Donald Trump and Congress for an infusion of cash for cities and states.\n“If you lead, the Senate will follow. If you are silent, they will not. It’s on you, Mr. President,” the Democrat said at a news briefing. He said he spoke Wednesday to the Republican president and told him “his hometown needs him.”\nThe city so far has spent over $700 million to handle the virus outbreak and expects to spend a total of $3.5 billion by the end of December, according to a news release from the mayor’s office.\nThe new spending has come as tax revenues are shrinking. The mayor’s new $89.3 budget proposal, released Thursday, trims projected tax revenue by $2.2 billion in the current budget year, and it’s $5.2 billion lower than his earlier plan for the fiscal year that begins in July.\nThe city has drawn on reserves, and it’s also saving on some programs because of virus-related shutdowns. But the mayor’s plan also calls for making a wide variety of trims: everything from delaying an expansion of its free prekindergarten program for 3-year-olds to reducing tree pruning, and from suspending a summer-job program for young people to closing city pools this summer.\nDe Blasio said layoffs or furloughs would be a last resort, but “honestly, that decision rests in Washington.”\n“Washington has to step in so we can provide basic services,” he said. “We must have that stimulus money, or else we’re going to have to make horrible choices.”\n___\nINMATES FREED\nNew York City officials say the city’s jail population has fallen to under 4,000 inmates, the lowest number since 1946, after officials granted early release to more than 1,000 high-risk inmates because of the pandemic.\nAt the beginning of March, there were 5,447 inmates in city jails, Mayor Bill de Blasio said.\nTwo city inmates have died from coronavirus.\nA public defender group, the Legal Aid Society, also sued the state prison system Thursday for the release of nine inmates it says are at risk in the viral outbreak because of other health problems.\n___\nMarina Villeneuve and Hill contributed from Albany, N.Y. Jennifer Peltz reported from New York.", "url": "https://apnews.com/a16f00e18fbf7f39c9e8cc19b2c89f7c"}