{"authors": ["Sara Ashley O'Brien", "Cnn Business"], "date_download": "2020-05-04 16:23:41", "date_modify": "2020-05-04 16:23:41", "date_publish": "2020-04-06 17:29:14", "description": "When Michelle, a rideshare driver for Uber and Lyft in North Carolina, came down with a fever and a cough in late March, she feared she might have coronavirus.", "filename": "2020_04_06_tech_lyft-uber-coronavirus-financial-assistance_index_1588609421.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403130818-03-lyft-car-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_tech_lyft-uber-coronavirus-financial-assistance_index_1588609421.html", "title": "Quarantined Lyft and Uber drivers are fighting for coronavirus pay", "title_page": "Quarantined Lyft and Uber drivers are fighting for coronavirus pay - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN Business) When Michelle, a rideshare driver for Uber and Lyft in North Carolina, came down with a fever and a cough in late March, she feared she might have coronavirus.\nA few days earlier, Michelle, who asked to be referred to only by her first name to protect her privacy, had transported a group of young people who had just returned from a trip to Florida, and also given a ride to people in town from New York, a hotbed of the virus , she said.\nHer doctor had her tested for both the flu and coronavirus and gave her a note instructing her to self-quarantine until the results came back. In the meantime, she applied for coronavirus financial assistance from Uber and Lyft.\nEven for those like Michelle who have been able to get access to coronavirus tests and doctor's notes -- neither of which are easy feats right now -- the process for getting assistance from companies like Uber and Lyft has been trying. Drivers say they've been given conflicting information about company policies and have had to hound customer support for updates. Some have resorted to tweeting at the companies, in addition to frequently calling and emailing, to draw attention to their claims.\nAnother gig worker, Laura Richey, said that after she was discharged from the ER, she received instructions to quarantine herself until coronavirus test results came back. \"That's when my fight started,\" she said. \"I was not only fighting for my health but fighting to get some [financial] assistance.\"\nGig workers have become critical lifelines in the economy during the pandemic, which has also made them vulnerable in terms of their possible exposure to the virus. Many can't afford to stay home but are getting little support from the companies they work for. Because these businesses largely treat gig workers as independent contractors, they don't receive benefits such as health insurance, paid time off or sick leave.\nIn the wake of the outbreak, many gig economy companies broke from their historical stance on worker benefits and pledged to offer a form of paid sick leave for the first time to those diagnosed with coronavirus or instructed to quarantine by a public health official. For Lyft, beyond that policy, there has been little clarity on its exact criteria for determining financial assistance.\nWhile Richey received an email last Sunday stating the company had deactivated her but did not have enough evidence to support her financial claim, Michelle received a rejection notice from Lyft customer support, reiterating the policy on its website as well as criteria she hadn't seen before. Per the notice, she would need to have driven an average of 20 hours weekly over the past 28 days before she applied.\nAfter pushing back and escalating the issue, including mentioning she was in touch with CNN Business about the additional criteria that was not detailed on Lyft's website, she was told there was a miscommunication and given $250. (Both she and Richey ultimately tested negative for the virus but had to quarantine until they received those results.)\nWhen asked about this, Lyft spokesperson Alexandra LaManna told CNN Business that \"qualification for the program and the amount of assistance are determined by the driver's previous activity on the Lyft platform, and payments range from $250 to $1,000.\"\nLyft has said it is basing its financial assistance on a driver's past month of activity on the platform. But, beyond that, the company had not previously disclosed how it determines who gets what.\nLaManna said drivers who've driven at least an average of five hours a week over the previous four weeks qualify for $250, while drivers who've worked an average of 37.5 hours or more over the same period would qualify for $1000. The current policy is in place until April 10, at which point Lyft will re-evaluate the program.\n\"This is an unprecedented situation and we are doing everything we can to meet the challenge,\" LaManna said. \"Over the past few weeks, we diverted team members away from other areas to handle these types of inquiries full-time -- and are actively adding more resources -- to help address these inquiries as quickly as possible.\"\nEven when companies have the right intentions, any struggle they have in figuring out or implementing their policy or in communicating it with drivers can seriously impact those workers. Every day matters for gig workers who often rely on that income to pay bills. While workers can apply for assistance through the newly passed Coronavirus Aid, Relief, and Economic Security Act, it could also be some time before people receive the support.\nRobert Poteete, an Uber driver in Tennessee, applied for the coronavirus pay after his doctor, whom he \"visited\" virtually, instructed him to self-quarantine because of his symptoms and provided him with a note. Uber first indicated he would receive a response in two to five business days, then two to seven business days, then two to 10.\nUber, whose policy is in place until April 6 at which time it will re-evaluate it, says it bases financial assistance on a driver's average daily earnings over the past six months. Based on examples released by the company, payouts could range from $400 for drivers with average daily earnings of $28.57 per day over that time to $1700 for those with earnings of $121.42 per day.\nSome gig workers, like Poteete and Richey, told CNN Business they went on Twitter to describe their experiences in the hopes of attracting the attention of the companies or, alternatively, reporters.\nIn a private message, Uber sent Poteete what appears to be an automated message saying that it is \"prioritizing safety concerns and other urgent issues.\" \"Well, what is mine?\" Poteete said he thought at the time. He even set up a GoFundMe while waiting for the company's response.\nOn his 11th day of quarantine, Poteete received a $700 deposit from the company. Richey said she received $170 from Uber.\n\"The unprecedented nature of this crisis has presented challenges for everyone - us included,\" said Uber spokesperson Kayla Whaling. \"We strive to provide the highest quality customer service and recognize we can do better. We're continuously gathering feedback from drivers and delivery people and are taking steps to help improve this process.\"", "url": "https://www.cnn.com/2020/04/06/tech/lyft-uber-coronavirus-financial-assistance/index.html"}