{"authors": ["Antonio Calanni", "Frances D'Emilio"], "date_download": "2020-05-04 20:25:20", "date_modify": "2020-05-04 20:25:20", "date_publish": "2020-04-20 07:11:17", "description": "MILAN (AP) — Every evening, when Pasqualina Conte returns home from a draining day as a nurse in a Milan emergency room for coronavirus patients, she longs to hold her 9-year-old son, Andrea. But...", "filename": "_69288e502efcc6dab4cb16c0398b90bf_1588623920.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c3667a36dcc442d48ae2f56df5437578/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_69288e502efcc6dab4cb16c0398b90bf_1588623920.html", "title": "Italian nurse and mom can't drop guard at home", "title_page": "AP PHOTOS: Italian nurse and mom can't drop guard at home", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "AP PHOTOS: Italian nurse and mom can't drop guard at home\nMILAN (AP) — Every evening, when Pasqualina Conte returns home from a draining day as a nurse in a Milan emergency room for coronavirus patients, she longs to hold her 9-year-old son, Andrea. But for 50 days and counting, the two have not hugged.\nAt sunrise, Conte has the breakfast table set. Barely an hour later, she will be slipping on her protective gear at San Carlo Hospital, one of the medical facilities at the epicenter of Italy’s COVID-19 outbreak in Lombardy. Schools are closed, so she drops Andrea off on her way to work at a friend’s.\nAndrea’s father left them when he was 3 months old, she says. At the outbreak intensified, Conte — in a state of panic — wanted to send Andrea to his grandparents in Italy’s south. But by the time the thought occurred to her, lockdown rules forbade such travel.\nWhen Conte and Andrea leave their home, each wears a mask and disposable gloves. She takes no chances even though she has repeatedly tested negative for the virus.\n“I could become positive from one moment to the other at work,” says Conte, who is 45.\nSome 30 nurses in Italy who contracted COVID-19 have died, according to an Italian nursing association. Conte wears a surgical mask at home, taking it off practically just to eat and sleep .\nHer day is packed: Patients to examine. Swab tests to administer. A video call from an isolated patient’s daughter. Some eight hours later, Conte slumps on a bench, then wipes away tears.\nFull Coverage: Photography\nLater, she will sit at the edge of her bed at home and explain what made her cry to an Associated Press photographer who documented her day.\nConte recalls how only she was able to adjust one patient’s pillows just right to make it easier for her lungs to do their work. Eventually, the woman needed to be connected to a respirator.\nConte says the woman told her she didn’t fear being sedated because, she said, “When I wake up, I’ll find you.” But recalling a doctor’s grim assessment of her patient’s chances, Conte chokes back tears: “She won’t wake up.”\nAndrea was angry when the emergency began. “He told me all the other parents were home” with their children, Conte says.\nSome nurses, Conte said, took leaves of absence. “The idea that I wouldn’t go (to work) because there was this emergency never in the least entered my head,” she says.\nWith time, Andrea has begun to see the situation differently. He has offered what’s in his piggy bank to help nurses like his mother.\n“Some days she returns a bit destroyed after work is finished,” Andrea says. “I’m proud of her, I’m very proud. She’s on the front line.”\nHearing Andrea say that is comforting, but it’s not the same as holding him. “For 50 days, there are no kisses, no hugs,” Conte says.\n___\nThis is the third story in a three-part series looking at front-line medical personnel at work and at home in Italy.\n___\nD’Emilio reported from Rome.\n___\nFollow AP coverage of the pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/69288e502efcc6dab4cb16c0398b90bf"}