{"authors": ["Jason Hoffman"], "date_download": "2020-05-04 16:19:45", "date_modify": "2020-05-04 16:19:45", "date_publish": "2020-04-04 22:36:05", "description": "President Donald Trump said Saturday that there could be a shortage of ventilators available to Americans as the coronavirus pandemic spreads across the nation.", "filename": "2020_04_04_politics_ventilators-trump-briefing-coronavirus_index_1588609185.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327193252-trump-ventilator-guarantee-cutie-pie-coronavirus-briefing-sot-tsr-vpx-00001011-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_politics_ventilators-trump-briefing-coronavirus_index_1588609185.html", "title": "Trump says shortage of ventilators is possible", "title_page": "Trump says shortage of ventilators is possible - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump said Saturday that there could be a shortage of ventilators available to Americans as the coronavirus pandemic spreads across the nation .\nWhen pressed by CNN's Jeremy Diamond at the White House coronavirus task force briefing as to whether there will be a shortage of ventilators in some cases, Trump said there \"could be\" as the country enters a critical phase in the fight against the pandemic.\n\"Could be. I mean, it could be you have shortages, and it could also be that you have some that have way overestimated the number of ventilators they need,\" Trump said, referring to the number of ventilators states have to combat the virus.\nThere are at least 305,820 cases of coronavirus in the United States and at least 8,291 American deaths, according to Johns Hopkins University's tally of cases in the United States . On Saturday, at least 27,867 new cases were reported, and at least 1,139 new deaths in the United States have been reported, according to the tally.\nTrump said without citing examples that he believes some states have asked for more ventilators than they will actually need. He then repeated the claim that the federal government has thousands of ventilators it can move to coronavirus hot spots if necessary.\n\"We have a good amount ready to move. I mean, literally, like an army, they're ready to move to any hot spot,\" Trump said.\nEarlier on Saturday, New York Gov. Andrew Cuomo noted the lack of ventilators in the federal stockpile, saying that the state has ordered 17,000 ventilators, which was a significant amount more than the government has to give out.\n\"On ventilators, remember we ordered 17,000 ventilators. To give you an idea of how many 17,000 is, the federal stockpile was about 10,000 ventilators for the nation. We ordered 17,000 just for the state of New York. And when we ordered the ventilators, we were paying for the ventilators,\" he said.\n\"So, trust me, you know, the situation — the financial situation of the state — we were not looking to spend a penny that we didn't have to spend. And we placed that order for the ventilators and we were paying for that order. That order never came through, and this goes back to the China situation.\"\nHe went on to clarify that New York had received some ventilators but not all of them.\n\"We are still gathering equipment because we're not at the apex,\" Cuomo said.\nThe President also added that they can move ventilators from places that won't be hit badly to those areas harder hit by the virus.\n\"What we're doing is we have a very good plan to take from some areas, even though we have the 10 or almost the 10,000, we're also taking from areas that won't be as badly hit as today we think they will be. There will be some areas hit harder than we think.\" Trump said.\nTrump reiterated his belief that states should have been building their reserve of ventilators.\n\"But a lot of hospitals, a lot of states had the chance of getting ventilators and they turned those ventilators down for -- so they could spend the money on something else, and in a way, I understand that because who thinks a thing like this? It's not a knock,\" Trump said.\nVice President Mike Pence said that supplies, including ventilators, are being prioritized to coronavirus hot spots.\n\"Our team at FEMA is doing a remarkable job working with governors, state health officials and local hospitals. Particularly focused on our priority areas. We'll prefer the New York metro area, which includes New Jersey and Connecticut. We're focused on the New Orleans metro area in Louisiana. We're focusing on Detroit, we're focusing on Chicago,\" Pence said.\n\"These are the areas where we see the significant rise in cases. And we are surging supplies, specifically ventilators, but all personal protective equipment from FEMA to those areas,\" he said.", "url": "https://www.cnn.com/2020/04/04/politics/ventilators-trump-briefing-coronavirus/index.html"}