{"authors": ["Amy Woodyatt", "Cnn Business"], "date_download": "2020-05-04 16:16:24", "date_modify": "2020-05-04 16:16:24", "date_publish": "2020-04-03 16:13:20", "description": "Google (GOOGL) is publicly releasing the data it's already collecting about people's movements during the coronavirus pandemic.", "filename": "2020_04_03_tech_coronavirus-google-data-sharing-intl-scli_index_1588608984.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403113214-google-logo-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_tech_coronavirus-google-data-sharing-intl-scli_index_1588608984.html", "title": "Google to release your location data to help fight coronavirus pandemic", "title_page": "Google to release your location data to help fight coronavirus pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) Google (GOOGL) is publicly releasing the data it's already collecting about people's movements during the coronavirus pandemic.\nThe company said it plans to publish a series of \"Community Mobility Reports\" to show the types of places people are visiting across 131 countries and regions. The first report was published on Friday.\nGoogle said in a blog post it hopes tracking movement trends over time and by geography could help shape and inform governments' and public health officials' response to the coronavirus pandemic.\nThe reports, which contain data from two to three days earlier, intend to spot trends in how people are behaving and responding to social distancing. Broken down by country and then by region, the reports will show if people are headed to retail and grocery stores, pharmacies, parks, workplaces and more. It'll also show how busy these places were before the pandemic.\nThe reports will be available for the duration of the pandemic, Google said.\nThe company said the findings are \"created with aggregated, anonymized sets of data from users who have turned on the location history setting, which is off by default\" in Google's services.", "url": "https://www.cnn.com/2020/04/03/tech/coronavirus-google-data-sharing-intl-scli/index.html"}