{"authors": [], "date_download": "2020-05-04 20:27:50", "date_modify": "2020-05-04 20:27:50", "date_publish": "2020-04-15 14:53:41", "description": "KANSAS CITY, Mo. (AP) — A Missouri man who investigators say was planning to bomb a Kansas City-area hospital was distressed by the government’s response to the coronavirus crisis and motivated by...", "filename": "_ad891a0e69f0e3d285c397a1626d1e0d_1588624070.html", "image_url": "https://storage.googleapis.com/afs-prod/media/187dbd7c3a604938b253d01acfcedbf5/2016.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ad891a0e69f0e3d285c397a1626d1e0d_1588624070.html", "title": "Government's response to virus spurred would-be bomber", "title_page": "FBI: Government's response to virus spurred would-be bomber", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This April 2020 photo shows the Belton Regional Medical Center in Belton, Mo. Newly unsealed court documents detail the FBI’s investigation into a violent confrontation last month with a Raymore man who investigators say was planning to bomb the Kansas City hospital. Timothy Wilson died March 24, 2020, in a firefight with FBI agents on a Belton street. The violent take-down followed a long-running domestic terrorism investigation that began in 2019. (Tammy Ljungblad/The Kansas City Star via AP)\nThis April 2020 photo shows the Belton Regional Medical Center in Belton, Mo. Newly unsealed court documents detail the FBI’s investigation into a violent confrontation last month with a Raymore man who investigators say was planning to bomb the Kansas City hospital. Timothy Wilson died March 24, 2020, in a firefight with FBI agents on a Belton street. The violent take-down followed a long-running domestic terrorism investigation that began in 2019. (Tammy Ljungblad/The Kansas City Star via AP)\nKANSAS CITY, Mo. (AP) — A Missouri man who investigators say was planning to bomb a Kansas City-area hospital was distressed by the government’s response to the coronavirus crisis and motivated by racial, religious and anti-government animus, according to newly unsealed court documents.\nTimothy Wilson, 36, of Raymore, died March 24 in a firefight with FBI agents serving a probable cause arrest warrant on a Belton street. The plot was reminiscent of the 1995 bombing of a federal building in Oklahoma City. Wilson first talked of plans for an attack in April or June, but FBI agents say he moved up that timeline as the coronavirus made its way to Missouri.\nThe violent take-down followed a long-running domestic terrorism investigation that began in 2019 with Wilson’s encrypted communications about bomb-building with Jarrett William Smith, a 24-year-old Army infantry soldier who faces prison for distributing bomb-making information through social media.\nAmong details in court records unsealed last week was that Wilson considered attacking the University of Kansas Hospital in Kansas City, Kansas, before settling on a plan to park a vehicle loaded with explosives and detonate it in the parking lot of Belton Regional Medical Center in Cass County, the Kansas City Star reported .\nJust two days before his death, Wilson and an undercover FBI agent visited Belton Regional to inspect the hospital property and conduct a dry run of their plot, court records say.\nThe records show that for months, Wilson had discussed ideas for a terrorist attack, telling an undercover FBI agent that he was considering sites ranging from a nuclear plant and Islamic centers in Missouri to the Walmart headquarters or a synagogue in Arkansas. He also discussed last year shooting up a predominantly black elementary school, the FBI said in the affidavits.\nAgents said that in January, Wilson started buying “explosive precursors” to a bomb, including nitrogen, ammonium nitrate and another type of fertilizer that can be combined to make a bomb.\nFirst, on Jan. 30, Wilson bought two 5-pound (2.3 kilogram) bags of urea, a nitrate commonly used in improvised explosive devices. The following day, Wilson bought a combined 60 pounds (27 kilograms) of ammonium nitrate and another type of fertilizer that, when combined, could be used to develop an explosive device.\nAmmonium nitrate was a main ingredient Timothy McVeigh used to blow up the Alfred P. Murrah Federal Building in Oklahoma City on April 19, 1995, that killed 168 people. The 25th anniversary of the attack is being marked this weekend.\nSmith, Wilson’s contact on bomb-making, was a private first class stationed at Fort Riley, Kansas. He admitted during a court hearing in February to providing information about explosives to an FBI undercover agent and signed a formal plea agreement with prosecutors in court. He faces up to 40 years in prison when he’s sentenced later this year.", "url": "https://apnews.com/ad891a0e69f0e3d285c397a1626d1e0d"}