{"authors": ["Donald Judd", "Ali Zaslav", "Daniella Diaz"], "date_download": "2020-05-04 17:00:58", "date_modify": "2020-05-04 17:00:58", "date_publish": "2020-04-10 10:02:26", "description": "The nurses of Harlem Hospital have had enough.", "filename": "2020_04_10_politics_n95-masks-coronavirus-pandemic_index_1588611658.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407160231-01-hospital-volunteers-mask-repair-trnd-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_n95-masks-coronavirus-pandemic_index_1588611658.html", "title": "Faced with shortages, hospitals and companies work to extend use of N95 masks", "title_page": "Faced with shortages, hospitals and companies work to extend use of N95 masks  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "\"This isn't a sob story. This is not a story about desperation, this is a story about the fight for our lives. And what you see here today is that fight,\" Sarah Dowd, a registered nurse at Harlem Hospital, told reporters gathered in front of the beleaguered hospital Monday.\n\"We're not here to cry. ... This is a tragedy without a doubt, but we're here to fight, because we deserve better, everyone that works in this hospital deserves better,\" Dowd said, \"including a new N95 mask for every shift, rather than the existing policy of one N95 for five shifts, which is about 60 hours of work with the same mask. There's no data that suggests that masks are effective with this duration of use.\"\nThe mask and supply shortage crisis continues to be a critical issue for front-line workers in Massachusetts as well, said Claire O'Connell, an intensive care unit nurse treating coronavirus patients at Brigham and Women's Hospital in Boston.\n\"There are people reusing masks or they'll be told they don't have any to give you,\" she said referring to nurses across the city and state. \"It's ridiculous.\"\nThe dearth of protective equipment has some in the private sector looking into methods to safely reuse masks for front-line medical workers.\nResearchers at Michigan State University created a new process to clean N95 masks for reuse with a protocol that heats them in a commercial oven. The team at the university -- together with Sparrow Health System, a health care organization in Michigan -- aims to decontaminate between 4,000 and 8,000 respirator masks per daywith a pro cess that only takes about 45 minutes. The team says the decontaminated mask offers the same protection a new N95 mask would.\n\"It's a game changer for us,\" said Jim Dover, the CEO of Sparrow Health System. \"By coming up with a way to reuse the masks up to 20 times without any degradation, this protocol, it basically moves us from a 25-day supply on hand, up to 400.\"\nAs a result, Dover said, \"We're no longer subject to what I'm going to call extortion prices from offshore manufacturers. We now have reliability.\"\nMSU researchers confirm the decontaminated mask offers the same protection a new N95 mask would for at least 10 wears, but it's still being tested.\nDr. Samuel Stanley, president of Michigan State University, says dire shortages in PPE for front-line workers in Michigan hospitals prompted the university to investigate ways to help.\n\"Michigan has been really at the forefront of this disease ... and as it's happened with a number of states, our ability to provide personal protective equipment for people on the front lines has lagged significantly,\" Stanley said.\nRep. Elissa Slotkin, a Democrat from Michigan who worked with her Republican colleague Rep. Fred Upton to pressure the US Food and Drug Administration leadership to streamline the mask-cleaning application, said this sanitizing process has become so much more critical over the past 96 hours, \"because we're hitting the peak of our cases.\"\n\"It's increasingly difficult to get things out of China and a sanitizing process that's approved by the FDA is something that we can control,\" Slotkin said. \"It's something that we can scale up.\"\nThe research team said they also plan to open source the process, which can greatly increase supply by at least 10 times and up to 20 times per N95 respirator.\n\"That's one of the potentials of this protocol,\" Jeff Dwyer, Michigan State University Extension director, told CNN. \"There are ovens like this in many different places around the country, around the state of Michigan, and in fact around the world.\"\nAt the same time, Slotkin said on Thursday she's working on identifying \"all the commercial baking ovens in the state and put them on alert\" that if we get FDA approval, they can immediately follow the procedure and start sanitizing N95 masks.\nMeanwhile, Batelle Memorial Institute, an Ohio-based research and development firm, has been partnering with states like California and Massachusetts to deploy a newly developed machine that decontaminates N95 masks using vaporized hydrogen peroxide.\nMark Ghilarducci, director of the California Governor's Office of Emergency Services, announced the state of California would utilize the new technology to address personal protective equipment shortages across the Golden State.\n\"It's a technology that is designed to get on the ground, and actually bring in a used N95 mask and do a sterilization and cleaning process that makes them basically new again,\" Ghilarducci told reporters Wednesday. \"And this is new technology that has been certified by the FDA, and CDC, and it will be here in California, here within the next week. As capability, we'll have the ability to clean up to 80,000 masks per day.\"\nRep. Joe Kennedy, a Democrat from Massachusetts, told CNN Thursday that as the state is expecting a surge in coronavirus patients in the next 10 days, technology like Battelle's will be instrumental in meeting need.\n\"That's where you've seen hospitals like Mass General that acquired a machine that sterilizes 80,095 N95 masks a day, which alleviates a huge burden on the acquisition of new masks.\"\nHe added that it's not to say the state won't need more medical supplies down the line, but the most urgent need is right now before the surge.\nLewis Von Thaer, Battelle's CEO, told CNN Wednesday the company's machine, which extends the use of N95 masks has been fast tracked by the FDA and is ready to deploy to states as early as this week.\n\"We proved that we could reuse these masks, basically decontaminate them for reuse up to 20 times with no degradation,\" he said on CNN International's \"First Move.\" \"This has been a team effort not just from our team but the FDA, our local politicians and others have helped because of the emergency. And everyone just came together to do this as quickly as possible.\"\nLast month, Ohio Gov. Mike DeWine urged President Donald Trump to fast track the approval of the FDA for the machine.\nTrump took to Twitter to express \"hope\" that the \"FDA can approve Mask Sterilization equipment ASAP.\"\nThe CEO of Cool Clean Technologies, a company that has a patented system for cleaning medical devices, told CNN he is working on a process that would clean the masks (and in effect, sterilize them) so they can be reused.\n\"The difference with our approach is we use liquid CO2 to actually clean the N95 masks,\" Jon Wikstrom told CNN in a phone interview. \"We commercialized this for the dry-cleaning industry, combination of environmentally friendly solvent, cleaning and extraction of the solvent, which has proven to be an excellent cleaning system.\"\n\"It's the right thing to do,\" he told CNN. \"I know we can clean them, I know we can do it gently and recover a big number of these masks -- it's a little bit like \"Field of Dreams\", we have these machines, let's do it.\"", "url": "https://www.cnn.com/2020/04/10/politics/n95-masks-coronavirus-pandemic/index.html"}