{"authors": ["Steve Reed"], "date_download": "2020-05-04 20:16:09", "date_modify": "2020-05-04 20:16:09", "date_publish": "2020-04-08 20:12:47", "description": "CHARLOTTE, N.C. (AP) — First-year head coach Matt Rhule said Teddy Bridgewater’s familiarity with the team’s offensive scheme made him the “right fit” at quarterback for the Carolina Panthers and...", "filename": "_861f755ae21dbaaa6f28192f74706075_1588623369.html", "image_url": "https://storage.googleapis.com/afs-prod/media/921eee5d14eb476f9a37b7a49afb4c65/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_861f755ae21dbaaa6f28192f74706075_1588623369.html", "title": "Bridgewater was 'right fit' because he knows offense", "title_page": "Rhule: Bridgewater was 'right fit' because he knows offense", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHARLOTTE, N.C. (AP) — First-year head coach Matt Rhule said Teddy Bridgewater’s familiarity with the team’s offensive scheme made him the “right fit” at quarterback for the Carolina Panthers and ultimately leading to Cam Newton’s release .\nBridgewater spent the 2018 season working under new Panthers offensive coordinator Joe Brady with the New Orleans Saints and the two developed a close player-coach relationship .\n“His relationship with Joe, knowing the offense, the things that he has done in this offense just made sense to us,” Rhule said.\nRhule didn’t directly answer whether Newton’s history of shoulder and foot injuries played a role in the decision.\nRhule called Newton a “great quarterback who can play in any system,” but added that Bridgewater’s built-in knowledge of Brady’s playbook — one that helped LSU win a national championship last season — will be helpful for the Panthers in what is expected to be a dramatically shortened offseason because of the coronavirus pandemic and the need for social distancing.\nThe Panthers are one of five teams that hired new coaches and were slated to begin a “virtual” offseason workout program Monday, but the league decided to delay the start until more details can be worked out.\n“In a year like this especially where we are all in our homes, I think Teddy is a guy who has been in this offense, knows this offense and had great familiarity with Joe,” Rhule said. “It just made sense to us.”\nNewton is a free agent for the first time in his nine-year NFL career, and recently said he feels like a fish out of water .\nThere has been no indication where he might play this season.\nRhule called the decision to release Newton, the Panthers’ No. 1 pick in the 2011 draft, a difficult one. He said he developed incredible respect for the 2015 league MVP in the brief time he spent with him this offseason.\n“I have no doubt that he will play well,” Rhule said of Newton. “He is a great quarterback and we have all seen the things that he has done. I just think as we move forward we thought this was the right time for us. We saw the opportunity to get Teddy and really felt like he was the right fit for us.”\nWhile the Panthers gave Bridegwater a three-year, $63 million contract , Rhule added the team wouldn’t rule out drafting a quarterback.\nThe Panthers have the seventh overall pick in the draft.\n“I don’t know if that’s our focus right now, a first-round quarterback, but at the end of the day if a guy drops in your lap that you think, at any position, you think can change your team. ...” Rhule said.\n“When you draft you’re not drafting for the next 12 months, you’re drafting for the next four to five to six years, and hopefully on.”\nRhule also said:\n— The Panthers’ biggest area of need entering the NFL draft is adding depth on the defense.\n— He was thrilled to sign Browns defensive back Juston Burris , someone the team had targeted since day one of the offseason.\n— He hasn’t decided if Shaq Thompson or free agent pickup Tahir Whitehead from the Raiders will play middle linebacker. He feels as if both have the flexibility to play that position in what he views will be a “position-less” defense.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/861f755ae21dbaaa6f28192f74706075"}