{"authors": ["Nic Robertson", "Mick Krever", "Cnn Business"], "date_download": "2020-05-04 16:15:38", "date_modify": "2020-05-04 16:15:38", "date_publish": "2020-04-03 16:04:50", "description": "Formula One teams based in the United Kingdom are racing to produce thousands of ventilators desperately needed by the country's National Health Service.", "filename": "2020_04_03_tech_f1-teams-coronavirus_index_1588608938.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403095653-f1-williams-car-racing-0227-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_tech_f1-teams-coronavirus_index_1588608938.html", "title": "F1 teams are lightning fast, highly skilled and available. Here's how they're fighting coronavirus", "title_page": "F1 teams are lightning fast, highly skilled and available. Here's how they're fighting coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) Formula One teams based in the United Kingdom are racing to produce thousands of ventilators desperately needed by the country's National Health Service.\nBuilt for speed, and with engineering expertise to spare, the racing teams are proving to be powerful weapons in the fight against coronavirus\nSeven teams including Aston Martin Red Bull, McLaren, ROKiT Williams and Mercedes-AMG Petronas have joined a manufacturing consortium that aims to ramp up production of ventilators to 1,500 units a week.\nThe group, which includes industrial giants such asand, says its members have already received orders from the government for over 10,000 of the devices.\nTheir contribution would be welcomed by a government that has only 8,000 ventilators on hand, and that has faced withering criticism over its coronavirus communication and testing strategies . There have been than 38,000 confirmed cases of coronavirus in the United Kingdom and over 3,600 deaths.\nWith the start of the racing season delayed by the pandemic , and eight contests either canceled or postponed, F1 teams are jumping into the effort.\nJames White, a spokesperson for the Ventilator Challenge UK consortium, said the racing teams are perfectly suited to the mission. \"F1 teams are used to operating under intense time pressures, which is clearly what we are doing right now,\" he said.\nUK Health Secretary Matt Hancock, who has himself tested positive for coronavirus, touted the success of the consortium on Friday, boasting during a radio interview that the group has already produced 560 ventilators.\nA Williams car in testing in Barcelona, Spain.\nTim Bampton, communications director at McLaren, said \"the speed at which it came together was phenomenal.\" With industrial giants bringing \"scale and medical expertise\" to the consortium, he said the F1 teams can focus on what they do best: moving very quickly.\nIn their normal work, everything the teams do is geared around innovation and urgency, he said. \"We develop cars for every race\" and use \"rapid prototype systems\" that rely on a global network of \"100 different suppliers who are used to dealing with us, used to our fast pace,\" added Brampton.\nAnd while the public rarely gets a look behind the scenes, the teams' logistical and back office operations are extremely sophisticated. \"Planning, program management, purchasing, procurement and machine shop\" are all honed for speed, Bampton said.\nBampton said the teams, normally fierce competitors, are now acting as one. His engineers will be overhauling their machine shop to make components for ventilators, as well as \"designing and building end of [production] line test equipment.\" Another task: producing trolleys that can move ventilators to patients in need.\nBreathing aids and missteps\nF1 engine manufacturer Mercedes has meanwhile teamed up with clinicians and university engineers in London to design a breathing aid for coronavirus patients. The Continuous Positive Airway Pressure (CPAP) devices could help buy hospitals more time until more ventilators can be produced.\nCPAP devices, which push air and oxygen into the mouth and nose at a continuous rate, have been used in hospitals in China and Italy to treat coronavirus infections, with reports indicating that roughly half of such patients have avoided the need for ventilators.\nFollowing clinical trials, Mercedes and other F1 teams could produce up to 1,000 per day.\nLando Norris driving for McLaren F1.\nYet the UK efforts to bring private industry into the fight against coronavirus have suffered some false starts.\nGtech, a British manufacturer of vacuum cleaners, was asked by the government to come up with a ventilator design. The company quickly came up with the required schematics, and was ready to start production when the government changed tack and said it needed a different type of device.\n\"I was asked: could we produce up to 30,000 in two weeks?\" Gtech founder Nick Grey told CNN Business last week. \"I put together a design that we could ... go into mass production in 24 hours notice.\"\nBut the government never gave its go ahead. \"What became apparent over the following week was that people needed a different kind of ventilator,\" Grey said.\nThe Gtech design mimicked human breath by compressing a rubber bag; instead, Grey said the government belatedly realized it needed CPAP devices similar to the ones designed by Mercedes.\nWhen asked about this discrepancy, a spokesperson for the UK government directed CNN Business to a statement, which said in part that the government was \"currently working with expert clinicians and health regulators to test all new machine designs, as patient safety is of paramount importance.\"\nTesting kits next?\nHancock, the health secretary, doubled down on his enthusiasm for the ventilator consortium on Friday, saying the same strategy could be applied to manufacturing coronavirus test kits.\n\"People will throw their rocks and make their criticisms,\" he told BBC Radio. \"What we are trying to do leading the nation through this is work out every single moment, what is the best we can do, and if people come forward with ideas we haven't thought of great.\"", "url": "https://www.cnn.com/2020/04/03/tech/f1-teams-coronavirus/index.html"}