{"authors": ["Frida Ghitis"], "date_download": "2020-05-04 16:17:34", "date_modify": "2020-05-04 16:17:34", "date_publish": "2020-04-03 23:48:29", "description": "If ever there were a time for big government, for ambitious programs, for a central role for federal authorities, for qualified people in government it is right now. Instead, writes Frida Ghitis, we have the President's callous son-in-law chastising states for seeking help with coronavirus and demonstrating the administration's hostility to its fundamental responsibility.", "filename": "2020_04_03_opinions_jared-k_c3fbedb8a9b8dc6958571afd2748727d_index_1588609054.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403180418-jared-kushner-ghitis-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_opinions_jared-k_c3fbedb8a9b8dc6958571afd2748727d_index_1588609054.html", "title": "Jared Kushner's spine-chilling new role", "title_page": "Jared Kushner's spine-chilling new role (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Frida Ghitis, a former CNN producer and correspondent, is a world affairs columnist. She is a frequent opinion contributor to CNN, a contributing columnist to the Washington Post and a columnist for World Politics Review. Follow her on Twitter @fridaghitis. The opinions expressed in this commentary are those of the author. Read more opinion on CNN.\n(CNN) President Donald Trump's son-in-law and adviser, Jared Kushner, seldom speaks to the public. Now we know why. When he stood at the White House podium on Thursday, what Americans heard was a spine-chilling performance from a believer in small government, delivered at a time when only big government can save the day.\nOf all the times to have a global pandemic, did it have to happen during the reign of an administration that wants to shrink the government to a fraction of its ability? Did it have to come under a president who has no respect for crucially relevant expertise or qualifications, who has surrounded himself with people whose principal talent is their ability to pay him public homage?\nIf ever there were a time for big government, for ambitious programs, for a central role for federal authorities, it is right now. If ever there were a time for qualified people in government, it is now.\nKushner's translucent presence -- his affect, bereft of even the slightest hint of empathy, in perfect synchrony with his callous words -- was a spectacle suitable for our nightmarish times.\nNow we know why Trump has put him in charge of so many intractable problems. Kushner is afflicted by a superabundance of unwarranted self-confidence . He is an introverted Trump; arrogance without flamboyance.\nKushner chastised governors, with citizens literally gasping for air, for asking the federal government to help find life-saving ventilators. \"Don't ask us for things when you don't know what you have in your own state. Just because you're scared, you ask your medical professionals and they don't know,\" he reprimanded.\nAt one point, he suggested that the federal stockpile of emergency medical supplies is not meant for the states, \"It's supposed to be our stockpile,\" he said. It's unclear who he meant by \"our.\"\nIt is a well-documented fact that Trump populated countless government positions with people utterly unqualified for their jobs. It comes as no surprise, then, that the rollout of emergency programs is proving less than impressive. Millions of Americans have already lost their jobs just a few weeks into the pandemic, so Congress moved fast to enact trillions of dollars in relief legislation.\nMany government professionals are doing their best in an unprecedented emergency, but the early days of the rescue plan are not encouraging. Suddenly-unemployed restaurant workers with families to feed may not get the promised $1,200 check for months. Despite vows to get money in people's pockets within two weeks, it looks like it could take up to 20 weeks -- that's about four months -- to mail out all the checks.\nSmall businesses wondering if help will arrive in time to avert bankruptcy saw hope when Treasury Secretary Steven Mnuchin said on Thursday that emergency loans would be available starting the next day. But just as he spoke, banks said they still need guidance from the Small Business Administration before they can disburse funds.\nThe programs are enormous. Perhaps the problems can be solved soon.\nBut there's no excuse for the incompetence and delays during this coronavirus crisis that have come as a direct result of Trump & Co.s' disdain for government.\nThe inescapable reality is that some challenges are so daunting that only the government can mount an effective response; some so cataclysmic than only the federal government has the muscle to do it.\nGabriel Sherman, in Vanity Fair, wrote that it was reportedly Kushner who told Trump that, \"I'm doing my own projections...New York doesn't need all the ventilators,\" according to a person present at a recent White House meeting on the issue. Cuomo explained, during a CNN town hall on the coronavirus: \"It's very simple: A person comes into the ICU unit. They need the ventilator, or they die.\" The help may be coming, but not without delay.\nIf the federal government were in good hands, it would have taken charge of the crisis much earlier. Trump wouldn't have resisted urgent calls to enact the Defense Production Act weeks ago, when the Chamber of Commerce persuaded him not to use his power to command production of ventilators\nNow states, watching the tidal wave of cases surge in their direction, are scrambling to secure the necessary supplies. Incredibly, they are competing against each other , and now competing against the Federal Emergency Management Agency -- FEMA.\nOn CNN Thursday, Cuomo made a suggestion so practical, so logical, it's hard to believe it has not been put in place. Instead of everyone simultaneously struggling to acquire the same products -- even from China, no less -- why not have a rolling deployment of supplies, distributed where they are needed, as the pandemic crests in different states at different times.\nImagine a pro-active, efficient, transparent and trustworthy administration, coordinating the purchase, production and distributing of ventilators and protective equipment to the places where they are needed, and arranging transportation of surplus from one state to another, as the need emerges.\nThe good government that we wish we had would have also ensured that everyone has health insurance. Incredibly, Trump rejected a proposal Thursday to reopen Obamacare enrollment so that uninsured Americans could get coverage amid projections that millions could become ill. Even health insurance companies were pushing for this, but Trump said no.\nThe White House says it's exploring other options, but it's unclear what those might be. With millions losing their jobs, and most people's insurance linked to employment, the number of uninsured could soar at the worst possible time.\nWith a more competent administration, the Navy hospital ships deployed with so much fanfare would not be floating mostly empty, as patients mass in overflowing hospitals. \"A tangle of military protocols and bureaucratic hurdles has prevented the Comfort from accepting many patients at all,\" reported the New York Times.\nFollow CNN Opinion Join us on Twitter and Facebook\nWithout a strong, big government, even paragons of capitalism, the country's iconic corporations, could disappear. Thanks to a stimulus, taxpayers are saving them. The government should be saving the taxpayers, their livelihoods, their lives.\nBut this government doesn't believe much in government. Early on it had promised to \"deconstruct\" the sinister-sounding \"administrative state.\" It's become painfully apparent how much we need experienced administrators.\nTo paraphrase a figure from another crisis, you go to a pandemic with the government you have. We can only hope this administration will get better fast, and then we should try to have a better government before the next crisis.", "url": "https://www.cnn.com/2020/04/03/opinions/jared-kushners-spine-chilling-new-role-ghitis/index.html"}