{"authors": ["David Brandt"], "date_download": "2020-05-04 20:10:34", "date_modify": "2020-05-04 20:10:34", "date_publish": "2020-04-16 16:32:29", "description": "TEMPE, Ariz. (AP) — An active offseason has transformed Arizona's roster from a problem-riddled puzzle to a potential playoff contender. Now the Cardinals have another chance to add to the...", "filename": "_b978d977e884b910d360fc1b17136f0f_1588623034.html", "image_url": "https://storage.googleapis.com/afs-prod/media/cd5144ff20f44751b0a53c9983b99d8c/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b978d977e884b910d360fc1b17136f0f_1588623034.html", "title": "Bold offseason moves mean Cardinals have options at No. 8", "title_page": "Bold offseason moves mean Cardinals have options at No. 8", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this July 24, 2019, file photo, Arizona Cardinals coach Kliff Kingsbury, right, talks with general manager Steve Keim as players on the NFL football team run sprints in Glendale, Ariz. Keim has been widely praised over the past few weeks after adding elite receiver DeAndre Hopkins in a trade and signing three potential defensive starters. The moves have given Arizona a lot of flexibility for the upcoming draft, eliminating the gaping holes that needed immediate attention. “We feel like we’re free to take the best available pick that comes at the No. 8 spot,” Kingsbury said. “That’s a tribute to Steve and the job that he’s done in the offseason.” (AP Photo/Ross D. Franklin, File)\nFILE - In this July 24, 2019, file photo, Arizona Cardinals coach Kliff Kingsbury, right, talks with general manager Steve Keim as players on the NFL football team run sprints in Glendale, Ariz. Keim has been widely praised over the past few weeks after adding elite receiver DeAndre Hopkins in a trade and signing three potential defensive starters. The moves have given Arizona a lot of flexibility for the upcoming draft, eliminating the gaping holes that needed immediate attention. “We feel like we’re free to take the best available pick that comes at the No. 8 spot,” Kingsbury said. “That’s a tribute to Steve and the job that he’s done in the offseason.” (AP Photo/Ross D. Franklin, File)\nTEMPE, Ariz. (AP) — An active offseason has transformed Arizona’s roster from a problem-riddled puzzle to a potential playoff contender.\nNow the Cardinals have another chance to add to the momentum with the No. 8 pick in the NFL draft.\nCardinals GM Steve Keim has been widely praised over the past few weeks after adding elite receiver DeAndre Hopkins in a trade and signing three potential defensive starters. The moves have given Arizona a lot of flexibility for the upcoming draft, eliminating the gaping holes that needed immediate attention.\n“We feel like we’re free to take the best available pick that comes at the No. 8 spot,” Arizona coach Kliff Kingsbury said. “That’s a tribute to Steve and the job that he’s done in the offseason.”\nArizona still has a few positions that could use upgrading, including right tackle. Last year’s fill-in starter Justin Murray did a decent job after expected starter Marcus Gilbert missed the entire season with a knee injury. Both players are back this fall, but the Cardinals could seek a long-term answer at the position.\nThis year’s draft is full of offensive tackle prospects who could be on the board at No. 8, including Alabama’s Jedrick Wills Jr., Iowa’s Tristan Wirfs and Louisville’s Mekhi Becton. The Cardinals could also add another player on the defensive line and someone like Auburn’s Derrick Brown might make sense for the roster.\nWhoever the Cardinals add will join a team that clearly feels it’s headed in the right direction. Kingsbury and quarterback Kyler Murray are entering their second seasons in the NFL after encouraging debuts in 2019, with Murray earning Offensive Rookie of the Year honors.\n“Being in Year 2 goes a long way,” Kingsbury said. “We have a lot of continuity with the staff, with players coming back, keeping our schemes in place.”\nHELPING THE DEFENSE\nArizona’s defense was among the worst in the league last season after giving up more than 400 yards per game. The team feels it’s already addressed some of the most glaring needs in free agency, adding linebackers Devon Kennard and De’Vondre Campbell along with lineman Jordan Phillips. All three are expected to be starters and should complement linebacker Chandler Jones and safety Budda Baker, who both made the Pro Bowl.\nBut there’s little doubt the Cardinals could use quality depth at just about every defensive position, especially on the line and at linebacker.\nBUILDING AROUND KYLER\nMurray, the No. 1 overall pick in last year’s draft, looks like he could become of the league’s top quarterbacks after throwing for 3,722 yards and 20 touchdowns. He also ran for 544 yards and four touchdowns.\nThe Cardinals have given their young QB even more options after adding Hopkins, who has had at least 1,000 yards receiving in five of the past six seasons and is a three-time All-Pro.\nKingsbury said he doesn’t expect the coronavirus-induced break to the offseason will hinder Murray’s growth.\n“We’ll do every sort of telecoaching that we can come up with,” Kingsbury said. “There’s nothing like being on the grass, but everyone’s dealing with it. I think the teams that are able to adapt and adjust the best are the ones that’ll have the most success early in the season.”\nRUNNING BACK DEPTH\nArizona re-signed running back Kenyan Drake after adding him in a midseason trade with the Miami Dolphins last season. Drake was impressive in eight games with the Cardinals last year, running for 643 yards and eight touchdowns.\nDrake is the expected starter, while Chase Edmonds — who was very good when healthy last season — is the primary backup. But the Cardinals could be in the market for one more back during the draft.\n“That’s an area we’d like to have three we can roll through and not lose much,” Kingsbury said.\nHIT AND MISS\nKeim’s first-round draft history has been erratic over the past few years. Drafting Murray looks like it was a wise move, but that came one year after drafting quarterback Josh Rosen at No. 10, who lasted just one season with the team.\nThe team’s 2016 first-round pick was defensive lineman Robert Nkemdiche, who had three mediocre seasons before being released. Linebacker Haason Reddick, the 2017 first round pick, has also been a mild disappointment.\nBut Kingsbury has no doubts Keim will make a good decision this year, even with the strange situation of all teams drafting remotely from their respective homes.\n“I think he’s kind of welcoming the solitude of it all,” Kingsbury said. “That’s a big day and there’s a lot of voices that can get in your head and a lot of clutter that can go on if you’re not careful.”\n___\nFollow David Brandt on Twitter: www.twitter.com/davidbrandtAP\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/b978d977e884b910d360fc1b17136f0f"}