{"authors": ["Martin Crutsinger"], "date_download": "2020-05-04 20:17:54", "date_modify": "2020-05-04 20:17:54", "date_publish": "2020-04-09 19:44:22", "description": "WASHINGTON (AP) — The coronavirus pandemic will push the global economy into the deepest recession since the Great Depression, with the world's poorest countries suffering the most, the head of...", "filename": "_75ccc164478a347fd4b3c54ffffd7895_1588623474.html", "image_url": "https://storage.googleapis.com/afs-prod/media/7175d92d8b234b3d9575b40018fdb462/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_75ccc164478a347fd4b3c54ffffd7895_1588623474.html", "title": "IMF head sees worst economic downturn since Great Depression", "title_page": "IMF head sees worst economic downturn since Great Depression", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Feb. 14, 2020 file photo, Kristalina Georgieva, Managing Director of the International Monetary Fund, attends a session on the first day of the Munich Security Conference in Munich, Germany. Georgieva said Friday, March 27, it is clear that the global economy has now entered a recession that could be as bad or worse than the 2009 downturn. She said the 189-nation lending agency was forecasting a recovery in 2021, saying it could be a “sizable rebound.” But she said this would only occur if nations succeed in containing the coronavirus and limiting the economic damage(AP Photo/Jens Meyer, File)\nFILE - In this Feb. 14, 2020 file photo, Kristalina Georgieva, Managing Director of the International Monetary Fund, attends a session on the first day of the Munich Security Conference in Munich, Germany. Georgieva said Friday, March 27, it is clear that the global economy has now entered a recession that could be as bad or worse than the 2009 downturn. She said the 189-nation lending agency was forecasting a recovery in 2021, saying it could be a “sizable rebound.” But she said this would only occur if nations succeed in containing the coronavirus and limiting the economic damage(AP Photo/Jens Meyer, File)\nWASHINGTON (AP) — The coronavirus pandemic will push the global economy into the deepest recession since the Great Depression, with the world’s poorest countries suffering the most, the head of the International Monetary Fund said Thursday.\n“We anticipate the worst economic fallout since the Great Depression,” IMF Managing Director Kristalina Georgieva said Thursday in remarks previewing next week’s virtual meetings of the 189-nation IMF and its sister lending organization, the World Bank.\nShe said that the IMF will release an updated world economic forecast on Tuesday that will show just how quickly the coronavirus outbreak has turned what had been expected to be a solid year of growth into a deep downturn.\nJust three months ago, the IMF was forecasting that 160 nations would enjoy positive income growth on a per capita basis. Now the expectation is that over 170 nations will have negative per capita income growth this yea.\nEmerging markets and low-income nations across Africa, Latin America and much of Asia are at high risk, she said.\n“With weak health systems to begin with, many face the dreadful challenge of fighting the virus in densely populated cities and poverty-stricken slums, where social distancing is hardly an option,” Georgieva said.\nInvestors have grown fearful of leaving their money in emerging economies that could be hit hard by a global recession. As a result, capital outflows from emerging-market countries have totaled more than $100 billion over the last two months, more than three times larger than the same period at the start of the global financial crisis, Georgieva noted.\nIn addition, countries that depend on exporting commodities have taken a double blow because of the steep fall in commodity prices.\nGeorgieva said there was no question that 2020 will be an “exceptionally difficult” year. She said if the pandemic fades in the second half of the year, allowing the gradual lifting of containment measures and the reopening of the global economy, the IMF is forecasting a partial recovery in 2021.\n“I stress there is tremendous uncertainty around the outlook,” she said. “It could get worse depending on many variable factors, including the duration of the pandemic.”\nShe said that she and World Bank President David Malpass will pursue at next week’s virtual meetings an agreement to adopt a standstill on debt payments over the next year by the world’s poorest nations, freeing up money they can use for critical health needs.\nFull Coverage: Economy\nShe also said that the IMF is prepared to commit its $1 trillion in lending capacity to providing support to nations that need help dealing with the pandemic.\n“We are responding to an unprecedented number of calls for emergency financing from over 90 countries so far,” she said.\nThe IMF’s executive board has agreed to double the loan levels it will provide from its emergency facilities that she said should allow the IMF to provide around $100 billion in financing to low-income countries.", "url": "https://apnews.com/75ccc164478a347fd4b3c54ffffd7895"}