{"authors": ["Jonathan Mattise"], "date_download": "2020-05-04 20:17:52", "date_modify": "2020-05-04 20:17:52", "date_publish": "2020-04-09 07:12:07", "description": "NASHVILLE, Tenn. (AP) — The legal team fighting for a delay in the June 4 execution of a Tennessee death row inmate says it has lost \"critical time\" due to the new coronavirus and restrictions to...", "filename": "_f703ea0bd7bfd7966ce2058393657e28_1588623472.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c75c53b4fded47848110b4deee5eb4bc/1972.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f703ea0bd7bfd7966ce2058393657e28_1588623472.html", "title": "'Critical time' lost amid virus", "title_page": "Death row inmate attorney: 'Critical time' lost amid virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Oct. 13, 1999, file photo, Ricky Bell, then the warden at Riverbend Maximum Security Institution in Nashville, Tenn., gives a tour of the prison's execution chamber. An attorney said her team has lost “critical time” in representing a Tennessee death row inmate slated for execution in June, 2020, due to the new coronavirus and restrictions in place to curb its spread. The attorney for inmate Oscar Smith gave the update in a state Supreme Court filing recently to argue further that his execution should be put on hold due to the health pandemic. Smith's legal team asked for the stay of execution due to COVID-19 in March, 2020.(AP Photo/Mark Humphrey, File)\nFILE - In this Oct. 13, 1999, file photo, Ricky Bell, then the warden at Riverbend Maximum Security Institution in Nashville, Tenn., gives a tour of the prison's execution chamber. An attorney said her team has lost “critical time” in representing a Tennessee death row inmate slated for execution in June, 2020, due to the new coronavirus and restrictions in place to curb its spread. The attorney for inmate Oscar Smith gave the update in a state Supreme Court filing recently to argue further that his execution should be put on hold due to the health pandemic. Smith's legal team asked for the stay of execution due to COVID-19 in March, 2020.(AP Photo/Mark Humphrey, File)\nNASHVILLE, Tenn. (AP) — The legal team fighting for a delay in the June 4 execution of a Tennessee death row inmate says it has lost “critical time” due to the new coronavirus and restrictions to curb its spread.\nIn a state Supreme Court filing Wednesday, the attorney for inmate Oscar Smith cited increasingly stringent government restrictions, including Gov. Bill Lee’s stay-at-home order, in response to a state coronavirus caseload that rose Thursday to 94 deaths and more than 4,600 people confirmed to have been infected.\nMeanwhile, many more Tennesseans are losing their jobs as economies shut down in response to the coronavirus pandemic.\nTennesseans filed more than 112,400 new claims for unemployment in the week ending Saturday, according to the state Department of Labor and Workforce Development. The numbers have risen sharply, to nearly a quarter of a million over the last three recorded weeks. Typically, the state gets fewer than 10,000 new claims in a three week period, the department said.\nDue to a downturn in business, hospital chain Ballad Health will furlough 200 to 250 employees in Virginia, and 1,100 in Tennessee starting Friday, while still providing health benefits and waiving the employee cost of their premiums, according to the Johnson City Press .\nBeginning Saturday, Volkswagen’s Chattanooga assembly plant will implement temporary emergency furloughs expected to last up to four weeks for 2,500 production and maintenance employees and contract workers. Those workers have not been able to work since the factory paused production beginning March 21. They will still receive earned bonuses and the company will continue to provide health care benefits and coverage of premiums, both employer and employee contributions.\nFor the vast majority of people who have the coronavirus, symptoms clear up in several weeks without requiring hospitalization, but the consequences can be life-threatening for older people and those with existing health problems.\nA new Vanderbilt University model projects that maintaining the current rate of transmission could result in Tennessee reaching its coronavirus peak in June, with 5,000 COVID-19 patients projected to be hospitalized at that point, possibly stressing hospitals to capacity, said John Graves, a Vanderbilt School of Medicine health policy associate professor.\nA more optimistic scenario under Vanderbilt’s model would see 2,000 to 3,000 people hospitalized during a projected early to mid-May peak. But if social distancing restrictions are lifted too early and there isn’t widespread testing and tracing of contacts of people who test positive, the capacity of hospitals could be overwhelmed by mid-May, Graves said.\nLee on Thursday again held off from tipping his hand on whether he’ll extend Tennessee’s mandatory safer-at-home order. The mandate expires April 14, but Lee said he’s still reviewing data to determine if an extension is necessary.\nVanderbilt’s status quo projection could stretch the peak of the pandemic to the execution date for Smith, the death row inmate who was convicted of murder in the 1989 slayings of his estranged wife and her two sons from a previous marriage.\nHis legal team asked for the stay of execution due to COVID-19 last month, pointing to the travel, interviews and other tasks needed to pursue a clemency request and court challenges.\n“Mr. Smith’s legal team continue to abide by the orders of Nashville Mayor Cooper and Governor Lee,” Smith’s attorney, Kelley Henry, wrote in the filing. “But doing so has resulted in the loss of critical time needed to represent Mr. Smith during this crucial period.”\nSmith’s lawyers also said that holding an execution during a pandemic will require more safeguards to protect witnesses, including news reporters, lawyers and others, whose presence could risk transmitting the virus to staff and inmates at Riverbend Maximum Security Institution. Texas has delayed three executions due to the outbreak there, they noted.\nAttorney General Herbert Slatery’s office argued against basing a stay on claims involving the appeals process and clemency efforts, but wrote that the Supreme Court is “in the best position to determine whether a stay of execution should be granted in response to coronavirus-related issues affecting the courts of this State.”\nTennessee’s prison system will also see mass coronavirus testing of staffers Friday at two facilities where workers, but not inmates, have tested positive: Bledsoe County Correctional Facility and Northwest Correctional Complex, said state Health Commissioner Lisa Piercey.\nJudges in Nashville, meanwhile, denied the public defender’s request for a widespread release of nonviolent offenders in jail amid the coronavirus. Judges ruled that individual hearings are appropriate to determine which inmates to release, The Tennessean reported .\n___\nKimberlee Kruesi in Nashville contributed to this report.\n___\nFollow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/f703ea0bd7bfd7966ce2058393657e28"}