{"authors": [], "date_download": "2020-05-04 20:05:32", "date_modify": "2020-05-04 20:05:32", "date_publish": "2020-04-08 17:39:23", "description": "DES MOINES, Iowa (AP) — Iowa public health officials said Wednesday that 97 more Iowans tested positive for coronavirus infection, increasing the state total to 1,145. One person died in...", "filename": "_f85dce83b3482314519a6859765da9e5_1588622732.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f85dce83b3482314519a6859765da9e5_1588622732.html", "title": "Iowa coronavirus cases climb to 1145, deaths at 27", "title_page": "Iowa coronavirus cases climb to 1145, deaths at 27", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DES MOINES, Iowa (AP) — Iowa public health officials said Wednesday that 97 more Iowans tested positive for coronavirus infection, increasing the state total to 1,145.\nOne person died in Linn County, where the highest number of cases are reported. The virus has now claimed 27 lives in the state and infections have now been found in 79 of Iowa’s 99 counties.\nThe data also shows increase hospitalization in recent days with 122 people now in hospitals, up 17 percent from the day before.\nIowa Department of Public Health Deputy Director Sarah Reisetter said the increase is due to changes in how the state gathers the information. She said Iowa’s hospitalization rate of 10% is lower than national trends of 15% to 20%.\nGov. Kim Reynolds said 14,000 small businesses have applied to the state for relief grants totaling $148 million. The first round of checks are going out to 500 businesses, with grants range from $5,000 to $25,000.\nReynolds has increased the state assistance program from the initial $4 million allocation to $24 million. She said the program was put in place to help businesses over the short term until funding from the federal government begins flowing. She said she expects Iowa to get a $1.25 billion block grant from the federal government.", "url": "https://apnews.com/f85dce83b3482314519a6859765da9e5"}