{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:27:03", "date_modify": "2020-05-04 20:27:03", "date_publish": "2020-04-16 22:14:32", "description": "___ Layoffs and pay cuts are now striking more white collar jobs WASHINGTON (AP) — First, it was bars, restaurants, hotels. And clothing stores, movie theaters, entertainment venues....", "filename": "_7ac9861c399455390fe92ccb0f446d8d_1588624023.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7ac9861c399455390fe92ccb0f446d8d_1588624023.html", "title": "Business Highlights", "title_page": "Business Highlights", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "___\nLayoffs and pay cuts are now striking more white collar jobs\nWASHINGTON (AP) — First, it was bars, restaurants, hotels. And clothing stores, movie theaters, entertainment venues. And all manner of small businesses, from bookstores to barber shops.Now, the record-setting flood of layoffs unleashed by the viral outbreak is extending beyond the services industries that bore the initial brunt — and that are still suffering most. White collar occupations, ranging from software programmers and legal assistants to sales associates and certain health care workers, are absorbing layoffs or salary cuts. So are workers in other occupations, like construction and real estate. The mounting toll of job losses resulted last week in 5.2 million new applications for unemployment benefits.\n___\nSmall business lending program on hold after reaching limit\nNEW YORK (AP) — The government’s paycheck protection loan program for small businesses is on hold. The Small Business Administration has announced that it reached the $349 billion lending limit for the program. Thousands of small business owners whose loans have not yet been processed must now wait for Congress to approve a Trump administration request for another $250 billion for the program. Lawmakers have been haggling over whether to extend the program as it stands now, or whether to add provisions that among other things would help minority businesses. It’s unclear when they might reach an agreement that would allow loan approvals to continue\n___\nAs $2 trillion starts to flow, oversight of virus cash lags\nWASHINGTON (AP) — Congress planned robust oversight of the $2 trillion coronavirus rescue package, creating at least four different bodies to help prevent fraud and abuse as the government doles out a massive amount of money to businesses, states and individuals. But none of those bodies has been set up yet. The halting start is fueling questions about how effectively watchdogs can monitor President Donald Trump’s administration as its spends an unprecedented sum rescuing the economy — and as the president has shown clear contempt for the oversight.\n___\nStocks climb as pandemic winners pull away on Wall Street\nNEW YORK (AP) — Stocks rose on Thursday, with the heaviest lifting coming from Amazon, health care stocks and the few other pockets of the market that have managed to be winners in the coronavirus crunch. The S&P 500 rose 0.6% after a government report showed that 5.2 million Americans filed for unemployment benefits last week as layoffs continue to sweep the nation. It was an awful number, but markets were expecting even worse, which helped to limit the losses. Momentum picked up in the last few minutes of trading after the White House released guidelines outlining a phased approach to reopening businesses.\n___\nFacebook to warn users who ‘liked’ coronavirus hoaxes\nSAN FRANCISCO (AP) — Have you liked or commented on a Facebook post about the COVID-19 pandemic that turned out to be a hoax? The social media company says it’s going to notify users if they liked, reacted or commented on harmful misinformation removed from Facebook’s news feed. It’s one of the many new policies tech companies are employing to slow the outbreak of dangerous online misinformation that’s spread quickly like the coronavirus itself. Facebook announced Thursday that it’s also put more than 40 million warning labels over false or misleading COVID-19 misinformation, a move that’s stopped 95% of its users from further viewing those falsehoods.\n___\nBudget office puts virus relief bill cost at $1.8 trillion\nWASHINGTON (AP) — The massive coronavirus relief bill passed virtually unanimously by Congress last month is estimated at costing taxpayers $1.8 trillion — slightly less than was projected at the time by the White House. That’s according to the Congressional Budget Office, which says the difference is due to scorekeeping on $454 billion provided to back trillions of dollars in guaranteed loans by a Federal Reserve emergency lending facility, which won’t have a deficit impact since the income and costs stemming from that lending are expected to offset each other. The CBO report comes as Washington is manuevering over replenishing a popular “paycheck protection” program with another $250 billion.\n___\nChina tries to revive economy but consumer engine sputters\nBEIJING (AP) — Chinese leaders have reopened factories and shops in an effort to revive the economy, but the consumers whose spending propels most of China’s growth have been slow to return to shopping malls and auto dealerships. Authorities are trying to encourage spending by handing out shopping vouchers, but many people are uneasy about a possible resurgence of the coronavirus or losing their jobs. The delay is a blow to automakers and other global companies that hope China will power a worldwide recovery following the most painful peacetime downturn since the Great Depression of the 1930s.\n___\nUS home construction collapsed 22.3% in March\nWASHINGTON (AP) — U.S. home-building activity collapsed in March as the coronavirus spread, with housing starts tumbling 22.3% from a month ago. The Commerce Department said Thursday that ground breakings occurred last month at a seasonally adjusted annual rate of 1.2 million units, down from a 1.56 million pace in February.\n___\nThe S&P 500 rose 16.19 points, or 0.6% to 2,799.55. The Dow Jones Industrial Average added 33.33 points, or 0.1%, to 23,537.68, the Nasdaq jumped 139.19, or 1.7%, to 8,532.36 and the Russell 2000 index of smaller stocks slumped 5.89, or 0.5%, to 1,178.09.", "url": "https://apnews.com/7ac9861c399455390fe92ccb0f446d8d"}