{"authors": ["Emily Schmall"], "date_download": "2020-05-04 20:25:23", "date_modify": "2020-05-04 20:25:23", "date_publish": "2020-04-20 06:21:12", "description": "NEW DELHI (AP) — India recorded its biggest single-day spike in coronavirus cases on Monday as the government eased one of the world's strictest lockdowns to allow some manufacturing and...", "filename": "_31c3c682c6ba37596c3e74cd1a6ce12f_1588623923.html", "image_url": "https://storage.googleapis.com/afs-prod/media/4f9a4af4602d43418ec05eb151641020/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_31c3c682c6ba37596c3e74cd1a6ce12f_1588623923.html", "title": "India reports biggest one-day virus spike as lockdown eased", "title_page": "India reports biggest one-day virus spike as lockdown eased", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A group of Indians distribute free food and water to homeless people during a nationwide lockdown to curb the spread of new coronavirus in Gauhati, India, Sunday, April 19, 2020. (AP Photo/Anupam Nath)\nA group of Indians distribute free food and water to homeless people during a nationwide lockdown to curb the spread of new coronavirus in Gauhati, India, Sunday, April 19, 2020. (AP Photo/Anupam Nath)\nNEW DELHI (AP) — India recorded its biggest single-day spike in coronavirus cases on Monday as the government eased one of the world’s strictest lockdowns to allow some manufacturing and agricultural activity to resume.\nAn additional 1,553 cases were reported over 24 hours, raising the national total past 17,000. At least 543 people have died from COVID-19, the respiratory disease caused by the virus, and epidemiologists forecast the peak may not be reached before June.\nThe shelter-in-place orders imposed in India on March 24 halted all but essential services, sparking an exodus of migrant workers and people who survive on daily wages out of India’s cities and toward villages in rural areas. Authorities picked up travelers in a fleet of buses and quarantined many of them in empty schools and other public buildings for 14 days.\nStarting Monday, limited industry and farming were allowed to resume where employers could meet social distancing and hygiene norms, and migrant workers were allowed to travel within states to factories, farms and other work sites.\n“In the event a group of migrants wish to return to their places of work within the state where they are presently located, they would be screened and those who are asymptomatic would be transported to their respective places of work,” India’s home ministry said in a letter to state governments.\nHowever, government surveys in the central Indian state of Maharashtra, the worst-hit by the virus, have suggested few companies eligible to restart operations can do so because they are required to transport and shelter workers as a virus-prevention measure.\nWhile a partial lifting of a curfew permitted the restart of coal plants and oil refineries, animal feed and agro-industry, and other labor-intensive manufacturing such as brick kilns, much of the country remained under lockdown.\nIndia’s airspace was closed to commercial traffic, its passenger rail system, buses and metros were halted, e-commerce was restricted to food and other essentials, and schools, stadiums and houses of worship remained closed until May 3.\nIndia is also continuing to ramp up testing, build up stocks of ventilators and personal protective equipment and prepare makeshift isolation wards and dedicated COVID-19 hospitals.\nFull Coverage: Virus Outbreak\nIn Mumbai, the capital of Maharashtra and home to Asia’s largest slum, city authorities were planning to administer hydroxycloroquine to thousands of slum-dwellers over 14 days to gauge whether the drug helped to slow the spread of the disease in a place where social distancing norms aren’t possible to achieve. It was unclear how many people would participate in the experiment, or when it would begin.\nPresident Donald Trump has touted the malaria drug to treat COVID-19, though its efficacy against the disease is unproven.", "url": "https://apnews.com/31c3c682c6ba37596c3e74cd1a6ce12f"}