{"authors": ["Ali Zaslav", "Donald Judd", "Daniella Diaz"], "date_download": "2020-05-04 16:23:59", "date_modify": "2020-05-04 16:23:59", "date_publish": "2020-04-06 21:06:35", "description": "As some parts of the country get closer to reaching the peak of coronavirus cases in the weeks ahead and in the midst of widespread complaints of the federal government's response, governors are stepping in to loan resources and move critical supplies directly to the hot spots.", "filename": "2020_04_06_politics_states-_c60cd336cd7aeb07e717b9e99eb0af5c_index_1588609439.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403185611-andrew-cuomo-0330-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_states-_c60cd336cd7aeb07e717b9e99eb0af5c_index_1588609439.html", "title": "States desperate for medical supplies turn to each other for help", "title_page": "States desperate for medical supplies turn to each other for help - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As some parts of the country get closer to reaching the peak of coronavirus cases in the weeks ahead and in the midst of widespread complaints of the federal government's response, governors are stepping in to loan resources and move critical supplies directly to the hot spots.\nSeveral states that are not currently facing the same level of coronavirus outbreaks as New York Michigan and Louisiana have started lending ventilators to help ease the strain the crisis has put on medical workers and hospitals facing a lack of supplies and medical equipment.\nStates sharing ventilators may be essential as there are only about 9,500 ventilators left in the Strategic National Stockpile, and by the week of April 13 only an estimated 3,200 more will have been acquired, according to the House Oversight Committee after a telephone briefing by Federal Emergency Management Agency officials.\nFEMA also reported that most of the 100,000 ventilators President Donald Trump promised through manufacturing or other methods will not be available until late June at the earliest, the committee said.\nThis has forced states to resort to creative measures to find resources and medical supplies, as well as have to compete with each other for the same limited resources such as ventilators, N95 masks and other necessities needed for the pandemic.\n\"If we had relied on the White House and its obligation to fulfill our needs from the SNS, our state and nearly every state in the United States would come up short and could not protect our health care workers and our first responders,\" Illinois Gov. J.B. Pritzker said Monday.\n\"But here's the good news,\" Pritzker added. \"We haven't trusted what we were told by the White House.\"\nCalifornia Gov. Gavin Newsom is the latest governor to lend out ventilators to other states, announcing Monday morning he planned to lend 500 ventilators to New York and other states hit by the coronavirus outbreak.\n\"We're meeting this moment with compassion,\" Newsom said in a statement. \"I know that if the tables were turned and we were experiencing a hospital surge, other states would come to our aid and provide ventilators just as we are today.\"\nFor California, the decision to take charge in redistributing medical supplies comes after weeks of calling for a more strategic centralized allocation of resources.\nThe 500 machines will leave California on a military aircraft Monday to be shipped to FEMA, which will then redistribute to other states based on need, Brian Ferguson with the California Office of Emergency Services told CNN. The state made its decision based on current modeling and current supply levels with an expectation that a similar number of ventilators could be returned down the road if necessary.\nA federal government inspector general published a report Monday that found hospitals have been facing a shortage of ventilators to combat the coronavirus outbreak.\n\"Many hospitals noted that they were competing with other providers for limited supplies, and that government intervention and coordination could help reconcile this problem nationally,\" the report reads . \"For example, hospitals wanted the government to ensure that they have access to test kits and swabs, make tests faster by allowing more entities to conduct and produce tests, and help hospitals obtain PPE supplies and other equipment such as ventilators.\"\nIn a briefing with reporters Sunday, New York Gov. Andrew Cuomo, a Democrat, suggested with ventilators at a premium and coronavirus numbers peaking along different timelines in different states, loaning resources according to need was the only solution to the problem.\n\"There's not enough in the federal stockpile to take care of New York and Illinois and Texas and Florida and California, it's just, it's not an option,\" Cuomo told reporters Sunday.\n\"The only option I see is, there's a national deployment, everybody says this is wartime, it is a war, and the virus is the enemy, where New York, help New York today -- thank you, state of Oregon,\" he added. \"We're dealing with this curve today, and this intensity. And then nationally, we shift the resources to the next place that is most impacted, right?\"\nOregon Gov. Kate Brown and Washington Gov. Jay Inslee have also sent ventilators from their states.\n\"The 140 ventilators Oregon sent were the entirety of our state's reserve supply from the strategic national stockpile,\" Brown's press secretary, Charles Boyle, told CNN Monday, adding that the state still had 800 ventilators reserved for its own Covid-19 response, with 38 currently in use to fight the virus.\nJUST WATCHED Intensive care doctor with coronavirus made goodbye video for her kids Replay More Videos ... MUST WATCH Intensive care doctor with coronavirus made goodbye video for her kids 02:27\nDr. Deborah Birx, the Coronavirus Response Coordinator for the White House Coronavirus Task Force, applauded Brown for sending ventilators to hard-hit New York.\n\"We really applaud what the governor is doing about moving between the states, between the different counties, to bring them to New York, because that's what's needed today,\" Birx said Saturday at the White House. \"A different place will be needed tomorrow.\"\nInslee released 400 ventilators to the national stockpile as well.\n\"These ventilators are going to New York and other states hardest hit by this virus,\" Inslee said in a statement Sunday. \"I've said many times over the last few weeks, we are in this together. This should guide all of our actions at an individual and state level in the coming days and weeks.\"\nVice President Mike Pence again thanked both Inslee and Brown by name for helping other states in need, on a call Monday morning with governors across the country, a source told CNN.\nThe growing call for medical equipment and supplies in states, like New York, at the epicenter of the coronavirus outbreak, is reaching the most critical point as health officials warn that parts of America will endure the peak of cases in coming weeks. CNN reached out to more than 15 states hit with coronavirus outbreaks about sharing supplies and ventilators.\nNot everyone's benefiting from state-to-state cooperation, however.\nNew Jersey still hasn't received the number of ventilators it needs, prompting some to call for a more formal means to distribute ventilators according to need.\nSen. Cory Booker, a Democrat from New Jersey where coronavirus cases continue to surge and ventilators are the number one concern, urged FEMA to create and implement a national database and distribution program for ventilators.\n\"Doing so will help us send these devices to where they are needed, when they are needed,\" Booker said in a letter to the leader of the recently-formed FEMA Supply Chain Stabilization Task Force on April 3.", "url": "https://www.cnn.com/2020/04/06/politics/states-ventilators-coronavirus-strategic-national-stockpile/index.html"}