{"authors": ["Por Kim Tong-Hyung"], "date_download": "2020-05-04 20:22:08", "date_modify": "2020-05-04 20:22:08", "date_publish": "2020-04-21 02:57:47", "description": "SEÚL, Corea del Sur (AP) — El gobierno de Corea del Sur dijo el martes que no se han detectado actividades sospechosas en su vecino del norte, luego de que surgieran reportes de que el mandatario...", "filename": "_423708f51047c808ebdc5d114c0197e7_1588623728.html", "image_url": "https://storage.googleapis.com/afs-prod/media/621fd1775ac94c44960732ffa5bbd9f2/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_423708f51047c808ebdc5d114c0197e7_1588623728.html", "title": "Seúl: No se ha detectado actividad sospechosa en Norcorea", "title_page": "Seúl: No se ha detectado actividad sospechosa en Norcorea", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nSeúl: No se ha detectado actividad sospechosa en Norcorea\nSEÚL, Corea del Sur (AP) — El gobierno de Corea del Sur dijo el martes que no se han detectado actividades sospechosas en su vecino del norte, luego de que surgieran reportes de que el mandatario norcoreano Kim Jong Un estaba en condiciones delicadas de salud después de una cirugía de corazón.\nLa Casa Azul presidencial dijo no tener información sobre los rumores en torno a la salud de Kim. Es habitual que la ausencia de los líderes norcoreanos en importantes actos de estado alimente especulaciones. Kim, que está a mediados de la treintena, no asistió a un homenaje a su difunto abuelo y fundador del país, Kim Il Sung, el 15 de abril, el feriado más importante de Corea del Norte.\nEl mandatario no ha hecho apariciones públicas desde que presidió una reunión del gabinete político del gobernante Partido de los Trabajadores el 11 de abril, donde se abordaron medidas preventivas contra el coronavirus y su hermana fue designada como miembro alternativo del gabinete.\n“No tenemos información para confirmar sobre los rumores sobre el problema de salud del presidente Kim Jong Un, que han sido reportados por algunos medios. Tampoco se han detectado movimientos inusuales dentro de Corea del Norte”, dijo en un comunicado el portavoz de la Casa Azul, Kang Min-seok.\nIncluso si Kim se ve relegado por motivos de salud, es improbable que se produzca un brusco cambio político en Corea del Norte, según el analista Cheong Seong-Chang, del Instituto Sejong, un grupo de estudios privado en Corea del Sur.\nLa hermana de Kim, Kim Yo Jong, ya ejerce una importante influencia en el gobierno, y la mayoría de los miembros de la cúpula gobernante comparten un interés con la familia Kim en mantener el sistema actual, explicó Cheong.\nCNN había citado a un funcionario estadounidense no identificado que dijo que el mandatario estaba en “grave peligro” después de una cirugía no especificada. Posteriormente, otro funcionario estadounidense le dijo a la misma cadena que las preocupaciones sobre la salud de Kim eran creíbles, pero era difícil evaluar si está grave o no.\nHoras antes, el diario en internet Daily NK, especializado en Corea del Norte, citó fuentes anónimas para reportar que Kim se recuperaba de una cirugía de corazón en Pyongyang y que su estado de salud estaba mejorando.\nEl Servicio Nacional de Inteligencia surcoreano no podía confirmar si Kim había sido operado, según dijo un funcionario de la agencia de espionaje que declinó dar su nombre debido a normas internas del organismo.\nMedios y gobiernos extranjeros han tenido un éxito dispar siguiendo las noticias sobre la élite gobernante norcoreana, algo que se ve complicado por el estricto control de Pyongyang sobre esa información.\nEn 2016, medios surcoreanos citaron a fuentes de inteligencia indicando que Kim Jong Un había ordenado ejecutar a un antiguo mando militar por corrupción y otros delitos. Pero meses más tarde, medios norcoreanos mostraron a Ri Yong Gil vivo y ocupando puestos importantes.", "url": "https://apnews.com/423708f51047c808ebdc5d114c0197e7"}