{"authors": ["Jeff Amy"], "date_download": "2020-05-04 20:09:32", "date_modify": "2020-05-04 20:09:32", "date_publish": "2020-04-16 21:51:19", "description": "ATLANTA (AP) — With Georgia officials still believing the state's hospitalization peak from COVID-19 is in the future, they're close to opening a 200-bed facility in a downtown Atlanta convention...", "filename": "_6e2c877592747e79360c78f3843247a9_1588622972.html", "image_url": "https://storage.googleapis.com/afs-prod/media/46a6ae3d048c4f3d85ac27b704b597e6/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6e2c877592747e79360c78f3843247a9_1588622972.html", "title": "200-bed surge hospital nears opening in Atlanta exhibit hall", "title_page": "200-bed surge hospital nears opening in Atlanta exhibit hall", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A massive temporary hospital is shown at the Georgia World Congress Center on Thursday, April 16, 2020, in Atlanta. Georgia Gov. Brian Kemp took part in a tour of the 200-bed facility, constructed quickly in the lower levels of the Georgia World Congress Center which normally plays host to large conventions and sporting events. (AP Photo/Ron Harris, Pool)\nA massive temporary hospital is shown at the Georgia World Congress Center on Thursday, April 16, 2020, in Atlanta. Georgia Gov. Brian Kemp took part in a tour of the 200-bed facility, constructed quickly in the lower levels of the Georgia World Congress Center which normally plays host to large conventions and sporting events. (AP Photo/Ron Harris, Pool)\nATLANTA (AP) — With Georgia officials still believing the state’s hospitalization peak from COVID-19 is in the future, they’re close to opening a 200-bed facility in a downtown Atlanta convention center.\nCrews have built rows of gleaming white cubicles, each 10 feet (3 meters) square, atop a bright white plastic floor in an exhibition hall at the sprawling Georgia World Congress Center. The bare rooms — most only have a hospital bed — are meant to host patients sick with coronavirus but who don’t need intensive care.\nThe state is spending $21.5 million on the project, including more than $6 million just to build the facility, which could be scaled up to 400 beds. It’s meant to provide a margin of safety for Georgia’s hospitals as a predicted peak in cases and hospitalizations approaches at the start of May amid the global virus outbreak.\n“If you have something that happens when we do get to the peak time, and our hospital bed capacity is nip and tuck, we’ll be glad we had a facility like this,” Georgia Gov. Brian Kemp told reporters after his tour.\nThe hospital is supposed to open this weekend after final inspections, with crews having completed construction ahead of schedule.\n“Well, it’s definitely sobering to have to do something like this in the first place,” Kemp said. “But it’s also makes me feel good at how quickly something like this came together.” For most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up within weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including life-threatening pneumonia.\nAs of Wednesday, the Georgia Emergency Management and Homeland Security Agency reported that 2,071 of the state’s 2,950 critical care hospital beds were in use, as well as 8,900 of the state’s 14,400 general hospital beds. Kemp said the Atlanta facility would be for patients from all over Georgia and touted other efforts to increase hospital capacity, including modular pods being deployed in Rome, Albany, Gainesville and Macon.\nThe surge hospital sits in an exhibit hall of more than 100,000 square feet (9,300 square meters). It includes portable toilet and shower units on trailers, as well as an area stocked with board games and footballs for patients who want to escape their rooms. On the other side of a wall is an area for medical staff to don protective gear on and take it off, as well as storage, food preparation and administration areas. Patients are supposed to arrive by ambulance to a loading dock, with Atlanta’s Grady Memorial Hospital deciding who goes there. Grady, the safety-net public hospital for metro Atlanta, has fewer beds than usual after a leaking pipe flooded multiple floors months ago.\nThe facility is being staffed by 211 health care personnel hired on contract. It’s being run by PAE, a government contractor that also built hospitals for Ebola patients in Liberia. Deputy Program Director Nick Visconti said that experience gave PAE a leg up on knowing how to construct Georgia’s hospital.\n“As far as the setup, it’s basically all the same,” Visconti said.\n__\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.\n___\nFollow Jeff Amy on Twitter at http://twitter.com/jeffamy", "url": "https://apnews.com/6e2c877592747e79360c78f3843247a9"}