{"authors": ["Cheri Mossburg"], "date_download": "2020-05-04 16:54:21", "date_modify": "2020-05-04 16:54:21", "date_publish": "2020-04-08 19:38:33", "description": "Dozens of patients from a nursing home in Southern California were evacuated to other centers Wednesday after employees stopped showing up for work, officials say.", "filename": "2020_04_08_us_california-nursing-home-evacuated_index_1588611261.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408133339-magnolia-rehabilitation-and-nursing-center-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_us_california-nursing-home-evacuated_index_1588611261.html", "title": "A California nursing home was evacuated after its staff didn't show up", "title_page": "A California nursing home was evacuated after its staff didn't show up - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Dozens of patients from a nursing home in Southern California were evacuated to other centers Wednesday after employees stopped showing up for work, officials say.\nMagnolia Rehabilitation and Skilled Nursing Center in Riverside, California has been hit hard by coronavirus, with at least 34 of 84 patients and five staff members testing positive, according to a news release from Riverside County Public Health Department.\nWednesday is the second day in a row employees didn't show up to care for patients. Thirty-three nurses were brought in by Riverside University Health and Kaiser Permanente to fill in on Tuesday, the release states.\nNoting that rehab centers and nursing facilities present a particular challenge due to the age and health conditions of the residents, the county's health department said the centers receiving patients will follow strict Covid-19 containment procedures.\nRiverside County has seen at least 1,016 confirmed cases, and 28 people have died, according to the county's public health department\nRead More", "url": "https://www.cnn.com/2020/04/08/us/california-nursing-home-evacuated/index.html"}