{"authors": [], "date_download": "2020-05-04 20:19:25", "date_modify": "2020-05-04 20:19:25", "date_publish": "2020-04-16 02:09:34", "description": "PORTLAND, Ore. (AP) — Weekday traffic on the four major interstates in the Portland, Oregon, area is down 46% from levels last year, according to a report compiled by the state Department of...", "filename": "_3134109bb06ea9099df894df6e8a064b_1588623565.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3134109bb06ea9099df894df6e8a064b_1588623565.html", "title": "Report: Oregon freeway traffic drops, average speeds jump", "title_page": "Report: Oregon freeway traffic drops, average speeds jump", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Ore. (AP) — Weekday traffic on the four major interstates in the Portland, Oregon, area is down 46% from levels last year, according to a report compiled by the state Department of Transportation.\nInterstates 5, 405, 84 and 205 are all seeing significant traffic declines, and the freeways are only becoming less congested as the weeks stretch on amid a stay home order issued by Gov. Kate Brown to slow the spread of the coronavirus.\nTraffic on weekends is down even more precipitously, The Oregonian/OregonLive reported .\nAccording to Oregon Department of Transportation’s first COVID-19 monitoring report, released Friday, the largest decreases occurred initially on highways and freeways to the coast and mountains. The report looked at the change in traffic patterns in the past month, starting with the week schools closed, then subsequent weeks under the stay-home order as well.\nI-5 is seeing the most significant declines of metro-area freeways. The average weekend traffic was down 64% for the most recent full week of data available (March 30-April 5).\nAnd as Portland police and other law enforcement agencies say speeding on surface roads is up, the state data show drivers are putting the pedal to the metal through the city. According to the state data, every week people are driving faster.", "url": "https://apnews.com/3134109bb06ea9099df894df6e8a064b"}