{"authors": ["David Eggert"], "date_download": "2020-05-04 21:09:14", "date_modify": "2020-05-04 21:09:14", "date_publish": "2020-04-13 17:00:57", "description": "LANSING, Mich. (AP) — A group spearheading a ballot drive to add LGBT anti-discrimination protections to Michigan's civil rights law moved Monday to collect voter signatures online because of the...", "filename": "_7b35d580f26d96f82e0059339fa5552b_1588626554.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ac2e118794f0458fbceead5ed9612031/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7b35d580f26d96f82e0059339fa5552b_1588626554.html", "title": "Anti-LGBT discrimination ballot drive moves to e-signatures", "title_page": "Anti-LGBT discrimination ballot drive moves to e-signatures", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Oct. 8, 2019 file photo, supporters of LGBT rights stage a protest on the street in front of the U.S. Supreme Court in Washington. A group spearheading a ballot drive to add LGBT anti-discrimination protections to Michigan's civil rights law moved Monday, April 13, 2020, to collect voter signatures online because of the coronavirus pandemic. (AP Photo/Manuel Balce Ceneta,File)\nFILE - In this Oct. 8, 2019 file photo, supporters of LGBT rights stage a protest on the street in front of the U.S. Supreme Court in Washington. A group spearheading a ballot drive to add LGBT anti-discrimination protections to Michigan's civil rights law moved Monday, April 13, 2020, to collect voter signatures online because of the coronavirus pandemic. (AP Photo/Manuel Balce Ceneta,File)\nLANSING, Mich. (AP) — A group spearheading a ballot drive to add LGBT anti-discrimination protections to Michigan’s civil rights law moved Monday to collect voter signatures online because of the coronavirus pandemic.\nThe electronic petition campaign is believed to be the first in state history, according to Fair and Equal Michigan, which said that the strategy is legal and secure. People who want to sign can go to a website with a two-factor authentication system and enter their driver’s license or state ID card number that organizers will cross-check against the voter file.\nThe ballot committee has until late May to collect about 340,000 valid voter signatures needed to send the initiated bill to lawmakers and, because the Republican-led Legislature would likely not act, to a public vote in November. The organization collected more than 150,000 signatures the traditional way by circulating petitions in person until the virus pandemic reached Michigan last month.\nThe proposal would update the law to prohibit discrimination based on sexual orientation or gender identity in employment, housing and public accommodations. Religion-based discrimination, which already is barred, would be defined to include an individual’s “religious beliefs.”\n“I genuinely believe that the decisions and these actions we take in the next 24 hours and beyond related to e-signature and its success will determine if LGBTQ people have their rights or not for at least eight years,” said Trevor Thomas, co-chair of the ballot drive.\nThe group’s announcement came weeks after two other ballot drives suspended their campaigns until 2022. One was pushing for a graduated state income tax and the other sought to rein in lobbying.\nIf the pro-LGBT rights group submits signatures, those collected electronically could face a legal challenge.\nBut Steven Liedel, a lawyer for Fair and Equal Michigan, said “the right to initiative petitions is an inherent constitutional right. ... This is just another mechanism for (people) to exercise that constitutional right in light of the limits on social gathering and social distancing requirements necessitated by the virus.”\nState law governing e-signatures, he said, says any signature that is required by law can be affixed electronically except on certain documents such as wills. The election law does not mandate that a signature be physically signed but does require petitions to be signed in the presence of a circulator, he said.\n“So Fair and Equal Michigan’s going to be using a process where it’s one signature per petition. The registered voter will be both the signer and the circulator. You’re always in your own presence,” Liedel said.\nHe also noted that Democratic Gov. Gretchen Whitmer issued an order last week temporarily encouraging e-signatures unless the law specifically mandates a physical signature.\nThe organization made the state elections bureau aware of the e-signature drive.\n“We have not yet determined if we can accept signatures collected as they propose as we have not yet conducted a full legal analysis and no signatures collected in this way have yet been provided to us,” said Jake Rollow, spokesman for Secretary of State Jocelyn Benson.\n___\nFollow Eggert on Twitter at https://twitter.com/DavidEggert00", "url": "https://apnews.com/7b35d580f26d96f82e0059339fa5552b"}