{"authors": ["Caroline Kelly"], "date_download": "2020-05-04 16:10:25", "date_modify": "2020-05-04 16:10:25", "date_publish": "2020-04-02 22:52:19", "description": "New Jersey Democratic Gov. Phil Murphy on Thursday called for an assessment of the federal response to the coronavirus once the crisis itself is handled, as states continue to scramble for much-needed medical supplies to combat the spreading virus.", "filename": "2020_04_02_politics_new-jer_6e40a2d5e2b72e1be52c03ace8b86fa0_index_1588608625.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/180703113949-phil-murphy-new-jersey-governor-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_new-jer_6e40a2d5e2b72e1be52c03ace8b86fa0_index_1588608625.html", "title": "New Jersey governor calls for 'postmortem' of federal response to coronavirus", "title_page": "New Jersey governor calls for 'postmortem' of federal response to coronavirus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) New Jersey Democratic Gov. Phil Murphy on Thursday called for an assessment of the federal response to the coronavirus once the crisis itself is handled, as states continue to scramble for much-needed medical supplies to combat the spreading virus.\nWhen asked by CNN's Wolf Blitzer what the lagging maintenance on some of the federal government's ventilator reserves revealed about national preparedness levels, Murphy noted that the ventilators New Jersey received from the federal government \"had a high rate of functioning.\"\n\"On the one hand, I'll leave history to the historians in terms of how we got here,\" Murphy said. \"But on the other hand, we've got -- all of us have to do one of the biggest postmortems, when the dust settles on this, in the history of our country.\"\n\"We've got to figure out how the heck we got into this spot and make sure we never get in this spot ever again,\" he added.\nMurphy's comments echo those of congressional Democrats calling for a commission to investigate what happened in the onset of the coronavirus crisis, with the number of US cases going higher than 236,000 on Thursday and continuing to climb.\nRead More", "url": "https://www.cnn.com/2020/04/02/politics/new-jersey-governor-coronavirus-postmortem-cnntv/index.html"}