{"authors": [], "date_download": "2020-05-04 20:18:28", "date_modify": "2020-05-04 20:18:28", "date_publish": "2020-04-29 12:44:09", "description": "Forecasters say the drop in the January-March quarter will be only a precursor of a far grimmer GDP report to come on the current April-June period.", "filename": "entry_us-economy-gdp-shrinks_n_5ea9757fc5b6123a17653ade_1588623508.html", "image_url": "https://img.huffingtonpost.com/asset/5ea975f3220000c80c827dab.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_us-economy-gdp-shrinks_n_5ea9757fc5b6123a17653ade_1588623508.html", "title": "U.S. Economy Shrank 4.8% Last Quarter As Virus Struck", "title_page": "U.S. Economy Shrank 4.8% Last Quarter As Virus Struck | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "WASHINGTON (AP) — The U.S. economy shrank at a 4.8% annual rate last quarter as the coronavirus pandemic shut down much of the country and began triggering a recession that will end the longest expansion on record.\nThe Commerce Department says the gross domestic product, the total output of goods and services, posted a quarterly drop for the first time in six years. And it was the sharpest fall since the economy shrank at an 8.4% annual rate in the fourth quarter of 2008 in the depths of the Great Recession.\nForecasters say the drop in the January-March quarter will be only a precursor of a far grimmer GDP report to come on the current April-June period, with business shutdowns and layoffs striking with devastating force. The Congressional Budget Office has estimated that GDP will plunge this quarter at a 40% annual rate.\nThat would be, by a breathtaking margin, the bleakest quarter since such records were first compiled in 1947. It would be four times the size of the worst quarterly contraction on record set in 1958.\nIn just a few weeks, businesses across the country have shut down and laid off tens of millions of workers. Factories and stores are shuttered. Home sales are falling. Households are slashing spending. Consumer confidence is sinking.\nAs the economy slides into what looks like a severe recession, some economists are holding out hope that a recovery will arrive quickly and robustly once the health crisis has been solved — what some call a V-shaped recovery. Increasingly, though, analysts say they think the economy will struggle to regain its momentum even after the viral outbreak has subsided.\nMany Americans, they suggest, could remain too fearful to travel, shop at stores or visit restaurants or movie theaters anywhere near as much as they used to. In addition, local and state officials may continue to limit, for health reasons, how many people may congregate in such places at any one time, thereby making it difficult for many businesses to survive. It’s why some economists say the damage from the downturn could persist far longer than some may assume.\nThere is also fear that the coronavirus could flare up again after the economy is re-opened, forcing reopened businesses to shut down again.\nThe Trump administration takes a rosier view. President Donald Trump told reporters this week that he expects a “big rise” in GDP in the third quarter, followed by an “incredible fourth quarter, and you’re going to have an incredible next year.”\nThe president is building his re-election campaign on the argument that he built a powerful economy over the past three years and can do so again after the health crisis has been resolved.", "url": "https://www.huffpost.com/entry/us-economy-gdp-shrinks_n_5ea9757fc5b6123a17653ade"}