{"authors": ["Washington Bureau Chief"], "date_download": "2020-05-04 20:23:31", "date_modify": "2020-05-04 20:23:31", "date_publish": "2020-04-30 03:40:45", "description": "The presumptive Democratic presidential nominee still has not commented on a sexual assault allegation from a former aide.", "filename": "entry_joe-biden-silent_n_5eaa2932c5b6edf4130df3e8_1588623811.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa297a300000301215527d.jpeg?cache=0immg3hejc&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_joe-biden-silent_n_5eaa2932c5b6edf4130df3e8_1588623811.html", "title": "Joe Biden Stays Silent", "title_page": "Joe Biden Stays Silent | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "UPDATE: Biden went on MSNBC’s Morning Joe and addressed the allegations on May 1, denying the sexual assault allegation.\nPREVIOUSLY:\nJoe Biden, who championed women’s rights during his time in the Senate and the vice president’s office, has remained silent as a sexual assault allegation against him gains more traction.\nHis campaign has put out a statement denying the accusation by Tara Reade, a former Senate aide, but Biden himself has not said anything. And in his absence, other Democrats ― particularly female activists and politicians ― have had to weigh in and decide whether to defend him.\nDemocrats find themselves in a position with few easy options, particularly when they don’t fully know what happened. Biden’s Democratic presidential campaign has reportedly circulated talking points to surrogates, obtained by BuzzFeed, telling people to say that the assault “did not happen,” but media reports continue to come out that corroborate parts of Reade’s account.\nOne route for Democrats involves saying they believe Reade and denouncing Biden. But that potentially hurts the presumptive nominee’s chances to defeat President Donald Trump ― and keeping Trump in office is unthinkable. Trump has been accused of sexual misconduct ― including conduct that goes far beyond what Biden is alleged to have done ― by more than a dozen women.\nOr they could stand by Biden and say they don’t believe Reade. But then they risk looking like hypocrites, willing to stand up for sexual assault victims only when it’s politically convenient.\nAnd then there’s a third option that combines the two.\n“It sucks that everyone can’t just say, ‘Yeah, I believe Tara Reade and I’m going to vote for Joe Biden,’ because that’s the only morally defensible position here,” said a Democratic strategist who requested anonymity to speak freely. “Donald Trump has been credibly accused by multiple women of sexual assault and has spent his first term in office undermining the basic tenets of our democracy. Folks will vote for Joe Biden in the fall for many reasons, and yet again it will be marginalized groups who have to bite the bullet to stop Trump’s reelection.”\nReade, who was a junior staffer in Biden’s Senate office in 1993, last year accused Biden of making her feel physically uncomfortable while she worked for him. She was one of eight women with such stories.\nBut on March 25, during a podcast interview with writer Katie Halper, Reade said Biden had also sexually assaulted her in 1993. She said she complained to her supervisors about sexual harassment, and her job responsibilities were downgraded.\nWomen’s rights advocates have urged the Biden campaign to address the allegation before the end of April, which is Sexual Assault Awareness Month. But they want to see more than a denial.\nOne advocate said a path for Biden would be to come out and acknowledge his past behaviors that were inappropriate and to talk about why they were wrong and how he has changed ― showing his personal growth over the years. Rather than painting every man as good or bad, Biden could help demonstrate a path toward reform and change.\nTarana Burke, the founder of the Me Too movement, said she would like to see Biden, at a minimum, acknowledge “that his demonstrated learning curve around boundaries with women, at the very least, left him open to the plausibility of these claims.”\nOn Wednesday, The New York Times reported that women’s rights groups had drafted a letter ― but decided not to release it yet ― calling Biden an “outspoken champion for survivors of sexual violence” and urging him to speak publicly about the Reade accusation. HuffPost confirmed the existence of the letter and the involvement of the progressive group UltraViolet.\nBiden’s public appearances are limited by the coronavirus crisis. He has done a few interviews since the allegation came out, but he has not yet been asked about it. On Tuesday, he held a “women’s town hall” where he received the endorsement of 2016 Democratic presidential nominee Hillary Clinton and took prescreened questions read by Michelle Kwan, the former Olympic figure skater who is now a Biden staffer.\nOn Thursday, he and his wife, Jill Biden, also did an Instagram Live chat with soccer star Megan Rapinoe, an outspoken advocate for women’s rights. The Reade controversy never came up.\nBut already, Democratic politicians ― especially female ones ― are having to give their thoughts on Biden and the Reade accusation. Biden has said he will choose a woman as his running mate, putting extra pressure on the most-discussed candidates.\nIt’s not yet clear what effect Reade’s allegation will have on the presidential election or whether it will even reach many voters who are focused on coronavirus.\n“Politically, it is unfortunately already hard enough to get voters to pay attention to these stories when you have someone like Trump admitting to it on tape or being accused of rape by his wife in a divorce proceeding,” said another Democratic strategist. “I think there are enough issues with this specific story, and voters feel like they know Joe Biden after his 40 years in office, that this doesn’t just doesn’t fit and it won’t become a significant factor.”\nStories about Trump’s mistreatment of women ― and his infamous 2005 comments bragging about sexually assaulting women ― came out during the election or before, and he won anyway.\nAlthough Biden has a legacy of advocacy for women’s rights, he also faced skepticism before his 2020 run about whether he was the right pick for a party that was energized in large part after Trump’s election by the women’s movement.\nAside from the accusations of physical discomfort from women, Biden has faced criticism for how he handled law professor Anita Hill’s accusation of sexual harassment against then-Supreme Court nominee Clarence Thomas in 1991, when Biden was chairman of the Senate Judiciary Committee.\nNo staffers who worked with Reade have corroborated her account. But two interns at the time did remember that Reade suddenly stopped supervising them, although they didn’t know why. Multiple people have also confirmed that Reade told them some details about her experience with Biden either at the time or long before this election cycle.\nOn Monday, Business Insider published an interview with Lynda LaCasse, who lived next door to Reade in the mid-1990s and said she remembered hearing about the incident.\n“This happened, and I know it did because I remember talking about it,” she said.\nAnd The Intercept published a transcript of a call to the “Larry King Live” program on CNN in 1993, in which a woman in California sought advice for her daughter, who had “problems” while working for a prominent senator in Washington. She did not name the senator or elaborate on the problems, but Reade said it was her mother’s voice.\nReade has said she filed a complaint with a Senate personnel office in 1993, but she does not have a copy. One place where there could be a copy, if one exists, is in Biden’s Senate papers. But those remain locked up at the University of Delaware, unavailable to the public for long after the 2020 election.", "url": "https://www.huffpost.com/entry/joe-biden-silent_n_5eaa2932c5b6edf4130df3e8"}