{"authors": ["Eliza Mackintosh"], "date_download": "2020-05-04 16:06:41", "date_modify": "2020-05-04 16:06:41", "date_publish": "2020-04-02 11:46:12", "description": "As global cases of the novel coronavirus near the staggering milestone of 1 million, spreading to almost every country and territory, the World Health Organization chief says he is \"deeply concerned\" about the \"near exponential growth\" of the pandemic.", "filename": "2020_04_02_world_coronavirus-newsletter-04-02-20-intl_index_1588608401.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_world_coronavirus-newsletter-04-02-20-intl_index_1588608401.html", "title": "What you need to know about coronavirus on Thursday, April 2", "title_page": "What you need to know about coronavirus on Thursday, April 2 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story appeared in the April 2 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every weekday\n(CNN) As global cases of the novel coronavirus near the staggering milestone of 1 million, spreading to almost every country and territory, the World Health Organization chief says he is \"deeply concerned\" about the \"near exponential growth\" of the pandemic.\nGovernors are pleading for supplies for inundated hospitals, as cases in the US hit more than 215,000. Today, the death toll topped 5,000 nationwide -- with over 1,300 in New York City.\nNY Gov. Andrew M. Cuomo issued a warning: \"This is not just New York.\" As the state's toll mounts, he urged Americans to take the virus seriously, saying the country would be living with the consequences of the outbreak for a long time. \"I don't think we get back to normal,\" Cuomo said. \"I think we get to a new normal.\"\nIn a sign of just how abnormal things have become: the nation's top coronavirus expert, Dr. Anthony Fauci -- who became a lightning rod for right-wing criticism after correcting President Donald Trump -- has been f orced to beef up his personal security amid increased death threats", "url": "https://www.cnn.com/2020/04/02/world/coronavirus-newsletter-04-02-20-intl/index.html"}