{"authors": [], "date_download": "2020-05-04 20:23:56", "date_modify": "2020-05-04 20:23:56", "date_publish": "2020-04-04 20:09:58", "description": "ASHEVILLE, N.C. (AP) — Firefighters kept working on Saturday to slow the spread of western North Carolina wildfires that have spread due to high winds, the U.S. Forest Service said. A fire...", "filename": "_b0d1e98ab0f683076826ca3f714fef59_1588623836.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b0d1e98ab0f683076826ca3f714fef59_1588623836.html", "title": "North Carolina, U.S. firefighters work to contain wildfires", "title_page": "North Carolina, U.S. firefighters work to contain wildfires", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ASHEVILLE, N.C. (AP) — Firefighters kept working on Saturday to slow the spread of western North Carolina wildfires that have spread due to high winds, the U.S. Forest Service said.\nA fire that began on private property Friday in Haywood County expanded to the Shining Rock Wilderness Area of Pisgah National Forest, covering 50 acres, the forest service said in a news release. Another fire covering 30 acres in Macon County also began on private property and expanded to the Nantahala National Forest.\nDozens of U.S. Forest Service and North Carolina Forest Service firefighters were called in to work the two fires. Helicopters and air tankers made multiple water drops over the fires on Friday. The causes of the fires are being investigated.\nFirefighters responded to multiple wildfire starts on Friday. The North Carolina Forest Service has ordered an open fire ban in 32 western north Carolina counties due to the hazardous conditions.\nThe fire threat comes as the U.S. Forest Service said its North Carolina forest land is experiencing lots of visitors, even with a statewide stay-at-home order due to the new coronavirus. The order does allow people to go outside for exercise. Dozens of national forest campgrounds, shelters and recreation areas have been closed.", "url": "https://apnews.com/b0d1e98ab0f683076826ca3f714fef59"}