{"authors": ["Guest Writer"], "date_download": "2020-05-04 20:18:33", "date_modify": "2020-05-04 20:18:33", "date_publish": "2020-04-29 13:01:54", "description": "\"As long as I’m still creative ... as long as I still enjoy life, nobody has the right to write me off.\"", "filename": "entry_i-am-old-not-disposable-coronavirus-pandemic_n_5ea7295dc5b6a30004e67306_1588623513.html", "image_url": "https://img.huffingtonpost.com/asset/5ea84c542200008f0c827cbe.jpeg?cache=ucifweqvpy&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_i-am-old-not-disposable-coronavirus-pandemic_n_5ea7295dc5b6a30004e67306_1588623513.html", "title": "Just Because I'm 90 Doesn't Mean I'm Ready To Die ― Or Disposable", "title_page": "Just Because I'm 90 Doesn't Mean I'm Ready To Die ― Or Disposable | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "I’ve been a senior citizen for a quarter of a century and I still sculpt, read and write essays. I speak five languages, and I use email and WhatsApp to communicate with family and friends in Finland, China, Norway, England, Israel, Russia, Thailand and throughout the U.S. I run a foundation I created that assists immobile seniors. I attend classes, and I’m organizing a philosophy club via Zoom that discusses ethics, forgiveness, anger, creativity and various other topics.\nCertainly now, my routine has changed. COVID-19 has shut down everything in one shot. At age 90, I have lived through a lot of history, but I’ve never seen a situation like this. My daughter was concerned that in the city I would be a lot more exposed while facing a lower level of care. I left Brooklyn and am now with her, my son-in-law and teenage grandson, secluded and safe, upstate in the Peekskill mountains. My only outings, masked and gloved, are to the nearest labs for regular blood tests.\nWho knows in which direction the changes to come will take us. What I’ve seen so far is that the crisis has brought out the best in good people and the worst in bad people. What I see now is that cooperation and empathy on a massive scale are needed to bring the world back on track.\nWhat I've seen so far is that the crisis has brought out the best in good people and the worst in bad people.\nSome people may suggest that if I were to die of the coronavirus, I at least have lived a full life. And yes, I have lived a full life.\nI was born in China to Jewish parents who left Russia after World War I to seek refuge from anti-Semitism, famine and pogroms. I spent the first 20 years of my life in China, surviving the Japanese occupation of my town, Tientsin, during World War II. Then, I spent the next 30 years in Israel. I taught Hebrew to Jewish immigrant children, served in the Air Force and worked as a graphic artist. I got married and raised two daughters. Finally, my husband’s work took us to the U.S. in 1979. I was 50 years old and unaware that this would be the start of a period during which I would grow and flourish as an artist.\nIn my 60s, I created five large outdoor sculptures in Israel for institutions such as Tel-Aviv University and the Ghetto Fighters Museum of Resistance. At age 70, I began to find my voice as a writer and collaborated on “The Defiant,” my husband’s memoir about fighting Nazis as a partisan in Eastern Europe. At 82, I created a nonprofit organization, the Rose Art Foundation, which has donated 800 Geri-recliners to immobile patients in facilities throughout the U.S. Even now, during the coronavirus pandemic, I get requests from patients whose quality of life has been changed by these donations. Last year, at 89, I published my second book. And there is still much to do.\nI’m not disposable, and I’m saddened that there are people who think age dictates whether a human life is worth saving. I can tell you that I, and my loved ones, want me to live for many years to come. I want to attend my grandson’s high school graduation and see which college he’ll attend. I want to see my older grandson, who is married, become a father. I want to continue my joyful life. I am unable to travel as extensively as I once did, but I want to visit Israel again. Just because I’m 90 doesn’t mean I don’t have things to learn and skills to hone.\nI'm not disposable, and I’m saddened that there are people who think age dictates whether a human life is worth saving.\nI have more physical limitations and ailments than I choose to mention but that won’t stop me. I’m growing as an artist. Last September I began a three-month class at the Brooklyn Clay Studio, learning to glaze and fire in the kiln. In February, before social distancing was put in place, I sought a new approach, visited Urban Glass in Brooklyn and found a teacher to show me the process. My twin sister passed away 15 years ago so when the quarantine is over, I hope to finish a sculpture that represents our relationship.\nOur lives, our dreams, our productivity don’t end when we turn 65, an age that society decided was “old enough.” Senior citizens can be productive and contribute to the world, bringing to it their added dimension of age and experience. I think no limit should be set on when a person’s life is no longer valuable.\nI’m 90 and I’m waiting for the quarantine to end. As long as I’m still creative and surrounded by the love of family and friends, as long as I still enjoy life, nobody has the right to write me off.\nHave a compelling first-person story or experience you want to share? Send your story description to pitch@huffpost.com.", "url": "https://www.huffpost.com/entry/i-am-old-not-disposable-coronavirus-pandemic_n_5ea7295dc5b6a30004e67306"}