{"authors": ["Opinion Holly Thomas"], "date_download": "2020-05-04 16:14:15", "date_modify": "2020-05-04 16:14:15", "date_publish": "2020-04-03 11:05:09", "description": "Holly Thomas writes that, like it or not, social distancing and shelter-at-home measures are sticking around for a while. Find out how to avoid the pitfalls of being isolated during the Covid-19 pandemic.", "filename": "2020_04_03_opinions_avoid-isolation-pitfalls-covid-19-thomas_index_1588608855.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402210532-avoid-isolation-pitfalls-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_opinions_avoid-isolation-pitfalls-covid-19-thomas_index_1588608855.html", "title": "A nonexhaustive guide to avoiding isolation pitfalls", "title_page": "How to avoid isolation pitfalls during covid-19 pandemic (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Holly Thomas is a writer and editor based in London. She tweets @HolstaT . The opinions expressed in this commentary are solely those of the author. View more opinion articles on CNN.\n(CNN) Many of us have already endured weeks of Covid-19-induced social distancing and lockdowns. The United Kingdom -- where I'm isolating -- is entering its second week of a nationwide ban on leaving home for nonessential reasons.\nStates across America are announcing new measures almost daily, with New York and California about to face their third week of shutdowns and Gov. Ron DeSantis of Florida issuing a stay-at-home order on Wednesday.\nIt's safe to say that not everyone has taken the new restrictions seriously enough. Spring breakers clung to partying like the stench of bleach now clings to your clothes, and we all know grandparents who insisted that they have survived worse, and they won't be \"hemmed in.\"\nBut, like it or not, it seems clear that social distancing and shelter-at-home measures are sticking around . So, we may as well accept this reality and not be completely insufferable about it.\nHow? Here are some nonexhaustive pitfalls to avoid wherever your isolation, er, doesn't take you.\nFirst, don't become a sofa vigilante.\nThe UK is deep into its second week of lockdown. This has come with some actual legislation around what people can and can't do -- which includes leaving the house without a reasonable excuse, such as going to the pharmacy -- and some not-legally-binding government guidelines\nOne guideline advises that people who aren't in high-risk groups take part in only one form of outdoor exercise per day, while another suggests limiting food shopping to essential purchases.\nThis has galvanized some overzealous members of the police force to rebuke members of the public for buying a nonessential item like a chocolate bar and even walking their dogs. The confusion between the guidelines and the law, and the bewildering inaccuracy with which some members of the police have interpreted both and seemingly mistakenly chastised people, has spurred some members of the public to follow suit.\nIt's led to an increase in calls to emergency services, as some people tattle on their neighbors for allegedly flouting the rules.\nCalling the cops on your neighbors for imagined offenses or because you don't understand the rules isn't just lame, it impacts the capacity of the police to respond to more far more serious crimes -- and at a time when some, including domestic violence, may be on the rise.\nThe pressure on police resources will only increase as more officers are infected by the coronavirus or have to self-isolate -- a strain already sorely felt by the New York Police Department. So, learn the actual rules wherever you are, feel free to go one better and play the model citizen -- and don't become a sofa vigilante.\nSpeaking of the sofa, how's your screen time looking? When you can't go out -- and can no longer stand the sight of your lockdown companions -- the temptation to scroll constantly might prove irresistible.\nFor many, it clearly has, with reports of some people's screen time doubling in the last few weeks. If that sounds familiar, proceed with caution -- it doesn't take much Insta-browsing to start hating your loved ones.\nFor all that your yoga-loving pals might breathe that we're \"all in this together,\" as they lift into cobra, it's undeniable that some of us are more \"in this\" than others. While some fret about how to fill the new swathes of spare time on their well-moisturized hands and set about reorganizing their palatial lofts, others are juggling several children with half a dozen jobs and attempting to squeeze all of the above into a kitchen that can barely fit a stove top.\nThough such differences obviously exist across the gamut of society -- who could compete with the \"Protestant church\" that serves as Kim Kardashian West's hallway -- it can be amazing to discover just how much more privileged some members of your immediate social circle are than, say, you. If you want to come out of this without hating half your friends, get off their feed and talk (on the phone). Don't digitally stalk.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nFinally, for now, forget the shred.\nThere are a ton of fatphobic warnings about the #Quarantine15 out there, and people seem determined to emerge from quarantine looking ready to audition for the New York City ballet.\nIt's easy to feel like a failure if you haven't already memorized several dozen bodyweight exercises by your third day of isolation -- \"lockdown workout\" yields over 100,000 Google results -- and the removal of structured meal times combined with a general scarcity mindset around food is apt to play havoc with anyone who has issues around eating.\nEating disorder sufferers have already come out (figuratively speaking) in protest against the trend, describing how it has exacerbated existing issues . Even if you don't have a history with disordered eating or exercise, the constant pressure to maintain an idealized physique in circumstances which couldn't be further from ideal could easily drive you to distraction.\nSo, go easy on yourself -- the lockdown toll is already tough enough. No one's likely to see anyone from the neck down for weeks, and by the time everybody's reunited, no one will give a protein bar how toned your legs are.", "url": "https://www.cnn.com/2020/04/03/opinions/avoid-isolation-pitfalls-covid-19-thomas/index.html"}