{"authors": [], "date_download": "2020-05-04 16:28:05", "date_modify": "2020-05-04 16:28:05", "date_publish": "2020-04-03 15:08:37", "description": null, "filename": "2020_04_03_cnn-underscored__f0c159913dd1b7df158c547288c2a6e5_index_1588609685.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200325000826-amazon-alternatives-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored__f0c159913dd1b7df158c547288c2a6e5_index_1588609685.html", "title": "If you can't wait for Amazon shipping, shop these other online retailers", "title_page": "If you can't wait for Amazon shipping, shop these other online retailers - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "We've interviewed experts and found the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nIn an effort to meet the skyrocketing demand for social distancing supplies, Amazon is only restocking essential goods in its warehouses through at least April 5. Some customers hoping to take advantage of convenient Prime shipping can expect to wait up to a month for many items, meaning it's time to diversify your online shopping habits.\nTo help, we've rounded up a long list of stores to fill the Amazon-shaped hole in your heart. Though many of the retailers below have shuttered their physical locations, all are still fulfilling online orders at this time and can deliver essential and nonessential goods alike. Most big box stores like Target, Walmart, Bed Bath & Beyond, and Overstock are still up and running online, and offer a huge variety of products in the categories below.\nThe unfortunate truth is that pretty much all retailers are experiencing some shipping delays due to the pandemic, but you will still get what you need delivered within a few days.\nBut if you have a favorite clothing, game, or homegoods shop nearby, this is a great time to check if it's completing online orders; many small stores are waiving or reducing shipping fees in the wake of social distancing, and you'll be supporting your local economy.\nWithout further ado, here are stores to supplement your Amazon shopping in the coming weeks.\nHome decor\nOverstock\nYou can still shop Overstock's huge selection of furniture and home goods, including rugs, pillows, curtains and more. Plus, shipping is free on everything sitewide.\nWayfair\nWayfair is continuing to offer free shipping on orders over $49 and has increased cleaning frequency across its facilities.\nWorld Market\nWorld Market is still delivering its eclectic inventory of pillows, rugs, knickknacks, lamps and other decor items.\nMOMA Design Store\nNew York's Museum of Modern Art may be closed, but its beloved design store is still taking online orders.\nArticle\nArticle is shipping its modern designs out as usual, though the company has switched over to totally contactless delivery (meaning there are no in-room assembly services).\nAt Home\nThe superstore is continuing to deliver as usual.\nTarget\nTarget has a famously huge and affordable home decor section. In addition to continued shipping, it's offering drive-up options for goods purchased online to be brought to your car.\nCB2\nCrate & Barrel's hip younger brother will continue to offer in-home furniture delivery and has taken added precautions when it comes to sanitizing its facilities.\nWest Elm\nWest Elm will still deliver its midcentury modern decor to your home despite physical store closures.\nAnthropologie\nShop a gorgeous (though pricey) collection of unique decor, now with a longer 60-day return period and free mail-in returns.\nUrban Outfitters\nUO has a large selection of chic and (slightly more) affordable decor that we promise won't make your home look like a dorm room.\nSerena & Lily\nSerena & Lily is fulfilling orders as usual, and it's also offering the option to postpone delivery for 30 days free of charge for items eligible for white glove service.\nH&M\nH&M has a very chic, affordable home section, and is offering free returns on everything and free shipping on orders over $25.\nTools and home improvement\nHome Depot\nHome Depot is still open for in-person shopping with reduced hours and delivery. The company is also prioritizing frequent restocking of cleaning supplies.\nLowe's\nLowe's is also continuing to deliver home supplies and keeping physical stores open with reduced hours in order to clean the store.\nSears\nSears has a large tool section and is shipping as usual.\nAcme Tools\nAcme Tools is still touting next-day shipping, free for orders over $199.\nTool Barn\nTool Barn is an online-only retailer with a huge selection of products. Snag free shipping on most orders over $199.\nHarbor Freight\nHarbor Freight stores are opening with limited hours and offering online shopping.\nTool Nut\nTool Nut offers free shipping on orders over $99, and a flat-rate shipping fee of $8 on all other orders.\nGrainger\nPhysical stores remain open and shipping across the country. Curbside pickup is also available.\nNorthern Tool + Equipment\nStores remain open with limited hours, and delivery and curbside pickup are available as well.\nHousehold products\nThe Container Store\nPlenty of containers, plus cleaning supplies, storage options and other household goods are available online.\nIkea\nLow-cost furniture, bedding, decor and supplies are all still being sold online.\nAgain, department and big box stores like Costco, Walmart, Target, Overstock, Wayfair and Macy's have huge selections of household products and are delivering as quickly as possible.\nAppliances\nHome Depot\nBoth Home Depot and Lowe's have large selections of large and small appliances.\nAppliances Connection\nThe store is still doing online orders, though demand and New York's mandatory shelter-in-place order may delay ship times.\nCostco\nCostco is still including free basic hookups and haul-aways with its appliance deliveries.\nSears\nSears is still shipping its huge range of refrigerators, dishwashers, ovens and more.\nBest Buy\nBest Buy is offering doorstep delivery, curbside pickup, as well as drive-up pickup (meaning the goods will be brought to your car).\nStaples\nStaples sells toasters, refrigerators, dishwashers, microwaves and other appliances in addition to office supplies, and is offering free delivery with no shipping minimum.\nMacy's\nMacy's sells appliances both large and small and is offering free shipping on all orders over $25.\nElectronics\nBest Buy\nBest Buy, of course, also has a huge selection of home electronics.\nNewegg\nNewegg is still shipping everything from webcams to massage chairs.\nCostco\nCostco sells pretty much everything, including TVs, computers, tablets and speakers.\nB&H Photo Video\nThe B&H NYC retail location along with its online store will be closed April 7 to April 17. After that the electronic superstore will only be accepting online orders.\nGameStop\nThe video game superstore also has a healthy selection of monitors, media players and other electronics.\nFishpond\nFishpond lists thousands of electronics for sale on its website (in addition to products in just about every category on this list).\nClothing and apparel\nMost department stores are still fulfilling orders, as are many smaller boutiques. Check with your favorite indie designers to see if you can place an order online.\nZappos\nShipping times may be longer than Zappos' typical lightning-fast turnaround, but you'll still get your goods.\nNordstrom\nNordstrom is still shipping online orders but has shut down all retail stores in the U.S. and Canada, which means no curbside pickup for the time being.\nClad & Cloth\nShop this trendy women's online boutique offering free shipping on orders of $75 or more and \"easy returns\" within 30 days of purchase.\nAsos\nThe popular site claims things are \"business as usual\" while \"working hard to make deliveries as safe as possible.\" It has also extended the return period to 90 days.\nRevolve\nRevolve offers tons of designer and mid-range pieces, always with free shipping and returns.\nShopbop\nShopbop has thousands of name-brand shoes, coats, clothes and accessories, often with two-day shipping.\nLulus\nLulus' affordable and very on-trend women's clothing is shipping as usual.\nArticle&\nThe hip boutique offers free shipping on all US orders.\nShoes.com\nHundreds of name-brand shoes for adults and kids alike, with free shipping on all orders.\nWalmart, Kohl's, JCPenney, Target and Gap et al. (Old Navy, Banana Republic, Athleta, etc.) all have affordable selections of clothes and shoes on their websites.\nSporting goods\nREI\nREI is offering free standard shipping on all online orders, even as its physical stores remain closed through March 27.\nDick's Sporting Goods\nDick's is offering free shipping on orders over $25, plus the option of contactless curbside pickup.\nBackcountry\nBackcountry is continuing to ship its large selection of outdoor gear and clothing.\nMoosejaw\nMoosejaw is still offering free two-day shipping on orders over $49.\nCabela's\nSpend $50 and get free two-day shipping.\nBass Pro Shops\nAs with Cabela's, Bass Pro Shops is offering free two-day FedEx delivery on orders over $50.\nPet supplies\nChewy.com\nChewy has a huge selection of pet products and excellent customer service. Shipping is free on orders over $49, though Chewy warns that delivery times are longer than the usual one- to two-day timeframe due to increased demand.\nPetco\nPetco is still touting free one- or two-day shipping on orders over $35.\nPetSmart\nGrooming salons are closed, but PetSmart is still shipping all the supplies for your pet. Plus, it's offering curbside pickup with updated store hours.\n1-800-PetMeds\nIts supply isn't as extensive as the three sites above, but 1-800-PetMeds is still offering free two-day shipping on orders over $49.\nPet Mountain\nPet Mountain offers free shipping on orders over $49, as well as a selection of bulk deals.\nLots of home stores also have surprisingly robust dedicated pet sections. Try your luck at Target, Walmart, Overstock, and Kohl's (even though Kohl's physical stores are closed for now). Fresh food delivery services like NomNomNow and The Farmer's Dog are also still delivering as usual with no anticipated service disruptions.\nBaby products\nBuy Buy Baby\nBuy Buy Baby is still offering same-day delivery on many items and curbside pickup available at all stores.\nBaby List\nAnother option for registering or buying one-off baby products from a large inventory.\nThe Honest Company\nSubscribe for diaper and wipe deliveries and get 17% off every month.\nBurt's Bees Baby\nThe company offers free shipping this whole week, plus an extended, 60-day return period.\nBed Bath & Beyond\nPhysical stores are closed, but the company continues to restock items online as quickly as possible and has also upped its return policy to 240 days.\nTarget, Walmart, Macy's, and other big box stores have well-stocked baby sections as well.\nBeauty products\nUlta\nUlta offers a huge range of beauty products, from drugstore to high-end, and is still offering free shipping on orders over $35.\nSephora\nRetail stores are shuttered through April 3, but you can still shop online (and get fully sealed free samples with your order). Plus you can get free shipping on every order until May 1 with code FREESHIP.\nDermstore\nDermstore is still shipping orders and has bumped up its return window to 90 days.\nSoko Glam\nShop a wide selection of K-beauty supplies with free shipping on orders over $35 and a free gift with orders over $75.\nOh Lolly\nOh Lolly is another retailer that specializes in K-beauty products. Snag free US shipping on orders over $50.\nNordstrom\nNordstrom stocks and delivers many high-end makeup and skin care brands.\nBirchbox\nBirchbox subscriptions are continuing as normal, and you can also shop full-size versions of all products.\nCVS, Walgreens and Target also sell a large selection of drugstore beauty products online.\nHealth and drugstore items\nGNC\nTons of vitamins and supplements, plus containers, apparel and skin care products, are available online.\nMost drugstores are remaining open (though often with altered hours). If you can't (or don't want to) go in person, CVS, Walgreens, Rite Aid, Walmart, Health Warehouse and Target all sell hundreds of drugstore and pharmacy items online.\nOffice supplies\nStaples\nStaples is currently offering free delivery on all orders.\nOfficeMax and Office Depot\nEverything you need to work remotely, shipped as soon as the next day on orders over $45.\nOffice Supply\nOffice Supply is offering free shipping when you spend $45.\nPaper Source\nPaper Source sells stationery, pens, calendars, craft supplies and gift packaging. Free shipping on orders over $50 and $7 flat rate 2-day shipping on all other orders.\nQuill\nAll orders ship free with no minimum.\nToys and games\nGameStop\nGameStop carries thousands of video game titles, plus other toys and electronics. The company is offering free shipping on orders over $35, plus contactless pickup at its stores.\nBarnes & Noble\nGames, toys and, of course, books are still shipping, with free shipping on orders over $35. Curbside pickup is also available.\nFat Brain Toys\nFat Brain specializes in educational toys, and offers a flat rate $3.99 shipping on all orders.\nFishpond\nThe site seems to have everything, including thousands of toys and games.\nAcorn Toy Shop\nThis woman-owned and -operated shop based in Brooklyn sells handcrafted toys and is still fulfilling online orders.\nThe Compleat Strategist\nThis NYC-based shop with a huge selection of board games is continuing to fulfill online orders.\nToysRUs\nYes, it still exists, and yes, it is still shipping.\nOnce again, big box stores like Target, Walmart, and Sears all have dedicated toy and gaming sections (of both the video and board variety).\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/online-shopping-walmart-target-home-depot-outbrain-2/index.html"}