{"authors": ["Analysis Brian Stelter", "Cnn Business"], "date_download": "2020-05-04 16:21:52", "date_modify": "2020-05-04 16:21:52", "date_publish": "2020-04-06 04:16:54", "description": "There's a lot of revisionist history being written right now. Lots of digging of the so-called memory hole. Pro-Trump media outlets are trying to bury the Trump White House's failures to fully protect the country from this pandemic.", "filename": "2020_04_06_media_federal-re_c5e8ceb60f19944d3ad1b95293020cd1_index_1588609312.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406001113-02-reliable-sources-newsletter-0406-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_media_federal-re_c5e8ceb60f19944d3ad1b95293020cd1_index_1588609312.html", "title": "Stelter: Federal response to pandemic is a 9/11-level failure", "title_page": "Stelter: Federal response to pandemic is a 9/11-level failure  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) A version of this article first appeared in the \"Reliable Sources\" newsletter. You can sign up for free right here.\nThere's a lot of revisionist history being written right now. Lots of digging of the so-called memory hole. Pro-Trump media outlets are trying to bury the Trump White House's failures to fully protect the country from this pandemic. They're trying with all their might to shift the blame to mayors and governors.\nLook: There were shortcomings on the local and state levels. But the federal government wields far more power and influence. The president has far more influence and far more responsibility than any governor. So it should be said loudly and clearly and repeatedly: This was a 9/11-level failure of the federal government.\nAs I argued on Sunday's \"Reliable Sources\" telecast, the government's failures need to be covered and scrutinized accordingly. To ignore what went wrong -- or to cover it up or to memory-hole it — does a disservice to the dead.\nWaPo editor: Government 'failed all along the way'\nWashington Post editor Marty Baron said it best on Sunday's program. Relaying the findings from this Page One investigation , Baron said \"the government didn't act like this was a war from the very beginning.\"\n\"And everything stems from the person at the top,\" Baron said, when I asked about the president's responsibility. \"From the very beginning he was being dismissive of this -- of the dangers here.\" Watch...\nReminder: The #'s are woefully incomplete\nThe Post and The New York Times both have front-page stories about this problem in Monday's print editions.\nWaPo's Emma Brown, Beth Reinhard and Aaron C. Davis write: \"The fast-spreading novel coronavirus is almost certainly killing Americans who are not included in the nation's growing death toll , according to public health experts and government officials involved in the tally.\"\nThe NYT's Sarah Kliff and Julie Bosman: \"Inconsistent protocols, limited resources and a patchwork of decision-making has led to an undercounting of people with the coronavirus who have died , health experts say.\"\nSo it's even worse than we think\nOn the right-wing web, there are complaints and conspiracy theories about alleged over-counting of Covid-19 deaths. But the truth is, as Kliff and Bosman wrote , \"the true death toll is likely much higher\" than we know.\nAmong the reasons why: \"In many rural areas, coroners say they don't have the tests they need to detect the disease. Doctors now believe that some deaths in February and early March, before the coronavirus reached epidemic levels in the United States, were likely misidentified as influenza or only described as pneumonia.\" The news coverage needs to reflect this awful reality...\nTwo key quotes\n-- On \"Reliable,\" Gregg Gonsalves took exception to my opening comments. \"It's not a 9/11-level failure,\" he said. \"It's greater than that. As Andy Slavitt said, it's the greatest public health crisis in a hundred years...\"\n-- \"I've got physicians calling me saying I don't know if I'll ever see my child again,\" Dr. Nisha Mehta told me...\nFOR THE RECORD, PART ONE\n-- New reporting from Lachlan Cartwright and Asawin Suebsaeng: Dr. Oz \"has been advising senior Trump admin officials on coronavirus-related matters\" and Oz's hits on Fox have caught Trump's attention... ( Beast\n-- Danny Meyer on Sunday's \"60 Minutes:\" \"This virus has, for me, been almost like a hurricane with no wind, or a forest fire with no flame.\" Scott Pelley's segment was about business owners and the newly unemployed... ( CBS\n-- Surgeon General Jerome Adams preparing the country for the week ahead: \"This is going to be our Pearl Harbor moment, our 9/11 moment...\" ( CNN\n-- David Remnick's newest column: \"These next weeks and months will be demanding in ways that are hard to fathom. If New Yorkers are in hiding, the virus has shown a knack for seeking. But, with time, life will return to the city...\" ( The New Yorker\nFormer IG watchdog addresses recent firing\nMichael Atkinson, the intelligence community inspector general who informed Congress of the whistleblower complaint that led to Trump's impeachment, \"said Sunday that he believes Trump fired him for doing his job,\" CNN's Caroline Kelly and Jeremy Herb report\nAtkinson's public statement is remarkable and worth reading in full . He concludes with a message to employees and contractors who know of malfeasance: \"The American people deserve an honest and effective government. They are counting on you to use authorized channels to bravely speak up -- there is no disgrace in doing so. It is important to remember, as others have said, that the need for secrecy in the United States Intelligence Community is not a grant of power, but a grant of trust. Our government benefits when individuals are encouraged to report suspected fraud, waste, and abuse. I have faith that my colleagues in Inspectors General Offices throughout the federal government will continue to operate effective and independent whistleblower programs, and that they will continue to do everything in their power to protect the rights of whistleblowers. Please do not allow recent events to silence your voices.\"\nAbout the WH briefing...\nOn Sunday morning the White House indicated that there wouldn't be a task force briefing or any public appearance by the president during the day. Then the plan changed and the president scheduled an early evening briefing. There wasn't a lot of news, but there was a lot of huffing and puffing.\n\"Here's the problem: These are not briefings,\" David Axelrod tweeted during the briefing. \"These are sales pitches from POTUS on his own behalf -- laced with shots at whoever he's mad at that day and weird side trips to push untested drugs. What people need is useful 411 about what we need to do and should expect.\"\n\"Trump pitches drug unapproved for coronavirus\"\nThat's the AP's fact-check headline... The newswire's team notes that the preisdent's advocacy of hydroxychloroquine \"is the latest and one of the most consequential examples of Trump and public-health authorities not being on the same page in the pandemic.\"\nCNN's Jeremy Diamond pressed Trump during the briefing: \"Why not just let the science speak for itself? Why are you promoting this drug?\"\n\"I'm not. I'm not. I'm not at all,\" Trump said. Then he continued promoting it: \"I want them to try it. It may work and it may not work.\"\nDoctors are already trying it, but it is not a proven treatment for coronavirus. When Diamond asked Fauci to comment on the matter, Trump stepped in and didn't allow Fauci to answer. Maggie Haberman called it a \"really jarring moment...\"\nTrump cuts off AP reporter\nToward the end of the briefing, Kevin Freking of the AP attempted to ask about his colleague Michael Biesecker's scoop. Biesecker reported that \"federal agencies largely waited until mid-March to begin placing bulk orders of N95 respirator masks, mechanical ventilators and other equipment needed by front-line health care workers.\"\nAs Kaitlan Collins noted , \"the reporter didn't even finish his question, only mentioned 'the equipment issue' before Trump cut him off and asked where he works. Then said 'they have done an unbelievable job' and 'you should be thanking them for what they have done, not always asking wise guy questions.'\"\nTapper directly addresses Trump: Do you have a plan?", "url": "https://www.cnn.com/2020/04/06/media/federal-response-coronavirus-reliable-sources/index.html"}