{"authors": ["Aj Willingham"], "date_download": "2020-05-04 16:00:03", "date_modify": "2020-05-04 16:00:03", "date_publish": "2020-03-21 08:08:41", "description": "Puzzles have entered the mainstream with stylish makeovers and a new reputation as a wholesome self-care activity.", "filename": "2020_03_21_world_puzzles-se_c612b5d749ff18500b371fd51c30143f_index_1588608003.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200320073601-coronavirus-puzzle-trend-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_21_world_puzzles-se_c612b5d749ff18500b371fd51c30143f_index_1588608003.html", "title": "Puzzles are the analog way people are curbing their stay-at-home anxiety", "title_page": "Puzzles are the analog way people are curbing their stay-at-home anxiety - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As the one-two combination of home quarantine and coronavirus anxiety takes its toll on millions of Americans, the hunt is on for new ways to pass the time . (After all, there's only so much Netflix a person can watch.) People sharing their quarantine routines online seem to be fascinated by a recently revived -- and very analog -- solution: Jigsaw puzzles.\nHowever, it's not just the monotony of self-isolation that's brought this pastime back into the spotlight. Puzzles have been \"a thing\" for about a year now , riding the trendy wave of other low-tech, contemplative activities like coloring books and bullet journaling. In 2019, MarketWatch predicted the value of the puzzle industry could reach $730 million by 2024.\nWith this renewed interest, puzzles have entered the mainstream with stylish makeovers and a new reputation as a wholesome self-care activity.\nQuality time, piece by piece\nAmanda Kahle and her husband Christopher started their puzzle business, Inner Piece , a little more than a year ago. The Los Angeles-based couple have demanding full-time jobs, and were feeling some burnout when, by chance, they discovered an unexpected respite.\n\"We were at home over Christmas in 2018, and we just said, 'We need to put the phones away and take a real break.'\" Kahle broke out a puzzle gifted by her mother-in-law, and as the family pieced it together, the evening took a pleasant turn. \"Our kids would float around us, put a couple of pieces in, and then go play,\" Kahle says. \"We were talking and drinking wine and interacting instead of just, say, watching a movie.\"\nNewer puzzle companies, like Inner Piece, feature bespoke, modern art to appeal to fashionable consumers.\nThis collaborative element, which isn't as strong in other \"old-fashioned\" hobbies like coloring or needlework, is one reason Kahle thinks people reach for puzzle boxes over remotes or tablets when they're craving quality time.\n\"You can talk, someone can read nearby and still feel included, and even if you're completely focusing, you still feel like you're doing something together,\" she says.\nDr. Vaile Wright, director of clinical research and quality at the American Psychological Association, says there's more benefits to social activities than just busting boredom, especially when you're cooped up for long periods of time.\n\"Social connection is critical to buffering our stress response,\" she says. \"We know from research that isolation can lead to feelings of depression, sadness, hopelessness, frustration and irritability. So, activities like this aren't frivolous. We need to protect both our mental and physical health during a crisis.\"\nA new look for an old hobby\nIt only takes a quick stroll through a local bookstore (or an isolation-safe browse online) to see that modern puzzles bear little resemblance to the traditional Kinkade-esque gardens and cookie cutter beach scenes of yore.\nNot that there's anything wrong with wisterias or moonlit palm trees, but as people of all generations and tastes rediscover the pleasures of puzzling, the art of puzzles is becoming far more fashionable. Botanicals, Baby Yoda, millennial pink -- even Korean boy band BTS has licensed jigsaw puzzles bearing their massively popular faces.\nA selection of popular puzzles from Barnes & Noble shows trendy themes, like Baby Yoda.\nKahle says when she and her husband decided to turn their love of puzzles into a business, they contacted artists to create special scenes that broke the old jigsaw mold.\n\"We wanted images people would actually want in their house,\" Kahle says. \"And people have been reinventing older things for a while now, so why not put a new spin on it?\"\nPuzzling out stress\nWoven into the coronavirus puzzle boom is another basic desire; not one of amusement, but of comfort and clarity. Puzzles, handcrafts, coloring and other meditative activities have long been thought to decrease feelings of anxiety and increase mental well-being. Studies have connected jigsaw puzzles to improved cognition in the elderly . It only takes one scroll through Twitter or Facebook to see the calming effect puzzles apparently have on people who, at home during a global pandemic, are not inclined to be calm at all.\nInner Piece is still shipping during the coronavirus outbreak, and Kahle says she's definitely noticed an increase in sales. She says customers have been contacting her with stories about how puzzling has been a welcome bright spot in their isolation.\nThere's a popular psychological concept, called flow, that activities like puzzles can ignite. Flow, typically thought of as \"being in the zone,\" is the state someone enters when they're totally concentrated on an activity they find fun and fulfilling.\nWright explains that pursuits like puzzles, crosswords and sudoku change the way your brain functions from moment to moment.\n\"They reduce your right or flight response because it serves as a distraction -- the good kind,\" she says. \"You're mentally looking for patterns, making connections, and that's firing off different parts of your brain that then influence hormone responses.\"\n\"People also find it lowers cortisol, which is your stress hormone, and increases endorphins,\" Wright adds.\nKahle says customers have been contacting her with stories about how puzzling has been a welcome bright spot in their isolation.\n\"It's meditative. When you're puzzling, you're completely focusing,\" Kahle says. \"It's a really simple thing, but when you find a hard piece or finish a whole puzzle, you get this little jolt of, 'Yes, I did that!' I think people realize it makes them feel better.\"\nFeeling better is probably one of the most precious goals at a time when so much feels bad and so many people are at risk or worse. It may be impossible to conjure a picture of perfect calm, but with a few hours and a little determination, anyone can piece together a decent beach scene. And that's almost as good.", "url": "https://www.cnn.com/2020/03/21/world/puzzles-self-quarantine-coronavirus-psychology-wellness-trnd/index.html"}