{"authors": ["Susan Montoya Bryan"], "date_download": "2020-05-04 20:16:00", "date_modify": "2020-05-04 20:16:00", "date_publish": "2020-04-16 19:30:03", "description": "ALBUQUERQUE, N.M. (AP) — New Mexico's multimillion-dollar horse racing industry could resume live racing if strict protocols were imposed, a group of horse owners said Thursday as state racing...", "filename": "_39eddb2e62f3087e49e3d0aed33749df_1588623360.html", "image_url": "https://storage.googleapis.com/afs-prod/media/aa7baf5e1b4e4233a2444426955778e4/2400.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_39eddb2e62f3087e49e3d0aed33749df_1588623360.html", "title": "New Mexico horse owners push for lifting live racing ban", "title_page": "New Mexico horse owners push for lifting live racing ban", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Sept. 6. 2010 file photo, horses compete in the 52nd All-American Futurity at Ruidoso Downs Racetrack and Casino in Ruidoso, N.M. New Mexico's multimillion-dollar horse racing industry could resume live racing if strict protocols were imposed, a group of horse owners said Thursday, April 16, 2020, as state racing regulators discussed the fiscal implications of the industry remaining idle because of the coronavirus outbreak. (Rudy Gutierrez/El Paso Times via AP,File)\nFILE - In this Sept. 6. 2010 file photo, horses compete in the 52nd All-American Futurity at Ruidoso Downs Racetrack and Casino in Ruidoso, N.M. New Mexico's multimillion-dollar horse racing industry could resume live racing if strict protocols were imposed, a group of horse owners said Thursday, April 16, 2020, as state racing regulators discussed the fiscal implications of the industry remaining idle because of the coronavirus outbreak. (Rudy Gutierrez/El Paso Times via AP,File)\nALBUQUERQUE, N.M. (AP) — New Mexico’s multimillion-dollar horse racing industry could resume live racing if strict protocols were imposed, a group of horse owners said Thursday as state racing regulators discussed the fiscal implications of the industry remaining idle because of the coronavirus outbreak.\nRacing in the state was suspended weeks ago because of a string of public health orders aimed at limiting gatherings and curbing the spread of the virus. While the grandstands and casinos are empty, some stables are still operational as groomers and others take care of the horses.\nLifting the ban on live racing would need the approval of Gov. Michelle Lujan Grisham, who has been adamant about social distancing serving as the most important tool in the fight against the virus. It would be up to the state Racing Commission to consider the options and make recommendations to the governor.\nThe commission discussed the issue with track owners during a closed session Thursday. Commissioners did vote to cancel the remaining race dates at Sunland Park in southern New Mexico and SunRay near Farmington. They also cleared the way for purse money to be redistributed to tracks that end up running later this year.\nCommission chairwoman Beverly Bourguet said regulators have been looking at other states that are allowing racing without spectators to see what has worked and what hasn’t. The commission will listen to track owners and others before determining a path forward, she said.\n“We are in uncharted territory and not knowing how long we need to prioritize the health and safety of our people to combat this pandemic,” she said. “We will get through this, but we will need to move slowly and carefully with some protocols.”\nThat could mean racing with empty stands or perhaps waiting until fans are allowed to return, she said.\nThe effects of the racing ban have been felt across the industry — from track owners to the farmers who grow feed for the horses. The state’s coffers also are taking a hit as the industry in the last fiscal year reported more than $48 million in horse racing purses and gaming taxes totaled more than $62 million for track operators. Gaming machine net wins at the tracks also topped $240 million.\nRichard Erhard with the New Mexico Horsemen’s Association described the industry as one of New Mexico’s top economic engines. Restarting racing by May 1 could help the state recover from the economic pains of the pandemic, he said.\nHe also said horse racing is unique in that shutting down completely as other businesses have done isn’t an option because the horses are “living, breathing animals that require constant supervision and care.”\n“Without the possibility of income and support for these horses, we are facing a crisis that could lead to these horses being abandoned throughout the state and potentially an increase in our homeless population,” Erhard told the commissioners. “Your ability to continue live racing under very stringent protocols is vital to our efforts to care for these animals and safeguard those individuals who care for them.”\nSome commissioners had questions about the logistics of restarting racing. Commission executive director Ismael Trejo said it’s not like flipping a light switch, explaining that paddock judges, entry clerks, race officials and track maintenance personnel would be needed along with vet assistants in the barns to administer the state’s drug testing program.\n“There’s a lot of ground to cover,” he said.", "url": "https://apnews.com/39eddb2e62f3087e49e3d0aed33749df"}