{"authors": ["Dan Merica", "Jeff Zeleny"], "date_download": "2020-05-04 16:04:08", "date_modify": "2020-05-04 16:04:08", "date_publish": "2020-04-01 21:45:24", "description": "Florida Gov. Ron DeSantis made clear Wednesday when issuing a statewide stay-at-home order that he is taking his cues from one man: President Donald Trump.", "filename": "2020_04_01_politics_desantis-florida-coronavirus_index_1588608248.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401144357-ron-desantis-sot-florida-stay-at-home-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_desantis-florida-coronavirus_index_1588608248.html", "title": "DeSantis cites Trump's changed 'demeanor' in issuing stay-at-home order in Florida", "title_page": "DeSantis cites Trump's changed 'demeanor' in issuing stay-at-home order in Florida - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Florida Gov. Ron DeSantis made clear Wednesday when issuing a statewide stay-at-home order that he is taking his cues from one man: President Donald Trump .\nThe Republican governor won his position two years ago by tying himself closely to Trump. He took the same approach over the last month as he had resisted growing calls to order residents to limit activity outside their households, even as images of spring breakers and crowded beaches in the state sparked outrage.\nDeSantis' deference to Trump has earned him plaudits from the President, who called him a \"great governor\" on Tuesday, arguing that DeSantis \"knows exactly what he's doing\" to combat the coronavirus.\nDeSantis' reversal on Wednesday corresponds with a shift in tone from Trump , who after weeks of downplaying the impact the pandemic could have on the nation is now explicitly warning that the coming weeks could be deadly and dire. DeSantis cited the President's \"demeanor the last couple of days\" to explain why he was taking this step.\n\"The President just the other day announced they are going to do a 30-day extension for the current guidelines, and although the guidelines don't call for any new actions beyond what was there previously ... I think it is clear that that represents effectively a national pause,\" DeSantis said. \"We're going to be in this for another 30 days. That is just the reality we find ourselves in.\" DeSantis added that \"given those circumstances\" he was \"directing all Floridians to limit movements and personal interactions outside the home to only those necessary to obtain or provide essential services or conduct essential activities.\"\n\"It is a very serious situation,\" DeSantis said of the virus. \"When you see the President up there and his demeanor the last couple of days, that's not necessarily how he always is.\"\nResistance to a statewide order\nDeSantis had consistently rejected calls to issue a statewide stay-at-home order, leaving it to counties and cities to decide on their own whether to bar residents from leaving their homes for anything other than essential needs. That had led to a hodgepodge of rules and regulations across Florida, with some of the largest counties mandating stay at home orders as their less populous neighbors declined to do the same.\nDeSantis often used Trump and the federal government to defend his lack of statewide action\n\"I'm in contact with (the White House team handling coronavirus) and I've said, 'Are you recommending this?' \" DeSantis recalled during a news conference on Tuesday. \"The task force has not recommended that to me.\"\nThe governor added: \"If they do, obviously that would be something that carries a lot of weight with me. We are obviously take whatever they say and we're going to implement that in Florida. If any of those task force folks tell me that we should do X, Y or Z, of course we're going to consider it. But nobody has said that to me thus far.\"\nRoughly 24 hours later, and after Trump and the federal government officially extended their social distancing guidelines to the end of April, DeSantis decided to move.\nDeSantis has said that regular contact with Trump has led him to take specific measures -- like pushing people coming to Florida from the New York area to submit to self-quarantine upon arriving in the Sunshine State. DeSantis has also issued a similar order for travelers coming from Louisiana.\nMore practically, though, the connections to Trump have also seemingly led Florida to receive more help from the federal government than other states.\nState officials told CNN on Tuesday that they had already received 100% of the medical supplies they've requested, even as countless states across the country are getting mere fractions of their asks and continue to wait for desperately needed protective equipment and supplies from the federal government.\nTrump on Sunday lauded the state's efforts at getting supplies.\n\"Florida has been taken care of,\" he said. \"Florida ... they're very aggressive in trying to get things and they're doing a very good job.\"\nRegional approach\nThe Florida governor opened the week by announcing an escalation in his response to the pandemic with an executive order that urged residents to stay home through mid-May if they lived in the South Florida counties of Miami-Dade, Broward, Palm Beach and Monroe.\n\"We're going guns blazing and doing all that we can to slow the spread of Covid-19,\" he told reporters on Monday morning in Miami Gardens. \"This is the time to do the right thing, listen to all of your local officials. We'll do this until the middle of May and we'll see where we're at.\"\nBut three-and-a-half hours later, the governor declared that he had misspoken, saying he actually meant mid-April, not May.\nThe governor's office never explained what led to his correction, affecting the lives of millions of residents across southeast Florida. His order followed what local officials in the four counties had already put in place.\nDeSantis, at that time, defended his stance to stop well short of issuing a statewide stay-at-home order, arguing that his more \"tailored\" approach will \"ultimately ... lead us to have better outcomes and I think it allows us to avoid some potentially unintended consequences in other parts of the state.\"\nThose tactics, however, led to confusion across the governor's 21 million-person state, with rules and regulations varying by county lines.\nCounty officials in population centers like Orange County (home to Orlando), Hillsborough County (home to Tampa), Pinellas County (home to St. Petersburg) and Leon County (home to Tallahassee) all issued stay at home orders. But many counties next to them remained without those orders, leading officials from these population centers to vent frustration.\n\"In the absence of a statewide order, a regional safer-at-home order is welcome to bring much-needed uniformity,\" Democratic state Sen. José Javier Rodríguez said in response to the governor's order about South Florida. \"However, no corner of our state is immune, and a piecemeal/patchwork approach will not cut it.\"\nState hit hard by pandemic\nFlorida has been hit hard by the coronavirus. Nearly 7,000 people in the state have tested positive for the virus, with 84 people dying. And state officials worry the situation could get increasingly worse, given the number of tourists who come in and out of Florida and that state's relatively older population core.\nDeSantis, from the outset of the viral spread, has been hesitant to take the same sweeping steps that other governors have.\nThe Republican governor avoided issuing a statewide mandate to close the beaches in Florida in early March, instead showing deference to local municipalities to make that decision. That strategy was later complicated by viral videos of spring breakers on some of Florida's most famous beaches.\nAnd while DeSantis did issue stern warnings about getting off the beaches -- \"Spring break's done,\" he said in mid-March -- he continued to argue decisions on beaches should be left to local municipalities. That led leaders from Miami Beach, Fort Lauderdale and Tampa to issue mandates to close some of their beaches.\nTrump has loomed throughout much of DeSantis' response, with the governor often following the lead of the President, who he speaks to frequently.\nThe former congressman ran for governor by touting his ties to Trump. He even released an ad featuring him teaching his kids different parts of Trump's platform, including by building a wall with one of his children, a reference to the President's efforts to build a wall along the US-Mexico border, and reading Trump's memoir, \"Art of The Deal,\" to his baby.", "url": "https://www.cnn.com/2020/04/01/politics/desantis-florida-coronavirus/index.html"}