{"authors": ["Todd Richmond"], "date_download": "2020-05-04 20:26:53", "date_modify": "2020-05-04 20:26:53", "date_publish": "2020-04-17 18:01:26", "description": "MADISON, Wis. (AP) — Election clerks in northern Wisconsin said Friday that they're ready for next month's special congressional election after they managed to make it through the April 7 election...", "filename": "_8b01e819253b20ef032b5f6ea7de8cf4_1588624013.html", "image_url": "https://storage.googleapis.com/afs-prod/media/dad41e0cdee941a89bb6000c91c33ac9/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8b01e819253b20ef032b5f6ea7de8cf4_1588624013.html", "title": "Wisconsin clerks ready for special congressional election", "title_page": "Wisconsin clerks ready for special congressional election", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HOLD FOR STORY BY SCOTT BAUER - FILE - In this June 20, 2019 file photo, Tricia Zunker speaks at the Marathon County Courthouse in Wausau, Wis. Zunker is seeking to replace U.S. Rep. Sean Duffy in the 7th Congressional District. (T'xer Zhon Kha/Wausau Daily Herald via AP File)\nHOLD FOR STORY BY SCOTT BAUER - FILE - In this June 20, 2019 file photo, Tricia Zunker speaks at the Marathon County Courthouse in Wausau, Wis. Zunker is seeking to replace U.S. Rep. Sean Duffy in the 7th Congressional District. (T'xer Zhon Kha/Wausau Daily Herald via AP File)\nMADISON, Wis. (AP) — Election clerks in northern Wisconsin said Friday that they’re ready for next month’s special congressional election after they managed to make it through the April 7 election despite the difficulties posed by the coronavirus pandemic.\nLessons learned from the chaotic spring election will help them pull off the race in the 7th Congressional District on May 12 to fill the seat vacated by retired Republican Rep. Sean Duffy, they said. The election will be held across a sparsely populated rural district and turnout should be lower than this month’s. Plus they have plenty of protective equipment left over for poll workers and voters, they said.\n“If they’re going to go forward with it, let’s just go forward with it and get it done,” said Terri Kalan, clerk in Superior, a city of 27,000 in northwest Wisconsin just across the border from Duluth, Minnesota.\nThe 7th Congressional District covers all or parts of 26 northern and northwestern Wisconsin counties. It’s the state’s largest congressional district geographically. Democrat Tricia Zunker, the president of the Wausau School Board, faces Republican state Sen. Tom Tiffany for the seat that’s been open since September.\nZunker didn’t respond to a message seeking comment. Tiffany said he thinks clerks are prepared for May 12 and voters who don’t trust the U.S. Postal Service to deliver their absentee ballots shouldn’t be denied a chance to vote in person.\nGov. Tony Evers on Thursday extended his stay-at-home order through May 26, but his chief legal counsel, Ryan Nilsestuen, signaled that the May 12 election likely will go on as scheduled. Nilsestuen emphasized that the district is rural and fewer people are infected in the region than in urban areas such as Milwaukee and Madison. Clerks have also had more time to prepare and mail out absentee ballots, he said.\nKelli Rasmussen, clerk in Barron, a city of 3,200 about 90 miles northeast of the Twin Cities, said she has only one polling place, in City Hall.\nShe lost six poll workers heading into April 7 but was able to replace them with four recruits and two National Guard members. The chief of police made in-person voters wait in their cars before letting them into City Hall to maintain social distancing. All told, her workers handled about 300 voters, with another 500 or so voting absentee.\nRasumussen has enough poll workers for May 12 and the chief again will keep people in their cars to maintain social distancing, she said. All voters will be given gloves and a mask, just like on April 7, she said.\nHer biggest concern is a potential court order creating confusion. Zunker has called for clerks to mail ballots to all registered voters, a non-starter for Rasmussen.\n“We have about 1,600 registered voters,” she said. “It would be mind-numbingly horrible if they ordered us to send an absentee ballot to everyone. I don’t know how that could be done.”\nValerie Foley, the clerk in Rhinelander, a city of 7,600 about 200 miles north of Madison, said she lost two-thirds of her poll workers heading into April 7. She had to consolidate her two polling sites into one at Rhinelander High School and rely on four National Guard soldiers to help. She said the biggest problem was voters hanging around and chatting.\n“They were starved for human contact,” she said. “We learned to just keep an eye on people and make sure they don’t linger too long.”\nFoley said Evers should postpone the election especially since he wants people to stay at home through May 26.\n“You’re still bringing us all together for an election,” Foley said. “It’s like feeding us to the wolves. We’re in northern Wisconsin. We don’t matter.”\n___\nThis story has been corrected to show there are 26 counties in the 7th Congressional District, not 20. It is also corrected to note that Barron is northeast of the Twin Cities, not northwest.\n___\nFollow Todd Richmond on Twitter: https://twitter.com/trichmond1", "url": "https://apnews.com/8b01e819253b20ef032b5f6ea7de8cf4"}