{"authors": ["Analysis Matt Egan", "Cnn Business"], "date_download": "2020-05-04 16:23:46", "date_modify": "2020-05-04 16:23:46", "date_publish": "2020-04-06 18:59:08", "description": "President Donald Trump has not fully shut down the American economy out of fear it will deal a devastating financial blow. But that reluctance could ultimately exacerbate the economic pain of the coronavirus pandemic.", "filename": "2020_04_06_business_economy-coronavirus-trump_index_1588609426.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406100952-washington-dc-coronavirus-0401-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_business_economy-coronavirus-trump_index_1588609426.html", "title": "Why the US response to coronavirus could deepen the recession", "title_page": "Why the US response to coronavirus could deepen the recession - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) President Donald Trump has not fully shut down the American economy out of fear it will deal a devastating financial blow. But that reluctance could ultimately exacerbate the economic pain of the coronavirus pandemic.\nTrump has largely left it up to the governors to issue stay-at-home orders aimed at slowing the spread of the virus. Many, but not all, US states have done so.\nBank of America is warning that the United States, as well as Europe, has failed to learn the lessons from the success of more aggressive shutdowns ordered by governments in Asia.\n\"The US health policy response has been slower and weaker,\" Bank of America economists wrote in a report published late last week. \"The end result of these delays is a much bigger and longer shock.\"\nThe shock has already been staggering. More than 10,000 people have died from coronavirus complications in the United States.\nThe economy is on pace to suffer an historic collapse this quarter. Millions of jobs have been lost. Unemployment could temporarily spike to \"depression\" levels , former Federal Reserve Chairwoman Janet Yellen warned Monday.\n\"This is a huge, unprecedented and devastating hit,\" Yellen said on CNBC\n'Ineffective response' from the United States\nBank of America, citing an \"ineffective response\" from the US and other governments, is warning that hit will likely get worse.\nThe bank significantly downgraded its 2020 GDP outlook for the United States, calling for a plunge of 6%, compared with 0.8% previously. And it now expects a global recession that will be \"considerably worse\" than the Great Recession.\n\"Only this week did the Trump Administration admit to the scale of the problem and there is still not a consistent, aggressive national policy,\" the bank said in its report, published last Thursday.\nHere's the problem: Economists say the experience in China, South Korea and other countries in Asia showed that the most effective policy is a strict lockdown at the national level. Yet Trump has refused to issue such an order.\n\"If a full shutdown is needed to bend the curve, then the weeks of partial shutdown are largely wasted,\" the Bank of America report said.\nAnd if those weeks are wasted, that will only drag out the impact on the economy and on human life. Each week of the shutdown cuts nearly 9% from quarter-over-quarter annualized GDP growth, the report said.\n\"For the economy, a delay means a rapid increase in the cost,\" the economists said.\nNew York peaking?\nUS stocks surged Monday on glimmers of hope in the fight against coronavirus. The Dow spiked more than 1,100 points, or roughly 5%, on signs that the virus could be peaking in New York , the epicenter of the crisis in the United States. Hospitalizations in New York have also sharply declined over the past three days.\n\"This is great news and seems to confirm the intuitive success of social distancing efforts,\" Cowen analyst Kevin Kopelman wrote in a Monday note to clients.\nBut there is reason to believe that the national picture could yet get worse before it gets better.\n\"In the United States, trends continue to deteriorate,\" Matthew Harrison, a biotech analyst at Morgan Stanley, wrote in a report to clients Monday. \"Mortality is growing exponentially and new 'hot spots' are developing in the interior of the country.\"\nMorgan Stanley: Social distancing for another 70+ days\nThe problem, according to Harrison, is the US response to the coronavirus pandemic.\n\"We would expect it to take longer in the US given the social distancing measures are not as robust,\" Harrison wrote. \"The containment measures continue to not be as strict as China which has delayed the time to peak.\"\nMorgan Stanley expects the United States to experience two peaks, one for coastal regions in around two weeks and then a second peak in the interior. The ultimate apex for the nation may not happen until mid-May.\nAs a result, the US economy may not enjoy a rapid reopening like the one Trump envisions and that many Americans are hoping for.\nSocial distancing measures are \"unlikely to start to recede\" for about 70 days from now, Harrison said, and these restrictions will likely \"wax and wane as hot spots develop over the next 1-2 years.\"\nSome states have not issued stay-at-home orders\nThe federal government has taken several other steps aimed at addressing the pandemic, including building temporary hospitals in New York City, sending ships to act as floating hospitals and working with US states to help secure badly needed medical equipment.\n\"We will move heaven and earth to safeguard our great American citizens,\" Trump said during Sunday's press briefing.\nTrump acknowledged that the next week or two will be very difficult: \"There'll be a lot of death, unfortunately, but a lot less death than if this wasn't done.\"\nEight governors have refused to issue statewide stay-at home orders -- even though Dr. Anthony Fauci, the nation's top infectious disease expert, has said these orders are the most effective way to stop the virus.\nTrump has said he wants to leave it up to governors to decide what happens in their states.\n\"They're doing very well, and they're doing a magnificent job in running their states,\" Trump said during a press briefing.\nMore aggressive financial response\nThe good news is that Washington has mounted a forceful financial response to coronavirus.\nThat response should help blunt the economic damage caused by the coronavirus and hopefully set the stage for a more rapid recovery. But before that can happen, the health crisis must end.", "url": "https://www.cnn.com/2020/04/06/business/economy-coronavirus-trump/index.html"}