{"authors": ["Opinion Jeffrey Sachs"], "date_download": "2020-05-04 16:24:03", "date_modify": "2020-05-04 16:24:03", "date_publish": "2020-04-06 21:31:02", "description": "Jeffrey Sachs writes that the US should immediately organize phone and computer banks to contact each of the people on the confirmed Covid-19 list every day, check on symptoms, support self-isolation and trace their contacts with others.", "filename": "2020_04_06_opinions_how-to-conquer-covid-19-sachs_index_1588609443.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405013646-01-coronavirus-0404-new-york-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_opinions_how-to-conquer-covid-19-sachs_index_1588609443.html", "title": "This is how we conquer Covid-19", "title_page": "This is how we conquer Covid-19 (Opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Jeffrey Sachs is a professor and director of the Center for Sustainable Development at Columbia University. The opinions expressed in this commentary are those of the author; view more opinion articles on CNN.\n(CNN) Since we lack effective drugs or a vaccine, there are only two ways to stop the Covid-19 epidemic short of catastrophe. They both involve stopping infectious individuals from spreading the disease.\nThe first is the rapid isolation of infected individuals. The second is a shutdown of economic and social activities to cut the number of face-to-face contacts each day. More than half the world's population is now under lockdown or stay at home orders.\nIt's urgent for every nation, indeed every community, to step up the rapid isolation of symptomatic individuals to save millions of lives and to make it possible to restart the economy as quickly as possible without setting off a new explosion of disease.\nEvery country now has lists of confirmed Covid-19 cases who should be contacted daily by the public health system. At the time of writing, the US confirmed active cases are around 362,000 people , a modest number by the standards of the digital age, when a presidential campaign can contact hundreds of thousands of people in a day.\nIndeed, recent reports note that the Republican National Committee was able to make 1.5 million calls to voters using phone banks in a fully remote, digital outreach effort. If only the same energy were being put into phone banks for our national survival.\nCountries in East Asia have been successfully using phone calls and online apps to support testing, tracing and isolation of infected individuals.\nWe don't really need the most advanced or intrusive features of those apps to achieve large benefits. The key is for the health system to make contact with those who have Covid-19 symptoms to promote early self-isolation and testing. Fortunately, after lagging behind in testing for two crucial months, the US is finally stepping up the rate of testing.\nEvery country and US state should immediately organize phone and computer banks in which volunteers or paid staff working from home will contact each of the people on the confirmed Covid-19 list every day, and use the calls to check on symptoms, support self-isolation (including by providing them with public services they may need) and trace their contacts with family members, work colleagues and others.\nThese contacts would then also be called to check on their own symptoms, helping to put those with new symptoms into quick isolation. The symptomatic individuals among these contacts would provide information on their close contacts as well, thereby identifying more and more people with Covid-19 symptoms and likely infections among presymptomatic and asymptomatic individuals.\nEvery person with symptoms -- cough, fever, breathing difficulty -- should be regarded as a presumptive Covid case and put into immediate self-isolation. The public health authorities would maintain lists of \"possible Covid cases\" alongside the existing lists of \"confirmed Covid cases.\"\nIn the best-case scenario, each of the suspected cases would be tested within 24 hours of viral exposure using one of the newly developed rapid diagnostic tests.\nA positive test would shift them from possible to confirmed cases. A negative result, though, would not necessarily remove them from the possible list, because of the possibility of false-negative results.\nIndividuals with Covid-19-type symptoms should remain in isolation until their symptoms disappear for several days and they test again negative.\nThe confirmed list will grow quickly as it captures more and more of the infected population that has not yet been tested and isolated. The evidence from China's epidemic showed that a substantial proportion of the viral spread arose from cases that were not identified by the health system, tested and confirmed.\nThe contact tracing and systematic outreach to all symptomatic individuals would greatly accelerate the early testing and self-isolation of more Covid-19 cases, and it would make it far easier for symptomatic individuals to register for testing, paid sick leave and social support.\nAll symptomatic individuals who are in isolation should automatically receive guaranteed sick pay and time off from work. If self-employed, they should receive a daily living stipend. If unemployed, and not yet registered for unemployment compensation, they should be enabled to do so online.\nNobody in this epidemic should ever have to choose between their job and staying home to protect others. There could be no better use of the federal funding than paid sick leave and other income support to help workers in need to stay home while also helping to end the epidemic itself.\nA technical demonstration of how early isolation subdues the epidemic is found in a new paper published in the Proceedings of the National Academy of Sciences, in which I am a co-author as an economist among a group of stellar epidemiologists.\nThe epidemiologists emphasize the numerical force of early isolation in reducing the epidemic by reducing the number of days that infected people are contacting others and thereby spreading infections. The economist's role is to help identify the public support systems and financial incentives to implement rapid self-isolation, such as guaranteed paid sick leave and social services.\nOur immediate national goal should be to get at least half of newly symptomatic cases (both those now measured in the data and those not yet measured) to self-isolate on the first day of symptoms -- and to go even higher after that. If all newly symptomatic cases would self-isolate no more than one day after the appearance of their symptoms, they would most likely infect fewer than one other person on average.\nThe epidemic would quickly wane without the need for a continuing near-total lockdown. The sooner we achieve a high rate of early isolation of symptomatic cases, the faster the lockdown can be ended.\nWe've so far been paralyzed in the face of this crisis. The federal government has done too little, too late in its response to the crisis, largely leaving the battle to the governors and mayors. Even the so-called flight suspension from China that Trump incessantly brags about didn't actually stop the travel or infections from China.\nSome 40,000 passengers arrived from China after Trump's announcement of the travel suspension. Even more shocking, there has been little systematic contact tracing in the US, despite the growing list of Covid-19 confirmed cases, and there was little testing until recently because of the utterly botched rollout of tests by the Centers for Disease Control and Prevention (CDC).\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nIn short, we've been running without serious public health measures for more than three months since the CDC first learned directly about the new disease from China's CDC on January 3.\nThere is no need or time for further delay. States such as California are stepping forward with online sites for testing, but the nation still lacks comprehensive contact tracing via phone or online apps.\nThe phone banks for contact tracing and early self-isolation can and should start up immediately. We should learn from East Asia's experience and from each other across the nation. We've been stymied at the federal level for three months and locked down for weeks. Our health workers have suffered grievously on the front lines. Too many Americans have already died.\nIt's time for public health now to bring this epidemic to a rapid end.", "url": "https://www.cnn.com/2020/04/06/opinions/how-to-conquer-covid-19-sachs/index.html"}