{"authors": ["Becky Bohrer"], "date_download": "2020-05-04 20:24:07", "date_modify": "2020-05-04 20:24:07", "date_publish": "2020-04-21 03:36:22", "description": "JUNEAU, Alaska (AP) — Gov. Mike Dunleavy said Alaskans soon could be making appointments at barbershops and nail salons again, as the state looks to further reopen parts of the economy shut down...", "filename": "_3a96eb570ca5c460eab9ff0cf7b6d052_1588623847.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3a96eb570ca5c460eab9ff0cf7b6d052_1588623847.html", "title": "Alaska governor to outline plans to reopen economy", "title_page": "Alaska governor to outline plans to reopen economy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "JUNEAU, Alaska (AP) — Gov. Mike Dunleavy said Alaskans soon could be making appointments at barbershops and nail salons again, as the state looks to further reopen parts of the economy shut down or restricted over coronavirus concerns.\nDunleavy on Monday said details are expected this week. Other areas he said were being looked at include restaurants and retail shops, businesses he said employ many people and could put in place safety protocols while meeting demand for services.\nHe said Alaskans will be asked to continue washing their hands, cleaning surfaces, maintaining social distance and wearing masks, particularly when shopping.\nThe state feels pretty good about its numbers and its health care capacity, equipment and ability to track cases, he said. The state has reported at least 321 cases of COVID-19, with 161 of those cases recovered and nine deaths.\nThe new coronavirus causes mild or moderate symptoms for most people. For some, especially older adults and people with existing health problems, it can cause more severe illness or death.\nState officials previously announced they would begin lifting restrictions on certain health care activities. The first piece of that took effect Monday. Provisions related to elective surgeries take effect May 4.\nAround the country, state and local leaders have faced calls to reopen the economy. A demonstration-by-vehicle is planned for Anchorage Wednesday to let Dunleavy, a Republican, and Anchorage Mayor Ethan Berkowitz, a Democrat, know “we are ready to open the economy,” according to a social media post for the event.\nBerkowitz said people are free to speak their minds. But he said he sees a larger demonstration, of those hunkering down.\n“I think that demonstration is vastly larger and represents a much more significant percentage of the public,” he said.\nBerkowitz released a multi-phased approach for reopening Alaska’s largest city. It calls for criteria, such as widespread testing capacity and a downward trend in case counts for 14 days, to be met to move from the current, hunker-down phase.\nHe said the plan wouldn’t be driven by hard dates but by data.\nHe said the plan the state is working on is slightly different but that the principles are the same. Berkowitz said the city has been working in conjunction with the state.\nDunleavy last week said he agreed to a large extent with those who felt the restrictions were infringing upon their personal freedoms. But he said the state acted to prevent the kinds of outbreaks seen in other places.", "url": "https://apnews.com/3a96eb570ca5c460eab9ff0cf7b6d052"}