{"authors": ["Reporter"], "date_download": "2020-05-04 20:27:39", "date_modify": "2020-05-04 20:27:39", "date_publish": "2020-04-30 08:10:13", "description": "Harvey Fineberg reality-checked the president, who hopes to hold a \"good old-fashioned 25,000-person\" rally in the not-too-distant future.", "filename": "entry_infectious-disease-expert-donald-trump-rally-coronavirus_n_5eaa7a14c5b62eaf043f1e92_1588624059.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa82ac30000030121552a7.jpeg?cache=egcz3lirsz&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_infectious-disease-expert-donald-trump-rally-coronavirus_n_5eaa7a14c5b62eaf043f1e92_1588624059.html", "title": "Infectious Disease Expert Spells Out Why Donald Trump’s Rally Plan Is ‘Not A Good Idea’", "title_page": "Infectious Disease Expert Spells Out Why Donald Trump’s Rally Plan Is ‘Not A Good Idea’ | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Infectious disease expert Dr. Harvey Fineberg on Wednesday explained why President Donald Trump’s hope to hold “massive” campaign rallies in the “not-too-distant future” during a pandemic is “not a good idea.”\nEarlier in the day, Trump said he was unable to imagine a rally “where you have every fourth seat full” due to social distancing measures aimed at slowing the spread of the disease that has killed more than 60,000 people nationwide.\nThe president, whose response to the public health crisis has been widely criticized, also said he hoped to hold “good old-fashioned 25,000-person rallies” before the 2020 election.\n“We have a tremendous pent-up demand. They love what we’re doing,” he said.\nFineberg, the former president of the National Academy of Medicine who has advised the Trump White House on the outbreak, told CNN’s Don Lemon that “this virus doesn’t care about American politics.”\n“It doesn’t care whether you have a rally for political reasons, for a sporting event, for a choir that’s going to sing together, for a musical festivity,” Fineberg said. “It doesn’t make any difference.”\n“The virus spreads through proximity of one person who’s infected to others who are not infected. The larger the numbers, the more likely infection will spread. The longer the time together, the more likely infection will spread,” Fineberg continued. “Shouting, singing, cheering are all things that help the virus to spread from one person through droplets, that are visible and invisible, from one person to another.”\n“In short, bringing together 25,000 people for any reason in a closed space for any length of time while this virus is still present is not a good idea,” he concluded.\nCheck out the interview here:\n\"Bringing together 25,000 people for any reason in a closed space for any length of time while this virus is still present is not a good idea.\" - Dr. Harvey V. Fineberg, an infectious disease expert, on having large gatherings amid the coronavirus pandemic https://t.co/zbjaY1BvZh pic.twitter.com/8WLoqRxdY1 — CNN Tonight (@CNNTonight) April 30, 2020\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/infectious-disease-expert-donald-trump-rally-coronavirus_n_5eaa7a14c5b62eaf043f1e92"}