{"authors": ["Mitch Stacy"], "date_download": "2020-05-04 20:15:02", "date_modify": "2020-05-04 20:15:02", "date_publish": "2020-04-15 17:29:27", "description": "COLUMBUS, Ohio (AP) — Ohio State coach Ryan Day said the addition of Oklahoma transfer running back Trey Sermon will give the Buckeyes some depth at a position that has become a question mark...", "filename": "_867b27c1811d4f83551da0072a780ada_1588623302.html", "image_url": "https://storage.googleapis.com/afs-prod/media/fbf371a10f134bab8abdaff059c765d7/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_867b27c1811d4f83551da0072a780ada_1588623302.html", "title": "Oklahoma transfer Sermon added to Buckeyes' hobbled RB corps", "title_page": "Oklahoma transfer Sermon added to Buckeyes' hobbled RB corps", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Sept. 28, 2019, file photo, Oklahoma running back Trey Sermon (4) carries for a touchdown in front of Texas Tech defensive back Dadrion Taylor (25) in the third quarter of an NCAA college football game in Norman, Okla. Ohio State coach Ryan Day said the addition of Oklahoma transfer running back Trey Sermon will give the Buckeyes a boost at a position that will be a question mark for going into fall training camp. (AP Photo/Sue Ogrocki, File)\nFILE - In this Sept. 28, 2019, file photo, Oklahoma running back Trey Sermon (4) carries for a touchdown in front of Texas Tech defensive back Dadrion Taylor (25) in the third quarter of an NCAA college football game in Norman, Okla. Ohio State coach Ryan Day said the addition of Oklahoma transfer running back Trey Sermon will give the Buckeyes a boost at a position that will be a question mark for going into fall training camp. (AP Photo/Sue Ogrocki, File)\nCOLUMBUS, Ohio (AP) — Ohio State coach Ryan Day said the addition of Oklahoma transfer running back Trey Sermon will give the Buckeyes some depth at a position that has become a question mark because of injuries.\nSermon, a graduate transfer whose season was cut short by a knee injury after nine games last year, joins a stable that includes Master Teague III — the heir apparent to departing star J.K. Dobbins — along with Marcus Crowley and others. But Teague is rehabbing from an Achilles injury suffered on the first day of spring practice, before it was called off entirely because of the coronavirus pandemic, and Crowley is recovering from a knee injury suffered last season.\nSermon, one of the highest-profile players to move via the transfer portal this offseason, ran for 2,076 yards and 22 touchdowns in three years at Oklahoma. He also had 36 catches for 391 yards and three more scores. Last season, he had 54 carries for 385 yards and four touchdowns, averaging a career-best 7.1 yards per carry before the injury.\nIn a conference call with reporters Wednesday, Day said his staff didn’t get to spend much time with Sermon because of coronavirus-related distancing rules, but he’s satisfied Sermon is on track to contribute, saying, “we felt really good about this.”\n“He can do a lot of things,” Day said of the 6-foot, 221-pound back. “I mean he’s big, strong, powerful, has got good feet in the hole. He can break tackles, he can run routes out of the backfield. He’s another versatile guy.”\nOklahoma coach Lincoln Riley said similar things.\n“Really, really good teammate,” Riley said. “Some really, really nice moments here throughout his career. I loved the three years we’ve had with him. Hate that it ended on a sour note for him because he did a great job here.”\nDay didn’t go into detail about the condition of his injured players but said all are meeting with coaches and trainers online and are working out on their own. The players still in Columbus have access to the Jameson Crane Sports Medicine Institute on campus even though the football facility remains closed.\nAs for if and when the 2020 college football season starts, Day said he thinks coaches and players would need around six weeks to get ready to play a game.\n“A lot of people have to weigh in on that,” he said. “I know some people think we can do it in four (weeks), some people say you need eight. Six is kind of in between, and then what do those look like? There are a lot of committees involved in this right now who are talking about those very things.”\nDay, who is in in his second full year as Ohio State’s head coach after taking over for the retired Urban Meyer, said it’s especially difficult to visualize the future right now.\n“Once we got into spring ball, that was kind of the first time in about two years where I took half a deep breath and was like ‘OK, I’m kind of getting my feet on the ground here,’” he said. “We get three practices of the spring out of the way, and here comes the quarantine. It’s kind of been almost the way it’s been for the last three years. Let’s do the best we can to maximize today because tomorrow we’re not quite sure what’s going to happen.”\n___\nAP Sports Writer Cliff Brunt contributed from Oklahoma City, Oklahoma.\n___\nMore AP college football: https://apnews.com/Collegefootball and https://twitter.com/AP_Top25\n___\nFollow Mitch Stacy at https://twitter.com/mitchstacy", "url": "https://apnews.com/867b27c1811d4f83551da0072a780ada"}