{"authors": ["Paul Leblanc"], "date_download": "2020-05-04 16:13:10", "date_modify": "2020-05-04 16:13:10", "date_publish": "2020-04-03 01:45:33", "description": "The nation's top infectious disease expert said Thursday he doesn't understand why every state hasn't issued stay-at-home orders as novel coronavirus cases continue to surge across the US.", "filename": "2020_04_02_politics_fauci-stay-home-coronavirus-states-cnntv_index_1588608790.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331124419-02-fauci-0327-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_fauci-stay-home-coronavirus-states-cnntv_index_1588608790.html", "title": "Fauci: 'I don't understand why' every state hasn't issued stay-at-home orders", "title_page": "Dr. Anthony Fauci: says 'I don't understand why' every state hasn't issued stay-at-home orders - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The nation's top infectious disease expert said Thursday he doesn't understand why every state hasn't issued stay-at-home orders as novel coronavirus cases continue to surge across the US.\n\"I don't understand why that's not happening,\" Dr. Anthony Fauci told CNN's Anderson Cooper during CNN's coronavirus town hall.\nMore than 30 states and the District of Columbia have ordered their residents to stay at home. Fauci said governors that have held out thus far \"really should\" reconsider with the number of US cases passing 236,000 on Thursday and continuing to climb.\n\"You know, the tension between federally mandated versus states' rights to do what they want is something I don't want to get into,\" he said. \"But if you look at what's going on in this country, I just don't understand why we're not doing that.\"\nFauci's message appears to be at odds with President Donald Trump, who has repeatedly said that he doesn't think a nationwide stay-at-home order is necessary, stressing the need for flexibility between different states.\nRead More", "url": "https://www.cnn.com/2020/04/02/politics/fauci-stay-home-coronavirus-states-cnntv/index.html"}