{"authors": ["Susan Montoya Bryan"], "date_download": "2020-05-04 20:21:39", "date_modify": "2020-05-04 20:21:39", "date_publish": "2020-04-10 21:44:58", "description": "ALBUQUERQUE, N.M. (AP) — A quarter horse trainer whose combined earnings over a decades-long career total nearly $13 million has been hit with a hefty fine and a 34-year suspension for several...", "filename": "_cc38d6635c6e4878847215a8c86dfd9d_1588623699.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cc38d6635c6e4878847215a8c86dfd9d_1588623699.html", "title": "Horse trainer faces stiff fines, suspension in New Mexico", "title_page": "Horse trainer faces stiff fines, suspension in New Mexico", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ALBUQUERQUE, N.M. (AP) — A quarter horse trainer whose combined earnings over a decades-long career total nearly $13 million has been hit with a hefty fine and a 34-year suspension for several doping violations.\nDocuments obtained from the New Mexico Racing Commission show the violations involved horses that tested positive while at Ruidoso Downs in southern New Mexico. The out-of-competition testing occurred in July 2019.\nThe horses — all owned by Jose Fabian Hernandez of Jarrell, Texas — tested positive for the medication ostarine. The drug is not approved by the FDA, but sites that sell it bill it as an oral solution that promotes muscle growth.\nUnder the commission’s ruling, Bobby Martinez faces fines totaling $480,000 and he won’t be eligible to apply for a state license until 2054. Any horses owned or trained by Martinez will be ineligible to race in New Mexico during his suspension.\nMartinez could appeal the commission’s rulings. Messages were left Friday for his attorneys.\nMartinez told the American Quarter Horse Association’s publication Q Racing that he never handled the horses that tested positive and only served as the trainer on paper. He said the punishment was too harsh and that he has never had a Class 1 violation in his 30-year career.\n“The only thing I’m guilty of is lending my name out,” Martinez said, saying the case has ruined his life.\nSince 1991, Martinez has trained more than 4,000 starters, with more than half of them placing.\nThe case comes as activists have targeted the racing industry over a string of horse deaths. They praised the rulings against Martinez and called for trainers and owners to stop running “doped up horses” during the coronavirus outbreak, noting that other sports have been put on hiatus.\nRacing in New Mexico is on hold due to public health orders issued by Gov. Michelle Lujan Grisham that have led to the closure of nonessential businesses, casinos and other venues. The restrictions also limit groups to less than five people in hopes of curbing the spread of the virus.\nThe Racing Commission at a recent special meeting agreed to postpone racing at SunRay Park in Farmington, saying the rest of the year remained a “rolling target.”\nCommission Chairwoman Beverly Bourguet said during the meeting that the closure of the tracks and casinos has had significant financial consequences for horse owners, jockeys, trainers, groomers, boarding facilities, farmers who grow feed for the animals and others.\nThe commission next week is expected to issue a letter on the financial effects of the closure and consider possible changes to more race dates and purse money for the 2020 season.", "url": "https://apnews.com/cc38d6635c6e4878847215a8c86dfd9d"}