{"authors": ["Jeff Amy"], "date_download": "2020-05-04 20:23:31", "date_modify": "2020-05-04 20:23:31", "date_publish": "2020-04-20 16:01:03", "description": "ATLANTA (AP) — Georgia's governor announced plans Monday to restart the state's economy before the end of the week, saying many businesses that closed to mitigate the spread of the coronavirus...", "filename": "_cbf7decd1893f9d9afa3ed66b0f516d3_1588623811.html", "image_url": "https://storage.googleapis.com/afs-prod/media/49d5a448ba3b4439b01e0b7fcf560eb2/2738.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cbf7decd1893f9d9afa3ed66b0f516d3_1588623811.html", "title": "Georgia to reopen some businesses as early as Friday", "title_page": "Georgia to reopen some businesses as early as Friday", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Wednesday, April 1, 2020 file photo, Georgia Gov. Brian Kemp speaks during a news conference at Liberty Plaza across the street from the Georgia state Capitol building in downtown Atlanta. Kemp is in a very public battle with Shirley Sessions, who was sworn in barely three months ago as mayor of Tybee Island, a small coastal community that thrives on beach tourism, after he reversed the city's painful decision to close its own beach to slow the coronavirus. (Alyssa Pointer/Atlanta Journal-Constitution via AP, File)\nFILE - In this Wednesday, April 1, 2020 file photo, Georgia Gov. Brian Kemp speaks during a news conference at Liberty Plaza across the street from the Georgia state Capitol building in downtown Atlanta. Kemp is in a very public battle with Shirley Sessions, who was sworn in barely three months ago as mayor of Tybee Island, a small coastal community that thrives on beach tourism, after he reversed the city's painful decision to close its own beach to slow the coronavirus. (Alyssa Pointer/Atlanta Journal-Constitution via AP, File)\nATLANTA (AP) — Georgia’s governor announced plans Monday to restart the state’s economy before the end of the week, saying many businesses that closed to mitigate the spread of the coronavirus could reopen as early as Friday.\nThe governor in neighboring Tennessee planned to let businesses in most of his state begin reopening as soon as next week.\nGeorgia’s timetable, one of the most aggressive in the nation, would allow gyms, hair salons, bowling alleys and tattoo parlors to reopen as long as owners follow strict social-distancing and hygiene requirements. Elective medical procedures would also resume. By Monday, movie theaters may resume selling tickets, and restaurants limited to takeout orders could return to limited dine-in service.\nSuch a swift reopening runs counter to the advice of many experts, including Dr. Anthony Fauci, the government’s top authority on infectious diseases, who warned again Monday that resuming business too soon risked a fresh spike in infections.\nRepublican Gov. Brian Kemp said it was important to allow businesses that had been shut down a chance to get some revenue flowing. But he emphasized businesses would still be operating under restrictions including monitoring employee health, enhancing sanitation and separating workers.\n“I think this is the right approach at the right time,” Kemp said. “We’re not just throwing the keys back to these business owners. We’re talking about people (who had) the government shut down their business.”\nBars, live performance venues and amusement parks will remain closed.\nKemp’s order overrides any attempt to impose stricter local decisions, but some local officials including Atlanta Mayor Keisha Lance Bottoms said the governor is moving too quickly.\n“It appears the governor’s order supersedes anything I can do as mayor, but I still have my voice and what I will continue to do is ask Atlantans to please stay at home,” Bottoms told ABC News.\n“Reopen? Dangerously incompetent” is how Stacey Abrams, a Democrat who narrowly lost the 2018 governor’s race to Kemp, characterized the action on Twitter .\nThe governor’s actions line up with the phase one of reopening seen in the guidelines issued last week by President Donald Trump’s administration. Those guidelines call for 14 days of declining COVID-19 cases. Georgia on Monday had recorded six days of declining new infections according to a rolling seven-day average of state Department of Public Health figures. If that continued through Friday, it would be 10 days. Kemp said he delayed the reopening of sit-down service in restaurants and theaters until next Monday in part because, “I also think that gives us more time to continue to flatten the curve.”\nBut new infections and deaths are likely to continue to mount, even if at a reduced rate. The Institute for Health Metrics and Evaluation suggests Georgia shouldn’t loosen social distancing until June 15. Kemp argues he’s still mandating social distancing even as businesses reopen.\nKemp’s action comes a month after he closed many businesses and not quite three weeks after he issued a shelter-at-home order that will remain in place until April 30. Kemp said elderly and medically fragile people should continue to stay at home until May 13. Kemp’s shelter-at-home order followed days of pressure from local officials, and even after he issued the order, there were clashes over keeping open beaches, lakes and state parks. Kemp says keeping those outdoor spaces open has been a success.\nThe governor Monday said a decline in emergency room visits by people with flu-like symptoms indicates that infections are coming down.\n“The bottom line is, social distancing worked,” state Public Health Commissioner Kathleen Toomey told a handful of reporters after Kemp’s news conference. Widespread testing is considered one cornerstone of reopening strategies.\nKemp acknowledged Georgia has lagged when it comes to COVID-19 testing and announced new initiatives to ramp it up. The state had administered more than 84,000 tests though Monday, but its per-capita testing rate is in the bottom 10 of states and lower than neighbors Alabama, Florida and Tennessee.\nHe said the state medical college in Augusta will begin producing thousands of swabs each day for collecting test samples. The school will also offer an online app statewide that would let people with symptoms consult with a clinician and be referred for testing if warranted. Meanwhile, the Georgia National Guard has been deploying teams capable of administering at least 1,500 tests per day to nursing home residents, emergency personnel and others.\nAdjutant General Thomas Carden couldn’t say exactly how much his efforts would push up testing by, saying there could be constraints on how many test kits are available or how many kits labs could process.\n“What I’ve charged General Carden to do is to take every test we got, and use it every single day,” Kemp said. “And when we run out, then we’ll figure out how to get more tests.”\nIn downtown Savannah, Patrick Godley’s restaurant 17 Hundred 90 has been closed for a month. His fine-dining menu doesn’t suit itself to takeout, so he just locked the doors. His cooks, waiters and dishwashers were furloughed, allowing them to draw partial unemployment benefits.\nGodley said Monday he fears it’s too early to reopen for business and that doing so might trigger a new spike in infections.\n“I’d rather stay closed an extra week and wipe this thing out than to open prematurely, have a second wave and have to shut down again,” he said.\nEven if he did reopen next week, Godley said, he doubts he would have many customers.\n“I don’t think people are going to be going out and celebrating a lot right now.”\nTennessee Gov. Bill Lee, also a Republican, said his mandatory safer-at-home order will expire April 30, which will pave the way for 89 of the state’s 95 counties to begin opening businesses.\nLee’s announcement did not apply to counties with the largest cities — areas that are not overseen by Tennessee’s Department of Health but have their own public health districts.\nLee said officials were “working directly with our major metropolitan areas to ensure they are in a position to reopen as soon and safely as possible.”\nSome businesses will be allowed to reopen as early as April 27, but it was unclear exactly which ones. Lee told reporters that details would be finalized later this week.\nGeorgia’s death toll from COVID-19 hit 775 late Monday. Infections have been confirmed in more than 19,000 people.\nFor most people, the coronavirus causes mild or moderate symptoms. For some, it can cause severe illness such as pneumonia or death.\n___\nAssociated Press Writer Russ Bynum in Savannah, Georgia, contributed to this report.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/cbf7decd1893f9d9afa3ed66b0f516d3"}