{"authors": ["Guest Writer"], "date_download": "2020-05-04 20:20:23", "date_modify": "2020-05-04 20:20:23", "date_publish": "2020-04-28 16:30:23", "description": "\"I never thought I’d hear the slur ever again, but unfortunately, I was wrong.\"", "filename": "entry_coronavirus-racial-slur-prejudice_n_5ea320a6c5b6d376358f1491_1588623623.html", "image_url": "https://img.huffingtonpost.com/asset/5ea7010f220000e10b827b87.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_coronavirus-racial-slur-prejudice_n_5ea320a6c5b6d376358f1491_1588623623.html", "title": "I Shouldn't Have To Explain Why 'Chink Virus' Is So Hurtful, But I Will Anyway", "title_page": "I Shouldn't Have To Explain Why 'Chink Virus' Is So Hurtful, But I Will Anyway | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Photo credit: Celeste Huang-Menders The author said the U.S. president has fueled racial fears and given tacit approval for cruelty and prejudice by intentionally calling COVID-19 the “Chinese Virus.”\nLast week, I had to explain to my four children why #ChinkVirus was showing up on Twitter.\nThe last time someone called me a chink to my face was 45 years ago. I was a 7-year-old chubby little kid with thick glasses and a bowl haircut (cut by my Dad) walking in my Queens, New York, neighborhood when two teenage girls whom I’d never met before mockingly sang “Ching chong, chink chong” as they passed me on the sidewalk. I was in second grade and there were two of them — what was I supposed to do? So I did nothing and kept walking home.\nNow, “chink” has made a comeback because of the ignorant association of COVID-19 with Chinese people. “Chink” has been used as a slur against Asians going back to the 1900s, possibly derived from the word “China” or used to describe narrow eyes or perhaps variations of Asian names. Regardless of the origin, it’s used as an insulting and contemptuous term for a person of Chinese birth or descent. I never thought I’d hear the slur ever again, but unfortunately, I was wrong.\nThe president of the United States has fueled racial fears and given tacit approval for cruelty and prejudice by intentionally calling COVID-19 the “Chinese Virus.” This is racist for numerous reasons. If I were trying to be as tolerant and patient as possible, I might try to forgive people who argue that it’s “geographically accurate” regardless of the underlying xenophobia.\nSeven-year-old me had learned that sticks and stones do break bones and that names, in fact, can often hurt us.\nIn 2015, the World Health Organization issued clear guidance on naming new diseases. To make the world a more inclusive and welcoming place for everyone, the WHO stated that disease names should avoid geographic locations (e.g. Middle East respiratory syndrome, Spanish flu, Rift Valley fever), people’s names (e.g. Creutzfeldt-Jakob disease, Chagas’ disease), animal species or foods (e.g. swine flu, bird flu, monkeypox) and cultural, population, industry or occupational references (e.g. legionnaires).\n“Disease names really do matter to the people who are directly affected,” Dr. Keiji Fukuda, the WHO’s former assistant director-general for health security, said at the time. “We’ve seen certain disease names provoke a backlash against members of particular religious or ethnic communities, create unjustified barriers to travel, commerce and trade, and trigger needless slaughtering of food animals. This can have serious consequences for people’s lives and livelihoods.”\nIn the early stages of COVID-19, CNN reported that several news outlets — including CNN itself — initially referred to the new coronavirus as the “Wuhan Virus” but stopped referring to it as such after receiving guidance from medical experts. Learn, adapt, evolve. At least it’s a start.\nBut #ChinkVirus is different. It’s intended to hurt, shame, damn and accuse. Seven-year-old me had learned that sticks and stones do break bones and that names, in fact, can often hurt us.\nRacism exists, I get it. We’re not going to eradicate it completely with ad campaigns, platitudes or even empathetic op-eds. These efforts are grains of sand. But as anyone who has tried to get dressed after going to the beach knows, single grains of sand can linger where you least expect them and can actually make an impact.\nIn mid-March, in an effort to document the wave of coronavirus-related hate crimes and attacks against Asian Americans and Pacific Islanders, the groups Chinese for Affirmative Action and Asian Pacific Planning and Policy Council launched an online reporting center and received about 1,600 reports of discriminatory incidents in the first month alone, adding about 80 new reports each day. The actual number of incidents nationwide is likely higher than what’s been reported on the site.\nThese reports indicate that AAPI women are being attacked at twice the rate of men. As a father of two daughters and a husband to a woman smarter than me, that statistic both scares me and pisses me off.\nMy eldest daughter, Quincy, is finishing the rest of this college year remotely like so many other students. She’s currently on the West Coast, while my wife, our three other children and I are on the East Coast. Knowing that Quincy has to leave the house to buy groceries once in a while, I cringe at the thought that her straight black hair, wide almond eyes or even the last name on her credit card might make her a target. She and I have talked about her taking precautions and maintaining a constant circle of awareness while she’s outside, and it is sickening to me that we have to have these conversations at all.\nMy daughter and I have talked about her taking precautions and maintaining a constant circle of awareness while she's outside, and it is sickening to me that we have to have these conversations at all.\nWith my three teenage children, I explained why some people calling the coronavirus the “Chinese Virus” was racist. I shared my story about 7-year-old me and the slur I was called on the sidewalk. That was the first time I ever said ”chink” out loud to them, and as I did, it felt as though I had just torn away a layer of veneer from their innocence.\nWas I talking about them? Were they ”chinks”? In the eyes of some people today, yes they were. My children wondered why I was so bothered by what some faceless strangers said on the internet. I was bothered because I hadn’t realized people still thought this way, or how empowered some people may now feel to attack them/us/me.\nIn my masculine bluster, I would like to think I could protect myself in an altercation, but by the very nature of bullies, they only attack when they have the upper hand. Like two teenagers would do against a bowl-cut big-eyeglasses boy walking alone.\nSo in hindsight, it was a bad idea for me to search for the hashtags #Chink, #ChinkVirus and other variations on Twitter.\nScrolling through the feeds, I once again experienced the sour, unbalanced feeling of being 7 years old again, unprotected and outnumbered by people who hated me for no good reason. I don’t know if the people unabashedly spewing online hatred are genuinely scared, panicked, ignorant or just angry, but it is stunning and saddening whatever their motivations.\nOne of the hardest yet most important efforts I can try to make today is to extend an olive branch to one of the people who use #ChinkVirus and – acting against my knee-jerk reaction of virtually wanting to punch him in the face – engage in respectful dialogue to say, “We are not monsters, neither are you.”\nWe can’t necessarily control how other people will act, but we certainly can decide how we individually want to conduct ourselves, what to stand up for and whom we choose to support and protect.\nHave a compelling first-person story or experience you want to share? Send your story description to pitch@huffpost.com.", "url": "https://www.huffpost.com/entry/coronavirus-racial-slur-prejudice_n_5ea320a6c5b6d376358f1491"}