{"authors": [], "date_download": "2020-05-04 20:21:58", "date_modify": "2020-05-04 20:21:58", "date_publish": "2020-04-04 19:57:23", "description": "MILWAUKEE (AP) — An update issued Saturday by the Wisconsin Department of Human Services shows an increase of 19 COVID-19 deaths from the previous day's report, raising the total number of deaths...", "filename": "_7c6adc0a6d3de46b79ab2d3826a66334_1588623718.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7c6adc0a6d3de46b79ab2d3826a66334_1588623718.html", "title": "Report: COVID-19 deaths in Wisconsin up 19 from previous day", "title_page": "Report: COVID-19 deaths in Wisconsin up 19 from previous day", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MILWAUKEE (AP) — An update issued Saturday by the Wisconsin Department of Human Services shows an increase of 19 COVID-19 deaths from the previous day’s report, raising the total number of deaths from the virus to 56.\nThe department summary lists a total of 2,112 positive tests for COVID-19, a jump of 196 from Friday. A total of 588 people have been hospitalized.\nThe MIlwaukee County Medical Examiner’s Office reported six new deaths on Saturday, bringing the total number of deaths in the county to 34.\nNearly 24,000 people have tested negative for the virus, according to the human services report. The state’s chief medical officer, Dr. Ryan Westergaard, said Friday that data was showing that the state was “flattening the curve.”\nGov. Tony Evers announced Saturday that the federal government has issued a major disaster declaration for Wisconsin. It provides access to public assistance programs for all 72 Wisconsin counties and the state’s federally recognized tribes.\n“I am grateful for the swift action of the federal government in reviewing our request for a major disaster declaration,” Evers said. “The assistance granted today will help ensure Wisconsin can gain access to critical assistance as we continue our work to respond to this pandemic.”", "url": "https://apnews.com/7c6adc0a6d3de46b79ab2d3826a66334"}