{"authors": ["Will Graves"], "date_download": "2020-05-04 20:21:17", "date_modify": "2020-05-04 20:21:17", "date_publish": "2020-04-15 12:57:41", "description": "MONROEVILLE, Pa. (AP) — The question comes frequently. Usually in the morning, when the day is still brimming with confidence. “Are we going to have a season this year?” my 10-year-old asks,...", "filename": "_f3e61e41f3e133c3b90a0c0674544c81_1588623677.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b2ede99dbe5c464099ae67841084b3e8/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f3e61e41f3e133c3b90a0c0674544c81_1588623677.html", "title": "VIRUS DIARY: For the smallest ballplayers, an unsure spring", "title_page": "VIRUS DIARY: For the smallest ballplayers, an unsure spring", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this April 14, 2020, photo, baseball and softball bags for Colin and Catherine Graves lie untouched in Monroeville, Pa. The spring seasons for both children's youth leagues are on hold and in danger of being canceled due to the COVID-19 pandemic. (AP Photo/Will Graves)\nIn this April 14, 2020, photo, baseball and softball bags for Colin and Catherine Graves lie untouched in Monroeville, Pa. The spring seasons for both children's youth leagues are on hold and in danger of being canceled due to the COVID-19 pandemic. (AP Photo/Will Graves)\nMONROEVILLE, Pa. (AP) — The question comes frequently. Usually in the morning, when the day is still brimming with confidence.\n“Are we going to have a season this year?” my 10-year-old asks, sometimes with a glove on his left hand and a baseball in his right.\nMy answer for the last month has always been the same: Maybe. I’m not exactly lying (though it is starting to feel like it) as the weeks pass and my confidence wanes that our suburb east of Pittsburgh will somehow emerge from the coronavirus quarantine in time to get one in.\nThe fridge calendar is the center of my family’s life. This time of year, it’s typically a sea of scribbles and the occasional color-coded marker highlighting work schedules and the seemingly never-ending stream of practices, games, church and school functions and Girl Scout meetings.\nThe page for April 2020 is largely empty. That doesn’t stop me from glancing at it a dozen of times a day.\nDuring the first couple weeks of the quarantine, I checked it mostly out of habit. Now, each time I slash out a date, it doubles as a milepost on an interminable countdown. I wonder how much longer the local youth baseball and softball leagues our kids play in can hold out before raising the white flag to the pandemic.\nIn the big picture, sacrificing a few months of activity to help slow the spread is not asking for much. The smaller picture — the one my wife and I navigate daily — is trickier.\nIn southwestern Pennsylvania, the start of baseball and softball practice offers concrete proof that spring is finally here. The familiar rhythms of long nights at the fields — from our daughter smearing her face with pink eye-black from chin to cheek to our introverted son briefly emerging from his shell in the dugout — are comforting and all too fleeting. The fragility of this moment in their lives is impossible to shake.\nHow many times are they going to be 10 and 8? Just once. How many spring and summers before their interests diverge? Not many. How many games of catch left with Mom and Dad? Fewer by the day. Selfishly, how much longer do I have to teach my son and his buddies pitching mechanics before I’m relegated to watching from the stands? I try not to think about it.\nFull Coverage: Virus Diary\nThough my son spent 20 minutes the other day breaking down every baseball team he’s ever played on, I’m acutely aware these years will end up as mostly hazy memories for him and his sister. But for my wife and I, they are vivid. They are joyful. The fear of missing out on an entire season is palpable.\nOur kids — thankfully — get along. Being stuck at home has forced them to play together in ways they haven’t before. That includes an impromptu backyard game the other day, one that ended with little sister getting big brother to swing and miss at a little high cheese .\nHer glee was infectious, the grin on his face unmistakable. And for a minute I forgot that on a normal Wednesday in April, our time together would be relegated to the groggy morning routines and the nightly homework-practice-dinner-bedtime sprint.\nThat doesn’t mean I can’t wait for the day when my son bounds into the dining room to ask me if there’s going to be a season and my response is an emphatic “yes.” Maybe it will happen sometime this month. Maybe not. The reality is, it’s out of our hands.\nUntil then, I keep reminding myself that the timeline doesn’t matter. The beauty of the game is that when we are ready, it will be there. It always is.\n___\n“Virus Diary,” an occasional feature, will showcase the coronavirus saga through the eyes of Associated Press journalists around the world. See previous entries here . Will Graves covers Pittsburgh sports for The Associated Press. Follow him on Twitter here .", "url": "https://apnews.com/f3e61e41f3e133c3b90a0c0674544c81"}