{"authors": ["James Macpherson"], "date_download": "2020-05-04 20:18:35", "date_modify": "2020-05-04 20:18:35", "date_publish": "2020-04-08 16:22:00", "description": "BISMARCK, N.D. (AP) — North Dakota Gov. Doug Burgum on Wednesday defended his decision to not issue a statewide stay-at-home order, saying the state’s targeted approach is working to slow the...", "filename": "_d2c7a058e246b25dd67bb25ea3cd9016_1588623515.html", "image_url": "https://storage.googleapis.com/afs-prod/media/dffb1549dc754a44b2da9bb8bc1f33c0/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d2c7a058e246b25dd67bb25ea3cd9016_1588623515.html", "title": "Gov. Burgum defends decision for no stay-at-home order", "title_page": "Gov. Burgum defends decision for no stay-at-home order ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "North Dakota Gov. Doug Burgum looks at a monitor displaying the positive rate of testing in each county in the state during his daily briefing on the coronavirus outbreak, Wednesday, April 8, 2020 at the state Capitol in Bismarck, N.D.. In the background is sign language interpreter Lindsey Solberg Herbel. (Mike McCleary/The Bismarck Tribune via AP)\nNorth Dakota Gov. Doug Burgum looks at a monitor displaying the positive rate of testing in each county in the state during his daily briefing on the coronavirus outbreak, Wednesday, April 8, 2020 at the state Capitol in Bismarck, N.D.. In the background is sign language interpreter Lindsey Solberg Herbel. (Mike McCleary/The Bismarck Tribune via AP)\nBISMARCK, N.D. (AP) — North Dakota Gov. Doug Burgum on Wednesday defended his decision to not issue a statewide stay-at-home order, saying the state’s targeted approach is working to slow the spread of the coronavirus.\nThe state’s “targeted action, smart action is slowing the spread and flattening the curve and saving lives,” Burgum said during his daily press conference at the state Capitol in Bismarck.\nThe number of North Dakota COVID-19 cases increased by 14 to a total statewide of 251 on Wednesday. No additional deaths were reported. Four people in North Dakota have died of the disease caused by the coronavirus.\nHealth officials said 16 people were hospitalized Wednesday, two fewer than on Tuesday. Ninety-eight people have recovered after testing positive, health officials said.\nThe first-term Republican governor said less than 1% of the state’s 2,600 available hospital beds are being used due to the coronavirus.\nBurgum has shut down schools, bars, restaurants, health clubs, movie theaters and beauty salons. But North Dakota is among only a handful of states where no one is under a mandated stay-at-home order.\nSimilar restrictions Burgum has ordered had commonly been in place in states that have issued stay-at-home orders.\nBurgum said restrictions he has imposed, including requiring anyone who tests positive for COVID-19 to self-isolate for no less than 14 days, are “functionally equivalent and totally compatible” to state’s that have issued stay-at-home orders.\n“This isn’t as much about what government says, it’s more about what individuals do,” Burgum said.\nBurgum on Wednesday amended a self-quarantine order that allows people seeking health care or supplies and services to move more freely across the state’s border.\nThe original order required people to self-quarantine for 14 days after returning from some three dozen states including neighboring Minnesota that have widespread outbreaks. The order does not include people who work in essential jobs such health care, energy, agriculture and the service industry.\nBurgum called it a “common sense order for how we want to manage this with travel.”", "url": "https://apnews.com/d2c7a058e246b25dd67bb25ea3cd9016"}