{"authors": ["Eric Tucker", "Matthew Daly", "Mary Clare Jalonick"], "date_download": "2020-05-04 20:03:49", "date_modify": "2020-05-04 20:03:49", "date_publish": "2020-04-07 21:06:14", "description": "WASHINGTON (AP) — President Donald Trump is moving aggressively to challenge the authority and independence of agency watchdogs overseeing his administration, including removing the inspector...", "filename": "_b66fe3c530a6be1a78082e948336f8a7_1588622629.html", "image_url": "https://storage.googleapis.com/afs-prod/media/3283da451ee74bc3ab90c450f2c1d5d5/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b66fe3c530a6be1a78082e948336f8a7_1588622629.html", "title": "Trump upends virus oversight, removing key official", "title_page": "Trump upends virus oversight, removing key official", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Donald Trump listens during a conference call with banks on efforts to help small businesses during the coronavirus pandemic, at the White House, Tuesday, April 7, 2020, in Washington. (AP Photo/Evan Vucci)\nPresident Donald Trump listens during a conference call with banks on efforts to help small businesses during the coronavirus pandemic, at the White House, Tuesday, April 7, 2020, in Washington. (AP Photo/Evan Vucci)\nWASHINGTON (AP) — President Donald Trump is moving aggressively to challenge the authority and independence of agency watchdogs overseeing his administration, including removing the inspector general tasked with overseeing the $2.2 trillion coronavirus rescue package that passed Congress with bipartisan support.\nIn four days, Trump has fired one inspector general tied to his impeachment, castigated another he felt was overly critical of the coronavirus response and sidelined a third meant to safeguard against wasteful spending of the coronavirus funds.\nThe actions have sent shock waves across the close-knit network of watchdog officials in government, creating open conflict between a president reflexively resistant to outside criticism and an oversight community tasked with rooting out fraud, misconduct and abuse.\nThe most recent act threatens to upend scrutiny of the $2.2 trillion coronavirus rescue effort now underway, setting the stage for a major clash between Trump, government watchdogs and Democrats who are demanding oversight of the vast funds being pumped into the American economy.\n“We’re seeing since Friday a wrecking ball across the IG community,” said Danielle Brian, executive director of the Project on Government Oversight, a government watchdog group.\nThe latest broadside came Tuesday when the Defense Department revealed that Trump had removed acting inspector general Glenn Fine, an experienced official, from his role as head of a coronavirus spending oversight board. It was unclear who might replace Fine, who also lost his title as acting inspector general.\nHouse Speaker Nancy Pelosi called Fine’s abrupt removal “part of a disturbing pattern of retaliation by the president against independent overseers.” Trump, she said, is attempting to “disregard critical oversight provisions that hold the administration accountable to the law.”\nTrump himself shed little light on the decision as he spoke to reporters Tuesday evening, saying he doesn’t know Fine, but had “heard the name.”\nA day earlier, Trump had asserted without evidence that an inspector general report warning of shortages of coronavirus testing in hospitals was “just wrong” and skewed by political bias. The report surveyed more than 300 U.S. hospitals.\n“Did I hear the word inspector general? Really?” Trump said when pressed about the Health and Human Services watchdog report .\n“Give me the name of the inspector general,” Trump demanded, before asking, “Could politics be entered into that?” The acting Health and Human Services inspector general, Christi A. Grimm, is a career employee who took over the position early this year in an interim capacity.\nMost dramatic of all was Friday’s late-night firing of Michael Atkinson, the intelligence community inspector general who drew Trump’s disdain for notifying Congress of an anonymous whistleblower complaint on Ukraine. The complaint led to the president’s impeachment.\nTrump defended the firing by complaining that Atkinson had never spoken with him about the complaint, even though Atkinson’s job is to provide oversight independent of the White House.\nThe dismissal prompted a sharply worded statement from Justice Department watchdog Michael Horowitz, who chairs a council of agency inspectors general and who last month had announced Fine’s appointment to the pandemic oversight board.\nDiverging from Trump’s condemnation of Atkinson as “terrible,” Horowitz called Atkinson’s handling of the whistleblower complaint an example of “integrity, professionalism, and commitment to the rule of law.”\nAnd he pointedly noted that the inspector general community will continue to do its job, including oversight of the more than $2 trillion in coronavirus aid.\nThe role of the modern-day inspector general dates to post-Watergate Washington, when Congress installed offices inside agencies as an independent check against mismanagement and abuse of power. Though inspectors general are presidential appointees, some, like Horowitz, serve presidents of both parties. All are expected to be nonpartisan.\nOver the years, inspectors general have exposed grave problems through their investigations and humbled, or even embarrassed, agency leaders and presidential administrations.\nMonday’s Health and Human Services report that angered the president chronicled long waits for coronavirus test results and supply shortages at hospitals across the country.\nHorowitz, meanwhile has identified significant flaws in the FBI’s surveillance during the Russia investigation. Trump has praised Horowitz’s findings even as he’s attacked his credibility for not finding evidence of political bias in the Russia probe, pejoratively describing him last December as an Obama appointee.\nFormer Justice Department inspector general Michael Bromwich said Trump perceives inspector general offices to have a “uniquely threatening function within the executive branch, which is to provide independent oversight of governmental functions.”\n“It’s just something that doesn’t compute for him,” Bromwich added. “He understands the value of loyalty. He doesn’t understand the value of independence because that can conflict with loyalty.”\nEven before this week, Democrats and good-government advocates feared that Trump was using the coronavirus rescue package to reward loyalty. He generated consternation by selecting Brian Miller, who works in the White House counsel’s office, to a new Treasury Department position overseeing $500 billion in coronavirus aid to industry.\nMiller has worked at the Justice Department and was inspector general for nearly a decade at the General Services Administration, which oversees thousands of federal contracts. Though he is respected in the oversight community, Miller’s role in the White House counsel’s office is troubling, watchdog groups said.\nDemocratic lawmakers had already questioned whether someone who worked for the president could be independent, concerns that were accelerated by Fine’s replacement.\n“The president now has engaged in a series of actions designed to neuter any kind of oversight of his actions and that of the administration during a time of national crisis, when trillions of dollars are being allocated to help the American people,” Rep. Adam Schiff, D-Calif., told The Associated Press.\nBut Trump has made clear his willingness to flout that system, perhaps foreshadowing the chaos of the last week.\nAs lawmakers were in the final stages of drafting what became the $2.2 trillion coronavirus rescue package, he declared, “I’ll be the oversight.” And even when he signed it, he attached a statement that says some of the oversight provisions in the law “raise constitutional concerns” and may not be followed.\n___\nAssociated Press writer Laurie Kellman contributed to this report.", "url": "https://apnews.com/b66fe3c530a6be1a78082e948336f8a7"}