{"authors": ["Russ Bynum"], "date_download": "2020-05-04 20:21:52", "date_modify": "2020-05-04 20:21:52", "date_publish": "2020-04-15 18:16:51", "description": "SAVANNAH, Ga. (AP) — Georgia's public health agency said Wednesday it's broadening its definition of who's eligible for coronavirus testing in the state, where the new virus has killed more than...", "filename": "_de76f1297e49943b5b7192824c1a16b8_1588623712.html", "image_url": "https://storage.googleapis.com/afs-prod/media/3ea7866aabbf44f7b0dd8340c78a9147/2738.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_de76f1297e49943b5b7192824c1a16b8_1588623712.html", "title": "Georgia expanding coronavirus testing as deaths pass 570", "title_page": "Georgia expanding coronavirus testing as deaths pass 570", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SAVANNAH, Ga. (AP) — Georgia’s public health agency said Wednesday it’s broadening its definition of who’s eligible for coronavirus testing in the state, where the new virus has killed more than 570 people and confirmed infections have exceeded 15,000.\nAnyone showing symptoms of COVID-19 such as cough, fever or shortness of breath is now considered a candidate for testing at one of the state’s drive-thru sites as long as those patients first get a referral, the Georgia Department of Public Health said. The state previously reserved most testing for high-risk populations, such as the elderly and medical workers, and required referrals from private physicians. People now can also get referrals from local health departments.\nPriority for testing will still go to health care workers, first responders and law enforcement officers as well as residents and staff of nursing homes and other long-term care facilities, whether they have symptoms or not, the department said in a news release.\nThe agency said it’s also expanding the number of sample-collection sites for testing. One new site expected to open Thursday will raise the total to 36 statewide, with more expected within the next week, said Nancy Nydam, spokeswoman for the Department of Public Health.\nNydam said the agency now has about 5,000 test kits in hand and has ramped up its ability to process them.\n“As much as anything that affected testing was actually having the kits to collect specimens and the capacity to process those tests,” Nydam said by email. “We are in a much better place now on both counts.”\nGov. Brian Kemp and the state health agency’s commissioner, Dr. Kathleen Toomey, have both openly expressed frustration at the limited availability of testing in Georgia. As of Wednesday, just over 4,000 tests for the disease had been processed by state labs, compared with nearly 60,000 Georgia tests handled by commercial labs.\nWithout more widespread testing, it’s impossible for health officials to accurately track the spread of the virus.\nMeanwhile, the coronavirus’s toll in Georgia continued to grow. As of Wednesday afternoon, state officials reported at least 576 people have died and more than 15,200 infections have been confirmed statewide. Nearly 20% of people testing positive for the virus have been hospitalized.\nThe highest rates of infection have been clustered in mostly rural southwest Georgia, where 84 people have died in Dougherty County — the highest toll of any county in the state.\nMayor Bo Dorough of Albany, Dougherty County’s largest city, urged residents Wednesday to remain vigilant not just about sheltering at home and maintaining distance from others to slow the spread of the virus, but also to take care with their finances as unemployment soars.\n“In retrospect, I believe most leaders in our country would now concede that greater precautions should have been taken earlier,” Dorough told a news conference Wednesday. “We now realize that, contrary to being an obstacle to the economy, these greater precautions would have been the best investment our country could have made.”\nFor most people, the new coronavirus causes mild or moderate symptoms that usually clear up within weeks. For some, especially older adults and those with existing health problems, it can cause severe illness and be life-threatening.\nThe Georgia Republican Party canceled its congressional district conventions that had been scheduled for Saturday, as well as its statewide convention in late May. State GOP Chairman David Shafer said the state executive committee voted to cancel the meetings Monday and unanimously approved emergency rules.\nThe conventions were supposed to elect delegates to the Republican National Convention in Charlotte, North Carolina, in August. Instead, the state party’s executive committee will elect delegates to the national convention that would normally have been chosen at the state convention. Other delegates will be elected by congressional district committees, likely by telephone.\n___\nAssociated Press writer Jeff Amy in Atlanta contributed to this report.\n___\nFollow AP coverage of the pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/de76f1297e49943b5b7192824c1a16b8"}