{"authors": ["Caroline Kelly", "Jeremy Herb"], "date_download": "2020-05-04 16:21:58", "date_modify": "2020-05-04 16:21:58", "date_publish": "2020-04-06 02:31:22", "description": "The former intelligence community inspector general, who informed Congress of the whistleblower complaint that led to President Donald Trump's impeachment, said Sunday that he believes Trump fired him for doing his job.", "filename": "2020_04_05_politics_atkinso_513b84dd540ba372e6ab945ff81a1320_index_1588609318.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406082253-01-donald-trump-michael-atkinson-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_atkinso_513b84dd540ba372e6ab945ff81a1320_index_1588609318.html", "title": "Former intelligence community watchdog addresses recent firing", "title_page": "Michael Atkinson: Former intelligence community watchdog addresses recent firing - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The former intelligence community inspector general, who informed Congress of the whistleblower complaint that led to President Donald Trump's impeachment, said Sunday that he believes Trump fired him for doing his job.\nMichael Atkinson said in a statement that he was \"disappointed and saddened\" by Trump's decision to oust him on Friday, with the President stating that Atkinson did not have his \"fullest confidence.\"\n\"It is hard not to think that the President's loss of confidence in me derives from my having faithfully discharged my legal obligations as an independent and impartial Inspector General, and from my commitment to continue to do so,\" Atkinson wrote.\nAtkinson is the latest in a line of officials involved in the impeachment that Trump has removed following the conclusion of the trial in February. Lt. Col. Alexander Vindman was reassigned from the National Security Council, and former US Ambassador to the European Union Gordon Sondland was fired following their witness testimony siding against the President.\nAtkinson's firing also comes as Trump has faced widespread criticism for the federal government's response to the ongoing coronavirus outbreak, and has said the impeachment trial \"probably did\" distract him from responding to the virus' outbreak during the trial in January and early February.\nRead More", "url": "https://www.cnn.com/2020/04/05/politics/atkinson-intelligence-community-watchdog-firing/index.html"}