{"authors": [], "date_download": "2020-05-04 20:27:39", "date_modify": "2020-05-04 20:27:39", "date_publish": "2020-04-05 21:08:39", "description": "LEXINGTON, Ky. (AP) — Kentucky point guard Ashton Hagans will enter the NBA draft and forego his final two seasons of eligibility. He said Sunday the “time is now” to pursue his dream of...", "filename": "_c9b5ccc7624cc7ffe1a33927157429ab_1588624059.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f5a9fefd9c4b40a49722107e1fbb48f1/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c9b5ccc7624cc7ffe1a33927157429ab_1588624059.html", "title": "Kentucky point guard Ashton Hagans will enter NBA draft", "title_page": "Kentucky point guard Ashton Hagans will enter NBA draft", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "1 of 2 Kentucky's Ashton Hagans takes an uncontested shot during the second half of the team's NCAA college basketball game against Tennessee, Tuesday, March 3, 2020, in Lexington, Ky. Tennessee won 81-73. (AP Photo/James Crisp)\n1 of 2 Kentucky's Ashton Hagans takes an uncontested shot during the second half of the team's NCAA college basketball game against Tennessee, Tuesday, March 3, 2020, in Lexington, Ky. Tennessee won 81-73. (AP Photo/James Crisp)\nLEXINGTON, Ky. (AP) — Kentucky point guard Ashton Hagans will enter the NBA draft and forego his final two seasons of eligibility.\nHe said Sunday the “time is now” to pursue his dream of playing professionally.\nThe 6-foot-3 Hagans was named Southeastern Conference Defensive Player of the Year as a freshman and became one of the country’s best point guards this past season. However, his time at Kentucky ended in controversy as he argued with forward Nick Richards and coach John Calipari and reportedly refused to re-enter in the second half of a home loss to Tennessee. Calipari downplayed the incident afterward.\nHagans then requested time away from the team for personal reasons and did not travel to the season finale at Florida. He was expected to return for the Wildcats at the SEC Tournament in Nashville, but that event and the NCAA Tournament were canceled last month because of the coronavirus pandemic.\nHagans said in a statement Sunday he was disappointed not to be able to pursue a national title but added that he understands why.\n“It’s time for me to live out my lifelong dream and declare for the NBA draft,” Hagans said. “It’s been my No. 1 goal since I first picked up a ball to take this step and I know my time is now.”\nHe also thanked coaches, teammates and fans and added, “the last two years have been some of the best of my life.”\nHagans was born and raised in Georgia. He had 351 assists at Kentucky — ranking 12th in school history — and 119 steals. He averaged 11.5 points, 6.4 assists, 3.9 rebounds and 1.9 steals last season.\n___\nMore AP college basketball: https://apnews.com/Collegebasketball and https://twitter.com/AP_Top25", "url": "https://apnews.com/c9b5ccc7624cc7ffe1a33927157429ab"}