{"authors": ["Josh Campbell"], "date_download": "2020-05-04 16:05:13", "date_modify": "2020-05-04 16:05:13", "date_publish": "2020-04-02 04:54:52", "description": "The FBI reported a 41% surge in background checks by individuals attempting to purchase firearms in the United States last month, according to newly released data from the agency, a significant increase over the same period last year.", "filename": "2020_04_02_us_fbi-gun-sale-background-checks-coronavirus_index_1588608313.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402004756-gun-sales-0315-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_us_fbi-gun-sale-background-checks-coronavirus_index_1588608313.html", "title": "FBI sees spike in gun sale background checks amid coronavirus pandemic", "title_page": "FBI sees spike in gun sale background checks amid coronavirus pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The FBI reported a 41% surge in background checks by individuals attempting to purchase firearms in the United States last month, according to newly released data from the agency, a significant increase over the same period last year.\nThe new figures indicate 3.7 million gun purchase background checks were conducted in the month of March alone, marking the greatest number of background checks conducted in a single month since the FBI's National Instant Criminal Background Check System (NICS) was launched in 1998.\nBy far, the state leading in federal firearm background checks numbers for the month of March was Illinois -- with over half a million background checks conducted -- followed by Texas, Kentucky, Florida, and California.\nUnder US law, federally licensed gun dealers must run checks on every buyer, whether a purchase is made in a store or at a gun show. A buyer presents his or her identification to the seller and fills out a form from the US Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF), which lists the buyer's age, address, race, and any criminal history. The seller then submits the information to the FBI and the agency checks the applicant's info against databases in order to ensure a criminal record does not preclude the purchase.\nThe dramatic rise in attempted firearm purchases in the US comes as the nation grapples with the spread of the deadly coronavirus. In mid-March, President Donald Trump announced sweeping new guidelines, including a recommendation that Americans stay home and avoid public gatherings and discretionary travel.\nAs new stay-at-home orders have been issued by states and municipalities across the country, experts have indicated a byproduct of these measures aimed at stopping the spread of the virus can include fear and anxiety.\n\"We often see seasonal spikes in firearm sales, but, in addition, it is not uncommon to see increased gun sales based on political or social events and attitudes,\" said ATF spokesperson Cara Herman. \"Background checks and other regulatory safeguards are in place to ensure that only those eligible under federal law can obtain and possess firearms.\"\nFBI statistics show the number of background checks it conducts nationwide has steadily increased since the system began over two decades ago. Gun purchases have also historically jumped following incidents of national tragedy -- an occurrence some experts attribute to the need to feel safe.\n\"The rise in gun and ammunition sales during this crisis is understandable as the fear of the unknown can drive purchasing far off their norms,\" said Jonathan Wackrow, CNN Law Enforcement Analyst and former special agent with the US Secret Service. \"Research has shown that during a crisis, if individuals let fear, anxiety, and confusion spread, they will most likely begin to feel helpless. For many, the purchase of a weapon resolves that sense of helplessness.\"\nA spokesperson for the National Rifle Association, one of the nation's largest gun-rights organizations, suggested that concerns about personal safety during the coronavirus pandemic are likely key drivers in the surge of FBI background checks.\n\"Firearm sales go up in times of uncertainty because Americans know their safety is ultimately in their own hands,\" said NRA spokesperson Amy Hunter. \"Headlines remind us about prisoners being furloughed, first responders being told to selectively enforce laws or being minutes away when seconds count. Now, more than ever, it's important that families have the ability and the tools they need to feel safe and able to defend themselves.\"\nBy contrast, advocacy groups in favor of stricter gun control are sounding the alarm over increased gun sales during what many view as a time of unprecedented national fear and anxiety.\n\"Adding more guns into the mix during a deadly pandemic won't make anyone safer, but it will make the gun lobby richer,\" said Shannon Watts, founder of Moms Demand Action. \"This spike in gun sales is deeply concerning, particularly for the millions of children unexpectedly at home with unsecured guns, women sheltering in place with abusers, and anyone struggling economically and psychologically.\"\nThe issues raised by Watts were echoed by others formerly in law enforcement, who view the surge in firearms as an unnecessary addition to an already volatile situation.\n\"My biggest concern involves the potential number of first time gun buyers who, before March, did not think they needed a gun,\" said David Chipman, a retired ATF special agent and senior policy adviser to the Giffords organization countering gun violence. \"Now in a moment of panic they are rushing to a store and buying a lethal weapon they don't know how to use and don't know how to store safely. Unfortunately, thousands of Americans have placed their families in jeopardy at a time when they simply want to be safe.\"", "url": "https://www.cnn.com/2020/04/02/us/fbi-gun-sale-background-checks-coronavirus/index.html"}