{"authors": ["Joan Biskupic", "Cnn Legal Analyst", "Supreme Court Biographer"], "date_download": "2020-05-04 16:27:50", "date_modify": "2020-05-04 16:27:50", "date_publish": "2020-04-07 16:59:00", "description": "The Supreme Court's 5-4 decision refusing to extend a deadline for absentee ballots in Tuesday's Wisconsin elections reflects Chief Justice John Roberts' cramped view of voting rights in America, a long-held position that has often favored Republican interests.", "filename": "2020_04_07_politics_voting-_bfa85497c63213390aea4c5a64bd2a28_index_1588609670.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200122012658-john-roberts-january-22-2020-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_voting-_bfa85497c63213390aea4c5a64bd2a28_index_1588609670.html", "title": "John Roberts' unwavering, limited view of voting access seen in Wisconsin ruling", "title_page": "John Roberts' unwavering, limited view of voting access seen in Wisconsin ruling - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The Supreme Court's 5-4 decision refusing to extend a deadline for absentee ballots in Tuesday's Wisconsin elections reflects Chief Justice John Roberts' cramped view of voting rights in America, a long-held position that has often favored Republican interests.\nThe pattern, joined by Roberts' fellow conservatives, was epitomized by a 2013 decision that restricted a crucial part of the Voting Rights Act and has allowed states to eliminate polling places, limit voting times and adopt other practices that make it harder for people, especially racial minorities, the poor and elderly, to cast ballots.\nThe chief justice, a 2005 appointee of President George W. Bush, has sometimes broken with his conservative brethren, most prominently in the 2012 Affordable Care Act case. But when it comes to politically charged electoral issues such as voting rights, campaign finance and gerrymandering, Roberts does not waver.\nRuling in the case brought by the Republican National Committee, the high court Monday night reversed lower court orders allowing an extension for absentee voting by six days. The majority dismissed concerns about Wisconsin residents going to the polls in the middle of the coronavirus crisis\nThe justices' 5-4 partisan lineup, reinforcing the contraction of voting rights, belies Roberts' regular assertion that the justices operate in a realm beyond politics.\nIt also suggested that for upcoming cases in the middle of the Covid-19 pandemic, the high court majority would be reluctant to accommodate voters who cannot meet usual state electoral requirements. In Wisconsin, a backlog of absentee ballot requests was pending, and it appeared thousands of voters would not even have ballots in hand to return with a Tuesday postmark.\n\"The Court's order, I fear, will result in massive disenfranchisement,\" Justice Ruth Bader Ginsburg wrote for liberal dissenters Monday night, adding that tens of thousands of residents would have to choose between braving the polls or losing the right to vote.\n\"That is a matter of utmost importance -- to the constitutional rights of Wisconsin's citizens, the integrity of the State's election process, and in this most extraordinary time, the health of the Nation,\" Ginsburg added.\nTo be sure, the justices in the majority -- none of whom signed the opinion -- asserted they were ruling on a \"narrow, technical question\" and stressed that they were adhering to precedent that generally forbids lower federal court judges from altering election rules close to an election.\nBut the court's fivesome on the right, in fact, itself changed the state of play with its decision on the eve of Wisconsin voting.\nThe pattern\nRoberts' constricted view on voting rights traces to his 1980s service in the Reagan administration. As a young lawyer he advocated for narrow interpretations of the milestone Voting Right Act passed by Congress in 1965, soon after the Bloody Sunday march in Selma, Alabama.\nBack in the 1980s, and in contemporary times as he leads the nation's high court, Roberts has argued that the VRA encroaches on state and local authority, that officials on the ground should regulate their election practices.\nAs chief justice, one of his defining opinions has been 2013's Shelby County v. Holder , which eviscerated a provision of the Voting Rights Act requiring states with a history of racial bias to clear any new electoral requirements with the US Department of Justice or a federal court.\nThe provision had covered mainly Southern locales. \"Our country has changed,\" Roberts wrote in the 2013 ruling, declaring that no longer could localities be divided between those that practiced discrimination, causing low voter registration and turnout, and those that did not.\nRoberts built on a 2009 ruling he had penned that pointedly asserted, \"Things have changed in the South. Voter turnout and registration rates now approach parity. Blatantly discriminatory evasions of federal decrees are rare.\"\nGinsburg, writing for the dissent in 2013, as she did Monday, acknowledged that conditions had changed from the 1960s but argued that the \"preclearance\" requirement had helped bring about that change. \"Throwing out preclearance when it has worked and is continuing to work to stop discriminatory changes,\" she wrote, \"is like throwing away your umbrella in a rainstorm because you are not getting wet.\"\nThat Ginsburg dissent inspired the \"Notorious RBG\" meme, a brainchild of a New York University law student, that today throughout social media and in all manner of RBG celebratory paraphernalia.\nStudies by advocacy groups, such as the Leadership Conference on Civil Rights and the Lawyers' Committee for Civil Rights Under Law, have documented the consequences of the Shelby County decision. Formerly covered localities, for example in Texas, Georgia and North Carolina, have imposed stricter voter identification laws, shortened voting days and reshaped voting districts in ways that arguably impose new barriers.\nExtending its pattern, the Supreme Court in 2018 rejected voting-rights challenges in Ohio and Texas. Again, the five-justice conservative majority emphasized states' authority to set their own rules, and liberal dissenters invoked a history of racial discrimination that need still be checked.\nIn the first case, the justices upheld an Ohio practice for purging citizens who had not recently voted from the rolls. The Ohio policy, triggered by the failure to vote for two years, also involved a mailed postcard to which voters could respond and provide an Ohio address. Liberal dissenters said that was not sufficient to drop voters from the rolls and raised the specter of poll taxes, literacy tests and other decades-old practices that had been used to keep blacks and Latinos from voting.\nThe Texas case centered on legislative districts that a lower court had said denied Latinos an equal opportunity to elect candidates of their choice. The five-justice Supreme Court majority concluded that the challengers failed to show that the Texas legislature had acted in bad faith or intentionally discriminated.\nAs occurred in Monday's Wisconsin case, the dissenters in 2018 homed in on fundamentals of the franchise. Justice Sonia Sotomayor, the court's only Latino, wrote, \"Our democracy rests on the ability of all individuals, regardless of race, income, or status, to exercise their right to vote.\"\nJUST WATCHED Americans battle to cope with life's challenges amid virus Replay More Videos ... MUST WATCH Americans battle to cope with life's challenges amid virus 03:27\nConservative allies\nDuring his 15-year tenure as chief justice, Roberts has always had four fellow conservatives for his voting-rights views. In his early years, Justices Antonin Scalia and Anthony Kennedy were with him in the majority. They were succeeded by Neil Gorsuch, in 2017, and Brett Kavanaugh, in 2018. The other two conservatives who round out the bloc are Clarence Thomas and Samuel Alito. All are Republican appointees.\nOn the left, joining Ginsburg, have consistently been Justices Stephen Breyer, Elena Kagan and Sotomayor, all Democratic appointees.\nAlong with the racial valance in these cases rests the inherently political overlay. As seen in the Wisconsin dispute, it has been largely GOP officials seeking relief from the Supreme Court.\nRoberts has long spurned any political connection, repeatedly asserting, \"We don't work as Democrats or Republicans.\" He stresses the independence of the judiciary. When President Donald Trump scorned a judge who had ruled against his administration in 2018 for being an \"Obama judge,\" Roberts issued a statement.\n\"We do not have Obama judges or Trump judges, Bush judges or Clinton judges,\" Roberts said. \"What we have is an extraordinary group of dedicated judges doing their level best to do equal right to those appearing before them.\"\nThe Wisconsin case concluded with a similar protestation that the high court was only minimally involving itself in the case brought by the Republican National Committee and Wisconsin state Republicans.", "url": "https://www.cnn.com/2020/04/07/politics/voting-wisconsin-supreme-court-john-roberts/index.html"}