{"authors": [], "date_download": "2020-05-04 20:04:09", "date_modify": "2020-05-04 20:04:09", "date_publish": "2020-04-07 21:45:31", "description": "SEATTLE (AP) — The Seattle City Council has again decided to consider a tax on large businesses, this time while contending with fallout from the coronavirus. The council voted unanimously...", "filename": "_4cf5d717fbbdd4f8733832183d49951a_1588622649.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4cf5d717fbbdd4f8733832183d49951a_1588622649.html", "title": "Seattle City Council sends big business tax bid to committee", "title_page": "Seattle City Council sends big business tax bid to committee", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SEATTLE (AP) — The Seattle City Council has again decided to consider a tax on large businesses, this time while contending with fallout from the coronavirus.\nThe council voted unanimously Monday to review legislation proposed by Councilwomen Kshama Sawant and Tammy Morales that would impose a 1.3% payroll tax on most companies with over $7 million in annual payroll, excluding grocery businesses and some other entities.\nSince last year’s council elections, Sawant, Mayor Jenny Durkan and other members of the council have been looking at a tax on large corporations, The Seattle Times reported .\nSawant and Morales have said their proposed tax could raise as much as $500 million a year. They have called for Seattle to spend $200 million this year on coronavirus relief payments to vulnerable families and for the tax to subsequently pay for rent-controlled housing and Green New Deal programs.\nUnder their plan, the tax would take effect in June, but it wouldn’t be collected until 2022. To provide relief payments this year, the city would borrow $200 million from funds including its Low Income Housing Fund and Housing Incentive Fund.\n“We’re staring down the barrel of an unprecedented emergency,” Morales said, arguing the plan could provide short-term relief and make the city’s tax system more equitable in the long term.\nCouncilman Alex Pedersen said he’s concerned “about introducing a new tax at a time that we’re going through this pandemic … going into a recession.”\nThe council says the tax likely could apply to about 800 companies across various industries, but Sawant has referred to her proposal with Morales as an “Amazon tax,” singling out the tech giant.\nThe council sent the measure to its budget committee, which includes all nine council members. Committee Chairwoman Teresa Mosqueda has said she believes Seattle should pursue new, progressive sources of revenue. In 2018, when the council passed and then almost immediately repealed a per-employee “head tax” on big businesses, only Sawant and Mosqueda voted against the repeal.\nCouncil President M. Lorena González said Seattle is projected to have a deficit of at least $200 million this year because the coronavirus has stunted business activity that generates revenue for the city.\nLeaders of some organizations such as the Downtown Seattle Association oppose the tax.\nBoosters of the tax, including Sawant, have launched a campaign to put an initiative on the November ballot in case the council declines to act.", "url": "https://apnews.com/4cf5d717fbbdd4f8733832183d49951a"}