{"authors": ["Sandee Lamotte"], "date_download": "2020-05-04 15:57:51", "date_modify": "2020-05-04 15:57:51", "date_publish": "2020-04-07 23:26:53", "description": "A new study maps long-term air pollution levels with death rates from Covid-19 and finds those of us who live in highly polluted areas are more likely to die from the disease.", "filename": "2020_04_07_health_covid-19-air-pollution-risks-wellness_index_1588607871.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407095829-02-los-angeles-smog-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_health_covid-19-air-pollution-risks-wellness_index_1588607871.html", "title": "Covid-19 death rate rises in counties with high air pollution, study says", "title_page": "Covid-19 death rate rises in counties with high air pollution, study says - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) You are more likely to die from Covid-19 if you live in a county in the United States with higher levels of long-term air pollution, according to new research released Tuesday by Harvard T.H. Chan School of Public Health.\n\"We found that an increase of only 1 gram per cubic meter in fine particulate matter in the air was associated with a 15% increase in the Covid-19 death rate,\" said lead author Francesca Dominici, co-director of the Harvard Data Science Initiative.\nThe study defined high pollution levels as fine particulate matter (PM 2.5) levels above 13 micrograms per cubic meter of air, much higher than the US mean of 8.4.\n\"The results suggest that long-term exposure to air pollution increases vulnerability to experiencing the most severe Covid-19 outcomes,\" Dominici said.\nThe new information should be used by federal, state and local officials to make informed decisions about enforcing social distancing and preparing hospitals and local health care systems for a potential influx of more severe cases that will need extreme measures such as ventilators, Dominici said.\n\"We know the counties that have higher pollution levels historically,\" she said. \"We know that even if they [the counties] haven't experienced high number of deaths yet, that would be one of their higher risks.\"\nUS county level average of PM2.5 concentrations (2000- 2016) Citation: Exposure to air pollution and COVID-19 mortality in the United States. Xiao Wu, Rachel C. Nethery, Benjamin M. Sabath, Danielle Braun, Francesca Dominici. medRxiv 2020.04.05.20054502\nAs for areas not currently seeing high mortality rates that should prepare, \"Atlanta stands out as one of the clearest examples,\" said co-author Xiao Wu, a Ph.D. student in the department of biostatistics at Harvard University.\n\"DeKalb and Gwinnett counties all have PM 2.5 levels greater than 13 micrograms per cubic meter of air across our study period, and still have a relatively low number of confirmed cases and deaths,\" Wu said. \"Baltimore as well stands out as a place with high PM exposure, but a low number of deaths for now.\"\nWu said other counties with high pollution levels with current death rates from Covid-19 lower than the average across the US include:\nFresno, Kings, Los Angeles, Orange and Tulare counties in California\nVanderburgh county in Indiana\nButler, Hamilton and Montgomery counties in Ohio\nAllegheny and Westmoreland counties in Pennsylvania\n\"That means that in these counties, we need to keep an even closer look to the social distancing measures, and we need to make sure that they are equipped to respond to those hospitalized with Covid-19,\" Dominici said. \"This is really, to me, utterly common sense.\"\nThe study is a \"pre-print,\" which means it has not undergone peer review and been accepted by a journal for publication. Pre-prints are becoming more and more common during the pandemic as researchers scramble to provide study results that might hold clues to fighting the virus.\nThe results provide \"stark new information about the deadly toll of particle pollution,\" said American Lung Association president and CEO Harold Wimmer, who was not involved with the study.\n\"The nation has known for some time that long-term exposure to particle pollution can worsen symptoms of lung disease, increase susceptibility to lung infection, trigger heart attack and stroke, and can even cause lung cancer and premature death,\" Wimmer said in a statement.\n\"This new research from Harvard now links particle pollution exposure to a dramatically higher death rate from Covid-19.\"\nFine particulate matter\nThe study analyzed the levels of fine particulate matter in each county in the US between 2000 and 2016.\nParticulate matter is a mixture of solid and liquid matter found in the air. Dust, dirt and smoke particles are larger but there are also extremely small, inhalable particulates that can't be seen with the naked eye. Those are called PM 2.5 because their size is generally 2.5 micrometers or less.\nThat's really tiny -- for comparison, an average human hair is 30 times larger than a PM 2.5 particle. Because they are so small, these particulates can get deep into the lungs and wreak havoc with our lungs and bodily functions.\nThe researchers then compared those county-level maps of air pollution to current numbers of deaths from Covid-19 through April 4, a number tallied by Johns Hopkins University.\nThere is a large overlap between the underlying conditions that put many Covid-19 patients at risk -- such as lung, kidney and heart conditions -- and diseases made worse by long-term exposure to fine particulate matter.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nA prior study of 60 million Americans over age 65 by the same research group found that each 1 gram per cubic meter rise in long-term PM 2.5 exposure was associated with a 0.73% increase in the rate of death from any cause.\nCompared to those results, the new study showed the same small increase led to a \"Covid-19 death rate of a magnitude that is 20 times the one estimated for all-cause mortality.\"\nThe study said those findings held true after a large set of \"socioeconomic, demographic, weather, behavioral, and healthcare-related confounders\" were taken into account.\nThe study has some limitations, the authors said, including the fact that the data was averaged at a county levelti.\n\"If they knew at the individual level the deaths from Covid-19, and knew whether the dead person smoked, had hypertension, had diabetes or any of the other known risk factors, that it would be a stronger analysis,\" said pulmonologist Dr. John Balmes, a professor of medicine at University of California, San Francisco, who was not involved in the study.\nMore to be done\nThe maps also show more danger from the virus in communities of color, said Balmes, who is also a professor of environmental health sciences at UC Berkeley.\n\"The same counties that have the higher air pollution, they also have more poor people, more poor people of color. And it's probably at the neighborhood level that there's the greatest risk,\" he said.\n\"You can use these maps to better target scarce resources, and specifically target resources for the safety net hospitals that these poor people of color usually have to go to,\" Balmes said.\nAnd there's a global need to analyze the impact of air pollution on risk levels around the world.\n\"I think overall the general convolutions that long-term exposure to PM 2.5 increases the risk or Covid-19 deaths is probably generalizable to a global scale,\" said Yifang Zhu, a professor in the department of environmental health and sciences at UCLA, who was not involved in the study.\n\"So, I think the study gives strong evidence to highlight the importance of further improving our air quality overall,\" Zhu said.", "url": "https://www.cnn.com/2020/04/07/health/covid-19-air-pollution-risks-wellness/index.html"}