{"authors": ["Steve Almasy", "Jason Hanna", "Christina Maxouris"], "date_download": "2020-05-04 15:59:02", "date_modify": "2020-05-04 15:59:02", "date_publish": "2020-03-31 07:56:46", "description": "The two top infectious disease experts on the White House coronavirus task force think social distancing measures appear to be helping but reminded Americans they are going to have a significant effect on how many people in the Unites States die.", "filename": "2020_03_31_health_us-coronavirus-updates-tuesday_index_1588607942.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330234211-coronavirus-maryland-0330-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_health_us-coronavirus-updates-tuesday_index_1588607942.html", "title": "Social distancing appears to be slowing the spread of coronavirus, experts say", "title_page": "Social distancing appears to be slowing the spread of coronavirus, experts say - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The two top infectious disease experts on the White House coronavirus task force think social distancing measures appear to be helping but reminded Americans they are going to have a significant effect on how many people in the Unites States die.\n\"It's communities that will do this. There's no magic bullet (for Covid-19), there's no magic vaccine or therapy, it's just behaviors,\" said Dr. Deborah Birx, coordinator of the task force. \"Each of our behaviors translating into something that changes the course of this viral pandemic over the next 30 days.\"\nCases and deaths are soaring: There have been at least 3,800 reported deaths in the United States -- more than 800 of which were reported Tuesday alone. More than 185,000 coronavirus cases have been reported in the country.\nHawaii became the 49th state to report a death. Only Wyoming, which has had 109 reported cases, has not announced a fatality.\nModels used by the White House predict that even with perfect adherence to social distancing guidelines, at least 100,000 Americans might die.\nDr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, told reporters that Americans should be ready for such a death toll, but the task force is working to keep the number down.\n\"We should be prepared for it. Is it going to be that much? I hope not, and I think the more we push on the mitigation the less the likelihood it would be that number,\" he said.\nPresident Donald Trump announced the White House's coronavirus guidelines would be extended for another 30 days and that Americans should be ready for a \"very tough two weeks ahead.\"\nFauci also told Americans not to get discouraged when the number of deaths keeps increasing because other data will show mitigation is working.\nEarly clues -- in places like New York, California and Seattle -- indicate social distancing may be slowing the rate at which Covid-19 cases otherwise would have increased in the United States.\nBut health officials warn it's too early to know how well it's working -- and even if mitigation measures continue, the number of US deaths still could be hard to take\nThere are, however, signs that rates of case increases may have been slowed in some places. It's too early to pinpoint why, though the signs have come after federal and state officials urged people to stay at home or avoid crowds:\n• New York has by far the most US cases (75,700+) and deaths (1,500+). But the state's average of day-over-day case increases for the past seven days was 17%, compared to 58% for the previous seven-day period, a CNN analysis shows.\n• In Washington state's King County, two new reports from an institute that specializes in studying disease transmission dynamics showed social distancing measures appeared to be making a difference.\nAnother model shows a lower death toll for strict social distancing.\n'Stay at home, buy us time'\nIn parts of the country, walking into work feels like walking into a war zone for many medical care workers.\n\"There is not enough of anything,\" one trauma physician at Miami's Jackson Memorial Hospital said. \"There are just so many patients who are so sick, it seems impossible to keep up with the demand.\"\nInside New York City's Elmhurst hospital, one doctor told CNN \"we are at the brink of not being able to care for patients.\"\nIt may seem simple, another doctor says, but staying at home could also be saving those working to save patients.\n\"It feels like coronavirus is everywhere and it feels like we have very little to protect ourselves from getting very sick ourselves as healthcare workers,\" Dr. Cornelia Griggs, a pediatric surgery fellow at Columbia University, said Monday. \"I want everyone at home to know that even though it seems like staying at home is futile, it's not.\"\n\"We need everyone at home to hold the line, stay at home. Buy us time, flatten the curve.\"\nThe city's police and fire personnel are struggling, too.\nAt the New York Police Department, 1,193 employees -- 1,048 uniformed officers and 145 civilian workers -- had tested positive for coronavirus by Tuesday morning, a law enforcement source told CNN. More than 5,600 members of the department -- about 15% of the force -- were out sick Tuesday, according to the source.\nNew York City Fire Department paramedic Madelyn Higueros, who works in the area near Elmhurst hospital, said her shifts have been extra hectic, responding to call after call from people with flu-like symptoms.\nHer husband, also a city paramedic, has tested positive for coronavirus and is self-isolating away from the family. She doesn't have symptoms.\n\"Most of the station is out with symptoms,\" she said. \"The ones that are still working, we're so tired. ... We're working over 16 hours a day.\"\nThe city fire department had 282 members test positive for coronavirus, spokesman Jim Long said Tuesday.\nStates clamp down\nMore than two dozen governors have stepped up to combat the spread of the virus, issuing stay-at-home orders that now cover more than three-fourths of the American population -- and authorities have begun cracking down on those who refuse to abide.\nTexas Gov. Greg Abbott is among governors who has not issued a strict stay-at-home order, but Tuesday he signed an executive order amending previous guidelines. Social gatherings are now limited to essential functions and residents are told to minimize in-person contact with people who aren't relatives.\nThe order says people should work from home, if possible.\n\"By staying at home -- by reducing personal interactions -- you are saving lives and you are improving the health across state,\" he said at a news conference.\nMore than 80% of Americans live in areas under a stay-at-home order.\nMaine Gov. Janet Mills issued an order Monday, saying it will be in effect through April 30. The penalty for breaking the order can be up to six months in jail and up to a $1,000 fine.\nTennessee's new order went into effect Tuesday.\nIn Florida, a pastor was arrested Monday for continuing to hold large services and is charged with unlawful assembly and violation of public health emergency rules, both second-degree misdemeanors.\n\"Last night I made a decision to seek an arrest warrant for the pastor of a local church who intentionally, and repeatedly, chose to disregard the orders set in place by our president, our governor, the CDC and the Hillsborough County Emergency policy group,\" Hillsborough County Sheriff Chad Chronister said.\n\"His reckless disregard for human life put hundreds of people in his congregation at risk, and thousands of residents who may interact with them this week in danger,\" he added.", "url": "https://www.cnn.com/2020/03/31/health/us-coronavirus-updates-tuesday/index.html"}