{"authors": [], "date_download": "2020-05-04 15:56:41", "date_modify": "2020-05-04 15:56:41", "date_publish": "2020-04-15 18:09:35", "description": "Across the world, museums and educational institutions are offering children incredible virtual field trips. They can learn about snow leopards, explore Mars, and even discover what it looks like inside their very own brains.", "filename": "2020_04_15_cnn-underscored_virtual-tours-museums-aquariums_index_1588607801.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410152136-underscored-virtual-tour-lead-new-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_15_cnn-underscored_virtual-tours-museums-aquariums_index_1588607801.html", "title": "Virtual tours and field trips to get \"out of the house\"", "title_page": "Virtual tours and field trips to get \"out of the house\" - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored has interviewed experts to find the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nSchools are closed across the US, leaving states and school districts scrambling to figure out how to implement distance learning during the pandemic. Regardless of our individual situations, however, parents are all likely to hear the words \"I'm bored\" at some point in the coming weeks.\nNot going to school may sound great at first to some kids — but what about no sleepovers, playdates or field trips? Across the world, museums and educational institutions are rising to the challenge to offer children incredible virtual field trips. They can learn about snow leopards, explore Mars, and even discover what it looks like inside their very own brains. It's screen time we can all feel good about.\nAnd when the field trip is over, we've found ways you can bring the museum experience home to keep the kiddos occupied with something educational and screen-free.\nZoos & Aquariums\nLook at animals like lemurs.\nMonterey Bay Aquarium, Monterey, CA\nThe Monterey Bay Aquarium is continuing to add activities and learn-at-home resources, including a week's worth of daily activities options for all age groups to guide exploration of their online resources and live cams. Kids can also learn about kelp forests as they build their own via an app (Apple or Google Play) or desktop browser.\nSan Diego Zoo\nThe San Diego Zoo's kid-friendly website is bright and easy to navigate. Kids can click on an animal to learn more about it and even watch live cams of some of the zoo's most popular residents, like pandas busy napping. Other videos include easy crafts and fascinating tours with zookeepers.\nCincinnati Zoo\nZookeepers are hosting daily \"home safaris\" on Facebook at 3:00 p.m. ET. All previous home safaris are available to watch on Facebook as well as on the zoo's own website.\n_______________________________________________________________________________\nHow to bring it home:\nSafari Ltd Toobs Wild ($12; michaels.com)\nSafari Ltd Toobs Wild\nYour kids will be prepared to lead their own zoo tours and share their own animal facts pretty soon. Let them get started with this set of animals from Safari Ltd.\n_______________________________________________________________________________\nPeaceable Kingdom Zoo Animal Matching Game ($10.99, amazon.com)\nPeaceable Kingdom Zoo Animal Matching Game\nThis matching game also doubles as a puzzle and can be played alone or in a group.\n_______________________________________________________________________________\nScience\nTour places like the Kennedy Space Center.\nKennedy Space Center, Florida\nEducators at the Kennedy Space Center are hosting periodic live videos about all things space, from daily life as an astronaut to a look at the moon rock collection. Upcoming videos are announced on the Facebook page.\nCalifornia Science Center, Los Angeles\nThe California Science Center is releasing its Stuck at Home Science! videos weekdays at 1:00 p.m. ET throughout its closure. Each week has a theme like \"All Cooked Up!\" and \"1, 2, 3, Blastoff!\" Kids can follow along with science experiments that use easy-to-find household supplies\nNational Air and Space Museum, Washington\nThe Air and Space Museum is one of the most visited museums in the world — and your kids can visit it (and see some of the famous planes and rockets) without leaving the house. They can tour the halls of the museum thanks to Google Arts & Culture. Other interactive exhibits include Geography from Space quizzes for older kids and the Pilot Pals game for younger ones.\nAmerican Museum of Natural History, New York\nThe American Museum of Natural History has Ology, an entire website for kids to explore. Each section lets kids choose an \"ology\" to learn about, like paleontology or archaeology, and includes coordinating games, videos from resident scientists and activities.\nMuseum of Science + Industry, Chicago\nKids can take a tour of the heart and even explore the museum after-hours with a cute but lazy robot companion, Twitch, who needs help with some simple machines. Parents can sign up for a weekly science newsletter for more activities and ideas.\nChildren's Museum of Indianapolis\nThe Children's Museum of Indianapolis, the largest children's museum in the country, is hosting Museum at Home, a series of videos and live streams that let kids explore the museum, learn from educators and even sit in on storytime.\nMars\nEven when we're not social distancing, it's unlikely kids will be able to hop a spaceship to Mars. Thankfully, the Curiosity Rover allows them to join for a virtual ride-along thanks to a partnership with Google, Access Mars and NASA.\nKidsQuest Children's Museum, Bellevue, WA\nKidsQuest is offering daily YouTube streams featuring at-home activities or storytime. Activities are centered around art, math and science. You can see all upcoming videos on its YouTube page.\nThe Franklin Institute, Philadelphia\nKids can learn more about their brains with The Franklin Institute's interactive exhibit. Different modules explore the fascinating ways our brains interpret sound, images and more.\n_______________________________________________________________________________\nHow to bring it home:\nSmithsonian Planetarium Projector ($29.99, target.com)\nSmithsonian Planetarium Projector\nEven if you can't get outside as much as you want, kids can still gaze at (and learn about!) the stars any time of day.\n_______________________________________________________________________________\nThames & Kosmos Magnetic Science Experiment Kit ($28.43, originally $32.95; amazon.com)\nThames & Kosmos Magnetic Science Experiment Kit\nThis kit goes beyond simple household science experiments, with a variety of magnets and other components, and 33 experiments.\n_______________________________________________________________________________\nNational Geographic Dino Dig Kit ($7.99, target.com)\nNational Geographic Dino Dig Kit\nKids can practice the same techniques real paleontologists use to dig for bones — and find a real fossil of their own.\n_______________________________________________________________________________\nArt\nWatch puppet shows put on by museums.\nThe Kennedy Center, Washington\nMo Willems, the current Kennedy Center Education Artist-in-Residence, is hosting Lunch Doodles every weekday at 1:00 p.m. ET. Kids can learn how to draw some of Willems' popular characters, like Elephant and Piggie, as well as some of their own original creations.\nThe International Museum of Children's Art, Oslo, Norway\nIf kids need even more inspiration, they can take a virtual tour of the first museum dedicated to art made by children from over 180 different countries. Google Arts & Culture has made a selection of works available that range from sweet to silly to profound.\nCenter for Puppetry Arts, Atlanta\nYour little ones can watch puppet shows, learn more about puppets around the world, and even learn how to make their own puppets as part of the Center for Puppetry Arts' digital learning program. Check out the weekly schedule and tune in on Facebook to watch.\n_______________________________________________________________________________\nHow to bring it home:\nDarice Deluxe Art Set ($17.25; amazon.com)\nDarice Deluxe Art Set\nAn oversized art kit — with pastels, markers, pencils and more — will provide young artists with plenty of options for creating their next masterpieces.\n_______________________________________________________________________________\nHey! Play! Kids Wooden Tabletop Puppet Theater ($38.49; target.com)\nHey! Play! Kids Wooden Tabletop Puppet Theater\nAfter learning and watching puppet shows, kids can put on their very own performance at home. And this happy dog puppet is a perfect star for their show.\n_______________________________________________________________________________\nHistory\nJoin a book club at the Dallas Holocaust and Human Rights Museum.\nNational Constitution Center, Philadelphia\nThe Constitution Center is offering free weekly classes on the Constitution via Zoom for middle and high schoolers. Kids will hear from the center's president and even get to discuss topics with fellow participants.\nNational Museum of American History, Washington\nCivil War buffs will love the chance to solve their very own mystery — and explore the archives of the Smithsonian — with Ripped Apart, an iPad app from the Smithsonian.\nThe British Museum, London\nMiddle and high school kids will enjoy exploring The Museum of the World, an interactive timeline that gives them a look at some of the museum's 8 million works. The timeline is elegantly organized by date, geographical area and theme. Click on an object to learn more and even get a mini lecture from a curator.\nColonial Williamsburg, Williamsburg, VA\nColonial Williamsburg is allowing kids to travel back in time from wherever they are with videos and educational resources. The Explore from Home series on YouTube includes videos with some of the historical interpreters, including the people who portray Martha Washington and Thomas Jefferson.\nDallas Holocaust and Human Rights Museum, Dallas\nThe museum is hosting virtual talks, book clubs and storytimes for kids of all ages. For the next two Fridays, they'll also have a Zoom book club for families. On April 17, they'll be discussing \"The Boy in the Striped Pajamas.\"\n_______________________________________________________________________________\nHow to bring it home:\n'The Boy in the Striped Pajamas' ($6.39, target.com)\nThe Boy in the Striped Pajamas\nEven if you can't finish the book in time for the book club, you can read and discuss it as a family.\n_______________________________________________________________________________\nOutset Media American Trivia Family Edition ($29.95; amazon.com)\nOutset Media American Trivia Family Edition\nPlayers travel around the United States and answer trivia questions in this board game — another great way to get out of the house without leaving the couch.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/15/cnn-underscored/virtual-tours-museums-aquariums/index.html"}