{"authors": ["Jacqueline Howard"], "date_download": "2020-05-04 17:02:31", "date_modify": "2020-05-04 17:02:31", "date_publish": "2020-04-10 17:41:36", "description": "Even though the coronavirus pandemic continues to take lives across the United States, Covid-19 has not become the leading cause of death in the nation, the Centers for Disease Control and Prevention confirmed to CNN.", "filename": "2020_04_10_health_coronavir_c048d82a624f1aec4ebb556faa690956_index_1588611751.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410111115-us-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_health_coronavir_c048d82a624f1aec4ebb556faa690956_index_1588611751.html", "title": "Coronavirus is not the leading cause of death in the US, CDC says", "title_page": "Coronavirus is not the leading cause of death in the US, CDC says - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Even though the coronavirus pandemic continues to take lives across the United States, Covid-19 has not become the leading cause of death in the nation, the Centers for Disease Control and Prevention confirmed to CNN.\n\"There are no data to support that theory,\" Jeff Lancashire, a spokesperson for the National Center for Health Statistics, said in an email on Friday.\nFalse claims declaring that coronavirus has become the leading cause of death in the US have swirled as the US leads the world in coronavirus cases . Those claims are made by some experts comparing how many people die of coronavirus daily with the estimate of how many people may die daily on average of each leading cause of death, using CDC data.\nIn other words -- the claims involve comparing reported deaths from Covid-19 to estimated deaths for leading causes of deaths, which include heart disease and cancer.\nRead More", "url": "https://www.cnn.com/2020/04/10/health/coronavirus-not-leading-cause-of-death-us-trnd/index.html"}