{"authors": ["Nathaniel Meyersohn", "Cnn Business"], "date_download": "2020-05-04 16:15:12", "date_modify": "2020-05-04 16:15:12", "date_publish": "2020-04-03 14:43:50", "description": "The coronavirus outbreak is threatening America's vast convenience store industry as consumers fill up at the pump less frequently and companies pull self-serve soda machines and hot dog rollers.", "filename": "2020_04_03_business_conveni_91819dc05f190da9e0a562ab08fafca6_index_1588608912.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402143741-slurpees-7-eleven-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_business_conveni_91819dc05f190da9e0a562ab08fafca6_index_1588608912.html", "title": "No more self-serve soda and hot dog rollers: Coronavirus upends convenience stores", "title_page": "No more self-serve soda and hot dog rollers: Coronavirus upends convenience stores - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) The coronavirus outbreak is threatening America's vast convenience store industry as consumers fill up at the pump less frequently and companies pull self-serve soda machines and hot dog rollers.\nThere are upward of 150,000 convenience stores in the United States, more than all of America's grocery stores, drug stores and dollar stores combined. The convenience store industry has been designated as an \"essential\" business and stores have mostly remained open during the crisis. Although the outbreak does not appear to be a death knell for the industry, chains are facing major challenges to their businesses.\nMore than 60% of convenience store' sales came from fuel in 2018, according to the National Association of Convenience Stores, an industry trade group\nBut millions of Americans are currently under shelter-in-place orders and have stopped driving to and from their jobs. That has crushed demand for gasoline. IHS Markit estimates that US gasoline demand may collapse by more than 50% during the coronavirus response period.\nConvenience stores can't easily replace those sales, especially because fewer are staying open 24 hours during the crisis to provide more time to clean down stores overnight.\nAdditionally, around a quarter of convenience chains' sales inside stores come from prepared foods. But companies have been forced to scale back or eliminate self-serve food and drink offerings amid the crisis and close down their diner seating areas.\n7-Eleven, Kwik Trip and Kum & Go and others have eliminated mini-mart staples such as roller grills, nacho and chili cheese machines, soup bars and self-serve coffee.\nIn response to the outbreak, convenience stores are rapidly pivoting their businesses. They are trying to become fill-in stops when shoppers find their local grocery store or big-box retailer has run out of toilet paper, hand sanitizer or water, experts say. This approach is helping chains blunt the impact of declining gas and food service sales.\nMore than half of chains say they are adding more cleaning and toiletry items to stores, according to a survey by the trade group. Many companies are also stepping up their ready-to-heat meals.\nThere is \"a diminished focus on prepared meals, a diminished focus on fuel and a lot more focus on just being a small neighborhood grocery store,\" said Jeff Lenard, spokesperson for the trade group.\nThe result of these changes is that while sales at convenience stores still rose in March, they grew more slowly than the average over the past year, according to BMO Capital Markets.\nConvenience stores are also getting a lift from shoppers buying cigarettes during the crisis.\nCigarette sales increased 3.3% in March, according to BMO Capital Markets. That marks the fastest sales growth since 2017.\n—CNN Business' Matt Egan contributed to this article.", "url": "https://www.cnn.com/2020/04/03/business/convenience-stores-coronavirus-7-eleven-wawa/index.html"}