{"authors": ["Alex Dabagh For Cnn Business Perspectives", "Alex Dabagh For"], "date_download": "2020-05-04 16:09:00", "date_modify": "2020-05-04 16:09:00", "date_publish": "2020-04-02 15:20:38", "description": "Like millions of small businesses across the country, the coronavirus, and its effect on the economy, has devastated us. We're doing everything possible to keep the lights on, and to support our fellow New Yorkers during this crisis.", "filename": "2020_04_02_perspectives_small-biz-coronavirus_index_1588608540.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401161707-02-pietro-handbags-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_perspectives_small-biz-coronavirus_index_1588608540.html", "title": "Small business owner: I'm losing $20,000 a day. Here's how the government can help me", "title_page": "Small business owner: I'm losing $20,000 a day. Here's how the government can help me (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Alex Dabagh is the owner of Pietro Handbags in New York City. The opinions expressed in this commentary are his own.\nOur family operates two large factories on the island of Manhattan -- about 10,000 square feet of leather goods manufacturing. We employ 40 well-paid artisans. Like millions of small businesses across the country, the coronavirus, and its effect on the economy, has devastated us. We're doing everything possible to keep the lights on, and to support our fellow New Yorkers during this crisis. But we can't do it alone. We need more help from the government, including grants large enough to help us pay our bills and enabling us to explore ways to let our factory be part of the fight against the virus.\nFor 38 years, we have been manufacturing handbags, belts and other accessories using imported Italian leather. We also supply leather goods for just about every designer boutique in New York City. My dad started the business after emigrating from Lebanon with $400 in his pocket. We're a classic American success story, but right now our survival, and the livelihoods of our 40 employees, is in serious jeopardy.\nAlthough handbags are not essential during a pandemic, our machinery and industrial capacity should not lay dormant. Our factories can be converted in a matter of days to produce thousands of protective masks and gowns for health care workers every day. We have already sourced three-ply polypropylene non-woven fabric for masks and polyethylene plastic for gowns. The masks we produce will not match the FDA safety standards of N95 masks, but N95 masks are in very short supply. The polyethylene gowns may meet FDA standards, but we need guidance to be certain.\nThe employees of Pietro Handbags pose for a photo in their factory in New York City.\nIf the hospitals will buy our masks, our employees can return to work and join the fight against coronavirus. I'm not doing this to make a profit -- I just want to help by putting our machines and our people to use. We will, of course, stagger our employees' hours and create separation on the manufacturing floor to ensure our employees are safe. I have reached out to the city and state and hope to hear back from them soon.\nMeanwhile, I'm also looking at every resource, government grant and loan program. The emergency $10,000 grant in the federal stimulus package is nice, but already my small business is losing $20,000 each day.\nRead More", "url": "https://www.cnn.com/2020/04/02/perspectives/small-biz-coronavirus/index.html"}