{"authors": ["Morris Pearl For Cnn Business Perspectives", "Morris Pearl For"], "date_download": "2020-05-04 16:22:39", "date_modify": "2020-05-04 16:22:39", "date_publish": "2020-04-06 13:55:29", "description": "With coronavirus pushing the US economy to the brink of disaster, the ultra wealthy have an obligation to step up and use their money and power for the greater good, writes Morris Pearl, chair of the Patriotic Millionaires.", "filename": "2020_04_06_perspectives_billionaires-coronavirus_index_1588609359.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406094722-dc-pedestrian-0402-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_perspectives_billionaires-coronavirus_index_1588609359.html", "title": "Billionaires are failing us when we need them most", "title_page": "Billionaires are failing us when we need them most (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Morris Pearl is chair of the Patriotic Millionaires and a former managing director at BlackRock, Inc. The opinions expressed in this commentary are his own.\nWith coronavirus pushing the US economy to the brink of disaster, the ultra wealthy have an obligation to step up and use their money and power for the greater good. As the people who benefited the most from a decade of economic growth, the hundreds of billionaires in America are in a unique position to do a great deal of good at a pivotal moment. But so far, they're failing to do so.\nIndeed, some have committed some of their millions to relief efforts or public health projects. The Bill and Melinda Gates Foundation , for example, has pledged $100 million to fight the coronavirus and Jeff Bezos has pledged $100 million to US food banks. But many more billionaires have done nothing. The scattered response from the world's wealthiest people to a massive systemic threat has been utterly disappointing. And that's not surprising.\nThe spreading coronavirus is laying bare the fundamental flaws with our country's reliance on philanthropic giving. Decades of cutting taxes on the wealthy and shrinking the social safety net have left the United States less prepared to handle a global pandemic than virtually any other developed country in the world. Rich people's philanthropy might be nice for the people receiving it, but when that philanthropy is used as an excuse to cut taxes on the wealthy, it may end up doing more harm than good. I'd rather feed three people through taxpayer-funded federal food assistance programs than feed one person through charity.\nThe very least billionaires and wealthy business owners can do is to ensure that their workforce, the people who made them wealthy in the first place, remain employed and paid during a business downturn. Some, like Mark Cuban of the Dallas Mavericks, are already doing this. And it's great if they're willing to spend their own money on relief efforts. But no individual, no matter how wealthy, is going to be able to make a significant dent in this crisis on their own. That's why they need to use their power, too.\nThe ultra wealthy should fight for systemic change through government action, even if that change might come with tax increases that make them slightly less wealthy at the end of the day. Here are some ideas:\nRead More", "url": "https://www.cnn.com/2020/04/06/perspectives/billionaires-coronavirus/index.html"}