{"authors": ["Russell Contreras"], "date_download": "2020-05-04 20:14:56", "date_modify": "2020-05-04 20:14:56", "date_publish": "2020-04-16 14:18:18", "description": "RIO RANCHO, N.M. (AP) — Gov. Michelle Lujan Grisham said New Mexico is not yet at a point where it can relax social distancing measures and reopen the economy in response to President Donald...", "filename": "_5818dddee021f29788dae303a5604baf_1588623296.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8585d274e98c4e779a53ca49c4e04da2/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5818dddee021f29788dae303a5604baf_1588623296.html", "title": "New Mexico governor defends lockdown", "title_page": "New Mexico governor defends lockdown", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Mike Urbina and his dog Dexter check out the mural honoring medical staff, truck drivers and other essential workers for their efforts against Covid-19 . The mural located on Central Ave. near Morningside SE in Albuquerque New Mexico, was made by artists from Home Grown NM Trading Post. Photographed on Sunday April 12, 2020. (Adolphe Pierre-Louis/The Albuquerque Journal via AP)\nMike Urbina and his dog Dexter check out the mural honoring medical staff, truck drivers and other essential workers for their efforts against Covid-19 . The mural located on Central Ave. near Morningside SE in Albuquerque New Mexico, was made by artists from Home Grown NM Trading Post. Photographed on Sunday April 12, 2020. (Adolphe Pierre-Louis/The Albuquerque Journal via AP)\nRIO RANCHO, N.M. (AP) — Gov. Michelle Lujan Grisham said New Mexico is not yet at a point where it can relax social distancing measures and reopen the economy in response to President Donald Trump’s announcement Thursday of a three-phased approach for states to restore normal activity.\nThe first-term Democratic governor and former state health secretary said that the state is not yet at a point where it can safely reopen and that doing so prematurely would guarantee greater transmission of COVID-19 and lead to greater illness and death.\n“Please know that my administration is working doggedly to develop robust economic recovery plans alongside a plan for a thoughtful, staged and flexible reopening of our state,” Lujan Grisham said in a statement. “But first things first.”\nLujan Grisham has emphasized this week that virus testing, treatment and contact tracing are not yet adequate to rein in the spread of infection if social distancing requirements are relaxed and schools and nonessential businesses are reopened. She highlighted New Mexico’s commitment to a partnership with the White House to demonstrate the effectiveness of aggressive testing and contract tracing capacity.\nHealth officials reported eight new virus-related deaths on Thursday, the highest one-day total to date.\nSmall business owners pleaded with the governor to ease some coronavirus restrictions as federal numbers Thursday showed another spike in the number of people applying for unemployment.\nSome are requesting her to allow small businesses to operate at 20% capacity while others in rural areas said they should be allowed to reopen if there are few COVID-19 cases in the areas where they do business.\nFollowing the criticism aimed at Lujan Grisham, her spokesman Tripp Stelnicki sent a tweet Thursday comparing a group he declined to name to a “death cult.”\nThe tweet was quickly denounced by the Republican Party of New Mexico, which recently held a video conference call with small business owners and said it thought the tweet was directed at the party.\nFarmington Mayor Nate Duckett said the restrictions in northwestern New Mexico have hurt small businesses so badly that some may never reopen.\n“Unfortunately, the public health crisis has become an economic crisis,” Duckett said.\nHe asked for the city of about 45,000 people to be declared an “economic emergency area” — a symbolic act he hopes influences other mayors follow to put pressure on the governor.\nAccording to the U.S. Department of Labor, 19,494 people in New Mexico applied for unemployment benefits last week compared to a revised number of 26,132 the week before. Both are among the highest of weekly unemployment claims in state history.\nFilings for unemployment aid generally reflects the pace of layoffs.\nThe Labor Department report said Thursday nationally 5.2 million more people sought unemployment benefits last week — another sign the wave of layoffs continues to engulf the U.S. economy since the coronavirus struck.\nAbout 22 million people in the U.S. sought jobless benefits over the past month. That’s easily the worst stretch of U.S. job losses on record. It means that approximately one in seven workers have lost their jobs.\nIt’s not known how many of those seeking unemployment benefits in New Mexico were working at small businesses. But small business owners said their employees are suffering the most under the restrictions because big chain stores like Walmart continue operating and are hiring.\nOn Wednesday, Lujan Grisham said her administration is considering exceptions for nonessential businesses that can provide curbside service and maintain social distancing.\nStelnicki suggested in his tweet that a group that he did not name wanted to “accelerated illness & death” and compared the group to a “death cult” whose opinions he said should not be published.\nAsked by email if he was referring to Republicans or small business owner critics of Lujan Grisham, Stelnicki declined to answer the question and said that his “tweet speaks for itself...I have nothing else to say about it.”\nThere are around 160,000 small businesses in New Mexico and they employ about 340,000 workers, according to the U.S. Office of Small Business Administration. They range from breweries to retail shops and vendors serving the state’s oil and gas industry.\nKathy Diaz, the owner of Monroe’s New Mexican Restaurant in Albuquerque, said she had to lay off about 50 employees.\n“It trickles down to venders and suppliers,” Diaz said. “It’s not their job they are losing. It’s the pride of working.”\nRory Veronda, 50, owner of the Empire Board Game Library on Albuquerque’s historic Route 66, said he let go all nine of his employees just before the restrictions were enacted. He’s staying busy by delivering board games to parents who are buying games for their bored children.\n“I think a lot of small businesses are being forced to be creative,” Veronda said. “That’s the only way we are going to survive.”\n___\nFollow Russell Contreras on Twitter at http://twitter.com/russcontreras", "url": "https://apnews.com/5818dddee021f29788dae303a5604baf"}