{"authors": ["Andrew Welsh-Huggins"], "date_download": "2020-05-04 20:18:53", "date_modify": "2020-05-04 20:18:53", "date_publish": "2020-04-07 15:00:44", "description": "COLUMBUS, Ohio (AP) — Gov. Mike DeWine has released a new list of 167 state prison inmates who could be eligible for release after 10 inmates and 27 employees at several institutions tested...", "filename": "_67982078e0c64fd45d7e871ca9e9c72a_1588623533.html", "image_url": "https://storage.googleapis.com/afs-prod/media/d8d9de97c252485db7856a38ad31454e/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_67982078e0c64fd45d7e871ca9e9c72a_1588623533.html", "title": "Governor provides list of 167 inmates eligible for release", "title_page": "Governor provides list of 167 inmates eligible for release", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Conneaut Patrolman Mike DeLisle directs traffic during the Conneaut Human Resources Center's monthly produce distribution on Mill Street in Conneaut, Ohio, Monday, April 6, 2020. (Warren Dillaway/The Star-Beacon via AP)\nConneaut Patrolman Mike DeLisle directs traffic during the Conneaut Human Resources Center's monthly produce distribution on Mill Street in Conneaut, Ohio, Monday, April 6, 2020. (Warren Dillaway/The Star-Beacon via AP)\nCOLUMBUS, Ohio (AP) — Gov. Mike DeWine has released a new list of 167 state prison inmates who could be eligible for release after 10 inmates and 27 employees at several institutions tested positive. Meanwhile, Lt. Gov. Jon Husted announced the creation of a state Office of Small Business Relief.\nA look at coronavirus-related developments in Ohio on Tuesday:\n___\nCORRECTIONAL FACILITIES\nDeWine released a list of 167 inmates who could be eligible for early release because their sentences are nearly done or they’re over 60 and meet certain conditions. No violent or sex offenders would be released, or inmates with poor prison records or domestic violence convictions, or if they were previously imprisoned. The cases would go before the Ohio Parole Board as soon as Friday. Ohio houses about 49,000 inmates.\nThe announcement comes with 14 inmates having tested positive as of Tuesday, most at Marion and Pickaway correctional facilities. The state says at least 27 staff members at four prisons have tested positive, but most at Marion. Five of 28 prisons are now under full quarantine. The inmates to be released would be low-level offenders likely near the end of their sentences and wouldn’t include violent or sex offenders.\nIn eastern Ohio, members of the Ohio National Guard began arriving at the federal prison in Elkton to help after seven inmates tested positive, said guard spokeswoman Stephanie Beougher. Of three additional inmates who have died, one tested positive for COVID-19 and tests are pending on the two others. The guard members are medical workers, including doctors and nurses.\n___\nCASES\nNearly 4,800 people have tested positive for the coronavirus and 167 people have died, with more than 1,300 hospitalizations as of Tuesday, according to the state health department. One in every five cases is a health care worker.\nBoth Cuyahoga County and much smaller Mahoning County have reported 19 deaths, the most in the state. Health officials in Mahoning County, which is home to Youngstown, attribute the number to community spread and not a single hot spot of cases.\nFor most people, COVID-19 displays mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can be more severe, causing pneumonia or death.\n___\nEDUCATION\nThe state school board provided additional guidance to schools for ending the academic year, including how to determine students’ eligibility for graduation, Gongwer News Service reported. The board says decisions should rest with a student’s principal, in consultation with teachers and counselors, or with a special ed student’s “individualized education program team.”\nOhio State University has replaced its in-person spring graduation ceremony on May 3 with a virtual ceremony with Apple CEO Tim Cook delivering the commencement address. The livestreamed event will include President Michael Drake and faculty in traditional commencement regalia, musical performances and special guests. About 12,000 diplomas are expected to be awarded.\n___\nECONOMY\nHouse Speaker Larry Householder said in an interview on WOSU-Radio’s “All Sides With Ann Fisher” that lawmakers are considering dipping into the state’s $2.7 billion rainy-day fund, as well as borrowing money for public works projects to help jump start the economy after the pandemic.\nThe Ohio Liquor Control Commission approved an emergency rule allowing restaurants to sell up to two alcoholic drinks with each food order.\nLt. Gov. Jon Husted announced the creation of a state Office of Small Business Relief to bring assistance efforts for the state’s 950,000 small businesses under one roof.\nHusted also said that 30,000 jobs are currently available at companies including grocery stores, delivery services, and businesses making personal protective equipment.\nIn Fairfield in southwestern Ohio, Shared Harvest Foodbank’s director said the agency has distributed as much food in two weeks as it normally would in two months, the Hamilton-Middletown Journal-News reported . The Ohio Foodbanks Association has asked DeWine for $25 million in emergency funding because of the overwhelming statewide demand. The association says the U.S. Department of Agriculture has waived requirements through April 30 for gathering detailed information on first-time recipients, making it easier to distribute food.\n___\nTHE NEW NORMAL\nColumbus police planned to begin issuing citations after 10 complaints of people holding large gatherings in off-campus neighborhoods over the weekend, according to The Columbus Dispatch.\nTraffic crashes across Ohio fell 44% in March compared to March 2019 as traffic plummeted, the Cincinnati Enquirer reported.\nThe annual outdoor drama, Tecumseh!, held in Chillicothe and telling the story of the 19th century Shawnee leader Tecumseh, canceled its entire season, according to the Chillicothe Gazette.\nPolice in Elyria cited a man for violating the stay-at-home order, explaining to the man that “buying drugs was not essential reason to travel,” The Chronicle-Telegram said.\n___\nAssociated Press writers Mark Gillispie, in Cleveland, Dan Sewell in Cincinnati and Julie Carr Smyth in Columbus contributed to this report.", "url": "https://apnews.com/67982078e0c64fd45d7e871ca9e9c72a"}