{"authors": ["Alaa Elassar"], "date_download": "2020-05-04 16:16:14", "date_modify": "2020-05-04 16:16:14", "date_publish": "2020-04-03 18:18:09", "description": "An Oklahoma newspaper has retracted a coronavirus-related story it published on April Fools Day that caused panic among parents and teachers.", "filename": "2020_04_03_us_oklahoma-sapu_b91b95a4a5a21d053c74552c8b6e5539_index_1588608974.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403132409-sapulpa-high-school-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_us_oklahoma-sapu_b91b95a4a5a21d053c74552c8b6e5539_index_1588608974.html", "title": "An Oklahoma newspaper has apologized for a coronavirus April Fools' story after facing backlash", "title_page": "An Oklahoma newspaper has apologized for a coronavirus April Fools' story after facing backlash  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) An Oklahoma newspaper has retracted a coronavirus-related story it published on April Fools Day that caused panic among parents and teachers.\nThe Sapulpa Times also issued an apology on its website for a story that claimed Sapulpa students would have to repeat the entire school year.\nThe Oklahoma State Board of Education ordered all public schools to close beginning March 17 due to the coronavirus, including the schools in Sapulpa, which is southwest of Tulsa.\n\"The story was not endorsed by, approved by, or even known about by any of the Sapulpa School's Administration when it went live on Wednesday morning, but SPS are the ones now having to deal with frantic parents and angry teachers,\" Micah Choquette, the owner and editor of the Sapulpa Times, said in the letter.\nChoquette said the story was an innocent joke and an attempt to find humor in \"a time where it's sorely needed.\" The newspaper retracted the story almost immediately after it was published.\nRead More", "url": "https://www.cnn.com/2020/04/03/us/oklahoma-sapulpa-times-april-fools-apology-trnd/index.html"}