{"authors": ["Opinion Nicole Hemmer"], "date_download": "2020-05-04 16:24:40", "date_modify": "2020-05-04 16:24:40", "date_publish": "2020-04-07 00:19:07", "description": "Peter Navarro's claims to have standing to debate or dispute Anthony Fauci about hydroxychloroquine reveal Navarro as Trump's perfect 21st-century huckster, says historian Nicole Hemmer: 'well-credentialed at something (even if it's not the field in question), television-ready and willing to jettison any knowledge that conflicts with the presidents aims.'", "filename": "2020_04_06_opinions_peter-n_cd15d2004806eee5aede7e87f5846416_index_1588609480.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406125044-navarro-fauci-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_opinions_peter-n_cd15d2004806eee5aede7e87f5846416_index_1588609480.html", "title": "Navarro's laughable claim that he knows better than Fauci", "title_page": "Navarro's laughable claim that he knows better than Fauci (opinion)  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Nicole Hemmer is an associate research scholar at Columbia University with the Obama Presidency Oral History Project and the author of \" Messengers of the Right: Conservative Media and the Transformation of American Politics .\" She hosts the history podcast \" Past Present \" and created the podcast \" A12 .\" The views expressed in this commentary are solely those of the author. View more opinion articles on CNN.\n(CNN) Dr. Anthony Fauci, the head of the National Institute of Allergy and Infectious Diseases (NIAID), has yet to embrace hydroxychloroquine, the drug the President touts , without evidence, as a miracle treatment for Covid-19.\nBut someone in the administration has stepped up to promote the drug: Peter Navarro.\nNavarro may seem like an odd person to be stepping into this role. Unlike Fauci, an infectious disease specialist who has directed NIAID under six presidents, Navarro is an economist. His principal role in the White House is to oversee trade policy.\nBut Navarro is ready to put his credentials up against Fauci's any day. As he told CNN on Monday : \"My qualifications in terms of looking at the science is that I'm a social scientist. I have a PhD. And I understand how to read statistical studies, whether it's in medicine, the law, economics or whatever.\"\nWhile that's more expertise than President Trump claims -- \"I'm not a doctor, but I have common sense,\" Trump said while promoting the drug on Sunday -- it's a specious claim to expertise, one that fits in well with the administration's long-running war against experts.\nThe misinformation emanating from the White House and conservative media during the pandemic has shown us the high price of rejecting expertise. But it has also illustrated how multifaceted the war on expertise really is -- that it is as much about co-opting and distorting expertise as it is discrediting it altogether.\nNavarro's claim that his social science PhD makes him a medical expert qualified to debate or dispute Fauci has roots in the late 19th century, when new systems of credentials emerged as a way of signaling expertise. As medicine, teaching, journalism, economics and other fields professionalized, they created a parallel set of institutions -- schools, degrees, licenses, associations -- that credentialed people who had completed courses, passed exams and agreed to adhere to a set of professional rules.\nThe rise of professional credentials had an enormous impact on the health and safety of Americans.\nAssociations policed the use of titles like \"doctor,\" something necessary in an age when patent-medicine peddlers and snake-oil salesmen called themselves doctors while pushing poisons on unsuspecting or desperate people. The American Medical Association worked to sort out useful pharmaceuticals from harmful ones in 1905, a role eventually taken on by the Food and Drug Administration.\nAmericans in the 20th century increasingly relied on experts as sources of reliable information, as well as on credentials to tell them who the experts were. But credentials were not exactly the same as expertise.\nCredentials could be bought, which is how John R. Brinkley, who got his MD from a diploma mill, rose to national fame as a \"doctor\" who used goat testicles to treat male infertility. They could also be denied: Many people, especially women and people of color, who attained the same skills and mastered the same bodies of knowledge had few if any ways of obtaining credentials until the second half of the 20th century. And people with credentials could wield them to speak well beyond their areas of expertise (think of an English Ph.D. who writes diet books or, say, an economist who offers medical advice).\nThat last group has given rise to the well-credentialed huckster, a mainstay of American culture in the last few decades. Navarro, too, falls in this group who assert expertise outside their fields.\nHe is an economist who shifted to punditry and began to style himself as a China expert , despite not speaking any Chinese dialect nor having spent significant time in the country, according to Foreign Policy\nAs such, Navarro represents exactly the sort of expert Trump, with his disdain for genuine expertise, admires: well-credentialed at something (even if it's not the field in question), television-ready and willing to jettison any knowledge that conflicts with the Presidents aims. It's no wonder that Navarro is the one appearing on news programs on Monday morning, after Trump blocked Dr. Fauci from answering questions about the president's favorite drug on Sunday evening.\nTrump has, by and large, gotten away with his disdain for expertise for much of his administration, because many Americans have also grown wary of experts, for a wide range or reasons. Faith in institutions has declined sharply since the 1960s, leaving Americans uncertain of who, exactly, they should trust. The right has pummeled universities, climate scientists, journalists and other experts for decades now, offering up an alternative network of trust knitted together by shared ideology rather than expertise.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nWhich is not to say experts are without influence.", "url": "https://www.cnn.com/2020/04/06/opinions/peter-navarro-anthony-fauci-hydroxychloroquine-expertise-hemmer/index.html"}