{"authors": [], "date_download": "2020-05-04 20:19:17", "date_modify": "2020-05-04 20:19:17", "date_publish": "2020-04-07 20:08:59", "description": "COLUMBUS, Ohio (AP) — A former Republican fundraiser in Ohio convicted in an investment scandal that ensnared a sitting governor is among nearly 170 state inmates who could be released early...", "filename": "_176dada78d7813558da61c1681907ac5_1588623557.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_176dada78d7813558da61c1681907ac5_1588623557.html", "title": "Convicted GOP insider could get released because of virus", "title_page": "Convicted GOP insider could get released because of virus ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "COLUMBUS, Ohio (AP) — A former Republican fundraiser in Ohio convicted in an investment scandal that ensnared a sitting governor is among nearly 170 state inmates who could be released early because of the coronavirus pandemic.\nRepublican Gov. Mike DeWine on Tuesday released the list of inmates, which includes former Toledo-area coin dealer Tom Noe, who is serving an 18-year sentence for stealing from a $50 million rare-coin fund he oversaw.\nThe investigation into what was dubbed “Coingate” led to 19 convictions that reached up to then-Ohio Gov. Bob Taft and his chief of staff. The scandal also helped Democrats win four of five statewide elective offices in 2006.\nIt will be up to the Ohio Parole Board to decide whether to release Noe and 25 other inmates who are over 60 and have medical problems that could make them vulnerable to the virus, DeWine said.\nAnother 141 inmates have been recommended for early release because of overcrowding concerns, the governor said. No violent inmates or sexual offenders will be released.\nNoe, 65, was due to be released in 2026.\nEach inmate on the list of those who could be released went through the same screening process and will be treated the same by going before the parole board, DeWine said.\nTwice before, the board has recommended against clemency for Noe. Prosecutors have said he used state money to pay off business loans and fund a lavish lifestyle, including the renovation of his Florida Keys home.", "url": "https://apnews.com/176dada78d7813558da61c1681907ac5"}