{"authors": ["Aj Willingham"], "date_download": "2020-05-04 16:05:46", "date_modify": "2020-05-04 16:05:46", "date_publish": "2020-04-02 10:08:29", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "filename": "2020_04_02_us_five-things-april-2-trnd_index_1588608346.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402031651-shelter-in-place-california-0325-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_us_five-things-april-2-trnd_index_1588608346.html", "title": "5 things to know for April 2: Coronavirus, health, guns, NASA, Daniel Pearl", "title_page": "5 things to know for April 2: Coronavirus, health, guns, NASA, Daniel Pearl - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "If your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' newsletter.\n(CNN) The Democratic convention is a little more than 100 days away. Joe Biden says it's difficult to imagine it will go on as planned , given coronavirus measures.\nHere's what you need to know to Get Up to Speed and On with Your Day.\n(You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily. Sign up here .)\n1. Coronavirus\nJUST WATCHED Panama tightens virus lockdown based on gender Replay More Videos ... MUST WATCH Panama tightens virus lockdown based on gender 01:28\n2. Health\nJUST WATCHED Confused on whether you need a mask or not? Gupta has the answer Replay More Videos ... MUST WATCH Confused on whether you need a mask or not? Gupta has the answer 02:07\n3. Guns\nJUST WATCHED By the numbers: Gun deaths in America Replay More Videos ... MUST WATCH By the numbers: Gun deaths in America 00:47\n4. NASA\nFor the first time since the final space shuttle mission in 2011, NASA says astronauts will launch into space aboard an American rocket and spacecraft from American soil . The agency is partnering with SpaceX for a manned SpaceX Demo-2 flight test in May from Kennedy Space Center. Of course, this launch date could be postponed depending on the state of the coronavirus crisis. This is a big step for NASA's Commercial Crew Program. By facilitating commercial spaceflights, the agency says it's providing another way for astronauts to get to and from the International Space Station. And it looks like a lot of people are interested in blasting off: More than 12,000 people applied to be part of NASA's next class of astronauts.\nJUST WATCHED SpaceX's Crew Dragon completes last test before first astronaut mission Replay More Videos ... MUST WATCH SpaceX's Crew Dragon completes last test before first astronaut mission 01:32\n5. Daniel Pearl\nA local court in Pakistan has overturned the death sentence and murder convictions of four men believed to be involved in the 2002 killing of American journalist Daniel Pearl. All had been in prison for 18 years. Three were handed life sentences, and a fourth, Ahmad Omar Saeed Sheikh, was awaiting execution. The high court in Pakistan's southern province of Sindh vacated Sheikh's murder conviction and reduced his sentence to a shorter prison term for kidnapping. Pearl was working as the South Asia bureau chief of the Wall Street Journal when he was kidnapped by militants in Pakistan and later murdered. His death shook the international community and sowed dread regarding the rise of radical Islamist terrorism.\nBREAKFAST BROWSE\nDolly Parton donates $1.1 million to coronavirus research\nJUST WATCHED Here's how Dolly Parton can help get your kids to sleep Replay More Videos ... MUST WATCH Here's how Dolly Parton can help get your kids to sleep 01:07\nJK Rowling launches 'Harry Potter at Home' hub for bored children\nNature documentaries are offering an escape for cooped-up viewers\nRuth Bader Ginsburg is still working out at the Supreme Court gym\nJUST WATCHED How Ruth Bader Ginsburg stays in shape (2018) Replay More Videos ... MUST WATCH How Ruth Bader Ginsburg stays in shape (2018) 01:07\nInstead of laying people off, Kansas City's WWI museum is giving employees thousands of pages of archives to digitize from home\nTODAY'S NUMBER\n5 million\nThat's the number of Marriott International customers who may have been affected by a data breach . The company says it was the target of a hack between mid-January and February of this year.\nJUST WATCHED Marriott wants to play Airbnb's game Replay More Videos ... MUST WATCH Marriott wants to play Airbnb's game 02:49\nTODAY'S QUOTE\n\"What are you waiting for? What more evidence do you need?\"\nJUST WATCHED CA Gov: All governors should issue stay at home orders now, what are they waiting for? Replay More Videos ... MUST WATCH CA Gov: All governors should issue stay at home orders now, what are they waiting for? 12:57\nTODAY'S WEATHER\nJUST WATCHED Spring snowstorm to cover the Plains Replay More Videos ... MUST WATCH Spring snowstorm to cover the Plains 01:51\nAND FINALLY\nHow hamsters fit so much food in their cheeks", "url": "https://www.cnn.com/2020/04/02/us/five-things-april-2-trnd/index.html"}