{"authors": ["Joseph E. Stiglitz For Cnn Business Perspectives", "Joseph E. Stiglitz For"], "date_download": "2020-05-04 16:02:16", "date_modify": "2020-05-04 16:02:16", "date_publish": "2020-04-01 13:40:45", "description": "The federal bill just passed was an impressive response to the economic consequences of the coronavirus pandemic.", "filename": "2020_04_01_perspectives_economic-relief-bill_index_1588608136.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401141306-01-capitol-hill-0326-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_perspectives_economic-relief-bill_index_1588608136.html", "title": "The relief package turned out better than I thought it would (opinion)", "title_page": "The relief package turned out better than I thought it would (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Joseph E. Stiglitz is an American economist and a professor at Columbia University. A recipient of the Nobel Memorial Prize in Economic Sciences, he is a former senior vice president and chief economist of the World Bank and a former member and chairman of the Council of Economic Advisers during the Clinton administration. His latest book People, Power, and Profits: Progressive Capitalism for an Age of Discontent, is coming out in paperback this month. The opinions expressed in this commentary are his own.\nThe federal bill just passed was an impressive response to the economic consequences of the coronavirus pandemic. But we should not refer to it as a \"stimulus\" package. That's a misnomer: It's not like 2008, when the economy faced insufficient demand because of problems in the financial sector. Then, a stimulus was what was required. Here, the problem is not lack of demand, but an implosion of the economy because of COVID-19.\nThe first priority is to ensure that we have the right economics to protect our health — that's why assistance to hospitals and paid sick leave is so important. But beyond that we need to protect our citizens to prevent the extremes of deprivation and stress that would otherwise arise, and to put our economy on a sound footing for recovery once the pandemic is under control. What the US economy needs is for the money to get into the right hands quickly and to keep workers linked to their employers.\nIn that respect, the bill rightly sought to strengthen the US unemployment insurance system, which is among the weakest in the advanced countries both in terms of coverage (the fraction of workers entitled to benefits) and replacement rates (benefits as a ratio of normal pay). If forecasts are correct, the burden on the unemployment insurance system will be enormous. The 3.3 million workers who registered for unemployment benefits last week increased the number of unemployed Americans by some 50% from the 5.8 million US workers unemployed in February. And that latest number is likely low because some couldn't get through to the unemployment offices to register. Coverage for freelance workers and those in the gig economy is also an important part of the deal that will help make sure these people get much-needed support — but it will lead to unemployment benefit numbers increasing still further. Extending the period of coverage for unemployed workers and increasing payments will also be key provisions protecting the estimated 20% to 30% of the labor force that is likely to be unemployed.\nThe package also attempts to prevent people from falling through the cracks by providing $1,200 to individuals earning $75,000 or less or $2,400 to couples earning less than $150,000, although it does not go far enough to ensure financial stability for most Americans. It was a fantasy for the Trump administration to suggest it could send the checks out in two weeks. It took two weeks to get legislation passed, and now the administration says it will take another three weeks for those funds to reach taxpayers for whom the IRS has the requisite data. It will take even longer for the rest. With so many Americans living paycheck-to-paycheck, unable to cover a $400 emergency , this delay could be calamitous.\nThere is an urgency here: If families can't pay the landlords, and the landlords can't pay their bills, and so forth down the line, we could get a gridlocked economy that would be hard to start up in the future. I've seen this in other crises, and we don't want it here.\nRead More", "url": "https://www.cnn.com/2020/04/01/perspectives/economic-relief-bill/index.html"}