{"authors": ["Ashraf Khalil", "Jacquelyn Martin"], "date_download": "2020-05-04 20:19:58", "date_modify": "2020-05-04 20:19:58", "date_publish": "2020-04-09 04:28:58", "description": "WASHINGTON (AP) — A line begins forming as a van pulls into the parking lot of a senior living center in southeast Washington. By the time the half-dozen masked volunteers set up the folding table...", "filename": "_9a6bf4c299b3f7051f09a1c649edce90_1588623598.html", "image_url": "https://storage.googleapis.com/afs-prod/media/54be5dd662334f2389f80a6cf81f46f5/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9a6bf4c299b3f7051f09a1c649edce90_1588623598.html", "title": "DC community volunteers provide food for locked-down needy", "title_page": "DC community volunteers provide food for locked-down needy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DC community volunteers provide food for locked-down needy\nWASHINGTON (AP) — A line begins forming as a van pulls into the parking lot of a senior living center in southeast Washington. By the time the half-dozen masked volunteers set up the folding table and start pulling out plastic bags filled with fruits, vegetables and canned goods, about 15 people stretch down the block.\nOrganizer Charlie Gussom Jr. advises those waiting to maintain social distancing by standing on every other sidewalk square. those in line quickly take up the same mantra to organize newcomers: “One square apart, everybody. One square apart!”\nThe group moves quickly as each person is handed a bag. When there’s no one left in line, the volunteers start going door-to-door inside the senior center, delivering food to elderly shut-ins. Then the whole operation packs up and moves to a street corner about six blocks away where the process is repeated.\n“People can’t get out to the stores, and kids are hungry,” says community organizer India Blocker-Ford. “People are just low on everything. They don’t have anything.”\nThese volunteers are the tip of the spear for a grassroots effort to keep Washington’s most vulnerable neighborhoods fed during an unprecedented coronavirus crisis that has nearly shut down the American economy.\nIn Washington’s Ward 8, the need is particularly dire. As the rest of the city has prospered, the term “across the river” became a common local racial code. It’s shorthand for Wards 7 and 8, the overwhelmingly black southeastern part of the city that is being left behind.\nThe area was already a notorious food desert, with one full-service grocery store for approximately 70,000 residents. And all manner of health issues strike disproportionately among its residents.\n“From asthma to high blood pressure, diabetes, you name it, we have it,” said Ward 8 Councilman Trayon White. “And we have some of the highest food insecurities in this community.”\nSo far, Ward 8′s official infection numbers aren’t out of line with the rest of Washington. As of Thursday, Washington had reported just over 1,500 positive infection identifications. Fewer than 200 of those, 11.7 percent, have been in Ward 8. But health officials have warned of a looming infection surge coming to the D.C. area, and White and others are bracing for impact.\nFor the vulnerable and underserved, the impact of the coronavirus lockdown has been immediate and catastrophic. Low-wage hourly workers were some of the earliest victims of the economic shutdowns, and the closure of schools had an indirect effect on the basic nutrition of many students.\n“There’s a lot of kids here that only eat hot meals at school,” said Jimmie Jenkins, who runs an organization called ManPower DC. “We were already behind with a need of food and resources. This right here just added another layer of struggle for us.”\nIn March, as the infection numbers grew, Jenkins and Blocker-Ford, who runs an organization called Indy B Mentoring, gathered community organizers to plan a grassroots response. Local charity Martha’s Table became the vehicle.\n“There’s been a huge spike in need,” said Gussom, a Martha’s Table staffer. “Food, diapers, toiletries, all types of stuff.”\nFull Coverage: Photography\nFounded as a food pantry, Martha’s Table prioritizes food insecurity and nutrition issues. The group distributes hot meals and groceries and has an in-house vegetable market that allows families in need to choose their own fresh produce. The organization expanded its programming to include after-school educational programs, fitness classes and a range of community activities. But now the vegetable market has closed, and the ancillary programs have ended.\nMartha’s Table, working with local organizers and community leaders, made it a full-time mission to respond to the skyrocketing need for food.\nA grassroots group of volunteers is working to keep Washington's most vulnerable neighborhoods fed during the unprecedented coronavirus crisis, in areas that have no grocery stores within walking distance. (April 9)\nJohanna Williams, who was in charge of after-school and summer educational programs, assumed what she called the “spontaneous position” of COVID-19 response coordinator.\nThe high-ceiling foyer and community kitchen at the Martha’s Table headquarters building has been transformed into a warehouse and distribution center, packed with crates of apples and sweet potatoes, giant sacks of onions and bags of broccoli and cauliflower. Teams of volunteers fill hundreds of bags, moving them out to cars and vans in giant rolling hampers for distribution around the ward.\nWilliams estimates that the distribution program was handing out about 200 to 250 bags per day at the beginning of March. Now that number is closer to 1,400 per day, with volunteers fanning out around the city for pop-up distributions and going door-to-door in places like senior centers. A local restaurant chain, Clyde’s Restaurant Group, has pledged to provide around 700 hot meals per day, with Martha’s Table handling the distribution.\nAndrea Phillips, an unemployed 31-year-old mother, had been a regular visitor to the in-house vegetable market at Martha’s Table. Now she tracks where the food distribution tables will be set up around the ward and shows up early to receive her bag.\n“When you’re on a budget like mine, you can usually find food. But the really hard part is eating healthy. Some other food charities try to give you cookies and soda,” she said.\nAt the food stops, volunteers wearing masks work to keep the mood light while demonstrating social distancing guidelines. Elbow bumps have replaced handshakes, hugs and high-fives. At one stop, a female volunteer has to physically push away a man who is crowding too close to the van.\nWhite, the Ward 8 councilman, arrives wearing a full-body white coverall used by painters. He’s fresh from a set of community rounds that included personally dispersing a set of youths hanging out too close together on a street corner.\n“God told us to feed his sheep,” White said. “That’s part of what we’re doing here today.”", "url": "https://apnews.com/9a6bf4c299b3f7051f09a1c649edce90"}