{"authors": ["Chris Isidore", "Cnn Business"], "date_download": "2020-05-04 16:10:33", "date_modify": "2020-05-04 16:10:33", "date_publish": "2020-04-02 23:25:54", "description": "Tesla built more than 100,000 vehicles in the first quarter, despite shutdowns at its plants in Shanghai and Fremont, California, due to health concerns associated with the coronavirus.", "filename": "2020_04_02_tech_tesla-sales-production_index_1588608633.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402182238-tesla-dealership-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_tech_tesla-sales-production_index_1588608633.html", "title": "Tesla overcomes plant shutdowns to again build 100,000 cars in quarter", "title_page": "Tesla overcomes plant shutdowns to again build 100,000 cars in quarter - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Tesla built more than 100,000 vehicles in the first quarter, despite shutdowns at its plants in Shanghai and Fremont, California, due to health concerns associated with the coronavirus.\nThe company delivered only about 88,400 of the 102,672 cars it built for customers.\nThe number of completed sales was up 40% from the year earlier. But it was down 21% from the record fourth quarter sales that lifted Tesla to its first annual operating profit . Still, that beat recently lowered Wall Street estimates of 80,000 deliveries in the quarter. It was \"a small victory in a dark environment,\" according to a note from analyst Daniel Ives of Wedbush Securities.\nTesla had to temporarily halt production at its new factory in Shanghai in late January due to restrictions put in place in China to combat the coronavirus. It kept its main plant in Fremont, California running even as state officials ordered non-essential businesses in the area to shut. But on March 19 it went ahead and suspended production there as well.\nMost of the auto industry suffered steep declines in car sales in the first quarter due to shutdowns in much of the United States, Europe and Asia in an effort to battle coronavirus. Forecasts for US and global sales for the entire industry have been slashed in recent weeks.\nRead More", "url": "https://www.cnn.com/2020/04/02/tech/tesla-sales-production/index.html"}