{"authors": ["Corey Williams"], "date_download": "2020-05-04 20:27:52", "date_modify": "2020-05-04 20:27:52", "date_publish": "2020-04-15 17:31:33", "description": "DETROIT (AP) — Barely surviving the 2008 economic meltdown and humbled by its 2013 bankruptcy, Detroit’s fiscal future now faces another daunting foe in the coronavirus. The state-forced...", "filename": "_7ba406d43e6cc02a5f16d336483ff76f_1588624072.html", "image_url": "https://storage.googleapis.com/afs-prod/media/62efbc87661f44f9846ff8a5e147827e/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7ba406d43e6cc02a5f16d336483ff76f_1588624072.html", "title": "Detroit facing fresh fiscal woes with coronavirus closures", "title_page": "Detroit facing fresh fiscal woes with coronavirus closures", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Jan. 11, 2019 photo, the Detroit skyline is seen from Windsor, Ont. Detroit's fiscal future faces a new daunting foe in the coronavirus. Detroit Mayor Mike Duggan on Tuesday, April 14, 2020, announced some layoffs, pay cuts for other employees and and a reduction in some services. He warned that Detroit could be subject to a return to state oversight if action isn't taken quickly. (AP Photo/Carlos Osorio)\nIn this Jan. 11, 2019 photo, the Detroit skyline is seen from Windsor, Ont. Detroit's fiscal future faces a new daunting foe in the coronavirus. Detroit Mayor Mike Duggan on Tuesday, April 14, 2020, announced some layoffs, pay cuts for other employees and and a reduction in some services. He warned that Detroit could be subject to a return to state oversight if action isn't taken quickly. (AP Photo/Carlos Osorio)\nDETROIT (AP) — Barely surviving the 2008 economic meltdown and humbled by its 2013 bankruptcy, Detroit’s fiscal future now faces another daunting foe in the coronavirus.\nThe state-forced shutdown of its three casinos, auto plants and other businesses to slow the spread of the COVID-19 virus is projected to cost Detroit $348 million over the next year and a half.\nMayor Mike Duggan warned that Detroit could see a return to state oversight if action is not taken quickly, as he announced some layoffs, pay cuts and a reduction in services.\n“We don’t get to just solve one problem at a time,” Duggan said Tuesday in a televised address. “Because while we have a health crisis, we have the biggest budget crisis this city’s seen in seven years and we have to solve it at the same time.”\nMichigan has at least 27,000 confirmed cases of COVID-19 and 1,768 deaths — third-most in the U.S — and its largest city has been especially hard hit. While the state remains under a stay-at-home order from the governor, the virus has sickened at least 7,020 people in Detroit and killed at least 424. For most people, the virus cases mild or moderate symptoms, but it can cause more severe illness and death in some, especially older adults and people with existing health problems.\nWith people out of work and non-essential businesses shuttered, the city faces financial losses from income and sales taxes and fees. Detroit also expects to lose about $184 million in casino wagering taxes.\nThe city will make up 80% of the shortfall through budget surpluses, money in a rainy-day fund, blight removal funds and cutbacks to capital projects. That would leave a $44 million deficit to be made up mostly through layoffs and pay cuts.\nA budget deficit could mean the city again finds itself under control of a state-appointed review commission that oversaw its finances from 2014 until 2018 as part of its exit from bankruptcy. Detroit was released from that oversight only after delivering three years of balanced budgets.\n“If the review commission is put in place, they run the city of Detroit’s life,” Duggan said. “They approve our budgets, our contracts ... none of us ever want to lose self-determination again.”\nDetroit is among dozens, if not hundreds, of cities across the U.S. that are facing financial problems, according to Doug Bernstein, director of business law at the Bloomfield Hills-based Plunkett Cooney law firm.\n“I don’t necessarily single Detroit out as unique, other than the fact its been through it before,” Bernstein said. “Maybe it works — in a perverse kind of way — to the city’s advantage because they’ve lived through it.”\nThe city’s 2013 bankruptcy happened after the state installed an emergency manager. At the time, Detroit had $14 billion in long-term debt, a $327 million budget deficit and bills piling up.\nThe bankruptcy allowed the city to wipe out or restructure about $7 billion in debt. Millions of dollars in annual pension contributions also were pushed back for about a decade. Those are to resume in fiscal year 2024.\nIn recent years, the city has been able to sock away funds. It hoped to have at least $335 million in assets available before the pension payments began to kick in.\n“We expected a downturn and we prepared for it,” Duggan said. “I can’t tell you I expected it to be this sudden and this dire, but we are far more prepared than this city was before.”\nThe creation of a rainy-day fund prompted the credit rating agency Moody’s in February to upgrade Detroit’s debt from “stable” to “positive.” That rating applies to $135 million of general obligation debt and still is three notches below investment grade.\nBut the severity and duration of the coronavirus pandemic could have a longer-term impact on the city’s credit.\n“Detroit’s revenue structure is significantly exposed to economic downturns because gambling and income taxes comprise two of the two largest revenue sources,” David Levett, Moody’s lead analyst for Detroit, said last week. “That said, the city’s fiscal 2019 audit, which was released in December 2019, showed that the city has an improved capacity to respond to stresses.”", "url": "https://apnews.com/7ba406d43e6cc02a5f16d336483ff76f"}