{"authors": ["Manveena Suri"], "date_download": "2020-05-04 16:12:51", "date_modify": "2020-05-04 16:12:51", "date_publish": "2020-04-03 08:39:30", "description": "Indian Prime Minister Narendra Modi praised citizens for their resilience in a televised speech Friday, as the nation entered its tenth day of a three week long lockdown intended to curb the spread of the coronavirus.", "filename": "2020_04_03_asia_coronavirus-india-modi-speech-dp-hnk-intl_index_1588608771.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403073418-india-coronavirus-queue-rations-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_asia_coronavirus-india-modi-speech-dp-hnk-intl_index_1588608771.html", "title": "Narendra Modi praises the Indian public amid nationwide Covid-19 lockdown", "title_page": "Narendra Modi praises the Indian public amid nationwide Covid-19 lockdown  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New Delhi (CNN) Indian Prime Minister Narendra Modi praised citizens for their resilience in a televised speech Friday, as the nation entered its tenth day of a three week long lockdown intended to curb the spread of the coronavirus.\n\"The discipline and spirit of service you have displayed during this period is unprecedented,\" said Modi of the difficulties faced by many during the unprecedented country-wide restrictions.\n\"Today, when millions of people are inside their homes, some of us might wonder how will they fight this battle against coronavirus alone ... But please remember, none of us are alone. The strength of 1.3 billion Indians is with and every one of us,\" the Prime Minister added.\nModi asked the public to switch off all lights and stand on balconies for nine minutes on Sunday, April 5 with lit candles, diya (small oil lamps), torches or cell phone flashlights to show solidarity and the strength of the public in the fight against coronavirus.\n\"This is to show that we are not alone, all 1.3 billion people of India stand together,\" Modi said.\nRead More", "url": "https://www.cnn.com/2020/04/03/asia/coronavirus-india-modi-speech-dp-hnk-intl/index.html"}