{"authors": ["Guest Writer"], "date_download": "2020-05-04 20:13:11", "date_modify": "2020-05-04 20:13:11", "date_publish": "2020-04-30 13:00:07", "description": "As a work-from-home mom, I didn’t expect to feel like I have more opportunities during the coronavirus crisis, but I do.", "filename": "entry_accessibility-covid-19-pandemic_n_5ea6e11dc5b6a30004e57bc3_1588623191.html", "image_url": "https://img.huffingtonpost.com/asset/5ea84bf62500004c10eb07db.jpeg?cache=m8oxwtf1li&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_accessibility-covid-19-pandemic_n_5ea6e11dc5b6a30004e57bc3_1588623191.html", "title": "Once The Pandemic Is Over, Can We Keep The World This Accessible?", "title_page": "Once The Pandemic Is Over, Can We Keep The World This Accessible? | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Over the past decade, I’ve created a career for myself built on autonomy, flexibility and the power to drop my laptop into my backpack and work from anywhere. (Poolside always felt like a win.) I fancied myself a digital nomad. But everything got slower and simpler and much closer to home once I became a mother 18 months ago. The benefits of working from anywhere gave way to the benefits of working from home — a surprising next-chapter byproduct that I felt equal parts grateful for and challenged by.\nSo when it became clear that the best way to slow the spread of COVID-19 was to stay in our homes, only venturing outside to get takeout or groceries, it sounded intense but possible.\nIt reminded me of those first few months of having a baby, when my world went from expansive and far-reaching to the diameter of my 1,800-square-foot home. Hibernating with my newborn was a jarring change for me, an extrovert who enjoyed the perks of living close to the nation’s capital. After all, I moved to the D.C. metro area to enjoy meeting clients at coffee shops in Chinatown, regularly checking in on the art at the National Portrait Gallery, and gathering with throngs at the Kennedy Center to see live performances.\nBut the reality of having a baby and suddenly being responsible for the life of another human meant that my 40-minute drive to Georgetown might as well have been four hours. Between feedings and nap schedules, I couldn’t leave the house for more than 90 minutes at a time even with baby in tow. And if I did plan ahead and hire help to watch the baby while I attended an event downtown, I was paying $60-$75 just for the travel time to get to the event — not to mention the cost of the time I’d actually be there enjoying it.\nAs a first-time mom with many new line items on the budget, there was hardly space for both diapers and babysitting.\nSo I missed out a lot. I asked for phone calls with clients instead of working lunches. I listened to podcasts instead of attending breakfast lectures. I skipped the annual writing conference. Concerts and plays came and went without me.\nBy my daughter’s first birthday, I had begun to head back out into the world more. I traveled several times to speak at conferences. I joined a co-working space, a local gym and a church. I left my home at least every few days. My pace was still incomparably slower compared to pre-baby life, but I was getting out with greater regularity.\nStill, this was only possible with meticulous planning. My husband and I tag-teamed schedules. I asked my parents to come for a long weekend months in advance and scheduled babysitters sometimes six or more weeks ahead of time. Every face-to-face interaction I got to enjoy happened because of layers of foresight, planning and budgeting.\nThen social distancing became our new normal. As nonessential businesses shuttered, everyone began working from home (that is, the lucky ones who remained employed in jobs that could be done from home). All of a sudden, nobody was having working lunches. All my colleagues were staring at laptop screens and waving at webcams. The ground had been leveled.\nI began receiving invitations to live-streamed lectures. John Legend gave a concert on Instagram. Birthday cocktails happened over Zoom. Conferences moved online. The kind of events I had previously had to move mountains for were now popping up online. I had a veritable smorgasbord of lectures, workshops and other events to attend from my own home. How was I busier during quarantine than I was pre-quarantine?\nIn a strange and unexpected way, the world has opened up to me now that the world is closed. I have greater access to professional development and connection with others now that everyone is sequestered in their own homes. The events I had to miss because I was committed to a consistent bedtime for my 1-year-old or really couldn’t swing another $150 babysitting bill are now available to me. Everything is just a click away.\nIt feels like a relief to no longer be the oddball with the random sound of a baby toy humming in the background of my conference call. It turns out the sight of someone’s cat walking across the keyboard is endearing, not unprofessional. The sheer number of things to do online borders on the overwhelming, but I much prefer feeling overwhelmed by choice than being forgotten.\nNothing beats an in-person experience. And I predict that when we can all confidently congregate again, we will, and we won’t take that moment for granted. But can we also remember that there are people who simply can’t make the trek? Let’s not let the accessibility of this moment be temporary.\nThere are plenty of reasons people can’t attend events in person: lack of time, lack of support, finances, physical needs, obvious and invisible obstacles. Some people can’t be in the room for reasons that are out of their hands. They have a disability. They don’t have transportation. They only have an hour and a half between feeding the baby and putting the baby down for a nap.\nThe disability community has been singing this song for years. Many people are understandably irritated that once accessibility became an “everybody” issue and not a “segment of the population” issue, accommodations previously deemed “impossible” became widespread and available. Education moved online. Doctors met with patients via phone. Therapists could do videoconferencing and remain HIPAA compliant.\nI didn’t expect to feel like I’d have more opportunities once we were all sheltering in place due to a global pandemic, but I do. So when this surreal nightmare of social distancing is over ― and thankfully, it will end ― can we remember the folks who are now feeling included for the first time? Can we make special live events streamable for a discounted rate? Can we remember to flip on our webcams at meetings, hop onto Facebook Live and give people the opportunity to experience events like we all can right now?\nLet’s use this moment to recognize how remarkably accessible our world can really be.\nDo you have a compelling personal story you’d like to see published on HuffPost? Find out what we’re looking for here and send us a pitch!", "url": "https://www.huffpost.com/entry/accessibility-covid-19-pandemic_n_5ea6e11dc5b6a30004e57bc3"}