{"authors": ["Majlie De Puy Kamp", "Curt Devine", "Drew Griffin", "Cnn Investigates"], "date_download": "2020-05-04 16:17:39", "date_modify": "2020-05-04 16:17:39", "date_publish": "2020-04-03 23:36:47", "description": "With the peak of Covid-19 infections still ahead and medical supplies still scarce, hospitals and physicians are gearing up for a nearly impossible question: who gets a life-saving ventilator.", "filename": "2020_04_03_health_coronavir_ab1e56deee9a9ba1eb73ee810f68323e_index_1588609059.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403005446-new-york-hospital-cardiac-arrest-patients-memo-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_health_coronavir_ab1e56deee9a9ba1eb73ee810f68323e_index_1588609059.html", "title": "As coronavirus cases grow, hospitals adopt a system to rank patients for treatment", "title_page": "As coronavirus cases grow, hospitals adopt a system to rank patients for treatment - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) With the peak of Covid-19 infections still ahead and medical supplies still scarce, hospitals and physicians are gearing up for a nearly impossible challenge: deciding who gets a life-saving ventilator and who doesn't.\n\"Physicians who work in parts of the world that don't have adequate resources have had to make decisions like this maybe even on a routine basis, but physicians in the United States have never faced anything like this before,\" said Dr. Robert Truog, director of the Center for Bioethics at Harvard Medical School . \"It is going to be extremely difficult.\"\nIf the current rate of hospitalization and intubation continues in New York, \"we have about six days\" left of ventilators in the stockpile, Gov. Andrew Cuomo said during Thursday's coronavirus briefing.\n\"If a person comes in and needs a ventilator and you don't have a ventilator, the person dies. That's the blunt equation here,\" Cuomo said.\nRobert Truog, director of the Center for Bioethics at Harvard Medical School, says American doctors may face new ethical challenges in trying to triage limited ventilators for Covid-19 patients.\nThe demand for ventilators has skyrocketed in intensive care units across the country as coronavirus patients have flooded in. Typically, adult patients will stay in the ICU -- and on a ventilator -- for only three to four days, as one Connecticut doctor explained , but Covid-19 patients need them for up to two or three weeks, dramatically increasing demand.\nTruog said he worked all weekend helping hospitals develop policies that determine who receives intensive care during a public health emergency. One of the better frameworks to follow, he said, is one developed by Dr. Douglas White, a professor of critical care medicine at the University of Pittsburgh and the University of Pittsburgh Medical Center (UMPC).\nWhite said he began to develop his framework more than a decade ago during the avian influenza epidemic.\nIt is essentially a point system calculating a patient's likelihood to benefit from ICU care, based on two considerations: 1) saving the most lives and 2) saving the most life-years.\nThe lower the patient scores, the higher their prioritization for care. In the system's eight-point scale, the first four points illustrate the patient's likelihood to survive hospitalization, and the last four points assess whether, assuming they survive hospitalization, they have medical conditions associated with a life expectancy of less than one year or less than five years.\nDr. Douglas White, professor of critical care medicine at the University of Pittsburgh, developed the basis for many hospitals' guidelines on how to prioritize coronavirus patients.\nIn the event of a tie, White's framework directs doctors to consider life cycle, with priority being given to younger patients.\n\"These are inevitably tragic choices with only bad options,\" White said. \"But the only thing worse than developing a clear allocation framework is not developing one, because then decisions made during a crisis will be biased and arbitrary.\"\nWhite said that his framework is meant to be inclusive and nondiscriminatory against people with disabilities.\n\"It is critical to make clear that stereotypical judgments about quality of life have no role in these decisions, and no one is disqualified from treatment because of disabilities,\" White said.\nIn 2007, White said he reviewed the existing recommendations for the allocation of critical care resources and realized those recommendations were often based on \"exclusion criteria,\" which simply barred access to critical care for large groups of people during a public health crisis.\n\"Advanced age, severe cognitive impairment and chronic heart and lung diseases were all used as exclusion criteria. That didn't seem ethical to me. Exclusion criteria send the wrong message that there are some lives that are not worth saving,\" White said.\nThis could lead to a perception of unfairness, he has said, during a public health emergency where trust is essential. By contrast, the framework White and his team developed ensures no one is disqualified from critical care from the outset.\n\"Everyone who is normally eligible for intensive care remains eligible in a public health emergency,\" White said.\nSeveral hundred hospitals around the country have adopted White's framework, he said. The first set of hospitals, including Johns Hopkins and Medstar, came on board after a 2009 article on the system , White said.\nBut since early March this year, his email has been flooded by hospitals' requests for guidance. UPMC confirmed that its 40 hospitals have since adopted the framework, and White said the state of Pennsylvania has implemented interim guidance to public hospitals based on his framework as well. Pennsylvania's Department of Health would not give details on the basis for their interim guidelines but said they intend to publish final guidelines soon.\nAs hospitals across the country try to figure out how they would ration insufficient supplies in an emergency -- with their discussions sometimes causing public outrage, as when a proposed letter to patients in the Henry Ford Health System leaked last week -- some states' guidelines have until recently excluded certain types of people from critical care under those conditions.\nAlabama's 2010 Emergency Operations Plan , for example, states that \"persons with severe or profound mental retardation\" and \"moderate to severe dementia\" are \"unlikely candidates for ventilator support.\"\nThose guidelines were updated in February 2020 , but the new guidance makes no mention of how to triage patients in the event of ventilator shortages. The Alabama Department of Public Health did not confirm whether exclusion criteria are still being used.\nIn a 2014 document, Indiana similarly listed exclusion criteria for ventilators during a respiratory disease pandemic, including severe burns or being dependent on dialysis. The state told a CNN reporter that these are \"not part of our current response plan\" and sent a link to a new plan . Like Alabama's, it lacks guidance on how to triage patients for access to ventilators.\nThat is hardly a solution, White said after reviewing the new Alabama guidelines.\n\"So their crisis standard of care guidance now basically provides no guidance to doctors about what to do in the face of ventilator shortages, which of course introduces its own thicket of problems around variability and bias,\" White wrote in an email.\nTwo other states, Tennessee and Kansas, had guidelines that excluded some people from care in the event of a pandemic emergency, but pulled the guides offline on Friday after a CNN reporter inquired about them.\nA Tennessee list of exclusion criteria finalized in 2016 included patients with traumatic brain injuries, severe burns, severe dementia, ALS and end-stage MS; the state says it is not planning to replace the 2016 guidelines. Kansas removed a document on public health emergencies , including exclusion criteria, that was last revised in 2013.\n\"The document you're referencing is an old one not intended for COVID-19 response. We are working to update our guidelines,\" a Department of Health spokesperson wrote.\nAt Harvard, Truog, who supports White's framework, has recently published articles in the New England Journal of Medicine and the Boston Globe to help prepare hospitals, doctors and the public for the decisions and outcomes he thinks they could be facing soon.\nThat kind of forethought by specialists is important, White has argued, so that doctors facing a pandemic don't have to struggle with such dire ethical questions case by case. White believes that triage committees should be created of non-frontline doctors, to \"enhance objectivity, avoid conflicts of commitments, and minimize moral distress.\"\nDr. Ira Byock, a palliative care physician in Los Angeles and founder of the Institute for Human Caring based at Providence TrinityCare Hospice in California, said that the usual clinical ethics for doctors change during a public health crisis.\n\"For the first time in our experience, we have to balance the well-being of the community with the well-being of individual patients, which is usually our sole focus,\" Byock said.\nBut even with the ethical guidance that a framework like White's provides, Truog said, that responsibility means the road ahead for American doctors will not be easy.\n\"It could very well be the case that in the next few days physicians are going to have to make decisions that they never even contemplated before, and the emotional toll for some is going to be absolutely disabling,\" Truog said.", "url": "https://www.cnn.com/2020/04/03/health/coronavirus-hospital-ethics-ventilators-invs/index.html"}