{"authors": ["Reporter"], "date_download": "2020-05-04 20:26:02", "date_modify": "2020-05-04 20:26:02", "date_publish": "2020-04-28 19:49:20", "description": "\"It’s disrespectful to the essential workers who need to ride the subway system,\" said the governor, referring to an article about homeless people in tra...", "filename": "entry_cuomo-homeless-subway-disgusting-disrespectful_n_5ea8713bc5b62271082f92f8_1588623962.html", "image_url": "https://img.huffingtonpost.com/asset/5ea878852200008f0c827cfc.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_cuomo-homeless-subway-disgusting-disrespectful_n_5ea8713bc5b62271082f92f8_1588623962.html", "title": "Andrew Cuomo Calls Homeless On Subway Cars 'Disgusting' And 'Disrespectful'", "title_page": "Andrew Cuomo Calls Homeless On Subway Cars 'Disgusting' And 'Disrespectful' | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "New York Gov. Andrew Cuomo (D) called the sight of homeless people sleeping on New York City subway cars “disgusting” on Tuesday, claiming they were putting essential workers at risk.\nCuomo held up a copy of the New York Daily News, which features a cover story about homeless people seeking refuge on the train cars amid the coronavirus pandemic, during his daily press briefing.\n“The front page is a picture of a subway car filled with homeless people and their belongings,” the governor said. “Respect the essential workers. That is disgusting, what is happening on those subway cars. It’s disrespectful to the essential workers who need to ride the subway system.”\nHis words stood in stark contrast to those of transit leaders, who acknowledge there have been problems with homeless people on the trains but have urged compassionate action.\n“The city has failed our most vulnerable who are in desperate need of mental health care and housing services,” interim NYC Transit President Sarah Feinberg told The Daily News for the story Cuomo highlighted. “NYC Transit will continue to do everything in our power to address this important issue, including working closely with all partners, but it is outrageous that a transportation agency is conducting social services in place of the city.”\nStefani Reynolds via Getty Images New York Gov. Andrew Cuomo holding up an article about problems with homeless people riding the subway.\nIncidents outlined in that article include a homeless passenger covered in human waste and a homeless rider lighting pieces of cardboard on fire. Some transit operators and riders have reported a spike in homeless people sleeping on subway cars.\nCuomo also called for better solutions for homeless people seeking protection from the coronavirus.\n“It’s not even safe for the homeless people to be on trains,” he said Tuesday. “No face masks, you have this whole outbreak, we’re concerned about homeless people, so we let them stay on the trains without protection in this epidemic of the COVID virus? No. We have to do better than that, and we will.”\nHowever, he did not outline any plans.\nNew York City Mayor Bill de Blasio vowed Monday that the city would increase homeless outreach work at subway stations, provide an additional 200 shelter beds and close some stations at night to conduct an “enhanced sanitization” of subway cars.\nMTA chief communications officer Abbey Collins said the department was disappointed it has taken such dire circumstances to help homeless people who seek shelter on trains.\n“We’re relieved on behalf of our customers and employees that the City has agreed to do more to provide safe shelter for homeless New Yorkers,” she said in a statement, “but it should not have taken a global pandemic for the City to do a job the MTA has called on it to do for years.”", "url": "https://www.huffpost.com/entry/cuomo-homeless-subway-disgusting-disrespectful_n_5ea8713bc5b62271082f92f8"}