{"authors": [], "date_download": "2020-05-04 20:09:51", "date_modify": "2020-05-04 20:09:51", "date_publish": "2020-04-09 13:33:53", "description": "CHICAGO (AP) — A funeral for the first Chicago Police officer to die from complications of the coronavirus on Thursday looked unlike any funeral for a city officer in memory. To protect...", "filename": "_e82280413f94641d7e50dd4462d65300_1588622991.html", "image_url": "https://storage.googleapis.com/afs-prod/media/3a84b93a05a449e5a5b8cd06dedc07f8/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e82280413f94641d7e50dd4462d65300_1588622991.html", "title": "Coronavirus prompts new funeral protocol for Chicago officer", "title_page": "Coronavirus prompts new funeral protocol for Chicago officer", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Teresa Di Rosa hugs her husband, Rosario, and their 12-year-old son Nico, close friends of Chicago Police Officer Marco DiFranco who had to stand outside during the funeral amid fears of the coronavirus pandemic, as the hearse leaves Cumberland Funeral Chapels, Thursday, April 9, 2020 in Norridge, Ill. DiFranco, 50, died April 2 from complications due to COVID-19, making him the first Chicago police officer to lose his life to the coronavirus. (Ashlee Rezin Garcia/Chicago Sun-Times via AP)\nTeresa Di Rosa hugs her husband, Rosario, and their 12-year-old son Nico, close friends of Chicago Police Officer Marco DiFranco who had to stand outside during the funeral amid fears of the coronavirus pandemic, as the hearse leaves Cumberland Funeral Chapels, Thursday, April 9, 2020 in Norridge, Ill. DiFranco, 50, died April 2 from complications due to COVID-19, making him the first Chicago police officer to lose his life to the coronavirus. (Ashlee Rezin Garcia/Chicago Sun-Times via AP)\nCHICAGO (AP) — A funeral for the first Chicago Police officer to die from complications of the coronavirus on Thursday looked unlike any funeral for a city officer in memory.\nTo protect Marco DiFranco’s fellow officers and other mourners from the virus that causes COVID-19, there was no crowded church, no streets lined with officers and respectful onlookers and no packed cemetery — a show of respect that has for generations comforted the families of fallen officers.\nFor DiFranco, whose death was determined to be in the line-of-duty by Interim Police Superintendent Charlie Beck, there was instead a private service at a funeral home attended only by family. Then, the funeral procession took the officer’s remains to All Saints Catholic Cemetery in Des Plaines.\nPeople who did stand along the route to pay their respects wore protective masks, as did the few uniformed police officers who stood at attention just outside the cemetery gates as the procession drove to the cemetery\nDozens of squad cars from several law enforcement agencies lined the street outside the funeral home and escorted the hearse to the cemetery, but the officers driving the vehicles did not get out and did not drive into the cemetery.\nThe department’s mounted unit escorted the casket from the hearse to the grave site for a service attended only by the family and the department’s command staff.\nThe 50-year-old DiFranco, a decorated undercover narcotics officer died last week. He is survived by his wife and two children.", "url": "https://apnews.com/e82280413f94641d7e50dd4462d65300"}