{"authors": ["Reporter"], "date_download": "2020-05-04 20:13:22", "date_modify": "2020-05-04 20:13:22", "date_publish": "2020-04-29 14:03:33", "description": "George Conway's Lincoln Project calls out the president's daily doses of “dangerous and ill-informed nonsense\" with its latest attack ad.", "filename": "entry_the-lincoln-project-video-trump-dystopian-spin_n_5ea96d79c5b6106b8ed03db7_1588623202.html", "image_url": "https://img.huffingtonpost.com/asset/5ea973412200008f0c827daa.jpeg?cache=h0mtmi7uh4&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_the-lincoln-project-video-trump-dystopian-spin_n_5ea96d79c5b6106b8ed03db7_1588623202.html", "title": "GOP Group Highlights Donald Trump's Dystopian Coronavirus Response", "title_page": "GOP Group Highlights Donald Trump's Dystopian Coronavirus Response | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "President Donald Trump’s ongoing attempt to rewrite his widely panned response to the coronavirus pandemic is the focus of a Republican group’s new attack ad.\nTrump rates his handling of the crisis as a “10,” boasts about the high TV ratings of daily coronavirus task force briefings and claims to have been “right a lot” in the video ― titled “Dystopia” ― that the anti-Trump Lincoln Project released online Tuesday.\nCheck it out here:\n“Americans need a president upon whom they can rely on for factual information regarding the state of the nation,” the group captioned the 30-second clip. It called out Trump for delivering daily doses of “dangerous and ill-informed nonsense.”\nTrump last week pondered injecting disinfectant as a possible cure for COVID-19, the disease caused by the virus. He later claimed he was just being sarcastic.\nLincoln Project founder George Conway, who is married to White House counselor Kellyanne Conway, has since helped the mocking nickname “President Pine-Sol” trend worldwide on Twitter:\nSo is President Pine-Sol going to hold another press briefing tomorrow? — George Conway, Noble Committee Chair (@gtconway3d) April 28, 2020\nPresident Pine-Sol woke up feeling unloved. https://t.co/Ldlj6zu9Rg — George Conway, Noble Committee Chair (@gtconway3d) April 28, 2020", "url": "https://www.huffpost.com/entry/the-lincoln-project-video-trump-dystopian-spin_n_5ea96d79c5b6106b8ed03db7"}