{"authors": ["David Williams"], "date_download": "2020-05-04 16:24:21", "date_modify": "2020-05-04 16:24:21", "date_publish": "2020-04-06 21:12:12", "description": "Carlos Rolon had been on the transplant list for four years, and now the 6-year-old has got a new heart.", "filename": "2020_04_06_health_six-year-old-gets-heart-transplant-trnd_index_1588609461.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406132739-01-six-year-old-heart-transplant-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_health_six-year-old-gets-heart-transplant-trnd_index_1588609461.html", "title": "A 6-year-old boy got a new heart after 4 years on the transplant list", "title_page": "A 6-year-old boy got a new heart after 4 years on the transplant list - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Carlos Rolon had been on the transplant list for four years, and now the 6-year-old has got a new heart.\n\"He's doing great. They said he's doing amazing,\" his mom, Sheena Cossette, told CNN.\nCarlos is still in intensive care at Boston Children's Hospital after Friday's surgery, but Cossette said they hope to be able to remove his breathing tube in the next day or so.\nThe boy came out of surgery before midnight, and his mom said she could see a difference right away.\n\"My first reaction was his color,\" because his skin had a bluish-gray tone before the surgery. \"When I looked at him, his color was amazing,\" she said.\nCossette said his breathing seemed much smoother and his oxygen levels were at 100%.\n\"That's when I knew it was real,\" she said.\nCarlos was born with an abnormality in his heart chambers called unbalanced atrioventricular canal defect , and had four open heart surgeries before he was 2 years old, his mom said.\nHe went on the transplant list in 2016, but he was still able to have a pretty normal life in Worcester, Massachusetts, and was even able to go to school.\nCarlos got sicker last year and has been at Boston's Children's since August 31.\nCossette talked to Carlos' primary doctor on Thursday because she was afraid that the coronavirus pandemic might delay him getting a transplant.\n\"A few hours later, he came up and told me he had one,\" she said. \"And I think that was the biggest shock for me like, wow, it almost was so unreal.\"\nCossette and Carlos' father, who's name is also Carlos, aren't together but have been taking turns staying with him at the hospital.\nThe doctor came with the news just a few minutes before his dad arrived.\nBoth young Carlos and the donor had to be tested for Covid-19 before the transplant could go forward. CNN has reached out to the hospital, but has not been able to get any information about the donor.\nCossette said they waited until the tests came back negative to tell their son the news\nCarlos Rolon sits with his dad Carlos before going into surgery on Friday.\n\"His face lit up,\" she said and he asked if that meant he'd be able to go home. \"His biggest thing these last few weeks is he wants to go home. He misses his family. We are very big family and very family-orientated,\" she said. \"And I said 'yes, after you get your new heart, you get to go home.\"\nShe said he might be able to go home in two or three weeks.\nThey won't be able to have that big family reunion right away, Cossette said, to protect him from coronavirus.\n\"We're going to quarantine when we go home. Yes, absolutely, because he has no immune system his immune system was suppressed and the biggest fear factor right after transplant is rejection,\" she said.\nCossette said she is grateful to the donor's family for giving Carlos a new chance at life.", "url": "https://www.cnn.com/2020/04/06/health/six-year-old-gets-heart-transplant-trnd/index.html"}