{"authors": ["Maryclaire Dale"], "date_download": "2020-05-04 20:22:55", "date_modify": "2020-05-04 20:22:55", "date_publish": "2020-04-20 12:57:03", "description": "Sent home from college because of the coronavirus outbreak, Carter Oselett is back in his childhood bedroom, paying rent on an empty apartment near campus and occasionally fighting with his...", "filename": "_7918ec3beca5db8ca0e93f8de227a768_1588623775.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8368a2a95477494db70b7206e4627287/831.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7918ec3beca5db8ca0e93f8de227a768_1588623775.html", "title": "College seniors face job worries, family stress amid virus", "title_page": "College seniors face job worries, family stress amid virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this April 6, 2020 photo, Victoria Arevalo poses for a selfie at her home in Los Angeles. Arevalo is back at home after she gave up her apartment near Loyola Marymount University due to the coronavirus pandemic. In the blink of an eye, Arevalo lost her emotional \"safe space,\" her paid TV news internship and her final months with college friends. (Victoria Arevalo via AP)\nIn this April 6, 2020 photo, Victoria Arevalo poses for a selfie at her home in Los Angeles. Arevalo is back at home after she gave up her apartment near Loyola Marymount University due to the coronavirus pandemic. In the blink of an eye, Arevalo lost her emotional \"safe space,\" her paid TV news internship and her final months with college friends. (Victoria Arevalo via AP)\nSent home from college because of the coronavirus outbreak, Carter Oselett is back in his childhood bedroom, paying rent on an empty apartment near campus and occasionally fighting with his parents over the television remote.\nHe’s handling the grocery shopping for an aunt recovering from COVID-19 and watching his mom, an optician, try to file for unemployment benefits.\nHis summer program at a university in Brazil has been canceled and he’s not sure he will graduate from Michigan State University in December as planned. And to top it off, he turned 21 quarantined at home with his folks.\n“So much fun,” Oselett said dryly from his family home in Macomb, about 100 miles (160 kilometers) from his East Lansing campus. “I got to buy a bottle of wine from our local grocer, and that was my big night.”\nFor many of the nearly 2 million people expected to earn U.S. bachelor’s degrees in 2020, the pandemic has taken away their housing, friends and long-held dreams of a graduation ceremony. Some college seniors have been jolted into instant “adulting” as they try to support themselves or struggling family members. For others, it’s adulthood delayed, as their post-college work, travel or internship plans are nixed for a dispiriting move back home.\nAnd nearly all of them fear their first steps into adulthood will be clouded by a global recession.\nUniversity of Iowa psychologist Barry Schreier advises students to hold on to their goals, even if they have to adjust their timelines. And he says they should expect to cycle through the stages of grief: denial, anger and depression among them.\n“Adulting is a ladder to climb for a lot of our students on a good day. And these are certainly not good days,” said Schreier, communications chairman of the Association for University and College Counseling Center Directors.\nAxel Lopez, a senior at the University of California, Los Angeles, and sports photographer at The Daily Bruin, hoped to take a last walk through the newsroom before moving to Utah this summer for a paralegal job. He’s now quarantined in his off-campus apartment, taking his final term online. The expected job offer never came.\n“It’s a very uncertain time, considering just a couple of months ago, it seemed there was a surplus of jobs available,” he said.\nA first-generation college student who accompanied his mother growing up as she cleaned houses in Los Angeles, Lopez had dreams of hugging his mom at graduation and telling her: “Yeah, it was all worth it.”\nUCLA announced its June commencement would be held online, then reconsidered after a backlash. The university has promised to hold an in-person celebration later.\n“Even though we’re going to have it in the next year, I feel it won’t be the same,” he said.\nNot far from Lopez, Victoria Arévalo is back in her family’s small two-bedroom apartment in west Los Angeles, where the bunk beds she shares with an older sister frame her appearance in online classes. She had hoped to stay at her apartment at nearby Loyola Marymount University, where she’s studying communications, but knew her family needed the refund she’d get if she left — her stepfather was furloughed from his warehouse job.\nIn the blink of an eye, Arévalo lost her emotional “safe space,” her paid TV news internship and her final months with college friends. At first, she lashed out on social media. But after a few weeks back home, she’s come to accept the situation and the tough road ahead.\n“I know it’s going to be a lot harder than it would have been. I’m just trying mentally to prepare myself,” said Arévalo, 22, who moved to the U.S. from El Salvador as a child. “There’s good days and bad days. It fluctuates.”\nFor health sciences major Anali Reyes Vazquez, the sweeping turmoil has brought setbacks — her parents are out of work — but also a glimmer of opportunity.\nThe 21-year-old senior at Rutgers University in Camden, New Jersey, planned to find a job and start a part-time master’s degree program come June. Now, she’s holding off on signing a new lease in case she needs to move home to New Brunswick.\nOne of her final classes, though, is a course on medical translating, which could help her land a position amid the pandemic serving Spanish-speaking patients.\n“There are people in need,” she said, “even though it is a scary thought.”\nBack in Michigan, Oselett finds his bedroom “a little smaller than I remember it.”\nHe spends some of his time working for a California-based nonprofit called Rise, pairing college students who are in crisis because of campus shutdowns with emergency funding.\nFull Coverage: Life\nHis classes, which have switched to pass/fail grading, involve a mix of posted assignments and videoconferencing.\n“Everyone has sort of adapted to it, but it just doesn’t feel as worthwhile,” Oselett said. “No one wants to worry about learning right now.”\nOther times, he and his parents squabble over what to watch on television. He and his father like “Schitt’s Creek.” His mother not so much.\n“We almost have too much time to watch TV and argue about it,” he said.\n___ Dale reported from Philadelphia.", "url": "https://apnews.com/7918ec3beca5db8ca0e93f8de227a768"}