{"authors": [], "date_download": "2020-05-04 16:54:38", "date_modify": "2020-05-04 16:54:38", "date_publish": "2020-04-03 18:22:17", "description": null, "filename": "2020_04_03_cnn-underscored_best-hand-cream-outbrain-2_index_1588611278.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200312093333-handcreamlead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored_best-hand-cream-outbrain-2_index_1588611278.html", "title": "The best hand creams, according to dermatologists", "title_page": "The best hand creams, according to dermatologists  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "The spread of coronavirus across the globe means that a lot of us are spending more time washing our hands, using stronger soaps and hand sanitizer, and adding more cleaning products into the mix.\nWhat's that mean for our hands? Well, they may be extra dry and flaky as a result. And it's still technically winter, which doesn't help skin that is yearning for moisture and hydration either.\nTo figure out the best treatments, we went to the experts and spoke with dermatologists about very best hand creams to soothe and moisturize your hands. Whether you're already a hand cream addict, or this whole regular moisturizing thing is brand new territory, our experts have you covered.\nKey ingredients to look for\nMoisturizers for the hands, like moisturizers for other areas, ideally contain three components: humectants, emollients and occlusives, explains Dr. Hadley King, a New York City-based dermatologist. \"Ceramides and filaggrin are the building block proteins for locking moisture in and keeping the outside environment out,\" says Dr. Caren Campbell, a San Francisco-based dermatologist.\nEltaMD So Silky Hand Crème ($19; amazon.com)\nEltaMD So Silky Hand Crème\nKing shared this favorite, saying, \"The formula combines ceramides, emollients and vitamin E to nourish dry skin, and sclareolide, a plant-derived ingredient that helps to lighten dark spots.\"\n_______________________________________________________________________________\nEau Thermale Avène Cold Cream Concentrated Hand Cream ($15; amazon.com)\nEau Thermale Avène Cold Cream Concentrated Hand Cream\nKing says she's a big fan because this cream is \"fast-absorbing and paraben free.\" She also said, \"Their studies showed that it lasts through five hand washings,\" which is the energy we need from a hand cream right now.\n_______________________________________________________________________________\nCetaphil Pro Eczema Soothing Moisturizer ($12.99, originally $15.99; amazon.com)\nCetaphil Pro Eczema Soothing Moisturizer\n\"This is a great lotion for many patients, particularly those with normal to dry skin,\" says Campbell.\n_______________________________________________________________________________\nCreams over lotions\nAnother tip: You're usually better off with a cream than a lotion. \"Creams are always best for those with extra dry skin over lotions, as they contain more of the moisturizing ingredients and less water,\" says Campbell. \"Lotions contain more water than creams.\" And remember, she says, \"White cotton gloves can also be worn at night to help keep lotions and creams on the hands and prevent them from rubbing off.\"\nSupergoop! Forever Young Hand Cream with Sea Buckthorn ($14; amazon.com)\nSupergoop! Forever Young Hand Cream with Sea Buckthorn\nThis anti-aging cream is one of King's favorites. \"It combines sea buckthorn fruit to lighten dark spots and argan and meadowfoam seed oils to hydrate and moisturize without feeling greasy,\" she says. \"And the SPF 40 protects your exposed skin from UV damage.\"\n_______________________________________________________________________________\nSoap & Glory Hand Food ($6.99; target.com)\nSoap & Glory Hand Food\nThis best-selling Target fave can soothe dry hands with shea butter and macadamia oil. While it's packaged in a tube, it feels like it was scooped from a tub of butter.\n_______________________________________________________________________________\nL'Occitane Shea Butter Intensive Hand Balm ($36; loccitane.com)\nL'Occitane Shea Butter Intensive Hand Balm\nThis luxurious balm melts into hands and nails when it's massaged in and is packed with a shea butter formulation that promises to nurture and protect dry, damaged skin.\n_______________________________________________________________________________\nThe secret ingredient for extremely dry skin\n\"A lot of people with dry skin don't realize they also have a problem shedding the dead top layer of skin,\" says Dr. Clarissa Yang, dermatologist-in-chief at Tufts Medical Center. \"So a secret ingredient I always look for is an exfoliating agent like salicylic, glycolic or lactic acid.\"\nAmLactin Daily Moisturizing Body Lotion ($12.97, originally $15.99; amazon.com)\nAmLactin Daily Moisturizing Body Lotion\nThis classic still packs a punch and is a dermatologist fave. \"I recommend this for my patients who need gentle exfoliation and hydration,\" Campbell says.\n_______________________________________________________________________________\nAveeno Daily Moisturizing Yogurt Body Lotion, Pack of 3 ($18.57; amazon.com)\nAveeno Daily Moisturizing Yogurt Body Lotion\nYou'll say \"ahh Aveeno\" when you coat your hands — and probably the rest of your body — with the nutrient-rich yogurt blend, which is blended with lactic acid for exfoliation.\n_______________________________________________________________________________\nCeraVe Moisturizing Cream Daily Face and Body Moisturizer ($17.21; amazon.com)\nCeraVe Moisturizing Cream Daily Face and Body Moisturizer\nThis daily cream \"contains ceramides and hyaluronic acid and is perfect for patients with very dry skin,\" says Campbell.\n_______________________________________________________________________________\nWorking hands\nWhether at home or at a workplace, hands that are getting dirty doing chores or cooking — or just getting dirty — are going to need something extra, like \"barrier ingredients like paraffin to keep moisture locked in,\" says Campbell. Yang likes to see particular occlusives, or moisturizing agents, in the ingredient list, too.\n\"Occlusives are much more oil-based, they help by trapping the water the humectants draw up and preventing it from evaporating,\" says Yang. \"Lanolin, petrolatum and beeswax are common ones.\"\nO'Keeffe's Working Hands Hand Cream Value Size ($11.96; amazon.com)\nO'Keeffe's Working Hands Hand Cream Value Size\nThis has been a moisture barrier builder for working hands for years. Campbell recommends it because \"it contains barrier ingredients like paraffin to keep moisture locked in.\"\n_______________________________________________________________________________\nBurt's Bees Almond & Milk Hand Cream ($8.69; target.com)\nBurt's Bees Almond & Milk Hand Cream\nSweet almond oil and vitamin E work to restore moisture to dry hands, while beeswax locks in moisture.\n_______________________________________________________________________________\nGold Bond Ultimate Intensive Healing Hand Cream ($3.89; amazon.com)\nGold Bond Ultimate Intensive Healing Hand Cream\nThis healing cream offers amazing bang for the buck, using petrolatum to help restore smooth, soft, healthy skin.\n_______________________________________________________________________________\nKiehl's Ultimate Strength Hand Salve ($23; sephora.com)\nKiehl's Ultimate Strength Hand Salve\nThis salve is designed for hard-working hands, and has wax-based properties that form a protective barrier on the skin, leaving the hands feeling soft.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/best-hand-cream-outbrain-2/index.html"}