{"authors": ["Reporter"], "date_download": "2020-05-04 20:28:23", "date_modify": "2020-05-04 20:28:23", "date_publish": "2020-04-30 10:49:27", "description": "The president of the American Federation of Teachers slammed the Trump White House as it released its own blueprint for reopening schools.", "filename": "entry_teachers-union-trump-coronavirus-opening-plan_n_5eaa9df4c5b6ac7c6f381b25_1588624103.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa9ffd250000b711eb09cb.jpeg?cache=4p6sfdisf1&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_teachers-union-trump-coronavirus-opening-plan_n_5eaa9df4c5b6ac7c6f381b25_1588624103.html", "title": "Teachers Union Counters Trump Lies With Coronavirus Road Map", "title_page": "Teachers Union Counters Trump Lies With Coronavirus Road Map | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "The president of the American Federation of Teachers on Wednesday called out the Trump White House’s chaotic response to the coronavirus pandemic ― and its confusing messaging ― as the union laid out its own road map for safely reopening the nation’s schools.\n“Our blueprint serves as a stark contrast to the conflicting guidance, bluster and lies of the Trump administration,” Randi Weingarten, president of the 1.7 million-member AFT, said of its five-stage plan in a statement.\nThe 22-page proposal — titled the “Plan To Safely Reopen America’s Schools and Communities” — is “based on the science as well as educator and health care expertise ― not on politics or wishful thinking,” the union said.\nIt is a “living document” that will be guided and updated “by constantly evolving expert advice,” it added.\nThe plan calls for social distancing measures to be maintained “until the number of new cases declines for at least 14 consecutive days”; the appropriate infrastructure “to test, trace and isolate new cases”; the deployment of public health tools to prevent the further spread of the contagion; the involvement “of workers, unions, parents and communities in all planning”; and the investment in public health and education as “a priority” in the recovery.\nBy drawing on science & the expertise of educators & healthcare practitioners, we have drafted a bold five-point plan to reopen our schools safely. It’s a stark contrast to the conflicting guidance, bluster & lies of the Trump administration #reopensafely https://t.co/TyfdHk7N8d — Randi Weingarten (@rweingarten) April 30, 2020\n“America is staring down a singular challenge that will require all of us to come together and negotiate a safe path forward,” said Weingarten.\n“The input of educators and health care workers, as well as parents, is crucial in making any reopening plan work,” she added. “They are the eyes and ears, and are indispensable in making any plan work safely and effectively. We hope this blueprint will be the start of a real discussion on reopening schools, universities and other workplaces that allows our workers and families not only to dream of a safe and welcoming future, but to realize it.”\nASSOCIATED PRESS The American Federation of Teachers has released its own roadmap to navigate the coronavirus pandemic to counter the Trump administration's \"bluster and lies.\"\nTrump, who has advocated for reopening the economy against the advice of public health officials who fear a second wave of deaths, on Monday suggested states should “seriously consider” reopening public schools.\n“Some of you might start thinking about school openings, because a lot of people are wanting to have the school openings,” the president reportedly told governors in a call.", "url": "https://www.huffpost.com/entry/teachers-union-trump-coronavirus-opening-plan_n_5eaa9df4c5b6ac7c6f381b25"}