{"authors": ["Michelle Toh", "Isaac Yee", "Cnn Business"], "date_download": "2020-05-04 16:12:24", "date_modify": "2020-05-04 16:12:24", "date_publish": "2020-04-03 06:46:51", "description": "Cathay Pacific is used to carrying about 100,000 daily passengers. At one point this week, it flew just 582 customers in a day.", "filename": "2020_04_03_business_cathay-_eef320b3188dfc9a5f106eefba52639e_index_1588608744.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403000501-cathay-pacific-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_business_cathay-_eef320b3188dfc9a5f106eefba52639e_index_1588608744.html", "title": "Cathay Pacific slashes more flights over Covid-19 after flying just 582 people in one day", "title_page": "Cathay Pacific slashes more flights over Covid-19 after flying just 582 people in one day - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Hong Kong (CNN Business) Cathay Pacific ( CPCAY ) is used to carrying about 100,000 daily passengers. At one point this week, it flew just 582 customers in a day.\nThe is the grim reality Hong Kong's flagship airline is facing as the novel coronavirus pandemic worsens, darkening the outlook for the global travel industry and \"intensifying\" financial ramifications for businesses like Cathay, CEO Augustus Tang said Friday.\nHe disclosed the dismal passenger numbers in an internal memo that was shared with CNN Business, announcing that passenger flights would be reduced even further from a \"skeleton schedule\" that was previously announced.\nTwo weeks ago, Cathay Pacific had already slashed 96% of passenger flight capacity for April and May, citing a severe drop in demand as the virus outbreak continued to empty out airports. It also made similar cuts to Cathay Dragon, the company's regional airline, and suspended all flights on its low-cost carrier, Hong Kong Express.\n\"[But] since I last communicated, our passenger fleet has been virtually grounded,\" Tang wrote to staff Friday. \"Remaining demand has disappeared.\"\nThe 582 passengers flown earlier this week represented a 99% drop from Cathay's daily expected average, and a load factor of just 18.3%, the CEO noted. Passenger load factors are an important metric for carriers as they measure an airline's capacity to fill seats and generate revenue.\nCathay says it will now operate only two flights a week in April to four long-haul destinations, including London, Los Angeles, Vancouver and Sydney. It will also aim to maintain three weekly regional flights to eight cities, including Tokyo, Manila and Singapore.\nThe company has not ruled out the possibility of cutting back even further. \"A timeline for a recovery in our customer demand still remains impossible to predict,\" Tang noted.\nThe pandemic has forced the airline industry into one of its worst crises in history. Last week, the International Air Transport Association predicted that carriers could lose up to $252 billion in passenger revenue, down 44% compared to last year and more than double the organization's previous estimate for a \"worst case scenario.\"\nThat's leaving companies like Cathay to double down on cost-cutting measures. Several industry CEOs have already stopped taking salaries , and Tang announced Friday that he and Cathay chairman Patrick Healy would also slash their base salaries by 30%. Additionally, the airline's executive directors will each take a 25% pay cut through December.\nThe airline has also asked its 27,000 staff members, most of whom are based in Hong Kong, to consider taking three weeks off without pay. As of last month, 80% of staff had volunteered for unpaid leave, while furloughs have begun \"for ground employees where flight activity has now ceased,\" according to the company.\nFor now, Cathay is working to stay afloat by maintaining its cargo business, where demand has remained \"strong,\" said Tang.\n\"However, the reduction of capacity on our wide body fleet means our cargo revenues are still well below last year,\" he added.\nCathay shares have plunged almost 30% so far this year. Its stock was down 1.2% in Hong Kong on Friday following the announcement.\n\"We will get through this,\" Tang told employees.\"We will continue to explore every area to ensure the Cathay Group emerges from this unprecedented crisis able to compete vigorously and to help Hong Kong to get back on its feet.\"", "url": "https://www.cnn.com/2020/04/03/business/cathay-pacific-flights-coronavirus-covid-19/index.html"}