{"authors": ["Jenna Fryer"], "date_download": "2020-05-04 20:26:43", "date_modify": "2020-05-04 20:26:43", "date_publish": "2020-04-20 21:41:50", "description": "CHARLOTTE, N.C. (AP) — The virtual racing has been cute and kept everyone entertained but NASCAR needs to get back to the real thing, quickly, for the financial and mental health of the sport....", "filename": "_ee0efc6af53d341e4aa1f8668254b889_1588624003.html", "image_url": "https://storage.googleapis.com/afs-prod/media/1125e27e284d4c6ba2bc2fb3e919605b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ee0efc6af53d341e4aa1f8668254b889_1588624003.html", "title": "In The Pits: NASCAR facing big decision on when to race", "title_page": "In The Pits: NASCAR facing big decision on when to race", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In The Pits: NASCAR facing big decision on when to race\nFILE - In this June 10, 2016, file photo, drivers Dale Earnhardt Jr., left, and Jimmie Johnson talk before qualifying for the NASCAR Sprint Cup series auto race at Michigan International Speedway in Brooklyn, Mich. The mind-boggling success of virtual racing has put motorsports out front in the race to create competition during the sports shutdown caused by the coronavirus pandemic. “All of the race teams are trying everything they can to keep their sponsors and keep their employees,\" said longtime virtual racing fanatic Dale Earnhardt Jr. (AP Photo/Carlos Osorio, File)\nFILE - In this June 10, 2016, file photo, drivers Dale Earnhardt Jr., left, and Jimmie Johnson talk before qualifying for the NASCAR Sprint Cup series auto race at Michigan International Speedway in Brooklyn, Mich. The mind-boggling success of virtual racing has put motorsports out front in the race to create competition during the sports shutdown caused by the coronavirus pandemic. “All of the race teams are trying everything they can to keep their sponsors and keep their employees,\" said longtime virtual racing fanatic Dale Earnhardt Jr. (AP Photo/Carlos Osorio, File)\nCHARLOTTE, N.C. (AP) — The virtual racing has been cute and kept everyone entertained but NASCAR needs to get back to the real thing, quickly, for the financial and mental health of the sport.\nNASCAR — really, almost all levels of professional racing — is not built to withstand a shutdown of any sort. Team owners are on their own to figure out how to pay the bills. If someone wants to race, they find whatever sponsorship they can and try to spread it over the longest season in sports at nearly 11 months.\nNASCAR does have a 10-year, $8.2 billion television deal with Fox and NBC Sports, but the teams get just 25% of that money and the checks come only after a race is completed.\nThere hasn’t been a race since March 8.\nEight events have postponed so far because of the coronavirus pandemic.\nA lot of sponsors are withholding payments until their logos are again shown at the track.\nHere is the desperate truth: Nobody is making any money right now and the longer NASCAR is shuttered, the deeper the financial hit will be for an industry already battling a slew of challenges.\nEvery metric worth caring about has been in nearly a decade-long decline. Team owners bought themselves some security three years ago via charters with NASCAR, but they are sold at market rate. The market, FYI, hasn’t been so great.\nNASCAR has already made pay cuts and a round of staff layoffs. It’s a privately owned company primarily by Jim France and his niece Lesa France Kennedy. The family last October paid $2 billion to swallow its publicly-owned sister company, International Speedway Corp., in a move NASCAR President Steve Phelps has argued proved the France commitment to the 72-year-old stock car series.\nWhat the Frances do and how they choose to spend their money is of no say to the car owners, who must figure out how long they can keep the lights on at the shop without any income. They can exist on borrowed time or they can fold.\nSome team owners are still paying employees, others have issued pay cuts. And some organizations have gone with layoffs and furloughs.\nIn the end, no member of the NASCAR industry will not be affected.\nTeams, primarily based in the greater Charlotte area, are shuttered under North Carolina’s stay-at-home order and local politicians have recognized the urgency in their financial plights. Five North Carolina Republican senators asked Gov. Roy Cooper to allow NASCAR to hold the Coca-Cola 600 at Charlotte Motor Speedway on May 24 without fans.\n“Allowing NASCAR to return Memorial Day weekend without fans would not only benefit an industry that calls our state home, it would mark a new beginning for North Carolina’s tourism, entertainment and service industries that are desperate to open for business,” House Speaker Tim Moore said Monday.\nEven if Moore doesn’t permit the Memorial Day spectacular, NASCAR and its leaders will almost surely find hosts to help it keep its vow to complete its remaining 32 races especially as states begin to relax restrictions.\nIn fact, the race to be the first track back on the schedule is already on.\nFlorida and Texas have already said NASCAR is welcome. The series could eventually get to Darlington Raceway in South Carolina, Bristol Motor Speedway in Tennessee or Atlanta Motor Speedway.\n“Texas Motor Speedway will work aggressively with the sanctioning bodies and TV networks to give American society, as well as people around the world, a positive distraction during this crisis,” said Eddie Gossage, president of Texas Motor Speedway.\nThe teams, meanwhile, just wait.\nThe drivers gamely try to represent sponsors in a weekly virtual iRacing league and it was a record-setting esports smash until Kyle Larson was fired for using a racial slur during a non-NASCAR event. Toss in politics with Fox and NASCAR over rules to make a better television show that came at the expense of lesser-known drivers and people have started to sour.\nVirtual racing still works for IndyCar and other series — those teams operate on much smaller budgets — but NASCAR has to be the leader in getting the cars running again. The series simply can’t afford not to make a bold move and throw the green flag to restart its season.", "url": "https://apnews.com/ee0efc6af53d341e4aa1f8668254b889"}