{"authors": ["Opinion Haig Aintablian"], "date_download": "2020-05-04 16:16:10", "date_modify": "2020-05-04 16:16:10", "date_publish": "2020-04-03 16:50:53", "description": "\"His belly bows in and out as he tries to fill his lungs while feeling like he's drowning,\" writes UCLA emergency room doctor Haig Aintablian of a man rushed to his hospital. \"His body is losing this fight. We're seeing more patients like him every day,\" as Los Angeles braces for the coronavirus onslaught.", "filename": "2020_04_03_opinions_doctor-_d0c6d50ce0e8d1f5def8986c238b83da_index_1588608970.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402223811-06-coronavirus-0402-new-york-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_opinions_doctor-_d0c6d50ce0e8d1f5def8986c238b83da_index_1588608970.html", "title": "Doctor: I see patients fighting for life", "title_page": "Doctor: I see patients fighting for life (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Haig Aintablian is an emergency medicine resident physician in the University of California Los Angeles Emergency Medicine program and the President of the American Academy of Emergency Medicine (AAEM) Resident and Student Association (RSA). The views expressed in this commentary are his. View more opinion articles on CNN.\nThe hospital PA system alerts us to the patient the Los Angeles County Fire Department just brought in. The firefighter's familiar faces are hidden by scarce N95 masks, many showing signs of reuse. The Emergency Room staff brings us the \"donning-doffing\" cart so we can quickly put on our precious personal protective equipment to examine this new case, possibly a Covid-19 patient.\n\"Hi, I'm Dr. Haig,\" I say to the fire captain. \"What's the story?\"\nHe gives me the description: a 59-year-old male, prior smoker, with a history of chronic obstructive pulmonary disease. He's been sick for three days, first with a dry cough and fever, but now with respiratory distress. I already know where this is heading. Since the first few cases began in California a few weeks ago, our physicians have been seeing and studying this disease, preparing for this pandemic.\nThis man, this husband and father, is breathing with what seems like every muscle in his body. His belly bows in and out as he tries to fill his lungs while feeling like he's drowning. He's starting to tire out. His body is losing this fight.\nJUST WATCHED Doctors answer your coronavirus questions Replay More Videos ... MUST WATCH Doctors answer your coronavirus questions 03:37\nWe're seeing more patients like him every day, more than the typical strokes or cardiac arrests that we're so used to in the ER.\nI have been an emergency room resident physician with UCLA for the last two years -- training under some of the most experienced and influential physicians in the world. I feel discomfort thinking of the challenges that our emergency medicine family is going to face in a week or two.\nEver since I started here, we have always been well-staffed and well-prepared. Our residency program's slogan is \"Ready for Anything,\" and this has never come into question.\nNow I am not so sure. A few of our docs have already gotten Covid-19 and have had to step to the sidelines of quarantine.\nWe are expecting a large wave of Covid-19 patients to hit our Los Angeles ER soon. I don't know if we'll be able to handle it. I don't know if we'll have enough ICU beds. I don't know how many more of our own doctors or nurses will get sick.\nOur hospital is doing all it can to prepare -- making contingency plan after contingency plan, finding clever ways to expand our inpatient and ICU capacity, layering our staffing so that if one or many of us go down, we have others to take our place. But I can't help looking at our sister hospitals in New York, drowning under the demands of coronavirus, and wonder.\nThe ED tech attaches this man to the monitor and it tells me what my eyes already knew: his blood oxygen level is low, 81%. Normal is 95% or higher. He is tachycardic, his heart is racing and he's breathing 34 times a minute. A chest X-ray shows what we suspected: ground-glass opacities at the base of both lungs -- hazy whitenings that show inflammation, fluid filling, or collapse of the small airspaces of the lung--suggesting Covid-19.\n\"We're going to need the intubation tray.\" Our nurses are right alongside me, bringing all the necessary supplies to the bedside. Our ED pharmacist is drawing the necessary medication and our respiratory therapist is setting up the myriad hoses and tubes for the ventilator as we get ready to try to save his life.\nIt's become an efficient team effort, with all hands on deck. Each team member knows their role, and we all rely on one another to save our patients and to protect ourselves from the dangerous virus they carry.\nIt isn't more than 10 minutes from the time he rolled in, to the time he has a tube in his trachea and a ventilator pumping high concentrations of oxygen into his failing lungs. His family, arriving a few minutes behind the ambulance, is stunned to see their loved one unconscious and attached to a breathing machine.\nFollow CNN Opinion Join us on Twitter and Facebook\nI tell them what happened. I tell them what we're doing and why. I try to be realistic about his possible outcomes, good or bad. I see tears and I hear crying -- emotions you cannot quarantine.\nI want to cry for them too, but I've got more work to do. \"I'm blessed to do what I do,\" I whisper to myself.\n\"Rescue 72 with an ALS run, now en route to Room 20\" the PA system announces.\nI grab my stethoscope and rush over. Our heroic ER staff does the same.", "url": "https://www.cnn.com/2020/04/03/opinions/doctor-i-see-patients-fighting-for-life-aintablian/index.html"}