{"authors": ["Marina Villeneuve", "Karen Matthews", "Michael Hill"], "date_download": "2020-05-04 20:18:05", "date_modify": "2020-05-04 20:18:05", "date_publish": "2020-04-08 13:05:12", "description": "NEW YORK (AP) — New data shows New York City’s death toll from COVID-19 has been disproportionately high in black and Hispanic communities. And deaths continue to rise statewide at a record pace,...", "filename": "_dc2ad6a6a0ccf9a6733067ca404d4254_1588623485.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9c33a2feebe34c6eb18f63a4e3a2157c/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dc2ad6a6a0ccf9a6733067ca404d4254_1588623485.html", "title": "Mayor says virus has hit black, Hispanic New Yorkers hard", "title_page": "Mayor says virus has hit black, Hispanic New Yorkers hard", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A woman leaves Elmhurst Hospital Center after being tested for COVID-19 or coronavirus during the current viral pandemic, Tuesday, April 7, 2020, in the Queens borough of New York. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Kathy Willens)\nA woman leaves Elmhurst Hospital Center after being tested for COVID-19 or coronavirus during the current viral pandemic, Tuesday, April 7, 2020, in the Queens borough of New York. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Kathy Willens)\nNEW YORK (AP) — New data shows New York City’s death toll from COVID-19 has been disproportionately high in black and Hispanic communities. And deaths continue to rise statewide at a record pace, even as stay-at-home restrictions show signs of working.\nHere are the latest coronavirus developments in New York:\nOUTBREAK DISPARITIES\nNew York City’s death toll from the coronavirus has been disproportionately high in black and Hispanic communities, and the city is starting an outreach campaign for those residents, Mayor Bill de Blasio said Wednesday.\n“We’re seeing folks who have struggled before really being hit particularly hard,” de Blasio said at a City Hall briefing.\nPreliminary data indicates that black people account for 28% of the city’s COVID-19 death toll, even though they are just 22% of the city’s population. Hispanic people account for 34% of the city’s virus death toll and 29% of its population.\nDe Blasio said of the racial disparities : “It’s sick. It’s troubling. It’s wrong. And we are going to fight back with everything we’ve got.”\nDr. Oxiris Barbot, the city’s health commissioner, noted that the communities that have been hit the hardest by the virus “have had higher rates of underlying chronic illness” than other New Yorkers.\nState health officials reported Wednesday that nearly 4,600 people have been killed by the virus in New York City. The city’s new round of data is based on a smaller number of cases, about 1,600, where the race and ethnicity of the victim is known.\nDe Blasio said the city would embark on a multimillion-dollar public service campaign to reach non-English speaking communities with information about the virus. The state also announced an awareness campaign to include hard-to-reach communities.\nGov. Andrew Cuomo, speaking separately later in the day, said he was troubled by the disparities and will order more testing in minority communities.\n“Why is it the poorest people always pay the highest price?” Cuomo asked. “But let’s figure it out. Let’s do the work. Let’s do the research. Let’s learn from this moment.”\nWhen the city fatality figures are adjusted to reflect the age makeup of ethnic groups within the city’s population, the disparities are more stark. The age-adjusted death rate for both blacks and Hispanics was more than double the rate for non-Hispanic whites.\nAsians, meanwhile, experienced a much lower rate of fatalities: 8.4 per 100,000 residents, compared with 10.2 for non-Hispanic whites, 19.8 for non-Hispanic blacks and 22.8 for Hispanics.\nAlthough the figures released Wednesday show racial disparities in who has died of the virus, the disparities are not as great as those that have been reported elsewhere in the country.\n___\nDEATHS AND HOSPITALIZATIONS\nNew York coronavirus deaths rose by 779, a record number for a second consecutive day, and Cuomo warned the toll will climb even as hospitalizations from the outbreak finally moderate.\nNew York state recorded 6,268 deaths by Tuesday.\nThe grim news was accompanied by more evidence that New York is arresting the outbreak’s month-long rise. The hospitalization rate is decreasing, Cuomo said, meaning the overburdened system could stabilize over the coming weeks if trends continue. While new hospitalizations were up by more than 500 on Tuesday, that compares to more than 1,000 daily for most of last week.\nThe governor said New York is at last “flattening the curve” of the outbreak. Still, the number of deaths will continue to rise as patients hospitalized for a longer period of time die.\n“I understand the science of it. I Understand the facts and the logic of it. But it is still incredibly difficult to deal with,” Cuomo said at a state Capitol news briefing. “Every number is a face, and that’s been painfully obvious to me every day.”\nCuomo raised alarms when he announced Friday he’d issue an executive order saying the state could take excess equipment from hospitals and shift them elsewhere because of a dire need for ventilators in New York City and its suburbs. But officials say fewer ventilators are needed now than projected. And some hospitals around New York say they are voluntarily agreeing to work with the state to shift hundreds of ventilators.\n___\nFORMER LAWMAKER DIES\nFormer state Assemblyman Richard Brodsky, 73, died Wednesday of suspected complications from the coronavirus. The Democrat represented parts of Westchester County from 1983 to 2010.\nHe was known for his work of environmental legislation and overseeing public authorities, as well as his sharp wit and extroverted personality.\nHis death was announced by the Assembly. His wife, Paige, told The New York Post that her husband likely died of a heart attack that she believed was triggered by COVID-19. She said Brodsky started feeling ill a week ago, had a fever and was awaiting the results of a COVID-19 test.\n__\nABSENTEE BALLOTS\nAll New Yorkers will have the option of voting by absentee ballot in June 23 primaries under an executive order Cuomo announced Wednesday. Cuomo said the order will add the risk of attracting COVID-19 as a reason to vote absentee.\n__\nNUMBER DISCREPANCY\nDe Blasio acknowledged that the city’s official coronavirus statistics have missed hundreds of people who died at home without ever being tested for the virus, and said the city would start including such victims in its COVID-19 tally.\n“The blunt truth is coronavirus is driving these very tragic deaths,” de Blasio said on CNN’s “New Day.” He added, “We’re not talking about, you know, 10 people, 20 people. We’re talking about something like 100, 200 people per day.”\nThe city’s Fire Department has recorded as many as 200 deaths at home daily in recent weeks, far more than the average 25 deaths at home before the pandemic.\nFUll Coverage: Virus Outbreak\nDe Blasio said the city would start including in its official tally of deaths people who died at home without a test.\n___\nBROADWAY\nProducers have extended the suspension of all shows on Broadway, saying musicals and plays will stay shuttered through June 7 in accordance with latest medical guidance.\n___\nHill and Villeneuve reported from Albany, N.Y.", "url": "https://apnews.com/dc2ad6a6a0ccf9a6733067ca404d4254"}