{"authors": ["Holly Ramer"], "date_download": "2020-05-04 20:20:35", "date_modify": "2020-05-04 20:20:35", "date_publish": "2020-04-16 12:47:13", "description": "CONCORD, N.H. (AP) — New Hampshire schools will remain closed and continue remote learning for the rest of the academic year, Republican Gov. Chris Sununu announced Thursday. Sununu’s...", "filename": "_d7639fc68ab052385db79b0c1df700a2_1588623635.html", "image_url": "https://storage.googleapis.com/afs-prod/media/6d897ea7b34941f6a8f8678a33af91bd/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d7639fc68ab052385db79b0c1df700a2_1588623635.html", "title": "Schools shut for academic year; new unemployment claims dip", "title_page": "Schools shut for academic year; new unemployment claims dip", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A sign blocks the entrance to a 24-hour fitness club, informing customers that they are closed until May 4th, in Hudson, N.H., Thursday, April 16, 2020. Most health and fitness clubs in New Hampshire have temporarily closed due to the COVID-19 virus outbreak. (AP Photo/Charles Krupa)\nA sign blocks the entrance to a 24-hour fitness club, informing customers that they are closed until May 4th, in Hudson, N.H., Thursday, April 16, 2020. Most health and fitness clubs in New Hampshire have temporarily closed due to the COVID-19 virus outbreak. (AP Photo/Charles Krupa)\nCONCORD, N.H. (AP) — New Hampshire schools will remain closed and continue remote learning for the rest of the academic year, Republican Gov. Chris Sununu announced Thursday.\nSununu’s initial order transitioning education to remote learning was issued March 15. It was originally set to expire April 3, then was extended to May 4. But he said the severity of the coronavirus pandemic warranted extending the closure through the end of the academic year, which is typically the second or third week of June.\n“Public health has to be a preeminent variable in our decision-making and in this case, it absolutely was,” he said. “We’re hoping to get back to a new model, within the classroom, in September, but we’ll have to see where we are.”\nIn a letter to school officials, state Education Commissioner Frank Edelblut thanked educators and said he knows they are up to the challenge.\n“Knowing they won’t be back in the school building, it will be tempting for some students to think that their summer vacation has started,” he said. “It’s important that we keep them engaged in their learning. School is still in session.”\nMore developments in New Hampshire:\nBLOWN BUDGET\nSununu said he expects the state to lose several hundred million dollars in revenue because of the pandemic by the end of the fiscal year that ends June 30, and up to $500 million in the next.\n“None of the CARES Act money is designed right now to come in and replace any of those revenues. There will be massive budget cuts across the state,” he said.\n___\nUNEMPLOYMENT CLAIMS\nNearly 24,000 initial unemployment claims were filed in New Hampshire last week, down more than 15,000 from the previous week, the U.S. Department of Labor reported Thursday.\nThe latest number covers new claims through April 11.\n___\nTHE NUMBERS\nAs of Thursday, 1,211 people in New Hampshire have tested positive for the virus, and 34 have died.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and the infirm, it can cause more severe illness, including pneumonia, or death.\n___\nFACILITY OUTBREAKS\nResidents of long-term care facilities make up nearly half of the state’s deaths caused by the virus. Health and Human Services Commissioner Lori Shibinette announced three additional outbreaks Thursday.\nAt the Institute for Professional Practice in Concord, one client died, and a second client tested positive for the virus. Six staffers at the facility, which serves individuals with autism, also tested positive, Shibinette said.\nThe other outbreaks were at assisted living facilities in Salem and Dover. Twenty-one residents and four staffers have tested positive at the Residence at Salem Woods, and five residents and five staffers at Bellamy Fields have tested positive.\n___\nSTAKEHOLDERS SPEAK UP\nThe impact of the coronavirus in housing, transportation, agriculture and more will be explored by a new subcommittee of the Governor’s Office for Emergency Relief and Recovery.\nA stakeholder advisory board met by phone Thursday to begin discussing recommendations on relief efforts across New Hampshire’s communities and private industries. The group’s initial members include those representing farms, hospitals, community action programs, ski areas and other industries.\nJim Jalbert, of C&J Trailways, said the group should look into funding to increase testing for the virus and other efforts that might ease public concerns once the stay-at-home order is lifted and businesses start to reopen.\n“If we don’t figure out how to test people and how to give the citizens of New Hampshire some measure of reassurance that it’s OK to go back out into the marketplace, we will be throwing money at this forever,” he said.\nMeanwhile, a hearing is scheduled Monday in a lawsuit filed by Democratic lawmakers who insist the Legislature’s fiscal committee must approve how the state spends $1.25 billion in federal aid.", "url": "https://apnews.com/d7639fc68ab052385db79b0c1df700a2"}