{"authors": ["Trends Reporter"], "date_download": "2020-05-04 21:09:53", "date_modify": "2020-05-04 21:09:53", "date_publish": "2020-05-01 04:02:38", "description": "Voice of America's White House bureau chief Steve Herman might be allowed on Air Force Two again if he or VOA apologizes.", "filename": "entry_mike-pence-steve-herman-voa-face-mask_n_5eab9795c5b62da419ef0a2d_1588626593.html", "image_url": "https://img.huffingtonpost.com/asset/5eaba8eb240000c2028ea0f5.jpeg?cache=ygp7zlr7jg&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_mike-pence-steve-herman-voa-face-mask_n_5eab9795c5b62da419ef0a2d_1588626593.html", "title": "Reporter Who Tweeted About Face-Mask Fiasco Says He Was Banned From Future Pence Trips", "title_page": "Reporter Who Tweeted About Face-Mask Fiasco Says He Was Banned From Future Pence Trips | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "A Voice of America journalist who contradicted second lady Karen Pence regarding the vice president’s dismissal of face-mask protocol at the Mayo Clinic was banned Thursday from taking further trips with Mike Pence, The Washington Post reported.\nA representative from Pence’s office later told Voice of America managers that the punishment might be lifted if the media organization or White House bureau chief Steve Herman apologizes, the newspaper reported.\nKaren Pence insisted in a Fox News interview Thursday that her husband had no idea he was supposed to wear a mask during his visit earlier this week to the Mayo Clinic in Minnesota. However, the hospital posted a tweet that was later deleted which said the vice president had been informed about the requirement.\nEveryone else on the tour work face masks.\nAfter the second lady’s interview, Herman tweeted that Pence’s office had informed journalists the day before the trip that masks were required for anyone accompanying him to the clinic:\nAll of us who traveled with him were notified by the office of @VP the day before the trip that wearing of masks was required by the @MayoClinic and to prepare accordingly. https://t.co/LFqh27LusD — Steve Herman (@W7VOA) April 30, 2020\nA copy of the directive from Pence’s office on the trip that was obtained by the Post clearly states that masks were required.\n“Please note, the Mayo Clinic is requiring [that] all individuals traveling with the VP wear masks,” the document read, per the Post. “Please bring one to wear while on the trip.”\nThe document was marked “off the record” and for “planning purposes only,” which is standard for such trips.\nAfter his tweet, the White House Correspondents’ Association told Herman that Pence’s office had banned him from all future travel on Air Force Two.\nWall Street Journal reporter Gordon Lubold tweeted the same information two days before Herman and emphasized that everyone was wearing a mask during the Mayo Clinic visit. He tweeted the information again after Karen Pence’s interview:\nHere at the Clinic with Pence and mayo made it clear **everyone should have a mask and VP is the only one not wearing one https://t.co/GCxahM8UVa — Gordon Lubold (@glubold) April 28, 2020\nalso, everyone in the entire Mayo Clinic had a mask on, everyone, and we were all told the day before we had to wear a mask if we entered the clinic https://t.co/cNW4fJ87Q4 — Gordon Lubold (@glubold) April 30, 2020\nAccording to the Post, VOA managers were still discussing the matter with Pence’s office late Thursday.\nThe vice president’s decision to ignore face mask protocol amid the coronavirus pandemic ignited a storm of controversy. Pence, who is head of the federal coronavirus task force, said he didn’t need to wear one.\n“As vice president of the United States, I’m tested for the coronavirus on a regular basis, and everyone who is around me is tested for the coronavirus,” Pence told pool reporters. He also said he wanted to look people “in the eye,” even though the masks don’t cover the eyes.\nThe Centers for Disease Control and Prevention recommends wearing face masks in public where social distancing can be difficult to maintain.\nPence did wear a face mask — and protective glasses — during a tour of a General Motors plant on Thursday.\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/mike-pence-steve-herman-voa-face-mask_n_5eab9795c5b62da419ef0a2d"}