{"authors": ["Erica Henry", "Paul Leblanc"], "date_download": "2020-05-04 17:00:23", "date_modify": "2020-05-04 17:00:23", "date_publish": "2020-04-10 01:22:17", "description": "Florida Gov. Ron DeSantis falsely claimed Thursday that the novel coronavirus hasn't killed anyone under 25 nationwide while discussing a timeline for reopening schools in the state.", "filename": "2020_04_09_politics_florida_3ca0bca25b7a48947ed2835a3fa21dbe_index_1588611623.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/181031153309-02-ron-desantis-file-103118-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_florida_3ca0bca25b7a48947ed2835a3fa21dbe_index_1588611623.html", "title": "Florida governor falsely claims the coronavirus hasn't killed anyone under 25", "title_page": "Florida governor falsely claims the coronavirus hasn't killed anyone under 25 - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Florida Gov. Ron DeSantis falsely claimed Thursday that the novel coronavirus hasn't killed anyone under 25 nationwide while discussing a timeline for reopening schools in the state.\n\"This particular pandemic is one where, I don't think nationwide there's been a single fatality under 25. For whatever reason it just doesn't seem to threaten, you know, kids,\" DeSantis said at an educators' meeting to discuss distance learning.\n\"And we lose in Florida between five and 10 kids a year for the flu. This one, for whatever reason, much more dangerous if you're 65 and plus than the flu, no doubt about that, if you're younger it just hasn't had an impact. So that should factor into how we're viewing this.\"\n\"I think the data on that has been 100% consistent,\" he continued. \"I've not seen any deviation on that.\"\nIn reality, the CDC reports on its website that four people between the ages of 15 and 24 and one person between the ages of one and four have died. CNN has also reported on the death of a newborn in Connecticut on April 1 and an infant in Illinois last month whose death is being investigated as possibly caused by the virus.\nRead More", "url": "https://www.cnn.com/2020/04/09/politics/florida-ron-desantis-false-claim-coronavirus/index.html"}