{"authors": ["Tami Luhby"], "date_download": "2020-05-04 17:02:00", "date_modify": "2020-05-04 17:02:00", "date_publish": "2020-04-10 15:16:29", "description": "Many unemployed Americans are starting to see a bump in jobless benefits, but it will likely be a few more weeks before independent contractors and gig workers start receiving checks -- and some may end up not qualifying at all.", "filename": "2020_04_10_politics_indepen_2963231a10de54f417efc131a4236b4a_index_1588611720.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409171251-02-unemployment-application-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_indepen_2963231a10de54f417efc131a4236b4a_index_1588611720.html", "title": "Self-employed workers stuck waiting for help", "title_page": "Self-employed workers stuck waiting for help - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Many unemployed Americans are starting to see a bump in jobless benefits , but it will likely be a few more weeks before independent contractors and gig workers start receiving checks -- and some may end up not qualifying at all.\nCongress recently opened up unemployment benefits to certain people who can't work because of the coronavirus pandemic or who don't typically qualify, including independent contractors and the self-employed. Also, gig economy workers who aren't eligible for traditional state benefits could access this aid.\nBut most states have yet to finish reprogramming their antiquated technology systems to accept these residents' applications.\nAnd once they are able to file, some may find they aren't eligible for assistance. The federal Department of Labor released guidance this past weekend that some experts say could exclude some non-traditional workers or limit the benefits they receive.\nSeeking to help the millions of Americans losing their jobs amid the coronavirus pandemic, lawmakers approved a historic expansion to the unemployment benefits program . The package, which was signed into law on March 27, boosted weekly checks by $600, added 13 weeks of benefits and created a new pandemic unemployment assistance program to cover certain people affected by the outbreak.\nWhile some state agencies have started to roll out the additional $600 payments , many say that adding new categories of workers to the pandemic program is a much heavier lift. Though the new benefit is based on the disaster unemployment assistance program, it requires states to create new applications, accept different proof of earnings and set up back-end systems.\nNo estimate for independent contractors and self-employed workers\nMany states CNN contacted this week said they had no estimate for when independent contractors and the self-employed would start being approved. California, for instance, says that it will take time to build and staff \"this complex new program\" that \"likely rival\" the size of its current unemployment benefits system. The state Employment Development Department says it will update its website as information becomes available.\nSome states, however, are starting to provide projections.\nMississippi hopes to finish reprogramming its systems and begin accepting applications next week, Timothy Rush, director of the state's unemployment agency, said in a webinar Wednesday. It will then send these residents a notice asking them to go back online and submit financial documentation of their wages, such as 1099 tax forms or earning statements for 2019.\nThe agency is still waiting for more details from the federal Department of Labor before it can send the notifications, he said.\nUtah's Unemployment Insurance Division believes it can post the applications on its site early next week, Kevin Burt, the agency's director, said Thursday. However, it may take 21 to 30 days for the jobless to be approved and receive payment, the same time it takes for the traditional program.\nMeanwhile, North Carolina's Division of Employment Security said Thursday that it estimates it can start accepting claims around April 25. And Massachusetts expects to launch the program on or around April 30 and is asking potentially eligible residents to check the unemployment agency's site for updates.\nThe delay is not sitting well with many self-employed workers, who are eager to sign up for benefits but find they are unable to apply or are getting denied.\nKashirah Jackson, a hair stylist and independent contractor, needs that money to buy diapers and baby wipes. The Charlotte, North Carolina, resident is seven months pregnant with her first child but hasn't been able to work since Gov. Roy Cooper ordered people to stay at home in late March. Her partner owns a small restaurant that also had to close after it couldn't make enough money selling take-out food.\n\"When I found out that the stimulus included independent contractors being able to file for unemployment, I saw a glimmer of hope,\" said Jackson, 33, whose hope was \"shattered\" when she was initially denied.\nKashirah Jackson, a hair stylist, hopes North Carolina will process her unemployment claim by the end of the month.\nShe's submitted another application and is waiting for it to be processed at the end of the month. Meanwhile, she still has to pay the rent on her home, as well as for her stylist chair at the salon.\n\"I thought it would be quicker than this,\" said Jackson. \"You can't raise a baby on nothing.\"\nWhile people have to wait to be approved, they won't be shortchanged. The pandemic benefits are retroactive to as early as January 27, depending on when applicants lost their jobs or stopped being able to go to work.\nSome may not qualify\nWhile the stimulus package extended benefits to a wider group of workers, some advocates fear that the Department of Labor's recent guidance may mean some of the newly jobless won't qualify in states that opt to implement it conservatively.\nFor instance, the document says that independent contractors such as ride-sharing service drivers may not be eligible because they don't have a \"place of employment\" and can't say they can't work because it closed. They may still qualify if they've been forced to stop working because a state or municipal order restricting movement makes continued operation \"unsustainable.\"\nHowever, not all governors have ordered drivers off the roads, said Andrew Stettner, senior fellow at The Century Foundation. And food delivery workers who don't want to continue ferrying orders because they fear getting infected may not qualify.\n\"The beauty of freelancing is that you can hustle and get work on your own,\" he said. \"But right now, people can't. Either they can't find customers or it would be dangerous for everybody if they were out hustling.\"\nSome experts take the opposite view, arguing the guidance is in line with the law. Both focus on the health-related consequences of the coronavirus and not the \"secondary effects of that playing out through the economy,\" said Matt Weidinger, a fellow at the American Enterprise Institute.\n\"If you are an Uber driver and your business has dried up, the regs pretty much say you are not eligible,\" he said.\nThe Department of Labor did not immediately respond to a request for comment.\nAnother troubling aspect of the guidance for advocates: Some Americans who had to stop working because of the coronavirus may find their benefits are cut off after only a few weeks or months.\nThe guidance notes that many of qualifying circumstances -- such as those being advised to self-quarantine -- \"are likely to be of short-term duration.\" Likewise, a school is not considered closed as a direct result of a public health emergency after the school year was originally scheduled to end.\nThese provisions place additional burdens on state agencies to determine whether these claimants continue to be eligible for benefits, said an aide to Sen. Mark Warner, Democrat of Virginia.\n\"An overly narrow interpretation is hurtful and not in the spirit of what the law was intended to do,\" the aide said.", "url": "https://www.cnn.com/2020/04/10/politics/independent-contractors-unemployment-benefits-wait/index.html"}