{"authors": ["Rob Gillies"], "date_download": "2020-05-04 20:23:35", "date_modify": "2020-05-04 20:23:35", "date_publish": "2020-04-20 12:10:45", "description": "TORONTO (AP) — Police fanned out across more than a dozen crime scenes Monday after a rampage by a gunman disguised as a police officer left at least 18 dead and homes in smoldering ruins in rural...", "filename": "_52e7e00fdf738a653a57801e4d5b2a23_1588623815.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c0af9270627a474d944e3be238a07889/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_52e7e00fdf738a653a57801e4d5b2a23_1588623815.html", "title": "Rampage leaves 18 dead in Canada's worst mass shooting", "title_page": "Rampage leaves 18 dead in Canada's worst mass shooting", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A tribute is displayed Monday, April 20, 2020, at the Royal Canadian Mounted Police headquarters in Dartmouth, Nova Scotia, following a weekend shooting rampage by a gunman, disguised as a police officer, that killed multiple people including an RCMP constable. (Andrew Vaughan/The Canadian Press via AP)\nA tribute is displayed Monday, April 20, 2020, at the Royal Canadian Mounted Police headquarters in Dartmouth, Nova Scotia, following a weekend shooting rampage by a gunman, disguised as a police officer, that killed multiple people including an RCMP constable. (Andrew Vaughan/The Canadian Press via AP)\nTORONTO (AP) — Police fanned out across more than a dozen crime scenes Monday after a rampage by a gunman disguised as a police officer left at least 18 dead and homes in smoldering ruins in rural communities across Nova Scotia — the deadliest mass shooting in Canada’s history.\nOfficials said the suspect, identified as 51-year-old Gabriel Wortman, also died in the weekend attack. Authorities did not provide a motive for the killings.\nRoyal Canadian Mounted Police Chief Superintendent Chris Leather told a news conference Monday that police expect to find more victims once they are able to comb through all the crime scenes, some of which were houses set ablaze as victims were inside, adhering to government calls to stay at home because of the coronavirus pandemic.\nLeather said police teams were spread out at 16 locations across central and northern Nova Scotia. He said some of the victims knew Wortman, and some didn’t.\n“We’re relatively confident we’ve identified all the crime scenes,” Leather said. “We have had five structure fires, most of those being residences, and we believe there may be victims still within the remains of those homes which burnt to the ground.”\nThe dead included a police officer. Another was wounded by gunfire and was recovering at home, Leather said.\n“The 18 innocent lives lost will be remembered throughout Canada’s history,” Public Safety Minister Bill Blair said .\nCanadian Prime Minister Justin Trudeau noted how close-knit the small province of Nova Scotia is.\n“The vast majority of Nova Scotians will have a direct link with one or more of the victims. The entire province and country is grieving right now as we come to grips with something that is unimaginable,” Trudeau told a news conference.\n“The pandemic will prevent us from mourning together in person, but a vigil will be held virtually to celebrate the lives of the victims,” Trudeau added, saying it would take place Friday night through a Facebook group.\nTrudeau asked the media to avoid mentioning the name of the assailant or showing his picture.\n“Do not give this person the gift of infamy,” he said.\nThe 12-hour rampage began late Saturday in the rural town of Portapique, about 60 miles (100 kilometers) north of Halifax, where police warned residents to lock their doors and stay in their basements as the attack unfolded. The town, like all of Canada, had been adhering to government advice to remain at home because of the pandemic and most of the victims were inside when the attack began.\nSeveral bodies were later found inside and outside one house on Portapique Beach Road, the street where the suspect lived, authorities said.\nBodies were also found at other locations within about a 30-mile (50-kilometer) area from the neighborhood where the shootings began, and authorities believe the shooter may have targeted his first victims but then began attacking randomly.\nAuthorities said the gunman wore a police uniform and made his car look like a Royal Canadian Mounted Police cruiser.\n“His ability to move around the province undetected was surely greatly benefited by the fact that he had a vehicle that looked identical in every way to a marked police car,” Leather said, adding that the gunman was also either wearing a police uniform or very good copy.\nHe said at one point the suspect was forced to abandon his car and then carjacked other vehicles to continue to “circulate around the province steps ahead of our investigators.”\nAuthorities believe he acted alone. RCMP Commissioner Brenda Lucki said he was not well known to police and no note from the suspect has been found. She said police were still studying the crime scenes to determine what weapons were used.\nAccording to his high school yearbook, Wortman long had a fascination with the Mounties. “Gabe’s future may include being an RCMP officer,” his yearbook profile said.\nThe dead officer was identified as Constable Heidi Stevenson, a mother of two and a 23-year veteran of the force.\nTwo health care workers at local nursing homes were also among those killed, according to Von Canada, a long term health care company, which identified them as Kristen Beaton, a continuing care assistant, and Heather O’Brien, a licensed practical nurse.\nO’Brien’s daughter, Darcy Dobson, wrote in a Facebook post that, “A Monster murdered my Mother.”\n“Murdered her, without a second thought. The pain comes and goes in waves. I feel like I’m outside of my own body. This can’t be real. At 9:59 am she sent her last text message to our family group chat. By 10:15 she was gone.”\nSchool teacher Lisa McCully, who worked at a local elementary school, also was among the dead. “Our hearts are broken along with those of her colleagues and students at Debert Elementary,” Nova Scotia Teachers Union President President Paul Wozney said.\nPolice initially said Wortman had been arrested Sunday at a gas station in Enfield, outside Halifax, but later said he had died. It was not clear how, and they did not provide further details, although one police official said that there was an exchange of gunfire between the suspect and police at one point.\nWortman, who owned a denture practice in the city of Dartmouth, near Halifax, lived part time in Portapique, according to residents.\nAtlantic Denture Clinic, the practice Wortman owned, had been closed for the past month because of the coronavirus pandemic.\nNeighbor Nancy Hudson said she met Wortman about 18 years ago when he bought the property on Portapique Beach Road, which is a short walk from her home, and she and her husband used to socialize with him.\n“There is another side to Gabe. He had some issues, especially with his girlfriend,” Hudson said, adding that he was obsessed and jealous. “It was a red flag.”\nSpeaking to reporters Monday, Nova Scotia Premier Stephen McNeil said that even in the midst of such anguish now was not the time to gather together to mourn.\n“We cannot forget that in the midst of this tragedy we are still fighting a deadly virus,” McNeil said. “Now more than ever we need your cooperation. It takes inner strength. The best that we can honor the victims of this tragedy is to continue to act in a way that protects our fellow Nova Scotians.”\nMass shootings are relatively rare in Canada. The country overhauled its gun-control laws after gunman Marc Lepine killed 14 women and himself at Montreal’s Ecole Polytechnique college in 1989. Before this weekend’s rampage, that had been the country’s worst mass shooting.\nTrudeau said Monday his government would introduce further gun control legislation prohibiting military-style assault weapons, a measure that had already been planned before the coronavirus pandemic interrupted the current parliamentary session.\n___\nThis story has been updated to correct that this was Canada’s worst mass shooting, not killing.", "url": "https://apnews.com/52e7e00fdf738a653a57801e4d5b2a23"}