{"authors": ["Por Steve Reed"], "date_download": "2020-05-04 20:24:40", "date_modify": "2020-05-04 20:24:40", "date_publish": "2020-04-21 00:49:08", "description": "Con los Panthers en medio de una transformación del plantel, Christian McCaffrey tuvo la posibilidad de abrirse camino fuera de Carolina con la esperanza de encontrar un conjunto mejor preparado...", "filename": "_95c01e740c2ace9cb8ee081d81b10c15_1588623880.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9a8bae36eafb4517920b07676fa6e5ed/2432.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_95c01e740c2ace9cb8ee081d81b10c15_1588623880.html", "title": "McCaffrey se convierte en el nuevo rostro de los Panthers", "title_page": "McCaffrey se convierte en el nuevo rostro de los Panthers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nEn esta imagen del 7 de enero de 2020, el exentrenador en jefe de Baylor y actual head coach de los Panthers de Carolina, habla con la prensa afuera de su casa en Waco, Texas.(Jerry Larson/Waco Tribune-Herald via AP, Archivo)\nEn esta imagen del 7 de enero de 2020, el exentrenador en jefe de Baylor y actual head coach de los Panthers de Carolina, habla con la prensa afuera de su casa en Waco, Texas.(Jerry Larson/Waco Tribune-Herald via AP, Archivo)\nCon los Panthers en medio de una transformación del plantel, Christian McCaffrey tuvo la posibilidad de abrirse camino fuera de Carolina con la esperanza de encontrar un conjunto mejor preparado para pelear por el campeonato.\nPero el estelar running back aseguró que esa idea jamás le cruzó por la mente.\nEn su lugar, el jugador de All-Pro firmó la semana pasada una extensión de contrato por cuatro años y 64 millones de dólares que lo convirtió en el running back mejor pagado en la historia de la NFL y en el rostro de la franquicia ahora que el quarterback Cam Newton y el linebacker Luke Kuechly ya no están.\n“Nunca me enfoqué en firmar en otro lado, nunca se me ocurrió”, dijo McCaffrey en una videoconferencia el lunes. “Quiero estar en Carolina toda mi carrera, compré una casa en Charlotte. Amo las Carolinas más que cualquier otra cosa del mundo. Me gustaría llamarla mi casa por siempre”.\nMcCaffrey, quien cumple 24 años en junio, jugará para un nuevo coach en Matt Rhule, recibirá pases de un nuevo quarterback en Teddy Bridgewater y correrá detrás de una renovada línea ofensiva en 2020, en caso de que la temporada se realice conforme a lo programado debido a la pandemia del coronavirus.\nLos cambios no parecen molestarle.\n“En la NFL hay cambios todo el tiempo”, dijo McCaffrey. “Ves la liga y te das cuenta de lo que sucede. Ves a algunos de los mejores jugadores de todos los tiempos y a los equipos a los que han ido. Puedes seguir siendo buenos amigos con las personas y formar grandes relaciones, pero es difícil arraigarse, porque esto es una puerta giratoria. Así es el negocio”.\nSe ganó su extensión de contrato después de convertirse en apenas el tercer jugador en la historia de la NFL en sumar 1.000 yardas por aire y por tierra en la misma temporada.\nMcCaffrey es el primer jugador en la historia de la NFL en superar las 2.500 yardas en ambas categorías en sus primeras tres campañas. El elusivo corredor tiene 29 touchdowns en su carrera.\nLos Panthers confían en que McCaffrey se vuelva “parte central de la ofensiva”, dijo Rhule.\n“Escuchar eso del coach significa mucho”, dijo McCaffrey. “Significa que tiene fe en mí y que la gerencia tiene fe en mí, y realmente lo aprecio”.\nEl dinero también ayuda.\n“Muestra que estoy en un equipo en el que los dueños y la gerencia creen en mí de la misma manera en que yo creo en mí”, declaró.", "url": "https://apnews.com/95c01e740c2ace9cb8ee081d81b10c15"}