{"authors": ["Anneken Tappe", "Annalyn Kurtz", "Cnn Business"], "date_download": "2020-05-04 16:57:37", "date_modify": "2020-05-04 16:57:37", "date_publish": "2020-04-09 12:33:59", "description": "Another 6.6 million people filed for unemployment benefits last week, according to the US Department of Labor, as American workers continued to suffer from devastating job losses, furloughs and reduced hours during the coronavirus pandemic.", "filename": "2020_04_09_economy_unemployment-benefits-coronavirus_index_1588611457.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409082513-01-unemployment-applications-florida-0407-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_economy_unemployment-benefits-coronavirus_index_1588611457.html", "title": "Another 6.6 million Americans filed for unemployment benefits last week", "title_page": "Unemployment benefits: Another 6.6 million Americans filed for initial unemployment benefits last week - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Another 6.6 million people filed for unemployment benefits last week, according to the US Department of Labor, as American workers continue to suffer from devastating job losses, furloughs and reduced hours during the coronavirus pandemic.\nIt was the second largest number of initial unemployment claims in history, since the Department of Labor started tracking the data in 1967.\nAltogether, about 16.8 million American workers, making up about 11% of the US labor force, have filed initial claims for jobless benefits in just the prior three weeks alone. About 7.5 million workers filed for their second week of benefits or more last week.\nNumbers at those levels are startling and contrast starkly with any other economic downturn on record, especially because of how quickly they've surged.\nJob losses during the Great Recession for example — as deep as they were — came at a much slower pace. It took two years for 8.6 million Americans to lose their jobs in that crisis. This time around, as businesses across the country close to slow the spread of coronavirus, the unemployment crisis has been far more acute, condensed into just a few weeks.", "url": "https://www.cnn.com/2020/04/09/economy/unemployment-benefits-coronavirus/index.html"}