{"authors": [], "date_download": "2020-05-04 20:28:34", "date_modify": "2020-05-04 20:28:34", "date_publish": "2020-04-05 18:55:28", "description": "INDIANAPOLIS (AP) — The Indiana Historical Society isn't waiting for the corornavirus crisis to make it into the history books to prepare to tell the story. The historical society that's...", "filename": "_495e5661c9c5c1ec3f01318e8663d794_1588624114.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_495e5661c9c5c1ec3f01318e8663d794_1588624114.html", "title": "Historical Society collecting items to tell story of virus", "title_page": "Historical Society collecting items to tell story of virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "INDIANAPOLIS (AP) — The Indiana Historical Society isn’t waiting for the corornavirus crisis to make it into the history books to prepare to tell the story.\nThe historical society that’s been documenting the state’s past since 1830 is for the first time collecting documents at the exact time the historic event is unfolding.\n“As historians we’re looking back 10, 15, and even 20 years because with historical perspective, you get a sense of something that is significant, ” Jody Blankenship, president and CEO of Indiana Historical Society, told WISH-TV. “So this is new for us.”\nThe museum has thus far collected more than 260 items from people all over the state. Once items are collected the historical society’s researchers will start to digitize and understand the submissions.\nItems the museum is looking for include photographs, paintings, drawings, writings and whatever else might help tell the story of how the global pandemic played out in Indiana. And the museum doesn’t want people to think that because they’re not famous, their submissions aren’t important.\n“Oftentimes, people will look at their own history and say it’s not history. Not everything in history has to be because you’re a general or a famous person,” said Blankenship.", "url": "https://apnews.com/495e5661c9c5c1ec3f01318e8663d794"}