{"authors": ["Leyla Santiago", "Priscilla Alvarez", "Kristen Holmes"], "date_download": "2020-05-04 16:07:22", "date_modify": "2020-05-04 16:07:22", "date_publish": "2020-04-02 00:42:25", "description": "Only a portion of the medical supplies being flown in by the Federal Emergency Management Agency from overseas are being allotted to critical hotspots prioritized by the agency and the Department of Health and Human Services.", "filename": "2020_04_01_politics_fema-flights-distribution_index_1588608442.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330095205-06-new-york-medical-supplies-0324-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_fema-flights-distribution_index_1588608442.html", "title": "Only some medical supplies from overseas going directly to coronavirus hotspots", "title_page": "Only some medical supplies from overseas going directly to coronavirus hotspots - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Only a portion of the medical supplies being flown in by the Federal Emergency Management Agency from overseas are being allotted to critical hotspots prioritized by the agency and the Department of Health and Human Services.\nThe rest will resupply the private market, where competition between states and the federal government has been a source of frustration for governors trying to shore up equipment to treat patients with coronavirus, according to multiple officials.\nThe Trump administration has touted the incoming flights, billing them and the equipment they're bringing in as a reprieve to states desperate for supplies. But states are not the sole recipients of the equipment, according to a FEMA spokesperson. Supplies will also be sent to the private market, where states have been in fierce competition with each other to get hold of hard-to-come-by supplies.\n\"These supplies will soon be distributed around the country. We have large cargo planes coming in from various parts of the world,\" President Donald Trump said during Wednesday's briefing, noting it includes gloves, gowns, goggles and masks. \"We're adding more and more.\"\nTrump has suggested that states are overestimating their needs, previously saying, \"Some people frankly think they need them and they don't need,\" referring to ventilators.\nTo fill the supply shortage, FEMA is chartering overseas flights with medical supplies secured by private companies. On the first overseas flight that landed at New York's John F. Kennedy International Airport on Sunday, according to FEMA, the federal agency purchased 60% of the supplies from the private company, and distributed the supplies in New York, New Jersey and Connecticut. The remaining 40% of the supplies on the flight went back to the private market.\nIn the overseas flights that have followed, however, FEMA has given the private companies supplying medical equipment a list of prioritized hot spots, identified by FEMA and HHS, that should receive at least 50% of supplies from the flight. According to one official, each chartered flight will be different in terms of what resources get distributed where, based on contracts negotiated by the government and the companies providing the supplies.\nAs of noon Wednesday, four flights -- all chartered by FEMA -- had arrived with supplies, according to FEMA. The agency has not released a list of the counties that will receive supplies but indicated they include areas in New York, Connecticut, New Jersey, the District of Columbia, Illinois, Texas, Florida, Washington and California.\nFEMA, an agency within the Department of Homeland Security, has been fielding requests for medical supplies and personal protective equipment from states. The agency says it's focusing allocation of resources to \"highly impacted areas,\" but some governors, like Illinois Gov. J.B. Pritzker, say they've faced pushback to those requests. Pritzker told CNN that Vice President Mike Pence shot down the state's estimate of how many ventilators were needed.\n\"Well, unfortunately, we, as I said, we need 4,000 ventilators,\" Pritzker told CNN Tuesday. \"And I spoke with the vice president earlier today. When I said that and repeated that to him, he said, 'Well, our models show that maybe you need 1,400 ventilators.'\"\nMontana Democratic Gov. Steve Bullock told CNN's Alisyn Camerota on \"New Day\" Thursday that getting help from private companies is \"our only hope\" because of the difficulty in getting supplies from the the Strategic National Stockpile and because of the competition between other states and the federal government.\n\"Everything that's brought, 80% of it, is just dumped into the private market. So then governors are competing against one another, at times the federal government, to try to get these supplies,\" Bullock said.\nRequests are being adjudicated against need and priority, according to a senior DHS official, who added algorithms are being developed to help in the decision-making process.\nFEMA told stakeholders earlier this week that it's distributing resources based on \"data-informed\" decisions that will be coordinated between the US government and the private sector, according to an advisory obtained by CNN.\nAs the government enlists companies to ramp up production, the so-called National Resource Prioritization Cell has also been established to \"unify government and private industry prioritization recommendations which will inform federal, state and private sector operations,\" according to the advisory.\nThe agency also provided guidance on questions regarding requests for ventilators, a critical item for treating some coronavirus patients. Among the questions is how many usable ventilators, ICU beds, and convertible ventilators are available within the state or tribe, how many anesthesia machines does a state or tribe have and have they been converted, among others.\nStill, there's been widespread confusion among governors and lawmakers about distribution decisions. Democratic Sen. Elizabeth Warren of Massachusetts requested information on how the federal government plans to get equipment to her state in a letter to FEMA Administrator Pete Gaynor.\nWashington, one of the states hardest hit by coronavirus , has also received little explanation as to why they haven't received certain supplies and equipment.\nOne of the sources of supplies -- the Strategic National Stockpile -- is deploying the last round of shipments in its inventory, depleting the bulk of its protective gear, according to a source familiar.\nAs the National Stockpile runs low, FEMA is assessing the global market for much needed medical supplies and working with private entities to secure and distribute that equipment to health care workers across the country. The chartered flights, according to the administration, will expedite the process for companies seeking to get medical supplies to clients in the US.\nBut where those items will go is still not a guarantee, even for states where the flights are expected to land. A senior Illinois state official told CNN's Jake Tapper on Wednesday that the state was not benefiting from the supplies coming to their state.\nReferring to \"Project Airbridge\" -- the airlift of supplies -- the official said \"all the goods went to other states.\"\n\"We got nothing,\" the official added.", "url": "https://www.cnn.com/2020/04/01/politics/fema-flights-distribution/index.html"}